{"result_id": "091015", "URL": "https://dailysceptic.org/2023/03/08/covid-not-deadly-enough-to-justify-risk-of-fast-track-vaccines-chris-whitty-told-government/", "timestamp": "2023-04-25 14:58:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/03/08/covid-not-deadly-enough-to-justify-risk-of-fast-track-vaccines-chris-whitty-told-government/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Covid 'Not Deadly Enough' to Justify Risk of Fast-Track Vaccines, Chris Whitty Told Government –", "cleaned_text": "COVID-19 was not dangerous enough to justify cutting short vaccine trials as the vaccine had to be “very safe”, Chris Whitty advised the Government in the early weeks of the outbreak, it has emerged.\n\nWriting on WhatsApp on February 29th 2020, the Chief Medical Officer told Government figures: “For a disease with a low (for the sake of argument 1%) mortality a vaccine has to be very safe so the safety studies can’t be shortcut. So important for the long run.”\n\nThe estimate of 1% turned out to be an overestimate, as the infection fatality rate in Europe and the Americas was found to be 0.3-0.4%.\n\nChief Scientist Patrick Vallance agreed with this advice and wrote that existing drugs should be relied on instead: “Agree, existing drugs best things to try for this outbreak. Accelerate vaccine testing where we have good candidates for future, and prepare for manufacturing capacity for longer term.”\n\nIt has not been reported what led to this approach being changed, but the advice was given before a pandemic had been declared or any country except China had imposed a lockdown. Public opinion, and Government responses around the world, shifted considerably after that point.\n\nThe has published an article looking at what the Lockdown Files WhatsApp messages show about how the Government came to impose lockdown on March 23rd as it came under pressure during March to do more.\n\nOn March 2nd Patrick Vallance said he and Whitty estimated that the chance of a reasonable worst case scenario (at one point reportedly estimated by Whitty to involved up to 820,000 U.K. deaths) was one in five:\n\nOn March 5th a poll showed the public were still happy with the Government’s calm approach.\n\nHowever, this was probably the last time that was true. As images from Italy – “where hospitals were overwhelmed by gasping Covid victims and distraught doctors were having to turn away the dying patients” – were beamed into living rooms over the following days the panic buying began as the sense of doom grew.\n\nOn March 8th France banned large gatherings as Italy locked down the entire north of the country, and Government figures began to feel the pressure to do more.\n\nBy March 11th Boris Johnson’s Chief Adviser Dominic Cummings was stressing how difficult it was to continue to hold the liberal line – and not very subtly implying he agreed with the critics.\n\nOn March 12th and 13th Patrick Vallance and other Government figures did one last media round arguing for sticking with a calm, liberal response that would lead to herd immunity, but it was no longer well-received by the media or much of the public. In line with that plan, contact tracing was stopped around March 15th as the country moved from containment (where contact tracing makes sense) to mitigation (where it doesn’t), but behind the scenes this change was opposed and the idea that we should be ramping up testing and contact tracing for indefinite use became a new orthodoxy. Cummings wrote: “We need to explain our testing policy tomorrow – neither I nor PM understand it and we need to explain and ramp up as fast as humanly possible.”\n\nOn the evening of March 16th – the day Neil Ferguson’s Report 9, projecting over 500,000 deaths without severe suppression measures, was published – Boris Johnson told the nation that, without drastic action, the virus would spiral out of control.\n\nThese modellers had a track record of drastically exaggerating threats, but this seemed not to matter. As Carl Heneghan and Tom Jefferson write in an excoriating piece in the this morning: “Faith was placed in experts who, in the past two decades, wrongly predicted 136,000 U.K. deaths from new variant CJD contracted by eating meat infected with BSE (or mad cow disease); 65,000 deaths from swine flu; and 700,000 deaths from bird flu.” As a second lockdown loomed later in the year, Dr. Heneghan and others tried to bring actual data and a sense of perspective to bear, but it quickly became clear that most ministers had no interest in anything that might make earlier decisions look unwise: “Our efforts were to no avail. A fixed ideology had rooted itself in Downing Street and the second lockdown in November 2020 went ahead.”\n\nIt was in those 11 days, from March 6th to 16th, that the country was transformed from a stoic survivor facing with calm courage the approaching tide to a gibbering wreck cowering in homes and refusing to go to work. The slow recovery from those traumatic days of spring three years ago is still ongoing.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Covid 'Not Deadly Enough' to Justify Risk of Fast-Track Vaccines, Chris Whitty Told Government – The Daily Sceptic", "description": "COVID-19 was not dangerous enough to justify cutting short vaccine trials as the vaccine had to be \"very safe\", Chris Whitty advised the Government in the early weeks of the outbreak, it has emerged.", "url": "https://dailysceptic.org/2023/03/08/covid-not-deadly-enough-to-justify-risk-of-fast-track-vaccines-chris-whitty-told-government/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-03-08T12:04:25+00:00", "article:modified_time": "2023-03-08T12:47:33+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2021/06/skynews-coronavirus-chris-whitty_4948418.jpg", "image:width": "1600", "image:height": "900", "image:type": "image/jpeg"}, "tags": ["IFR", "Safety", "COVID-19", "Chris Whitty", "Vaccine", "Lockdown"], "tweets": [], "movies": [], "links": ["https://www.telegraph.co.uk/news/2023/03/07/covid-not-deadly-enough-fast-track-vaccines-chris-whitty-advised/", "https://onlinelibrary.wiley.com/doi/epdf/10.1111/eci.13554", "https://www.telegraph.co.uk/news/2023/03/07/messages-reveal-how-britain-plunged-lockdown/", "https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/covid-19/report-9-impact-of-npis-on-covid-19/", "https://www.telegraph.co.uk/news/2020/03/16/watch-boris-johnsons-historic-coronavirus-announcement/", "http://Faith was placed in experts who, in the past two decades, wrongly predicted 136,000 UK deaths from new variant CJD contracted by eating meat infected with BSE (or mad cow disease); 65,000 deaths from swine flu; and 700,000 deaths from bird flu.", "https://dailysceptic.org/tag/chris-whitty/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/ifr/", "https://dailysceptic.org/tag/lockdown/", "https://dailysceptic.org/tag/safety/", "https://dailysceptic.org/tag/vaccine/"], "authors": ["Will Jones"], "publish_date": "2023-03-08T12:04:25+00:00"}