{"result_id": "091035", "URL": "https://dailysceptic.org/2023/04/14/zika-the-pandemic-that-never-was/", "timestamp": "2023-04-25 14:58:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/14/zika-the-pandemic-that-never-was/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Zika: The Pandemic That Never Was –", "cleaned_text": "Roger Daltry of mod rock band The Who screamed “We won’t get fooled again” in its lengthy and punchy signature song. But it appears we have. Almost everything that those on the sceptical side of the Covid narrative recognise about the hyped-up nature of the recent pandemic will see parallels in Overturning Zika: the pandemic that never was by Randall S. Bock.\n\nBock is a U.S. physician who has long harboured scepticism about something that most of us had completely forgotten: the Zika ‘pandemic’ of 2015 in Brazil. Like COVID-19, this was accompanied by dire predictions of deaths in the millions and, parallel to the ridiculous and extraordinary locking down and social distancing mandates of 2020-2021, Zika was accompanied by ludicrous suggestions that women should not have babies and even abort the ones they were carrying. Some did.\n\nZika is a mosquito-borne virus that is present in South America. According to Wikipedia, it can be associated with the birth defect microcephaly, whereby a child is born with a smaller than normal brain. One source, GAVI (‘The Vaccine Alliance‘) claimed in 2022 that one third of babies exposed pre-birth to Zika developed microcephaly. However, it then proceeded to say there is a “continued need to develop a safe and effective vaccine for preventing Zika virus infections during pregnancy”. It has a vested interest in vaccine production and distribution.\n\nIt is worth pointing out that the author of this book is not a tin-foil hat wearing virus sceptic, ‘anti-vaxxer’ or conspiracy theorist. He does not deny the existence of the Zika virus, or specifically deny its potential to cause microcephaly and does not ascribe the manufacturing of the Zika pandemic to evil forces determined to reduce the population of the world. Instead, he examines the evidence as it stands, contextualises this within the scientific paradigm and examines some of the social and media forces at work which fan the flames. Thus, a smouldering fire of (misplaced) suspicion that there was an outbreak of Zika-related microcephaly in Brazil soon became a forest fire of panic across the country and elsewhere in the region.\n\nThe simple facts are that a case of microcephaly was attributed to Zika without a shred of evidence that Zika was the cause. Microcephaly occurs in possibly one in every 800-5,000 babies. If you go out armed with only a hammer, everything looks like a nail and other cases of microcephaly were soon identified and misattributed to Zika. In 2019, when Zika was now a distant blip in the rear-view mirror, Bock tried to publish a short review demonstrating that the accompanying pandemic had been a mistake, but major medical journals refused to publish it. This was not because it was inaccurate or that what was contained was not fairly common knowledge among the medical community, but in case it undermined public trust in public health initiatives related to Covid. This is what is now referred to as ‘malinformation’; something that is true but uncomfortable for those controlling the narrative.\n\nThe story, briefly, is that Zika was considered the cause of a cluster of cases of microcephaly. This was done against a background of poor baseline information about the extent of microcephaly and without specific laboratory testing for the presence of Zika. A purported Zika test had never been standardised and Zika and its close relative dengue fever are almost identical genetically and almost impossible to distinguish. Scepticism about the existence of Zika, based on the poor science applied to its characterisation was quashed and likewise scepticism about the link between it and microcephaly.\n\nIn the sceptical free zone that was allowed to exist around the Zika microcephaly story, local, national, regional and international panic ensued. Pregnant women lived in fear that their babies were going to be born brain damaged, the WHO issued travel advice related to the 2016 Brazil Olympics and NPR, never known to let a good pandemic go to waste, reported fears amongst athletes and staff at the games over Zika infection.\n\nHowever, when accurate Zika testing became available in 2016, the purported link between the virus and microcephaly failed to hold. Zika-related microcephaly, now described as ‘rare’, just disappeared. The only reasonable conclusion, in the absence of a vaccine or additional preventive measures, was that it probably did not exist. In the meantime, pregnant women had been smothering themselves in insecticides potentially harmful to their unborn babies and the family planning lobby had got to work with increased calls for ‘net zero’ related to birth rates.\n\nBock traces the main characters involved from the group of physicians who initially raised the alarm, through incompetent national health officials up to the ubiquitous , without whom no pandemic is complete, Anthony Fauci who said all the usual things about vaccines and public health measures. In this case, rather than being a driving force, Fauci jumped on the Zika bandwagon. What had started as a cock-up soon became a conspiracy. Fauci used Zika to “wage war” on pandemics. We now know what he meant.\n\nThe book is written in a very familiar and even colloquial style. It is reasonably easy to read and not too heavy, within the text, on scientific jargon. It does suffer, however, from a somewhat style of presentation and there is a great deal of repetition of what the appropriate scientific procedures should have been. That said, the opening synopsis is very helpful, makes all the main points and stands alone. The accompanying diagrams and figures are far too busy, poorly produced, and not signposted properly. On the whole, some ruthless editing may have helped to produce a more concise text. Nevertheless, this is a book that should be read.\n\nOverturning Zika: the pandemic that never was . Drivestraight Publishing, Istanbul, is available to purchase on Amazon.\n\nDr. Roger Watson is Academic Dean of Nursing at Southwest Medical University, China. He has a PhD in biochemistry.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Zika: The Pandemic That Never Was – The Daily Sceptic", "description": "The 2015 Zika panic, like the 2020 Covid panic, resulted in extreme global over-reaction. Yet when the smoke cleared it turned out there was no microcephaly epidemic. But the world just moved on and forgot.", "url": "https://dailysceptic.org/2023/04/14/zika-the-pandemic-that-never-was/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-14T11:08:29+00:00", "article:modified_time": "2023-04-16T08:29:10+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/04/zika.png", "image:width": "1154", "image:height": "693", "image:type": "image/png"}, "tags": ["Testing", "Propaganda", "Censorship", "COVID-19", "Zika", "Anthony Fauci", "The Science", "Pandemic", "Brazil"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Overturning-Zika-Pandemic-That-Never/dp/1957975016", "https://en.wikipedia.org/wiki/Zika_virus", "https://www.gavi.org/vaccineswork/third-babies-born-zika-infected-mothers-developed-abnormalities", "https://www.cdc.gov/ncbddd/birthdefects/microcephaly.html", "https://www.who.int/news/item/28-05-2016-who-public-health-advice-regarding-the-olympics-and-zika-virus", "https://www.npr.org/sections/goatsandsoda/2017/10/07/556194272/mosquito-borne-diseases-found-in-u-s-athletes-and-staff-at-rio-olympics", "https://www.news-medical.net/news/20210720/New-study-disproves-suspicion-that-dengue-raises-risk-of-zika-related-microcephaly.aspx", "https://www.smithsonianmag.com/innovation/anthony-fauci-waging-war-against-zika-preparing-other-epidemics-to-come-180958768/", "https://en.wikipedia.org/wiki/Samizdat", "https://www.amazon.com/Overturning-Zika-Pandemic-That-Never/dp/1957975016", "https://dailysceptic.org/tag/anthony-fauci/", "https://dailysceptic.org/tag/brazil/", "https://dailysceptic.org/tag/censorship/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/pandemic/", "https://dailysceptic.org/tag/propaganda/", "https://dailysceptic.org/tag/testing/", "https://dailysceptic.org/tag/the-science/", "https://dailysceptic.org/tag/zika/"], "authors": ["Dr Roger Watson"], "publish_date": "2023-04-14T11:08:29+00:00"}