{"result_id": "091004", "URL": "https://dailysceptic.org/2023/03/10/ons-admits-vaccine-effectiveness-data-are-flawed/", "timestamp": "2023-04-25 14:57:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/03/10/ons-admits-vaccine-effectiveness-data-are-flawed/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "ONS Admits Vaccine Effectiveness Data Are Flawed – The Daily Sceptic", "cleaned_text": "Like buses, you wait over six months for Office for National Statistics (ONS) data and then two publications come along within weeks. On February 21st 2023 it released its deaths by vaccination status data set and on Wednesday it looked at ‘COVID-19 vaccine effectiveness estimated using Census 2021 variables, England: March 31st 2021 to March 20th 2022’.\n\nThere has been lots of analysis of the February publication so today I will look at the latest ‘vaccine effectiveness’ data.\n\nBut to give you a heads-up, it’s good news – take as many jabs as you can and your life will be extended! We are witnessing the results of a miracle cure. Squirt some in the eyes of a blind man and I wouldn’t be surprised if he could see again.\n\nAccording to the latest data, vaccine effectiveness against hospitalisation for Covid was 52.2% for one dose, 55.7% for a second dose and 77.6% after your booster.\n\nVaccine effectiveness against COVID-19 mortality was 58.7% for a first dose, 88.6% for a second dose and 93.2% for a third dose.\n\nOne question that isn’t addressed properly in the ONS’s publication is why are you 100% likely to be hospitalised with Covid three months after your first dose? An obvious answer to this is that someone who didn’t go on to get his or her second dose was probably too ill to do so and so perhaps was in and out of hospital anyway. He or she may have caught Covid in hospital or the test produced a false positive. Either way, the ONS just says that this may be due to not all confounding from differences in health being taken into account. I think it should have looked at this further.\n\nBut now on to the interesting part that shows that any of its vaccine effectiveness statistics are nonsense – non-Covid mortality.\n\nAs you can see, apart from the “First dose: after three months” category, if you had a Covid vaccine you are less likely to die than those pesky unvaccinated individuals. Each group is adjusted three times. firstly by age (light green), then by age and socio-demographics (light blue) and then fully (dark blue).\n\nThe fully adjusted data show that if you have had three or more shots you are 50% less likely to die of than an unvaccinated person! It really is a miracle.\n\nTo be fair to the ONS, it admits as much itself. It says:\n\nThe confounding factors the ONS used to adjust the data were:\n• number of comorbidities as defined in the QCOVID model\n• hospitalisation within the last 21 days\n\nBut still, even after all those adjustments, the data show the boosted are 50% less likely to die of anything, which is clearly wrong. This shows how inaccurate its data on vaccine effectiveness against Covid must be.\n\nIn the publication, the ONS also says that “given instances of adverse events are rare, we can assume that the non-COVID-19 risk of death should be similar to, or close to, zero if there is no residual confounding”.\n\nI wouldn’t assume anything, ONS, that’s not good sciencing. You should be open to the possibility that perhaps adverse events aren’t rare and the non-Covid risk of death isn’t similar.\n\nAnd finally, a little trick which we’ve all come to know and love that completely muddies the water.\n\nThe unvaccinated group includes anyone who had a first dose less than 21 days ago. So for three weeks you count as unvaccinated even though you clearly are not. And the ONS are scratching their heads as to why the figures don’t add up!\n\nAgain, to be fair to the ONS, it has been clear that the unvaccinated group includes the under-21 days first dosers and, according to the ONS, this doesn’t apply to its February mortality statistics.\n\nAnd finally, why do the data stop in March 2022 – a whole year ago? The ONS has the data up to December 2022 because it used it in its February publication. As a sceptic I would look at the excess deaths rising from April 2022 last year and wonder whether there is any connection. I have asked the Head of Mortality Analysis at the ONS, Sarah Caul, as to the reason why, so will update with the answer if she responds.\n\nSo to conclude, either we have witnessed the invention of a wonder drug that reduces your risk of dying by 50% or the stats are wrong. And if these stats are wrong, how many of the other stats are wrong? And if these stats, a year later, are wrong, how many of the stats from a year ago were wrong? You know, the ones that were used to sack people from their jobs, stop them from participating in society or travelling to other countries.\n\nThis post first appeared on the Naked Emperor’s Substack page. Subscribe here.", "opengraph": {"locale": "en_GB", "type": "article", "title": "ONS Admits Vaccine Effectiveness Data Are Flawed – The Daily Sceptic", "description": "In a new ONS report on vaccine effectiveness, the statistics agency finds that even after adjustments the vaccinated die of non-Covid 50% less than the unvaccinated and admits this means its estimates are unreliable.", "url": "https://dailysceptic.org/2023/03/10/ons-admits-vaccine-effectiveness-data-are-flawed/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-03-10T11:48:53+00:00", "article:modified_time": "2023-03-14T18:05:57+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2021/06/210621-astrazeneca-ap-773.jpg", "image:width": "1160", "image:height": "773", "image:type": "image/jpeg"}, "tags": ["ONS", "Vaccine efficacy", "Dodgy Data", "COVID-19", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsinvolvingcovid19byvaccinationstatusengland/latest", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/covid19vaccineeffectivenessestimatedusingcensus2021variablesengland/31march2021to20march2022", "https://nakedemperor.substack.com/p/take-the-jab-and-live-forever", "https://nakedemperor.substack.com/subscribe", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/dodgy-data/", "https://dailysceptic.org/tag/ons/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-efficacy/"], "authors": ["Naked Emperor"], "publish_date": "2023-03-10T11:48:53+00:00"}