{"result_id": "091011", "URL": "https://dailysceptic.org/2023/02/28/nhs-stroke-consultations-shoot-up-by-25-since-vaccine-rollout/", "timestamp": "2023-04-25 14:58:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/02/28/nhs-stroke-consultations-shoot-up-by-25-since-vaccine-rollout/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Stroke Consultations Shoot Up by 25% Since Vaccine Rollout – The Daily Sceptic", "cleaned_text": "Last month the U.S. CDC and FDA released a joint statement stating that they had identified a statistical signal of increased strokes after vaccination with Pfizer’s bivalent Covid booster vaccine in those aged 65 and over. This sounds worrying, but the FDA and CDC were quick to reassure the population that they were only being open and transparent in releasing this information, and that they were sure that in reality the vaccines were very very safe and highly effective (and so everyone older than six months of age should get their dose whenever they’re told to by their benevolent Government).\n\nHowever, I was a bit puzzled by their joint statement – while it was eager with its reassurances, it didn’t actually include any data to support this reassurance. All we were told is that in the three weeks after vaccination there was a higher risk of stroke compared with the four to six week period after vaccination in those aged 65 or older. But there was no quantitative data on this relative risk, no information at all on the risk after this six week period and no statement on whether they’d actually even investigated stroke risk in other age groups.\n\nGiven this lack of data I thought I’d head over to the data on NHS hospital consultant activity to see whether that would offer some insight into the incidence of stroke in the U.K. over the last few years.\n\nHmm. The workload of stroke specialists appears to have suddenly increased in the U.K. by a very large factor just at the point where the vaccines were being rolled out in large numbers. As I recall the Government was very pleased with the speed at which it managed to vaccinate such large numbers of people over such a short period of time, so if there were a significant increased risk of stroke then an extremely rapid rise in stroke incidence would be exactly what you’d expect. Of course, this might just be coincidence, despite this strong temporal association with the vaccines…\n\nIn many respects this type of statistical signal is the same as the increase in excess deaths that we’ve seen in the U.K. and many other countries since the vaccines were rolled out – there is that temporal association with the vaccines but there’s little actual scientific evidence that it is due to the vaccines (although that lack of evidence might just be due to a strange reluctance on the part of our authorities to investigate this phenomenon). Various alternative explanations have been rolled out for the excess deaths such as their being due to lockdowns (including lack of NHS care) or due to Covid itself (or eggs, climate change, stress about Ukraine etc.). Strangely though, the one thing that is never said is that it would be fairly easy to exclude the vaccines as being the cause of the excess deaths – simply undertake a retrospective matched cohort study into the number of excess deaths by vaccination status. Given the extraordinarily high excess deaths we’ve been seeing, the lack of such a study is weird.\n\nAnd the same applies to this statistical signal in increased strokes in the U.K. in the period since the Covid vaccinations started to be given. Surely our Government would love to identify all and any increased risks that our population is under – surely?\n\nI note in particular that there appears to be a somewhat higher rate of consultant activity in the second half of 2020 – perhaps the higher incidence rates aren’t anything to do with the vaccines after all? On the other hand, it might simply be that during autumn 2020, when the NHS started to dial down its hysterical Covid response, the specialists in stroke medicine were starting to treat cases where the initial stroke had occurred during the NHS shutdown earlier in the year. This could explain the higher consultation rates in the second half of 2020. However, it won’t be the case that this same mechanism would persist over longer timescale – strokes aren’t like some other conditions where consultants might see individuals at higher risk or where there is a long waiting list to get treatment. Rather, people typically see a consultant specialising in strokes at their bedside immediately after a stroke and typically the sooner they’re seen the better. There certainly won’t be many people, if any, waiting a over a year for their consultation.\n\nThe other interesting aspect of the increase in the NHS consultant activity data is that the increased activity doesn’t seem to be reducing. I note that the CDC/FDA announcement on strokes only found an increased risk in the three weeks after vaccination compared with the following three weeks, so maybe these high stroke incidence data indicate that it isn’t associated with the vaccines. Or, alternatively, the vaccines might induce a sustained increased risk, in which case we would be seeing a new normal of increased stroke risk after vaccination. If this were the case the CDC and FDA should change their methods to look at risks far beyond their six week post vaccination period. Indeed, it is a bit odd that they limit their time period in this way. Didn’t they want to find any evidence of longer term increased stroke risk? Surely the population of the USA would be very keen to have this information. One other note on the consistently high stroke activity in NHS hospitals is that we don’t know how close to capacity they are. Is the seemingly consistently high activity simply reflecting this speciality working at 100%, with some spikes in the data by for each Covid wave or vaccination drive being masked by the inability of the speciality to respond appropriately?\n\nThe NHS hospital episodes data appear to have offered an early indication that there might be a problem – after all, even in spring 2021 the number of strokes appears to have been substantially higher than in the pre-Covid period. Can we use other NHS data to explore this risk further? In this and subsequent posts I’ll also be making use of three other datasets that the NHS issues on how drugs are being used in the U.K.:\n• Prescriptions written by GPs are collated in the Practice Level Prescribing Data Series – this data series is difficult to use, but fortunately an independent body, Openprescribing, has made these data available in a more user-friendly format. Note that all the datasets have been complicated by Covid – for the GP dataset it is mainly that GP services were significantly curtailed in 2020 and they remain somewhat less accessible compared with the pre-Covid period.\n• The issuance of drugs by hospitals is available in the Secondary Care Medicines Dataset. Note that the NHS doesn’t make this an easy dataset to use – it is almost as if it is required to publish the data, but doesn’t really want anyone actually using it. The hospitals prescription dataset is complicated by the fact that hospitals nearly closed down to non-Covid patients in early 2020, and nearly all medicines show a significant decline in hospital use over this period, with many taking some time to recover to the pre-2020 trend.\n• Regular hospital prescriptions can only be dispensed in a hospital pharmacy, so there is a separate database for prescriptions written in a hospital setting but intended to be dispensed by a normal pharmacist. Again, this dataset isn’t particularly easy to work with. In my posts on this topic I’ll often describe these particular data as ‘emergency prescriptions’ but note that this category of prescription is broader than merely those prescriptions issued in accident and emergency departments for dispensing in a regular pharmacy. The problem with the data for hospital prescriptions written for dispensing in the community is that over the Covid period people had little choice but to attend A&E for minor problems because it had become relatively difficult to see a GP.\n\nThe obvious first drug to investigate is alteplase, a clot-busting drug used in the hours after a stroke to get rid of the clots that are causing the problem. However, there is no strong statistical signal for alteplase – unfortunately, this drug has been in short supply for some time due to unusually high global demand. Strangely, the other emergency clot-busting drug, tenecteplase, is also in short supply for the same reason. There appears to be no explanation given for this global increase in demand.\n\nIn normal times, without global shortages, clot-busting drugs are only used for a minority of stroke patients – not only do they need to be used very soon after the stroke occurred, but also they can make things much worse if applied in the wrong types of stroke and it takes time to gather this evidence. On average only about 10% of strokes are treated using these drugs. For most strokes that involve clots the clot-busters can’t be used and thus rapid-acting anti-coagulants become the drug of choice, used in high doses under close medical supervision in a hospital setting. The hospital drug use data do show an increased use of these anti-clotting drugs, such as apixaban.\n\nWhat’s particularly interesting in the graph above is the short spike in issuance of apixaban around the turn of 2019-2020 – is this a sign of Covid itself being clot-promoting, with something since the start of 2021 increasing this problem? Also, note the timing of that early peak, at the turn of 2019-2020 – do these data support the theory that Covid was endemic in the U.K. in late 2019, with the increased cases of ‘respiratory disease’ being blamed on an unusually early outbreak of influenza?\n\nThere has been a similar increase in the use of other anticoagulants, such as enoxaparin and edoxaban in a hospital setting.\n\nThe data for prescriptions of general ‘blood-thinning’ drugs are a bit difficult to interpret, however, given the general increase in the use of these drugs in the community. The graph below shows the increase in prescriptions written for apixaban by GPs over the last few years.\n\nIt is clearly difficult to untangle changes in risk given this years-long general trend as more and more in our population are introduced to the benefits of the pharmaceutical industry. One thing is fairly clear, however – there doesn’t seem to have been any noticeable decline in the issuance of these (and other) cardiovascular drugs during the Covid lockdowns, despite claims by our authorities that this has been the driving force of the increase in excess deaths seen during 2022.\n\nThere is also a strange upwards trend in the prescription of aspirin (300mg) in hospitals for dispensing within normal pharmacies.\n\nNote how the number of tablets dispensed increases markedly from the start of 2021 and how there appears to be a maintained upwards trend. It is important to note that while aspirin is often taken as a mild painkiller, this is generally not the preferred use within a modern medical context. It is likely that these prescriptions will relate to aspirin’s anti-coagulant properties.\n\nAn important aspect of the data that I’ve shown here is that they don’t give any indication as to the characteristics of the individuals behind this increase in consultations for stroke. While it is reasonable to assume that this increased risk would be proportionate to the prior risk, this is by no means certain. For example, if the risk of stroke increased to one in 200 per five years for everyone in the population, this increase would be significant for younger individuals, but wouldn’t impact much on stroke risk for those aged 85 years or older. This lack of data on changes in stroke risk by age certainly isn’t helping us understand the changes in risk that our population appears to be experiencing. Still, I very much hope that the increased stroke risk isn’t being seen in younger adults.\n\nThe data suggest that something is going on with blood clotting within the population of the U.K., resulting in an increase in strokes and presumably other conditions such as deep-vein thrombosis and pulmonary embolism. Although the U.S. FDA and CDC claim (without offering supporting data) that there isn’t really a net increase in strokes associated with the vaccines, the data available from the NHS suggest that there might well be a non-trivial increased risk. Our population deserve a comprehensive study into the risks associated with blood clotting in this post-Covid and post-vaccine age.\n\nI suppose I could stop here – there appears to be an indication of an increased stroke risk in the U.K. population over the past few years, and it is surely time for our Government to look much more seriously into this unhappy change in the health of the nation and into what might have caused it, preferably with analysis beyond the six week point. .\n\nHowever, the NHS hospitals and drugs datasets appear to offer some insight into the health (or otherwise) of the nation, and I’ll explore some other population morbidities over my next few posts.\n\nAmanuensis is an ex-academic and senior Government scientist. He blogs at Bartram’s Folly – subscribe here.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Stroke Consultations Shoot Up by 25% Since Vaccine Rollout – The Daily Sceptic", "description": "NHS stroke consultations shot up by 25% following the Covid vaccine rollout, but for some reason the Government has shown no interest in getting to the bottom of this worrying trend.", "url": "https://dailysceptic.org/2023/02/28/nhs-stroke-consultations-shoot-up-by-25-since-vaccine-rollout/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-02-28T07:00:00+00:00", "article:modified_time": "2023-02-28T11:13:43+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/02/image-122.png", "image:width": "1004", "image:height": "717", "image:type": "image/png"}, "tags": ["NHS", "COVID-19", "Vaccine", "Vaccine injury", "Cardiovascular Diseases", "Stroke"], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/bivalent-boosters.html", "https://digital.nhs.uk/data-and-information/publications/statistical/provisional-monthly-hospital-episode-statistics-for-admitted-patient-care-outpatient-and-accident-and-emergency-data/april-2022---november-2022", "https://digital.nhs.uk/data-and-information/areas-of-interest/prescribing/practice-level-prescribing-in-england-a-summary", "https://openprescribing.net/", "https://opendata.nhsbsa.net/dataset/secondary-care-medicines-data", "https://opendata.nhsbsa.net/dataset/hospital-prescribing-dispensed-in-the-community", "https://www.cas.mhra.gov.uk/ViewandAcknowledgment/ViewAttachment.aspx?Attachment_id=104069", "https://openprescribing.net/chemical/0208020Z0/", "https://bartram.substack.com/", "https://bartram.substack.com/subscribe", "https://dailysceptic.org/tag/cardiovascular-diseases/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/nhs/", "https://dailysceptic.org/tag/stroke/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Amanuensis"], "publish_date": "2023-02-28T07:00:00+00:00"}