{"result_id": "091041", "URL": "https://dailysceptic.org/?p=165997", "timestamp": "2023-04-25 14:58:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/12/busting-the-myth-that-covid-vaccines-are-highly-effective-against-death/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Busting the Myth that Covid Vaccines Are 'Highly Effective' Against Death – The Daily Sceptic", "cleaned_text": "There are two possible mechanisms, thoughtfully explained in a thorough review and a recent article on : Covid vaccines might reduce the risk of infection, or reduce the risk of death — if infected, or both. We can explain the mechanisms in words, with reference to ‘marginal and conditional probabilities’, or we can depict them in a causal diagram — a powerful methodological tool.\n\nThe first mechanism is simple: If a Covid vaccine reduces the risk of infection, it will also reduce the risk of death, because there is no doubt that getting infected increases the risk of death. Theoretical exceptions aside, if A affects B, and B affects C, then A affects C.\n\nWhat if A does not affect B? What if a Covid vaccine does not reduce the risk of infection? Then it cannot reduce the risk of death through this mechanism. The causal chain does not exist. A link is broken.\n\nBy now we know that Covid vaccines appear temporarily to the risk of infection, and any subsequent benefit is nullified within months, if not turned again into harm (negative vaccine effectiveness). Therefore, according to the first mechanism, there is a short period when a Covid vaccine the risk of death, a limited period (a few months) when it the risk of death, and a later period when the effect is null at best.\n\nThe second mechanism is more complicated. One aspect was explained in the article and is related to a causal concept called ‘effect modification’. Like numerous epidemiological concepts, there are layers of complexity below superficial simplicity. I will keep it simple.\n\nWhen two causes — Covid vaccine and Covid infection — operate on a single outcome (death), we may ask two causal questions:\n• What is the effect of a Covid vaccine on the risk of death — if infected?\n• What is the effect of a Covid vaccine on the risk of death — if not infected?\n\nThe second question is asking about vaccine-related death, the worst adverse effect. (A vaccine can be a cause of death even when someone is infected, but that’s another issue.)\n\nTheoretically, the two types of effect could be different, in any possible way: magnitude and direction. Both might be harmful effects, yet of different magnitude. One might be beneficial and the other null, and so on. Add to that complexity time-varying effects, as noted earlier, and you can see how complicated causal reality might be.\n\nCoincidentally, I encountered a relevant study at about the same time that I read the article. That study provides insight into the two mechanisms by which Covid vaccines might reduce the risk of death, although the authors missed one aspect of their data (regarding reduced infections) and stopped short of the computation for the other (reduced mortality, if infected).\n\nThat’s not surprising. At times of biased media and biased science, we sometimes find insight from narrative-matched publications that missed interesting inference from the data.\n\nPublished as a ‘research letter‘, the study compared Covid mortality with mortality from seasonal flu. Using databases of the U.S. Department of Veterans Affairs (VA), the researchers identified patients who were hospitalised with an admission diagnosis of Covid or influenza and ascertained deaths. Most patients were elderly, the age group where Covid mortality is concentrated and effective vaccines are needed.\n\nDid Covid vaccines reduce infections? Although the design was a classical retrospective cohort, the baseline data in the first table may be viewed as data from a hospital-based case-control study. (I cannot get into a technical explanation of ‘propensity score weighting’, but it can be ignored for a basic case-control analysis.)\n\nWe may consider Covid patients as cases (numbering 8,996) and seasonal influenza patients as controls (there are 2,403). In a typical hospital-based case-control study, controls are selected from multiple disease categories, but I don’t see a major problem with this control group, and perhaps there are referral-related advantages.\n\nMany complicated issues arise from a case-control study. Nonetheless, the basic analysis is simple. We visually compare the distribution of the suspected causal variable (Covid vaccination status) in cases and controls and compute odds ratios. If the vaccines meaningfully reduced the risk of infection, we should get odds ratios much smaller than 1.\n\nWe have no such evidence in these data. The odds ratios are close to 1 (close to zero vaccine effectiveness) and they line up in the ‘wrong’ (unexpected) order of magnitude: the larger the number of doses, the the apparent effect. The causal chain from vaccination to reduced mortality through reduced Covid infections is not corroborated.\n\nInterestingly, we may also view influenza patients as cases and Covid patients as controls and compare the distribution of flu vaccination status in the two groups. Check their table above. There is no meaningful association either.\n\nMight biases account for near-null associations? Biasing paths typically lead to a statistical association when there is no real cause-and-effect relation. Random error aside, it is unusual for biases to turn strong effects into near-null associations.\n\nDid Covid vaccines reduce mortality, if infected? We turn next to the second mechanism by which a Covid vaccine might reduce mortality: reducing the risk of death, . That part was addressed in the original design. Every member of the cohort was infected, either by SARS-Cov-2 or by influenza.\n\nThe authors have focused on a comparison of Covid mortality with flu mortality, but they added a secondary conclusion:\n\nHow important is vaccination? What was the vaccine effectiveness — if infected? They don’t say.\n\nIf Covid vaccines no longer reduce the risk of infection, that’s the only source of vaccine effectiveness (VE) against death.\n\nBelow you will find their table and my computation:\n\nVE of 30% or 40% in the vulnerable population is far from ‘highly effective’, a perpetuated claim. The incremental benefit of booster vaccine (one or more doses, per supplementary material) was even smaller (risk ratio 0.83, VE 17%).\n\nMoreover, 30% to 40% is not necessarily the true effectiveness. We have clear evidence of ‘healthy vaccinee bias‘, a type of confounding bias, in both the U.S. and the U.K.. People of the same age who were vaccinated against Covid were healthier, on average, than their unvaccinated counterparts, as evident by lower non-Covid mortality. Therefore, the unbiased VE should be smaller. For example, a modest bias correction factor around 1.5 would drive VE of 40% close to zero.\n\nBillions have been vaccinated under the slogan ”safe and effective’.\n\nIt was neither.\n\nDr. Eyal Shahar is Professor Emeritus of Public Health at the University of Arizona. This article Medium", "opengraph": {"locale": "en_GB", "type": "article", "title": "Busting the Myth that Covid Vaccines Are 'Highly Effective' Against Death – The Daily Sceptic", "description": "It is commonly claimed that Covid vaccines are highly effective against death from COVID-19, but the data do not support this claim, writes Professor Eyal Shahar.", "url": "https://dailysceptic.org/2023/04/12/busting-the-myth-that-covid-vaccines-are-highly-effective-against-death/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-12T13:00:00+00:00", "article:modified_time": "2023-04-12T11:10:41+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2022/02/covid-19-vaccine-mixing-shutterstock_1891563244.jpg", "image:width": "2000", "image:height": "1333", "image:type": "image/jpeg"}, "tags": ["Vaccine efficacy", "COVID-19", "Vaccine injury", "United States", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.jpands.org/vol28no1/ophir.pdf", "https://brownstone.org/articles/final-brick-vaccine-efficacy-narrative/", "https://www.intechopen.com/chapters/32599", "https://pubmed.ncbi.nlm.nih.gov/20539118/", "https://jamanetwork.com/journals/jama/fullarticle/2803749", "https://brownstone.org/articles/final-brick-vaccine-efficacy-narrative/", "https://brownstone.org/research/articles-of-inquiry-the-role-of-media/", "https://brownstone.org/articles/the-censorship-of-covid-science-three-examples/", "https://twitter.com/prof_shahar/status/1452038614238449666", "https://jamanetwork.com/journals/jama/fullarticle/2803749", "https://pubmed.ncbi.nlm.nih.gov/22701093/", "https://pubmed.ncbi.nlm.nih.gov/19124221/", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7043e2.htm?s_cid=mm7043e2_w", "https://medium.com/p/b7ccba4a25ed", "https://twitter.com/prof_shahar/status/1452038614238449666", "https://dailysceptic.org/2023/04/04/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "https://shahar-26393.medium.com/covid-vaccines-and-covid-mortality-highly-effective-354471b403da", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/united-states/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-efficacy/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Dr Eyal Shahar"], "publish_date": "2023-04-12T13:00:00+00:00"}