{"result_id": "091006", "URL": "https://dailysceptic.org/2023/02/10/singapores-large-rise-in-heart-deaths-points-to-a-potential-vaccine-cause/", "timestamp": "2023-04-25 14:57:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/02/10/singapores-large-rise-in-heart-deaths-points-to-a-potential-vaccine-cause/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Singapore's Large Rise in Heart Deaths Points to a Potential Vaccine Cause – The Daily Sceptic", "cleaned_text": "The Singapore Government released data on its excess deaths in 2021, which is a window into what has caused excess cardiovascular deaths. Singapore is interesting because Covid deaths did not feature until September 2021. Prior to that date only 29 deaths had been attributed to Covid.\n\nIt is worth noting that cardiovascular disease is not a prominent cause of death in Singapore. In 2021, 28% of deaths were from cardiovascular disease compared to 48% in England. Given those pieces of information we can predict what would happen under different hypotheses.\n• None Hypothesis 3: Lack of access to healthcare from fear and lockdown\n\nThis is an odd hypothesis because there were no non-Covid excess cardiovascular deaths following Covid in England in 2020 (grey bars above purple line). But it’s a popular hypothesis so let’s go along with it.\n\nCovid accounted for 3% of deaths in Singapore in 2021 but 14% in England. The lower proportion of deaths and the fact Covid did not really take off until Sept 2021 in Singapore means that if Covid is the cause we would expect excess cardiovascular deaths in Singapore than in England.\n\nIf they were Long Covid related then we would expect an effect in England but not Singapore where only a tiny fraction had been infected by the end of 2021 and only for a short time.\n\nHypothesis 3: Lack of access to healthcare from fear and lockdown caused later excess cardiovascular deaths\n\nSingapore did have a spring 2020 lockdown and some people stopped accessing healthcare. Emergency department visits reached a nadir of 75% of normal.\n\nBy contrast, in England the fall in emergency attendances reached as low as half of normal levels. Unlike in Singapore, in England a second period of lack of access in the second lockdown (November 2020) will also have had an impact. From early 2021, demand increased to above previous levels (despite the third lockdown from January to July). This cannot be attributed to ambulance delays as this was the total number of people sick enough to need to attend the emergency department.\n\nAlthough Chris Whitty claimed that a reduction in statin prescriptions could have led to recent cardiac excess deaths, the levels of prescriptions were in fact maintained. Moreover, the British Heart Foundation estimated that a lack of preventative care would lead to an extra 12,000 heart attacks or strokes over a five year period, the vast majority of whom would not die, which is far too few to account for the increase.\n\nThe psychological impact of lockdowns including lack of access to healthcare, could, however, have acted directly as a risk factor for cardiovascular disease that then led to a longer term impact on cardiovascular events.\n\nSingapore vaccinated one to two months later than England but ended up giving marginally more doses by the end of 2021. If it were vaccine related then we would expect a similar rise in both countries.\n\nWhich hypothesis is supported by the evidence?\n\nWhat would we expect excess cardiovascular deaths to look like in 2021 in Singapore compared to England under each hypothesis?\n\nN.B. It might be that more cardiovascular deaths would be expected in England from any of these causes because of there being a higher susceptibility to cardiovascular death.\n\nHaving established what we would expect, let’s look at what happened. I have compared 2021 deaths by cause in Singapore with 2020 levels to give a percentage excess. For England I have used the UKHSA expected deaths data from here.\n\nFirst, there has been a similar minimal rise in cancer deaths in both countries. By contrast, the rise in cerebrovascular disease (strokes) and ischaemic heart disease (heart attacks) is substantial in both countries.\n\nThe overall increase in cardiovascular deaths was 9% in Singapore and 14% in England.\n\nRemember the first nine months of 2021 saw no Covid deaths in Singapore at all, leaving little time for the rise in cardiovascular deaths to have been caused by Covid.\n\nThere is a clear signal of increased cardiovascular disease in 2021 in Singapore which has very low rates of cardiovascular disease normally. The total number of excess cardiovascular deaths in 2021 would represent three excess cardiovascular deaths for every four Covid deaths, i.e., a ratio of 0.75. In contrast, there was one excess cardiovascular death for every two Covid deaths in England, i.e., a ratio of 0.5. Why would Singapore have more cardiovascular deaths caused by Covid than England? Did Covid lead to proportionately more cardiovascular disease in Singapore than in England? That would be rather odd given the higher propensity for cardiovascular disease in the English population.\n\nLong Covid can’t explain the large increase in cardiovascular deaths in Singapore when it had had so little Covid prior.\n\nA lack of access to healthcare because of lockdown and fear cannot be ruled out as a cause.\n\nIt seems quite a coincidence that the lag between people not attending hospitals in 2020 and the rise in cardiovascular deaths is so consistent between the countries, despite different demographics. It might be expected that an older, frailer, more unhealthy population (England) would see detrimental effects of a lack of healthcare sooner than a younger, fitter population (Singapore).\n\nVaccination is clearly a possibility here that needs to be investigated.\n\nThe Singapore Government report made no mention of vaccination with respect to deaths from any cause other than Covid deaths. It said:\n\nThe report authors have forgotten here to account for the healthy vaccinee effect, where people on the brink of death rejected or were not offered the vaccine as they were dying anyway. Such an effect has been used to explain impossibly high estimates of effectiveness for influenza vaccines. Both the ONS and Statistics Regulator have both assumed this phenomenon exists.\n\nThe Singapore report makes the claim that the excess deaths were only seen in people post-Covid infection: “In a secondary analysis of persons without recent infection, no additional excess deaths were found.”\n\nThis analysis and the data it relied on are not shared and I am not sure what an “additional excess death” is. Others have demonstrated that compared to a population having any random encounter with medical services, those who sought medical help for Covid had a lower risk of cardiovascular disease and stroke.\n\nGiven the low numbers of infections with Covid in Singapore in 2020 and the fact that there was little Covid prior to September 2021, it is hard to reconcile that conclusion with this substantial increase in cardiovascular deaths.\n\nSo two unanswered questions remain: What role (if any) do vaccinations have in excess cardiovascular deaths? When will there be a full, independent and transparent investigation?\n\nDr. Clare Craig is a diagnostic pathologist and Co-Chair of the HART group . This article was first published by HART.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Singapore's Large Rise in Heart Deaths Points to a Potential Vaccine Cause – The Daily Sceptic", "description": "Singapore has seen a similar rise in heart deaths to England despite having far less Covid before autumn 2021, meaning it cannot be blamed on Long Covid and putting more suspicion on the vaccines.", "url": "https://dailysceptic.org/2023/02/10/singapores-large-rise-in-heart-deaths-points-to-a-potential-vaccine-cause/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-02-10T07:00:00+00:00", "article:modified_time": "2023-02-11T10:32:32+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/02/singapore.png", "image:width": "1022", "image:height": "677", "image:type": "image/png"}, "tags": ["Non-Covid", "heart failure", "Excess deaths", "Singapore", "Cardiovascular Diseases", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.moh.gov.sg/docs/librariesprovider5/resources-statistics/reports/report-on-excess-mortality-during-the-covid-pandemic-18sep2022.pdf", "https://pubmed.ncbi.nlm.nih.gov/34902499/#&gid=article-figures&pid=figure-2-uid-1", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/952272/EDSSSBulletin2021wk01.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/952272/EDSSSBulletin2021wk01.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1021618/EDSSSBulletin2021wk38.pdf", "https://www.telegraph.co.uk/news/2023/01/12/statins-should-offered-anyone-who-wants-new-nhs-guidance/", "https://trusttheevidence.substack.com/p/is-everyone-dying-of-statin-starvation", "https://www.moh.gov.sg/docs/librariesprovider5/resources-statistics/reports/report-on-excess-mortality-during-the-covid-pandemic-18sep2022.pdf", "https://app.powerbi.com/view?r=eyJrIjoiYmUwNmFhMjYtNGZhYS00NDk2LWFlMTAtOTg0OGNhNmFiNGM0IiwidCI6ImVlNGUxNDk5LTRhMzUtNGIyZS1hZDQ3LTVmM2NmOWRlODY2NiIsImMiOjh9", "https://www.moh.gov.sg/docs/librariesprovider5/resources-statistics/reports/report-on-excess-mortality-during-the-covid-pandemic-18sep2022.pdf", "https://www.singstat.gov.sg/find-data/search-by-theme/population/death-and-life-expectancy/latest-data", "https://app.powerbi.com/view?r=eyJrIjoiYmUwNmFhMjYtNGZhYS00NDk2LWFlMTAtOTg0OGNhNmFiNGM0IiwidCI6ImVlNGUxNDk5LTRhMzUtNGIyZS1hZDQ3LTVmM2NmOWRlODY2NiIsImMiOjh9", "https://www.populationpyramid.net/united-kingdom/2023/", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-015-1154-y", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsinvolvingcovid19byvaccinationstatusengland/deathsoccurringbetween1january2021and31march2022", "https://osr.statisticsauthority.gov.uk/correspondence/ed-humpherson-to-norman-fenton-martin-neil-clare-craig-and-scott-mclachlan-ons-deaths-by-vaccination-status-statistics/", "https://academic.oup.com/ofid/article/10/1/ofac683/6953331", "https://www.hartgroup.org/fda-approve-covid-vaccine-for-0-4-years/", "https://www.hartgroup.org/singapore-is-a-control-group/", "https://dailysceptic.org/tag/cardiovascular-diseases/", "https://dailysceptic.org/tag/excess-deaths/", "https://dailysceptic.org/tag/heart-failure/", "https://dailysceptic.org/tag/non-covid/", "https://dailysceptic.org/tag/singapore/", "https://dailysceptic.org/tag/vaccine/"], "authors": ["Dr Clare Craig"], "publish_date": "2023-02-10T07:00:00+00:00"}