{"result_id": "091049", "URL": "https://dailysceptic.org/2023/04/04/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "timestamp": "2023-04-25 14:58:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/04/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "\"Unacceptable\": Calculating the Covid Vaccine Fatality Rate –", "cleaned_text": "Let’s clear up three points first:\n• Forcing people to be injected, by coercion and threats, was a despicable intervention. Only an immoral mind could find it acceptable, and society has no shortage of immoral, ‘normal’ minds, as history shows.\n• Covid vaccines have caused severe adverse effects and deaths. Only a prejudiced mind can deny this statement. They are neither safe nor as effective as initially claimed. There is considerable uncertainty about their true effectiveness (see here and here, for example).\n• That any vaccine cause death is not some novel discovery. The ultimate questions in science are quantitative, not qualitative: How often? What is the fatality rate of Covid vaccines? How does it compare with the fatality rate of, say, a flu vaccine?\n• Fatality after a flu shot is extremely rare: one death per five million.\n• Short-term fatality after Covid shots is many folds higher: dozens of deaths per one million. That’s unacceptable, or at least was unacceptable for any vaccine before 2021.\n• We should also add long-term mortality, which is difficult to quantify. For instance, fatal arrhythmia two years later due to subclinical myocarditis. Is this tragic death an example or not? Who can tell? Unexpected death of young people had happened before, rarely.\n• I do not think, however, that Covid vaccine deaths have been a main contributor to excess mortality in the past two years. With some exceptions (here and here, for example), it is difficult to detect these deaths in country-level statistics.\n\nIn the normal course of science, regulatory agencies would have set up well-designed cohort studies to estimate the fatality rate of Covid vaccines. That did not happen. They were too busy advertising the shots as ‘safe and effective’, so we have to derive estimates from other sources. That’s far from rigorous science but better than nothing.\n\nI used several methods to estimate the likely range. Two sources allowed me to exclude implausible values. Other sources allowed me to narrow the range.\n\nBelow, I compute the rate as the number of deaths per 100,000, rather than per million, and consider the number of vaccinated people, not the number of doses.\n\nA landmark study, by a highly qualified research team, has estimated the rate of serious adverse events in the clinical trials of Pfizer and Moderna mRNA vaccines. The rate of such events was roughly 10-15 per 10,000 (100-150 per 100,000) above the rates in the placebo arms.\n\nThe rate of fatal events must be a fraction of the rate of serious adverse events, just as the number of patients who die in a hospital is a fraction of those who are hospitalised. What is that fraction in the case of Covid vaccines?\n\nIt is certainly small. Not 50%, not 30%, not 20%. I think it is no more than 10% of serious adverse events, and probably smaller.\n\nWe should therefore conclude that the fatality rate of Covid vaccines cannot be more than 15 per 100,000. The data on serious adverse events in the randomised trials (however problematic those trials might have been) allow us to exclude some implausibly high values. The fatality rate of Covid vaccines is not 100 deaths per 100,000 nor 50 deaths per 100,000.\n\nThe first vaccination campaign in Israel took place at the beginning of 2021, concurrent to a Covid winter wave.\n\nDuring that period (December 2020-March 2021) the Ministry of Health reported about 3,300 Covid deaths, whereas the Central Bureau of Statistics (CBS) later estimated only half as many excess deaths.\n\nThe CBS estimate of about 1,600 excess deaths in that period seems reasonable to me. I reached a similar number based on simple extension of a linear trend.\n\nThe striking difference between reported Covid deaths and excess deaths undermines vaccine efficacy studies from Israel. But it also sets an upper boundary on the short-term fatality rate of the Pfizer vaccine. Undoubtedly, much of the excess mortality at that time was Covid deaths, which means that only a few hundred could have been vaccine fatalities: perhaps 500 at most, among five million vaccinated residents.\n\nRates that are much higher are incompatible with the number of excess deaths in Israel during the first vaccination campaign. For example, a rate of 50 per 100,000 implies 2,500 vaccine deaths when the total number of excess deaths was 1,600. Similarly, a rate of 20 per 100,000 implies 1,000 vaccine deaths out of 1,600 excess deaths. That’s implausible, too.\n\nThere is one caveat, however. The early post vaccination period is a high-risk period for contracting Covid and for death from Covid. Since the vaccination campaign coincided with a Covid wave, an unknown proportion of Covid deaths might have been vaccine-related. These deaths should be added to the numerator of the fatality rate.\n\nDuring 2021-2022, when Covid vaccines were injected into billions, I encountered counts of reported vaccine-related deaths from several countries. These reports were compiled by national registries, reflecting different cultures and different administrative structures. Some reports included the number of vaccinated people by some time point; for others I obtained estimates elsewhere.\n\nI kept adding lines of data to an Excel file. At that time, I did not envision publishing an article, so I did not keep a record of the data source, the date, or a link to a website. I simply wanted to know the truth, which authorities were trying to hide. The numbers I obtained are ‘crude’ — in any sense of the word you would like.\n\nHere are my data, without much editing:\n\nCan we still learn something from such raw data? I think we can, relying on heuristic arguments.\n\nReports from different countries and different cultures have returned a narrow range of the fatality rate (2-7 deaths per 100,000). They cannot be wrong by a similarly large factor (e.g. 10, 20, 40). Otherwise, we would have to assume, for example, that Sweden and the U.S. share the same huge under-reporting bias (e.g. only 10% of vaccine deaths are reported in each country).\n\nStated differently: to assume a large error, we have to assume that data from different countries are not only extremely bad but were also somehow ‘standardised’ to be – everywhere. No exception.\n\nI would not make such an assumption. The rates from different countries are likely underestimates of the truth, but the correction factor may be two to four at most. Not 40, not 20. Not 10. Many deaths after a vaccine shot are unexpected and not easily ignored by medical personnel. I think that a significant proportion of these deaths has been reported, even in the Covid era, when biases prevailed.\n\nIn the table below, I summarised the data as follows:\n\nFirst, when millions are vaccinated, some reported deaths are coincidental. To be conservative (favouring the vaccines), I assumed that only 75% of reported deaths were vaccine-related.\n\nSecond, I allowed for an under-reporting factor (URF) of two (only half is reported), three (only one-third is reported), and four (only one-quarter is reported).\n\nExtending the 7-14 range somewhat, in both directions, we may assume that the fatality rate is somewhere between 5 and 15 deaths per 100,000. The upper limit is in line with the number I deduced from the rate of serious adverse events.\n\nIn the U.S, these rates imply at least 13,000 short-term vaccine fatalities and possibly three times as many (almost 40,000 deaths). Statistically, few of these people would have died from Covid.\n\nMany of those who completed the first vaccination protocol (two doses a few weeks apart) received a third (booster) dose several months later. There were booster-associated deaths (see here and here), and they add to the count of vaccine fatalities, probably doubling the overall short-term fatality rate.\n\nSome insight, albeit not scientific, may also be gained from what are sometimes labeled ‘sentinel events‘.\n\nBack in 2021, I was following a news outlet in my state and noticed a cluster of five unexpected deaths of relatively young people over a short period (November 4th through December 4th). Unexpected deaths are not usually reported unless the deceased is a public figure in some sense, which was the case here. The deceased worked in professions that may be called ‘protective services’ (see here, here, here, here, and here). In one case, “sources” reportedly said it was Covid. The circumstances of other deaths remained obscure.\n\nSometimes, the general descriptor was “in the line of duty”, which is non-specific, and elsewhere included Covid death (see here, for example).\n\nDid they all die from Covid? Suddenly? That’s unlikely. Furthermore, deaths from Covid of police officers were highlighted in the local media, not hidden (see here, here, and here).\n\nWere all of them vaccinated? I do not know (though it is likely, especially in those professions).\n\nIf they were vaccinated, was the death vaccine-related in any case? I do not know.\n\nBut I do know that the time period roughly coincided with the timing of a booster dose. I also know that a cluster of such deaths in one month is highly unlikely, statistically, in the absence of a time-dependent shared cause.\n\nFrom what I could find, there may be 40,000 people or so in such professions in my state. If these were booster-related deaths, the rate is in line with the estimates.\n\nBooster deaths or not, we do not expect to hear about five unexpected deaths, in one month, of relatively young people in occupations that require excellent health status. I am not aware of any investigative report about this unexplained cluster of deaths.\n\nFatality after a flu shot is extremely rare: one death per five million.\n\nfatality after Covid shots is many folds higher: dozens of deaths per one million. That’s unacceptable, or at least was unacceptable for any vaccine before 2021.\n\nWhat about long-term consequences, fatal and non-fatal? Will we be able to estimate the rates in a decade or two? How would we know, for example, if a future Covid death was caused by changes in natural immunity? How would we know if a sudden death was caused by subclinical myocarditis? How would we know if an auto-immune disease was triggered by Covid vaccine?\n\nThis is not going to be an easy task.\n\nThere had been good reasons, before the Covid era, for not rushing a new drug, or a new vaccine, into the market. We have learned the lesson the hard way, or have we?\n\nDr. Eyal Shahar is Professor Emeritus of Public Health at the University of Arizona. This article Medium", "opengraph": {"locale": "en_GB", "type": "article", "title": "\"Unacceptable\": Calculating the Covid Vaccine Fatality Rate – The Daily Sceptic", "description": "Dr. Eyal Shahar, Professor Emeritus of Public Health at the University of Arizona, draws on official data sources to estimate the short-term fatality rate of the COVID-19 vaccines, which he calls \"unacceptable\".", "url": "https://dailysceptic.org/2023/04/04/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-04T06:00:00+00:00", "article:modified_time": "2023-04-03T23:30:27+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2021/05/mrna-vaccines-large.jpg", "image:width": "1800", "image:height": "1013", "image:type": "image/jpeg"}, "tags": ["Vaccine injury", "Adverse events", "COVID-19", "Vaccine"], "tweets": [], "movies": [], "links": ["https://filiperafaeli.substack.com/p/the-day-i-understood-the-good-german", "https://wherearethenumbers.substack.com/p/how-to-create-the-illusion-your-vaccine?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://onlinelibrary.wiley.com/doi/10.1111/jep.13839", "https://www.kgun9.com/news/local-news/tucson/golder-ranch-fire-captain-dies", "https://shahar-26393.medium.com/how-severe-was-the-pandemic-in-europe-658a7f18c669", "https://econpapers.repec.org/paper/waieconwp/22_2f11.htm", "https://brownstone.org/articles/short-term-fatality-rate-in-israel-of-a-third-dose/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://shahar-26393.medium.com/pfizer-vaccine-and-covid-mortality-a-call-for-retraction-of-publications-from-israel-15f5e67e6f7f", "https://brownstone.org/articles/the-censorship-of-covid-science-three-examples/", "https://econpapers.repec.org/paper/waieconwp/22_2f11.htm", "https://brownstone.org/articles/short-term-fatality-rate-in-israel-of-a-third-dose/", "https://medical-dictionary.thefreedictionary.com/Sentinel+event", "https://www.kgun9.com/news/local-news/drexel-heights-fire-member-dies-after-being-taken-to-hospital-for-medical-emergency", "https://www.kgun9.com/news/local-news/tucson-sector-border-patrol-agent-dies-in-line-of-duty", "https://www.kgun9.com/news/local-news/tucson-police-detective-dies-after-being-hospitalized-for-medical-condition", "https://www.kgun9.com/news/local-news/border-patrol-tucson-sector-agent-died-monday-in-line-of-duty", "https://www.kgun9.com/news/local-news/tucson-police-detective-of-15-years-dies-after-medical-issue", "https://www.azcentral.com/story/news/local/phoenix-breaking/2021/09/30/arizona-officers-who-died-line-duty-2019-2020-honored/5926333001/", "https://www.kgun9.com/news/national/coronavirus/three-arizona-police-officers-die-of-covid-19-in-one-week", "https://www.kgun9.com/news/state/chandler-police-officer-loses-battle-to-covid-19", "https://www.kgun9.com/news/coronavirus/casa-grande-police-officer-jesus-chuy-lara-dies-after-battling-covid-19", "https://shahar-26393.medium.com/covid-vax-fatality-what-is-the-rate-419b3fe1b35c", "https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fvote%2Fp%2F419b3fe1b35c&operation=register&redirect=https%3A%2F%2Fshahar-26393.medium.com%2Fcovid-vax-fatality-what-is-the-rate-419b3fe1b35c&user=Eyal+Shahar&userId=7a14afac4b47&source=-----419b3fe1b35c---------------------clap_footer-----------", "https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fvote%2Fp%2F419b3fe1b35c&operation=register&redirect=https%3A%2F%2Fshahar-26393.medium.com%2Fcovid-vax-fatality-what-is-the-rate-419b3fe1b35c&user=Eyal+Shahar&userId=7a14afac4b47&source=-----419b3fe1b35c---------------------clap_footer-----------", "https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fbookmark%2Fp%2F419b3fe1b35c&operation=register&redirect=https%3A%2F%2Fshahar-26393.medium.com%2Fcovid-vax-fatality-what-is-the-rate-419b3fe1b35c&source=--------------------------bookmark_footer-----------", "https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fvote%2Fp%2F419b3fe1b35c&operation=register&redirect=https%3A%2F%2Fshahar-26393.medium.com%2Fcovid-vax-fatality-what-is-the-rate-419b3fe1b35c&user=Eyal+Shahar&userId=7a14afac4b47&source=-----419b3fe1b35c---------------------clap_footer-----------", "https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fvote%2Fp%2F419b3fe1b35c&operation=register&redirect=https%3A%2F%2Fshahar-26393.medium.com%2Fcovid-vax-fatality-what-is-the-rate-419b3fe1b35c&user=Eyal+Shahar&userId=7a14afac4b47&source=-----419b3fe1b35c---------------------clap_footer-----------", "https://dailysceptic.org/tag/adverse-events/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Dr Eyal Shahar"], "publish_date": "2023-04-04T06:00:00+00:00"}