{"result_id": "091014", "URL": "https://dailysceptic.org/2023/04/01/narrative-crumbles-as-doctors-thank-aseem-malhotra-and-angus-dalgleish-for-explaining-how-the-mrna-vaccines-are-injuring-their-patients/", "timestamp": "2023-04-25 14:58:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/01/narrative-crumbles-as-doctors-thank-aseem-malhotra-and-angus-dalgleish-for-explaining-how-the-mrna-vaccines-are-injuring-their-patients/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Narrative Crumbles as Doctors Thank Aseem Malhotra and Angus Dalgleish for Explaining How the mRNA Vaccines Are Injuring Their Patients – The Daily Sceptic", "cleaned_text": "Why is the Government still charging ahead with spring and summer booster Covid vaccines with absolutely no scientific justification?\n\nLast week I applied to attend a Policy Exchange forum on ‘What is the future for vaccines policy?’ with speakers from the U.K. Health Security Agency (Dame Jenny Harries), Government (former Health Secretary Sajid Javid MP), the Royal Pharmaceutical Society (Thorrun Govind) and the British pharmaceutical industry (Susan Rienow), who also happens to be U.K. President for Pfizer. The Policy Exchange is the ‘conservative’ think tank which published A Fresh Shot, The Future of Vaccines Policy in England in December 2022.\n\nI was eager to hear if any revelations were going to be discussed. My application was initially accepted, but after I filled in all my details they must have had second thoughts and the next day I was informed that the event was oversubscribed and I would not be able to attend in person. I was, however, given a link to watch online, where I observed many empty seats.\n\nThe event, even by our current dystopian standards, was quite extraordinary with unbelievable self-congratulatory speeches all confirming the brilliance of the Covid vaccine programme, the plans for spring and summer boosters and how this will be applied to all future threats.\n\nThe five people who were allowed to ask questions were all graduates from the Uriah Heep school of obsequiousness.\n\nThere were no facts, no mention of the side-effects, no seeking any justification for this mass psychotic madness.\n\nJenny Harries spoke with a strange supercilious detachment from reality, never once addressing any negative aspects in spite of the Yellow Card data and statistics of which she must be aware. Susan Rienow reacted like a cartoon figure with dollar signs where her eyes should have been.\n\nThis confirmed that the U.K. Government and its agencies – including so-called think tanks – are in serious and dangerous denial leading to many deaths by medical negligence (you may argue incompetence but the facts are out there so it is negligence, and as some of the 63,500 excess deaths last year were a direct result of unnecessary vaccinations, it is criminal negligence to boot). They are also wasting billions of pounds when NHS time is desperately needed to help those left physically and mentally impaired by the pandemic, let alone the vaccine injuries.\n\nI have argued strongly before that the boosters are not needed at all as the vaccine is still against the Alpha and Delta variants, which have long since left the planet.\n\nThere is no crossover protection as the response is one of classic antigenic sin or immunological imprinting. The Omicron-variant vaccines so beloved of Pfizer and Moderna not only fail to protect from new variants but actively encourage them by Antibody Dependent Enhancement (ADE), which explains why on some data boosted patients are 50% more likely to catch Covid after their vaccination than those who refuse.\n\nI have also pointed out that the booster is worse than no vaccine at all as it induces T-cell suppression and antibody class switching which is why I and my colleagues throughout the world are seeing an explosive rise of cancer relapses in boosted cancer patients. I initially reported my experience in melanoma and lymphoma patients but others are reporting the same in young people, with many different types including colorectal, prostate and very rare tumours, often close to the injection site.\n\nI have been admonished for reporting anecdotes and not doing a proper study which no one will fund, so let’s look at the Government’s own figures released in October last year and ignored. They show that there are more Yellow Cards for Covid vaccines than all the other vaccines over 50 years. The rate of Serious Adverse Events (SAEs) i.e., those which result in death or serious hospitalisation or severe disability ,is 1 in 800 for all vaccines, which the MHRA calls ‘very rare’.\n\nSo let’s look at the effectiveness, i.e. the number of vaccines required to prevent hospitalisations and severe disease requiring intensive care (ITU). For those aged 50-59 the figures are 43,600 boosters required to prevent one hospitalisation and 256,000 to prevent one ITU admission. But at an SAE rate of 1 in 800 there are 321 in ITU with vaccine injuries! The figures for 40-49 are a ludicrous 932,000 and 92,600, with 1,175 in ITU with vaccine injuries. Remember this is for a virus which at its worst killed patients of an average age of 82.\n\nLast weekend cardiologist Dr. Aseem Malhotra and I went to talk to a GP forum in Scotland, where we had been warned there would be severe objections to these dangerous lunatics from England. The expected challenges never happened as doctor after doctor thanked us for explaining the science of why so many of their patients’ lives have been ruined by the vaccines.\n\nAt least we are starting to bring some hard facts into the indefensible mass Stockholm Syndrome event we have had to endure these last three years.\n\nAngus Dalgleish is an expert in immunology and Professor of Oncology at St George’s Hospital Medical School, London. This article first appeared in TCW Defending Freedom", "opengraph": {"locale": "en_GB", "type": "article", "title": "Narrative Crumbles as Doctors Thank Aseem Malhotra and Angus Dalgleish for Explaining How the mRNA Vaccines Are Injuring Their Patients – The Daily Sceptic", "description": "The narrative is crumbling as doctors thank Aseem Malhotra and Angus Dalgleish for explaining how the mRNA vaccines are injuring their patients.", "url": "https://dailysceptic.org/2023/04/01/narrative-crumbles-as-doctors-thank-aseem-malhotra-and-angus-dalgleish-for-explaining-how-the-mrna-vaccines-are-injuring-their-patients/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-01T08:00:00+00:00", "article:modified_time": "2023-04-01T00:01:17+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2022/03/Covid-Vaccine.jpeg", "image:width": "900", "image:height": "610", "image:type": "image/jpeg"}, "tags": ["COVID-19", "Policy Exchange", "Vaccine injury", "Vaccine", "booster"], "tweets": [], "movies": [], "links": ["https://policyexchange.org.uk/publication/a-fresh-shot/", "https://twitter.com/DrAseemMalhotra", "https://www.conservativewoman.co.uk/dystopian-world-of-the-preening-vaccine-mongers/", "https://dailysceptic.org/tag/booster/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/policy-exchange/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Dr Angus Dalgleish"], "publish_date": "2023-04-01T08:00:00+00:00"}