{"result_id": "091003", "URL": "https://dailysceptic.org/2023/04/13/they-deliberately-gave-the-unvaccinated-a-lower-standard-of-care-a-doctor-speaks-out/", "timestamp": "2023-04-25 14:57:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/13/they-deliberately-gave-the-unvaccinated-a-lower-standard-of-care-a-doctor-speaks-out/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "\"They Deliberately Gave the Unvaccinated a Lower Standard of Care\" – a Doctor Speaks Out – The Daily Sceptic", "cleaned_text": "I am a physician who stood against the false narratives swirling around Covid and, for a time, it seemed like I lost.\n\nBefore Covid became a public reality, I was working as a successful trauma surgeon and surgical ICU physician in the hospital that had the first diagnosed Covid case in America. I was working as one of the more senior surgeons of a team of 12 surgeons. The hospital and medical community had already been struggling prior to Covid with various departures from reality with narratives including ‘racism everywhere’ and ‘diversity as long as it supports deviancy’, but it wasn’t appearing to dramatically affect patient care.\n\nIn 2018-2019, I stumbled onto a fraud scheme perpetrated by some of the administrative doctors in our hospital that did cause patient harm, so I reported our hospital administration for fraud. I similarly observed and discovered other connected issues that caused patient harm by various other providers that I tried to bring to light in our hospital. I was ‘rewarded’ with 12 complaints filed against me over a two week period, in retaliation. These complaints accused me of breaches of almost every aspect of professional behavior and ethics. They followed one of the administrators sending out an email asking her colleagues to “get rid of Dr. Miller”. None of these allegations stood (they were all false to begin with), and I continued to do my job to the best of my abilities in this hostile situation, but it became increasingly difficult. Eventually, every single complaint was dismissed as unsubstantiated.\n\nThen, through February and March of 2020, our hospital had a large number of Covid patients including a real upsurge of many sick patients in early March. A couple of weeks later, it hit the news, but only after the virus had passed its inflection point in our hospital and after our healthcare system was not in any threat of having inadequate resources. Things then went completely mad with hype and fear – again, this was after the real infectious surge was passed.\n\nSuddenly, our hospital outcomes and quality data became hidden and opaque to us. Prior to this, almost all data were openly shared and discussed in quality assurance meetings. The hospital forced upon us a narrative that was pure lunacy and contrary to all available observations and previously available data. A chilling example is the following.\n\nI was working a shift in the ICU in late April 2020 and had basically nothing to do because greater than half our beds were empty. We were ‘low censusing’ any nurses willing to go home because there were so few sick patients. I was having a cup of coffee, chatting with the staff and another ICU physician, who was in leadership, when the daily newspaper was delivered. Prior to the paper being delivered, we were all relaxed, jocular and noting how little work we all had. The other ICU physician picked up the local paper where the main headline said, “Local ICU Overwhelmed”. The article was referencing our ICU, as we were the only hospital in the county. He looked at me, started sweating, panicked and said, “What are we going to do? We may not be able to handle this!” I replied with, “Pour another cup of coffee and laugh at the morons writing the paper.” He became visibly distressed and left to call the hospital administration about the situation, who confirmed they were complicit with the newspaper article. This colleague was one of the medical directors of our ICU. Our hospital and ICU were not overfull at the peak number of infections in March 2020. In fact, the ICU was never overfull, even after the horrible protocols that hurt so many patients were established. I knew we were in serious trouble as a medical community when clinical leaders started believing the words in a newspaper and hospital administrators more than their own eyes and experience.\n\nThen, I watched as every policy, practice and quality metric that makes a trauma and surgical programme have good patient outcomes be undermined or abandoned by my colleagues and hospital administration. I filed countless complaints to our quality department for disgusting breaches of care that were now becoming commonplace. I could not turn my back on my oaths taken to advocate for patients. Between mid-2020 and 2021, following a leak of information from the opaque administration, I learned that our unanticipated morbidity and mortality numbers had more than doubled for indexed trauma patients. It was horribly demoralising to watch.\n\nAfter the vaccine was rolled out in late 2020, it became a functional mandate in the broader community, and then definitively mandated by the late summer of 2021. The medical community in the county I was working in (Snohomish, Washington State) started refusing to care for unvaccinated patients except in the hospital setting. I couldn’t believe that patients were banned from accessing basic primary care at first, but then I spoke to a man at my church who was denied both refills of his diabetic medications and treatment for a sinus infection by his primary care provider, all because of his Covid vaccination status. This was so inconceivable that I still didn’t believe it. Even when patients did make it to the hospital, I learned that the physicians and staff in the emergency room were directed to provide a lower tier of medicine to this group of patients. It was less than acceptable, and worse, less dignified, than the care given to any other patients pre- and post- Covid. I had to verify with physician leaders that they approved of this inhumanity. I found out that all the major healthcare systems in the county had agreed to this action, and drove the creation of the policies that demanded physicians act in direct opposition to their oaths. After discovering this, I departed from the medical community in spirit.\n\nWorking with my pastor, we turned our church into a free clinic to care for those ostracised from society. I obtained independent malpractice insurance and we started seeing patients. People were desperate. We didn’t advertise, but there were so many people seeking basic healthcare that we struggled to see everyone. I did my best to see people in their time of need, but it was hard. I was still working in my full-time hospital position. I just didn’t have enough hours in the day. Most of the people I cared for were seen at the church – they were met with maskless smiles, prayer, support and free medical care. Sometimes, people would be waiting in my driveway for me when I arrived home in the early morning after a night shift or late at night after I finished a day shift. What became obvious as the most important thing about our clinic is that our patients needed to be treated as valuable people created in God’s image.\n\nPrior to this experience, I was a seasoned (and hardened) subspecialist with the best reputation one could hope for in the hospitals I worked in. When other doctors, health executives, nurses and local politicians or their families had surgical problems, I was often the one asked to deliver their care even if I wasn’t scheduled to be working. After our health care system abandoned the oaths we took as physicians, I had an identity crisis and pivoted to putting more efforts into the free clinic, caring for the dispossessed patients.\n\nEventually, my work at the free clinic treating unvaccinated patients became known, and the hospital administration learned of it. Subsequently, the real pressure against me started. The hospital responded by opening an investigation of me on synthesised charges of ‘micro-aggression’. There ended up being two separate and independent investigations (one by the hospital, one by my physician group leadership who were working in tandem with the hospital) into my conduct. My colleagues, who months earlier asked for my help and guidance about both professional and personal matters, would no longer return my calls, text messages or emails, or speak to me in public, for fear of being labelled as affiliated with me while in my state of political disfavour. The investigations themselves and the repercussions to my reputation were the punishment. I was treated as guilty, even when proven innocent, by the hospital administration and my colleagues. The investigations eventually exonerated me, my behaviour and my healthcare delivery, but left open the possibility for immediate suspension or termination if I committed a ‘micro-aggression’ in the future. Obviously, this was a no-win scenario for me since micro-aggressions are subjective, undefinable, unprovable and therefore indefensible. I refused to continue working without an independent mediator, so the hospital gladly paid out my contract instead of mediation and restoration.\n\nSeparately during this time I was reported to the State Medical Board by an outpatient pharmacist for prescribing a two-week course of fluvoxamine (an anti-depressant) to help a patient recovering after Covid. This prescription had been banned by the Washington State Medical Association as a treatment for Covid or its repercussions. Incidentally, the patient had a positive response and near complete recovery from her illness, but the pharmacist and WSMA didn’t seem to care about that data point and were apparently just offended that I violated their protocol.\n\nBy March and April of 2022, multiple other clinics in the county began to accept care for most patients, regardless of vaccination status, and so we wound down the free clinic at my church, transitioning people’s care to physicians in established practices who would now agree to deliver appropriate care. As I had been reported to the state (although no formal charges were brought) and I was being pushed out of hospital medicine for practising ethical medicine, I knew it was time to leave Washington State. The message to me was clear: if I stayed, I would have formal investigations that would prohibit me from obtaining a medical licence in another state. My livelihood would be stripped away. So, we sold our homes and boats, liquidated our assets and moved to South Florida in May 2022. I was, and am, bitter at the medical establishment that committed these crimes, so I planned to retire at age 50 with the move and have nothing further to do with the establishment.\n\nHowever, after the hurricane came through Florida in the fall of 2022, I started doing volunteer work for hurricane victims. This included some medical relief work. I realised there is still good that can be done in medicine, that people need healthcare providers, and that by nature, I am a healer.\n\nSo, in February of 2023, I returned to practising medicine and started working as a primary care physician at a holistic clinic where no patient is turned away. I discovered that I enjoy being a family physician, too. I lost my prestigious career and my social position, but I did not lose my ethics or integrity. I did not violate my oaths of practice. So, ultimately, I have won. And I’m happy.\n\nThis post first appeared on the Forgotten Side of Medicine", "opengraph": {"locale": "en_GB", "type": "article", "title": "\"They Deliberately Gave the Unvaccinated a Lower Standard of Care\" – a Doctor Speaks Out – The Daily Sceptic", "description": "When the local medical community started refusing to treat the unvaccinated outside of hospital and only provide a reduced standard of care within it, Dr James Miller knew he had to get out.", "url": "https://dailysceptic.org/2023/04/13/they-deliberately-gave-the-unvaccinated-a-lower-standard-of-care-a-doctor-speaks-out/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-13T08:00:00+00:00", "article:modified_time": "2023-04-12T23:39:06+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/04/doc.png", "image:width": "1192", "image:height": "696", "image:type": "image/png"}, "tags": ["Medicine", "Discrimination", "Vaccine", "Mandatory Vaccines", "Unvaccinated"], "tweets": [], "movies": [], "links": ["https://edition.cnn.com/2020/01/21/health/wuhan-coronavirus-first-us-case-cdc-bn/index.html", "https://amidwesterndoctor.substack.com/p/an-honest-doctors-experiences-on", "https://amidwesterndoctor.substack.com/subscribe", "https://dailysceptic.org/tag/discrimination/", "https://dailysceptic.org/tag/mandatory-vaccines/", "https://dailysceptic.org/tag/medicine/", "https://dailysceptic.org/tag/unvaccinated/", "https://dailysceptic.org/tag/vaccine/"], "authors": ["Dr James Miller"], "publish_date": "2023-04-13T08:00:00+00:00"}