{"result_id": "091022", "URL": "https://dailysceptic.org/2023/04/18/who-pandemic-treaty-gives-tedros-power-to-impose-legally-binding-countermeasures-on-the-world-but-government-doesnt-care/", "timestamp": "2023-04-25 14:58:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/18/who-pandemic-treaty-gives-tedros-power-to-impose-legally-binding-countermeasures-on-the-world-but-government-doesnt-care/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "WHO Pandemic Treaty Gives Tedros Power to Impose Legally Binding Countermeasures on the World, But Government Doesn't Care – The Daily Sceptic", "cleaned_text": "Yesterday in Westminster Hall, MPs debated the Pandemic Prevention, Preparedness and Response: International Agreement. Over 150,000 signed the petition to “not sign any WHO Pandemic Treaty unless it is approved via public referendum”. They don’t want the Government to commit to signing an international treaty unless it is approved through a public referendum.\n\nSteve Brine MP said he was “puzzled by the debate”. We are too.\n\nSo, what is the Treaty about, and should we be concerned?\n\nThe WHO wants member states to negotiate a new international instrument to advance collective action for pandemic prevention, preparedness and response.\n\nIn March 2021, world leaders, including Boris Johnson, announced the need for a treaty to enhance international pandemic cooperation. In October, a WHO working group published a ‘zero draft’ report for consideration by the World Health Assembly (WHA), the WHO’s decision-making body. As a result, the WHA convened a second special session in December, where it established an Intergovernmental Negotiating Body (INB) to draft and negotiate the instrument with a view to its adoption under Article 19 of the WHO Constitution. Article 19 of the WHO’S Constitution gives the WHA the authority to adopt conventions or agreements on any matter within WHO’s competence.\n\nDoes the U.K. support the treaty? Well, Boris Johnson, as Prime Minister, was a signatory. In May 2022, the Government responded to the petition, stating it supported “a new legally-binding instrument.”\n\nGovernment support that is pledged despite not knowing the substance of what is being proposed: the Government supports a new treaty “as part of a cooperative and comprehensive approach to pandemic prevention, preparedness and response”.\n\nThe zero draft for consideration was reported at the fourth INB meeting – known as the WHO CA+. The aim of the CA+ is “a world where pandemics are effectively controlled”. Have we learnt anything about respiratory agents?\n\nOne of the aims of the CA+ is confusing: it states it wants to “achieve universal health coverage”. But, the concept of universal health coverage is based on the 1948 WHO Constitution, which declares health a fundamental human right and commits to ensuring the highest attainable level of health for all – therefore, why should universal coverage be reserved for pandemics?\n\nOne of the primary reasons underpinning the treaty is the “recognition of the catastrophic failure of the international community to show solidarity and equity in response to the coronavirus disease (COVID-19) pandemic”. There’s no need then for vital reflection on how we got it so wrong – it’s not just more of the same; this treaty sets out it will be much more.\n\nCurrently, the negotiating team is looking into the definition, means and procedure for declaring a pandemic, what this means in practice, how to finance pandemic preparedness and response initiatives and the setting up of a new Governing Body for overseeing the treaty.\n\nIt’s not all bad news: manufacturers are well catered for. Article 7(3a) states:\n\nThe petition asks for a referendum to decide whether the treaty will proceed. This isn’t going to happen – once the political will is in place, there’s little to stop the progress unless a block of countries at the WHA objects.\n\nThe issues that concern us are the definition, the costs and the actors.\n\nWe have previously noted the problems with defining a pandemic, and issues with the elusive definition of pandemic influenza have been pointed out as far back as 2011 when the need for any impact on morbidity and mortality was removed. Instead, all you needed was the worldwide spread of a new disease “against which the population has no immunity”.\n\nThere are also no widely accepted definitions for the end of the pandemic – who knows when this one will end?\n\nAs for the costs: Article 19(1c) of the draft report states:\n\nHas anyone considered the cost? Five per cent is roughly £7.5 billion for England and Wales – about half the General Practice budget gone. Any answers on what the XX% of GDP referred to below might add up to are much appreciated.\n\nAs for the actors in all this, there will be many. Global politics is an excellent distractor for domestic problems; the WHO Global Pandemic Supply Chain and Logistics Network will ensure numerous opportunities for industry, and academia will gladly go along with an agenda that promises $XXX funding opportunities. At the centre will be the WHO – primarily a political organisation; it is essential that the past mistakes of the influenza narrative are not repeated.\n\nIn 2010, key scientists advising the WHO on pandemic planning had done paid work for industry that stood to gain from the guidance they authored. Deborah Cohen’s investigation showed that key experts contributing to the plan were conflicted. As a result, the definition of a pandemic was altered, billions of pounds of antivirals were stockpiled, and the WHO’s warning of two billion influenza H1N1 cases never materialised.\n\nThere’s been a lot (rightly) made about this treaty ceding power to an unelected body.\n\nThe treaty will be a legally binding instrument. There may be some downplaying of this when folk realise the implications. However, if a party wants to leave, it can do so at any time within two years from the date the WHO CA+ entered into force. But we will have to give one year’s notice (it’s unclear what happens after two years).\n\nAnd as if you don’t need to be any more concerned, any party may propose amendments to the WHO CA+ that can be adopted by a two-thirds majority vote of the Parties present and voting at the session.\n\nThe INB will submit the treaty for consideration by the 77th World Health Assembly in May 2024. As Esther McVey said, we need “robust debate and an open review” of the plans.\n\nOnce the treaty is in force – to make it relevant and the political effort worthwhile – all you’ll need is another pandemic.\n\nWe do not need to spell out the catastrophic failures of the last three years. For now, just think that the same people are in charge and as our series on the UKHSA ‘evidence base’ for mask mandates shows, they do not care what any of us think.\n\nThis is not a U.K. problem, and we urge our non-U.K. readers to spread the word and, if they agree, our grave concerns.\n\nWe’ll be watching; we’ll keep you posted and keep writing. Somebody somewhere will take notice, perhaps.\n\nDr. Carl Heneghan is the Oxford Professor of Evidence Based Medicine and Dr. Tom Jefferson is an epidemiologist based in Rome who works with Professor Heneghan on the Cochrane Collaboration. This article was first published on their Substack blog, Trust The Evidence , which you can subscribe to here .", "opengraph": {"locale": "en_GB", "type": "article", "title": "WHO Pandemic Treaty Gives Tedros Power to Impose Legally Binding Countermeasures on the World, But Government Doesn't Care – The Daily Sceptic", "description": "The looming WHO pandemic treaty, that would give the Director General power to impose legally binding countermeasures on the world, was debated in Parliament yesterday – but with no sign the Government is concerned.", "url": "https://dailysceptic.org/2023/04/18/who-pandemic-treaty-gives-tedros-power-to-impose-legally-binding-countermeasures-on-the-world-but-government-doesnt-care/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-18T10:28:54+00:00", "article:modified_time": "2023-04-18T10:28:55+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2022/05/mask-WHO-1652556759.6375.jpg", "image:width": "2560", "image:height": "1439", "image:type": "image/jpeg"}, "tags": ["Petition", "COVID-19", "Globalism", "Referendum", "Parliament", "Pandemic treaty", "Lockdown"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"&#x201C;WHO treaty another move to authoritarianism, backed by commercialism&#x201D;  - Prof Carl Heneghan\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/YwCSiahEc94?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/YwCSiahEc94?feature=oembed"}], "links": ["https://hansard.parliament.uk/commons/2023-04-17/debates/12BE683F-A25C-46E5-9FE9-B9C12CCDA9B7/PandemicPreventionPreparednessAndResponseInternationalAgreement", "https://petition.parliament.uk/petitions/614335", "https://commonslibrary.parliament.uk/research-briefings/cbp-9550/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3127275/", "https://www.bma.org.uk/advice-and-support/nhs-delivery-and-workforce/funding/investment-in-general-practice#:~:text=As%20a%20result%2C%20the%20BMA,on%20investment%20in%20general%20practice", "https://www.bmj.com/content/340/bmj.c2912.abstract", "https://hansard.parliament.uk/commons/2023-04-17/debates/12BE683F-A25C-46E5-9FE9-B9C12CCDA9B7/PandemicPreventionPreparednessAndResponseInternationalAgreement", "https://trusttheevidence.substack.com/p/who-treaty-debated-in-uk-parliament", "https://trusttheevidence.substack.com/subscribe", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/globalism/", "https://dailysceptic.org/tag/lockdown/", "https://dailysceptic.org/tag/pandemic-treaty/", "https://dailysceptic.org/tag/parliament/", "https://dailysceptic.org/tag/petition/", "https://dailysceptic.org/tag/referendum/"], "authors": ["Dr Carl Heneghan and Dr Tom Jefferson"], "publish_date": "2023-04-18T10:28:54+00:00"}