{"result_id": "091018", "URL": "https://dailysceptic.org/2023/02/18/what-private-eyes-md-gets-wrong-about-vaccines-and-excess-deaths/", "timestamp": "2023-04-25 14:58:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/02/18/what-private-eyes-md-gets-wrong-about-vaccines-and-excess-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "What Private Eye's MD Gets Wrong About Vaccines and Excess Deaths – The Daily Sceptic", "cleaned_text": "s anonymous ‘MD’ has written an article in the magazine this week about what’s behind the recent excess deaths and whether the vaccines could be involved. For a mainstream piece on the topic it’s unusually polite and balanced – it refrains from any scoffing or offhand dismissal, though naturally rules out vaccines as unlikely.\n\nBecause a piece as considered and reasonable as this rarely appears in the mainstream press I thought it was worth going through it to offer comment on its arguments.\n\nThe doctor opens his article – which is titled ‘Pandemic Update: MD on Excess Deaths and Vaccines‘ – by drawing attention to the ONS’s age standardised mortality rates (ASMRs) for England, which he says “allow fairer comparisons between countries and within them”. Using the ASMR, the crude 6.3% excess for 2022 is slashed to minus-0.7%, though with marked variation throughout the year (e.g. minus-15.9% in January vs 9.4% in December).\n\nAt the we have previously looked at ASMRs in some detail. In brief, the ASMR is a modelled quantity that introduces large adjustments to the raw data using the 2013 European Standard Population to “standardise rates“. These adjustments are based on an assumption about how much a society is ageing and how likely older people are to die which may not be valid in reality. U.K. data for recent years show no clear rise in the crude mortality rate suggesting these large adjustments to the crude death rate are unwarranted. Furthermore, the recent excess deaths are largely from cardiovascular causes rather than diseases of old age such as Alzheimer’s and Parkinson’s, and are also occurring in younger age groups, giving a further indication that the large adjustments for an ageing population are not appropriate.\n\nThe MD also points out that excess deaths in the U.K. were down to just 2% in the week ending January 27th, “coinciding with the waning of the flu season and improvements in emergency response times”. However, the reason excess deaths have been low in January is because the baseline now includes the large Alpha wave of 2021, which raises it by around 1,000 deaths each week. This means that a comparison with the pre-pandemic 2015-19 baseline would show around 1,000 more excess deaths each week, which would seem the more accurate figure and indicate that the excess deaths crisis is not yet over.\n\nThe MD notes that ONS data on death certificates “show just 52 deaths in England and Wales where COVID-19 vaccines were the underlying cause between March 2020 and December 2022”, arguing this is an indication that there are unlikely to be considerably more vaccine deaths than that. However, it’s unclear whether doctors are likely to record the Covid vaccine as an underlying cause of death, particularly where the death occurs some weeks after vaccination owing to a cardiovascular issue. Personally, I’m more surprised that on 52 occasions doctors actually recorded the vaccine as the underlying cause of death, given the controversy around this issue.\n\nNext, MD claims that global data fail to “nail mRNA vaccines as a cause of significant excess deaths”. Since the start of mRNA vaccination, “the unvaccinated have had higher excess death rates per capita than the vaccinated,” he claims. The source for this claim is unclear. Excess deaths are rarely if ever reported by vaccination status; if they were, there would be numerous analyses of these data, but the fact is that governments have generally refused to release these data. However, a recent analysis of local areas of England by vaccination coverage suggests that excess deaths since the vaccine rollout, and especially in 2022, are concentrated in areas with higher vaccine coverage. The following chart illustrates this: it shows the change in excess deaths in the 300-plus local council areas of England between the first Covid wave in 2020 and the 2022 excess deaths, plotted against booster coverage. The reversal in the health outcomes following the vaccine rollout is remarkable. This is not proof of cause but it is certainly consistent with it.\n\nMD then acknowledges that “many countries have had higher excess deaths recently, leading to the hypothesis that over-vaccination with mRNA boosters might be behind it”. He notes, however, that the pattern is not consistent: “Not all the highly mRNA vaccinated countries have a higher age standardised excess of death.” He doesn’t name countries here but in fact almost all countries saw excess deaths in 2022, largely driven by cardiovascular deaths in the elderly and sometimes in younger age groups as well. This includes Sweden, which is sometimes singled out as bucking the trend, but in fact had elevated deaths during the second half of the year.\n\nFor some reason the Human Mortality Database (HMD), which is a commonly-used source, uses a higher baseline for Sweden than Our World in Data so shows lower excess deaths. Nonetheless, even the HMD shows high excess in 75-84 year-olds.\n\nThe MD claims that where there are high excess deaths “there are usually other plausible explanations (e.g. Covid or flu waves, health system pressures, heatwaves, cold winters)”, though doesn’t give examples and this statement seems to beg the question.\n\nHe goes on to claim that “Omicron, it turns out, was only milder if you had vaccine protection”, but this is not true. Omicron was first identified as milder in low-vaccination South Africa and studies have repeatedly shown that it is milder for the unvaccinated as well as the vaccinated. A U.S. CDC study which controlled for vaccination status found Omicron was 91% less deadly. The reason Hong Kong, like most of East Asia, had a rough time with Omicron, having had a much easier ride with earlier variants – which was the opposite of most of the rest of the world, which had a rough time with earlier variants but an easier ride with Omicron – is not really clear. But whatever explains that, the mildness of Omicron outside East Asia is certainly not merely a vaccine effect.\n\n“Many high-risk people have been put off protective boosters and had repeated infections,” he says. However, recent studies have indicated that infections are more likely with additional vaccine doses, not less likely.\n\nMD goes on to argue that in New Zealand, which had no Covid when it rolled out the vaccines in 2021, “excess deaths did not go up and there was no indicator of widespread vaccine harm”. However, what he doesn’t acknowledge is that the reporting rate of adverse events from Covid vaccination in New Zealand was 550 per 100,000 doses, including 31 per 100,000 serious adverse events. This compares to a rate for flu vaccines in 2021 of 30 per 100,000 with three per 100,000 being serious. In other words, serious adverse events with the Covid vaccines in New Zealand were reported at a rate more than 10 times higher than the flu vaccines in 2021.\n\nMD quotes a Cochrane review which found no serious vaccine risks in 41 RCTs, but he does also quote the reanalysis of Pfizer and Moderna clinical trials in which found a risk of serious adverse events (SAE) of one in 800. However, he repeats his claim that “this high rate of early SAEs was not observed in, say, New Zealand’s vaccine rollout”, which as noted is untrue.\n\nHe acknowledges that “if you compare 2022 just to 2019, there appears to be a significant increase in excess cardiac deaths in middle-aged people”. He lists five potential causes: the vaccine – “repeated overstimulation with mRNA boosters is causing immune-mediated cardiac arrests”; missed diagnosis and treatment during the pandemic; the current NHS crisis with its delays in emergency care; lasting effects of Covid; and random variation.\n\nTo counter the idea that it’s the vaccines he points to recent Scandinavian research which shows vaccine myocarditis is “rare” and “much less likely to cause heart failure and death than the myocarditis you can get with Covid”. However, a number of other studies have shown that myocarditis is much more common after the vaccine than after infection, while other studies have found no link between prior COVID-19 and an increased risk of cardiovascular conditions or stroke. Besides which, since the vaccine doesn’t prevent infection the risks are additive rather than alternatives.\n\nMD adds that “you get exposed to far more spike protein from infection than vaccination”. But this fails to recognise that the vaccine enters the bloodstream directly, making systemic effects on the cardiovascular system and other organs more likely, whereas the virus usually enters the body via the respiratory system and its access to the bloodstream is more limited.\n\nIt is welcome that the MD says he “agrees with Malhotra that vaccines, like all drugs, should be voluntary, used wisely and with informed consent” and that “drug companies should make all data for trials for drugs used in humans available, perhaps at secure sites where researchers can access it, and other researchers can see what they’re doing”.\n\nHe ends with a worrying statement: “If [Dr. Aseem] Malhotra and [Andrew] Bridgen are right, we’re doomed: 13.27 billion vaccine doses have been given globally, mainly mRNA, so we could all be ticking time bombs for early cardiac death.”\n\nThe worry is they may well be right – though if everyone would stop taking the boosters that could only help.", "opengraph": {"locale": "en_GB", "type": "article", "title": "What Private Eye's MD Gets Wrong About Vaccines and Excess Deaths – The Daily Sceptic", "description": "Private Eye's MD has written about the Covid vaccines and excess deaths and suggested they're probably not involved. However, his argument, while polite, is full of holes.", "url": "https://dailysceptic.org/2023/02/18/what-private-eyes-md-gets-wrong-about-vaccines-and-excess-deaths/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-02-18T09:00:00+00:00", "article:modified_time": "2023-02-20T12:18:35+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/02/private-eye.png", "image:width": "951", "image:height": "632", "image:type": "image/png"}, "tags": ["Private Eye", "COVID-19", "Omicron", "New Zealand", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/wp-content/uploads/2023/02/Private-Eye-Scan-page-9-No-1592-v2.pdf", "https://dailysceptic.org/wp-content/uploads/2023/02/Private-Eye-Scan-page-9-No-1592-v2.pdf", "https://dailysceptic.org/2023/01/23/2022s-high-mortality-is-real-and-worrying/", "https://dailysceptic.org/2023/02/03/the-alarming-trend-in-core-mortality-since-the-vaccine-rollout/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/monthlymortalityanalysisenglandandwales/december2022", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsregisteredweeklyinenglandandwalesprovisional/weekending3february2023", "https://dailysceptic.org/2023/02/10/higher-excess-deaths-clearly-linked-to-higher-vaccination-rates-in-england-new-analysis-shows/", "https://mpidr.shinyapps.io/stmortality/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?zoomToSelection=true&time=earliest..2022-01-02&facet=none&uniformYAxis=0&pickerSort=asc&pickerMetric=location&hideControls=true&Metric=Excess+mortality+%28%25%29&Interval=Weekly&Relative+to+Population=true&Color+by+test+positivity=false&country=~SWE", "https://dailysceptic.org/2021/12/23/ukhsa-report-confirms-omicron-causes-62-fewer-hospitalisations-than-delta/", "https://www.medrxiv.org/content/10.1101/2022.01.11.22269045v1.full", "https://dailysceptic.org/2022/12/21/covid-infection-risk-increases-with-number-of-vaccine-doses-by-up-to-300-study-finds/", "https://www.medsafe.govt.nz/COVID-19/safety-report-46.asp", "https://www.medsafe.govt.nz/safety/reports-and-promotion/Spontaneous-Reports-Influenza-Vaccination-2021.asp", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://bmjmedicine.bmj.com/content/2/1/e000373", "https://dailysceptic.org/2022/10/27/mrna-vaccines-injure-the-heart-of-all-vaccine-recipients-and-cause-myocarditis-in-up-to-1-in-27-study-finds/", "https://academic.oup.com/ofid/article/10/1/ofac683/6953331", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/new-zealand/", "https://dailysceptic.org/tag/omicron/", "https://dailysceptic.org/tag/private-eye/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Will Jones"], "publish_date": "2023-02-18T09:00:00+00:00"}