{"result_id": "091043", "URL": "https://dailysceptic.org/2023/03/07/doubling-of-hormone-prescriptions-since-2020-raises-fresh-vaccine-concerns/", "timestamp": "2023-04-25 14:58:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/03/07/doubling-of-hormone-prescriptions-since-2020-raises-fresh-vaccine-concerns/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Doubling of Hormone Prescriptions Since 2020 Raises Fresh Vaccine Concerns – The Daily Sceptic", "cleaned_text": "A short while back a friend mentioned in casual conversation that she’d been feeling fatigued for a while and had been referred by her GP to a consultant specialising in endocrine function. I suppose most people might have ignored this, but as it happened, when I got home I had a look at the data for the activity of hospital consultants in this field and had a bit of a surprise.\n\nThe field of endocrinology is all to do with the way hormones in the body work. The chart above suggests that something significant appears to have happened over the past three years. Intrigued, I popped over to the OpenPrescribing website to see if there had been any significant change in the prescription of drugs related to endocrine function. However, examination of these data didn’t highlight any particular problem for common endocrine disorders such as those associated with impairment of the function of the thyroid gland.\n\nThere did, however, appear to be a significant statistical signal for one set of endocrine disorders in the NHS prescription data. While hormones are responsible for regulating a huge number of biological processes in the body, arguably the most common interpretation of the word ‘hormone’ will be with sex hormones. We don’t have data for GP appointments specifically regarding dysregulation of sex hormones, but we can see what drugs they are prescribing – which for women will predominantly mean hormone replacement therapy associated with the menopause.\n\nNote that the above data are specifically for prescriptions related to sex hormone dysregulation (principally HRT), and do not include contraceptive pills (which are also related to sex hormones but are included under a different code in the prescriptions medicines database).\n\nThis also matches up with an increase in prescriptions related to medications for vaginal and vulval conditions, which are also strongly (but not exclusively) related to the menopause.\n\nHas there been a significant rise in women suffering symptoms related to the menopause since the start of 2021? A document issued by the NHS last year on HRT activity in the NHS since 2015 suggests that there was indeed a significant rise in activity that occurred in spring 2021. Figure 2 from that document also indicates that this wasn’t simply more hormones being prescribed, but also that it was affecting substantially more women.\n\nThe NHS document suggests that approximately 500,000 additional women had at least one course of HRT over 2021-2022 compared with 2020-2021, an increase of around one third.\n\nThe odd thing is, there wasn’t any promotion of the NHS document on HRT in the press at the time – it suffered the usual fate of being hidden away in the metaphorical filing cabinet in the basement. This was doubly surprising as there has been considerable research that indicated the vaccines had an impact on menstrual cycles (see this paper for a review), and it is plausible that such dramatic changes might have some impact on the arrival and severity of the menopause. There’s certainly been little outrage in the usual online forums on the potential for the vaccines to impact on female fertility. It is almost as if the Government wanted to make sure that no-one was aware of any changes in fertility that the vaccines might be responsible for. I accept that few women become pregnant when close to their menopause, but there is no doubt that the menopause marks the point where women naturally cease to be fertile, and it is also possible that something that changed the onset of the menopause in women in their late 40s might also impact on fertility of younger women (note that this is supposition – it would be useful if there were some research undertaken to investigate this potential effect, but none seems to have been undertaken despite the reduction in the number of births in the U.K. and other countries over the past 18 months).\n\nIt must be stated that we don’t have information on the age of the individuals being given sex hormones – it is implied that what we’re seeing is more women who reach the menopause are having sufficiently deleterious symptoms to want to take replacement hormones, but there is little evidence to confirm this. It is certainly possible that there has been an increase in the numbers of women reaching the menopause at a younger age, increasing overall prescription levels. As always, we desperately need more information to fully understand what is going on here.\n\nWay back in 2021 I wrote about the strange and dramatic increase in Yellow Card reports on menstrual irregularities that occurred during April of that year. The most plausible explanation for this was that it followed an article on BBC Radio 4’s Woman’s Hour all about post-vaccination menstrual irregularities where the speakers suggested to listeners that they could make a Yellow Card report if they felt that they’d had side effects following their Covid vaccination. I applaud the Woman’s Hour team for highlighting this problem – physiological disorders relating to sexual function are all too often ‘hidden’ and unfortunately it usually takes this type of targeted encouragement in the media to get individuals to come forward and discuss their problems. Perhaps Emma Barnett might now like to revisit the story from way back then and investigate why there’s also been strange and dramatic increase in women taking HRT in the post-vaccine period. Oh, and while they’re there they could also investigate why this significant change in the health of such a large number of our population has been ignored by Government and why there has been no investigation into what might have caused it. They could also ask their audience to send in reports of the age at which they’re experiencing menopausal symptoms, because it looks like this information isn’t going to come from official sources any time soon.\n\nFor completeness, it wasn’t just women that saw changes during that year. Data for males show a smaller, but still significant increase in the prescription of testosterone supplements over the same time period.\n\nIt should be noted that the menopause is a significant event for women and that HRT is very much a known treatment; however, men also suffer from increased sex hormone dysregulation with age, but this problem just isn’t discussed as much as the menopause and changes tend to be much more spread out over multiple years. Are there many more men than indicated in the chart above who might have sex hormone dysregulation and who thus might benefit from some medical intervention but who just don’t know how to interpret the signs?\n\nAs an aside, I don’t like to rely too much on strange internet conspiracy theories but one possible link from the Covid vaccines to sex hormonal dysregulation came to light in a recent sting video featuring a Pfizer employee. In this video the employee claims that he doesn’t understand why Pfizer’s Covid vaccine has had an impact on menstrual cycles and female sex hormones in general. While we should not place too much weight on a single undercover recording, it certainly creaks open a Pandora’s box in terms of who knew what and when…\n\nAmanuensis is an ex-academic and senior Government scientist. He blogs at Bartram’s Folly – subscribe here.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Doubling of Hormone Prescriptions Since 2020 Raises Fresh Vaccine Concerns – The Daily Sceptic", "description": "Prescriptions for hormone treatments such as HRT have doubled since 2020. No explanation has been offered for this, but the vaccines, introduced at the same time, are known to have a strong effect on women's periods.", "url": "https://dailysceptic.org/2023/03/07/doubling-of-hormone-prescriptions-since-2020-raises-fresh-vaccine-concerns/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-03-07T07:00:00+00:00", "article:modified_time": "2023-03-06T18:35:35+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/03/hrt-1.png", "image:width": "1193", "image:height": "787", "image:type": "image/png"}, "tags": ["women", "Side effects", "period", "COVID-19", "Hormones", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://digital.nhs.uk/data-and-information/publications/statistical/provisional-monthly-hospital-episode-statistics-for-admitted-patient-care-outpatient-and-accident-and-emergency-data/april-2022---november-2022", "https://openprescribing.net/", "https://openprescribing.net/bnf/0604/", "https://openprescribing.net/bnf/0702/", "https://nhsbsa-opendata.s3.eu-west-2.amazonaws.com/hrt/hrt_June_2022_v001.html", "https://www.sciencedirect.com/science/article/pii/S1576988722000723", "https://dailysceptic.org/2023/03/04/number-of-births-in-england-falls-by-11-9-in-2022/", "https://bartram.substack.com/p/is-the-yellow-card-database-completely", "mailto:womanshour.yourviews@bbc.co.uk", "https://openprescribing.net/chemical/0604020K0/", "https://rumble.com/v284pgu-pfizer-director-concerned-over-womens-reproductive-heath-after-covid-19-vac.html", "https://bartram.substack.com/", "https://bartram.substack.com/subscribe", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/hormones/", "https://dailysceptic.org/tag/period/", "https://dailysceptic.org/tag/side-effects/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/", "https://dailysceptic.org/tag/women/"], "authors": ["Amanuensis"], "publish_date": "2023-03-07T07:00:00+00:00"}