{"result_id": "091029", "URL": "https://dailysceptic.org/2023/01/13/covid-vaccines-are-obviously-dangerous-and-should-be-halted-immediately-say-senior-swedish-doctors/", "timestamp": "2023-04-25 14:58:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/13/covid-vaccines-are-obviously-dangerous-and-should-be-halted-immediately-say-senior-swedish-doctors/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Covid Vaccines Are \"Obviously Dangerous\" and Should Be Halted Immediately, Say Senior Swedish Doctors – The Daily Sceptic", "cleaned_text": "There follows a public statement by a group of five senior Swedish doctors who, in collaboration with Dr. Johan Eddebo, a researcher in digitalisation and human rights, are raising the alert about the Covid vaccines, which they describe as “obviously dangerous”. They say there should be an “immediate halt” to the mass vaccination pending “thorough investigations” of the true incidence and severity of adverse effects.\n\nThe true character and scope of the harm caused by the unprecedented mass vaccinations for COVID-19 is just now beginning to become clear. Leading scientific journals have finally begun publishing data corroborating what the underground research community has observed over the last two years, especially in relation to complex problems of immune suppression.\n\nTruly concerning numbers pertaining to both births and mortality are also emerging.\n\nAt this moment in time, a new, allegedly super-infectious Omicron variant is all over the headlines. A sub-variant of XXB, this strain is said to possess immune escape capabilities of precisely the type that some independent researchers predicted would follow on the heels of the mass vaccinations’ narrow antigenic fixation.\n\nThe WHO maintains that worldwide, 10,000 people still die due to Covid every single day, an implausible death toll more than ten times that of an average flu. It reiterates the urgent need for vaccinations, especially in light of China’s reopening and allegedly falsified data on mortality and infections.\n\nThe EU has even called an emergency summit in light of the purported Chinese “Covid chaos” that “calls to mind how everything began in Wuhan, three years ago”.\n\nIn Sweden, the Minister for Health and Social Affairs has said he cannot rule out new restrictions, and states that everyone must take “their three doses”, since “only” 85% of the population is ‘fully inoculated’.\n\nThat such an extensive vaccine coverage has not yielded better results after nearly two years is a remarkable fact. Even more so in light of some individuals receiving four or more repeated exposures to the same vaccine antigen, yet still contracting the disease they are supposedly immunised against.\n\nAt the same time, even more ominous warning signs abound.\n\nOne such warning sign is the fact that average mortality in many Western states is still at a remarkably high level, in spite of the direct effects of the coronavirus being marginal for more than a year. Data from EuroMOMO indicate a marked excess mortality in the EU for all of 2022, and the German Bureau of Statistics reports that the country’s mortality in October was more than 19% over the median value of the preceding years.\n\nIs this due to Covid, as the WHO’s ’10 000 per day’ figure would seem to indicate?\n\nBlame is placed at the feet of ‘Long Covid‘ as well as the regular acute infections, but according to the EuroMOMO and Our World in Data stats, the bulk of the excess deaths in Europe during 2022 are actually not due to clinically manifest coronavirus infections.\n\nMoreover, we shouldn’t see continued excess deaths from a respiratory virus of this kind after three years of global exposure due to the inevitable consolidation of natural immunity.\n\nIf such a situation persists, the hypothetical connection to a vaccine-related immunity suppression that just now has come into focus becomes pertinent to investigate in detail.\n\nIf, as has been argued, the vaccinations, and especially the boosters, alter the immune profile of recipients such that Covid infections get ‘tolerated’ by the immune system, it’s possible that vaccinated individuals will tend towards a situation of long-term, repeat infections that do not get cleared, and do not present with obvious symptoms, while still promoting systemic damage.\n\nThe literature now indicates an extensive substitution in the vaccinated of virus-neutralising antibodies for non-inflammatory ones, a ‘class switch’ from antibodies that work towards clearing the virus from our system, to a category of antibodies whose purpose is to desensitise us to irritants and allergens.\n\nThe net effect is that the inflammatory response to Covid infection gets down-regulated (reduced). This means that full-blown infections will present with milder symptoms, and that they won’t get cleared as effectively (partly since fever and inflammation are essential to your body getting rid of a pathogen).\n\nThat these developments alone aren’t cause for an immediate halt to the mass vaccinations, as well as thorough investigations, is astonishing.\n\nThere is of course another, and more well-known, potential partial explanation of the surprising excess mortality. We have indications of clotting disorders connected to the Covid vaccines, evident in a new major Nordic study, while repeated studies evidence a clear correlation between heart disease and Covid vaccination (see Le Vu , Karlstad and Patone ).\n\nA newly published Thai study moreover indicated that almost a third of the vaccinated youth enrolled exhibited cardiovascular manifestations, and a yet unpublished Swiss study suggests that as many as 3% of everyone vaccinated manifest heart muscle damage.\n\nAnd as stated above, we also see signals pertaining to fertility disturbances connected to the Covid vaccines.\n\nAn Israeli study shows impaired motility and sperm concentrations after both Pfizer and Moderna vaccination. The safety committee of the European Medicines Agency has also affirmed that the vaccines may cause menstrual disturbances, and Pfizer’s own studies indicate that the lipid nanoparticles of the mRNA-vaccines cluster in the reproductive organs.\n\nThe hypothesis that COVID-19 vaccinations influence fertility is supported by a significant and unprecedented decline in the Swedish birth rate during the first months of 2022. According to Swedish demographers, the decline is ”surprising”.\n\nThere are similar data from many other Western countries, and to continue the mass vaccinations for low-risk groups such as children or pregnant women is utterly irresponsible – especially since the vaccinations do little or nothing to stop the spread as was initially promised, and is often still falsely maintained.\n\nOne hopes that the hypothesis of a decline in birth rates due to the vaccinations can be falsified through a thorough and independent investigation as soon as possible. The numbers are truly worrying.\n\nYet the fact that Pfizer’s data pertaining to fertility disturbances had been hidden away and needed to be discovered through a FOIA request is typical for the entire situation.\n\nThere’s almost no independent public debate on these issues, and critical perspectives are actively suppressed by the major digital platforms.\n\nPublic watchdogs such as the European Medicines Agency are funded by the pharmaceutical industry and often base their recommendations on Big Pharma’s in-house studies. The independence of our scientific and academic institutions is threatened, and we see a confluence between scientific research, private corporate interests and political and ideological objectives on every level.\n\nTo place a digital filter of censorship on top of all of this, where proprietary algorithms micromanage the flow of information and the public debate in accordance with the intentions of their owners, in practice means to abolish the open democratic society and independent scientific research.\n\nRecent disclosures also show that the digital platforms have actively worked towards suppressing critical perspectives on the Covid policies and the mass vaccinations. Twitter has for this purpose developed clandestine censorship strategies and employed so-called ‘shadowbanning’ with the effect of an almost undetectable suppression of the visibility of posts and accounts connected to undesirable perspectives and analyses. Facebook took down more than seven million posts to influence the debate on Covid only during the second quarter of 2020. YouTube has banned publishing of video material that contains critical perspectives on the Covid vaccinations. Such content is designated ‘misinformation’ and ‘disinformation’ whether or not it is supported by relevant data.\n\nThese kinds of measures have very serious consequences. Digitalisation’s centralised control of the flow of information doesn’t just affect policy on the local and regional level, but also influences the way in which scientific and journalistic work can be designed and carried out. It creates structures that immediately repress heterodox views and silences critical voices through fear and indirect persecution.\n\nPublic trust in our common institutions will inevitably be eroded by this development.\n\nThe open society now desperately needs a renaissance. The democratic and scientific discourses must be rebuilt from the ground up, and in a way which respects the new and unique risks of our contemporary situation, and which protects and emphasises the responsibility of the individual citizen.\n\nKey to this in our current predicament is to press on with critical questions pertaining to the obviously dangerous mass vaccinations and to investigate the corruption of our political and scientific institutions that the Covid situation has shed light on.\n\nIt is critical that we immediately begin to remedy the significant damage that has been rendered to global public health, and to the open society as such.\n\nSture Blomberg, MD, Ph.D, Associate Professor in Anaesthesiology and Intensive Care and former senior physician\n\nSven Román, MD, Child and Adolescent Psychiatrist, since 2015 Consultant Psychiatrist working in Child and Adolescent Psychiatry throughout Sweden\n\nThe authors are members of the bio-medico-legal network of Läkaruppropet. They are organising a conference in Stockholm on January 21st-22nd in conjunction with the Swedish Doctors’ Appeal network. Its main focus will be on the consequences of the global COVID-19 politics and the effects of the Covid vaccines.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Covid Vaccines Are \"Obviously Dangerous\" and Should Be Halted Immediately, Say Senior Swedish Doctors – The Daily Sceptic", "description": "Five senior Swedish doctors are raising the alert about the Covid vaccines, which they call \"obviously dangerous\", and say there should be an \"immediate halt\" to the mass vaccination pending a full investigation.", "url": "https://dailysceptic.org/2023/01/13/covid-vaccines-are-obviously-dangerous-and-should-be-halted-immediately-say-senior-swedish-doctors/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-13T07:00:00+00:00", "article:modified_time": "2023-01-18T11:02:32+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/01/swedenvax.png", "image:width": "1117", "image:height": "752", "image:type": "image/png"}, "tags": ["COVID-19", "Adverse Effects", "Sweden", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9723332/", "https://www.dn.se/varlden/ny-omikronvariant-snart-dominerande-i-usa/", "https://www.eugyppius.com/p/preprint-the-sars-cov-2-delta-variant", "https://www.who.int/publications/m/item/virtual-press-conference-on-global-health-issues-transcript---4-january-2023", "https://www.dn.se/varlden/fortsatt-covidkaos-i-kina-eu-kallar-till-krismote/", "https://www.svd.se/a/bgXLl3/socialministerns-larm-for-fa-ar-fullvaccinerade", "https://www.euromomo.eu/graphs-and-maps", "https://www.destatis.de/EN/Press/2022/11/PE22_480_126.html", "https://time.com/6241420/us-deaths-2022-covid-19/", "https://euromomo.eu/graphs-and-maps", "https://ourworldindata.org/coronavirus", "https://jessicar.substack.com/p/the-immunological-mechanism-of-action", "https://www.science.org/doi/10.1126/sciimmunol.ade2798", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2793348", "https://www.nature.com/articles/s41467-022-31401-5", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2791253", "https://doi.org/10.1161/CIRCULATIONAHA.122.059970", "https://www.mdpi.com/2414-6366/7/8/196", "https://www.unibas.ch/en/News-Events/News/Uni-Research/Temporary-mild-damage-to-heart-muscle-cells-after-Covid-19-booster-vaccination.html", "https://pubmed.ncbi.nlm.nih.gov/35713410/", "https://www.ema.europa.eu/en/news/meeting-highlights-pharmacovigilance-risk-assessment-committee-prac-24-27-october-2022", "https://www.judicialwatch.org/documents/jw-v-hhs-fda-pfizer-biontech-vaccine-prod-3-02418/", "https://www.svt.se/nyheter/inrikes/barnafodandet-i-sverige-minskar-overraskande", "https://www.statista.com/statistics/612074/fertility-rates-in-european-countries/", "https://www.bmj.com/content/376/bmj.o298", "https://news.bloomberglaw.com/health-law-and-business/why-a-judge-ordered-fda-to-release-covid-19-vaccine-data-pronto", "https://www.amazon.com/Illusion-Evidence-Based-Medicine-Exposing-credibility/dp/1743057245", "https://www.thefp.com/p/twitters-secret-blacklists", "https://www.washingtonpost.com/technology/2020/08/11/facebook-covid-misinformation-takedowns/", "https://support.google.com/youtube/answer/11161123?hl=en", "https://lakaruppropet.se/", "https://lakaruppropet.se/2022/12/01/internationell-konferens-om-covidpandemin-pa-stockholm-waterfront-congress-centre-21-22-januari-2023/", "https://dailysceptic.org/tag/adverse-effects/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/sweden/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Dr Johan Eddebo"], "publish_date": "2023-01-13T07:00:00+00:00"}