{"result_id": "091025", "URL": "https://dailysceptic.org/2023/01/12/the-flawed-ons-data-on-deaths-by-vaccination-status-tell-everyone-what-they-want-to-hear/", "timestamp": "2023-04-25 14:58:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/12/the-flawed-ons-data-on-deaths-by-vaccination-status-tell-everyone-what-they-want-to-hear/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "The Flawed ONS Data on Deaths By Vaccination Status Tell Everyone What They Want to Hear – The Daily Sceptic", "cleaned_text": "Noah Carl’s recent article in the “Vaccinating the Elderly Saved Lives” and Will Jones’s piece “Excess Non-Covid Deaths Surge to 30,000 Since April as Deaths in Week Before Christmas Hit 20% Above Average” both highlighted the failure of the ONS or the medical authorities to update the dataset, last published July 6th 2022, that shows deaths by vaccine status. In addition, we’ve had both Neville Hodgkinson and Amanuensis referencing the ONS dataset that includes deaths from January 1st 2021 to May 31st 2022 by vaccine status. Finally, a recent Substack post by analysed these same U.K. data on all-cause deaths by vaccine status.\n\nBut do these data tell us what we think they tell us? We thought readers might find it useful to see the data presented as interactive charts so you can see for yourself. Here are the links to each age-group specific chart: 18-39, 40-49, 50-59, 60-69, 70-79, 80-89, 90+. By clicking on the legend line colour by vaccine status you remove it from the chart, making the chart less busy for ease of comparing the various groups. This article pulls out some of the more interesting points from the data but we would recommend you exploring the charts yourself – once you’ve read the article!\n\nOur view is that the data will confirm whatever prejudice you have. If you want to show that vaccination is pointless the charts can do that, conversely, if you want validation that vaccination saved the nation, well, they can do that too. Let us illustrate.\n\nComparing the red line (deaths of unvaccinated) with the blue line (deaths of people at least 21 days after their ) we can see that the two lines are in lockstep. Conclusion? Vaccination was pointless.\n\nHold your horses! Look at figure 2. Exactly the same dataset for 18-39 year-olds, but this time comparing all-cause mortality of the unvaccinated with those dying at least 21 days after their vaccination. The death rate in the vaccinated shoots up from 68 in February 2021 to 115 in April. While in the unvaccinated the fatality rate drops from 70 in January 2021 to 38 in May. From comparable rates in January and February, the vaccinated appear to be dying at three times the rate by April and May. Conclusion? The vaccines kill you!\n\nHowever, as can be seen in Figure 3, if we look at the relative fatality rate of the unvaccinated with those who died at least 21 days after their vaccination we see that by December 2021, the fatality rate of the unvaccinated was up to 69, while the rate for the double vaccinated plummeted to 29. Conclusion? The vaccines save lives.\n\nAre these huge swings in fatality rate unique to the 18-39 age-cohort? No. Figure 4 is a rather busy chart showing fatality rates for the 80-89 year-olds. Again, we get these huge swings. The unvaccinated’s fatality rate plummets from February 2021 five-fold in three months, while for those with just one shot of vaccine it increases five-fold! However, those having had a second shot (the light green line) stays below the unvaccinated’s rate until October 2021, when it increases four-fold.\n\nPerhaps, though, the most telling line is the dark blue one showing the fatality rate of people at least 21 days after their booster. By May 2022 it was no better than the fatality rate of the unvaccinated.\n\nNow, let us add two caveats that you should bear in mind when looking at these charts:\n• The volatility in the numbers isn’t much down to Covid. Nor, is it much down to vaccines. Covid, even at its peak, only accounted for a relatively small proportion of deaths. Likewise, even if the most apocalyptic soothsayers of vaccine deaths were correct, as overall deaths aren’t up multiple times then the huge swings can’t be ascribed to vaccines either. Rather, it’s down to the condition of the people of vaccinated.\n• Those of you who take a keen interest in the data will recall the ongoing debate about how many people are unvaccinated. The table in Figure 5 comes from a piece by one of us (NR) published in the back in June 2022, though for people wanting greater authority on this matter can I suggest you look at Professor Norman Fenton’s extensive work on this issue. The point is that the ONS has knowingly, though consistently, understated the unvaccinated amongst us. Alternative population data from ‘NIMS’ put the U.K. population far higher – too high, according to the ONS. No one knows what the U.K. population is and so no one knows how many people are unvaccinated. The ONS data should be treated as a ‘worst case’ scenario. So, looking at the red line in each of these charts you can be sure that it’s overstating the fatality rate of the unvaccinated.\n\nComing back to the ONS data, Figure 6 summarises the relative fatality rate of the unvaccinated with the boosted at the end of May 2022. The percentage figures in red show the age cohorts where vaccination seems to have reduced fatalities.\n\nTake your pick. If you’re under 50 or over 90 it would appear that the unvaccinated are less likely to die than the ‘boosted’. If you’re aged 50 to 89 then you would appear to be safer if you’ve had a pile of vaccinations. However, how can this be? If Covid accounts for, say 5% of deaths across these age groups and these months, even if vaccines were 100% effective, we’d only expect to see a 5% variance in all-cause mortality. How could a Covid vaccine produce a swing five or 10 times greater than the background rate of Covid deaths?\n\nWe suspect the answer is that the all-cause mortality tells us something about the profile of people being vaccinated but next-to-nothing about the efficacy of the vaccines themselves. One final chart to illustrate our point using data for the 70-79 age-cohort where we can see fatality rates swing 10-fold between various groups.\n\nThe grey line appears to show the single vaccinated starting to die at an alarmingly high rate, possibly as those well enough to get jabbed a second time move into a different category leaving the vulnerable and close to death behind. Later on, from about October 2021, we see the light green line shoot up; again, this may be as those well enough to receive a booster leave the vulnerable behind. Alternatively, it may be owing to misclassification issues around vaccinated deaths, as Professor Norman Fenton has discussed.\n\nIf the ONS does ever issue an update to the May data, as it has said it intends to (we’ll believe it when we see it), our advice is: treat all conclusions and analysis with caution, as they may just be reinforcing the prejudices of the author.", "opengraph": {"locale": "en_GB", "type": "article", "title": "The Flawed ONS Data on Deaths By Vaccination Status Tell Everyone What They Want to Hear – The Daily Sceptic", "description": "The ONS data on deaths by vaccination status are so flawed that they can be interpreted as telling everyone on all sides of the debate what they want to hear, say Nick Rendell and David Hawkins.", "url": "https://dailysceptic.org/2023/01/12/the-flawed-ons-data-on-deaths-by-vaccination-status-tell-everyone-what-they-want-to-hear/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-12T09:00:00+00:00", "article:modified_time": "2023-01-12T02:05:33+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2022/03/science.png", "image:width": "1129", "image:height": "746", "image:type": "image/png"}, "tags": ["ONS", "Vaccine efficacy", "COVID-19", "Norman Fenton", "All-Cause Mortality", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2023/01/06/vaccinating-the-elderly-saved-lives/", "https://dailysceptic.org/2023/01/05/excess-non-covid-deaths-surge-to-30000-since-april-as-deaths-in-week-before-christmas-hit-20-above-average/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://dailysceptic.org/2023/01/09/dramatic-figures-link-more-covid-jabs-with-more-covid/", "https://dailysceptic.org/2022/12/26/the-government-vaccine-reports-that-inadvertently-told-the-truth-about-vaccine-failure/", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://boriquagato.substack.com/p/uk-age-stratified-all-cause-death", "https://rpubs.com/DavidHawkins/989140", "https://rpubs.com/DavidHawkins/989139", "https://rpubs.com/DavidHawkins/989138", "https://rpubs.com/DavidHawkins/989137", "https://rpubs.com/DavidHawkins/989136", "https://rpubs.com/DavidHawkins/989133", "https://rpubs.com/DavidHawkins/989132", "https://dailysceptic.org/archive/negative-vaccine-effectiveness-the-fact-checks-were-wrong-last-autumn-and-theyre-even-more-wrong-now/", "https://www.normanfenton.com/post/the-ons-data-on-vaccine-mortality-is-not-fit-for-purpose", "https://www.researchgate.net/publication/365202828_What_the_ONS_Mortality_Covid-19_Surveillance_Data_can_tell_us_about_Vaccine_Safety_and_Efficacy", "https://twitter.com/SarahCaul_ONS/status/1613163030417743872", "https://dailysceptic.org/tag/all-cause-mortality/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/norman-fenton/", "https://dailysceptic.org/tag/ons/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-efficacy/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Nick Rendell and David Hawkins"], "publish_date": "2023-01-12T09:00:00+00:00"}