{"result_id": "092007", "URL": "https://www.darkjournalist.com/s-bruce3.php", "timestamp": "2023-04-25 14:58:14 CEST+0200", "meta": {"description": "Dark Journalist Interviews author Alexandra Bruce and Dr. Robin Falkov", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.darkjournalist.com/s-bruce3.php", "encoding": "utf-8"}, "image": null, "domain": "www.darkjournalist.com", "title": "Alexandra Bruce and Dr. Robin Falkov - Hacked Election FIRESIGN Wildcard Special Report - Dark Journalist", "cleaned_text": "Election 2016 Special Report\n\n Dark Journalist Election 2016 Special Report\n\n In this fascinating deep analysis of trends and wildcardsin the 2016 election, Dark Journalist Daniel Liszt welcomes two powerful voices in Alternative Media, Influential Author and Publisher of the popular website Forbidden Knowledge TV Alexandra Bruce and Health Freedom Innovator Dr. Robin Falkov of Event Horizons Radio. \n\n\n\n Hacked Election\n\n In the first segment Alexandra Bruce breaks down the implications of revealing and damaging leaks that are having a huge impact on the 2016 Presidential Race between Donald Trump and Hillary Clinton. Wikileaks, Anonymous, KimDotCom, DC Leaks and other computer hacking groups have brought a tremendous level of transparency to the public in response to a Corporate Media Firewall of disinformation and brainwashing propaganda. The leaks have demonstrated a level of political corruption that has never been seen before!\n\n\n\n FIRESIGN Event\n\n Among all of the powerful leaks that have been released a mysterious and controversial document called the Benenson FIRESIGN Salvage Report shows a major Clinton Strategist running through scenarios to save the election for Clinton from the major turnout of Trump Supporters set to dominate this election The options include a staged Mass UFO wave sighting to distract and confuse the public on election day and throw the results into chaos. The advanced Low Frequency Brainwave Entrainment Laser Technology that would be utilized and deployed is Top Secret Hologram technology that has been tested in the theater of Middle East military operations where religious images were projected on the battlefield to cause large scale defections and surrender of enemy soldiers.\n\n\n\n Trump Ascendancy\n\n In the second part Dr. Robin Falkov reveals that the Trump presidency may be the last chance for America to wrestle control back from a variety of special interests that have a Transhumanist agenda that includes Common Core, Open Borders, Mandated Vaccines, The TransPacific Partnership, and the Centralization of Power via a powerful Artificial Intelligence Global Control Grid.\n\n\n\n Powerful, informative, eye opening and unnerving. Don't miss this fascinating Dark Journalist Special Report on Election 2016.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Dark Journalist"], "publish_date": null}