{"result_id": "092001", "URL": "https://www.darkjournalist.com/s-fitts11.php", "timestamp": "2023-04-25 14:58:10 CEST+0200", "meta": {"description": "Dark Journalist Interviews Former Assistant Housing Secretary Catherine Austin FItts on Transhumanist Depopulation and The 2016 Presidential Election...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.darkjournalist.com/s-fitts11.php", "encoding": "utf-8"}, "image": null, "domain": "www.darkjournalist.com", "title": "Catherine Austin Fitts - Matrix Reality and Elite Endgame - Dark Journalist", "cleaned_text": "Deep State Transhumanist Agenda in 2016 Political Race\n\n The Global Control Grid\n\n Join Dark Journalist for the exciting Part Two Interview of his deep discussion with Former Assistant Housing Secretary and Financial Expert Catherine Austin Fitts. In this fascinating episode Dark Journalist and Former Assistant Housing Secretary Catherine Austin Fitts explore the Transhumanist agenda that covert forces are pursuing to install a global control grid. Is the elite endgame a dismantling of the constitution and a major play for complete dominance by the use of suborbital platforms using invasive satellite surveillance technology? \n\n\n\n Transhumanist Depopulation Agenda \n\n Fitts arrives at the conclusion that the transhumanist depopulation agenda extends to mandated vaccines that are linked to autism and the creation of shadow financial system that is engaged in a 'War on Cash' and is focused on drawing the public into a control system under the nebulous title 'The Internet of Things'. \n\n\n\n The gradual development of this centralization is reaching a crescendo as the 2016 Presidential contest enters a crucial phase and Neocon Democrat Hillary Clinton attempts to consolidate the Deep State around her candidacy against upstart casino billionaire and TV star Donald Trump. \n\n\n\n Shocking, unnerving, informative and inspiring, this is the Dark Journalist episode you need to see to stay one step ahead of the world!\n\n\n\n Watch Part 1 Here", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["s-fitts10.php"], "authors": ["Dark Journalist"], "publish_date": null}