{"result_id": "092006", "URL": "https://www.darkjournalist.com/rpt-deeppolitics.php", "timestamp": "2023-04-25 14:58:13 CEST+0200", "meta": {"description": "Dark Journalist reports on controversial subjects like Deep Politics, Economy, Media cover-ups, UFOs, The Secret Space Program, The Breakaway Civilization, Advanced Technology and more...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.darkjournalist.com/rpt-deeppolitics.php", "encoding": "utf-8"}, "image": null, "domain": "www.darkjournalist.com", "title": "Dark Journalist: Deep Politics, Deep State, JFK Assassination, False Flags, Media Cover-ups, Jim Marrs, Peter Dale Scott, Dick Russell", "cleaned_text": "In this historic Dark Journalist episode, he welcomes Watergate Lawyer Douglas Caddy. Caddy is well-known for being the Attorney of the Watergate burglars who mysteriously broke into the Democratic National Committee. He also represented Texas businessman Billy Sol Estes in his bid to expose the lurid details of LBJ’s participation in the JFK Assassination. Caddy was close personal friends with ultra CIA insider and agent E. Howard Hunt. In their final meeting Hunt shared never before heard details of the JFK Assassination with Caddy. In a bombshell twist, Hunt then revealed that JFK was killed for his attempts to expose the reality of the Alien Presence.\n\nIn this exciting and revealing special two hour Dark Journalist episode he welcomes University of California, Berkeley Professor and Former Canadian Diplomat Peter Dale Scott. Professor Scott has just released his controversial new book \"The American Deep State,\" which exposes the truth about covert forces that constitute an unelected, unaccountable, shadow government. The \"Deep State,\" a concept that Professor Scott created over decades of research, posits that a secret system operates alongside the public state for control and profit.\n\nJoin Dark Journalist and his special guest Best-Selling Author Jim Marrs as they investigate the deep events of the last 75 years, including strange parallels between 9/11 and Pearl Harbor, and find a rising, insidious influence of a new Fourth Reich! By exposing major inconsistencies in the official story of 9/11 with new evidence and testimony, Jim Marrs carefully tracks the forces behind this historic False Flag event in stunning detail to bring us face to face with the reality of a Globalist Dictatorship.\n\nIn this special episode, Dark Journalist is joined by best-selling author Dick Russell, who co-authored several volumes on American conspiracy with Jesse Ventura and also wrote the ultimate classic volume on the JFK Assassination, \"The Man Who Knew Too Much.\" In this rare, exclusive interview, Russell recounts tracking down retired CIA agent and super spy Richard Case Nagell. Nagell told Russell that he became an intelligence triple agent and walked into the key plotters in the JFK assassination!\n\nJoin Dark Journalist as he welcomes best-selling author, political insider, and presidential advisor to Presidents Nixon and Reagan, Roger Stone. Together, they dive deep into the secret history and controversial new evidence of LBJ's involvement in the Kennedy Assassination! Find out all of the shocking details that were covered up and learn about the real covert forces behind the tragic event that changed history. As a bonus there is a clip of a fingerprint expert who says that the fingerprint found on the 6th floor of the TSBD was of convicted LBJ hitman Malcom Wallace!\n\nJoin Dark Journalist and Best-Selling author Jim Marrs as they explore the fascinating layers of intrigue and deep politics in the JFK Assassination. Covert operations, Oswald doubles, Z-film tampering, Dealey Plaza tramps and intel agents, coup D'etat and JFK coverup are just a preview of this stunning examination of the real reasons behind the historic tragedy. Experience Jim Marrs uncensored, on the record, and completely unleashed in this no-holds -barred interview with Dark Journalist. After viewing this you may never look at history the same way again!\n\nDark Journalist and retired NBC Network TV producer/director John Barbour revisit the Lost Jim Garrison Documentary \"The Garrison Tapes.\" The film chronicles the electrifying trial prosecuted by New Orleans District Attorney Jim Garrison in the JFK murder. Special clips of interviews with Jim Garrison from the documentary are included with commentary from director John Barbour on how he came to know and admire the legendary DA. Plus shocking revelations and highlights of the event that changed the world!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["s-caddy.php", "s-scott.php", "s-scott.php", "s-marrs2.php", "s-marrs2.php", "s-russell1.php", "s-russell1.php", "s-stone.php", "s-stone.php", "s-marrs.php", "s-marrs.php", "documentaries.php", "documentaries.php", "s-barbour.php", "s-barbour.php", "rpt-breakaway.php", "rpt-deeppolitics.php", "rpt-ufo.php", "rpt-darkeconomy.php", "rpt-media.php", "s-subscribe.php", "newsletter.php", "s-subscribe.php", "s-howe.php", "s-howe.php", "s-fitts5.php", "s-fitts5.php", "s-hellyer.php", "s-hellyer.php", "http://www.darkjournalist.com/s-marrs2.php", "s-marrs2.php", "rpt-breakaway.php", "rpt-breakaway.php", "reports.php", "reports.php", "http://www.darkjournalist.com/intv-darkjournalist.php", "http://www.youtube.com/darkjournalist", "http://www.facebook.com/darkjournalist", "https://www.twitter.com/darkjournalist", "https://www.reddit.com/r/UFOs/comments/3f77fg/im_dark_journalist_ama/?sort=old", "https://www.reddit.com/r/conspiracy/comments/32ud1r/im_dark_journalist_ama/?sort=old", "http://sarahwestall.com/the-secret-space-program-trillions-to-the-black-budget-and-the-upcoming-secret-space-conference/", "https://www.earthfiles.com/news.php?ID=2334&category=Environment", "http://information-machine.blogspot.com/2015/05/linda-moulton-howe-et-survival-ufo-time.html", "http://investmentwatchblog.com/bankster-secrets-former-goldman-sachs-nomi-prins-tells-all-dark-journalist/", "http://popularliberty.com/1029/dark-journalist-pole-shift-gmo-mind-control-nanotechnology-dr-richard-alan-miller", "http://www.educatinghumanity.com/2015/03/government-conspiracy-and-cover-up.html", "http://projectavalon.net/forum4/showthread.php?80676-Dark-Journalist-Economic-Crashup-Black-Budget-Goes-Global\n\t\t", "http://www.educatinghumanity.com/2015/01/interview-dark-jounalist-stanton-friedman.html", "http://thefreedomreport.us/jim-marrs-false-flag-events-911-the-fourth-reich-dark-journalist/", "http://thedailycoin.org/?p=10829#sthash.2cUTCzxt.dpbs", "http://projectavalon.net/forum4/showthread.php?76283-Joseph-Farrell-Dark-Journalist-UFOs-And-The-Breakaway-Security-State-Black...", "http://gizadeathstar.com/2014/10/interview-dark-journalist", "https://solari.com/blog/catherine-austin-fitts-economic-fascism-dark-journalist/", "http://www.educatinghumanity.com/2013/09/richard-dolan-ufos-breakaway-civilization.html"], "authors": ["Dark Journalist"], "publish_date": null}