{"result_id": "092004", "URL": "https://darkjournalist.com/intv-marrs.php", "timestamp": "2023-04-25 14:58:12 CEST+0200", "meta": {"description": "Dark Journalist reports on controversial subjects like Deep Politics, Economy, Media cover-ups, UFOs, The Secret Space Program, The Breakaway Civilization, Advanced Technology and more...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://darkjournalist.com/intv-marrs.php", "encoding": "utf-8"}, "image": null, "domain": "darkjournalist.com", "title": "Dark Journalist: Interviews with Jim Marrs", "cleaned_text": "Dark Journalist takes a daring look into the rise of covert forces that comprise the \"Deep State\" sometimes referred to as the \"The Breakaway Civilization\" and exposes hidden information on how they exert influence on our world. In-depth analysis and compelling interviews with amazing guests like best-selling author Jim Marrs, Coast to Coast AM Investigative Reporter Linda Moulton Howe, Dr. Katherine Albrecht, Dr. Joseph Farrell, financial expert Catherine Austin Fitts and more! Enjoy fascinating topics such as deep politics, covert finance, UFOs, advanced technology, media manipulation, mind control and more! If you were looking for the cutting-edge of journalism, you've found it!\n\nIn this special Dark Journalist episode he welcomes back Bestselling author of Alien Agenda Jim Marrs for a fascinating rundown of his latest cutting edge research on UFOs, Remote Viewing, Stargates. Genetic Engineering and Alien DNA. Marrs reveals his 20 year investigation into the shadowy Black Ops world of Psychic Spies, Remote Viewers, UFO Encounters and Government Cover-ups of advanced technology reverse-engineered from ET craft. Some controversial Remote Viewing reveals that there are ET-controlled UFO bases on Earth, located in four very remote places.\n\nIn this special episode Dark Journalist welcomes back Best-Selling Jim Marrs for his third appearance on the show. Jim lays out the case in this deep interview that corporate overlords are employing methods of depopulation to fulfill their plan for dominating the world and creating a permanent slave class out of the citizens! From GMOs, Fracking, Geoengineering, Pharmaceutical Addiction, Vaccines and Media Control, Jim examines the situation of America in 2015 and what the Globalist Forces have in store for the unaware public. They also get down to the real facts behind the massive military exercise known as Jade Helm!\n\nJoin Dark Journalist and best-selling author Jim Marrs as they explore the fascinating layers of intrigue and deep politics in the JFK Assassination. Covert operations, Oswald doubles, Z-film tampering, Dealey Plaza tramps, intel agents, Oswald exhumation, Jim Garrison trial, House Assassination Commmitee, triangulated crossfire, and coup D'etat are just a preview of this stunning examination of the real reasons behind the tragedy. Experience Jim Marrs uncensored with Dark Journalist. After viewing this you may never look at history the same way!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["s-marrs4.php", "s-marrs3.php", "s-marrs2.php", "s-marrs4.php", "s-marrs4.php", "s-marrs3.php", "s-marrs3.php", "s-marrs2.php", "s-marrs2.php", "s-marrs.php", "s-marrs.php"], "authors": ["Dark Journalist"], "publish_date": null}