{"result_id": "092005", "URL": "https://www.darkjournalist.com/s-bruce.php", "timestamp": "2023-04-25 14:58:13 CEST+0200", "meta": {"description": "Dark Journalist Interviews Author and Publisher Alexnadra Bruce on the Rise of Alternative Media...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.darkjournalist.com/s-bruce.php", "encoding": "utf-8"}, "image": null, "domain": "www.darkjournalist.com", "title": "Alexandra Bruce - Media Mind Control and Forbidden Knowledge TV - Dark Journalist", "cleaned_text": "Vaccine Controversy and Deaths of Holistic MDs\n\n In this fascinating part 1 episode Dark Journalist Daniel Liszt interviews author and publisher Alexandra Bruce on pervasive Media Mind Control and the various entrainment processes they use to shape public opinion and manipulate the public narrative for social engineering in 2016. Forbidden Knowledge TV\n\n Alexandra, a Brown University graduate, former MTV producer and independent filmmaker is the publisher of the popular ForbiddenKnowledgeTV.net website that acts as an open source video network and features her unique and incisive writing style that explores eclectic themes like Deep State Politics, Alternative Healing, Free Energy, UFO Technology, Directed Energy Weapons, HAARP Weather Manipulation and more! \n\n\n\n Controversial Topics\n\n Together they explore the layers of social unrest being generated by covert forces using hot button political issues, false flag events and divisive tactics to shape the narrative of a top down, centralizing authority providing new security solutions. They expose the push for mandatory vaccines by dangerous Pharmaceutical Corporations using puppet politicians to enact the unconstitutional SB277 law ratified in California recently that removes the religious exemption, infringing the rights and separation of powers between Church and State. \n\n\n\n They also reveal the strange pattern of deaths of Holistic Doctors associated with research on alternative cures for cancer and uncover the real facts behind the movie 'Vaxxed' being pulled from several film festivals because of the devastating revelations of CDC whistleblower Dr. William Thompson of a coverup being orchestrated by high officials.\n\n\n\n Heal For Free: Edgar Mitchell\n\n In this deep interview they discuss how Alexandra recently produced the breakthrough alternative health documentary 'Heal For Free' based on a newly-understood technique to ground with the Earth, which was found to reduce inflammatory disease in 95% of people studied in a University of Florida (Gainesville).\n\n\n\n The film contains the last major interview with Astronaut Dr. Edgar Mitchell who died recently, but left behind stunning testimony on his knowledge of the UFO issue and his belief that we need to bring and end to the obfuscation and wall of secrecy around this vital subject. As a special surprise for viewers Alexandra reveals for the first time her own compelling UFO sighting experiences in Brazil! \n\n\n\n Informative, groundbreaking, shocking and unnerving, you don’t want to miss this special Dark Journalist Episode!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Dark Journalist"], "publish_date": null}