{"result_id": "092008", "URL": "https://www.darkjournalist.com/s-fitts12.php", "timestamp": "2023-04-25 14:58:14 CEST+0200", "meta": {"description": "Dark Journalist Interviews Former Assistant Housing Secretary Catherine Austin Fitts on Her Endorsement of Presidential Candidate Donald Trump...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.darkjournalist.com/s-fitts12.php", "encoding": "utf-8"}, "image": null, "domain": "www.darkjournalist.com", "title": "Catherine Austin Fitts - Donald Trump For President - Dark Journalist", "cleaned_text": "Catherine Austin Fitts Endorses Donald Trump\n\n In this powerful and groundbreaking episode Dark Journalist Daniel Liszt welcomes back Former Assistant HUD Secretary Catherine Austin Fitts. Secretary Fitts announces that she is endorsing Donald Trump for President because she thinks he will deliver real change as opposed to the disastrous rise of Transhumanism lurking in the insidious campaign of 'Media Anointed\" Neocon Democrat Hillary Clinton. \n\n\n\n Human vs. Inhuman\n\n Fitts sees the choice in this election as Human vs. Inhuman in terms of the direction the United States and the emerging Transhumanist policies of Mandated Vaccines, Economic Harvesting, Common Core, Chemtrail Spraying, Geoengineering, ObamaCare, Corporate Takeover of Education, Rise of Artificial Intelligence, and the Centralization of Power by major corporations. She sees Donald Trump as the candidate that represents the best interests of humanity because of his background in business and his understanding of the economy and most importantly the transparency his campaign has brought to this election. \n\n\n\n 2016 Presidential Election\n\n Join Dark Journalist for this exciting interview as Catherine Austin breaks down what's at stake in this 2016 Presidential Election terms of the Black Budget, The Deep State and the looming danger of a Global Corporate Technocracy with designs on Worldwide domination. Will it be Human or Inhuman? That is the question all Americans need to answer on November 8th in this pivotal election year!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Dark Journalist"], "publish_date": null}