{"result_id": "093038", "URL": "https://davidicke.com/tag/vaccine/", "timestamp": "2023-04-25 14:58:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/tag/vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Court Orders Merck to Turn Over Gardasil Adverse Event Databases", "cleaned_text": "All of David Icke's premium content, as well as a wide range of films and series are now available on Ickonic - subscribe today to receive full access.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2020/06/shutterstock_1506051596-e1591776336913.jpg", "image:width": "900", "image:height": "599", "url": "https://davidicke.com/2023/04/04/court-orders-merck-to-turn-over-gardasil-adverse-event-databases/", "description": "\r\n\r\nA North Carolina district court ordered Merck to turn over all of its Gardasil adverse events databases to plaintiffs suing the pharmaceutical giant for injuries allegedly caused by the human papillomavirus (HPV) vaccine.\r\n\r\nThe databases, which include information from the Merck Adverse Event Reporting and Review System (MARRS) — Merck’s version of the Vaccine Adverse Event Reporting System (VAERS) — should contain all of the reports pertaining to Gardasil adverse events submitted by physicians, patients and publications, plaintiffs’ attorney Michael Baum told The Defender.\r\n\r\nIn his March 20 order, U.S. District Judge Robert J. Conrad, Jr., said, “Plaintiffs’ and their experts should have the same opportunity as Merck to review and analyze the entirety of the data.”\r\n\r\nMerck until now has refused to make the entire MARRS databases available to the plaintiffs’ attorneys.\r\n\r\nGardasil is a widely used vaccine commonly administered to teens and young adults before they are sexually active to protect against HPV infections, which can be sexually transmitted later in life.\r\n\r\nHPV infections may lead to the development of cervical cancer. However, most infections are benign and resolve on their own.\r\n\r\nThe firm Baum Hedlund Aristei & Goldman and Robert F. Kennedy, Jr., Children’s Health Defensechairman-on-leave, have filed more than two dozen lawsuits on behalf of young people injured by Gardasil, alleging Merck knowingly and fraudulently concealed the vaccine’s risks.\r\n\r\nThe lawsuits are some of the more than 80 pending in the federal court system, and that number is expected to grow. In August 2022, a judicial panel consolidated the lawsuits into a single federal courtroom.\r\n\r\nSome of the signature impacts observed following HPV vaccination — which afflict a number of the plaintiffs — include permanently disabling autoimmune and neurological conditions such aspostural orthostatic tachycardia syndrome (POTS), fibromyalgia and myalgic encephalomyelitis/chronic fatigue syndrome, The Defender Reported.\r\n\r\nRead More: Court Orders Merck to Turn Over Gardasil Adverse Event Databases\r\n\r\n[trap-banner] ", "title": "Court Orders Merck to Turn Over Gardasil Adverse Event Databases"}, "tags": ["Older Posts"], "tweets": [], "movies": [], "links": ["https://ickonic.com/", "https://ickonic.com"], "authors": [], "publish_date": null}