{"result_id": "093011", "URL": "https://davidicke.com/2023/02/05/quebec-based-covid-vaccine-manufacturer-to-halt-all-operations/", "timestamp": "2023-04-25 14:58:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/02/05/quebec-based-covid-vaccine-manufacturer-to-halt-all-operations/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Quebec-Based COVID Vaccine Manufacturer to Halt All Operations", "cleaned_text": "A COVID-19 vaccine manufacturing company in Quebec is set to cease all operations after its owner and sole shareholder decided to pull investments because of “significant changes” in the COVID vaccine-making industry.\n\nMedicago Inc., which is headquartered in Quebec City and was the manufacturer of the plant-based COVID vaccine, Covifenz, announced on Feb. 3 that it will not be receiving any further investments from the Mitsubishi Chemical Group (MCG) and that it will now begin an “orderly wind-up of its business and operations in Canada and in the United States.”\n\nMCG wrote in a statement on Feb. 3 that Medicago had previously been preparing to transition its operations to a “commercial-scale” level.\n\n“However, in light of significant changes to the COVID-19 vaccine landscape since the approval of Covifenz, and after a comprehensive review of the current global demand and market environment for COVID-19 vaccines and Medicago’s challenges in transitioning to commercial-scale production, the Group has determined that it will not pursue the commercialization of Covifenz,” MCG wrote.\n\nRead more: Quebec-Based COVID Vaccine Manufacturer to Halt All Operations", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/02/covid-canada-scaled.jpg", "image": "https://davidicke.com/wp-content/uploads/2023/02/covid-canada-scaled.jpg", "image:width": "2560", "image:height": "1378", "url": "https://davidicke.com/2023/02/05/quebec-based-covid-vaccine-manufacturer-to-halt-all-operations/", "description": "A COVID-19 vaccine manufacturing company in Quebec is set to cease all operations after its owner and sole shareholder decided to pull investments because of “significant changes” in the COVID vaccine-making industry. Medicago Inc., which is headquartered in Quebec City and was the manufacturer of the plant-based COVID vaccine, Covifenz, announced on Feb. 3 that it will not be receiving any [...]", "title": "Quebec-Based COVID Vaccine Manufacturer to Halt All Operations"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/quebec-based-covid-vaccine-manufacturer-to-halt-all-operations_5031544.html?ea_med=desktop_news&ea_src=ai_recommender&ea_cnt=1", "https://shop.davidicke.com/product/perceptions-of-a-renegade-mind-david-icke-coming-soon/", "https://shop.davidicke.com/product/the-answer-by-david-icke/"], "authors": [], "publish_date": null}