{"result_id": "093018", "URL": "https://davidicke.com/2023/04/15/doubled-pregnancy-loss-rate-raised-foetal-abnormality-rate-and-concentration-of-lipid-nanoparticles-in-ovaries-how-could-they-call-this-fake-vaccine-safe/", "timestamp": "2023-04-25 14:58:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/15/doubled-pregnancy-loss-rate-raised-foetal-abnormality-rate-and-concentration-of-lipid-nanoparticles-in-ovaries-how-could-they-call-this-fake-vaccine-safe/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Doubled Pregnancy Loss Rate, Raised Foetal Abnormality Rate and Concentration of Lipid Nanoparticles in Ovaries – How Could They Call This Fake Vaccine ‘Safe’?", "cleaned_text": "The mRNA vaccines were released globally in early 2021 with the slogan ‘safe and effective’. Unusually for a new class of medicine, they were soon recommended by public health authorities for pregnant women. By late 2021, working age women, including those who were pregnant, were being thrown out of employment for not agreeing to be injected. Those who took the mRNA vaccines did so based on trust in health authorities – the assumption being that they would not have been approved if the evidence was not absolutely clear. The role of regulatory agencies was to protect the public and, therefore, if they were approved, the drugs were safe.\n\nRecently, a lengthy vaccine evaluation report sponsored by Pfizer and submitted to the Australian regulator, the Therapeutic Goods Administration (TGA) dated January 2021 was released under a Freedom of Information request. The report contains significant new information that had been supressed by the TGA and by Pfizer itself. Much of this relates directly to the issues of safety in pregnancy and impacts on the fertility of women of child-bearing age. The whole report is important, but four key data points stand out:\n\nThe rapid decline in antibody and T cells in monkeys following a second dose;\n\n Biodistribution studies (previously released in 2021 through an FOI request in Japan);\n\n Data on the impact of fertility outcomes for rats;\n\n Data on foetal abnormalities in rats.\n\n We focus on the last three items as, for the first point, it is enough to quote the report itself: “Antibodies and T cells in monkeys declined quickly over five weeks after the second dose of [Pfizer Covid vaccine] BNT162b2 (V9), raising concerns over long term immunity.” This point indicates that the regulators should have anticipated the rapid decline in efficacy and must have known at the outset that the initial two dose course was unlikely to confer lasting immunity and would, therefore, require multiple repeat doses. This expectation of failure was recently highlighted by Dr. Anthony Fauci, former director at the U.S. NIH.\n\nThe three remaining items should be a major cause for concern with the pharmaceutical regulatory system. The first, as revealed in 2021, involved biodistribution studies of the lipid nanoparticle carrier in rats, using a luciferase enzyme to substitute for the mRNA vaccine. The study demonstrated that the vaccine will travel throughout the body after injection and is found not only at the injection site but in all organs tested, with high concentration in the ovaries, liver, adrenal glands and spleen. Authorities who assured vaccinated people in early 2021 that the vaccine stays in the arm were, as we have known for two years, not being honest.\n\nIn terms of the impact on fertility and foetal abnormalities, the report includes a study of 44 rats and describes two main metrics, the pre-implantation loss rate and the number of abnormalities per foetus (also expressed per litter). In both cases the metrics were significantly higher for vaccinated rats than for unvaccinated rats.\n\nRoughly speaking, the pre-implantation loss ratio compares the estimated number of fertilised ova and the ova implanted in the uterus. The table below is taken from the report itself and clearly shows the loss rate for vaccinated (BNT162b2) is more than double the unvaccinated control group.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/01/vaccines-scaled.jpg", "image": "https://davidicke.com/wp-content/uploads/2023/01/vaccines-scaled.jpg", "image:width": "2560", "image:height": "1707", "url": "https://davidicke.com/2023/04/15/doubled-pregnancy-loss-rate-raised-foetal-abnormality-rate-and-concentration-of-lipid-nanoparticles-in-ovaries-how-could-they-call-this-fake-vaccine-safe/", "description": "The mRNA vaccines were released globally in early 2021 with the slogan ‘safe and effective’. Unusually for a new class of medicine, they were soon recommended by public health authorities for pregnant women. By late 2021, working age women, including those who were pregnant, were being thrown out of employment for not agreeing to be injected. Those who took the mRNA vaccines did so based on [...]", "title": "Doubled Pregnancy Loss Rate, Raised Foetal Abnormality Rate and Concentration of Lipid Nanoparticles in Ovaries – How Could They Call This Fake Vaccine ‘Safe’?"}, "tags": ["MRNA Vaccine", "covid pregnancy", "lipid nano particles", "covid vaccine damage"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2023/04/14/doubled-pregnancy-loss-rate-raised-foetal-abnormality-rate-and-concentration-of-lipid-nanoparticles-in-ovaries-how-could-they-call-this-vaccine-safe/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}