{"result_id": "093023", "URL": "https://davidicke.com/2023/02/23/world-first-vaccine-for-winter-bug-rsv-could-be-rolled-out-by-summer-by-pfizer-psychopaths/", "timestamp": "2023-04-25 14:58:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/02/23/world-first-vaccine-for-winter-bug-rsv-could-be-rolled-out-by-summer-by-pfizer-psychopaths/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "World-first vaccine for winter bug RSV could be rolled out by summer by Pfizer psychopaths", "cleaned_text": "Avaccine to prevent severe cases of the highly contagious respiratory syncytial virus in babies could be coming as soon as August.\n\nPharmaceutical behemoth Pfizer has developed an RSV vaccine that is administered to expectant mothers to confer antibody protection from severe disease to their unborn babies through six months of age.\n\nRSV has been especially acute this winter, plaguing infants and young children with severe lower respiratory infections.\n\nMost children are exposed to RSV before the age of two. Between 58,000 and 80,000 infants are hospitalized with RSV each year and between 100 to 500 will die.\n\nThe virus exploded last fall, sending thousands of children to hospitals. It constituted one part of a ‘tripledemic,’ a term dubbed by scientists to describe the nightmarish scenario of contending with RSV, on top of seasonal flu, and Covid-19.\n\nThe FDA will consider Pfizer’s application to market its vaccine, called RSVpreF, to expectant mothers, endowing their newborns with protection against dangerous infection when they most need it.\n\nPfizer stopped its Phase 3 clinical trial of the shots last fall, concluding that they were both safe and effective.\n\nTheirs was the first to demonstrate that it can protect infants against severe RSV immediately after birth.\n\nThe vaccine was nearly 82 percent effective at preventing severe respiratory infection in infants through their first 90 days of life. In infants through six months old, the shot was 70 percent effective at preventing hospitalization and assisted breathing.\n\nDr Annaliesa Anderson, Senior Vice President and Chief Scientific Officer of Vaccine Research & Development at Pfizer said: ‘If approved, RSVpreF would help protect infants at their first breath from the devastating effects of this infectious disease, which though well-known, has been particularly evident throughout this RSV season.\n\nRead More: World-first vaccine for winter bug RSV could be rolled out by summer", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2022/07/PFIZER-MURDER-IMAGE.jpeg", "image": "https://davidicke.com/wp-content/uploads/2022/07/PFIZER-MURDER-IMAGE.jpeg", "image:width": "900", "image:height": "600", "url": "https://davidicke.com/2023/02/23/world-first-vaccine-for-winter-bug-rsv-could-be-rolled-out-by-summer-by-pfizer-psychopaths/", "description": "Avaccine to prevent severe cases of the highly contagious respiratory syncytial virus in babies could be coming as soon as August. Pharmaceutical behemoth Pfizer has developed an RSV vaccine that is administered to expectant mothers to confer antibody protection from severe disease to their unborn babies through six months of age. RSV has been especially acute this winter, plaguing infants [...]", "title": "World-first vaccine for winter bug RSV could be rolled out by summer by Pfizer psychopaths"}, "tags": ["Pfizer vaccines", "Pfizer"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/pfizer/index.html", "https://www.dailymail.co.uk/health/rsv/index.html", "https://www.dailymail.co.uk/health/article-11570373/Tripledemic-flu-RSV-infection-rates-drop-latest-CDC-report-COVID-rise.html", "https://www.pfizer.com/news/press-release/press-release-detail/us-fda-accepts-biologics-license-application-pfizers", "https://www.msn.com/en-gb/health/other/world-first-vaccine-for-winter-bug-rsv-could-be-rolled-out-by-summer/ar-AA17O3vf?ocid=winp1taskbar&cvid=ff52fa36935c419db16872a86dc9aac5", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}