{"result_id": "093044", "URL": "https://davidicke.com/2023/02/04/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "timestamp": "2023-04-25 14:58:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/02/04/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "94% of Claims to the Government’s Vaccine Injury Payment Scheme Are Rejected, Many Because They Are Not “60% Disabled”. Mark Kerry is One of Them", "cleaned_text": "Mark Kerry was a healthy 48 year-old from Worcestershire, a father of three, grandfather of two and a loving husband to his wife Melanie. Together with Melanie, Mark loved life and lived it to the full, they socialised with friends every weekend, loved to travel and loved holidays.\n\nMark and Melanie run mobile home parks and were heavily impacted in 2020 when the COVID-19 pandemic hit. With the mobile home business being a mixture of residential and holidays, the holiday side was halted when lockdown and heavy restrictions were enforced. As with millions of people worldwide, they found themselves spending most of their time at home.\n\nLike most of us, Mark was eager to get life back to some form of normality and, knowing the business was suffering and being self-employed, the quicker the better.\n\nIn late 2020, nine months into the COVID-19 pandemic, it was announced that a Covid vaccine had been approved and was being rolled out to stop the spread of the virus and save lives, ready for use in December 2020.\n\nThis was exciting news for Mark and Melanie. Their lives and their business had been placed on hold for far too long and they were ready and eager to resume their lives as they were pre-pandemic; the vaccine was the way out. Mark waited patiently for his turn to have his first jab. While waiting, the media was full of stories of how wonderful these vaccines were and that everyone absolutely must get this vaccine. It was suggested if you don’t get the vaccine you are being selfish. The Prime Minister and Cabinet ministers were telling the public daily on TV that everyone must have it, as well as every news channel and road signs everywhere saying the same. GPs were sending letters, flyers were coming through the door, doctors were all over the TV, with some doctors even suggesting the AstraZeneca vaccine was 100% safe and effective. This of course was what we were all hoping for and most of the population believed.\n\nFinally it was Marks turn to have his vaccine. On March 2nd 2021 Mark had his first dose of the AstraZeneca vaccine. Initially everything was fine and Mark seemed to escape the mild flu-like side-effects and aching arm that people were talking about. That was until the evening of March 15th 2021 when Mark had a headache and noticed blood in his urine. Melanie called 111 and they sent them to Worcester hospital. When the doctor examined Mark he noticed that Mark had a rash on his legs and admitted him straight away. Over the next day Mark’s headache got worse and, following some blood tests, it was revealed that Mark’s platelet count was at a very low rate of 14; normal levels would read between 150 and 450, so this in itself was alarming. On top of that results from a brain scan revealed a blood clot on Marks brain known as Cerebral Venous Sinus Thrombosis (CVST).\n\nCVST is a type of rare blood clot that forms in the venous sinuses in your brain. This is a system of veins found between the layers of the dura mater – the tough outer layer of your brain that lies directly under your skull.\n\nThe clot can block the blood in your brain from draining out toward your heart. When this happens, blood cells may break from the pressure, cross the blood-brain barrier and seep into nearby brain tissue. This can cause a haemorrhage, a type of stroke that stems from internal bleeding. CVST can be life-threatening. You need immediate medical attention.\n\nRead More: 94% of Claims to the Government’s Vaccine Injury Payment Scheme Are Rejected, Many Because They Are Not “60% Disabled”. Mark Kerry is One of Them", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/05/VACCINE-DEATHS-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/05/VACCINE-DEATHS-IMAGE.jpg", "image:width": "900", "image:height": "507", "url": "https://davidicke.com/2023/02/04/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "description": "Mark Kerry was a healthy 48 year-old from Worcestershire, a father of three, grandfather of two and a loving husband to his wife Melanie. Together with Melanie, Mark loved life and lived it to the full, they socialised with friends every weekend, loved to travel and loved holidays. Mark and Melanie run mobile home parks and were heavily impacted in 2020 when the COVID-19 pandemic hit. With [...]", "title": "94% of Claims to the Government’s Vaccine Injury Payment Scheme Are Rejected, Many Because They Are Not “60% Disabled”. Mark Kerry is One of Them"}, "tags": ["experiment vaccines", "Covid vaccines", "vaccine"], "tweets": [], "movies": [], "links": ["https://www.webmd.com/dvt/blood-clots", "https://www.webmd.com/brain/picture-of-the-brain", "https://www.webmd.com/stroke/default.htm", "https://www.webmd.com/first-aid/internal-bleeding-causes-signs", "https://pn.bmj.com/content/20/5/356", "https://dailysceptic.org/2023/02/03/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}