{"result_id": "093007", "URL": "https://davidicke.com/2023/04/17/what-effect-do-mrna-vaccines-have-on-human-consciousness/", "timestamp": "2023-04-25 14:58:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/17/what-effect-do-mrna-vaccines-have-on-human-consciousness/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "What effect do mRNA “vaccines” have on human consciousness?", "cleaned_text": "The strategies we are currently employing aren’t working. Appealing to published science, data, rational debate, and ethical responsibility is water off a duck’s back. In fact, the response of governments around the world is to bury data and attack those asking questions.\n\nCould it be the case that the genetic processes induced by covid vaccination have curtailed rational thought and promoted indifference to risk? In short, does mRNA vaccination drill down to the interface between consciousness and genetics – interfering with the very basis of mental clarity and physical health?\n\nn an interview I recorded a couple of weeks ago with Paul Brennan of Reality Check Radio he asked me when I thought the authorities would come to their senses and realise that the“safe and effective” narrative is false. I found myself at a loss for words because I don’t see any indication that it is happening or will anytime soon.\n\nLooking around the world, we see governments doubling down on mRNA vaccination, congratulating each other on their pandemic success (???), controlling the media, and denying their own statistics of unprecedented excess death and vaccine injury. You can’t win an argument without dialogue and rational discussion. We are trying to stop a runaway train without the benefit of brakes.\n\nMore worryingly, risky biotechnology experiments are proliferating. Gain-of-function experiments are continuing like THIS one, which could render the monkeypox virus 1000x more lethal than it currently is, by crossing the current mild version circulating in human populations with a deadly strain currently confined to mice populations. Research to put mRNA vaccines in food is also in progress, funded by Bill Gates.\n\nRead more: What effect do mRNA “vaccines” have on human consciousness?", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/02/moderna-covid-vaccine-singapore-death-feature-800x417-1.jpg", "image": "https://davidicke.com/wp-content/uploads/2023/02/moderna-covid-vaccine-singapore-death-feature-800x417-1.jpg", "image:width": "800", "image:height": "417", "url": "https://davidicke.com/2023/04/17/what-effect-do-mrna-vaccines-have-on-human-consciousness/", "description": "The strategies we are currently employing aren’t working. Appealing to published science, data, rational debate, and ethical responsibility is water off a duck’s back. In fact, the response of governments around the world is to bury data and attack those asking questions. Could it be the case that the genetic processes induced by covid vaccination have curtailed rational thought and promoted [...]", "title": "What effect do mRNA “vaccines” have on human consciousness?"}, "tags": [], "tweets": [], "movies": [], "links": ["https://mobile.twitter.com/R_H_Ebright/status/1641992936874450944", "https://dailyclout.io/renz-missouri-house-testimony-biotech-admits-gates-gmo-factory-food-is-a-gene-therapy/", "https://expose-news.com/2023/04/16/effects-mrna-vaccines-have-on-human-consciousness/", "https://shop.davidicke.com/product/perceptions-of-a-renegade-mind-david-icke-coming-soon/", "https://shop.davidicke.com/product/the-answer-by-david-icke/"], "authors": [], "publish_date": null}