{"result_id": "093042", "URL": "https://davidicke.com/tag/covid-19-vaccine/", "timestamp": "2023-04-25 14:58:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/tag/covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "‘Covid’ Fake Vaccines Must Be Suspended and a Full Inquiry Launched into How They Were Approved, Say Experts", "cleaned_text": "All of David Icke's premium content, as well as a wide range of films and series are now available on Ickonic - subscribe today to receive full access.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/02/moderna-covid-vaccine-singapore-death-feature-800x417-1.jpg", "image:width": "800", "image:height": "417", "url": "https://davidicke.com/2023/04/20/covid-fake-vaccines-must-be-suspended-and-a-full-inquiry-launched-into-how-they-were-approved-say-experts/", "description": "\r\n\r\nCOVID-19 vaccines must be suspended owing to the level of reported injuries and deaths across all age groups and a full inquiry launched into the MHRA, the regulator which approved them, a group of experts has said.\r\n\r\nIn a groundbreaking new report sent to every member of Parliament, the Perseus group – a team of experts from the fields of medicine, pharmaceutical regulation and safety management – has set out in detail the numerous concerns raised by experts globally about the vaccines and the specific concerns about the U.K.’s Medicines and Healthcare products Regulatory Authority (MHRA) responsible for giving them the green light.\r\n\r\n“MHRA announced that it has morphed from ‘watchdog’ to ‘enabler’. Would anyone be concerned if that was said by the Office for Nuclear Regulation, the Civil Aviation Authority or the Defence Safety Regulator,” Perseus group spokesman Nick Hunt said.\r\n\r\nThe evident lack of interest in post-rollout issues with the COVID-19 vaccines was highlighted as particularly shocking.\r\n\r\nBefore the rollout in December 2020 the MHRA promised a rigorous “four-strand proactive vigilance” of Covid vaccine safety. But freedom of information requests have revealed that very little of this work is being done. The single report supplied from the “Targeted Active Monitoring” strand was 15 months old, from August 2021, the report says.\r\n\r\nThe group slams the MHRA for failing to act on problems with the AstraZeneca vaccine for months after many other national regulators suspended and withdrew it for certain age groups. The MHRA also continued to ignore “ever increasing evidence of Covid vaccine risks, notably blood clotting, heart inflammation, neurological conditions, immune downgrading and menstrual disorders”, the report states.\r\n\r\nThe secrecy around Covid vaccines in particular is blasted, with key documents on risks versus benefits that are routinely published for other medicines being absent for Covid vaccines. “This compromised informed consent,” notes the group.\r\n\r\nOther problems include that the MHRA authorised the mRNA products as vaccines, which have lower regulatory requirements, rather than properly classifying them as novel genetic products, and that it failed to identify and address problems with manufacturing and quality control, leading to batch quality problems.\r\n\r\nMore general criticisms of the agency include that it assesses the safety of a medicine relative to its benefit rather than in absolute terms, which the report likens to the Nuclear Regulator saying, “Our nuclear power station is safe because it has fewer contaminated water leaks than other stations”.\r\n\r\nThe regulator also nowhere defines the tolerable rate of fatal and serious side-effects of new medicines, which the report blames for its slowness to act when problems emerge.\r\n\r\nFreedom of information requests also reveal, alarmingly, that the MHRA has no process for investigating Yellow Card reports of adverse events potentially linked to the COVID-19 vaccines or other medicines. This, the report highlights, is just one facet of a broader lack of the kind of robust safety management systems and processes that are standard in other safety critical sectors such as aviation, defence, nuclear, oil and gas and rail. Similarly, freedom of information requests reveal that there has never been a safety audit of MHRA.\r\n\r\nThe report’s findings are damning and expose a regulator not fit for purpose and clearly failing in its basic aim of keeping the public safe from harmful medical products.\r\n\r\nConcerns about the MHRA are nothing new. The 2020 Cumberlege report listed basic safety and governance issues that the Commons Health Select Committee in December 2022 noted with concern were slow in being addressed. But the new Perseus group report lays out in devastating detail for the first time how the MHRA’s longstanding failings have directly impacted on the disastrous rollout of the Covid vaccines.\r\n\r\nThe Perseus group suggests that anyone who shares its concerns could write to his or her MP to ask if they have read the report and what they intend to do. Other suggested actions include signing the petition to “Launch a Public Inquiry into the approval process for COVID-19 vaccines” and signing the open letter to the Health Secretary organised by the Together Declaration.\r\n\r\nRead More: Covid Vaccines Must Be Suspended and a Full Inquiry Launched\r\n\r\n[trap-banner]", "title": "‘Covid’ Fake Vaccines Must Be Suspended and a Full Inquiry Launched into How They Were Approved, Say Experts"}, "tags": ["Older Posts"], "tweets": [], "movies": [], "links": ["https://ickonic.com/", "https://ickonic.com"], "authors": [], "publish_date": null}