{"result_id": "093048", "URL": "https://davidicke.com/2021/04/16/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "timestamp": "2023-04-25 14:58:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2021/04/16/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Study: mRNA-Based Vaccines And The Risk Of Prion Disease", "cleaned_text": "Vaccines have been found to cause a host of chronic, late developing adverse events. Some adverse events like type 1 diabetes may not occur until 3-4 years after a vaccine is administered [1]. In the example of type 1 diabetes the frequency of cases of adverse events may surpass the frequency of cases of severe infectious disease the vaccine was designed to prevent.\n\nGiven that type 1 diabetes is only one of many immune mediated diseases potentially caused by vaccines, chronic late occurring adverse events are a serious public health issue.\n\nThe advent of new vaccine technology creates new potential mechanisms of vaccine adverse events. For example, the first killed polio vaccine actually caused polio in recipients because the up scaled manufacturing process did not effectively kill the polio virus before it was injected into patients. RNA based vaccines offers special risks of inducing specific adverse events.\n\nOne such potential adverse event is prion based diseases caused by activation of intrinsic proteins to form prions. A wealth of knowledge has been published on a class of RNA binding proteins shown to participating in causing a number of neurological diseases including Alzheimer’s disease and ALS. TDP-43 and FUS are among the best studied of these proteins [2].\n\nThe Pfizer RNA based COVID-19 vaccine was approved by the US FDA under an emergency use authorization without long term safety data. Because of concerns about the safety of this vaccine a study was performed to determine if the vaccine could potentially induce prion based disease.\n\nPfizer’s RNA based vaccine against COVID-19 was evaluated for the potential to convert TDP-43 and or FUS to their prion based disease causing states. The vaccine RNA was analyzed for the presence of sequences that can activate TDP-43 and FUS. The interaction of the transcribed spike protein with its target was analyzed to determine if this action could also activate TDP-43 and FUS.\n\nRead more: Study: mRNA-Based Vaccines And The Risk Of Prion Disease", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/02/LEMMINGS-VACCINE-IMAGE-1.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/02/LEMMINGS-VACCINE-IMAGE-1.jpg", "image:width": "900", "image:height": "616", "url": "https://davidicke.com/2021/04/16/study-mrna-based-vaccines-and-the-risk-of-prion-disease/", "description": "Vaccines have been found to cause a host of chronic, late developing adverse events. Some adverse events like type 1 diabetes may not occur until 3-4 years after a vaccine is administered [1]. In the example of type 1 diabetes the frequency of cases of adverse events may surpass the frequency of cases of severe infectious disease the vaccine was designed to prevent. Given that type 1 diabetes [...]", "title": "Study: mRNA-Based Vaccines And The Risk Of Prion Disease"}, "tags": [], "tweets": [], "movies": [], "links": ["mRNA-Based Vaccines And The Risk Of Prion Disease"], "authors": [], "publish_date": null}