{"result_id": "093010", "URL": "https://davidicke.com/2023/03/31/dystopian-world-of-the-preening-vaccine-mongers/", "timestamp": "2023-04-25 14:58:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/31/dystopian-world-of-the-preening-vaccine-mongers/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Dystopian world of the preening vaccine-mongers", "cleaned_text": "WHY are the government still charging ahead with spring and summer booster Covid vaccines with absolutely no scientific justification?\n\nLast week I applied to attend a Policy Exchange forum on ‘What is the future for vaccines policy?’ with speakers from the UK Health Security Agency (Dame Jenny Harries), Government (former Health Secretary Sajid Javid MP) the Royal Pharmaceutical Society (Thorrun Govind) and the British pharmaceutical industry Susan Rienow), who also happens to be UK president for Pfizer. The Policy Exchange is the ‘conservative’ think tank which published A Fresh Shot, The Future of Vaccines Policy in England in December 2022.\n\nI was eager to hear if any revelations were going to be discussed. My application was initially accepted, but after I filled in all my details they must have had second thoughts and the next day I was informed that the event was oversubscribed and I would not be able to attend in person. I was, however, given a link to watch online, where I observed many empty seats.\n\nThe event was by our current dystopian standards quite extraordinary with unbelievable self-congratulatory speeches by all confirming the brilliance of the Covid vaccine programme, the plans for spring and summer boosters and how this will be applied to all future threats.\n\nThe five people who were allowed to ask questions were all graduates from the Uriah Heep school of obsequiousness.\n\nThere were no facts, no mention of the side effects, no seeking any justification for this mass psychotic madness.\n\nJenny Harries spoke with a strange supercilious detachment from reality, never once addressing any negative aspects in spite of the Yellow Card data and statistics of which she must be aware. Susan Rienow reacted like a cartoon figure with dollar signs where her eyes should have been.\n\nThis confirmed that the UK government and its agencies – including so-called think tanks – are in serious and dangerous denial leading to many deaths by medical negligence (you may argue incompetence but the facts are out there so it is negligence, and as some of the 63,500 deaths last year were a direct result of unnecessary vaccinations it is criminal negligence to boot). They are also wasting billions of pounds when NHS time is desperately needed to help those left physically and mentally impaired by the pandemic, let alone the vaccine injuries.\n\nRead More – Dystopian world of the preening vaccine-mongers", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image:width": "900", "image:height": "506", "url": "https://davidicke.com/2023/03/31/dystopian-world-of-the-preening-vaccine-mongers/", "description": "WHY are the government still charging ahead with spring and summer booster Covid vaccines with absolutely no scientific justification? Last week I applied to attend a Policy Exchange forum on ‘What is the future for vaccines policy?’ with speakers from the UK Health Security Agency (Dame Jenny Harries), Government (former Health Secretary Sajid Javid MP) the Royal Pharmaceutical Society [...]", "title": "Dystopian world of the preening vaccine-mongers"}, "tags": [], "tweets": [], "movies": [], "links": ["https://policyexchange.org.uk/publication/a-fresh-shot/", "https://www.conservativewoman.co.uk/dystopian-world-of-the-preening-vaccine-mongers/"], "authors": [], "publish_date": null}