{"result_id": "093019", "URL": "https://davidicke.com/2023/04/17/brain-injuries-after-covid-vaccination/", "timestamp": "2023-04-25 14:58:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/17/brain-injuries-after-covid-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Brain Injuries After COVID Vaccination", "cleaned_text": "There are back door routes to the brain. COVID vaccine developers have traversed a path through those doors. And they knew they had entered the brain by November 2020, before the vaccine rollout.\n\nWe have 86 billion neurons in the human brain, and each of those connects with 10,000 other neurons. No other structure in the known universe rivals the brain’s complexity.\n\nThe brain is also the most exclusive club, so to speak, in the body. The gatekeeper is the blood-brain barrier (BBB). That barrier, shown in the second illustration below, is mostly composed of tight junctions between endothelial cells that line, in a single layer, the capillaries (our smallest blood vessels) that nourish the brain. So the BBB is in effect the capillary walls and the tight junctions between its cells.\n\nHowever, to some extent, there is a liquid component to the BBB, in that the pristine cerebrospinal fluid (CSF) that bathes the brain and spinal cord is kept pure by the BBB. At the risk of oversimplifying, if the central nervous system, which includes the brain and spinal cord, is the royalty of the body, then the skull and vertebrae and BBB are the castle walls, and the CSF is the moat—but a clean moat—unlike the medieval ones. Intruding molecules and pathogens would have to traverse both solid and liquid barriers.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2022/12/Covid-jab-brain.jpg", "image": "https://davidicke.com/wp-content/uploads/2022/12/Covid-jab-brain.jpg", "image:width": "753", "image:height": "545", "url": "https://davidicke.com/2023/04/17/brain-injuries-after-covid-vaccination/", "description": "There are back door routes to the brain. COVID vaccine developers have traversed a path through those doors. And they knew they had entered the brain by November 2020, before the vaccine rollout. We have 86 billion neurons in the human brain, and each of those connects with 10,000 other neurons. No other structure in the known universe rivals the brain’s complexity. The brain is also the most [...]", "title": "Brain Injuries After COVID Vaccination"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/brain-injuries-after-covid-vaccination_5188400.html", "https://www.ickonic.com/"], "authors": [], "publish_date": null}