{"result_id": "093040", "URL": "https://davidicke.com/2023/04/12/husband-of-bbc-presenter-killed-by-covid-vaccine-sues-astrazeneca-says-vaccine-is-unsafe-defective-product/", "timestamp": "2023-04-25 14:58:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/12/husband-of-bbc-presenter-killed-by-covid-vaccine-sues-astrazeneca-says-vaccine-is-unsafe-defective-product/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Husband of BBC Presenter Killed by Covid Vaccine Sues AstraZeneca, Says Vaccine is Unsafe “Defective Product”", "cleaned_text": "The widower of BBC presenter Lisa Shaw who died from coronavirus vaccine complications says he has “no alternative” but to pursue legal action against pharmaceutical company AstraZeneca, arguing the vaccine is an unsafe “defective product”. The Mail has more.\n\nMother-of-one Lisa Shaw, 44, died from “vaccine-induced thrombotic thrombocytopenia” in May 2021, about a week after receiving her first Covid jab. She worked for BBC Radio Newcastle.\n\nLawyers for her husband, Gareth Eve, reportedly sent pre-action protocol letters to AstraZeneca last year on the behalf of nearly 75 people who allege that their relatives died or suffered injuries related to the vaccine.\n\nNow, nearly two years after Ms. Shaw’s passing and failed attempts to “engage with the U.K. Government, MPs and three prime ministers’, Mr. Eve has told the BBC he has taken legal action in an attempt to get “some sort of acknowledgement or recognition” from the drug producer.\n\nThe grieving widower is pursuing a lawsuit after he reportedly spent two years trying to address the vaccine-related deaths and illnesses with U.K. leaders.\n\nMr. Eve alleges no one had “reached out or engaged with us at all”, forcing him to take legal action against the firm.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/04/Lisa-Shaw.jpg", "image": "https://davidicke.com/wp-content/uploads/2023/04/Lisa-Shaw.jpg", "image:width": "1083", "image:height": "672", "url": "https://davidicke.com/2023/04/12/husband-of-bbc-presenter-killed-by-covid-vaccine-sues-astrazeneca-says-vaccine-is-unsafe-defective-product/", "description": "The widower of BBC presenter Lisa Shaw who died from coronavirus vaccine complications says he has “no alternative” but to pursue legal action against pharmaceutical company AstraZeneca, arguing the vaccine is an unsafe “defective product”. The Mail has more. Mother-of-one Lisa Shaw, 44, died from “vaccine-induced thrombotic thrombocytopenia” in May 2021, about a week after receiving her [...]", "title": "Husband of BBC Presenter Killed by Covid Vaccine Sues AstraZeneca, Says Vaccine is Unsafe “Defective Product”"}, "tags": ["AstraZeneca", "Lisa Shaw"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-9928939/BBC-presenter-Lisa-Shaw-died-complications-caused-AstraZeneca-covid-jab-coroner-rules.html"], "authors": [], "publish_date": null}