{"result_id": "093001", "URL": "https://davidicke.com/2023/01/19/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-fake-vaccine-data-says-top-scientist-withdraw-them-immediately/", "timestamp": "2023-04-25 14:58:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/01/19/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-fake-vaccine-data-says-top-scientist-withdraw-them-immediately/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Unequivocal Safety Signals for Heart, Blood and Reproduction Found in Yellow Card Fake-Vaccine Data, Says Top Scientist – ‘Withdraw Them Immediately’", "cleaned_text": "Dr. Richard Ennos, a retired Professor of Evolutionary Biology at Edinburgh University, has undertaken a thorough analysis of the U.K.’s COVID-19 ‘Yellow Card’ vaccine adverse event data and found it indicates “unequivocal safety signals” for adverse reactions caused by the Pfizer and Moderna vaccines affecting the blood, the heart and female reproduction. He concludes that: “There can be no question that the mRNA vaccines should be withdrawn with immediate effect.”\n\nIn the U.K., three COVID-19 vaccines – AstraZeneca (AZ), Pfizer (PF) and Moderna (MO) – have been used in a nationwide inoculation programme aimed at preventing harm from the SARS-CoV-2 virus. All three vaccines provide the genetic code that enables vaccinees to produce within their bodies the spike protein of the SARS-CoV-2 virus, the molecule associated with the pathology of COVID-19. In the AZ vaccine the genetic code for the spike protein takes the form of DNA, and is introduced into recipient’s cells by a genetically modified chimpanzee virus (DNA, adenovirus vector). For the PF and MO vaccines, the introduced genetic code takes the form of heavily modified RNA, and is carried to recipient’s cells within lipid nanoparticles (mRNA, lipid nanoparticle). There is no control over either the tissues to which the vaccines are transported or the length of time for which spike proteins are produced by those tissues.\n\nAll three vaccines rely on novel technology that has never before been used in humans. At the time of their introduction, they lacked any long-term safety data, and therefore required Conditional Marketing Authorisation from the Medicines and Healthcare products Regulatory Agency (MHRA). To monitor the safety of the three vaccines the MHRA established the COVID-19 vaccine Yellow Card reporting scheme (C-19VYC). This collates standardised reports of suspected adverse reactions to the COVID-19 vaccines that can be analysed to detect safety signals and potentially trigger withdrawal of the vaccines. Here we show that a thorough analysis of the C-19YC data indicates unequivocal safety signals for adverse reactions caused by the mRNA vaccines PF and MO affecting the lymph system, the heart and female reproduction.\n\nThe strength of the C-19VYC reporting scheme is that it is capable of generating an enormous amount of valuable information about adverse reactions to the experimental COVID-19 vaccines. Reports of suspected adverse reactions can be submitted not only by physicians but also by the recipients of the vaccines themselves, providing valuable feedback to the MHRA based on first-hand experience. This inclusive aspect of the C-19VYC reporting scheme has proved very successful, with nearly half a million adverse event reports submitted, roughly one for every hundred recipients of the COVID-19 vaccines in the U.K.\n\nDespite this strength in terms of quantity of data, the C-19VYC reporting scheme has a number of serious weaknesses related to the nature of the data collected. These weaknesses place limits on the scheme’s ability both to detect and to measure safety signals. The first problem is that the scheme does not identify or include a control group of individuals, who have not taken the vaccine, against which to compare those who have. Other major weaknesses are that reporting is passive rather than planned and takes place at a single point in time. Thus, reporting relies on the sufferer of the adverse reactions or his or her physician making the connection between the vaccine treatment and the adverse reaction. As a consequence, many adverse events will go unrecorded, and this becomes more likely the longer the delay between treatment and the associated adverse reaction. Reporting rates of adverse reactions are also likely to represent only a fraction of actual cases because physicians or recipients may have too little time to fill out the onerous paperwork, may not have knowledge of the Yellow Card scheme, or may be unwilling to countenance the idea of harms resulting from a medication in which they have placed trust.\n\nRead More: Unequivocal Safety Signals for Heart, Blood and Reproduction", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/10/VACCINE-MASS-MURDER-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/10/VACCINE-MASS-MURDER-IMAGE.jpg", "image:width": "898", "image:height": "591", "url": "https://davidicke.com/2023/01/19/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-fake-vaccine-data-says-top-scientist-withdraw-them-immediately/", "description": "Dr. Richard Ennos, a retired Professor of Evolutionary Biology at Edinburgh University, has undertaken a thorough analysis of the U.K.’s COVID-19 ‘Yellow Card’ vaccine adverse event data and found it indicates “unequivocal safety signals” for adverse reactions caused by the Pfizer and Moderna vaccines affecting the blood, the heart and female reproduction. He concludes that: “There can be no [...]", "title": "Unequivocal Safety Signals for Heart, Blood and Reproduction Found in Yellow Card Fake-Vaccine Data, Says Top Scientist – ‘Withdraw Them Immediately’"}, "tags": ["Covid Vaccine Deaths", "covid vaccine damage", "Covid 19"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2023/01/18/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-vaccine-data-says-top-scientist-withdraw-them-immediately/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}