{"result_id": "093005", "URL": "https://davidicke.com/2023/01/27/study-finds-covid-fake-vaccines-have-killed-1-in-every-874-americans/", "timestamp": "2023-04-25 14:58:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/01/27/study-finds-covid-fake-vaccines-have-killed-1-in-every-874-americans/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Study finds ‘Covid’ fake vaccines have killed 1 in every 874 Americans", "cleaned_text": "A peer-reviewed study published on 24 January 2023 estimates 278,000 Americans died in 2021, alone, due to covid injections. 243 million Americans had received Covid injections by the end of Dec 2021. So, the study’s estimate suggests that 1 out of 874 vaccinees is killed by the injections.\n\nThe study commissioned an online survey from a reputable polling company, Dynata. According to the Centres for Disease Control, about 31% of the United States population had not completed the primary vaccination series as of November 2022. So, the primary aim of the study was to identify the factors associated by American citizens with the decision to be vaccinated against covid.\n\nA total of 2,840 participants completed the survey between 18 and 23 December 2021. 22% of respondents indicated that they knew at least one person who had experienced a severe health problem following covid vaccination.\n\n“Estimates from the survey indicate that through the first year of the covid-19 vaccination program there may be as many as 278,000 vaccine-induced fatalities and up to a million severe adverse events,” the study noted.\n\nAs Igor Chudov highlighted, the estimates of the total number of vaccine fatalities cannot be very precise, and the study author points that out very honestly.\n\nAt the time of the study, the reported number of vaccine deaths in VAERS was 8,023.\n\nIgor Chudov compared the results of this study with other sources:\n• A January 2023 Rasmussen survey showed that 28% of all adults know someone who died due to covid injections. 35% of adults under 40 believe someone they know personally might have died from vaccine side effects, compared to 28% of those 40-64 and just 14% of Americans 65 and older.\n• In mid-December 2021 Steve Kirsch estimated 388,000 Americans had been killed by covid injections\n• An analysis done by Fabian Spieker estimated 1 death for every 1,642 doses given in Germany. Assuming that by the end of 2021, 1.8 doses per vaccinated person were given, as some had only one dose. This would yield, in the USA, 266,400 dead from covid injections.\n\nThat these three outcomes are not wildly different means that the true number of deaths – which nobody knows and nobody will ever know exactly – is somewhere within this ballpark.\n\nRead More: BREAKING: Study finds COVID Vaccines have killed 1 in every 874 Americans", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image:width": "900", "image:height": "506", "url": "https://davidicke.com/2023/01/27/study-finds-covid-fake-vaccines-have-killed-1-in-every-874-americans/", "description": "A peer-reviewed study published on 24 January 2023 estimates 278,000 Americans died in 2021, alone, due to covid injections. 243 million Americans had received Covid injections by the end of Dec 2021.  So, the study’s estimate suggests that 1 out of 874 vaccinees is killed by the injections. The study commissioned an online survey from a reputable polling company, Dynata.  According to the [...]", "title": "Study finds ‘Covid’ fake vaccines have killed 1 in every 874 Americans"}, "tags": ["Covid vaccines", "experimental vaccines"], "tweets": [], "movies": [], "links": ["https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3", "https://igorchudov.substack.com/p/covid-vaccines-killed-278000-americans", "https://www.rasmussenreports.com/public_content/politics/public_surveys/died_suddenly_more_than_1_in_4_think_someone_they_know_died_from_covid_19_vaccines", "https://stevekirsch.substack.com/p/latest-vaers-estimate-388000-americans", "https://vigilance.pervaers.com/p/german-excess-mortality-part-3", "https://expose-news.com/2023/01/26/1-in-874-americans-killed-covid-vaccine/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}