{"result_id": "093047", "URL": "https://davidicke.com/2023/03/31/u-s-military-runs-covid-vaccines-former-pharma-exec-tells-rfk-jr/", "timestamp": "2023-04-25 14:58:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/31/u-s-military-runs-covid-vaccines-former-pharma-exec-tells-rfk-jr/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "U.S. MILITARY RUNS COVID VACCINES, FORMER PHARMA EXEC TELLS RFK JR.", "cleaned_text": "The U.S. government’s COVID-19 vaccination effort is a biological weapon project run by the U.S. Department of Defense (DOD), according to Alexandra Latypova, a former pharmaceutical research and development executive with 25 years of industry experience.\n\nLatypova, who oversaw compliance for more than 60 clinical trials, knows the regulatory standards pharmaceutical companies historically were required to meet before bringing a product to market.\n\n“People misunderstand that this is just another instance of Big Pharma corruption,” she told Robert F. Kennedy, Jr., chairman and chief litigation counsel for Children’s Health Defense, during an episode of “RFK Jr. The Defender Podcast.” “It’s much, much bigger than that.”\n\nLatypova said we have government reports describing the COVID-19 vaccines as a biological weapon. “I have a question to our government,” she said. “What is it that they’re exactly forcing on us?”\n\nThe DOD is “fully in charge” of the COVID-19 vaccine clinical trials and the vaccine’s manufacturing and distribution, and it owns the vaccine “until it is injected into a person,” she said.\n\nBy creating a “pseudo-legal structure” over time that included Emergency Use Authorization (EUA) and other transaction authority agreements — called OTAs — the U.S. government allowed the military to take over the distribution of vaccines without adhering to historical safety testing guidelines or product recall procedures.\n\nAccording to Latypova, the notion that the COVID-19 vaccines met regulatory standards for safety and effectiveness was the “biggest lie that was sold to the public.”\n\n“I am describing a very illegal structure that’s made legal on paper,” she said. “It’s unlawful. They — the government — are driving this.”\n\nKennedy agreed with Latypova and pointed out that OTA was designed to allow the Pentagon to quickly buy weapons and weapons systems without paying attention to any existing regulatory authorities.\n\n“What they’ve done is they’ve taken that authority and they’ve applied it to the vaccines so they’re purchasing the vaccines under OTA as a demonstration product.\n\n“It’s all a huge military operation and the involvement of the drug companies is a kind of window dressing.”\n\nThe DOD paid the pharmaceutical companies for their brand names so people would think they were getting something from Pfizer or Moderna — but all of the distribution and manufacturing is done by the military, Kennedy said. The pharmaceutical companies were brought in to put their name on it and then to pretend to do clinical trials, he said.\n\nLatypova and Kennedy discussed how the military accomplished this without most workers involved in the production and distribution of the vaccine catching on.\n\nThey also discussed how citizens and lawyers might effectively challenge the Pentagon’s COVID-19 vaccination project in the court system.\n\nRead More: U.S. MILITARY RUNS COVID VACCINES, FORMER PHARMA EXEC TELLS RFK JR.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image": "https://davidicke.com/wp-content/uploads/2021/09/VACCINE-MASS-MURDER.jpeg", "image:width": "900", "image:height": "506", "url": "https://davidicke.com/2023/03/31/u-s-military-runs-covid-vaccines-former-pharma-exec-tells-rfk-jr/", "description": "The U.S. government’s COVID-19 vaccination effort is a biological weapon project run by the U.S. Department of Defense (DOD), according to Alexandra Latypova, a former pharmaceutical research and development executive with 25 years of industry experience. Latypova, who oversaw compliance for more than 60 clinical trials, knows the regulatory standards pharmaceutical companies historically [...]", "title": "U.S. MILITARY RUNS COVID VACCINES, FORMER PHARMA EXEC TELLS RFK JR."}, "tags": ["US Military", "Covid vaccines", "experimental vaccines"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/fda-moderna-bypass-covid-vaccine-safety-standards-documents/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://childrenshealthdefense.org/", "https://anchor.fm/rfkjr", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.fda.gov/vaccines-blood-biologics/vaccines/emergency-use-authorization-vaccines-explained", "https://www.nationaldefensemagazine.org/articles/2021/2/4/enthusiasm-growing-at-pentagon-for-otas", "https://truthcomestolight.com/u-s-military-runs-covid-vaccines-former-pharma-exec-tells-rfk-jr/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}