{"result_id": "093015", "URL": "https://davidicke.com/2023/03/25/astrazeneca-sued-over-covid-19-vaccine-injuries/", "timestamp": "2023-04-25 14:58:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/25/astrazeneca-sued-over-covid-19-vaccine-injuries/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "AstraZeneca Sued Over ‘COVID’-19 Vaccine Injuries", "cleaned_text": "Families and patients are suing vaccine manufacturer AstraZeneca in the UK, claiming that their loved ones died or suffered severe reactions after taking its vaccine, according to their lawyers.\n\nA legal team representing a group of vaccine-injured people is pursuing personal injury compensation against AstraZeneca, arguing that the vaccine was “not as safe as the public were entitled to expect.”\n\nPeter Todd, consultant solicitor with Scott-Moncrieff & Associates, told The Epoch Times by email that he has started a claim against AstraZeneca under the Consumer Protection Act 1987.\n\n“I have started a claim against AstraZeneca seeking damages for injury (namely thrombosis with thrombocytopenia) and consequential loss caused by their COVID vaccine,” he said.\n\n“The claim is under the Consumer Protection Act 1987, which holds manufacturers liable for injury caused by a defective product,” he added.\n\nTodd said that it is “not necessary to prove fault.”\n\n“A product is defective under this legislation if it is not as safe as consumers were reasonably entitled to expect. Our contention is that the AstraZeneca COVID vaccine was not as safe as consumers were reasonably entitled to expect in that it caused serious injury or death when we were assured it had been established to be safe through extensive clinical trials,” he added.\n\nHe said that the government “agreed in the procurement contract of the vaccine to indemnify AstraZeneca against any liability of this kind, so we ask the government to do the right thing and to support people who were vaccinated and help them cope with the devastating consequence of their life changing injuries.”\n\n“Strict time limits apply to such claims so anyone who thinks they may have been affected in a similar way should get in touch,” he added.\n\nThe UK became the first country in the world to approve the Oxford University/AstraZeneca COVID-19 vaccine in 2020. The vaccine is now known as Vaxzevria.\n\nIn the UK, the Moderna, AstraZeneca, and Pfizer-BioNTech vaccines have been approved for use. All three have legal indemnity protecting the companies from being sued for damages.\n\nThe Epoch Times understands that the only way to hold a vaccine manufacturer to account as an injured party is under the Consumer Protection Act 1987. The details of indemnity that the vaccine manufacturers have with the government are unknown.\n\nVaccine Damage Payment\n\n The Vaccine Damage Payment Scheme (VDPS) is a one-off tax-free payment of £120,000 if someone is proven to have been severely disabled or has died as a result of vaccination from diseases such as measles, mumps, and rubella (MMR), swine flu, and more.\n\nIn December 2020, ministers agreed to add COVID-19 to the scheme to demonstrate “government confidence in the safety profile” of any vaccine being used in the programme.\n\nOne in 20 claims made to the UK vaccine injury scheme are successful in the case of COVID-19 jabs, according to data obtained by Freedom of Information requests in March.\n\nAccording to responses, 44 claimants have been notified they are entitled to a Vaccine Damage Payment, which means over £5 million has so far been paid out.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2020/10/shutterstock_1664089354.jpg", "image": "https://davidicke.com/wp-content/uploads/2020/10/shutterstock_1664089354.jpg", "image:width": "1000", "image:height": "666", "url": "https://davidicke.com/2023/03/25/astrazeneca-sued-over-covid-19-vaccine-injuries/", "description": "Families and patients are suing vaccine manufacturer AstraZeneca in the UK, claiming that their loved ones died or suffered severe reactions after taking its vaccine, according to their lawyers. A legal team representing a group of vaccine-injured people is pursuing personal injury compensation against AstraZeneca, arguing that the vaccine was “not as safe as the public were entitled to [...]", "title": "AstraZeneca Sued Over ‘COVID’-19 Vaccine Injuries"}, "tags": ["AstraZeneca", "covid vaccine damage", "Covid 19"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/astrazenica-sued-over-covid-19-vaccine-injuries_5146961.html", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}