{"result_id": "093008", "URL": "https://davidicke.com/2023/03/12/the-vaticans-covid-19-vaccine-coin/", "timestamp": "2023-04-25 14:58:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/12/the-vaticans-covid-19-vaccine-coin/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "The Vatican’s COVID-19 Vaccine Coin", "cleaned_text": "Last year, Vatican City issued a 20 Euro silver coin. As the Numista catalogue describes it:\n\nThe coin depicts a doctor, a nurse and a young person who is ready to receive the vaccine. The Holy Father has repeatedly stressed the importance of vaccination, recalling that healthcare is “a moral obligation”, and it is important to “continue efforts to immunize even the poorest peoples.\n\nAfter I initially posted this report, I pondered this description (written in the Numista catalogue) and I realized that the formulation “a young person who is ready to receive the vaccine” is identical to the formulation for a communicant “who is ready to receive the host”—in Italian “pronto a ricevere l’Eucaristia.” Realizing this, I wondered who wrote the catalogue copy. Was it the Philatelic and Numismatic Office of the Vatican City State?\n\nThe obverse of the coin bears the name Franciscus, the year 2022 (“Anno MMXXII”) and the Coat of Arms of Pope Francis.\n\nAs I wrote in a Substack essay last October titled “President Biden Keeps the Faith,” it seems that many have placed something akin to religious faith in the COVID-19 vaccines, which are conceived as the Savior of Mankind. With this commemorative silver coin, issued in the name of Francis, the Holy Father officially endorsed the COVID-19 vaccines and bestowed upon them his sublime authority and prestige.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/02/POPE-STORY-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/02/POPE-STORY-IMAGE.jpg", "image:width": "900", "image:height": "525", "url": "https://davidicke.com/2023/03/12/the-vaticans-covid-19-vaccine-coin/", "description": "\"The Holy Father has repeatedly stressed the importance of vaccination.\" Last year, Vatican City issued a 20 Euro silver coin. As the Numista catalogue describes it: The coin depicts a doctor, a nurse and a young person who is ready to receive the vaccine. The Holy Father has repeatedly stressed the importance of vaccination, recalling that healthcare is “a moral obligation”, and it [...]", "title": "The Vatican’s COVID-19 Vaccine Coin"}, "tags": [], "tweets": [], "movies": [], "links": ["https://petermcculloughmd.substack.com/p/president-biden-keeps-the-faith?utm_source=%2Fsearch%2Fcult&utm_medium=reader2"], "authors": [], "publish_date": null}