{"result_id": "093014", "URL": "https://davidicke.com/2023/03/02/pfizer-confirms-it-ended-covid-19-vaccine-pregnancy-trial-early/", "timestamp": "2023-04-25 14:58:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/02/pfizer-confirms-it-ended-covid-19-vaccine-pregnancy-trial-early/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Pfizer Confirms It Ended ‘COVID’-19 Vaccine Pregnancy Trial Early", "cleaned_text": "Pfizer has confirmed it stopped its clinical trial analyzing COVID-19 vaccine safety and efficacy in pregnant women early.\n\nThe company said that enrollment in the study stopped in the fourth quarter of 2021 after health experts, including the U.S. Advisory Committee on Immunization Practices, began recommending the Pfizer-BioNTech vaccine for pregnant women.\n\n“With the declining enrollment, the study had insufficient sample size to assess the primary immunogenicity objective and continuation of this placebo controlled study could no longer be justified due to global recommendations,” Pfizer told journalist Maryanne Demasi.\n\nThe U.S. Food and Drug Administration and European Medicines Agency both agreed to the proposal to halt the study, according to Pfizer. The regulatory agencies did not respond to requests for comment.\n\nAn internal email, disclosed in a court case, previously indicated Pfizer had stopped enrollment early.\n\n“The study enrolment was stopped with incomplete numbers because recruitment was slow and it became unreasonable/inappropriate to randomise pregnant women to placebo given the amount of observational evidence that the vaccine is safe and effective, coupled with increasing number of technical committees supporting immunization of pregnant women,” Jelena Vojicic, vaccines medical lead at Pfizer Canada, wrote in the 2022 email.\n\nThe randomized, placebo-controlled study in question was launched in early 2021 after pregnant women were excluded from the phase three trial that led to the authorization of the vaccine in the United States and a number of other countries.\n\nPfizer and BioNTech said they expected to enroll some 4,000 pregnant women but actually enrolled just 349, according to the trial record. Some of the participants were to receive a vaccine while others would receive a placebo, according to the original protocol. Women were expected to be studied for seven to 10 months.\n\nThe trial was listed as completed on Aug. 23, 2022, but no results have been released yet.\n\nPfizer told Demasi that it still does not have “a complete data set” from the study and did not say when it expected to receive it. Pfizer said it and BioNTech plan to complete an analysis of the trial “and seek publication or presentation as is our standard practice.”\n\nPfizer officials told CDC advisers in September 2022 that the study was completed.\n\n“We will be generating data from that study despite the difficulties in enrollment … due to the wide recommendations for pregnant women to be vaccinated, but we will generate those data for sure,” Nicholas Kitchen, a senior Pfizer vaccine official, told the panel.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2023/01/vaccines-scaled.jpg", "image": "https://davidicke.com/wp-content/uploads/2023/01/vaccines-scaled.jpg", "image:width": "2560", "image:height": "1707", "url": "https://davidicke.com/2023/03/02/pfizer-confirms-it-ended-covid-19-vaccine-pregnancy-trial-early/", "description": "Pfizer has confirmed it stopped its clinical trial analyzing COVID-19 vaccine safety and efficacy in pregnant women early. The company said that enrollment in the study stopped in the fourth quarter of 2021 after health experts, including the U.S. Advisory Committee on Immunization Practices, began recommending the Pfizer-BioNTech vaccine for pregnant women. “With the declining enrollment, [...]", "title": "Pfizer Confirms It Ended ‘COVID’-19 Vaccine Pregnancy Trial Early"}, "tags": ["covid vaccine damages", "Pfizer vaccines", "covid pregnancy", "COVID vaccine"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/pfizer-says-it-ended-covid-19-vaccine-pregnancy-trial-early_5088375.html?ea_src=ai&ea_med=search", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}