{"result_id": "093016", "URL": "https://davidicke.com/2023/03/25/dozens-of-families-seriously-injured-by-astrazeneca-jab-launch-legal-fight/", "timestamp": "2023-04-25 14:58:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/03/25/dozens-of-families-seriously-injured-by-astrazeneca-jab-launch-legal-fight/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Dozens of Families Seriously Injured by AstraZeneca Jab Launch Legal Fight", "cleaned_text": "Dozens of patients and families whose lives have been damaged by serious reactions to the Oxford/AstraZeneca Covid vaccine have launched legal action against the pharmaceutical company. The i has the story.\n\nWhile the vaccine is widely credited with protecting many millions of people from the virus, 81 patients died and 364 suffered severe reactions, some of them resulting in catastrophic injuries as a result of blood clots caused by the jab. Legal action is now being taken against AstraZeneca by the families of 19 people who died after being vaccinated and 54 patients who suffered severe reactionsbut survived.\n\nStrokes, paralysis and repeated blood clots are among the symptoms of those who suffered very rare [sic] but severe reactions to the vaccine. Many have gone from being fit and healthy to being left struggling to walk and talk, with little hope of getting better…\n\nThe 54 members of the class action group who survived the reaction have been diagnosed as having vaccine-induced immune thrombotic thrombocytopenia (VITT), a rare condition that has been identified after COVID-19 vaccination.\n\nLawyers representing the group, who are pursuing personal injury compensation in addition to a Vaccine Damage Payments Scheme claim, argue that the AstraZeneca vaccine was “not as safe as the public were entitled to expect” and that the case is not about finding fault “but about the reasonable expectation of safety”. They claim people were provided with a false picture of safety and efficacy and expect the number joining the lawsuit to increase.\n\nVaccine-induced immune thrombotic thrombocytopenia affects approximately one in 50,000 AstraZeneca vaccine recipients under 50 years-old, and one in 100,000 for those aged 50 and older in England, according to the NHS, which says the effect of the blood clots can be devastating.\n\nAstraZeneca vaccinations were first administered on January 4th 2021 as part of a rapid rollout of jabs by the NHS. Just a few weeks earlier, Margaret Keenan, 90, had become the first person in the world to receive the Pfizer jab following its clinical approval. By September 2022, almost 25 million first doses of the Oxford/AstraZeneca vaccine and 27.2 million of the Pfizer/BioNTech vaccine had been administered in the U.K. Around 50 million AstraZeneca doses have been given in total.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2020/10/shutterstock_1664089354.jpg", "image": "https://davidicke.com/wp-content/uploads/2020/10/shutterstock_1664089354.jpg", "image:width": "1000", "image:height": "666", "url": "https://davidicke.com/2023/03/25/dozens-of-families-seriously-injured-by-astrazeneca-jab-launch-legal-fight/", "description": "Dozens of patients and families whose lives have been damaged by serious reactions to the Oxford/AstraZeneca Covid vaccine have launched legal action against the pharmaceutical company. The i has the story. While the vaccine is widely credited with protecting many millions of people from the virus, 81 patients died and 364 suffered severe reactions, some of them resulting in catastrophic [...]", "title": "Dozens of Families Seriously Injured by AstraZeneca Jab Launch Legal Fight"}, "tags": ["AstraZeneca", "Covid vaccines", "Covid Scam"], "tweets": [], "movies": [], "links": ["https://inews.co.uk/news/health/father-reaction-astrazeneca-covid-jab-lawsuit-2228078?ico=in-line_link", "https://inews.co.uk/news/health/covid-vaccine-side-effects-when-symptoms-show-after-jab-how-long-last-most-common-922328?ico=in-line_link", "https://www.england.nhs.uk/coronavirus/documents/vaccine-induced-thrombocytopenia-and-thrombosis-vitt-support-for-patients-family-members/", "https://inews.co.uk/news/astrazeneca-vaccine-covid-jab-blood-clots-victim-family-949694?ico=in-line_link"], "authors": [], "publish_date": null}