{"result_id": "093021", "URL": "https://davidicke.com/2023/04/13/cdc-behavior-change-project-targeted-vaccine-critics-was-funded-by-pfizer-and-new-york-misinformation-response-unit/", "timestamp": "2023-04-25 14:58:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/13/cdc-behavior-change-project-targeted-vaccine-critics-was-funded-by-pfizer-and-new-york-misinformation-response-unit/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "CDC “behavior change” project targeted vaccine critics, was funded by Pfizer and New York “Misinformation Response Unit”", "cleaned_text": "The benevolently named Public Good Projects (PGP) describes itself as a public health nonprofit with focus on “large-scale media monitoring programs, social and behavior change interventions.”\n\nA new report is now shedding more light of how the system of censorship and deplatforming of Covid vaccine skeptics worked at the height of the pandemic, including the intricate ties between a number of actors, such as the PGP, and their partners.\n\nOne of them is the Centers for Disease Control and Prevention (CDC) non-profit called the CDC Foundation (the CDC itself was established by Congress). Other partners include FDA, Kaiser Permanente, Rockefeller, and Humana, as per the Tennessee Department of Health, which cites these as part of the bio of the PGP CEO, Dr. Joe Smyser.\n\nAnd the Public Goods Project in the past received funding not from lobbyists for just any corporate players but those strongly interested in stomping out any vaccine hesitancy – namely, vaccine manufacturers like Pfizer and Moderna.\n\nTo add another “ingredient” into this “dish” that will appear unsavory to many, the New York City’s Health Department Misinformation Response Unit was also among those the PGP has in its portfolio of collaborations.\n\nBut things get more granular from there. The PGP operates an initiative called Shots Heard, while another one with a similar mission is called Team Halo and is the brainchild of the United Nations Verified initiative and the Vaccine Confidence Project.\n\nAn Epoch Times report details how in 2021, Dr. Mary Talley Bowden, a doctor who graduated from Stanford, was one of those caught in their crosshairs online.\n\nRead More: CDC “behavior change” project targeted vaccine critics, was funded by Pfizer and New York “Misinformation Response Unit”", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/08/CDC.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/08/CDC.jpg", "image:width": "900", "image:height": "500", "url": "https://davidicke.com/2023/04/13/cdc-behavior-change-project-targeted-vaccine-critics-was-funded-by-pfizer-and-new-york-misinformation-response-unit/", "description": "If you're tired of censorship, cancel culture, and the erosion of privacy and civil liberties subscribe to Reclaim The Net. The benevolently named Public Good Projects (PGP) describes itself as a public health nonprofit with focus on “large-scale media monitoring programs, social and behavior change interventions.” A new report is now shedding more light of how the system of censorship [...]", "title": "CDC “behavior change” project targeted vaccine critics, was funded by Pfizer and New York “Misinformation Response Unit”"}, "tags": ["Vocid scam", "Pfizer", "United Nations", "CDC"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/subscribe", "https://reclaimthenet.org/new-york-misinformation-response-unit", "https://reclaimthenet.org/topics/united-nations", "https://www.theepochtimes.com/cdc-partners-with-social-and-behavior-change-initiative-to-silence-vaccine-hesitancy_5175172.html", "https://reclaimthenet.org/cdc-behavior-change-project-targeted-vaccine-critics", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}