{"result_id": "093006", "URL": "https://davidicke.com/2023/01/30/drink-it-snort-it-smoke-it-the-vaccine-juggernaut-rumbles-on/", "timestamp": "2023-04-25 14:58:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/01/30/drink-it-snort-it-smoke-it-the-vaccine-juggernaut-rumbles-on/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Drink it, snort it, smoke it – the vaccine juggernaut rumbles on", "cleaned_text": "MORE good news on vaccine, folks. First, you may be required to take only one Covid-19 shot per year, and if all goes well you will not even have to do that. You will be able to drink or even inhale your vaccine. No more painful injections, just a quick slurp or a snort and the job’s a good ’un. That’s you safe from the deadly virus for another year.\n\nWe could even make it fun. Why not hold Covid-19 vaccine parties? A selection of flavours in shot glasses (they don’t call them shot glasses for no reason) or add your vaccine to a vape and puff away until your immune system is primed.\n\nI glean all this garbage from Global Health Now, the daily newsletter from the Johns Hopkins Bloomberg School of Public Health. The first story concerns how the Food and Drug Administration (FDA) in the United States is considering ‘simplifying the Covid vaccination schedule, allowing most people to get the currently available booster, regardless of how many doses they had received before that’. This means that if you are boosted up to the eyeballs or have never had one before and suddenly made the incomprehensible decision to start now, then Bob’s your uncle; roll up your sleeves.\n\nPlease note that nothing has changed; there is no new vaccine and no new threat. The FDA is just making an arbitrary decision to change the schedule. Clearly the aim is to get more people to accept the vaccination. But it is also clear that they are making this stuff up as they go along. They have no further evidence that the vaccines will work any better this way.\n\nThe information that is available to them is the abundant and accumulating evidence of vaccine harms which, incredibly, the Medicines and Healthcare products Regulatory Agency (MRHA) in the United Kingdom admits can be serious while insisting that the vaccines are safe. If truth is the first casualty of war – it certainly died early in the Covid-19 madness – logic is not far behind it. The MRHA is willing to trade off serious vaccine side effects against minimal protection from a virus which is virtually harmless to the vast majority of people. Perhaps the FDA is trying to reduce the number of boosters it says people will need in the hope that vaccine injuries will go away. Alternatively, it may be keen to accelerate the rollout before the general population wakes up to the fact that they are being conned, if they are lucky, and killed if they are not.\n\nRead More – Drink it, snort it, smoke it – the vaccine juggernaut rumbles on", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/10/MAN-TREE-VACCINE-IMAGE.jpeg", "image": "https://davidicke.com/wp-content/uploads/2021/10/MAN-TREE-VACCINE-IMAGE.jpeg", "image:width": "829", "image:height": "597", "url": "https://davidicke.com/2023/01/30/drink-it-snort-it-smoke-it-the-vaccine-juggernaut-rumbles-on/", "description": "MORE good news on vaccine, folks. First, you may be required to take only one Covid-19 shot per year, and if all goes well you will not even have to do that. You will be able to drink or even inhale your vaccine. No more painful injections, just a quick slurp or a snort and the job’s a good ’un. That’s you safe from the deadly virus for another year. We could even make it fun. Why not hold [...]", "title": "Drink it, snort it, smoke it – the vaccine juggernaut rumbles on"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nbcnews.com/health/health-news/fda-proposes-simplifying-covid-vaccine-schedule-making-similar-flu-sho-rcna66961", "https://www.conservativewoman.co.uk/mhra-admits-74-of-vaccine-injuries-are-serious-but-still-insists-jabs-are-safe/", "https://www.conservativewoman.co.uk/drink-it-snort-it-smoke-it-the-vaccine-juggernaut-rumbles-on/"], "authors": [], "publish_date": null}