{"result_id": "093030", "URL": "https://davidicke.com/tag/booster-vaccine/", "timestamp": "2023-04-25 14:58:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/tag/booster-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Mass murder – Get ready for FIFTH jabs this autumn: Sajid Javid says over-50s will ‘probably’ need another ‘Covid’ booster later this year", "cleaned_text": "All of David Icke's premium content, as well as a wide range of films and series are now available on Ickonic - subscribe today to receive full access.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/09/JAVID-LIAR-IMAGE.jpg", "image:width": "900", "image:height": "562", "url": "https://davidicke.com/2022/03/22/mass-murder-get-ready-for-fifth-jabs-this-autumn-sajid-javid-says-over-50s-will-probably-need-another-covid-booster-later-this-year/", "description": "\r\nFifth Covid jabs could be rolled out this autumn, the Health Secretary has suggested in the strongest hint yet that the vaccination programme will be expanded again.\r\nGrilled this morning about whether another booster campaign was in the works, Sajid Javid claimed it was 'possible... probably for those that are 50 and over'. But he added a 'final' decision was yet to be made.\r\nOver-75s, care home residents and patients with weak immune systems will begin receiving invitations for a spring Covid top-up from today, in order to bolster the immunity levels of millions.\r\nIf they are offered another jab in the autumn, it will be their fifth. Some immunocompromised adults will have already had five by then.\r\nMr Javid also revealed No10's 'level of concern has not changed' over the past two weeks, despite the rise in infections and hospitalisations. He said the numbers 'are still way below their peak'.\r\nHe also urged people to treat Covid like any other infectious disease, and 'behave sensibly' if they were feeling unwell or experiencing symptoms — including socialising less and staying indoors to avoid spreading the virus. He gave the advice ahead of England ending its free testing offer from next Friday.\r\nFive million Britons became eligible for second boosters today, with the first 600,000 expected to be invited this week.\r\nThe move comes after the Joint Committee on Vaccination and Immunisation (JCVI) recommended the spring top-up as a precautionary measure.\r\nRead More: Get ready for FIFTH jabs this autumn: Sajid Javid says over-50s will 'probably' need another Covid booster later this year\r\n[renegade-banner]", "title": "Mass murder – Get ready for FIFTH jabs this autumn: Sajid Javid says over-50s will ‘probably’ need another ‘Covid’ booster later this year"}, "tags": ["Older Posts"], "tweets": [], "movies": [], "links": ["https://ickonic.com/", "https://ickonic.com"], "authors": [], "publish_date": null}