{"result_id": "093043", "URL": "https://davidicke.com/2021/08/09/google-censors-plandemic-truth-because-its-heavily-invested-in-covid-vaccines/", "timestamp": "2023-04-25 14:58:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2021/08/09/google-censors-plandemic-truth-because-its-heavily-invested-in-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Google Censors Plandemic Truth Because it’s Heavily Invested in Covid “Vaccines”", "cleaned_text": "A big reason why Google, and by extension YouTube, is aggressively censoring all truth about the Wuhan coronavirus (Covid-19) “pandemic” is because the company is directly invested in the Chinese Virus injection from AstraZeneca and the University of Oxford.\n\nGoogle directly profits from the sale of Fauci Flu shots, in other words, which explains why one of the world’s most evil corporations is pulling down YouTube videos and censoring search results that draw attention to all science debunking the plandemic as manufactured fraud.\n\nDr. Reiner Fuellmich from the German Corona Extra-Parliamentary Inquiry Committee (Außerparlamentarischer Corona Untersuchungsausschuss) spoke with independent investigative reporter Whitney Webb recently about the collusion taking place between Google and AstraZeneca, and how the world is being deceived by it.\n\nDespite claims that its jab is “not-for-profit,” AstraZeneca developed its Chinese Virus injection via Adrian Hill and Sarah Gilbert from the Jenner Institute for Vaccine Research. The patents and royalty rights are likewise held by a private corporation known as Vaccitech, which was co-founded by Hill and Gilbert.\n\nAmong Vaccitech’s most prominent investors are Google Ventures, the Wellcome Trust, the British government, a Deutsche Bank capital investment company known as BRAAVOS, and various communist Chinese companies including Fosun Pharma.\n\n“All of these investors stand to profit from this ‘vaccine’ at some point in the near future, and Vaccitech has been quite open about the future profit potential with its shareholders, noting that the COVID-19 shot will most likely become an annual vaccine that is updated each season much like the seasonal flu vaccine,” explains Dr. Joseph Mercola.\n\n“Sure, AstraZeneca promised it would not make any profit from this COVID-19 vaccine, but there’s a time limit on this pledge. The not-for-profit vow expires once the pandemic is over, and AstraZeneca itself can decide when that is.”\n\nThe globalists want total control of your money and your body\n\nBy censoring all information and truth that threatens the Wuhan coronavirus (Covid-19) injection push, Google is protecting its financial stakes, as well as those of its allies and partners.\n\nGoogle is also trying to delve into the health care industry with the creation of new “telemedicine” and artificial intelligence (AI) programs that the company hopes will eventually be implemented as a replacement for human doctors.\n\n“They’ve started to sort of reimagine health care as a way of taking control over people’s lives, telling them it’s for the benefit of the public, the collective and also their personal health, whereas it’s really a way to implement these transhumanist or technocratic technologies under the guise of that being a health-related venture,” Webb says about the scheme.\n\nThe ultimate goal is to supplant all traditional forms of medicine and replace them with a centralized, globalist-controlled, Big Tech-run system predicated upon total enslavement of humanity.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/01/GOOGLE-EVIL-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/01/GOOGLE-EVIL-IMAGE.jpg", "image:width": "900", "image:height": "573", "url": "https://davidicke.com/2021/08/09/google-censors-plandemic-truth-because-its-heavily-invested-in-covid-vaccines/", "description": "A big reason why Google, and by extension YouTube, is aggressively censoring all truth about the Wuhan coronavirus (Covid-19) “pandemic” is because the company is directly invested in the Chinese Virus injection from AstraZeneca and the University of Oxford. Google directly profits from the sale of Fauci Flu shots, in other words, which explains why one of the world’s most evil corporations [...]", "title": "Google Censors Plandemic Truth Because it’s Heavily Invested in Covid “Vaccines”"}, "tags": [], "tweets": [], "movies": [], "links": ["https://articles.mercola.com/sites/articles/archive/2021/07/22/google-censorship-due-to-vaccine-investment.aspx", "https://www.ox.ac.uk/", "https://www.naturalnews.com/2021-06-29-darpa-built-covid-help-bill-gates-who.html", "https://evilgoogle.news/2021-07-23-google-censors-plandemic-truth-invested-covid-vaccines.html#"], "authors": [], "publish_date": null}