{"result_id": "093013", "URL": "https://davidicke.com/2023/01/02/japanese-researchers-investigate-link-between-covid-fake-vaccines-and-deaths-and-severe-adverse-reactions/", "timestamp": "2023-04-25 14:58:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/01/02/japanese-researchers-investigate-link-between-covid-fake-vaccines-and-deaths-and-severe-adverse-reactions/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Japanese Researchers Investigate Link Between ‘Covid; Fake Vaccines and Deaths and Severe Adverse Reactions", "cleaned_text": "Japanese researchers are investigating the mechanisms by which experimental Covid-19 vaccines could be causing deaths and severe adverse reactions.\n\nIn a report out of Japan, Hiroshima University School of Medicine Prof. Masataka Nagao highlighted how the bodies of vaccinated persons he performed autopsies on were abnormally warm, with upwards of 100 degree F (~40ºC) body temps.\n\n“The first concern was that the body temperatures of the corpses were very high when the police performed the autopsy,” Nagao observed. “The body temperatures were unusually high, such as 33 or 34 degrees celsius (91-93ºF).”\n\nIn other bodies, Nagao says “temperatures were very high at the time of death. Their body temperatures were above the normal temperature, more like over 40 degrees celsius (104ºF).”\n\nGraphing the data, Nagao’s research team found there were significant changes to the genetic makeup of vaccinated autopsied patients’ immune systems.\n\nThe research has led Nagao to conclude the vaccine causes immune system abnormalities that prompt inflammation throughout the body, which is likely the cause of the high body temperatures at the time of autopsy.\n\n“Based on the data and the circumstances alone, it is not possible to conclude that the vaccine was the cause of the deaths,” Prof. Nagao said, adding, “However, it is impossible to say that the vaccine was not the cause. We can only say that it is doubtful, but we believe that vaccination was sufficiently related to the immune abnormalities.”\n\nIn another report, dermatology expert Prof. Shigetoshi Sano of the Kochi University School of Medicine discussed discovering spike proteins at the site of skin lesions and other skin problems on patients who were vaccinated.\n\n“The spike protein derived from the vaccine was found in the skin,” Sano explained, highlighting a slide showing a bright green region on a lesion made visible by a special dye.\n\nRead More: Japanese Researchers Investigate Link Between Covid Jabs and Deaths, Severe Adverse Reactions", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/01/UPDATED-NO-VACCINE-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/01/UPDATED-NO-VACCINE-IMAGE.jpg", "image:width": "900", "image:height": "630", "url": "https://davidicke.com/2023/01/02/japanese-researchers-investigate-link-between-covid-fake-vaccines-and-deaths-and-severe-adverse-reactions/", "description": "Japanese researchers are investigating the mechanisms by which experimental Covid-19 vaccines could be causing deaths and severe adverse reactions. In a report out of Japan, Hiroshima University School of Medicine Prof. Masataka Nagao highlighted how the bodies of vaccinated persons he performed autopsies on were abnormally warm, with upwards of 100 degree F (~40ºC) body temps. 1. The DAM is [...]", "title": "Japanese Researchers Investigate Link Between ‘Covid; Fake Vaccines and Deaths and Severe Adverse Reactions"}, "tags": ["Japan", "vaccine", "Covid vaccines"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">1. The DAM is breaking in Japan, two more professors speaking out against the vaccine<br/>\nProf. Masanaka Nagao from Hiroshima University School of Medicine<br/>\n“We believe the vax is related to immune abnormalities”<br/>\n<a href=\"https://t.co/kirr2Ntzs1\">pic.twitter.com/kirr2Ntzs1</a></p>\n<p>— aussie17 (@_aussie17) <a href=\"https://twitter.com/_aussie17/status/1607008929430769665?ref_src=twsrc%5Etfw\">December 25, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://t.co/kirr2Ntzs1", "https://twitter.com/_aussie17/status/1607008929430769665?ref_src=twsrc%5Etfw", "https://www.infowars.com/posts/japanese-researchers-investigate-link-between-covid-jabs-and-deaths-severe-adverse-reactions/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}