{"result_id": "093012", "URL": "https://davidicke.com/2023/02/11/mass-murdering-cdc-adds-original-covid-mrna-fake-vaccine-to-childhood-schedule-despite-known-harms/", "timestamp": "2023-04-25 14:58:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/02/11/mass-murdering-cdc-adds-original-covid-mrna-fake-vaccine-to-childhood-schedule-despite-known-harms/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Mass-Murdering CDC Adds Original ‘Covid’ mRNA Fake Vaccine to Childhood Schedule Despite Known Harms", "cleaned_text": "The Centers for Disease Control and Prevention on Thursday added the two-shot primary series mRNA COVID-19 vaccine to its routine immunization schedule for children and adults, formalizing the agency’s vaccine advisory committee’s unanimous recommendation made in October 2022.\n\nThe Centers for Disease Control and Prevention (CDC) on Thursday added COVID-19 vaccination to its routine immunization schedule for children and adults.\n\nAlthough the CDC does not have the authority to set requirements itself, the agency’s immunization schedule provides formal guidance for state and local public health officials who set the rules for which vaccines are required to attend school.\n\nThe schedule also is the basis for vaccine recommendations made by most physicians.\n\n“Given all that we have learned about the dangers and ineffectiveness of COVID-19 shots over the last two years, it is horrifying to see the CDC now recommend this as a routine shot to children,” Mary Holland, Children’s Health Defense (CHD) president and general counsel told The Defender.\n\n“Although it is unsurprising given the agency capture, it is nonetheless tragic,” she added.\n\nThursday’s move formalized the recommendation by the agency’s vaccine advisory committee, which on Oct. 20, 2022, voted unanimously (15-0) to recommend adding COVID-19 vaccines for children as young as 6 months old to the new Child and Adolescent Immunization Schedule.\n\nUnder the new guidelines, the CDC recommends healthy children 6 months to 11 years old receive a primary series of two doses of the mRNA Moderna or Pfizer-BioNTech monovalent COVID-19 vaccine, followed by a booster of the bivalent shot.\n\nIt recommends that healthy people age 12 and older receive two doses of either the Moderna, Pfizer or Novavax vaccine followed by a bivalent booster.\n\nAll COVID-19 vaccines being administered in the U.S. to people under 18 are Emergency Use Authorized (EUA) products. The U.S. Food and Drug Administration (FDA) did grant full approval to Pfizer’s Comirnaty COVID-19 vaccine for ages 12 and older, however, the Comirnaty vaccine is not available in the U.S. — which means all children who get the Pfizer vaccine are getting an EUA product.\n\nRead More: ‘Tragic’: CDC Adds Original COVID mRNA Vaccine to Childhood Schedule Despite Known Harms", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/08/CDC.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/08/CDC.jpg", "image:width": "900", "image:height": "500", "url": "https://davidicke.com/2023/02/11/mass-murdering-cdc-adds-original-covid-mrna-fake-vaccine-to-childhood-schedule-despite-known-harms/", "description": "The Centers for Disease Control and Prevention on Thursday added the two-shot primary series mRNA COVID-19 vaccine to its routine immunization schedule for children and adults, formalizing the agency’s vaccine advisory committee’s unanimous recommendation made in October 2022. The Centers for Disease Control and Prevention (CDC) on Thursday added COVID-19 vaccination to its routine [...]", "title": "Mass-Murdering CDC Adds Original ‘Covid’ mRNA Fake Vaccine to Childhood Schedule Despite Known Harms"}, "tags": ["Covid vaccines", "experimental vaccines", "CDC"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">This reckless action is final proof of the cynicism, corruption + capture of a once exemplary public health agency. ACIP members have demonstrated that fealty to their pharma overlords eclipses any residual concerns they may harbor for child welfare.<a href=\"https://t.co/UkRQBxAvo2\">https://t.co/UkRQBxAvo2</a></p>\n<p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1583243667560538112?ref_src=twsrc%5Etfw\">October 20, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.cdc.gov/vaccines/schedules/hcp/index.html", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/", "https://www.reuters.com/world/us/us-cdc-advisers-approve-adding-covid-shots-vaccine-schedules-2022-10-20/", "https://childrenshealthdefense.org/defender/childhood-covid-vaccine-schedule/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://t.co/UkRQBxAvo2", "https://twitter.com/RobertKennedyJr/status/1583243667560538112?ref_src=twsrc%5Etfw", "https://www.cdc.gov/vaccines/covid-19/images/COVID19-vaccination-schedule-most-people.png", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://childrenshealthdefense.org/defender/childrens-health-defense-sues-fda-pfizer-comirnaty-covid-vaccine/", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/?utm_source=salsa&eType=EmailBlastContent&eId=2cbc918a-8bc7-47ce-af80-70306725676d", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}