{"result_id": "093045", "URL": "https://davidicke.com/2023/04/15/swiss-halt-covid-vaccinations-but-still-insist-they-work/", "timestamp": "2023-04-25 14:58:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/15/swiss-halt-covid-vaccinations-but-still-insist-they-work/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Swiss halt Covid vaccinations – but still insist they work", "cleaned_text": "LAST week the Swiss government hit the headlines with its surprise announcement that it would no longer be recommending Covid vaccines. While other countries, including the UK, were busy announcing plans for their 2023 rollout, the Swiss Federal Office for Public Health (FOPH) and the Federal Commission for Vaccination Issues (EKIF) revoked the vaccine recommendation for all age groups, including those designated at high risk, namely the over-65s and pregnant women.\n\nYou could be forgiven for thinking that in the light of damning reports confirming serious side-effects and deaths resulting from widespread, even mandatory, vaccination programmes worldwide, the Swiss decision was prompted by caution and health priorities.\n\nBut no. It’s all because the vaccines have been so successful! Or so they would have us believe. The Swiss authorities have described their ‘achievement’ thus: ‘Nearly everyone has been vaccinated and/or contracted and recovered from Covid-19. Their immune system has therefore been exposed to the coronavirus. In spring/summer 2023, the virus will likely circulate less. The current variants also cause rather mild illness.’\n\nNowhere do they retract any of the claims made at the outset of the pandemic, and posted through everyone’s letterbox, that the vaccines were safe and effective. Nor have they banned the vaccines. Official blanket recommendations have been withdrawn, but doctors may continue to administer vaccines in individual cases under certain conditions, but should they do so the doctors themselves will bear the risk of liability for any vaccination damage.\n\nThe Federal Office for Public Health strategy document of November 2022 states that ‘compensation by the federal government to injured persons for vaccination damage can only be considered for vaccinations officially recommended or ordered’. In practice however, the government stepped in only if the damage was not covered by the vaccine manufacturer, the person vaccinating, or an insurance company.\n\nGiven the volume of advice circulated at the outset of the pandemic in Switzerland, already reported in TCW, that the vaccines are safe and getting jabbed was socially responsible, it is hardly likely that the ‘person vaccinating’, i.e. the doctor, would have personally given every patient detailed information about the risks, the side-effects and the limited effectiveness of the Covid vaccinations.\n\nRead More – Swiss halt Covid vaccinations – but still insist they work", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/10/VACCINE-MASS-MURDER-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/10/VACCINE-MASS-MURDER-IMAGE.jpg", "image:width": "898", "image:height": "591", "url": "https://davidicke.com/2023/04/15/swiss-halt-covid-vaccinations-but-still-insist-they-work/", "description": "LAST week the Swiss government hit the headlines with its surprise announcement that it would no longer be recommending Covid vaccines. While other countries, including the UK, were busy announcing plans for their 2023 rollout, the Swiss Federal Office for Public Health (FOPH) and the Federal Commission for Vaccination Issues (EKIF) revoked the vaccine recommendation for all age groups, [...]", "title": "Swiss halt Covid vaccinations – but still insist they work"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/switzerland-stops-recommending-covid-19-vaccination_5180835.html?utm_source=goodeveningnoe&src_src=goodeveningnoe&utm_campaign=gv-2023-04-09&src_cmp=gv-2023-04-09&utm_medium=email&est=dQRSPvN35Xr1BcXisCZrTZdvY2VQ8JKQrWGyzWsxXdQs6qH%2BJpJ9q%2FpN9%2B6J7g%3D%3D", "https://www.conservativewoman.co.uk/if-bill-gates-himself-says-the-jabs-dont-work", "https://www.conservativewoman.co.uk/swiss-halt-covid-vaccinations-but-still-insist-they-work/"], "authors": [], "publish_date": null}