{"result_id": "093003", "URL": "https://davidicke.com/2023/04/04/college-student-injured-by-moderna-vaccine-says-independence-now-just-a-distant-memory/", "timestamp": "2023-04-25 14:58:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/04/college-student-injured-by-moderna-vaccine-says-independence-now-just-a-distant-memory/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "College Student Injured by Moderna Vaccine Says Independence Now Just a ‘Distant Memory’", "cleaned_text": "At age 21, Philadelphia native Andre Cherry had an active life and a promising future, as he worked toward completing his bachelor’s degree in English. But in an interview with The Defender, Cherry said all that ended after his second Moderna COVID-19 vaccine.\n\nAt age 21, Philadelphia native Andre Cherry had an active life and a promising future, as he worked toward completing his bachelor’s degree in English.\n\nCherry’s studies ground to a halt, however, shortly after his second dose of the Moderna COVID-19 vaccine. Within hours, Cherry experienced an adverse reaction that was moderate at first but grew more intense.\n\nTo this day, Cherry experiences the random, daily onset of tremors, muscle spasms, involuntary vocalizations and temporary paralysis.\n\nCherry, now 23, shared his experience with The Defender. He provided extensive medical documentation to support his story.\n\n‘Only time I don’t have symptoms is when I’m asleep’\n\nCherry received the two-dose Moderna series on May 26, 2021, and June 23, 2021. After the second dose, he developed a “moderate tremor in my left arm, where I was injected both times,” he said.\n\nBut what started as a moderate tremor quickly spiraled into a range of severe adverse reactions, which continue to afflict Cherry to the present day.\n\n“I experience tremors in all of my limbs. Dystonia of my face, neck, torso, diaphragm and extremities. Muscle spasms throughout my body. Violent involuntary movements such as punching, kicking, jumping, walking and running — known as ballismus [hemiballismus]. Involuntary speech, laughter and screaming. And flaccid paralysis of my neck, torso and extremities.\n\n“All of these symptoms are intermittent and random, varying in duration, combination and intensity on a daily basis.”\n\nRead More: College Student Injured by Moderna Vaccine Says Independence Now Just a ‘Distant Memory’", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2021/01/moderna.jpg", "image": "https://davidicke.com/wp-content/uploads/2021/01/moderna.jpg", "image:width": "900", "image:height": "500", "url": "https://davidicke.com/2023/04/04/college-student-injured-by-moderna-vaccine-says-independence-now-just-a-distant-memory/", "description": "At age 21, Philadelphia native Andre Cherry had an active life and a promising future, as he worked toward completing his bachelor’s degree in English. But in an interview with The Defender, Cherry said all that ended after his second Moderna COVID-19 vaccine. At age 21, Philadelphia native Andre Cherry had an active life and a promising future, as he worked toward completing his bachelor’s [...]", "title": "College Student Injured by Moderna Vaccine Says Independence Now Just a ‘Distant Memory’"}, "tags": ["Moderna", "Covid vaccines", "experimental vaccines"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/wp-content/uploads/andre-cherry-modern-covid-vaccine-card.jpg", "https://childrenshealthdefense.org/defender/", "https://www.ninds.nih.gov/health-information/disorders/dystonia", "https://www.ncbi.nlm.nih.gov/books/NBK559127/", "https://www.sciencedirect.com/topics/medicine-and-dentistry/flaccid-paralysis", "https://childrenshealthdefense.org/defender/andre-cherry-moderna-vaccine-injury/?utm_source=luminate&utm_medium=email&utm_campaign=defender&utm_id=20230403", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}