{"result_id": "093034", "URL": "https://davidicke.com/2023/04/05/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "timestamp": "2023-04-25 14:58:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/04/05/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "“Unacceptable”: Calculating the Covid Vaccine Fatality Rate", "cleaned_text": "Let’s clear up three points first:\n• Forcing people to be injected, by coercion and threats, was a despicable intervention. Only an immoral mind could find it acceptable, and society has no shortage of immoral, ‘normal’ minds, as history shows.\n• Covid vaccines have caused severe adverse effects and deaths. Only a prejudiced mind can deny this statement. They are neither safe nor as effective as initially claimed. There is considerable uncertainty about their true effectiveness (see here and here, for example).\n• That any vaccine can cause death is not some novel discovery. The ultimate questions in science are quantitative, not qualitative: How often? What is the fatality rate of Covid vaccines? How does it compare with the fatality rate of, say, a flu vaccine?\n• Fatality after a flu shot is extremely rare: one death per five million.\n• Short-term fatality after Covid shots is many folds higher: dozens of deaths per one million. That’s unacceptable, or at least was unacceptable for any vaccine before 2021.\n• We should also add long-term mortality, which is difficult to quantify. For instance, fatal arrhythmia two years later due to subclinical myocarditis. Is this tragic death an example or not? Who can tell? Unexpected death of young people had happened before, rarely.\n• I do not think, however, that short-term Covid vaccine deaths have been a main contributor to excess mortality in the past two years. With some exceptions (here and here, for example), it is difficult to detect these deaths in country-level statistics.\n\nIn the normal course of science, regulatory agencies would have set up well-designed cohort studies to estimate the fatality rate of Covid vaccines. That did not happen. They were too busy advertising the shots as ‘safe and effective’, so we have to derive estimates from other sources. That’s far from rigorous science but better than nothing.\n\nI used several methods to estimate the likely range. Two sources allowed me to exclude implausible values. Other sources allowed me to narrow the range.\n\nBelow, I compute the rate as the number of deaths per 100,000, rather than per million, and consider the number of vaccinated people, not the number of doses.\n\nA landmark study, by a highly qualified research team, has estimated the rate of serious adverse events in the clinical trials of Pfizer and Moderna mRNA vaccines. The rate of such events was roughly 10-15 per 10,000 (100-150 per 100,000) above the rates in the placebo arms.", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2020/06/shutterstock_493063273-e1592032593486.jpg", "image": "https://davidicke.com/wp-content/uploads/2020/06/shutterstock_493063273-e1592032593486.jpg", "image:width": "900", "image:height": "600", "url": "https://davidicke.com/2023/04/05/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "description": "Let’s clear up three points first: Forcing people to be injected, by coercion and threats, was a despicable intervention. Only an immoral mind could find it acceptable, and society has no shortage of immoral, ‘normal’ minds, as history shows. Covid vaccines have caused severe adverse effects and deaths. Only a prejudiced mind can deny this statement. They are neither safe nor as effective as [...]", "title": "“Unacceptable”: Calculating the Covid Vaccine Fatality Rate"}, "tags": ["mrna vaccines", "Covid vaccines", "experimental vaccines"], "tweets": [], "movies": [], "links": ["https://filiperafaeli.substack.com/p/the-day-i-understood-the-good-german", "https://wherearethenumbers.substack.com/p/how-to-create-the-illusion-your-vaccine?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://onlinelibrary.wiley.com/doi/10.1111/jep.13839", "https://www.kgun9.com/news/local-news/tucson/golder-ranch-fire-captain-dies", "https://shahar-26393.medium.com/how-severe-was-the-pandemic-in-europe-658a7f18c669", "https://econpapers.repec.org/paper/waieconwp/22_2f11.htm", "https://brownstone.org/articles/short-term-fatality-rate-in-israel-of-a-third-dose/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://dailysceptic.org/2023/04/04/unacceptable-calculating-the-covid-vaccine-fatality-rate/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}