{"result_id": "093031", "URL": "https://davidicke.com/2023/01/21/neurosurgeon-proves-how-covid-fake-vaccine-can-damage-the-brain-cause-cancer/", "timestamp": "2023-04-25 14:58:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://davidicke.com/wp-content/uploads/2020/05/favicon.ico", "canonical": "https://davidicke.com/2023/01/21/neurosurgeon-proves-how-covid-fake-vaccine-can-damage-the-brain-cause-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "davidicke.com", "title": "Neurosurgeon proves how ‘Covid’ Fake Vaccine can damage the Brain & cause Cancer", "cleaned_text": "Retired American neurosurgeon Russell Blaylock recently gave an in-depth presentation on the adverse effects the spike proteins, induced by Covid-19 vaccination, have on the body.\n\nThe doctor shared shocking discoveries about neurological damage, cancer rates, cardiac arrest and other exacerbating health issues as well as their connection to mRNA technology.\n\nHis presentation titled ‘Spike Proteins and Neurodegeneration: Effect of artificial exosomes on the nervous system in the form of an injection’ (which can be viewed in full at the end of this article) covers the damage the spike protein does to the brain, the elderly and unborn children.\n\nDr Blaylock also explains in detail the mechanisms that cause the damage and used several published papers to demonstrate the harm. And ends with some advice for those who have been vaccine-injured.\n\nWith all vaccines, and this injection in particular, if you stimulate the peripheral immune system within minutes there’s microglial activation in the brain – the brain’s primary immune cell. This is what Dr. Blaylock describes as “sickness behaviour.”\n\nWhen there’s systemic inflammation or any kind of trauma occurs in the body, it produces inflammation and activation of the immune system. This sends a signal to the brain within minutes and starts activating the microglia which is the inflammatory, cytotoxic cell in the brain.\n\nRead More: Neurosurgeon proves how COVID Vaccine can damage the Brain & cause Cancer", "opengraph": {"image:secure_url": "https://davidicke.com/wp-content/uploads/2020/12/USELESS-VACCINE-IMAGE.jpg", "image": "https://davidicke.com/wp-content/uploads/2020/12/USELESS-VACCINE-IMAGE.jpg", "image:width": "900", "image:height": "573", "url": "https://davidicke.com/2023/01/21/neurosurgeon-proves-how-covid-fake-vaccine-can-damage-the-brain-cause-cancer/", "description": "Retired American neurosurgeon Russell Blaylock recently gave an in-depth presentation on the adverse effects the spike proteins, induced by Covid-19 vaccination, have on the body. The doctor shared shocking discoveries about neurological damage, cancer rates, cardiac arrest and other exacerbating health issues as well as their connection to mRNA technology. His presentation titled ‘Spike [...]", "title": "Neurosurgeon proves how ‘Covid’ Fake Vaccine can damage the Brain & cause Cancer"}, "tags": ["Covid vaccines", "experimental vaccines"], "tweets": [], "movies": [], "links": ["https://wikispooks.com/wiki/Russell_Blaylock", "https://expose-news.com/2023/01/20/neurosurgeon-proves-how-covid-vaccine-can-damage-the-brain-cause-cancer/", "https://shop.davidicke.com/product/the-trap/"], "authors": [], "publish_date": null}