{"result_id": "094013", "URL": "https://shop.davidwolfe.com/products/cymbiotika-d3-k2-coq10", "timestamp": "2023-04-25 14:58:46 CEST+0200", "meta": {"description": "Cymbiotika D3 K2 CoQ10 is an organic blend of the highest quality-sourced, plant-based materials available today, supported by numerous studies and scientific research.", "lang": "en", "keywords": "", "favicon": "//cdn.shopify.com/s/files/1/2718/3098/t/20/assets/favicon.png?v=169360117983311101101630009208", "canonical": "https://shop.davidwolfe.com/products/cymbiotika-d3-k2-coq10", "encoding": "utf-8"}, "image": null, "domain": "shop.davidwolfe.com", "title": "Cymbiotika D3+K2+CoQ10", "cleaned_text": "Nourish your Immune System with the world's most potent epigenetic substance: Vitamin D3. Vitamin D3 turns on over 3000 genes associated with healing. Vitamin D3 is most important during the winter months and/or working months when sunlight is not as abundant.\n\nVitamin K2 is known to prevent soft-tissue calcification and may protect the heart.\n\nWe believe this to be the most comprehensive D3 K2 CoQ10 formula ever designed, using our micelle delivery system. Micelle technology guarantees maximum absorption making the vital nutrients in this formula and wrapping them up in highly-nutritious phosphatidyl choline, making all the nutrients easily available to our cells.\n\nCymbiotika D3 K2 CoQ10 is an organic blend of the highest quality-sourced, plant-based materials available today, supported by numerous studies and scientific research. Our Vitashine™ D3 is the world’s only Vegan and Vegetarian Society registered plant-source Vitamin D3 ingredient in the world. D3 is the most important epigenetic substance ever discovered, in charge of activating over 3,000 genes associated with healing. D3 is critical for regulating the absorption of calcium and phosphorus, two minerals that play an important role in the strength and density of our teeth and skeletal system.\n\nThere are dozens of studies highlighting the powerful synergy between Vitamin D3 and Vitamin K2 and their ability to positively affect the cardiovascular system. We have included two of the most important forms of vitamin K2: mk-4 & mk-7. Our MenaQ7® mk7 is the only clinically validated, patented vitamin K2 available on the market today. This mk7 is entirely in the “trans” form, making it the most bio-available, longest lasting and bio-active form of mk7, versus other mk7 products that have only a 10% absorption rate, at best.\n\nOur mk-4 is derived from fermented garbanzo beans, and is critical for mothers and developing children and is the only K2 that crosses the placenta barrier.\n\nMenaQ7® is a registered trademark of NattoPharma, Norway; Patented in the United States and Canada.” (US Patent Numbers 8,728,553 & 8,354,129; Canada Patent Number 2,347,387).\n\nNow for the most important antioxidant for the cardiovascular system. CoQ10, in Ubiquinol form, trademarked by Kaneka™. Ubiquinol helps to control the harmful effects of free radicals and oxidative stress, which are directly related to the ageing process. This patented version of CoQ10 has higher absorption rates than standard CoQ10 products.\n\nWhat makes Cymbiotika’s D3/K2 product different from other products on the market?\n• No synthetics. Created with natural compounds directly from our Earth.\n• Clean delivery: easy to use liquid; NO capsules, powders or tablets to swallow\n• Enhanced absorption: Micelle Technology is the most advanced delivery system today, guaranteeing nutrients make it into the cell so nothing is wasted.\n• Delicious flavour: that curbs cravings and boosts metabolism while having a positive effect on energy levels.\n\nCymbiotika formulates products with only the highest quality organic and wild-crafted ingredients. This product contains no synthetic chemicals, animal products, GMOs, fish, soy, wheat, gluten, corn, nuts, dairy, lactose, eggs, yeast, sugar, solvents, alcohols, fillers, binders, artificial flavours, additives, preservatives, synthetic colourings, fragrances, silicone or BPA.\n\nAll of these ingredients have been put into micelle form, enhancing the absorption rate to almost 100%. Nothing gets wasted. This is now considered a food. 🔑\n\nDisclaimer* If taking a blood-thinning medication, consult a healthcare practitioner before using this product.", "opengraph": {"type": "product", "title": "Cymbiotika D3+K2+CoQ10", "image": "http://cdn.shopify.com/s/files/1/2718/3098/products/photo_2020-02-28_20-24-15_600x600.jpg?v=1610482886", "image:secure_url": "https://cdn.shopify.com/s/files/1/2718/3098/products/photo_2020-02-28_20-24-15_600x600.jpg?v=1610482886", "description": "Cymbiotika D3-K2-CoQ10\nNourish your Immune System with the world's most potent epigenetic substance: Vitamin D3. Vitamin D3 turns on over 3000 genes associated with healing. Vitamin D3 is most important during the winter months and/or working months when sunlight is not as abundant. \nVitamin K2 is known to prevent soft-tissue calcification and may protect the heart. \nCoQ10 assists with energy production.\nWe believe this to be the most comprehensive D3 K2 CoQ10 formula ever designed, using our micelle delivery system. Micelle technology guarantees maximum absorption making the vital nutrients in this formula and wrapping them up in highly-nutritious phosphatidyl choline, making all the nutrients easily available to our cells. \nCymbiotika D3 K2 CoQ10 is an organic blend of the highest quality-sourced, plant-based materials available today, supported by numerous studies and scientific research. Our Vitashine™ D3 is the world’s only Vegan and Vegetarian Society registered plant-source Vitamin D3 ingredient in the world. D3 is the most important epigenetic substance ever discovered, in charge of activating over 3,000 genes associated with healing.  D3 is critical for regulating the absorption of calcium and phosphorus, two minerals that play an important role in the strength and density of our teeth and skeletal system.  \nThere are dozens of studies highlighting the powerful synergy between Vitamin D3 and Vitamin K2 and their ability to positively affect the cardiovascular system.  We have included two of the most important forms of vitamin K2: mk-4 &amp; mk-7. Our MenaQ7® mk7 is the only clinically validated, patented vitamin K2 available on the market today. This mk7 is entirely in the “trans” form, making it the most bio-available, longest lasting and bio-active form of mk7, versus other mk7 products that have only a 10% absorption rate, at best.\nOur mk-4 is derived from fermented garbanzo beans, and is critical for mothers and developing children and is the only K2 that crosses the placenta barrier.\nMenaQ7® is a registered trademark of NattoPharma, Norway; Patented in the United States and Canada.”  (US Patent Numbers 8,728,553 &amp; 8,354,129; Canada Patent Number 2,347,387).\nNow for the most important antioxidant for the cardiovascular system. CoQ10, in Ubiquinol form, trademarked by Kaneka™. Ubiquinol helps to control the harmful effects of free radicals and oxidative stress, which are directly related to the ageing process. This patented version of CoQ10 has higher absorption rates than standard CoQ10 products.\nWhat makes Cymbiotika’s D3/K2 product different from other products on the market?\n\n\nNo synthetics. Created with natural compounds directly from our Earth.\n\nClean delivery: easy to use liquid; NO capsules, powders or tablets to swallow\n\nEnhanced absorption: Micelle Technology is the most advanced delivery system today, guaranteeing nutrients make it into the cell so nothing is wasted.\n\nDelicious flavour: that curbs cravings and boosts metabolism while having a positive effect on energy levels.\n\nSafe for children.\n\nChina Free\n\nProduced in a GMP Organic certified lab\n\n3rd Party tested for purity\n\nZero Heavy Metals\n\nNon-GMO\n\nPackaged in a 60 ml glass bottle with coated UV Protection Technology\n\nCymbiotika formulates products with only the highest quality organic and wild-crafted ingredients. This product contains no synthetic chemicals, animal products, GMOs, fish, soy, wheat, gluten, corn, nuts, dairy, lactose, eggs, yeast, sugar, solvents, alcohols, fillers, binders, artificial flavours, additives, preservatives, synthetic colourings, fragrances, silicone or BPA.\nIngredients\nD3 - Vegan (Vitashine)™️\nK2 - MK-7 (MenaQ7)™️\nK2 - Mk-4\nCoq10 - (Kaneka Ubiquinol)™️\nBeta Carotene\nSelenium\nOrganic Vitamin E\nOrganic Phosphatidlycholine\nOrganic Monk Fruit\nOrganic Lemon Essential Oil 🔑\nAll of these ingredients have been put into micelle form, enhancing the absorption rate to almost 100%. Nothing gets wasted. This is now considered a food. 🔑\n\nDosage\nAdults: 8 pumps (2ml) Children: 4 pumps (1ml)\nDisclaimer* If taking a blood-thinning medication, consult a healthcare practitioner before using this product.\n", "price:amount": "77.00", "price:currency": "USD", "url": "https://shop.davidwolfe.com/products/cymbiotika-d3-k2-coq10", "site_name": "David Wolfe Shop"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["David Wolfe Shop"], "publish_date": null}