{"result_id": "094012", "URL": "https://www.davidwolfe.com/11-american-men-oral-sexually-transmitted-disease/", "timestamp": "2023-04-25 14:58:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/11-american-men-oral-sexually-transmitted-disease/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "11% Of American Men Have This Oral Sexually Transmitted Disease", "cleaned_text": "A new study published in the journal Annals of Internal Medicine has found that about one in nine American men is infected with the oral form of human papillomavirus (HPV). The nationwide rates for oral HPV infections found in the study are 11.5% of men and 3.2% of women.\n\nIf the researchers estimates are correct, that would mean 11 million men and 3.2 million U.S. women have this common virus.\n\nAn infection with HPV, which is transmitted through intimate skin-to-skin contact, has the potential to cause cancer in several areas of the body, including the throat, anus, penis and vagina.\n\nThe U.S. Centers for Disease Control and Prevention claims that nearly all men and women will become infected with at least one type of HPV, which is a group of 150 related viruses, at some point in their lives.\n\nIn explaining the cause of the difference in prevalence between men and women, Ashish A. Deshmukh, senior author of the study and an assistant professor at the University of Florida’s College of Public Health and Health Professions, told CNN, “One suspects that the HPV persists longer (means doesn’t clear easily) among men and that might be causing increased prevalence.”\n\nDeshmukh also surmised, “It is also possible that men acquire oral HPV more readily than women,” he said, with another possibility being that after a first infection women develop greater resistance to subsequent infections. “Further research is needed to understand the reason behind this,” Deshmukh stated.\n\nOn average, 38,793 cases of HPV-related cancer were diagnosed annually — 59% of them in women and 41% in men — in the United States between 2008 and 2012.\n\nCervical cancer is known to be caused by HPV, and while an HPV vaccine is available for both men and women, one mother has made the potential debilitating effects of the HPV vaccine known after her daughter suffered immense and unyielding pain after taking the vaccine.\n\nThe HPV vaccine is strongly advertised as necessary to protect children from the Human Papilloma Virus. The recommended vaccination age for boys and girls is 11 to 12 years old, however, girls can get the vaccination as late as 26 and boys can receive it as late as 21. Pharmaceutical companies claim the vaccine is 100% effective against protecting a person from HPV and any cancers that may form because of it.\n\nHowever, side effects for both Gardasil and Cervarix include:\n\nSevere Stomach Pain\n\n Swollen Glands\n\n Easy Bruising or Bleeding, Confusion, or Unusual Weakness\n\n Fever, Chills, Body Aches, General Ill Feeling\n\n Chest Pain\n\n Shortness of Breath\n\n Muscle Pain\n\nEach dose of Gardasil contains polysorbate 80 and 225mcg of aluminum. Cervarix is made by gene-cloning cells of Trichoplusia ni, a worm-like insect, and contains 500mcg of aluminum.\n\nBy February 2011, more than 20,500 adverse reaction reports pertaining to Gardasil were filed with the U.S. government — an average of 12 reports per day. Nearly half of all of these reports required a doctor or emergency room visit, with hundreds of teenage girls and young women needing extended hospitalization.\n\nMany of the vaccine recipients were stricken with serious and life-threatening disabilities, including Guillain-Barre syndrome (paralysis), seizures, convulsions, swollen limbs, chest pain, heart irregularities, kidney failure, visual disturbances, arthritis, difficulty breathing, severe rashes, persistent vomiting, miscarriages, menstrual irregularities, reproductive complications, genital warts, vaginal lesions and even HPV infection — the very thing Gardasil and Cervarix were meant to vaccinate against.", "opengraph": {"locale": "en_US", "type": "article", "title": "11% Of American Men Have This Oral Sexually Transmitted Disease - David Avocado Wolfe", "description": "A new study published in the journal Annals of Internal Medicine has found that about one in nine American men is infected with the oral form of human papillomavirus (HPV). The nationwide rates for oral HPV infections found in the study are 11.5% of men and 3.2% of women. If the researchers estimates are correct, …", "url": "https://www.davidwolfe.com/11-american-men-oral-sexually-transmitted-disease/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "percent", "article:section": "health", "article:published_time": "2017-10-18T11:26:57-07:00", "article:modified_time": "2017-11-13T22:47:53-08:00", "updated_time": "2017-11-13T22:47:53-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2017/10/men-hpv-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2017/10/men-hpv-FI.jpg", "image:width": "800", "image:height": "419"}, "tags": ["one", "nine", "men", "HPV", "percent", "Cervarix", "in", "American", "Gardasil"], "tweets": [], "movies": [], "links": ["http://annals.org/aim/article/2657698/oral-human-papillomavirus-infection-differences-prevalence-between-sexes-concordance-genital", "http://www.cnn.com/2017/10/16/health/oral-hpv-infections-men-study/index.html?sr=fbCNN101617oral-hpv-infections-men-study0514PMStory", "https://www.davidwolfe.com/mother-see-hpv-vaccine-daughter/", "http://annals.org/aim/article/2657698/oral-human-papillomavirus-infection-differences-prevalence-between-sexes-concordance-genital", "http://www.cnn.com/2017/10/16/health/oral-hpv-infections-men-study/index.html?sr=fbCNN101617oral-hpv-infections-men-study0514PMStory", "https://www.davidwolfe.com/mother-see-hpv-vaccine-daughter/", "https://www.naturalnews.com/031432_HPV_vaccines_alternatives.html"], "authors": [""], "publish_date": "2017-10-18T11:26:57-07:00"}