{"result_id": "094016", "URL": "https://www.davidwolfe.com/the-differences-between-organic-free-range-eggs/", "timestamp": "2023-04-25 14:58:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/the-differences-between-organic-free-range-eggs/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "What Color Egg Yolks Do You Eat? - Organic Vs. Free-Range Eggs", "cleaned_text": "DW STAFF – The National Organic Program is run by the U.S. Department of Agriculture to maintain standards for organic food production on a national scale. But what is the difference between ‘organic’ food and ‘free-range’ food, specifically eggs?\n\nWith this article, allow me to give you a brief run through of the two certifications and give you a little insight as to what they mean for food consumers.\n\nAccording to standards set by the U.S. Department of Agriculture, organic chickens must be fed only feed that is grown without the use of fertilizers or pesticides. Additionally, they cannot be fed hormones or antibiotics at any time during their lives. They can, however, be given vaccinations to prevent disease and must be provided reasonable access to the outdoors, although they can be kept inside for medical treatment purposes.\n\nAs is to be expected with food certifications, there is quite a large marketing aspect related to the National Organic Program, as laid out in the U.S. Environmental Protection Agency’s document on organic farming.\n\nThe National Organic Program regulates marketing standards related to organic agriculture. What this means for us consumers is that produce such as chicken cannot be labelled ‘organic’ unless it meets certain criteria. I suggest you take a look at the official government document I’ve linked to again here related to the National Organic Program’s regulations.\n\nFor chicken to be classified as ‘free-range,’ it must have been granted access to the outdoors during the raising process. There are no specific time or space limitations set for this, making the term a little ambiguous.\n\nIn fact, there is quite little regulation in general regarding free-range chicken, with many questions being raised by credible sources regarding the practices involved.\n\nIt becomes even more ambiguous when you factor in that free-range chicken does not have to be ‘organic.’ In other words, growing chicken free-range does not instantly qualify their eggs to be labelled as ‘organic.’\n\nSo which should I buy?\n\nIt’s a bit hard to tell at this moment, isn’t it? Both sides seem to have their perks and drawbacks, with each classification being a bit ambiguous and not exactly helpful to the end consumer.\n\nAnd such is the case when buying many types of mass produced food of either classification, as mentioned in this article from WebMD.\n\nBut there actually is a third option that’s worth looking into, and that is that of free-range organic chicken, typically grown by private, local farmers.\n\nOn the left is the yolk of an egg produced by a free-range organic chicken, on the right is just the opposite – a store-bought, mass produced egg.\n\nNotice the difference in color. This is a common difference that will instantly give away ‘store bought’ eggs in the presence of natural, free-range organic eggs.\n\nThe egg yolk’s color has implications regarding the nutrition and health of the chicken that produced it. A darker yolk is an indication of a nutritious and balanced diet rich in xanthophyll, omega-3 fatty acids and meats.\n\nSimply put, it takes quite a bit of time and energy to feed free-range chickens that produce eggs with a darker yolk. While the above hyperlinked article goes into a bit more detail regarding the commercial chicken feeding process, the gist of it is that egg factories feed their chickens lots and lots of corn, which gives their yolk a golden color.\n\nOn the other hand, free-range organic chicken farmers must feed their chickens lots of fresh greens, including kale, collard and broccoli to produce the dark orange yolk that has been proven to not only taste richer but also be more rich in nutrients and vitamins.\n\nI hope that, after reading this article, you will choose to buy free-range organic chicken eggs from your local farmer. Most should not have a problem allowing you to ask questions regarding the raising of their chickens – maybe some might even allow you to walk through their property yourself.\n\nBut if that option does not work for you, please do consider regular store bought ‘organic’ or ‘free range’ eggs. Supporting those types of eggs is far more ethical than to support the means by which eggs are conventionally grown.", "opengraph": {"locale": "en_US", "type": "article", "title": "What Color Egg Yolks Do You Eat? - Organic Vs. Free-Range Eggs - David Avocado Wolfe", "description": "DW STAFF – The National Organic Program is run by the U.S. Department of Agriculture to maintain standards for organic food production on a national scale. But what is the difference between ‘organic’ food and ‘free-range’ food, specifically eggs? With this article, allow me to give you a brief run through of the two certifications …", "url": "https://www.davidwolfe.com/the-differences-between-organic-free-range-eggs/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "which eggs should I buy", "article:section": "Animals", "article:published_time": "2015-08-30T20:16:57-07:00", "article:modified_time": "2015-12-01T18:27:12-08:00", "updated_time": "2015-12-01T18:27:12-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2015/08/FreeRangeVSOrganic.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2015/08/FreeRangeVSOrganic.jpg", "image:width": "800", "image:height": "600"}, "tags": ["chicken", "free range eggs", "which eggs should I buy", "organic vs free range", "eggs", "food"], "tweets": [], "movies": [], "links": ["https://upload.wikimedia.org/wikipedia/commons/0/04/Collecting_eggs_on_an_organic_farm.jpg", "http://www.epa.gov/agriculture/torg.html", "http://www.epa.gov/agriculture/torg.html", "https://upload.wikimedia.org/wikipedia/commons/e/eb/Free_range_chicken_flock.jpg", "http://www.theglobeandmail.com/life/the-dark-side-of-free-range-chickens/article1146977/", "http://www.webmd.com/food-recipes/organic-food-is-natural-worth-the-extra-cost?page=2", "https://cdn.davidwolfe.com/wp-content/uploads/2015/08/FreeRangeVSOrganic.jpg", "http://www.gardenbetty.com/2013/03/how-to-get-those-delightful-dark-orange-yolks-from-your-backyard-chickens/", "http://hencam.com/faq/what-to-feed-your-chickens/", "http://www.huffingtonpost.com/bruce-friedrich/eggs-from-caged-hens_b_2458525.html"], "authors": [""], "publish_date": "2015-08-30T20:16:57-07:00"}