{"result_id": "094002", "URL": "https://www.davidwolfe.com/5-foods-trigger-autoimmune-disease-flare-ups/", "timestamp": "2023-04-25 14:58:43 CEST+0200", "meta": {"description": "What causes your autoimmune disease condition to flare up? Some people say it's just bad luck, but you'll find 5 foods that will trigger your symptoms.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/5-foods-trigger-autoimmune-disease-flare-ups/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "5 Foods That Trigger Autoimmune Disease Flare-Ups", "cleaned_text": "Did you know? There are over 100 identified autoimmune diseases. And counting! By some estimates, more than 50 million Americans suffer from an autoimmune condition. In a patient with an autoimmune disease, the body is unable to tell the difference between its own healthy cells and foreign cells. As a result, the immune system, which usually defends the body against disease, instead attacks healthy cells. Some of the most common autoimmune diseases include rheumatoid arthritis, colitis, Crohn’s disease, and lupus. (1)\n\nBut how does our immune system get confused? Well, many theories are being tested right now, but we do know that foreign cells — not “you” cells — may get into the body through the intestines. Some foods that cause inflammation create gaps in our intestinal lining, allowing the foreign cells to leak through. This is called leaky gut, and it may also be why people with autoimmune disorders can fluctuate between periods of remission and flare-ups with worsening conditions. (2)\n\nHere are 5 foods that trigger autoimmune disease flare up’s:\n\nA diet full of processed sugar wreaks havoc on your body. And it’s no wonder! Sugar sabotages your immune system’s ability to handle illness, chronic disease, and other threats. For example, over-eating sugar leads to chronic inflammation, causing the body’s immune system to turn on, unfortunately attacking health cells. This, in turn, can lead to an autoimmune disease flare up. (3)\n\nSure, quinoa is seen as a heath food thanks to its fiber, protein, and iron content. Unfortunately, for someone with an autoimmune disease, quinoa can be harmful. Why? Well, saponins, a phytochemical found in quinoa, may further irritate already inflamed intestines. Imagine this little molecule poking holes in the intestinal lining as it passes, irritating the body into an immune response. Thus, damage to the lining of your gut may cause your immune system to work in overdrive. In fact, the saponins in quinoa have also been identified as effective adjuvants for vaccines, which is what vaccine developers use to increase the body’s immune response! (4)\n\nMaybe you’ve seen all the new gluten free products lining store shelves. That’s because, for many people, a gluten free lifestyle is necessary. Yes, gluten can be dangerous for those suffering from many autoimmune diseases, not just celiac disease. For example, if a person already has an autoimmune condition, then the body has trouble processing gluten naturally. Therefore, consuming gluten puts stress on the immune system, and this can result in a flare up. (5)\n\nYou may not want to, but now may be the time to move away from dairy. And yes, even organic dairy can have a negative effect on the body. When you have a cold, you already know to stay away from dairy because it increases mucous production (yuck!). For those with an autoimmune disease, dairy causes other problems, too. For one, the casein protein naturally found in milk can cause inflammation in the body, which leads to a weakened immune system and an autoimmune disease flare up. These proteins can also mimic your body’s cells, like the pancreas. And when the body mistakenly attacks the pancreas, a person may develop autoimmune type 1 diabetes. (6)\n\nWhat? I hear you: do not take away my chocolate! While cacao does have some pretty amazing health benefits, processed, store-bought milk chocolate can be hazardous to your health. Specifically, if you suffer from an autoimmune disease, you’ll want to avoid milk chocolate. For one, the fact that it’s a dairy product should help deter you from your cravings. For another, the high sugar content can also wreak havoc on your immune system. Instead, find some dark raw or minimally processed cacao. Better yet, make your own! (7)\n\nSure, you may need to remove some of your favorite foods, but there are also steps you can take to improve your digestion and autoimmune condition. First, hydrate. Flushing out toxins and supporting cellular energy will go a long way to improving autoimmunity. Next, go easy on your digestion. Some veggies just go down better when lightly steamed. Also, add in probiotics or digestive enzymes. Last, try some gentle exercise to reduce stress. Since high stress leads to inflammation, then lowering stress makes for a better you.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Foods That Trigger Autoimmune Disease Flare-Ups - David Avocado Wolfe", "description": "What causes your autoimmune disease condition to flare up? Some people say it's just bad luck, but you'll find 5 foods that will trigger your symptoms.", "url": "https://www.davidwolfe.com/5-foods-trigger-autoimmune-disease-flare-ups/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "sugar", "article:section": "health", "article:published_time": "2017-07-28T09:11:45-07:00", "article:modified_time": "2021-04-07T15:54:36-07:00", "updated_time": "2021-04-07T15:54:36-07:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2017/07/food-flare-ups-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2017/07/food-flare-ups-FI.jpg", "image:width": "800", "image:height": "419"}, "tags": ["dairy", "health", "diet", "self help", "autoimmune disease diet", "sugar", "gluten", "flare up", "quinoa", "Autoimmune Disease", "food", "milk chocolate"], "tweets": [], "movies": [], "links": ["https://www.aarda.org/diseaselist/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5440529/", "https://www.davidwolfe.com/is-sugar-bad-for-you/", "https://blog.daveasprey.com/autoimmune-disease-diet/", "https://www.davidwolfe.com/quinoa-benefits/", "https://s3.amazonaws.com/academia.edu.documents/46967107/Adjuvant_action_of_Chenopodium_quinoa_sa20160702-13984-47try4.pdf?response-content-disposition=inline%3B%20filename%3DAdjuvant_action_of_Chenopodium_quinoa_sa.pdf&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=AKIAIWOWYYGZ2Y53UL3A%2F20200113%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Date=20200113T195221Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Signature=51072293643314840ee4737bc63e5019d11eb1b6b6af2e30e3b934795e7513af", "https://www.davidwolfe.com/celiac-disease-diet/", "https://www.glutenfreesociety.org/gluten-and-the-autoimmune-disease-spectrum/", "https://nutritionstudies.org/autoimmune-disease-genes-infection-environment-gut/", "https://www.davidwolfe.com/cacao-vs-cocoa-healthiest-chocolate/", "https://www.phoenixhelix.com/2013/07/29/chocolate-friend-or-foe/", "https://thedr.com/autoimmune-disorders/hydration-is-key-for-boosting-natural-body-defenses/", "https://www.davidwolfe.com/8-probiotic-foods-digestion-depression-heart/", "https://www.womenshealth.gov/a-z-topics/autoimmune-diseases", "http://www.healthline.com/health/autoimmune-disorders?algo=true#overview1", "https://www.glutenfreesociety.org/gluten-and-the-autoimmune-disease-spectrum/", "http://realfarmacy.com/avoid-5-autoimmune-disease-triggers/", "https://www.mindbodygreen.com/0-17100/12-common-triggers-of-autoimmune-disease.html"], "authors": [""], "publish_date": "2017-07-28T09:11:45-07:00"}