{"result_id": "094003", "URL": "https://www.davidwolfe.com/toxic-tap-water/", "timestamp": "2023-04-25 14:58:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/toxic-tap-water/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "You will Never Guess the #1 Contaminant in Tap Water!", "cleaned_text": "In Canada and the U.S., we are incredibly fortunate to have access to fresh, running water whenever we need it. Not having to fight to survive and get our daily needs met allows us to be able to focus on other things, like creating new technology and advancing our capability and knowledge in ways never thought possible. However, like all things that are mass-produced, the quality of our tap water suffers.\n\nToday’s tap water is honestly, nothing short of scary. I know that the governing bodies are doing the best that the can to provide for the public but the fact of the matter is that unfortunately ‘water treatment’ means adding hormone-disrupting chemicals like chlorine, man-made fluoride and an assortment of heavy metals. Also, the water treatment process is unable to remove the accumulation of pharmaceutical medications such as the pill. Sigh!\n• toilet paper residue (yes, you are reading this right!)\n• heavy metals such as lead, cadmium and arsenic\n• residues of pharmaceutical medications such as birth control, anti-depressants, etc.\n\nThis may not seem like a big deal to you, but this is a growing concern that has even caught the attention of the Canadian Government. Scientists have even proven the drugs are creating “intersex” fish, with males developing eggs in their testes!\n\nThe concentrations in your drinking water are low, but it is the mixture of all these drugs and chemicals that is the cause for concern.\n\nKeep in mind that not only are we drinking this water but also bathing in it and cooking with it. Our skin is the largest elimination organ and is very permeable. We were particularly vulnerable in the shower because the heat opens up the pores of the skin and allows toxins to come in.\n\nOur governments have ‘safety net’ policies in place when it comes to water treatment, vaccinations, food supply and nutritional recommendations. These prevent the masses from getting sick and dying, but if we want more than just to avoid illness then we have to go out and get it!\n\nSo, what can YOU do?\n\nDrink and use ONLY pure water! This could mean:\n• getting spring water (in glass bottles) regularly delivered to your home, or,\n• better yet, get into the habit of going out and foraging your own!\n\nWild water hunting is easier than you think! I was introduced to this practice by my dear friends and mentors David Wolfe and The Gnome, they have shown me why it is so vitally important for us to drink only the best water. The message to me has essentially been: change your water and change your life!\n\nOther reasons why harvesting your own spring water is the best ever:\n• It is pure, living water, the way nature intended.\n• Gets you outside of our homes, offices, towns and cities.\n• You can try out new springs and explore new areas.\n• Make it a fun and healthy tradition with your family,\n• deepens your connection to nature and the source of your food.\n• Carrying the water jugs is always a good workout.\n• The water tastes, unlike any tap water you’ve ever had.\n\nThe practice of harvesting my water is definitely something that I am committed to doing for the rest of my life. It is of very high importance to me, and so naturally, I want to share it with you!\n\nRegular wild water hunting is made possible thanks to websites like FindaSpring.com; an online database of springs around the world. Please check it out, to find a spring near you! It is complete with details like videos, directions and test results of each spring.\n\nWhile getting your own spring water is an easy way to upgrade your health quickly, it is unrealistic to boycott tap water altogether. We still need to shower! However, as David says; “get a filter or be a filter.” We highly recommend getting a shower head filter to protect you and your family, especially if you live in cities or municipalities with old water systems.\n\nLongevity Now: A Comprehensive Approach to Healthy Hormones, Detoxification, Super Immunity, Reversing Calcification, and Total Rejuvenation\n\nFor more inspiration and healthy recipes, check out\n\n my other health blogs on DavidWolfe.com.\n\n Click here to learn about my online school for Inspired Living!", "opengraph": {"locale": "en_US", "type": "article", "title": "You will Never Guess the #1 Contaminant in Tap Water! - David Avocado Wolfe", "description": "In Canada and the U.S., we are incredibly fortunate to have access to fresh, running water whenever we need it. Not having to fight to survive and get our daily needs met allows us to be able to focus on other things, like creating new technology and advancing our capability and knowledge in ways never …", "url": "https://www.davidwolfe.com/toxic-tap-water/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "wild water", "article:section": "Featured", "article:published_time": "2016-01-05T14:36:02-08:00", "article:modified_time": "2022-11-13T08:15:17-08:00", "updated_time": "2022-11-13T08:15:17-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2016/01/shutterstock_312973745.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2016/01/shutterstock_312973745.jpg"}, "tags": ["outdoors", "tap water", "find a spring", "chlorine", "heavy metals", "water", "spring water", "wild water", "toxic", "living water", "chemical free", "pesticides", "nature"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe loading=\"lazy\" title=\"David Wolfe's Exploration and Insights into Spring Water\" width=\"1200\" height=\"675\" src=\"https://www.youtube.com/embed/HJDXvEI0Fo8?feature=oembed&amp;enablejsapi=1&amp;origin=https://www.davidwolfe.com\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/HJDXvEI0Fo8?feature=oembed&enablejsapi=1&origin=https://www.davidwolfe.com"}], "links": ["https://www.findaspring.com/", "http://www.amazon.com/gp/product/1583946144/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=1583946144&linkCode=as2&tag=gilliancom-20&linkId=HZJL7KP3TMPRUWH5", "http://www.cbc.ca/news/health/drinking-water-contaminated-by-excreted-drugs-a-growing-concern-1.2772289", "https://www.davidwolfe.com/?s=Gillian", "https://gillianb.thinkific.com/", "https://gillianb.thinkific.com/"], "authors": [""], "publish_date": "2016-01-05T14:36:02-08:00"}