{"result_id": "094019", "URL": "https://www.davidwolfe.com/5-ways-keep-ticks-lyme-disease-out/", "timestamp": "2023-04-25 14:58:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/5-ways-keep-ticks-lyme-disease-out/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "5 Simple Ways to Keep Ticks and Lyme Disease Out of Your Yard!", "cleaned_text": "If you’re unfamiliar with Lyme disease, it’s a bacterial infection transmitted via tick bite, and it’s something you absolutely don’t want to contract. The Centers for Disease Control and Prevention estimates that 300,000 people are diagnosed with Lyme disease in the United States every year. It affects people of all ages, and it’s often misdiagnosed because its symptoms mimic those of other illnesses. If left untreated, Lyme disease can spread to the joints, heart and even the nervous system.\n\nThe first step to preventing Lyme disease is to know where ticks are common. They live in moist, humid environments, most often near wooded or grassy areas. After spending time outdoors, be sure to check for ticks before going inside. If you find one, remove it immediately.\n\nDogs and cats are also susceptible to tick bites and tick-borne diseases. While vaccines are available, they won’t keep pets from bringing a tick into your home. Check your pets daily for ticks, especially after they’ve spent time outdoors. Change in behavior or appetite can signal that your pet has been bitten by a tick. If you find a tick on your pet, remove it right away.\n\nNo one wants to cut back on picnics, days at the park or other outdoor activities, but being aware and prepared is important to prevent Lyme disease.\n\nUse these five tips and tricks to help keep your family safe from ticks and Lyme disease in your own backyard!\n\nGet rid of any tall grass and brush, even if it’s at the edge of your lawn. Tall grass is a favorite hideout spot for ticks. If they’ve made a home in the tall grass next to your yard, chances are they’ll make their way into your yard.\n\nTicks enjoy grass. They don’t like to cross a path if it’s lined with something rough like wood chips or gravel. Use one of these materials as a buffer between your lawn and a wooded area to help keep ticks from crossing into your yard.\n\nWood piles are another hangout spot for ticks, especially if the wood is stacked in the shade. Keep the wood neatly stacked in a spot that gets some sun. It’ll dry out faster and keep it from staying moist — the preferred atmosphere for ticks.\n\nThere are plenty of tick repellents available, but the majority of them contain harsh chemicals. Instead of using a chemical repellent, try planting American beautyberry bushes. Their leaves have been known to repel ticks.\n\nThis isn’t an option for everyone, but if you have some land and you really want to keep ticks away, consider buying a few chickens. You’ll have fresh eggs, and they’ll peck away at any ticks that make their way into your yard. Guinea hens will also protect your yard from ticks. Just be sure to do your research to find the proper shelter and food your new additions will need.\n\nThe video below provides some great tips for keeping ticks out of your yard. However, we do not suggest deer or tick spraying unless the oil used is natural. In this video, they use cedar oil.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Simple Ways to Keep Ticks and Lyme Disease Out of Your Yard! - David Avocado Wolfe", "description": "If you’re unfamiliar with Lyme disease, it’s a bacterial infection transmitted via tick bite, and it’s something you absolutely don’t want to contract. The Centers for Disease Control and Prevention estimates that 300,000 people are diagnosed with Lyme disease in the United States every year. It affects people of all ages, and it’s often misdiagnosed …", "url": "https://www.davidwolfe.com/5-ways-keep-ticks-lyme-disease-out/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "ticks", "article:section": "Safety", "article:published_time": "2016-04-27T09:36:28-07:00", "article:modified_time": "2020-05-26T15:23:33-07:00", "updated_time": "2020-05-26T15:23:33-07:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2016/04/ticks-yard-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2016/04/ticks-yard-FI.jpg", "image:width": "800", "image:height": "420"}, "tags": ["health", "lyme disease prevention", "prevention", "ticks", "disease", "health risks", "protection", "lyme disease"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe loading=\"lazy\" title=\"How to properly remove a tick\" width=\"1200\" height=\"675\" src=\"https://www.youtube.com/embed/27McsguL2Og?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/27McsguL2Og?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1200", "height": "675", "embed_code": "<iframe loading=\"lazy\" title=\"Tick Control - How to Keep Ticks out of your Yard\" width=\"1200\" height=\"675\" src=\"https://www.youtube.com/embed/BdZhKd7PAmU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/BdZhKd7PAmU?feature=oembed"}], "links": ["https://www.lymedisease.org/lyme-basics/lyme-disease/about-lyme/", "https://www.davidwolfe.com/red-mark-seek-medical-attention/", "http://www.rodalesorganiclife.com/wellbeing/how-avoid-ticks-woods", "http://www.cdc.gov/lyme/prev/on_pets.html", "http://garden.org/plantguide/?q=show&id=2134", "http://www.rodalesorganiclife.com/wellbeing/natural-tick-repellants-protect-your-yard"], "authors": [""], "publish_date": "2016-04-27T09:36:28-07:00"}