{"result_id": "094014", "URL": "https://www.davidwolfe.com/hantavirus/", "timestamp": "2023-04-25 14:58:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/hantavirus/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "Hantavirus: Symptoms & Prevention Methods", "cleaned_text": "Most people don’t know that rats and mice worldwide spread over 35 different diseases that can impact humans.\n\n (1) Hantavirus is one of these dangerous infections. Here now are the hantavirus symptoms, hantavirus preventention tips, and hantavirus treatment options you must know.\n\nHantaviruses are carried by rodents and shrews, especially in brown rats. There are a number of strains of hantaviruses that are transmitted from several species of rodents. The coasts in the United States, parts of Canada, Asia and Mexico are particularly at risk.\n\nRodents often transmit these infections and diseases to people without their knowledge. How? When people come into contact with rodent feces, urine or saliva.\n\nThe single greatest risk factor for hantavirus infection is a rodent infestation near your home.\n\nThe virus is passed through aerosolized urine or exposure to dust from the nests of infected rodents. Infected urine or other materials can infect broken skin or the mucous membranes of the eyes, nose or mouth.\n\nThe cotton rat, deer mouse, rice rat, and white-footed mouse are common carriers of hantaviruses.\n\nEarly signs and symptoms can include trouble breathing, muscle aches and symptoms associated with a fever. If the virus continues to worsen, it can progress into the life-threatening condition called hantavirus pulmonary syndrome (HPS). (2)\n\n– Infection of the lungs, trouble breathing and respiratory distress.\n\n– Intense headaches, back and abdominal pain, fever, blurred vision, flushing of the face. These signs, plus inflammation or redness of the eyes, or a rash, are often attributed to HFRS. Symptoms of HFRS include low blood pressure, acute shock, vascular leakage, and acute kidney failure.\n\nHantavirus prevention is important because there is currently no specific treatment available that helps a high percentage of patients who have the virus. There is no known cure or vaccine.\n\n1. Reduce or Eliminate Contact with Rodents & Their Droppings\n\nMany don’t realize they are coming into contact with rodents or their droppings.\n\nRodent control in and around the home remains the primary strategy for preventing hantavirus infection. (3)\n\nTo minimize your potential exposure to hantavirus, seal up any holes or gaps in your walls or garage. A solid wall prevents rodents and insects from invading your home. Small mice can squeeze through a hole that’s only about the size of a nickel. Typical exposure points include under or behind kitchen cabinets, refrigerators, pipes, washing machines, hot water heaters and stoves. Also check around furnaces, fireplaces, doors, floor vents, dryer vents, attics, basements, crawl spaces and laundry rooms.\n\nIt might also be wise to place rodent traps with peanut butter around your home.\n\n2. Keep Your Home & Yard Clean to Prevent Attracting Rodents\n\nNever leave food, garbage or scraps around your home. Food scraps attract rodents and other animals. When camping or grilling outside, always clean up any waste and food. If rodents are already present, speak with a professional exterminator.\n\nWhile a strong immune system might not fully protect you from getting hantavirus, it can help. Increasing your immunity should help you recover quicker and lower the odds that you’ll develop any serious complications. Here are some superfoods that can increase protection against hantavirus symptoms.\n\nGarlic possesses antiviral, antibacterial and anti-fungal properties, allowing it to put up a great fight against infections. Garlic can even be used to treat skin conditions caused by bacteria, fungi or viruses. It’s also a great tool for boosting the immune system, as it contains high levels of Vitamin C and potassium.\n\nGinger has been named as one of the healthiest spices on the planet. It contains gingerol, a substance with powerful medicinal properties, and it has been known to be highly effective against nausea. It’s also a natural anti-inflammatory, and it can aid in digestion, and has been used to significantly reduce muscle pain and soreness.\n\nThe health benefits from lemon stem from its many nourishing elements. Lemon provides Vitamin C, Vitamin B6, Vitamin A, Vitamin E, folate, calcium, iron, magnesium, potassium, and zinc. Another benefits of lemon are flavonoids — composites that contain antioxidant and cancer-fighting properties. Lemon helps to prevent diabetes, constipation, high blood pressure, fever, indigestion and many other problems.\n\nRaw honey contains antioxidants and it can kill unwanted bacteria and fungus. It naturally contains the antiseptic hydrogen peroxide, so it can be used to treat wounds and kill germs. Raw, organic honey is also full of phytonutrients, which provide both antioxidant and anti-inflammatory benefits.\n\nFor more immune boosting foods, and an amazing drink that combines all of the foods, read this.\n\nUnfortunately, hantavirus treatment is a difficult subject because there is no treatment available at this time.\n\nReportedly, scientists haven’t been able to develop a vaccine or treatment for hantavirus. The reason is because the virus mutates when transferred from its original host. The virus adapts to its new environment, mutating as it invades the new host’s RNA.\n\nIf a patient is suspected to be infected with hantavirus, they should be treated in an intensive care unit at a hospital right away. Hantavirus patetients are intubated and given oxygen therapy to help them deal with respiratory symptoms and try to prevent complications from occurring. Use of intravenous ribavirin, an antiviral drug, is often used.\n\nHowever, like most medications, ribavirin comes with a huge list of side effects. The best method to defeat hantavirus is to not get it in the first place. This is easy to do when one follows the prevention tips listed above.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hantavirus: Symptoms & Prevention Methods - David Avocado Wolfe", "description": "Most people don’t know that rats and mice worldwide spread over 35 different diseases that can impact humans. (1) Hantavirus is one of these dangerous infections. Here now are the hantavirus symptoms, hantavirus preventention tips, and hantavirus treatment options you must know. What is Hantarvirus? Hantaviruses are carried by rodents and shrews, especially in brown …", "url": "https://www.davidwolfe.com/hantavirus/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "treatment", "article:section": "Conditions", "article:published_time": "2017-11-19T17:31:54-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2017/11/hantavirus-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2017/11/hantavirus-FI.jpg", "image:width": "800", "image:height": "419"}, "tags": ["hantavirus symptoms", "hantavirus", "causes", "treatment", "hantavirus treatment", "rats", "symptoms", "hantavirus prevention", "conditions", "mice"], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/rodents/index.html", "https://www.cdc.gov/hantavirus/hps/index.html", "https://www.cdc.gov/hantavirus/hps/diagnosis.html", "https://www.davidwolfe.com/remedy-boost-immune-system/"], "authors": [""], "publish_date": "2017-11-19T17:31:54-08:00"}