{"result_id": "094001", "URL": "https://www.davidwolfe.com/pregnant-prevent-zika/", "timestamp": "2023-04-25 14:58:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/pregnant-prevent-zika/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "5 Things Pregnant Women Can Do to Prevent Zika (Mosquito-Borne Diseases)", "cleaned_text": "Zika is a virus that is spread through the bite of a mosquito. Its symptoms commonly include fever, rash, joint pain, and conjunctivitis. However, in May 2015, an outbreak of this virus in Brazil led to reports of Guillain-Barre syndrome and effects on pregnancy. These include birth defects and poor pregnancy outcomes. (Source)\n\nThe current countries affected by this virus outbreak include: Barbados, Bolivia, Brazil, Colombia, Dominican Republic, Ecuador, El Salvador, French Guiana, Guadeloupe, Guatemala, Guyana, Haití, Honduras, Martinique, México, Panamá, Paraguay, Puerto Rico, St. Martin, Suriname, U.S. Virgin Islands, Venezuela, Samoa, and Cape Verde.\n\nAny pregnant woman, or any woman looking to become pregnant, should take extreme caution when entering these countries. There are, however, some things a woman can do to protect herself from the mosquitos that carry Zika.\n\nThe mosquitos that carry this virus are very small and typically are active during the day. They have lived at least as long as humans have been on Earth and are excellent at striking when one is not aware. Stay indoors during the day and make sure windows are heavily screened or closed. Even a small hole is big enough to let in the mosquito that carries zika. These mosquitos also like to hide under tables, couches, beds, or even sills in the kitchen. Be aware of this. If your hotel or home is not mosquito proof, sleep under a mosquito net.\n\nWhen used as directed, most natural organic repellents are safe for pregnant or nursing women. Find a safe repellent and use it. Some good repellents to use are those containing: catnip, cedar, citronella, clove, eucalyptus, lavender, lemongrass, lemon eucalyptus, mint, peppermint, rosemary, and tea tree. You can discuss with a healthcare professional about the best choices for you. Oil of lemon eucalyptus should not be used for children under the age of 3. If you are using sunscreen and insect repellent, apply the sunscreen first and then the repellent.\n\nAdd 10-15 drops of each of these essential oils: cedar, citronella, clove, eucalyptus, lavender, and lemongrass to your laundry with a simple Castille soap or hemp soap like Dr. Bronner’s. Wash your clothes with these as normal. Before going outside, splash several drops of these essential oils around your ankles and wrists as well as on your clothes (again).\n\nIf the weather permits, try to wear long sleeve shirts and long pants. I understand how difficult this is to do in the tropics, but these clothing choices will keep you better protected from mosquitos. This is especially true if your clothes are treated with the essential oils mentioned above.\n\nMosquitos breed in water. You can easily control the amount of mosquitos around the home or location by removing any free-standing water. If you have pet water bowls, a daily wash in hot water will easily remove and kill any mosquito eggs. You can also burn some insect repelling candles to help keep the mosquitos away.\n\nFollowing these steps will decrease the likelihood of contracting zika, but it will not remove the risk completely. If you are pregnant, it is best not to visit the affected areas. If you live in the affected areas, discuss your best options with your healthcare provider.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Things Pregnant Women Can Do to Prevent Zika (Mosquito-Borne Diseases) - David Avocado Wolfe", "description": "Zika is a virus that is spread through the bite of a mosquito. Its symptoms commonly include fever, rash, joint pain, and conjunctivitis. However, in May 2015, an outbreak of this virus in Brazil led to reports of Guillain-Barre syndrome and effects on pregnancy. These include birth defects and poor pregnancy outcomes. (Source) The current …", "url": "https://www.davidwolfe.com/pregnant-prevent-zika/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "zika virus", "article:section": "Environment", "article:published_time": "2016-01-28T06:08:47-08:00", "article:modified_time": "2017-11-14T21:22:22-08:00", "updated_time": "2017-11-14T21:22:22-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2016/01/Brazil-microcephaly-AP.gif", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2016/01/Brazil-microcephaly-AP.gif", "image:width": "800", "image:height": "418"}, "tags": ["zika virus", "clothing", "birth defects", "prevention", "repellents", "zika", "mosquito", "Guillain-Barre syndrome", "permethrin"], "tweets": [], "movies": [], "links": ["http://www.cdc.gov/zika/index.html", "https://www.davidwolfe.com/citronella-oil/", "https://www.davidwolfe.com/clove-oil-uses-benefits/", "https://www.davidwolfe.com/eucalyptus-oil/", "https://www.davidwolfe.com/15-lavender-essential-oil-uses/", "https://www.davidwolfe.com/lemongrass-essential-oil/", "https://www.davidwolfe.com/peppermint-oil/", "https://www.davidwolfe.com/rosemary-oil-uses-benefits/", "https://www.davidwolfe.com/tea-tree-oil-uses-benefits/", "/essential-oils/", "http://www.cdc.gov/zika/prevention/index.html", "http://www.independent.co.uk/news/world/americas/zika-virus-that-shrinks-babies-brains-is-spreading-say-scientists-a6795326.html"], "authors": [""], "publish_date": "2016-01-28T06:08:47-08:00"}