{"result_id": "094018", "URL": "https://www.davidwolfe.com/90-terminal-cancer-patients-previously-procedure/", "timestamp": "2023-04-25 14:58:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/90-terminal-cancer-patients-previously-procedure/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "More Than 90% of Terminal Cancer Patients Previously Had THIS Procedure Done!", "cleaned_text": "A lot of people think they have a pretty firm grasp on what they need to do to avoid cancer. Things like not smoking, avoiding tanning beds and not standing too close to the microwave come to mind.\n\nBut what if I told you there’s one procedure 22.3 million unsuspecting Americans get done each year that leads to cancer? What if I told you the medical industry has been covering up the truth about this procedure for more than a century, insisting it’s totally safe?\n\nI’m not talking about an MRI scan or x-ray. No, I’m talking about something most people would probably never even think to link with cancer.\n\nWhen bacteria enters a tooth through a cavity, it can sometimes work its way down to the root. Once there, it causes an infection and leads to inflammation.\n\nDuring a root canal procedure, a dentist will drill a hole down to the root and clear this bacteria before filling the tooth.\n\nMost modern dentists will stop the explanation there and say that, after filling the tooth, everything’s hunky dory. But those who are familiar with the work of Dr. Weston A. Price know that things don’t end there at all.\n\nIn the early 1900s, Dr. Price – a dentist at the time – became suspicious that after a root canal, teeth actually remain infected.\n\nThrough extensive research, he found that this perpetual infection was to blame for a number of chronic, deadly conditions – including cancer.\n\nDentists, and patient who trust them, mistakenly believe that chemicals used in root canal procedures successfully get rid of all harmful bacteria. In reality, there are miles (yes, miles) of microscopic tubes in teeth that never get exposed to sanitizing chemicals.\n\nThis is made worse by the fact that after a root canal, these tubes are cut off from oxygen and blood circulation by filler.\n\nBacteria in those tubes (such as capnocytophagaochracea) cannot be reached by antibiotics or your body’s immune system. And so they’re free to leak toxins into your body.\n\nIn the book Cancer: A Second Opinion, Dr. Josef Issels says that in 40 years of working with 16,000 cancer patients, more than 90% of them showed up to his clinic with multiple root canals.\n\nBecause of this, Dr. Issels requires that all of his patients have their root canals removed before even beginning treatment.\n\nDr. Robert Jones, who has studied the link between cancer and root canals, discovered that an alarming 93% of women with breast cancer had root canals done. In most cases, the tumors were found on the same side of the body as the affected tooth.\n\nDr. Jones found that toxins from the tooth suppress proteins that delay tumor development. His findings were confirmed by a study from the University of Michigan which identified the protein as one called RIP.\n\nCancer cells don’t typically engage in the normal cell death process – RIP forces them to.\n\nRoot Canals Cause More Than Just Cancer\n\nRemember Dr. Price? Well, around the time he discovered the shocking truth about root canals, he met a patient who had been suffering from crippling arthritis for six years.\n\nHe recommended that the woman have her root canal extracted – even though it seemed totally healthy.\n\nThe woman agreed and Dr. Price transplanted the extracted tooth into a rabbit. The rabbit developed the same crippling arthritis as the woman and, within just 10 days, died.\n\nThe woman, on the other hand, recovered and was able to walk without a cane within days.\n\nResearchers who have followed up on Dr. Price’s work also drew connections between root canals and ALS, multiple sclerosis, Lupus, heart disease and kidney disease.\n\nWant to learn more about the dangers of root canals? Researchers have published a number of books on the topic. In addition to the previously-mentioned Cancer: A Second Opinion, have a look at Dr. George E. Meinig’s Root Canal Cover Up.\n\nCheck out what David has to say about fillings and how to care for your teeth!", "opengraph": {"locale": "en_US", "type": "article", "title": "More Than 90% of Terminal Cancer Patients Previously Had THIS Procedure Done! - David Avocado Wolfe", "description": "A lot of people think they have a pretty firm grasp on what they need to do to avoid cancer. Things like not smoking, avoiding tanning beds and not standing too close to the microwave come to mind. But what if I told you there’s one procedure 22.3 million unsuspecting Americans get done each year …", "url": "https://www.davidwolfe.com/90-terminal-cancer-patients-previously-procedure/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "teeth cancer", "article:section": "Health & Longevity", "article:published_time": "2016-07-30T12:33:01-07:00", "article:modified_time": "2016-07-30T20:47:43-07:00", "updated_time": "2016-07-30T20:47:43-07:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2016/07/dental-work-cancer-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2016/07/dental-work-cancer-FI.jpg", "image:width": "800", "image:height": "419"}, "tags": ["health", "root canals cause cancer", "cancer", "teeth cancer", "root canal and cancer", "breast cancer", "root canal", "root canal causes cancer", "root canal cancer"], "tweets": [], "movies": [], "links": ["https://www.google.ca/url?sa=t&rct=j&q=&esrc=s&source=web&cd=4&cad=rja&uact=8&ved=0ahUKEwjQtNfF45vOAhUs4oMKHUjVDSQQFggrMAM&url=http%3A%2F%2Fwww.davidwolfe.com%2Fquit-smoking-body-benefit%2F&usg=AFQjCNFRg5IoXcQeHZzdi3leFDTbUj8j3g&sig2=PE_nWTJp9M9yJ08gpZxENw", "https://www.google.ca/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwjJz5K-45vOAhUsxYMKHb24ARgQFggbMAA&url=http%3A%2F%2Fwww.davidwolfe.com%2Fdeadly-lumps-throat-common-obsession%2F&usg=AFQjCNHucU1uhzCFFbL6hTPZKbY5Tllghw&sig2=qEfL93O5A8xAyFg0QPLNtQ&bvm=bv.128617741,d.amc", "https://www.google.ca/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0ahUKEwjNke_b45vOAhUM0YMKHVi_ACUQFggiMAA&url=http%3A%2F%2Fwww.davidwolfe.com%2Fstop-using-microwaves%2F&usg=AFQjCNEWdnVRUdtbboY9-0agKoqLUshb8A&sig2=jSkCbCnnqqLg2vyczusPxw&bvm=bv.128617741,d.amc", "http://www.aae.org/about-aae/news-room/endodontic-treatment-statistics.aspx", "http://www.colgate.com/en/us/oc/oral-health/procedures/root-canals/article/illustrations-root-canal-treatment-from-start-to-finish", "http://www.westonaprice.org/holistic-healthcare/root-canal-dangers/", "https://microbewiki.kenyon.edu/index.php/Capnocytophaga_ochracea", "http://amzn.to/2acfCtB", "http://www.cancerdefeated.com/newsletters/This-Was-Done-to-Almost-ALL-Terminal-Cancer-Patients-Earlier-in-Their-Lives.html", "http://ns.umich.edu/new/releases/7510", "http://amzn.to/2acfCtB", "http://amzn.to/2aD3UfI", "http://amzn.to/2aD3UfI", "http://amzn.to/2acfCtB", "http://ns.umich.edu/new/releases/7510", "http://www.cancerdefeated.com/newsletters/This-Was-Done-to-Almost-ALL-Terminal-Cancer-Patients-Earlier-in-Their-Lives.html", "http://www.westonaprice.org/holistic-healthcare/root-canal-dangers/", "http://www.aae.org/about-aae/news-room/endodontic-treatment-statistics.aspx"], "authors": [""], "publish_date": "2016-07-30T12:33:01-07:00"}