{"result_id": "094022", "URL": "https://www.davidwolfe.com/lichen-planus/", "timestamp": "2023-04-25 14:58:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.davidwolfe.com/lichen-planus/", "encoding": "utf-8"}, "image": null, "domain": "www.davidwolfe.com", "title": "Lichen Planus Causes, Symptoms & 9 Natural Treatments", "cleaned_text": "Anyone with a rash with red, purple or bluish lesions that itches and spreads should listen up. You may have lichen planus. This disease is triggered by the immune system in response to stress, allergens or a viral infection. It may affect the skin, scalp and nails, as well as the mouth and the genitals. (1) This article details the key lichen planus causes, lichen planus home remedies, and lichen planus treatment methods.\n\nThere is controversy as to what lichen planus is. Many think it is an autoimmune disease. Others contend it is the body’s natural reaction to an allergen. Either way, lichen planus is an aggressive and uncomfortable rash that can affect virtually every part of the body.\n\nDiscomfort can range from mild to severe, and effective lichen planus treatments help to relieve the symptoms and facilitate healing.\n\nWhile the rash itself is unsightly and uncomfortable, the good news is the condition is not considered serious. Additionally, lichen planus is not contagious. The medical community estimates it affects 0.1 percent to 4 percent of the general population. The people most affected are between the ages of 30 and 60. Men and women are both affected, but it most often occurs in women during perimenopause. (2)\n\nThis features a white web-like pattern that is easy to discern. The pattern is called “Wickham’s Striae.”\n\nNoted by the bright red rash that typically affects mucous membranes. The mouth, gums, cheek, tongue, and genitals are especially prone. In more severe cases, ulceration can occur. Most people experience moderate to severe discomfort while eating and drinking. Common irritants include acidic and spicy foods. Extreme hot and extreme cold can worsen the pain.\n\nThe fluid-filled blisters and lesions occur in the mouth, genitals, lower limbs and trunk.\n\nThe rarest form, it typically affects the trunk and legs. The rash features whitish blue papules with a center that has atrophied or broken down. (4)\n\nWhen lichen planus develops in the mouth, expect moderate to severe discomfort. Spicy foods and acidic foods may worsen the discomfort and some individuals may find that icy foods or drinks or extremely hot foods or drinks may cause further distress. In more severe cases of oral lichen planus, the discomfort may be constant and unrelenting.\n\nIn fact, the four types of lichen planus described above do commonly develop in and around the genitals. In men, rashes appear around the glands of the penis, or the shaft. For women, it can affect the skin around the genitals, as well as the vulva and vagina. Some studies indicate that up to 50 percent of women with oral lichen planus also have it in the genital region. Yet for many, it remains undiagnosed. (5)\n\nLichen Planus of the Nails and Scalp\n\nLichen planus can also appear on both fingernails and toenails. For some individuals, it may only involve one or two nails. For others, it may affect all of the nails, causing temporary or permanent damage to the nail. When a rash appears on the scalp, it may cause permanent scarring leading to alopecia or hair loss. (6)\n\nNo single, definitive lichen planus causes have been determined. However, many medical conditions and environmental factors are believed to play a role.\n\nGenetics are one risk factor. The likelihood of developing lichen planus is greater if a family member has been diagnosed.\n\nHepatitis C is another risk factor. Research has found a statistically significant association between hepatitis C and lichen planus. (7)\n\nExposure to allergens, including certain artificial dyes and chemicals may cause an outbreak.\n\nMedications containing arsenic, bismuth, gold or quinidine have been implicated. These include antibiotics, diuretics, flu vaccines, medications for diabetes, malaria, high blood pressure and heart disease. (8, 9)\n\nAmalgam Fillings may act as an allergen leading to the development of oral lichen planus.\n\nBone marrow transplant recipient and middle-aged adults are especially at risk.\n\nMany physicians use what’s called the six “Ps” to describe lichen planus shape and characteristics. They are: planar (flat-topped), purple, polygonal, pruritic, papules, and plaques.\n\nThe first sign of lichen planus may be the appearance of a reticular rash with these characteristics.\n\nThe wrist, trunk, and legs are typical outbreak points. However, it can begin anywhere on the body.\n\nLook also for the the appearance of purplish-colored lesions or bumps. Whitish-blue colored fluid-filled blisters or lesions that burst and scab over are also suspect. Additionally, monitor thin white lines that create a web-like look that appear over a red rash of small lesions.\n\nModerate to severe itching on skin rashes is another sign. Another symptom are nails with a white chalky appearance, ridges, grooving or splitting.\n\nAlso, itching and pain on the scalp when accompanied by a rash is another sign. An odd odor coming from a rash, even after cleansing is a known symptom.\n\nVaginal discharge, burning, itching and painful intercourse is possible. This may occur with lesions or blisters on the penis or shaft, chronic itching and painful intercourse.\n\nOne effective lichen planus treatment is a turmeric ointment. Turmeric may be beneficial in changing the appearance and discomfort in oral lichen planus. A study published in the National Journal of Maxillofacial Surgery found this and more. Researchers believe that the anti-inflammatory, antiviral and antibacterial properties of curcumin have an amazing effect. Curcumin can actually inhibit the growth of squamous cell carcinoma of the head and neck. This type of carcinoma is a recognized risk of oral lichen planus. (10)\n\nTo soothe the itching and discomfort on your skin, try a turmeric face mask. Use caution, as it can easily stain your clothing and skin if left on too long. Turmeric tea may also help to promote healing while soothing the pain and discomfort.\n\nAs lichen planus targets skin and mucous membranes, increasing your intake of vitamin A may help.\n\nDuring an outbreak, eat more vitamin A rich foods. These include raw carrots, sweet potatoes, kale, spinach and winter squash. In addition to treating the rash, vitamin A supports the immune system and fights inflammation.\n\nOne study found that 44 percent of patients with oral lichen planus were folate deficient. The researchers recommended daily supplements of folate. (11)\n\nPeople at risk for folate deficiency include those with liver disease and people on certain medications. Those medications include diuretics and those used to treat diabetes. Liver disease, diuretics and diabetes medications can increase your risk of developing lichens planus.\n\nTherefore, eat folate rich foods from the legumes family. These include garbanzo beans, pinto beans and lentils, as well as beets, asparagus, and avocados.\n\nEpsom salt can provide relief by relieving sore muscles and detoxing the body. It is known for helping to reduce stress, eliminate toxins and reduce pain and inflammation. Prepare a warm bath, and add 2 cups of Epsom salt, stirring it around with your arm. Soak at least 30 minutes for best results. Also, the addition of your favorite essential oils can provide additional relief.\n\nTea tree oil’s benefits are well known. If you have oral lichen planus, a tea tree oil based mouthwash may aid in the healing, particularly with erosive and bullous types. However, some may find it further irritates the mouth. In this case, discontinue use immediately.\n\nWhen treating lichen planus on the scalp, mix tea tree oil, coconut oil, aloe vera, apple cider vinegar and raw honey. These substances have antibacterial, antifungal and antiviral properties. Together, rubbing them on the scalp can work to relieve the itching commonly associated with this condition.\n\nFor oral lichen planus, coconut oil pulling twice a day may improve the symptoms and provide relief. The process helps to detoxify your mouth by literally sucking out the toxins. Benefits include killing bad breath, soothing a dry mouth, reducing inflammation, and boosting the immune system.\n\nWhen lichen planus is present on the skin, applying coconut oil to affected areas can help minimize the itching, burning sensation, and pain. Apply several times a day, or as desired.\n\nNatural beauty treatments often include oats as a gentle exfoliator and skin soother. As the lesions and blisters transform through the course of the disease, a gentle exfoliation is a perfect treatment. It allows you to rub off the dead skin to relieve itching, and improve the appearance.\n\nFor a simple oat exfoliation, here is a simple recipe. You can mix equal parts oats and raw yogurt and let stand at room temperature for 20 minutes. Then mix in ¼ part raw honey. Use the mixture in generous quanties over the affected areas. Allow the treatment to set for 10 to 15 minutes. Finally, rinse thoroughly with warm water, and pat dry.\n\nIn addition to treating a vitamin D deficiency, getting direct, unprotected sun exposure, can speed healing and provide relief.\n\nMake it a priority while you have lichen planus to spend at least 15 minutes each day in direct sunlight. Avoid using sunscreen. The best exposure times are in the middle of the day. When you can, roll up your sleeves or pant legs, and expose the affected area during this period.\n\nAccording to the Mayo Clinic, stress complicates the symptoms associated with this disease and can trigger recurrences. (12) To help ease stress, do activities that soothe your mind and your spirit. For example, guided meditation, yoga and other natural stress relievers can all be incorporated into your daily routine.\n\nIn addition to using these lichen planus home remedies, it is always best to consult a health care professional before undergoing any treatment. Lichen planus not only increases the risk of developing squamous cell carcinoma, it is classified as a “precancerous condition.” (13)", "opengraph": {"locale": "en_US", "type": "article", "title": "Lichen Planus Causes, Symptoms & 9 Natural Treatments - David Avocado Wolfe", "description": "Anyone with a rash with red, purple or bluish lesions that itches and spreads should listen up. You may have lichen planus. This disease is triggered by the immune system in response to stress, allergens or a viral infection.  It may affect the skin, scalp and nails, as well as the mouth and the genitals.  (1) This …", "url": "https://www.davidwolfe.com/lichen-planus/", "site_name": "David Avocado Wolfe", "article:publisher": "https://www.facebook.com/DavidAvocadoWolfe", "article:author": "https://www.facebook.com/DavidAvocadoWolfe", "article:tag": "treatments", "article:section": "Conditions", "article:published_time": "2017-11-30T11:33:19-08:00", "image": "https://cdn.davidwolfe.com/wp-content/uploads/2017/11/Lichen-Planus-FI.jpg", "image:secure_url": "https://cdn.davidwolfe.com/wp-content/uploads/2017/11/Lichen-Planus-FI.jpg", "image:width": "800", "image:height": "419"}, "tags": ["treatments", "causes", "planus", "lichen", "remedies", "home"], "tweets": [], "movies": [], "links": ["http://www.mayoclinic.org/diseases-conditions/lichen-planus/home/ovc-20188519", "http://www.aafp.org/afp/2011/0701/p53.html", "https://rarediseases.info.nih.gov/diseases/12675/atrophic-lichen-planus", "http://emedicine.medscape.com/article/1123213-clinical#b4", "http://www.aocd.org/?page=lichenplanus", "https://www.ncbi.nlm.nih.gov/pubmed/19770446", "http://www.medicinenet.com/lichen_planus/article.htm#what_are_causes_and_risk_factors_for_lichen_planus", "http://www.healthline.com/health/lichen-planus#symptoms3", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3961895/", "https://www.ncbi.nlm.nih.gov/pubmed/11944731", "https://www.davidwolfe.com/tea-tree-oil-uses-benefits/", "http://www.mayoclinic.org/diseases-conditions/oral-lichen-planus/manage/ptc-20196920", "http://www.sciencedirect.com/science/article/pii/S1741940903000025"], "authors": [""], "publish_date": "2017-11-30T11:33:19-08:00"}