{"result_id": "096040", "URL": "https://www.discovery.org/a/u-s-military-uses-religious-test-against-service-members-to-enforce-vaccine-mandate/", "timestamp": "2023-04-25 14:59:24 CEST+0200", "meta": {"description": "Members of our military pledge their loyalty to the Constitution. Its First Amendment guarantees freedom of religion. So, it would be perverse to force men and…", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/2020/09/cropped-di-tile-white-32x32.png", "canonical": "https://www.discovery.org/a/u-s-military-uses-religious-test-against-service-members-to-enforce-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "U.S. Military Uses Religious Test Against Service Members To Enforce Vaccine Mandate", "cleaned_text": "Members of our military pledge their loyalty to the Constitution. Its First Amendment guarantees freedom of religion. So, it would be perverse to force men and women in uniform to abandon their deeply held religious beliefs to serve their country.\n\nYet that’s what’s happening regarding the COVID-19 vaccine mandates — for which the normal rules seem not to apply.\n\nThe Air Force recently discharged its first active-duty members for declining to take a COVID-19 vaccine. Those 27 are likely the first batch of many to be discharged on these grounds. Thousands of our servicemen and women have requested religious exemptions. So far, not one has been granted.\n\nLast September, an Air Force Academy graduate requested a religious exemption. As a Catholic, she objected to benefitting from vaccines developed or tested on cell lines derived from a procured abortion.\n\nThe reviewing chaplain denied her request. What’s troubling is that he did so on theological grounds. If this case were unique, we might not worry much about it. But this is just one example of many.\n\nNot everyone agrees on the morality of taking COVID-19 vaccines. Even Catholic bishops do not agree on the matter. Some have called for ethical alternatives. Others have urged Catholics to get a vaccine.\n\nBut it’s not hard to construct a coherent objection to the drugs in question. Here goes.\n\nAbortion is wrong. Benefitting from an abortion is wrong. All currently authorized COVID-19 vaccines were developed with or tested on fetal cell lines harvested from an abortion. To receive one of these vaccines is to benefit from an abortion.\n\nConclusion: Since I oppose abortion, I should avoid any of these vaccines.\n\nThis is not a complex argument. Yes, well-meaning people may dispute some or another premise. So what? The point is that one could sincerely and rationally believe this argument, and so have a moral objection to the vaccines.\n\nIn many cases, this is also a religious objection. A Catholic might believe that her faith teaches that procuring or actively securing a benefit from abortion is wrong. Many men and women in uniform believe this. As a result, the president’s mandate, as the military is executing it, threatens their religious conscience.\n\nTake the case of the Air Force grad rebuffed in September. The chaplain reviewing her request claimed her objection wasn’t a “sincerely held belief.” Why? Because she conceded that she took other drugs, such as Tylenol, which he claimed had also been “tested” on such cell lines.\n\nShe asked for the document backing up his claim on vaccine testing, and was sent a blog post written by a Catholic priest. Using a Google search, this priest had found that many common drugs such as Tylenol had at some point been “tested” on the same fetal cell lines in question. His argument was that one could not consistently take any of these drugs while refusing to take the authorized COVID vaccines.\n\nThere are two huge problems with the chaplain’s response. First, it contradicts the law. Believers don’t forfeit their religious rights either because their observance is sloppy or they’ve never openly demonstrated such beliefs in the past.\n\nSecond, the priest was describing drugs that had been on the market for decades before the fetal cell lines even existed. He had equated such unrelated experiments with tests for COVID vaccines conducted by and for drug companies to get the drugs approved in the first place. The Air Force chaplain simply parroted this claim in rejecting the airman’s request for an exemption.\n\nBut this is to compare apples with albatrosses — which is why this priest’s blog post was eviscerated by critics. If you take Tylenol, which came out in 1955, you are not benefiting in any way from an experiment done with it for some unknown reason by a grad student in 2010.\n\nNot so with this current batch of COVID-19 vaccines. The development and testing on fetal cell lines were necessary conditions for these drugs to be authorized. (There are other drugs in the pipeline that are not entangled with fetal cell lines, but none are yet available.)\n\nNow one could argue that benefitting from an abortion isn’t the same as procuring an abortion. The most authoritative Catholic document, for instance, follows Catholic teaching in forbidding all abortion. But it lists (strict) criteria under which one could use a vaccine produced with “illicit material” without sin.\n\nBut whatever your view, this is clearly an ethical and theological dispute. The military is denying requests for religious exemptions because ill-informed officials disagree with the theological views of service members under their command.\n\nThis seems to be military policy across the board. Fox News reported on a leaked Coast Guard memo that advises reviewing officers to interrogate guardsmen who submit requests for religious exemption. They are told to ask guardsmen about other drugs they take, and how other members of their religion, and religious leaders, view the vaccines. The memo looks designed to bewilder coastguardsmen who lack graduate degrees in ethics.\n\nIn November, First Liberty filed a federal lawsuit against the administration on behalf of dozens of Navy SEALS and other Naval Special Warfare personnel. The complaint contends that the mandate “substantially burdens the SEALs’ free exercise of religion, and the Department of Defense has failed to prove it has a compelling government interest, or that there are no less restrictive ways to further its effort to mitigate the Covid-19 virus.”\n\nIn another case, Supreme Court Justices Neil Gorsuch and Samuel Alito this week issued a dissenting opinion citing the court’s previous judgment that “under the Free Exercise Clause, government ‘cannot act in a manner that passes judgment upon or presupposes the illegitimacy of religious beliefs and practices.’”\n\nThey continue: “As a result, we have argued that government actions burdening religious practice should be ‘set aside’ if there is even ‘slight suspicion’ that those actions ‘stem from animosity to religion or distrust of its practices.’”\n\nWill that reasoning prevail in court when it comes to military service? Who knows?\n\nBut even if the courts decide that the commander in chief can legally force those in uniform to surrender their religious conscience, should he do so? This is a moral question before it is a legal one. Should President Biden expect the military to protect his religious freedom, if he won’t act to protect their own?", "opengraph": {"image": "https://www.discovery.org/m/2022/01/covid-19-vaccination-record-card-and-personal-facemask-on-us-army-military-uniform-stockpack-adobe-stock-scaled.jpg", "image:width": "2560", "image:height": "1610", "image:alt": "Covid 19 vaccination record card and personal facemask on US Army military uniform", "locale": "en_US", "type": "article", "title": "U.S. Military Uses Religious Test Against Service Members To Enforce Vaccine Mandate", "description": "Members of our military pledge their loyalty to the Constitution. Its First Amendment guarantees freedom of religion. So, it would be perverse to force men and women in uniform to abandon their deeply…", "url": "https://www.discovery.org/a/u-s-military-uses-religious-test-against-service-members-to-enforce-vaccine-mandate/", "site_name": "Discovery Institute", "updated_time": "2022-01-07T00:54+00:00", "article:publisher": "https://www.facebook.com/thediscoveryinstitute", "article:published_time": "2022-01-03T23:18+00:00", "article:modified_time": "2022-01-07T00:54+00:00"}, "tags": ["covid-19", "religious liberty", "Covid-19 vaccine", "medical conscience", "American Military", "vaccine mandates", "Catholic Church"], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/politics/coast-guard-covid-vetting-inquisition", "https://www.al.com/news/2021/12/us-military-has-granted-0-religious-exemptions-for-covid-vaccines.html", "https://catholicfamilynews.com/blog/2021/12/09/the-everything-was-tested-on-hek-lie/", "https://stream.org/the-cell-lines-used-for-covid-19-vaccines-came-from-carefully-planned-abortions-not-miscarriages/", "https://cogforlife.org/guidance/", "https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20081208_dignitas-personae_en.html", "https://www.patheos.com/blogs/throughcatholiclenses/2021/01/if-any-drug-tested-on-hek-293-is-immoral-goodbye-modern-medicine/", "https://www.eeoc.gov/laws/guidance/section-12-religious-discrimination", "https://cogforlife.org/2021/05/12/lets-get-a-few-things-cleared-up-testing-cell-lines-and-fetal-tissue/", "https://s27589.pcdn.co/wp-content/uploads/2020/12/CHART-Analysis-of-COVID-19-Vaccines-02June21.pdf", "https://www.vatican.va/roman_curia/congregations/cfaith/documents/rc_con_cfaith_doc_20081208_dignitas-personae_en.html", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3929111", "https://www.foxnews.com/politics/coast-guard-covid-vetting-inquisition", "https://firstliberty.org/wp-content/uploads/2021/11/SEALs-Complaint.2021.11.09.pdf", "https://www.supremecourt.gov/opinions/21pdf/21a145_gfbi.pdf"], "authors": [], "publish_date": "2022-01-03T23:18+00:00"}