{"result_id": "096005", "URL": "https://www.discovery.org/education/2021/11/02/washington-states-vaccine-mandate-carries-extreme-consequences/", "timestamp": "2023-04-25 14:58:53 CEST+0200", "meta": {"description": "Get vaccinated or get fired. This was the ultimatum issued by Washington State Governor Jay Inslee in August that took effect on October 18…", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/sites/71/2020/09/cropped-acte-tile-32x32.png", "canonical": "https://www.discovery.org/education/2021/11/02/washington-states-vaccine-mandate-carries-extreme-consequences/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Misguided Mandate Will Cost Washington State", "cleaned_text": "Get vaccinated or get fired. This was the ultimatum issued by Washington State Governor Jay Inslee in August that took effect on October 18, impacting thousands of the state’s public servants and community heroes — doctors, nurses, firefighters, police officers, schoolteachers, and beyond. No weekly Covid testing alternative was provided nor was natural immunity taken into account.\n\nInslee’s order requires “all employees, on-site independent contractors, volunteers, goods and services providers, and appointees of designated state agencies to be fully vaccinated against Covid-19” by October 18.\n\nThe expansive order includes employees in “educational settings” which includes:\n\nLooking back, Washington’s K-12 public schools were closed to in-person learning for 12 months due to teacher union leaders’ claiming schools were unsafe. In a rare disagreement with the unions, Inslee went on record in January 2021 to publicly oppose their position, asserting that “we can operate a school safely.”\n\nHis effort was to no avail. So in mid-February, he again tried to combat the union narrative, stating that “schools can safely reopen.” Referencing a Centers for Disease Control and Prevention (CDC) report, Inslee rightfully argued that there was little evidence of widespread Covid-19 transmission in schools. CDC Director Rochelle Walensky also stressed that vaccinating teachers was not necessary for schools to reopen.\n\nFast forward to late summer and early fall, when more data was available including from in-person summer school and nearly all schools fully reopening. The data confirmed the reality that schools could be operated safely. So, to conclude that children are in significantly elevated danger by attending school with unvaccinated school personnel — warranting firing any unvaccinated employee — does not align with the evidence.\n\nWhile the delta variant, which is currently the predominant strain, is more transmissible, the death rate remains very low and is highly age-dependent. According to October data from the CDC, the death rate among those who contract Covid (regardless of vaccination status) is 0.05% for ages 18-29, 0.15% for ages 30-39, 0.40% for ages 40-49, and 1.39% for ages 50-64. However, not many government workers remain in that profession past age 50-60 due to retirement privileges after 20-30 years of employment.\n\nThe August 2021 Proclamation touting the need to protect children during in-person learning not only failed to evaluate the relevant data but ignored the detrimental consequences of the mandate for Washington State and its citizens. With a massive worker shortage wreaking havoc on the state’s and nation’s supply chain, business operation, and school staffing, Inslee has opted to double down on his political power — limiting individual freedom, medical privacy, and the ability of individuals to make medical decisions in consultation with their doctor.\n\nNearly 2,000 state workers, which equates to about three percent, are gone from their jobs because of the October 18 vaccination deadline. Others in the private sector have lost their employment, as well — private school teachers are one example.\n\nThe edict jeopardizes the well-being, and even safety, of those needing service from hospital workers and other medical providers, firefighters, police officers, ferry operators, child protective services, mental health employees, educators, and others. Furthermore, it harms the well-being of those willingly providing service to their community in these vital roles.\n\nStripping employment from an individual and barring them from future employment opportunities, despite job performance and qualifications, pipelines an influx of Washington’s citizens toward governmental handouts — in turn driving up income tax on those remaining employed.\n\nIn this new reality, the state government vaccine mandate is costing those opting not to get vaccinated their professional livelihood, while bringing a significant future, long-term cost to those who comply and get vaccinated. And the overall negative impact on the state’s economy is yet another byproduct of this poor policy.\n\nThere are less draconian measures — regular Covid testing as one example — than the mass firing of the qualified and willing workforce.", "opengraph": {"image": "https://www.discovery.org/m/sites/71/2021/11/washington-state-ferrry-768x512.jpg", "image:width": "768", "image:height": "512", "image:alt": "Washington State Ferry Olympic Mountains Edmonds", "locale": "en_US", "type": "article", "title": "Misguided Mandate Will Cost Washington State", "description": "Get vaccinated or get fired. This was the ultimatum issued by Washington State Governor Jay Inslee in August that took effect on October 18, impacting thousands of the state’s public servants and…", "url": "https://www.discovery.org/education/2021/11/02/washington-states-vaccine-mandate-carries-extreme-consequences/", "site_name": "American Center for Transforming Education", "updated_time": "2021-11-17T18:30+00:00", "article:published_time": "2021-11-02T20:24+00:00", "article:modified_time": "2021-11-17T18:30+00:00"}, "tags": ["medical privacy", "educational settings", "limiting freedom", "school staff shortage", "CDC", "private school teachers", "private sector", "Covid testing", "Jay Inslee", "firing unvaccinated", "October 18", "firing government workers", "teachers", "firefighters", "community heroes", "Delta variant", "firing government employees", "government edict", "nurses", "natural immunity", "COVID-19", "vaccine mandates", "school closures", "doctors", "Washington State", "teacher unions", "K-12", "teacher shortage", "police", "worker shortage"], "tweets": [], "movies": [], "links": ["https://www.governor.wa.gov/sites/default/files/proclamations/21-14.1%20-%20COVID-19%20Vax%20Washington%20Amendment.pdf", "https://www.bizjournals.com/seattle/news/2021/03/16/keri-d-ingraham-classroom-closures-affect-students.html", "https://www.bizjournals.com/seattle/news/2021/03/16/keri-d-ingraham-classroom-closures-affect-students.html", "https://www.vox.com/22699019/covid-19-children-kids-risk-hospitalization-death", "https://www.discovery.org/education/2021/10/12/its-not-only-students-taking-flight-from-public-schools/", "https://www.seattletimes.com/seattle-news/politics/nearly-1900-washington-state-workers-quit-or-are-fired-over-covid-vaccine-mandate/"], "authors": [], "publish_date": "2021-11-02T20:24+00:00"}