{"result_id": "096010", "URL": "https://www.discovery.org/a/dr-jay-bhattacharya-on-covid-19-authentic-public-health-and-the-biosecurity-state/", "timestamp": "2023-04-25 14:58:55 CEST+0200", "meta": {"description": "The COVID pandemic has been one of the most politically and culturally divisive events in American history. Which seems odd. Usually…", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://humanize.today/podcast/dr-jay-bhattacharya-on-covid-19-authentic-public-health-and-the-biosecurity-state/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Dr. Jay Bhattacharya on COVID-19, Authentic Public Health, and the Biosecurity State", "cleaned_text": "The COVID pandemic has been one of the most politically and culturally divisive events in American history. Which seems odd. Usually, a universal external threat unite societies and rallies populations to focus on the common foe. Instead, American society fractured into different tribes, which often coincided with our preexisting political factionalism.\n\nAdding to our woes, the proper approach to scientific inquiry and policy makers’ relationship with the expert class became badly skewed. Once an orthodoxy was declared by the World Health Organization or the Center for Disease Control, government leaders, the mainstream media, and Big Tech circled the wagons to prevent dissenting views from being aired — and even seeking to punish those with differing opinions.\n\nOne of those caught in this cultural oppression was Wesley’s guest on this episode of Humanize. He and Wesley discuss how COVID was treated differently than other pandemics, the personal costs of taking a heterodox view on the best approach to the pandemic, how science has been corrupted by politics, and Bhattacharya’s views on the safety of the COVID vaccines and the wisdom of vaccine mandates. It is an illuminating discussion with a highly credentialed expert about one of the most dramatic scientific events in recent world history.\n\nDr. Jayanta Bhattacharya is a Professor of Health Policy at Stanford University and directs Stanford’s Center for Demography and Economics of Health and Aging.\n\nDr. Bhattacharya’s research focuses on the health and well-being of vulnerable populations, with a particular emphasis on the role of government programs, biomedical innovation, and economics. Dr. Bhattacharya’s recent research focuses on the epidemiology of COVID-19 as well as an evaluation of policy responses to the epidemic. He has published 135 articles in top peer-reviewed scientific journals in medicine, economics, health policy, epidemiology, statistics, law, and public health among other fields. He holds an MD and PhD in economics, both earned at Stanford University.\n\nHe is also a co-author the Great Barrington Declaration, published in the fall of 2020, to great controversy, which dissented against the reigning public health policies being brought to bear against the virus, and offered a heterodox approach that would recommended reopening society as we continued to protect our most vulnerable members from illness.\n• We Cannot Stop the Spread of COVID, But We Can End the Pandemic ⋆ Brownstone Institute\n• The Emergency Must Be Ended, Now ⋆ Brownstone Institute\n• The Collins and Fauci Attack on Traditional Public Health ⋆ Brownstone Institute\n• Fauci Wants UN to ‘Rebuild the Infrastructures of Human Existence’ (theepochtimes.com)", "opengraph": {"image": "https://humanize.today/wp-content/uploads/sites/5/2022/02/A61202EE-EEA7-41B1-B217-EDB0C897E9C5.jpeg", "image:width": "1024", "image:height": "585", "locale": "en_US", "type": "article", "title": "Dr. Jay Bhattacharya on COVID-19, Authentic Public Health, and the Biosecurity State", "description": "The COVID pandemic has been one of the most politically and culturally divisive events in American history. Which seems odd. Usually, a universal external threat unite societies and rallies…", "url": "https://humanize.today/podcast/dr-jay-bhattacharya-on-covid-19-authentic-public-health-and-the-biosecurity-state/", "site_name": "Humanize", "updated_time": "2022-09-09T16:59+00:00", "article:published_time": "2022-02-28T05:17+00:00", "article:modified_time": "2022-09-09T16:59+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://humanize.today/wp-content/uploads/sites/5/2022/02/Jay-Bhattacharya-Episode.mp3", "https://gbdeclaration.org/", "https://brownstone.org/articles/we-cannot-stop-the-spread-of-covid-but-we-can-end-the-pandemic/", "https://brownstone.org/articles/the-emergency-must-be-ended-now/", "https://brownstone.org/articles/the-collins-and-fauci-attack-on-traditional-public-health/", "https://www.theepochtimes.com/fauci-wants-un-to-rebuild-the-infrastructures-of-human-existence_3490021.html"], "authors": [], "publish_date": "2022-02-28T05:17+00:00"}