{"result_id": "096001", "URL": "https://www.discovery.org/a/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/", "timestamp": "2023-04-25 14:58:50 CEST+0200", "meta": {"description": "Francis Collins is Director of the National Institutes of Health (NIH). He also is the most well-known evangelical Christian in the federal science…", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/2020/09/cropped-di-tile-white-32x32.png", "canonical": "https://www.discovery.org/a/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Francis Collins’ Rhetoric About the Unvaccinated is Anything but Christian", "cleaned_text": "Francis Collins is Director of the National Institutes of Health (NIH). He also is the most well-known evangelical Christian in the federal science establishment.\n\nBut his recent rhetoric is anything but Christian.\n\nEarlier this month, Collins appeared on MSNBC. He first suggested that unvaccinated people were selfish, declaring that “this is really an occasion to think about loving your neighbor, not just yourself.”\n\nCollins then attacked unvaccinated people and politicians who oppose vaccine mandates as killers on the wrong side of history.\n\nDismissing their concerns as a “philosophical political argument” that is part of “a culture war,” Collins said their view is “killing people, including, I’m sad to say, some children.”\n\n“Citizens, we will not escape history,” he declared. “Do you want to be looked at… 10 years from now and defend what you did when in fact, we are losing tens of thousands of lives that didn’t have to die?”\n\nCollins’ rhetoric is self-righteous. It’s vicious. And it’s based on false claims.\n\nThe Risks Real People Have to Weigh\n\nIf you have a healthy teenage son, are you being “selfish” if you don’t want him to get a COVID-19 vaccine? According to a new study, teenage males are vastly more likely to suffer a post-vaccine heart problem (a “cardiac adverse event”) than hospitalization due to a COVID-19 infection.\n\nIs it selfish or loving to be concerned about the risk to your son?\n\nOr what if you’ve already recovered from COVID-19? That includes more than 119 million Americans. According to studies, those who have had COVID-19 are far less likely to get infected again than vaccinated individuals who haven’t yet had the disease.\n\nSo are you a selfish killer simply because you want to rely on your natural immunity after having recovered from COVID-19?\n\nWhat if you are a healthy person under age 65 with no underlying health conditions? Your risk of hospitalization from COVID-19 is small. Are you irrational or selfish because you have concerns about the risk of taking a COVID-19 vaccine?\n\nSince 1990, over 1.5 million adverse events have been submitted to the government’s Vaccine Adverse Event Reporting System (VAERS). Guess what percentage of these adverse events come from the COVID-19 vaccines? Five percent? Ten percent? Twenty percent?", "opengraph": {"image": "https://www.discovery.org/m/2021/09/collins-fauci-biden-nih.jpg", "image:width": "1600", "image:height": "1066", "image:alt": "Francis Collins at the Viral Pathogenesis Laboratory at the National Institutes of Health Laboratory", "locale": "en_US", "type": "article", "title": "Francis Collins’ Rhetoric About the Unvaccinated is Anything but Christian", "description": "Francis Collins is Director of the National Institutes of Health (NIH). He also is the most well-known evangelical Christian in the federal science establishment. But his recent rhetoric is anything…", "url": "https://www.discovery.org/a/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/", "site_name": "Discovery Institute", "updated_time": "2021-10-04T21:18+00:00", "article:publisher": "https://www.facebook.com/thediscoveryinstitute", "article:published_time": "2021-09-30T00:14+00:00", "article:modified_time": "2021-10-04T21:18+00:00"}, "tags": ["vaccine passports", "covid-19", "vaccination", "Francis Collins", "bioethics", "The Golden Rule", "lover your neighbor"], "tweets": [], "movies": [], "links": ["https://www.msnbc.com/transcripts/transcript-all-chris-hayes-9-9-21-n1278904", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/burden.html", "https://www.medrxiv.org/content/10.1101/2021.06.01.21258176v2", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1.full.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/clinical-care/underlyingconditions.html", "https://www.nih.gov/news-events/nih-research-matters/most-covid-19-hospitalizations-due-four-conditions", "https://stream.org/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/"], "authors": [], "publish_date": "2021-09-30T00:14+00:00"}