{"result_id": "096046", "URL": "https://www.discovery.org/p/thaxton/", "timestamp": "2023-04-25 14:59:28 CEST+0200", "meta": {"description": "Charles Thaxton received his Ph.D. in physical chemistry from Iowa State University. He completed two post-doctoral programs, one in history of science at…", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/2020/09/cropped-di-tile-white-32x32.png", "canonical": "https://www.discovery.org/p/thaxton/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Charles Thaxton", "cleaned_text": "Charles Thaxton received his Ph.D. in physical chemistry from Iowa State University. He completed two post-doctoral programs, one in history of science at Harvard University and the second in the molecular biology laboratories of Brandeis University.\n\nHe has specialized in the origin of life and in science’s relationship with Christianity through history.\n\nHe is co-author of The Mystery of Life’s Origin and also The Soul of Science. He is Academic Editor of the high school biology book Of Pandas and People. He has contributed significant chapters to the books God and Culture and The Creation Hypothesis.\n\nHe has published technical articles in Journal of Inorganic Chemistry, Journal of Scientific Instruments, and Journal of Cell Biology.\n\nHe has lectured widely in American universities including Princeton University, Yale University, University of Michigan, University of Delaware, Rice University, Texas Universtiy, Johns Hopkins University, Vanderbilt University, and Harvard Law School.\n\nHe has lectured outside the country at the Korean Advanced Institute of Science, the Russian Academy of Science, and in various universities in Mongolia, Romania, Poland, Hungary, and the former Czechoslovakia.\n\nHe has held appointments at Slovak Technical University in Bratislava, Czechoslovakia, the Biomathematical Institute in Craiova, Romania, and at Charles University in Prague, where he was a Templeton scholar in the department of natural sciences.\n\nHe is a member of American Chemical Society, American Association for the Advancement of Science, and Fellow of American Institute of Chemistry, American Scientific Affiliation, and Discovery Institute.\n\nHe and his wife Carole homeschooled two sons, both of whom are college graduates. He is a survivor of two bouts of cancer, which left him with one leg and one lung. He and his wife reside near Atlanta, Georgia, where they teach homeschooled teens at Konos Academy. He also is writing two books, punctuated by speaking stints.", "opengraph": {"image": "https://www.discovery.org/m/2021/03/cropped-DI-2021-sunrise-moon-slide-scaled-1.jpg", "image:width": "2560", "image:height": "1345", "locale": "en_US", "type": "profile", "title": "Charles Thaxton", "description": "Charles Thaxton received his Ph.D. in physical chemistry from Iowa State University. He completed two post-doctoral programs, one in history of science at Harvard University and the second in the…", "url": "https://www.discovery.org/p/thaxton/", "site_name": "Discovery Institute"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}