{"result_id": "096012", "URL": "https://www.discovery.org/leadership/blog/vaccine-shaming-is-not-a-cure", "timestamp": "2023-04-25 14:58:57 CEST+0200", "meta": {"description": "Blaming the unvaccinated is the sharpest tool in President Joe Biden's shed, and that is not healthy for America.", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/sites/51/2017/08/cropped-leadership-logo-footer@2x-32x32.png", "canonical": "https://www.discovery.org/leadership/blog/vaccine-shaming-is-not-a-cure", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Vaccine Shaming Is Not a Cure", "cleaned_text": "Blaming the unvaccinated is the sharpest tool in President Joe Biden’s shed, and that is not healthy for America.\n\nConsider Biden’s address to the nation on COVID-19 from the White House State Dining Room Tuesday. Biden started off well enough as he offered that he shared the public’s frustration and loss and commended Americans who have been vaccinated.\n\nThen he turned to vaccination shaming.\n\n“You have an obligation to yourselves, to your family and, quite frankly — I know I’ll get criticized for this — to your country” to get vaccinated, Biden declared.\n\nHe added, “I honest to God believe it’s your patriotic duty.”\n\nCalling the unvaccinated unpatriotic — that’ll win them over. Too bad Biden didn’t call them stupid, too.\n\nBiden’s remarks were not completely tone-deaf. Aware that red states like Alabama have a much lower rate of vaccination than blue states like California, Biden credited former President Donald Trump for getting vaccinated and a booster shot. “It may be one of the few things he and I agree on,” the Democrat quipped.\n\nBiden even credited “the prior administration and our scientific community” for making America one of the earliest countries to develop vaccines.\n\nHe could have done more. There are pockets of the vaccine-resistant who don’t trust the scientific establishment because they’ve seen a tendency to shut down unorthodox opinions.\n\nStanford Medical School epidemiologist Jay Bhattacharya tweeted that the Biden address had positives but took issue with Biden “blaming ‘misinformation’ for vaccine hesitancy without an acknowledgment that the government & some media have caused great harm to trust in science & the vaccines by their propaganda and silencing of scientific dissidents.”\n\nThe American Institute for Economic Research reported that retiring Director of National Institutes of Health Francis Collins asked colleagues to publish “a quick and devastating” takedown of the October 2020 Great Barrington Declaration, which warned of the devastating public-health effects of blanket COVID-19 lockdowns and called for a return to normal.\n\nCollins dismissed the three authors, Bhattacharya, Oxford University epidemiologist Sunetra Gupta and Harvard epidemiologist Martin Kulldorff as “fringe epidemiologists.”\n\nBut they were right, and the numbers suggest that’s exactly what happened. According to The New York Times, 95% of Americans aged 65 and older have had at least one vaccine dose, and 88% are fully vaccinated. So, yaaay.\n\nAnd this Biden statement is just wrong: “Almost everyone who has died from COVID-19 in the past many months has been unvaccinated.”\n\nAccording to the Centers for Disease Control and Prevention, there were 16,700 COVID-19 deaths of vaccinated individuals — compared with nearly 60,000 unvaccinated, from April through November. The CDC now estimates that unvaccinated individuals are 20 times more likely to die than vaccinated people.\n\nAmid mushrooming breakthrough cases, Americans are looking for tests and not finding them on pharmacy shelves. Here, the Biden administration has come up short. The administration promised half a billion tests next month — too little, too late.\n\nDuring the 2020 campaign, Biden and other Democrats were merciless in their bashing of Trump for being unprepared and not sufficiently forceful in taking on the virus.\n\nTell me how Biden’s better, because I don’t see it. The last year has been a year of drift.\n\nLike Trump, Biden is not responsible for COVID-19, but he is responsible for his response to it.\n\n“Blaming people for getting sick is wrong & bad for public health. It will make many vaccine-hesitant individuals distrust the message & further social division,” Bhattacharya warned.", "opengraph": {"image": "https://www.discovery.org/m/sites/51/2021/05/Biden-with-Mask-On.jpg", "image:width": "560", "image:height": "470", "locale": "en_US", "type": "article", "title": "Vaccine Shaming Is Not a Cure", "description": "Blaming the unvaccinated is the sharpest tool in President Joe Biden's shed, and that is not healthy for America.", "url": "https://www.discovery.org/leadership/blog/vaccine-shaming-is-not-a-cure", "site_name": "Chapman Center for Citizen Leadership", "updated_time": "2022-01-04T20:20+00:00", "article:published_time": "2021-12-26T20:16+00:00", "article:modified_time": "2022-01-04T20:20+00:00"}, "tags": ["Democrats", "COVID-19", "Vaccine Mandates", "Biden"], "tweets": [], "movies": [], "links": ["https://www.mgid.com/ghits/11556942/i/123055/0/pp/1/1?h=17RKV9hg0HLIzShy6_vg4qZWhxmUq78JBXRW-WwtJiMjNFn7FozLBOxLskm_CMpq&rid=4c6d24a3-6d9b-11ec-9c64-78ac440ce852&ts=realclearpolitics.com&tt=Referral&att=4&cpm=1&gbpp=1&abd=1&iv=11&ct=1&gdpr=0&muid=k8176_23jbWa"], "authors": [], "publish_date": "2021-12-26T20:16+00:00"}