{"result_id": "096033", "URL": "https://www.discovery.org/education/2021/01/21/teachers-vaccines-debate-demands/", "timestamp": "2023-04-25 14:59:17 CEST+0200", "meta": {"description": "With COVID-19 vaccines in the early stages of rollout across the U.S., a debate has sparked: Should teachers reenter classrooms prior to vaccination?", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/sites/71/2020/09/cropped-acte-tile-32x32.png", "canonical": "https://www.discovery.org/education/2021/01/21/teachers-vaccines-debate-demands/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Teachers & Vaccines: Debate & Demands", "cleaned_text": "The emotionally charged feelings surrounding COVID-19, largely linked with politics, are nowhere stronger than in the discussion about K-12 public school reopenings. As we now experience a transition of the U.S. presidency from Republican to Democratic hands, the vastly differing viewpoints remain as strong as ever. Front and center are both a debate about the way forward and new demands from teachers.\n\nWith COVID-19 vaccines in the early stages of rollout across the U.S., a debate has sparked: Should teachers reenter classrooms prior to vaccination? Teacher unions champion the notion that forcing teachers to return to classrooms before receiving the vaccine is mistreatment of employees. The opposing viewpoint is schools should be open without further delay.\n\nStating the obvious, Sarah Schwartz writes, “Opening more physical classrooms to students means that more teachers may have to come into schools. Some districts have denied many teachers’ requests to work remotely…in order to adequately staff in-person classes for the number of students who have chosen to return to school buildings.” How is this any different from retail stores, restaurants, or even gyms? Opening each requires employees to come to work in-person. And as in-person customer volume increases, more on-site employees will be needed. While employees in companies may request work from home privileges, that may not be feasible or effective in many industries that serve customers. Should school teachers be exempt from standard employee expectations?\n\nGovernment paid K-12 public school teachers have not been deemed essential workers since the early spread of the virus in March 2020. However, in some cases, teacher unions are now adopting the essential worker description in an effort to expedite teachers receiving the vaccine. Insisting teachers working from home be prioritized along with healthcare workers is illogical. Comparing teachers who at some point in the future will return to the controlled environment of a classroom to front-line healthcare workers facing the highest risk of contraction (most of whom have faithfully remained at their jobs in-person the past nine plus months) is ludicrous.\n\nFurthermore, data has shown children and teens are not high virus spreaders. Nor are teachers in a demographic likely to be hardest hit by the disease. Research from Yale School of Medicine reveals “age is the strongest predictor of mortality, with risk climbing after age 55. Patients under the age of 50 with COVID-19 have only a 1 percent chance of dying. Those 85 and older have at least a 34 chance of dying if they get COVID-19….Another important predictor of COVID-19 mortality is the number of diagnoses a patient has based on the Charlson Comorbidity Index (CCI), a listing of 17 health conditions including diabetes, liver disease, and dementia.” Also important to note, as reported by the CDC, “only 6% of deaths have COVID-19 as the only cause mentioned, revealing that 94% of patients who died from coronavirus also had other ‘health conditions and contributing causes.’”\n\nTeachers who fall into the high age or high comorbidity category should be prioritized based on those factors instead of a blanket approach of early vaccination for all teachers. Lieutenant Governor Jon Husted outlines Ohio’s sensible approach: “School personnel will only be prioritized for vaccinations if the school will reopen for in-person education.”\n\nThe experience of private schools and public schools that reopened to provide full in-person learning in August and September confirms K-12 schools are among the lowest of risks for virus spreading. Evidently, “following the science” only applies when it aligns with one’s predetermined ideological approach or political interests.\n\nNot only is a fierce debate underway, but teacher demands are surfacing as well. Unsurprisingly, the main demand is for more money, with teacher unions advocating for hazard pay, bonuses, and overall pay raises for their teachers. Without receiving met demands, district leaders are keeping schools closed.\n\nAs of January 13, nationwide, 49.5 percent of K-12 students experience their school only offering virtual learning. In other words, half of all U.S. K-12 schools are closed to any form of in-person learning. This is the current reality for families, despite the gradual move to reopen schools late in the fall of 2020 when the figure was 37.2 percent, according to Burbio’s K-12 school opening tracker data presented by Education Week’s Catherine Gewertz.\n\nAccording to Mike Antonucci, it can’t be assumed vaccine availability will reopen schools. He explains: “I have yet to see any teacher unions declare that all they need is a vaccination to return to work. Bargaining will be long and difficult, and in some places, fruitless. Even if every school employee were vaccinated, we would expect unions to insist that community infection rates drop dramatically before teachers return to work….So whether you see a classroom as a high risk environment or not, the addition of a vaccine isn’t really a game-changer — at least not for the short term.”\n\nChicago Public Schools illustrates how teacher demands are playing out. With half of the school year already past, the district is planning for a staggered January reopening. In preparation, school officials announced, “teachers who do not show up to work on Monday [January 4] will not be eligible for pay.” That seems reasonable.\n\nHowever, teachers, backed by their strong union, balked at the expectation. Despite the proactive communication by the district, “just over half of all teachers ordered to report to [Chicago] city public schools did not show up to prepare for in-person instruction.” Subsequently, the district sent emails to all individuals reiterating the expectations. Chicago Public Schools CEO Janice Jackson had a fitting comment concerning those who did report back to work: “These teachers chose to attend school despite significant pressure from union leadership, which is openly engaged [and] encouraged both parents and students to remain out of the classroom in defiance of actual public health guidance.”\n\nOn the important decision regarding when schools should reopen, teacher unions seem to wield power — rather than infectious disease experts, public health officials, and parents. Keri Rodrigues, founding president of the National Parents Union, explains: “Many public health experts have said public schools can—and should—safely reopen in communities with low COVID-19 infection rates and with safety protocols in place, and that there are health and academic risks to keeping children home, too. And a vocal contingent of parents has called for schools to stay open…clashing with the teachers’ unions.” She rightfully laments, “the balance of power is off.” Although parents trust the medical experts, “often, teachers’ unions are the loudest voices at the decision-making table.”\n\nIt’s not surprising research regarding reopening plans from over 10,000 school districts discovered “districts with stronger unions, as measured by district size and whether there’s collective bargaining, were less likely to hold in-person classes.” Similarly, research of 400 plus Wisconsin school districts uncovered the correlation between districts with teachers’ union and districts opting not to reopen. Infection rates within the community were not the leading factor concerning reopening decisions.\n\nDespite the data supporting a conclusion that schools can safely reopen, teacher unions have driven a contrary narrative — one characterized by fear. The consequence is a misplaced focus. We need to return the emphasis in education to what’s best for students, with consideration given to parents’ preferences and priorities — not those of teacher unions. It’s not too late to change course for the current school year and return students to in-person classrooms.", "opengraph": {"image": "https://www.discovery.org/m/sites/71/2021/01/doctor-vaccinating-young-man-in-clinic-stockpack-adobe-stock-scaled.jpg", "image:width": "2560", "image:height": "1707", "image:alt": "Doctor vaccinating young man in clinic", "locale": "en_US", "type": "article", "title": "Teachers & Vaccines: Debate & Demands", "description": "With COVID-19 vaccines in the early stages of rollout across the U.S., a debate has sparked: Should teachers reenter classrooms prior to vaccination? Demands are surfacing.", "url": "https://www.discovery.org/education/2021/01/21/teachers-vaccines-debate-demands/", "site_name": "American Center for Transforming Education", "updated_time": "2021-01-21T20:51+00:00", "article:published_time": "2021-01-21T20:51+00:00", "article:modified_time": "2021-01-21T20:51+00:00"}, "tags": ["in-person learning", "closed school", "remote learning", "K-12 public school teachers", "remote school", "teacher unions", "Coronavirus", "Covid-19 vaccine", "vaccine", "COVID-19", "in-person instruction", "reopen schools", "schools closed", "teacher union demand"], "tweets": [], "movies": [], "links": ["https://www.edweek.org/teaching-learning/some-states-order-schools-to-be-open-but-teachers-cant-yet-get-the-vaccine/2021/01?utm_source=nl&utm_medium=eml&utm_campaign=eu&M=59838632&U=&UUID=f09155779331bbfa380df6bbb6482bf0", "https://medicine.yale.edu/news-article/28980/", "https://www.edweek.org/teaching-learning/districts-retreat-to-remote-learning-even-as-biden-calls-for-reopening-schools/2021/01?utm_source=nl&utm_medium=eml&utm_campaign=eu&M=59834100&U=&UUID=f09155779331bbfa380df6bbb6482bf0", "http://www.eiaonline.com/intercepts/2021/01/06/dont-assume-vaccine-will-reopen-schools/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Intercepts+%28Intercepts%29", "https://cai.burbio.com/school-opening-tracker/", "https://www.edweek.org/teaching-learning/districts-retreat-to-remote-learning-even-as-biden-calls-for-reopening-schools/2021/01?utm_source=nl&utm_medium=eml&utm_campaign=eu&M=59834100&U=&UUID=f09155779331bbfa380df6bbb6482bf0", "http://www.eiaonline.com/intercepts/2021/01/06/dont-assume-vaccine-will-reopen-schools/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Intercepts+%28Intercepts%29", "https://www.nbcchicago.com/news/local/teachers-who-dont-show-up-to-work-monday-wont-be-paid-cps-says/2411790/", "https://www.edweek.org/teaching-learning/how-teachers-unions-are-influencing-decisions-on-school-reopenings/2020/12", "https://www.edweek.org/teaching-learning/how-teachers-unions-are-influencing-decisions-on-school-reopenings/2020/12"], "authors": [], "publish_date": "2021-01-21T20:51+00:00"}