{"result_id": "096036", "URL": "https://www.discovery.org/a/former-public-health-officials-undermine-public-trust-with-conduct-unbecoming-scientists/", "timestamp": "2023-04-25 14:59:19 CEST+0200", "meta": {"description": "Anthony Fauci, the former head of the National Institutes of Allergy and Infectious Diseases, infamously boasted, “I represent science.” Let’s hope not.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://humanize.today/2023/03/former-public-health-officials-undermine-public-trust-with-conduct-unbecoming-scientists/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Former Public Health Officials Undermine Public Trust with Conduct Unbecoming Scientists", "cleaned_text": "Anthony Fauci, the former head of the National Institutes of Allergy and Infectious Diseases, infamously boasted, “I represent science.” Let’s hope not. His actions during the COVID emergency both corrupted science and undermined trust in our most important public health institutions.\n\nEarly in the pandemic, I believed Fauci would approach his duties with integrity and intellectual rigor. After all, he effectively engaged the struggle against AIDS—such as assisting President George W. Bush in creating the U.S. President’s Emergency Plan for AIDS Relief, which has saved countless lives around the world—and I expected that he would perform his COVID duties with similar excellence. I also thought highly of Francis Collins, who once headed the Human Genome Project and went on to lead the National Institutes of Health (NIH).\n\nSilly me. Recent revelations show that both Fauci and Collins appeared to act acted more like turf-protecting bureaucrats than they did public health scientists.\n\nLet’s start with the latest news. Early in the pandemic, Fauci appeared at a White House briefing at which he told reporters that a just published peer-reviewed paper demonstrated that the virus leaped from animals to humans and, moreover, that a lab leak from the Wuhan Institute of Virology was “improbable.”\n\nFauci acted as if he had nothing to do with the study, which he claimed was authored by “a group of highly qualified evolutionary virologists.” He even said disingenuously, “I don’t have the authors right now,” strongly implying that the report was rendered without his involvement.\n\nThat wasn’t true. Recently disclosed emails obtained by the House Select Subcommittee on the Coronavirus Pandemic demonstrate that not only did Fauci seemingly prompt publication of the paper with the apparent purpose of discrediting the “lab leak” theory, but according to Republican committee members, helped edit it and had final approval of its contents.\n\nThe newly uncovered emails are a bombshell. In February 2020, one of the authors of the study, Dr. Kristian Andersen, wrote to a colleague, “Our main work over the last couple of weeks has been focused on trying to disprove any type of lab theory …” In other words, rather than seek to learn what led to the outbreak without any desired conclusion, the paper may have been deliberately aimed at covering up the potential that the lab leak was what caused the pandemic.\n\nWhy do that? There is credible evidence that the NIH approved funding research at the Wuhan lab known as “gain of function,” which manipulates viruses to make them more dangerous to humans as a means of gaining information to fight future pandemics. If that was indeed the cause of the pandemic, there will be serious consequences.\n\nBack to the emails. Andersen wrote to the science journal Nature Medicine—which would publish the study—that the investigation was “prompted” by Fauci, Collins, and another scientist. Republican investigators (pdf) have also determined that Fauci and Collins were given the opportunity to review the paper before it was submitted for publication—which is something that Fauci surely remembered when he lied by omission to the press.\n\nNot only did Fauci’s obfuscation lack integrity, but it may have delayed investigative focus on the lab leak hypothesis that now has gained considerable credibility. For example, FBI Director Christopher Wray recently said that a leak is the “most likely” cause of the pandemic.\n\nSecretly participating in “the lab didn’t do it” paper wouldn’t be the last time Fauci and Collins were both guilty of conduct unbecoming a scientist. They also engaged in similar obfuscation in their joint attempt to discredit the Great Barrington Declaration (GBD).\n\nWhen public health experts Dr. Jay Bhattacharya, Dr. Martin Kulldorff, and Dr. Sunetra Gupta published the GBD in October 2020 challenging the wisdom of societal lockdowns and keeping children, who were at little risk, out of school—while simultaneously urging “focused” protection for the elderly and other vulnerable populations—a concerned Collins emailed Fauci stating, “This proposal from the three fringe epidemiologists who met with the [HHS] Secretary [Alex Azar] seems to be getting a lot of attention.”\n\nFringe? None of the authors warrants that denigrating descriptive. To the contrary, all were and are prominent in their fields. Bhattacharya teaches at Stanford Medical School, Kulldorff at Harvard, and Gupta at Oxford. Bhattacharya alone had published more than 100 peer-reviewed articles at the time of Collins’s dismissive comment.\n\nRather than engage the authors of the Declaration as colleagues and peers with different opinions—which would be in accord with the proper working of the scientific method—Collins’s email to Fauci instead urged that the authors be discredited, writing: “There needs to be a quick and devastating published take down of its premises. I don’t see anything like that on line yet—is it underway?”\n\nIt soon was. Articles appeared quickly in publications such as Wired, in which science editor Matt Reynolds called the controversy over the proper response to COVID “a manufactured scientific debate.”\n\nAt about the same time, a column in The Washington Post described the three authors as “mavericks” and quotes Collins as saying: “This is a fringe component of epidemiology. This is not mainstream science. It’s dangerous. It fits into the political views of certain parts of our confused political establishment.”\n\nFor his part, Fauci told ABC News that the Great Barrington Declaration’s proposals were “total nonsense.”\n\nOf course, we now know that Bhattacharya, Kulldorff, and Gupta had the better argument. The harm done unnecessarily to children—their lost time in school, the reduced quality they received from virtual classes, not to mention, missed socialization—is a blow from which many will never recover.\n\nFauci and Collins owe the country an apology for their failures of scientific and public policy leadership. By stifling investigations of the lab leak hypothesis—efforts that extended well beyond their direct participation in the publication of the lab leak study discussed above—and seeking to discredit the Great Barrington Declaration and its authors, two of the nation’s top public health officials obstructed the proper deliberative process essential to fashioning proper policy responses to the emergency—and in so doing, badly tarnished the reputations of our most important public health institutions.", "opengraph": {"image": "https://humanize.today/wp-content/uploads/sites/5/2021/10/collins-fauci-biden-nih.jpg", "image:width": "1600", "image:height": "1066", "image:alt": "Francis Collins at the Viral Pathogenesis Laboratory at the National Institutes of Health Laboratory", "locale": "en_US", "type": "article", "title": "Former Public Health Officials Undermine Public Trust with Conduct Unbecoming Scientists", "description": "Anthony Fauci, the former head of the National Institutes of Allergy and Infectious Diseases, infamously boasted, “I represent science.” Let’s hope not. His actions during the COVID emergency both…", "url": "https://humanize.today/2023/03/former-public-health-officials-undermine-public-trust-with-conduct-unbecoming-scientists/", "site_name": "Humanize", "updated_time": "2023-03-13T17:11+00:00", "article:published_time": "2023-03-10T17:01+00:00", "article:modified_time": "2023-03-13T17:11+00:00"}, "tags": ["COVID-19", "Anthony Fauci", "Francis Collins"], "tweets": [], "movies": [], "links": ["https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-11824905%2FEmails-Dr-Fauci-commissioned-February-2020-paper-disprove-COVID-leaked-Wuhan-lab.html&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293185946%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=%2BGTyRGA4XmsIJyHfRBurY9c3%2F3yDZoh9daeDgAoUWqc%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Ftheintercept.com%2F2021%2F09%2F09%2Fcovid-origins-gain-of-function-research%2F&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293185946%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=HjbANUoskJwaurtmRWpdb06VJs49mXu5G2jG0InnyW8%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Foversight.house.gov%2Fwp-content%2Fuploads%2F2023%2F03%2F2023.03.05-SSCP-Memo-Re.-New-Evidence.Proximal-Origin.pdf&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293185946%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=cnBySFW9DCt1XrMfbmJeVuDxGxmMXLBAgTisuWh6FXg%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.wsj.com%2Farticles%2Ffbi-director-says-covid-pandemic-likely-caused-by-chinese-lab-leak-13a5e69b&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293185946%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=DklVO0apPHx0KxKbCdyDQD3kGmcVUUO6vYU6UgBfos4%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-10324873%2FEmails-reveal-Fauci-head-NIH-colluded-try-smear-experts-called-end-lockdowns.html&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293185946%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=I%2FaSy8QNk7OcfgXAc9SEop%2B6jL7FTnWtNRwwHNWdLdY%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-10324873%2FEmails-reveal-Fauci-head-NIH-colluded-try-smear-experts-called-end-lockdowns.html&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293342776%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=nO4DDXRtfdd18eoWz3QmKFUHk9304Y2zXl%2BYknolwBA%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.wired.co.uk%2Farticle%2Fgreat-barrington-declaration-herd-immunity-scientific-divide&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293342776%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=jfIosWIlb%2B91ml1vuJzHU%2F7jWYLCfa7VmntSjcxQYS0%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.washingtonpost.com%2Fhealth%2Fcovid-herd-immunity%2F2020%2F10%2F10%2F3910251c-0a60-11eb-859b-f9c27abe638d_story.html&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293342776%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=%2FrE4DX5Nm6sIXMs4uT8umXC2SJELaRRDBwX99Wb8whY%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fabcnews.go.com%2FHealth%2Flive-updates%2Fcoronavirus%2F%3Fid%3D73623859%2373627869&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293342776%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=qJtwi9IGHp78NcZ6ZIlYKjCH%2FcEsJAOrbxceZz7BvQA%3D&reserved=0", "https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.theepochtimes.com%2Fideological-scientists-created-the-science-credibility-gap_4244848.html&data=05%7C01%7Cjmeyer%40discovery.org%7C6701e8159093471bf18d08db22151c7b%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638141246293342776%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=74q0KdOCp8oF3xzO5GyV53nr%2FDr2ivW%2BWk%2FCD85bm7Y%3D&reserved=0"], "authors": [], "publish_date": "2023-03-10T17:01+00:00"}