{"result_id": "096026", "URL": "https://www.discovery.org/a/questioning-vaccine-mandates/", "timestamp": "2023-04-25 14:59:09 CEST+0200", "meta": {"description": "If a free society is to remain worthy of the name, persuasion—not coercion—must be the watchword. Because if COVID becomes the excuse for government and Big…", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://humanize.today/2021/08/questioning-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Questioning Vaccine Mandates", "cleaned_text": "The COVID vaccines have hardly ameliorated our disagreements over public health policies. Instead, they have made our disharmony more bitter. We are now divided into three distinct vaccine tribes.\n\nThe pro-vaccine/pro-mandate tribe has taken the jab and insists that everyone else be inoculated too. The anti-vaccine/anti-mandate tribe refuses to be inoculated and plans to resist all mandates. This tribe includes some healthcare workers. For example, Houston Methodist Hospital fired more than 150 nurses and other staffers when they sacrificed their jobs rather than receive the jab.\n\nThen there is my tribe, the pro-vaccine/anti-mandate middle-grounders. We see the vaccine as the best chance to mitigate the virus, and we strongly encourage the hesitant to be inoculated. At the same time, we understand that COVID isn’t nearly as dangerous as smallpox. Nor is it polio. Unlike those plagues, the lethal threat is mostly limited to the elderly, the vast majority of whom have already been vaccinated. Those in my tribe worry that if the pro-mandate tribe forces the hesitant to get the shots, the last vestiges of comity in the country will be shattered. Gone will be the days in which reasonable people were allowed to disagree and remain friends.\n\nA national mandate would probably not be constitutional, but even state and local mandates may not be legal. We will soon find out, as local mandates are beginning to be issued. New York City, for example, is requiring all employees of the city’s Department of Education to be vaccinated. The San Antonio School District is too.\n\nThe Supreme Court ruling often cited by mandate-mongers is Jacobson v. Massachusetts, decided in 1905, which permitted Cambridge, Massachusetts, to punish residents who refused a smallpox vaccination during an outbreak emergency. This was a local mandate. But the power of the locality was not absolute. A government cannot just pass whatever law it wants because there is a crisis. As the Jacobson ruling made clear (my emphasis), “liberty may at times, under the pressure of great dangers, be subjected to such restraint, to be enforced by reasonable regulations, as the safety of the general public may demand.” A mandatory COVID vaccine could well be deemed unreasonable in locales in which the number of cases is low.\n\nAside from the unsettled legal questions, there are other problems with vaccine mandates.\n\nFirst, mandates don’t take into account those with natural immunity. This is like taking a shotgun approach when a rifle is needed. There is significant evidence that people who have already had COVID are naturally resistant to reinfection, and blanket mandates are not sufficiently nuanced to accommodate those with this acquired natural immunity. It is unreasonable to force people with existing antibodies to be involuntarily injected with substances, particularly since there is a slight potential for serious side effects.\n\nVaccine mandates would also sow distrust between doctors and patients. Consider that an Alabama physician has told his patients that he will no longer treat them if they are unvaccinated. Other doctors have suggested they might follow suit. Mandates could lead even more doctors to similarly coerce their patients, increasing the potential for such conflicts. But refusing to treat the unvaccinated is abandonment, pure and simple. If you disagree, consider this analogy: Would society ever countenance a doctor refusing to care for a sexually active gay patient who refused to take anti-HIV drugs as a prophylactic? Of course not, nor should the doctor refuse the patient care. The same applies here.\n\nFinally, vaccine mandates would empower the corporatocracy. President Biden seems to understand that the executive branch doesn’t have the power to order everyone in the country to be vaccinated. That is why he has urged corporations to do the deed for him. Having the private sector serve government purposes permits arbitrary actions and circumvents democratic checks and balances. That is not the American way.\n\nMuch like viruses, authoritarianism can spread. In free societies, significant interference with civil liberties is justified only by urgent need—and then should be done in the least intrusive way practicable. A COVID vaccine mandate simply does not pass that test—especially with COVID testing readily available. Indeed, a reasonable compromise to mandates would give people a choice: Either prove you are inoculated and/or have COVID antibodies from a prior infection, or receive regular tests. This would be a far less intrusive regulation, but would still offer significant public health benefits.\n\nBottom line: If a free society is to remain worthy of the name, persuasion—not coercion—must be the watchword. Because if COVID becomes the excuse for government and Big Business to exert such extreme control, even greater intrusions on civil liberties will surely follow. Once power is grabbed, the grabbers rarely let go.", "opengraph": {"image": "https://humanize.today/wp-content/uploads/sites/5/2021/10/vaccine-mandate-scaled.jpg", "image:width": "2560", "image:height": "1706", "image:alt": "A no vaccine, no mask, no entry sign at a restaurant, cafe or other establishment.", "locale": "en_US", "type": "article", "title": "Questioning Vaccine Mandates", "description": "If a free society is to remain worthy of the name, persuasion—not coercion—must be the watchword. Because if COVID becomes the excuse for government and Big Business to exert such extreme control…", "url": "https://humanize.today/2021/08/questioning-vaccine-mandates/", "site_name": "Humanize", "updated_time": "2021-10-02T00:08+00:00", "article:published_time": "2021-08-31T17:24+00:00", "article:modified_time": "2021-10-02T00:08+00:00"}, "tags": ["vaccine mandates", "Public Health", "COVID-19", "religious liberty"], "tweets": [], "movies": [], "links": ["https://www.latimes.com/world-nation/story/2021-06-22/houston-covid-vaccine-fired", "https://www.reuters.com/world/us/new-york-city-mandates-covid-19-vaccine-public-school-teachers-staff-mayor-2021-08-23/", "https://newsinhealth.nih.gov/2021/04/antibodies-protect-against-covid-19-reinfection", "https://www.huffpost.com/entry/doctor-refuses-unvaccinated-patients_n_611ed57ce4b0e5b5d8e7f503?ncid=engmodushpmg00000004", "https://www.msn.com/en-us/news/politics/biden-asks-businesses-to-mandate-vaccine-after-pfizer-shot-gets-fda-approval/ar-AANEgo7?ocid=uxbndlbing"], "authors": [], "publish_date": "2021-08-31T17:24+00:00"}