{"result_id": "096043", "URL": "https://www.discovery.org/p/meyer/", "timestamp": "2023-04-25 14:59:25 CEST+0200", "meta": {"description": "Dr. Stephen C. Meyer received his Ph.D. from the University of Cambridge in the philosophy of science. A former geophysicist and college professor…", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/2020/09/cropped-di-tile-white-32x32.png", "canonical": "https://www.discovery.org/p/meyer/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Stephen C. Meyer", "cleaned_text": "Stephen C. Meyer received his Ph.D. in the philosophy of science from the University of Cambridge. A former geophysicist and college professor, he now directs Discovery Institute’s Center for Science and Culture in Seattle. He has authored the best seller Darwin’s Doubt: The Explosive Origin of Animal Life and the Case for Intelligent Design (HarperOne, 2013), Signature in the Cell: DNA and the Evidence for Intelligent Design (HarperOne, 2009), which was named a Book of the Year by the (of London) in 2009, and now, (HarperOne, 2021).\n\nIn his first book on intelligent design, Signature in the Cell: DNA and the Evidence for Intelligent Design (HarperOne, 2009) Meyer examined the mystery of the origin of the first life. With , he has expanded the scope of the case for intelligent design to the whole sweep of life’s history. Meyer’s research addresses the deepest mystery surrounding the origin of life and the origin of animal life: the origin of biological information necessary to produce it.\n\nMeyer graduated from Whitworth College in Spokane, Washington, in 1981 with a degree in physics and earth science. He later became a geophysicist with Atlantic Richfield Company (ARCO) in Dallas, Texas. From 1981 to 1985, he worked for ARCO in digital signal processing and seismic survey interpretation. In 1986 as a Rotary International Scholar, he began his training in the history and philosophy of science at Cambridge University, earning an M.Phil. in 1987 and a Ph.D. in 1991. His doctoral thesis was titled “Of Clues and Causes: A Methodological Interpretation of Origin-of-Life Research.”\n\nHe returned to Whitworth in the fall of 1990 to teach philosophy and the philosophy of science. He left a tenured position as a professor at Whitworth in 2002 to direct the Center for Science and Culture full time, which he had helped found with John West in 1996.\n\nPrior to the publication of and , the writing for which Meyer was best known was an August 2004 review essay in the Smithsonian Institution-affiliated peer-reviewed biology journal Proceedings of the Biological Society of Washington . The article laid out the evidential case for intelligent design, presenting it as the best explanation for the origin of the biological information necessary to produce the new forms of animal life that arose abruptly during the Cambrian explosion.\n\nBecause the article was the first peer-reviewed publication arguing for intelligent design in a technical journal, it proved extremely controversial. The journal’s editor, evolutionary biologist Richard Sternberg, was punished by his Smithsonian supervisors for allowing Meyer’s article into print. This led to the investigation of top Smithsonian personnel by the U.S. Office of Special Counsel. The controversy was widely covered in the media with articles or news stories appearing about it in , , , NPR, and the . The federal investigation eventually concluded that Sternberg had been wrongly disciplined and intimidated.\n\nMeyer’s many other publications include contributions to, and the editing of, the peer-reviewed volume (Michigan State University Press, 2004) and the innovative textbook (Hill House Publishers, 2007).\n\nMeyer has also published editorials in national newspapers such as , , , (of London) and . He has appeared on national television and radio programs such as , , , , , (CNN), and the on PBS. He has also been featured in two front-page stories and has garnered attention in other top national media.\n\nIn 2008, he appeared with Ben Stein in the theatrical-released documentary . He has also been featured prominently in the science documentaries Icons of Evolution, The Case for a Creator, and , the latter which was shown on PBS and which Meyer co-wrote with producer Lad Allen.", "opengraph": {"image": "https://www.discovery.org/m/2021/03/cropped-DI-2021-sunrise-moon-slide-scaled-1.jpg", "image:width": "2560", "image:height": "1345", "locale": "en_US", "type": "profile", "title": "Stephen C. Meyer", "description": "Dr. Stephen C. Meyer received his Ph.D. from the University of Cambridge in the philosophy of science. A former geophysicist and college professor, he now directs the Center for Science and Culture at…", "url": "https://www.discovery.org/p/meyer/", "site_name": "Discovery Institute"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.discovery.org/id/", "http://www.darwinsdoubt.com/", "http://www.signatureinthecell.com/", "https://returnofthegodhypothesis.com", "http://www.intelligentdesign.org/", "http://iconsofevolution.org/", "http://www.thecaseforacreator.com/", "http://www.darwinsdilemma.org/", "http://www.unlockingthemysteryoflife.com/"], "authors": [], "publish_date": null}