{"result_id": "096029", "URL": "https://www.discovery.org/a/vaccine-mandates-are-an-exploding-cigar/", "timestamp": "2023-04-25 14:59:12 CEST+0200", "meta": {"description": "In short, treat us like free Americans. Not only will that promote comity, but I believe it would also make skeptics more likely to accept the shot.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://humanize.today/2021/11/vaccine-mandates-are-an-exploding-cigar/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Vaccine Mandates are an Exploding Cigar", "cleaned_text": "The exploding cigar, often seen in cartoons, is the perfect metaphor for vaccine mandates. You remember the gag. A fat cat is offered a big stogie. After a few puffs the cigar explodes spreading soot all over the hapless victim’s face.\n\nPresident Biden lit a national cigar with his plan to order larger employers and those that do business with the government to force their workers to receive the jab. This is the wrong approach.\n\nUnlike Australians—who mostly accepted the far more draconian controls—we are generally not a sheep-like people. We believe in doing the right thing but resent being herded.\n\nSo, while the threat of job loss certainly has induced some of the “vaccine hesitant” to acquiesce, it seems to me that the mandates are in acute danger of exploding in our face.\n\nFor example, the Air Force is set to lose 12,000 trained and ready personnel who have refused the jab. The Navy, Army, and Marine mandates don’t become effective until later in the year, but if the Air Force is any guide, we can expect tens of thousands of other soldiers to face such discipline.\n\nI understand that members of the military are in a different liberty category than civilians. But fewer than 100 Army soldiers have died from COVID and a large percentage of those were reservists. Are the jabs really worth losing trained military members and the potential cost in readiness at a time when China is a growing military threat and the vast majority of military members have already been vaccinated?\n\nNow, consider Southwest Airlines. It canceled more than 1000 weekend flights recently, harming the airline’s reputation for reliability. Southwest denied that its vaccine mandate caused the dislocation. But it may not be a coincidence that Southwest just dropped its plan to put all unvaccinated personnel on unpaid leave.\n\nThe same thing may be happening to American Airlines. Last weekend the carrier canceled thousands of flights. Is there a connection? AA says not. But isn’t it interesting that airline travel hit such significant turbulence at the same time vaccine mandates were about to bite?\n\nThen, there is the supply chain crisis. The last thing we need are vaccine mandates that will further tighten the already squeezed labor pool needed to remedy the problem—particularly of truck drivers, of which there are already some 80,000 fewer than needed to move goods from our logjammed ports.\n\nThat is why big business and labor union lobbyists, are pressing the administration to delay mandates until after Christmas. Especially worrying: The National Trucking Association has warned that “37 percent of drivers” are expected to refuse the jab, either “through retirements, resignations and workers switching to smaller companies not covered” by the Biden mandate.\n\nIt’s not just the private sector. New York City Mayor Bill DeBlasio chirpily announced his own mandate for city employees not too long ago. It has not gone well. The New York Post just reported, “The FDNY shuttered 26 fire companies citywide on Saturday due to staff shortages caused by the COVID-19 vaccination mandate, according to furious elected officials, who ripped the move as ‘unconscionable’—and warned it could have catastrophic consequences.”\n\nMeanwhile, jab-resistant cops are still working while city bureaucrats review requests for medical and religious exemptions. But if thousands of police officers decide to bail rather than jab, New York’s crimewave will only get worse. Then there are the thousands of sanitary workers who face layoffs because they have not yielded—meaning the Big Apple could soon be known as the Big Stinky.\n\nHealthcare is also suffering from mandate-itis. Thousands of healthcare workers have been laid off, forcing some hospitals to restrict service. We should also take note that hospitals, once in the vanguard of the mandate movement, have recently balked with only 42 percent now having imposed vaccination requirements on employees.\n\nLet me be clear. I am not anti-vaccine. Indeed, I completed my two-shot dose last March, and based on my doctor’s recommendation, plan to soon receive a third shot.\n\nBut in free societies, mandates must be reasonable—and a national diktat fails that test.\n• A national mandate is unprecedented. Even during the smallpox and polio epidemics, the federal government did not impose vaccine requirements on the entire population.\n• Biden is empowering a corporatocracy: The federal government attempting to harness the private sector to enforce its policy prescriptions on individuals. That’s the last thing liberty needs.\n• People who recovered from COVID have natural resistance. That being so, it is unreasonable to require those with antibodies to involuntarily inject substances into their bodies.\n• Testing can be an effective safeguard. If we had ready access to easy testing, the heat over vaccines could decrease because infected people could quarantine, people with comorbidities could be sure that everyone who came into their home tested negative, and new infections would be prevented. But there currently is a shortage of ready testing. So, how about an Operation Warp Speed to manufacture COVID tests instead?\n• Vaccine efficacy declines over time: That is why the CDC urged all the vaccinated to get another dose. Are we going to keep roiling the country with mandate after mandate if the vaccines provide an ever-declining benefit?\n• Vaccinated people can spread the disease. We now know that the vaccinated become infected and spread the disease. That materially weakens a major argument in favor of mandates.\n• People who choose to go unprotected are primarily risking themselves. Vaccines reduce—but do not eliminate—the chances for experiencing serious illness or death. Allowing the unvaccinated to face that increased risk knowingly is more reasonable than violating their personal autonomy by forcing them to get jabbed.\n• Vaccines Aren’t Risk-Free: The risk posed by the vaccine is not nonexistent. For example, a small number of young people have experienced myocarditis and pericarditis, potentially serious conditions that cause chest pain, shortness of breath, heartbeat fluttering, and so on, after taking the vaccine.\n• In a Free Society, Moral Objections Matter: Millions of us have moral objections to the vaccine. Should our government compel dissenters to be inoculated? No! That’s not the American way.\n\nWhat would an alternative policy look like? Urge people to take the vaccine and continue to explain why it’s a good idea without exhibiting a derisive attitude or using divisive spokespeople like Anthony Fauci. Welcome reasonable dissenting opinions so that people know they have had a chance to hear fully from all sides. Be honest about what we don’t know and when scientific understandings shift—as they always do—be candid about what changed and why.\n\nIn short, treat us like free Americans. Not only will that promote comity, but I believe it would also make skeptics more likely to accept the shot. And here’s a big bonus: No national exploding cigar.", "opengraph": {"image": "https://humanize.today/wp-content/uploads/sites/5/2021/04/vaccination-passport-on-a-mobile-phone-allowing-movement-and-travel-vaccination-against-the-coronavirus-covid-19-imunity-passport-health-passport-stockpack-adobe-stock-scaled-1.jpg", "image:width": "2560", "image:height": "1728", "image:alt": "Vaccination passport on a mobile phone allowing movement and travel - Vaccination against the coronavirus Covid 19 - Imunity passport - Health passport", "locale": "en_US", "type": "article", "title": "Vaccine Mandates are an Exploding Cigar", "description": "In short, treat us like free Americans. Not only will that promote comity, but I believe it would also make skeptics more likely to accept the shot. And here’s a big bonus: No national exploding cigar.", "url": "https://humanize.today/2021/11/vaccine-mandates-are-an-exploding-cigar/", "site_name": "Humanize", "updated_time": "2021-11-01T23:47+00:00", "article:published_time": "2021-11-01T23:47+00:00", "article:modified_time": "2021-11-01T23:47+00:00"}, "tags": ["vaccine mandates", "COVID-19", "Vaccine Passports", "medical conscience"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-vaccine-mandates", "https://www.theepochtimes.com/Air%20Force%20is%20first%20military%20branch%20to%20face%20rejection%20of%20vaccine%20mandate%20as%20thousands%20avoid%20shots%20%7C%20The%20Seattle%20Times", "https://www.theepochtimes.com/Southwest%20drops%20plan%20to%20put%20unvaccinated%20staff%20on%20unpaid%20leave%20(cnbc.com)", "https://www.theepochtimes.com/Businesses%20ask%20White%20House%20to%20delay%20Biden%20Covid%20vaccine%20mandate%20until%20after%20holidays%20(cnbc.com)", "https://www.theepochtimes.com/FDNY%20firehouses%20shuttered%20over%20vaccine%20staffing%20shortages%20(nypost.com)", "https://www.theepochtimes.com/NYC%20Vaccine%20Mandate:%20Officials%20Say%20Sanitation%20Contingencies%20In%20Place,%20NYPD%20And%20FDNY%20Trying%20To%20Fill%20Gaps%20%E2%80%93%20CBS%20New%20York%20(cbslocal.com)", "https://news.bloomberglaw.com/health-law-and-business/hospitals-put-off-jab-requirement-for-staff-as-rule-draws-near", "https://www.theepochtimes.com/Antibodies%20Protect%20Against%20COVID-19%20Reinfection%20%7C%20NIH%20News%20in%20Health"], "authors": [], "publish_date": "2021-11-01T23:47+00:00"}