{"result_id": "096038", "URL": "https://www.discovery.org/a/639/", "timestamp": "2023-04-25 14:59:21 CEST+0200", "meta": {"description": "Should all children, even those with fragile and undeveloped immune systems, be subjected to multiple vaccine cocktails required in most states?", "lang": "en", "keywords": "", "favicon": "https://www.discovery.org/m/2020/09/cropped-di-tile-white-32x32.png", "canonical": "https://www.discovery.org/a/639/", "encoding": "UTF-8"}, "image": null, "domain": "www.discovery.org", "title": "Shots in the Dark?", "cleaned_text": "Should all children, even those with fragile and undeveloped immune systems, be subjected to multiple vaccine cocktails required in most states?\n\nAccording to the government and pharmaceutical companies the answer is an unqualified yes. Most states have some mandated vaccines for children, from hepatitis B to chickenpox, among other diseases. And the mainstream media has become the most vocal cheerleader for these government-mandated vaccines.\n\nA growing number of physicians and informed parents are concerned that they aren’t getting the complete story about the pros and cons of these vaccines. In fact, parents may be putting their children at great risk if they follow government vaccine mandates without taking into consideration the individual medical needs of their children.\n\nBut many public health officials and politicians are distorting these legitimate concerns. In their eyes, anyone who questions vaccine mandates is a knuckle-dragging Neanderthal putting every child at risk. Just this week, the Houston Chronicle ran an opinion piece criticizing a national physician group that recently voted to oppose mandatory vaccines without parental consent. The article accused the group of having a hidden agenda, while completely ignoring the motives of the drug companies who make billions on the vaccines.\n\nTake the case of the hepatitis B vaccine. According to the government’s own statistics, children under the age of 14 are at least three times more likely to suffer adverse effects — including death — following the hepatitis B vaccine than to catch the disease itself. Children are in an extremely low-risk group for this disease, which is usually transmitted between multiple sex partners, drug abusers or adults who work in health-care professions. In recent months, parents in Utica, N.Y., were threatened by Child Protective Services with possible loss of custody if their children did not get the hepatitis B vaccine.\n\nSo why require hepatitis B shots for young children as a condition for attending public schools? And why give it to newborn infants?\n\nAnswer: Public health officials took a “get ’em when we’ve got ’em” attitude rather than recommending the vaccine for those at significant risk. In contrast, vaccination for yellow fever and prophylaxis for malaria are recommended when people are at risk for these diseases — for example, when people plan to travel where these diseases occur and are active. Pre-treatment is not recommended when the risk is much less. The same principle should apply to hepatitis B and other immunizations, with patient and doctor balancing the severity and likelihood of the disease risk against the severity and likelihood of vaccine complications.\n\nA number of public health officials have admitted that vaccines for illnesses such as chickenpox are required because government officials calculated that the cost and inconvenience of parents’ lost time from work taking care of children was greater than the costs of chickenpox vaccination. Why should children whose parents are concerned about the exposure to adverse effects be subject to mandated vaccines just because a government bureaucrat has crunched a cost-benefit ratio between the dollars and health risk?\n\nInstead of government officials, shouldn’t parents decide if chickenpox vaccination is worth it — or not — to them and their children?\n\nThe public health argument, for the greater good, goes that if some children are vaccinated against chickenpox, other children are partially protected because the likelihood of the spread of chickenpox is decreased. This is called “herd immunity,” in that all members of the group, e.g., children, are protected to some degree, even if only some of the group are vaccinated. On the other hand, if exposed to the infectious agent, the non-vaccinated children are more likely to suffer the infection.\n\nBut in America we value the rights of the individual above those of the herd. Some people are more comfortable having as many vaccinations as possible because of the unpredictability and severity of the possible disease. Others people are more comfortable having as few vaccinations as possible because of the possible complications, as well as religious objections.\n\nVaccines can and do save lives. But we are concerned that vaccine mandates pressure — or even force — physicians to violate their responsibility to keep the patient’s benefit uppermost. If the government mandates a vaccine, some physicians will give the vaccine routinely and consider parents’ concerns and questions impertinent; these physicians may feel that the government mandate overrules their desire to individualize treatment. As a result, vaccine mandates put a significant number of children at unnecessary risk in addition to violating the patient-physician relationship.\n\nWe’ll say it one more time to make sure everyone understands. Opposing vaccine mandates is not a stand against vaccines. Both of our children received “all of their shots.” But that was the 1970s — this is now! Then there were about six vaccines; now there are 22 or more! Physicians and parents who sincerely question the efficacy of vaccine mandates should not be castigated for their legitimate concerns. We believe that parents, with the advice of their doctors, should make decisions about their children’s medical care — not government agencies.\n\nWe think the safety of every child and patient’s civil rights should be the first considerations.\n\nMichael Arnold Glueck, M.D., of Newport Beach, Calif., writes extensively on medical, legal, disability and mental health reform. Robert J. Cihak, M.D., of Aberdeen, Wash., is president of the Association of American Physicians and Surgeons. Both doctors are Harvard trained diagnostic radiologists. Collaborating as The Medicine Men, they write a weekly column for WorldNetDaily as well as numerous articles and editorials for newspapers, newsletters, magazines and journals nationally and internationally.", "opengraph": {"image": "https://www.discovery.org/m/2021/03/cropped-DI-2021-sunrise-moon-slide-scaled-1.jpg", "image:width": "2560", "image:height": "1345", "locale": "en_US", "type": "article", "title": "Shots in the Dark?", "description": "Should all children, even those with fragile and undeveloped immune systems, be subjected to multiple vaccine cocktails required in most states? According to the government and pharmaceutical…", "url": "https://www.discovery.org/a/639/", "site_name": "Discovery Institute", "updated_time": "2022-07-21T21:29+00:00", "article:publisher": "https://www.facebook.com/thediscoveryinstitute", "article:published_time": "2001-01-26T07:00+00:00", "article:modified_time": "2022-07-21T21:29+00:00"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2001-01-26T07:00+00:00"}