{"result_id": "099035", "URL": "https://doctors4covidethics.org/covid-19-mrna-vaccines-contain-excessive-quantities-of-bacterial-dna-evidence-and-implications/", "timestamp": "2023-04-25 14:59:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/covid-19-mrna-vaccines-contain-excessive-quantities-of-bacterial-dna-evidence-and-implications/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "COVID-19 mRNA vaccines contain excessive quantities of bacterial DNA: evidence and implications", "cleaned_text": "Recent studies by Kevin McKernan, a leading expert in sequencing methods for DNA and RNA, have revealed that batches of the modified mRNA vaccines produced by both Pfizer and Moderna contain a high proportion of contaminating bacterial DNA. In all, the DNA accounts for up to 20-35% of the nucleic acids contained in each of the vaccine batches. These alarmingly high concentrations far exceed the levels deemed safe by standard-setting organizations such as the European Medicines Agency (EMA). This document summarizes the evidence of that DNA contamination and discusses what possible health risks it implies to the recipients of the vaccines.\n\n1. The role of DNA in the manufacture of mRNA vaccines\n\nMost readers will be aware that\n• the synthetic RNAs contained in the COVID-19 mRNA vaccines encode the SARS-CoV-2 spike protein;\n• in living mammalian cells, the instructions for building a given protein molecule are stored as a gene within the DNA inside the nucleus;\n• to build a given protein molecule, the cell first transcribes its gene into RNA and modifies the two ends of this molecule to form messenger RNA (mRNA). The mRNA is then transported from the nucleus to the cytoplasm, where it induces the cell’s protein factories—the ribosomes—to translate the mRNA’s nucleotide sequence into the corresponding amino acid sequence and assemble the protein.\n\n1.2. Steps in the manufacture of mRNA vaccines\n\nSince the spike protein is a large molecule, so is the mRNA which encodes it. The total chemical synthesis of large mRNA molecules is not practical at scale. Therefore, in order to obtain the mRNA molecule encoding spike, the process by which cells produce their own mRNAs is mimicked in vitro. This involves the following steps:\n• A DNA copy of the gene for the spike protein is inserted into a bacterial plasmid. This is a ring-shaped, double-stranded DNA molecule which can exist in a bacterial cell independently of the cell’s own chromosomal DNA, and which can also be copied and passed on to both daughter cells when that cell divides.\n• The recombinant (artificial) plasmid carrying the spike protein gene is introduced into a cell of the bacterial species Escherichia coli (E. coli ). Since E. coli cells divide very rapidly, this one cell can within a short time be grown up to a very large number of cells. Each of these progeny cells will contain their own inherited copies of the plasmid, and therefore of the spike protein gene.While there is a certain chance of the plasmid being lost from some of the offspring during successive cell divisions, we can enforce its maintenance by giving it a selectable marker, which ensures that only those cells which retain the plasmid will survive. With the plasmids used by both Pfizer and Moderna, this selection marker is a gene which endows the host cells with resistance to the antibiotic kanamycin. To apply the selection, the bacteria are simply grown in the presence of kanamycin.\n• After growing up a sufficient number of bacterial cells in a nutrient broth containing kanamycin, these cells are broken up and the plasmid DNA is purified from the other bacterial cell components.\n• The ring-shaped plasmid molecules are converted to linear form using a restriction enzyme, which cleaves both strands of the DNA molecule at a specific, unique site which is located downstream of the spike protein gene. This step is needed to prevent the formation of RNA molecules that are overly long and might have undesired effects in vivo.The linearized DNA molecules can be purified from remaining circular ones, but in what manner and how efficiently this may be done in the production of Pfizer’s and Moderna’s vaccines is not public knowledge.\n• An RNA polymerase is used, in the presence of the necessary nucleoside building blocks and cofactors, to copy the spike protein gene from the DNA version on the linearized plasmid into the mRNA version. Both Pfizer and Moderna employ the T7 RNA polymerase, which is derived from the eponymous bacteriophage. This enzyme binds to a cognate promoter sequence likewise derived from T7 that has been engineered into the plasmid upstream of the gene for the spike protein. This interaction between polymerase and promoter initiates the transcription.At this stage, the synthetic nucleoside N-methyl-pseudouridine (mψU) is incorporated into the artificial RNA instead of the natural uridine nucleoside. When delivered in the form of a vaccine, RNA modified in this manner is less stimulatory to the innate immune system than is RNA containing the natural uridine. It is also more efficiently translated into protein, and under certain conditions more resistant to degradation . Both Pfizer’s and Moderna’s mRNA vaccines contain mψU instead of uridine.\n• The two ends of each RNA molecule are coupled enzymatically to certain moieties that are also found at these positions within natural mammalian mRNAs, and which enhance its biological activity and stability in vivo.\n\nThis steps provide a functional mRNA which is capable of instructing the cells’ ribosomes to produce the spike protein. However, at this stage the product is not yet pure—all of the bacterially derived template DNA is still present. The latter should not be included in the final drug product, because it poses health risks to the recipients (see Section 4). To get rid of this DNA, another enzyme called DNase is added. This should break up the DNA into smaller fragments, which can then be removed from the much larger RNA molecules by filtration and other purification techniques. In the final step, the mRNA is combined with a lipid mixture in order to package it into lipid nanoparticles (LNPs), which induce human cells to take up the mRNA molecule and to make the spike protein.\n\n2. What did we know previously about the DNA contamination problem?\n\nIn a nutshell, very little. The FDA’s assessment reports on both vaccines [2,3] do not mention the issue at all. The European Medicines Agency (EMA) assessment report on the Pfizer vaccine mentions that “The robustness of the DNase digestion step is not considered comprehensively demonstrated” [4, p. 17]. Similar language is used in the EMA report on the Moderna vaccine [5, p. 19f]. However, based on this sparse information alone, it is impossible to say whether the problem was considered serious, and what remedies were required by the regulator, if any.\n\nAs of April 3, 2023, Kevin McKernan has described his recent findings in three articles on his Substack site [6–8]. The experiments described in the first two reports were carried out on samples of newly introduced “bivalent” vaccines from Pfizer and Moderna. These preparations resemble the previous “monovalent” ones in their chemical composition, i.e. they should contain highly pure mRNA, complexed with a mixture of lipid (fat-like) molecules into mRNA /lipid nanoparticles. The only difference between the two varieties is that the bivalent vaccines contain a mixture of two mRNAs encoding two antigenic variants of the spike protein. This has no bearing on the technical problem of DNA contamination as such. We note, however, that the extent of DNA contamination may vary between production batches, and that only a small number of batches has so far been characterized in this regard.\n\nIn an initial study [6], McKernan characterized both the RNA and the DNA contained in the mRNA vaccines.\n\n3.1.1. Extraction and direct characterization of nucleic acids from the vaccines\n\nThe first step consisted in stripping away the lipids in order to obtain the pure nucleic acids. The solvent-based method that he used does not discriminate between DNA and RNA—if both are present, both will be recovered. The extracted nucleic acids were separated according to size. This revealed not only the expected regular, full-length spike mRNA species, but also smaller fragments, which had been noted previously both by the regulators and in work published by one of the manufacturers [9]. More surprisingly, RNA species larger than the full-length mRNA were also found. These species remain uncharacterized.\n\nAs a preparatory step for determining the exact nucleotide sequences of the extracted nucleic acids, they were amplified by PCR methods. In the case of the RNA, PCR was preceded by reverse transcription into DNA using a dedicated enzyme (reverse transcriptase). Since this study’s primary goal was to study the RNA rather than the DNA, this amplification step was biased against DNA through the addition of actinomycin D, which under the given experimental conditions selectively inhibits DNA synthesis. Accordingly, relatively low amounts of DNA were recovered in the amplified sample. Nevertheless, in case of the Pfizer vaccine, the amount of DNA determined to be present already exceeded EMA’s arbitrarily decided limit for the maximal permissible proportion of DNA per RNA.\n\nWith both Pfizer’s and Moderna’s products, DNA sequences of complete DNA plasmids were obtained, although some ambiguity remained in the case of the Moderna plasmids. The features of the plasmid sequences will therefore be discussed in connection with McKernan’s second study, which used more and more pure DNA for sequencing and therefore provided more reliable results.\n\nThe second study [7] focused on quantifying and characterizing the DNA contamination that was qualitatively detected in the first one.\n\n3.2.1. Plasmid DNA contained in the mRNA vaccines is competent to propagate in bacterial cells\n\nIn the first experiment, it was determined whether the plasmid DNA whose presence had been inferred from the previous sequencing results is indeed biologically functional, to the extent that it can be introduced into and persist within bacterial cells. To this end, nucleic acids were again extracted from the vaccine samples. These nucleic acids were mixed with a suspension of E. coli cells that had been rendered competent for DNA uptake.\n\nAfter inducing these cells to take up the DNA and giving them some time to recover, they were spread onto Petri dishes filled with solidified growth medium containing kanamycin. As noted earlier, kanamycin will kill any E. coli cells that do not contain a resistance gene to it. Therefore, the observed growth of bacterial colonies on those Petri dishes confirmed that some cells had indeed acquired resistance to kanamycin by taking up and propagating the plasmids. This was observed with both the Pfizer and the Moderna vaccine samples.\n\nIn this context, we should note that only circular plasmid molecules, but not linearized ones, can be efficiently introduced into bacterial cells. The success of this experiment therefore suggests that some of the plasmid molecules had escaped the linearization step (step 4 in Section 1.2) and made it all the way through the production process in the circular form which exists in bacterial cells. On the other hand, since the number of bacterial colonies observed in this experiment was not high, it is likely that most of the DNA had indeed been linearized. Because the biological hazards of foreign DNA within our own body may vary depending on whether it is linear or circular, the likely presence of both forms in the vaccines is worth noting. The exact proportions of circular and linear DNA in the mixtures remain to be determined.\n\nThe second major finding of this study is the quantitation by PCR of both DNA and mRNA contained in the vaccine samples. As you may be aware, in a PCR reaction, a chosen segment of a nucleic acid sequence is reduplicated by enzymatic synthesis in several successive reaction cycles. From the number of cycles (or doublings) necessary to reach a certain threshold concentration, we can calculate how many copies of the target sequence were present at the outset.\n\nIn these experiments, the chosen experimental format was multiplex PCR, i.e. two target sequences were amplified in a single reaction mixture. One of these targets was within the spike protein gene, and it thus should be present both on the plasmid DNA molecules and on the spike mRNA molecules transcribed from them. In order to include the mRNA molecules in this amplification, PCR was again preceded by reverse transcription.\n\nThe other target sequence was within the kanamycin resistance gene, which should be present only on the plasmid DNA. By comparing the number of cycles required for each of the two targets to cross the threshold, it was determined that up to 35% of the total nucleic acid contained in the vaccines is in fact DNA. For comparison, the EMA has stipulated that DNA should not amount to more than 0.033% of the total nucleic acids.\n\nThe plasmids that had originally been contained in the vaccines and then been introduced into bacterial cells (see Section 3.2.1) were again isolated from those bacterial cultures, and their complete DNA sequences were determined. Such sequences were provided in full in McKernan’s first study [6], but he indicated that he was still working on corroborating and refining the sequencing data. Meanwhile, the functional features of the plasmid DNA found in the Pfizer vaccine samples are shown in Figure 1. They will be discussed in connection with the risk assessment.\n\nIn his thus far latest report, McKernan examined eight vials of an earlier batch of the Pfizer vaccine using the quantitative PCR method described above. The DNA content in this case was markedly lower than with the bivalent vaccine samples, but still exceeded the EMA limit by a factor of 18-70 [8].\n\nWe must assume that the recombinant DNA found in the mRNA vaccines can be introduced into the cells of our body, and that this will be aided by the lipid nanoparticles, just as is the case with the mRNA itself. This poses several different kinds of health risks.\n\nOne key argument that is regularly used in order to promote the perception of mRNA vaccine safety is that mRNA is short-lived in vivo, and that the expression of the encoded antigen will therefore be of short duration also. For example, the EMA assessment report on the Pfizer vaccine states, with respect to animal experiments on a model vaccine that were accepted en lieu of proper studies on the actual COVID-19 vaccine [4, p. 46]:\n\nAs expected with an mRNA product, the luciferase expression was transient … The signal decreased slowly during the first 72 hours and after 6 and 9 days the signals were further weakened to approximately levels of 18 and 7 times the signals obtained from animals injected with buffer control.\n\nThese findings seem to agree with two in vitro studies that compared the duration of protein expression between messenger RNA species, which were identical in sequence but contained uridine or mψU, respectively; as noted above, the latter is also present in the Pfizer and Moderna mRNA vaccines. In both studies [1,10], the mψU-modified RNA species induced significantly higher levels of protein expression, yet nevertheless this elevated expression decreased with a half-life similar to that of the unmodified RNA. None of the half-lives which can be inferred from the data in either study exceeds 4.5 days.\n\nIt is, however, clear from multiple studies on vaccinated individuals that both the spike protein itself and nucleic acids encoding it can be detected, in the bloodstream and in various organs, for weeks and even months after the injection [11–15]. This discrepancy between in vitro and in vivo studies has so far been difficult to understand. The high levels of residual plasmid DNA in the vaccines detected by McKernan now suggest a plausible explanation.\n\nFor the bacterial plasmid DNA to support prolonged expression of the spike protein, two conditions must be fulfilled:\n• the plasmid DNA must persist inside our body cells, and\n• the spike protein gene on that plasmid must be transcribed into mRNA by our own cellular RNA polymerase II.\n\nWhile we do not yet have any direct experimental data on Pfizer’s and Moderna’s spike expression plasmids, precedent suggests that indeed both of these requirements are met. Recombinant plasmids expressing coagulation factor IX have been found to persist in the liver cells of experimental animals at stable levels for up to 1.5 years [16,17], which was the entire duration of the experiment. One might object that the plasmids used in these studies were circular, whereas most of the plasmid DNA contained in the mRNA vaccines is probably in the linear form (see Section 1.2). In response, we note that, firstly, some circular plasmid DNA likely remains (see Section 3.2.1), and secondly that recombinant viral DNA has been shown to persist in linear form within animals for equally long periods of time [18], which suggests that the same can occur with plasmid DNA.\n\nIn the cited studies [16,17], the gene encoding the protein of interest (factor IX) had been under the control of a mammalian promoter, and indeed the factor IX protein was expressed at stable levels throughout. In contrast, the spike protein gene contained in Pfizer’s and Moderna’s expression plasmids is under the control of a T7 bacteriophage promoter. We cannot assume a priori that this promoter will function in the absence of its cognate T7 RNA polymerase. It has, however, been experimentally confirmed that indeed the T7 promoter also binds the cellular RNA polymerase II and causes protein expression in mammalian cells [19].\n\nIn summary, the possibility that the observed long-lasting expression of spike protein is caused by the plasmid DNA contained in the mRNA vaccines must be taken seriously. Prolonged persistence of spike protein mRNA and its expression after vaccination, detected in biopsies and autopsies, has been unambiguously linked to serious harm [14,20], which is most likely mediated by immune attack on the cells expressing this foreign antigen. The omission of the corresponding experimental studies at the stage of preclinical trials, in conjunction with the scale of this contamination, creates an altogether unacceptable safety risk.\n\nOne feature that was identified by McKernan on Pfizer’s but not on Moderna’s expression plasmids [6] is a promoter derived from the SV40 virus, which belongs to the polyoma family (see Section 4.2). This promoter is located upstream of the kanamycin resistance gene; and since it is active in mammalian cells, the protein encoded by this resistance gene will be expressed in any cell containing this DNA. Like the spike protein, this protein is a foreign antigen, and it, too, may therefore trigger an immune attack on the cells expressing it.\n\nThe SV40 promoter also includes an internal origin of replication that can potentially cause copies of the plasmid to be made inside mammalian cells [21]. This will require the presence of the viral large T antigen, a protein which directly recognizes this origin and then initiates the replication of the DNA molecule. This protein is not encoded by the plasmid, nor is it normally present in our body cells, but it might be supplied by either the SV40 virus itself or by a related polyoma virus. A minority of the human population is latently infected with SV40, and such latent infection is associated with some malignant and non-malignant diseases [22]. Should a copy of the Pfizer plasmid be taken up into a cell harboring SV40, then additional copies of it might indeed be formed.\n\nTwo related polyoma viruses that are much more widespread in the human population are the BK and the JC virus [23,24]. The JC large T antigen is apparently less effective in conjunction with the SV40 origin than is SV40’s own protein [25], but the replication of Pfizer’s plasmid in cells latently infected with JC or BK viruses can nevertheless not be ruled out. Additional copies of the plasmid generated in this manner would amplify all of the other risks discussed in this section, with the possible exception of non-specific inflammation (see Section 4.4).\n\nThe scenarios discussed so far all involve the independent episomal persistence of the plasmid DNA; it will be present near the chromosomes (within in the cell nucleus), but it will not have become an integral part of any of them. Such independent, non-replicating plasmid molecules will tend to be lost during cell division [26]. However, as we will see, in some cases a plasmid molecule may indeed be integrated into one of its host cell’s chromosomes, and it will then be inherited by all descendants of that cell.\n\nChromosomal integration is one form of “genotoxicity”, i.e. toxicity which causes genetic damage. With respect to the possibility of such effects, the EMA assessment report on the Pfizer mRNA vaccine notes succinctly [4, p. 50]:\n\nNo genotoxicity studies have been provided. This is acceptable as the components of the vaccine formulation are lipids and RNA that are not expected to have genotoxic potential.\n\nApparently, EMA’s experts were assuming that RNA in general will not affect the integrity of the host cell genome. This view is incorrect, and the first evidence to prove it so has recently celebrated its fiftieth anniversary [27]. However, the detection of copious amounts of plasmid DNA in both manufacturers’ vaccines now obviates the need to make that case. Surely even EMA’s scientists will be aware that this DNA may be integrated into the genome of human host cells. No specific sequence features are necessary for such integration to occur, and accordingly it has been observed alike with the DNA of mammalian viruses, bacteriophages, and plasmids [28]. It is worth noting that such insertions can occur in random locations of the genome, but genes which are being actively expressed by the cell are more commonly affected [29].\n\nThe stable chromosomal integration of a bacterial plasmid into the chromosomal DNA of mammalian cells was demonstrated as early as 1982 [30]. The plasmid in question shares multiple features with those used in the production of Moderna’s and Pfizer’s mRNA vaccines. The introduction of foreign or modified genes into mammalian cells using this and similar techniques has since become commonplace in experimental research and in biotechnology. The methodology is referred to as transfection, and organisms modified in this manner as transgenic. We note that stable integration can occur with both linear and circular plasmid DNA [31].\n\nIn this context, we should also consider the study previously published by Aldén et al. [32], who detected DNA copies of the spike protein gene in a human liver cell line after these cells had been exposed to the Pfizer mRNA vaccine. Based on the assumption that the vaccine contained essentially pure mRNA but not DNA, they took this observation as evidence that the synthetic mRNA had undergone reverse transcription within those cells. Their interpretation is plausible, because such reverse transcription is known to occur in principle, and it has previously been reported in cells of patients infected with the SARS-CoV-2 virus [33]. However, in light of McKernan’s discovery that Pfizer vaccine vials may contain substantial amounts of DNA, it seems equally possible that the observations by Aldén et al. indicated simply the cellular uptake of this DNA. Either way, however, their findings indicate the presence of spike-encoding DNA within those cells, which indicates a risk of genomic insertion.\n\nIn proper gene therapy, chromosomal integration is often desired since it will correct the gene defect in question in a lasting manner. To this end, special DNA vectors have been developed which have a greatly increased propensity to undergo such integration. These vectors are derived from retroviruses, whose entire survival strategy is based on genomic integration. It turns out, however, that integration, when it occurs at the wrong place within the genome, frequently induces malignant diseases, especially leukemia [34]. This is indeed so common that it has prevented the widespread adoption of gene therapy, even in diseases for which all other therapeutic options are likewise fraught with very grave risks. A good example is adenosine deaminase deficiency, a metabolic disease which wipes out the lymphocytes and thus causes severe combined immune deficiency (SCID), a condition which without treatment is always fatal during infancy. This disease is in principle a very suitable target for gene therapy, yet a bone marrow transplant from a matched and related donor remains the preferred therapeutic option, due to the grave risk of gene therapy-induced malignancies [35].\n\n4.3.2. How does genomic insertion cause malignancies?\n\nOur genome contains multiple genes which may give rise to cancer if their expression level—the rate at which mRNA and protein molecules are synthesized from them—is either too low or too high. A foreign DNA molecule may perchance insert directly into such a gene and knock it out altogether, or it may insert next to it, and a strong promoter present on that foreign DNA may cause excessive expression of the gene in question. Additionally, it has been observed that insertion events can also cause genome-wide changes in DNA methylation, which will affect the expression levels of many genes; and some of these changes may contribute to the induction of malignancy. Importantly, this effect has been seen not only with viral DNA but also with bacterial plasmids [36].\n\nWhen cells are isolated from a healthy human or animal organ and grown in cell culture, they will divide for a limited number of generations and then die. In contrast, cells derived from malignant tumors and leukemias can be propagated indefinitely. A similar change may also occur in cultured cells, which thereby become immortalized and typically also lose some features that are characteristic of their tissue of origin. This transformation can be induced e.g. by infecting the cells with the aforementioned SV40 virus. Similarly, the cells can be transformed by transfection with a SV40-derived plasmid which retains the crucial parts of the viral genome, including the gene encoding the large T-antigen. On the other hand, if the large T-antigen is missing from the plasmid, transformation does not typically occur [30]. However, some exceptions have been reported [37,38]. These cases must have arisen from the disruption or dysregulation of cellular genes involved in controlling proliferation.\n\nOocytes can be transfected in vivo at certain stages of maturation [39], and so can sperm-producing cells within the testes [40]. In the latter case, the offspring of the animals subjected to such treatment were shown to be transgenic. It can therefore not be ruled out that persons injected with mRNA vaccines that also contain DNA will subsequently give rise to transgenic children. DNA insertion into germline cells might also interfere with early intrauterine development and thereby induce miscarriages or malformations.\n\n4.3.4. How should we assess the risk of genomic insertion?\n\nIt is certainly true that bacterial plasmids have a lower propensity to insert into our chromosomal DNA than do gene therapy vectors especially designed for efficient integration. But exactly how great is the risk in case of the plasmids contained in the mRNA vaccines? The simple answer is that nobody knows. This is not because it is unknowable in principle, but because the appropriate experimental studies in animals, and subsequently in humans, were not done; or if they were, the results have been kept from the public, and apparently also from the regulators.\n\nHow would such risks be assessed in properly conducted approval procedures? The current FDA guidance on the testing and approval of gene therapies [41] recommends that, at the clinical testing stage, patients be monitored for a full 15 years after administration, with yearly exams during the initial five years. This applies to vectors with which chromosomal insertion is intended. The guidance document goes on to construct a false dichotomy between inserting and non-inserting vectors, but the dividing line between them remains fuzzy. On the one hand, the guidance suggests that\n\nGT [gene therapy] products that are based on vectors such as plasmids … do not have a propensity to integrate or reactivate following latency, generally present a lower risk of delayed adverse events,\n\nbut on the other hand, it states that\n\nchanges in the methods used to introduce plasmid DNA vectors into cells … result in higher integration frequencies (Ref. 27).\n\nThe reference cited in the latter quote is a study by Wang et al. [42], who unambiguously identified DNA insertion of plasmid DNA in vivo after intramuscular injection, which was followed by electroporation. While electroporation did increase the cellular uptake of the injected DNA relative to the injection of “naked” DNA alone, it was likely much less effective in this regard than the lipid nanoparticles contained in the mRNA vaccines would be. Accordingly, we must expect some extent of chromosomal integration of the contaminating plasmid DNA in vivo.\n\nThe human innate immune system reacts with inflammation to various bacterial macromolecules, including DNA. The large amounts of DNA present in the vaccines must be assumed to contribute to inflammation near the injection site, and potentially also elsewhere in the body.\n\nThe presence of contaminating plasmid DNA in Pfizer’s and Moderna’s mRNA vaccines entails severe health risks, in addition to those which were already known and understood. Preeminent among these risks are the prolonged expression of spike protein, which may lead to correspondingly prolonged and more destructive autoimmune-like inflammation, and the induction of malignant disease after chromosomal integration of the plasmid DNA. Furthermore, the sheer scale of the contamination proves conclusively that the manufacturers have not mastered or properly implemented the designed production processes. Each of these issues alone would be reason enough to demand the immediate withdrawal of these vaccines.\n\nWe thank Kevin McKernan and Ulrike Kämmerer for corrections and discussion.\n\nThis text is licensed under the terms of the Creative Commons Attribution 4.0 International License (CC BY 4.0). This means that you are free to copy and reuse the content, as long as the original authors are credited. If you make changes to the text, you must explicitly indicate this fact. For details, see the Creative Commons website [43].\n• N1-methylpseudouridine-incorporated mRNA outperforms pseudouridine-{}incorporated mRNA by providing enhanced protein expression and reduced immunogenicity in mammalian cell lines and mice . J. Control. Release 217:337-344\n• Deep sequencing of the Moderna and Pfizer bivalent vaccines identifies contamination of expression vectors designed for plasmid amplification in bacteria .\n• Pfizer and Moderna bivalent vaccines contain 20-35% expression vector and are transformation competent in E.coli .\n• Characterization of BNT162b2 mRNA to Evaluate Risk of Off-Target Antigen Translation . J. Pharm. Sci. DOI:10.1016/j.xphs.2023.01.007\n• Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines . J. Immunol. 207:2405-2410\n• SARS‐CoV‐2 spike RNA vaccine sequences circulate in blood up to 28 days after COVID‐19 vaccination . APMIS 131:128-132\n• Vaccine mRNA Can Be Detected in Blood at 15 Days Post-Vaccination . Biomedicines 10:1538\n• Clinical and Molecular Characterization of a Rare Case of BNT162b2 mRNA COVID-19 Vaccine-Associated Myositis . Vaccines 10\n• Immune imprinting, breadth of variant recognition and germinal center response in human SARS-CoV-2 infection and vaccination . Cell DOI:10.1016/j.cell.2022.01.018\n• Long-term and therapeutic-level hepatic gene expression of human factor IX after naked plasmid transfer in vivo . Mol. Ther. 3:947-57\n• Complete and sustained phenotypic correction of hemophilia B in mice following hepatic gene transfer of a high-expressing human factor IX plasmid . J. Thromb. Haemost. 1:103-11\n• Persistence of high-capacity adenoviral vectors as replication-defective monomeric genomes in vitro and in murine liver . Hum. Gene Ther. 20:883-96\n• [The function of T7 promoter as cis-acting elements for polymerase II in eukaryotic cell] . Yi Chuan Xue Bao 27:455-61\n• A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against Covid-19 . Vaccines 10:2022060308\n• Definition of the simian virus 40 early promoter region and demonstration of a host range bias in the enhancement effect of the simian virus 40 72-base-pair repeat . Proc. Natl. Acad. Sci. U. S. A. 80:721-5\n• Human BK and JC polyomaviruses: Molecular insights and prevalence in Asia . Virus Res. 278:197860\n• Differential replication of SV40 and polyoma DNAs in Chinese hamster ovary cells . Virus Res. 2:329-44\n• Episomal persistence of recombinant adenoviral vector genomes during the cell cycle in vivo . J. Virol. 77:7689-95\n• Beware of manipulations on the genome: epigenetic destabilization through (foreign) DNA insertions . Epigenomics 8:587-91\n• A new concept in (adenoviral) oncogenesis: integration of foreign DNA and its consequences . Biochim. Biophys. Acta 1288:F79-99\n• Transformation of mammalian cells to antibiotic resistance with a bacterial gene under control of the SV40 early region promoter . J. Mol. Appl. Genet. 1:327-41\n• Optimizing the generation of stable neuronal cell lines via pre-transfection restriction enzyme digestion of plasmid DNA . Cytotechnology 62:189-94\n• Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line . Curr. Issues Mol. Biol. 44:1115-1126\n• SARS-CoV-2 RNA reverse-transcribed and integrated into the human genome . bioRxiv DOI:10.1101/2020.12.12.422516\n• Sola dosis facit venenum. Leukemia in gene therapy trials: a question of vectors, inserts and dosage? . Leukemia 22:1849-1852\n• Inheritable epigenetic response towards foreign DNA entry by mammalian host cells: a guardian of genomic stability . Epigenetics 13:1141-1153\n• High-efficiency transformation of human endothelial cells by Apo E-mediated transfection with plasmid DNA . Biochem. Biophys. Res. Commun. 214:206-11\n• Transformation of MC3T3-E1 cells following stress and transfection with pSV2neo plasmid . Anticancer Res. 22:585-98\n• Transfection of oocytes and other types of ovarian cells in rabbits after direct injection into uterine arteries of adenoviruses and plasmid/liposomes . Gene Ther. 10:580-4\n• Transgenesis via permanent integration of genes in repopulating spermatogonial cells in vivo . Nat. Methods 5:601-3\n• Long Term Follow-Up After Administration of Human Gene Therapy Products: Guidance for Industry .\n• Detection of integration of plasmid DNA into host genomic DNA following intramuscular injection and electroporation . Gene Ther. 11:711-21", "opengraph": {"type": "article", "title": "COVID-19 mRNA vaccines contain excessive quantities of bacterial DNA: evidence and implications", "description": "Recent studies by Kevin McKernan, a leading expert in sequencing methods for DNA and RNA, have revealed that batches of the modified mRNA vaccines produced by both Pfizer and Moderna contain a high proportion of contaminating bacterial DNA. This document summarizes the evidence of that DNA contamination and discusses what possible health risks it implies to the recipients of the vaccines.", "url": "https://doctors4covidethics.org/covid-19-mrna-vaccines-contain-excessive-quantities-of-bacterial-dna-evidence-and-implications/", "site_name": "Doctors for COVID Ethics", "updated_time": "2023-04-11T17:12:35+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2023/04/pfizer-plasmid-feature.png", "image:width": "1872", "image:height": "749", "article:published_time": "2023-04-05T16:10:08+02:00", "article:modified_time": "2023-04-11T17:12:35+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org/wp-content/uploads/2023/04/dna-contamination5.pdf", "https://doctors4covidethics.org/wp-content/uploads/2023/04/dna-contamination-de2.pdf", "https://doctors4covidethics.org/wp-content/uploads/2023/04/Contaminacion-DNA_ES.pdf", "#ref1", "#sec-risk", "#ref2", "#ref3", "#ref4", "#ref5", "#ref6", "#ref8", "#ref6", "#ref9", "#ref7", "#sec-manufacture-steps", "#sec-retransformation", "#ref6", "#fig-pfizer-plasmid", "#ref8", "#ref4", "#ref1", "#ref10", "#ref11", "#ref15", "#ref16", "#ref17", "#sec-manufacture-steps", "#sec-retransformation", "#ref18", "#ref16", "#ref17", "#ref19", "#ref14", "#ref20", "#ref6", "#sec-sv40", "#ref21", "#ref22", "#ref23", "#ref24", "#ref25", "#sec-inflammation", "#ref26", "#ref4", "#ref27", "#ref28", "#ref29", "#ref30", "#ref31", "#ref32", "#ref33", "#ref34", "#ref35", "#ref36", "#ref30", "#ref37", "#ref38", "#ref39", "#ref40", "#ref41", "#ref42", "#ref43", "http://dx.doi.org/10.1016/j.jconrel.2015.08.051", "https://www.fda.gov/media/144245/download", "https://www.fda.gov/media/144452/download", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.ema.europa.eu/en/documents/assessment-report/spikevax-previously-covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://anandamide.substack.com/p/curious-kittens", "https://anandamide.substack.com/p/pfizer-and-moderna-bivalent-vaccines", "https://anandamide.substack.com/p/dna-contamination-in-8-vials-of-pfizer", "https://www.ncbi.nlm.nih.gov/pubmed/?term=36642376", "https://www.ncbi.nlm.nih.gov/pubmed/?term=29739835", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "http://dx.doi.org/10.1111/apm.13294", "http://dx.doi.org/10.3390/biomedicines10071538", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35891299", "http://dx.doi.org/10.1016/j.cell.2022.01.018", "https://www.ncbi.nlm.nih.gov/pubmed/?term=11407909", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12871546", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19364285", "https://www.ncbi.nlm.nih.gov/pubmed/?term=10979193", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.ncbi.nlm.nih.gov/pubmed/?term=6298771", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31403031", "https://www.ncbi.nlm.nih.gov/pubmed/?term=23474680", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31911182", "https://www.ncbi.nlm.nih.gov/pubmed/?term=2994312", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12805471", "https://www.ncbi.nlm.nih.gov/pubmed/?term=4316300", "https://www.ncbi.nlm.nih.gov/pubmed/?term=26997469", "https://www.ncbi.nlm.nih.gov/pubmed/?term=8876634", "https://www.ncbi.nlm.nih.gov/pubmed/?term=6286831", "https://www.ncbi.nlm.nih.gov/pubmed/?term=20424915", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35723296", "http://dx.doi.org/10.1101/2020.12.12.422516", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18769449", "https://www.ncbi.nlm.nih.gov/pubmed/?term=30458693", "https://www.ncbi.nlm.nih.gov/pubmed/?term=7669041", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12014626", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12646863", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18552853", "https://www.fda.gov/media/113768/download", "https://www.ncbi.nlm.nih.gov/pubmed/?term=14724672", "https://creativecommons.org/licenses/by/4.0/"], "authors": [], "publish_date": "2023-04-05T16:10:08+02:00"}