{"result_id": "099045", "URL": "https://doctors4covidethics.org/mrna-vaccines-against-covid-19-und-their-effects-on-the-central-nervous-system/", "timestamp": "2023-04-25 14:59:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/mrna-vaccines-against-covid-19-und-their-effects-on-the-central-nervous-system/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "mRNA vaccines against COVID-19 and their effects on the central nervous system", "cleaned_text": "PDF file is available for download:\n\nmRNA vaccines against COVID-19 and their effects on the central nervous system\n\nThis document was written to answer three questions posed to us by a lawyer who is challenging COVID-19 vaccine approvals and mandates in his home country. The answers may be of interest to the readers of this website as well.\n\n1. What evidence is currently available to show that mRNA vaccine particles cross the blood-brain barrier?\n\nThis question has not been rigorously studied in humans or animals. An overview of the limited evidence available follows.\n\nBoth Pfizer [1] and Moderna [2] have conducted animal studies with model vaccines that contained the same lipids as the respective COVID-19 vaccines, but different mRNAs. In both cases, components of these model vaccines were also found in brain tissue; Pfizer detected the lipid component, and Moderna detected the mRNA. In both cases, the concentrations in brain tissue were significantly lower than those in the blood. However, as will become clear below, these findings do not mean that these vaccines won’t harm the brain.\n\n1.2. On the mechanism of transport through the blood-brain barrier\n\nIn vivo, lipid nanoparticles of the type used in Pfizer and Moderna vaccines will acquire a “biomolecular corona”, i.e. an outer coating consisting of the body’s own proteins. With this coating, they then behave similarly to the body’s own natural fat transport particles, the lipoproteins. The cellular uptake of the lipid nanoparticles and their transport across the blood-brain barrier are mediated in particular by coating with the proteins ApoB and ApoE [3,4], which also serve the same purpose with the body’s own lipoproteins.\n\n1.3. Can the spike protein affect transport across the blood-brain barrier?\n\nWhile the lipid nanoparticles are important, one should not overlook a possible role of the mRNA contained in the vaccine. It is known that the spike protein of SARS-CoV-2 can impair the function of the blood-brain barrier [5–8]. Quite possibly, the vaccine particles may initially be taken up by cells outside the brain, which then produce and release spike protein into the bloodstream. This circulating spike protein could then act on the blood-brain barrier and facilitate the passage of further vaccine particles into brain tissue. Thus, it would have been very important to perform these animal studies with the real COVID-19 vaccines rather than with model vaccines only. This would not have been particularly difficult from a technical point of view. In all likelihood, the manufacturers either did conduct these studies but chose to keep the results in the poison cabinet, or they deliberately skipped these experiments to avoid the risk of obtaining results unfavorable to them.\n\nThe blood-brain barrier consists of two cell layers: the endothelia of the small blood vessels form the inner layer, and glia cells of the surrounding brain tissue form the outer layer. It is well known that the blood-brain barrier becomes permeable during inflammation. Until proven otherwise, it must be assumed that this also applies to inflammation of blood vessels (vasculitis) in the brain which was induced by the mRNA vaccines; that these vaccines indeed cause various forms of vasculitis is now amply documented in the literature [9–14].\n\nAgainst this background, it seems likely that the first injection of an mRNA vaccine may lead to inflammation of brain vessels, which would soften up the blood-brain barrier. The vaccine particles applied with the second injection could then pass unhindered into the brain tissue. It is therefore not sufficient to investigate the transport of mRNA vaccines across the blood-brain barrier only after a single injection, as Pfizer and Moderna did in their animal experiments; instead, the transport should have been measured after repeated injections also.\n\nThe COVID-19 vaccines are injected intramuscularly. With this form of application, one aims to apply the drug or vaccine in question into the extracellular space outside the bloodstream, so that it remains in the tissues, at least initially; from there, it may then make its way into the bloodstream only slowly or not at all. The above-cited manufacturers’ animal studies found that indeed a large proportion of intramuscularly injected model vaccines remained in muscle tissue. The risk assessments released by the various national and international regulatory agencies all assume that this will always be the case.\n\nEach medical doctor should know, however, that even with careful technique—i.e., with prior aspiration [15–17]—injection can occur accidentally into the bloodstream. In animal studies, it has been observed that myocarditis caused by mRNA vaccines is more severe after intravenous than after intramuscular injection [18]. The same must be assumed to be the case with humans and with damage to other organs, including the brain.\n\nIn summary, the available data do not suffice for a reliable quantitative estimation of the transport of mRNA vaccines across the blood-brain barrier, but they qualitatively prove nevertheless that the lipid nanoparticles enter the brain. The optimistic assessments of the regulatory authorities on this issue disregard serious risks and important confounding factors and are therefore unrealistic.\n\n2. How long can the vaccine nanoparticles remain in the brain?\n\nOne should first clarify that the nanoparticles as such probably do not last very long anywhere in the body—soon after uptake into a cell, the lipids will separate from the RNA. Only after the RNA has been released in this manner can it initiate the synthesis of the spike protein within the cell. From then on, the time span of biological activity is most likely decided by the stability of the RNA, although the lipid components can also contribute to mRNA vaccine toxicity.\n\nAs with the question of transport into the brain, the manufacturers have not provided sufficient and reliable data on the persistence of the vaccine mRNAs in brain tissue. The EMA document on Moderna again only contains data on the model vaccine, not on the actual COVID vaccine. Reportedly, at three days after the injection, the model vaccine mRNA remained detectable only in muscle tissue, lymph nodes, and spleen. Pfizer reported no direct measurements of RNA, but only data on the activity of the protein encoded by the model vaccine (luciferase). This activity decayed with a half-life of approximately one day [1]. However, no measurements were carried out on the brains of the animals.\n\nIn both cases, it remains uncertain to what extent these findings from animal experiments apply to the lifespan, within the human brain, of the mRNA which encodes the SARS-CoV-2 spike protein. However, we will see in the next section that there is reason to believe that the expression of the spike protein in the human brain, induced by vaccination, can last much longer than these animal data suggest.\n\n3. What damage can vaccine nanoparticles cause to the brain?\n\nWe should note at the outset that, when it comes to damage to the brain, the blood-brain barrier is less crucial than one might assume; the reasons will become clear in the following.\n\nIt is now clear that adverse events caused by the genetically engineered COVID vaccines (both mRNA- and adenovirus-based) begin very often with damage to the blood vessels (see Figure 1). Vascular injury then leads to the formation of blood clots; the tissues and organs which depend on these obstructed vessels for their blood supply will then be damaged or even perish. Stroke and heart attack are straightforward and practically important examples of this pathogenetic mechanism [19–21]. Another variation is hemorrhage following the rupture of vessels subject to vaccine-induced inflammation [22–24]. For these forms of injury, it suffices that the vaccine particles be taken up from the circulating blood into the cells of the blood vessel walls. These cells will then express the spike protein, a foreign antigen, and thereby incur the wrath of the immune system, which then causes the actual damage. Note, however, that in this scenario the particles need not cross any major anatomical barriers; and in particular, they need not cross the blood-brain barrier in order to damage the brain vessels and cause stroke.\n\n3.2. Inflammation of the brain and spinal cord\n\nIn addition to stroke, the mRNA vaccines have also caused many cases of encephalitis and myelitis, i.e. inflammation of the brain and spinal cord, respectively, and sometimes also of both at once (encephalomyelitis). The pathogenetic mechanisms are the same with all three diseases; for the sake of simplicity, we will use only the term ‘encephalitis’ in the following.\n\n3.2.1. Encephalitis due to an immune reaction against spike protein\n\nThis pathogenetic mechanism must be expected to operate from first principles of immunology. How might it be proven in a given case of encephalitis? The following criteria would make such a diagnosis at least highly likely:\n• occurrence within days to a few weeks of the vaccine injection;\n• detection of lymphocytes and other inflammatory cells within brain tissue;\n• detection of spike protein in the foci of inflammation.\n\nIt should be noted that criteria 2 and 3 can only be satisfied by histopathological examinations; with the brain, these are usually performed only after autopsy, since biopsies on this organ are particularly precarious.\n\nEven though this mechanism is likely of great importance, the supporting evidence so far is scant—simply because pathologists have not been looking for it. However, a first case report that fulfills all of the above criteria has just been published [25] (see Figure 2). This very meticulous study also ruled out that the detected expression of spike protein was caused by infection with the virus itself rather than by vaccination.\n\nThe patient in question had initially received a single injection of AstraZeneca’s adenovirus-based vaccine, followed by two injections of Pfizer’s mRNA vaccine. The last injection had been given three weeks before the time of death. Marked expression of the spike protein was detected in the brain capillaries and also in the glia cells of the brain tissue, very likely caused by the most recent dose of mRNA vaccine. It must therefore be assumed that the spike protein survives for at least several weeks after application of the mRNA vaccines, and it most likely is also continuously synthesized during this time. This finding echoes previous studies on various tissues other than brain and on blood [26–29]. The expression of spike protein in glia cells also shows unequivocally that either or both of the vaccines can cross the blood brain barrier.\n\nIn this pathogenetic mechanism, the connection with the vaccination is indirect: the vaccine first triggers an inflammation, which might not even have to directly affect the brain; and in the context of this inflammation an immune response is activated not only against the spike protein but also against one or more of the body’s own proteins or other biomolecules (autoantigens). The immune system may then attack these same autoantigens within initially unaffected target organs, including the brain, and trigger inflammation there as well.\n\nThe clinical symptoms, and also the autopsy findings when using routine methods, will likely be very similar as with an immune reaction to the spike. Therefore, how might one decide whether the encephalitis is triggered by the spike protein or by an autoantigen? In a true autoimmune encephalitis, one should expect the following findings:\n• autoantibodies to the autoantigens in question should be detectable in blood samples;\n• the spike protein should not be detectable in the inflammatory lesions;\n• the temporal connection to the vaccination might be less close, because autoantigens are produced in the body perpetually.\n\nJarius et al. [30] reported a case of autoantibody-positive encephalitis in a patient who had initially received two doses of AstraZeneca’s adenovirus-based vaccine, followed by one dose of Pfizer’s mRNA vaccine. In this patient, a protein expressed in the brain—myelin oligodendrocyte glycoprotein (MOG)—was the autoantigen. These authors also provided an overview of twenty other cases previously reported in the literature. In three of these cases, an mRNA vaccine had been used, whereas the remaining seventeen cases were associated with the AstraZeneca vaccine. Since none of these cases were fatal, no positive or negative histopathological evidence of spike protein expression was obtained.\n\nAsioli et al. [31] reported four cases of encephalitis in which autoantibodies against the LGI1 protein were detected. Three of these cases, all from the same city (Bologna), occurred after injection of mRNA vaccines. A particularly striking case was reported by Poli et al. [32]. This patient developed three different autoimmune diseases simultaneously—demyelinating encephalitis, myasthenia, and thyroiditis. However, no specific autoantibodies were detected that could account for the encephalitis in this case.\n\nIn several case reports of encephalitis after injection of mRNA vaccines, the diagnosis “antibody-negative autoimmune encephalitis” was made ( [33–35]. It is certainly reasonable to assume that in many such cases an unidentified autoantigen may have been causative. On the other hand, without histopathology, it will often be impossible to decide whether a given case of encephalitis was caused by an immune reaction against an unknown autoantigen or against the spike protein.\n\nNumerous cases of encephalitis, myelitis, and encephalomyelitis have been reported after the use of mRNA vaccines and also of adenovirus-based vaccines. Both autoimmune reactions and an immune reaction against the spike protein have been proven causative in specific cases. The respective proportion of each form among the total number of all clinical cases of encephalitis cannot be determined on the basis of the currently available evidence.\n\nThere are numerous case reports of central nervous system disorders following the use of mRNA vaccines against COVID-19. These disorders include stroke, cerebral hemorrhage, and encephalitis. It is not necessary for the vaccines to cross the blood-brain barrier to harm the brain; however, this must be considered possible, especially after repeated injections or accidental intravenous injection, and it is likely to aggravate the clinical course of encephalitis.\n• Apolipoprotein-mediated transport of nanoparticle-bound drugs across the blood-brain barrier . Journal of drug targeting 10:317-25\n• The Biomolecular Corona of Lipid Nanoparticles for Gene Therapy . Bioconjug. Chem. 31:2046-2059\n• The SARS-CoV-2 spike protein alters barrier function in 2D static and 3D microfluidic in-vitro models of the human blood-brain barrier . Neurobiol. Dis. 146:105131\n• Penetration of the SARS-CoV-2 Spike Protein across the Blood-Brain Barrier, as Revealed by a Combination of a Human Cell Culture Model System and Optical Biosensing . Biomedicines 10 (preprint)\n• The S1 protein of SARS-CoV-2 crosses the blood-brain barrier in mice . Nat. Neurosci. 24:368-378\n• Giant cell arteritis presenting with chronic cough and headache after BNT162b2 mRNA COVID-19 vaccination . QJM (preprint)\n• To aspirate or not to aspirate? Considerations for the COVID-19 vaccines . Pharmacol. Rep. (preprint)\n• Intravenous injection of COVID-19 mRNA vaccine can induce acute myopericarditis in mouse model . Clin. Infect. Dis. (preprint)\n• Myocardial Infarction, Stroke, and Pulmonary Embolism After BNT162b2 mRNA COVID-19 Vaccine in People Aged 75 Years or Older . JAMA 327:80-82\n• Intracranial Hemorrhage Due to Potential Rupture of an Arteriovenous Malformation after BNT162b2 COVID-19 mRNA Vaccination in a Young Korean Woman: Case Report . Vaccines 10 (preprint)\n• Rupture of Vertebral Artery Dissecting Aneurysm after mRNA Anti-COVID-19 Vaccination: A Report of Two Cases . NMC Case Rep. J. 9:95-100\n• A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against Covid-19 . Vaccines 10:2022060308\n• Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines . J. Immunol. 207:2405-2410\n• Clinical and Molecular Characterization of a Rare Case of BNT162b2 mRNA COVID-19 Vaccine-Associated Myositis . Vaccines 10 (preprint)\n• Immune imprinting, breadth of variant recognition and germinal center response in human SARS-CoV-2 infection and vaccination . Cell (preprint)\n• Persistent varicella zoster virus infection following mRNA COVID‐19 vaccination was associated with the presence of encoded spike protein in the lesion . J. Cutan. Immunol. Allergy (preprint)\n• MOG encephalomyelitis after vaccination against severe acute respiratory syndrome coronavirus type 2 (SARS-CoV-2): case report and comprehensive review of the literature . J. Neurol. (preprint)\n• New-onset refractory status epilepticus due to autoimmune encephalitis after vaccination against SARS-CoV-2: First case report . Front. Neurol. 13:946644", "opengraph": {"type": "article", "title": "mRNA vaccines against COVID-19 and their effects on the central nervous system", "description": "PDF file is available for download: mRNA vaccines against COVID-19 and their effects on the central nervous system Michael Palmer, MD and Sucharit Bhakdi, MD This document was written to answer three questions posed to us by a lawyer who is challenging COVID-19 vaccine approvals and mandates in his home country. The answers may be of interest to the readers of this website as well.", "url": "https://doctors4covidethics.org/mrna-vaccines-against-covid-19-und-their-effects-on-the-central-nervous-system/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-10-06T02:34:00+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/10/frontal-brain-spike-ab9d0.jpg", "image:width": "975", "image:height": "586", "article:published_time": "2022-10-02T03:40:58+02:00", "article:modified_time": "2022-10-06T02:34:00+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org/wp-content/uploads/2022/10/brain-memo-en.pdf", "#ref1", "#ref2", "#ref3", "#ref4", "#ref5", "#ref8", "#ref9", "#ref14", "#ref15", "#ref17", "#ref18", "#ref1", "#fig-endothelial-attack", "#ref19", "#ref21", "#ref22", "#ref24", "#ref25", "#fig-ihc", "#ref26", "#ref29", "#ref30", "#ref31", "#ref32", "#ref33", "#ref35", "https://archive.org/details/pfizer-confidential-translated", "https://www.ema.europa.eu/en/documents/assessment-report/spikevax-previously-covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12164380", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32786370", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33053430", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34687399", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35052867", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33328624", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35211310", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34973526", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35818985", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35790206", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35075622", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35175942", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35320581", "https://www.ncbi.nlm.nih.gov/pubmed/?term=10497490", "https://www.ncbi.nlm.nih.gov/pubmed/?term=3276426", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34406358", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34807248", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35618584", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35095058", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35334996", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34783899", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35646499", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35891299", "http://dx.doi.org/10.1016/j.cell.2022.01.018", "http://dx.doi.org/10.1002/cia2.12278", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35737110", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35751687", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35711270", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34325334", "https://www.ncbi.nlm.nih.gov/pubmed/?term=36051224", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35700455"], "authors": [], "publish_date": "2022-10-02T03:40:58+02:00"}