{"result_id": "099029", "URL": "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "timestamp": "2023-04-25 14:59:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Did Pfizer Perform Adequate Safety Testing for its Covid-19 mRNA Vaccine in Preclinical Studies? Evidence of Scientific and Regulatory Fraud", "cleaned_text": "The rushed “warp speed” development and approval of completely novel Covid-19 mRNA and DNA vaccines pushed on the people of the world has resulted until today in millions of reported injuries and thousands of deaths according to public health databases such as VAERS (US), EudraVigilance (EU), Yellow Card (UK) and others. This article reviews some of the publicly available documents on Pfizer’s non-clinical development program and points out its deficiencies, omissions and gaps, which were very obvious, yet were never questioned by the regulators or other health authorities. The cursory nature of the entire preclinical program can be summed up as “we did not find any safety signals because we did not look for them.” The omission of safety studies which are considered standard or even mandatory, and the scientific dishonesty in those studies which were performed are so obvious and glaring that they cannot be attributed to the incompetence of the manufacturers and regulators. Rather, the question of wilful negligence must be raised.\n\nThe focus of my review is the scope and adequacy of the program of non-clinical assessment for a novel gene therapy vaccine, combined with a brief discussion of the relevant regulatory frameworks. I did not dive deeply into the review of the results of specific studies. My goal is to illustrate the complete breakdown of the regular process of drug development and approval, previously known to be rigorous and ethical, as well as the shocking negligence on the part of the regulatory agencies which are supposed to keep the pharmaceutical manufacturers honest. In carrying out this review, I have made the following findings:\n• Pfizer’s program did not include a comprehensive end-to-end test of all components of the final approved product (the mRNA COVID-19 vaccine). Instead, the studies included in the document package submitted to the FDA employed several variants and analogues of the product, whose comparability to the actual COVID-19 vaccine was not demonstrated or evaluated. Thus, no comprehensive assessment of product safety can be made on the basis of these studies.\n• A key determinant of a drug’s toxicity is its distribution within the body. However, with the mRNA active ingredient of Pfizer’s COVID-19 vaccine, this crucial aspect was never studied!\n• Pfizer claimed absence of potential for “vaccine-elicited disease enhancement” based on studies of an animal species that does not get sick from SARS-CoV-2.\n• The CDC, the FDA and Pfizer all lied about “vaccine staying at the injection site”; they knew all along that distribution of the vaccine throughout the body had to be expected.\n• Pfizer used dishonest and self-serving interpretation of regulatory guidelines to justify the shortcuts it took in routine safety testing.\n• Both FDA and Pfizer knew about major toxicities associated with gene-therapy medicines in general, and they therefore cannot claim lack of anticipatory knowledge of these risks with the particular gene therapy medicine that is Pfizer’s COVID-19 vaccine. This points to intentional fraud and collusion between Pfizer and the regulators, who conspired to push this untested dangerous product on the market.\n\nOverall, therefore, both the manufacturer and the regulators behaved in a highly dishonest manner and conspired to push an entirely novel technology and product on millions of people without carrying out a single well designed safety assessment.\n\nThe pharmaceutical R&D process is heavily regulated and divided into multiple phases, with the aim of de-risking new medicines, reducing potential for harm to human subjects, and ensuring a sufficient understanding of a new drug’s risks and benefits at every step. The initial stage of this process are pre-clinical studies, in which a drug or biological product is tested on cell lines, small animals (e.g. mice and rats), and larger animals (e.g. monkeys). The aim of pre-clinical studies is to demonstrate that the new medicine has the intended mode of action, as well as to characterize safety and efficacy to a level sufficient to decide whether clinical studies are warranted. For traditional vaccines, the non-clinical phase is the only phase of development where safety and toxicity are formally assessed.\n\nThe US Food and Drug Administration (FDA) provides guidelines for different phases of development, which are described in FDA Guidance for Industry publications [1] and are coordinated globally via the International Conference on Harmonization (ICH). Separate sets of guidelines have been issued for conventional drugs (small molecules) and biological products, including vaccines. However, for more complex platforms, such as drug-device or drug-biologics combinations, more than one guideline will be applicable, depending on the composition of the finished product. Since 2013, the FDA has been publishing guidelines that pertain specifically to gene therapy platforms. The most recent FDA Guidance on early phase testing of gene therapy products was published in 2015 [2]. Relevant aspects of this guidance and FDA position on this class of drugs are discussed at the end of this paper (see Section 2.7), which will demonstrate what the FDA and manufacturers knew about the risks associated with the class prior to 2020.\n\nThe exact scope of each new medicine’s development program is negotiated in a series of meetings between the manufacturer and the FDA. In general, the more novel the new drug or biologics entity, the more stringent and extensive the required testing will be, since with novel medicines the risks are not yet well characterized, and relevant safety data from prior experience with similar products are sparse. Numerous unknown risks of potential harm to patients need to be assessed, and any risks that are identified in early tests must be thoroughly characterized in further studies, so that in the end a well-informed risk/benefit assessment can be performed.\n\nBy necessity, a drug or a biological product must be deemed dangerous until proven safe. Claiming that something is safe purely on theoretical grounds or because “all vaccines are safe” is not scientifically or ethically acceptable. In addition, it should be noted the FDA has not historically permitted the testing of different versions of a candidate product under the same investigational new drug (IND) application.\n\nA well designed non-clinical testing strategy will include characterization of the product and its components in the following general categories of research (each of which is discussed further on in this article):\n• pharmacokinetics, which concerns a drug’s uptake into, distribution within, and elimination from the body;\n• pharmacodynamics, that is, the drug’s mechanism of action, including primary and secondary (off-target) effects;\n• safety pharmacology and toxicology, including the characterization of risks for major organ classes: cardiovascular and central nervous systems, liver, kidneys, and blood, as well as other organ systems selected based on known or predicted effects of the product class or its components;\n• genotoxicity, that is, the drug’s proclivity to cause damage to genetic material (DNA);\n• reproductive toxicology, which concerns the toxicity to reproductive organs or to the developing fœtus. This must be assessed before the product can be administered to people of reproductive potential;\n• other kinds of studies designed to characterize the risk based on safety signals identified in any of the above initial studies.\n\nIt is important to note that, while global agencies such as the World Health Organization may provide technical or scientific opinions via published recommendations, in the United States the sole authority to regulate drugs/biologics development and approve new products is vested in the FDA.\n\nRecently, some of the documents used by the FDA to approve Pfizer’s mRNA-based Covid-19 vaccine have been obtained via Freedom or Information requests and lawsuits, overcoming the FDA and Pfizer’s motions to keep this information secret for 75 years. One package of these documents on preclinical trials, amounting to 466 pages, was obtained by Judicial Watch from the Department of Health & Human Services [3].\n\n2.1. Pfizer’s program did not include a comprehensive end-to-end test of all components of the final approved product\n\nThe studies included in the approval package were for a variety of versions of the product with no comparability assessments; thus, no comprehensive assessment of product safety can be made. Page 6 of the “Non-Clinical Module” contained in the FOIA documents [3] states the following (emphasis added):\n\nIt is clear from the above product description that this completely novel platform consists of new proprietary biological/genetic and chemical components within a “payload plus delivery vehicle” structure. Whenever complex products contain combinations of drugs and biologics, or biologics and novel delivery vehicles as with Pfizer’s product, the manufacturer is required to assess the safety of all components separately and also in the final assembled version which is intended for human phases of development [4].\n\nThe same page of the FOIA document further explains:\n\nThe highlighted statement above is false, at least with respect to clinical testing. Review of clinical studies released by FOIA uncovered that at least 4 different variants of active ingredient were included in the single Investigational New Drug application by Pfizer IND#19736:\n• SARS-CoV-2 Spike Protein; MP: I don’t see clinical trials on the protein itself mentioned in the package—the only place where I find the phrase “SARS-CoV-2 Spike Protein” is in literature references.\n\nEach type of mRNA can be delivered using the same lipid nanoparticles composed of ALC-0315, ALC-0159, distearoyl-phosphatidylcholine (DSPC) and cholesterol [5]. According to the Investigator’s Brochure issued by BioNTech, which was obtained by FOIA from the Australian regulator (the TGA), several versions of RNA, modRNA and saRNA were being used in multiple clinical studies in several countries as of August 2020 [6]. Furthermore, BNT162b1 rather than the b2 variant was the test article used in Pfizer’s Phase I clinical trial [7]. Likewise, it is evident from the Phase 1/2/3 clinical trial protocol and its amendments that new versions not mentioned in the above IND application were added without explanation of their composition or any new testing (e.g. a South Africa-specific variant of the vaccine was added to the protocol schedule in 2021).\n\nWhile the use of multiple versions of a product in the early stages of development is often inevitable, each chemical or biological entity is nevertheless deemed legally distinct for the purpose of product approval. Therefore, studies conducted with versions of the product that don’t conform to the exact specification of the final version may serve only as supporting information for the approval of the latter, but they should never be deemed definitive and sufficient tests for claims of safety or efficacy pertaining to the final product.\n\nIn September 2021, the FDA issued a draft guidance entitled Studying Multiple Versions of a Cellular or Gene Therapy Product in an Early-Phase Clinical Trial [8], which states that each version of product requires a separate IND application. However, a footnote in this guideline exempts “vaccines intended to prevent infectious diseases” from this requirement. No explanation is given as to why this exemption is made, and no conceivable scientific or legal basis exists for this exemption, other than that the FDA had already arbitrarily allowed this unprecedented deviation from the regulatory standard and later needed to cover their tracks. In fact, arguably this regulatory “exception” does not even apply to Pfizer’s COVID-19 “vaccine”, since the product does not prevent infection or transmission of the disease. Is intent to prevent illness alone a sufficient condition? After all, every new drug is intended to do something like preventing an illness, but only few successfully do so.\n\nPfizer states that the primary pharmacology, distribution, metabolism, safety, and immunogenicity of BNT162b2 were studied in vitro and in vivo in mice, rats and rhesus monkeys as well as in several cell-culture assay experiments. In all, 18 studies were included in the non-clinical package, of which 7 were for the V9 nucleotide sequence variant; these included one study that did not meet “good laboratory practice” (GLP) regulations [9] and therefore should not have been deemed acceptable for regulatory approval and labelling. Six of the included studies pertained to two of the four the lipid excipients, ALC-0315 and ALC-0159. The other lipids included in the Lipid Nanoparticle Platform (LNP), namely, distearoyl-phosphatidylcholine (DSPC) and cholesterol were not studied. Pfizer and regulators argued elsewhere that DSPC and cholesterol are “naturally occurring”, which in general is true. However, neither occur in nature as parts of the exact lipid nanoparticle formulation used in Pfizer’s product. In fact, some publications by Moderna refer to cholesterol analogues, which were substituted for cholesterol in order to improve penetration into the cell [10]. Pfizer’s documents do not explain what form of cholesterol is used and how it is formulated. No biocompatibility, biosimilarity or toxicity tests are provided.\n\nOf the six studies on the lipid excipients, four were for lipid formulations “comparable to LNP in BNT162b2,” and two studies did not conform with GLP. It is not explained anywhere in the document how these other formulations differed from the final formulation of the LNP included in the approved product, and how it was determined beyond Pfizer’s assertion that they were indeed comparable. Therefore, only 9 of the 18 studies in this package are directly related to the licensed product or to precisely specified components of the final product.\n\n2.2. While some limited toxicity studies were done, the complete pharmacokinetics of the active ingredient mRNA was never studied!\n\nIn the studies designed to test whether the vaccine remains near the injection site or travels throughout the body, Pfizer did not use the test article representative of the commercial vaccine, which is named BNT162b2 and contains methyl-pseudouridine-modified mRNA coding for full-length spike protein with two proline mutations (P2). Instead, Pfizer studied biodistribution by administering “mod[ified] RNA encoding luciferase formulated in LNP comparable to BNT162b2 with trace amounts of [3H]-CHE [cholesteryl hexadecyl ether] as nondiffusible label” [3, p. 10] to mice and rats—that is, a “surrogate” mRNA encoding the luciferase enzyme rather than the SARS-CoV-2 spike protein.\n\nThe results of that study are summarized in Figure 1 below. Pfizer and the FDA simply assume that the real vaccine will show the same distribution pattern, because its lipid composition is identical [3, p. 43] (emphasis added):\n\nHowever, this claim is unsupported by any data and scientifically untenable. In reality, the studies employing the presumably inert luciferase protein likely represent a “best case” scenario. Even this model vaccine travels throughout the body, and the study in question does demonstrate luciferase expression in the spleen and liver also. It may quite possibly get worse with mRNA encoding the spike—vascular leakiness induced by the expressed spike protein could very well increase penetration of vaccine nanoparticles into the tissues of additional organs, particularly also the brain [11–13].\n\nNot only is Pfizer’s claim scientifically dishonest, however—they are using an untested hypothesis instead of proof—but this statement is key to the approval of the entire fraudulent “vaccine platform”: Pfizer, with the FDA’s connivance, wants the public and the medical professionals to believe that the delivery vehicle (LNP) is the “product”, while the payload that gets delivered is irrelevant and can be substituted with arbitrary surrogates. This goes against all previously established regulatory practices in pharmaceutical R & D, the scientific method, and even common sense. It is akin to saying that a truck loaded with food and a truck loaded with explosives are the same thing!\n\nWhile there were some toxicology studies conducted, the overall program was extremely limited. These studies are summarized in Table 1 below, which is taken from Pfizer’s non-clinical document package. According to the table, there was a total of just three studies in rats, of which only 2 were GLP-compliant repeat-dose toxicity studies, and one of the two included a different version of the product (V8) which differs from BNT162b2 (V9), the candidate submitted for licensure in the “presence of optimized codons to improve antigen expression.” No data on the comparability of the different mRNA versions are available. Pfizer simply claims that the changes are for “optimization” and are “not expected” to influence safety.\n\nDespite the claim in the table footnote (a), not all three studies were conducted in compliance with good laboratory practice. The developmental and reproductive toxicity (DART) study in Wistar Han rats was not compliant with GLP (this is disclosed in the text of the document). The non-GLP Reproductive Toxicity study can only be deemed exploratory. In addition, the male rats in the study were not treated with Pfizer’s final product, and thus no impact of vaccination on fertility in males was assessed.\n\nThe results of these studies are only briefly discussed an ambiguously worded summary which can mean either that there were no deaths or abnormalities detected, or that they were detected but the investigators deemed them not related to the vaccine. There is no way to independently verify these assertions, as the full study report has not been made available. The study also confirmed that the antibodies (and therefore likely spike proteins, too) pass from the mother to the offspring—a very important detail that was never mentioned in CDC’s advertisements of this vaccine as “safe” for pregnant women.\n\nThe only toxicology study that was performed with both the correct version of the vaccine candidate and in compliance with GLP was the repeat dose toxicity study # 20GR142. The full report of this study is not made available. The manufacturer’s own description of the results indicates that the animals experienced appetite loss and weight loss, had fever, had clinical pathology and laboratory parameter changes consistent with inflammation, and not all changes were resolved by the time the study was terminated. Treated animals had enlarged spleens (1.5 times) and lymph nodes. Pathological findings in liver, spleen, bone marrow and lymph nodes were noted but not described in detail, and just waived off by the manufacturer as not significant. There is no way to independently assess these findings.\n\nSince both the manufacturer and the FDA are fighting to keep the toxicology data secret and have not fully disclosed them in this FOIA response, we can only conclude that the findings in animal studies were severe.\n\nIt would have been possible to assess the expression (and subsequent effects or lack thereof) of the spike protein in various tissues of interest. Recent histopathological studies on autopsy materials of post-vaccine deaths clearly show that the expression of spike protein with subsequent organ damage can readily be detected and studied with standard techniques, even months after the most recent injection [14]. This would have been even easier in an experimental setting.\n\n2.3. Pfizer cites studies of an animal species that does not get sick from SARS-CoV-2 to claim absence of “vaccine-elicited disease enhancement.”\n\nThe potential disease enhancement is a known risk that has been identified in numerous prior animal studies with gene therapy medicines. Pfizer and FDA were clearly aware of this risk. To “prove” that this risk does not apply to their mRNA vaccine, Pfizer referred to an immunogenicity study (VR-VTR-10671) on rhesus monkeys. Six animals received two vaccine injections 21 days apart, whereas a control group of three monkeys received no vaccine. The inoculated monkeys produced a measurable antibody response, and upon viral challenge they produced much lower levels of viral RNA in the lungs than the control group.\n\nThe document package also emphasizes repeatedly that in this very small study “there was no evidence of vaccine-elicited disease enhancement.” Crucially, however, none of the monkeys in either group got clinically ill. Pfizer states this explicitly [3, p. 15] (emphasis added):\n\nNone of the challenged animals showed clinical signs of significant illness, indicating that the 2-4 years old male rhesus challenge model is primarily an infection model for SARS-CoV-2, .\n\nIt seems that for Pfizer—as well as for the FDA, which blithely accepted this “evidence”—studies of an animal model that lacks disease in the first place are sufficient to prove the lack of enhanced disease.\n\n2.4. CDC, FDA and Pfizer lied about the “vaccine staying in the injection site.”\n\nThe model vaccine biodistribution study discussed in Section 2.2 clearly shows that the payload—whatever it happens to be, luciferase surrogate or a never-tested mRNA encoding for spike protein—is getting into the bloodstream and is being distributed all over the body (Figure 1). As is evident from the graph, there are major accumulations in adrenal glands, liver, spleen, ovaries, and other organs such as lymph nodes and bone marrow as the table below illustrates. In fact, one of the studies in rats included in the package anticipates the product reaching the bloodstream directly and includes the intravenous route of administration. This study is also based on the surrogate mRNA and not the one that encodes the spike protein.\n\nThere is reason to be concerned about the clinical implications of these findings. However, since the focus of this article is the scope of Pfizer’s non-clinical program, and not an in-depth review of these studies, I refer the readers to an excellent analysis performed by scientific experts in this field [15]. In the pre-clinical context, it must be noted that this study is incomplete: it does not fully characterize the biodistribution of the LNPs carrying their payload. The study was stopped while the concentrations in multiple organs were still increasing, and therefore it is not possible to say what the true maximum concentrations in these organs would have been. No follow-on studies elucidating the complete time course of distribution, time to maximum concentration, maximum concentrations observed, and time to clearance were performed or planned. No estimates of the therapeutic safety margins were provided.\n\nOverall, the non-clinical testing program appears woefully incomplete. This fact was clearly noted in the European Medicines Agency (EMA) summary document of the “Comirnaty” BNT162b2 vaccine. The reviewers share an explicit admission [16, p. 45] that\n\nAdditionally, on page 54, they state that\n\nAlthough the biodistribution study was not performed according to industry GLP standards, its results strongly suggest that lipid nanoparticles with mRNA which codes for the spike protein will reach the bloodstream, circulate throughout the body, and then accumulate in a variety of organs and tissues. If this results in spike protein expressed in those organs, it will both stimulate immunity and cause those same cells to be attacked by the immune system. The resulting “vaccine reactogenicity” could resemble clinical symptoms seen with autoimmune syndromes of variable severity, in some cases severe enough to cause death or permanent disability; this conclusion is indeed strongly supported by the aforementioned autopsy study [14]. With the roll-out of the vaccines globally, these exact types of adverse events have been reported in thousands in the vaccine adverse event reporting systems, yet no public health agency has yet made a connection between this pre-clinically documented mechanism and the alarming current health outcomes data.\n\nEven more elucidating is what Pfizer chose NOT to study, i.e., the entire pharmacology sections related to safety and risk characterization. Specifically, the non-clinical document package states [3]:\n\nLet’s review what safety studies Pfizer decided to omit entirely.\n\nThe aim of safety pharmacology is to characterize the pharmacokinetic/pharmacodynamic (PK/PD) aspects of a drug’s adverse effects. Pharmacodynamics aims to describe how the drug acts on the body, while pharmacokinetics examines where in the body does the drug go, how long does it stay there, and how is it eliminated.\n\nA safety pharmacology ‘core battery’ comprises studies to determine the potential undesirable effects of a drug on the central nervous, cardiovascular, and respiratory systems. It also includes supplementary tests to evaluate other organ systems (liver, kidney, blood, etc.) if there are potential risks of damage to these systems.\n\nAssessments of new drugs for pharmacological activities on targets other than the therapeutically desired one are called Secondary Pharmacodynamics. For an entirely novel class of biological compound with completely novel and undisclosed excipients,1 it is completely unacceptable to omit the evaluation of secondary pharmacodynamics of the whole product or of its novel components.\n\nDrug interactions studies are designed to assess potential harmful effects from interactions of the novel pharmaceutical product with existing medicines which a patient may be taking. For example, such simultaneous drug application will place additional burdens on major drug-metabolizing organs, particularly the liver.\n\n2.5.4. What are Genotoxicity and Carcinogenicity Studies?\n\nThese studies are designed to evaluate the risk of possible damage to the DNA and related cellular processes, and to evaluate the risk of promoting cellular damage and cancer formation. DNA/RNA-based novel technologies have obvious genotoxic potential.\n\nOne straightforward mechanism of genetic damage is the incorporation of the injected nucleic acid into the host cell genome. This is well known with viral vectors such as the adenovirus-derived ones used by the Johnson & Johnson and AstraZeneca vaccines [17], but it has recently also been demonstrated with the Pfizer mRNA vaccine in a human liver cell line [18]. The mechanism is likely the same as that previously demonstrated in case of the genomic insertion of sequences derived from the SARS-CoV-2 virus, that is, reverse transcription of the mRNA into a DNA copy by cellular retrotransposon, followed by chromosomal insertion of that DNA copy [19]. A second potential pathway to genotoxicity is the metabolic activity of the cationic lipids, which disrupt mitochondrial respiration and thereby cause the production of reactive oxygen species, which may chemically damage DNA [20–22].\n\nPfizer’s mRNA vaccine was never tested to exclude these risks—neither in animals nor in humans. The next logical question is: what rationale was used to waive this entire category of pharmacological safety testing?\n\nIt bears mention that Moderna conducted some preliminary genotoxicity studies on their own mRNA vaccine, which is very similar to Pfizer’s. These studies employed the erythrocyte micronucleus assay. A so-called micronucleus is a chromosome fragment which was produced by chromosome damage [23,24] and then left behind in the cytoplasm when the main nucleus was expelled. The test, which counts the number of red blood cells with such micronuclei, is widely used to assess genotoxicity in vivo [24]. The EMA assessment report summarizes and comments as follows [25]:\n\nIn other words, the positive genotoxicity signal was speculatively blamed on other possible causes, without actually carrying out any experimental follow-on studies to decide this crucial question. Invoking the vaccine-induced inflammation of the spleen to explain away vaccine-induced genotoxicity certainly takes the cake.\n\n2.6. Pfizer used dishonest and self-serving interpretation of regulatory guidelines to avoid routine safety testing\n\nNumerous mechanisms of injury to major organ systems had been documented for the spike protein of SARS-CoV-2 before the vaccine roll-out [11,26–28], and previous efforts to develop vaccines against the original SARS virus had failed due to antibody-dependent enhancement, which caused vaccinated animals to fare worse than the unvaccinated controls upon viral challenge [29,30]. Thus, there was abundant reason for concern regarding the safety of Pfizer’s mRNA-based vaccine, which also would deploy the spike protein as the antigen. Yet, Pfizer claimed to the FDA that safety pharmacology, secondary pharmacodynamic, genotoxicity or carcinogenicity studies were not necessary for their product, and as justification of this claim, Pfizer cited the World Health Organization’s Guidelines for Vaccine Development from 2005.\n\nPfizer’s product was only arbitrarily reclassified as a vaccine in 2020. Prior to that, it would have been categorized as a gene therapy; thus, back in 2005 when the WHO guidelines were written, it would not have been regarded as a vaccine. Furthermore, the 2005 recommendations from WHO did not anticipate the use of gene therapy platforms for vaccines. Additionally, it is the responsibility of the FDA and other regulatory bodies worldwide to regulate the authorization and licensing of medical products. WHO does not have this authority, as it is only an advisory and coordination non-governmental body.\n\n2.6.1. What Do the WHO Recommendations from 2005 Really State?\n\nThe WHO Guidelines on the non-clinical evaluation of vaccines [31] state that pharmacokinetics studies are not normally needed but should be considered on a case-by-case basis (§4.2.6), and toxicity studies should be performed whenever new excipients (and preservatives) are used, for which no toxicological data exist (§5.2). Safety pharmacology is covered in §4.2.4, which states:\n\nThe purpose of safety pharmacology is to investigate the effects of the candidate vaccine on vital functions. If data from nonclinical and/or human clinical studies suggest that the vaccine … may affect physiological functions (e.g. central nervous system, respiratory, cardiovascular and renal functions) other than those of the immune system, safety pharmacology studies should be incorporated into the toxicity assessment. Useful information on this topic can be found in the Note for Guidance on safety pharmacology studies for human pharmaceuticals.\n\nThus, it is clear that the WHO guidelines do indicate a need for safety pharmacology studies in cases such as the SARS-CoV-2 spike protein, with its many documented untoward effects.\n\n2.7. Both FDA and Pfizer knew about major toxicities associated with the gene therapy class of medicines\n\nIt is clear that both the manufacturer and the regulator understood the potential dangers of gene-based vaccines and therefore cannot claim lack of anticipatory knowledge of these risks. This points to intentional fraud and collusion between Pfizer and the regulators to push this untested dangerous product on the market.\n\nSeveral FDA Guidance documents exist for studying investigational cellular and gene therapy products, including therapeutic vaccines [2,32–35]. These guidance documents contain regulatory thinking that clearly anticipates many risks with this class of product. Specifically, the guidance document on non-clinical studies from 2013 [32] states that:\n\nThe FDA guidance document on early-phase clinical trials program of 2015 [2] is extensive and warns of severe known risks from prior experience with gene therapies:\n• migration of product to undesired organ systems, and\n• shedding of transgenic viral particles that could be transmitted to other individuals.\n\nThe guidance also states that the risks associated with the gene therapy class may be entirely novel and cannot be derived from prior history of other drug classes. In other words, this class is uniquely risky and requires an extensive and rigorous safety testing program. Because of these potentially severe toxicities, the FDA guidelines do generally advise not to carry out such studies in healthy volunteers.\n\nIt should be noted that prior to 2020, all gene therapy derived products were being developed for extremely severe, often fatal illnesses like terminal cancer and Huntington’s disease. Such medicines could not be even tested in healthy people, much less prescribed to every human on the planet as a prophylactic treatment, and much less forced on every human being regardless of consent.\n\nPfizer’s non-clinical document states that the company considered FDA’s guidelines on the development of COVID-19 vaccines [33]. It is not clear, however, that any consideration of this document in fact took place, since none of its recommendations were implemented in Pfizer’s nonclinical assessments. We also must ask why the WHO recommendations from 2005, rather than the FDA industry guidance document from 2020, was used as the basis for design of the non-clinical testing program. Specifically, the FDA guidance clearly states that:\n\nFor a COVID-19 vaccine candidate consisting of a novel product type and for which no prior nonclinical and clinical data are available, nonclinical safety studies will be required prior to proceeding to FIH clinical trials 21 CFR 312.23(a)(8).\n\nThe FDA guidance specifically expresses concern about the vaccine-associated enhanced respiratory disease and the need to characterize and exclude this risk with the novel vaccine product:\n\nData from studies in animal models administered certain vaccine constructs against other coronaviruses (SARS-CoV and MERS-CoV) have raised concerns of a theoretical risk for COVID-19 vaccine-associated enhanced respiratory disease (ERD). In these studies, animal models were administered vaccine constructs against other coronaviruses and subsequently challenged with the respective wildtype virus. These studies have shown evidence of immunopathologic lung reactions characteristic of a Th-2 type hypersensitivity similar to ERD described in infants and animals that were administered formalin-inactivated respiratory syncytial virus (RSV) vaccine and that were subsequently challenged with RSV virus due to natural exposure or in the laboratory, respectively (Refs. 4-9). Vaccine candidates should be assessed in light of these studies.\n\nGiven this known potential for antibody-dependent enhancement of disease (ADE), it is even more puzzling that Pfizer chose to disregard these guidelines, and FDA chose to let them get away with it.\n\nOne paragraph from the guidance document describing conditions under which non-clinical safety studies might be waived caught my attention:\n\nIn some cases, it may not be necessary to perform nonclinical safety studies prior to FIH clinical trials because adequate information to characterize product safety may be available from other sources. For example, if the COVID-19 vaccine candidate is made using a platform technology utilized to manufacture a licensed vaccine or other previously studied investigational vaccines and is sufficiently characterized, it may be possible to use toxicology data (e.g., data from repeat dose toxicity studies, biodistribution studies) and clinical data accrued with other products using the same platform to support FIH clinical trials for that COVID-19 vaccine candidate. Vaccine manufacturers should summarize the findings and provide a rationale if considering using these data in lieu of performing nonclinical safety studies.\n\nIt made my antennae go up. I may be jaded by the experience of government health authorities continuously lying, misrepresenting data, suppressing dissenting opinion and open scientific debate in the past few years. Be that as it may—I am questioning whether this paragraph is inserted to provide Pfizer and Moderna the future “out” of safety testing by claiming their products are derivatives of “approved safe products” while erecting a regulatory barrier to other manufacturers who would wish to design a different Covid-19 vaccine?\n\nOverall, Pfizer’s dishonest interpretation of guidelines and cherry-picking of the applicable regulations resulted in brazen disregard for all routine safety assessments. It is unacceptable for a pharmaceutical manufacturer to not study their product for potential to harm major organ systems, or to substitute the product with a surrogate or a different version, claim theoretical comparability, and then assert that there are no risks to major human organ systems. Absence of evidence of harm is not evidence of absence of harm!\n\nThe mandate of the FDA as the industry regulator requires the agency to question and check such reckless disregard for safety testing. An honest regulator would have questioned the manufacturer’s assertion that major categories of safety studies were not applicable to their product. This cannot be explained by incompetence. The FDA is staffed with qualified and experienced pharmacology and toxicology professionals. At this point, with millions of adverse event reports accumulating rapidly in every public health database, neither the FDA, NIH, CDC, Pfizer nor other manufacturers can claim ignorance of these issues. The question of fraud and wilful negligence by both the manufacturers and the regulators must be raised.\n\nMichael Palmer contributed to the content and editing of this document.\n• Considerations for the Design of Early-Phase Clinical Trials of Cellular and Gene Therapy Products: Guidance for Industry .\n• FDA records pertaining to non-clinical studies on the Pfizer COVID-19 vaccine, released pursuant to FOIA request 2021-4389 .\n• Principles of Premarket Pathways for Combination Products: Guidance for Industry and FDA Staff .\n• FDA letter to BioNTech, granting fast track designation for their BNT162b1 and BNT162b2 vaccines .\n• Studying Multiple Versions of a Cellular or Gene Therapy Product in an Early-Phase Clinical Trial .\n• Naturally-occurring cholesterol analogues in lipid nanoparticles induce polymorphic shape and enhance intracellular delivery of mRNA . Nat. Commun. 11:983\n• The SARS-CoV-2 spike protein alters barrier function in 2D static and 3D microfluidic in-vitro models of the human blood-brain barrier . Neurobiol Dis 146:105131\n• Pathophysiologic mechanisms of cerebral endotheliopathy and stroke due to Sars-CoV-2 . J. Cereb. Blood Flow Metab. 41:1179-1192\n• On COVID vaccines: why they cannot work, and irrefutable evidence of their causative role in deaths after vaccination .\n• Adenoviral Vector DNA- and SARS-CoV-2 mRNA-Based Covid-19 Vaccines: Possible Integration into the Human Genome—Are Adenoviral Genes Expressed in Vector-based Vaccines? . Virus Res. 302:198466\n• Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line . Current issues in molecular biology 44:1115-1126\n• Reverse-transcribed SARS-CoV-2 RNA can integrate into the genome of cultured human cells and can be expressed in patient-derived tissues . Proc. Natl. Acad. Sci. U. S. A. 118 (preprint)\n• In vivo toxicity of cationic micelles and liposomes . Nanomedicine 11:467-77\n• Toxicity of cationic lipids and cationic polymers in gene delivery . J. Control. Release 114:100-9\n• Cargo-Free Nanoparticles Containing Cationic Lipids Induce Reactive Oxygen Species and Cell Death in HepG2 Cells . Biol. Pharm. Bull. 39:1338-46\n• The induction of micronuclei as a measure of genotoxicity. A report of the U.S. Environmental Protection Agency Gene-Tox Program . Mutat. Res. 123:61-118\n• Micronucleus Assay: The State of Art, and Future Directions . Int. J. Mol. Sci. 21 (preprint)\n• Worse Than the Disease? Reviewing Some Possible Unintended Consequences of the mRNA Vaccines Against COVID-19 . 2:38-79\n• The spike protein of SARS-CoV–a target for vaccine and therapeutic development . Nat. Rev. Microbiol. 7:226-36\n• Immunization with SARS coronavirus vaccines leads to pulmonary immunopathology on challenge with the SARS virus . PLoS One 7:e35421\n• WHO guidelines on non-clinical evaluation of vaccines, Annex 1, TRS No 927 .\n• Development and Licensure of Vaccines to Prevent COVID-19 .\n• Studying Multiple Versions of a Cellular or Gene Therapy Product in an Early-Phase Clinical Trial .\n\nAlexandra LATYPOVA is serial entrepreneur and a founder of iCardiac Technologies, a company based on technology developed by students and faculty at the University of Rochester. It has received in excess of $7 million in venture capital funding and currently serves 6 of the top 10 pharmaceutical companies in addition to a broad range of clients across North America, Europe and Asia. Prior to iCardiac Technologies, Ms. Latypova worked at VirtualScopics, Inc., a technology spin out from the University of Rochester and Analysis Group, Inc., a Boston-based economics, financial and strategy consultancy.", "opengraph": {"type": "article", "title": "Did Pfizer Perform Adequate Safety Testing for its Covid-19 mRNA Vaccine in Preclinical Studies? Evidence of Scientific and Regulatory Fraud", "description": "This article reviews some of the publicly available documents on Pfizer’s non-clinical development program and points out its deficiencies, omissions and gaps, which were very obvious, yet were never questioned by the regulators or other health authorities.", "url": "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-08-19T19:51:39+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/06/featured_20220609_154025.png", "image:width": "750", "image:height": "305", "article:published_time": "2022-06-10T15:33:43+02:00", "article:modified_time": "2022-08-19T19:51:39+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org/wp-content/uploads/2022/06/sasha-revised2.pdf", "https://doctors4covidethics.org/wp-content/uploads/2022/06/sasha-revised2.es_.pdf", "#ref1", "#ref2", "#sec-gene-therapy", "#ref3", "#ref3", "#ref4", "#ref5", "#ref6", "#ref7", "#ref8", "#ref9", "#ref10", "#ref3", "#fig-distribution", "#ref3", "#ref11", "#ref13", "#tbl-tox-studies", "#ref14", "#ref3", "#sec-biodistribution", "#fig-distribution", "#ref15", "#ref16", "#ref14", "#ref3", "#footnotetext1", "#ref17", "#ref18", "#ref19", "#ref20", "#ref22", "#ref23", "#ref24", "#ref24", "#ref25", "#ref11", "#ref26", "#ref28", "#ref29", "#ref30", "#ref31", "#ref2", "#ref32", "#ref35", "#ref32", "#ref2", "#ref33", "https://www.fda.gov/vaccines-blood-biologics/guidance-compliance-regulatory-information-biologics", "https://www.fda.gov/media/106369/download", "https://archive.org/details/Pfizer-vaccine-nonclinical", "https://www.fda.gov/media/119958/download", "https://www.icandecide.org/wp-content/uploads/2022/03/125742_S1_M1_fast-track-designation.pdf", "https://archive.org/details/biontech-investigator-brochure", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32785213", "https://www.fda.gov/media/152536/download", "https://www.ecfr.gov/current/title-21/chapter-I/subchapter-A/part-58", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32080183", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33053430", "http://dx.doi.org/10.3389/fcvm.2021.687783", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33530831", "https://doctors4covidethics.org/on-covid-vaccines-why-they-cannot-work-and-irrefutable-evidence-of-their-causative-role-in-deaths-after-vaccination/", "https://doctors4covidethics.org/the-pfizer-mrna-vaccine-pharmacokinetics-and-toxicity/", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34087261", "https://doi.org/10.3390/cimb44030073", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33958444", "https://www.ncbi.nlm.nih.gov/pubmed/?term=25168934", "https://www.ncbi.nlm.nih.gov/pubmed/?term=16831482", "https://www.ncbi.nlm.nih.gov/pubmed/?term=27476941", "https://www.ncbi.nlm.nih.gov/pubmed/?term=6888413", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32102335", "https://www.ema.europa.eu/en/documents/assessment-report/spikevax-previously-covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://ijvtpr.com/index.php/IJVTPR/article/view/23/51", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33232769", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32908214", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19198616", "https://www.ncbi.nlm.nih.gov/pubmed/?term=22536382", "https://www.who.int/publications/m/item/nonclinical-evaluation-of-vaccines-annex-1-trs-no-927", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/preclinical-assessment-investigational-cellular-and-gene-therapy-products", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/development-and-licensure-vaccines-prevent-covid-19", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/studying-multiple-versions-cellular-or-gene-therapy-product-early-phase-clinical-trial", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/human-gene-therapy-products-incorporating-human-genome-editing"], "authors": [], "publish_date": "2022-06-10T15:33:43+02:00"}