{"result_id": "099027", "URL": "https://doctors4covidethics.org/boosting-blood-clots-and-leaky-vessels-the-dangers-of-covid-19-vaccines-and-booster-shots/", "timestamp": "2023-04-25 14:59:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/boosting-blood-clots-and-leaky-vessels-the-dangers-of-covid-19-vaccines-and-booster-shots/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "The Dangers of Booster Shots and COVID-19 ‘Vaccines’: Boosting Blood Clots and Leaky Vessels", "cleaned_text": "New discoveries in the immunology of SARS-CoV-2 and COVID-19 vaccines\n\nWhat happens inside your body after injection with gene-based COVID-19 vaccines? How does this new ‘vaccination’ technology differ from usual vaccination methods, and why is that dangerous?\n\nIn this document, we answer all those questions and more, based on the latest and best available science. We explain how several papers in 2021 significantly advanced our understanding of SARS-CoV-2 immunity, and therefore the science and safety of COVID-19 vaccines.\n\nUnfortunately, as the COVID-19 vaccination programme has followed a policy of ‘vaccinate first – research later’, our understanding of SARS-CoV-2 immunity has only recently caught up with the rushed vaccination schedule.\n\nGiven that no clinical trials involved more than two injections of any vaccine, it is important that doctors and patients understand where the latest science leaves us in terms of how the vaccines interact with the immune system, and the implications for booster shots.\n\nWe explain here that booster shots are uniquely dangerous, in a way that is unprecedented in the history of vaccines. That is because repeatedly boosting the immune response will repeatedly boost the intensity of self-to-self attack.\n\nPlease take the time to read this important information, and share.\n\nThe findings are presented in summary form for those who would like an overview, followed by an explanation of the underlying immunology for those who wish to understand in more detail.", "opengraph": {"type": "article", "title": "The Dangers of Booster Shots and COVID-19 ‘Vaccines’: Boosting Blood Clots and Leaky Vessels", "description": "Months into the vaccination campaign, and new discoveries in the immunology of SARS-CoV-2 have only just caught up with the rushed vaccination schedule. With booster shots being rolled out in many countries, it is important that doctors and patients understand how the vaccines interact with the immune system, and why 'booster shots are uniquely dangerous, in a way that is unprecedented in the history of", "url": "https://doctors4covidethics.org/boosting-blood-clots-and-leaky-vessels-the-dangers-of-covid-19-vaccines-and-booster-shots/", "site_name": "Doctors for COVID Ethics", "updated_time": "2021-11-12T11:48:18+01:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2021/09/Booster-shot-conveyor-belt.png", "image:width": "751", "image:height": "300", "article:published_time": "2021-09-17T06:45:30+02:00", "article:modified_time": "2021-11-12T11:48:18+01:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org/wp-content/uploads/2021/11/Vaccine-immune-interactions-and-booster-shots.pdf", "https://doctors4covidethics.org/wp-content/uploads/2021/11/Vaccine-immune-interactions-and-booster-shots.pdf", "https://doctors4covidethics.org/wp-content/uploads/2021/11/Vaccine-immune-interactions-and-booster-shots.pdf"], "authors": [], "publish_date": "2021-09-17T06:45:30+02:00"}