{"result_id": "099022", "URL": "https://doctors4covidethics.org/expert-report-on-the-johnson-johnson-covid-19-vaccine/", "timestamp": "2023-04-25 14:59:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/expert-report-on-the-johnson-johnson-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Expert Report on the Johnson & Johnson COVID-19 Vaccine", "cleaned_text": "This expert statement was submitted by a consortium of lawyers to the South African constitutional court in conjunction with a lawsuit that challenges the government’s COVID measures. Similar documents were published earlier by D4CE regarding the Pfizer vaccine [1] and the Moderna vaccine [2].\n\nPermission is hereby granted to freely share and distribute this document in unchanged form.\n\nThis expert opinion discusses the safety and efficacy of Johnson & Johnson’s (J & J’s) adenovirus-based Ad26.COV2.S vaccine against COVID-19 (the J & J vaccine). It refers to the open assessment report by the European Medicines Agency (EMA) on this vaccine, as well as to peer-reviewed scientific publications and several other data sources. The EMA report [3] is used as the primary reference because it is the most thorough document of its kind. A similar but shorter document was prepared by the American Food and Drug Administration (FDA) in connection with the FDA’s emergency use authorization of the J & J vaccine[4]. Most other regulators, including in particular the South African Health Products Regulatory Authority (SAHPRA), have not published any similarly detailed documents.\n\n1.1. The J & J vaccine is not a traditional vaccine but rather a form of gene therapy\n\nIn principle, the use of the word “vaccine” for the J & J vaccine is misleading and promotes unjustified expectations in the public’s mind of a protective effect with low risk. According to the scientific definition, the technique employed by this vaccine—namely, of introducing DNA into human cells—constitutes gene therapy, and the J & J vaccine is therefore a gene therapy product. This view is adopted by the FDA in its short guide “What is Gene Therapy?” [5]:\n\nThe FDA definition also explicitly references the use of viral vectors as one method for introducing the foreign DNA:\n\nThis definition by the FDA describes the J & J vaccine to a “T.” In this case, a modified adenovirus is used as a vector (vehicle) to carry the foreign, synthetic genetic material (DNA) into human cells. This foreign DNA encodes the SARS-CoV-2 spike protein, causing the cells to synthesize this protein.\n\n1.2. The gene delivery system used by the J & J vaccine causes risk of delayed, grave disease\n\nIn addition, the introduction into human cells of this foreign DNA raises the possibility of its stable, irreversible incorporation into the human genome. This, in turn, creates the potential for dangerous side effects, some of which could be confirmed or ruled out only by long-term observation. These side effects must be considered with any such gene therapy product, but in the case of this vaccine they have not even been researched in the most preliminary manner—no long-term studies of any kind are currently available.\n\nIt is therefore inappropriate to refer to the J & J vaccine as a protective vaccine in the classical style. For the sake of simplicity as well as for consistency of this expert opinion with the original report of EMA, the term “vaccine” will be used in the following. Nevertheless, the reader should keep in mind that this injectable is not a proper vaccine but a gene therapy product that may irreversibly alter human cells.\n\nAdenoviruses are non-encapsulated, icosahedral infectious particles (virions) between 80 and 100 nm in diameter. Each virion contains a single copy of the double-stranded DNA genome.\n\nThe active substance of the J & J vaccine consists of a recombinant human adenovirus type 26 that contains a synthetic gene encoding the SARS-CoV-2 spike glycoprotein. This gene has been codon-optimized in order to increase the efficiency of protein synthesis inside human cells, and it also carries several amino acid substitutions that stabilize the protein’s structure. In particular, the recognition site for the protease furin, which cleaves the spike protein into its S1 and S2 fragments within the host cell, has been abolished by replacing several crucial amino acids. Furthermore, two proline residues have been introduced into the spike protein’s hinge region; these cause the spike protein remains in the so-called\n\n “prefusion” conformation [3] (p. 43).\n\nAfter this modified virus infects a cell, each gene of the altered viral genome is transcribed to messenger-RNA (mRNA), which is then translated to the encoded protein molecule by cellular ribosomes. The translation of the SARS-CoV-2 spike protein begins with the formation of a leader sequence. This leader sequence causes the spike protein to enter the cell’s secretory pathway and ultimately become incorporated into the cell membrane and be exposed to other cells. Some of the spike protein molecules will remain on the cell, which may cause it to be attacked by the immune system (see Section 6.8.2); other spike protein molecules may undergo cleave, and the detached S1 fragments may bind to receptors on other cells, causing damage to the latter (see Section 6.8.1).\n\nIn addition to endowing it with the synthetic SARS-CoV-2 spike protein, the genome of the J & J vaccine virus has also been modified so as to ensure that the virions, while remaining able to enter human cells and initiate the synthesis of viral proteins, cannot form functional progeny virions that could infect other cells in turn. This should in principle prevent the vaccine virus from spreading in the human population.\n\nIn order to accomplish this purpose, the E1 gene, which encodes an essential part of the viral protein shell (the capsid), was deleted. The place vacated by this deletion has been filled with the gene encoding the modified SARS-CoV-2 spike protein (see Figure 1). Since the E1 protein remains necessary for generating the vaccine virus particles, the gene encoding it has been engineered into genome of the cell line (PER.C6 TetR) which is used for producing the vaccine.\n\nA further optimization concerns the expression of the SARS-CoV-2 spike protein, which is switched on in the cells of the human vaccinees but is suppressed in the producing cell line, freeing the latter from a considerable biosynthetic burden. This is achieved by placing the spike protein gene under the control of a highly effective promoter (human tetracycline-regulated long cytomegalovirus, CMV), which contains binding sites for the Tet repressor protein. The transcription of the spike protein is mostly suppressed when the Tet repressor protein is present, as it is within the PER.C6 TetR cell line. The repressor protein is absent, however, in human cells, which means that transcription will be switched on.\n\nThe recombinant viral genome contains several other minor modifications which are summarized\n\n in the EMA report [3] (p. 43).\n\nAside from the viral particles just described, the vaccine also contains the following ingredients: 2-hydroxypropyl-β -cyclodextrin (HBCD), citric acid monohydrate, ethanol, hydrochloric acid, polysorbate-80, sodium chloride, sodium hydroxide, trisodium citrate dihydrate, and water for injection.\n\nThe vaccine is administered intramuscularly (IM) in a single dose of 5× 1010 viral particles per dose of 0.5 mL. The product is available in a 2.5 mL (5 doses) multidose vial presentation in packs of 10 vials each [3] (p. 19).\n\nThere are three sites for the manufacture of the J & J vaccine (Janssen Vaccines & Prevention B.V., Leiden, NL; Janssen Biologics B.V., Leiden, NL; Emergent Manufacturing Operations Baltimore LLC, Baltimore, USA). Certificates of good manufacturing practice (GMP) compliance are available for all sites [3] (p. 21-22).\n\nThe description of the manufacturing process given in the EMA report is unclear. The text describes that the viral recombinant DNA was taken from viruses previously produced in cells. The authors describe how they disrupt these cells and then isolate the viruses from the cell lysate. However, virus particles are not isolated from cell lysates, but rather from the (liquid) growth medium. Further on in the report, however, the authors mention what substances they have added to the fermentation process in bacterial cells. These two statements contradict each other.\n\nIt is common practice to produce large amounts of recombinant viral DNA in bacteria using bioreactors. After the bacterial cells are lysed, their chromosomal DNA is degraded using nucleases, and the recombinant viral DNA (active substance) is separated from this degraded bacterial DNA and from other process-related impurities. We can assume that this was done here as well, since in the end the authors mention that the recombinant DNA is passed through 0.2µm pore filters in order to remove any remaining bacterial cells or debris before being stored at -40∘C. That such an elementary error in the documentation should have been committed or overlooked by the EMA raises grave doubts about the integrity of the review and approval process.\n\nAfter its isolation from bacteria, the viral DNA is introduced (transfected) into PER.C6 Tet cells, which then express the viral proteins from it. Some of these proteins combine with the DNA to form the finished virus particles, which are then released from the cells into the growth medium. The produced virions are finally isolated from the medium.\n\nAccording to EMA, there is no risk of contamination with extraneous infectious agents (viruses or other microbes).\n\n4.3. Validation of the assay for replication-competent adenovirus particles\n\nWhile in principle the design of the J & J vaccine recombinant virus renders the cell culture-generated virions unable to replicate in vivo, there is a possibility of recombination events in cell culture, which might mobilize the gene encoding the viral E1 protein from the cellular genome and reinsert it into the viral genome. This would result in the emergence of a replication-competent adenovirus (RCA). Such a virus could then establish an infection in the vaccinated persons and potentially also be transmitted and spread in the population.\n\nThe safety test for the absence of such replication-competent adenovirus (RCA) was only carried out for the active substance (the recombinant virions) but not for the finished pharmaceutical product. The EMA report states that “the results complied with the acceptance criteria specifications” but does not specify these criteria. The report does not state that RCA particles were absent; presumably, they were present at low abundance. Still, the presence of any RCA at all in a vaccine product raises the possibility of adenovirus propagation and exacerbation of host response.\n\nBecause it is extremely difficult to completely avoid the emergence of RCA in adenovirus vector products in the current production process, examining the level of RCA in each lot of adenovirus vector product is important. It is not clear from the EMA report that this test is applied on every production batch of the vaccine. In addition, testing for the presence of RCA in patients who have been injected adenovirus vectors should have been mandated during the clinical study. The latter was not done [3] (p. 33, 53).\n\nSince the J & J vaccine is produced with biological materials, there is a need to guard against possible contamination with adventitious pathogenic agents. The World Health Organization (WHO) defines adventitious agents as microorganisms that may have been unintentionally introduced into the manufacturing process of a biopharmaceutical product [6]. These agents can include bacteria, fungi, mycoplasma/spiroplasma, mycobacteria, rickettsia, protozoa, parasites, transmissible spongiform encephalopathy (TSE) agents (prions), and viruses.\n\nAdventitious pathogens could be inadvertently introduced into a vaccine with the starting materials used for production. While any vaccine production process will include some purification steps, with live viral vaccines such procedures must necessarily be rather gentle and cannot guarantee the comprehensive, reliable elimination of all other live microbes. Therefore, to ascertain the absence of adventitious agents, extensive testing during vaccine production is necessary, not only in vitro but also in animal models.\n\nPrior experience shows that in the manufacture of biological products this danger must be taken very seriously. In a number of cases, adventitious agents went undetected during production and made their way into a marketed vaccine product. Examples of such contaminants are the monkey virus SV40, which was found in polio vaccine; bacteriophages, which were found in measles and polio vaccines; reverse transcriptase activity, which arose from contamination by an unidentified avian retrovirus, in measles, mumps and rubella (MMR) vaccine; and finally porcine circovirus particles or DNA sequences, which were found in rotavirus vaccine [7].\n\nWith respect to the J & J vaccine, the EMA report cites numerous documents concerning the quality of raw materials and excipients, and it describes various intermediate steps of purification. It also does discuss some tests which were carried out in cell cultures [3] (p. 37). Crucially, however, the report does not contain any information on animal experiments to test for adventitious agents. We must therefore assume that no such animal tests were performed in the production of the J & J vaccine. These tests are vital in order to safeguard human health, and it is therefore unacceptable to omit the important animal tests.\n\n4.5. Stability and shelf life specification of the active substance\n\nUntil conditional approval was granted, no data produced had been provided by J & J to EMA which would demonstrate the efficacy of the current vaccine doses or acceptable immunogenicity of the commercial batches at the end of their shelf life [3] (p. 28).\n\nJ & J has evaluated representative batches of the active substance for stability during storage (real-time at -60∘Cand accelerated at 5∘C). These included clinical and small-scale manufacturing batches from the Janssen Vaccine and Prevention B.V. site (Leiden, NL) and large-scale batches from the Janssen Biologics B.V. site (Leiden, NL). A stability testing program was established with appropriate readout parameters. All batches are tested at all time points for pH, infectious units, transgene expression, viral particles, and ratio of viral particles to infectious unit.\n\nCrucially, however, at the time of approval, EMA had only 6 months worth of stability data for the active substance and 3 months worth for the small commercial batch (manufactured at the Janssen Vaccine and Prevention B.V. site) as well as for a large commercial batch (manufactured at the Janssen Biologics B.V. site). It is unacceptable that studies under both the real-time and the accelerated stability storage conditions had not been completed, and that data for all batches—especially commercial batches—had not been submitted before approval was granted. In the absence of any study results, appropriate shelf life of the product and storage condition were arbitrarily stipulated. Shelf life was estimated from long-term (below -40∘C) and accelerated (2-8∘C) stability data of other vaccines based on viral Ad26 vectors that had been produced using the same technology platform.\n\nIt is irresponsible to accept uncertainties in batch shelf life, since EMA or other regulators cannot know for how long each batch will be used. Extended storage obviously might reduce the concentration of infectious virus particles to such an extent that vaccination would result in little or no immune response.\n\nThe hold time for the finished vaccine—that is, the time period for which the vaccine can be stored and used without loss of infectiousness—is currently still being determined, since the vaccine is simply too new for observation of the complete time course of loss of activity; currently, only some early time points of the J & J vaccine stability studies on clinical batches are available. The currently used preliminary value for the shelf-life is therefore based on a statistical model and on data from similar Ad26 products, not on this specific vaccine.\n\nOnce the maximum hold time will have been experimentally validated, it must be compared to the assumed preliminary value on which the use of the vaccine in the ongoing vaccination campaign is based. The shorter the accepted hold time, the more unstable the virus is.\n\nBased on the above statistical model used to predict the time course of the decline in vaccine potency, it was tentatively agreed that the unopened vaccine vials could be stored 24 months at -25∘C to -15∘C and 3 months when refrigerated at 2∘C to 8∘C, in both cases protected from light [3] (p. 35).\n\nSensitivity of the finished product the J & J vaccine to light stress has not been determined and will need to be investigated separately using a further study post-approval. In this study, the vaccine should be tested for potency, turbidity, radius and aggregation. All cases of significant negative deviation should be immediately reported to EMA.\n\nVerification of the hold time is important to ensure consistent infectiousness of the virus particles. A decrease in infectiousness would reduce the cellular uptake of the vaccine, which in turn would cause diminished spike protein production, resulting in little or no immune response. The vaccine dose would then have no effect. At the time of approval, no verified data on the hold times were available.\n\nQuality risk management principles (ICH Q9) were used to identify critical process-related impurities. According to the EMA report, there were 81 different impurities in the active substance, only two of which were classified as critical: Host Cell DNA and Host Cell Protein [3] (p. 36). J & J has determined certain specification limits, conformance with which they verify during the manufacturing process. According to EMA, the present data show that specific purification steps resulted in efficient minimization but not elimination of impurities. The EMA deemed the achieved degree of purity sufficient.\n\nThese include empty or incomplete adenovirus particles not containing any DNA, aggregated particles, and adenovirus protein molecules as well as fragments or post-translationally modified forms thereof. Such impurities were analyzed by J & J and reported to EMA. The latter determined that the impurities were present in small amounts and consistent between batches. The stated impurities have been present in the product that was used in clinical trials.\n\nThe International Council for Harmonisation, of which the European Community is a founding member and with which SAHPRA is affiliated as an observer, has issued the ICH Q3D guideline on elemental impurities in pharmaceutical products. Both the European and South African regulators should therefore demand that J & J ensures compliance of its vaccine with this guideline. A summary of this risk assessment and a control strategy for elemental impurities in compliance with ICH Q3D should be developed. However, data on elemental impurities are being collected and analyzed only after approval. This is unacceptable.\n\nStudies were performed on several animal models [3] (p. 44-50): 1. mice [8]; 2. Syrian hamster [9,10]; 3. challenge studies in rhesus macaques [9] These studies are summarized in the following.\n• Mice 8-12 weeks of age were injected with a single dose of the J & J vaccine, which contained 108, 109 or 1010 virus particles, respectively.\n• Analysis was carried out 4 weeks after vaccination.\n• Antibodies that bound spike protein specifically were detectable, and the amount (titres) of such. antibodies correlated with the dose of vaccine administered.\n• The antibodies produced had neutralizing activity against wild-type SARS-CoV-2 virus.\n• The authors compared two doses of the J & J vaccine (108 and 1010 virus particles, respectively) and elicited T cells that produced IFN-γ. No differences were observed between the two doses.\n• A single dose of the J & J vaccine (1010 virus particles, 20% of a human dose) was used. This was compared to a single dose of purified 50µg of spike protein, used in combination with µg Adjuphos (an aluminium phosphate vaccine adjuvant).\n• Immunogenicity of the two regimens was compared two weeks after vaccination.\n• the J & J vaccine was shown to induce the T cell-associated cytokine IFN-γ , whereas the alum-adjuvanted spike protein did not.\n• The ratios of IFN-γ /IL-4, IFN-γ/IL-5, and IFN-γ/IL-10 were high with the J & J vaccine, indicating a Th1 response.\n• High IgG levels were observed only after the J & J vaccine vaccination, which the EMA report interpreted as another indication of a Th1-directed response.\n• According to EMA, immunisation with a dose corresponding to one tenth of a full human dose induced a humoral and cellular immune response.\n• Raw data were not available to EMA.\n• Syrian hamsters 10-12 weeks of age were used.\n• The immunogenicity and protection by the J & J vaccine was compared with other Ad26-based candidate SARS-CoV-2 vaccines, and with placebo (an Ad26 vector virus not containing any spike protein gene).\n• One- and two-dose schedules were compared.\n• Animals were challenged (experimentally infected with SARS-CoV-2) 4 weeks after the last vaccination and followed for 4 days after infection.\n• A single immunisation with 109 or 1010 of the J & J vaccine virus particles—2% or 20%, respectively, of a human dose—induced spike protein-binding antibodies in a dose-independent manner. Neutralising antibody titres were higher at 4 weeks after a second dose than at 4 weeks after a single dose..We note that this experimental design does not prove that a booster dose increases the antibody response. The antibody titre might have increased further with time even without a second dose of vaccine; therefore, antibody titres should have been measured and compared at the same time points after the first injection throughout in animals that did and did not receive the second dose, respectively.\n• Immunisation with the J & J vaccine reduced the viral load within the lungs after challenge with the SARS-CoV-2 virus, compared with placebo. The reduction in viral load was not, however, apparent in the upper respiratory tract, as infectious virus particles were also detected in vaccinated animals after challenge. This occurred regardless of the one- or two-dose vaccination schedule.\n• Due to a technical error, only limited histopathological data are available for the one-dose schedule, hampering any conclusion as to the potential benefits of a two-dose (raw data not available).\n• The immunogenicity and efficacy of the J & J vaccine in a single-dose regimen was determined in Syrian hamsters at different doses of 107, 108, 109 or 1010 virus particles of the J & J vaccine, with the highest dose corresponding to 20% of a human dose.\n• Placebo consisted of 1010 virus particles of an Ad26 vector not encoding any SARS-CoV-2 antigen\n• Viral load and histopathology of the lungs were evaluated after challenge.\n• A single immunisation with the J & J vaccine induced spike protein-binding and neutralising antibodies, and it reduced median lung viral load as well as lower respiratory tract histopathology scores after inoculation with SARS-CoV-2. All effects were dose-dependent.\n• A dose of 108 virus particles or below of the J & J vaccine resulted in a breakthrough SARS-CoV-2 infection upon challenge, as determined by the viral load in lung tissue. If breakthrough infection occurred, no increase of viral load was noted compared with the infection in the control group. There was no indication of increased lung pathology in the vaccinated animals even at lower doses, and no presence of eosinophils was noted in histopathological analyses, showing that the presence of low levels of neutralising antibodies elicited by sub-optimal the J & J vaccine vaccine doses do not aggravate lung disease in challenged Syrian hamsters compared to controls.\n• A single administration of 2% (109 virus particles) or 20% (1010 virus particles) of a human dose of the J & J vaccine protects Syrian hamsters against severe disease and mortality after challenge with a high dose of 5 × 105 TCID (median tissue culture infectious dose).\n• The vaccinated animals showed a minimal interstitial pneumonia, whereas the control animals displayed moderate to severe multifocal pneumonia characterised by consolidation, affecting 30 to 60% of lung parenchyma.\n• In this model an inverse correlation of the antibody response with upper respiratory tract\n\n viral load was also identified.\n• Immunisation with the J & J vaccine decreased the number of virus RNA copies, and the time period of their persistence in lung, nose, trachea, heart, gastrointestinal tract, brain, spleen, liver and kidney compared to sham-vaccinated animals.\n\nBased on the data presented in hamster immunogenicity and challenge studies, one can conclude that vaccination with one or two doses of the J & J vaccine at 109 and 1010 virus particles 4 weeks prior to challenge protects the animals from moderate to severe disease, as evidenced by reduction of viral load and histopathology in the lower respiratory tract. The extent of this protection correlates with antibody titres. In contrast, benefits of the vaccine in terms of upper respiratory tract protection are not clearly apparent, as measured by viral load (infective and viral RNA material), histopathological scores and immunohistochemistry. A correlation of upper respiratory tract protection with antibody titres is not clearly established.\n\nMany data in this section are taken from EMA’s report (pages 47-50 and 54-55) and cannot be independently verified.\n• Animals (n=4 to 6) were vaccinated IM with a single dose that amounts to twice the human dose (1011 virus particles) or with placebo (saline).\n• The challenge occurred 6 weeks later, using pseudovirus or SARS-CoV-2 strain USA-WA1/2020 (105 TCID ).\n• All of the animals remained healthy throughout the study; no differences between groups or changes in time of clinical scores, pulmonary X-ray images, laboratory parameters of inflammation, or histopathology were reported.\n• A decrease in viral load in both the upper and the lower respiratory tract was shown.\n• A single immunisation with the J & J vaccine was found to induce antibodies against the spike protein as well as neutralising antibodies against pseudovirus.\n• The T-cell response, as judged by IFN-γ production, is rather low and variable; no IL-4 response is detectable.\n• Some limited data were presented on the immune response to the challenge itself, which was evaluated 2 weeks afterwards (at week 8 post immunisation). These data showed that levels of neutralising antibodies after challenge seem to remain stable, whereas binding antibodies seem to increase after challenge. The cause for this discrepancy is unknown.\n• Dose level titration study with the J & J vaccine applying 1011, 5 × 1010, 1.125 × 1010, and 2 × 109 virus particles administered as a single dose each (n=5 per dose level).\n• A single immunisation with the J & J vaccine induced protection from SARS-CoV-2 infection in the lower and the upper respiratory tract. This was observed in all dose groups, but protection was strongest with highest with the two highest doses.\n• the J & J vaccine induced neutralising (measured by pseudovirus neutralization) and binding (whole spike protein or receptor binding domain ELISA) antibodies; the titres correlated with the dose levels.\n• T cell response, as measured by IFN-γ expression, was also dose-dependent but rather low and variable overall.\n• Since a higher number of breakthrough infections was observed in the nose compared to the lung, these data suggest that protection in the upper respiratory tract may require higher vaccine doses, which induce a stronger systemic immune response.\n\nFor correlate of protection analysis, the data of the above two studies, as well as of a third one (NHP 20-07) were pooled, and the following findings were reported:\n• Non-human primates were vaccinated with a single dose of Ad26-based SARS-CoV-2 vaccine candidates (2 × 109 to 1011 virus particles), followed by challenge via intranasal and intratracheal route with SARS-CoV-2 (USA-WA1/2020, dose: 105 TCID ) at week 6 or week 7.\n• The J & J vaccine was not evaluated in study NHP 20-07 but 7 other Ad26 SARS-CoV-2 vaccine candidates were tested under comparable conditions.\n• All three studies used the same immunogenicity assays: two pseudovirus neutralisation assays, two ELISAs for binding antibodies, and a T cell assay (IFN-γ ELISpot).\n• All studies also used the same assay to determine viral load in broncho-alveolar lavages and in nasal swabs: RT-qPCR of SARS-CoV-2 E gene subgenomic ribonucleic acid (sgRNA).\n• Two logistic regression analyses were made independently: one dataset consisted of all vaccine candidates combined (N=51) and a second dataset containing only the J & J vaccine candidate (N=26).\n• Based on the data generated with the final vaccine candidate, derived from studies NHP 20-09 and 20-14, the dose-dependent increase in the humoral immune response correlates with protection from infection, especially in the upper respiratory tract.\n• While protection from infection in the lower respiratory tract was observed with few breakthrough cases even in the low-dose groups, viral load in the upper respiratory tract was dose-dependent.\n\nAccording to the data listed in the EMA report, vaccination of rhesus monkeys with the J & J vaccine at all dose levels followed by challenge with SARS-CoV-2, was associated with considerably lower average lung pathology scores than with unvaccinated or sham-vaccinated animals, and with the absence of virus-induced lung pathology after challenge. In the control animals in general, but especially in the age-matched control group, pneumonia induced after challenge was very mild and without clinical signs.\n\nAn animal model without clear clinical findings is not suitable to study immunogenicity and viral clearance, and most importantly is not a valid disease model for studying this vaccine. If even unvaccinated animals don’t show disease symptoms, how can vaccine efficacy against the clinical disease be demonstrated? Note also that the animal trials did not attempt to determine the vaccine’s ability to stop the transmission of a disease. Thus, the animal trials do not prove any substantive benefit of the vaccine.\n\nThe studies in rhesus monkeys and Syrian hamsters showed only a partial protective effect of the vaccine against an experimental SARS-CoV-2 challenge based on pathological analyses. Information on the cellular immune response induced by the vaccine is very sparse. Data on Th1 or Th2 bias in the immune response response and T cell subtyping after vaccination and challenge was rather limited and, in some studies, completely absent. Based on the vaccine-induced IFN-γ production, cellular immune responses were rather weak and variable.\n\nIt must also be noted that the animals in these studies were young and healthy. They could only be infected with SARS-CoV-2 by application of a high viral load directly into the respiratory tract (trachea). Translating this to humans, it is important to remember that the most vulnerable individuals are older and have underlying diseases that make them more susceptible to severe COVID-19 disease. The inconsistent results of the animal studies leave in doubt the real extent of the protection from COVID-19 disease even in these young, healthy animals. In elderly humans with many comorbidities and generally less vigorous responses to vaccination, the protective effect of the vaccine seems even more doubtful.\n\nPharmacokinetics comprises the absorption, distribution, metabolism, and excretion of a drug (ADME for short). These parameters control the availability and utilization of the drug—or here, the vaccine—in the organism. All four parameters will affect the strength and the timing of the vaccine’s effect on cells and tissues. It is not acceptable for EMA to claim that ADME studies are not relevant to the development and licensing of a novel vaccine, particularly in the present case, since the agent in question does not possess the characteristics of a proper vaccine.\n\nWith the exception of some experiments concerning distribution, no ADME studies have been performed; and these distribution studies did not use the Ad26.COV2.S vaccine itself but some related recombinant virus constructs (see below). A vaccine which uses completely new technology needs to be closely monitored in every direction, and a key aspect is how the components of the vaccine are distributed, metabolised and broken down by the body. It must also be examined whether any residues are excreted which can contaminate the environment and pollute supplies such as drinking water.\n\nTwo studies in rabbits were carried out to examine the biodistribution of recombinant viral particles [3] (p. 50-51). The vaccines in question were derived from the same Ad26 vector but encoded antigens other than the SARS-CoV-2 spike protein. In one study, the viruses were administered intramuscularly at doses of 5 × 1010 viral particles. Tissue samples were collected at days 11, 61, or 91 after injection. In the second study, the Ad26-based vaccine was given at a dose of 1011 virus particles, and the animals were sacrificed on days 11, 90, 120 or 180 after injection.\n\nAnimal tissues were analysed for Ad26 vector DNA using a quantitative PCR assay. According to the EMA report, both of the tested Ad26-based vaccines showed a similar pattern of systemic distribution and clearance, despite carrying different transgenic inserts. Vector DNA was primarily detected at the site of injection, within the draining lymph nodes, and to a lesser extent in the spleen. The amount of Ad26 DNA within these tissues decreased slowly, with a small amount remaining in an iliac lymph node of one animal at 180 days. In one of the two studies, the vector DNA was below limit of detection in all other organs. No bio-distribution into the gonads (ovaries and testes) was detected.\n\nThe EMA report does not state which organs were studied and at what time points the DNA was found. The report also claims that in only one of the two studies all organs except the one specified were free of DNA. What should we make of the second study, which apparently found DNA in other organs? There is no information as to whether, for example, the central and peripheral nervous systems and bone marrow were studied. Based on what is known about the bio-distribution of adenoviruses in general, it must be assumed, until proven otherwise, that the vaccine also penetrates the nervous tissue and bone marrow, with unpredictable adverse effects. Also, since the two recombinant virus constructs did not express the SARS-CoV-2 spike protein, these studies may underestimate the extent of viral penetration into the brain (see Section 6.8.1).\n\nEven though these data are pivotal, they were not available at the time of approval. Indeed, DNA persistence was shown in various other published preclinical studies that demonstrated the presence of adenovector vaccine DNA for up to 2 years after IM injection, with low but detectable expression and immunogenicity in a mouse model [12].\n\nThe safety profile of the J & J vaccine has been assessed in two toxicology studies in rabbits [3] (p. 51-53).\n\nThree intramuscular injections of the J & J vaccine containing 1011 viral particles or placebo (saline) were administered on days 1, 15, and 29, and tests were carried out for 3 weeks after the last vaccination. According to the EMA report, the toxicological analysis revealed a slightly elevated body temperature, a decrease in body weight, as well as changes in blood laboratory parameters. There was an increase in the numbers of monocytes and lymphocytes and an increase in a levels of plasma proteins associated with inflammation (C-reactive protein, fibrinogen, and globulins). Histopathology findings showed increased lymphoid cellularity of germinal centers in popliteal and iliac lymph nodes and the spleen. These findings were partially or completely reversible at 3-weeks after injection. The local effects at the injection site consisted of transient skin reactions associated with minimal to slight and reversible inflammation and haemorrhage.\n\nThe EMA assessment report does not provide any detailed information about what exactly has or has not been investigated. Transparency regarding the results of the possibly altered blood parameters might shed light on how the thrombosis that occurs in some of the vaccinated people (see Section 9.3) is linked to the vaccine. Aside from the stated increase in plasma fibrinogen, no other blood parameters related to blood coagulation are mentioned. No such blood parameters were monitored in the subjects during the clinical trials either. In this context, we must note that there is reason to believe that the SARS-CoV-2 spike protein itself and the immune reaction to it can trigger blood coagulation (see Section 6.8); therefore, we need to know whether the relevant blood parameters have been investigated in this animal model or not.\n\nThis was studied by injecting female rabbits with a single dose of the J & J vaccine containing 1011 either 7 days before mating, on gestational day 6, or on gestational day 20. No adverse effects were observed on maternal body weight or fertility, nor on fetal body weight or morphology. Effects on male fertility and repeat dose toxicity were apparently not assessed, and the number of animals tested is not stated, so that the statistical power of this study cannot be evaluated.\n\n6. Risks and dangers ignored by J & J and the EMA\n\nAbove, we have summarized the rather limited animal trials and other non-clinical data which the EMA deemed sufficient for granting its emergency use authorization for J & J’s the J & J vaccine. We maintain that in accepting this evidence the EMA acted negligently, as did the other regulatory bodies in South Africa and all over the world. In the following, we will discuss the existing evidence, both clinical and non-clinical, which should have compelled the EMA to demand much more thorough tests and documentation.\n\nWhile primary pharmacodynamics is concerned with the intended and expected effects of a drug, secondary pharmacodynamics refers to its unintended, “off-target” effects. Safety pharmacology is a related concept, focusing on harmful, usually unintended effects. The EMA report states that no studies in either category were carried out, and it deems this acceptable, since it conforms with the general guidelines applicable to vaccines [3] (p. 50):\n\nIn other words, J & J was absolved of its responsibility to prove that its product is safe simply by using the semantic trick of calling this experimental gene therapy a “vaccine.” The safety testing requirements that really should have been applied in this case are those for gene therapy products, which require some very involved long-term follow-up studies [13].\n\nIn addition to the long-term risks inherent in any therapeutic approach that involves the introduction of foreign DNA, there are also very specific short-term risks that result from the known biological activities of the SARS-CoV-2 spike protein. Of these, three are discussed in the following.\n\n6.1.1. Release of S1 fragment into the circulation\n\nThe vaccine induces the host cells to produce the spike protein molecules and expose them the cell surface, where they are presented to the immune system. It has been reported that cells can cleave off and release a fragment (the S1 peptide) of the spike protein. Conceivably, the released S1 fragments can be transported in the bloodstream and give rise to adverse effects at distant sites [14]. The S1 peptide contains the entire receptor binding domain (RBD) and thus is able to bind to ACE2 receptors on other cells. Those receptors will then be taken up into their host cells. The decreased amount of ACE2 receptors remaining on the cell surface will disturb the balance of the renin-angiotensin hormone system, which may lead to cell damage, inflammation, and thrombosis.\n\nNewly synthesized spike protein molecules that remain uncleaved on the cell surface can also bind to ACE2 receptors on other cells, which may cause the two cells to fuse [14,15]. This resembles the normal function of the protein, namely to induce fusion of the virus particle to the host cell membrane; and it cannot be assumed to be fully suppressed by the two proline substitutions engineered into the protein (see Section 2.1). The resulting syncytia (fused cells) are giant cells with multiple nuclei, and they can assume pathological activities. Small amounts of spike protein suffice to set off this fusion cascade.\n\nBlood platelets, too, are known to express ACE2 receptors on the cell surface and thus can bind the spike protein. In vitro, this results in direct platelet activation and aggregation, platelet spreading, leukocyte-platelet aggregate formation, and clot retraction. In vivo, such effects would translate into an increased risk of thrombosis formation. Spike protein molecules also directly stimulate platelets to release granules, coagulation and inflammatory factor secretion.\n\nThere biological activity of the SARS-CoV-2 spike protein can cause significant damage to cells and to the human body in multiple ways. The approval of the J & J vaccine for use in humans without prior safety pharmacology tests to address these pathogenic mechanisms is irresponsible. J & J also performed no preclinical studies on pharmacodynamic drug interactions, which means that there are no available data concerning the behaviour of the vaccine in recipients who show physiological changes due to diseases, genetic mutations, ageing or the influence of other drugs. For example, considering that blood clotting and bleeding disorders have been reported both in COVID-19 and after vaccination, and furthermore that many elderly people are taking drugs that inhibit blood clotting, it would certainly have been important to examine how the vaccine interacts with such drugs; but no such study was carried out.\n\nEven though the vaccine is a genetically modified organism (GMO), EMA assumes that it poses a negligible risk it poses to human health and the environment. Accordingly, no studies on ecotoxicity /environment risk assessment have been performed [3] (p. 53).\n\nThe potential for DNA products to be released unintentionally into the environment is another safety concern. This could happen because of accidents during vaccine production or during the vaccination process. Plasmid DNA—such as that isolated from bacterial cells in the first stage of the vaccine manufacturing process—can be quite resistant to breakdown in the environment. Therefore, it may be necessary to study potential environmental effects such as the persistence of plasmid DNA and its uptake by other organisms in the environment. Furthermore, it was not investigated whether vaccinated persons will excrete the vaccine or any part thereof into the environment. No urine or stool samples have been tested for vaccine components that could cause problems for important municipal providers e.g. for drinking water. No monitoring of excretion in recipients of the vaccine is planned.\n\nSince the vaccine contains GMOs, unused vaccine vials or waste material should be disposed of in accordance with local guidelines for genetically modified organisms or biologically hazardous waste. It cannot be assumed that medical clinics which will dispense the vaccine have the appropriate biohazard level 2 facilities required for safe disposal and, in addition, have the expertise and permits for handling GMOs.\n\n6.3. Risk of recombination between vaccine and wild-type adenovirus strains\n\nThe DNA of the replication-incompetent adenovirus used in the J & J vaccine could undergo recombination with the DNA of a natural, replication-competent adenovirus. This might occur when the two viruses happen to infect the same cell within the body of a vaccine recipient, and it could produce a virus that encodes the SARS-CoV-2 spike protein and at the same time is replication-competent. Two major risks would then result:\n• The recombinant virus could replicate in the vaccine recipient’s body, and excessive amounts of spike protein might be produced, with correspondingly increased toxicity.\n• The recombinant virus might be transmitted to other persons, including some in whom the vaccination is contraindicated.\n\nIn Section 4.3, we argued that the precautions taken by J & J against the emergence of replication-competent recombinant virus during vaccine production were insufficient. The import of this section is that even if the in vitro production process could be fully secured in this regard, it will be impossible to eliminate the risk that a recombinant virus will emerge in vivo.\n\nAdenoviruses are among the pathogens that can cause the common cold. We currently know more than 50 distinct human adenovirus serotypes [16], and due to this large number of circulating viruses and their relative ease of transmission, the vast majority of people have been infected by multiple adenovirus-types during childhood and throughout their lives. This means that a significant proportion of the human population has antibodies and T-cell immunity to these viruses.\n\n6.4.1. Interference of immunity against adenoviruses with vaccination\n\nSpecific immunity or cross-immunity to a certain human adenovirus serotype will hamper the use of this serotype for the construction of adenovector vaccines, because\n• the pre-existing antibodies will bind to the vaccine virus particles and may prevent their cellular uptake;\n• any cell that does take up a virus particle will begin to express not only the transgene—in this case, the SARS-CoV-2 spike protein—but also the adenoviral proteins. If the recipient is already immune to the adenovirus serotype in question, the cell may then be attacked and destroyed by cytotoxic T-cells.\n\nBoth effects will reduce the amount of the transgene product expressed. This would likely not have been observed in the pre-clinical study for the J & J vaccine, because the animals used in such studies are kept under clinically sterile conditions and are not naturally infected with adenoviruses; however, the same cannot be expected with humans.\n\nIt should be pointed out that the prevalence of neutralizing antibodies to different adenovirus serotypes may vary considerably between geographic regions; in particular, serotypes that are rare in the United States or in Europe can be quite common in other regions [17–19].\n\n Adenovirus serotypes that are subject to such geographical variation may induce cross-immunity to other serotypes to different degrees. Thus, in some parts of the world, many recipients of the vaccine may already have a distinct immune response to the virus, including both neutralizing antibodies and specifically reactive T cells.\n\nHuman Adenovector-5 based vaccines showed high efficacy in pre-clinical studies, but in clinical trials they performed below expectation because participants already had human Ad5 immunity due to natural exposure. In particular, in a phase I study, individuals with pre-existing immunity to this serotype showed lower immune responses compared to participants without pre-existing immunity [20].\n\nAdenovector 26 pre-existing immunity was assessed in study VAC31518COV1001 (Phase I/IIa) by\n\n measuring neutralising antibodies to the Ad26 backbone vector at baseline and prior to second\n\n placebo injection on day 57 [3] (p. 68ff). According to the EMA report, 9% of the participants in the placebo group display Ad26-neutralising antibodies [3] (p. 72). Also, in earlier large vaccine clinical studies done by J & J with the same Ad26 backbone vector, Ad26 seroprevalence varied by continents. The highest seroprevalence was reported in Africa (77.9%), followed by Brazil (44%), Asia (41.4%). Much lower values were observed in North America (15.1%) and Europe (11.6%) [3] (p. 167).\n\nAccording to EMA, the potential impact of natural or vaccine induced pre-existing anti-Ad26 immunity on vaccine efficiency remains unclear. From experience with seroprevalence on adenovectors, we must expect that immunity to the vector will severely limit the immunizing effect of vaccine the J & J vaccine.\n\nPre-existing immunity to HAd5 has also been associated with adverse outcomes beyond interfering with vaccination [21]. Injection of recombinant adenovirus preparations can induce potent inflammatory responses, in part due to the activity of structural viral proteins [22]. Activation of innate responses appears to involve several pathways, including at least two toll-like receptors as well as type 1 interferon expression. In addition, the adenovector DNA is recognized in the cytosol by NALT3, which in turn triggers a pro-inflammatory cytokine response. Overall, adenoviruses and adenovectors are recognized by innate sensors through multiple pathways that all result in activation of cytokine and chemokine release, which in turn impose dose-limiting toxicity for the use of adenovectors in humans.\n\nA stark example of an adverse reaction to adenovirus gene therapy, likely immune-mediated, is the first death in a gene therapy phase I experiment, which occurred in 1999 at the University of Pennsylvania [23,24]. They used a replication-defective adenovirus, Ad5-vector (injected dose: 6 × 1011 virus particles per kg of body weight), to deliver potentially therapeutic DNA to the liver. Approximately 18 hours later, the 18 years old subject developed jaundice and impaired consciousness. The subsequent clinical course was marked by systemic inflammatory response syndrome with biochemically detectable failure of multiple organ systems, leading to death 98 hours following gene transfer. Post-mortem examination was consistent with the clinical course, and vector DNA sequences were readily detectable in most tissues. The subject had shown high serum levels of IL-6 and IL-10 but normal TNF-α immediately after infusion of the vector. This experience points to the limitations of animal studies in predicting human responses, which in this fatal case were ascribed to an unexpectedly strong immune reaction [25].\n\nFurther studies are absolutely necessary to gain a better understanding of the immune response to replication-defective adenovirus vectors and of their toxicity, and also in order to understand the substantial differences in both between individual subjects. Considering the limitations of our current knowledge, it is irresponsible to administer adenovirus-based vaccines such as the J & J vaccine to healthy people—particularly on such a large scale as has been done since immediately after emergency use authorization was granted.\n\nFinally, even in patients without any pre-existing immunity to Ad26, the first injection will induce immunity not only to the transgene product (the SARS-CoV-2 spike protein) but also to all of the adenoviral proteins whose genes remain intact (see Figure 1). This freshly induced immunity will then interfere with the second and all further injections. The Russian Sputnik V vaccine uses two different adenovirus serotypes (26 and 5, respectively) as vectors for the first and second dose, respectively, to address this problem [26]; however, J & J and AstraZeneca prefer to pretend that it does not exist.\n\nOne theme conspicuous by its absence among the animal studies on toxicology (see Section 5.3) genotoxicity and carcinogenicity. We will here explain why J & J’s omission of such studies, and EMA’s acquiescence to it, are fundamentally flawed.\n\nOne feature of adenoviruses that makes them attractive as vectors for gene therapy is their very broad host cell range. They can infect, and therefore deliver genes to, most human dividing and non-dividing cells, since almost all cells express the primary adenovirus receptor (CD46) and the secondary integrin receptors [27].\n\nIn J & J’s distribution study (Section 5.2.1), adenovirus DNA was found only in some tissues, but the sensitivity of DNA detection depends on the proportion of infected cells within the tissue. Thus, even if the analysis of a large organ as a whole may not detect viral DNA, individual cells of the organ may very well have picked up the virus. Hence, we must expect that the vaccine will be found in all tissues; accordingly, the genotoxic effects may also occur in many cell types and organs.\n\n6.6.2. Insertion of adenovirus DNA into the host cell genome\n\nIt has been known for several decades that viral DNA can integrate into the genome of mammalian host cells [28]. These interactions are of interest not only in tumor virology and gene therapy, but also for the role of viral DNA as an evolutionary mechanism. Thus, it has been scientifically demonstrated in many ways that adenoviruses introduce their genetic material into the chromosomal DNA of human cells via both non-homologous and homologous recombination [29–32].\n\nThe site of adenovirus integration into host cell DNA cannot be controlled [29]. There are more than 70 different adenovirus-transformed cell lines that show non-identical patterns of viral DNA insertions\n\n into the host genome [31]. In vitro studies on hamster, mouse, rat, and human systems identified no highly specific sites of viral DNA insertion into the cellular genome. Published work on adenovirus vectors indicates that in most cases the vector genome remained intact after integration; the same was also observed with the wild-type adenovirus DNA. Some integration events had taken place completely non-specifically, without any detectable sequence similarity between the host DNA at the site of insertion site and the viral genome, whereas in other cases short homologous stretches near the junction sites could be discerned.\n\nIt should be emphasized that all integration sites in the host cell genome have been shown to be transcriptionally active. The resulting genotoxic effect can be manifested in various ways [33–35]:\n• Gene inactivation: insertion may occur within a chromosomal gene and disrupt it. This can lead to the loss of important cellular gene products (i.e., proteins) and thus, potentially, to the development of disease including cancer.\n• Gene activation: viral promoters and insertion of viral DNA into the regulatory elements of chromosomal genes may increase the transcription rate of these genes. This, too, may transform the host cell into a cancer cell, which may then proliferate and mature into a clinically manifest tumour. Viral DNA integration is an important paradigm in modern tumour biology.\n• Gene regulation: other transcriptional and epigenetic regulation mechanisms may be affected, increasing or decreasing expression levels of individual proteins with unpredictable results.\n• Chromosomal damage: other possible effects of adenovector integration are chromosomal deletions, inversions, or translocations. Such a loss or rearrangement of genetic material may affect a large number of genes and accordingly have more severe consequences than the effects discussed above. For example, chromosomal translocations are often associated with leukaemia.\n• Autoimmune-like disease: integration of the spike protein gene into the host cell could lead to permanent expression of this antigen. This would cause the immune system to attack these cells and could lead to autoimmune-like disease.\n\nThe occurrence of malignancies through DNA integration and oncogene activation has been demonstrated, for example, in clinical trials with a retroviral (not adenoviral) vector for the treatment of children with SCID-X1 (severe combined immune deficiency) [36]. These will typically become manifest several years after the completion of treatment [37]. Therefore, thorough long-term investigations concerning possible genotoxic effects by chromosomal integration in the pre-clinical and clinical trial stages are absolutely necessary for a valid benefit-risk analysis of gene transfer vectors like the J & J vaccine. Detailed information on genotoxicity after gene transfer is already available for vectors derived from viruses of the retrovirus and parvovirus families. In contrast, there are only few studies on chromosomal integrations of adenovector DNA after gene transfer in cell cultures, and even less is known about adenovector integration in vivo [32].\n\nIt is irresponsible to use an adenovirus vector as a vaccine on humans when so little scientific data is available which covers such a very short observation period. Even though the regular adenovirus life cycle is extrachromosomal, it is dangerous to assume that adenovectors will never integrate into the cellular genome; there are no studies to prove this point. On the contrary, in previous in vivo studies it was shown that injection of hamsters with wild-type adenovirus type 12 (Ad12) resulted in tumor formation due to chromosomal integration of the virus DNA and the expression of cancer-promoting proteins [31]. Therefore, long-term follow-up studies must be categorically demanded for any adenovector-based vaccine (see Section 6.6.6).\n\nStephen et al. examined the frequency of insertion into liver cell DNA of a recombinant type 12 adenovirus, using a limiting amount of viral particles, such that only a negligible number of cells would have taken up more than one virus particle. Under these conditions, approximately seven in 100,000 cells that had taken up the virus ended up with a chromosomally inserted copy of its genome. One human dose of the J & J vaccine contains 5 × 1010 particles; if each of these were taken up by a cell, then the number of integration events expected from the data Stephen et al. would be 700,000.\n\nAt first glance, this number may not seem very high when compared to the frequency of spontaneous mutation events. However, most spontaneous mutations are point mutations, which do not usually cause the same extent of gene damage as the integration of whole or partial adenovector genomes, which is much more likely to lead to wholesale gene inactivation or even chromosomal damage.\n\nThe mechanism of insertion of foreign DNA into mammalian cells is not yet fully understood at the molecular level. Accordingly, there is a need for further research and better understanding prior to approval of any vaccines based on DNA vectors. Currently, researchers mainly focus on the following topics:\n• Does insertion occur randomly throughout the genome, or is it targeted to specific sites?\n• If insertion is not random: what are the characteristics of the chromosomal sites that are targeted by the insertion of foreign DNA, and at which sequence motifs does the foreign DNA recombine with cellular DNA?\n• What cellular or viral factors facilitate insertion of foreign DNA?\n• What are the effects of the inserted genes on the expression of host genes adjacent to the inserted DNA, or on the expression of genes located at more distant sites?\n\nAll of these questions have a direct bearing on the risks inherent in the use of the J & J vaccine, but they cannot currently be answered. In particular, it is unknown for how long the vector DNA may persist within the cell without undergoing integration. Pre-clinical studies have shown the presence of episomal (extra-chromosomal) DNA for up to 2 years upon intramuscular injection, with low but detectable expression and immunogenicity in a mouse model [38]. According to the FDA, DNA persistence is not generally evident at ectopic sites in bio-distribution and persistence studies, but remains detectable at the injection site for periods exceeding 60 days. Such long persistence in the nuclei of transfected cells increases the risk that the foreign DNA will ultimately integrate into the host chromosomes, and therefore the long-term risk of mutagenesis and tumour induction.\n\n6.6.6. The need for long-term follow-up studies on gene therapy products\n\nIntegrating gene therapy vectors can persist in the body over the life-span of the patient’s transduced cells. According to a guide published by the FDA in 2020 [13], leukaemia have been reported in more than one trial in which subjects received cells that had been genetically modified in vitro using γ-retroviral vectors. Advances in analytical techniques for integration site analysis in patient samples collected during long-term follow-up have provided some insight into the possible mechanisms involved in the occurrence of such delayed adverse events. Such risks can be mitigated through improvements in vector design and the duration and design of long-term follow-up observations.\n\nIn keeping with the generic FDA recommendation, a pre-clinical study in a relevant animal species should also have been performed with the J & J vaccine to assess the duration of its persistence in cells of different tissues, since it is currently unknown how long this gene therapy product persists in the host after injection. If such studies turn up evidence of chromosomal integration, then all clinical protocols should include long-term follow-up observations for appropriate human subject protections. Only after completion of such a study could one reliably assess the risk of delayed side effects.\n\nIn the absence of such specific information, some extent of adenovector insertion into the genome of host cells must be considered likely, for reasons that were discussed above. In this context, we note that the applicable FDA recommendation states that for gene therapy products that can integrate into the genome, a long term observation study (LTFU) of up to 15 years is necessary, including the investigation of new clinical conditions such as new malignancies or hematological disorders, new incidence or exacerbation of a pre-existing neurologic disorder, rheumatologic or other autoimmune disorder, or potentially product-related infection. None of this has been done with the J & J vaccine.\n\n6.6.7. The benefit of preventative vaccination does not warrant the risk of long-term genetic damage\n\nAccording to the FDA, gene therapy products derived from adenoviruses generally pose a low risk of delayed adverse events. If only severely sick people were to be treated with such a gene therapy product, the risk-benefit ratio might well be acceptable if indeed the people so treated were cured of their disease, and if no safer conventional treatment is available. But with the COVID-19 adenovector vaccines, millions of people are exposed to the risk of long-term genetic damage, even though they are healthy, and the viral disease supposed to be prevented by the vaccines is usually mild and self-limiting. Even if these vaccines were effective, which they are not (see Section 8), the risk of late adverse events would be neitherproportionate nor acceptable.\n\nSince the clinical trials were carried out on a greatly accelerated schedule, with overlapping rather than successive second and third stages (“telescoping”), it has not been determined whether antibody-dependent enhancement (ADE) will occur after SARS-CoV-2 immunization. Based on review of numerous scientific data (see below), the likelihood that ADE will occur in recipients of this coronavirus vaccine is high enough to be significant to reject these vaccines.\n\nAntibody-dependent enhancement of disease (ADE) has been observed in human subjects with several natural virus species, but also with vaccines for respiratory syncytial virus (RSV), dengue virus and measles [39,40]. Vaccine-elicited enhancement of disease was also observed with SARS and MERS viruses [41,42] and with feline coronavirus [43], which are closely related to SARS-CoV-2. In particular, SARS-CoV and SARS-CoV-2 are highly homologous, with 80% sequence identity at the genome level, and the viral receptor on host cells for both is ACE2.\n\nAn antiviral vaccine that induces ADE will aggravate rather than mitigate the corresponding viral infection. The immune mechanisms of this enhancement invariably involve antibodies. In the simplest case, antibodies that have bound to the viral particle promote uptake of the latter into cells through binding, with their unoccupied (F ) ends, to F receptors on those cells. In addition, interaction of antibody-antigen complexes with F receptors on macrophages alters the function of these cells and induces lung injury through hyperimmunity and Th2 skewing of T-cells (see below). Notably, both neutralizing and non-neutralizing antibodies have been implicated in ADE.\n\nOne early SARS-CoV vaccine candidate was produced from inactivated whole SARS-CoV virus without adjuvants. In animal experiments, this vaccine preparation provided only modest protection, since it induced only low neutralizing antibody titres but was able to early clear lungs from viruses in challenged ferrets.\n\nIn mice, inactivated whole virus vaccines with or without alum adjuvant also provided only partial protection, but they caused severe eosinophilic lung pathology, similar to that seen with SARS-CoV re-challenges after natural primary infection [41]. In a SARS-CoV homologous re-challenge study, 11 of the 12 vaccinated African green monkeys were free of replicating virus at day 5 after re-challenge.However, incidence and severity of lung inflammation was not reduced despite the reduced viral replication mediated by the progressive increase in anti-SARS-CoV antibodies upon re-challenge [44].\n\nEosinophilic immunopathology in the lung was also observed in another mouse study which examined a double-inactivated SARS-CoV vaccine with or or without alum adjuvant [45], as well as with an alum-adjuvanted vaccine directed against the SARS-CoV nucleocapsid protein [46]. All vaccine variants demonstrated poor protection against a non-lethal heterologous challenge in aged mice.\n\nThese collective data raise significant concerns regarding SARS-CoV vaccine safety, suggesting a generalized problem of Th2-polarizing response [47]. This highlights the need for additional studies of the molecular mechanisms governing vaccine-induced eosinophilia and vaccine failure, especially in the aged-animal models that better reflect human disease in the more vulnerable individuals. To date, it is not known if human subjects vaccinated against COVID-19 might be similarly predisposed to severe lung immune pathology upon SARS-CoV-2 infection. It seems likely that infection with natural coronaviruses or injection with vaccines against not only induces neutralizing antibodies to viral antigens, but also poses a unique problem related to Th2-biased immune response. Many animals immunized with coronavirus vaccines show eosinophilic pathology in the lungs after new infection with the wild type virus or after vaccination [45–48]. The same phenomenon has been reported after immunization of mice with recombinant coronavirus spike proteins.\n\nGene-based vaccines have been tried against SARS as well. As early as 2005, a modified poxvirus vector was constructed that carried the complete SARS-CoV viral spike protein gene. The findings were much the same as with conventional vaccines—namely, increased lung pathology after viral challenge [49].\n\nThe most promising path toward a truly protective vaccine may be to focus not on the technique of antigen delivery but rather on the adjuvant. Mouse studies published in 2015 have shown that formulation of SARS-CoV spike protein or inactivated whole-virus vaccines with novel delta inulin-based polysaccharide adjuvants enhanced neutralizing-antibody titres [48]. This kind of experimental vaccine also provides protection against both manifest disease and the development of lung eosinophilic immunopathology.\n\nAnother strategy to reduce the level of eosinophilic pathology in the lungs is the use of Toll-like receptor agonists together with inactivated whole virus SARS-CoV vaccine [47]. Further in-depth studies are needed to elucidate the long-term protective effects of different adjuvants and to develop safer and more effective vaccines. No similar efforts were made in the development of the J&J vaccine discussed here.\n\nThe possibility of ADE in the context of natural infection with SARS-CoV-2, as well as of vaccination against it, has been acknowledged [50]. More specifically, ADE due to spike protein antibodies elicited by other coronavirus strains has been invoked to account for the peculiar geographical distribution of COVID clinical disease severity within China [51]. Johnson & Johnson and the regulatory bodies are well aware of the risk of ADE as well. The EMA report summarizes the information supplied by J & J as follows [3] (p. 181):\n\nOverall, it is clear that the risk of ADE is recognized in theory but has not been addressed in human vaccine recipients with any degree of rigour. Given the abundant evidence of ADE with experimental SARS vaccines, this is unacceptable.\n\nIn summary, a Th2-type immunopathologic reaction with severe lung inflammation and eosinophil infiltration upon challenge of vaccinated animals has occurred in three animal models including two different inbred mouse strains with four different types of SARS-CoV vaccines, both with and without alum adjuvant. None of the various SARS-CoV vaccines was ever approved for use in humans. Until and unless proof positive to the opposite is adduced, we must assume that the current crop of COVID-19 vaccines, including the J & J vaccine, may cause ADE. In this context, we note that the J & J vaccine showed an almost threefold increased risk of COVID infection, relative to no vaccination, in a recent large scale study published by the CDC (see Section 8). ADE seems to be the most straightforward explanation for this observation from the real world.\n\nAdverse reactions related to blood clotting have occurred with all gene-based COVID-19 vaccines (see Section 9). There are two major mechanisms that apply to all of them, namely\n• direct effects of the spike protein, and\n• attack of the immune system on cells that have taken up the vaccine and express the spike protein.\n\nWith the adenovirus-based vaccines manufactured by Johnson & Johnson and AstraZeneca, there is a third mechanism: adenoviruses as such, even without encoding the SARS-CoV-2 spike protein or any other transgene, have been shown to trigger blood clotting. We will consider each of these mechanisms in turn.\n\nThe SARS-CoV-2 spike protein is a leading cause of the manifestations of severe COVID disease.1 Some of its harmful effects are mediated by the S1 fragment, a soluble protein molecule that is released from infected cells through proteolytic cleavage of the surface-anchored spike protein. The blood plasma level of S1 correlates with disease severity [52]. S1 can bind to ACE2 receptors on endothelial cells and on thrombocytes (blood platelets), which can promote blood clotting [14,53].\n\nThe spike protein also damages the capillary barriers in the lungs and the brain [54,55]. In addition to the ACE2 receptor, the protein binds to Toll-like receptor 4 (TLR-4) and to the cell surface protein CD209 (CLEC4M) [56]; these interactions extend the host cell range of the virus. TLR-4 in particular has been implicated in myocarditis, which is associated with the virus infection [57] and also a prominent side effect of the COVID vaccines, particularly in young men.\n\nAgainst the background of this well-known toxicity, it is very peculiar that all of the current gene-based vaccines, including the J & J vaccine, were designed to induce the expression of functionally active spike protein in the cells of our bodies2 rather than of a “toxoid,” that is, an immunogenic but innocuous derivative of the toxic protein. Toxoids can be produced with simple means and have been successfully used as vaccines for a long time, for example with diphtheria and tetanus, whose eponymous toxins can be rendered non-toxic by facile chemical modification. With modern methods of molecular biology, it should have been easy enough to create a non-toxic spike protein derivative for vaccination.\n\nThe concerns about vaccine-induced spike protein toxicity are not at all merely hypothetical. Blood plasma levels of S1 detected in vaccinated persons are comparable to those observed in severe cases of the viral infection [52,58]. Accordingly, similarly grave detrimental effects on vascular integrity had to be expected after vaccination; and this is indeed borne out by a very large number of severe adverse events (see Section 9).\n\n6.8.2. Risk of clotting and bleeding due to autoimmune attack\n\nAside from the direct toxicity of the spike protein, we must expect additional harm due to immune reactions against it. If the protein is expressed within vascular endothelial cells—the innermost cell layer of the blood vessels—then an immune reaction to it can destroy these cells. The resulting vascular lesion will again activate blood clotting. This immune reaction can involve cytotoxic T-cells, but also antibodies that trigger the complement system and other immune effector mechanisms. Note that this mechanism of cell damage will also operate in other tissues—any body cell that expresses the spike protein will thereby become a target for the immune system.\n\nDirect spike protein toxicity is significant because it does not involve an immune reaction and therefore can be triggered right away even in persons without pre-existing immunity. The immune attack mechanism will be particularly dangerous in persons with pre-existing immunity. Such immunity can arise from infection with the SARS-CoV-2 virus or from a previous injection of vaccine. In addition, cross immunity induced by other coronaviruses may also promote cell destruction through immune attack.\n\nLafont et al. [59] examined the occurrence of thrombosis after adenovirus-mediated gene transfer into normal and atherosclerotic arteries in animal experiments. A replication-deficient adenovector expressin the β-galactosidase reporter gene was injected into normal and atherosclerotic arteries. Three days later, the animals were sacrificed and examined for thrombi and for the presence of β-galactosidase activity. Non-occlusive thrombi were readily detected in atherosclerotic arteries. β-Galactosidase activity was found predominantly in the endothelial (innermost) layer of blood vessels. Thrombi were formed as well after injection of adenovirus particles without any transgene.\n\nIn a preclinical study in rhesus monkeys, administration of a replication-deficient adenovirus vector was shown to reduce platelet counts and platelet half-life in a dose-dependent manner [60]. Injection of 6 ×\n\n 1012 particles per kg caused severe thrombocytopenia (reduction of the platelet count by up to 90%) and a decrease in platelet half-life from normally 111 hours to 22 hours. Another study in the same animal species with administration of 1013 particles of an E1-deleted recombinant adenovirus or a virus that had been rendered replication-incompetent by UV irradiation also showed severe thrombocytopenia and evidence of disseminated intravascular coagulation [61]. The same was observed in rabbits after injection of 5 × 1011 infectious adenovirus particles/kg. A reduction of platelets by 80-90% was measured within 48 hours [62].\n\nThrombocytopenia after application of adenoviral vectors for gene therapy was also reported in clinical studies. For example, injection with 1010-1013 adenoviral particles encoding a thymidine kinase gene in patients with metastatic liver tumors showed grade 1 thrombocytopenia in 6 of 16 patients (38%) and grade 3 in 1 subject (6%) [63]. In a phase I clinical trial which involved the injection of 1012 adenovirus particles expressing heat shock protein 70 into cancer tissue, two patients (7%) developed thrombocytopenia, with one case classified as grade 4 [64].\n\nHow adenovirus particles trigger thrombi and thrombocytopenia is still poorly understood. Activated platelets contribute to blood clotting both through mutual aggregation and through facilitating, on their cell surfaces, membrane-dependent reactions of the plasmatic coagulation cascade, ultimately resulting in fibrin activation and aggregation. It was determined that platelet activation occurs rapidly after incubation with human adenovirus Type C5 (HAdv-C5) and that platelets express HAdv-C5 attachment receptor, CAR. This suggests that direct HAdv-C5 binding to CAR on platelets may be responsible for virus-mediated platelet activation. This is supported by some studies carried out in vitro and in vivo [65,66]. Secondly, HAdv-C5 was also shown to bind avidly to coagulation factor X, which suggests a mechanism for the direct activation of the plasmatic coagulation cascade, with possibly devastating consequences.\n\nThe formation of a thrombus involves numerous elements, including endothelial cells, platelets, plasma proteins, and shear stress changes. In the circulation, once a vessel wall is injured, collagen is exposed, which causes platelets to accumulate at the site of injury and become activated. This is mediated by von Willebrand factor (VWF), which causes platelet adherence to the injured vessel wall through binding to both the collagen and to specific receptors on the surface of platelets. Activated platelets also recruit leukocytes. Fibrin and fibronectin are produced and cross-link together to form a protein plug to stop the blood loss.\n\nIn von VWF knock-out mice, injection of adenovirus did not show significant thrombocytopenia compared with wild-type mice [67]. This study also showed that adenovirus causes adhesion of platelets to endothelial cells. Formation of mixed aggregates of platelets and leukocytes then sets off blood coagulation. Such uncontrolled activation and recruitment could lead to thrombosis, tissue damage, and loss of organ function. If this occurs in multiple locations at once—a condition referred to as disseminated intravascular coagulation—it will also consume plasma coagulation factors and platelets. The upshot will be simultaneous diffuse, aberrant blood clotting and bleeding. The absence of thrombocytopenia in knock-out mice deficient in complement factors C3 and B [22] also suggests a role of the serum complement system in this phenomenon.\n\nA very recent observation of pathological blood clotting induced by a viral vector concerns the gene therapeutic Zolgensma, which is intended to treat spinal muscular atrophy, a rare genetic disorder of the motor neurons. The gene delivery method used for Zolgensma is essentially the same as that used with the J & J vaccine, with an only slightly different virus, namely the non-replicating recombinant adeno-associated virus serotype 9. Clinical application can cause thrombotic microangopathy [68]. This is an acute and life-threatening condition characterized by thrombocytopenia, hemolytic anemia and acute kidney injury. Since this gene therapy was approved for the treatment of children with spinal muscular atrophy, five confirmed cases of TMA have occurred in the approximately 800 children treated worldwide to date.\n\nOverall, it is apparent that the novel method of introducing genetic material into human cells via adenoviruses or adeno-associated viruses is fraught with dangerous side effects, the causes of which are not yet entirely clear. While such risks might be acceptable in otherwise incurable conditions such as spinal muscular atrophy, it is absolutely irresponsible to impose them on healthy people who have little or no risk to ever experience a severe course of COVID-19.\n\nThis section will have made it clear that vascular injury, clotting, and bleeding induced by the J & J vaccine and other gene-based SARS-CoV-2 vaccines had to be expected. However, out of the pathogenetic mechanisms enumerated above, not a single was examined, let alone excluded, by J & J in any preclinical animal experiments. In the main clinical study, a numerical imbalance was observed for the venous thromboembolic events with 11 subjects in the vaccine group (6 cases of deep vein thrombosis, 4 cases of pulmonary embolism, 1 case of transverse sinus thrombosis) versus 4 in the placebo group [3] (p. 160).\n\nSince the approval of the J & J vaccine, numerous cases of thromboembolic events and DIC have been observed in vaccinated individuals (see Section 9), which motivated the transient suspension of its use in as many as 15 countries, many of them EU members.\n\nAside the general danger of bleeding and clotting, which also pertain to the brain and can give rise to stroke and cerebral venous sinus thrombosis, there are many forms of inflammatory and demyelinating diseases, including transverse myelitis, disseminated encephalomyelitis, Bell’s palsy, and Guillain-Barré syndrome. While all of the gene-based vaccines are affected [69,70], Guillain-Barré syndrome has been identified as a particular risk with the J & J vaccine [71].\n\nMost of the EMA report [3] deals with the clinical trials on the J & J vaccine. A summary of the study protocols devised by J & J can be found on pages 59-64 of the report. The phase 3 studies were carried out internationally, but more than 40% of the subjects came from the United States, and another 40% from six Latin American countries [3] (p. 103). In Brazil, a substantial percentage (approximately 30%) of the participants had neutralizing antibodies against adenovirus serotype 26 even before vaccination; approximately 15% of these subjects failed to respond to the vaccine [3] (p. 82).\n\nThe studies claim to show a clinical vaccine efficacy of 67% against COVID-19 of any degree of severity, and an efficacy of 77% against clinically severe COVID-19[3] (p. 139). Furthermore, severe adverse events were purportedly rare, with minor ‘numerical imbalances’ in disfavour of the vaccine (relative to placebo) reported for thromboembolic events, seizures, Bell’s palsy, and asthma [3] (p. 174-5).\n\nMuch effort was expended on a detailed investigation of the optimal vaccine dose for the J & J vaccine in humans and the required number of vaccine doses. Although many data that must have been collected are not shown in the report, it seems that a single dose of 5 × 1010 virus particles is sufficient to induce humoral and cellular immune responses in adults 18-55 years and 65 years or more of age. A booster dose resulted in only a small increase in antibody titres. The likely reason is that the proteins of the Ad 26 vector virus induce cognate antibodies after the first injection, which will then neutralize the virus particles after the second injection (see Section 6.5.3). In keeping with this explanation, more than 95% of the vaccine recipients did indeed develop Ad26 antibodies after the first injection [3] (p. 87).\n\nSubjects were followed for a median period of only 58 days after vaccination, which means of course that the duration of protection beyond eight weeks after vaccination is not known. The short duration of the follow-up also undermines the reliability of the reported statistics on adverse events. A recent study by Bansal et al has demonstrated that spike protein remains detectable even four months after vaccination, which raises the very real prospect of long-term autoimmune-like disease. While the subjects examined by Bansal et al. had received the Pfizer vaccine, a similarly long or even longer persistence must be considered likely with the J & J vaccine (see Section 6.6.5). Another notable shortcoming of the clinical trials is the lack of safety and efficacy data on individuals with compromised immune systems or other comorbidities, because this is the only group at substantial risk to suffer severe consequences from COVID-19.\n\nWhile one could go into more detail examining and criticizing these clinical studies, this is now largely moot, since in the meantime convincing evidence has accumulated of the J & J vaccine’s lack of real world efficacy (see Section 8) and of safety (Section 9). These data supersede and invalidate the purported results of the clinical trials.\n\n8. The real-world efficacy of the Johnson & Johnson vaccine is negative\n\nRecent data published by the Israeli health ministry indicate that COVID is equally likely to occur in vaccinated and unvaccinated persons, which suggests that the true efficacy is not 95% but rather close to 0%. The same is evident from a CDC report that examines a cluster of COVID infections which occurred among vaccinated and unvaccinated persons in Barnstable County, Massachusetts during July 2021 [72]. The data are summarized in Table 1. The two mRNA vaccines have a relative risk of infection near 1, indicating lack of effectiveness. With the J & J vaccine, the relative risk is substantially higher: recipients of this vaccine are almost 2.5 times more likely to suffer COVID-19 than the general population, and almost three times more than the unvaccinated. While this finding may be surprising at first glance, a plausible explanation is antibody-dependent enhancement of disease (see Section 6.7).\n\nThe vaccine-associated relative risk of hospitalization stated in the table is based on a total of only 5 cases and therefore is not statistically robust. We note, however, that this low number of hospitalized cases indicates a very low disease severity overall. Of particular interest in this connection is that most of these cases were apparently due to the so-called Delta variant, which was identified in 89% of those 133 cases in which the viral RNA was characterized by genomic sequencing.\n\nBrown et al. do not state whether the Delta variant was overrepresented among the “breakthrough” cases which occurred in vaccinated persons; thus, the incomplete data provided in this study do not rule out the possibility that the vaccines might have been more effective with the original Wuhan strain of SARS-CoV-2. Be that as it may, however—RNA viruses are always subject to antigenic drift. Even if we assume that the vaccines had been active against the Wuhan strain, their obsolescence due to antigenic drift within mere months after introduction would suffice to make them useless in practice.\n\nBrown et al. [72] state that all of their reported cases were “associated with large public gatherings,” which suggests that most of the affected persons were in a reasonable state of health before contracting the infection. Other studies have reported vaccine “breakthrough” cases of infection both among the healthy [73] and among those with pre-existing neurological disease [74]. Overall, it is clear that the vaccines, including the J & J vaccine, are failing.\n\nFurther evidence of the vaccines’ ineffectiveness is provided by a statistical overview of 68 countries, in which the incidence of COVID-19, within the week before September 3, 2021, was correlated to the vaccination rate of the population [75]. The results are summarized in Figure 2. The vaccination rate ranges from 0% to 80%; thus, if vaccination could indeed reduce the spread of the disease, this should be evident in the graph. Instead, we see that the incidence of COVID-19 actually goes up with the vaccination rate; but the correlation is very week. Overall, it is clear that this large-scale comparison fails to show any protective effect of vaccination.\n\n9. The safety record of the Johnson & Johnson vaccine\n\nSince the introduction of the vaccines, numerous adverse events have been reported to registries around the world. We will here focus on two registries, namely, the U.S. vaccine adverse events reporting system (VAERS) and the EU monitoring system for drug adverse events (EudraVigilance).\n\n9.1. Total cases and fatalities reported to EudraVigilance and VAERS\n\nTable 2 summarizes the numbers of adverse events for each of the four COVID vaccines deployed in the countries of the European Union. We see very high numbers of incidents and fatalities across the board. Pfizer has managed to rack up the highest body count because their vaccine is the most widely used. The Moderna vaccine takes the second spot; it is also remarkable for its high percentage of reported events which are fatal. Johnson & Johnson is only slightly behind Moderna in this regard.\n\nThe totals are somewhat lower but still appallingly high in the VAERS database. With VAERS, we can also obtain the case numbers and fatalities by age group. These data are summarized in Table 3, separately for the J & J vaccine and for all COVID vaccines combined (also including J & J). Deadly events occur in all age groups, but the elderly are more often affected. Among those up to 19 years of age, the J & J vaccine has not yet caused any fatalities, most likely because thus far it has not been very widely used in this age group. Overall, though, with the J & J vaccine the case fatality rate of adverse events is above the average, which resembles the trend seen in EudraVigilance.\n\nIt is impossible to know what percentage of all fatalities that occur shortly after vaccination will actually be reported to VAERS or EudraVigilance. Comparison between different European countries suggest that reporting is very incomplete. For example, Iceland and the Netherlands report one adverse event for every 112 and 77 vaccine injections, respectively, whereas that number is 534 for Germany, 8,367 for Slovakia, and 36,851 for Poland.\n\nWe note that the total of the COVID vaccine fatalities in VAERS already exceeds that reported for all other vaccines combined, over the entire 30 year period that this reporting system has been in existence. It is therefore clear that these vaccines are far and away the most deadly ones in history—quite predictably so, and all for a disease whose case fatality rate does not exceed that of influenza [77] and is negligible in otherwise healthy persons [78,79].\n\n9.2. Heart attacks and myocarditis or pericarditis by age group\n\nIt is generally accepted that, in COVID-19 disease, the spike protein of the virus triggers vascular lesions and blood clotting [15,81,82]. A prominent clinical manifestation of blood clotting is myocardial infarction (heart attack). Another form of cardiac involvement, also connected to the spike protein but purely inflammatory rather than related to clotting, is myocarditis [57].\n\nSince all of the COVID vaccines induce the production of active spike protein, they, too, must be expected to cause heart attacks and myocarditis; and in fact both VAERS and EudraVigilance document a large number of cases. In Figure 3A, the cases of these diseases reported to VAERS have been grouped by age. The incidence of heart attack rises with age, which is expected. Note, however, that even in the youngest age group, there are as many as 213 cases; this is highly irregular. Panel B of the same figure groups the reported heart attacks according to time elapsed since vaccine injection. Of all heart attacks reported, 49% occurred within one day of the vaccination, and 84% within one week. This close correlation in time very strongly points to causation by the vaccine.\n\nFrom panel A, it is evident that the age distribution of myocarditis/pericarditis is practically a mirror image of that of heart attacks—it is highest in the youngest age group and drops continuously with age. Myocarditis in particular is a very serious condition in its own right; it can be fatal in the acute phase and is likely to leave behind some measure of lifelong functional impairment. Thus, overall, all age groups are at substantial risk to suffer grave harm to their cardiovascular health from the vaccines.\n\nAside from myocardial infarctions, the litany of diagnoses in both databases that indicate pathological activation of blood clotting is almost endless—strokes, thromboses in the brain and in other organs, pulmonary embolism; but also thrombocytopenia and bleeding, which result from excessive consumption of thrombocytes and of coagulation factors in disseminated intravascular coagulation. Clotting disorders caused many of the fatalities summarized above; in other cases, they caused severe acute disease, which will in many cases leave behind severe disability.\n\nAs of December 3rd, 2021, VAERS contains 2,437 case reports of miscarriage among vaccinated pregnant women; of these, 92 concern the J & J vaccine. While it is difficult to ascertain what percentage of these miscarriages must be attributed to vaccination—the CDC claimed to have addressed this question [84], but had to admit in an erratum that this study was completely botched [85]—we must note that most of the cases in VAERS and in EudraVigilance were reported by healthcare professionals, who evidently considered a connection to the vaccine at least plausible.\n\nThis high number of reports alone would be reason enough to pause the vaccinations and investigate. We must also note that pregnant women had been excluded from the clinical trials on the Moderna vaccine, as well as on the other COVID vaccines. Continuing vaccination without proper investigation in the face of mounting indications of harm is completely irresponsible.\n\nSevere reactions also include seizures and other neurological symptoms, particularly related to motor control, and severe systemic inflammation with damage to multiple organs. Again, in many of these patients, long-lasting or even permanent residual damage is highly likely.\n\nThere are several lines of evidence to show that there is no need to vaccinate the general population against COVID-19.\n\n10.1. The case fatality rate of COVID-19 in the general population is low\n\nThe vast majority of all persons infected with COVID-19 recovers after minor, often uncharacteristic illness. According to world-leading epidemiologist John Ioannidis [86,87], the infection fatality rate of COVID-19 is on the order of 0.1% to 0.2% across all age groups, with a very strong bias towards old people, particularly those with co-morbidities. This rate does not exceed the range commonly observed with influenza, against which a vaccination of adolescents is not considered urgent or necessary.\n\n10.2. COVID-19 has a particularly low prevalence and severity in adolescents\n\nA review by Rajapakse et al. [88] states that, internationally, children and adolescents up to 18 years have accounted for only 1-2% of all confirmed clinical cases of COVID, and that severity was generally low. It has also been reported that children and adolescents only rarely transmit the disease to adults living in the same households; transmission in the opposite direction is far more common [89].\n\nWithin this age group, the most severe cases were observed among very young infants [90]. This is consistent with the lack in infants of cross-immunity to COVID-19, which in other age groups is conferred by preceding exposure to regular respiratory human coronaviruses (see Section 10.5). Among slightly older children, a peculiar multi-system inflammatory syndrome was observed in early 2020 [91]. Conceivably, these patients, too, were still lacking cross-immunity, although it has also been argued that the syndrome may in fact have a post-infectious immune pathogenesis [88].\n\nThe basis for the overall very low incidence of COVID in children has been elucidated in immunological studies reported by Loske et al. [92]. According to these authors, the mucous membranes of the airways of children exhibit stronger non-specific immunity than those of adults; for example, pattern recognition receptors are more strongly expressed in children. They also exhibit stronger CD8 T-cell responses.\n\nFigure 4 compares the mortality and the infection fatality rates between age groups. Panel A very clearly shows that adolescents have vanishingly small mortality; in fact, mortality in this age group is lower than in all others. As of July 2021, the German Robert Koch Institute reported a total of only 11 fatalities in those between 10 and 19 years of age—not even two in a million. To contemplate mass vaccinations with an experimental vaccine in the face of such low overall mortality is not justifiable.\n\nNumerous experienced physicians have collaborated on establishing effective treatment guidelines for clinically manifest COVID-19 [95]. Treatment options are available both for the early stage of the disease, when the emphasis is on inhibiting viral replication, and for the later stage, at which anti-inflammatory treatment is paramount. Two drugs that have been used successfully at the early stage are hydroxychloroquine and ivermectin. Both drugs have been, and continue to be, in use against a variety of other diseases. Ivermectin, for example, is considered safe enough to be used not only for treating manifest scabies—a parasite infection of the skin that is unpleasant but not severe, and which is quite amenable to local treatment—but even prophylactically in asymptomatic contacts of scabies-infected persons [96].\n\nIvermectin is also widely used in the treatment of tropical parasitic diseases such as onchocerciasis (river blindness), and for this reason it is on the WHO’s list of essential medicines. Yet, with COVID-19, the WHO sees fit to warn against the use of this very same well-known and safe drug outside of clinical trials [97]. This policy cannot be rationally justified, and it has quite appropriately been overridden by national or regional health authorities and ignored by individual physicians worldwide.\n\nThe availability of effective treatment voids the rationale for the emergency use of vaccines on any and all age groups, including also adolescents.\n\n10.4. Most people, particularly adolescents, are by now immune to SARS-CoV-2\n\nDue to the many inherent flaws and shortcomings of the diagnostic methods in common use, it is impossible to accurately determine the proportions of those who have already been infected with SARS-CoV-2 and those who have not. However, there are indications that the proportion of those who have been infected and recovered is high:\n• The incidence of multisystem inflammatory syndrome in children (see Section ) peaked in early to mid 2020, and then receded, with some slight delay after the initial wave of the COVID-19 respiratory disease itself .\n• Approximately 60% of randomly selected test persons from British Columbia have detectable antibodies against multiple SARS-CoV-2 proteins (personal communication by Stephen Pelech, University of British Columbia), indicating past infection with the virus—as opposed to vaccination, which would induce antibodies to only one (the spike) protein.\n\nPast COVID-19 infection has been found to protect very reliably from reinfection [99], and strong specific humoral and cellular immunity is detected in almost all recovered individuals, as well as in those who remained asymptomatic throughout the infection [100]. Thus, a large proportion of individuals in all age groups, including adolescents, already have specific, reliable immunity to COVID-19.\n\n10.5. Cross-immunity between SARS-CoV-2 and other coronaviruses\n\nCoronaviruses are a large family of enveloped, single-stranded RNA viruses. In humans and a variety of animal species, they cause respiratory tract infections that can range from mild to lethal in severity. However, the vast majority of coronavirus infections in humans cause mild illness (common cold), although in very young children, who lack immunity from previous exposure, respiratory disease can be more severe. The same clinical picture is also caused by viruses from several other families, predominantly rhinoviruses.\n\nThe virus that causes COVID-19 is known as Severe Acute Respiratory Syndrome Corona-Virus 2 (SARS-CoV-2). While it has been maintained that SARS-CoV-2 arose naturally in a species of bats [101], a thorough analysis of the genome sequences of SARS-CoV-2 and of related virus strains indicates unambiguously that the virus is in fact of artificial origin [102–105]. Initially decried as a “conspiracy theory,” this explanation has recently and belatedly been gaining acceptance in the mainstream [106].\n\nSARS-CoV-2-reactive T-cells [107–109] and antibodies [110,111] are widespread even in those who have not been exposed to this virus; this is mostly due to previous infections with other coronaviruses. Cross-reactive T-cells, which are likely important for defending against SARS-CoV-2 infection, are found even among those who have no detectable cross-reactive antibodies [112,113]. The protective effect of such cross-immunity has been documented [114–117].\n\nCross-immunity will be particularly effective in healthy adolescents and young adults. Individuals with specific immunity or sufficient cross-immunity cannot possibly derive any benefit from undergoing an experimental vaccination. Rather to the opposite, they are at increased risk of suffering adverse events from it [118].\n\n10.6. Asymptomatic transmission of COVID-19 is not real\n\nAn oft-cited rationale for vaccinating individuals who are not themselves at risk of severe disease is the need to induce “herd immunity:” the few who are at high risk should be protected by preventing the spread of the virus in the general population.\n\nA subtext of this rationale is the idea of “asymptomatic spread”—persons who have been infected but who show no signs of it other than a positive PCR test are assumed to transmit this infection to other susceptible individuals. If we accept the idea of such asymptomatic spread, then preventative mass vaccination might indeed appear as the only means of reliable protection of those at risk.\n\nIt has, however, been unambiguously determined that such asymptomatic transmission does not occur. In a large-scale study which involved almost 10 million Chinese residents, no new infections could be traced to persons that had tested positive for SARS-CoV-2 by PCR, but who did not exhibit any other signs of infection [119]. This agrees with several studies that compared PCR to virus isolation in cell culture among patients with acute COVID-19 disease. In all cases, growth of the virus in cell culture ceased as symptoms subsided, or very shortly thereafter, whereas PCR remained positive for weeks or months afterwards [120,121]. It was accordingly proposed to use cell culture rather than PCR to assess infectiousness and to determine the duration of isolation [121].\n\nThese findings indicate that restricting contact of persons at risk with those who show, or very recently showed, symptoms of acute respiratory disease would be effective and sufficient as a protective measure. Indiscriminate mass vaccinations of persons who are not themselves at risk of severe disease are therefore not required to achieve such protection.\n\nProfessor Sucharit Bhakdi, MD, is a Professor Emeritus of Medical Microbiology and Immunology and Former Chair, Institute of Medical Microbiology and Hygiene, Johannes Gutenberg University of Mainz. Dr. Bhakdi has conducted experimental research on numerous topics including the complement system, bacterial toxins, malaria, and atherosclerosis.\n\nMichael Palmer, MD, is an Associate Professor of biochemistry in the Department of Chemistry at the University of Waterloo, Ontario, Canada. He obtained a board certification in Medical Microbiology and Infectious Disease Epidemiology from the German province of Rhenania-Palatinate while working with Dr. Sucharit Bhakdi at the University of Mainz, Germany. His research has focused on bacterial toxins and lipopeptide antibiotics, and his teaching subjects include medical microbiology, metabolism, and pharmacology.\n\nWolfgang Wodarg, MD, is a specialist in pulmonary and bronchial internal medicine, hygiene and environmental medicine, epidemiology, and public health; Honorary Member of the Parliamentary Assembly of the Council of Europe and former Head of the Health Committee of the Parliamentary Assembly of the Council of Europe; former Member of the German federal parliament (the Bundestag); initiator and spokesman for the study commission ‘Ethics and Law in Modern Medicine;’ author and university lecturer.\n• Sections and have been adapted from a recent court expertise on the Moderna vaccine by Palmer2021d.\n• The vaccines produced by Pfizer, Moderna, and J & J incorporate two proline substitutions intended to stabilize the spike protein in a “pre-fusion” conformation. However, this does not prevent the proteolytic release of the S1 fragment, which appears to be responsible for much of the direct toxicity.\n• Palmer, M. et al. (2021) Expert evidence regarding Comirnaty (Pfizer) COVID-19 mRNA Vaccine for children.\n• Palmer, M. and Bhakdi, S. (2021) Expert statement regarding the use of Moderna COVID-19-mRNA-Vaccine in children.\n• Anonymous, (2021) FDA Briefing Document: Janssen Ad26.COV2.S Vaccine for the Prevention of COVID-19.\n• Anonymous, (2015) Scientific principles for regulatory risk evaluation on finding an adventitious agent in a marketed vaccine, Annex 2, TRS No 993.\n• Petricciani, J. et al. (2014) Adventitious agents in viral vaccines: lessons learned from 4 case studies. Biologicals : journal of the International Association of Biological Standardization 42:223-36\n• Mercado, N.B. et al. (2020) Single-shot Ad26 vaccine protects against SARS-CoV-2 in rhesus macaques. Nature 586:583-588\n• van der Lubbe, J.E.M. et al. (2021) Ad26.COV2.S protects Syrian hamsters against G614 spike variant SARS-CoV-2 and does not enhance respiratory disease. NPJ vaccines 6:39\n• Tostanoski, L.H. et al. (2020) Ad26 vaccine protects against SARS-CoV-2 severe clinical disease in hamsters. Nat. Med. 26:1694-1700\n• Jager, L. and Ehrhardt, A. (2009) Persistence of high-capacity adenoviral vectors as replication-defective monomeric genomes in vitro and in murine liver. Hum. Gene Ther. 20:883-96\n• Letarov, A.V. et al. (2021) Free SARS-CoV-2 Spike Protein S1 Particles May Play a Role in the Pathogenesis of COVID-19 Infection. Biochemistry Mosc 86:257-261\n• Buonvino, S. and Melino, S. (2020) New Consensus pattern in Spike CoV-2: potential implications in coagulation process and cell-cell fusion. Cell death discovery 6:134\n• Lynch, J.P. and Kajon, A.E. (2016) Adenovirus: Epidemiology, Global Spread of Novel Serotypes, and Advances in Treatment and Prevention. Seminars in respiratory and critical care medicine 37:586-602\n• Ersching, J. et al. (2010) Neutralizing antibodies to human and simian adenoviruses in humans and New-World monkeys. Virology 407:1-6\n• Barouch, D.H. et al. (2011) International seroepidemiology of adenovirus serotypes 5, 26, 35, and 48 in pediatric and adult populations. Vaccine 29:5203-9\n• Mennechet, F.J.D. et al. (2019) A review of 65 years of human adenovirus seroprevalence. Expert review of vaccines 18:597-613\n• Fausther-Bovendo, H. and Kobinger, G.P. (2014) Pre-existing immunity against Ad vectors: humoral, cellular, and innate response, what’s important?. Hum Vaccin Immunother 10:2875-84\n• Lasaro, M.O. and Ertl, H.C.J. (2009) New insights on adenovirus as vaccine vectors. Mol. Ther. 17:1333-9\n• Appledorn, D.M. et al. (2008) Complex interactions with several arms of the complement system dictate innate and humoral immunity to adenoviral vectors. Gene Ther 15:1606-17\n• Raper, S.E. et al. (2003) Fatal systemic inflammatory response syndrome in a ornithine transcarbamylase deficient patient following adenoviral gene transfer. Mol. Genet. Metab. 80:148-58\n• Wilson, J.M. (2009) Lessons learned from the gene therapy trial for ornithine transcarbamylase deficiency. Mol. Genet. Metab. 96:151-7\n• Doerfler, W. (2021) Adenoviral Vector DNA- and SARS-CoV-2 mRNA-Based Covid-19 Vaccines: Possible Integration into the Human Genome – Are Adenoviral Genes Expressed in Vector-based Vaccines? Virus Res. 302:198466\n• Mitani, K. and Kubo, S. (2002) Adenovirus as an integrating vector. Curr. Gene Ther. 2:135-44\n• Moustafa, A. et al. (2017) The blood DNA virome in 8,000 humans. PLoS Pathog. 13:e1006292\n• Orend, G. et al. (1994) Selective sites of adenovirus (foreign) DNA integration into the hamster genome: changes in integration patterns. J. Virol. 68:187-94\n• Stephen, S.L. et al. (2010) Chromosomal integration of adenoviral vector DNA in vivo. J. Virol. 84:9987-94\n• Doerfler, W. et al. (1995) On the insertion of foreign DNA into mammalian genomes: mechanism and consequences. Gene 157:241-5\n• Endter, C. and Dobner, T. (2004) Cell transformation by human adenoviruses. Curr. Top. Microbiol. Immunol. 273:163-214\n• Staal, F.J.T. et al. (2008) Sola dosis facit venenum. Leukemia in gene therapy trials: a question of vectors, inserts and dosage?. Leukemia 22:1849-1852\n• Hacein-Bey-Abina, S. et al. (2008) Insertional oncogenesis in 4 patients after retrovirus-mediated gene therapy of SCID-X1. J. Clin. Invest. 118:3132-42\n• Morral, N. et al. (1999) Administration of helper-dependent adenoviral vectors and sequential delivery of different vector serotype for long-term liver-directed gene transfer in baboons. Proc. Natl. Acad. Sci. U. S. A. 96:12816-21\n• Tirado, S.M.C. and Yoon, K. (2003) Antibody-dependent enhancement of virus infection and disease. Viral immunology 16:69-86\n• Tseng, C. et al. (2012) Immunization with SARS coronavirus vaccines leads to pulmonary immunopathology on challenge with the SARS virus. PLoS One 7:e35421\n• Yong, C.Y. et al. (2019) Recent Advances in the Vaccine Development Against Middle East Respiratory Syndrome-Coronavirus. Front. Microbiol. 10:1781\n• Cloutier, M. et al. (2020) ADE and hyperinflammation in SARS-CoV2 infection- comparison with dengue hemorrhagic fever and feline infectious peritonitis. Cytokine 136:155256\n• Clay, C. et al. (2012) Primary severe acute respiratory syndrome coronavirus infection limits replication but not lung inflammation upon homologous rechallenge. J. Virol. 86:4234-44\n• Bolles, M. et al. (2011) A double-inactivated severe acute respiratory syndrome coronavirus vaccine provides incomplete protection in mice and induces increased eosinophilic proinflammatory pulmonary response upon challenge. J. Virol. 85:12201-15\n• Yasui, F. et al. (2008) Prior immunization with severe acute respiratory syndrome (SARS)-associated coronavirus (SARS-CoV) nucleocapsid protein causes severe pneumonia in mice infected with SARS-CoV. J. Immunol. 181:6337-48\n• Iwata-Yoshikawa, N. et al. (2014) Effects of Toll-like receptor stimulation on eosinophilic infiltration in lungs of BALB/c mice immunized with UV-inactivated severe acute respiratory syndrome-related coronavirus vaccine. J. Virol. 88:8597-614\n• Honda-Okubo, Y. et al. (2015) Severe acute respiratory syndrome-associated coronavirus vaccines formulated with delta inulin adjuvants provide enhanced protection while ameliorating lung eosinophilic immunopathology. J. Virol. 89:2995-3007\n• Czub, M. et al. (2005) Evaluation of modified vaccinia virus Ankara based recombinant SARS vaccine in ferrets. Vaccine 23:2273-9\n• Tetro, J.A. (2020) Is COVID-19 receiving ADE from other coronaviruses?. Microbes and infection 22:72-73\n• Ogata, A.F. et al. (2020) Ultra-Sensitive Serial Profiling of SARS-CoV-2 Antigens and Antibodies in Plasma to Understand Disease Progression in COVID-19 Patients with Severe Disease. Clin. Chem. 66:1562-1572\n• Grobbelaar, L.M. et al. (2021) SARS-CoV-2 spike protein S1 induces fibrin(ogen) resistant to fibrinolysis: Implications for microclot formation in COVID-19. (Unknown journal) (preprint)\n• Buzhdygan, T.P. et al. (2020) The SARS-CoV-2 spike protein alters barrier function in 2D static and 3D microfluidic in-vitro models of the human blood-brain barrier. Neurobiol Dis 146:105131\n• Raghavan, S. et al. (2021) SARS-CoV-2 Spike Protein Induces Degradation of Junctional Proteins That Maintain Endothelial Barrier Integrity. Frontiers Cardiovasc Med 8 (preprint)\n• Amraie, R. et al. (2020) CD209L/L-SIGN and CD209/DC-SIGN act as receptors for SARS-CoV-2 and are differentially expressed in lung and kidney epithelial and endothelial cells. bioRxiv (preprint)\n• Siripanthong, B. et al. (2020) Recognizing COVID-19-related myocarditis: The possible pathophysiology and proposed guideline for diagnosis and management. Heart rhythm 17:1463-1471\n• Ogata, A.F. et al. (2021) Circulating SARS-CoV-2 Vaccine Antigen Detected in the Plasma of mRNA-1273 Vaccine Recipients. Clin. Infect. Dis. (preprint)\n• Lafont, A. et al. (1998) Thrombus generation after adenovirus-mediated gene transfer into atherosclerotic arteries. Hum. Gene Ther. 9:2795-800\n• Wolins, N. et al. (2003) Intravenous administration of replication-incompetent adenovirus to rhesus monkeys induces thrombocytopenia by increasing in vivo platelet clearance. Br. J. Haematol. 123:903-5\n• Schnell, M.A. et al. (2001) Activation of innate immunity in nonhuman primates following intraportal administration of adenoviral vectors. Mol. Ther. 3:708-22\n• Cichon, G. et al. (1999) Intravenous administration of recombinant adenoviruses causes thrombocytopenia, anemia and erythroblastosis in rabbits. J Gene Med 1:360-71\n• Sung, M.W. et al. (2001) Intratumoral adenovirus-mediated suicide gene transfer for hepatic metastases from colorectal adenocarcinoma: results of a phase I clinical trial. Mol. Ther. 4:182-91\n• Li, J. et al. (2009) A phase I trial of intratumoral administration of recombinant oncolytic adenovirus overexpressing HSP70 in advanced solid tumor patients. Gene Ther 16:376-82\n• Shimony, N. et al. (2009) Analysis of adenoviral attachment to human platelets. Virology journal 6:25\n• Raddi, N. et al. (2016) Pseudotyping Serotype 5 Adenovirus with the Fiber from Other Serotypes Uncovers a Key Role of the Fiber Protein in Adenovirus 5-Induced Thrombocytopenia. Hum. Gene Ther. 27:193-201\n• Othman, M. et al. (2007) Adenovirus-induced thrombocytopenia: the role of von Willebrand factor and P-selectin in mediating accelerated platelet clearance. Blood 109:2832-9\n• Chand, D.H. et al. (2021) Thrombotic Microangiopathy Following Onasemnogene Abeparvovec for Spinal Muscular Atrophy: A Case Series. J. Pediatr. 231:265-268\n• Garg, R.K. and Paliwal, V.K. (2021) Spectrum of neurological complications following COVID-19 vaccination. Neurol. Sci. (preprint)\n• Ismail, I.I. and Salama, S. (2021) A systematic review of cases of CNS demyelination following COVID-19 vaccination. J. Neuroimmunol. 362:577765\n• Woo, E.J. et al. (2021) Association of Receipt of the Ad26.COV2.S COVID-19 Vaccine With Presumptive Guillain-Barré Syndrome, February-July 2021. JAMA 326:1606-1613\n• Brown, C.M. et al. (2021) Outbreak of SARS-CoV-2 Infections, Including COVID-19 Vaccine Breakthrough Infections, Associated with Large Public Gatherings—Barnstable County, Massachusetts, July 2021. MMWR. Morbidity and mortality weekly report 70:1059-1062\n• Sankary, K.M. et al. (2021) Breakthrough cases of COVID-19 in vaccinated United States Veterans with spinal cord injuries and disorders. Spinal cord (preprint)\n• Subramanian, S.V. and Kumar, A. (2021) Increases in COVID-19 are unrelated to levels of vaccination across 68 countries and 2947 counties in the United States. Eur. J. Epidemiol. (preprint)\n• Shilhavy, B. (2021) 24,526 Deaths and 2,317,495 Injuries Following COVID Shots Reported in European Union’s Database of Adverse Drug Reactions.\n• Pueschel, K. (2020) Forensic Pathologist: No One in Hamburg Has Died of COVID-19 Alone.\n• Biswas, S. et al. (2021) Blood clots in COVID-19 patients: Simplifying the curious mystery.\n\n Med. Hypotheses 146:110371\n• Shimabukuro, T.T. et al. (2021) Preliminary Findings of mRNA Covid-19 Vaccine Safety in Pregnant Persons. N. Engl. J. Med. 384:2273-2282\n• Ioannidis, J.P.A. (2021) Reconciling estimates of global spread and infection fatality rates of COVID‐19: An overview of systematic evaluations. Eur. J. Clin. Invest. 5:e133554\n• Rajapakse, N. and Dixit, D. (2021) Human and novel coronavirus infections in children: a review. Paediatrics and international child health 41:36-55\n• Galow, L. et al. (2021) Lower household transmission rates of SARS-CoV-2 from children compared to adults. J. Infect. 83:e34-e36\n• Tsabouri, S. et al. (2021) Risk Factors for Severity in Children with Coronavirus Disease 2019: A Comprehensive Literature Review. Pediatric clinics of North America 68:321-338\n• Abrams, J.Y. et al. (2020) Multisystem Inflammatory Syndrome in Children Associated with Severe Acute Respiratory Syndrome Coronavirus 2: A Systematic Review. J. Pediatr. 226:45-54\n• Loske, J. et al. (2021) Pre-activated antiviral innate immunity in the upper airways controls early SARS-CoV-2 infection in children. Nature biotechnology (preprint)\n• Axfors, C. and Ioannidis, J.P. (2021) Infection fatality rate of COVID-19 in community-dwelling populations with emphasis on the elderly: An overview. medRxiv (preprint)\n• McCullough, P.A. et al. (2020) Multifaceted highly targeted sequential multidrug treatment of early ambulatory high-risk SARS-CoV-2 infection (COVID-19). Reviews in cardiovascular medicine 21:517-530\n• Bernigaud, C. et al. (2021) Oral ivermectin for a scabies outbreak in a long-term care facility: potential value in preventing COVID-19 and associated mortality. Br. J. Dermatol. 184:1207-1209\n• Anonymous, (2021) WHO advises that ivermectin only be used to treat COVID-19 within clinical trials.\n• Flood, J. et al. (2021) Paediatric multisystem inflammatory syndrome temporally associated with SARS-CoV-2 (PIMS-TS): Prospective, national surveillance, United Kingdom and Ireland, 2020. The Lancet regional health. Europe 3:100075\n• Shrestha, N.K. et al. (2021) Necessity of COVID-19 vaccination in previously infected individuals. medRxiv (preprint)\n• Nielsen, S.S. et al. (2021) SARS-CoV-2 elicits robust adaptive immune responses regardless of disease severity. EBioMedicine 68:103410\n• Andersen, K.G. et al. (2020) The proximal origin of SARS-CoV-2. Nat. Med. 26:450-452\n• Sørensen, B. et al. (2020) Biovacc-19: A Candidate Vaccine for Covid-19 (SARS-CoV-2) Developed from Analysis of its General Method of Action for Infectivity. {QRB} Discovery 1 (preprint)\n• Sørensen, B. et al. (2020) The evidence which suggests that this is no naturally evolved virus. Preprint (preprint)\n• Yan, L. et al. (2020) Unusual Features of the SARS-CoV-2 Genome Suggesting Sophisticated Laboratory Modification Rather Than Natural Evolution and Delineation of Its Probable Synthetic Route. Preprint (preprint)\n• Yan, L. et al. (2020) SARS-CoV-2 Is an Unrestricted Bioweapon: A Truth Revealed through Uncovering a Large-Scale, Organized Scientific Fraud. Preprint (preprint)\n• van Helden, J. et al. (2021) An appeal for an objective, open, and transparent scientific debate about the origin of SARS-CoV-2. Lancet (preprint)\n• Grifoni, A. et al. (2020) Targets of T Cell Responses to SARS-CoV-2 Coronavirus in Humans with COVID-19 Disease and Unexposed Individuals. Cell 181:1489-1501.e15\n• Mateus, J. et al. (2020) Selective and cross-reactive SARS-CoV-2 T cell epitopes in unexposed humans. Science 370:89-94\n• Majdoubi, A. et al. (2021) A majority of uninfected adults show preexisting antibody reactivity against SARS-CoV-2. JCI insight 6 (preprint)\n• Simula, E.R. et al. (2020) HCoV-NL63 and SARS-CoV-2 Share Recognized Epitopes by the Humoral Response in Sera of People Collected Pre- and during CoV-2 Pandemic. Microorganisms 8:1993\n• Braun, J. et al. (2020) Presence of SARS-CoV-2-reactive T cells in COVID-19 patients and healthy donors. medRxiv (preprint)\n• Schmidt, K.G. et al. (2021) SARS-CoV-2-Seronegative Subjects Target CTL Epitopes in the SARS-CoV-2 Nucleoprotein Cross-Reactive to Common Cold Coronaviruses. Front. Immunol. 12:627568\n• Dugas, M. et al. (2021) Less severe course of COVID-19 is associated with elevated levels of antibodies against seasonal human coronaviruses OC43 and HKU1 (HCoV OC43, HCoV HKU1). Int J Infect Dis 105:304-306\n• Dugas, M. et al. (2021) Lack of antibodies against seasonal coronavirus OC43 nucleocapsid protein identifies patients at risk of critical COVID-19. J Clin Virol 139:104847\n• Yamaguchi, T. et al. (2021) Immunity against seasonal human coronavirus OC43 mitigates fatal deterioration of COVID-19. Int J Infect Dis (preprint)\n• Mathioudakis, A.G. et al. (2021) Self-Reported Real-World Safety and Reactogenicity of COVID-19 Vaccines: A Vaccine Recipient Survey. Life 11 (preprint)\n• Cao, S. et al. (2020) Post-lockdown SARS-CoV-2 nucleic acid screening in nearly ten million residents of Wuhan, China. Nat. Commun. 11:5917\n• Wölfel, R. et al. (2020) Virological assessment of hospitalized patients with COVID-2019. Nature 581:465-469\n• Basile, K. et al. (2020) Cell-based culture of SARS-CoV-2 informs infectivity and safe de-isolation assessments during COVID-19. Clin. Infect. Dis. (preprint)", "opengraph": {"type": "article", "title": "Expert Report on the Johnson & Johnson COVID-19 Vaccine", "description": "This expert statement was submitted by a consortium of lawyers to the South African constitutional court in conjunction with a lawsuit that challenges the government’s COVID measures.Permission is hereby granted to freely share and distribute this document in unchanged form.", "url": "https://doctors4covidethics.org/expert-report-on-the-johnson-johnson-covid-19-vaccine/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-02-20T23:43:56+01:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/02/genome-map-750.png", "image:width": "750", "image:height": "131", "article:published_time": "2022-02-09T01:49:54+01:00", "article:modified_time": "2022-02-20T23:43:56+01:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "#ref1", "#ref2", "https://doctors4covidethics.org/wp-content/uploads/2022/02/janssen-published.pdf", "#ref3", "#ref4", "#ref5", "#ref3", "#sec-clotting-autoimmune", "#sec-clotting-spike", "https://doctors4covidethics.org/wp-content/uploads/2022/02/genome-map-ae9f5.png", "#ref3", "#ref3", "#ref3", "#ref3", "#ref6", "#ref7", "#ref3", "#ref3", "#ref3", "#ref3", "#ref3", "#ref8", "#ref9", "#ref10", "#ref9", "#ref11", "#ref3", "#sec-clotting-spike", "#ref12", "#ref3", "#sec-clotting", "#sec-te-tp-dic", "#ref3", "#ref13", "#ref14", "#ref14", "#ref15", "#sec-construct", "#ref3", "#sec-replication-competent", "#ref16", "#ref17", "#ref19", "#ref20", "#ref3", "#ref3", "#ref3", "#ref21", "#ref22", "#ref23", "#ref24", "#ref25", "https://doctors4covidethics.org/wp-content/uploads/2022/02/genome-map-ae9f5.png", "#ref26", "#sec-toxicology", "#ref27", "#sec-distribution", "#ref28", "#ref29", "#ref32", "#ref29", "#ref31", "#ref33", "#ref35", "#ref36", "#ref37", "#ref32", "#ref31", "#sec-ltfu-needed", "#ref38", "#ref13", "#sec-real-world", "#ref39", "#ref40", "#ref41", "#ref42", "#ref43", "#ref41", "#ref44", "#ref45", "#ref46", "#ref47", "#ref45", "#ref48", "#ref49", "#ref48", "#ref47", "#ref50", "#ref51", "#ref3", "#sec-real-world", "#sec-safety-record", "#footnotetext1", "#ref52", "#ref14", "#ref53", "#ref54", "#ref55", "#ref56", "#ref57", "#footnotetext2", "#ref52", "#ref58", "#sec-safety-record", "#ref59", "#ref60", "#ref61", "#ref62", "#ref63", "#ref64", "#ref65", "#ref66", "#ref67", "#ref22", "#ref68", "#ref3", "#sec-safety-record", "#ref69", "#ref70", "#ref71", "#ref3", "#ref3", "#ref3", "#ref3", "#ref3", "#sec-diminished-booster-effect", "#ref3", "#sec-ignored-open-questions", "#sec-real-world", "#sec-safety-record", "#ref72", "#tbl-brown2021a", "#sec-ade", "#ref72", "#ref73", "#ref74", "#ref75", "https://doctors4covidethics.org/wp-content/uploads/2022/02/subramanian-82b5d.png", "#tbl-eudra-totals", "#tbl-vaers-events-deaths", "#ref77", "#ref78", "#ref79", "#ref15", "#ref81", "#ref82", "#ref57", "https://doctors4covidethics.org/wp-content/uploads/2022/02/openvaers-heart-046e2.png", "#ref84", "#ref85", "#ref86", "#ref87", "#ref88", "#ref89", "#ref90", "#sec-cross-immunity", "#ref91", "#ref88", "#ref92", "https://doctors4covidethics.org/wp-content/uploads/2022/02/ifr-mortality-7b24f.png", "#ref95", "#ref96", "#ref97", "#sec-adolescents-prevalence", "#ref98", "#ref99", "#ref100", "#ref101", "#ref102", "#ref105", "#ref106", "#ref107", "#ref109", "#ref110", "#ref111", "#ref112", "#ref113", "#ref114", "#ref117", "#ref118", "#ref119", "#ref120", "#ref121", "#ref121", "#sec-clotting-spike", "#sec-clotting-autoimmune", "https://doctors4covidethics.org/expert-evidence-regarding-comirnaty-covid-19-mrna-vaccine-for-children/", "https://doctors4covidethics.org/expert-statement-regarding-the-use-of-moderna-covid-19-mrna-vaccine-in-children/", "https://www.ema.europa.eu/en/documents/assessment-report/covid-19-vaccine-janssen-epar-public-assessment-report_en.pdf", "https://www.fda.gov/media/146217/download", "https://www.fda.gov/vaccines-blood-biologics/cellular-gene-therapy-products/what-gene-therapy", "https://cdn.who.int/media/docs/default-source/biologicals/cell-substrates/annex2__adventious_agent_in_marketed_vaccine_eng.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/?term=25135887", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34580303", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32731257", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33741993", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32884153", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19364285", "https://www.fda.gov/media/113768/download", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33838638", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33262894", "https://www.ncbi.nlm.nih.gov/pubmed/?term=27486739", "https://www.ncbi.nlm.nih.gov/pubmed/?term=20797754", "https://www.ncbi.nlm.nih.gov/pubmed/?term=21619905", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31132024", "https://www.ncbi.nlm.nih.gov/pubmed/?term=25483662", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19513019", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18615115", "https://www.ncbi.nlm.nih.gov/pubmed/?term=10524611", "https://www.ncbi.nlm.nih.gov/pubmed/?term=14567964", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19211285", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34399368", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31784892", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34087261", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12109211", "https://www.ncbi.nlm.nih.gov/pubmed/?term=28328962", "https://www.ncbi.nlm.nih.gov/pubmed/?term=8254728", "https://www.ncbi.nlm.nih.gov/pubmed/?term=20686029", "https://www.ncbi.nlm.nih.gov/pubmed/?term=7607499", "https://www.ncbi.nlm.nih.gov/pubmed/?term=14674602", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19429476", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18769449", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18688285", "https://www.ncbi.nlm.nih.gov/pubmed/?term=10536005", "https://www.ncbi.nlm.nih.gov/pubmed/?term=12725690", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32506725", "https://www.ncbi.nlm.nih.gov/pubmed/?term=22536382", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31428074", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32866898", "https://www.ncbi.nlm.nih.gov/pubmed/?term=22345460", "https://www.ncbi.nlm.nih.gov/pubmed/?term=21937658", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18941225", "https://www.ncbi.nlm.nih.gov/pubmed/?term=24850731", "https://www.ncbi.nlm.nih.gov/pubmed/?term=25520500", "https://www.ncbi.nlm.nih.gov/pubmed/?term=15755610", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32298458", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32092539", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32897389", "http://dx.doi.org/10.1101/2021.03.05.21252960", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33053430", "http://dx.doi.org/10.3389/fcvm.2021.687783", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32607506", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32387246", "http://dx.doi.org/10.1093/cid/ciab465", "https://www.ncbi.nlm.nih.gov/pubmed/?term=9874277", "https://www.ncbi.nlm.nih.gov/pubmed/?term=14632782", "https://www.ncbi.nlm.nih.gov/pubmed/?term=11356076", "https://www.ncbi.nlm.nih.gov/pubmed/?term=10738553", "https://www.ncbi.nlm.nih.gov/pubmed/?term=11545608", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19092859", "https://www.ncbi.nlm.nih.gov/pubmed/?term=19222836", "https://www.ncbi.nlm.nih.gov/pubmed/?term=26757054", "https://www.ncbi.nlm.nih.gov/pubmed/?term=17148587", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33259859", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34719776", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34839149", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34617967", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34320281", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34404912", "http://dx.doi.org/10.1007/s10654-021-00808-7", "https://healthimpactnews.com/2021/24526-deaths-2317495-injuries-following-covid-shots-reported-in-european-unions-database-of-adverse-drug-reactions/", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32782048", "https://www.epicentro.iss.it/coronavirus/bollettino/Report-COVID-2019_17_marzo-v2.pdf", "https://gatesofvienna.net/2020/05/forensic-pathologist-no-one-in-hamburg-has-died-of-covid-19-alone/", "https://www.openvaers.com/", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33223324", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33248385", "https://www.openvaers.com/covid-data", "http://dx.doi.org/10.1056/NEJMoa2104983", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34496171", "https://www.who.int/bulletin/online_first/BLT.20.265892.pdf", "http://dx.doi.org/10.1111/eci.13554", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32584199", "http://dx.doi.org/10.1016/j.jinf.2021.04.022", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33228941", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32768466", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34408314", "https://www.bpb.de/nachschlagen/zahlen-und-fakten/soziale-situation-in-deutschland/61538/altersgruppen", "http://dx.doi.org/10.1101/2021.07.08.21260210", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33387997", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33454964", "https://www.who.int/news-room/feature-stories/detail/who-advises-that-ivermectin-only-be-used-to-treat-covid-19-within-clinical-trials", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34027512", "http://dx.doi.org/10.1101/2021.06.01.21258176", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34098342", "http://dx.doi.org/10.1038/s41591-020-0820-9", "http://dx.doi.org/10.1017/qrd.2020.8", "https://www.minervanett.no/files/2020/07/13/TheEvidenceNoNaturalEvol.pdf", "https://doi.org/10.5281/zenodo.4028830", "https://doi.org/10.5281/zenodo.4073131", "http://dx.doi.org/10.1016/S0140-6736(21)02019-5", "http://dx.doi.org/10.1016/j.cell.2020.05.015", "http://dx.doi.org/10.1126/science.abd3871", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32999467", "http://dx.doi.org/10.1172/jci.insight.146316", "http://dx.doi.org/10.3390/microorganisms8121993", "http://dx.doi.org/10.1101/2020.04.17.20061440", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33995351", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33636357", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33965698", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34273512", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32758887", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33803014", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33219229", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32235945", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33098412"], "authors": [], "publish_date": "2022-02-09T01:49:54+01:00"}