{"result_id": "099034", "URL": "https://doctors4covidethics.org/the-watson-et-al-modeling-study-did-covid-vaccinations-really-prevent-14-million-deaths/", "timestamp": "2023-04-25 14:59:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/the-watson-et-al-modeling-study-did-covid-vaccinations-really-prevent-14-million-deaths/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "The Watson et al. “modeling study”: did “COVID vaccinations” really prevent 14 million deaths?", "cleaned_text": "On June 23, 2022, a “Mathematical Modeling Study” was published in the medical journal THE LANCET Infectious Diseases [1], which purported to show that “COVID vaccinations” have “substantially altered” the course of the pandemic and “prevented 14.4 million … deaths from COVID-19 … during the first year of COVID-19 vaccination.”\n\nWhenever a drug achieves the impossible, it is worth examining the underlying data a little more closely and comparing it to reality.\n\n1. What requirements must normally be met for the approval of a drug or vaccine?\n\nNormally, the benefit provided by a new drug must be demonstrated in extensive clinical studies (“phase 3 trials”) in order for this drug to be approved for the market; this involves a thorough review of the trial documentation by the authorities. For full approval, a pharmaceutical company usually has to submit all of the following:\n• phase 1 and phase 2 studies in humans, and\n• 12 months worth of phase 3 trial results that prove beyond doubt the efficacy and the safety of a candidate drug.\n\nThe COVID “vaccines” were given “temporary” or “conditional” approval worldwide based on very much shortened phase 3 trials, which lasted only 2 months instead of 12 months [2,3], and on insufficient or missing animal studies, i.e. they received only an “emergency approval.”\n\nThe primary clinical endpoints used in the phase 3 studies were not clinically and socially relevant, as predominantly mild, minor events such as headache, cough or fever were counted as “COVID disease cases”, just as long as the RT-PCR test for the coronavirus was positive. An effect of the “vaccinations” on “severe COVID illnesses”, which among other things required hospitalization, was only analyzed secondarily [4,5]. Thus, in order to obtain approval, the manufacturers were not formally required to prove that the “vaccinations” reduce severe courses of disease to a relevant extent.\n\nThe fact that the regulatory authorities worldwide accepted this flawed study design for granting approval indicates that they were not able to act independently. To date, the clinical trials have not demonstrated any relevant benefit [6], pivotal documents overall were demonstrably completely inadequate, and moreover the data from the phase 3 studies were manipulated [7–9].\n\nOnce a drug is approved, the manufacturer is required to further investigate its efficacy and safety under real-world conditions. The data generated in this way are subsequently submitted to the regulatory authorities, and the results are presented to physicians as “real world evidence” to convince them that these data, ideally, support the findings from the clinical trials and thus to encourage them to use this drug on their patients.\n\n2. What does the reality of “COVID vaccines” show?\n\nThe internationally available “Real World Evidence” data of the COVID “vaccines” confirm what the registration studies had already indicated: The “vaccines” are not associated with any relevant benefit, but on the contrary with a negative effect.\n\nA robust analysis by Kyle Beattie, who examined publicly published COVID data from Our World in Data, shows that for 145 countries, “vaccine” use correlates positively with the number of “COVID cases” and, far more worryingly, with the number of “COVID deaths” [11]. The countries which appear to fare the worst after introduction of the “vaccines” are those where few “COVID deaths” had been reported for 2020 (e.g., Thailand). Based on Beattie’s results, it must be assumed that almost all countries experienced more infections and deaths than if “vaccination” had not been given. Beattie based his model for calculating the hypothetical morbidity and mortality that would have occurred without “vaccination” on the data from four African countries which had very low vaccination rates throughout, and which therefore could be used rather like a “control group.”\n\nBeattie’s conclusions are corroborated by other observations. As of early August 2022, official figures report 6.4 million deaths that have occurred with or from COVID-19. A look at the progression curve of “COVID deaths” recorded worldwide does not reveal any favorable effect on “COVID deaths” concomitant with the roll-out of the vaccines in late 2020/early 2021 (Figure 1). Overall, “COVID deaths” actually increased after the introduction of the “vaccination” and stagnated at a high level throughout 2021. With an effective vaccine, of course, a clearly discernible drop in the mortality curve would have been expected after the onset of a worldwide vaccination campaign.\n\nIsrael is an instructive example, because it achieved high vaccination rates earlier than most other countries. According to EuroMomo, Israel experienced its highest excess mortality ever since the beginning of the “Corona crisis” in the first quarter of 2022, i.e. at a time when the majority of the population was supposedly maximally protected by the “mRNA vaccines”—even though during this period only the Omicron variant was endemic, which is about ten times less dangerous than the original Wuhan strain and the Delta variant [12]. Increases in excess mortality were correlated in time with vaccination drives (Figure 2). A similar correlation in time is also evident between vaccinations and deaths specifically attributed to COVID-19 (data not shown).\n\nIn the USA, the introduction of COVID vaccinations was followed not by a leveling off but by a sustained increase in all-cause mortality (Figure 3). Australia, too, is experiencing a similar phenomenon: After the Australian Department of Health recommended a second “booster dose” of COVID vaccination to all persons aged 30 years and older in July 2022, the country is experiencing a peak in “COVID deaths” of unprecedented proportions, even though the harmless Omicron variant remains predominant (Figure 4).\n\n3. On what data do Watson et al. base their conclusion that COVID “vaccination” has prevented 14 million deaths?\n\nThe study in question is a mathematical modeling exercise which, like any exercise, depends on the underlying data. A closer look at these data raises serious questions—pertaining not only to the scientific value of this publication, but also to its credibility.\n\nIn the “modeling study” by Watson et al., hypothetical data serve as the baseline, not real observations:\n\nThe authors thus used previously published models to calculate their projections of the hypothetical COVID mortality that would have occurred without vaccination. The problem with these published models is that they date from the early days of the “pandemic” and are based on data and assumptions which were out of date by 2021 at the latest, and which are now demonstrably wrong. In the meantime, it has become clear that SARS-CoV-2 is neither exceptionally dangerous for the general population nor a threat to the health care system. Already at the beginning of the “pandemic”, i.e. at a time when the original Wuhan strain of the virus was prevalent, the infection fatality rate (IFR) was 0.15% overall, less than 0.05% for those under 70 years of age, and 0.00% for children [16]. The IFR of the currently circulating Omicron variant is about 10 times lower than that of the Wuhan strain and the Delta variant [12]. All assumptions on which millions of “COVID deaths” have been estimated worldwide are therefore fundamentally incorrect and obsolete.\n\nIt is now known that “COVID deaths” have been massively overcounted worldwide, because both “confirmed cases” and “probable cases” have been lumped together in those case statistics [17]. “Confirmed cases” are counted based on matching (yet non-specific) clinical symptoms together with a positive RT-PCR test result, whereas with “probable” cases no corroborating PCR test result is available. The practice of counting “probable COVID cases” based only on generic symptoms of an upper respiratory tract infection makes no sense from a medical point of view; it can serve only to inflate the case count in an unscientific manner. The Corman-Drosten RT-PCR test protocol for the detection of SARS-CoV-2 [18] is scientifically more than deficient: the test based on it is not validated, not standardized, hypersensitive, and not very specific; its specificity is 98.6% and 92.4% in the absence and presence of other beta-coronaviruses, respectively, and rates of false positive results consequently are 1.4% and 7.6 [19,20].\n\nIn only 5% of the “COVID deaths” recorded in the USA was COVID-19 listed as the sole cause of death on the death certificate, and thus an illness due to SARS-CoV-2 was causally responsible for the death [21]. A study from Italy showed that even only 0.8% of the “COVID deaths” did not have a concomitant disease [22]. Instead of taking these facts into account and correcting the case numbers downwards accordingly, Watson et al. even argue that a massive under-reporting of “COVID deaths” must be assumed.\n\nIf the enormously high COVID mortality predicted by the modeling were true, then this should have invariably been reflected in a relevant increase in excess mortality during the winter months when the “corona pandemic” was rampant, but prior to the introduction of vaccination.\n\n5. No relevant excess mortality in the 2020 pandemic winter\n\nThis, however, is demonstrably not the case: no relevant long-lasting increase in deaths from any cause (“all-cause mortality”) was observed for the winter of 2020. Rancourt has examined the correlation in time between the WHO’s declaration of the “pandemic” and all-cause mortality in various jurisdictions [23]. Immediately after the declaration, there occurred a sharp peak in all-cause mortality in some jurisdictions, but not in others; this discrepancy is illustrated in Figure 5 for New York City and Texas.\n\nCommon sense and historic precedents suggest that the spread of a deadly virus would not be stopped by international or state borders. Furthermore, if the virus had indeed been both deadly and truly novel, the wave of deaths in New York should not have subsided within such a short period of time as is apparent from Figure 5. The peak may instead signify that infected persons were transferred to New York City from other regions, were (mis)treated there, and died.\n\nThe mortality curve for the state of Texas shows no abnormalities for the winter of 2020, neither before nor after the WHO’s declaration of the pandemic. The same also applies to other jurisdictions such as Canada (Figure 6) and Europe. Thus, it is plain that in Winter 2020 there was no pattern of excess mortality that would reflect an usually severe and deadly virus pandemic.\n\n6. False assumptions serve as the basis for the calculations\n\nThe data used in the Watson et al. “modeling study” were based on hypotheses related to the Corona pandemic that have since been shown to be clearly wrong, namely:\n• that there is no preexisting immunity and that the pandemic will affect everyone;\n• that its effect can only be mitigated by political measures.\n\nAd 1: Serological investigations have shown that SARS-CoV-2 was endemic in Italy as early as September 2019 [25] and in France as early as November 2019 [26], which is thus likely true for Europe in general. However, at this time, no clustered disease activity was observed clinically. Antibodies to SARS-CoV-2 were found in up to 53% of asymptomatic individuals, whose serum samples had been collected in the pre-pandemic phase in Italy. In the meantime, more than 90 studies prove that a past infection with SARS-CoV-2 protects better against a recurrence of the disease than the vaccines [27]. While reinfections with new variants are possible, they are not severe [28]. These crucial facts are completely ignored by the authors. On the contrary, they speculate that possibly even more deaths than the estimated 14 million have been prevented by the “vaccination”, because in their calculations they may have underestimated the effect of the immune system’s failure to recognize new variants, which according to them would further increase the risk of a new infection.\n\nAd 2: Over 400 studies show that non-pharmaceutical interventions such as lockdowns or school closures to prevent a pandemic are associated with no benefit, only harm [29]. Sweden, as one of the countries where hardly any restrictions were applied, performed significantly better in terms of the number of “COVID deaths” than many other countries with strict lockdown measures (Figure 7).\n\n7. The claim of “vaccination success” is based on unscientific calculations\n\nWhile Kyle Beattie’s estimate of hypothetical COVID mortality without vaccination is based on real data, namely on observations from countries with very low vaccination rates [11], Watson et al. use completely unrealistic and demonstrably false figures for their calculations to supposedly prove the efficacy of the COVID “vaccines.” This leads them to estimate an excessively high mortality which allegedly would have occurred without “vaccination.” From these inflated hypothetical death counts, they then subtract the officially reported deaths to obtain the “success of vaccination” (Figure 8). It is difficult to conceive of a more unscientific and misleading methodology than this one.\n\nIf a publication raises as many questions as this one, then it is imperative to find out how it was financed. According to the declaration in the published paper itself, this “modeling study” was funded by, among others, the very institutions that earn millions from the “vaccinations”, thanks to an impressive return on investment ratio of 20:1 [31].\n\nThe hypothesis that the COVID “vaccinations” prevented 14 million “COVID deaths” and thus significantly mitigated the severity of the “pandemic” is based on unrealistic figures and demonstrably false calculations. To date, the experimental “vaccines”, for which an integration into the human genome cannot be safely ruled out [32,33] and must even be considered likely [34], have not been able to prove a relevant benefit, neither in the clinical studies before their approval nor afterwards. Real world evidence shows that the “COVID vaccination” is associated with a negative effect overall and positively correlates with an increase in morbidity and mortality associated with SARS-CoV-2 infection, as well as in all-cause mortality. Overall, the “modeling study” by Watson et al. must be considered an unscientific and dishonest attempt to falsely cast the “vaccines” in a positive light. The serious conflicts of interest surrounding the study undermine not only the credibility of the publication itself, but also that of the medical journal which published it.\n\nWe are grateful to Prof. Harald Walach, who made an important contribution to this opinion with his blog article [35].\n• Global impact of the first year of COVID-19 vaccination: a mathematical modelling study . Lancet Infect. Dis. (preprint)\n• Safety and Efficacy of the BNT162b2 mRNA Covid-19 Vaccine . N. Engl. J. Med. 383:2603-2615\n• Efficacy and Safety of the mRNA-1273 SARS-CoV-2 Vaccine . N. Engl. J. Med. 384:403-416\n• A phase 1/2/3, placebo-controlled, randomized, observer-blind, dose-finding study to evaluate the safety, tolerability, immunogenicity, and efficacy of SARS-CoV-2 RNA vaccine candidates against Covid-19 in healthy individuals .\n• A Phase 3, Randomized, Stratified, Observer-Blind, Placebo-Controlled Study to Evaluate the Efficacy, Safety, and Immunogenicity of mRNA-1273 SARS-CoV-2 Vaccine in Adults Aged 18 Years and Older .\n• COVID-19 vaccine efficacy and effectiveness-the elephant (not) in the room . Lancet Microbe 2:e279-e280\n• Did Pfizer Perform Adequate Safety Testing for its Covid-19 mRNA Vaccine in Preclinical Studies? Evidence of Scientific and Regulatory Fraud .\n• Moderna’s Non-clinical Summary for Spikevax—Evidence of Scientific and Regulatory Fraud .\n• Worldwide Bayesian Causal Impact Analysis of Vaccine Administration on Deaths and Cases Associated with COVID-19: A Big Data Analysis of145 Countries . ResearchGate (preprint)\n• Reduction in the infection fatality rate of Omicron variant compared with previous variants in South Africa . Int. J. Infect. Dis. 120:146-149\n• COVID-Period Mass Vaccination Campaign and Public Health Disaster in the USA . ResearchGate (preprint)\n• Reconciling estimates of global spread and infection fatality rates of COVID‐19: An overview of systematic evaluations . Eur. J. Clin. Invest. 5:e133554\n• Detection of 2019 novel coronavirus (2019-nCoV) by real-time RT-PCR . Euro Surveill. 25 (preprint)\n• All-cause mortality during COVID-19: No plague and a likely signature of mass homicide by government response . (preprint)\n• Analysis of all-cause mortality by week in Canada 2010-2021, by province, age and sex: There was no COVID-19 pandemic, and there is strong evidence of response-caused deaths in the most elderly and in young males .\n• Unexpected detection of SARS-CoV-2 antibodies in the prepandemic period in Italy . Tumori 107:446-451\n• Evidence of early circulation of SARS-CoV-2 in France: findings from the population-based “CONSTANCES” cohort . Eur. J. Epidemiol. 36:219-222\n• 91 Scientific Studies prove Naturally Acquired Immunity provides better protection than the Covid-19 Vaccines .\n• Genomic characterization and epidemiology of an emerging SARS-CoV-2 variant in Delhi, India . Science 374:995-999\n• More Than 400 Studies on the Failure of Compulsory Covid Interventions (Lockdowns, Restrictions, Closures) .\n• Bill Gates: My `best investment’ turned $10 billion into $200 billion worth of economic benefit .\n• Reverse-transcribed SARS-CoV-2 RNA can integrate into the genome of cultured human cells and can be expressed in patient-derived tissues . Proc. Natl. Acad. Sci. U. S. A. 118 (preprint)\n• mRNA vaccines: Why is the biology of retroposition ignored? . Preprint (preprint)\n• Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line . Curr. Issues Mol. Biol. 44:1115-1126\n• Ohne Impfung 18 Millionen mehr Tote weltweit? – Wirklich? [Without vaccination 18 million more deaths worldwide? Really?] .", "opengraph": {"type": "article", "title": "The Watson et al. “modeling study”: did “COVID vaccinations” really prevent 14 million deaths?", "description": "The hypothesis (published in the medical journal THE LANCET Infectious Diseases on June 23, 2022) that the COVID “vaccinations” prevented 14 million “COVID deaths” and thus significantly mitigated the severity of the “pandemic” is based on unrealistic figures and demonstrably false calculations. ", "url": "https://doctors4covidethics.org/the-watson-et-al-modeling-study-did-covid-vaccinations-really-prevent-14-million-deaths/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-08-29T21:27:42+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/08/world-death_featured_750.png", "image:width": "750", "image:height": "303", "article:published_time": "2022-08-29T21:26:40+02:00", "article:modified_time": "2022-08-29T21:27:42+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "#ref1", "#ref2", "#ref3", "#ref4", "#ref5", "#ref6", "#ref7", "#ref9", "#ref11", "#fig-world-deaths", "#ref12", "#fig-euromomo", "#fig-rancourt-acm-us", "#fig-australia-deaths", "#ref16", "#ref12", "#ref17", "#ref18", "#ref19", "#ref20", "#ref21", "#ref22", "#ref23", "#fig-texas-nyc", "#fig-texas-nyc", "#fig-canada-acm", "#ref25", "#ref26", "#ref27", "#ref28", "#ref29", "#fig-cumulative-deaths", "#ref11", "#fig-watson-graph", "#ref31", "#ref32", "#ref33", "#ref34", "#ref35", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35753318", "http://dx.doi.org/10.1056/NEJMoa2034577", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33378609", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://web.archive.org/web/20220325130049/https://www.modernatx.com/sites/default/files/mRNA-1273-P301-Protocol.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33899038", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2022/01/Fact-Checking-The-Fact-Checkers-1.pdf", "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "https://www.trialsitenews.com/a/modernas-non-clinical-summary-for-spikevax-evidence-of-scientific-and-regulatory-fraud-fd53b4f7", "https://ourworldindata.org/covid-deaths", "https://doi.org/10.13140/RG.2.2.34214.65605", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35462038", "https://ourworldindata.org/covid-vaccinations", "https://www.euromomo.eu/graphs-and-maps", "https://denisrancourt.ca/entries.php?id=116", "http://dx.doi.org/10.1111/eci.13554", "https://ndc.services.cdc.gov/case-definitions/coronavirus-disease-2019-2021/", "http://dx.doi.org/10.2807/1560-7917.ES.2020.25.3.2000045", "https://transition-news.org/IMG/pdf/340_de_sars-cov-2_genom_april_2020_20200502j.pdf", "https://cormandrostenreview.com/", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://www.epicentro.iss.it/coronavirus/bollettino/Report-COVID-2019_17_marzo-v2.pdf", "https://denisrancourt.ca/entries.php?id=9", "https://denisrancourt.ca/entries.php?id=104", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33176598", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33548003", "https://expose-news.com/2021/10/23/91-studies-prove-natural-immunity-is-better-than-covid-19-vaccines/", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34648303", "https://brownstone.org/articles/more-than-400-studies-on-the-failure-of-compulsory-covid-interventions/", "https://ourworldindata.org/explorers/coronavirus-data-explorer?time=2020-03-01..latest&facet=none&Metric=Confirmed+deaths&Interval=Cumulative&Relative+to+Population=true&Color+by+test+positivity=false&country=SWE~European+Union~USA~AUT~ITA~FRA~CHE", "https://www.cnbc.com/2019/01/23/bill-gates-turns-10-billion-into-200-billion-worth-of-economic-benefit.html", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33958444", "http://dx.doi.org/10.31219/osf.io/uwx32", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35723296", "https://harald-walach.de/2022/08/04/ohne-impfung-18-millionen-mehr-tote-weltweit-wirklich/"], "authors": [], "publish_date": "2022-08-29T21:26:40+02:00"}