{"result_id": "099025", "URL": "https://doctors4covidethics.org/session-i-the-fundamental-flaws-of-mrna-vaccine-technology-2/", "timestamp": "2023-04-25 14:59:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/session-i-the-fundamental-flaws-of-mrna-vaccine-technology-2/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Symposium 5, Session I: The Fundamental Flaws of mRNA Vaccine Technology", "cleaned_text": "Below are edited replays with written summaries of individual speaker segments from Session I of our fifth Symposium, In the Midst of Darkness Light Prevails, held on December 10th, 2022 in conjunction with UK Column and Children’s Health Defense.\n\nJournalist Taylor Hudak MA opened the symposium by noting that as we approach the end of 2022, “it is clear that we are at a critical point in our fight for freedom, bodily autonomy and human rights.”\n\nDoctors for Covid Ethics’ documentation of evidence that mRNA vaccines are causing vascular and organ damage has gone viral, she said, “which demonstrates the manifest shift in the public discourse” underway. It is a shift that inspired the motto for this our fifth symposium: In the Midst of Darkness Light Prevails.\n\nSucharit Bhakdi: Why All mRNA Vaccines Will Cause Harm\n\nProf Sucharit Bhakdi MD began with a call for physicians and medical scientists around the world to “go back to your textbooks and recall what we all should know.”\n\nHe provided an overview of “textbook immunology” on respiratory viruses such as SARS-CoV-2, which teaches that:\n• From birth the immune system is equipped to recognise virtually all “non-self” proteins and destroy the the cells that produce them, including viruses and their many variants, on entry via the respiratory and oral tracts. Vaccines against respiratory viruses are, therefore, unnecessary.\n• Intramuscular injections such as the COVID vaccines are, moreover, “doomed to fail”, as they induce blood-borne antibodies which do not act meaningfully in the respiratory mucous membranes. Dr Bhakdi reminded viewers that D4CE has been stressing this reality since early 2021.\n• The key downfall of all gene-based mRNA injections is that they are bound to inflict damage by instructing cells, particularly in the body’s lymph nodes and blood vessels, to produce “non-self” proteins, whether the spike protein or any other protein, inviting the immune system to attack those cells.\n• Such attack includes destruction by an immune effector system called ‘complement’ which induces a “violent” cell death. The mRNA-induced destruction of lymph (immune) cells in this way can promote impaired immunity and vulnerability to cancer. Destruction of cells on blood vessel walls (endothelial cells) can cause blood clots and vessel leakage, including leakage of vaccine into surrounding organs such as the liver, lung, brain and heart, with potentially irreversible and fatal consequences.\n\nDr Bhakdi concluded by urging doctors and scientists to “open your textbooks and go back and see whether what we have been saying has not been before your eyes for decades.”\n\nDr Michael Palmer MD followed Sucharit Bhakdi’s presentation by summarising the body of evidence from autopsies and biodstribution studies, which supports the mechanisms described by Dr Bhakdi.\n\nThe studies summarised by Michael Palmer have shown that:\n\nDr Meryl Nass, MD, ABIM led a panel discussion with all speakers from Session I, during which she pointed out that regulatory agencies have admitted to approximately 50 percent of the RNA in COVID injections being unidentified. This means, she said, that neither the regulators nor the public know what the mRNA vaccines contain. Approximately 50 percent of the mRNA, moreover, is degraded, creating genetic debris that makes it impossible to scientifically determine the genetic composition of the shots, even if regulators inspected the vaccine contents, which they do not.\n\nProf Sucharit Bhakdi MD underlined the extent of regulatory negligence in Europe by tracing the European authorisation for 5 billion doses of mRNA vaccines to a single and profoundly misleading submission by the firm BioNTech, in May 2020.\n\nDr Bhakdi added that independently published research has demonstrated the vaccine nanoparticles’ lipid component alone to be highly inflammatory, and lethal in animal models, constituting “poison”, which belatedly “provides the safety pharmacological studies that BioNTech did not supply.”\n\nSucharit Bhakdi concluded with the “ray of hope” that the companies responsible for the fraud perpetrated on populations and taxpayers have provided documentary evidence of their own fraudulent conduct, paving the way for legal action.\n\nSession I concluded with the song Hands off our Children by Joydah Mae.\n\nHands off our Children – Joydah Mae from Joydah Bernardo on Vimeo.\n\nWatch all of Session I here\n\nClick here for Session 1 presenters’ links and resources\n\nProf. Sucharit BHAKDI MD is Professor Emeritus of Medical Microbiology and Immunology, Former Chair, Institute of Medical Microbiology and Hygiene, Johannes Gutenberg University of Mainz.\n\nDr. Brian HOOKER, PhD, PE, is an Associate Professor of Biology at Simpson University in Redding California where he specializes in microbiology and biotechnology. Brian Hooker is the co-inventor for five patents, and recipient of the Battelle Entrepreneurial Award in 2001. Brian Hooker’s over 60 science and\n\nengineering papers have been published in internationally recognized, peer reviewed journals. In 2013 and 2014, Dr. Hooker worked with the CDC Whistleblower, Dr. William Thompson, to expose fraud and corruption within vaccine safety research in the CDC, which led to the release of over 10,000 pages of documents.\n\nTaylor HUDAK, MA, is an American Hungarian journalist focused on human rights, media freedom and health. She researches, writes, and produces video reports and interviews for The Last American Vagabond and acTVism Munich. Taylor received a master’s degree in journalism and mass communication from Kent State University.\n\nMeryl NASS, MD, ABIM is an internist with special interests in vaccine-induced illnesses, chronic fatigue syndrome, Gulf War illness, fibromyalgia and toxicology. As a biological warfare epidemiologist, she investigated the world’s largest anthrax epizootic in Zimbabwe, and developed a model for analyzing epidemics to assess whether they are natural or man-made. She has played a major role in creation of a\n\ncoalition that has fought the Anthrax Vaccine Immunization Program. Nass is active in assisting legal teams defending anthrax vaccine refusers and ill service members in the U.S. and Canada.\n\nMichael PALMER, MD is a former Associate Professor in the Department of Chemistry at the University of Waterloo, Ontario, Canada, and is board certified in Medical Microbiology. His experimental research focus is on bacterial toxins and antibiotics. Michael has authored a textbook on Biochemical Pharmacology.", "opengraph": {"type": "article", "title": "Symposium 5, Session I: The Fundamental Flaws of mRNA Vaccine Technology", "description": "In Session I of D4CE's fifth symposium, watch Dr Sucharit Bhakdi explain how BioNTech confirmed in writing that it never conducted safety pharmacology studies on its COVID shots. Edited replays of all Session I segments with summaries are here.", "url": "https://doctors4covidethics.org/session-i-the-fundamental-flaws-of-mrna-vaccine-technology-2/", "site_name": "Doctors for COVID Ethics", "updated_time": "2023-01-20T14:20:24+01:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2023/01/Panel-discussion-Session-I-scaled-e1674219063574.jpg", "image:width": "1200", "image:height": "750", "article:published_time": "2023-01-20T13:57:29+01:00", "article:modified_time": "2023-01-20T14:20:24+01:00"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://player.vimeo.com/video/727597645?h=40fb8ac18a\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://player.vimeo.com/video/727597645?h=40fb8ac18a"}], "links": ["#", "#", "#", "#", "#", "#", "https://rumble.com/v21i440-d4ce-5th-symposium-session-i-the-fundamental-flaws-of-mrna-vaccine-technolo.html", "https://doctors4covidethics.org/gold-standard-covid-science-in-practice-an-interdisciplinary-symposium-v-in-the-midst-of-darkness-light-prevails/", "https://www.ukcolumn.org/", "https://childrenshealthdefense.org/", "https://www.sciencedirect.com/science/article/pii/S2589004221014504", "https://vimeo.com/727597645", "https://vimeo.com/user100233628", "https://vimeo.com", "https://doctors4covidethics.org/wp-content/uploads/2023/01/Presenters-links-Session-I.pdf", "https://doctors4covidethics.org/wp-content/uploads/2023/01/Presenters-links-Session-I.pdf", "https://doctors4covidethics.org/wp-content/uploads/2023/01/Presenters-links-Session-I.pdf"], "authors": [], "publish_date": "2023-01-20T13:57:29+01:00"}