{"result_id": "099039", "URL": "https://doctors4covidethics.org/about/", "timestamp": "2023-04-25 14:59:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/about/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "About Doctors for COVID Ethics", "cleaned_text": "We stand for truth and ethics in science and medicine, and we therefore oppose the ongoing abuse of science and medicine for the destruction of peoples’ health, livelihoods, and even lives. In our view, this abuse includes but is not limited to the “public health” measures taken in the contrived COVID “pandemic.”\n\nD4CE got started with three open letters to the European Medicines Agency, written shortly after the EMA had issued the emergency approval for the gene-based COVID vaccines. In these letters, which were signed by hundreds of physicians and scientists, we urgently warned of short-term and long-term dangers from COVID-19 vaccines, including clotting, bleeding, and autoimmune-like inflammation. We also demanded the immediate withdrawal of all experimental gene-based COVID-19 vaccines. Unfortunately, the vaccines were not withdrawn, and all of those adverse effects soon became manifest in abundance.\n\nOur scientific case against the vaccines has been laid out in a number of educational memorandums, in whose conception and realization Prof. Sucharit Bhakdi, MD has played a leading role. Prof. Bhakdi is uniquely qualified to speak on this subject with authority; you can find out more about him in this biographical sketch.\n\nIn the two years that have passed, it has become increasingly clear that the gene-based vaccines were merely one step on the way toward the totalitarian control of society. This includes vaccine passports, which threaten public health and violate Nuremberg and other protections. We are warning that ‘health passes’ place coercive pressure on citizens to submit to dangerous medical experimentation, in return for freedoms that once were human rights. Other elements of this totalitarian agenda are the weaponization of mental health, the transfer of national sovereignty over public health to unaccountable international bodies, particularly the WHO, as well as the introduction of central bank digital currencies. We have discussed all of these issues in our symposiums, jointly held with UKColumn and with Children’s Health Defense.\n\nRead our letters, press releases and educational materials, and watch our videos, to learn more. Follow us on the Telegram Doctors For Covid Ethics Channel.", "opengraph": {"type": "article", "title": "About Doctors for COVID Ethics", "description": "We stand for truth and ethics in science and medicine, and we therefore oppose the ongoing abuse of science and medicine for the destruction of peoples’ health, livelihoods, and even lives. In our view, this abuse includes but is not limited to the “public health” measures taken in the contrived COVID “pandemic.” D4CE got started with three open letters to the European Medicines Agency, written", "url": "https://doctors4covidethics.org/about/", "site_name": "Doctors for COVID Ethics", "updated_time": "2023-01-15T18:10:03+01:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2021/06/D4CE-home-page.png", "image:width": "1167", "image:height": "583", "article:published_time": "2021-05-21T19:44:35+02:00", "article:modified_time": "2023-01-15T18:10:03+01:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://doctors4covidethics.org/about-sucharit-bhakdi-md/", "https://doctors4covidethics.org/symposiums/", "https://doctors4covidethics.org/letters/doctorsforcovidethics-letters/", "https://doctors4covidethics.org/publications-ii/", "https://doctors4covidethics.org/videos-new/", "https://t.me/Doctorsforcovidethics", "https://t.me/Doctorsforcovidethics", "https://t.me/Doctorsforcovidethics"], "authors": [], "publish_date": "2021-05-21T19:44:35+02:00"}