{"result_id": "099012", "URL": "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "timestamp": "2023-04-25 14:59:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Vascular and organ damage induced by mRNA vaccines: irrefutable proof of causality", "cleaned_text": "This article summarizes evidence from experimental studies and from autopsies of patients deceased after vaccination. The collective findings demonstrate that\n• mRNA vaccines don’t stay at the injection site by instead travel throughout the body and accumulate in various organs,\n• mRNA-based COVID vaccines induce long-lasting expression of the SARS-CoV-2 spike protein in many organs,\n• vaccine-induced inflammation can cause grave organ damage, especially in vessels, sometimes with deadly outcome.\n\nWe note that the damage mechanism is which emerges from the autopsy studies is not limited to COVID-19 vaccines only but is completely general—it must be expected to occur similarly with mRNA vaccines against any and all infectious pathogens. This technology has failed and must be abandoned.\n\nWhile clinical case reports (e.g. [1,2]) and statistical analyses of accumulated adverse event reports (e.g. [3,4]) provide valuable evidence of damage induced by mRNA-based COVID-19 vaccines, it is important to establish a causal relationship in individual cases. Pathology remains the gold standard for proof of disease causation. This short paper will discuss some key findings on autopsy materials from patients who died within days to several months after vaccination. For context, some experimental studies are briefly discussed as well.\n\n1. Most of the evidence presented here is from the work of pathologist Prof. Arne Burkhardt, MD\n\nProf. Burkhardt is a very experienced pathologist from Reutlingen, Germany. With the help of his colleague Prof. Walter Lang, he has studied numerous cases of death which occurred within days to several months after vaccination. In each of these cases, the cause of death had been certified as “natural” or “unknown.” Burkhardt became involved only because the bereaved families doubted these verdicts and sought a second opinion. It is remarkable, therefore, that Burkhardt found not just a few but the majority of these deaths to be due to vaccination.\n\nWhile all four major manufacturers of gene-based vaccines were represented in the sample of patients studied by Burkhardt and Lang, most patients had received an mRNA vaccine from either Pfizer or Moderna. Some of the deceased patients had received both mRNA- and viral vector-based vaccines on separate occasions.\n\n2. Pfizer’s own animal experiments show that the vaccine quickly distributes throughout the body\n\nIn order to cause potentially lethal damage, the mRNA vaccines must first distribute from the injection site to other organs. That such distribution occurs is apparent from animal experiments reported by Pfizer to Japanese authorities with its application for vaccine approval in that country [5]. Rats were injected intramuscularly with a radioactively labelled model mRNA vaccine, and the movement of the radiolabel first into the bloodstream and subsequently into various organs was followed for up to 48 hours.\n\nThe first thing to note is that the labelled vaccine shows up in the blood plasma after a very short time—within only a quarter of an hour. The plasma level peaks two hours after the injection. As it drops off, the model vaccine accumulates in several other organs. The fastest and highest rise is observed in the liver and the spleen. Very high uptake is also observed with the ovaries and the adrenal glands. Other organs (including the testes) take up significantly lower levels of the model vaccine. We note, however, that at least the blood vessels will be exposed and affected in every organ and in every tissue.\n\nThe rapid and widespread distribution of the model vaccine implies that we must expect expression of the spike protein throughout the body. For a more in-depth discussion of this biodistribution study, see Palmer2021b.\n\n3. Expression of viral proteins can be detected with immunohistochemistry\n\nWhile the distribution of the model vaccine leads us to expect widespread expression of the spike protein, we are here after solid proof. Such proof can be obtained using immunohistochemistry, which method is illustrated in this slide for the vaccine-encoded spike protein.\n\nIf a vaccine particle—composed of the spike-encoding mRNA, coated with lipids—enters a body cell, this will cause the spike protein to be synthesized within the cell and then taken to the cell surface. There, it can be recognized by a spike-specific antibody. After washing the tissue specimen to remove unbound antibody molecules, the bound ones can be detected with a secondary antibody that is coupled with some enzyme, often horseradish peroxidase. After another washing step, the specimen is incubated with a water-soluble precursor dye that is converted by the enzyme to an insoluble brown pigment. Each enzyme molecule can rapidly convert a large number of dye molecules, which greatly amplifies the signal.\n\nAt the top right of the image, you can see two cells which were exposed to the Pfizer vaccine and then subjected to the protocol outlined above. The intense brown stain indicates that the cells were indeed producing the spike protein.\n\nIn short, wherever the brown pigment is deposited, the original antigen—in this example, the spike protein—must have been present. Immunohistochemistry is widely used not only in clinical pathology but also in research; it could readily have been used to detect widespread expression of spike protein in animal trials during preclinical development. However, it appears that the FDA and other regulators never received or demanded such experimental data [6].\n\n4. Expression of spike protein in shoulder muscle after vaccine injection\n\nThis slide (by Dr. Burkhardt) shows deltoid muscle fibres in cross section. Several (but not all) of the fibres show strong brown pigmentation, again indicating spike protein expression.\n\nWhile the expression of spike protein near the injection site is of course expected and highly suggestive, we would like to make certain that such expression is indeed caused by the vaccine and not by a concomitant infection with the SARS-CoV-2 virus. This is particularly important with respect to other tissues and organs which are located far away from the injection site.\n\n5. Coronavirus particles contain two prominent proteins: spike (S) and nucleocapsid (N)\n\nTo distinguish between infection and injection, we can again use immunohistochemistry, but this time apply it to another SARS-CoV-2 protein—namely, the nucleocapsid, which is found inside the virus particle, where it enwraps and protects the RNA genome. The rationale of this experiment is simple: cells infected with the virus will express all viral proteins, including the spike and the nucleocapsid. In contrast, the mRNA-based COVID vaccines (as well as the adenovirus vector-based ones produced by AstraZeneca and Janssen) will induce expression only of spike.\n\n6. Infected persons express the nucleocapsid protein (and also the spike protein)\n\nThis slide simply illustrates that the method works: lung tissue or cells from a nasal swab of a person infected with SARS-CoV-2 stain positive for nucleocapsid expression, whereas cultured cells exposed to the vaccine do not (but they stain strongly positive for the spike protein; see inset at the top right of Slide 3).\n\n7. Injected persons express only the spike protein, which implicates the vaccine\n\nHere, we see immunohistochemistry applied to heart muscle tissue from an injected person. Staining for the presence of spike protein causes strong brown pigment deposition. In contrast, only very weak, non-specific staining is observed with the antibody that recognizes the nucleocapsid protein. The absence of nucleocapsid indicates that the expression of the spike protein must be attributed ot the vaccine rather than an infection with SARS-CoV-2.\n\nWe will see shortly that the strong expression of spike protein in heart muscle after vaccination correlates with significant inflammation and tissue destruction.\n\n8. Expression of spike protein within the walls of small blood vessels\n\nWe see spike protein expression in arterioles (small arteries; left) as well as in venules (small veins) and capillaries (right). Expression is most prominent in the innermost cell layer, the endothelium. This makes the endothelial cells “sitting ducks” for an attack by the immune system.\n\n9. Endothelial stripping and destruction of a small blood vessel after vaccination\n\nWe now turn to the evidence of immune attack on the endothelial cells which produce the spike protein. On the left, a normal venule, delimited by an intact endothelium and containing some red blood cells and few white blood cells (stained blue) inside.\n\nThe image on at the centre shows a venule that is being attacked and destroyed by the immune system. The outline is already dissolving, and the spindle-shaped (and swollen) endothelial cells have peeled off from the vessel wall. Furthermore, we see lymphocytes—the small cells with dark, round nuclei and with very little cytoplasm around them; a single lymphocyte (at much higher magnification) is shown on the right.\n\nLymphocytes are the backbone of the specific immune system—whenever antigens are recognized and antibodies are produced, this is done by lymphocytes. Also among the lymphocytes we find cytotoxic T cells and natural killer cells, which serve to kill virus-infected cells—or ones that look to them as if infected, because they have been forced to produce a viral protein by a so-called vaccine.\n\nA crucial function of the endothelium is to prevent blood clotting. Thus, if the endothelium is damaged, as it is in this picture, and the tissues beyond it make contact with the blood, this will automatically set off blood clotting.\n\n10. A crack in the wall of the aorta, lined by clusters of lymphocytes, leading to aortic rupture\n\nOn the left, a section through the wall of an aorta. This picture is taken at an even lower magnification than the one before; the lymphocytes now appear as just a cloud of tiny blue specks. To the left of this blue cloud, we see a vertical crack running through the tissue. Such a crack is also visible macroscopically in the excised specimen of an aorta shown on the right.\n\nThe aorta is the largest blood vessel of the body. It receives the highly pressurized blood ejected by the left ventricle of the heart, and it is thus exposed to intense mechanical stress. If the wall of the aorta is weakened by inflammation, as it is here, then it may crack and rupture. Aortic rupture is normally quite rare, but Prof. Burkhardt found multiple cases in his limited number of autopsies. Some of the affected aortas were also shown to have expressed the spike protein.\n\nIn Slide 7, we saw that heart muscle cells strongly expressed the spike protein after vaccine injection. Here, we see the consequences. The picture on the shows a sample of healthy heart muscle tissue, with regularly oriented and aligned heart muscle fibres. On the right, we see a heart muscle sample from one of the autopsies. The muscle fibres are disjointed and disintegrating, and they are surrounded by invading lymphocytes. Burkhardt found myocarditis in multiple of his deceased patients.\n\nOn the left, we see healthy lung tissue, with air-filled spaces (the alveoli), delimited by delicate alveolar septa with embedded, blood-filled capillaries. We also see some larger blood vessels.\n\nOn the right hand side, we see lung tissue overrun by lymphocytes. The air-filled spaces have largely disappeared and been filled with scar (connective) tissue. This vaccine-injected patient would obviously have had very great trouble breathing.\n\nLymphocytic infiltration, inflammation and destruction were also observed in many other organs, including the brain, the liver, the spleen, and multiple glands. However, instead of illustrating them all, we will conclude the pathological evidence with another immunohistochemistry result, which strikingly shows the long duration of spike protein expression.\n\n13. Vaccine-induced expression of spike protein in a bronchial biopsy nine months after vaccination\n\nThe slide shows a sample of bronchial mucous membrane, from a patient who is alive but has suffered respiratory symptoms ever since being vaccinated. We see several cells in the uppermost cell layer that strongly express spike protein—and this even nine months after his most recent vaccine injection! While this is indeed the most extreme case of long-lasting expression, there is evidence both from Burkhardt’s autopsies and from published studies on blood samples [7] or lymph node biopsies [8] to indicate that expression does last several months.\n\n14. The Pfizer vaccine mRNA gets copied (“reverse-transcribed”) into DNA and inserted into the cellular genome\n\nThe official mRNA vaccine narrative maintains that the modified mRNA contained in the vaccine will not be replicated in vivo; expression of the spike protein should therefore cease once the injected RNA molecules have been degraded.\n\nThe limited experimental studies available [9,10] suggest that the injected modified mRNA should be degraded within days to a few weeks of the injection. This is obviously difficult to square with the observed long-lasting expression; in some form or other, the genetic information appears to be perpetuated in vivo.\n\nA recent experimental study from Sweden [11] has shown that human-derived cells can copy the Pfizer mRNA vaccine into DNA and then insert it into their own chromosomal DNA. The image shows the key evidence from this study. The cells were exposed to the vaccine for the lengths of time indicated. Cellular DNA was then isolated, and inserted DNA copies of the vaccine mRNA detected by PCR amplification of a fragment 444 base pairs (bp) in length.\n\nAll samples labelled with “BNT” had been treated with the vaccine, and they all show a PCR product of the expected length, as is evident from comparison to a DNA fragment length standard (“L”). Samples labelled with “Ctrl n” were controls: Ctrl 1– 4 contained DNA from cells not incubated with vaccine, Ctrl 5 contained RNA (not DNA) from vaccine-treated cells; Ctrl 6 contained the same but was additionally treated with RNAse, which step was also performed in the purification of DNA samples. As expected, none of the control samples contain the PCR product.\n\nConsidering Aldén’s observation of DNA insertion in every single experimental sample, it seems highly likely that this will also occur in vivo. Beyond providing a plausible mechanism for perpetuating the expression of spike protein, DNA insertion also poses risks of genetic damage, leading to cancers and leukemias.\n\nThe evidence presented here clearly demonstrates a chain of causation from vaccine injection to\n• rapid distribution of the vaccine through the bloodstream,\n\nVaccine-induced vascular damage will promote blood clotting, and clotting-related diseases such as heart attack, stroke, lung embolism are very common in the adverse events databases [4,12].\n\nIn addition to autoimmune-like inflammation, other disease mechanisms, including prion-mediated CNS degeneration [13], aberrant vascular protein deposition (amyloidosis) [14,15], and lipid nanoparticle toxicity [16], are plausible but require further study and corroboration. Overall, these vaccines can no longer be considered experimental—the “experiment” has resulted in the disaster that many medical doctors and scientists predicted from the outset [17]. The vaccination must be stopped, and all approvals and authorizations of their use must be revoked.\n• Biopsy-proven lymphocytic myocarditis following first mRNA COVID-19 vaccination in a 40-year-old male: case report . Clinical research in cardiology official journal of the German Cardiac Society 110:1855-1859\n• A Report on Myocarditis Adverse Events in the U.S. Vaccine Adverse Events Reporting System (VAERS) in Association with COVID-19 Injectable Biological Products . Current problems in cardiology p. 101011\n• 43,898 Dead, 4,190,493 Injured Following COVID Vaccines in European Database of Adverse Reactions .\n• Did Pfizer Perform Adequate Safety Testing for its Covid-19 mRNA Vaccine in Preclinical Studies? Evidence of Scientific and Regulatory Fraud .\n• Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines . J. Immunol. 207:2405-2410\n• Immune imprinting, breadth of variant recognition and germinal center response in human SARS-CoV-2 infection and vaccination . Cell (preprint)\n• N1-methylpseudouridine-incorporated mRNA outperforms pseudouridine-incorporated mRNA by providing enhanced protein expression and reduced immunogenicity in mammalian cell lines and mice . J. Control. Release 217:337-344\n• Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line . Curr. Issues Mol. Biol. 44:1115-1126\n• Towards the emergence of a new form of the neurodegenerative Creutzfeldt-Jakob disease: Twenty six cases of CJD declared a few days after a COVID-19 “vaccine” Jab . ResearchGate (preprint)\n• Neurotoxic amyloidogenic peptides in the proteome of SARS-COV2: potential implications for neurological symptoms in COVID-19 . Nat. Commun. 13:3387\n• Urgent Open Letter from Doctors and Scientists to the European Medicines Agency regarding COVID-19 Vaccine Safety Concerns .", "opengraph": {"type": "article", "title": "Vascular and organ damage induced by mRNA vaccines: irrefutable proof of causality", "description": "This article summarizes evidence from experimental studies and from autopsies of patients deceased after vaccination. mRNA vaccines travel throughout the body and accumulate in various organs and induce long-lasting expression of the SARS-CoV-2 spike protein in many organs. The vaccine-induced expression of the spike protein induces autoimmune-like inflammation, which can cause grave organ damage, especially in vessels, sometimes with deadly outcome. ", "url": "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-08-29T21:27:30+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/08/20220819_featured.jpg", "image:width": "750", "image:height": "280", "article:published_time": "2022-08-19T18:02:09+02:00", "article:modified_time": "2022-08-29T21:27:30+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org", "https://doctors4covidethics.org/wp-content/uploads/2022/08/causality-article.pdf", "https://doctors4covidethics.org/wp-content/uploads/2022/08/Dano_vascular_y_de_organos_inducido_por_vacunas_de_ARNm_Prueba_irrefutable.pdf", "#ref1", "#ref2", "#ref3", "#ref4", "#ref5", "#ref6", "#slide-immunohisto-cartoon", "#slide-heart-spike-nc", "#ref7", "#ref8", "#ref9", "#ref10", "#ref11", "#ref4", "#ref12", "#ref13", "#ref14", "#ref15", "#ref16", "#ref17", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34281357", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34487236", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34601006", "https://healthimpactnews.com/2022/43898-dead-4190493-injured-following-covid-19-vaccines-in-european-database-of-adverse-reactions/", "https://archive.org/details/pfizer-confidential-translated", "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "http://dx.doi.org/10.1016/j.cell.2022.01.018", "http://dx.doi.org/10.1016/j.jconrel.2015.08.051", "https://www.ncbi.nlm.nih.gov/pubmed/?term=29739835", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35723296", "https://www.openvaers.com/", "https://doi.org/10.13140/RG.2.2.14427.03366", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35697699", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35579205", "https://doctors4covidethics.org/the-pfizer-mrna-vaccine-pharmacokinetics-and-toxicity/", "https://doctors4covidethics.org/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-vaccine-safety-concerns/"], "authors": [], "publish_date": "2022-08-19T18:02:09+02:00"}