{"result_id": "099002", "URL": "https://doctors4covidethics.org/rebutting-health-feedbacks-critique-of-our-article-vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "timestamp": "2023-04-25 14:59:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/rebutting-health-feedbacks-critique-of-our-article-vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Rebutting “Health Feedback’s” critique of our article “Vascular and organ damage induced by mRNA vaccines: irrefutable proof of causality”", "cleaned_text": "On August 19, 2022, we published on this website an article [1] which summarized evidence from autopsies that demonstrated autoimmune-like inflammation in the blood vessels and tissues of patients who had died after receiving a COVID-19 mRNA vaccine. In the foci of inflammation, the vaccine-induced expression of spike protein had also been demonstrated, indicating very strongly a causal chain from vaccination to vascular and organ damage and ultimately death.\n\nOur conclusions were disputed by Dr. Iria Carballo-Carbajal in a post on the website “Health Feedback” [2]. We here rebut Dr. Carballo-Carbajal’s more important assertions; but we will let slide some minor ones, because life is short. In the following, Dr. Carballo-Carbajal’s statements will be typeset in italics, whereas our own text will appear in upright font shape.\n\nEarly on in her article Dr. Carballo-Carbajal denounces us as having “a history of spreading misinformation about COVID-19 and COVID-19 vaccines.” In support of this statement, she merely assembles a list of links, but she makes no argument as to the facts whatsoever. Her statement therefore amounts to no more than slander.\n\n2. Does the vaccine stay in the injection site?\n\nIf one considers the possibility of vaccine-induced damage to the organs of the body, then a crucial question is whether or not the vaccine distributes from the injection site to those organs.\n\nIn our article, we had shown data from an animal study conducted by Pfizer, which showed the rapid appearance of an intramuscularly injected model vaccine in the bloodstream and its subsequent accumulation in several organs, including the liver, the spleen, the adrenal glands, and the ovaries [3]. What our article did not say is that all of the vaccine leaves the injection site. It is indeed correct that in those rat experiments a large proportion was retained at the injection site—at least during the time period of observation, which was limited to 48 hours.\n\nThe headline of Dr. Carballo-Carbajal’s section on the subject asserts that “Only a tiny fraction of the lipid nanoparticles in COVID-19 vaccines travel through the body.” However, further down in her text she states that 52.6% are retained at one hour after the injection. What she does not mention is that already after two hours that value has dropped to below one third of the total. A problem with this entire data set, however, is that the total of all of the organs combined never adds up to 100%. Without going into too much detail, this is to be expected, given the technical difficulties of such measurements.\n\nNot only is the exact proportion of distributed vaccine difficult to ascertain, however, but it also does not really matter. It was determined in rats, not humans, and in rats of a fairly uniform age and genetic make-up at that; and furthermore, it used a model vaccine that contained the correct lipid mixture but a different mRNA. It is illusory to base exact predictions of the distribution of the vaccine in humans on these rat data, and on this model vaccine—there is a reason why pharmacokinetics studies in humans are normally considered necessary during drug development. Distribution in humans would likely be much more variable than in these rats—injection into the highly vascularized deltoid muscle of a young athlete should result in substantially higher systemic distribution than that into the typically much less used and less perfused muscle of an elderly person.\n\nWhat really matters is only this: a substantial fraction of the vaccine must be assumed to be taken up into the system, where it may give rise to spike protein expression and subsequent organ damage—and no more than this was expressed in our article. In summary, Dr. Carballo-Carbajal misrepresents both our article and the data from the Pfizer study at issue.\n\n3. For how long is the spike protein expressed after vaccination?\n\nAside from the spatial distribution of the vaccine, another crucial question concerns the duration of its activity—the longer the spike protein is expressed, the more sustained and destructive the resulting autoimmune-like inflammation will be. Dr. Carballo-Carbajal’s blankly states that there is “no evidence” of long-lasting expression, and that “the idea that mRNA from COVID-19 vaccines can remain in our bodies in the long term is a common myth.”\n\nThe “common myth” is in fact supported by solid evidence. The mRNA, and the spike protein expressed from it, were demonstrated in lymph nodes near the injection site for up to 60 days after injection by Röltgen et al. [4]. Long-lasting persistence of the vaccine mRNA in skeletal muscle tissue distant from the injection site was recently reported by Magen et al. [5]. The patient in question suffered debilitating myositis (muscle inflammation). Finally, long-lasting persistence of the spike protein in the bloodstream, and therefore again long-lasting expression, was also confirmed by Bansal et al. [6]. Burkhardt’s detection of long-lasting spike protein expression by immunohistochemistry thus fits the overall picture of the available evidence, but it does extend the time horizon of persistence to up to nine months after injection.\n\nTrue to form, Dr. Carballo-Carbajal addresses none of these reported findings. Instead, she focuses exclusively on one hypothetical explanation for the observed long-lasting expression, which we had proposed in our study. This explanation involved the reverse transcription of the Pfizer vaccine mRNA into DNA, which was observed in a liver cell line in vitro by Aldén et al. [7], followed by the integration of the DNA copies into the cellular genome; from such inserted copies, mRNA encoding the spike protein might then be continuously transcribed.\n\nIn her critique of our hypothesis, Dr. Carballo-Carbajal manages to present the single correct argument contained in her entire piece: she points out that Aldén et al. demonstrated the reverse transcription of the vaccine mRNA into DNA, but did not strictly show its integration into the genome. We note, however, that the LINE retrotransposons—which include LINE-1, which is far and away the most common retrotransposon in humans, and thus the one most likely to have copied the vaccine mRNA into DNA—are target-primed [8], which means that the two processes of reverse transcription and genomic insertion of the DNA are inextricably linked. Therefore, in the absence of direct evidence for or against genomic insertion, it must be considered highly likely. In any case: regardless of whether or not the DNA copies will insert into the genome, and if so, whether such inserted copies will indeed drive continued expression—the long-lasting expression of spike after vaccination as such is supported by ample evidence, all of which Dr. Carballo-Carbajal simply ignores.\n\nThe autopsy findings discussed in our article were provided to us by Dr. Arne Burkhardt, an emeritus professor of pathology with extensive diagnostic experience—he has evaluated approximately 40,000 autopsies over the course of his career. He reviewed and approved the text of our article before its publication.\n\nWhat arguments does Dr. Carballo-Carbajal adduce in order to discredit Dr. Burkhardt and his findings? She quotes anonymous members—how many? how senior, and with what credentials?—of the German register of COVID-19 autopsies:\n\nThe team of the German register of COVID-19 autopsies at the University Hospital RWTH Aachen … explained that the accumulation of lymphocytes was similar to “those found in many autopsy cases.” Furthermore, they said that no conclusions could be drawn from Burkhardt’s data because the criteria for selecting the cases were “unclear.”\n\nTo get the “unclear criteria for selection” out of the way: Burkhardt always clearly stated that all of the cases he reviewed were brought to his attention by the bereaved families who were seeking a second opinion, and he never extrapolated his limited case statistics to the population at large. To anyone with open eyes, those limited statistics will nevertheless be cause for grave concern.\n\nThe heart of the matter, however, are of course the pathological findings themselves. What exactly is proven by the statement that “many autopsy cases” show similar accumulations of lymphocytes? Nobody will dispute that other causes of lymphocyte infiltrations exist—such as for example autoimmune diseases or viral infections. Such diseases, however, usually have characteristic features of their own, for example the involvement of specific tissues and organs. In virus infections, one typically can find the viral antigens in the affected tissues. The detection of such viral antigens within a focus of inflammation is generally accepted as proof of causation.\n\nAnd lo and behold—the same standard was applied by Burkhardt and by his his pathology colleagues, some of whom have so far not appeared in public but have very much contributed their time and expertise. The presence of SARS-CoV-2 spike protein in the inflamed tissues and blood vessels was demonstrated by immunohistochemistry, which is a standard method for detecting specific antigens (be they viral or cellular) in tissue sections. What is more, the absence of the SARS-CoV-2 nucleocapsid protein was also shown. Nucleocapsid will be present in patients who are infected with the virus, but it will be absent in the vaccinated, since the vaccine encodes only the spike protein. Thus, the presence of only spike protein implies that its expression must have been caused by vaccination. We further note that the expression of spike protein in heart muscle tissue samples from multiple vaccinated patients with myocarditis has in the meantime been verified by another team of pathologists [9]; and these authors, too, consider their demonstration proof of causation by the vaccine.\n\nThis, then, is the current state of the evidence, which Dr. Carballo-Carbajal would have to address in order to make a meaningful and relevant argument. However, she does not even pretend to address it; instead, she offers up some more stale third party commentary, such as this one from the The Federal Association of German Pathologists (Bundesverband Deutscher Pathologen):\n\nAs far as we know, the opinions presented in the video by Professor Burkhardt and Professor Lang are currently neither sufficiently supported by scientific evidence nor are they available in a format worthy of comment.\n\nThe video referred to in this quote represents the very first public statement by Burkhardt and Lang, which dates from the summer of 2021. They shared this preliminary report because of the perceived urgency, even though the crucial corroboration by immunohistochemistry was not yet available at the time. Based on their long-standing experience, Burkhardt and Lang had understood that they were looking at novel and unusual findings, which suggested a novel and unusual cause; and as we have seen, their attribution of these findings to the vaccines has in the meantime been proven correct. Burkhardt and Lang must be commended for their courage to come out with their findings as soon as they did in order to warn the public of the dangers posed by the gene-based vaccines.\n\nThroughout her entire commentary, Dr. Carballo-Carbajal has avoided to substantially address the evidence presented by Dr. Burkhardt and his colleagues, as well as our interpretations of it. Her article is quite simply a hit job without any scientific merit.\n• Vascular and organ damage induced by mRNA vaccines: irrefutable proof of causality .\n• Unsubstantiated claims by Michael Palmer and Sucharit Bhakdi don’t demonstrate that COVID-19 vaccines harm organs .\n• Immune imprinting, breadth of variant recognition and germinal center response in human SARS-CoV-2 infection and vaccination . Cell (preprint)\n• Clinical and Molecular Characterization of a Rare Case of BNT162b2 mRNA COVID-19 Vaccine-Associated Myositis . Vaccines 10 (preprint)\n• Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines . J. Immunol. 207:2405-2410\n• Intracellular Reverse Transcription of Pfizer BioNTech COVID-19 mRNA Vaccine BNT162b2 In Vitro in Human Liver Cell Line . Curr. Issues Mol. Biol. 44:1115-1126\n• The take and give between retrotransposable elements and their hosts . Annu. Rev. Genet. 42:587-617", "opengraph": {"type": "article", "title": "Rebutting “Health Feedback’s” critique of our article “Vascular and organ damage induced by mRNA vaccines: irrefutable proof of causality”", "description": "Our conclusions were disputed by Dr. Iria Carballo-Carbajal in a post on the website “Health Feedback.” Throughout her entire commentary, she has avoided to substantially address the evidence presented by Dr. Burkhardt and his colleagues, as well as our interpretations of it. Her article is quite simply a hit job without any scientific merit.", "url": "https://doctors4covidethics.org/rebutting-health-feedbacks-critique-of-our-article-vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-09-21T20:23:21+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2021/04/Signing-narrow.png", "image:width": "751", "image:height": "300", "article:published_time": "2022-09-19T20:39:35+02:00", "article:modified_time": "2022-09-21T20:23:21+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "#ref1", "#ref2", "#ref3", "#ref4", "#ref5", "#ref6", "#ref7", "#ref8", "#ref9", "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "https://healthfeedback.org/claimreview/unsubstantiated-claims-by-michael-palmer-sucharit-bhakdi-dont-demonstrate-covid-19-vaccines-harm-organs/", "https://archive.org/details/pfizer-confidential-translated", "http://dx.doi.org/10.1016/j.cell.2022.01.018", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35891299", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35723296", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18680436", "http://dx.doi.org/10.3390/ijms23136940"], "authors": [], "publish_date": "2022-09-19T20:39:35+02:00"}