{"result_id": "099047", "URL": "https://doctors4covidethics.org/gene-based-vaccination-quo-vadis/", "timestamp": "2023-04-25 14:59:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/gene-based-vaccination-quo-vadis/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Gene-based vaccination–quo vadis?", "cleaned_text": "The concept underlying vaccine development is straightforward: application of a harmless derivative of an infectious agent should stimulate the immune system to produce antibodies that protect against that agent.\n\nIntroduction of any foreign substance into the body can never be entirely devoid of risks, however, so the prime question to be addressed is whether the benefit can be expected to outweigh the risks. Therefore,\n• the pathogen must be dangerous—an infection with it is associated with a high morbidity and mortality rate, and\n\nThese requisites were fulfilled in the historic successes of vaccine development against smallpox, tetanus, diphtheria and poliomyelitis. The euphoria created by these scientific milestones caused one decisive fact to be overlooked, however. In all four cases, the agents were transported to their destination in the bloodstream.\n\nIt is essential to realize that this is the exception and not the rule. Most viral pathogens cause self-limiting infections of the respiratory or the gastrointestinal tract. Severe damage to internal organs caused by their spread via the bloodstream occurs infrequently, and infections are generally not associated with high death rates. Because of their ubiquity, a high level of background immunity to such viruses is already present in the general population. For these simple reasons, a genuine need for development of vaccines against most viral pathogens does not exist.\n\nWe now turn to an important fact regarding the protection of the respiratory tract against infections: it is mediated by cells of the immune system which reside within and beneath our respiratory mucous membranes, and these cells function quite independently from those immune cells which protect our internal organs.\n\nA key aspect of this functional separation between mucosal and systemic immunity concerns the nature of antibodies produced by plasma cells located directly beneath the mucous membranes. These antibodies—secretory immunoglobulin A (sIgA)—are secreted across the mucous membranes to their surface. They are thus on site to meet airborne viruses, and they may be able to prevent them from binding and infecting the cells within those mucous membranes. The same mode of protection pertains to the digestive tract as well.\n\nIn contrast, IgG and circulating IgA are the main antibodies found in the bloodstream. They cannot prevent the entry of viruses into the cells that line the airways or the gut, and they may at best counteract their spread if they gain entry to the circulation. Crucially, vaccines that are injected into the muscle—i.e., the interior of the body—will only induce IgG and circulating IgA, but not secretory IgA. The antibodies induced by such vaccines therefore cannot and will not effectively protect the cells of the respiratory tract against infection by airborne viruses [1,2]. This realization is neither contentious nor new. As long as 30 years ago, McGhee et al. [2] concluded:\n\nIt is surprising that despite our current level of understanding of the common mucosal immune system, almost all current vaccines are given to humans by the parenteral route [i.e. by injection]. Systemic immunization is essentially ineffective for induction of mucosal immune responses. Since the majority of infectious microorganisms are encountered through mucosal surface areas, it is logical to consider the induction of protective antibodies and T cell responses in mucosal tissues.\n\nThe failure of intramuscular injection to induce secretory IgA has been confirmed in a study on Middle East Respiratory Syndrome (MERS) [3]. Like COVID-19, this disease is caused by a coronavirus, and the experimental vaccine used in the study was gene-based, like all of the major vaccines currently deployed against COVID-19. More recently, another study has shown that the mRNA COVID-vaccines also do not stimulate substantive production of secretory IgA [4]. For this simple reason, one cannot expect that vaccination will inhibit airway infection. Indeed, the utter failure of the vaccines to prevent SARS-CoV-2 infection is today solidly documented [5,6].\n\nIt is general knowledge that secretory IgA antibodies (sIgA) are produced in response to naturally occurring airway infections. The mucous membranes of healthy individuals are consequently coated with antibodies directed against common respiratory viruses. However, the capacity of these antibodies to prevent infections is limited. The outcome of an encounter with a virus is not “black or white”—numbers are all-important. A wall of protective antibodies may ward off a small-scale attack, but it will be breached at higher viral loads. This is why infections with airborne viruses occur repeatedly throughout life, a fact that will not even be altered by the use of intranasal vaccines in order to stimulate sIgA-production, even though intranasal vaccine application does induce stronger mucosal immune responses than does intramuscular injection [3,7].\n\nThe subordinate role of secretory IgA in combating systemic viral infections is highlighted by the fact that individuals with a very common genetic defect—selective sIgA deficiency—who are unable to produce sIgA do not suffer from dramatically increased susceptibility toward severe respiratory infections. This observation can be understood from the following two principles: firstly, immunological protection against respiratory viruses rests mainly on T-cells; and secondly, in those with preexisting immunity, levels of bloodstream antibodies (circulating IgG and IgA) are generally sufficient to prevent severe disease through viral spread within the body.\n\nT-lymphocytes are crucial for controlling respiratory infections and indeed, this extends to viral infections in general. Attention is now turned to these cells, whereby the discussion can initially be focused on the function of cytotoxic T-lymphocytes (CTL).\n\nWhat do these cells recognize, and what is the cardinal consequence of this immune recognition?\n\nWhenever a cell produces a specific protein, it will generate multiple copies of it. A few of these copies will be broken down, on purpose, into small fragments; these are then transported to the surface of the cell, together with a specific carrier molecule named MHC 1. There, the fragments become amenable for interaction with and recognition by CTL. Different fragments will be recognized by lymphocytes belonging to different “clones”; all cells of a given T-cell clone will carry the same T-cell receptors and recognize the same protein fragments, but cells belonging to different clones will differ in their antigen specificity (Figure 1). A T-cell which does manage to find and bind its cognate protein fragment will thereby be activated to eject deadly toxic substances onto and into the targeted cells.\n\nIf the protein whose fragments had attracted and activated those CTL was encoded by a virus, then the result will be the destruction of the virus-infected cell, which is useful and necessary for eradicating a viral infection. However, note that the process of protein fragmentation and presentation is completely general—it is not limited to viral or other “non-self” proteins, but rather applies to the body’s own “self” proteins as well. It is therefore vital to prevent the activation of CTL that recognize the fragments of these “self” protein-derived fragments. How is this accomplished?\n\nEnvisage the interaction between presented protein fragment and its “receptor” on the T-cell as one between lock and key. There are myriad different keys (fragments) fitting into myriad different locks (T-cell receptors). It is known that the truly incredible diversity of locks arises already during fetal development. How does this happen? Are locks molded in response to the fragments (keys) as these appear during development? Then, since the fetus is not usually exposed to any viral infections, CTL would be equipped with receptors exclusively recognizing “self” protein fragments; but these self-reactive CTL clones could hardly serve a useful purpose. If, on the other hand, the diversity of locks should arise haphazardly and by chance, without requirement for any instructing template (key), then billions of lymphocytes that recognize “non-self”—extraneous agents, including virus proteins—should be generated alongside those that recognize “self.”\n\nIntriguingly, the latter is today known to be the case [8]. Wondrously, lymphocytes recognizing “self” are silenced or held in check throughout life, preventing them from wantonly attacking healthy body cells. Mishaps occasionally occur that can lead to autoimmune disease. Come T-cells out of cover that are reactive against liver proteins, come autoimmune hepatitis. Come T-cells out of cover that are reactive against the pancreatic islets, come autoimmune diabetes.\n\nBut on the other hand, immune cells reactive against essentially all non-self proteins and present at birth are ready to spring into action whenever a challenge is issued. It is for this very reason that conventional vaccinations can successfully be performed already in early infancy. And when a Coronavirus comes around, up rises the anti-Corona CTL team. When flu comes around, up rises the anti-flu team, etc. Each bout of training strengthens the team, enabling the opponent to be more rapidly constrained and infections terminated with increasing effectiveness.\n\nBut is such acquired immunity not voided and evaded by ever new virus “variants of concern”? Not so. Here, one must note that a protein will generate many fragments that are recognized by many different CTL clones. The proteins encoded by a virus mutant may generate one or a few differing fragments, but the majority of other fragments will remain the same. For this reason, CTL-based cross-reactivity and cross-protection exists between all members of a given virus family. In connection with COVID-19 specifically, it has been noted that previously infected persons may indeed sometimes contract another infection with a new variant, but such reinfections are almost never of a serious nature [9,10]. This is just as we should have expected; the narrative that emergence of virus mutations must be countered by development of customized vaccines has thus been fundamentally flawed right from the start.\n\nActivation of T-lymphocytes—but in this case, T-helper cells rather than CTL—is also coupled to B-lymphocyte activation, and this leads to antibody production (Figure 3). While CTL recognize fragments of proteins presented on the cell surface, antibodies bind to the intact proteins themselves. Bound antibodies then trigger activation of another major arm of immune defense, the complement system, with far-reaching consequences. A plethora of inflammatory events are triggered by complement activation. Furthermore, the complement system itself will attack and destroy the cell on whose surface activation occurs.\n\nIt follows from the above that production of “non-self” antigens by our own body cells will invariably provoke inflammatory and cell-destructive processes. In viral infections, this is to the purpose, because it leads to elimination of befallen cells. Most viruses target a limited spectrum of tissues, and most tissues can regenerate, so wounds can heal thereafter.\n\nProponents of gene-based vaccines commonly argue that these agents do nothing more than mimic what happens in actual virus infections. Expression of the alien protein is thereby claimed to be short-lived and confined mainly to the site of intramuscular injection. Any cell damage should likewise be limited, and serious adverse reactions are therefore not to be expected.\n\nNothing could be more misleading and further from the truth.\n\nThe assertion that LNP-packaged mRNA remains at the site of injection is by now widely known to be a blatant untruth. These “vaccines” rapidly spread from the site of injection to lymph nodes and the blood circulation [11]; and long-lived expression in organs and tissues at distance from the injection site has been documented repeatedly and with range of analytical techniques [12–15]. And because the vaccine particles can enter all nucleated cells, their uptake is bound to rapidly occur in cells of the lymph nodes, in endothelial cells that line the walls of blood vessels, and in cells of every tissue they reach.\n\nThis fact immediately sets apart “mRNA-vaccination” from naturally occurring infections. Very few infectious agents systemically target lymphocytes or endothelial cells. Amongst the latter are dangerous viruses that cause hemorrhagic fevers, and bacteria that also cause life-threatening infections, e.g. typhus and Rocky Mountain spotted fever.\n\nIn striking contrast, each and every mRNA-“vaccine” will incite self-destructive processes in lymphatic organs and in blood vessels throughout the body. The immense dangers of self-attack events occurring within the immunological control network have been outlined [16]. They include the reactivation of dormant infections (e.g. Herpes simples, shingles, EBV, CMV, tuberculosis, parasites), reduced capacity to control new infections, and activation or reactivation of neoplasms [17].\n\nConcomitantly, concerted immune attack will be mounted against the walls of vessels, whenever and wherever the endothelial cells become transfected (Figure 4). In the case of SARS-CoV-2, it is known that spike protein-specific cytotoxic T-cells are widely present in the blood of healthy individuals. This may be due to previous infection with this virus, but alternatively also to immunological cross-reactivity with other, related Coronaviruses [18,19]. With the appearance of specific antibodies, attack on cells carrying the alien proteins will be multiplied and intensified manifold through the action of complement and phagocytic cells. Blood clots forming in the wake of endothelial injury will result in circulatory disturbances. Ischemic cell death will have irreversible consequences in the central nervous system and the heart. Damage to vessel walls will predictably cause leakage of the vaccines to and uptake by cells of the respective organs, planting the seeds for myriad autodestructive events.\n\nAccumulating data are confirming these premonitions, and an emerging finding may prove to be distinctive and diagnostic for vaccine-mediated pathologies: vaccine-induced expression of spike protein within endothelial cells and resulting vasculitis will go hand in hand. The first illustration of this principle has been presented in a case report of a 76-year old man who died three weeks after receiving his third COVID-19 vaccination [20]. Histopathological analyses of the brain led to detection of multifocal vasculitis and necrotizing encephalitis. Small vessel vasculitis and lymphocytic myocarditis were found in the heart. Spike protein was detected within the foci of inflammation in both the brain and the heart, particularly in the endothelial cells of small blood vessels (Figure 5). Appropriate control experiments confirmed that the observed spike protein expression was indeed caused by the vaccine injections the patient had received, rather than by an undiagnosed infection with the virus itself.\n\nMultiorgan vasculitis, with notable involvement of small vessels, is now emerging as a common theme underlying adverse events following COVID-19 vaccination. Affliction of capillaries with thrombus formation in brain and heart are repeatedly being observed (Mörz [20]; Mörz and Burkhardt, unpublished). This pattern of disease in small and smallest vessels is novel and deemed by the authors to be characteristic for the action of gene-based vaccines.\n\nFulminant reactions may be expected to occur in patients who are vaccinated after recovery from genuine SARS-CoV-2 infections. Such patients will have high levels of circulating IgG antibodies against the spike protein [21], and complement attack on vaccine-transfected cells may then be immediate and massive. A case report of myocarditis-induced sudden death after first vaccination with direct evidence of complement activation on heart muscle cells has been published [22].\n\nIn our considered opinion, the outcome with future mRNA vaccines against other pathogens will be much the same as we have witnessed with the COVID-19 vaccines. It is true that the spike protein itself can promote blood clotting and inflammation without any help from the immune system [23]. Nevertheless, the already available evidence indicates that the grave, widespread and sustained injury to tissues and to blood vessels is mostly caused by the immune attack on spike protein-producing cells. This attack occurs simply because the spike protein is a non-self antigen; and since every other mRNA vaccine will encode its own non-self antigen, derived from whichever particular microbe it targets, we must expect that it will cause harm by the same mechanism and to a similar extent. These nightmarish scenarios will only get worse with every booster injection. The catastrophic events will be neither avoidable nor suppressible due to their very nature.\n\nThe disaster unfolding before our eyes could be, and was [24], predicted from first principles of immunology. The ability to distinguish between self and non-self is fundamental to life. It is already present at birth and ends only at death. It cannot be manipulated or controlled. Any attempt to do so with mRNA or other gene-based vaccines is doomed to failure.\n\nThe authors thank pathologists Prof. Arne Burkhardt, MD and Dr. Michael Mörz, MD for valuable discussion and above all for their dedicated and groundbreaking work on the tissue samples of vaccine victims.\n• The mucosal immune system of the upper respiratory tract and recent progress in mucosal vaccines . Auris nasus larynx (preprint)\n• The mucosal immune system: from fundamental concepts to vaccine development . Vaccine 10:75-88\n• Superior immune responses induced by intranasal immunization with recombinant adenovirus-based vaccine expressing full-length Spike protein of Middle East respiratory syndrome coronavirus . PLoS One 14:e0220196\n• Cutting Edge: Serum but Not Mucosal Antibody Responses Are Associated with Pre-Existing SARS-CoV-2 Spike Cross-Reactive CD4+ T Cells following BNT162b2 Vaccination in the Elderly . J. Immunol. 208:1001-1005\n• Community transmission and viral load kinetics of the SARS-CoV-2 delta (B.1.617.2) variant in vaccinated and unvaccinated individuals in the UK: a prospective, longitudinal, cohort study . Lancet Infect. Dis. (preprint)\n• Intranasal vaccination of recombinant adeno-associated virus encoding receptor-binding domain of severe acute respiratory syndrome coronavirus (SARS-CoV) spike protein induces strong mucosal immune responses and provides long-term protection against SARS-CoV infection . J. Immunol. 180:948-56\n• Survival of the fetus: fetal B and T cell receptor repertoire development . Semin. Immunopathol. 39:577-583\n• Genomic characterization and epidemiology of an emerging SARS-CoV-2 variant in Delhi, India . Science 374:995-999\n• Protection afforded by prior infection against SARS-CoV-2 reinfection with the Omicron variant . medRxiv (preprint)\n• Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines . J. Immunol. 207:2405-2410\n• Clinical and Molecular Characterization of a Rare Case of BNT162b2 mRNA COVID-19 Vaccine-Associated Myositis . Vaccines 10 (preprint)\n• Immune imprinting, breadth of variant recognition and germinal center response in human SARS-CoV-2 infection and vaccination . Cell (preprint)\n• Persistent varicella zoster virus infection following mRNA COVID‐19 vaccination was associated with the presence of encoded spike protein in the lesion . J. Cutan. Immunol. Allergy (preprint)\n• Shots and Shingles: What Do They Tell Us? .\n• Targets of T Cell Responses to SARS-CoV-2 Coronavirus in Humans with COVID-19 Disease and Unexposed Individuals . Cell 181:1489-1501.e15\n• A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against Covid-19 . Vaccines 10:2022060308\n• Safety, tolerability and viral kinetics during SARS-CoV-2 human challenge in young adults . Nat. Med. (preprint)\n• Myocarditis-induced Sudden Death after BNT162b2 mRNA COVID-19 Vaccination in Korea: Case Report Focusing on Histopathological Findings . J. Korean Med. Sci. 36:e286\n• Free SARS-CoV-2 Spike Protein S1 Particles May Play a Role in the Pathogenesis of COVID-19 Infection . Biochemistry Mosc 86:257-261\n• Urgent Open Letter from Doctors and Scientists to the European Medicines Agency regarding COVID-19 Vaccine Safety Concerns .", "opengraph": {"type": "article", "title": "Gene-based vaccination–quo vadis?", "description": "Sucharit Bhakdi MD, Karina Reiss PhD, and Michael Palmer MD 1. Rationale for development of vaccines The concept underlying vaccine development is straightforward: application of a harmless derivative of an infectious agent should stimulate the immune system to produce antibodies that protect against that agent. Introduction of any foreign substance into the body can never be entirely devoid of risks, however, so the prime question", "url": "https://doctors4covidethics.org/gene-based-vaccination-quo-vadis/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-10-10T17:22:13+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/08/spike-protein-small-vessels-d2c7d.jpg", "image:width": "975", "image:height": "479", "article:published_time": "2022-10-10T15:25:24+02:00", "article:modified_time": "2022-10-10T17:22:13+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "#ref1", "#ref2", "#ref2", "#ref3", "#ref4", "#ref5", "#ref6", "#ref3", "#ref7", "#fig1", "#ref8", "#ref9", "#ref10", "#fig3", "#ref11", "#ref12", "#ref15", "#ref16", "#ref17", "#fig-endothelial-attack", "#ref18", "#ref19", "#ref20", "#fig-ihc", "#ref20", "#ref21", "#ref22", "#ref23", "#ref24", "http://dx.doi.org/10.1016/j.anl.2021.07.003", "http://dx.doi.org/10.1016/0264-410X(92)90021-B", "https://www.ncbi.nlm.nih.gov/pubmed/?term=31329652", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35121642", "http://dx.doi.org/10.2139/ssrn.3897733", "http://dx.doi.org/10.1016/S1473-3099(21)00648-4", "https://www.ncbi.nlm.nih.gov/pubmed/?term=18178835", "https://www.ncbi.nlm.nih.gov/pubmed/?term=28466095", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34648303", "http://dx.doi.org/10.1101/2022.01.05.22268782", "https://archive.org/details/pfizer-confidential-translated", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35891299", "http://dx.doi.org/10.1016/j.cell.2022.01.018", "http://dx.doi.org/10.1002/cia2.12278", "https://doctors4covidethics.org/shots-and-shingles-what-do-they-tell-us/", "https://doctors4covidethics.org/covid-vaccination-and-turbo-cancer-pathological-evidence/", "http://dx.doi.org/10.1016/j.cell.2020.05.015", "https://www.ncbi.nlm.nih.gov/pubmed/?term=32999467", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.ncbi.nlm.nih.gov/pubmed/?term=35361992", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34664804", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33838638", "https://doctors4covidethics.org/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-vaccine-safety-concerns/"], "authors": [], "publish_date": "2022-10-10T15:25:24+02:00"}