{"result_id": "099019", "URL": "https://doctors4covidethics.org/mrna-a-serious-threat-to-mankind/", "timestamp": "2023-04-25 14:59:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/mrna-a-serious-threat-to-mankind/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "mRNA a Serious Threat to Mankind", "cleaned_text": "Freedom is the Cure: Unpacking and Defeating the Medical Tactics of a World Takeover\n\nBelow is an email that was sent out to Doctors for Covid Ethics subscribers and friends, summarising the first session of our fourth symposium, whose title carries what we view as one of the most important lessons of the COVID-19 operation: mRNA vaccines pose a serious threat to mankind.\n\nThank you for your ongoing interest in our endeavours. We hope that you have been finding information of interest and assistance to you on our website and Telegram channel, where we continue to provide honest, independent scientific analysis in the face of a global onslaught of weaponized ‘science’.\n\nTo that end, today we bring you the first session in our most recent symposium, held on June 11th 2022, titled, Freedom is the Cure: Unpacking and Defeating the Medical Tactics of a World Takeover, generously hosted by UK Column, and held in collaboration with Children’s Health Defense. At this our fourth symposium we brought together experts in science, medicine, psychiatry, finance, journalism and the law, to place the abuses of science surrounding COVID-19 in the context of a rapidly escalating global power grab, and against a backdrop of historical abuses by the medical profession. You can read about the symposium contributors here.\n\nWe have divided each session into individual presentations for you to watch and share at your leisure, summarised with links below. Meanwhile, if there just is one piece of information we hope you will take away from this event, to share with your family and friends, it is this:\n\nDuring Session 1, eight speakers across six segments expanded upon this crucial theme, covering scientific, medical and clinical aspects, the underlying regulatory fraud, and legal implications.\n\n1. Sucharit Bhakdi: The fundamental mechanism of damage is simple and universal\n\nTo open the symposium, Immunologist and Former Chair at the Institute of Medical Microbiology and Hygiene, Johannes Gutenberg University of Mainz, Professor Sucharit Bhakdi MD, explained how and why mRNA injections pose a mortal danger to their recipients, irrespective of the disease for which they are deployed. He called the decision to use the deadly COVID spike protein for the first mRNA rollout a uniquely brilliant tactic, under which the inherent dangers of mRNA technology can hide.\n\nThe reality, Dr Bhakdi explained, is that mRNA technology – spike protein or not – perverts the genetic functioning of the body’s cells by instructing them to produce disease fragments. This transforms our own cells and tissues from ‘self’ into ‘non-self’, inviting the immune system to attack. It is a recipe for medical disaster that turns the body against itself. Dr Bhakdi called the plan to roll out the underlying mRNA technology from COVID-19 to conventional vaccines:\n\n2. Michael Palmer: Summary of the evidence – irrefutable proof of causality\n\nDr Michael Palmer, former Associate Professor of Biochemistry at the University of Waterloo, provided an overview of damning autopsy evidence, which unambigiuously confirms that Sucharit Bhakdi, the first in the world to warn of blood clots and organ damage from mRNA ‘vaccines’, was right. Dr Palmer spelled out the significance of histology and histopathology findings from post-vaccine autopsies performed by Dr Arne Burkhardt, showing expression of spike protein, immune attack, and catastrophic damage such as aortic rupture in organs throughout the body.\n\nDr Palmer also discussed the “very remarkable” finding that bronchial tissue in the vaccinated continued expressing spike protein for nine months after vaccination. “We were promised this would be short-lived”, Dr Palmer said, noting that that the injected mRNA molecules should be expected to last only days, or at most a very few weeks.\n\nAs do findings of a Swedish study in 2022 showing that the Pfizer mRNA vaccine can convert into a DNA copy which can subsequently integrate into the chomosomal DNA. Such genetic modification may explain the dangerously prolonged spike protein production evidenced in Dr Burkhadt’s autopsy findings.\n\nOn all of these developments Dr Palmer stressed:\n\n3. Alexandra Latypova: Pfizer’s and Moderna’s preclinical vaccine trials – evidence of scientific and regulatory fraud\n\nSasha Latypova is an expert in drug development with 25 years experience in pharmaceutical R&D, including working in clinical trials globally, and interacting with the FDA on regulatory approvals and pharmaceutical data. She took the audience through the shocking breaches of protocol perpetrated by Pfizer and Moderna to bring their mRNA vaccines to market, and the role of the FDA in waiving those breaches through.\n\nSasha Latypova said that at every step Pfizer and Moderna showed a “shocking disregard for any previously established regulatory norms, and the FDA did not push back.” She added that European and other regulators operated in lockstep with the FDA to enable the manufacturers to sidestep protocol. She shared an image mapping out the typical pre-clinical steps omitted by Pfizer and Moderna, from drug interactions to cardiac effects to genotoxicity to carcinogenicity.\n\nIn addition to abrogating its regulatory functions, Sasha Latypova explained that the FDA misled the public on preclincal (animal) data regarding safety in pregnancy. Moderna found that its mRNA shot led to statistically significant skeletal malformations in the fetuses and offspring of injected pregnant rats, while the FDA wrote on its website that there were no pregnancy-related skeletal malformations. “Why is the FDA lying on behalf of the manufacturer?” Sasha Latypova asked. In Pfizer’s human clinical trial, she said, 90% of the pregnant women who were followed up by Pfizer lost their baby.\n\nRead her article on Pfizer and Moderna’s fraud here\n\nDr Thomas Binder is a specialist in cardiology and internal medicine, with a thesis in immumology and virology. He offered his perspective as a practicing clinician on the neccessity, efficacy and safety of mRNA vaccines, presenting both clinical and real-world evidence that the mass mRNA ‘vaccination’ campaign was neither necessary nor effective nor safe. In reality, the mRNA injections show negative efficacy, he explained. In other words, they do more harm than good, based not only on adverse events databases but numerous peer reviewed papers.\n\nDr Binder went on to describe post-vaccine injury syndromes caused by a combination of the self-to-self attack outlined by Sucharit Bhakdi and Michael Palmer, and the known toxicity of the mRNA injections’ lipid nanoparticles. Post-vaccine injury syndromes can involve localised damage in some people, and generalised damage in others, he said, resulting in specific diagnoses or diffuse systemic syndromes.\n\nFor those suffering vaccine injuries, Dr Binder outlined specific treatments for localised injuries, and he drew attention to the protocol for treating diffuse systemic post-vaccine syndromes published by the Frontline COVID-19 Critical Care Alliance (FLCCC) on May 25th 2022.\n\n5. Renate Holzeisen and Mary Holland with Polly Tommey: legal actions against mRNA vaccine approvals\n\nPolly Tommy, film producer, author and director of programming for CHD TV, interviewed lawyers Mary Holland, Director of the Graduate Lawyering Program at NYU School of Law and president of Children’s Health Defense, and Renate Holzeisen, European Human Rights lawyer, Barrister and specialist in European and International Law, who is fighting the Corona measures in Europe.\n\nMary Holland described legal actions underway in the United States by Children’s Health Defense, including:\n• None A petition to the FDA to halt emergency use authorisations for all COVID vaccines, based on deaths and injuries\n• None A lawsuit against the FDA for disseminating Emergency Use Authorization (EUA) vaccines when recipients believed that they were receiving approved licensed versions, fraudulently affording vaccine manufacturers the “vast liability protections” under the EUA\n• None A second lawsuit against the FDA challenging authorization of COVID vaccines for children, based on the accumulation of evidence that these products are “simply not safe.”\n\nMary Holland outlined successful US lawsuits against the CDC and other agencies to date, which have resulted in mask mandates and vaccine mandates being struck down, adding that many other US lawsuits against COVID measures are underway. On the prospects of legal success she said:\n\nRenate Holzeisen explained the legal significance of findings such as that from the University of Malmö that mRNA products carry a real risk of modifyling the DNA, reflecting the fact that the mRNA technology performs the same function as products previously defined as gene therapies. She stressed that there is a clear provision in the EU based on European Law that even for products not formally defined as gene therapies, but which perform the same function, an evaluation procedure must be followed via the Committe for Advanced Products. That procedure involves testing for gene toxicity and carcinogenicity, which has not been performed for the COVID mRNA ‘vaccines’. On this basis legal actions in Europe are seeking withdrawal of the conditional authorisations under which mRNA vaccines are being deployed.\n\nRenate Holzeisen described a very important legal decision three days earlier by a court in Sardinia, which ruled that obligatory COVID injection violated Italian constitutional law.\n\n6. Mary Holland and Brian Hooker with Polly Tommey: mRNA effects on fertility and sterility\n\nFinally Mary Holland and Polley Tommey joined Brian Hooker, specialist in microbiology and biotechnology and Associate Professor of Biology at Simpson University, to discuss COVID shots and fertility. Mary Holland began by describing a WHO-backed vaccination campaign in Kenya which is the subject of a documentary called Infertility: A Diabolical Agenda. The documentary reveals that the WHO worked for 30 years to create infertility-causing vaccines, and pushed out vaccines in Kenya that amounted to forced sterilization of young women.\n\nMary Holland cited a Kenyan doctor in the film who warned, “once they’re done with Africa they’re coming for you.”\n\nBrian Hooker elaborated on that theme by noting that the mRNA COVID vaccines have not been evaluated for safety in pregnancy, nor with respect to birth defects. He added that fertility issues associated with COVID-19 injections are “off the map”. Reports of vaccine-related fertility problems to VAERS following COVID vaccines, he said, have increased 10-fold in the last 18 months compared to the entire previous 31 years.\n\nIssues being reported include menstrual difficulties, passing of clots, miscarriage, bleeding in post-menopausal women, and similar problems in unvaccinated women close to those who have been vaccinated. Shedding of the uterus, moreover, a very rare condition, has increased dramatically in the medical literature since the rollout of COVID vaccines. Dr Hooker noted that these phenomena are not limited to mRNA injections, and are being observed across COVID shots. He added that biodistribution studies conducted by Pfizer showed the vaccine to accumulate in the ovaries, and that the only human study to examine COVID injections during pregnancy ran for just three months.\n\nPolly Tommey asked whether mothers injecting their baby girls and young daughters with COVID vaccines may be causing their sterilization. “Yes” was Brian Hooker’s answer.\n\nTaylor Hudak: Thank you for watching, and please share this information\n\nTaylor Hudak is an American journalist focused on human rights, media freedom and global corruption. She researches, writes, and produces video reports and interviews for The Last American Vagabond and acTVism Munich, and has been dedicated to bringing you the voices, knowledge and perspectives of censored doctors and scientists since the start of the manufactured pandemic. In this time of extreme censorship and human need, Taylor Hudak reminded viewers of the importance of sharing the information presented during the symposium. She said:", "opengraph": {"type": "article", "title": "mRNA a Serious Threat to Mankind", "description": "Below is an email that has been sent out to Doctors for Covid Ethics subscribers and friends, summarising the first session of our fourth symposium, whose title carries what we view as one of the most important lessons of the COVID-19 operation: mRNA vaccines pose a serious threat to mankind.", "url": "https://doctors4covidethics.org/mrna-a-serious-threat-to-mankind/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-09-08T20:42:08+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2022/06/Screen-Shot-2022-06-21-at-3.34.14-pm-scaled.jpg", "image:width": "2560", "image:height": "1600", "article:published_time": "2022-06-25T02:09:32+02:00", "article:modified_time": "2022-09-08T20:42:08+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "http://doctors4covidethics.org/blog/", "https://t.me/Doctorsforcovidethics", "https://doctors4covidethics.org/gold-standard-covid-science-in-practice-an-interdisciplinary-symposium-iv-freedom-is-the-cure/", "https://www.ukcolumn.org/", "https://childrenshealthdefense.org/", "http://doctors4covidethics.org/find-out-more-about-our-symposium-iv-contributors/", "https://doctors4covidethics.org/video-replays-d4ce-symposium-iv-session-i/", "https://rumble.com/v18bxi7-the-fundamental-mechanism-of-damage-is-simple-and-universal-with-prof.-such.html", "https://www.mdpi.com/1467-3045/44/3/73/htm", "https://rumble.com/v18by95-summary-of-the-evidence-irrefutable-proof-of-causality-with-michael-palmer-.html", "https://rumble.com/v18fkf9-pfizers-and-modernas-preclinical-vaccine-trials-evidence-of-scientific-and-.html", "https://doctors4covidethics.org/did-pfizer-perform-adequate-safety-testing-for-its-covid-19-mrna-vaccine-in-preclinical-studies-evidence-of-scientific-and-regulatory-fraud/", "https://www.thomasbinder.ch/", "http://covid19criticalcare.com/covid-19-protocols/i-recover-post-vaccine-treatment/", "https://rumble.com/v18fmbn-a-clinical-perspective-and-synopsis-with-thomas-binder-md.html", "https://live.childrenshealthdefense.org", "https://childrenshealthdefense.org/", "https://t.me/renateholzeisen", "https://www.mdpi.com/1467-3045/44/3/73", "https://www.mdpi.com/1467-3045/44/3/73/htm", "https://rumble.com/v18fsfb-legal-actions-against-mrna-vaccine-approval.html", "https://www.researchgate.net/profile/Brian-Hooker", "https://live.childrenshealthdefense.org/infertility-a-diabolical-agenda", "https://rumble.com/v18ftyl-mrna-effects-on-fertility-and-sterility.html", "https://www.thelastamericanvagabond.com/", "https://www.actvism.org/", "https://www.ukcolumn.org/", "https://doctors4covidethics.org/video-replays-d4ce-symposium-iv-session-i/", "https://doctors4covidethics.org/gold-standard-covid-science-in-practice-an-interdisciplinary-symposium-iv-freedom-is-the-cure/", "https://doctors4covidethics.org", "https://t.me/Doctorsforcovidethics"], "authors": [], "publish_date": "2022-06-25T02:09:32+02:00"}