{"result_id": "099020", "URL": "https://doctors4covidethics.org/long-term-persistence-of-the-sars-cov-2-spike-protein-evidence-and-implications-2/", "timestamp": "2023-04-25 14:59:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://doctors4covidethics.org/wp-content/uploads/2021/05/globe-60x60.png", "canonical": "https://doctors4covidethics.org/long-term-persistence-of-the-sars-cov-2-spike-protein-evidence-and-implications-2/", "encoding": "UTF-8"}, "image": null, "domain": "doctors4covidethics.org", "title": "Long-term persistence of the SARS-CoV-2 spike protein: evidence and implications", "cleaned_text": "Abstract: This paper discusses the recent study by Bansal et al. [1] on the detection of spike protein in persons vaccinated with the Pfizer mRNA vaccine. The most significant finding is that spike protein is found on exosomes, that is, cell-derived vesicles, for at least four months after the second injection. This surprisingly long persistence raises the prospect of sustained inflammation within and damage to organs which express the spike protein.\n\n1. The picture so far: Spike protein expression occurs early and is of short duration\n\nAn earlier study on the expression of spike protein after mRNA vaccination was reported by Ogata et al. [2]. The patients in that study had received the Moderna vaccine, which is similar to the one produced by Pfizer. In particular, both vaccines use mRNA that incorporates pseudouridine instead of uridine, which affects the stability in vivo of the RNA molecules. Moreover, while the two vaccines show some sequence deviation at the RNA level, they encode the very same spike protein sequence. We note, however, that the lipid nanoparticles used with the two vaccines differ in composition, which might influence the distribution of the vaccines in the body and the time course of spike protein expression.\n\n1.1. Plasma levels of spike protein fragment S1 and entire spike protein after mRNA vaccination\n\nS1 is a fragment of the spike protein that is cleaved by proteases already within the cells that express the whole protein, and which can be released into the bloodstream once the cleaved protein molecule appears on the cell surface. The S1 fragment can bind to ACE2 receptors on thrombocytes and other cells; this may contribute to the pathogenesis in COVID-19 [3] and also to the adverse effects of vaccination.\n\nAccording to [2], blood plasma levels of the S1 fragment rise quickly and decline again within no more than two weeks. The delayed rise of the whole spike protein is notable, yet expression is still of much shorter duration than apparent in Bansal’s study (see below). This finding, however, may result from interference of the patient’s own antibodies with this measurement (see next slide). In contrast, the analytical method used by Bansal et al. [1] removes this interference—it will detect spike protein even if already bound to antibodies.\n\nNote that Ogata et al. did not determine whether the S1 or full-length spike protein they found in the plasma was present in free form or bound to exosome particles (see later). Conceivably, the S1 was free, whereas the full-length spike protein may have been bound to exosomes.\n\nThese data, too, are from Ogata’s study. Antibodies to both the S1 fragment and to full length spike protein develop with a delay of 1-2 weeks after the first injection; after the second dose, they rise again and more rapidly. The slight drop from day 0 to day 1 may be due to the rapid expression of spike protein, which would bind pre-existing antibodies and take them out of circulation.\n\nThe fairly rapid immune response after the first injection suggests that it is mostly driven by immunological memory, which would be due to cross-immunity. This agrees with a study by Nielsen et al. [4], who found a similarly rapid response to SARS-CoV-2 infection. As Dr. Bhakdi has pointed out, this widespread cross-immunity means that most people are protected from severe disease due to SARS-CoV-2 even without vaccination [5].\n\nIf we compare this figure to the preceding one, we see that the levels of detectable circulating S1 fragment and full length spike protein drop concomitantly with the rise of antibodies. That is expected, in light of the detection method used by Ogata et al. [2] (see the following slides).\n\nThis picture illustrates only the initial steps of the procedure, namely, the capture and separation of the spike protein from the complex mixture of proteins found in the blood plasma. The method employs small magnetic beads that are coated with antibodies against the spike protein. These are mixed into a sample of blood plasma, and some time is allowed for the spike protein or S1 fragment to bind to the beads. Subsequently, the beads can be recovered using a magnet. This separation is followed by further steps that again use antibodies and ultimately generate an optical signal; however, these details need not concern us here.\n\nOnce the immune reaction to the vaccine sets in and newly formed spike protein antibodies appear in the bloodstream, they can bind to circulating S1 or full length spike protein molecules and prevent their capture by the antibodies coupled to the magnetic beads. This effect can explain why, in Ogata’s study, the levels of S1 and full-length spike protein detected in the plasma drop off as the amounts of antibody rise. Moreover, the highest levels of full-length spike arrive only after a substantial amount of antibodies is already present; this will likely cause those highest levels to be underestimated, too.\n\nSince the study by Bansal et al. [1] deals with spike protein on exosomes, we will first talk a little bit about exosomes as such.\n\n2.1. Exosomes are formed by pinching off bits of cell membrane and cytoplasm\n\nExosomes are little membrane vesicles, formed by pinching off bits of cell membrane from a cell surface, and filled with intracellular fluid and macromolecules. The two distinct pathways illustrated here—intracellular formation with subsequent release in bulk, or formation and release directly at the cell surface—are interesting, but they need not concern us here.\n\nExosomes carry cellular surface protein molecules (the little black “clubs” in the illustration) and also intracellular macromolecules (proteins and RNA). They may fuse with, or be taken up by, other cells and thus transmit cargo and information between cells.\n\nThis list is not exhaustive. A very good review on the subject is [6], from which the illustration in Section 2.1 was adapted.\n\nHepatitis B is a viral disease that is transmitted either by infected blood products or by intimate contact. In many patients, the virus gives rise to a chronic infection which the immune system does not manage to eradicate. In the blood of such patients, one can find not only infectious virus particles, but also non-infectious ones. These consist of host cell membranes, decorated with the viral surface antigen, but they lack the viral nucleic acids and capsid proteins inside.\n\nIn this picture, some infectious particles are highlighted with arrows; they are regularly shaped and denser (darker) as well as larger in diameter than most of the other particles, which are non-infectious. The latter may be thought of as exosomes, although they are not usually referred to as such. It has been proposed that such empty particles serve as decoys to deflect the attention of the immune system from the actual infectious particles and/or the infected cells.\n\nSimilar non-infectious particles or exosomes are also observed with several other viruses [6], and given the data reported by Bansal et al. [1] it appears that we can add SARS-CoV-2 to the list.\n\nAnother distinction we need to consider is that between regular exosomes, which are released by cells which are healthy or at least not about to die, from vesicles released by cells which are undergoing apoptosis (programmed cell death). The illustration on the left shows regular exosomes, whereas the one on the right shows ‘membrane blebbing’ in an apoptotic umbilical cord cell.\n\nApoptosis is important in many physiological contexts, including embryonic development, elimination of autoreactive immune cells, and also in the immune response to viral infections: cytotoxic T-lymphocytes recognize cells that express viral proteins and drive them into apoptosis by bombarding them with various cytotoxic agents. Thus, after infection or vaccination, the SARS-CoV-2 spike protein might conceivably occur both on proper exosomes and on apoptotic vesicles.\n\nApoptotic vesicles are typically somewhat larger than regular exosomes which are produced by live cells. However, if we look at the scale bars in these two pictures, we see that some of the incipient apoptotic vesicles are no more than a few hundred nanometres across; this overlaps with the size distribution of proper exosomes. Figure adapted from [6].\n\nWe now turn to the evidence presented by Bansal et al. [1].\n\n3.1. Detection of SARS-CoV-2 spike protein on an exosome with immunogold\n\nThis picture, adapted from Figure 1 in [1], shows an exosome or vesicle carrying spike protein, as is evident from the binding of ‘immunogold’, that is, small gold particles that are coated with antibodies. The reason for employing gold to detect specific target molecules in electron microscopy is this element’s very high density; the heavy gold particles stop the electron beam, causing black dots such as those shown in this picture.\n\nNote that the exosome in this picture is the only such particle shown by Bansal et al., and furthermore that it is rather large. Comparison with the preceding slide suggests a possible apoptotic origin, although we cannot be certain of it.\n\nWe also note that the decoration with immunogold is rather sparse, suggesting the presence of only a small number of spike protein molecules on this vesicle. However, as with the magnetic bead assay illustrated in Section 1.4, this may be due to interference by the patient’s own antibodies.\n\n3.2. Time course of spike protein on exosomes and of antibodies against it\n\nThis figure summarizes the key findings of the study. Spike protein on exosomes was negligible on the day of the first injection (D0) and remained so on day 7; it rose on day 14 after the first injection, peaked on day 14 after the second injection (D14-2), and decreased again but remained detectable at 4 months after the second injection (which is 5 months after the first). Antibodies to spike protein followed a similar time course but were not yet detected on day 14 after the first injection. Based on the apparent delay of the antibody response relative to the appearance of the exosome-associated spike protein, the authors propose that the latter is crucial for triggering the antibody response. We can make the following observations:\n• The most remarkable and medically significant finding is the very protracted expression of the spike protein. As long as the spike protein can be detected on cell-derived membrane vesicles, the immune system will be attacking the cells that release these vesicles. This applies regardless of whether the vesicles are ‘proper’ exosomes or apoptotic vesicles, although one straightforward explanation for the surprisingly late rise in the amount of spike protein on vesicles, and particularly also for the greater amount observed after the second injection, would be that these vesicles arise through the apoptosis of cells which are being attacked and destroyed by the immune response.\n• The very slow antibody response is at odds with most other studies, such as for example the one by Ogata et al. [2]. The assay employed by Bansal et al. may have lacked sensitivity. We must also keep in mind, though, that the two studies relate to similar but not identical vaccines (see Section 1).\n• Bansal et al. looked only for spike protein on exosomes, which were purified from plasma samples using centrifugation and filtration; unlike Ogata et al., they did not measure spike protein not bound to exosomes in whole plasma samples. This could explain why Bansal et al. did not detect the early peak of spike fragment S1 that was observed by Ogata et al.\n\nWe mentioned earlier that Ogata et al. [2] had also detected a delayed appearance of whole spike protein in plasma (Section 1.1), but that their measurements were likely subject to interference by the mounting antibody response (Section 1.3). It is pertinent to note that Bansal et al. [1] used SDS-polyacrylamide gel electrophoresis (SDS-PAGE) instead of magnetic beads to analyze the proteins in their samples. SDS-PAGE, which separates protein species according to molecular weight, will break up any complexes which spike protein may have formed with antibodies present in the blood plasma. It will therefore measure not only the unbound fraction but the total of the spike protein present. In this regard at least, we should prefer the data reported by Bansal et al. to earlier studies.\n\n3.4. Mice can be immunized with exosomes isolated from human vaccinees\n\nWe noted above that Bansal et al. inferred from their observations of the time course that exosome-bound spike is necessary for inducing an antibody response. The experiments depicted in this figure were carried out to support that claim: mice were injected with exosomes isolated from vaccinated people and shown to develop antibodies to spike protein.\n\nWhile the figure caption in the original study is not entirely clear, it seems that ‘Vaccinated’ mice were given conventionally purified spike protein, whereas the ‘CSP’ mice were injected with the exosomes. Antibody concentrations were measured on days 15, 21, and 30 after injection.\n\nIn further experiments, the mice were also shown to express increased amounts of the cytokines interferon-γ and of tumor necrosis factor-α. In our view, these findings do not amount to very strong evidence in support of the authors’ hypothesis.\n• Delayed onset of spike protein expression—but observation limited to spike on exosomes\n• EMA report on Pfizer also reported relatively slow onset of spike expression; on the other hand, early onset of blood clots etc. suggests early onset of spike expression\n\nWhile some specific claims made by Bansal et al. can be debated, the very long-lasting persistence of the spike protein in the body is convincingly demonstrated. Whether it is the mRNA encoding the spike protein that persists or rather the spike protein itself remains to be determined. Nevertheless, as long as the spike protein appears on either exosomes or apoptotic vesicles, it must be present on cell membranes; and as long as it is found there, the immune system will attack those cells.\n\nProtracted inflammation and impaired organ function have been reported both with the virus infection itself [7] and after vaccination [8]. While inflammation may arise from autoimmunity downstream of intense acute tissue damage, the long-term persistence of spike protein after vaccination offers another straightforward explanation, and it supports the notion that the vaccines will give rise to lingering and slowly progressing inflammatory disease.\n\nWe must also note that the spike protein persists for at least twice as long as the participants of Pfizer’s farcical and fraudulent [9,10] ‘clinical trials’ were observed, on average, after the second vaccination [11]. It follows that the reports on side effects which occurred in those trials cannot possibly be complete.\n• Bansal, S. et al. (2021) Cutting Edge: Circulating Exosomes with COVID Spike Protein Are Induced by BNT162b2 (Pfizer-BioNTech) Vaccination prior to Development of Antibodies: A Novel Mechanism for Immune Activation by mRNA Vaccines. J. Immunol. 207:2405-2410\n• Ogata, A.F. et al. (2021) Circulating SARS-CoV-2 Vaccine Antigen Detected in the Plasma of mRNA-1273 Vaccine Recipients. Clin. Infect. Dis. (preprint)\n• Letarov, A.V. et al. (2021) Free SARS-CoV-2 Spike Protein S1 Particles May Play a Role in the Pathogenesis of COVID-19 Infection. Biochemistry Mosc 86:257-261\n• Nielsen, S.S. et al. (2021) SARS-CoV-2 elicits robust adaptive immune responses regardless of disease severity. EBioMedicine 68:103410\n• Bhakdi, S. et al. (2021) Letter to Physicians: Four New Scientific Discoveries Regarding COVID-19 Immunity and Vaccines—Implications for Safety and Efficacy.\n• van der Pol, E. et al. (2012) Classification, Functions, and Clinical Relevance of Extracellular Vesicles. Pharmacol. Rev. 64:676-705\n• Thacker, P.D. (2021) Covid-19: Researcher blows the whistle on data integrity issues in Pfizer’s vaccine trial. BMJ p. n2635\n• Palmer, M. et al. (2021) Expert evidence regarding Comirnaty (Pfizer) COVID-19 mRNA Vaccine for children.", "opengraph": {"type": "article", "title": "Long-term persistence of the SARS-CoV-2 spike protein: evidence and implications", "description": "This paper discusses the recent study by Bansal et al. on the detection of spike protein in persons vaccinated with the Pfizer mRNA vaccine. The most significant finding is that spike protein is found on exosomes, that is, cell-derived vesicles, for at least four months after the second injection. This surprisingly long persistence raises the prospect of sustained inflammation within and damage to organs which", "url": "https://doctors4covidethics.org/long-term-persistence-of-the-sars-cov-2-spike-protein-evidence-and-implications-2/", "site_name": "Doctors for COVID Ethics", "updated_time": "2022-08-29T21:37:13+02:00", "image": "https://doctors4covidethics.org/wp-content/uploads/2021/11/exosomes-2021-11-27.png", "image:width": "750", "image:height": "333", "article:published_time": "2021-12-21T16:39:26+01:00", "article:modified_time": "2022-08-29T21:37:13+02:00"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "#", "#", "https://doctors4covidethics.org/", "https://doctors4covidethics.org/wp-content/uploads/2021/11/bansal-notes.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34654691", "http://dx.doi.org/10.1093/cid/ciab465", "https://www.ncbi.nlm.nih.gov/pubmed/?term=33838638", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34098342", "https://doctors4covidethics.org/letter-to-physicians-four-new-scientific-discoveries-crucial-to-the-safety-and-efficacy-of-covid-19-vaccines/", "http://dx.doi.org/10.1124/pr.112.005983", "https://www.ncbi.nlm.nih.gov/pubmed/?term=34024217", "https://www.openvaers.com/covid-data", "http://dx.doi.org/10.1136/bmj.n2635", "https://doctors4covidethics.org/expert-evidence-regarding-comirnaty-covid-19-mrna-vaccine-for-children/", "https://www.fda.gov/media/144245/download"], "authors": [], "publish_date": "2021-12-21T16:39:26+01:00"}