{"result_id": "100010", "URL": "https://draxe.com/health/pneumonia-symptoms/", "timestamp": "2023-04-25 15:00:02 CEST+0200", "meta": {"description": "Pneumonia is one of the most common infectious conditions on the planet that can sometimes be life-threatening. Here are pneumonia symptoms to watch for.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/pneumonia-symptoms/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Prime Your Body to Prevent Pneumonia Symptoms", "cleaned_text": "Pneumonia is the single largest infectious cause of death in children globally, killing more than 2,500 children a day worldwide. It’s also to blame for up to 7 percent of all deaths in adults. (1) According to the American Lung Association, believe it or not there are more than 30 different causes of pneumonia. (2) Luckily not every case is very serious or life-threatening, especially those considered to be “walking pneumonia,” a milder type that rarely requires serious intervention or hospitalization to deal with pneumonia symptoms.\n\nThe most common cause of pneumonia infections is complications due to other respiratory illnesses, especially the flu. Other reasons you or your child might come down with pneumonia? These include contact with certain fungi or viruses, catching pneumonia from someone’s who infected, or even exposure to indoor air pollution and toxic chemicals.\n\nThe severity of pneumonia symptoms that someone experiences depends on factors like the specific type of pneumonia the person has (bacterial versus viral), medical history, age and strength of the immune system. If you have viral pneumonia, unfortunately you also are at risk for getting bacterial pneumonia too — making pneumonia symptoms even worse and complications more likely.\n\nWhat can you do to help lower your odds of developing pneumonia, especially if you already have several other risk factors like a history of lung damage, smoking or other respiratory problems? The first step is to eliminate any voluntary risk factors that increase your chances of catching bacterial infections or viruses in the first place — especially suffering from nutrient deficiencies, leaving illnesses untreated and cigarette smoking.\n\nPneumonia is a type of respiratory infection that affects the lungs. Pneumonia infections can be bacterial or viral, which partially determines the type of pneumonia symptoms that someone develops due to having the illness.\n\nInitially when someone develops pneumonia, symptoms are about the same whether the infection is caused by bacteria or a virus (these normally include mild fever, a dry cough, headache, muscle pains and fatigue/weakness). Feverish symptoms tend to get worse however within several days when the pneumonia infection is bacterial in nature. Most people start to display more severe pneumonia symptoms within about three days of the infection taking hold, including having trouble breathing, coughing up mucus and developing higher fevers. In some cases, viral pneumonia causes more symptoms than bacterial cases do, although each person is different.\n\nIs pneumonia contagious? Yes, pneumonia can spread from person to person, but it can also develop in other ways too.\n\nThe same types of bacteria or viral pathogens that cause pneumonia infections are already present in many people’s airways and sinuses (especially in children, who carry these organisms in their noses and throats). The real problem starts when these organisms enter and infect the lungs. How strong someone’s immune system is largely determines whether or not these organisms have the chance to spread, proliferate and cause an acute lung infection, which is exactly why improving overall immunity is the best way to protect yourself or your children.\n\nThe most common signs and symptoms of pneumonia are: (3)\n• Persistent coughing, sometimes which can become painful\n• Coughing up mucus — sometimes mucus can contain small amounts of blood or appear green and/or yellow\n• Trouble breathing normally and shortness of breath — wheezing is more common when the pneumonia is viral\n• Chest pains, especially when moving around and breathing more heavily\n• Developing a fever — usually fevers are mild but in some people become high (in cases of bacterial pneumonia, fevers can sometimes cause body temperature to rise to almost 105 degrees F), and in the case of bacterial pneumonia, it can take several days for fevers to become severe\n• Experiencing other symptoms of a fever, such as having the chills, headaches, stomach aches, confusion/disorientation, shaking or sweating\n• Sometimes rapid heartbeat, rapid breathing, changes in skin color and becoming delirious, especially when experiencing a high fever\n• In infected infants, serious complications can sometimes develop, including being unable to drink, unconsciousness, and convulsions\n\nWondering about symptoms of walking pneumonia exactly and if it’s also contagious? Walking pneumonia is a non-medical term to describe a mild case of pneumonia, usually caused from bacteria in the lungs. Most cases of walking pneumonia are due to a bacterial microorganism called Mycoplasma pneumoniae, which is contagious and spread just like other types of pneumonia.\n\nHow long does pneumonia last in most cases?\n\nEvery person reacts to pneumonia infections differently, but most usually start to show symptoms within about three to seven days of the infection developing. Some have pneumonia symptoms in as little as one day, while others might be contagious but not show symptoms for up to 10 days. Most struggle with pneumonia symptoms for about two to three weeks before feeling totally better, although a quicker recovery and developing complications that last longer are both also possible. (4)\n\nHow do you get pneumonia exactly, and who has the highest risk of developing this illness?\n\nPneumonia is caused by a variety of infectious agents and develops when the lungs become filled with pus and mucus, making it hard to breath, get enough oxygen and control coughing. The parts of the the lungs that are most affected by pneumonia infections are called the alveoli, which are small sacs that normally fill up with air/oxygen and allow for someone to breathe properly. (5)\n\nWhile people of all ages and levels of health can develop pneumonia for many different reasons, researchers believe that there are five main infectious agents to blame that are the primary causes of pneumonia:\n• Certain types of harmful bacteria, which lead to infection of the lungs. These most commonly include Streptococcus pneumoniae (especially in children with pneumonia) and Haemophilus influenzae type b (Hib). Pneumocystis jiroveci is another type of bacteria that’s associated with death due to pneumonia in children with viruses, such as HIV.\n• Certain types of viruses. This type of pneumonia is often called respiratory syncytial virus.\n• Mycoplasma, which contributes to walking pneumonia most often.\n• Exposure to certain toxic chemicals (such as from fumes, tobacco products or cigarettes) that weaken the immune system.\n\nInfectious agents that cause pneumonia can be transmitted from person to person or spread from certain parts of someone’s body (like the nose) to the lungs. Some of the ways these agents are passed include someone:\n• Inhaling them. Organisms can be spread via airborne droplets.\n• Being near someone else who is infected and coughing or sneezing.\n• Being exposed to blood from someone with pneumonia.\n• Pregnancy and delivery. If the mother is infected, the infant can become infected after being exposed to her blood.\n• Becoming infected with the flu or another respiratory infection/virus (such as a cold, laryngitis, bronchitis or influenza)\n• Having any chronic respiratory or lung disease, such as COPD or cystic fibrosis\n• Being an older adult — research shows that the elderly tend to suffer from pneumonia and experience more serious complications than younger adults\n• In children, having any form of chronic respiratory disease or frequent respiratory infections, especially COPD, severe allergies or asthma\n• In infants, if their mothers were infected or have another respiratory illness they can become infected too\n• Having a weakened immune system due to other illness like autoimmune disorders, viruses such as HIV, measles, hepatitis or serious infections\n• Malnutrition, lack of safe drinking water or undernourishment due to a poor diet\n• In infants, being formula-fed instead of breast-fed, which improves immunity\n• Smoking cigarettes and having related complications, such as lung damage or emphysema\n• Having difficulty swallowing (due to a history of other medical problems, such as suffering from a stroke, dementia, cerebral palsy or Parkinson’s disease)\n• A history of common inflammatory diseases that weaken the immune system, including diabetes, heart disease or liver disease/damage\n• Living or spending lots of time in tight quarters, especially if unhygienic, where you’re in close contact with other infected people (this can include nursing homes, day cares, etc.)\n• Exposure to air pollution, both inside and outside — indoor air pollution can be caused from parents smoking or burning/heating with biomass fuels\n\nTreatment for pneumonia depends on its cause, specifically if it’s bacterial pneumonia or viral pneumonia. According to the World Health Organization (WHO), “Pneumonia can be prevented by immunization, adequate nutrition, and by addressing environmental factors. Pneumonia caused by bacteria can be treated with antibiotics, but only one third of children with pneumonia receive the antibiotics they need.” (6)\n\nThe type of oral antibiotic that’s most commonly used to treat bacterial pneumonia is called amoxicillin, which is usually given in tablet form. Remember that viruses cannot be cured with antibiotics, so in this case the patient must overcome the illness by waiting and managing symptoms. Most people don’t require hospitalization unless complications develop, such as a very high fever, or it’s an infant who’s infected. In recent years, vaccines have also been introduced for certain types of pneumonia, specifically those that target Hib and the pneumococcal conjugate type.\n\nAs you’ll learn, there are also many natural ways you can protect yourself from the different pathogens that cause pneumonia. Today, most of the focus regarding pneumonia is on prevention since this is the best way to keep complications and transmission from causing widespread problems. Not relying on antibiotics also lessens the risk globally for antibiotic-resistant pneumonia.\n\nLimiting your exposure to other people with the infection, while at the same time boosting immune strength, is the best way to control pneumonia transmission and is critical for both prevention and treatment. Steps you can take to immediately reduce your risk for infections or viruses include:\n• Improving your diet and gut health — Avoid inflammatory or common allergenic foods like processed grains, gluten, conventional dairy products, lots of added sugar, processed foods with synthetic ingredients and sweetened beverages with artificial flavors.\n• Taking probiotic supplements — Probiotics help populate the GI tract with healthy bacteria that actually keep bad bacteria in check. You can also get probiotics from your diet naturally by eating probiotic foods like cultured veggies and yogurt.\n• Getting enough sleep — Aim for seven to nine hours per night.\n• Exercising — The benefits of exercise include improving immune function, helping prevent infections and lowering inflammation.\n• Managing stress — Stress can increase inflammation, weaken the immune system and make infectious symptoms last longer than necessary.\n• Other immune-boosting supplements — These include vitamin C, astragalus root, licorice root, echinacea, garlic, turmeric and ginger, which can speed up healing. There are also other antiviral herbs that keep you protected from future infections and recurrences .\n\nOne of the best ways to prevent pneumonia infections in infants and children is to exclusively breast-feed them during the first year of life, followed by providing adequate nutrition during their earliest years. This has been shown to help protect young children from numerous illnesses beyond pneumonia too, including allergies and asthma.\n\nIn addition to breast-feeding babies, risk for infection and mortality due to pneumonia during infancy or childhood is greatly reduced when children aren’t malnourished and have access to safe drinking water and sanitary living/school environments. Avoiding exposure to secondhand smoke, preventing indoor air pollution, treating food allergies, preventing nutrient deficiencies and keeping up with doctors appointments can all keep your baby or child safe.\n\nTo help keep a fever from getting worse or a high fever from causing further complications, here are tips that you can implement at home:\n• Suck on ice cubes or make homemade ice pops to prevent dehydration.\n• Take cooling baths or showers, or wrap a damp, chilled towel around your neck. You can also soak a towel in peppermint oil for extra cooling effects, thanks to its natural menthol.\n• Get enough electrolytes by making homemade green or fruit smoothies or from drinking coconut water.\n• Get plenty of rest and sleep.\n• Take an over-the-counter fever reducer if symptoms become very bad, such as ibuprofen or Advil.\n• Consume mucus-reducing foods to naturally treat coughs or wheezing, including homemade vegetable soups, bone broth and green tea.\n• Breath in moist, warm air as much as possible, avoiding very cold temperatures.\n• Rub on a topical cough suppressant or use natural cough syrup made with essential oils like eucalyptus, thyme, cedarwood, nutmeg, camphor and peppermint.\n• Avoid strenuous workouts that can make shortness of breath or chest pain worse.\n• Clean your home regularly to remove irritants, inhale or diffuse essential oils, and try using a humidifier.\n• Clean up dust mites, pet hair and other common allergens (especially if someone in the family suffers from asthma symptoms).\n• Prevent pneumonia from spreading by washing your hands regularly with soap (ideally the kinds made with natural ingredients that fight bacteria).\n• Don’t smoke indoors or burn toxic fumes when cooking or heating your home.\n• Inhaling gases and contact with construction debris should also be avoided at work.\n• Reduce your use of household products made with strong chemicals, instead using natural cleaning products to help clean surfaces, fabrics and even your skin.\n• Very drastic temperature changes, humidity, high temperatures or extreme cold might all make pneumonia symptoms worse, so try to avoid these situations.\n• The WHO reports that pneumonia results in more than 920,000 deaths in children each year. This accounts for roughly 15 percent of all deaths of children under the age of 5 years old.\n• It’s also to blame for up to 7 percent of all deaths in adults, or more than 4 million deaths annually. (7)\n• People in every nation develop pneumonia, but the infection is most prevalent in underdeveloped nations, especially parts of South Asia and sub-Saharan Africa.\n• People living in underdeveloped nations develop pneumonia up to fives more often than those living in industrialized nations do. India, China, Pakistan, Bangladesh, Indonesia and Nigeria are currently the nations with the highest prevalence rates of pneumonia. (8)\n• Worldwide over $109 million is spent annually in antibiotics to treat pneumonia infections.\n• Infants and children under 4 years old or elderly adults who are over 75 are most at risk for developing pneumonia.\n• Of around 450 million total cases of pneumonia per year, about 200 million are due to viral strains of the infection.\n• In the U.S. alone every year, approximately 1.86 million emergency visits are due to pneumonia. (9)\n• Between 20 percent to 40 percent of people with pneumonia visit the hospital and require hospitalization.\n• More than $10 billion is spent in the U.S. annually to treat pneumonia infections and complications, making it one of the most expensive conditions to manage for the health care system.\n• Pneumonia occurs during the winter months more than any other time of the year, similar to the flu.\n• Males tend to get pneumonia more often than females do, and African-Americans tend to suffer more commonly than Caucasians.\n• Because walking pneumonia is usually milder than other cases, symptoms are normally less severe and sometimes not even very noticeable at all.\n• While pneumonia commonly causes symptoms like fatigue, fever, the need for bed rest or sometimes even hospitalization, some people with walking pneumonia are able to carry on with their regular routines for the most part, although they’re still contagious.\n• It’s believed that during “outbreaks” of walking pneumonia, which occur every several years on average, this type accounts for about half of all pneumonia cases.\n• Walking pneumonia is usually caused from bacterial infection due to mycoplasma. It affects people living or working in tight quarters most often, since it’s usually transmitted through tiny airborne droplets, passed from sneezing or coughing.\n• People with walking pneumonia are generally contagious for about 10 days, even when they don’t show symptoms.\n• Higher prevalence rates for walking pneumonia have been reported among school-aged children, military recruits and adults younger than 40 who live in places like homeless shelters, prisons, or crowded and unsanitary buildings. People living in nursing homes or staying in the hospital are also at risk for all types of pneumonia.\n• Compared to more severe cases of pneumonia that are most common during the winter, walking pneumonia usually peaks in prevalence during the late summer months.\n\nIf you’re concerned you might have pneumonia, call your doctor immediately to confirm, especially if you’re recovering from another respiratory illness like the flu or you’re over the age of 65. Infants and young children should also be evaluated if they’re suspected to have pneumonia, since they’re at the highest risk for serious complications. If you notice signs of pneumonia complications, including those listed below, visit the emergency room to help prevent the situation from worsening.", "opengraph": {"locale": "en_US", "type": "article", "title": "Prime Your Body to Prevent Pneumonia Symptoms", "description": "Worried about pneumonia? Here are the symptoms to look for and what to do about them.", "url": "https://draxe.com/health/pneumonia-symptoms/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-11-01T18:47:03+00:00", "image": "https://draxe.com/wp-content/uploads/2016/09/Pneumonia-FBNLMeme-01.png", "image:width": "780", "image:height": "410", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Pneumonia", "#Pneumonia_Symptoms_and_Signs", "#Pneumonia_Causes_and_Risk_Factors", "#Conventional_Treatment_for_Pneumonia_Symptoms", "#Prevention_and_Natural_Treatments_for_Pneumonia_Symptoms", "#Pneumonia_Statistics_and_Facts", "http://data.unicef.org/child-health/pneumonia.html", "http://www.lung.org/lung-health-and-diseases/lung-disease-lookup/pneumonia/symptoms-causes-and-risk.html", "https://draxe.com/health/flu-natural-remedies/", "https://draxe.com/health/indoor-air-quality-natural-solutions/", "http://www.lung.org/lung-health-and-diseases/lung-disease-lookup/pneumonia/?referrer=https://www.google.com/", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://draxe.com/health/how-to-get-rid-of-nausea/", "https://draxe.com/health/low-body-temperature/", "https://draxe.com/health/mycoplasma/", "http://www.webmd.com/lung/tc/pneumonia-what-happens", "https://en.wikipedia.org/wiki/Pulmonary_alveolus", "https://statistics.blf.org.uk/pneumonia", "http://www.mayoclinic.org/diseases-conditions/respiratory-syncytial-virus/basics/definition/con-20022497", "https://www.cdc.gov/pneumonia/atypical/mycoplasma/", "https://draxe.com/health/cystic-fibrosis/", "https://draxe.com/health/copd-symptoms/", "https://draxe.com/health/breast-milk/", "https://draxe.com/health/liver-disease/", "http://www.who.int/mediacentre/factsheets/fs331/en/", "https://www.drugs.com/amoxicillin.html", "https://draxe.com/health/antibiotic-resistance/", "https://draxe.com/health/how-to-boost-your-immune-system/", "https://draxe.com/health/7-signs-symptoms-you-have-leaky-gut/", "https://draxe.com/nutrition/probiotics-benefits-foods-supplements/", "https://draxe.com/nutrition/probiotic-foods/", "https://draxe.com/fitness/benefits-of-exercise/", "https://draxe.com/nutrition/turmeric-curcumin-benefits/", "https://draxe.com/nutrition/antiviral-herbs/", "https://draxe.com/health/food-allergies-treatments-natural-remedies/", "https://draxe.com/health/dehydration-symptoms/", "https://draxe.com/health/electrolyte-imbalance/", "https://draxe.com/health/home-remedies-cough/", "https://draxe.com/beauty/homemade-cough-syrup/", "https://draxe.com/essential-oils/essential-oil-uses-benefits/", "https://draxe.com/health/asthma-symptoms/", "https://draxe.com/health/natural-cleaning-products/", "http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(10)61459-6/abstract", "http://www.who.int/bulletin/volumes/86/5/07-048769.pdf", "https://hcup-us.ahrq.gov/reports/statbriefs/sb155.jsp", "https://medlineplus.gov/ency/article/000086.htm", "https://draxe.com/health/asthma-symptoms/"], "authors": [], "publish_date": null}