{"result_id": "100011", "URL": "https://draxe.com/health/heavy-metal-detox/", "timestamp": "2023-04-25 15:00:03 CEST+0200", "meta": {"description": "Exposure to heavy metals can result in reduced mental function, lower energy levels and damage to organs. Here's the comprehensive heavy metal detox treatment plan.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/heavy-metal-detox/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Have You Done a Heavy Metal Detox?", "cleaned_text": "Symptoms and even chronic diseases related to heavy metal toxicity (also called heavy metal poisoning) is now considered to be a problem that millions of people deal with. (1)\n\nExposure to toxic heavy metals is believed to be a contributing factor, if not a root cause, of symptoms like low energy, mood disturbances and cognitive changes. Heavy metals first enter your bloodstream from exposure to farmed fish, contaminated water, dental fillings and household products. These metals then travel throughout your body and penetrate the cells of various tissues and organs, where they can remain stored up for years!\n\nHow do you treat heavy metal toxicity? Following a heavy metal detox plan is one of the best ways to start reversing symptoms. One thing to be aware of, however, is that while you work on overcoming metal poisoning, you might actually notice some symptoms getting worse before they get better. Potential heavy metal detox symptoms can include fatigue, loss of appetite and digestive issues.\n\nWhat foods can help remove heavy metals from the body? As you’ll learn more about below, foods to include in a heavy metal detox include leafy green veggies, other non-starchy veggies, herbs, spices, algae and other superfoods, and bone broth.\n\nDetoxifying treatments and certain supplements can also be incorporated into a natural heavy metal diet plan to help support your brain, nervous system, liver and other vital organs. Want to learn how to detox your body from heavy metals and other chemicals? Follow detox diet and treatment plan described below to help rid your body of toxins.\n\nWhat exactly are “heavy metals”? Heavy metals are elements that can be toxic and very dangerous even in low concentrations. Heavy metals that can lead to toxicity (or “poisoning”) include: (2)\n• Other definitions include manganese, iron, lithium, zinc and calcium (yes, under certain conditions very high levels of even essential minerals can become dangerous) (3)\n\nHeavy metal poisoning describes a number of health problems caused by exposure to environmental metals that accumulate inside the body. According to a report in Scientific World Journal, “Toxic metals such as arsenic, cadmium, lead, and mercury are ubiquitous, have no beneficial role in human homeostasis, and contribute to noncommunicable chronic disease.” (4)\n\nResearchers have identified that significant exposure to at least 23 different environmental metals (called “heavy metals”) can contribute to acute or chronic toxicity. These metals are described as being heavy because they stick around in the body, especially hiding out in adipose tissue (fat cells). They are difficult to get rid of, making them similar to fat-soluble toxins. Body fat tries to protect the organs by trapping certain substances inside, including some metals, which causes them to linger. This is one reason weight loss can sometimes result in heavy metal detoxing, as fat cells shrink and release dormant toxins.\n\nThere is virtually no way to entirely avoid heavy metal exposure, considering metals are natural elements found all over the world in the food supply, water and ground. (5) Environmental metals are problematic because over time, they can accumulate within bodily tissues, often without the person who is affected even realizing this is happening. Heavy metal toxicity can result in damaged or reduced mental and central nervous function, plus damage to the vital organs — such as the liver, heart, endocrine glands and kidneys.\n\nLong-term exposure to heavy metals may lead to physical, muscular, and neurological degenerative processes. When they become severe, heavy metal poisoning symptoms can even mimic symptoms associated with Alzheimer’s disease, Parkinson’s disease and multiple sclerosis. Because heavy metal poisoning symptoms mimic those related to aging (such as loss of memory and increased fatigue), many people blame getting older as the cause of their emerging symptoms, not realizing that heavy metal exposure is a major contributing factor.\n\nWhat Are the Signs and Symptoms of Heavy Metal Poisoning?\n\nSome of the most common warning signs that you might be struggling with heavy metal toxicity include:\n• Chronic aches and pains, such as those associated with fibromyalgia\n\nWhere Do Heavy Metals Come From?\n\nMercury poisoning is one of the most common types of heavy metal poisoning. Almost every single person in the world has at least trace amounts of mercury in his or her body. Why? Some of the factors that can cause mercury poisoning (and other types of heavy metal toxicity) include:\n• Exposure to environmental pollutants, such as traffic fumes, air pollution, food contaminants, cigarette smoke or radiation.\n• Having metal amalgam dental fillings (silver fillings slowly release mercury into the body).\n• Eating a poor-quality diet (for example, eating farm-raised fish that carry high levels of mercury). According to the Environmental Protection Agency, the most common way we’re exposed to mercury in the U.S. is by consuming fish you shouldn’t eat that contains health-hazardous heavy metals, such as tilefish, swordfish, shark, king mackerel and bigeye tuna. (6) A diet that includes processed foods, especially those that are imported from foreign countries and not organically grown (and even plant foods grown in soil that has high levels of metals) can also be a contributing factor.\n• Drinking water that is contaminated with trace amounts of metals (such as aluminum).\n• From birth (heavy metals can be passed down in utero from mother to her offspring).\n• Exposure or use of household substances that carry mercury, such as adhesives, air condition filters, cosmetics, fabric softeners, felt, floor waxes and polishes, and talcum powder.\n• Exposure to substances that carry lead, such as some chocolates, canned foods, toothpastes, old paints, insecticides, ceramic and some pottery, and soldered pipes.\n• Use or exposure to other household items, such as antiperspirants, baking powder, certain baby formulas, plastic toys, antacids, aluminum foil, certain metal pots and pans, stainless steel cutlery, coins, and some makeup.\n\nIn high amounts, mercury is one of the deadliest metals there is. Certain studies have found that when nerves are exposed to mercury, the myelin sheath (the fatty substance that surrounds the axon of some nerve cells and helps with electrical signaling) can become severely damaged, interfering with how nerves communicate.\n\nWhat are some warning signs and side effects associated with mercury poisoning? These include: changes to the central nervous system, irritability, fatigue, behavioral changes, tremors, headaches, problems hearing, skin damage and cognitive loss. (7)\n\nCan you die from heavy metal poisoning? While it’s rare, it’s possible — in some severe cases, metal poisoning has lead to hallucinations and death.\n\nWhat Is a Heavy Metal Detox? Plus Benefits of Heavy Metal Detox\n\nIf someone has reason to believe that they have had excessive exposure to metals, they should seek medical testing for metal poisoning by speaking with their doctor or integrative practitioner/naturopath. Heavy metal testing in the form of hair analysis or a blood test is now widely available and is useful for confirming suspected toxicity. Even if you choose not to be tested for toxicity, many of the diet and lifestyle changes described below will still be beneficial for immune system function, gut health, liver function and more.\n\nThe primary goal of a heavy metal detox is to remove accumulated heavy metals from your brain and nervous system. The kidneys, liver, heart, lymphatic system and respiratory system will also benefit from detoxification, such as a liver cleanse.\n\nHow are toxins removed from the body? The most common way is through chelation. Chelation therapy is a medical procedure (although it can also be performed at home) that involves the administration of chelating agents to remove heavy metals from the body by binding to molecules and allowing them to be dissolved and excreted in the urine.\n\nChelation is central to natural detoxification of heavy metals because it works with glutathione and other small molecules to promote excretion. It’s recommended that it be performed by a doctor since serious side effects are possible, such as removal of essential minerals and cognitive impairment. (8)\n\nOther ways to detox the body of heavy metals include making dietary changes and using herbs and supplements, which help to break down metals into smaller molecules so they can be removed from urine, feces, sweat and even the breath.\n• Better protection against diseases cognitive disorders and autoimmune disease\n\nRelated: Brain Detox: Is It Time for a Cleanse? (Plus How to Do It)\n\nFirst and foremost, changing your diet should be the first step you take to improve your overall health. What foods can help remove heavy metals from the body?\n\n\n\n Foods to eat while doing a heavy metal detox include:\n• Leafy green veggies — Greens are some of the most powerful heavy metal detox foods. Try to have some type of bitter greens each day, such as kale, swiss chard, dandelion greens, mustard greens, arugula, spinach or beet greens. Broccoli sprouts are another great food for providing antioxidants and reducing inflammation.\n• Herbs and spices — Anti-inflammatory, antioxidant herbs and spices like basil, parsley, oregano, rosemary, thyme, ginger, turmeric, cinnamon and cilantro can help remove heavy metals. Cilantro (along with other green herbs and plants) is one of the best herbs for detoxifying and can help reduce the buildup of heavy metals like mercury and lead in the body. (9) Try adding herbs like cilantro and parsley to fresh-squeezed green juices.\n• Foods rich in vitamin C – Fruits and vegetables rich in vitamin C can reduce the damage caused by heavy metal toxicity by acting as an antioxidant. High-vitamin C foods include citrus fruits like oranges or grapefruit, leafy greens like spinach and kale, all types of berries, broccoli and cruciferous veggies, kiwi, papaya, guava and bell pepper.\n• Garlic and onions – These vegetables contain sulfur which helps your liver detoxify itself of heavy metals like lead and arsenic.\n• Water – Drink 8 ounces of water or vegetable juice every two hours to stay hydrated and help flush out toxins.\n• Flax and chia seeds – These provide omega-3 fats and fiber that can help with detoxification of the colon and reduce inflammation.\n• Bone broth— Bone broth helps to keep you hydrated, provides important mineral, and supports liver health by providing glutathione. It also provides amino acids that help strengthen the organs. Consume bone broth by either making your own and sipping on several cups daily, or by using protein powder made from bone broth.\n• Farmed fish – Farmed fish, especially those from foreign countries where the quality is not monitored, can contain heavy metals, dioxins and PCB’s which are highly toxic. The worst offenders are tilefish, swordfish, shark, king mackerel and bigeye tuna. You can continue to eat fish up to several times per week — just make better choices that are low in mercury and purchase wild-caught fish, ideally from a local fisherman that you trust.\n• Food allergens – If your body is fighting against common allergens and dealing with high levels of inflammation, it will not be able to detoxify from heavy metal poisoning as well.\n• Non-organic foods – These foods increase exposure to chemicals which make symptoms worse. Some of the worst offenders include conventional apple juice and brown rice products. For a list of other foods that you should always try to buy organic, see this list of the Dirty Dozen, detailing the most pesticide-contaminated produce as tested by the Environmental Working Group (EWG).\n• Foods with additives – Additives may aggravate toxicity symptoms and decrease your body’s ability to detoxify.\n• Alcohol – Too much alcohol is toxic to the body and can make it more difficult for your liver to process other toxins.\n\nSupplements to take that may help you overcome heavy metal poisoning include:\n• Chlorella (1-4 grams per day, or about 4-8 caps daily) — Chlorella is a type of green algae that acts as a natural chelator to remove heavy metals, especially lead and mercury. It’s a great source of chlorophyll and is “hungry” to absorb other metals. You can take it in powder or tablet form.\n• Vitamin C (3000 milligrams daily) — Acts as an antioxidant to help reduce free radicals.\n• Cilantro (preferably taken as a tincture 2x per day)\n• Shilajit (between 100-500 milligrams daily, typically in powder form) — Shilajit is an adaptogenic plant that has certain things in common with activated charcoal, especially that it contains a lot of carbon. It’s a natural chelator because it contains fulvic acid and humic acid that bind to toxic molecules. (10)\n• Milk Thistle (150 milligrams taken 2x daily, or milk thistle tea 1-3 times daily) — This is one of the most popular herbs for detoxifying the liver. Silybin is a component with the greatest degree of biological activity that has strong antioxidant properties. It may act as a toxin blockade agent by inhibiting binding of toxins to cell membrane receptors. Silymarin has been shown to reduce liver injury and is used to treat alcoholic liver disease, acute and chronic viral hepatitis and toxin-induced liver diseases. (11)\n• Probiotics (soil-based, 50 billion units one time daily) — Can help improve detoxification of the gut and help boost immunity.\n• Chelation therapy — Of all heavy metal detox products, chelation therapy is probably one of the most effective ways to reduce serious heavy metal exposure, especially metals like lead, mercury, aluminum and arsenic. Chelation therapy involves a chemical solution called EDTA (ethylenediaminetetraacetic acid), which is administered into the body, typically directly into the bloodstream via injection, so it can bind with excess minerals. EDTA chelation therapy helps to eliminate metals by binding salts to molecules. After EDTA attaches to heavy metals, together they both move to the kidneys where they are eliminated through urine. Most people need between 5–30 chelation sessions to see the best results. While it’s considered to be generally safe, side effects are possible. What are potential side effects of chelation therapy? These include burning at the injection site, vomiting, feeling dizzy, fever, headaches, nausea, low blood sugar symptoms and blood pressure changes.\n• Activated charcoal— Activated charcoal is a treatment that works to eliminate metals and toxins via adsorption, or the chemical reaction where elements bind to a surface. The porous surface of activated charcoal has a negative electric charge that causes positive charged toxins and gas to bond with it. Charcoal is so powerful that it’s used as a emergency treatment for removing poisons from the body very fast. (12) It’s full of carbon and can help discard heavy metals and other toxins. Look for activated charcoal made from coconut shells or identified wood species that have ultra-fine grains. Follow directions based on the specific type you use. Whenever you take activated charcoal, it’s imperative to drink 12–16 glasses of water per day.\n• Bentonite clay— Clays are used to absorb toxins because they act like a sponge or magnet for chemicals and metals inside the body. (13) Due to its poly-cationic nature, bentonite clay leads to absorption of negative charge toxins. Most clays are meant for topical use only (they are not meant to be ingested). However, some high-quality, organic clays can be used internally, although you need to be very careful about doing this (contact the manufacturer to ask if it’s safe to consume the clay). Historically, many cultures ate clay to obtain minerals and help cleanse their bodies of parasites and other microbes. If you do want to use clay internally, mix 1/2 teaspoon with water, shake to combine and take once daily.\n• Triphala— Triphala is a a traditional Ayurvedic herbal formulation made from the dried powder of three different fruits that contain the strong antioxidants called gallic acid, ellagic acid and chebulinic acid. (14) Triphala has antibacterial, anti-inflammatory and anti-diarrheal abilities. Consuming triphala can help to cleanse the digestive tract, relieve constipation and produce regular bowel movements, which are important for removing metals, bacteria, and excess fatty acids from the body. It can be consumed in tea form, powder form, as liquid tincture or in capsule form. Take it on an empty stomach, ideally about two hours before bedtime.\n• Homemade Anti-Itch Cream — If you deal with skin irritation or itchiness either before or during your heavy metal detox, then apply anti-itch cream to help soothe the inflammation. This cream contains coconut oil and shea butter to boost hydration, essential oils to fight infection and help with healing, and ingredients like apple cider vinegar and bentonite clay to cleanse and detoxify the skin. Spread the cream over itchy skin irritations 2–3 times (avoid if you have an allergy to any of the ingredients).\n\nDetox drinks and recipes can help to naturally reduce inflammation, boost energy, support digestion, cleanse the liver and promote gut health. Detox drinks are especially useful for providing raw vegetables, fruits and herbs that stimulate detoxification while providing vitamins and minerals. Many detox drinks can be made with ingredients you already have at home, like lemon juice, apple cider vinegar, cucumbers, leafy greens, berries, ginger, herbs or melon. You can also make detoxifying water drinks, which you can sip on throughout the day.\n\nBelow are recipes to incorporate into your heavy metal detox plan:\n\nHeavy Metal Detox Symptoms + How to Deal with Them\n\nWhen you begin to detoxify, certain symptoms can be expected as you body starts to acclimate. Before you wind up feeling better and seeing improvements in your health, you might actually feel worse at first for a brief period of time. This is a sign that your body is going through changes that might not feel very great, but ultimately they will leave you healthier once you get through them. Remember that your body heals itself, and in the process you might need to go through a transition phase that feels uncomfortable.\n\nWhat are the side effects of detoxing? Potential heavy metal detox symptoms you might temporarily experience while you’re cleansing include:\n• Metallic or sour taste in the mouth\n\nSome people find that if they jump into a detox too “aggressively” and quickly, they wind up dealing with significant side effects/symptoms. It’s advised that you detox slowly and gradually; start by making dietary changes and then beginning incorporating herbs, supplements and treatments over the course of at least several weeks or months.\n\nTry to stick with the detox plan outline above and be patient — it will be worth it! To ease symptoms, stay hydrated, get plenty of sleep, eat a nutrient-dense diet, manage stress and only do moderate exercises until you gain more energy.\n\nHow long can you expect it to take for a heavy metal detox to begin working? It really depends on how high your levels are, the source(s) of exposure and the efforts you make to rid yourself of these metals.\n\nRemember that heavy metal exposure slowly takes place over many years, so getting rid of them will not happen overnight. It might take months for even longer for you reverse the problem, but it’s important to stay on track since toxicity can have a negative life-long impact on your health.\n\nBecause heavy metal toxicity causes such a range of health problems, it can be easy to confuse toxicity without another underlying health condition. If you have concerns about your heavy metal levels, it’s a good idea to see a doctor for testing who can help diagnose you. Regarding what to do amalgam about dental fillings, talk to your dentist about available options (I recommend seeking out a IAOMT-certified dentists who has been trained in biocompatible dentistry).\n\nIt’s especially important for women who are considering becoming pregnant in the near future to know their heavy metal levels, since toxicity can contribute to developmental problems in newborns. If a women has been diagnosed with high levels of a heavy metal, such as mercury, it’s recommended that she delay pregnancy by at least a few months so they can work on restoring normal levels first.\n• Heavy metals are elements that can be toxic and very dangerous even in low concentrations. The most dangerous heavy metals include mercury, lead, cadmium and arsenic.\n• Causes of heavy metal toxicity include environmental pollution, food contamination, water contamination, metal dental fillings and use of household/beauty products that contain trace amounts of metals.\n• Heavy metal detoxes use foods, herbs, supplements and treatments to excrete metals from the body via the urine, feces, sweat and breath. Some of the most effective include chelation therapy, bentonite clay, milk thistle, triphala, bone broth, bitter leafy greens, algae, raw juices and herbs.\n• Symptoms might get worse during a detox before they get better as the body transitions and cleanses.\n\nRead Next: Is Eating Tilapia Worse than Eating Bacon?", "opengraph": {"locale": "en_US", "type": "article", "title": "Have You Done a Heavy Metal Detox?", "description": "Suffering from odd symptoms like fatigue, autoimmune issues and skin irritation without knowing the cause? You might be suffering from heavy metal poisoning. Here's a detox treatment plan that anyone can do.", "url": "https://draxe.com/health/heavy-metal-detox/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2023-01-19T02:01:24+00:00", "image": "https://draxe.com/wp-content/uploads/2014/06/Heavy-Metal-Detox_FB.jpg", "image:width": "1230", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "400", "embed_code": "<iframe src=\"https://www.youtube.com/embed/813D8qhsoWQ\" width=\"100%\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/813D8qhsoWQ"}], "links": ["#Dangers_of_Heavy_Metals_aka_Heavy_Metal_Poisoning", "#What_Is_a_Heavy_Metal_Detox_Plus_Benefits_of_Heavy_Metal_Detox", "#Heavy_Metal_Detox_Diet", "#Heavy_Metal_Detox_Recipes", "#Heavy_Metal_Detox_Symptoms_How_to_Deal_with_Them", "https://www.ncbi.nlm.nih.gov/pubmed/22315626/", "https://www.ncbi.nlm.nih.gov/pubmed/22505948/", "https://en.wikipedia.org/wiki/Metal_toxicity", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3654245/", "http://www.dartmouth.edu/~toxmetal/toxic-metals/metals-primer.html", "https://draxe.com/health/alzheimers-natural-treatment/", "https://draxe.com/health/california-bans-chemicals-in-beauty-products/", "https://draxe.com/health/chronic-fatigue-syndrome/", "https://draxe.com/health/autoimmune-disease-symptoms/", "https://draxe.com/health/manic-depression/", "https://draxe.com/health/ibs-symptoms/", "https://draxe.com/health/anemia-symptoms/", "https://draxe.com/health/mercury-poisoning/", "https://draxe.com/health/dangers-of-amalgam-fillings/", "https://draxe.com/nutrition/fish-you-should-never-eat/", "https://www.fda.gov/food/foodborneillnesscontaminants/metals/ucm115644.htm", "https://draxe.com/nutrition/processed-foods/", "https://draxe.com/health/chronic-fatigue-syndrome/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3253456/", "https://draxe.com/health/metal-in-baby-food/", "https://draxe.com/health/liver-function/", "https://draxe.com/nutrition/liver-cleanse/", "https://draxe.com/nutrition/glutathione/", "http://onlinelibrary.wiley.com/doi/10.1038/clpt.2010.132/abstract?systemMessage=Please+be+advised+that+we+experienced+an+unexpected+issue+that+occurred+on+Saturday+and+Sunday+January+20th+and+21st+that+caused+the+site+to+be+down+for+an+extended+period+of+time+and+affected+the+ability+of+users+to+access+content+on+Wiley+Online+Library.+This+issue+has+now+been+fully+resolved.++We+apologize+for+any+inconvenience+this+may+have+caused+and+are+working+to+ensure+that+we+can+alert+you+immediately+of+any+unplanned+periods+of+downtime+or+disruption+in+the+future.", "https://draxe.com/health/brain-detox/", "https://draxe.com/nutrition/broccoli-sprouts/", "https://draxe.com/nutrition/top-herbs-spices-healing/", "https://draxe.com/nutrition/cilantro-benefits/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4055906/", "https://draxe.com/nutrition/vitamin-c-foods/", "https://draxe.com/nutrition/omega-3-benefits-plus-top-10-omega-3-foods-list/", "https://draxe.com/nutrition/bone-broth-benefits/", "https://draxe.com/health/dirty-dozen/", "https://draxe.com/nutrition/7-proven-chlorella-benefits-side-effects/", "https://draxe.com/nutrition/shilajit/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3296184/", "https://draxe.com/nutrition/milk-thistle-benefits/", "https://www.ncbi.nlm.nih.gov/pubmed/20564545", "https://draxe.com/nutrition/probiotics-benefits-foods-supplements/", "https://draxe.com/health/chelation-therapy/", "https://draxe.com/beauty/natural-deodorant/", "https://draxe.com/nutrition/activated-charcoal-uses/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5942148/", "https://draxe.com/nutrition/10-bentonite-clay-benefits-uses/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5632318/", "https://draxe.com/nutrition/triphala/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4293677/", "https://draxe.com/beauty/diy-anti-itch-cream/", "https://draxe.com/nutrition/apple-cider-vinegar-uses/", "https://draxe.com/recipes/secret-detox-drink/", "https://draxe.com/nutrition/detox-drinks/", "https://draxe.com/nutrition/healthy-smoothie-recipes/", "https://draxe.com/nutrition/switchel/", "https://draxe.com/nutrition/dandelion-tea/", "https://draxe.com/nutrition/milk-thistle-benefits/", "https://draxe.com/health/bloated-stomach/", "https://draxe.com/health/how-to-stop-diarrhea/", "https://draxe.com/nutrition/nutrient-dense-foods/", "https://iaomt.org/for-patients/why-use-iaomt-dentists/", "https://draxe.com/eating-tilapia-is-worse-than-eating-bacon/"], "authors": [], "publish_date": null}