{"result_id": "100003", "URL": "https://draxe.com/health/chicken-pox-symptoms/", "timestamp": "2023-04-25 14:59:54 CEST+0200", "meta": {"description": "Chicken pox symptoms usually affect children between the ages of 2 to 12, but adults can get it too. Click here to learn 4 natural ways to soothe symptoms.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/chicken-pox-symptoms/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Chicken Pox Symptoms + How to Find Natural Relief", "cleaned_text": "Even though chicken pox is one of the most common viruses that children between 4 and 12 years old experience, many people are still not sure exactly why the virus occurs, how it spreads or how to manage chicken pox symptoms.\n\nWhat is chicken pox and what does it look like? Chicken pox (also called varicella) is a very contagious viral infection that usually affects children. But it can also affect adults who are not immune to the virus. The virus is often mild in children but more serious in adults. In most cases chicken pox goes away within several weeks, but, rarely, in severe cases it can be life-threatening.\n\nWhat makes chicken pox tricky to prevent is that it is contagious within one to two days of someone catching the virus, which is several days before they usually show any symptoms. Chicken pox symptoms usually include an itchy skin rash characterized by small, fluid-filled blisters that later form crusts. (1) Some of the first signs and symptoms of chicken pox might also include fever, abdominal pain, fatigue and muscle aches.\n\nChicken pox is the common name for the varicella-zoster virus. The virus is very contagious and can spread quickly through transmission of respiratory droplets that travel through the air, or from direct contact with another infected person’s skin fluids. The varicella-zoster virus (VZV) is a very common type of alpha herpes virus that causes both symptoms of chicken pox (varicella) and symptoms of shingles (herpes zoster). The virus is actually one of the herpes viruses (there are several types); acquiring chicken pox does not mean someone then has herpes.\n\nChicken pox symptoms usually affect children between the ages of 2 and 12 (the virus is most common between the ages of 4 and 10). When someone has chicken pox as a kid but overcomes it, it’s possible that the virus will become dormant in their immune system only to become reactivated at a later stage in life. When this happens the person develops shingles, another virus that causes a painful skin rash.\n\nHow long does chicken pox usually last? It’s rare for chicken pox symptoms to last more than two weeks, starting from the time when blisters first appear to when they disappear. Most people have a chicken pox rash for about 5–10 days. (2) How quickly someone is able to overcome the virus depends on the strength of their immune system and their current health.\n\nHow can you identify chicken pox? The easiest way to recognize chicken pox is by looking for a red, itchy rash that forms on the face, scalp, chest, back and, to a lesser extent, the arms and legs. The most common chicken pox symptoms include: (3)\n• Developing a red skin rash that is usually severely itchy and uncomfortable. Chicken pox rashes go through three stages, but usually the skin feels itchy the whole time. The rash first fills with clear fluid, then ruptures and forms crusts. Breakouts of the rash can continue happening for one to two weeks. Normally the rash is active for about five days, but then healing starts to take place. It’s common for blisters to be at various stages of development at the same time (bumps, blisters and scabbed lesions). Chicken pox rashes will usually be more severe in children than in adults.\n• Fever, which is usually more severe in adults with chicken pox than children. This may cause a stiff neck, nausea, etc. and usually lasts about 3–5 days.\n\nAfter exposure to the virus, chicken pox symptoms usually emerge within about two to three weeks. A chicken pox rash will usually start with superficial pink or red spots forming on the infected person’s face, chest or back. As the rash progresses it becomes worse, filling with clear fluid. The spots can then rupture and form crusts before beginning to heal. Sometimes a secondary infection can develop while the blisters are rupturing and crusting, which can contribute to an ongoing fever and scarring (although this usually doesn’t happen).\n\nChicken pox is most threatening when it affects a child who has lung damage or a history of lung disease, nervous system complications, any type of severe bacterial infection, or a weakened immune system. According to the Centers for Disease Control and Prevention (CDC), even though most children with chicken pox will fully overcome the virus and experience no long-term health problems as a result, there are certain serious complications that can be caused by chicken pox, including varicella pneumonia, internal infection of the organs, hepatitis or encephalitis (inflammation of the brain). (4)\n\nIn adults with chicken pox pneumonia is a bigger threat. When either a child or adult has a compromised immune system, due to a history of another illness or from taking immunosuppressant drugs, the situation becomes more complicated to treat. And in pregnant women experiencing symptoms of chicken pox, precautions need to be taken in order to minimize the risk that the baby will contract the virus and be born with a congenital deformity.\n\nWhat is the cause of chicken pox? The chicken pox virus develops when someone who is not immune to the disease (usually a child) breathes in an infected droplet or has direct contact with bodily fluids that contain the virus. The most common way that someone has direct contact with the virus is by touching another infected person’s skin and coming into contact with fluids that leak from blisters caused by the chicken pox rash. Chicken pox blisters usually fill with fluid before rupturing and blistering. During the whole process the skin is very contagious.\n• Never having had chicken pox before\n• Having a weakened immune systems or taking immuno-suppressing medications, which can include cancer treatments or treatment for HIV\n• Having close contact with anyone who is infected or was recently infected (both children and adults)\n• Working in close contact with children, such as in a daycare or school\n• Never having been vaccinated for chicken pox\n• Being an infant or newborn whose mother never had chickenpox or the vaccine\n\nRarely, someone will get chicken pox more than once, but the vast majority of the time it only affects people one time (usually while they are a child).\n\nThe varicella-zoster virus attacks a part of the spine that contains sensory cells and nerves. It can remain dormant as it “hibernates” for many years, causing zero noticeable symptoms. (6) For some people the virus will come back as shingles, which causes blisters that are very painful. Adults over 60 years old are most likely to get shingles, although it can develop in younger adults too. Some people suffering from shingles also deal with post-herpetic neuralgia, a condition that leaves the affected skin area feeling painful even after the rash clears.\n\nThe good news is that in most healthy children chicken pox does not require much (or any) medical attention and treatment. If you do wish to get an official diagnosis, a doctor can make a diagnosis by examining the rash and accompanying symptoms. A child or adult with chicken pox who also has another illness that weakens their immune system should always seek help and medical attention to reduce risk for complications.\n• If someone has a high-risk case of chicken pox, their doctor might prescribe medications such as antiviral drugs to shorten the duration of the infection and help to manage inflammation.\n• Two types of antiviral drugs that are sometimes used to manage chicken pox are called acyclovir and immune globulin intravenous. Others that are less commonly used are valacyclovir and famciclovir. (7)\n• You should never take aspirin if you have chicken pox as this is associated with serious complications including . Instead you can take an over-the-counter (OTC) pain killer if you’re in a lot of pain, such as acetaminophen or ibuprofen.\n\nIn 1995 the varicella vaccine (aka the chicken pox vaccine, that goes by the brand name Zostavax) was first introduced to the public. (8) A booster form of the vaccine is also available for children between the ages of 4–5. If you choose to vaccinate, most health authorities recommend that children receive the chicken pox vaccine between 12 and 18 months of age. Older children, and even teens and adults, can also receive the vaccine at a later age if they have never had the virus, especially if they are in a high-risk group. For people over the age of 13 who have never had the virus and want to get the vaccine, they will need more than one dose (usually two) that are spread apart by four to eight weeks.\n\nAre you definitely immune to chicken pox if you’ve been vaccinated? Actually, no; it’s important to know that the chicken pox vaccine doesn’t offer total protection from the virus. Once someone is vaccinated with the varicella vaccine, they still have a slight chance of developing chicken pox. Some children, and adults, too, will still develop symptoms of chicken pox that can fortunately be treated by giving it time, resting, soothing the skin and supporting the immune system.\n\nIn fact, varicella vaccination is not as effective as the natural immunity that develops by having the virus. (9) Plus, as I mentioned previously, among otherwise healthy children, most cases of chicken pox are not severe and will heal without much intervention.\n\nIf you do choose to vaccinate, it’s important to be aware of possible side effects so that you can recognize them if they occur and contact your health care provider.\n\nKeep in mind that the chicken pox vaccine is not approved for use by pregnant women, people with certain immune system conditions, or people who have allergies to microbes and antibiotics that are used in the vaccine.\n\nTry to keep the skin moist by taking frequent warm (but not very hot) baths. You can add uncooked oatmeal or colloidal oatmeal to your baths to provide relief from itching. Even though it’s very tempting, don’t pick at the skin or scratch areas that are itchy. This usually makes the rash worse and can lead to infections. If you find yourself scratching the rash during the night, consider wearing gloves.\n\nGently applying a cool, damp compress to inflamed skin can help to reduce swelling, heat and itchiness. Use a natural fabric like cotton and avoid putting ice directly on the skin. You might also want to apply an antihistamine lotion to painful areas, such as calamine lotion.\n\nChicken pox might cause you to have no appetite or feel nauseated. Make sure to prevent dehydration, especially if you have a fever and are vomiting, by drinking fluids and eating water-rich foods. If sores develop inside the mouth, then eat soft, bland foods that are easily digested and won’t cause irritation, such as broth, pureed veggies or fruit, smoothies, oatmeal, yogurt or cooked potatoes.\n\nYou should never take aspirin if you have chicken pox (or give it to your child who does) because aspirin can lead to complications while the virus is active, including Reye’s syndrome. Instead you can take an over-the-counter pain-killer if you’re very uncomfortable, such as acetaminophen or ibuprofen. Additionally, some people choose to take antihistamines such as diphenhydramine. Other natural pain killers include peppermint essential oil and Epsom salts.\n\nMost of the time an otherwise healthy child or adult with chicken pox should simply stay home and give the virus time to pass. However, there are times when intervention is needed. Anyone who is immunodeficient or younger than 6 months old should always get medical treatment right away. You should also see your doctor immediately if you notice any of the following happening while you’re experiencing symptoms of chicken pox:\n• The rash shows signs of infection, such as becoming very swollen, warm, tender or painful.\n• Signs of high fever (higher than 102 F or 38.9 C) or neurological problems start to occur, such as vomiting, very stiff neck, , disorientation, rapid heartbeat, shortness of breath, or tremors.\n• Chicken pox is the common name for the varicella-zoster virus that causes a very itchy skin rash. It usually affects children but can also affect adults who are not yet immune to the virus.\n• The chicken pox virus is very contagious and can spread quickly through transmission of respiratory droplets that travel through the air, or from direct contact with another infected person’s skin fluids.\n• Symptoms of chicken pox include developing a rash of small, fluid-filled blisters that later form crusts, and possibly also a fever, abdominal pain, fatigue, nausea and body aches.\n• Don’t take aspirin for symptoms as it can cause complications.", "opengraph": {"locale": "en_US", "type": "article", "title": "Chicken Pox Symptoms + How to Find Natural Relief - Dr. Axe", "description": "Chicken pox symptoms usually affect children between the ages of 2 to 12, but adults can get it too. Click here to learn 4 natural ways to soothe symptoms.", "url": "https://draxe.com/health/chicken-pox-symptoms/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-07-18T14:03:44+00:00", "image": "https://draxe.com/wp-content/uploads/2017/11/ChickenPox_FB.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Chicken_Pox", "#Chicken_Pox_Symptoms_Signs", "#Chicken_Pox_Risk_Factors", "#Conventional_Treatments_for_Chicken_Pox", "#4_Natural_Treatments_for_Chicken_Pox_Symptoms", "#Precautions_When_Treating_Chicken_Pox_Symptoms", "#Final_Thoughts_on_Chicken_Pox_Symptoms_Natural_Remedies", "https://draxe.com/beauty/6-rash-natural-remedies/", "http://www.mayoclinic.org/diseases-conditions/chickenpox/symptoms-causes/syc-20351282", "https://draxe.com/health/muscle-relaxers/", "https://draxe.com/health/shingles-symptoms/", "https://ancientnutrition.com/collections/popular-products?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_20offjan", "http://www.mayoclinic.org/diseases-conditions/chickenpox/symptoms-causes/syc-20351282", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0072805/", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://draxe.com/health/stiff-neck/", "https://draxe.com/health/loss-of-appetite/", "https://draxe.com/health/natural-headache-remedies-relief/", "https://draxe.com/health/pneumonia-symptoms/", "https://www.cdc.gov/chickenpox/hcp/high-risk.html", "http://www.mayoclinic.org/diseases-conditions/chickenpox/symptoms-causes/dxc-20191277", "https://draxe.com/health/10-natural-cancer-treatments-hidden-cures//", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2563790/", "https://www.webmd.com/drugs/condition-165-Chickenpox.aspx?diseaseid=165&diseasename=Chickenpox", "https://draxe.com/health/reyes-syndrome/", "http://www.mayoclinic.org/drugs-supplements/varicella-virus-vaccine-subcutaneous-route/description/drg-20067091", "https://draxe.com/health/how-to-boost-your-immune-system/", "http://www.sciencedirect.com/science/article/pii/S0264410X12007761", "http://www.nvic.org/Ask-Eight-Questions.aspx", "https://ancientnutrition.com/pages/supergreens-detox?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensdetox", "https://draxe.com/health/dehydration-symptoms/", "https://draxe.com/health/natural-painkillers/", "https://draxe.com/health/dizziness/", "https://draxe.com/health/scarlet-fever-rash/"], "authors": [], "publish_date": null}