{"result_id": "100040", "URL": "https://draxe.com/health/biologics/", "timestamp": "2023-04-25 15:00:31 CEST+0200", "meta": {"description": "Biologics or biological medicine is an emerging treatment for a variety of diseases ranging from autoimmune disorders to cancer to Alzheimer's disease.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/biologics/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "New Treatment for Alzheimer's and Other Chronic Diseases", "cleaned_text": "Traditionally, treating a disease or condition went something like this: you had symptoms. You were diagnosed with a condition by your doctor and then together, you searched for its origin and tried to figure out how best to treat it. But what if you could turn that idea on its head and instead, figure out how to use genetic variations to change your body’s course and manipulate its behavior?\n\nAs it turns out, this type of medication exists. Say hello to biologics, or biological medicine. This emerging type of healthcare is becoming more popular for a variety of diseases ranging from autoimmune disorders to cancer. In fact, by 2019, biologics are expected to be a $220 billion market, with the U.S. accounting for nearly half of sales. (1)\n\nBut what are they? Are they safe? And should you or a loved one be using them? Let’s dig in.\n\nSo what are biologics? They are medicines usually made from certain types of cells that produce the right type of protein to treat the medical issue. In some ways like prolotherapy and PRP treatment that are used to heal injuries, biologics can also be made from other parts of our body, like DNA or hormones. Usually, the biologic treatment is injected into the body.\n\nWhile biologics sound new and fancy, they’ve actually been around for some time. Also known as biopharmaceuticals, vaccines, insulin and human growth hormones are all biologics — they’re considered the first generation, in fact.\n\nToday, the term usually refers to a category of therapeutic medicine that’s produced through a biological process that involves recombinant DNA technology, or rDNA. Biologics are the fastest-growing type of therapeutic compounds, with nearly 300 different types of biologics available to humans.\n\nWhat’s interesting about biologics is that because biologics are made from proteins, they can’t be produced the way drugs usually are, mixing chemicals together to get a certain result. While medicine is sophisticated, we don’t know exactly what type of proteins we need or how, exactly, the body produces them. But we do know what genes are related to what proteins. So to make biologics, scientists “trick” specific cells into creating the proteins they need. (2, 3)\n\nFirst, they isolate the right gene for the necessary protein. Once that’s sorted out, the scientists can insert the gene into the host cell’s DNA and tell it to keep this “special” cell alive. This gets the cells to produce extra protein, doing the scientists work for them. Do this in large amounts, and you have a little protein-making factory that can eventually be transformed into drugs for people who need them.\n\nWhat Are the Benefits of Biologics?\n\nBiologics are usually prescribed because other medications haven’t been successful in treating the disease. Because they reduce inflammation, biologics have been particularly successful with chronic diseases like rheumatoid arthritis, psoriasis, Crohn’s disease, and certain cancers.\n\nThe major benefit of biologics is that they’re able to target “bad” cells a lot more specifically. While “normal” drugs go after cells broadly to repair whatever damage is happening, biologics’ power is in the fact that they can bind to and target specific cells. Because they’re not just attacking the body on a whim, they often have fewer side effects.\n\nExcitingly, biologics is now being considered an emerging therapy for Alzheimer’s disease. A small study of an experimental drug called aducanumab, an antibody, discovered that the biologic reduced the toxic plaque produced by a specific type of protein found in Alzheimer’s patients. (4)\n\nPlaque buildup in an Alzheimer’s brain is thought to be one of the main reasons that cell death and tissue loss occur. These “sticky” proteins build up between nerve cells, blocking signaling between cells and likely activating a response in the immune system that triggers inflammation. (5) As Alzheimer’s disease progresses, the brain shrinks at a rapid speed, particularly in the cortex, which is responsible for thinking and planning, and the hippocampus, which is critical in forming new memories.\n\nWhile the pharmaceutical industry has spent billions of dollars trying to create treatment that treats the underlying cause of Alzheimer’s rather than just the symptoms, they have been unsuccessful thus far. This early study, conducted among 165 patients, suggests that aducanumab actually actually removes this plaque buildup in the brain. It does this by ignoring benign proteins in the brain while fighting the dangerous ones. It also seems to make existing immune cells better at attacking the toxins themselves.\n\nA larger study of about 2,700 patients is in the works. While the results are several years away, the possibility of finally having a way to treat Alzheimer’s is a unbelievably exciting.\n\nRisks of and Precautions with Biologics\n\nBecause biologics require such a high level of biotechnology and research, while also requiring sensitive living conditions and handling), the treatments are notoriously expensive. Insurance companies often require a series of authorizations from a doctor and proof that other, less expensive treatments have failed. That puts the burden on a sick patient to jump through hoops when they’re already sick.\n\nAdditionally, while insurers usually require just a co-pay from a patient for medications, because biologics are so pricey, often patients are expected to pay a percentage of the therapy’s final cost. That can lead to out-of-pocket costs in the high hundreds, if not thousands. If it’s a regular medication, it can be exceptionally difficult to procure the treatment you need. (6)\n\nIt’s also been debated whether biologics are actually even better at treating diseases than their cheaper counterparts. One study found that when treating rheumatoid arthritis, using biologics wasn’t actually more effective. (7, 8) Though biologics worked faster than traditional drugs, there was “no convincing evidence that biologic drugs have a superior clinical efficacy in comparison with the synthetic drugs.”\n\nWhat is likely most concerning to people considering biologics is that because they suppress the immune system and change the way it works, people using biologics are at an increased risk of infection. (9) While they fight inflammation, biologics make it more difficult for your body to attack infections. (10) Several other studies have found that biologics therapy to treat diseases like psoriasis and inflammatory arthritis increases the risk of serious infection. (11, 12)\n\nBiologics are a tough topic. While the studies are inconclusive as to whether they’re actually more effective at treating certain diseases, just experiencing quicker relief than traditional medications can be a game-changer for someone suffering from a chronic disease. The fact that it can target specific cells is also huge for people who use it for things like cancer treatment — it can help reduce side effects like losing your hair or generally feeling awful.\n\nThe idea that biologics might be able to treat the root causes of devastating diseases like Alzheimer’s is exciting as well. Not only does this have the possibility of changing millions of lives, but it also opens the door to more research and treatment, and could provide a path to treating other notoriously tough diseases.\n\nUnfortunately, for many people, the cost of biologics might be prohibitive. That could be changing, though. As patents expire for the first biologics, something called “biosimilars” — the equivalent of generic drugs — are coming onto the market. (13) While only a few have been approved by the FDA thus far, if they become more prevalent, biologics might become more accessible to more people; these therapies are about 20 to 30 percent less expensive than biologics.\n\nAre biologics right for you? I can’t say. But the fact that this specialized type of medicine is available and more research is being done on it is certainly promising.\n\nRead Next: These Jobs Could Protect Against Alzheimer’s Disease", "opengraph": {"locale": "en_US", "type": "article", "title": "New Treatment for Alzheimer's and Other Chronic Diseases", "description": "Biologics or biological medicine is an emerging treatment for a variety of diseases ranging from autoimmune disorders to cancer to Alzheimer's disease. The jury is still out but some of the promises are exciting.", "url": "https://draxe.com/health/biologics/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-02-21T16:40:08+00:00", "image": "https://draxe.com/wp-content/uploads/2016/10/BT-FBNLMeme-01.png", "image:width": "840", "image:height": "441", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Are_Biologics", "#What_Are_the_Benefits_of_Biologics", "#Risks_of_and_Precautions_with_Biologics", "https://draxe.com/health/autoimmune-disease-symptoms/", "http://www.researchandmarkets.com/reports/2622741/biologics_and_biosimilars_world_markets", "https://draxe.com/health/prolotherapy/", "https://draxe.com/health/prp-treatment/", "https://ancientnutrition.com/collections/popular-products?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_20offjan", "https://www.rpi.edu/dept/chem-eng/Biotech-Environ/Projects00/rdna/rdna.html", "http://www.everydayhealth.com/columns/zimney-health-and-medical-news-you-can-use/understanding-biologics-how-they-differ-from-drugs-and-why-they-cost-more/", "http://www.fda.gov/AboutFDA/CentersOffices/OfficeofMedicalProductsandTobacco/CBER/ucm133077.htm", "https://draxe.com/health/psoriasis-symptoms/", "https://draxe.com/health/alzheimers-natural-treatment/", "http://www.nature.com/articles/nature19323.epdf?referrer_access_token=LJ7T8hI2d8C1DxiuXiKULdRgN0jAjWel9jnR3ZoTv0OqjsrnqFbRwzkQCJeuXdT6QH-vYxB4jJOOZP2j6zdaAJ-_tAFhY-BpSs-ZQbcpsiJderwKj-bE54NONgA9OP2gZIaQwMvJGdeFYiI254Sxbij729dkig9DwVdKNME3IZuG5eVRs1d78TZSDvKKE3kMQlS2mDKa8ySc_VAVI0t5BtV17fGWpZ1NQHj4YuEmjyCB2LzkWe8YIORweMF0EPmCo2aNOL6UoaFUHDAySAbDilFybNFS17QnIE5pkQaWlJcFCz-dUJWSYZHWL4hSFKQuuWC50AA1M4bwgc7ZPFBX5Q%3D%3D&tracking_referrer=www.npr.org", "http://www.alz.org/norcal/in_my_community_20545.asp", "https://www.washingtonpost.com/national/health-science/biologics-are-revolutionizing-care-for-some-diseases-but-they-are-very-costly/2015/03/16/1ffe46b6-b6ed-11e4-9423-f3d0a1ec335c_story.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2592779/", "http://www.medscape.com/viewarticle/722426", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0014868/", "http://www.hopkinsarthritis.org/arthritis-news/side-effects-of-biologic-medications/", "https://www.ncbi.nlm.nih.gov/pubmed/25970800", "https://www.ncbi.nlm.nih.gov/pubmed/24827752", "https://draxe.com/health/10-natural-cancer-treatments-hidden-cures//", "https://ancientnutrition.com/collections/popular-products?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_20offjan", "http://www.biopharma-reporter.com/Markets-Regulations/US-biosimilars-in-2016-Where-we-re-at-following-Zarxio-s-breakthrough", "https://draxe.com/health/jobs-could-protect-against-alzheimers/"], "authors": [], "publish_date": null}