{"result_id": "100012", "URL": "https://draxe.com/health/asthma-symptoms/", "timestamp": "2023-04-25 15:00:03 CEST+0200", "meta": {"description": "More than 25 million Americans deal with asthma symptoms, and that number is only expected to rise. Here's what to do about your asthma symptoms.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/asthma-symptoms/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Asthma Symptoms: The REAL Cause of Asthma Your Doctor Isn't Telling You", "cleaned_text": "Asthma is a common problem that affects more than 25 million Americans, especially children and teens. Rates of asthma have been increasing steadily over the past several decades as well — today one in 12 people has asthma, or 8 percent of the U.S. population, compared to about one in 14 people less than 10 years earlier who dealt with asthma symptoms. (1)\n\nSymptoms of asthma include coughing, wheezing and shortness of breath, which are usually triggered by things like food allergies, exposure to irritants and seasonal allergies, or sometimes intense bouts of exercise. What sorts of things make someone more susceptible to developing asthma? There are many contributing factors, including eating a poor diet, being overweight or obese, having low immune function, spending very little time outside, and having a family history of asthma.\n\nWith rates of asthma on the rise, attention in the medical community has now turned to the potential role that antibiotics and vaccines might play in asthma development (called the “hygiene hypothesis”). Although the theory hasn’t yet been proven, some experts believe that asthma might be affecting more people today than ever before due to the widespread use of medications that alter normal immune functions. (2) Adding to this problem is the fact that more people are spending lots of time indoors where irritants can be found. In addition, rising rates of obesity over the past 30 years have contributed to rising asthma diagnoses.\n\nAs you’ll learn, some of the things that can help prevent attacks and naturally treat asthma symptoms include avoiding triggers like certain allergenic or inflammatory foods, building natural resistance to allergens by going outside more, and addressing underlying causes of allergies and poor gut health.\n\nAsthma symptoms vary a lot in terms of severity and frequency, with some people remaining symptom-free the majority of the time and others having symptoms or attacks much more often. It’s possible for asthma attacks to only happen occasionally and be very brief when they do. This is one reason why some people remain undiagnosed with asthma and assume that their symptoms are only temporary and therefore normal.\n\nOther people with asthma might cough and wheeze most of the time and have severe attacks in response to things that stress their immune systems.\n\nThe most common symptoms of asthma include: (3)\n• Sneezing and coughing, which sometimes releases moisture and makes rattling noises\n• Wheezing, including sounds emanating from your chest as you try to breath\n• Running out of air as you try to speak or inhale\n• Pressure and tightness in the chest\n• Signs of poor circulation and oxygen, including having blue- or purple-colored toes and fingers or skin changes\n• Lack of coordination and balance, plus trouble seeing normally during attacks\n• Sometimes during an attack you might feel panicked or anxious over your shortness of breath\n• Symptoms similar to those caused by allergies, such as watery and red eyes, itchy throat, or a runny nose. Some people can look inside their throats or noses and see redness and swelling.\n• Swollen glands and puffy lymph nodes in the neck. Sometimes people with asthma even feel like they’re choking due to having inflamed airways.\n• Dry mouth, especially if you begin breathing through the mouth more often due to shortness of breath when breathing through the nose\n• Having trouble exercising or doing anything that causes increased breathing\n\nGetting outside more and spending less time in places with high amounts of dust mites, chemical fumes and other toxins can help control asthma symptoms. Although you might think that being outdoors exposes someone to seasonal allergies, over time it builds resilience and can be beneficial. Cleaning your home regularly with natural products, vacuuming, diffusing essential oils and using a humidifier can also be helpful.\n\nThe majority of people with asthma have some sort of allergies, which can include food allergies or intolerances that contribute to poor gut health, like leaky gut syndrome. Removing allergen and inflammatory foods from your diet — such as gluten, conventional dairy, and packaged foods with preservatives and chemicals — can help lower asthma symptoms.\n\nSmoking cigarettes or using tobacco products can make asthma symptoms much worse, not to mention that they commonly cause many other lung and health problems. Burning fumes, inhaling gases and contact with construction debris should also be avoided.\n\nObesity is linked to higher risk for asthma and other breathing problems, including sleep apnea. Although exercise can sometimes cause symptoms in people who already have asthma, staying active is generally very beneficial for improving immune function, preventing obesity and lowering inflammation.\n\nVery drastic temperature changes, humidity, high temperatures or extreme cold can all make asthma symptoms worse.\n\nAsthma is a condition characterized by difficulty breathing and narrowing of the airways (including the nose, nasal passageways, mouth and larynx) leading to the lungs. (4) Although asthma attacks can be very scary and sometimes very serious, the good thing is that narrowing of the airways that causes asthma symptoms can usually be reversed with certain lifestyle changes and treatments.\n\nAsthma is a type of chronic obstructive pulmonary disease (COPD). A characteristic of asthma is that symptoms tend to occur suddenly in response to stimuli that irritate the immune system and air passageways, which is described as having an asthma attack. Research shows that more than half of adult asthma sufferers experience a significant attack at least once yearly. Unfortunately, even after asthma patients are taught how to reverse their conditions and prevent symptoms, surveys show that more than half don’t comply with advice from their doctors or take action.\n\nAsthma is now considered to be one of the most common chronic health problems experienced during childhood. More than 6 million children in the U.S. have now been diagnosed with asthma. Surveys show that more boys tend to develop asthma before puberty and more girls afterward. Children have more attacks on average than adults, and roughly 60 percent of children who have asthma experience one or more asthma attacks over the course of a year.\n\nAlthough asthma is more likely to impact children, attacks in adults tend to be more serious and even life-threatening at times. Over 3,000 American adults died in 2007 from asthma attacks, compared to under 200 children during the same year.\n\nAsthma disturbs normal functions of the airways reaching the lungs that allow us to breath. The part of the airways most impacted by asthma is usually the bronchi. Bronchi look like thin, long tubes that are controlled by muscular movements that push air in and out of the lungs. The muscular walls of the bronchi have tiny cells with receptors called beta-adrenergic and cholinergic.\n\nThese receptors stimulate the muscles of the bronchi to contract and release depending on stimuli, such as certain hormones or the presence of microbes. In response to triggers, airflow can sometimes be reduced as the these tubs are constricted shut (called a bronchospasm). This leads to less clean air making its way into the lungs and also more air filled with carbon dioxide remaining in the lungs.\n\nAnother way that asthma develops is due to higher-than-normal amounts of thick mucus being released into the airways or from inflammation and swelling of the airways due to allergies. (5)\n\nStudies now suggest that the use of vaccines and antibiotics can have a negative impact on immune system responses, which can contribute to problems like increased food allergies and asthma symptoms. It’s been found that antibiotics and vaccines might shift activities of a special group of white blood cells called lymphocytes, which normally help protect the body from infections or viruses by raising inflammation. In response to antibiotics and vaccines, however, lymphocytes might begin releasing certain chemicals that cause allergic reactions and the airways to constrict.\n\nThe fact that children and adults both spend more time than ever inside clean, very hygienic homes seems like a good thing, but this can actually reduce someone’s ability to effectively build the immune system. In addition, being inside more increases exposure to certain allergens or irritants that can accumulate indoors, including dust mites, mold spurs, pet hair and other microbes.\n\nObesity, Allergies, Autoimmune Disorders, and Other Medical Conditions that Affect the Lungs and Cause Low Immunity\n\nSometimes childhood infections can affect lung tissue and cause the airways to narrow or become inflamed.\n\nStudies show that asthma tends to run in families, although it usually isn’t completely genetically acquired. Parents who have asthma should be careful to have their children screened for asthma symptoms and allergies in order to prevent attacks.\n\nCompression of the lungs caused from poor posture might also contribute to symptoms.\n\nIn people prone to asthma and allergies, what types of things might trigger an asthma attack?\n\nThese include recovering from another illness (such as a cough, cold or virus), being under a lot of stress, eating something that causes an allergic response (including foods with sulfites), exposure to household irritants, exercising, a lack of sleep or smoking cigarettes. High temperatures, extreme cold or heat, and humidity might also make asthma symptoms worse, and surveys show that in these conditions people tend to have more attacks.\n\nCertain working conditions can make asthma symptoms worse. Research also shows that people who live or work in places where high levels of pollution and irritants are found — such as those with exposure to fumes, pet fur, mold, burning garbage, gases, or lots of debris and dust — are more likely to have asthma attacks. All of these factors weaken immunity and can lead to troublesome inflammatory responses.\n\nDoctors use medications and inhalers (bronchodilators) to help control asthma attacks and prevent emergencies or complications. Most of these drugs can help open up the airways very quickly, preventing complications. Some refer to these drugs as “rescue drugs” since they have the benefit of helping someone breath again usually within minutes — however, long-term they aren’t very effective for treating the underlying causes of asthma or other respiratory problems.\n• Brochodiltors: These help relax the muscles that line the respiratory system in order to allow more air to pass through. They’re used in response to an attack and only very useful in an emergency.\n• Other medication that are sometimes used to help control inflammation and constriction of the airways include albuterol (Proventil, Ventolin), metaproterenol (Alupent, Metaprel), pirbuterol (Maxair) and terbutaline (Brethine, Brethaire and Bricanyl).\n• Sometimes doctors prescribe corticosteroids to lower swelling, including beclomethasone, Alvesco, Flovent, Asmanex Twisthaler and triamcinolone. These can be inhaled but work differently than brochodilators because they don’t open up airways short term.\n• Alternative long-term asthma treatments can also include cromolyn and omalizumab, which are considered “anti-IgE” drugs. These are not suitable for all patients and need to be administered as injections once or twice a month. They directly impact immune system functioning and might contribute to side effects, such as nasal congestion, coughing, sneezing, wheezing, nausea, nosebleeds, GI symptoms, mood changes and dry throat. (7)\n• About one in 10 children and one in 12 adults living in the U.S. has asthma. (8)\n• An estimated 300 million people worldwide suffer from asthma, with 250,000 deaths attributed to the disease every year.\n• The average number of asthma-related deaths is 3,168 per year. This costs the U.S. $29 billion every year. (9)\n• Adult women are more likely than men to have asthma. However, in children the opposite is true — boys are more likely than girls to have asthma.\n• Asthma is most common among adults who are obese or overweight compared to adults who are of normal/healthy weight.\n• Rates of asthma have been rising for several decades, and it’s now estimated that the number of people with asthma will grow by more than 100 million by 2025!\n• African-Americans and Puerto Ricans suffer from asthma more often than people of other nationalities. One in six non-hispanic black children are now diagnosed with asthma, a prevalence rate that has gone up 50 percent since 2001.\n• Due to medical expenses, missed school or work days, early deaths and doctors visits, asthma costs the U.S. $81.9 billion annually. (9)\n• The annual medical cost of asthma alone costs $3,266 per person. (9)\n• Missed school and work days alone cost $3 billion per year. This results in 5.2 million school days and 8.7 million work days lost due to asthma. (9)\n• Almost 60 percent of children and one-third of all adults who have asthma miss school or work because of attacks or symptoms. On average children miss about four days of school, and adults miss about five days of work annually because of asthma-related issues.\n• Adults between the ages of 45–64 years are most likely to have strong enough asthma symptoms to miss work and need to visit a doctor or emergency room.\n• Asthma is tied to other health problems, including allergies, obesity and influenza. About 70 percent of people with asthma also have allergies.\n• Children who have asthma are four times more likely to become infected with the influenza virus, and 16 percent of influenza deaths in children every year occur in patients who had asthma.\n\nAlthough drugs and inhalers can help provide quick relief for asthma patients, if during an attack these aren’t able to help someone experience improvements immediately, then it’s important to visit the ER or call an ambulance right away.\n\nAlthough it’s rare, asthma attacks can sometimes become fatal, so being cautious is always best. Signs of a severe asthma attack that requires immediate intervention include a pale face, sweating, blue lips, very rapid heartbeat and inability to exhale. (10)\n\nIf asthma symptoms ever start recurring multiple times per day, make sure to see your doctor. Also mention to your doctor if symptoms ever become frequent or severe enough to interrupt sleep, work, school or other normal day-to-day activities. Keep an eye out for side effects of medications or other signs of allergies that might make asthma symptoms worse, including a very dry mouth, stuffy nose, dizziness, fatigue and so on.\n\nFinal Thoughts on Asthma Symptoms and Causes\n• Asthma is a condition that affects breathing caused by narrowed airways (bronchospasm), a swollen or inflamed respiratory system, and abnormal immune system reactions.\n• Common symptoms of asthma include coughing, wheezing, chest tightness, shortness of breath, and pain or pressure in the chest.\n• Risk factors and underlying contributors of asthma include an inflammatory/poor diet, low immune function, food or seasonal allergies, and exposure to household or environmental irritants.\n• Eliminating food allergies, spending more time outdoors, and avoiding exposure to pollution or irritants found inside the home are all natural treatments for asthma symptoms.", "opengraph": {"locale": "en_US", "type": "article", "title": "Asthma Symptoms: The REAL Cause of Asthma Your Doctor Isn't Telling You", "description": "See how to treat the root causes of asthma instead of just dealing with the symptoms. The actual triggers will shock you.", "url": "https://draxe.com/health/asthma-symptoms/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2021-06-08T13:44:21+00:00", "image": "https://draxe.com/wp-content/uploads/2016/09/Asthma-FBMeme-01.png", "image:width": "720", "image:height": "378", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#Asthma_Symptoms_and_Signs", "#Natural_Treatments_for_Asthma_Symptoms", "#What_Is_Asthma", "#What_Causes_Asthma", "#Conventional_Treatment_for_Asthma_Symptoms", "#Statistics_and_Facts_About_Asthma", "http://www.aaaai.org/about-aaaai/newsroom/asthma-statistics", "https://draxe.com/health/seasonal-allergy-symptoms/", "https://draxe.com/health/lose-weight-fast/", "https://draxe.com/health/antibiotic-resistance/", "http://www.ncirs.edu.au/assets/provider_resources/fact-sheets/vaccines-asthma-allergies-fact-sheet.pdf", "https://draxe.com/health/asthma-natural-remedies/", "https://ancientnutrition.com/pages/supergreens-detox?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensdetox", "http://www.webmd.com/asthma/guide/what-is-asthma", "https://draxe.com/health/home-remedies-cough/", "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "http://www.mayoclinic.org/diseases-conditions/dry-mouth/basics/definition/con-20035499", "https://draxe.com/essential-oils/essential-oil-uses-benefits/", "https://draxe.com/health/7-signs-symptoms-you-have-leaky-gut/", "https://draxe.com/health/sleep-apnea/", "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0072704/", "https://ancientnutrition.com/pages/bone-broth-diet?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_bbpdiet", "https://draxe.com/health/copd-symptoms/", "http://study.com/academy/lesson/bronchi-anatomy-function-definition.html", "https://en.wikipedia.org/wiki/Cholinergic", "https://www.drugs.com/cg/bronchospasm.html", "http://www.aafa.org/page/asthma-triggers-causes.aspx", "http://www.asthma.com/what-is-asthma/asthma-symptoms.html", "https://draxe.com/health/food-allergies-treatments-natural-remedies/", "https://draxe.com/health/autoimmune-disease-symptoms/", "https://draxe.com/health/postural-restoration/", "https://draxe.com/health/cant-sleep/", "http://www.medicinenet.com/corticosteroids-oral/article.htm", "http://www.nytimes.com/health/guides/disease/asthma/long-term-relief-medications.html", "http://www.aafa.org/page/asthma-facts.aspx", "http://www.newswise.com/articles/view/687619/?sc=mwhn", "http://my.clevelandclinic.org/health/diseases_conditions/hic_Asthma_An_Overview/hic_Symptoms_of_Asthma", "https://draxe.com/health/asthma-natural-remedies/"], "authors": [], "publish_date": null}