{"result_id": "100031", "URL": "https://draxe.com/health/optic-neuritis/", "timestamp": "2023-04-25 15:00:22 CEST+0200", "meta": {"description": "Optic neuritis is characterized by inflammation and swelling of the eye’s optic nerve. Left untreated, it can become serious. Click to learn more.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/optic-neuritis/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Optic Neuritis Symptoms + 5 Natural Remedies", "cleaned_text": "Optic neuritis is a condition of the eyes that can affect both adults and children — especially anyone who has an autoimmune disease or history of a viral infection that causes their immune system to attack the nerves in their eyes.\n\nIf eye conditions like optic neuritis are not treated, they can become serious and potentially even lead to permanent vision loss in some cases. Vision is most likely to be compromised in people dealing with other underlying medical problem, such as multiple sclerosis (MS) or lupus.\n\nIs optic neuritis treatable? The good news is that, yes, most people will be able to fully recover their vision. Visual changes that are caused by optic neuritis — such as blurry or dimmed vision — usually peak within a few days of symptoms first becoming noticeable, but then start improving within about one to three months. A study published in the Indian Journal of Ophthalmology reports that “The long-term visual prognosis of idiopathic optic neuritis remains good. More than 90% of the patients recover a visual acuity of 20/40 or better by 6 months.” (1)\n\nConventional treatments for optic neuritis, such as steroid injections, may be recommended to help manage inflammation and swelling in the eyes, while natural remedies like applying ice packs, eating a healthy diet, resting and taking supplements can also help reduce symptoms and support recovery.\n\nThe definition of neuritis is “inflammation of one or more nerves, usually causing pain, tenderness, impaired sensation and loss of function.” (2)\n\nOptic neuritis describes inflammation and swelling of the eye’s optic nerve, the nerve that carries light signals from the back of the eye to the brain. This condition affects vision because it interferes with the normal way that you interpret visual images, causing changes in how you see such as dimness, blurriness, dullness of colors, and the appearance of flashing lights.\n\nWhat are some of the reasons that optic neuritis may develop? The optic nerve can become damaged due to causes like: bacterial infections, certain viruses, MS, or autoimmune diseases that mistakenly cause the immune system to attack optic nerve tissue.\n\nOptic neuritis can develop in both eyes, but most often affects just one. Symptoms vary depending on the person and the underlying cause. Sometimes symptoms worsen gradually over time as the optic nerve becomes more damaged, while for others symptoms might start suddenly and progress quickly.\n• Dimmed vision that makes it appear as if someone “turned down the lights.” Diminished vision is considered the most common optic neuritis symptom. However, it’s also possible for the optic nerve to be inflamed without affecting someone’s vision.\n• Blurry vision. Most people will develop the inability to see out of one eye.\n• Trouble seeing colors normally, such as seeing dull/less vibrant colors.\n• Pain. Optic neuritis pain can feel like a dull, aching pain in the back of your eye socket, or discomfort that gets worse when you move your eyes.\n• Abnormal reaction of the affected pupil when exposed to bright light.\n• Symptoms might get worse when your body temperature increases, when you are under stress, tired, very hot, when you exercise, or when you take a bath or shower.\n\nOptic neuritis is due to nerve fibers in the affected eye(s) becoming inflamed and swollen. It’s not always known why this affects certain people, although experts know that having had certain diseases/conditions in the past can increase someone’s risk. By far the most common form of optic neuritis is “idiopathic,” which means it’s caused by diseases that cause demyelination of nerves, especially multiple sclerosis (MS). (4)\n• History of certain viruses including mumps, measles, or even the flu.\n• Having an autoimmune disease, such as lupus, multiple sclerosis, Lyme disease and others.\n• Having had an infection that affects the eyes or peripheral nerves, including cat-scratch fever, meningococcal infection, and others.\n• Inflammation due to conditions like sarcoidosis, vasculitides or syphilis.\n• Other health conditions such as Guillain-Barre syndrome or taxoplasmosis.\n• Having had an injury to the eye that damages the optic nerve.\n\nThe best way to receive an accurate optic neuritis diagnosis is to visit an ophthalmologist, a doctor who specializes in treating conditions of the eyes.\n• Eye examination using an instrument called an ophthalmoscope to view the back of the eye (this test is called an ophthalmoscopy)\n• Vision test using objects placed in your visual field\n• Tests to determine if you’re seeing colors normally\n• Pupillary light reaction test to check if your pupils are responding normally to light.\n• CT scan and/or MRI scan, and possibly a visual brain wave recording that shows how your brain is processing visual information. (7)\n\nThe goal of your appointment should ultimately be to determine if your optic nerve is swollen by looking inside your eye, to test your side (peripheral) vision, to check if you’re seeing colors normally, and to look for any other unusual signs of nerve damage.\n\nIs optic neuritis permanent? In some cases, optic neuritis will get better on its own and no treatment (especially invasive treatments) will be necessary. But usually the condition needs to be treated to manage symptoms and prevent inflammation or an infection from worsening. If someone has only had optic neuritis once — especially if they don’t have any other serious health conditions — they are likely to fully recover and restore their vision.\n• Use of steroid medication called corticosteroids, which help to control swelling and usually improve vision. Steroids are typically injected into your numbed, affected eye so they can reach the optic nerve. Steroids have been shown to do little in terms of improving visual acuity in patients with optic neuritis, but they can help to speed the rate of recovery and reduce symptoms. (8)\n• When someone has severe vision loss that persists, even when given steroids, a treatment called plasma exchange (PE) therapy (or intravenous immune globulin) might be used to recover vision. PE therapy is a way of “cleansing the blood” by removing plasma — the liquid part of your blood — and replacing it with plasma from a donor or with a plasma substitute. This can help control inflammatory disease symptoms by altering the way that white blood cells work. (9) Certain studies have found that treatment with pulsed intravenous corticosteroids and PE is more effective than standard treatment of corticosteroids alone. (10)\n• Treatments for any other health conditions that are causing neuritis, such as MS, autoimmune disorders or viruses/infections. For example, beta interferons and immunosuppressive drugs may be used to delay or help prevent multiple sclerosis. Some examples of these disease-modifying drugs include: Avonex (interferon beta-1a), Betaseron (interferon beta-1b), Extavia (interferon beta-1b), Plegridy (peginterferon beta-1a), and Rebif (interferon beta-1a).\n• Vitamin B12 injections are also sometimes given if it’s suspected that vitamin B12 deficiency may be contributing to neuritis (this is considered to be rare).\n\nDo optic neuritis treatment always work, and will most people’s vision typically return to normal? If the condition is considered mild or moderate, medications like steroids can usually improve vision and help it to return to normal or near-normal. But if someone is dealing with a progressive autoimmune disease, such as multiple sclerosis, it may not be possible to restore the patient’s vision completely.\n\nSome people find that their optic neuritis symptoms get worse when their body temperature increases, when they are feeling stressed, tired, very hot, or when they exercise or take hot showers. Identify what tends to trigger your symptoms and then work on reducing exposure to triggers. For example, avoid being outside in very humid weather, exercising intensely, or taking very hot baths.\n\nExercise and staying active can help you deal with stress and strengthen your immune system, but you may need to be careful about the type of activities you do. Staying active, such as by working with a physical therapist or personal trainer who is familiar with any condition you’re dealing with, is a great way to promote circulation and help control inflammation. Just be sure to avoid any exercise that makes symptoms worse, such as those that make you very hot, involve lowering your head below your heart, or increase your heart rate too much. Talk to your doctor about safe ways to stay active, such as walking outdoors, swimming, cycling or doing yoga and tai chi. Aim for 20–30 minutes of moderate exercise (think a brisk walk or a slow jog) every day if possible.\n\n3. Get Enough Rest and Relaxation\n\nBy reducing inflammation, you’ll be better able to heal from neuritis and potentially prevent symptoms from worsening. Emphasize anti-inflammatory foods like fresh vegetables, fruits, nuts, seeds, ancient grains, healthy fats and clean protein. Some of the best choices include:\n• None . Organic foods are best to help decrease exposure to pesticides and chemicals. All types of leafy greens, sweet potatoes, broccoli and other cruciferous veggies, carrots, tomatoes, squash, garlic, herbs and spices, citrus, mangos, cherries, melon, all types of berries, cocoa, green tea and. Organic foods are best to help decrease exposure to pesticides and chemicals.\n• None Plenty of lean protein, such as fish, grass-fed meat, pastured eggs and poultry.\n• None Wild-caught fish like salmon or sardines that provide\n• None Stay hydrated, particularly with water, fresh vegetable juices and herbal teas/infusions.\n• None Avoid refined and processed foods, including fried foods, fast food, and those made with refined grains, added sugar and hydrogenated fats.\n• Limit or avoid foods with artificial ingredients, preservatives, and high amounts of sodium, as well as any food allergies you’re aware of, such as gluten and dairy. Having adequate levels of vitamin D supports immune function and has positive effects on neurological health. Vitamin D deficiency can worsen inflammation and increase risk for health problems like MS. The best way to make enough vitamin D on your own is to expose your bare skin to sunlight everyday, if possible, for about 15 minutes. If you live in a place where it’s very dark and cold, or during the winter, then you can supplement with vitamin D3 (5,000 IU daily) to help modulate the immune system and support your brain and nervous system. Other supplements that can help support your immune system include:\n• Omega-3 fatty acids/fish oil (2,000 milligrams daily) — Fish oil can help reduce inflammation and promote better nerve functioning.\n• Probiotics — Helps to restore or maintain a healthy symbiotic gut microbiota that decreases inflammation.\n• Vitamin B12 (1,000 micrograms daily) — Vitamin B12 helps with the formation of nerves and may help reduce neuritis in some patients.\n• (2 milligrams, one to two times daily) — A powerful carotenoid antioxidant found in wild-caught salmon that can support the brain and nervous system.\n• Green tea flavonoid extract (especially EGCG, or epigallocatechin-3-gallate), which has the ability to fight oxidative damage.\n• Curcumin, the active ingredient found in turmeric, which has anti-inflammatory benefits and much more.\n• which has analgesic and anti-spastic effects.\n\nIt’s important that optic neuritis be treated as soon as possible, since symptoms can get worse as time goes on. If you notice any optic neuritis symptoms, such as pain in your eyes/head or changes in your vision, talk with your doctor or visit an ophthalmologist for an evaluation. This is especially important if you’re at high risk for neuritis, such as due to an autoimmune disorder, diabetes, weakened immune system, etc.\n\nTo rule out any underlying health conditions, such as a neurological problem or MS, always get help right away if you experience symptoms like sharp eye pain or sudden changes in your vision, or numbness or weakness in one or more limbs.\n• Optic neuritis is a condition characterized by inflammation and swelling of the eye’s optic nerve, the nerve that carries light signals from the back of the eye to the brain.\n• This condition negatively affects vision because it interferes with the normal way that you interpret visual images, causing changes in vision like blurriness, dullness of colors, and the appearance of dimmed light. Other symptoms can include headaches, pain in the eyes, and seeing flashing lights.\n• Causes of optic neuritis can include: multiple sclerosis, other autoimmune diseases that mistakenly cause the immune system to attack the optic nerve tissue, bacterial infections or certain viruses.\n• Conventional treatments for optic neuritis typically include use of steroid injections to reduce inflammation, sometimes a treatment called plasma exchange (PE) therapy (also called intravenous immune globulin) that cleans the blood, and medications to treat underlying health conditions.\n• Natural remedies for optic neuritis symptoms include avoiding triggers, trying natural pain-relievers like essential oils, getting enough rest and working on relaxation, eating an anti-inflammatory diet and taking supplements to support the immune system.", "opengraph": {"locale": "en_US", "type": "article", "title": "Optic Neuritis Symptoms + 5 Natural Remedies - Dr. Axe", "description": "Optic neuritis is characterized by inflammation and swelling of the eye’s optic nerve. Left untreated, it can become serious. Click to learn more.", "url": "https://draxe.com/health/optic-neuritis/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-11-11T19:46:14+00:00", "image": "https://draxe.com/wp-content/uploads/2018/08/Optic-Neuritis_FB.jpg", "image:width": "1230", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Optic_Neuritis", "#Symptoms_and_Signs", "#Causes_and_Risk_Factors", "#Optic_Neuritis_Diagnosis", "#Conventional_Treatments_for_Optic_Neuritis", "#5_Natural_Remedies_for_Optic_Neuritis_Symptoms", "#Precautions", "https://draxe.com/health/lupus-symptoms/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3116540/", "https://draxe.com/health/inflammation-at-the-root-of-most-diseases/", "https://www.britannica.com/science/neuritis", "https://draxe.com/health/autoimmune-disease-symptoms/", "https://www.aao.org/eye-health/diseases/optic-neuritis-symptoms", "https://draxe.com/health/blurry-vision/", "https://bestpractice.bmj.com/topics/en-us/966", "https://draxe.com/health/lyme-disease-symptoms/", "https://draxe.com/health/cat-scratch-fever/", "https://draxe.com/health/tb-symptoms/", "https://draxe.com/health/sarcoidosis/", "https://draxe.com/health/syphilis-symptoms/", "https://draxe.com/health/guillain-barre-syndrome/", "https://draxe.com/health/multiple-sclerosis-natural-treatments/", "https://www.hopkinsmedicine.org/healthlibrary/conditions/nervous_system_disorders/optic_neuritis_134,44", "https://www.mayoclinic.org/diseases-conditions/optic-neuritis/diagnosis-treatment/drc-20354958", "https://www.aao.org/eye-health/diseases/optic-neuritis-diagnosis", "https://emedicine.medscape.com/article/1217083-overview?pa=4vfyXHxpS54EutimyO3TYDu2QD2Cdqyc80jRotkopVo%2BzRNs1SvfZ0pof2NgaLaLcovywsdap%2Bc6kFHCF69UkG8OxiDO6aXcc0JeYePWHqw%3D", "https://www.aan.com/Guidelines/Home/GetGuidelineContent/472", "https://www.ncbi.nlm.nih.gov/pubmed/22776923", "https://draxe.com/nutrition/b12-injections/", "https://draxe.com/nutrition/vitamin-b12-benefits/", "https://draxe.com/health/natural-painkillers/", "https://draxe.com/health/natural-headache-remedies-relief/", "https://draxe.com/essential-oils/peppermint-oil-uses-benefits/", "https://draxe.com/health/stress-relievers/", "https://draxe.com/health/quitting-smoking/", "https://draxe.com/nutrition/kelp/", "https://draxe.com/nutrition/probiotic-foods/", "https://draxe.com/nutrition/vitamin-d-deficiency-symptoms/", "https://draxe.com/nutrition/fish-oil-benefits-health/", "https://draxe.com/nutrition/astaxanthin-benefits/", "https://draxe.com/nutrition/benefits-of-green-tea/", "https://draxe.com/nutrition/turmeric-curcumin-benefits/", "https://draxe.com/nutrition/cannabis-oil/"], "authors": [], "publish_date": null}