{"result_id": "100019", "URL": "https://draxe.com/pet-health/leptospirosis/", "timestamp": "2023-04-25 15:00:08 CEST+0200", "meta": {"description": "Leptospirosis is a bacterial infection that can occur in both animals and humans. Rats are the most lethal carrier of this deadly disease. Learn more here.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/pet-health/leptospirosis/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Rats, Puddles Pose 'Lepto' Risk to Your Dog (It Can Kill Humans, Too)", "cleaned_text": "Earlier in 2017, you may have heard how New York rats became more than just an unsettling, yet common, city sighting — these rats actually led to serious illness and death for three people living in the Bronx who came down with severe cases of leptospirosis. According to The New York City Department of Health and Mental Hygiene, these infected individuals were hospitalized with liver and kidney failure. Ultimately, two of the three survived while the third, sadly, passed away. (1)\n\nNow Arizona has also seen a resurgence in cases of leptospirosis. It’s been labeled a concern for human as well as dog residents of the area. (2) In India, two people died this month of leptospirosis, often shortened to simply “lepto.” (3) This is a health concern that doesn’t just affect humans. In fact, you may be most familiar with the infection if you have a dog. Just recently in the Philadelphia area, a pet owner mourned the loss of her beloved dog that she lost to leptospirosis. (4)\n\nWhat is leptospirosis? Leptospirosis is a type of bacterial infection. It’s actually said to be the most common zoonosis in the world. What on earth is a zoonosis? It’s the official name for any disease that can be transmitted to humans from animals. Leptospirosis can spread several ways. It’s also possible for pets to become infected with the disease. Thankfully, it’s not generally very common in humans and there are a lot of natural ways ways to prevent and treat leptospirosis in both people and animals.\n\nLeptospirosis is a bacterial infection that can occur in both animals and humans. Leptospirosis is caused by bacteria in the genus Leptospira. Leptospirosis is a whole-body disease that can be asymptomatic (no symptoms) or it can cause a spectrum of symptoms.\n\nWeil’s disease is the name for a severe form of leptospirosis and it typically always requires hospitalization. (5) Leptospirosis is known to occur in household pets as well as wild animals. When it comes to pets, leptospirosis in dogs is more common than leptospirosis in cats.\n\nLeptospirosis is a bacterial disease that spreads through direct contact with the urine of infected animals or contaminated water, soil or food. A lot of different animals — both domesticated and wild — can be infected with lepto including rodents, dogs, cats, pigs, cattle and horses. Basically, it’s possible for most mammals to be infected with leptospirosis. (6)\n\nWhen an infected animal urinates, the lepto bacteria can contaminate soil, crops, lakes, rivers and other water sources. The lepto bacteria can survive in soil and water for months. So a human can pick up leptospirosis if they have a cut or other opening in the skin or through mucous membranes that come in direct contact with infected animal urine or something contaminated by infected urine. People can also accidentally ingest the bacteria if they consume crops or water contaminated with lepto-causing bacteria.\n\nCan human to human transmission occur? It’s possible yet rare for a human to give another human leptospirosis. But the urine of an infected individual is a possible source of the disease for another person. It is also possible for an infected pregnant woman to pass the infection to her unborn. It’s also possible, yet not common, to pick up lepto from a sexual partner. (7)\n\nLepto bacteria love warm, wet environments so animals and people living in areas with high temperatures and high rainfall are more at risk. Hawaii is an example of a region of the United States known for having lepto bacteria in its freshwater streams, waterfalls and ponds. Out of the estimated 100 to 200 cases of Leptospirosis in the United States each year, about half of those cases occur in Hawaii! (8) Both animals and humans are more likely to contract leptospirosis if they drink from or have exposure to water sources contaminated with Leptospira bacteria.\n\nPeople and animals living in an area or a home with garbage disposal and/or collection problems are also known to have more occurrences of leptospirosis. Basically, living anywhere that rats or other rodents thrive is going to increase your risk for contracting leptospirosis. (9)\n\nDogs have a higher risk for leptospirosis infections in comparison to humans. This makes sense since dogs love to smell whatever comes across their paths and one of their favorite places to sniff includes the areas where other dogs urinate. Groomers, veterinarians, pet store workers, zoo workers and other individuals who work with animals are also more likely to get this bacterial infection since they commonly come in contact with animal urine. (10)\n\nLeptospirosis symptoms resemble general bacterial infection symptoms or flu-like symptoms. This is why leptospirosis can sometimes be mistaken for another disease. It’s also possible for a human to be infected and have no signs of infection at all.\n\nLeptospirosis typically comes on suddenly. Possible human leptospirosis symptoms include:\n\nAccording to the CDC, it can take anywhere between two days to 28 days between coming in contact with lepto bacteria and actually becoming ill. The sickness can then last a few days or a few weeks, or even longer. Leptospirosis symptoms can also be experienced in two phases. For the initial phase, an infected individual may experience many of the symptoms above and then briefly recover only to become symptomatic all over again. The second phase is when more serious symptoms can occur such as liver failure or meningitis. This severe phase is when leptospirosis is referred to as Weil’s disease. (11)\n\nWhen it come to pets having a case of leptospirosis, they also may not exhibit any symptoms. Dogs are the pet most known to display clinical symptoms of the disease. Typically, the younger the dog, the worse the symptoms.\n\nLepto in dogs can result in the following symptoms: (12)\n\nDogs are more likely to be affected by lepto. But cats can also exhibit similar symptoms if they have leptospirosis. (13) The time between exposure to lepto bacteria and development of leptospiroris is typically somewhere between five to 14 days for pets. However, the time frame can be as short as only a few days or as long as a month or more. (14)\n\nThe most common conventional treatment for a leptospirosis infection is antibiotics. Typically the antibiotics employed include penicillin or doxycycline. These drugs are recommended as soon as possible after discovering the infection. When an infected individual displays more serious lepto symptoms, then their doctor may likely recommend intravenous antibiotics.\n\nFor pets, leptospirosis is also treated with antibiotics. The likelihood of recovery is typically good if treatment is early in the course of the illness. Even with ideal treatment, some animals may still have permanent damage to their livers or kidneys. (15)\n\nIt’s very common for dogs to receive a lepto vaccine from a conventional vet. This vaccine is said to protect dogs for a year. Cats are said to be at risk for lepto, too. But the leptospirosis vaccine is not typically given to cats because it’s believed that cats have a natural resistance to the disease. (16) If you’re trying to decide whether or not to give your dog the lepto vaccine, this is an interesting article from Dogs Naturally Magazine written by Dr. Jodie Gruenstern: The Lepto Vaccine: Why Vets Give It Yearly.\n\nCurrently, there is no human leptospirosis vaccine commercially available in the United States. “High-risk workers” in some Asian and European countries are said to possibly have access to a vaccine at this time. But these vaccines don’t offer widespread protection. (17)\n\nIt’s possible to become infected with leptospirosis and spontaneously recover without treatment. Overall, the prognosis of leptospirosis is good. However, as symptoms worsen, the prognosis gets worse. (18) Here are some of the best natural ways to prevent and treat leptospirosis in humans and pets.\n\nSince rodents, especially rats, have shown their ability to be so lethal to humans, getting rid of rats naturally is one of the best ways to avoid leptospirosis. This is especially important since the worst form of leptospirosis known as Weil’s disease is typically linked to rat-transmitted bacteria. (19) Some of the best ways to get rid of rats and prevent rats from invading your living areas in the first place include:\n• Keep food and trash sealed at all times.\n• Seal holes in screens, doors, walls, or anywhere else a rat could potentially find its way into your home.\n\nFor more details, check out: How to Get Rid of Rats Naturally\n\nAnytime you are in a place that has trash — whether it be a public dumpster or your own personal garbage cans outdoors — you can easily be dealing with an area that rodents visit, which means it’s possible that the contaminated urine of infected rodents may be around. The surest bet to prevent catching anything from these garbage harboring areas is to always wash your hands thoroughly afterwards. If you have any cuts on your hands or just want to be ultra careful, you can also wear rubber gloves when possibly making contact with things like dumpsters. For anyone who has to go into trash rooms or other areas where rats could possibly be visiting (or living), it’s advisable to wear covered shoes (as opposed to open-toe shoes or sandals) and protective clothing. (20)\n\n3. Think Before You (or Your Dog) Drink\n\nSince various bodies of water from streams to lakes to puddles can be contaminated with leptospirosis-causing bacteria, it’s important that you and your pets don’t consume any contaminated water. Do your best to prevent your dog from drinking from any standing water. When hiking or spending time outdoors, some adults or children may be tempted to drink from what appears to be a clean source of water. However, never drink from any outdoor water sources. (21)\n\n4. Think Before You Dip\n\nSimilar to the previous preventive measure, you should be careful where you choose to swim and also where you allow your four-legged friends to swim. Freshwater lakes and ponds can potentially be contaminated. Because it’s so easy to swallow water when you or your dog are swimming, avoiding certain bodies of water may help you avoid lepto bacteria. If you have any open wounds such as a cut or skin ulcer, it’s even more important that you are highly cautious where you choose to swim. These openings make it so easy for bacteria to get into your bloodstream. That goes for your dog as well. If he or she has any openings in the skin, then it’s even more important that you are cautious about where your dog swims.\n\nHomeopathy is a natural treatment option for lepto in dogs. The following are some possible homeopathic medicines that may help depending on your pet’s symptoms: (22)\n• Aconitum napellus 12x: Recommended for preventing shock and limiting the progression of the disease.\n• Mercurius corrosivus 30c: Recommended for bloody diarrhea and ulcerations of the mucous membrane.\n• Leptospirosis nosode 30c: Recommended for use along with other remedies. The nosode is said to help to prevent the build up of leptospirae bacteria in the kidneys.\n• Lycopodium 1M: Recommended for chronic cases with wasting and lack of appetite.\n\nBoosting your immune system with natural foods and supplements is another key way to prevent, as well as help treat, leptospirosis. Your immune system is responsible for fighting off harmful bacteria, such as the kind that cause lepto infections, so doing what you can to ensure its operating optimally is so important to your health. One of the best ways to boost your immune system is to include things like probiotics, ginger, garlic and vitamin D-rich foods in your diet on a regular basis.\n\nWithout proper treatment, leptospirosis can lead to kidney damage, kidney failure, liver failure, meningitis and respiratory distress. It can even lead to death. (23) Seek medical attention right away if you think you have leptospirosis.\n\nA pregnant woman contracting leptospirosis can lead to fetal death, stillbirth, and/or congenital leptospirosis. There is also a higher likelihood of miscarriage if the infection occurs during the first trimester. (24)\n\nContact your veterinarian immediately if you believe that your pet may have lepto. Your vet can conduct testing to determine if your pet has the infection. The sooner your pet gets treatment the better.\n• Leptospirosis is a bacterial infection that has been making headlines this year. Rats have been the most lethal carrier of the infection.\n• Almost any mammal can get leptospirosis.\n• When it comes to pets, dogs are more commonly infected with lepto than cats.\n• There are an estimated 100 to 200 cases of leptospirosis in the United States each year.\n• In the U.S., Hawaii is the state with the most cases of this bacterial infection on a yearly basis.\n• The urine of infected animals causes lepto as does soil, water or food contaminated with urine.\n• Avoiding swimming and drinking from freshwater lakes and other bodies of water can help prevent lepto in dogs and humans.\n• If your dog or another pet has lepto, it’s very important to avoid contact with its urine.\n• Keeping rats away and being careful around rat-prone areas are key preventive measures.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rats, Puddles Pose 'Lepto' Risk to Your Dog (It Can Kill Humans, Too)", "description": "Here are common-sense, natural ways to protect your family and four-legged friends from this life-threatening bacterial disease.", "url": "https://draxe.com/pet-health/leptospirosis/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-10-01T18:29:40+00:00", "image": "https://draxe.com/wp-content/uploads/2017/08/Leptospirosis_FBMeme.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Leptospirosis", "#Risk_Factors_and_Causes", "#Leptospirosis_Symptoms", "#Conventional_Treatment", "#6_Natural_Ways_to_Prevent_Leptospirosis", "#Precautions", "https://draxe.com/health/kidney-failure/", "https://www.forbes.com/sites/robertglatter/2017/02/16/leptospirosis-reported-in-new-york-city-what-you-need-to-know/#502560a521b7", "http://www.abc15.com/news/state/leptospirosis-making-resurgence-in-valley-concerns-for-dogs-people", "http://www.hindustantimes.com/mumbai-news/deadly-july-in-mumbai-7-swine-flu-2-leptospirosis-deaths/story-egNLiokO6kyeGDcSxHrxXN.html", "http://philadelphia.cbslocal.com/2017/06/29/bacteria-strikes-humans-and-dogs/", "http://www.healthline.com/health/weils-disease#overview1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2231387/", "http://www.medicinenet.com/leptospirosis/page2.htm", "http://health.hawaii.gov/docd/disease_listing/leptospirosis/#risk_in_hawaii", "http://www.thehealthsite.com/diseases-conditions/leptospirosis-are-you-at-risk-b0617/", "http://www.natural-dog-health-remedies.com/canine-leptospirosis.html", "https://draxe.com/health/jaundice/", "https://draxe.com/health/meningitis-symptoms/", "https://www.cdc.gov/leptospirosis/symptoms/index.html", "https://www.cdc.gov/leptospirosis/pets/symptoms/index.html", "http://www.petmd.com/cat/conditions/infectious-parasitic/c_ct_leptospirosis", "https://www.cdc.gov/leptospirosis/pets/treatment/index.html", "https://www.avma.org/public/PetCare/Pages/Leptospirosis.aspx", "http://www.higginsanimalclinic.com/site/epage/100532_332.htm", "https://www.dogsnaturallymagazine.com/the-lepto-vaccine-why-vets-give-it-yearly/", "http://www.medicinenet.com/leptospirosis/page6.htm", "http://www.medicinenet.com/leptospirosis/page5.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2700559/", "https://draxe.com/essential-oils/eucalyptus-oil-uses-benefits/", "https://draxe.com/health/boric-acid/", "https://draxe.com/health/how-to-get-rid-of-rats/", "https://www.forbes.com/sites/robertglatter/2017/02/16/leptospirosis-reported-in-new-york-city-what-you-need-to-know/2/#1b3abfa079da", "http://www.vetstreet.com/our-pet-experts/spotting-treating-and-preventing-leptospirosis-in-dogs", "https://draxe.com/health/homeopathy/", "https://www.dogsnaturallymagazine.com/leptospirosis-homeopathy/", "https://draxe.com/health/how-to-boost-your-immune-system/", "https://draxe.com/nutrition/probiotics-benefits-foods-supplements/", "https://draxe.com/nutrition/top-10-vitamin-d-rich-foods/", "https://www.cdc.gov/leptospirosis/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2700559/", "https://draxe.com/health/toxoplasmosis/"], "authors": [], "publish_date": null}