{"result_id": "100027", "URL": "https://draxe.com/health/keystone-virus/", "timestamp": "2023-04-25 15:00:15 CEST+0200", "meta": {"description": "The Keystone virus has been identified in humans for the first time ever. It's the latest mosquito-borne disease threatening people.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/keystone-virus/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "New Mosquito Virus Identified in Humans for the First Time Ever", "cleaned_text": "You’re probably familiar with mosquito-borne ailments like Zika virus and West Nile, but there’s another not so well-known virus that also poses a threat to your health. The Keystone virus was first discovered in animals and was only recently found to infect a 16-year-old boy living in Florida.\n\nBut scientists believe that this virus may have been infecting humans for years without us even realizing it. In fact, reports suggest that about 20 percent of people living in the Florida region where the virus was first detected have positive blood test results for the presence of Keystone.\n\nAlthough the boy infected with the Keystone virus went to an urgent care center in August of 2016 with a mild fever and rash, it wasn’t until June of 2018 that scientists published their findings — linking the boy’s condition to this mosquito-borne infection that had never been detected in humans. (1)\n\nNow we are left with questions about how long this virus has been affecting humans and what we can do to prevent it.\n\nWhat Is the Keystone Virus?\n\nThe Keystone virus was first isolated in 1964 from mosquitoes found in Keystone, Florida. Until recently, scientists thought it only infected animals of the coastal regions, stretching from Texas to the Chesapeake Bay.\n\nWhen a teenager living in Florida went to an urgent care center with a rash and fever, doctors thought it may be from another mosquito-borne virus. This was during the well-known Zika virus epidemic that affected Florida and the Caribbean. So when the boy’s lab samples were collected, doctors were surprised to see that all studies for Zika were negative. They finally found the Keystone virus after doing viral cultures from the patient’s samples.\n\nBecause this is the first known case of Keystone virus in humans, we don’t have a clear idea of how this virus will affect humans. But researchers believe that many people living in the Florida area have already been infected and aren’t experiencing symptoms, which is similar to other mosquito-borne diseases like Zika and West Nile. Scientists also believe that the Keystone virus can infect brain cells, and like West Nile, and may possibly lead to brain disorders like encephalitis.\n\nThis threat of mosquito-borne diseases continues to rise. According to the CDC, the rates of disease spread by mosquitos, ticks and fleas (referred to as vector-borne diseases) have tripled in the United States from 2004 to 2016. (2)\n\nThe CDC confirms that “changes in infectious disease transmission patterns are a likely major consequence of climate change.” Data indicates the health effects of climate change and shows that even small temperature increases can greatly affect the transmission of mosquito-borne diseases. (3)\n\nAccording to research published by the University of California Press Journals, mosquitos may actually benefit from climate change. Researchers indicate that while climate change may mean extinction for many species, it can lead to longer breeding seasons and increased hatch rates of mosquito populations. The enlarged mosquito population will then seek more territory, and the warmer climate will make more territory available, so the cycle can continue and escalate. (4)\n• The Keystone virus is likely transmitted by the Aedes Atlanticus mosquito, a cousin to the mosquito that spreads the Zika virus.\n• In 1964, the Keystone virus was first isolated in the Tampa Bay region of the U.S. It was initially found in animal populations, but was identified in a human living in Florida in August 2016.\n• The Keystone virus can spread when an infected mosquito bites a human or animal.\n• Symptoms of the Keystone virus likely include a rash and mild fever — the two symptoms present in the teenage boy diagnosed. Scientists believe that like the West Nile Virus, Keystone can infect brain cells and may possibly lead to brain disorders like encephalitis.\n• There’s no treatment or vaccine available for the Keystone virus, but many people are likely infected and show no symptoms. (5)\n• The Zika virus is transmitted by the Aedes species mosquito. In the U.S., these mosquitos are most common in Florida, Hawaii and along the Gulf Coast. In warmer temperatures, however, they become a threat in areas as far north as Washington, D.C.\n• The first confirmed Zika case was reported in Brazil in May 2015. By February 2016, the World Health Organization declared Zika virus a “Public Health Emergency of International Concern.”\n• Zika can spread from mosquito bites (the most common form of transmission), from mother to child during pregnancy, through unprotected sexual contact and through blood transfusion.\n• Most people with Zika don’t experience symptoms and never know they are infected, but some may experience a rash, red eyes, fever, headaches, joint pain and muscle pain. For women who are pregnant, the Zika virus can cause certain birth defects, including microcephaly and severe fetal brain defects.\n• There’s no treatment or vaccine for Zika virus. (6)\n• The West Nile virus is most commonly spread through the bite of an infected mosquito, especially those from the Culex species. A mosquito is first infected by feeding on an infected bird and then spreads the virus by biting humans or other animals, such as horses.\n• West Nile virus was first isolated from a patient living in the West Nile part of Northern Uganda in 1937. After that, small and large outbreaks occurred in several areas, including Israel, Egypt and South Africa, Russia, Spain and Romania. In 1999, the virus was first detected in North America, where a total of 62 confirmed cases in Queens, New York, and the surrounding areas. (7)\n• Most people with West Nile virus don’t develop symptoms. About 1-in-5 people infected with West Nile experience a fever and other symptoms like a rash, headache, body aches, joint pain, diarrhea and vomiting. About 1-in-150 people with West Nile virus develop a severe illness that affects the central nervous system, such as encephalitis (inflammation of the brain) and meningitis (inflammation of membranes surrounding the brain and spinal cord).\n• There’s no treatment or vaccine for the West Nile virus. (8)\n\nBecause there’s no treatment or vaccine for viruses spread by mosquitos, the best and only approach is avoiding mosquito bites altogether. According to research published in the Journal of Insect Science, “the use of repellents to alter mosquito host seeking behavior is an effective method for the prevention of mosquito-borne diseases.” (9)\n\nSo what are the best home remedies for mosquito bites? Here’s a breakdown of the best science-based mosquito repellents. Some are more chemical-based. I opt for more natural solutions, but I’m listing what the science on all different types of repellents below.\n\n1. DEET: When researchers at New Mexico State University compared the efficacy of insect repellents for the type of mosquito that spreads the Zika virus, they found that products containing DEET were among the most effective. (10)\n\nAccording to the CDC, the concentration of DEET in mosquito repellent products is meant to indicate how long the product will be effective. A higher DEET concentration means that the product will work better for a longer period of time, while products containing lower concentrations of DEET will need to be reapplied. But the CDC also warns that concentrations over 50 percent provide no added protection.\n\nOne thing to look out for when using DEET is the risk of developing skin reactions, like rashes and blisters. It also shouldn’t be used on infants younger than 2 months. (11)\n\nMore seriously, other side effects include seizures and Gulf War Syndrome. And this widely used repellent may also harbor carcinogenic properties; it’s turned up in Hodgkin lymphoma and soft tissue sarcomas. (12)\n\n2. Oil of Lemon Eucalyptus: Oil of lemon eucalyptus is registered with the Environmental Protection Agency and is on the list of effective insect repellents. A study conducted in Queensland, Australia, and published in the Journal of the American Mosquito Association compared a mosquito repellent formulation containing 40 percent DEET to a formulation containing 32 percent lemon eucalyptus oil. Researchers found that the DEET formula provided 100 percent protection against mosquitoes for 7 hours, while the oil of lemon eucalyptus formula provided 95 percent protection for three hours. (13)\n\nOil of lemon eucalyptus oil should not be used on young children. Always perform a patch test on a small area of skin before applying it completely to be sure that you don’t have an adverse skin reaction.\n\n3. Citronella Oil: Studies show that citronella oil is an effective alternative mosquito repellent and boosts a repellency percentage of 96.7, according to research published in Rural and Remote Health. (13)\n\nHowever, some studies show that the protection time of citronella oil is less than that of products containing DEET, with a difference in protection time of up to 253 minutes. Data suggests that citronella oil provides a complete repellency time of at least 3 hours, and may have a longer protection time when combined with vanillin, the primary component of vanilla bean extract. (14)\n• The Keystone virus was first isolated in 1964 from mosquitoes found in Keystone, Florida. Until recently, it was only known to infect animals of the coastal regions, stretching from Texas to the Chesapeake Bay.\n• In August of 2016, the virus was detected in a 16-year-old boy living in Florida. He developed a rash and fever, two symptoms that are common among other mosquito-borne diseases, like Zika and West Nile.\n• There are a few science-backed mosquito repellents that can be used to prevent the spread of Keystone and other mosquito-borne viruses. Science-backed mosquito protection includes DEET, oil of lemon eucalyptus and citronella oil.\n• The protection times of these repellents vary, and DEET is linked to some serious health concerns.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Mosquito Virus Identified in Humans for the First Time Ever", "description": "Plus, the dark side of DEET, including links to lymphoma, soft tissue sarcoma and Gulf War Syndrome.", "url": "https://draxe.com/health/keystone-virus/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-12-17T16:39:56+00:00", "image": "https://draxe.com/wp-content/uploads/2018/07/Keystone-Virus_FB.jpg", "image:width": "1230", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_the_Keystone_Virus", "#Keystone_Virus_vs_Zika_vs_West_Nile_Virus", "#Science-Backed_Mosquito_Repellents", "https://draxe.com/health/avoiding-zika-virus/", "https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciy485/5035220?redirectedFrom=fulltext", "https://ancientnutrition.com/pages/supergreens-detox?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensdetox", "https://www.cdc.gov/ncezid/dvbd/", "https://draxe.com/health/health-effects-climate-change/", "http://www.who.int/globalchange/climate/summary/en/index5.html", "http://abt.ucpress.edu/content/79/3/169", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://ufhealth.org/news/2018/virus-found-florida-resident-may-be-widespread-throughout-southeast", "https://draxe.com/health/natural-remedies-for-bone-and-joint-pain/", "http://www.who.int/news-room/fact-sheets/detail/microcephaly", "https://www.cdc.gov/zika/about/index.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3111838/", "https://draxe.com/health/meningitis-symptoms/", "https://www.cdc.gov/westnile/symptoms/index.html", "https://academic.oup.com/jinsectscience/article/17/1/24/2996380", "https://draxe.com/health/home-remedies-for-mosquito-bites/", "https://academic.oup.com/jinsectscience/article/17/1/24/2996380", "https://www.cdc.gov/malaria/toolkit/DEET.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4921870/", "https://www.ncbi.nlm.nih.gov/pubmed/24772681", "https://draxe.com/essential-oils/citronella-oil/", "https://www.ncbi.nlm.nih.gov/pubmed/26564331", "https://ancientnutrition.com/pages/supergreens-detox?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensdetox", "https://www.ncbi.nlm.nih.gov/pubmed/21481108"], "authors": [], "publish_date": null}