{"result_id": "100007", "URL": "https://draxe.com/nutrition/dandelion-root/", "timestamp": "2023-04-25 14:59:59 CEST+0200", "meta": {"description": "Dandelion root is loaded with nutrients and boasts many health benefits, including helping to fight cancer. There are side effects too.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/nutrition/dandelion-root/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Dandelion Root vs. Dandelion Greens", "cleaned_text": "Dandelions have a reputation as both a granter of wishes and a dreaded weed and lawn nuisance. However, did you know that dandelion root is loaded with nutrients and boasts a variety of benefits to your health — just like dandelion greens and dandelion tea?\n\nWhat is dandelion root good for? This plant is low in calories, yet high in fiber as well as antioxidants, vitamin K, vitamin A and vitamin C. Research even suggests it can help reduce cancer growth, lower cholesterol levels and support liver function.\n\nIn addition to being rich in many vitamins and minerals that promote a strong immune system, dandelion is also readily available, easy to add to your diet and bursting with a signature, peppery flavor.\n\nDandelions, also known as Taraxacum officinale, are a type of flowering plant native to Europe, Asia and North America.\n\nAs a member of the daisy family of plants, dandelions are related to dahlias, thistle, ragweed, lettuce, artichokes and sunflowers.\n\nDandelions produce many small yellow flowers, called florets, which collectively form one flower head. Once it has finished flowering, the flower head dries out, the florets drop off and a seed head is formed.\n\nThe dandelion seeds are then naturally dispersed by the wind … or those looking to score a free wish.\n\nAlthough dandelion is often overlooked as just a pesky weed, it can actually be a useful addition to both your kitchen and your medicine cabinet. Many parts of the dandelion plant are edible, including the roots, leaves, seeds and flowers.\n\nBoth the root and greens are packed with health-promoting properties and can be used to make everything from dandelion tea to super-nutritious salads. Not only is this plant high in vitamins and antioxidants — such as silymarin, silibinin, curcumin, berberine and resveratrol — it also contains potassium, magnesium, zinc, iron and choline.\n\nJust like other roots, such as burdock and ashwagandha, dandelion root also has a rich history of use in traditional medicine. In fact, the origins of dandelion as a natural remedy can be traced all the way back to 659 B.C. in ancient China. It was also used in Arabic, Welsh and European medicine and was eaten raw or made into a juice or tonic.\n\nTraditional uses of the dandelion ranged from promoting better digestion to healing the liver. Some Native American tribes chewed on dandelion root to relieve pain, while others steamed the leaves and applied topically to ease sore throats.\n\nWhy are dandelions sometimes called “pee the beds”? In some countries, including Scotland and France, these plants earned the nickname pee-the-beds, or pissenlit in French, due to their natural diuretic effects that can cause increased urination.\n\nWhat does dandelion do to your body? Here’s more about what research has shown us regarding dandelion root benefits:\n\nA number of studies have found that dandelion root may be useful in the prevention and treatment of certain types of cancer, including liver cancer, leukemia, pancreatic cancer, breast cancer, esophageal cancer and prostate cancer.\n\nFor instance, a 2011 study out of Canada treated skin cancer cells with dandelion extract and found that it started killing off cancer cells within just 48 hours of treatment.\n\nAnother study in Oncotarget showed that dandelion root extract was able to kill 95 percent of colon cancer cells within two days.\n\n2. Can Help Reduce Cholesterol and High Blood Pressure\n\nHigh cholesterol is one of the major contributors to coronary heart disease. Changing your diet is one of the easiest ways to prevent high cholesterol.\n\nAlong with limiting your intake of processed foods, including more whole foods like fruits and vegetables can help lower cholesterol.\n\nDandelion root has been shown to help reduce cholesterol levels.\n\nIn one study, rabbits were fed a high-cholesterol diet and supplemented with dandelion root. Dandelion led to a reduction in total cholesterol, triglycerides and bad LDL cholesterol, as well as an increase in beneficial HDL cholesterol.\n\nStudies also suggest that dandelion may help normalize blood sugar levels and lower high blood pressure.\n\nStudies show that dandelion root is especially high in antioxidants, such as beta-carotene, polyphenols, coumarins and hydroxycinnamic acid derivatives — which may account for its many potent health benefits since this allows it to fight free radicals.\n\nFree radicals are compounds that form in your body as a result of things like stress, pollution and a poor diet. Over time, the accumulation of free radicals can lead to cell damage and chronic disease.\n\nAntioxidants can help neutralize these harmful compounds and have been shown to reduce the risk of conditions like heart disease and cancer.\n\nWhen applied topically, dandelion also seems to protect against skin damage caused by sun damage, aging and acne.\n\nFrom filtering toxins to metabolizing drugs, the liver is essential to many aspects of health.\n\nDandelion root benefits your liver, helping protect it from oxidative stress and keeping it working effectively. In fact, folk medicines originating from China, India and Russia have long recognized dandelion’s effect as a liver tonic, mostly due to its anti-inflammatory effects and ability to fight oxidative stress.\n\nOne study done in Korea showed that dandelion extract prevented damage to the liver caused by alcohol toxicity in both liver cells and mice.\n\nThese protective effects are likely due to the amount of antioxidants found in dandelion root, as well as its ability to prevent cell damage.\n\nIs dandelion good for your kidneys? In most cases, yes.\n\nThis plant is known for having natural diuretic effects, meaning it increases the frequency of urination, which can help keep the kidneys healthy.\n\nAccording to Mount Sinai Medical Group, “Herbalists use dandelion root to detoxify the liver and gallbladder, and dandelion leaves to help kidney function.” For centuries, Native Americans boiled dandelion in water and took it to treat kidney disease, as well as other digestive issues like heartburn and upset stomach.\n\nIn addition to its many other health benefits, dandelion root also possesses antimicrobial and antiviral properties that can help stop the growth of disease-causing bacteria and pathogens.\n\nA study in Ireland published in Phytotherapy Research showed that dandelion root was especially effective against certain strains of bacteria that are responsible for staph infections and foodborne illness.\n\nAlthough more research is needed, dandelion root may be a useful natural method for supporting the immune system in fighting off bacterial infections.\n\nTaraxacum officinale is a great source of vitamin K, an important nutrient that plays a key role in bone health. This essential vitamin increases levels of a specific protein needed to help build strong bones, which is exactly why lower intakes of vitamin K have been linked to an increased risk of fractures and reduced bone density.\n\nDandelion also contains calcium, which forms the structure of the bones and teeth to help keep them strong.\n\nEach serving of dandelion supplies a hearty dose of antioxidants, which can protect skin cells against damage to slow signs of aging and keep you looking (and feeling) your best.\n\nNot only that, but a 2015 in vitro study out of Canada also showed that applying extracts of dandelion (Taraxacum officinale) to skin cells helped protect against harmful ultraviolet damage.\n\nSome research also shows that dandelion could possess powerful antimicrobial properties, which can help block bacterial growth to prevent skin infections.\n\nDandelion roots are a great source of fiber and are especially rich in a type of soluble fiber known as inulin.\n\nFiber has been associated with several health benefits, especially when it comes to regulating blood sugar levels. Because fiber moves through the body undigested, it helps slow the absorption of sugar in the bloodstream, which can help improve long-term blood sugar control.\n\nIn addition to maintaining steady blood sugar levels, fiber can also protect against a multitude of digestive issues, including constipation, stomach pains, hemorrhoids, gastroesophageal reflux disease (GERD) and stomach ulcers.\n\nRelated: Top 23 High-Fiber Foods and the Benefits of Each\n\nProducts containing dandelion come in a variety of forms, including tinctures, liquid extract, teas, tablets and capsules.\n\nDandelions are abundant throughout backyards and grocery stores alike. While it is safe to pick dandelions from your own yard and use them, you should be sure to avoid areas where weed killer or pesticides have been sprayed and remember to wash thoroughly.\n\nGather the roots by digging a bit deep into the soil and pulling out all of the stems that the flowers may be attached to. Wash the roots well to make sure all dirt is removed before using.\n\nThe flowers of the dandelion plant can be used to make dandelion wine or dandelion jelly, while the greens can be added to soups, salads and pasta dishes.\n\nThe roots of the plant can be used in a wide array of dandelion recipes as well, but many choose to brew dandelion root into a tasty tea or soothing coffee substitute.\n\nDandelion root tea and coffee are both natural, caffeine-free beverages that can help start your day off on the right foot. Plus, the potential dandelion tea benefits are similar to the benefits of the root, which makes it an effortless way to get in your fix in the morning.\n\nThere are many different methods available for how to make dandelion root tea, but it generally involves pouring hot water over the root and letting it steep for five to 10 minutes before straining. To make dandelion coffee, simply roast the root first by baking for around 10–15 minutes at 350 degrees Fahrenheit.\n\nDandelion extract and pills are available at some pharmacies and health stores. If you decide to supplement with dandelion, make sure to look for a reputable brand with minimal added ingredients and fillers.\n\nAlthough there’s no official recommended dosage for dandelion root capsules, most dried/powder supplements contain between 500–1,500 milligrams of dandelion root extract per serving.\n\nIf using fresh leaves to make tea, consume about four to 10 grams daily. If supplementing with dandelion tincture, have between 0.5 to one teaspoon (2–5 mL) three times per day.\n\nAlways read dosage recommendations for the specific product you’re using, since these vary from brand to brand depending on potency.\n\nIs it safe to take dandelion root every day? It depends how you’re using it and your overall health.\n\nMany people can safely drink one to three cups of dandelion tea every day. For best results, start with a lower dose, and work your way up to assess your tolerance and prevent any potential side effects.\n\nDandelion is very high in vitamin K, which may impact blood clotting. If you take warfarin or another blood thinner, you need to maintain consistent vitamin K intake to prevent interfering with your medication.\n\nBecause it acts as a diuretic, this plant can have an impact on kidney function. It may also interact with medications that are broken down by the liver.\n\nTo avoid interactions, try taking dandelion extract or drinking dandelion tea two or more hours after/before taking any drugs.\n\nMedications that may potentially interact with dandelion extract and other products include:\n\nIf you have any underlying health conditions, such as liver disease, diabetes or kidney problems, it’s best to talk to your doctor before starting supplementation or making any major changes to your diet. This is especially important if you take daily medications and are considering supplementing with dandelion root extract.\n\nWhat are the side effects of taking dandelion root? Dandelion is “generally recognized as safe” as a food by the U.S. Food and Drug Administration. For most healthy adults, adding this powerful herb to your diet is typically safe and beneficial, however there are several side effects that need to be considered as well.\n\nFor starters, dandelion may cause allergic reactions in some people when eaten or applied to the skin. If you have a sensitivity to other plants in the same family of plants, such as ragweed, daisies or thistle, you may also have a sensitivity to dandelion.\n\nIf you experience symptoms like swelling, itching or redness, you should discontinue use immediately, and talk to your health care provider.\n\nIs dandelion root ever bad for your kidneys? Dandelion acts as a diuretic, causing your body, especially your kidneys, to produce more urine, which is the same effect that diuretic drugs have.\n\nIf you also take prescription/herbal diuretics, this may negatively affect kidney function and put you at risk for developing an electrolyte imbalance, so always follow directions, and be cautious if you already have kidney issues.\n• Dandelion, also known as Taraxacum officinale, is a type of plant that belongs to the daisy family.\n• Despite being considered little more than a weed by many, dandelion packs in some impressive health benefits when it comes to supporting the digestive and immune systems.\n• What can dandelion treat? While it’s not treated as a drug, as a supplement it offers protection against oxidative stress, liver disease, high cholesterol and blood pressure, high blood sugar, cancer, kidney issues, and infections.\n• Dandelion root can be taken in pill or extract supplement form or used to brew a hot cup of caffeine-free coffee or tea.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dandelion Root vs. Dandelion Greens", "description": "Did you know that both the root and greens of this herb are loaded with nutrients and boast a variety of benefits to your health?", "url": "https://draxe.com/nutrition/dandelion-root/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2022-02-26T13:32:09+00:00", "image": "https://draxe.com/wp-content/uploads/2019/10/DandelionRootFB.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Dandelion", "#Dandelion_Root_Benefits", "#Dosage_and_Preparation_UsesRecipes", "#Drug_Interactions", "#Risks_and_Side_Effects", "https://draxe.com/nutrition/dandelion-greens/", "https://draxe.com/nutrition/dandelion-tea/", "https://draxe.com/nutrition/vitamin-a/", "https://draxe.com/nutrition/vitamin-c-benefits/", "https://draxe.com/nutrition/artichokes/", "https://draxe.com/nutrition/burdock-root/", "https://draxe.com/nutrition/ashwagandha-benefits/", "https://pubmed.ncbi.nlm.nih.gov/31391857/", "https://pubmed.ncbi.nlm.nih.gov/29234282/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3281857/", "https://www.ncbi.nlm.nih.gov/pubmed/22647733", "https://pubmed.ncbi.nlm.nih.gov/34476429/", "https://www.ncbi.nlm.nih.gov/pubmed/18425335", "https://www.ncbi.nlm.nih.gov/pubmed/21234313", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5341965/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2820990/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5979456/", "https://draxe.com/nutrition/beta-carotene/", "https://www.ncbi.nlm.nih.gov/pubmed/21226664", "https://pubmed.ncbi.nlm.nih.gov/31254243/", "https://www.researchgate.net/publication/302959005_Hepatoprotective_properties_of_Dandelion_Recent_update", "https://pubmed.ncbi.nlm.nih.gov/33804908/", "https://pubmed.ncbi.nlm.nih.gov/20347918/", "https://www.mountsinai.org/health-library/herb/dandelion", "https://draxe.com/nutrition/liver-cleanse/", "https://pubmed.ncbi.nlm.nih.gov/29548293/", "https://www.ncbi.nlm.nih.gov/pubmed/25644491", "https://draxe.com/nutrition/vitamin-k-foods/", "https://www.ncbi.nlm.nih.gov/pubmed/12540415", "https://draxe.com/nutrition/foods-high-in-calcium/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4630464/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5553762/", "https://draxe.com/nutrition/inulin/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3878841/", "https://pubmed.ncbi.nlm.nih.gov/19335713/", "https://draxe.com/nutrition/high-fiber-foods/", "https://draxe.com/nutrition/energizing-alternatives-to-coffee/", "https://www.myteadrop.com/blogs/news/dandelion-tea-benefits", "https://pubmed.ncbi.nlm.nih.gov/30000932/", "https://draxe.com/health/ragweed-allergy/"], "authors": [], "publish_date": null}