{"result_id": "100046", "URL": "https://draxe.com/health/coronavirus-covid-19/", "timestamp": "2023-04-25 15:00:37 CEST+0200", "meta": {"description": "Coronavirus disease 2019 (COVID-19) is a new virus that was recently identified in humans, causing flu-like symptoms. Learn the symptoms and protective measures to take.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/coronavirus-covid-19/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Coronavirus (COVID-19) Symptoms and Protective Measures to Take", "cleaned_text": "COVID-19 is an ever-changing topic in the news and other outlets, but, to date, the coronavirus has sparked panic around the globe, shutting down schools, sporting events and entire communities as scientists scramble to try to control the virus.\n\nOn March 11, 2020, the World Health Organization characterized coronavirus as a pandemic. Since then, travel between countries has become heavily restricted and parts of certain countries are on lockdown, as are various states in the U.S.\n\nBut although it has become a global problem, there are plenty of steps you can take locally to help neither contract this highly contagious virus nor spread it. This includes practicing cough etiquette, washing your hands frequently and keeping your distance from others who are sick to prevent the spread of germs.\n\nThis article will take a closer look at the coronavirus, including what it is, what we know about it to date and what scientists are working on to help contain and combat it.\n\nWhat Is the Coronavirus?\n\nCoronaviruses (CoV) are a large family of viruses found in a variety of mammals and birds. In humans. These viruses can cause a number of conditions, ranging from mild respiratory infections to more serious illnesses like severe acute respiratory syndrome (SARS) or Middle East respiratory syndrome (MERS). Coronavirus disease 2019 (COVID-19) is a new strain of coronavirus that was recently identified in humans.\n\nCoronaviruses are zoonotic, which means that they can be transmitted from animals to humans. SARS, for example, is believed to have originated from civet cats while MERS was first transmitted to humans from dromedary camels.\n\nLike other respiratory infections, coronaviruses can also be spread from person-to-person through contact with bodily fluids such as saliva, blood or urine. Although the first reported case was in China, scientists have still not traced where exactly COVID-19 originated.\n\nCOVID-19 appears to be highly transmissible, and those who are infected can pass the virus onto others even before symptoms present. Although people can shed the virus for weeks after infection, research suggests that it’s most contagious in the early stages. According to a recent study published, the virus can also live on surfaces for 2–3 days and may even survive in the air for up to three hours.\n\nOn March 11, the World Health Organization (WHO) officially upgraded the status of coronavirus from an epidemic to a pandemic, marking the first time an outbreak has received this classification since the emergence of H1N1 (swine flu) in 2009. A pandemic is defined as an epidemic that “occurs over a wide geographic area and affects an exceptionally high proportion of the population.”\n\nAlthough many online sources have stated that products like white vinegar and homemade hand sanitizers can kill off the virus, there is still no evidence to support these claims. Therefore, until a vaccine or treatment is released for the virus, taking a few basic protective measures is prudent.\n\nWhere Has It Spread in the U.S. and World?\n\nCOVID-19 has spread rapidly within the past few weeks, with confirmed cases reported in every continent around the globe. As of April 7, there were nearly 1.4 million cases around the globe, with the highest number in countries including:\n\nWithin the U.S., nearly 12,000 people have died from coronavirus as of April 7, 2020, and states like New York, New Jersey, Michigan and Louisiana have been hit the hardest. Currently, every state has multiple confirmed cases of COVID-19, ranging from over 130,000 in New York to 185 in Alaska.\n\n\n\nNow that we’ve covered what exactly coronavirus is and where it has spread, let’s take a closer look at this pandemic by the numbers:\n• None As of April 7, 2020, there are 1,381,014 cases of COVID-19 worldwide, 27 percent of which are in the United States.\n• There are currently 211 countries, territories or areas with confirmed cases around the world.\n• None The global death toll for the virus currently stands at 78,269.\n• None Symptoms can emerge between 2–14 days after infection.\n• None Without containment measures such as quarantine, it’s that an infected person could spread the virus to 1.5–3.5 people.\n• None Although the virus can infect anyone, the mortality rate with age. Those who are in their 50s, for example, are three times as likely to die from coronavirus as those in their 40s. Meanwhile, older adults over 80 have a mortality rate of nearly 15 percent.\n• Older adults, people with asthma, those with HIV and those with other serious underlying medical conditions may be at a higher risk for severe illness caused by COVID-19.\n• According to the Washington Post, while more women than men have been infected in the United States, men may be at a higher risk of fatality.\n\nThe symptoms of coronavirus are often mild and similar to other respiratory infections, including the common cold. While some people may exhibit no symptoms, symptoms usually appear anywhere from three days to 13 days after contracting the virus.\n\nSome of the most common symptoms include:\n\nIn severe cases, coronavirus may also cause more serious issues, including pneumonia, kidney failure, severe acute respiratory syndrome or even death.\n\nIf you experience any symptoms like fever, cough or difficulty breathing and have recently traveled from an area with an ongoing spread or have been in contact with someone who is infected, the CDC recommends staying home and notifying your healthcare provider.\n\nThe FDA recently approved a test that is able to quickly diagnose COVID-19 by collecting samples from the nose, throat or lungs. In the U.S., there are 95 public health labs in all 50 states, along with DC, Guam, Puerto Rico, and the U.S. Virgin Islands, that are currently conducting COVID-19 diagnostic tests.\n\nIf you experience symptoms like difficulty breathing, persistent chest pain or pressure, bluish lips or confusion, seek medical attention immediately.\n\n\n\nHow to Protect Yourself\n\nTaking a few basic protective measures against infection is a simple strategy that can help prevent the spread of the coronavirus. Here are a few steps that you can take to protect yourself and others.\n\nWash your hands regularly using either soap and water or an alcohol-based rub, which can help kill off any viruses and prevent the spread of germs. Be sure to wash hands for at least 20 seconds before eating and after coughing, sneezing, blowing your nose or using the bathroom.\n\nIf soap and water is not available, use a hand sanitizer that contains at least 60 percent alcohol.\n\nIdeally, try to maintain at least three feet of distance from others if you are in a community where COVID-19 is spreading. This can help prevent you from breathing in any liquid droplets containing the virus, which can be sprayed through the nose or mouth through coughing and sneezing.\n\nViruses can live on surfaces for several days at a time. Washing and disinfecting surfaces that you regularly use can help block the spread of germs to prevent infection.\n\nThe CDC recommends using EPA-registered household disinfectants, including alcohol or diluted bleach solutions.\n\nYour hands can pick up viruses from the surfaces that you touch. Touching your face with unwashed hands can transfer these germs, which can then enter the body and cause infection.\n\nCoughing or sneezing into the bend of your elbow or using a tissue to cover your mouth can help prevent the spread of germs and viruses. Be sure to also dispose of used tissues immediately and wash your hands thoroughly after exposure to any respiratory secretions.\n\nThe CDC advises using a cloth face mask to cover your nose and mouth in public settings to help prevent the spread to others. Because medical-grade masks and respirators are in short supply, they should be reserved for caregivers, healthcare providers and first responders.\n\n\n\nIn order to stay prepared, you may want to stock up on other household supplies and anything else you regularly use for your health. Ideally, you should have a 30-day supply of essentials, including laundry detergent, soap, diapers and pantry staples.\n\n8. Stay up-to-date to make sure the virus is not in your region\n\nFind and bookmark the website of your local health department, which can help you stay up-to-date with the latest news and ensure that you know who to contact in case of infection.\n\nIf you’re not feeling well, you should stay home to avoid infecting others. If you experience more serious side effects like cough, fever or shortness of breath, contact your own health provider to determine the next steps.\n\nThere is still a lot that is unknown about the “novel” or new coronavirus.\n\nAccording to the Centers for Disease Control and Prevention, there is currently no specific treatment for COVID-19. Those who are infected can receive medical care to help alleviate symptoms, which may also include care to support vital organ functions in more severe cases.\n\nThere are no approved treatments for coronaviruses and very few effective antiviral medications in general. Additionally, developing new drugs can require a massive investment in terms of time, money and resources, which can make it challenging to find medical treatments against COVID-19.\n\nOn March 6, President Trump signed an $8.3 billion spending bill into law to provide emergency funding to develop treatments and enact public health measures to prevent the spread of COVID-19.\n• None Coronaviruses are a large family of viruses that can cause a range of different symptoms.\n• None Coronavirus disease 2019 (COVID-19) is a new strain of virus that was recently identified in humans and can cause symptoms such as fever, cough and shortness of breath.\n• None Until new treatments and therapies are developed, however, it’s important to wash your hands frequently, maintain distance from others who are sick, disinfect surfaces, practice respiratory hygiene and seek medical care immediately if you are sick.", "opengraph": {"locale": "en_US", "type": "article", "title": "Coronavirus (COVID-19) Symptoms and Protective Measures to Take", "description": "Coronavirus disease 2019 (COVID-19) is a new virus that was recently identified in humans, causing flu-like symptoms. Learn the symptoms and protective measures to take.", "url": "https://draxe.com/health/coronavirus-covid-19/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2020-04-07T18:06:55+00:00", "image": "https://draxe.com/wp-content/uploads/2020/02/Corona_1230x630-scaled.jpg", "image:width": "2560", "image:height": "1311", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_the_Coronavirus", "#Where_Has_It_Spread_in_the_US_and_World", "#Statistics", "#Symptoms", "#Diagnosis", "#How_to_Protect_Yourself", "#Coronavirus_Outlook_to_Date", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/events-as-they-happen", "https://www.who.int/health-topics/coronavirus", "https://ancientnutrition.com/collections/popular-products?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_20offjan", "https://www.medrxiv.org/content/10.1101/2020.03.05.20030502v1.full.pdf", "https://www.who.int/docs/default-source/coronaviruse/who-china-joint-mission-on-covid-19-final-report.pdf", "https://www.medrxiv.org/content/10.1101/2020.03.09.20033217v1.full.pdf", "https://www.merriam-webster.com/dictionary/pandemic", "https://www.cdc.gov/coronavirus/2019-ncov/locations-confirmed-cases.html", "https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200311-sitrep-51-covid-19.pdf?sfvrsn=1ba62e57_8", "https://www.nytimes.com/2020/02/25/health/prepare-for-coronavirus.html?", "http://weekly.chinacdc.cn/en/article/id/e53946e2-c6c4-41e9-9a9b-fea8db1a8f51", "https://www.washingtonpost.com/health/2020/04/04/coronavirus-men/", "https://www.cdc.gov/coronavirus/2019-ncov/faq.html", "https://www.cdc.gov/coronavirus/2019-ncov/faq.html", "https://www.cdc.gov/coronavirus/2019-ncov/testing-in-us.html", "https://ancientnutrition.com/collections/supergreens?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensship_v2", "https://www.cdc.gov/coronavirus/2019-ncov/about/prevention.html", "https://www.cdc.gov/coronavirus/2019-ncov/about/prevention-treatment.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2Fabout%2Fprevention.html"], "authors": [], "publish_date": null}