{"result_id": "100002", "URL": "https://draxe.com/health/antibiotic-side-effects/", "timestamp": "2023-04-25 14:59:54 CEST+0200", "meta": {"description": "Antibiotic side effects may be strange and unexpected, including developing a black or hairy tongue, tendon ruptures and even allergies and asthma.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/antibiotic-side-effects/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Antibiotic Side Effects: 8 Insane Things They Do to Your Body", "cleaned_text": "Antibiotic side effects should be on everyone’s radar, given the scope of antibiotic use in the United States. As of April 2018, antibiotics ranked as the No. 1 most commonly prescribed drug class with sales hitting $40 billion globally. (1) Between 2000 and 2015, human use of antibiotics rose by nearly 40 percent. And some economists now say that if nothing changes, antibiotic resistance will be responsible for 10 million deaths around the world by 2050. (2) Clearly, a lot of people are taking antibiotics (and a lot of money is being made), but are they now hurting us more than they’re helping us?\n\nAs antibiotic resistance continues to rise, these medications are creating even more health problems in the U.S. and around the world. In fact, a recent article entitled Deadly ‘Nightmare Bacteria’ Resistant to Antibiotics Infected 221 Americans in 2017, CDC Says is just one of many recent accounts of the scary antibiotic side effects.\n\nI’m about to tell you about more about both the short and long-term side effects of antibiotics…\n\nWhat Is an Antibiotic?\n\nWhat exactly is an antibiotic? Antibiotics definition: A drug used to treat bacterial infections. When antibiotics first came on the scene, they consisted of naturally derived substances made from a microorganism to selectively inhibit the growth of other microorganisms. Penicillin, discovered in 1926, is a perfect example. The fungi-produced antibiotic inhibited certain types of harmful bacteria. Nowadays, we have many more antibiotics on the market and a lot of them are synthetic or manmade. (3)\n\nWondering about the top 10 antibiotics and their uses? Some of the most commonly used generic antibiotics include:\n\nSome of the most common uses of antibiotics include the treatment of acne, bronchitis, conjunctivitis (pink eye), ear infections, sexually transmitted diseases, skin infections, strep throat, traveler’s diarrhea, upper respiratory tract infections and urinary tract infections. (4)\n\nIt’s important to note that antibiotics have zero effect on viral infections which is why they should never be used for them. Examples of viral infections in which people wrongly choose to use antibiotics? The common cold or influenza. Some people also take antibiotics for throat infection, but that should never be recommended unless it’s a bacteria throat infection such as strep. As the CDC points out: “Most sore throats will go away on their own without antibiotics.” (5)\n\nPatients stopping antibiotics early due to side effects is a common occurrence. Many doctors will warn that stopping early leaves bacteria behind to grow stronger or possibly resistant to additional treatment. According to the World Health Organization, “Evidence is emerging that shorter courses of antibiotics may be just as effective as longer courses for some infections. Shorter treatments make more sense – they are more likely to be completed properly, have fewer side effects and also likely to be cheaper. They also reduce the exposure of bacteria to antibiotics, thereby reducing the speed by which the pathogen develops resistance.” (6)\n\nWhether you take antibiotics when it’s inappropriate (viral infections) or when it can be viewed as warranted (bacterial infections), let’s talk about some of the many possible side effects of antibiotics.\n\nHow do antibiotics affect the body? Here are just some of the many possible and undesirable side effects of antibiotics on the body:\n\nEach year, over 23,000 Americans are dying because of bacteria that is resistant to antibiotics and the CDC is warning about resistant “nightmare bacteria” spreading throughout the country. (7)\n\nOne of the biggest general concerns when it comes to antibiotic use is the fact that we are seeing infections that are now resistant to antibiotics. Why is this happening? Misuse and overuse of antibiotics is definitely a main reason, but so is the use of antibiotics in the food we’re eating; especially conventional meat, dairy and antibiotics in fast food is rampant.\n\nAs the CDC points out, “Antibiotic resistance has been called one of the world’s most pressing public health problems. Antibiotic resistance can cause illnesses that were once easily treatable with antibiotics to become dangerous infections, prolonging suffering for children and adults. Antibiotic-resistant bacteria can spread to family members, schoolmates, and co-workers, and may threaten your community.” (8)\n\nAs Dr. Katherine Fleming-Dutra, deputy director of the Office of Antibiotic Stewardship at the U.S. Centers for Disease Control and Prevention in Atlanta, point outs, “Any time antibiotics are used, they can cause side effects and lead to antibiotic resistance.” (9)\n\nAs a result of antibiotic use, people are taking longer to heal from infections that once were more easily treated with antibiotics. Bacterial infections like UTIs and pneumonia are now becoming much harder to treat. The type of antibiotics that are most often employed to treat urinary tract infections are now considered ineffective for over 50 percent of the patients in many parts of the world.\n\nAccording to the Council on Foreign Affairs, “Antibiotics are facing an existential crisis less than a century since their introduction. The bacteria-fighting drugs are becoming less effective as a result of their overuse in both humans and animals.” (10) Clearly, antibiotics are failing us more as time goes on.\n\nRecent research is now showing a link between antibiotic use and the development of allergies. A large study published April 2, 2018 analyzed the health records of more than 792,000 children born between 2001 and 2013 and they found a link between babies who took antibiotics (or antacids) between birth and six months of age and the development of allergies as well as asthma. (11)\n\nAccording to the lead author of the study, Dr. Edward Mitre, exposure to antibiotics appeared to double children’s future asthma risk, while prompting a 50 percent increase in risk for allergies to dust, dander and pollen (allergic rhinitis); eye allergies (allergic conjunctivitis); and anaphylaxis. (12)\n\nDiarrhea is an unpleasant yet very common side effect of taking antibiotics and it can lead to further complications such as dehydration and electrolyte imbalances. Diarrhea can even persist weeks after you stop taking an antibiotic. This is one of the common side effects of antibiotics when they are taken by both children and adults. (13)\n\nWhen talking about antibiotics side effects tiredness definitely makes the list of possibilities. So if it’s not bad enough that you’re sick and may already be feeling worn out, antibiotics may make you feel even more exhausted. This is a side effect of antibiotics we have known about for decades. Sometimes, people who take antibiotics feel tired or even experience extreme fatigue. (14)\n\nWhat are the side effects of amoxicillin, a penicillin-type antibiotic? Well, there are many, but a swollen, black or “hairy” tongue makes the list. What on earth? No, this isn’t a joke. Common side effects of amoxicillin include: (15)\n\nAnd if you think that a tongue with that very strange description is the worst it gets then think again. Other serious side effects of amoxicillin include:\n• Colitis caused by an overgrowth of Clostridium spp bacteria in the intestines\n\nCan antibiotics mess with your period? The ability of antibiotics to disrupt the menstrual cycle continues to be debated with research on this topic dating back to 1947 with a study on penicillin’s effects on the menstrual cycle. (16)\n\nIt appears that some women don’t experience a disruption in their cycle while others do when taken antibiotics. Since antibiotics and hormones both need to be processed by the liver, it makes sense that taking antibiotics may affect estrogen and progesterone metabolism in a woman. When hormone balance is possibly thrown off by antibiotics then this is when irregularities in a cycle could occur for a woman.\n\nOther theories are that it’s not the antibiotics, but the physical and emotional stress of illness that could cause a delay in your period. (17)\n\nRecently, a class of antibiotics called fluoroquinolones have been making headlines as experts expect that they can damage mitochondria and cause irreversible nerve damage. Researchers are now trying to figure out why. (18)\n\nFluoroquinolones have been associated with troubling side effects including depression, brain fog and even hallucinations and psychotic reactions. (19) Around 10 years ago, the FDA even required makers of fluoroquinolone antibiotics to add a “black box” warning to the drugs to warn both prescribing doctors as well as patients of the increased risk for tendonitis and even tendon rupture as potential side effects of these antibiotics!\n\nHow long do the side effects of antibiotics last? It depends on the antibiotic, the specific side effects of that antibiotic and the individual, but side effects of antibiotics have been known to last for several weeks. For example, with mild cases of diarrhea due to antibiotic use, diarrhea can continue for as long as two weeks after you finish taking an antibiotic. In more severe cases, side effects of antibiotics can go on for several weeks. (20)\n\nThere are thankfully a lot of incredible natural remedies that have been shown by research to be close to or even as powerful as antibiotics without the unwanted side effects of antibiotics! If we’re going to stop antibiotic-resistance superbugs then it’s important to consider natural antibiotic alternatives that can be used to obtain an effective yet safer outcome. Unlike antibiotics, these natural options are not known for creating super bugs.\n\nFor starters, there is raw garlic, garlic oil and garlic supplements. Garlic is known to have potent antibacterial, antiviral, antifungal and antiprotozoal abilities. (21) Garlic oil is one of my favorite natural remedies for an ear infection.\n\nOregano oil is another incredible natural alternative to antibiotics. Oregano (Origanum vulgare) is an herb you may already love it for its culinary use, but it also has a long history of fighting infections. Oregano oil contains powerful compounds like carvacrol and thymol which have been shown in scientific studies to have strong anti-bacterial and antimicrobial properties. (22, 23) Oregano oil is by far one of my favorite natural alternatives to antibiotics.\n\nAnother incredible alternative to antibiotics is colloidal silver. In vitro research conducted in 2017 demonstrates how naturally synthesized colloidal silver nanoparticles display impressive antibacterial and anti-fungal activity. (24) Colloidal silver is often recommended as an alternative therapy for a sinus infection or a cold, two health situations where antibiotics are often misused since a cold is always caused by a virus and as sinus infection is most often caused by a virus as well. (25)\n\nThere are also more antibacterial foods you can eat in addition to garlic and oregano. Some of my favorites that I consume on a regular basis include Manuka honey, onions, mushrooms, and turmeric.\n• Overuse and misuse of antibiotics is creating dangerous antibiotic resistance bacteria known as superbugs.\n• Antibiotics are only effective (but now, not always!) against bacterial infections, not viral infections.\n• There are so many side effects of antibiotics that we know about and as research continues, we’re learning even more such as the link between childhood antibiotic use and the development of allergies and asthma.\n• Many people take antibiotics and don’t realize the extent of possible bizarre and outright scary side effects which is why education on possible side effects should be a must before taking an antibiotic or giving an antibiotic to your chid.\n• There are natural remedies like oregano oil, garlic and colloidal silver that have been shown to have potent antibiotic-like abilities.", "opengraph": {"locale": "en_US", "type": "article", "title": "Antibiotic Side Effects: 8 Insane Things They Do to Your Body", "description": "Antibiotic side effects may be strange and unexpected, including developing a black or hairy tongue, tendon ruptures and even allergies and asthma.", "url": "https://draxe.com/health/antibiotic-side-effects/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2020-02-03T17:15:05+00:00", "image": "https://draxe.com/wp-content/uploads/2018/04/AntibioticSideEffects_FB.jpg", "image:width": "1230", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_an_Antibiotic", "#8_Potential_Side_Effects_of_Antibiotics", "#Alternatives_to_Antibiotics", "https://www.barrons.com/articles/antibiotics-could-clean-up-as-m-a-catalyst-1522685528", "https://draxe.com/health/antibiotic-resistance/", "http://time.com/5215398/antibiotics-rates-worldwide/", "http://www.newsweek.com/nightmare-bacteria-resistant-antibiotics-are-growing-problem-cdc-says-870038", "https://www.medicinenet.com/script/main/art.asp?articlekey=8121", "https://draxe.com/health/cystic-acne/", "https://draxe.com/health/16-strep-throat-home-remedies/", "https://www.drugs.com/article/antibiotics.html", "https://draxe.com/health/natural-cold-remedies/", "https://www.cdc.gov/antibiotic-use/community/for-patients/common-illnesses/sore-throat.html", "http://www.who.int/features/qa/stopping-antibiotic-treatment/en/", "https://www.sciencealert.com/completely-antibiotic-resistant-unusual-bacteria-future-issue-spreading-here-cdc-nightmare-bacteria", "https://draxe.com/health/antibiotics-in-fast-food/", "https://www.cdc.gov/antibiotic-use/community/about/antibiotic-resistance-faqs.html", "https://www.reuters.com/article/us-health-sinusitis/people-with-sinus-infections-stay-on-antibiotics-too-long-idUSKBN1H61KZ", "https://draxe.com/health/home-remedies-for-uti/", "https://www.cfr.org/backgrounder/end-antibiotics", "https://draxe.com/health/asthma-symptoms/", "https://www.ncbi.nlm.nih.gov/pubmed/29610864", "https://draxe.com/health/8-natural-allergy-relief-remedies/", "https://www.cbsnews.com/news/antibiotics-antacids-may-increase-babys-risk-of-allergies/", "https://draxe.com/health/how-to-stop-diarrhea/", "https://www.health.harvard.edu/digestive-health/antibiotic-associated-diarrhea", "https://www.aarp.org/health/drugs-supplements/info-06-2012/medications-that-cause-chronic-fatigue.html", "https://www.rxlist.com/amoxicillin-side-effects-drug-center.htm", "https://draxe.com/health/jaundice/", "https://draxe.com/health/hives-treatment/", "http://sti.bmj.com/content/sextrans/23/1/1.full.pdf", "https://draxe.com/essential-oils/essential-oils-for-hormones/", "http://www.newhealthguide.org/Can-Antibiotics-Delay-My-Period.html", "https://www.nature.com/articles/d41586-018-03267-5", "https://draxe.com/health/natural-remedies-depression/", "https://well.blogs.nytimes.com/2012/09/10/popular-antibiotics-may-carry-serious-side-effects/", "https://draxe.com/health/tendonitis/", "https://www.mayoclinic.org/diseases-conditions/achilles-tendon-rupture/symptoms-causes/syc-20353234", "https://www.summitmedicalgroup.com/library/adult_health/aha_antibiotic_associated_diarrhea/", "https://draxe.com/health/stopping-superbugs/", "https://draxe.com/nutrition/7-raw-garlic-benefits-reversing-disease/", "https://www.ncbi.nlm.nih.gov/pubmed/11759674", "https://draxe.com/health/natural-ear-infection-remedies/", "https://draxe.com/essential-oils/oregano-oil-benefits-superior-prescription-antibiotics/", "https://www.ncbi.nlm.nih.gov/pubmed/23553824", "https://www.ncbi.nlm.nih.gov/pubmed/29537935", "https://draxe.com/nutrition/colloidal-silver-benefits/", "https://www.ncbi.nlm.nih.gov/pubmed/28530184", "https://draxe.com/health/sinus-infection-natural-remedies/", "https://www.cdc.gov/antibiotic-use/community/for-patients/common-illnesses/sinus-infection.html", "https://draxe.com/nutrition/manuka-honey-benefits-uses/", "https://cen.acs.org/articles/93/web/2015/03/Turmeric-Compound-Spices-Antimicrobial-Surface.html"], "authors": [], "publish_date": null}