{"result_id": "100018", "URL": "https://draxe.com/health/chelation-therapy/", "timestamp": "2023-04-25 15:00:08 CEST+0200", "meta": {"description": "While more research is still needed, chelation therapy offers many health benefits, particularly for removing toxic heavy metals from the body.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/chelation-therapy/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Chelation Therapy for Heavy Metal Toxicity and More", "cleaned_text": "Chelation therapy is considered an alternative medicine that has the purpose of removing “heavy metals” and toxins from the body.\n\nWhy would someone experience heavy metal toxicity in the first place? Although it might sound like something only tied to rare circumstances of accidental poisoning, heavy metals are more common than you think. If you have mercury fillings in your teeth (or amalgam fillings), have been vaccinated to prevent various diseases, eat farm-raised fish regularly, consume foods that are grown in foreign countries (like China) that aren’t certified organic, or are healing from radiation and chemotherapy treatments, you’re likely experiencing heavy metal toxicity right now to some degree.\n\nChelation therapy involves a chemical solution called EDTA (ethylenediaminetetraacetic acid), which is administered into the body — usually directly injected into the bloodstream — so it can bind with excess minerals. Once bound to “toxins” in the body, EDTA helps detox the body of heavy metals by removing them before imbalances and illnesses have the chance to develop.\n\nWhat is chelation therapy good for? First developed and used in the 1950s for the treatment of heavy metal poisoning, chelation therapy using EDTA is now performed to remove common heavy metals, including lead, mercury, copper, iron, arsenic, aluminum and calcium. While still a controversial practice in mainstream medicine and one that requires more research for us to fully understand how it works, studies show that chelation therapy has potential for reducing the risk of heightened inflammation, heart disease, infections and more.\n\nA National Health Interview Survey conducted by the Centers for Disease Control and Prevention found that 111,000 adults 18 years or older had used chelation therapy as a form of complementary medicine between the years 2006–2007. (1) Since the popularity of chelation therapy has grown since this time and more health care professionals are being trained in this practice, it’s safe to say that this number is steadily rising.\n\nMany people who have used chelation therapy regularly feel that it helps them remain more energetic and immune to common illnesses, environmental toxins and stress. Studies show that chelation is scientifically proven to rid the body of excess or toxic metals, especially certain kinds like lead or mercury that can lead to poisoning. The U.S. Food and Drug Administration has approved the use of chelation therapy with EDTA for treating lead poisoning and continues to investigate its potential and safety as a new drug for reducing coronary heart disease symptoms. (1)\n\nWhat is EDTA? EDTA is a type of man-made synthetic amino acid. As an alternative, some practictioners also use another substance in EDTA’s place called DMPS (2,3-Dimercapto-1-propanesulfonic acid), which works similarly. EDTA chelation therapy works by binding salts to molecules in the blood once EDTA is administered into someone’s veins. After EDTA attaches to heavy metals, together they both move to the kidneys where their elimination from the body occurs through urine.\n\nIt’s possible that “chelating agents” like EDTA and DMPS can help detoxify the body of toxic elements that contribute to many types of chronic diseases. Chelating agents have specific bonds that form between organic molecules and metals. This gives them the ability to “bind” to metals that build up in the blood, major organs and blood vessels.\n\nSome chelating agents, including peptides like glutathione and metallothionein, have been well-researched and proven to transport and excrete toxins from the body, all without the need for expensive surgeries and risky medications.\n\nOne of the biggest chelation therapy benefits is its ability to help control levels of various environmental metals in the body. Metals, including lead, mercury, aluminum and arsenic, can cause short- and long-term health consequences since they impact functions of the central nervous, cardiovascular, immune and skeletal systems. When the body is out of homeostasis due to experiencing imbalances in minerals, malfunction and damage to vital organs can develop.\n\nSome of the most symptoms of heavy metal toxicity include:\n\nAlthough ongoing research is still underway, some alternative health care providers use chelation therapy to help treat coronary heart diseases, including atherosclerosis (thickening and hardening of the arteries that can potentially lead to a heart attack or stroke).\n\nWhy do some provides use chelation therapy for heart disease? EDTA binds with calcium within the arteries, helping to reduce plaque build-up and deposits that can cut off blood flow. (2) Once bound to calcium, EDTA can help carry the molecules out of arteries so circulation improves. In a similar way, EDTA might help control high inflammation and cholesterol levels, which also pose a risk for heart disease. In the future, we might see chelation therapy used a less risky and more affordable alternative to heart surgery and complicated mediations that have many side effects.\n\nEDTA might act similarly to antioxidants by reducing inflammation, fighting free radical damage and removing metals that cause the foundation of chronic disease development. It’s been suggested that EDTA binds to not only calcium within arteries, but also other metals stored within bones, muscles and bodily tissues that can lead to increased inflammation or pain.\n\nThe use of certain chelating agents has been shown to successfully lower the presence of plutonium radiation toxicity within the body, which is tied to increased cancer risk. (3) Uranium and radionuclide are two types of chemicals that can cause toxicity, leukemia and osteosarcoma when someone experiences long-term radiation exposure, but chelating agents, including DTPA, are able to help remove these before serious illnesses can form.\n\nSince chelation therapy targets inflammation, the root of most diseases, including arthritis and many autoimmune disorders, many people report less pain from inflamed muscles, joints and bones when using EDTA.\n\nAlthough this theory hasn’t yet been proven in controlled scientific studies, chelation therapy might work by helping to reduce the effects of oxygen ions (also called oxidative stress) that can damage blood vessels and tissue. When inflammation causes the walls of vessels to become clogged, circulation decreases and pain grows. Chelation therapy may offer an alternative to ongoing medication treatments for chronic pain.\n\nThere’s evidence that chelation therapy can successfully treat cognitive disorders, including Alzheimer’s disease, multiple sclerosis and Parkinson’s disease. While the exact mechanisms in which EDTA helps resolve these problems isn’t yet clear or proven in studies, there seems to be a tie between heavy metal poisoning (or toxicity), including high levels of lead or mercury in the blood, and medical disorders that affect the brain, memory and learning.\n\nResearch also shows that increased accumulation in the brain of copper, iron and zinc might be associated with a number of neurodegenerative diseases. Long-term heavy metal exposure can lead to physical, muscular and neurological degenerative changes in the brain that set the stage for not only Alzheimer’s disease, but also dementia, Parkinson’s disease and multiple sclerosis. (4)\n\nSadly, rates of learning disabilities, ADHD symptoms and autism spectrum disorders have been on the rise in recent years, yet how exactly these conditions should be treated or prevented remains controversial in the medical community. Many practitioners are now looking to alternative treatment methods to control symptoms of cognitive disorders, including some like chelation therapy that target heavy metal poisoning.\n\nWhile not technically authorized to be used for treating such conditions, “off-label use” of chelation therapy might be beneficial for cognitive health due to its ability to lower circulating or stored toxic metals that interfere with brain function. (5) Going forward, we should expect to see new proven strategies using chelating agents that are capable of crossing the blood-brain barrier and bringing back homeostasis of minerals levels.\n\nChelation therapy sessions take several hours to complete and usually take place in a doctor’s office under special monitoring. Most patients need between five to 30 treatments for best results. Each treatment session involves insertion of an intravenous (IV) to administer liquid EDTA, usually into a vein located in the hand or arm.\n\nThe procedure isn’t painful for most people, but like with all injections, it’s possible to feel some burning, redness or swelling at the injection site. There isn’t much recovery time needed after the procedure and most patients are free to drive themselves home and go about their normal day. Some people report needing to urinate more than usual following chelation therapy, which can be beneficial considering this is how heavy metals leave the body.\n\nHow can you locate a health care provider with appropriate training to perform chelation therapy? Currently the American Board of Clinical Metal Toxicology (ABCMT) is responsible for training and qualifying chelation therapy practitioners. ABCMT has actually been certifying doctors in chelation therapy for over 24 years! The American College for Advancement in Medicine is another organization that offers educational training. Both hold seminars and administer examinations in order for doctors to become board-certified and approved to work with patients.\n\nCan you feel safe with a chelation therapy doctor? Most likely, yes! Chelation therapy doctors must be either D.O. or M.D. and have a license to practice in their states, complete a comprehensive course on the diagnosis and treatment of chelation therapy, obtain letters of recommendation, and conduct at least 2,000 intravenous treatments for metal toxicity as part of a preceptorship with a certified physician.\n\nYou can find out more about the qualifications and seek out a trained practitioner on the American Board of Clinical Medicine Toxicology website.\n\nIs chelation therapy covered by insurance? One thing to consider is that currently most insurance companies do not cover chelation therapy. As governing health authorities continue to undergo investigations into its safety and efficacy, it’s only practiced by limited alternative practitioners, which means your regular doctor might not yet offer chelation therapy or be convinced of its benefits.\n\nHow much does it cost for chelation therapy? Depending on how many treatments your practitioner recommends, chelation therapy cost for an entire course of treatment will vary by patient. Treatments typically cost between $75 and $125.\n\nYou should only receive Chelation therapy with EDTA from a properly licensed professional due to the potential for side effects to develop in some cases. What are the side effects of chelation therapy? The most common side effect is a burning sensation at the site where EDTA is enters the vein, but this usually goes away quickly and is mild. Rare chelation therapy side effects can include headache, fever, nausea, and vomiting. (6)\n\nIt’s very important for EDTA to be infused properly and slowly, since high levels can cause electrolyte imbalances. It’s also possible that while it removes harmful heavy metals, EDTA can potentially also bind to needed vitamins and minerals and remove them from the body, which poses the risk for deficiencies. To make up for this, many practitioners give patients large doses of vitamins/minerals following chelation therapy so they avoid becoming very deficient.\n\nAlthough it’s very rare, kidney damage and heart failure can also occur due to blood pressure levels dropping suddenly and abnormally low calcium levels in the blood (hypocalcemia). At this time, children, pregnant women, and anyone who has a history of heart disease or kidney problems should not use chelation therapy without consulting with a doctor first. (7)\n\nRelated: Brain Detox: Is It Time for a Cleanse? (Plus How to Do It)\n\nIf you’re experiencing symptoms of heavy metal toxicity, chelation therapy along with a reduction in common toxins may be able to help you. How can you lower your exposure to heavy metals in the first place? Start by adjusting your diet, and then consider taking supplements that can also help.\n\nLower heavy metals in your diet by limiting or avoiding these foods:\n• None Farmed fish, which can contain mercury or other heavy metals, dioxins and PCBs found in aluminum cans\n• Common and allergens like gluten and conventional dairy (when your immune system is working on fighting allergens, it has less energy available to detoxify the body)\n• Packages/processed foods that contain many synthetic ingredients and additives\n• Alcohol, which makes it harder for your liver to process other toxins\n\nWant to practice some chelation therapy at home? Try incorporating these detoxifying foods into your diet regularly:\n• Garlic contains sulfur which helps your liver detoxify itself of heavy metals like lead and arsenic. Research using an animal model has also shown that garlic can protect against heavy metal poisoning and also reduce the accumulation of heavy metals in the liver, kidneys and bone. (8)\n• Cilantro is tasty herb is a great addition to so many recipes including fresh juices and it’s well-known for its ability to act as a natural chelation agent. (9)\n• Brazil nuts are by far one of the best food sources of selenium, an important chelator that research shows can help the body rid itself of heavy metals, especially mercury. (10)\n\nYou can engage in some natural chelation therapy with the help of well-chosen supplements. These are some options that can help lower the presence of heavy metals naturally:\n• Vitamin C (3,000 milligrams daily during detoxification) — an antioxidant that helps reduce free radicals\n• Chelation therapy is an alternative medicine that has the purpose of removing “heavy metals” and toxins from the body.\n• Sources of heavy metal poisoning can include farm-raised fish, amalgam fillings (that contain mercury) and vaccinations.\n• The U.S. Food and Drug Administration has approved the use of chelation therapy with EDTA for treating lead poisoning and continues to investigate its potential and safety as a new drug for reducing coronary heart disease symptoms.\n• The procedure typically isn’t painful and side effects are rare, but you may feel a mild burning sensation briefly at the injection location.\n• You should only receive chelation therapy from a trained and qualified chelation therapy practitioner.", "opengraph": {"locale": "en_US", "type": "article", "title": "Chelation Therapy for Heavy Metal Toxicity and More - Dr. Axe", "description": "While more research is still needed, chelation therapy offers many health benefits, particularly for removing toxic heavy metals from the body.", "url": "https://draxe.com/health/chelation-therapy/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2020-12-09T14:26:57+00:00", "image": "https://draxe.com/wp-content/uploads/2015/09/ChelationFBMeme.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#How_Chelation_Therapy_Works", "#5_Benefits_of_Chelation_Therapy", "#How_Chelation_Therapy_Is_Performed", "#Side_Effects_of_Chelation_Therapy", "#Other_Ways_to_Lower_Heavy_Metal_Toxicity", "https://draxe.com/health/dangers-of-amalgam-fillings/", "https://draxe.com/nutrition/tilapia/", "https://draxe.com/health/organic-farming/", "https://draxe.com/health/heavy-metal-detox/", "https://draxe.com/nutrition/arsenic-in-rice/", "https://nccih.nih.gov/health/chelation/TACT-questions", "https://draxe.com/nutrition/glutathione/", "https://draxe.com/health/chronic-fatigue-syndrome/", "https://draxe.com/health/7-signs-symptoms-you-have-leaky-gut/", "https://draxe.com/health/natural-remedies-for-bone-and-joint-pain/", "https://draxe.com/health/coronary-heart-disease/", "https://www.webmd.com/balance/guide/what-is-chelation-therapy#2", "https://draxe.com/health/lower-cholesterol-naturally-fast/", "https://draxe.com/nutrition/top-10-high-antioxidant-foods/", "https://draxe.com/health/fighting-free-radical-damage/", "https://www.ncbi.nlm.nih.gov/pubmed/16305471", "https://draxe.com/health/inflammation-at-the-root-of-most-diseases/", "https://draxe.com/health/effective-all-natural-treatments-for-arthritis/", "https://draxe.com/health/alzheimers-natural-treatment/", "https://www.ncbi.nlm.nih.gov/pubmed/22489724", "https://draxe.com/health/symptoms-of-adhd/", "https://draxe.com/health/signs-of-autism-what-you-cant-afford-to-miss/", "https://www.ncbi.nlm.nih.gov/pubmed/26114777", "https://draxe.com/nutrition/aconite/", "http://abcmt.org", "http://www.acam.org", "http://abcmt.org/", "https://nccih.nih.gov/health/chelation/TACT-questions", "https://draxe.com/health/electrolyte-imbalance/", "https://www.mayoclinic.org/diseases-conditions/heart-disease/expert-answers/chelation-therapy/faq-20157449", "https://draxe.com/health/brain-detox/", "https://draxe.com/nutrition/fish-you-should-never-eat/", "https://draxe.com/health/food-allergies-treatments-natural-remedies/", "https://draxe.com/nutrition/the-real-risks-of-gmo-foods-how-to-avoid/", "https://www.ncbi.nlm.nih.gov/pubmed/3268178", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3654245/", "https://www.ncbi.nlm.nih.gov/pubmed/25947386", "https://draxe.com/nutrition/7-proven-chlorella-benefits-side-effects/", "https://draxe.com/nutrition/milk-thistle-benefits/", "https://draxe.com/nutrition/liver-cleanse/", "https://draxe.com/nutrition/probiotics-benefits-foods-supplements/"], "authors": [], "publish_date": null}