{"result_id": "100028", "URL": "https://draxe.com/health/hepatitis-b/", "timestamp": "2023-04-25 15:00:18 CEST+0200", "meta": {"description": "Hepatitis B is a potentially life-threatening viral infection that affects the liver. Learn about prevention and 6 natural treatments to manage symptoms.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/hepatitis-b/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "6 Ways to Nurture Your Liver After a Hepatitis B Diagnosis", "cleaned_text": "It is estimated that over 300 million people are living with hepatitis B. In 2015, it resulted in 887,000 deaths worldwide. Although many people with hepatitis B don’t experience any symptoms, it’s a chronic infection that can lead to severe liver conditions like cirrhosis and liver cancer. The scary part is that it is 50–100 times more infectious than HIV. An even scarier note: coinfection with hepatitis B and HIV is common. Seventy to 90 percent of people with HIV in the U.S. show evidence of past or active HBV infections. (1a, 2a) HBV is also more infectious than hepatitis C. Both hepatitis B and C are transmitted through infected blood, but hepatitis A is transmitted through infected fecal matter. The virus can live outside of the body for many days and infect you unknowingly. That’s why people at risk of acquiring hepatitis B should be screened. That way those infected can limit the spread of the virus. (1b, 2b)\n\nThere is no cure for hepatitis B, but there are natural ways to support your immune system and reduce your risk of developing a chronic infection. There are also remedies for relieving the symptoms of acute hepatitis B, which for some people can last for months.\n\nHepatitis B (also known as HBV or hep B) is a potentially life-threatening viral infection that affects the liver. The name comes from the Greek word hêpar, meaning “liver” (the same can be said for “Hepatology,” the study of the liver, gallbladder, biliary tree and pancreas) and –itis, which means “inflammation” in Greek. The infection can lead to acute or chronic liver disease, or even death. Approximately 1,800 people die every year from hepatitis B-related liver disease. The hepatitis B virus is a member of the Hepadnaviridae family. It’s a small DNA virus that has unusual features, similar to retroviruses like HIV. The virus is able to persist in infected cells, allowing it to replicate and cause a chronic condition.\n\nThe danger of hepatitis B is that an acute infection can become chronic and lead to a wide spectrum of liver disease, including cirrhosis and liver cancer (hepatocellular carcinoma).\n\nMost people (about two-thirds) with acute hepatitis B experience no symptoms. But some, especially adults and children over the age of 5, develop symptoms that can last for several weeks. Approximately one-third of adults with acute HBV will experience symptoms. They usually develop two to five months after exposure to the virus. The most common symptoms of acute hepatitis B include: (3)\n• Stomach pain (especially the upper right quadrant)\n\nSymptoms of hepatitis B usually last a few weeks. But people can experience symptoms for as long as six months. People with chronic hepatitis B are unable to clear the virus. They may experience ongoing symptoms or live symptom-free for many years. The likelihood of the infection becoming a chronic condition depends on the age at which a person is infected. Children infected with the virus before the age of six are more likely to develop chronic hepatitis B. Research shows that 80 percent to 90 percent of infants infected with hepatitis B during their first year of life will go on to develop chronic infections. And 30 percent to 50 percent of children infected before the age of 6 will develop chronic hepatitis B. This is compared to less than 5 percent of otherwise healthy adults who develop a chronic infection. (5, 6)\n\nAmong those who do have chronic hepatitis B, 15 percent to 30 percent develop serious liver conditions, like liver cancer or cirrhosis. The type of liver cancer hepatitis B causes is hepatocellular carcinoma. Unlike other types of liver cancers that start in another organ of the body and spread to the liver, this type of cancer starts in the liver. It’s usually caused by long-term liver damage.\n\nCirrhosis is a serious disease that occurs when scar tissue develops in the liver. This scarring becomes so severe that the liver no longer functions properly. This impacts some of the body’s most essential processes, like blood flow, the elimination of toxins and waste, and the digestion of essential nutrients. According to research conducted at the National Institute of Diabetes and Digestive and Kidney Diseases, for those with severe chronic hepatitis and cirrhosis, the five year survival rate is about 50 percent. (7)\n\nHepatitis B is caused by a viral infection. The virus can survive outside of the body for at least seven days. During this time, it can infect a person if it enters his or her body. It can be detected within 30 to 60 days after infection. It can persist and develop into chronic hepatitis B, especially if someone is infected at a young age.\n\nIt can be transmitted or spread in several ways, including (8):\n• Perinatal transmission: One of the most common ways that it spreads in endemic areas is by transmission from mother to child at birth.\n• Exposure to infected blood: Another common cause of hepatitis B is exposure to infected blood. Transmission from an infected child to an uninfected child during the first 5 years of life is especially common. Some scenarios that put a person at risk of transmitting the virus through exposure to blood include sharing razors, toothbrushes or any sharp instruments with an infected person. If infected blood comes into contact with open sores of an uninfected person, this can spread hepatitis B.\n• Sexual transmission: Sexual transmission of hepatitis B occurs when the body fluids, such as semen or vaginal secretions, of an infected person enter the body of an uninfected person. According to the Centers for Disease Control and Prevention (CDC), in the United States, hepatitis B most commonly spreads through sexual transmission, which accounts for nearly two-thirds of all acute hepatitis B cases. People with multiple sex partners or men who have sex with men are the most at risk of transmitting hepatitis B through sexual exposure. ( )\n• Needle sharing: The reuse of needles and syringes can transmit hepatitis B. This can happen in a health care setting or among people who inject drugs. It can also spread through instruments contaminated with blood used in tattooing or medical procedures.\n\nAnyone can get this virus. But some people are at a greater risk of exposure to the virus. This includes people who:\n• Live with or have close contact with a person with chronic hepatitis B\n• Are exposed to blood at work (such as health care workers)\n\nBecause the symptoms of hepatitis B are similar to those of other viral infections, an accurate diagnosis should be made with a blood test that detects the hepatitis B surface antigen HBsAg. If the presence of HBsAg persists for at least six months (meaning the antibodies were not able to destroy the antigen in the body), this serves as a principal marker of risk for developing liver disease later in life. During the initial phase of the infection, patients will test positive for HBeAg, an antigen that indicates that the blood and body fluids of the infected person are highly infectious.\n\nThere is no specific treatment for acute hepatitis B. But for people with chronic hepatitis B, antiviral agents are usually prescribed to slow the progression of liver disease and reduce the incidence of liver cancer. Some of the most common medications used by patients with chronic hepatitis B are tenofovir and entecavir, which are used to suppress the virus. These drugs don’t cure most people. But they do help by suppressing the replication of the hepatitis B virus and therefore reduce the risk of developing life-threatening liver conditions. Many people with chronic hepatitis B have to stay on these medications for the rest of their lives. Doctors commonly prescribe pegylated interferon to help treat hepatitis C but rarely HBV.\n\nAccording to the World Health Organization (WHO), a vaccine can be used to prevent the possibility of infection with the hepatitis B virus. WHO recommends that “all infants receive the hepatitis B vaccine as soon as possible after birth, preferably within 24 hours … The birth dose should be followed by 2 or 3 doses to complete the primary series.” WHO also indicates that the low incidence of chronic hepatitis B cases in children under the age of 5 is due to the widespread use of hepatitis B vaccine. And the vaccine is 95 percent effective in preventing infection and the development of chronic liver conditions due to the infection. The CDC reports that since 1991, the rates of acute hepatitis B in the U.S. have declined by approximately 82 percent. The vaccine lasts for 20 years. It’s probably lifelong, so you don’t need a booster vaccination. (10, 11)\n\nIt’s important to note that yeast is used when making the hepatitis B vaccine. So anyone allergic to yeast should not receive it. The vaccine also isn’t recommended for people who have had serious allergic reactions to a prior dose of the vaccine.\n\nTo protect infants from getting hepatitis B from his or her infected mother, the CDC recommends that the infant receive a shot called Hepatitis B immune globulin (HBIG) and the first dose of the hepatitis B vaccine within 12 hours of birth. Then the infant should receive two to three additional shots to finish the series within six months. Precautions should be taken with infants of infected mothers because they have a 90 percent chance of developing chronic hepatitis B if the infection isn’t treated properly. (12)\n\nOne of the most important ways for a person with hepatitis B to live a longer, healthier life is to focus on maintaining an adequate nutritional balance with a whole foods and anti-inflammatory diet. Eating foods that contain chlorophyll can also be beneficial for reducing oxidative stress and liver damage. Some of the most beneficial, detoxifying, liver-cleansing and cancer-fighting foods include (13, 14):\n• Cruciferous vegetables, such as broccoli, cabbage, cauliflower and Brussels sprouts\n• Nuts and seeds, especially walnuts, flaxseeds and chia seeds\n• Unrefined oils, such as healthy coconut oil and extra virgin olive oil\n\nSome common symptoms of acute HBV are nausea and vomiting. It may be helpful to eat a more substantial breakfast. Then keep your lunch and dinner on the lighter side if you experience an upset stomach. You can also add 1–2 drops of peppermint oil to a glass of water to help get rid of nausea naturally. To be sure that you’re getting adequate nutrients and fluids, try fruit and vegetable juices or smoothies instead of heavier meals. This will be easier for you to digest and using immune-boosting ingredients will help you to recover.\n\nTo help prevent the spread of the virus and ease the symptoms of an acute infection, avoid consuming foods and drinks that increase inflammation. This includes sugar, refined oils, refined carbohydrates, conventional dairy products and farm-raised meats. Try not to eat processed foods that typically contain refined ingredients and additives. It’s also very important to avoid drinking alcohol or using over-the-counter drugs, especially acetaminophen. They can worsen liver damage, which is a concern for people with HBV. (15)\n\nVomiting is a common symptom of hepatitis B, which can cause dehydration. You need to make sure you’re drinking enough fluids throughout the day so that you don’t become dehydrated. Drink plenty of water. Have at least an 8-ounce glass with every meal and water between meals, too. Drinking fresh fruit and veggie juices can be helpful. So can consuming bone broth, which is full of essential nutrients that will boost your immune system and help you to fight the virus. Instead of turning to sports drinks that are full of sugar and artificial flavors, drink coconut water, which will help you to avoid an electrolyte imbalance.\n\nTo help relieve symptoms and prevent the spread of the virus, you have to reduce stress levels and take it easy. Don’t engage in strenuous activities, especially if you are feeling tired and low energy. Allow your body to rest. Try some natural stress relievers, like taking a short walk outside, doing some gentle yoga. Take a warm bath or read an uplifting book. Another easy way to reduce stress and bring on feelings of peace is to diffuse lavender essential oil at home or work. If you don’t have a diffuser, just tub 1–2 drops of lavender oil into your temples or inhale it directly from the bottle.\n\nMilk thistle benefits and supports the liver. It’s a powerful detoxifier. It helps rebuild liver cells while removing bodily toxins that are processed through the liver. The silymarin found in milk thistle acts as an antioxidant by reducing free radical production and oxidative stress. It even acts as a toxin blockade agent that inhibits the binding of toxins in liver cells. Research on milk thistle shows it can be used to treat acute and chronic viral hepatitis and liver disease. (16)\n\nScientific research shows there’s a direct correlation between glutathione levels and viral activity for both hepatitis B and C. Glutathione is a peptide that consists of three amino acids, L-cysteine, L-glutamic acid and glycine. It is known as the “mother of all antioxidants” because it supports vital body functions, including liver detoxification. The liver uses glutathione to break down toxins. This is why glutathione levels decrease when the viral load increases. If you have chronic hepatitis B for more than 90 days, ask your healthcare provider to check your glutathione levels. If they are low, you can take L-cysteine (NAC), a-Lipoic acid and L-glutamine to help restore your glutathione levels. (17)\n\nIf you have chronic hepatitis B and symptoms of acute or chronic liver disease, do not use herbal supplements without consulting with your healthcare provider or nutritionist first. These supplements must pass through the liver. They can cause more damage if you don’t take them correctly. Always alter your diet and lifestyle first. Make sure to eat whole foods that will help to reduce inflammation and support your liver. If you drink alcohol or do drugs, quit immediately — that should be your first line of defense.\n• None Over 300 million people are living with HBV.\n• None It is a potentially life-threatening viral infection that affects the liver.\n• None The danger of this condition is that an acute infection can become chronic and lead to a wide spectrum of liver disease, including cirrhosis and liver cancer.\n• Most people don’t experience any symptoms. But some may notice nausea, vomiting, extreme fatigue, stomach pain, loss of appetite, jaundice, dark urine, muscle soreness and light-colored stools.\n• It spreads through blood or body fluids, including semen and vaginal fluids. It can also pass from an infected mother to her infant during childbirth.\n• The World Health Organization and Centers for Disease Control and Prevention recommend that every infant receive the hepatitis B vaccination.\n• Some of the best at-home remedies to relieve the symptoms of hepatitis B are eating a healthy and well-balanced diet; staying hydrated; staying away from alcohol and other substances that are hard on the liver; reducing stress; boosting glutathione levels and trying milk thistle to detoxify the liver.", "opengraph": {"locale": "en_US", "type": "article", "title": "6 Ways to Nurture Your Liver After a Hepatitis B Diagnosis", "description": "Here are the top 10 liver-friendly foods to work into your diet.", "url": "https://draxe.com/health/hepatitis-b/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2020-12-11T02:18:40+00:00", "image": "https://draxe.com/wp-content/uploads/2017/07/Hepatitis-B-FB-Meme.png", "image:width": "660", "image:height": "347", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Hepatitis_B", "#Hepatitis_B_Signs_and_Symptoms", "#Causes_and_Risk_Factors", "#Conventional_Treatment", "#6_Natural_Treatments_to_Manage_Hepatitis_B_Symptoms", "#Precautions", "https://draxe.com/health/cirrhosis/", "http://hivinsite.ucsf.edu/InSite?page=kb-05-03-04", "http://hivinsite.ucsf.edu/InSite-KB-ref.jsp?page=kb-05-03-04&rf=2", "https://draxe.com/health/hepatitis-c-symptoms/", "https://draxe.com/health/hepatitis-a/", "http://www.who.int/mediacentre/factsheets/fs204/en/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4635410/", "https://draxe.com/health/liver-disease/", "http://www.webmd.com/cancer/hepatocellular-carcinoma#1", "https://www.cdc.gov/hepatitis/hbv/bfaq.htm", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://draxe.com/health/loss-of-appetite/", "https://draxe.com/health/jaundice/", "http://www.who.int/mediacentre/factsheets/fs204/en/", "https://www.ncbi.nlm.nih.gov/pubmed/19399811", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2809016/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4635410/", "https://www.cdc.gov/hepatitis/hbv/bfaq.htm", "https://www.drugs.com/mtm/tenofovir.html", "https://medlineplus.gov/druginfo/meds/a605028.html", "http://www.who.int/mediacentre/factsheets/fs204/en/", "https://www.ncbi.nlm.nih.gov/pubmed/22114089", "https://www.cdc.gov/hepatitis/hbv/bfaq.htm", "https://draxe.com/nutrition/anti-inflammatory-foods/", "https://draxe.com/nutrition/chlorophyll-benefits/", "https://draxe.com/nutrition/cancer-fighting-foods/", "https://www.ncbi.nlm.nih.gov/pubmed/25190687", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4499388/", "https://draxe.com/essential-oils/peppermint-oil-uses-benefits/", "https://draxe.com/health/how-to-get-rid-of-nausea/", "https://draxe.com/health/acetaminophen-overdose/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3860520/", "https://draxe.com/nutrition/is-coconut-water-good-for-you/", "https://draxe.com/health/electrolyte-imbalance/", "https://draxe.com/health/stress-relievers/", "https://draxe.com/essential-oils/lavender-oil-benefits/", "https://draxe.com/nutrition/milk-thistle-benefits/", "https://www.ncbi.nlm.nih.gov/pubmed/20564545", "https://draxe.com/nutrition/glutathione/", "https://draxe.com/nutrition/l-cysteine/", "https://draxe.com/nutrition/l-glutamine-benefits-side-effects-dosage/", "https://www.ncbi.nlm.nih.gov/pubmed/11366543"], "authors": [], "publish_date": null}