{"result_id": "100035", "URL": "https://draxe.com/health/celiac-disease-treatment/", "timestamp": "2023-04-25 15:00:24 CEST+0200", "meta": {"description": "Celiac disease treatment options may span beyond just eating 'gluten-free' foods. Check out the \"gross\" breakthroughs that could lead to a cure one day.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/celiac-disease-treatment/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Will Worms Really Cure Celiac Disease?", "cleaned_text": "Because the phrase “gluten-free” has become ubiquitous on food menus and even trendy in some circles, it’s easy to forget that it’s not just a food buzzword or the new “it” ingredient (hi, kale and smashed avocado). For those people living with celiac disease symptoms, gluten-free is really the only way to survive. But recent breakthroughs mean we could be on the cusp of some new celiac disease treatment options. And some of these interventions might, uh, seem a little gross at first glance.\n\nSo what’s the deal with gluten and celiac disease anyway? The autoimmune disorder stems from an allergy to gluten and how the body reacts to it. This protein is found in wheat, barley and rye grains — in other words, in everything from breads and flours to beers and pasta. Some people can handle gluten with no issues. But when folks with celiac disease eat these grains, their immune systems initiate an attack to rid the body of gluten. (1)\n\nThe attacks are launched on the small intestine and, in the process, damage villi, the parts of the organ that help the body absorb nutrients. Unfortunately, because this battle against gluten is often waged unknowingly, a person can experience celiac disease symptoms without even realizing it, including cramping and abdominal pain, weight fluctuations, bloated stomach, diarrhea or constipation, chronic headaches, and chronic fatigue.\n\nSince there is no real “test” to determine whether someone has celiac disease and the symptoms are shared among a variety of other disorders, the road to discovering that someone suffers from celiac disease can be long and frustrating.\n\nDoctors often misdiagnose the disease, and people learn to deal with the harsh symptoms without realizing that they can actually feel better. And even once gluten is the suspected culprit, an elimination diet is normally required to rule out other issues.\n\nFollowing a strict gluten-free diet has been the most effective way for those with celiac disease to combat the disorder, but it’s quite difficult to maintain, especially when eating out. That is, until a recent study published in the American Journal of Physiology-Gastrointestinal and Liver Physiology was published. (2)\n\nThe study’s goal was to target the compounds in gluten that kick the immune system into overdrive by identifying enzymes that can break down the proteins found in gluten before reaching the small intestines, where it wreaks havoc on the body.\n\nThe Boston University-based research team found that a certain type of bacteria normally found in the mouth, Rothia bacteria, actually breaks down the gluten compounds that trigger an immune response. From this bacteria, the research team was able to isolate an entirely new class of enzymes that can degrade gluten before reaching the small intestine.\n\nInterestingly enough, these enzymes are in the same class as Bacillus enzymes, or B. subtilisis, which is found in natto. I’m a big fan of the fermented Japanese soy superfood already, but it appears this food might have wider ramifications than science originally expected. Natto has been around for centuries and has few adverse effects. While this was just one study, it opens up new opportunities for researchers to go down as they explore other ways of treating celiac disease and gluten intolerance symptoms.\n\nThis new development in celiac disease treatment options involves utilizing bacteria to our advantage and is definitely exciting. But there are a two other unconventional treatments being explored, too.\n\nIt seems wriggly creatures that often gross us out might actually be able to temper celiac symptoms, too. In helminthic therapy, patients are deliberately infected with parasitic worms. (Not the kind that will give you tapeworm symptoms, but rather another species used in a more beneficial way.) And unlike treatments from the 19th century, where leeches were let loose on people to help stop bleeding, it seems these parasites might actually work. (3)\n\nThe small trial, which ran the course of a year, involved 12 patients infected with hookworms. While four of the patients withdrew from the study before the end of the year, the remaining eight participants all showed significant — and ongoing — benefits from the hookworms. (4)\n\nAs patients ate foods with gradually increasing doses of gluten, each of them enjoyed the meals without ill effects. In fact, at the end of the study, the eight patients were given the option of taking drugs to eliminate the hookworms — all eight of them chose to keep the parasites instead. The researchers believe that a protein found in the hookworms is able to moderate the human immune response, leading to fewer symptoms in the presence of gluten.\n\nAnd just like we are given vaccines for things like hepatitis and chickenpox, a vaccine for celiac disease is in the works. (5) The vaccine’s aim is to desensitize patients to the gluten-containing compounds that spark a negative immune reaction. The vaccine is still in the second phase of trials ‚ and I always recommend natural options first — but the research is ongoing.\n\nThe first phase involved 150 Australian patients but focused on establishing a tolerable gluten dosage, as opposed to completing conquering celiac disease. The second round of studies tests the idea that the vaccine will be more effective when administered over a longer dosing schedule. (6)\n\nWhile bacteria, worms and vaccines might not be the right solution for everyone to help control and maybe even eliminate celiac disease, having more options available for patients means that people can make informed, thoughtful decisions about what works best with their lifestyles and health.\n\nThe No. 1 Pumpkin Spiced Latte Ingredient to Avoid This Fall", "opengraph": {"locale": "en_US", "type": "article", "title": "Will Worms Really Cure Celiac Disease?", "description": "See how unconventional celiac disease treatment methods could be the future of treating this digestive disease.", "url": "https://draxe.com/health/celiac-disease-treatment/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2021-10-06T15:00:59+00:00", "image": "https://draxe.com/wp-content/uploads/2016/09/CeliacBT-FBMeme-01.png", "image:width": "756", "image:height": "397", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#Current_Celiac_Disease_Treatment_A_Gluten-Free_Lifestyle", "#Celiac_Disease_Treatment_Breakthroughs", "https://draxe.com/health/celiac-disease-symptoms/", "https://draxe.com/health/gluten-intolerance-symptoms/", "https://celiac.org/celiac-disease/understanding-celiac-disease-2/what-is-celiac-disease/", "https://draxe.com/health/bloated-stomach/", "https://draxe.com/nutrition/elimination-diet/", "https://ancientnutrition.com/collections/supergreens?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensship_v2", "http://ajpgi.physiology.org/content/early/2016/07/25/ajpgi.00185.2016", "https://draxe.com/nutrition/natto/", "https://draxe.com/health/gluten-intolerance-symptoms/", "https://draxe.com/health/tapeworm-symptoms/", "http://www.jacionline.org/article/S0091-6749%2814%2901010-0/abstract", "https://www.cdc.gov/parasites/hookworm/", "http://www.medicaldaily.com/hookworms-may-reduce-celiac-disease-patients-gluten-intolerance-symptoms-305236", "http://www.heraldsun.com.au/news/victoria/victorians-to-be-among-first-to-benefit-from-coeliac-disease-vaccine/news-story/5413d563cdd46bdc6fb7cf003eeb37f7", "http://www.businesswire.com/news/home/20160524006174/en/ImmusanT-Reports-Nexvax2-Phase-1-Data-Patients", "https://draxe.com/nutrition/pumpkin-spiced-latte-ingredient/"], "authors": [], "publish_date": null}