{"result_id": "100015", "URL": "https://draxe.com/health/immunotherapy/", "timestamp": "2023-04-25 15:00:05 CEST+0200", "meta": {"description": "Immunotherapy is a way of stimulating the immune system, using either natural substances or man-made ones, to restore or improve immunity.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/immunotherapy/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Can Immunotherapy Beat Cancer?", "cleaned_text": "It’s hard to find anyone who hasn’t been affected by cancer in some way. In 2016 alone, nearly 1.7 million new instances of cancer will be diagnosed in the U.S. alone. Another 595,690 people will die from the disease. (1)\n\nSo it’s no surprise that when it comes to cancer, researchers, patients and families alike are desperate for a cure or, at the very least, a way to turn cancer into an ongoing but manageable disease with effective natural cancer treatments, similar to diabetes.\n\nOne treatment that’s been gaining traction in the medical community in the last few years is immunotherapy. So is this the way to fight cancer going forward, or is it still a pipe dream? Given new and severe cases of side effects and research like the 2015 paper in The New England Journal of Medicine that reported 54 percent of patients receiving a combination of immunotherapy drugs experienced grade 3 or 4 (severe or potentially life-threatening) side effects, the answer to this question still feels very far away.\n\nWhen the body detects cancer cells, unlike when you have a cold or a flu, often times it doesn’t fight back. Cancer has managed to disguise itself from the immune system, allowing the cells to grow, spread and thrive. It does this by displaying a particular protein called PD-1, or “programmed death.” When our T-cells, the ones that fight disease, come into contact with the PD-1 protein, they’re basically commanded to destruct.\n\nThough it might seem counterintuitive for our bodies’ defense mechanism to not be allowed to fight, it’s the PD-1 protein that actually protects the immune system from attacking itself, which is what occurs in diseases like lupus and Crohn’s. The cancer cells smarten up and realize that, by wearing the PD-1 mask, they can command the T-cells to hold fire and not attack while also multiplying.\n\nImmunotherapy is a way of stimulating the immune system, using either natural substances or man-made ones, to restore or improve immunity. This kick in the butt, in theory, gives the immune system the strength and power it needs to attack cancer cells.\n\nThe ultimate goal is that the individual’s own body will knock out cancer in a way that other treatments haven’t been able to do. But if the immune system is unable to destroy the cancer completely, slowing or stopping the growth of cancer cells and preventing them from metastasizing, or spreading to other parts of the body, can still make a huge difference in the life of a person with cancer. (2, 3)\n\nAlong with immunotherapy’s possible help in the fight against cancer, oral immunotherapy has been gaining attention for it’s potential ability to reduce food allergies.\n\nA 2017 study discovered that a prolonged and persistent combination of probiotic and peanut oral immunotherapy yielded an eventual suppression of allergic reactions to peanuts in participants. Participants from the immunotherapy group were significantly more likely than those from the placebo group to have continued eating peanuts (67 percent versus 4 percent). Over eight weeks, 58 percent of participants from the immunotherapy group remained unresponsiveness to peanuts, compared with 7 percent of participants from the placebo group. (4a)\n\nAnd a 2018 study published in The New England Journal of Medicine also found that oral immunotherapy in children and adolescents who are highly allergic to peanuts may lower symptom severity after peanut exposure. Patients received a peanut-derived immunotherapy drug in an escalating dose program for 24 weeks. By the end of the trial, 67 percent of participants in the immunotherapy group and only 4 percent in the placebo group were able to ingest a dose of 600 milligrams or more of peanut protein without displaying dose-limiting symptoms. Those using oral immunotherapy also experienced lower symptom severity during peanut exposure compared to those taking the placebo. (4b)\n\nAs research continues, immunotherapy’s ability to stimulate the immune system only proves more promising to help improve related immune conditions.\n\nThere are several types of immunotherapy, as the New York Times succinctly explains.\n\nThe most common one is when drugs known as checkpoint inhibitors are used. These prevent the PD-1 cells from tricking the immune system and allows the T-cells to attack cancer tumors. To date, there are four checkpoint inhibitors that have received the go-ahead from the Food and Drug Administration.\n\nIn this type of immunotherapy, a patient’s immune cells are removed from the body and genetically altered to help them fight cancer. They’re multiplied in the lab and then fed back into the person’s body, like a transfusion, unleashing them on the cancer. This type of immunotherapy must be created for each individual patient and are still in the experimental phase. (5)\n\nThese present an alternative to the super personalized cell therapy. Instead, these antibodies have the power to attach to both cancer and T-cells, getting the two enemies close enough to allow the T-cell to fight the cancer cell. Currently, there is one drug on the market, Blincyto, that’s been approved to treat a rare form of leukemia.\n\nCancer vaccines have been the least successful form of immunotherapy to date. (6) They’re not vaccines that prevent people from getting the disease, the way traditional vaccines are supposed to operate.\n\nInstead, these are injected in people who already have cancer, in hopes that injecting some of the cancer prompts the immune system to fight it. While there’s still a way to go in improving cancer vaccines, the idea is that perhaps when combined with the checkpoint inhibitors, the combo could make a formidable opponent against cancer cells.\n\nWhat Are the Limitations & Risks Involved with Immunotherapy?\n\nEven though there have been promising results for patients undergoing immunotherapy, this treatment is still at not at a stage to be widely used. The first reason is simply because it doesn’t always work – and no one knows why.\n\nOn some patients, the immunotherapy has proven to be successful, but those patients are in the minority. Currently, it seems to be most effective in treating melanoma and certain types of lymphoma or leukemia. One study found immunotherapy effective for more than 40 percent of advanced melanoma patients when using nivolumab and ipilimumab, two immunotherapy drugs, together. (7) In most people, however, immunotherapy has no effect on reducing the tumors.\n\nAnother major factor is the cost involved. Checkpoint inhibitors, for example, can cost $150,000 a year or more. Some health insurance providers will cover the cost — if the drug has been approved for the specific type of cancer. That means if a drug has been approved for melanoma, for instance, but a doctor thinks it could be effective for leukemia, an insurer has no obligation to pay, because the drug is being used off label.\n\nThe very real reality is that not everyone could afford to pay those types of prices. In other cases, because the drugs are so expensive, co-payments, even when the drugs are covered, are astronomically high. This brings up a moral dilemma — what happens when a particular drug is available for a person, but they can’t afford it? Will immunotherapy become a cancer treatment only for the wealthy?\n\nFinally, though immunotherapy harnesses a patient’s own immune system, this doesn’t mean that it’s any better for the body than traditional treatments like radiation or chemotherapy. In fact, before starting some immunotherapy, a round of chemo is required before starting treatment.\n\nImmunotherapy comes with its own strong brand of side effects – there is a reason, of course, why our bodies are designed to suppress immune reactions. As this piece in Scientific American explains, “The immune system has such powerful weapons in its arsenal that it can kill you faster than whatever ails you.” When not under control, the immune system can attack healthy, vital organs like the liver, lungs, kidneys, adrenal and pituitary glands, pancreas and, in the worst cases, the heart. (8)\n\nBecause immunotherapy is still in its relative infancy, much of the work being done is still in clinical trials. Unfortunately, patients have died as a result of side effects during these trials. While that risk is inherent in the trial of any medicine, it’s clear that these therapies have a long way to go before going mainstream.\n\nAmong the more powerful effects of checkpoint inhibitors, for example, are basically autoimmune diseases. Because the immune system is in overdrive, it can go beyond its target of cancer cells and attack healthy tissues and organs along with the cancer cells. Immunotherapy can cause inflammation as well as overstimulation of the immune system. (9) Other issues include nausea, fever, chills, lung inflammation, hepatitis and pancreatitis.\n\nA December 2016 article in the New York Times reported that doctors at Yale believe immunotherapy is triggering a type of acute-onset diabetes, and they have at least 17 cases so far to back up the hypothesis.\n\nFor many people, immunotherapy’s potential benefits are worth the risks. After all, the treatments are working for some people. It stands to reason that as the science and medicine behind it become more sophisticated and doctors are better able to isolate potential problems, that immunotherapy will become more effective, at least for certain cancers.\n\nUnfortunately, just like other cancer treatments, there’s no way currently to determine who will benefits the most from immunotherapy and who it might not work for at all. When it comes to cancer, it’s one more choice in a sea of unfortunate choices in mainstream medical America.\n\nRead Next: Thermography — Breast Cancer Detection and Better Risk Assessment", "opengraph": {"locale": "en_US", "type": "article", "title": "Can Immunotherapy Beat Cancer?", "description": "Immunotherapy is a way of stimulating the immune system, using either natural substances or man-made ones, to restore or improve immunity. In fact, there are 4 types that supposedly give the immune system the strength and power it needs to attack cancer cells. Does it work?! Let's see …", "url": "https://draxe.com/health/immunotherapy/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-02-11T19:53:09+00:00", "image": "https://draxe.com/wp-content/uploads/2016/08/Immunotherapy-FBNL-Meme-01.png", "image:width": "720", "image:height": "378", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Immunotherapy", "#How_Does_Immunotherapy_Work", "#What_Are_the_Limitations_Risks_Involved_with_Immunotherapy", "http://www.cancer.gov/about-cancer/understanding/statistics", "https://draxe.com/health/10-natural-cancer-treatments-hidden-cures//", "https://www.ncbi.nlm.nih.gov/pubmed/25891304", "https://ancientnutrition.com/collections/supergreens?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_greensship_v2", "https://draxe.com/health/how-to-boost-your-immune-system/", "http://www.cancer.org/treatment/treatmentsandsideeffects/treatmenttypes/immunotherapy/immunotherapy-what-is-immunotherapy", "http://www.cancer.net/navigating-cancer-care/how-cancer-treated/immunotherapy-and-vaccines/understanding-immunotherapy", "http://www.thelancet.com/journals/lanchi/article/PIIS2352-4642(17)30041-X/abstract", "https://www.nejm.org/doi/full/10.1056/NEJMoa1812856", "http://www.nytimes.com/2016/07/31/health/what-is-immunotherapy-cancer-treatment.html?action=click&contentCollection=Health&module=RelatedCoverage&region=EndOfArticle&pgtype=article&_r=0", "http://www.sciencedirect.com/science/article/pii/S2214647415000215", "http://www.ncbi.nlm.nih.gov/pubmed/10953341", "https://ancientnutrition.com/collections/popular-products?utm_source=draxe.com&utm_medium=ad&utm_campaign=2023_20offjan", "http://www.nejm.org/doi/full/10.1056/NEJMoa1302369#t=article", "http://www.scientificamerican.com/article/cancer-immunotherapy-the-cutting-edge-gets-sharper/", "http://www.nytimes.com/2016/12/03/health/immunotherapy-cancer.html?rref=collection%2Fsectioncollection%2Fhealth&action=click&contentCollection=health&region=rank&module=package&version=highlights&contentPlacement=1&pgtype=sectionfront", "http://finance.yahoo.com/news/car-t-kite-juno-novartis-000000573.html", "https://draxe.com/health/autoimmune-disease-symptoms/", "http://blog.dana-farber.org/insight/2016/02/what-are-the-side-effects-of-immunotherapy/", "http://www.nytimes.com/2016/12/03/health/immunotherapy-cancer.html?rref=collection%2Fsectioncollection%2Fhealth&action=click&contentCollection=health&region=rank&module=package&version=highlights&contentPlacement=1&pgtype=sectionfront&_r=0", "https://draxe.com/health/thermography/"], "authors": [], "publish_date": null}