{"result_id": "100004", "URL": "https://draxe.com/health/roseola/", "timestamp": "2023-04-25 14:59:57 CEST+0200", "meta": {"description": "Roseola, aka \"sixth disease,\" is a common and highly contagious childhood infection. Click here to learn more about how to soothe symptoms naturally.", "lang": "en", "keywords": "", "favicon": "https://draxe.com/wp-content/themes/mat_draxe/favicon.ico", "canonical": "https://draxe.com/health/roseola/", "encoding": "utf-8"}, "image": null, "domain": "draxe.com", "title": "Roseola: How to Soothe 'Sixth Disease' Symptoms", "cleaned_text": "Roseola is a viral illness that most commonly affects children between the ages of 6 months and 2 years old. It is extremely common, and most children will have been infected by the time they enter kindergarten. Some children will experience very mild symptoms, while others will host a wide range of symptoms, including a high fever, rash, decreased appetite, swollen eyelids and mild diarrhea. (1)\n\nRoseola is also known as ‘sixth disease’ and is caused by viruses from the herpes simplex virus family. Unlike other conditions caused by this class, roseola doesn’t cause cold sores or genital infections. Roseola does cause upper respiratory illness, typically mild, and is often accompanied by a fever over 103 degrees F.\n\nAround the time that the fever abates, a rash develops. Generally, the rash begins on the trunk and can radiate out to the neck, face, arms, skull and legs. The bumps are pinkish-red and relatively flat or slightly raised. When pressed, the spots turn white and a halo may appear around them. (2)\n\nRoseola normally isn’t serious, but a very high fever can cause potentially life-threatening complications. If you suspect roseola, and your child has a fever in excess of 103 F or a fever lasts for more than seven days, consult with your pediatrician as quickly as possible.\n\nWhenever a child has a fast-rising fever, febrile seizures are possible. It is estimated that approximately 10 percent to 15 percent of children that get roseola will experience this type of seizure, which while frightening for both parents and children, normally does not cause permanent damage brain damage or increase the risk for developing epilepsy. (3)\n\nRoseola is a contagious disease. It spreads through saliva transmitted by spitting and coughing and by nasal fluid expelled from sneezing, or just a dripping nose. It is contagious while the child has a fever but generally isn’t contagious by the time the rash arrives. However, it is important to note that the virus that causes roseola can live on surfaces for quite some time, depending on environmental factors. (4)\n\nThe fever can last anywhere from three to seven days and the rash can last anywhere from a few hours to three or four days. Conventional treatment focuses on relieving the fever, preventing dehydration and soothing the general discomfort the child is experiencing.\n\nWhile generally considered an early childhood disease, adults can get “sixth disease.” Adults can contract it if they were never exposed as a child. Once you have had roseola your body typically generates antibodies to protect you from future infections.\n\nHowever, adults with a weak immune system due to cancer treatment, a bone marrow transplant, an organ transplant, or who have HIV/AIDS, are at a heightened risk for reinfection. For these adults, potentially fatal complications like encephalitis and pneumonia are possible. If you suspect roseola or another infection and you have a compromised immune system, seek emergency medical attention immediately.\n\nRoseola, or sixth disease, is a highly contagious viral illness. In the beginning a fever presents abruptly and is often in excess of 103 F. Febrile seizures are possible during this time, particularly if the fever passes 103 F. The incubation period can be anywhere from five and 15 days after exposure before the first symptoms of roseola appear.\n\nDuring the fever portion of the illness, saliva and nasal fluids can spread the bacteria to individuals who have not yet been exposed, or to those who don’t have the antibodies necessary to fight the virus. The virus can live for an extended period of time on surfaces. Sneezing and coughing are the two primary ways that the virus is spread.\n\nThe fever may last for up to a week, and afterward a rash may develop. If an elevated temperature remains high for longer than seven days, seek medical attention immediately. The rash phase of the illness is typically short-lived, with most rashes going away within 12 to 24 hours. However, for some, the rash may linger for a couple of days.\n\nThe vast majority of cases of roseola are relatively mild and the symptoms will go away on their own in a week to two weeks. However, complications are possible with any illness that includes a fever, so a watchful eye is recommended.\n\nSometimes, roseola and the measles are confused as they both have symptoms of a high fever and a rash. The difference is really in the appearance of the rash. The roseola rash is a rosy pink color with bumps that start on the abdomen and radiate towards other areas of the body. Measles, on the other hand, causes a rash that is red or reddish-brown in color that typically starts on the face, migrating its way down the body. Whenever a rash appears, it is wise to see your child’s pediatrician as quickly as possible. (5)\n\nRoseola is caused by human herpes virus (HHV) type 6 or human herpes type 7 virus. There is no vaccine to prevent infection and the majority of people develop antibodies after infection to fight the virus when exposed later in life. (6)\n\nHowever, certain children and adults with a compromised immune system do have an elevated risk for reacquiring this illness. They include: (7)\n\nUpon physical examination of a child who presents with the typical symptoms associated with roseola, diagnosis is fairly rapid. Some physicians may request blood tests to determine the type of virus, particularly if any complications are present.\n\nTreatment focuses on reducing the fever and preventing dehydration as there is no cure for roseola. A pediatrician will likely recommend acetaminophen or ibuprofen to help relieve the fever — both of which can be dangerous. Please note: Under no circumstances should a child be given aspirin for a fever as Reye syndrome, a serious illness that affects the brain and liver, is possible. (8)\n\nFor babies who are still nursing, breast milk is the best way to stay hydrated and nourished while fighting roseola and other infections. For older children no longer nursing, coconut water is pleasing to the palate and rich with essential nutrients like potassium, which help to maintain electrolyte levels. (9)\n\nFighting viruses is hard on our bodies, particularly for young children. Eating yogurt or drinking kefir supports a healthy immune system response and it’s easy to digest, even when the stomach is upset.\n\nIn addition, researchers in Italy are studying the role of probiotics in fighting respiratory tract infections in children. Early results show probiotics may display clinical advantages in treatment and prevention. Researchers urge further study. (10)\n\nThese two nutrients are considered superpowers for fighting viral illness — and even the common cold. And now, research shows that when taken together they are significantly more efficient. (11)\n\nDosing for young children is a challenge, and it is safer to boost their intake of vitamin C-rich foods and zinc-rich foods. For an easy-on-the-tummy way to increase these two vital nutrients, top a bowl of yogurt with fresh berries, papaya or pineapple, or make a cold smoothie to soothe the throat.\n\nIn addition to boosting the immune system, research shows that selenium may help children recover more quickly from viral infections. Selenium fights inflammation, reduces asthma symptoms and increases longevity. It is an essential nutrient to be added to our diets through food. (12)\n\nAs mentioned above, dosing of supplements for infants and young children is challenging. The best way for them to receive the benefits of selenium is through food. Eggs are a great source of selenium and are generally well-tolerated. However, if your child has an egg allergy, one cup of sunflower seeds or brazil nuts will provide ample selenium.\n\nRich with antioxidants and anti-inflammatory properties, chamomile tea is proven to reduce fever and boost the immune system. For nursing babies, a mother can drink a cup or two of chamomile tea each day and the baby will receive a safe level of benefit. It is important to avoid chamomile tea if you have an adverse reaction to ragweed. (13)\n\nThe polyphenols in cocoa butter fight certain chronic diseases and support skin healing. Plus they can help relieve the discomfort associated with a skin rash like roseola. Rich with fatty acids, including stearic acid and palmitic acid, the cream is soothing and rich. (14)\n\nSafe and effective, aloe vera is a great way to relieve inflammation, redness and itching associated with a skin rash. If you don’t have a plant at home to cut from, purchase a high-quality aloe vera gel or 0.5 percent aloe extract cream. Apply to the affected areas several times a day.\n\nAdd a handful of ground oatmeal to a warm bath, along with a few drops of Roman chamomile essential oil. Together, they will help to relieve the discomfort of the rash while helping to reduce the inflammation. Roman chamomile is a known treatment for eczema, wounds and general skin irritations as well as for rashes. (15, 16)\n\nTo ease the irritability and anxiety of a sick baby or child, diffuse lavender oil. You can also add it to baths or to cocoa butter to help relieve the rash. Research has shown that inhaling lavender essential oil reduces stress and anxiety. So adding it to your child’s roseola treatment plan may help them relax. (17)\n\nThere is no known way to prevent roseola. The vast majority of people get the illness before they enter kindergarten. For adults and children with compromised immune systems due to underlying diseases or ongoing treatments, avoiding children known to have roseola is the best way to prevent infection.\n\nRoseola is considered a mild — yet highly contagious — childhood disease. However, complications are possible. If a fever persists for more than seven days, or if the rash persists for more than four days, consult with a physician immediately.\n\nFor those with a compromised immune system, seek medical attention immediately if you believe you’ve been exposed to roseola as life-threatening complications — including encephalitis and pneumonia — are possible.\n• Roseola, also known as ‘sixth disease,’ is a common and highly contagious childhood infection that afflicts the vast majority of children before they enter kindergarten.\n• Somewhere between 10 percent and 15 percent of children with roseola will experience a febrile seizure.\n• It is caused by human herpes virus (HHV) type 6 or human herpes type 7 virus, and there is no vaccine to prevent infection.\n• Treatment focuses on relieving the fever and preventing dehydration.\n• Individuals with a compromised immune system should seek medical attention immediately if they believe they’ve been exposed to roseola.\n• Stay hydrated and maintain a healthy balance of electrolytes by sipping coconut water.\n• Eat or drink probiotic-rich foods to ease stomach discomfort and boost immune system response.\n• Boost vitamin C and zinc intake by eating zinc-rich and vitamin C-rich foods.\n• Sip chamomile tea to boost the immune system and reduce the fever.\n• Rub cocoa butter on the rash to help relieve the pain and itching and to reduce inflammation.\n• Apply aloe vera to the rash to relieve inflammation, redness and itching.\n• Add ground oatmeal and chamomile essential oil to a warm bath to help to relieve discomfort.\n• Use lavender essential oil in a diffuser, or add to rash treatments to help reduce anxiety and irritability.", "opengraph": {"locale": "en_US", "type": "article", "title": "Roseola: How to Soothe 'Sixth Disease' Symptoms - Dr. Axe", "description": "Roseola, aka \"sixth disease,\" is a common and highly contagious childhood infection. Click here to learn more about how to soothe symptoms naturally.", "url": "https://draxe.com/health/roseola/", "site_name": "Dr. Axe", "article:publisher": "https://www.facebook.com/DrJoshAxe", "article:modified_time": "2019-02-20T19:31:12+00:00", "image": "https://draxe.com/wp-content/uploads/2018/01/Roseola_FB.jpg", "image:width": "1230", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#What_Is_Roseola", "#Roseola_Signs_Symptoms", "#Causes_Risk_Factors", "#Conventional_Treatment", "#9_Natural_Ways_to_Relieve_Roseola_Symptoms", "#Prevention", "#Precautions", "#Roseola_Key_Points", "#9_Natural_Treatments", "https://www.mayoclinic.org/diseases-conditions/roseola/symptoms-causes/syc-20377283", "http://kidshealth.org/en/parents/roseola.html", "https://draxe.com/health/epilepsy/", "http://kidshealth.org/en/parents/febrile.html", "http://kidshealth.org/en/parents/roseola.html", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://draxe.com/beauty/6-rash-natural-remedies/", "https://www.healthline.com/health/roseola#roseola-vs-measles", "https://draxe.com/essential-oils/essential-oils-for-sore-throat/", "https://www.healthline.com/health/roseola#causes", "https://www.healthline.com/health/immunodeficiency-disorders#6", "https://draxe.com/health/hepatitis-b/", "https://draxe.com/health/acetaminophen-overdose/", "https://draxe.com/health/dangers-of-nsaids/", "https://draxe.com/health/aspirin-side-effects/", "http://kidshealth.org/en/parents/reye.html", "https://draxe.com/nutrition/is-coconut-water-good-for-you/", "http://www.todaysdietitian.com/news/exclusive1011.shtml", "https://draxe.com/nutrition/kefir-benefits/", "https://draxe.com/nutrition/probiotics-benefits-foods-supplements/", "https://www.ncbi.nlm.nih.gov/pubmed/24720809", "http://journals.sagepub.com/doi/10.1177/147323001204000104", "https://draxe.com/nutrition/vitamin-c-foods/", "https://draxe.com/nutrition/foods-high-in-zinc/", "https://draxe.com/nutrition/selenium-benefits/", "http://www.umm.edu/health/medical/altmed/condition/roseola", "https://draxe.com/nutrition/sunflower-seeds/", "https://draxe.com/nutrition/chamomile-benefits/", "https://www.ncbi.nlm.nih.gov/pubmed/21132119", "https://draxe.com/nutrition/cocoa-butter/", "https://www.ncbi.nlm.nih.gov/pubmed/18822039", "https://draxe.com/nutrition/aloe-vera-benefits/", "https://draxe.com/essential-oils/roman-chamomile-essential-oil/", "https://www.webmd.com/children/tc/rash-age-11-and-younger-home-treatment#1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2995283/", "https://draxe.com/essential-oils/lavender-oil-benefits/", "https://books.google.com/books?id=JXe9CgAAQBAJ&pg=PA393&dq=essential+oils+for+anxiety&hl=en&sa=X&ved=0CDsQ6AEwAmoVChMI366X-ZjPyAIVT89jCh0heADS#v=onepage&q=essential%20oils%20for%20anxiety&f=false", "https://draxe.com/health/chicken-pox-symptoms/"], "authors": [], "publish_date": null}