{"result_id": "101006", "URL": "https://www.drnorthrup.com/should-you-get-the-flu-shot-this-year/", "timestamp": "2023-04-25 15:00:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.drnorthrup.com/wp-content/uploads/2014/11/fav.png", "canonical": "https://www.drnorthrup.com/should-you-get-the-flu-shot-this-year/", "encoding": "UTF-8"}, "image": null, "domain": "www.drnorthrup.com", "title": "Should You Get the Flu Shot This Year?", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) recommends that all Americans over the age of 6 months receive an annual flu shot. Many doctors push the flu vaccine on patients during regular visits. Pediatricians often do this during well child visits and even use fear and guilt to coerce parents into vaccinating. This practice has become standard, and some doctors will not treat patients who refuse CDC-recommended vaccines.\n\nEven if you don’t go to the doctor, you can’t escape the ads and media messages selling the flu vaccine as the best method of preventing influenza. Pharmacies and retail stores also promote flu shots. It’s ingrained in our culture that Fall is “flu season” and that by getting your flu shot, you are protecting yourself and those around you.\n\nHere is the content of an email my editor received on September 29 as we were in the process of publishing this blog:\n\n“This year, it’s even more important to get a flu shot to protect yourself and your community. The CDC recommends getting vaccinated by the end of October, before peak flu season begins.”\n\nIf you have followed me for a while, you know that universal screening tests and vaccines are not the same as prevention, and they do not create true, lasting health. True health is cultivated from the inside out. And when so-called experts say, “Vaccines only work if enough people get them” or “Everyone needs to be vaccinated in order to protect the small number of people who cannot get the vaccine for medical reasons,” you know that something is not right.\n\nIn fact, when it comes to the flu vaccine, something is wrong indeed. Research suggests that receiving annual flu vaccinations does not lower the risk of disease transmission at all, so you are not protecting yourself or your community when you receive a flu vaccine. That said, I’m the first to acknowledge that if your inner wisdom and not societal pressure leads you to get a flu shot, then it is most likely the right thing for you.\n\nRisks Associated with the Flu?\n\nThe flu is a respiratory virus spread via infectious droplets. The most common symptoms of the flu include sudden fatigue, fever (usually above 100 degrees), chills, headache, body aches, dry cough, and sore throat. Children can sometimes have stomach problems or diarrhea, but this is not a common symptom for adults.\n\nAs with any virus and in any given year, some people can experience more severe symptoms and complications that require medical intervention. These symptoms may include chest pain, trouble breathing, severe vomiting, dizziness and confusion, among others.\n\nPeople who are typically at high risk for complications from the flu (and all other viruses) include those with immune system problems or chronic health conditions, such as diabetes and heart disease. If you are pregnant, Native American, or Alaska Native, you may have a higher risk of complications from the flu. The elderly and very young (under 2 years) may suffer more severe symptoms as well.\n\nWhile some people will die from complications from the flu, the number of flu deaths reported by the CDC each year are misleading because they are combined with pneumonia deaths, the causes of which can be anything. For most healthy individuals, the flu is easily treated with rest and fluids.\n\nI live a healthy life, and I trust my immune system to do its job. I also know that viruses are ubiquitous organisms that make up the human biome. And they don’t cause problems unless the body is compromised in some other way—such as by air pollution, water pollution or soils laced with glyphosate. So, I don’t worry that I’ll catch something during “flu season.” But I know that even healthy people get fooled, shamed, or scared by their doctors, the media, and even friends and family into getting a flu shot when it’s really not necessary.\n\nThat’s why I want you to understand the reasons I don’t get flu a shot and why I recommend you pass on it as well.\n• They are ineffective. According to the CDC, flu vaccine effectiveness varies between 40–60 percent. However, in 10 out of 14 flu seasons between 2004/2005 and 2017/2018, overall influenza vaccine effectiveness was less than 50 percent. During the 2018/2019 season, the vaccine proved to be only 29 percent effective. During the 2014/2015 season, the vaccine was only 19 percent effective! Most flu vaccines are created using the common Type A and Type B influenza strains. One reason the flu vaccine is not effective is because there are always hundreds of influenza viruses circulating, and there is no way to predict which strains will hit each year. More than 80 percent of influenza-like respiratory illnesses that occur during flu season are not caused by Type A and Type B influenza strains. In addition, influenza viruses mutate rapidly. A flu vaccine with last year’s strains will not offer protection against this year’s new strains.\n• Vaccine data is manipulated. Research shows that much of the data supporting flu vaccines as a way to prevent infection, complications, hospitalizations, and death are actually due to what’s called the healthy user effect. This means that people who received the vaccine and didn’t die during flu season are reported as having had a reduced risk of dying over those who were not vaccinated, which translates into the success rate of the vaccine. However, when the people who are vaccinated actually have a lower risk of dying to begin with, this is attributed to being a healthy user. Given the growth in pharmaceutical advertising dollars behind the studies and medical journals reporting them, I think it’s fair to say that there is widespread bias in reporting on vaccine effectiveness.\n• They contain harmful adjuvants. A great majority of vaccines (if not all) contain harmful ingredients that act as adjuvants. Many are known to be extremely toxic, including mercury, aluminum compounds, ammonia sulfate, beta-Propiolactone, ethyl mercury (thimerosal), formaldehyde, monosodium glutamate, octoxynol-9, phenol, polysorbate 80, and others. In animal studies, these ingredients have been shown to cause developmental delays; adverse neurologic events and disorders, such as motor weakness and slowing; and a host of other ill effects. The CDC reports that brain inflammation and death are known “side effects” of every vaccine. (Remember, conditions such as ADHD, autism, and learning disabilities are manifestations of an inflamed brain.) I encourage anyone considering getting a flu vaccine (or any vaccine for that matter) to read the package inserts first. That way you can see for yourself exactly what is in them. You can find package insert information for many commonly given vaccines at Vaccinesafety.org.\n• They contain viral proteins from animals. Vaccine companies typically use chicken embryos to culture flu strains. (They also use dog kidney cells.) Fertilized chicken eggs are susceptible to a wide variety of viruses and contain biologically active ingredients that may be harmful to humans, including tiny proteins that have been associated with neurological disorders and oncogenes that can cause cancer.\n• Flu mortality statistics are exaggerated. The CDC’s National Center for Health Statistics (NCHS) lumps influenza and pneumonia statistics together. This greatly inflates the number of “flu deaths” each year. For example, in 2001, the CDC reported 62,034 “influenza and pneumonia” deaths. Since pneumonia can have many underlying causes, you need to look at the actual number of reported flu deaths. That number—the number of deaths with influenza as the sole underlying cause—was just 257. That means 61,777 reported flu deaths were actually due to pneumonia with some other underlying cause. Even more interesting is that of the 257 “flu deaths,” there were only 18 positive cases of influenza virus that could be identified. In addition, between 1976 and 2006, flu death estimates varied widely because the tests used to diagnose influenza were not sensitive enough to distinguish influenza from the 150–200 different pathogens that produce flu-like symptoms. And, while the CDC uses respiratory and circulatory (R&C) deaths to provide an estimate of deaths that include secondary respiratory or cardiac complications following influenza, it admits that only 2.1 percent of these deaths are related to influenza.\n• Risk of adverse events. In addition, a growing body of evidence shows not only are flu shots ineffective, there are also possible dangers of the flu vaccine. In my opinion, the risk of adverse events from the flu vaccine far outweigh the risk associated with contracting the flu virus for most people. According to the Health Resources and Services Administration (HRSA), since the flu vaccine’s inclusion in the National Vaccine Injury and Compensation Program (NVICP), up until 2015, there were more than 3,400 petitions claiming injury or death resulting from flu vaccines. While this may not seem like a large number, it’s important to remember that most people do not report adverse events. And yet flu vaccine petitions represented 37.71 percent of all petitions. Of those flu vaccine–related injury and death claims, nearly 60 percent of petitioners received compensation.\n• Increases your risk of COVID-19 infection. A Department of Defense study showed that, while the flu vaccine studied demonstrated varied benefit in flu prevention, it raised the risk of coronavirus infection by 36 percent. This is most likely due to vaccine virus interference. A 2018 study supported by the CDC showed an increased risk in non-flu acute respiratory illnesses (ARI) in children under the age of 18 who received the flu vaccine compared to unvaccinated children. Other studies also show that flu vaccines greatly increase the risk of non-flu viral infections and also greatly increase risk of flu infections. You can find more information on the Children’s Health Defense website.\n\nAnything that appears to increase my risk and also has a risk of serious adverse events is not something I want to put in my body. If you are considering getting a flu vaccine, the National Vaccine Information Center has a number of resources to help you become fully informed about the risks and complications of diseases and vaccines.\n\nRemember, getting the flu or any illness is not inevitable. You have the tools you need to stay healthy every day, even during “flu season.”\n\nExploiting the narrative that the mRNA COVID shots are working, Pfizer and Moderna have been quickly working toward the launch of universal, multivalent flu shots using the same experimental mRNA platform. Currently in late-stage human trials, the new flu shots—known as a quadrivalent vaccines—are being pitched as protecting against four different flu virus strains. (In addition, Moderna is working on new mRNA combined vaccines for flu, COVID, and respiratory syncytial virus, or RSV.)\n\nThe idea behind creating a universal flu vaccine is that it would reduce the need to create new flu shots every year. But that doesn’t mean the new universal flu shots will actually replace annual flu shots. The establishment will most likely tell you that you need to get both. Here’s why…\n\nThe current flu shots are seasonal and are supposed to protect against the most recent circulating strains. The mRNA shots “encode” immunogens from all the known influenza subtypes and lineages, but they do not protect against the current flu strains in circulation. The mRNA shots simply illicit a “memory response” that would potentially have the effect of reducing severe illness and death.\n\nWhat this really means is that the new universal flu vaccines do not create “sterilizing” immunity. In other words, they will not prevent infection or transmission. Instead, they are being pitched as the best way to prime your immune system to respond better if you get the flu and lower your risk of hospitalization and death.\n\nIs this starting to sound familiar?\n\nThe Flu Vaccine is Bad Medicine: The science against the flu vaccines and Tamiflu: why they are ineffective, unnecessary, and bad medicine. Forward by Jim Meehan, MD\n\nIncreased Risk of Noninfluenza Respiratory Virus Infections Associated With Receipt of Inactivated Influenza Vaccine. Benjamin J. Cowling, Vicky J. Fang, […], and J. S. Malik Peiris", "opengraph": {"site_name": "Christiane Northrup, M.D.", "title": "Should You Get the Flu Shot This Year? | Christiane Northrup, M.D.", "image": "https://www.drnorthrup.com/wp-content/uploads/2020/10/Imagereduced.jpg", "description": "The Centers for Disease Control and Prevention (CDC) recommends that all Americans over the age of 6 months receive an annual flu shot. Many doctors push the flu vaccine on patients during regular visits. Pediatricians often do this during well child visits and even use fear and guilt to coerce parents into vaccinating. This practice […]", "url": "https://www.drnorthrup.com/should-you-get-the-flu-shot-this-year/", "locale": "en_US", "article:publisher": "https://www.facebook.com/DrChristianeNorthrup", "article:author": "https://www.facebook.com/DrChristianeNorthrup", "article:published_time": "2022-12-07T12:16:00+00:00", "article:modified_time": "2022-12-06T20:46:17+00:00", "image:width": "946", "image:height": "629", "types": ["article", "og:article"]}, "tags": ["flu vaccine", "flu", "Vaccines", "vaccine risks", "flu shot", "immunity"], "tweets": [], "movies": [], "links": ["https://www.pnas.org/content/115/5/1081", "https://www.cdc.gov/flu/weekly/", "https://www.cdc.gov/flu/vaccines-work/effectiveness-studies.htm", "https://www.cidrap.umn.edu/news-perspective/2008/08/study-flu-vaccine-doesnt-lower-death-rates-elderly", "http://www.vaccinesafety.edu/package_inserts.htm", "https://www.hrsa.gov/sites/default/files/vaccinecompensation/data/vicpmonthlyreporttemplate2_1_17.pdf", "https://www.sciencedirect.com/science/article/pii/S0264410X19313647?via%3Dihub", "https://pubmed.ncbi.nlm.nih.gov/29525279/", "https://childrenshealthdefense.org/news/vaccine-misinformation-flu-shots-equal-health/", "https://www.drnorthrup.com/natural-ways-to-stay-healthy-this-winter/", "https://www.drnorthrup.com/natural-ways-to-stay-healthy-this-winter/", "https://www.meehanmd.com/blog/post/170337/the-flu-vaccine-is-bad-medicine-1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3404712/"], "authors": [], "publish_date": "2022-12-07T12:16:00+00:00"}