{"result_id": "101007", "URL": "https://www.drnorthrup.com/5-health-questions-you-need-to-ask-now/", "timestamp": "2023-04-25 15:00:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.drnorthrup.com/wp-content/uploads/2014/11/fav.png", "canonical": "https://www.drnorthrup.com/5-health-questions-you-need-to-ask-now/", "encoding": "UTF-8"}, "image": null, "domain": "www.drnorthrup.com", "title": "7 Health Questions You Need to Ask Now.", "cleaned_text": "I have been an advocate for women (and men) taking control of their health for decades. Yet, sadly our medical freedom is under attack now more than ever with health care providers, insurance companies, governments, and schools dictating how we take care of our health and the health of our families.\n\nOne question I get a lot is “Should I get this vaccine?” Or “Should my child get this vaccine?” Whether it be a hepatitis B vaccine for a newborn, a measles vaccine for a school-age child, the flu shot for a pregnant woman, or the shingles vaccine for an elderly relative, making the right decision for you (or your family member) can seem daunting.\n\nNow, I can’t tell every person who asks me which vaccines they should or shouldn’t get. But I have been teaching women for decades how to tune into their own body’s intuition, where to find the facts, and what hard questions to ask your health care provider.\n\nWith the vaccine initiatives in play today, I want to share 6 questions (and answers) to consider when trying to keep yourself and your family safe from communicable diseases.\n\nQUESTION 1: Do unvaccinated children pose a health risk to others, especially immunocompromised children?\n\nANSWER: No. The vaccination status of other children does not pose a significant risk to your children, even those who are immunocompromised. No study has ever shown that an unvaccinated child puts another child at risk. On the contrary, a 2014 NVIC (National Vaccine Information Center) report documents how a vaccinated child can shed a live virus for up to 7 weeks after injection, depending upon the vaccine given, and therefore poses more of a threat of spreading the disease.\n\nPhysicians for Informed Consent has a great fact sheet about vaccines on their website. In addition, you may want to read an article written by Jean Ghantous, the mother of a child with leukemia, at Thinking Mom’s Revolution. What she has to say about this subject is right on.\n\nQUESTION 2: Are vaccines safe? Haven the been thoroughly tested?\n\nANSWER: No. In fact, all you need to do to find the answer to this question is to read the package insert for any vaccine. These inserts plainly state that the great majority of, if not all, vaccines contain ingredients known to be extremely toxic, including mercury, aluminum, sorbitol, and others. In animal studies, these ingredients have been shown to cause developmental delays; adverse neurologic events and disorders, such as motor weakness and slowing; and a host of other ill effects. You can find package insert information for many commonly given vaccines at VaccineSafety.org.\n\nANSWER: No. In fact, according to historical records, 90 percent of the decline in disease mortality occurred before the introduction of vaccines. The most important factors contributing to the steep decline of diseases such as polio, measles, diphtheria, and typhoid in the late 19th and early 20th centuries were better nutrition, less crowding, better sanitation, and cleaner water. To learn the history and facts related to the decline of these diseases and their mortality rates, check out LearnTheRisk.org.\n\nANSWER: Unfortunately, no. It has been well documented in countless cases that diseases such as measles, mumps, and whooping cough (pertussis) occur in fully vaccinated populations. Vaccinations by no means guarantee a child will not contract the virus or bacteria the vaccine is supposed to protect against.\n\nThere are many examples of this:\n• Measles outbreaks occur regularly in fully vaccinated populations. The reasons for this are: (a) Vaccine-conferred immunity wanes over time. And contrary to what you have been told, a third, or booster, of the vaccine has not been shown to increase immunity. (b) Some people don’t respond to the vaccine at all despite multiple shots. In fact, it is estimated that nearly 50% of schoolchildren and most adults vaccinated with two doses of the MMR vaccine can still be infected with the measles virus and spread it to others, even with mild or no symptoms of their own. China is a perfect example of this. For the last decade, China has had a countrywide vaccination coverage above 95% (the threshold for measles elimination). Yet, measles continues to cause large epidemics. One study shows that despite a measles vaccination rate of more than 97 percent, more than one-quarter of vaccinated children in Tianjin, China, became infected with measles. School systems also see similar outbreaks. Two school systems in Texas—one in Houston and one in Corpus Christi—are prime examples of outbreaks among the fully vaccinated. In addition, we are now seeing generations of children born to vaccinated mothers. These children lack transplacental immunity—in other words, disease immunity is not passed from the mother to the child, unlike with previous generations, because the vaccinated mother does not have the natural immunity. So, rather than eradicating diseases such as measles and creating healthier children who could fight off a measles infection if they were to acquire it, vaccines are creating generations of children who become sicker from these infections than in the past due to an altered host immune response, and we are likely to see higher death rates as well. In fact, the side effects of the MMR vaccine are worse than getting the measles. For example, data shows that seizures are 5 times more likely to occur in children who have received the MMR vaccine than in children who contract the measles. Conversely, naturally acquired measles infections are associated with a reduced risk of Hodgkin’s and non-Hodgkin’s lymphomas, as well as a reduced risk of atopic diseases such as hay fever, eczema, and asthma. In addition, measles infections are associated with a lower risk of mortality from cardiovascular disease in adulthood.\n• In 2016, an outbreak of mumps swept through the student body at Harvard. These students were all fully vaccinated. In 2019, a US Navy warship carrying marines was quarantined for nearly 4 months due to a mumps outbreak. All of the service people on board had been fully vaccinated against it. This is not the first incident of an outbreak of mumps on a military ship.\n• The current outbreaks of pertussis in this country are taking hold in fully vaccinated children. This is because the current pertussis vaccine doesn’t confer much protection at all, and what protection it does provide wanes within 2 years. As is common in the world of viruses and bacteria, the pertussis germ has mutated, making the DPT vaccine ineffective. In December 2019, a Houston school closed due to a pertussis outbreak among vaccinated children and staff.\n\nANSWER: Sadly, no. A staggering 50% of children today—more than ever before—have a chronic illness including asthma, allergies, ADHD, depression, anxiety, developmental delays, and autoimmune diseases. Controlled clinical trials comparing vaccinated with unvaccinated populations in the United States have never been carried out. And there aren’t any studies on the safety of injecting infants, toddlers, and adolescents with up to 6 vaccines in a single visit—a common practice today.\n\nThere are now 69 to 72 vaccines recommended by the CDC for all children through age 18. The vaccine industry has become a huge business with no liability. On the contrary, it is the US taxpayers who have thus far paid out $4.1 billion in vaccine-related damages since the companies themselves have been granted immunity. Merck’s—just one of several vaccine manufacturers—2019 fourth-quarter financial highlights speak volumes as to what is really happening. And while many pediatricians have not dared to speak out on the subject, some who have been in practice 20 years and longer, including Dr. Lawrence Palevsky, are now coming out and saying it is their unvaccinated patients who are healthier than their vaccinated ones. In fact, some studies show that the non-specific effects of vaccines can increase morbidity and mortality.\n\nIn 1986, Congress gave vaccine manufacturers complete immunity from all liability resulting from vaccine injury, shifting the financial burden to US taxpayers, who, according to the Vaccine Adverse Events Reporting System (VAERS), have paid out $4 billion to vaccine-injured families since that date. That is a lot, considering that fewer than 1% of all vaccine injuries are reported.\n\nThe average period of safety testing for a vaccine is only 10 days. If you or your child develops seizures 2 weeks following a vaccine, almost no doctor will attribute the cause to the vaccine. Yet, pregnant women are being given flu and DPT vaccines containing aluminum, mercury, and other neurotoxins even though the practice is known to cause an increased risk in autism spectrum disorder.\n\nThe Food and Drug Administration (FDA) has ruled for the past decade that aluminum in infant parenteral (feeding) solutions should not exceed 5 micrograms/kg/day. Yet, aluminum in infant IV parenteral solutions, commonly given to infants in standard neonatal intensive care IV feeding solutions, contains 45 micrograms/kg/day. These solutions are given for 14 days or longer and have been shown to impair neurological development. One influential study estimated that infants lost around one mental development index point for each day on the standard aluminum solution.\n\nThe CDC continues to ignore this data and requires that all newborns born in the United States receive the hepatitis B vaccine at birth (or shortly after). The hepatitis B injection contains 250 micrograms of aluminum—more than 10 times (1,000%) the maximum FDA allowable\n\nSince vaccine manufacturers won their immunity from prosecution, the CDC schedule for recommended vaccines has tripled. Two hundred more vaccines are in the pipeline. The CDC itself is involved in conflict of interest practices with vaccine companies; and the former CDC director, who fast-tracked Gardasil despite many concerns, became the head of Merck’s vaccine division. The CDC’s Advisory Committee on Immunization Practices (ACIP) includes many individuals who have received financial gains from vaccine manufacturers.\n\nRemember, the first step toward maintaining your health and your health freedom is staying informed. It is your right to be informed before making any decisions regarding your health. So, keep asking questions\n\nTwo More Questions That Many People Are Asking Now\n\nQUESTION 6: Are vaccines the only way to achieve herd immunity?\n\nANSWER: No.We are hearing about herd immunity a lot lately. Frankly, this term is being co-opted to achieve higher vaccination rates. In fact, from June 2020-November 2020 the World Health Organization (WHO) changed the definition of herd immunity to imply it can only be achieved through vaccination. The truth is active immunity is achieved by natural immunity. Vaccine-induced immunity is partial immunity but is not true immunity.\n\nSo, let me explain.True immunity is obtained through exposure to an infection that your body fights off. When your body defeats an infection, you gain lifelong immunity to that infection in the future. You even acquire some—even considerable—immunity to different strains of the infection. I have a friend who had SARS (along with her husband) in 2003. My friend and her husband were exposed to SARS-COV-2 through their housekeeper (who developed COVID-19) in February of 2020. However, because my friend and her husband had SARS 17 years ago, they developed only very minor symptoms for about 2 days.\n\nMothers who have natural immunity to infections pass that immunity to their babies. It’s called transplacental immunity. My same friend who had SARS had a baby in 2007. Their child who was 12 years old and likely had multiple exposures to SARS-COV-2 in addition to the household exposure, did not become sick. Transplacental immunity does not occur if the mother is vaccinated.\n\nThe theory behind vaccine-created immunity is that vaccines prime your immune system to fight off an infection if you are ever exposed to it. However, vaccines use a much weaker strain than that found in nature. This is one reason multiple booster shots are needed, and why we see breakthrough cases of diseases we inoculate against. Another reason vaccines do not provide 100% immunity is because your immune system is designed to respond to exposures, not intramuscular injections with toxic adjuvants.\n\nNow, the COVID-19 shots are brand new technologies that work differently than typical vaccines. However, like traditional vaccines these injections will also require you to take multiple booster shots. And, as with traditional vaccines, we are already seeing breakthrough cases in people who have taken the COVID shots—not to mention serious adverse effects, including disability and death, from the vaccines themselves\n\nGetting back to herd immunity, the important thing to remember is if you have had a disease and recovered from it, you have lifelong immunity. So, you do not need to be vaccinated against it. A recent study showed that people who have had SARS-COV-2 are unlikely to become reinfected, and that the COVID shots do not provide additional protection to previously infected individuals.\n\nQUESTION 7: If I’ve a COVID shot, do I need to take the booster shots?\n\nANSWER: The short answer is no. From a purely scientific standpoint, it makes no sense. The bivalent booster shots are identical to the original COVID shots except for a small tweak in the mRNA code to match the omicron BA.5 virus.\n\nThe FDA’s decision to approve the BA.4/5 boosters was made without data from human trials. In fact, the only “data” is from mice—specifically 8 mice. This is hardly evidence that the shots are “safe and effective.” The FDA’s approval process in this instance is unprecedented primarily due to the fact that mice conditions do not compare to or mimic the human state. And while the FDA clears flu vaccines without human trials (another shot I do not recommend), the mRNA shots are not the same.\n\nBypassing normal drug development protocols to rush a drug to market without supporting data should raise a red flag for everyone. And, these shots are being approved for Emergency Use Authorization (EUA). But what is the emergency? The CDC has relaxed its “pandemic rules.” So what’s really going on? I’ll tell you what: The government, the FDA and the CDC are preparing us for annual (or more frequent) booster shots.\n\nDuring a vaccine advisory committee meeting on September 1, 2022, Evelyn Twentyman, head of the CDC’s vaccine policy unit, said “We want to emphasize we’re no longer looking at total number of doses. From now on, the agency hopes to transition into a more regular schedule for COVID-19 vaccines, similar to getting annual flu shots.”\n\nStéphane Bancel, Moderna’s CEO, has said that the shots will evolve like the iPhone. And, the people who are pushing these jabs on us would like to make them mandatory and tied to your ability to participate in society while they continue to bypass protocols, sell their “safe and effective” slogan through the media, celebrities, and others, and put the profits in their own pockets.\n\nThe good news is many people are waking up—even those who previously took the shots—and are saying “no”. You can too.\n\nWhat vaccines do you think have helped you or hurt you? Please leave your comments below.\n\nThe HPV Vaccine: What You Need to Know Today\n\nDoes Your Daughter Need the HPV Vaccine?\n\nShould You Get the Shingles Vaccine? (Video)\n\nDo You Need to Detox?", "opengraph": {"site_name": "Christiane Northrup, M.D.", "title": "7 Health Questions You Need to Ask Now. | Christiane Northrup, M.D.", "image": "https://www.drnorthrup.com/wp-content/uploads/2020/03/Imagereduced.jpg", "description": "I have been an advocate for women (and men) taking control of their health for decades. Yet, sadly our medical freedom is under attack now more than ever with health care providers, insurance companies, governments, and schools dictating how we take care of our health and the health of our families. One question I get […]", "url": "https://www.drnorthrup.com/5-health-questions-you-need-to-ask-now/", "locale": "en_US", "article:publisher": "https://www.facebook.com/DrChristianeNorthrup", "article:author": "https://www.facebook.com/DrChristianeNorthrup", "article:published_time": "2022-09-21T11:17:00+00:00", "article:modified_time": "2022-09-21T12:00:47+00:00", "image:width": "946", "image:height": "630", "types": ["article", "og:article"]}, "tags": ["autism", "DPT", "flu", "shingles", "holistic self-care", "hpv vaccine", "measles", "pharmaceutical companies", "mumps", "Vaccines", "pertussis", "Gardasil", "self-care"], "tweets": [], "movies": [], "links": ["https://www.nvic.org/CMSTemplates/NVIC/pdf/Live-Virus-Vaccines-and-Vaccine-Shedding.pdf", "https://physiciansforinformedconsent.org/wp-content/uploads/2019/12/PIC-RGIS.pdf", "https://thinkingmomsrevolution.com/dont-vaccinate-protect-cancer-kid/", "http://www.vaccinesafety.edu/package_inserts.htm", "https://www.learntherisk.org/diseases/?__cf_chl_jschl_tk__=da11ab664d863c5a00e142753cc01c84a9b71db3-1582127216-0-AYIs1NR4YLJEuZsVgvQdSWCXOX_XsMXyo0DkdyixDuY62iCBH3LH2w9RI-FwE4BwpUpPRoPxZrKcF3103vAXPqi6W74XVn2NSuKqA3UuQq-1H8aEdD_W5qeo4xHDYUT1bH-ywxboQmXCSZ2iNCchJ46mLVXmDgksWzG1xecMnWl7I6GVYlefj23YMYa5Q90rBs3b-s_Vn-r1so0nEEIpIYbs4wvbzZnztth_zHyr97zWQ4CO6uQKT679D7Bz7DzoAuWV29IqE9quNRORiO7q4eAr1V6iHiecVOLNOaacJqJQ", "https://physiciansforinformedconsent.org/wp-content/uploads/2019/12/Measles-DIS.pdf", "https://physiciansforinformedconsent.org/wp-content/uploads/2019/12/MMR-Waning-Immunity-PSA.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6375639/?fbclid=IwAR0RQ4NM0oFBLPomWyJw3E_3y9DT6wIgvZ9uXjd0hHz2vD_4duNqX0Y4QOw", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6375639/?fbclid=IwAR0RQ4NM0oFBLPomWyJw3E_3y9DT6wIgvZ9uXjd0hHz2vD_4duNqX0Y4QOw", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6375639/?fbclid=IwAR0RQ4NM0oFBLPomWyJw3E_3y9DT6wIgvZ9uXjd0hHz2vD_4duNqX0Y4QOw", "https://www.ncbi.nlm.nih.gov/pubmed/8483623", "https://www.ncbi.nlm.nih.gov/pubmed/3821823", "http://vaccineriskawareness.com/vaccination-and-natural-immunity/", "https://healthimpactnews.com/2013/outbreaks-of-measles-in-vaccinated-children-intensifying/", "https://physiciansforinformedconsent.org/measles/dis/", "/news.harvard.edu/gazette/story/2020/02/the-story-behind-the-mumps-outbreaks-of-2016-17", "https://taskandpurpose.com/uss-fort-mchenry-mumps-outbreak.", "/www.sciencedaily.com/releases/2019/06/190610090106.htm", "https://thevaccinereaction.org/2019/12/fully-vaccinated-school-in-houston-closes-due-to-pertussis-outbreak/", "https://www.reuters.com/article/us-merck-co-results-idUSKCN1S616K?fbclid=IwAR3pGYlADrvmTTW-jokDWpWwtY4OV_ubJJaNzJKNzLvHi4bfKujEbglVZpg", "https://mms.businesswire.com/media/20200205005307/en/771394/1/Financial_Highlights_Package_4Q19_.pdf?download=1", "https://vimeo.com/386313325?fbclid=IwAR1cnwNHFgxf9j_ZblEGnbhimL79o-7DOdJ_aXu7JtmTfPemexD7LuLi87M", "https://www.oatext.com/Pilot-comparative-study-on-the-health-of-vaccinated-and-unvaccinated-6-to-12-year-old-U-S-children.php", "https://www.ncbi.nlm.nih.gov/pubmed/27893896", "https://pubmed.ncbi.nlm.nih.gov/9164811-aluminum-neurotoxicity-in-preterm-infants-receiving-intravenous-feeding-solutions/", "https://www.greenmedinfo.com/blog/examining-rfk-jrs-claim-cdc-owns-over-20-vaccine-patents", "https://vaccineimpact.com/2018/former-cdc-director-that-approved-gardasil-vaccine-and-became-head-of-mercks-vaccine-division-named-woman-of-the-year/", "https://www.documentcloud.org/documents/20804781-necessity-of-covid-19-vaccination-in-previously-infected-individuals", "/www.cdc.gov/vaccines/acip/meetings/slides-2022-09-01-02.html", "https://www.cdc.gov/vaccines/acip/meetings/slides-2022-09-01-02.html", "https://www.cnn.com/2022/08/11/business/moderna-covid-vaccines-annual-booster-intl-hnk/index.html", "https://www.drnorthrup.com/should-you-get-the-flu-shot-this-year/", "https://www.drnorthrup.com/the-hpv-vaccine-what-you-need-to-know-today/", "https://www.drnorthrup.com/does-your-daughter-need-hpv-vaccine/", "https://www.drnorthrup.com/help-for-gardasil-side-effects/", "https://www.drnorthrup.com/video/shingles-vaccine/", "https://www.drnorthrup.com/do-you-need-to-detox/"], "authors": [], "publish_date": "2022-09-21T11:17:00+00:00"}