{"result_id": "103007", "URL": "https://ecology.news/2023-02-24-epa-chief-regan-downplays-ohio-chemical-spill.html", "timestamp": "2023-04-25 15:01:05 CEST+0200", "meta": {"description": "Michael Regan, the administrator of the Environmental Protection Agency (EPA), remarked that he would allow his own children to drink and bathe in the public water at East Palestine, Ohio – where a chemical-loaded train derailed and spilled its lethal cargo. The EPA head made his remark with a caveat – he will only permit […]", "lang": "en", "keywords": "Air pollution,badhealth,badpollution,badscience,cancer causes,chaos,chemical spill,chemicals,clean air,clean water,conspiracy,controlled burn,Cover-Up,Dangerous,deception,derailment,disaster,East Palestine,Ecology,environment,hazmats,Mike DeWine,ohio,panic,poison,pollution,Toxic,toxic chemicals,toxins,train derailment,water pollution", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-02-24-epa-chief-regan-downplays-ohio-chemical-spill.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "EPA chief downplays Ohio chemical spill, says he’ll allow his kids to drink and bathe in East Palestine’s water", "cleaned_text": "EPA chief downplays Ohio chemical spill, says he’ll allow his kids to drink and bathe in East Palestine’s water\n\nMichael Regan, the administrator of the Environmental Protection Agency (EPA), remarked that he would allow his own children to drink and bathe in the public water at East Palestine, Ohio – where a chemical-loaded train derailed and spilled its lethal cargo.\n\nThe EPA head made his remark with a caveat – he will only permit his children there as long as the water had been tested and deemed safe by officials.\n\n“As a father, I trust the science. I trust the methodology that this state is using and as a parent, I would,” he said, seeking to reassure skeptical residents that the water is safe to drink and the air around the crash site is safe to breathe.\n\nRegan’s remarks followed a challenge posted by Sen. JD Vance (R-OH) on Twitter. The Republican lawmaker visited a local creek in East Palestine on Feb. 16, and dragged a stick through a creek bed. Vance then stirred up an oily-looking rainbow sheen on the water’s surface.\n\n“If the EPA administrator wants to stand here and tell people that the tap water is safe, [he] should be willing to drink it,” Vance wrote. The senator firmly told residents not to drink from the water supply and to drink bottled water instead, which is being supplied by the government at no cost. (Related: Government, mainstream media trying to downplay Ohio derailment and chemical spill.)\n\nA day before Vance’s visit, the local EPA office announced on Feb. 15 that tests on five wells that supply drinking water to East Palestine “showed no detection of contaminants” associated with the train derailment. However, the office also disclosed that the enforceable maximum contaminant level for vinyl chloride – the main hazardous chemical involved in the spill – in drinking water is two parts per billion.\n\nMoreover, the Ohio Department of Natural Resources said dead fish had appeared along more than seven miles of streams. According to its estimates, at least 3,500 fish – mostly small ones such as minnows and darters – turned up dead following the disaster.\n\nTo make matters worse for the Buckeye State, the Biden administration rejected Ohio Gov. Mike DeWine’s request for disaster relief following the train derailment and chemical spill.\n\nDeWine’s office has been regularly contacting FEMA, but the agency continues to tell the governor that Ohio isn’t eligible for disaster assistance.\n\nAccording to a federal official, it has already provided extensive assistance to surrounding communities following the chemical release. But the Federal Emergency Management Agency (FEMA), the agency that usually provides relief to communities hit by hurricanes and other natural disasters, isn’t equipped to support the state’s current needs, the official added.\n\n“The Biden administration is mobilizing a robust, multi-agency effort to support the people of East Palestine, Ohio. Since Feb. 3, EPA has had personnel on the ground. FEMA is coordinating with the emergency operations center working closely with the Ohio Emergency Management Agency,” the government representative said. They pointed out that East Palestine needs much more expansive help than what FEMA can provide because the “situation is different.”\n\n“The state needed help testing the water and air – EPA is providing it. They called for an investigation into the derailment – the Department of Transportation is on it. The governor today asked for help to conduct additional public health testing and assessments – we’re deploying teams from HHS and the CDC to get that done,” the said administration official told Fox News Digital.\n\nChemicals.news has more about the Ohio train derailment and chemical spill.\n\nWatch litigation expert Eric Coppolino explain below why the Ohio chemical spill could be deadlier than the 1986 Chernobyl disaster in Ukraine.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nNorfolk Southern trying to BUY OFF East Palestine residents for just $1,000 to silence them forever, and block all future cancer lawsuits resulting from vinyl chloride train catastrophe.\n\nEPA warns about DIOXINS released from chlorinated compounds such as polyvinyl chloride (PVC) or “backyard burning” of household trash.\n\nHere’s why dioxins are the most toxic chemical class known to man.", "opengraph": {"title": "EPA chief downplays Ohio chemical spill, says he’ll allow his kids to drink and bathe in East Palestine’s water", "type": "article", "url": "https://www.ecology.news/2023-02-24-epa-chief-regan-downplays-ohio-chemical-spill.html", "site_name": "Ecology News", "description": "Michael Regan, the administrator of the Environmental Protection Agency (EPA), remarked that he would allow his own children to drink and bathe in the public water at East Palestine, Ohio – where a chemical-loaded train derailed and spilled its lethal cargo. The EPA head made his remark with a caveat – he will only permit […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/02/Pollution-Water-Oil-Chemicals-Toxic-Waste.jpg"}, "tags": ["conspiracy", "hazmats", "chemical spill", "deception", "disaster", "clean water", "ohio", "toxins", "chemicals", "panic", "chaos", "poison", "Cover-Up", "environment", "toxic chemicals", "controlled burn", "train derailment", "Dangerous", "Mike DeWine", "derailment", "East Palestine", "Ecology", "Toxic", "clean air"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/cover-up-epic-proportions-happening-east-palestine-ohio/5809209", "https://www.naturalnews.com/2023-02-16-government-media-downplay-ohio-derailment-chemical-spill.html", "https://www.dailymail.co.uk/news/article-11763429/EPA-boss-says-allow-children-drink-bathe-East-Palestine-water.html", "https://www.foxnews.com/politics/white-house-explains-why-turned-down-disaster-relief-ohio", "http://chemicals.news/", "https://www.brighteon.com/cbca517a-db4a-433a-8a8c-3dc5af9962fa", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.naturalnews.com/2023-02-22-norfolk-southern-buying-off-east-palestine-1000.html", "https://www.chemicals.news/2023-02-22-east-palestine-headaches-anger-burning-skin-train.html", "https://www.disaster.news/2023-02-22-epa-dioxins-chlorinated-pvc-backyard-trash-toxic.html", "https://www.poison.news/2023-02-22-dioxins-most-toxic-chemical-class.html", "https://www.globalresearch.ca/cover-up-epic-proportions-happening-east-palestine-ohio/5809209", "https://www.dailymail.co.uk/news/article-11763429/EPA-boss-says-allow-children-drink-bathe-East-Palestine-water.html", "https://www.foxnews.com/politics/white-house-explains-why-turned-down-disaster-relief-ohio", "https://www.brighteon.com/cbca517a-db4a-433a-8a8c-3dc5af9962fa", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-02-24-epa-chief-regan-downplays-ohio-chemical-spill.html&linkname=EPA%20chief%20downplays%20Ohio%20chemical%20spill%2C%20says%20he%E2%80%99ll%20allow%20his%20kids%20to%20drink%20and%20bathe%20in%20East%20Palestine%E2%80%99s%20water", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}