{"result_id": "103011", "URL": "https://ecology.news/2023-03-06-glyphosate-based-weedkillers-linked-disease-disorders-kids.html", "timestamp": "2023-04-25 15:01:08 CEST+0200", "meta": {"description": "Children exposed to glyphosate-containing weedkillers, used in farming and on school playgrounds, appear to be at increased risk for liver inflammation and metabolic disorders in young adulthood and more serious diseases later in life, according to a study published Wednesday in the journal Environmental Health Perspectives. (Article by Carey Gillam republished from TheNewLede.org) Children exposed […]", "lang": "en", "keywords": "agrichemicals,badhealth,badmedicine,badpollution,chemicals,children's health,deception,disease causes,endocrine disorders,environment,food supply,glyphosate,glyphosate herbicide,liver disease,Monsato's Roundup,pesticides,research,toxins", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-03-06-glyphosate-based-weedkillers-linked-disease-disorders-kids.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Researchers link glyphosate-based weedkillers to liver disease and endocrine disorders in kids", "cleaned_text": "Researchers link glyphosate-based weedkillers to liver disease and endocrine disorders in kids\n\nChildren exposed to glyphosate-containing weedkillers, used in farming and on school playgrounds, appear to be at increased risk for liver inflammation and metabolic disorders in young adulthood and more serious diseases later in life, according to a study published Wednesday in the journal Environmental Health Perspectives.\n\nChildren exposed to a weedkiller commonly used in farming, as well as on residential yards and school playgrounds, appear to be at increased risk for liver inflammation and metabolic disorders in young adulthood and more serious diseases later in life, according to a study published Wednesday in the journal Environmental Health Perspectives.\n\nThe paper was authored by 12 California scientists and health researchers — most from the University of California, Berkeley School of Public Health — and is the latest of many studies linking glyphosate herbicide to human health problems.\n\nGlyphosate is better known as the active ingredient in Monsanto’s Roundup products as well as scores of other weedkilling brands sold around the world.\n\nThe chemical is considered the most widely used herbicide in history, and residues are commonly present in food and water, as well as in human urine. The chemical is so pervasive that government researchers have documented it in rainfall.\n\nMonsanto and Bayer AG, which bought Monsanto in 2018, maintain that Roundup and other glyphosate-based herbicides are safe when used as directed, and say the weight of scientific evidence demonstrates that safety.\n\nBut more than 100,000 people in the U.S. have alleged exposure to the weedkiller caused them to develop non-Hodgkin lymphoma. Many independent scientific studies have linked glyphosate to cancers as well as liver disease, endocrine disruption and other health problems.\n\nIn the new study, researchers tracked 480 “mother-and-child duos” who live in the Salinas Valley of California, a key agricultural area, analyzing levels of glyphosate weed killer used in the area and levels of the weedkiller present in the urine of the mothers while they were pregnant and in the children as they grew.\n\nThey also took into account levels of a degradation product of glyphosate known as Aminomethylphosphonic acid, or AMPA, in the urine of the study subjects. The researchers then assessed the liver and metabolic health of the children at the age of 18.\n\nThey concluded that higher levels of glyphosate residue and AMPA in urine in childhood and adolescence were associated with higher risk of liver inflammation and metabolic disorders in young adulthood.\n\nIn addition, they found that agricultural use of glyphosate near participants’ homes from birth and up through age five was associated with metabolic disorders at age 18.\n\nMetabolic disorders in youth can lead to heart disease, stroke, type 2 diabetes and liver disease later in life.\n\nThe children could have been exposed to glyphosate through a variety of routes, including their proximity to areas where glyphosate is used and also through consumption of cereal, snacks and other foods that commonly contain glyphosate residues.\n\n“There really is a paucity of data about what we know about glyphosate in children and young adults,” said Brenda Eskenazi, director of the UC Berkeley School of Public Health’s Center for Environmental Research and Community Health (CERCH).\n\n“We really need to figure out what’s going on here and how the most vulnerable populations may be affected. Until we have more research, the precautionary principle would say we shouldn’t be using it unnecessarily.”\n\nThe California study notes that the prevalence of childhood obesity and metabolic syndrome has increased “at an alarming rate” in the U.S., particularly among populations of color.\n\nAnd while diet and physical activity may be factors, “some hypothesize that exposure to synthetic chemicals may also be involved,” the study states. The authors also noted that glyphosate use in the U.S. has similarly risen markedly in the last few decades.\n\n“Although previous research on glyphosate in humans has largely focused on its potential carcinogenicity, this study indicates the need for further investigation of its association with metabolic and liver outcomes,” the study concludes.\n\nFunding for the work was provided, in part, by the National Institutes of Health and the National Institutes of Environmental Health Sciences.\n\nThe study utilized biological samples collected by the Center for the Health Assessment of Mothers and Children of Salinas (CHAMACOS), a longitudinal birth cohort investigation on the health effects of pesticides and other environmental exposures among children in a farmworker community.\n\nCHAMACOS researchers provided more than 20 years of exposure data and health records along with the urine samples.\n\nThe findings are particularly troubling because the levels of glyphosate measured in the urine of study subjects is within the range reported separately for the general U.S. population, according to Ana Maria Mora, a co-author of the study and a CERCH investigator.\n\nLast year, a unit of the Centers for Disease Control and Prevention (CDC) reported that more than 80% of urine samples drawn from children and adults in a U.S. health study contained detectable traces of glyphosate.\n\nClose to 300 million pounds of glyphosate are used annually by U.S. farmers on their fields. The weedkiller is routinely sprayed directly over growing genetically engineered crops such as corn and soybeans, and also over non-genetically engineered crops such as wheat and oats as a desiccant to dry crops out prior to harvest.\n\nMany farmers also use it before the growing season, including spinach growers and almond producers.\n\nThe safety of glyphosate has been subject to international scientific and regulatory debate for years. In 2015, the International Agency for Research on Cancer classified glyphosate as a probable human carcinogen.\n\nMany regulators, including the U.S. Environmental Protection Agency (EPA), consider glyphosate as not likely to be carcinogenic, but critics say regulatory reviews are deeply flawed and highly influenced by the chemical industry.\n\nLast year, a U.S. federal appeals court vacated the EPA’s safety finding, saying the agency ignored important studies and ordering the EPA to give further consideration to evidence of glyphosate risks.\n\nMany countries have sought to ban glyphosate, but threats of trade sanctions and other industry pushback have thwarted those efforts in countries such as Thailand.\n\nThe U.S. has been pressuring Mexico to drop plans to ban glyphosate but Mexican leaders say they are phasing out glyphosate by March 2024.", "opengraph": {"title": "Researchers link glyphosate-based weedkillers to liver disease and endocrine disorders in kids", "type": "article", "url": "https://www.ecology.news/2023-03-06-glyphosate-based-weedkillers-linked-disease-disorders-kids.html", "site_name": "Ecology News", "description": "Children exposed to glyphosate-containing weedkillers, used in farming and on school playgrounds, appear to be at increased risk for liver inflammation and metabolic disorders in young adulthood and more serious diseases later in life, according to a study published Wednesday in the journal Environmental Health Perspectives. (Article by Carey Gillam republished from TheNewLede.org) Children exposed […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/03/Garden-Fertilizer-Pesticide-Herbicide-Insecticide-Sprayer-Tree.jpg"}, "tags": ["agrichemicals", "liver disease", "glyphosate", "research", "Monsato's Roundup", "deception", "endocrine disorders", "disease causes", "glyphosate herbicide", "environment", "food supply", "toxins", "children's health", "chemicals"], "tweets": [], "movies": [], "links": ["https://www.thenewlede.org/2023/03/california-researchers-link-popular-weedkiller-to-health-problems-in-young-adults/", "https://ehp.niehs.nih.gov/doi/full/10.1289/EHP11721", "https://childrenshealthdefense.org/defender/glyphosate-dna-damage-cancer-oxidative-stress-cg/", "https://childrenshealthdefense.org/defender/monsanto-glyphosate-roundup-poison-playbook-rtk/", "https://pubs.er.usgs.gov/publication/70046159", "https://childrenshealthdefense.org/defender/monsanto-trial-roundup-weedkiller-cancer/", "https://health.ucsd.edu/news/releases/pages/2019-05-14-herbicide-linked-to-human-liver-disease.aspx", "https://www.health.state.mn.us/communities/environment/risk/docs/guidance/gw/ampainfo.pdf", "https://cerch.berkeley.edu/home", "https://cerch.berkeley.edu/research-programs/chamacos-study", "https://www.theguardian.com/us-news/2022/jul/09/weedkiller-glyphosate-cdc-study-urine-samples", "https://usrtk.org/pesticides/not-just-for-corn-and-soy-a-look-at-glyphosate-use-in-food-crops/", "https://childrenshealthdefense.org/defender/countries-waive-safety-regulations-gene-edited-corn/", "https://childrenshealthdefense.org/defender/genetically-engineered-soybean-oil-cola/", "https://www.thenewlede.org/wp-content/uploads/2022/06/9th-circuit-on-glyphosate.pdf", "https://usrtk.org/pesticides/thailands-reversal-on-glyphosate-ban/", "https://childrenshealthdefense.org/defender/united-states-mexico-gmo-corn-cd/", "https://cen.acs.org/food/agriculture/Mexico-revises-plan-phase-glyphosate/101/web/2023/02", "https://www.thenewlede.org/2023/03/california-researchers-link-popular-weedkiller-to-health-problems-in-young-adults/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-03-06-glyphosate-based-weedkillers-linked-disease-disorders-kids.html&linkname=Researchers%20link%20glyphosate-based%20weedkillers%20to%20liver%20disease%20and%20endocrine%20disorders%20in%20kids", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}