{"result_id": "103017", "URL": "https://ecology.news/2023-01-25-mit-scientist-warns-glyphosate-most-destructive-chemical.html", "timestamp": "2023-04-25 15:01:12 CEST+0200", "meta": {"description": "When you take an honest look around you – at the foods you eat, the hygiene products you use, and even the items in your home – you’ll find a startling amount of toxic chemicals. Even those who make an effort to use clean products wherever possible often admit that no matter how hard we […]", "lang": "en", "keywords": "agriculture,autism,badfood,badhealth,cancer causes,chemical violence,crops,disease causes,environment,food supply,glyphosate,gut health,Organic,poisons,Roundup,stop eating poison,toxic chemicals,toxins", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-01-25-mit-scientist-warns-glyphosate-most-destructive-chemical.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "MIT scientist warns that glyphosate is our environment’s most destructive chemical", "cleaned_text": "MIT scientist warns that glyphosate is our environment’s most destructive chemical\n\nWhen you take an honest look around you – at the foods you eat, the hygiene products you use, and even the items in your home – you’ll find a startling amount of toxic chemicals. Even those who make an effort to use clean products wherever possible often admit that no matter how hard we try, we just can’t seem to avoid every potential toxin in our daily lives. However, if there is one that more people should be actively trying to avoid, it’s glyphosate. There is no question that this cancer-causing chemical is bad news, but the worst part about it is the fact that we are essentially drowning in it.\n\nMIT scientist Stephanie Seneff, PhD, has long been warning about the dangers of glyphosate, which is currently the world’s most widely used herbicide. It can be found pretty much everywhere, from our food supply to our waterways and animal life. It has been routinely used for aerial spraying in the form of Monsanto’s Roundup, which has enabled it to make its way everywhere.\n\nDr. Seneff, who has spent more than four decades as a researcher and has published more than 200 peer-reviewed scientific articles, warned that “glyphosate is far more toxic than we’ve been led to believe. There has not been nearly enough research, and we’ve become very complacent in letting the population be the guinea pigs.”\n\nIts pervasiveness means that it’s in a lot of places where you might not expect to find it. For example, Dr. Seneff cites the fact that ill children are fed through tubes contaminated with this cancer-causing chemical in hospitals.\n\n“I find it astonishing that babies and children with cancer are being provided with nutrients through feeding tubes contaminated with glyphosate. It should be obvious to medical professionals that it is essential to ensure that as few toxic chemicals as possible are present in enteral nutrition provided to seriously ill children. This is a direct delivery system for glyphosate to the blood and to the tissues,” she cautioned, adding that certified organic sources should be used in these cases.\n\nWhy is glyphosate so dangerous?\n\nAfter years of studying rises in chronic illnesses in modern society, Dr. Seneff has found a direct correlation between the growing use of glyphosate and the increasing number of sick people. One particular problem is the way in which glyphosate blocks our body’s ability to absorb nutrients from the foods that we eat. This means that even those who make an effort to eat the recommended amount of fruits and vegetables may not be getting the nutritional value out of them that they expect if they are not choosing organic varieties because the herbicides these foods are sprayed with block their absorption.\n\nShe has also drawn attention to the link between glyphosate and autism, pointing out that when the rise of autism over the years is plotted on a curve, it matches perfectly with the increase in glyphosate usage over time. She says that this and other effects of the toxin are due to its impact on gut microbes. This also explains its role in the increase in allergies. For example, the critical gut microbe known as Lactobacillus that enables us to digest milk depends on manganese, which glyphosate can chelate and make unavailable. This can make certain people sick when they consume milk, and it’s an especially big problem in infants.\n\nIn short, glyphosate kills the important bacteria in our gut microbiomes that are needed for producing neurotransmitters, proteins and other essentials, allowing pathogenic bacteria to grow unchecked and make us sick. There’s also the fact that it is a known carcinogen and has been the subject of numerous successful lawsuits filed by individuals who have developed cancer following exposure to the chemical.\n\nAlthough glyphosate is pervasive in our environment and we cannot avoid it entirely, we can certainly reduce our exposure by eating certified organic whole foods and avoiding areas where glyphosate is sprayed on crops as well as consuming processed foods. Eating fermented foods may help, and people can ask establishments in their local communities with greenery — such as city parks, golf clubs and school districts — to stop using Roundup and other toxins.", "opengraph": {"title": "MIT scientist warns that glyphosate is our environment’s most destructive chemical", "type": "article", "url": "https://www.ecology.news/2023-01-25-mit-scientist-warns-glyphosate-most-destructive-chemical.html", "site_name": "Ecology News", "description": "When you take an honest look around you – at the foods you eat, the hygiene products you use, and even the items in your home – you’ll find a startling amount of toxic chemicals. Even those who make an effort to use clean products wherever possible often admit that no matter how hard we […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/01/Editorial-Use-RoundUp-Herbicide.jpg"}, "tags": ["autism", "crops", "glyphosate", "Organic", "Roundup", "disease causes", "poisons", "environment", "food supply", "gut health", "chemical violence", "toxic chemicals", "toxins", "agriculture", "stop eating poison"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/the-legal-poison-in-our-foods-dr-stephanie-seneff-on-what-glyphosate-does-and-how-to-avoid-it_4673781.html", "https://cancercriminals.com/", "https://www.naturalhealth365.com/cancer-causing-glyphosate-is-the-most-destructive-chemical-in-our-environment-mit-scientist-warns.html", "https://glyphosate.news/", "https://www.naturalhealth365.com/cancer-causing-glyphosate-is-the-most-destructive-chemical-in-our-environment-mit-scientist-warns.html", "https://www.theepochtimes.com/health/the-legal-poison-in-our-foods-dr-stephanie-seneff-on-what-glyphosate-does-and-how-to-avoid-it_4673781.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-01-25-mit-scientist-warns-glyphosate-most-destructive-chemical.html&linkname=MIT%20scientist%20warns%20that%20glyphosate%20is%20our%20environment%E2%80%99s%20most%20destructive%20chemical", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}