{"result_id": "103032", "URL": "https://ecology.news/2021-12-14-insanity-phoenix-zoo-vaccinates-animals-covid.html", "timestamp": "2023-04-25 15:01:22 CEST+0200", "meta": {"description": "Seventy-five animals at the Phoenix Zoo in Arizona have been given the Wuhan coronavirus (COVID-19) vaccines – all of them are on the endangered species list. Veterinarians working for the zoo claim the animals are susceptible to the coronavirus, which is why they need the experimental and dangerous vaccines. “Animal health and human health are closely […]", "lang": "en", "keywords": "animals,badhealth,badmedicine,badscience,coronavirus,coronavirus vaccine,covid-19,Ecology,Endangered species,infections,insanity,lunatics,medical extremism,medical fascism,outbreak,Phoenix Zoo,propaganda,stupid,Zoetis", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2021-12-14-insanity-phoenix-zoo-vaccinates-animals-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "INSANITY: Phoenix Zoo vaccinates 75 ANIMALS for COVID-19 – all of them endangered species", "cleaned_text": "INSANITY: Phoenix Zoo vaccinates 75 ANIMALS for COVID-19 – all of them endangered species\n\nSeventy-five animals at the Phoenix Zoo in Arizona have been given the Wuhan coronavirus (COVID-19) vaccines – all of them are on the endangered species list. Veterinarians working for the zoo claim the animals are susceptible to the coronavirus, which is why they need the experimental and dangerous vaccines.\n\n“Animal health and human health are closely connected,” claimed Dr. Gary West, a veterinarian and Phoenix Zoo’s vice president for animal health and living collections. “We started seeing increasingly concerning reports from other zoos where the large cats, tigers, lions, snow leopards were acquiring the infections from their human caretakers.”\n\nBecause of this, Phoenix Zoo authorities decided to choose 75 animals who will get the vaccine. These included Sumatran tigers, bobcats, jaguars, African lions, orangutans, emperor tamarins, Egyptian fruit bats, three-banded armadillos and Linne’s two-toed sloths. (Related: MIND-BLOWING: Oakland and Denver zoos giving COVID-19 spike protein vaccines to animals – including bears, gorillas, tigers and mountain lions.)\n\nThe tigers, bobcats, jaguars and lions were vaccinated from a distance using darts that contained the shots. They are expected to receive a second dose – which will serve as booster doses – soon. “They take it way better than people do,” said West. “They don’t like it, but they bounce right back and go back to their lives.”\n\n“So far, we really haven’t seen anything significant. Maybe some mild lethargy in a couple of our primates but really, nothing major,” he added, talking about the vaccine’s immediate side effects on the animals. “In addition to guest-facing measures deployed, we have been taking precautions during the pandemic behind-the-scenes to keep our animals safe.”\n\nSome of these precautionary measures include zoo staffers keeping their distance from the animals and wearing protective equipment. West said zookeepers have to wear masks and gloves whenever they come close to animals. Places in the zoo that allow visitors to get a little closer to the animals are currently still closed.\n\nWest claimed that knowing the animals in Phoenix Zoo are vaccinated is helping him feel relieved.\n\n“We can offer another layer of protection for these animals [with the vaccine]. You know, zoos are some of the last places you’re going to see [some of these animals], and some of the last places these animals are going to be saved in,” said West.\n\n“We have some very rare animals, such as Sumatran tigers and Bornean orangutans and if there’s things we can do to offer additional protection from the disease then we’re going to look at those opportunities.”\n\nThe COVID-19 vaccines being used at the Phoenix Zoo were developed specifically for animals by Zoetis, a global animal health company based in New Jersey. Zoetis donated 160 doses of its COVID-19 vaccines to the zoo.\n\n“We put together a list of species that we wanted to vaccinate twice and submitted that twice and we were able to [get the] vaccine for all those animals,” said West.\n\nAs part of the mass vaccination program, Phoenix Zoo veterinarians are obligated to send monthly reports to Zoetis detailing any adverse effects related to the vaccinations.\n\nThe Zoetis vaccine received its emergency use authorization for use on endangered species from the Department of Agriculture early this year. Since then, COVID-19 vaccines have been administered to animals in dozens of many zoos across the United States.\n\nThe first vaccines were given to nine great apes at the San Diego Zoo. They were the first non-humans in America to receive a COVID-19 vaccine.\n\nSince the beginning of the year, multiple zoos across the country have grappled with COVID-19 outbreaks among their animals, no doubt caused by coming into close contact with their fully vaccinated handlers. This has led to the deaths of endangered animals, including three snow leopards that recently died at the Lincoln Children’s Zoo in Nebraska.\n\nIt will only be a matter of time until more reports start coming out regarding vaccinated zoo animals experiencing sudden health complications due to the experimental and dangerous COVID-19 vaccines.\n\nLearn more about how dangerous COVID-19 vaccines are at Vaccines.news.", "opengraph": {"title": "INSANITY: Phoenix Zoo vaccinates 75 ANIMALS for COVID-19 – all of them endangered species", "type": "article", "url": "https://www.ecology.news/2021-12-14-insanity-phoenix-zoo-vaccinates-animals-covid.html", "site_name": "Ecology News", "description": "Seventy-five animals at the Phoenix Zoo in Arizona have been given the Wuhan coronavirus (COVID-19) vaccines – all of them are on the endangered species list. Veterinarians working for the zoo claim the animals are susceptible to the coronavirus, which is why they need the experimental and dangerous vaccines. “Animal health and human health are closely […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2021/12/Tiger-Nature-Animal.jpg"}, "tags": ["Phoenix Zoo", "covid-19", "medical fascism", "stupid", "Zoetis", "outbreak", "lunatics", "coronavirus vaccine", "infections", "animals", "Ecology", "medical extremism", "coronavirus", "insanity", "Endangered species", "propaganda"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/sciencetech/article-10297241/Phoenix-Zoo-gives-special-COVID-vaccines-75-animals-including-orangutans-fruit-bats-big-cats.html", "https://ktar.com/story/4801611/phoenix-zoo-giving-out-covid-19-vaccines-to-susceptible-animals/", "https://naturalnews.com/2021-07-13-oakland-denver-zoos-giving-vaccines-to-animals.html", "http://insanity.news", "https://www.azfamily.com/news/phoenix-zoo-animals-vaccinated-against-covid-19/article_46873392-590c-11ec-999a-afc79b2acbd5.html?block_id=688096", "https://www.ctvnews.ca/health/coronavirus/phoenix-zoo-vaccinates-susceptible-animals-against-covid-19-1.5702555", "https://vaccines.news/", "https://www.dailymail.co.uk/sciencetech/article-10297241/Phoenix-Zoo-gives-special-COVID-vaccines-75-animals-including-orangutans-fruit-bats-big-cats.html", "https://ktar.com/story/4801611/phoenix-zoo-giving-out-covid-19-vaccines-to-susceptible-animals/", "https://www.azfamily.com/news/phoenix-zoo-animals-vaccinated-against-covid-19/article_46873392-590c-11ec-999a-afc79b2acbd5.html?block_id=688096", "https://www.ctvnews.ca/health/coronavirus/phoenix-zoo-vaccinates-susceptible-animals-against-covid-19-1.5702555"], "authors": [], "publish_date": null}