{"result_id": "103029", "URL": "https://www.ecology.news/2019-05-15-microplastics-weaken-mussels-may-affect-biodiversity-aquaculture.html", "timestamp": "2023-04-25 15:01:20 CEST+0200", "meta": {"description": "Increasing numbers of microplastics are found inside mussels and other shellfish during recent years. Now, a U.K. study warns that exposure to these tiny plastics makes it more difficult for blue mussels (Mytilus edulis) to get a grip on a surface, much less hang on to its surroundings while getting pounded by the surf or tugged at […]", "lang": "en", "keywords": "animals,aquaculture,badpollution,biodegradable plastics,biodiversity,blue mussels,Ecology,environment,marine ecosystems,microplastics,Mussels,plastic pollution,seafood,wildlife", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ecology.news/2019-05-15-microplastics-weaken-mussels-may-affect-biodiversity-aquaculture.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ecology.news", "title": "Exposure to microplastics weakens the grip of mussels, which may affect biodiversity and reduce aquaculture yields", "cleaned_text": "Exposure to microplastics weakens the grip of mussels, which may affect biodiversity and reduce aquaculture yields\n\nIncreasing numbers of microplastics are found inside mussels and other shellfish during recent years. Now, a U.K. study warns that exposure to these tiny plastics makes it more difficult for blue mussels (Mytilus edulis) to get a grip on a surface, much less hang on to its surroundings while getting pounded by the surf or tugged at by the tides.\n\nMussels form an important part of ocean ecosystems and a billion-dollar slice of the global seafood industry pie. Factors that decrease their chances of surviving and thriving in their natural environment will have considerable repercussions on nature and humans alike.\n\nDr. Dannielle Green of Anglia Ruskin University served as the lead author of the study’s paper. She oversaw the research at the Portaferry Marine Laboratory in Northern Ireland, U.K.\n\nIn the 52-day-long trial, Green and her team exposed blue mussels to different amounts of tiny pieces of non-biodegradable plastics. They said that microplastic-contaminated mussels produced greatly decreased numbers of byssal threads. Their published findings can be found in the science journal Environmental Pollution.\n\nMicroplastic contamination makes it easier to dislodge mussels from their homes\n\nByssal threads are slender organic fibers that serve as anchor lines for a mussel. They help the shellfish attach itself to a surface and keep the mussel secure in areas with powerful waves and tides.\n\nFurthermore, if there are plenty of mussels present, their combined byssal threads can form large reefs over the years. These underwater structures serve as homes for marine animals and plants. But if mussels produce fewer byssal threads, the reefs will take much longer to form, be smaller than normal, or may never appear.\n\nThe Anglia Ruskin researchers also took a look at the average tenacity of microplastic-contaminated shellfish. They based their calculations on the maximal vertical force needed to pry a mussel from its location. The results of their tests showed that the tenacity of contaminated mussels are 50 percent lower than those of healthy counterparts that have never been exposed to microplastics.\n\nThe last part of their experiment evaluated the possible effects of microplastic contamination on the well-being of the mussels. A series of tests on samples of the shellfish’s hemolymph – a circulatory fluid that works in more or less the same way as blood – revealed that microplastics trigger a powerful immune response, an indicator of their toxic properties. In addition, the metabolic processes of the mussel were also disrupted by the microplastics.\n\n“Tenacity is vital for mussels to form and maintain reefs without being dislodged by hydrodynamic forces,” Green explained. “Our study showed that the presence of non-biodegradable microplastics reduced the number of byssal threads produced by the mussels, which likely accounts for the 50% reduction in their attachment strength.”\n\nThe importance of byssal threads go beyond keeping mussels from getting carried away by wave and tidal action. They serve as the building materials for reef habitats, make fertilization more likely to succeed during spawning seasons, and protect the mussels from predators.\n\nMicroplastics are shown to reduce the number of byssal threads produced by wild mussels. They can cause a domino effect on biodiversity and aquaculture.\n\nFurthermore, biodegradable plastics are also capable of harming mussels. These supposedly eco-friendlier plastics can also be broken down into microplastics, which can be ingested by the shellfish.\n\nIn order to protect mussels and other marine organisms, Green recommends decreasing the amount of plastics. Recycling is one way to cut back on plastic pollution, but cutting back on the production and use of plastic products are even better.", "opengraph": {"title": "Exposure to microplastics weakens the grip of mussels, which may affect biodiversity and reduce aquaculture yields", "type": "article", "url": "https://www.ecology.news/2019-05-15-microplastics-weaken-mussels-may-affect-biodiversity-aquaculture.html", "site_name": "Ecology News", "description": "Increasing numbers of microplastics are found inside mussels and other shellfish during recent years. Now, a U.K. study warns that exposure to these tiny plastics makes it more difficult for blue mussels (Mytilus edulis) to get a grip on a surface, much less hang on to its surroundings while getting pounded by the surf or tugged at […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/05/mussels-1.jpg"}, "tags": ["Mussels", "biodiversity", "blue mussels", "seafood", "animals", "biodegradable plastics", "Ecology", "environment", "microplastics", "wildlife", "aquaculture", "marine ecosystems"], "tweets": [], "movies": [], "links": ["https://www.sciencedaily.com/releases/2019/01/190129101901.htm", "https://www.anglia.ac.uk/", "https://www.naturalnews.com/2017-10-12-ocean-pollution-threatens-food-supply-british-mussles-found-to-be-full-of-microplastics.html", "https://www.sciencedirect.com/science/article/pii/S0269749118338314?via%3Dihub", "https://ecology.news/2019-03-12-microplastics-are-invading-our-farm-lands.html", "https://environ.news/2019-04-23-follow-these-tips-to-reduce-plastic-pollution.html", "http://pollution.news/", "https://www.sciencedaily.com/releases/2019/01/190129101901.htm", "https://www.sciencedirect.com/science/article/pii/S0269749118338314?via%3Dihub", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2019-05-15-microplastics-weaken-mussels-may-affect-biodiversity-aquaculture.html&linkname=Exposure%20to%20microplastics%20weakens%20the%20grip%20of%20mussels%2C%20which%20may%20affect%20biodiversity%20and%20reduce%20aquaculture%20yields", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}