{"result_id": "103028", "URL": "https://www.ecology.news/2023-01-15-government-approves-vaccine-honeybees-chemicals-pollinators.html", "timestamp": "2023-04-25 15:01:20 CEST+0200", "meta": {"description": "The United States Department of Agriculture (USDA) just approved a conditional license for the world’s first “vaccine” for honeybees. The claim is that this new vaccine will help to fight the diseases that routinely ravage bee colonies, which are vital to food production. (Related: Honeybees have been under attack for many years by farmers who […]", "lang": "en", "keywords": "badfood,badhealth,badmedicine,badscience,Big Pharma,chemical violence,chemicals,Dalan Animal Health,Ecology,government,honeybee,poison,pollinators,USDA,vaccine,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ecology.news/2023-01-15-government-approves-vaccine-honeybees-chemicals-pollinators.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ecology.news", "title": "U.S. government approves world’s first “vaccine” for honeybees – as if there aren’t already enough chemicals destroying our precious pollinators", "cleaned_text": "U.S. government approves world’s first “vaccine” for honeybees – as if there aren’t already enough chemicals destroying our precious pollinators\n\nThe United States Department of Agriculture (USDA) just approved a conditional license for the world’s first “vaccine” for honeybees.\n\nThe claim is that this new vaccine will help to fight the diseases that routinely ravage bee colonies, which are vital to food production. (Related: Honeybees have been under attack for many years by farmers who spray death-causing Roundup [glyphosate] herbicide on their crops – is there a vaccine for that?)\n\nDalan Animal Health, a U.S.-based biotechnology company, will manufacture the vaccine for commercial beekeepers, providing them with “a breakthrough in protecting honeybees,” according to company CEO Annette Kleiser.\n\n“We are ready to change how we care for insects, impacting food production on a global scale,” Kleiser stated ominously.\n\nOne of the diseases that the new honeybee vaccine purportedly fights is foulbrood, a disease carried by the bacterium Paenibacillus larvae. Roughly one-quarter of all U.S. hives are infected with foulbrood, which is said to have no cure.\n\n“It’s something that beekeepers can easily recognize because it reduces the larvae to this brown goo that has a rancid stink to it,” said Keith Delaplane, an entomologist at the University of Georgia who helped Dalan develop the vaccine.\n\nStop spraying the environment with deadly pesticide and herbicide chemicals and bees will stop getting sick and dying\n\nSince jabbing bees with needles is unrealistic, Dalan came up with a formulation that can be injected straight into the royal jelly that worker bees feed to the queen. After ingestion, the vaccine transfers into the bees’ ovaries where it is then passed on to her offspring.\n\n“In a perfect scenario, the queens could be fed a cocktail within a queen candy – the soft, pasty sugar that queen bees eat while in transit,” Delaplane explained. “Queen breeders could advertise ‘fully vaccinated queens.'”\n\nAmerican foulbrood originated in the U.S., which could be due to the country’s obsession with crop chemicals. It might just be that the disease is a direct result of bees getting sick from all this chemical exposure, for which the USDA is now planning to “treat” them with even more chemicals in the form of this new “vaccine.”\n\nThe Guardian admits that today’s honeybees “have been exposed to a cocktail of different diseases,” as they are calling them. These “diseases,” in many cases, are just the toxic fallout from persistent pesticide and herbicide exposure while bees are roaming out in the wild.\n\nGreed is largely behind all this as the commercialization of food necessitates chemical-intensive agricultural practices to maximize yields while minimizing costs. The end result is a sick and dying pollinator ecosystem that we are told now requires vaccination.\n\nOnce again, the corporate-controlled media is deflecting from the root of the problem by blaming bee sickness on the “climate crisis,” which is laughable in light of the obscene volumes of chemicals that are sprayed on crops every year – chemicals that destroy the environment and potentially alter climate conditions in the process.\n\n“I certainly would like to have bees in our future for years to come,” wrote a commenter, lamenting the progressive loss of our precious pollinators. “I sure would miss the food source they provide.”\n\nAs for Colony Collapse Disorder (CCD), another “disease” afflicting American honeybees, someone else in the comments noted that all the electromagnetic pollution swirling around us from 5G towers, high-voltage power lines, and other modern technologies are a major factor causing that phenomenon.\n\nIt is said that honeybees are “in alarming decline,” but the establishment refuses to tell the truth as to why. Instead, our leaders continue to funnel more easy profits into the coffers of Big Pharma, which always has the “solutions.”\n\nTo learn more about the importance of honeybees, butterflies, and other pollinators for biodiversity, visit Bees.news.", "opengraph": {"title": "U.S. government approves world’s first “vaccine” for honeybees – as if there aren’t already enough chemicals destroying our precious pollinators", "type": "article", "url": "https://www.ecology.news/2023-01-15-government-approves-vaccine-honeybees-chemicals-pollinators.html", "site_name": "Ecology News", "description": "The United States Department of Agriculture (USDA) just approved a conditional license for the world’s first “vaccine” for honeybees. The claim is that this new vaccine will help to fight the diseases that routinely ravage bee colonies, which are vital to food production. (Related: Honeybees have been under attack for many years by farmers who […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/01/Bee-Pollenate-Flower.jpg"}, "tags": ["government", "Big Pharma", "poison", "vaccine", "pollinators", "Ecology", "vaccines", "honeybee", "chemical violence", "chemicals", "Dalan Animal Health", "USDA"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https%3A%2F%2Fwww.theguardian.com%2Fenvironment%2F2023%2Fjan%2F04%2Fhoneybee-vaccine-first-approved", "https://naturalnews.com/046769_Roundup_honeybees_colony_collapse_disorder.html", "https://www.uga.edu/", "http://bees.news", "https://12ft.io/proxy?q=https%3A%2F%2Fwww.theguardian.com%2Fenvironment%2F2023%2Fjan%2F04%2Fhoneybee-vaccine-first-approved", "https://naturalnews.com/046769_Roundup_honeybees_colony_collapse_disorder.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-01-15-government-approves-vaccine-honeybees-chemicals-pollinators.html&linkname=U.S.%20government%20approves%20world%E2%80%99s%20first%20%E2%80%9Cvaccine%E2%80%9D%20for%20honeybees%20%E2%80%93%20as%20if%20there%20aren%E2%80%99t%20already%20enough%20chemicals%20destroying%20our%20precious%20pollinators", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}