{"result_id": "103026", "URL": "https://ecology.news/2023-02-22-east-palestine-myid-surveillance-biometrics-train-derailment.html", "timestamp": "2023-04-25 15:01:18 CEST+0200", "meta": {"description": "Exactly one week before a Norfolk Southern freight train carrying noxious, cancer-causing chemicals derailed and subsequently exploded in a “controlled release,” residents of East Palestine, Ohio, were told to sign up for a MyID tracking device from the local fire department. An announcement from the East Palestine Fire Department explained that MyID provides “an easy […]", "lang": "en", "keywords": "badhealth,badpollution,biometrics,cancer causes,conspiracy,deception,deep state,derailment,East Palestine,emergency service,false-flag,MyID,ohio,privacy watch,surveillance,toxic chemicals,Train,Unexplained", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-02-22-east-palestine-myid-surveillance-biometrics-train-derailment.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "East Palestine launched “MyID” emergency service to surveil locals’ biometrics data just one week before train derailment", "cleaned_text": "East Palestine launched “MyID” emergency service to surveil locals’ biometrics data just one week before train derailment\n\nExactly one week before a Norfolk Southern freight train carrying noxious, cancer-causing chemicals derailed and subsequently exploded in a “controlled release,” residents of East Palestine, Ohio, were told to sign up for a MyID tracking device from the local fire department.\n\nAn announcement from the East Palestine Fire Department explained that MyID provides “an easy method to provide valuable medical information to first responders in the event of an emergency.”\n\n“Roll out [sic] is scheduled to begin in November, 2022,” it further reads. “The base service will be free to residents of East Palestine as an added service of the Fire Department.”\n\nBob Moore, a local 70-year-old farmer and longtime East Palestine resident, told the independent media that he ignored local news reports prior to the disaster urging residents like himself to sign up for MyID, allowing them to receive a biometric tracking device capable of relaying updates to first responders about their health conditions amid an emergency or “major disaster” not unlike the one that occurred in real life a week later.\n\nThe timing of the MyID rollout, Moore explained, is nothing short of suspicious – almost like the whole thing was planned as a false flag event.\n\n“It was exactly a week before the derailment happened,” Moore explained. “The people were asked to go to the local fire department in downtown East Palestine to get that MyID.”\n\n“They began monitoring your physical activity, your heart rate, your respiration, anything you might be exposed to. I see this as the kind of sensor you would put on an astronaut or on an athlete that you wanted to track to see how he’d react to stress or being winded, or in this instance chemical exposure. It’s a monitoring device.”\n\nWas East Palestine a “test town” for the release of biometric tracking bracelets?\n\nOn January 26, WKBN, a local Ohio news affiliate, announced that East Palestine would begin making “an important medical device available to all 4,700 residents” starting on January 29, just five days before the derailment.\n\n“The MyID program is ready to roll out in East Palestine. It’s a medical information system that helps first responders provide care,” WKBN reported – watch the news report below.\n\n“MyID provides wearable devices or key FOBs that have QR codes. Emergency responders use a camera phone to access important medical information.”\n\nThe announcement upset Moore, who said it reminded him of the Wuhan coronavirus (Covid-19) “vaccine” rollout under Operation Warp Speed.\n\n“I completely ignored it,” Moore said about the announcement.\n\n“But the way the media played it up – it was like East Palestine was a test town that they volunteered to be part of, that they were chosen and were going to implement it right after Jan. 23. I do find it odd. I find it a coincidence that we are having coincidences pile up around here.”\n\nMoore further speculated about the rise in disasters at food factories and egg farms on top of the train explosion and MyID rollout. He believes the biometric bracelets are possibly a way for the government to track people in the midst of a major disaster.\n\n“The fact that the program exists indicates that somebody somewhere knows something and wants to get data,” he said.\n\n“Every piece of data that the government collects, that DARPA, large corporations, and multinational corporations collect, can always be turned against the citizen. Everything is vulnerable to weaponization and the most sacred thing in any weaponizing is data.”\n\nThe latest news about the East Palestine incident can be found at Disaster.news.", "opengraph": {"title": "East Palestine launched “MyID” emergency service to surveil locals’ biometrics data just one week before train derailment", "type": "article", "url": "https://www.ecology.news/2023-02-22-east-palestine-myid-surveillance-biometrics-train-derailment.html", "site_name": "Ecology News", "description": "Exactly one week before a Norfolk Southern freight train carrying noxious, cancer-causing chemicals derailed and subsequently exploded in a “controlled release,” residents of East Palestine, Ohio, were told to sign up for a MyID tracking device from the local fire department. An announcement from the East Palestine Fire Department explained that MyID provides “an easy […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/02/surveillance-street-icons.jpg"}, "tags": ["conspiracy", "false-flag", "biometrics", "derailment", "East Palestine", "deep state", "deception", "Unexplained", "privacy watch", "emergency service", "ohio", "surveillance", "toxic chemicals", "Train", "MyID"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/FUnBJijCbTo\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/FUnBJijCbTo"}], "links": ["https://www.thegatewaypundit.com/2023/02/local-farmer-sounds-the-alarm-why-did-east-palestine-launch-myid-emergency-service-to-surveil-biometrics-1-week-before-ohio-train-derailment/", "https://www.naturalnews.com/2023-02-20-company-hired-norfolk-southern-toxicology-train-farce.html", "http://disaster.news", "https://www.thegatewaypundit.com/2023/02/local-farmer-sounds-the-alarm-why-did-east-palestine-launch-myid-emergency-service-to-surveil-biometrics-1-week-before-ohio-train-derailment/", "https://www.naturalnews.com/2023-02-20-company-hired-norfolk-southern-toxicology-train-farce.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-02-22-east-palestine-myid-surveillance-biometrics-train-derailment.html&linkname=East%20Palestine%20launched%20%E2%80%9CMyID%E2%80%9D%20emergency%20service%20to%20surveil%20locals%E2%80%99%20biometrics%20data%20just%20one%20week%20before%20train%20derailment", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}