{"result_id": "103036", "URL": "https://ecology.news/2019-06-16-how-mussels-deal-with-microplastic-pollution.html", "timestamp": "2023-04-25 15:01:26 CEST+0200", "meta": {"description": "Mussels often end up getting contaminated by the vast amount of microplastics that pollute the oceans. A new study showed that the animals successfully expel most of the tiny plastic fibers from their bodies. Microplastics are present in every part of the world’s oceans, even remote areas that are thousands of miles away from the nearest human presence. They are […]", "lang": "en", "keywords": "animals,badpollution,contaminated mussels,Ecology,ecosystems,environ,environment,goodpollution,goodscience,marine animals,marine ecosystem,marine life,microplastic pollution,microplastics,Mussels,ocean pollution,plastic fibers,plastics,wildlife", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2019-06-16-how-mussels-deal-with-microplastic-pollution.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Study reveals how mussels deal with microplastic pollution", "cleaned_text": "Mussels often end up getting contaminated by the vast amount of microplastics that pollute the oceans. A new study showed that the animals successfully expel most of the tiny plastic fibers from their bodies.\n\nMicroplastics are present in every part of the world’s oceans, even remote areas that are thousands of miles away from the nearest human presence. They are believed to affect the environment and marine life in many ways, ranging from housing colonies of microorganisms to disrupting the movement of energy and nutrients through entire ecosystems.\n\nFibers are the most numerous type of microplastics. They are shed in large numbers by carpets, fleece clothing, and other everyday plastic products. The fibers are also small enough to be consumed by zooplankton and other tiny marine lifeforms.\n\nMussels suck in water from their surroundings and filter the liquid for plankton and other food. This pattern makes them very vulnerable to ingesting microplastic fibers.\n\nThe non-profit institute Bigelow Laboratory for Ocean Sciences supported a study on how mussels deal with plastic fibers. The information would help them map the movement of microplastics through the food web, where plastics affect both the animals that directly swallow them and other animals higher up on the food chain that feed on the former. (Related: Exposure to microplastics weakens the grip of mussels, which may affect biodiversity and reduce aquaculture yields.)\n\nMussels can get rid of most microplastic fibers that enter their bodies\n\n“We know that microfibers can be consumed by shellfish, but at what rate and how long they are retained by the animals remains unclear,” explained Bigelow researcher David Fields. “The degree to which plastic is impacting the food chain is unknown, but as more plastic make its way into the ocean, the number of organisms containing plastics is sure to increase.”\n\nThey discovered that the mussels quickly cover many of the plastic fibers in mucus and then purge the irritants. The process allows the clams to get rid of most of the microplastics while also avoiding bringing the threads into their body.\n\nDespite the efficiency of the protective process, the mollusks still end up ingesting about 10 percent of the fibers, which build up inside their organs and tissues. After the researchers transferred the mussels to containers with clean water, they were able to get rid of most of the accumulated fibers.\n\n“Our work with microplastic fibers emphasizes the need for laboratory studies that accurately mimic an organism’s natural environment,” explained Shaw Institute researcher Madelyn Woods, the primary author of the paper. “Detailed studies of individual species and their mechanisms for particle selection will be important for understanding how microplastics affect ecosystems on a larger scale.”\n\nAdvances in technologies and techniques make it easier to study microplastic pollution\n\nIn their tests, Woods and her Bigelow counterparts put live mussels into water samples that contained microplastic fibers at levels found in the ocean. Their methodology contrasted with earlier studies that did not attempt to replicate pollution levels in the real world.\n\nAfter letting time pass, the researchers counted the number of plastic particles inside the mollusks. Previously, they resorted to labor-intensive methods of counting fibers. But the task of the Bigelow team became more manageable due to their access to a FlowCam.\n\nDeveloped by other Bigelow researchers, the FlowCam is an optical instrument that can count the microplastic fibers with greater ease. It promises to speed up future studies with microplastic fibers.\n\nThe researchers noted that the vastness of the ocean prevents microplastics from concentrating in an area. However, that also conceals the totality of their effect on the environment, which merits additional extensive research.\n\nRead Microplastics.news for more coverage of the microplastics pollution problem.", "opengraph": {"title": "Study reveals how mussels deal with microplastic pollution", "type": "article", "url": "https://www.ecology.news/2019-06-16-how-mussels-deal-with-microplastic-pollution.html", "site_name": "Ecology News", "description": "Mussels often end up getting contaminated by the vast amount of microplastics that pollute the oceans. A new study showed that the animals successfully expel most of the tiny plastic fibers from their bodies. Microplastics are present in every part of the world’s oceans, even remote areas that are thousands of miles away from the nearest human presence. They are […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/05/mussels-5.jpg"}, "tags": ["Mussels", "marine life", "ecosystems", "marine ecosystem", "environ", "animals", "Ecology", "contaminated mussels", "environment", "marine animals", "microplastics", "wildlife", "plastic fibers", "plastics"], "tweets": [], "movies": [], "links": ["https://waldo.villagesoup.com/p/study-shows-how-mussels-handle-microplastic-fiber-pollution/1793841", "https://www.newstarget.com/2018-10-30-new-type-of-fabric-will-eventually-compete-with-cotton.html", "https://www.bigelow.org/", "https://www.naturalnews.com/2019-05-15-microplastics-weaken-mussels-may-affect-biodiversity-aquaculture.html", "https://www.sciencedirect.com/science/article/pii/S0025326X18307732?via%3Dihub", "https://www.shawinstitute.org/", "https://ecology.news/2019-03-12-microplastics-are-invading-our-farm-lands.html", "https://environ.news/", "http://Microplastics.news", "https://waldo.villagesoup.com/p/study-shows-how-mussels-handle-microplastic-fiber-pollution/1793841", "https://www.sciencedirect.com/science/article/pii/S0025326X18307732?via%3Dihub", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2019-06-16-how-mussels-deal-with-microplastic-pollution.html&linkname=Study%20reveals%20how%20mussels%20deal%20with%20microplastic%20pollution", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}