{"result_id": "103008", "URL": "https://ecology.news/2021-11-12-study-reveals-covid-related-plastics-pollute-oceans.html", "timestamp": "2023-04-25 15:01:06 CEST+0200", "meta": {"description": "A recent study published in the journal PNAS calculated for the first time how much waste in the form of single-use personal protective equipment (PPE) ended up in the oceans since the Wuhan coronavirus (COVID-19) pandemic began in 2020. “The Covid-19 pandemic has led to an increased demand for single-use plastics that intensifies pressure on an already out-of-control […]", "lang": "en", "keywords": "badpollution,coronavirus,covid-19,discoveries,Ecology,environment,face masks,garbage,masks,medical waste,microplastics,ocean health,pandemic,plastic pollution,PPE", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2021-11-12-study-reveals-covid-related-plastics-pollute-oceans.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "COVID-related plastics pollute the world’s oceans, study reveals", "cleaned_text": "A recent study published in the journal PNAS calculated for the first time how much waste in the form of single-use personal protective equipment (PPE) ended up in the oceans since the Wuhan coronavirus (COVID-19) pandemic began in 2020.\n\n“The Covid-19 pandemic has led to an increased demand for single-use plastics that intensifies pressure on an already out-of-control global plastic waste problem,” study co-authors Yiming Peng and Peipei Wu from Nanjing University said. “The released plastics can be transported over long distances in the ocean, encounter marine wildlife, and potentially lead to injury or even death.”\n\nThe Nanjing University and University of California San Diego (UC San Diego)-led research team looked at the amount of waste generated between the beginning of the pandemic in 2020 and August 2021. The researchers found that 193 countries generated over 9.3 million tons of COVID-specific plastic wastes, 28,550 tons of which ended up in the world’s oceans. These numbers were based on a model that calculated how the pandemic could impact the amount of plastic released into the ocean and where it would go from there.\n\nStudy co-author Yanxu Zhang said in a press release that the model simulates how the seawater moves when driven by wind and how the plastics float on the surface of the ocean, degraded by sunlight and fouled by the plankton, land on beaches or sink to the deep. “It can be used to answer ‘what if’ questions, for example, what will happen if we add a certain amount of plastics to the ocean?” (Related: Face masks are adding to plastic pollution, and its effects are seen across Asia.)\n\nThe researchers found that within three to four years, a large portion of the pollution will end up either on beaches or the seabed, while a smaller amount will reach the open ocean, where it will eventually end up in gyres or a plastic accumulation zone in the Arctic.\n\nThe study also looked at the main sources of the waste regionally: 46 percent came from Asia, 24 percent from Europe and 22 percent from the Americas.\n\nIncreased demand for single-use plastics highlights need for better collection systems\n\nInterestingly, the researchers found that the bulk of the waste did not come from individual use of PPE, which only accounted for 7.6 percent of the total. Instead, the bulk of the waste – 87.4 percent – came from hospitals.\n\nStudy co-author, Amina Schartup from UC San Diego’s Scripps Institution of Oceanography, said they were surprised to find that the amount of medical waste was substantially larger from hospitals than from individuals and that a lot was coming from Asian countries.\n\n“The biggest sources of excess waste were hospitals in areas already struggling with waste management before the pandemic. They just weren’t set up to handle a situation where you have more waste,” she said.\n\nThe study highlighted the increased demand for single-use plastic, which intensified the pressure of this already severe problem. However, the findings highlight further the hotspot rivers and watersheds that require special attention when it comes to waste management.\n\n“We find a long-lasting impact of the pandemic-associated waste release in the global ocean. At the end of this century, the model suggests that almost all the pandemic-associated plastics end up in either the seabed (28.8%) or beaches (70.5%),” the researchers said.\n\nThe need for better systems for collecting, treating and disposing of medical plastic waste in developing countries is particularly important to ensure that it is being kept out of rivers. An overall need to limit the use of single-use plastics is necessary, while an increase in the use of sustainable alternatives should be applied where possible.\n\nRead more about how COVID-19 is affecting the world at Pandemic.news.", "opengraph": {"title": "COVID-related plastics pollute the world’s oceans, study reveals", "type": "article", "url": "https://www.ecology.news/2021-11-12-study-reveals-covid-related-plastics-pollute-oceans.html", "site_name": "Ecology News", "description": "A recent study published in the journal PNAS calculated for the first time how much waste in the form of single-use personal protective equipment (PPE) ended up in the oceans since the Wuhan coronavirus (COVID-19) pandemic began in 2020. “The Covid-19 pandemic has led to an increased demand for single-use plastics that intensifies pressure on an already out-of-control […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/05/Hazmat-Suit-Clean-Ppe-Hazard-Radiation-Respirator.jpg"}, "tags": ["pandemic", "covid-19", "masks", "ocean health", "garbage", "Ecology", "environment", "microplastics", "coronavirus", "PPE", "face masks", "discoveries", "medical waste"], "tweets": [], "movies": [], "links": ["https://www.ecowatch.com/plastic-waste-covid-oceans-2655526771.html#toggle-gdpr", "https://www.nju.edu.cn/en/", "https://www.nju.edu.cn/en/main.psp", "https://ucsd.edu/", "https://www.naturalnews.com/2021-09-13-face-masks-adding-plastic-pollution-across-asia.html", "https://www.livescience.com/plastic-pandemic-waste-clogs-oceans", "https://www.theguardian.com/environment/2021/nov/08/about-26000-tonnes-of-plastic-covid-waste-pollutes-worlds-oceans-study", "https://www.theguardian.com/environment/2021/nov/08/about-26000-tonnes-of-plastic-covid-waste-pollutes-worlds-oceans-study", "https://www.ecowatch.com/plastic-waste-covid-oceans-2655526771.html#toggle-gdpr", "https://www.livescience.com/plastic-pandemic-waste-clogs-oceans", "https://www.theguardian.com/environment/2021/nov/08/about-26000-tonnes-of-plastic-covid-waste-pollutes-worlds-oceans-study", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2021-11-12-study-reveals-covid-related-plastics-pollute-oceans.html&linkname=COVID-related%20plastics%20pollute%20the%20world%E2%80%99s%20oceans%2C%20study%20reveals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}