{"result_id": "103009", "URL": "https://ecology.news/2020-10-02-endangered-reptiles-sold-online-extinction.html", "timestamp": "2023-04-25 15:01:07 CEST+0200", "meta": {"description": "For decades, nothing has brought species closer to the brink of extinction like poaching and illegal trade. In a major breakthrough, a trio of ecologists found that people can purchase about 4,000 reptile species online, including the endangered speckled tortoise and the Seychelles tiger chameleon. The researchers came about this finding after scouring the web for […]", "lang": "en", "keywords": "animals,badscience,biodiversity,conservation,Ecology,endangered,Endangered species,environment,extinction,reptiles,wildlife", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2020-10-02-endangered-reptiles-sold-online-extinction.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Endangered reptile species being sold as pets could be in danger of extinction, warn scientists", "cleaned_text": "Endangered reptile species being sold as pets could be in danger of extinction, warn scientists\n\nFor decades, nothing has brought species closer to the brink of extinction like poaching and illegal trade. In a major breakthrough, a trio of ecologists found that people can purchase about 4,000 reptile species online, including the endangered speckled tortoise and the Seychelles tiger chameleon.\n\nThe researchers came about this finding after scouring the web for information on the online reptile trade from 2000–2019. In total, 79 percent of all reptile species up for sale are not subject to regulations under the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES). This global agreement aims to prevent the over-exploitation of plants and animals.\n\nHowever, as the online reptile trade has grown, even species under the protection of CITES have been removed from their habitats and sold worldwide as pets.\n\nReptiles are often traded for one of two reasons. In the name of fashion, thousands of skins of crocodiles, snakes and lizards are shipped worldwide to make boots, belts and purses. This kind of trade happens on a commercial scale and is what CITES monitors, for the most part, when it comes to reptiles.\n\nBut much less documented is the smaller scale trade of reptiles as pets. In fact, the trio had to scour some 24,000 web pages and two international trade databases to get a clear picture of the reptile pet trade.\n\nIt turns out that the market is booming, with some of the largest consumer markets located in Europe and the US.\n\nThis high demand for reptiles as pets could be attributed to their perceived low-maintenance nature. But as with most exotic pets, people who purchase reptiles are often ill-prepared for their needs. Being cold-blooded animals, for instance, reptiles require correct levels of heat and light, as well as an appropriate diet that mimics their diet in the wild.\n\nHowever, most of the reptiles that animal rescue groups take in are often found outside, left to fend for themselves in the cold. This is the case with the Royal Society for the Prevention of Cruelty to Animals (RSPCA), a UK-based animal rescue organization.\n\nWithout a doubt, people are still purchasing far more dogs and cats than lizards and snakes. But numbers alone are not the problem with the online reptile trade. Unlike dogs and cats, most of the reptiles put up for sale as pets are not bred. Instead, the animals are “harvested” from their natural habitats.\n\nThis form of sourcing disturbs reptile populations in the wild, which could then trigger a chain of adverse outcomes. Populations of bent-toed geckos, for instance, are now under threat from illegal trade online. The dwindling numbers are concerning, especially since scientists have not learned much about this species.\n\nIndonesia’s spotted gecko is another popular reptile species sold online. Most of them come from the wild because of their cheap market value, with conservationist groups fearing over-exploitation.\n\nWhile the sale of one reptile here and there might not seem like a problem, the thousands of individual reptile sales taking place worldwide are bound to add up. This could result in entire reptile populations being threatened with extinction, even those not considered endangered in the first place.\n\nMore needs to be done on top of educating prospective customers about the source of their would-be companions, as well as the animals’ needs. To expand protection for the thousands of reptile species up for sale, the researchers suggest implementing regulations that would require a seller to prove that a prospective trade is sustainable before being allowed to proceed.\n\nWhile still insufficient, this measure could be an important first step in curbing the illegal trade of reptiles online. (Related: Modern destruction of animal populations rivals extinction of dinosaurs, scientists warn.)\n\nRead more articles on protecting endangered species at Environ.news.", "opengraph": {"title": "Endangered reptile species being sold as pets could be in danger of extinction, warn scientists", "type": "article", "url": "https://www.ecology.news/2020-10-02-endangered-reptiles-sold-online-extinction.html", "site_name": "Ecology News", "description": "For decades, nothing has brought species closer to the brink of extinction like poaching and illegal trade. In a major breakthrough, a trio of ecologists found that people can purchase about 4,000 reptile species online, including the endangered speckled tortoise and the Seychelles tiger chameleon. The researchers came about this finding after scouring the web for […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2020/10/Lizard-Reptile-Animal.jpg"}, "tags": ["biodiversity", "conservation", "Endangered species", "animals", "Ecology", "environment", "extinction", "wildlife", "reptiles", "endangered"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/sciencetech/article-8784937/Pets-Thousands-exotic-reptiles-sold-online-die-year.html", "https://awionline.org/awi-quarterly/2011-fall/skins-suffering-fashion-trend-falls-hard-reptiles", "https://www.naturalnews.com/048019_mass_extinction_animal_populations_marine_life.html", "https://environ.news", "https://www.dailymail.co.uk/sciencetech/article-8784937/Pets-Thousands-exotic-reptiles-sold-online-die-year.html", "https://awionline.org/awi-quarterly/2011-fall/skins-suffering-fashion-trend-falls-hard-reptiles"], "authors": [], "publish_date": null}