{"result_id": "103020", "URL": "https://ecology.news/2021-11-09-climate-alarmism-tool-global-elites-wield-control-lives.html", "timestamp": "2023-04-25 15:01:13 CEST+0200", "meta": {"description": "It was a Friday in the late spring of 2016, and I was scrambling to figure out what I was going to teach my students during first period. I was in the heart of coaching through a rugby season, and exams were fast approaching — needless to say I was a busy teacher/coach. My first […]", "lang": "en", "keywords": "big government,Climate,climate alarmism,climate change,climate control,climate lockdown,conspiracy,COVID,deception,disinfo,environment,fake science,globalist elites,hoax,lies,pandemic,propaganda,science fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2021-11-09-climate-alarmism-tool-global-elites-wield-control-lives.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Like COVID-19, climate alarmism is a tool global elites wield to control our lives", "cleaned_text": "Like COVID-19, climate alarmism is a tool global elites wield to control our lives\n\nIt was a Friday in the late spring of 2016, and I was scrambling to figure out what I was going to teach my students during first period. I was in the heart of coaching through a rugby season, and exams were fast approaching — needless to say I was a busy teacher/coach. My first period class was a geography class, and I could tell that my students were visibly sluggish, and the advent of warm and sunny weather — something that always seems miraculous in Canada — beckoned their attention toward the window.\n\nAs an experienced teacher, I decided to cut my losses and give the students a bit of a day off. I reached inside the cabinet that housed department-approved DVDs and found Al Gore’s famous Inconvenient Truth. I admit, I was not as wise to the nonsense surrounding global warming hysteria at the time, and in all honesty, I had never seen the movie. I sat at my desk and began to mark papers and prepare assignments for the next week — the students were enthralled in the film.\n\nIt was an admittedly well-produced film, and Al Gore made an engaging presentation. However, there were moments in the film which sincerely piqued my curiosity. There were a lot claims that just didn’t “sit right,” especially predictions that were supposed to come true within a few short years. Here I sat a decade after the film was released, and things weren’t adding up.\n\nI always had my suspicions about global warming — or is it climate change? — and this encouraged me to really look into the topic. It was not hard to find a wealth of knowledge that debunked virtually every claim of all the climate change prophets, who were not just wrong, but were often really wrong. One example: In 2008, Al Gore said that by 2013 it was likely that the Arctic would have no ice in the summer … That clearly did not come true.\n\nWhen you look into the litany of predictions about catastrophes related to climate and weather, you find that the predictions are all over the map, and there is no consistency. For example, in the 1970s it was all about “global cooling.” One major newspaper ran an article that predicted a “new Ice Age” by the year 2000. I should add that this is just one of many claims by mainstream outlets of a coming Ice Age, and the predicted years differed by decades depending on which “experts” were consulted.\n\nBy the 1980s the switch had (mostly) flipped to the narrative of global warming, including alarmist claims about whole island nations being underwater. The Maldives, for example, were supposed to be under the sea by 2018. In case you were wondering, the Maldives are still open for business … although you might need a vaccine passport to travel there.\n\nIn the 1990s I was an elementary school student worried about the ozone layer disappearing, and we were told to lather up with untold amounts of sunscreen lest we burst into flames under a beating sun that did not send its rays through a protective atmospheric layer anymore. The holes in the ozone layer seem to have gone away for the most part … even though the population has grown worldwide, and fossil fuel emissions are still a thing.\n\nWe haven’t even touched on the fact that New York was predicted to be underwater by 2019, or the acid rain that would kill all the life in lakes, or peak oil by 2000, 2010, and 2020, etc.\n\nNone of this is to say that pollution is good, or we should pour toxic sludge into lakes and ponds, or that we should be wasteful. But climate scientists — and popular representations of their claims — are often extremely wrong, and are wrong more often than not.\n\nWhy is this?\n\nWhat the Canadian psychologist was trying to express is that there is a massive amount of complexity when considering the “entire climate,” “which is everything.” It is impossible to reasonably consider every aspect of all things that pertain to temperatures, and ecosystems, and weather, and pollution, and emissions, and population growth, and so on. There are just too many things to consider. Even if it could be proven that man was causing global warming; or climate change; or global cooling; or whatever, it would not be obvious that we could really do anything about it – save for exterminating the human race, which some climate alarmists wouldn’t be opposed to.\n\nI would add to Peterson’s sentiment that the issue of the climate is too big to pin down and suggest that the issue of COVID — and all that is associated with the litany of failed government interventions — is of the same ilk. The audacious claim that a government or governments could control a virus is as absurd as the idea that they could control the entire natural world.\n\nInherent in the quest for climate control has been the propensity for “experts” on the climate scene to present models for what the “disasters” they believe will come to pass if things do not change — which in reality means if governments do not force people to do what they say. Esteemed PhDs with a long list of credentials from major institutions (or screaming adolescents like Greta Thunberg) tell the world at a major international gathering of the “who’s who” that we are headed for a veritable hell on earth if we don’t all stop driving cars, or eating meat, or having children. Clips from these conferences are played on newscasts around the world, and within weeks, all major institutions fall in line and propagandize the population to love their paper straws with all their hearts.\n\nAs an aside, if plastic straws are so bad for the climate … then why couldn’t we just drink out of a cup, like all of human civilization has done since the dawn of man? Perhaps I am not fully enlightened as to why it is paper straws that will save the polar bears, but I digress.\n\nThis model of “modeling” coming disasters by credentialed experts is exactly what we have seen regarding COVID. Just like with climate models, virtually all of the COVID models have been inaccurate to a high degree, or even completely wrong. This goes largely unnoticed among those who believe CNN isn’t a farcical news network.\n\nYou see, the COVID modelers and the climate modelers ensure that they have “get out of jail free cards” built into their fallacious models. Their models always show the “worst case” that will befall humanity if governments don’t “do something,” and there is always a collection of outcomes that can only be proven in a hypothetical future scenario that depends on a host of factors that may or may not happen. As a result, if the worst case does not come true, then they can simply point to government intervention and say, “Just like I said, if governor so-and-so hadn’t given a tax rebate for electric cars, our state would have been underwater.” With COVID, they can say, “Just like I told you, if you didn’t all stand an arbitrary six feet apart, then everyone would have died in two weeks.” There is of course no way to completely disprove their claims, because they made claims about outcomes that never existed.\n\nCOVID and climate modelers are like Las Vegas casinos that rig the game against the gambler; they are in total control and there is no way to prove any dishonesty, because you are playing by their rules.\n\nNow, not everyone falls for the COVID or climate narrative, and places like Florida, South Dakota, and Sweden exist to buck the trend. But the problem is that the nebulous nature of modeling and the hypothetical framework that the modelers use allow them to continue to claim the intellectual high ground even if they are widely proven to be wrong. If Florida does not lock down, and the citizens do not all die, this is not evidence that the COVID models were wrong, but it is instead evidence that they should have locked down because fewer people would have died.\n\nAgain, it is a rigged game, and they can always claim to be right, because they operate in a world of fantasy and whimsy that does not require reality as a contributing factor.\n\nIf you need more proof that the same mentality encompasses climate and COVID science, then look no further than the proposed “climate lockdowns.” The expert class and the multinational oligarchs had so much fun locking you down and closing your churches and business that they are now proposing we need to prohibit “non-essential” travel and basically anything that causes emissions in order to avoid a “climate disaster.”\n\nOne major multinational non-profit organization published an article in October called Avoiding a Climate Lockdown. It begins, “As COVID-19 spread earlier this year, governments introduced lockdowns in order to prevent a public-health emergency from spinning out of control. In the near future, the world may need to resort to lockdowns again — this time to tackle a climate emergency.”\n\nAnother lockdown, but this time for the climate! I must say, I am a bit disappointed in how unoriginal the elites and the left have become, you would think they might be a bit more creative.\n\nThe notion of a climate lockdown is peak pseudoscientific nonsense. Just like the COVID modelers have done for the past 20 months to slow the spread, the climate worshippers predict a coming climate catastrophe that will destroy the human race, which can only be stopped by another lockdown.\n\nIf they lock us down, and the world does not disappear, then they will claim victory. And if we are not locked down, they can manipulate any piece of climate evidence they want which they deem the result of human activity and say, “Look! We told you! You didn’t lock down and now there are less pigeons in New York City, this will lead to super hurricanes in six months if we do not lock down now!”\n\nThere is no way to “win” against these sorts of zealots if you play their game at all. Just as we have seen with COVID, if you subject the population to any measures at all, then you leave the door open for further measures. The only places that have thrived are those who rejected the narrative from the outset, or places that courageously lifted every single measure at some point. Places like Alberta, England, or Australia have had periods of opening, but they have left everything up to “metrics” that dictate whether or not citizens maintain basic freedoms.\n\nNo, you cannot participate, you must reject the whole scenario, or you will find yourself in a perpetual cycle of lockdowns, and the same will be true for any imposed climate lockdowns. Any politician who tries to “reasonably” lockdown for climate purposes will be explaining away human rights abuses and scientific blunders for at least 2 years after the first lockdown. The climate crowd is bloodthirsty for control of your life, and they are largely the same people as the COVIDian crowd that has lorded over you for almost two years. They will never stop abusing your rights and freedoms if you do not simply say “no!”\n\nIf you are concerned for the environment — which is fine — do not advocate for any massive government intervention in the realm of climate. Instead, focus on the things you can control, like reducing your own carbon footprint, or engaging with likeminded people who want to do what you want. Just like with COVID, wherever the government has taken complete control, there has been no discernable difference in disease — in some cases the government made the virus situation worse — and for everyone the best course of action has been to take their own health into their own hands.\n\nAs alarming as this whole climate lockdown business seems, there is a silver lining: The elites will have nothing else to go after when they have finally pushed for total climate control. When their attempted total-domination of the skies and seas shows itself to be a failure, they will be seen as the complete and utter fools that we know them to be.", "opengraph": {"title": "Like COVID-19, climate alarmism is a tool global elites wield to control our lives", "type": "article", "url": "https://www.ecology.news/2021-11-09-climate-alarmism-tool-global-elites-wield-control-lives.html", "site_name": "Ecology News", "description": "It was a Friday in the late spring of 2016, and I was scrambling to figure out what I was going to teach my students during first period. I was in the heart of coaching through a rugby season, and exams were fast approaching — needless to say I was a busy teacher/coach. My first […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2021/11/climate-change-attorney-general-1.png"}, "tags": ["pandemic", "conspiracy", "climate lockdown", "big government", "Climate", "climate change", "hoax", "COVID", "deception", "environment", "climate control", "disinfo", "lies", "propaganda", "globalist elites", "science fraud"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/blogs/like-covid-19-climate-alarmism-is-a-tool-global-elites-wield-to-control-our-lives/", "https://dailycaller.com/2015/07/08/the-arctic-still-isnt-ice-free-despite-alarmism/", "https://www.newspapers.com/newspage/435402308/", "https://trove.nla.gov.au/newspaper/article/102074798", "https://www.nasa.gov/feature/goddard/2019/2019-ozone-hole-is-the-smallest-on-record-since-its-discovery/", "https://web.archive.org/web/20110202162233/https:/www.salon.com/books/int/2001/10/23/weather/", "https://www.aei.org/uncategorized/50-years-of-failed-doomsday-eco-pocalyptic-predictions-the-so-called-experts-are-0-50/", "https://www.wbcsd.org/Overview/Panorama/Articles/Avoiding-a-climate-lockdown", "https://www.lifesitenews.com/blogs/like-covid-19-climate-alarmism-is-a-tool-global-elites-wield-to-control-our-lives/"], "authors": [], "publish_date": null}