{"result_id": "103022", "URL": "https://ecology.news/2023-01-11-chinese-researchers-study-mosquitoes-administer-vaccines.html", "timestamp": "2023-04-25 15:01:16 CEST+0200", "meta": {"description": "Soon it will no longer be necessary to make an appointment to get vaccinated as Big Pharma’s latest endeavor involves using insects – in this case mosquitoes – to administer shots to people out in the wild without their knowledge or consent. Researchers out of China are reportedly celebrating their newfound ability to deliver what […]", "lang": "en", "keywords": "badhealth,badmedicine,badpollution,badscience,biological weapons,bioterrorism,China,conspiracy,Dangerous Medicine,Ecology,environment,GMO,health freedom,infections,Medical Tyranny,mosquito,research,vaccine wars,vaccines,Zika", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-01-11-chinese-researchers-study-mosquitoes-administer-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Chinese researchers celebrate study using mosquitoes to administer “vaccines”", "cleaned_text": "Soon it will no longer be necessary to make an appointment to get vaccinated as Big Pharma’s latest endeavor involves using insects – in this case mosquitoes – to administer shots to people out in the wild without their knowledge or consent.\n\nResearchers out of China are reportedly celebrating their newfound ability to deliver what Chinese state-owned media outlet South China Morning Post (SCMP) describes as “re-engineered vaccines for animals.”\n\nPublished in the peer-reviewed journal Nature Communications, a study about the new technology claims it can help to eradicate viral diseases like Zika that spread through mosquitoes and other creatures to potentially endangered wildlife.\n\n“Our study provides a future avenue for developing a mosquito-delivered vaccine to eliminate zoonotic viruses,” said Prof. Zheng Aihau, the study’s lead author from the Institute of Zoology’s State Key Laboratory of Integrated Management of Pest Insects and Rodents at the Chinese Academy of Sciences.\n\nAihau and his team claim that loading up mosquitoes with vaccines will help scientists to more easily vaccinate “hard-to-access wildlife hosts” while also protecting endangered species from viral diseases. (Related: Remember back in 2012 when the Florida Keys Mosquito Control District sought federal and state approval to release GMO mosquitoes throughout Key West?)\n\nWill humans also be “vaccinated” by these new GMO mosquitoes?\n\nThe mosquitoes themselves are genetically modified (GMO) to contain the vaccines, which Aihau and his colleagues say in tests produced a strong, long-lasting immune response.\n\n“Once immunised, the animals resisted infections, thus helping to prevent the early spread of many viruses, including the once widespread Zika virus (ZIKV),” the SCMP reported.\n\nAedes mosquitoes are the primary transmitters of Zika, which belongs to the flavivirus genus. People who become infected with it can develop symptoms ranging from rashes and fever to joint and muscle pain.\n\nIf a pregnant woman becomes infected with Zika while carrying, her infant can be born with microcephaly, which is an abnormally small head or cranial capacity, or some other congenital malformation. Zika infection can also lead to premature birth or miscarriage.\n\nZika is said to have been really bad in 2015, having reached a peak of around 1.3 million cases in Brazil that year before declining globally after 2017. Many tropical African and Asian countries are still plagued by it, though – at least that is what we are being told as an excuse for the creation of these new GMO mosquitoes.\n\nWhen it comes to GMO technologies, we are routinely told that tampering with the plant and animal kingdoms at the genetic level is necessary in order to stop disease. These new GMO mosquitoes are no exception, with the alleged threat of Zika necessitating the unleashing of genetically engineered, vaccine-delivering insects into the wild.\n\nZheng says the inspiration for his latest research comes from the 2009 discovery of the Chaoyang virus (CYV), which also belongs in the flavivirus genus, in Chaoyang City, located in China’s Liaoning province. An earlier paper about that discovery claims that CYV is capable of replicating in mosquitoes but not in vertebrates, which include humans.\n\nFor Zheng’s study, he and his team of researchers used CYV as a vaccine vector to develop a chimeric vaccine containing various proteins from a different virus. Several proteins from CYV were artificially inserted into ZIKV cells to create a CYV-ZIKV virus that is supposedly not infectious, but that replicates easily in mosquitoes and is released via their saliva.\n\nMosquitoes fed the CYV-ZIKV chimera virus were essentially transformed into vaccine carriers. And these carriers, once unleashed, have the ability to inject their targets – including humans – with what researchers say is a vaccine against the chimera virus with a simple bite.\n\nVaccines are dangerous and often deadly, regardless of whether they come out of medical syringes or wild insects. To learn more, visit Vaccines.news.", "opengraph": {"title": "Chinese researchers celebrate study using mosquitoes to administer “vaccines”", "type": "article", "url": "https://www.ecology.news/2023-01-11-chinese-researchers-study-mosquitoes-administer-vaccines.html", "site_name": "Ecology News", "description": "Soon it will no longer be necessary to make an appointment to get vaccinated as Big Pharma’s latest endeavor involves using insects – in this case mosquitoes – to administer shots to people out in the wild without their knowledge or consent. Researchers out of China are reportedly celebrating their newfound ability to deliver what […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/01/Mosquito-Human-Hand-Sucking-Blood.jpg"}, "tags": ["conspiracy", "vaccine wars", "bioterrorism", "research", "infections", "Ecology", "China", "environment", "Medical Tyranny", "vaccines", "GMO", "Zika", "mosquito", "health freedom", "biological weapons"], "tweets": [], "movies": [], "links": ["https://www.scmp.com/news/china/science/article/3205463/bite-club-chinese-researchers-buzzing-over-study-mosquito-vaccinators", "https://naturalnews.com/034943_genetically_modified_mosquitoes_Florida_disease.html", "http://vaccines.news", "https://www.scmp.com/news/china/science/article/3205463/bite-club-chinese-researchers-buzzing-over-study-mosquito-vaccinators", "https://naturalnews.com/034943_genetically_modified_mosquitoes_Florida_disease.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-01-11-chinese-researchers-study-mosquitoes-administer-vaccines.html&linkname=Chinese%20researchers%20celebrate%20study%20using%20mosquitoes%20to%20administer%20%E2%80%9Cvaccines%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}