{"result_id": "103001", "URL": "https://ecology.news/2023-01-26-glyphosate-is-spreading-further-into-the-ecosystem.html", "timestamp": "2023-04-25 15:01:00 CEST+0200", "meta": {"description": "Glyphosate, the infamous carcinogen in Round Up, has become pervasive in the ecosystem, destroying the integrity of the food supply and contributing to immunosuppression in humans. This chemical is still the most frequently used weed killer in the EU, despite its links to immunosuppression and cancer. Glyphosate and its main metabolite, aminomethylphosphonic acid, (AMPA) have […]", "lang": "en", "keywords": "badpollution,Bee Pollen,biotech industry,desiccant,ecosystem,environment,environmental health,food collapse,food supply,glyphosate,herbicide,honeybee populations,microbiome,monopoly,poison,pollen,Round Up,scarcity,shikimate pathway,toxins,wildflowers,world agriculture", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2023-01-26-glyphosate-is-spreading-further-into-the-ecosystem.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Glyphosate is spreading further into the ecosystem, now detected in surviving wildflowers and bee pollen", "cleaned_text": "Glyphosate is spreading further into the ecosystem, now detected in surviving wildflowers and bee pollen\n\nGlyphosate, the infamous carcinogen in Round Up, has become pervasive in the ecosystem, destroying the integrity of the food supply and contributing to immunosuppression in humans. This chemical is still the most frequently used weed killer in the EU, despite its links to immunosuppression and cancer.\n\nGlyphosate and its main metabolite, aminomethylphosphonic acid, (AMPA) have previously been detected in the pollen of plants that were sprayed directly by the herbicide. Glyphosate has even been detected in the nectar that bees collect from targeted plants. Now, a group of Irish scientists have found glyphosate residue in the nectar of wildflowers that have NOT been sprayed directly with the weedkiller.\n\nSurviving wildflowers now contain toxic levels of glyphosate, poisoning pollinators\n\nThis is the first time that scientists have reported glyphosate in unsprayed wildflowers under conventional farming conditions. Worse yet, the glyphosate levels that were detected in wildflowers exceed the maximum amount permitted by European regulators, as it pertains to honey and honey bee products.\n\nIn the study, researchers investigated glyphosate exposure after it was used as a desiccant. As a desiccant, glyphosate is sprayed onto crops as a pre-harvest treatment to regulate plant growth and ripening. The research spanned seven fields of oilseed rape in East and Southeast Ireland, from two separate planting seasons. The researchers collected the pollen and bee nectar from the blackberry flowers that grow on the edge of these fields. The glyphosate residues in the blackberry flowers were detected at upwards of 10% of the applied rate. Studies show that 1–5% of the recommended application rate can negatively impact pollinators.\n\nThese illegal levels of glyphosate suggest that the herbicide could be negatively affecting honeybee populations. This is not good news for organic agriculture, honeybee colonies, or the food supply. As glyphosate infects the natural environment, it won’t matter whether honeybees engage directly with plants sprayed with glyphosate or whether they take up the nectar from natural wildflowers. Glyphosate has become a pervasive poison, nevertheless. It’s bad enough that honeybee populations are starved of diverse nutritional sources because glyphosate has already wiped-out several wildflower populations. Now, the honeybees are being poisoned by the plants that are barely surviving along the glyphosate-ridden fields.\n\nGlyphosate targets 5-enolpyruvylshikimate-3-phosphate synthase — an essential enzyme that is part of the shikimate pathway of plants. The biotech industry has genetically engineered seeds to withstand their poison. This allows the biotech industry to retain monopolistic control over the food supply and allows for unchecked poisoning of the ecosystem.\n\nThe shikimate pathway is also present in the microbiome of humans. This is why glyphosate acts as an antibiotic in humans, destroying gut bacteria that are essential to the human immune system. Glyphosate also harms the digestive system of honeybees and bumblebees, making colonies more vulnerable to infections.\n\nThe loss of pollinators is the number one issue affecting global production of nuts, fruits, and vegetables. The loss of pollinators causes an annual production loss of 3-5% for these nutrient-dense foods. This profoundly impacts the well being of hundreds of thousands of people, and could spiral into a food supply and nutrition crisis that further exacerbates the malnutrition and immunosuppression problem that is currently plaguing the world population.\n\nThe researchers conclude: In advance of, and to inform the upcoming renewal of market authorization for glyphosate in the European Union, we recommend the immediate investigation of glyphosate as desiccant before harvesting crops, to elucidate the behavior of glyphosate residues in soil and non-target flowering plants growing near crop fields, over a period of several days after the desiccant spraying.”", "opengraph": {"title": "Glyphosate is spreading further into the ecosystem, now detected in surviving wildflowers and bee pollen", "type": "article", "url": "https://www.ecology.news/2023-01-26-glyphosate-is-spreading-further-into-the-ecosystem.html", "site_name": "Ecology News", "description": "Glyphosate, the infamous carcinogen in Round Up, has become pervasive in the ecosystem, destroying the integrity of the food supply and contributing to immunosuppression in humans. This chemical is still the most frequently used weed killer in the EU, despite its links to immunosuppression and cancer. Glyphosate and its main metabolite, aminomethylphosphonic acid, (AMPA) have […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/01/Editorial-Use-Roundup-Weedol-Herbicide-Weed-Killer.jpg"}, "tags": ["food collapse", "wildflowers", "scarcity", "toxins", "biotech industry", "microbiome", "Bee Pollen", "honeybee populations", "poison", "pollen", "environment", "world agriculture", "Round Up", "desiccant", "herbicide", "shikimate pathway", "glyphosate", "environmental health", "ecosystem", "food supply", "monopoly"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/glyphosate-desiccant-pesticide-pollen/?itm_term=home", "https://www.cell.com/heliyon/fulltext/S2405-8440(22)03467-3#bib37", "https://pubmed.ncbi.nlm.nih.gov/33636765/", "https://glyphosate.news/", "http://pollution.news", "https://childrenshealthdefense.org/defender/glyphosate-desiccant-pesticide-pollen/?itm_term=home", "https://www.cell.com/heliyon/fulltext/S2405-8440(22)03467-3#bib37", "https://pubmed.ncbi.nlm.nih.gov/33636765/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-01-26-glyphosate-is-spreading-further-into-the-ecosystem.html&linkname=Glyphosate%20is%20spreading%20further%20into%20the%20ecosystem%2C%20now%20detected%20in%20surviving%20wildflowers%20and%20bee%20pollen", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}