{"result_id": "103015", "URL": "https://www.ecology.news/2022-11-30-mineral-oil-effective-cheaper-saving-citrus-trees.html", "timestamp": "2023-04-25 15:01:10 CEST+0200", "meta": {"description": "Iranian researchers have found that mineral oil can be an effective and inexpensive way to manage snail infestations in citrus orchards. Snails are one of the major agricultural pests in citrus orchards, causing damage to trees by feeding on both ripe and ripening fruits, as well as the leaves of young trees and tree bark. […]", "lang": "en", "keywords": "agriculture,citrus trees,crops,Ecology,environment,goodscience,green living,home gardening,homesteading,iron phosphate,metaldehyde,Mineral oil,natural pest repellent,natural pesticide,orchard,organic farming,pesticides,research,snails", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ecology.news/2022-11-30-mineral-oil-effective-cheaper-saving-citrus-trees.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ecology.news", "title": "Mineral oil offers a cheaper, more effective way of saving citrus trees from white snails", "cleaned_text": "Mineral oil offers a cheaper, more effective way of saving citrus trees from white snails\n\nIranian researchers have found that mineral oil can be an effective and inexpensive way to manage snail infestations in citrus orchards.\n\nSnails are one of the major agricultural pests in citrus orchards, causing damage to trees by feeding on both ripe and ripening fruits, as well as the leaves of young trees and tree bark. To keep them from climbing trees, farmers often use snail-repellent paints and molluscicide baits, such as metaldehyde and iron phosphate (ferricole). However, molluscicides are also toxic to animals and humans.\n\nMetaldehyde, in particular, is toxic when ingested or inhaled. It can irritate the skin, eyes and mucous membranes of the upper airways and gastrointestinal tract. In humans, it can cause abdominal pain, nausea, vomiting, diarrhea, fever, convulsions, coma and persistent memory loss for hours after ingestion. High acute exposure can also lead to tachycardia, respiratory panting, acute asthmatic reaction, high blood pressure, excessive urination and defecation, muscle tremors, cyanosis, acidosis, unconsciousness and more.\n\nMeanwhile, iron phosphate can cause diarrhea, vomiting and depression. In severe cases, it can cause problems with blood pressure and heart rate that can lead to shock and even death. (Related: Latest FDA Pesticide Monitoring Report reveals that nearly 50% of food samples contain pesticide “residues.”)\n\nOn top of this, these chemical treatments are expensive for citrus farmers.\n\nTo find a safer and more cost-effective alternative for controlling snails in citrus orchards, researchers from the Sari Agricultural Sciences and Natural Resources University in Iran looked at the effectiveness of mineral oil in suppressing damage caused by citrus white snails (Helica candeharica).\n\nThe team tested the effectiveness of mineral oil, metaldehyde, iron phosphate and the snail-repellent paint Sabzarang in a commercial citrus orchard in northern Iran. Ten days after application of the treatments, they counted the number of snails plaguing citrus trees. They continued monitoring the number of snails on the trees at intervals of six to eight days until harvest time.\n\nIn addition, they conducted a second study directly comparing mineral oil against metaldehyde.\n\nIn the first study, they counted the mean total number of snails found on citrus trees over an experimental period of 30 days. They found that mineral oil and the snail-repellent paint reduced the number of snails the most, with only an average of 4.9 and 8.4 snails per tree, respectively. Meanwhile, the trees treated with metaldehyde and iron phosphate had an average of 20.3 and 22.6 snails, respectively.\n\nFor the second study, they again found that the former reduced the number of snails best. The researchers counted only 4.2 snails per tree on average for trees treated with mineral oil compared to 16.7 per tree on average for those treated with metaldehyde.\n\nBeyond its effectiveness at keeping snails away from citrus trees, mineral oil is also more cost-effective than its commercial rivals.\n\nThe researchers came to this conclusion after comparing the cost of the material used for the treatment per tree, as well as the labor cost per hectare of orchard.\n\nMineral oil costs only $0.10 per tree – the cheapest among the treatments tested. The next cheapest was metaldehyde at $0.24 per tree, followed by the snail-repellent paint at $.033 per tree. Iron phosphate was the most expensive at $0.35 per tree.\n\nThe cost of molluscicides is higher due to them needing to be applied more times over the course of the experiment – eight applications per tree compared to one each for the mineral oil and snail-repellent paint. As such, the labor cost per hectare when using the former was $48 per hectare ($/ha) compared to just 25 $/ha when using the latter two.\n\nIn sum, mineral oil treatment only costs $55/ha while the other three cost more than $100/ha. Metaldehyde costs $120/ha, the snail-repellent paint cost $124/ha and iron phosphate costs $153/ha.\n\nBased on these results, the researchers concluded that mineral oil is a much more effective and economical treatment for keeping snails away from citrus trees than toxic molluscicides.\n\nLearn more about natural alternatives to chemical pesticides at OrganicFarming.news.\n\nWatch the video below for tips on how to deal with garden pests naturally and organically.\n\nThis video is from the Nature’s Always Right channel on Brighteon.com.\n\nStay vigilant: These garden pests can wipe out your plants in a hurry.\n\n15 Ways to use spent coffee grounds on your homestead.", "opengraph": {"title": "Mineral oil offers a cheaper, more effective way of saving citrus trees from white snails", "type": "article", "url": "https://www.ecology.news/2022-11-30-mineral-oil-effective-cheaper-saving-citrus-trees.html", "site_name": "Ecology News", "description": "Iranian researchers have found that mineral oil can be an effective and inexpensive way to manage snail infestations in citrus orchards. Snails are one of the major agricultural pests in citrus orchards, causing damage to trees by feeding on both ripe and ripening fruits, as well as the leaves of young trees and tree bark. […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/11/Snail-Close-Up-Nature.jpg"}, "tags": ["green living", "crops", "research", "natural pest repellent", "metaldehyde", "homesteading", "orchard", "citrus trees", "iron phosphate", "Mineral oil", "Ecology", "organic farming", "environment", "snails", "home gardening", "agriculture", "natural pesticide"], "tweets": [], "movies": [], "links": ["https://www.agric.wa.gov.au/citrus/managing-snails-citrus-orchards", "https://www.sciencedirect.com/topics/agricultural-and-biological-sciences/metaldehyde", "http://npic.orst.edu/factsheets/ironphosphategen.html#:~:text=Iron%20phosphate%20is%20considered%20very,and%20depression%20have%20been%20reported.", "https://www.naturalnews.com/2019-04-01-fda-pesticide-monitoring-report-food-samples-pesticides.html", "https://sanru.academia.edu/", "https://www.tandfonline.com/doi/full/10.1080/09064710.2018.1510026?scroll=top&needAccess=true", "http://organicfarming.news", "http://OrganicFarming.news", "https://www.brighteon.com/604dfc29-6507-4231-b03e-2f22dbb31f39", "https://www.brighteon.com/channels/naturesalwaysright", "https://naturalnews.com/2018-08-11-these-garden-pests-can-wipe-out-your-plants-in-a-hurry.html", "https://naturalnews.com/2022-02-04-15-ways-to-use-spent-coffee-grounds.html", "https://naturalnews.com/2018-06-05-tomato-plants-eavesdrop-on-snails-to-build-preemptive-defenses.html", "https://www.agric.wa.gov.au/citrus/managing-snails-citrus-orchards", "https://www.sciencedirect.com/topics/agricultural-and-biological-sciences/metaldehyde", "http://npic.orst.edu/factsheets/ironphosphategen.html#:~:text=Iron%20phosphate%20is%20considered%20very,and%20depression%20have%20been%20reported.", "https://www.tandfonline.com/doi/full/10.1080/09064710.2018.1510026?scroll=top&needAccess=true", "https://www.brighteon.com/604dfc29-6507-4231-b03e-2f22dbb31f39", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2022-11-30-mineral-oil-effective-cheaper-saving-citrus-trees.html&linkname=Mineral%20oil%20offers%20a%20cheaper%2C%20more%20effective%20way%20of%20saving%20citrus%20trees%20from%20white%20snails", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}