{"result_id": "103013", "URL": "https://www.ecology.news/2022-09-08-disastrous-high-tech-war-on-a-pathogen.html", "timestamp": "2023-04-25 15:01:09 CEST+0200", "meta": {"description": "Bill Gates has called the global response to Covid-19 a “world war.” His militaristic language has been echoed by Anthony Fauci and other architects of Covid-19 policy for the last two and half years. (Article by W. Aaron Vandiver republished from BrownStone.org) To fight their “world war,” Gates and Fauci and their allies have deployed […]", "lang": "en", "keywords": "Anthony Fauci,badhealth,badmedicine,badpollution,big government,Big Pharma,Big Tech,bill gates,biological warfare,biological weapon,biotech,bioterrorism,biowar,conspiracy,covid-19,deception,Ecology,environment,mRNA,pandemic,pharmaceutical fraud,vaccine,weapons technology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ecology.news/2022-09-08-disastrous-high-tech-war-on-a-pathogen.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ecology.news", "title": "The disastrous high-tech war on a pathogen", "cleaned_text": "Bill Gates has called the global response to Covid-19 a “world war.” His militaristic language has been echoed by Anthony Fauci and other architects of Covid-19 policy for the last two and half years.\n\nTo fight their “world war,” Gates and Fauci and their allies have deployed an arsenal of high-tech “weapons” and tech-enabled tools of social control—contact tracing apps, PCR tests, QR codes, digital passports, lockdowns, mask mandates, mRNA vaccines, social media censorship, mass surveillance, and so on—with devastating consequences for civil societies, human health, and even the environment.\n\nAs an advocate for wildlife conservation, I have been appalled as virtually all environmentalists, and most others on the Left, have supported this disastrous high-tech “war” on Covid-19. I believe that an ecological perspective reveals many of the flaws inherent in an aggressive high-tech attack on a pathogen, although most environmentalists have been too blinded by progressive political ideologies and the hysteria surrounding Covid-19 to see this truth.\n\nIn addition to criticisms leveled at pandemic policies by civil libertarians and public-health experts such as the authors of the Great Barrington Declaration—critiques that I appreciate—I tend to view the pandemic in accord with insights I have gained while trying to protect the planet’s biodiversity, a point of view that many critics may not have thought about, and may even be inclined to dismiss.\n\nTo me, the “war” on Covid-19 has been characterized by a destructive set of attitudes, beliefs, and behaviors that appear to be deeply engrained in our political and economic institutions, and which form a pattern that should be recognizable to conservationists and ecologists.\n• Aggressive intervention in complex natural processes using new, poorly understood technologies designed to achieve narrowly defined short-term goals, with disregard for the potential long-term ramifications;\n• Profiteering by private interests that own the technologies, enabled by government entities and “experts” that have been financially captured by those interests;\n• Followed by a cascade of unintended consequences.\n\nEach aspect of the “war” on Covid-19 can be understood in these terms. To explain, I will first elaborate on how I see the global response to Covid-19 through the lens of ecology.\n\n“The first rule of ecology is that everything is connected to everything else,” wrote the ecologist Barry Commoner in the 1970s. Or as the legendary naturalist John Muir, founder of Sierra Club (recently canceled by his own organization), wrote a hundred years before, “When we try to pick out anything by itself, we find it hitched to everything else in the universe.”\n\nEcological damage often ensues when people aggressively try to control complex natural processes to achieve short-term goals without truly understanding how those living systems work, or what the full range of ramifications will be, usually with new technologies that promise “progress” but have a variety of consequences that cannot be managed over the long run. In my opinion, this is one reason why our global industrial economy, which interferes in natural processes on a massive scale across the planet, has brought about a multi-faceted ecological crisis that has seen a dramatic collapse in the planet’s biodiversity, including an average 70% decline in Earth’s wildlife populations since 1970, among other symptoms of environmental degradation (I won’t even mention the “C” word).\n\nAn example of an ecologically destructive practice that fits this pattern is the Big Ag / Big Pharma industry’s worldwide chemical “war” on plant and animal pathogens using herbicides, pesticides, antibiotics, and other pharmaceuticals. The world’s most popular herbicide, glyphosate, has harmed global biodiversity over the last five decades and has potentially caused many human health problems, including cancer. (Acknowledging these harms is not to endorse the anti-farmer measures recently enacted in the Netherlands, Canada, and elsewhere).\n\nThe “war” on insects waged via the widespread application of the chemical insecticide DDT in the mid twentieth century also caused vast ecological damage across many species that Rachel Carson exposed in her book, Silent Spring, giving rise to the modern-day environmental movement. Studies still link DDT to elevated risks of cancer in children and grandchildren of women who were exposed to the chemical decades ago.\n\nA similar ecologically destructive practice is the “war” that has been waged for decades on apex predators like wolves, bears, and big cats at the behest of industrial agricultural interests, often accomplished through the large-scale spreading of chemical poisons across landscapes, triggering negative “trophic cascades” throughout U.S. and global ecosystems.\n\nI cannot help but notice that the high-tech “war” on Covid-19 resembles these industrial “wars” against the natural world in many respects. The whole “war” concept is based on a militaristic, mechanistic way of thinking that is obsessed with exerting technological control over natural processes to achieve short-term aims—often eradication of a “threat” like a pathogen or a predator—but cannot recognize the long-term consequences of interfering in the complex set of biological relationships that support natural ecosystems, and that ultimately provide the basis for human health and well-being.\n\nGates exemplifies this mindset, with his techno-utopian beliefs that human pathogens are like computer viruses, that human biology can be manipulated like computer code, and that vaccines can be regularly “uploaded” into the human body like software updates. He has a wrongheaded, war-like notion, as observed by economist Jeffrey A. Tucker, that “with enough money, intelligence, and power, along with technological know-how at the helm, [a virus] can be stopped in its tracks.” Gates’s militaristic Covid-19 strategy of retreat (lockdowns and masks) and attack (mass mRNA vaccination) was never based on a wholistic understanding of how human populations interact with pathogens and co-exist with them over time, how individual citizens remain healthy, or how human societies thrive.\n\n“The pandemic is not a war,” says Indian activist Dr. Vandana Shiva, one of Gates’s staunchest critics, and one of the only prominent ecologists to criticize his Covid-19 policies. “In fact,” she says, “we are part of the biome. And we are part of the virome [the set of all viruses present in the human body]. The biome and the virome are us.” In other words, co-existence with pathogens is the rule in ecology, eradication of a pathogen from nature is the rare exception, and declaring “war” on any part of a complex living system can have significant unintended consequences.\n\nBut for Gates and Fauci and others in power, waging high-tech “wars” on viruses is far more amenable to their interests than a humble approach based on the subtle principle of ecology (or the traditional precepts of public health prior to March 2020). Using new technologies to control natural processes for short-term gain, with disregard for long-term ecological consequences, is the business model. In fact, the more ecological damage that is caused, the more that further technological interventions can be justified, raising the question whether “unintended” consequences are in some cases intended.\n\nAs explained further below, the failure of each aspect of the “war” on Covid-19 can be described and understood in ecological terms, including lockdowns, masks, mRNA mass vaccination, and even the origins of the virus itself.\n\nOrigins of the Virus: Who Is the Real Bio-Terrorist, Mother Nature or Anthony Fauci?\n\nOne of the great ironies of the global response to Covid-19 is that one of its prime architects, Fauci, may have been partly responsible for the pandemic. Fauci and other powerful figures in the international bio-security establishment have long ignored the ecological risks of tampering with natural viruses using bio-weapons technology. This is an important factor that may have led to the initial outbreak of Covid-19 in Wuhan, China.\n\nAs soon as the pandemic started, Fauci immediately and vigorously began promoting the unproven theory that SARS-CoV-2 jumped naturally from wild animals to humans, and he even orchestrated a behind-the-scenes campaign to discredit alternative theories. But evidence has been steadily mounting that the novel coronavirus quite possibly came from “gain of function” research at the Wuhan Institute of Virology, funded in part by U.S. government grants approved by Fauci himself. Jeffrey Sachs, a prominent Democrat and professor of sustainability at Columbia University, chaired a commission for The Lancet that investigated the origins of SARS-CoV-2 for two years.\n\nHe has said, “I’m pretty convinced it [the virus] came out of U.S. biotechnology, not out of nature . . . So it’s a blunder of biotech, not a natural spillover.” Sachs has compiled evidence supporting the lab-leak theory, particularly regarding the existence of an unusual feature on the virus called a “Furin Cleavage Site,” which may have been artificially inserted in SARS-CoV-2.\n\nI find Sach’s reasoning and the evidence he has presented persuasive, although as a wildlife conservationist I remain concerned about the potential for natural “spillover” of viruses from wild animals to humans. Environmentalists, journalists, scientists, and others who focus their attention exclusively on computer models of zoonotic transmission and statistical studies favoring the natural transmission theory, while turning a blind eye to the hard evidence supporting the lab-leak theory laid out by Sachs and others, including Matt Ridley and Alina Chan, authors of Viral: The Search for the Origins of Covid-19, are missing an important story. (Even Fauci now says he has an “open mind” about a possible lab leak.)\n\nMost fail to realize that Fauci and other proponents of “gain of function” have long shown reckless disregard for the risks of tampering with natural viruses, expressing a paranoid attitude toward nature that is the antithesis of respect for ecology. Fauci and others claim that “Mother Nature Is the Ultimate Bioterrorist” to justify their Frankenstein-like efforts to hunt down the most dangerous viruses that exist in wild nature, take them to labs like the one in Wuhan, and tinker around with them to make them more dangerous and deadly.\n\nTheir twisted logic seems to be that if they intentionally create superviruses, they can somehow anticipate and prepare for natural pandemics. Most objective observers, however, say that “gain of function” is a military-industrial boondoggle that has no practical benefit whatsoever and dramatically increases the risk of pandemics (which, when they do occur, substantially increase the wealth and power of those funding and conducting the experiments). “Gain of function research of concern involves the creation of new health threats,” Dr. Richard Ebright of Rutgers University recently testified before the U.S. Senate, “health threats that did not exist previously and that might not come to exist by natural means for tens, hundreds, or thousands of years.”\n\nIf environmentalists and others on the Left were being true to their principles, they would denounce Fauci’s funding of bio-weapons experimentation and cry out for a worldwide ban on “gain of function” research in the same way that earlier generations of activists sought to limit the proliferation of nuclear weapons. “Gain of function” is already illegal under U.S. laws that Fauci appears to have found his way around.\n\nIt remains inconclusive whether “gain of function” research actually caused the Covid-19 pandemic, but its potential to have done so is a vivid example of how powerful actors like Fauci use technological tools to interfere with natural processes, with disregard if not outright contempt for the long-term ecological consequences, thereby creating opportunities to exercise more power.\n\nSince 9/11 it has been part of U.S. bio-warfare planning to “lock down” the population in response to a deliberate biological attack or the accidental release of an engineered pathogen, which according to Sachs is exactly how SARS-CoV-2 escaped the bio-technology lab in Wuhan, China. (See Chapter 12 of Robert F. Kennedy Jr.’s book, The Real Anthony Fauci, for a comprehensive summary of bio-warfare planning over the last twenty years).\n\nIn the Spring of 2020 this bio-warfare tactic—lockdown!—was unleashed on hundreds of millions of healthy Americans and billions of others worldwide without any understanding of the true long-term effects on human health and well-being, the vitality of our complex civil societies, or the biological relationship between the population and the virus.\n\nAuthorities justified lockdowns and associated policies with oversimplified computer models that did not reflect biological reality, and which were based on the utterly false premise that limiting social contacts through the brute force of modern technology (contact tracing apps, QR codes, digital passports, mass testing, online schooling, social media messaging, etc.) would somehow “flatten the curve” of infections in some meaningful, non-temporary way.\n\nThe Great Barrington Declaration, authored by epidemiologists Jay Bhattacharya, Martin Kulldorff, and Sunetra Gupta, of Stanford, Harvard, and Oxford Universities, correctly predicted that lockdowns were incapable of containing or controlling the spread of the virus, which is now ubiquitous in every corner of the globe despite numerous countries enforcing lockdowns throughout 2020 and 2021.\n\nComplex human societies—vast networks of relationships and flows of material and energy—are in many ways like complex ecosystems that cannot simply be turned on and off like a machine. Indeed, shutting down social activity violated the first rule of public health articulated by the renowned Dr. D.A. Henderson, who patiently conducted slow and methodical work on smallpox, the only human disease ever to be eradicated (after a century-and-a-half of effort and a vaccine that prevented infection and transmission). He said, “Experience has shown that communities faced with epidemics or other adverse events respond best and with the least anxiety when the normal social functioning of the community is least disrupted.”\n\nBy disrupting the normal functioning of society to the maximum extent, lockdowns caused immense collateral damage to the most vulnerable and marginalized people on Earth, including the global poor (100 million pushed into dire poverty by lockdowns in 2020, and 263 million more could crash into extreme poverty this year), working classes ($3.7 trillion in lost earnings in 2020 alone and now crippling inflation), and children (massive educational deficits and an unprecedented mental-health crisis).\n\nLockdowns led to deaths of despair from suicide and drug and alcohol addiction, depression, skipped medical treatments, and other direct harms to human health, including the impairment of millions of immune systems due to lack of exposure to pathogens, leading to surges of infection with adenovirus, rhinovirus, respiratory syncytial virus (RSV), human metapneumovirus, influenza, and parainfluenza, in addition to Covid-19.\n\nMeanwhile, billionaires who own the technological armory of lockdown added a total of $5 trillion to their wealth from March 2020 to November 2021, and the world’s ten richest men, including Gates, doubled their fortunes due to the increase in the value of their holdings in Big Tech and Big Pharma attributable to “pandemic super profits.” According to OxFam International, “for every new billionaire created during the pandemic—one every 30 hours—nearly a million people could be pushed into extreme poverty in 2022.”\n\nLockdowns also empowered government bureaucrats (under the influence of Big Pharma, Big Tech, and other multinational corporate interests) to rule by emergency decree, circumventing democratic processes and causing a massive worldwide rollback of basic civil liberties and human rights, which fell to various forms of tech-enabled control: free speech gave way to social media censorship, free movement to digital passports, and freedom to earn a living or get an education to bans on “nonessential” activity that forced commerce and schooling online.\n\nThe real story here is how elites used lockdowns to exert an unprecedented degree of control over society and each one of us. At the height of global lockdown mania in 2020, Vandana Shiva described their destabilizing and dehumanizing effect from her perspective as an activist who has long tried to protect India from policies that Gates and other global elites have forcefully imposed on her country, especially industrial agricultural policies that take control of the land away from traditional farmers and give it to giant multinational corporations. She used ecological terms to illustrate how technocratic elites seek to control us in the same way that they control the land:\n\n“The coronavirus pandemic and lockdown have revealed even more clearly how we are being reduced to objects to be controlled, with our bodies and minds the new colonies to be invaded. This linear, extractive logic [of lockdown and similar policies] is unable to see the intimate relations that sustain life in the natural world. It is blind to diversity, cycles of renewal, values of giving and sharing, and the power and potential of self-organizing and mutuality. It is blind to the waste it creates and to the violence it unleashes.”\n\nJust as an ecologically short-sighted intervention in a complex living ecosystem can destabilize it, lockdowns severely destabilized our complex civil societies, exposing them and each of us to exploitation. For many years, we will be living with the catastrophic consequences of this heavy-handed and poorly understood bio-warfare tactic.\n\nToxic Masquerade: The Effects of Petrochemical Masks on Health and the Environment\n\nMasks are “weapons” in the “war” on Covid-19 manufactured by the petrochemical industry that have caused enormous collateral damage to human health, civil society, and even the environment.\n\nYes, surgical and N95 style masks are made from synthetic petrochemical fibers, i.e. plastic. As I have written about previously, billions of plastic masks have already ended up in the world’s oceans, where they directly harm marine life like sea turtles, whales, and especially sea birds—masks are devastating bird populations around the world. Masks also pollute the water with countless tiny particles called “microplastics” that infiltrate the marine food chain. Billions more plastic masks have been buried and burned in landfills and incinerators, where they release petrochemicals into the soil, water, and air. At the height of the pandemic, the world was throwing away about 3 million masks per minute.\n\nThe petrochemicals in masks are toxic. Many surgical and N95 masks contain PFAS, known as “Forever Chemicals. One study found that “wearing masks treated with high levels of PFAS for extended periods of time can be a notable source of exposure and have the potential to pose a health risk.” The Environmental Protection Agency (EPA) recently warned that certain PFAS compounds are more dangerous to human health than previously thought and present a risk to human health even in very tiny quantities.\n\nRecent studies have also found microplastics in human blood and deep lung tissue for the first time ever. Those studies were not about masks, but they raise obvious questions about the effects of breathing through plastic material worn over the nose and mouth. A research team from the Hull York Medical School in the U.K. found polypropylene and PET (polyethylene terephthalate), which are fibers from synthetic fabrics such as the material that surgical and N95 masks are made from, in lung tissue. “The surprise for us was how deep it got into the lungs and the size of those particles,” their team leader said.\n\nClearly, public-health agencies never paused their mask campaign long enough to consider the obvious risks that petrochemicals pose to human health and the environment. And notwithstanding these risks, Big Plastic manufacturing giants like 3M, which sold $1.5 billion of surgical and N95 masks in 2021, have every incentive to keep plastic masks rolling off the assembly line. 3M and other large companies in the multibillion-dollar petrochemical industry routinely lobby officials in Washington D.C. about the supposed benefits of masking, and have been handsomely rewarded with huge public contracts to provide masks to the government. The petrochemical industry has also engaged in heavy lobbying to defeat efforts to regulate the toxic chemicals, PFAS, found in masks and other plastic products.\n\nIn addition to the direct harmful effects of the toxic petrochemicals and microplastics in masks, countless negative social, emotional, educational, and health-related harms have been suffered by the public due to the simple act of covering people’s faces, especially those of children. Forcibly covering people’s faces in plastic material, or useless cloth, is not “low impact” in any sense, as public-health officials wrongly declare.\n\nDespite all this collateral damage, masks made little to no difference in the spread of the virus throughout the U.S. and the world. As with lockdowns, public-health officials rationalized mask mandates with oversimplified computer models, and with ridiculous studies on mannequins, as well as small inconclusive observational studies, not a robust scientific understanding of disease transmission in complex human societies.\n\nRandomized controlled trials conducted before and during the pandemic showed that mask policies did not significantly reduce community transmission of respiratory viruses including Covid-19. Even if masks were shown to have some modest effect, officials who mandated masks across vast swathes of society relied on the same faulty short-term logic that characterized lockdowns: the simple-minded notion that temporarily “tamping down” transmission of a respiratory virus is a legitimate and meaningful goal, regardless of the collateral damage.\n\nPetrochemical masks are yet another failed, but profitable, bit of industrial technology produced by the “war” economy that has sprung up around Covid-19.\n\nmRNA Mass Vaccination: What Can We Learn from Big Pharma’s “War” on Plant and Animal Pathogens?\n\nThe biggest “weapons” deployed in the “war” on Covid-19, Pfizer and Moderna’s mRNA vaccines, are brand-new technologies that are unlike any other vaccine in history. Despite their technological novelty, the Food and Drug Administration (FDA) determined with unprecedented “warp speed” that mRNA shots are “safe and effective,” and initially approved them for use on an emergency basis after shockingly brief tests.\n\n“Operation Warp Speed” was, in fact, a gargantuan military-industrial project involving four generals and dozens of other military officers. Bio-warfare planners have zeroed in on mRNA products because they can be quickly formulated and manufactured in response to a biological attack or an accidental lab leak. Clinical testing, however, takes years to complete and cannot be sped up, only curtailed. Long testing delays are unacceptable in a “war.” Putting “shots in arms” as quickly as possible is the measure of success.\n\nBut what are the long-term consequences for human health, as well as the ecology of the viral-host equilibrium in the population, due to hastily injecting nearly the entire human species with brand-new, lightly tested mRNA technologies developed by Big Pharma with “warp speed”?\n\nWe may have no way of knowing for certain, and even trying to answer the question exposes someone to the pejorative “anti-vaxxer.” There are many rational critics of mRNA vaccines who deserve credit for standing up to name-calling and censorship, and there are some irrational critics, too. I will not wade through all of those arguments here.\n\nInstead, as a conservationist, I tend to look for answers in the worldwide industrial “war” waged by Big Pharma (in conjunction with its corporate cousin, Big Ag) against plant and animal pathogens. To my mind, that chemical and pharmaceutical war is an important global precedent that has some disturbing parallels to the current mRNA assault on Covid-19, and may hold important lessons about what we can expect.\n\nFor example, over three hundred million of pounds of the chemical herbicide, glyphosate, are now dumped on U.S. soils every year. Glyphosate is manufactured by Bayer, which recently acquired the original manufacturer, Monsanto, in a $66 billion merger between Big Ag and Big Pharma (a confluence of corporate interests in which Bill Gates is an interested party, through his program to “revolutionize” global food production called Gates Ag One).\n\nThe EPA, under the industry-friendly leadership of the Trump administration, determined that glyphosate is “safe” and “effective.” In June of this year, however, a United States Court of Appeals ordered the EPA to set aside that order and reassess the risk that glyphosate poses to human health and the environment due to accumulating evidence of harms, including biodiversity loss in soils and waters laced with glyphosate. The United States Supreme Court recently refused Bayer’s appeal of a major multi-million-dollar judgment based on the company’s failure to warn about glyphosate’s cancer risk.\n\nNevertheless, glyphosate use remains at extraordinarily high levels, particularly on crops that have been genetically modified to withstand exposure to the chemical. As weeds growing on about 150 million acres of U.S. soil have become resistant to glyphosate—you might call them weed variants—more and more glyphosate and other powerful herbicides are used to kill “superweeds” in a perpetually escalating chemical war against natural plant pathogens.\n\nSimilar practices are carried out by the Big Ag / Big Pharma industry in the animal agriculture sector. The widespread overuse of antibiotics and “leaky” vaccines that fail to prevent infection or transmission have created “superbugs” and “superviruses” in livestock animals. A “leaky” vaccine for Marek’s Disease in chickens may have stimulated the evolution of viral variants that made the disease much more deadly, as explained in a 2015 article in Science magazine (with a title that could never be printed today), “Do Some Vaccines Make Viruses More Deadly?”\n\nYet industry continues to engage in these kinds of ecologically risky (but profitable) agricultural practices on a global scale.\n\nThe parallels between Big Ag / Big Pharma’s chemical and pharmaceutical “wars” on plant and animal pathogens and Big Pharma’s current mRNA “war” on a human pathogen include these striking similarities:\n• Determination by corporate manufacturers and government regulators that chemical / pharmaceutical products are “safe” and “effective” before the long-term effects can possibly be known.\n• Accumulating evidence of adverse health effects after widespread use. We now know, after hundreds of millions of people have received shots in the U.S. alone, that mRNA vaccines can cause myocarditis, blood clots, facial paralysis, disruption of the menstrual cycle, and a drop in sperm count, among other problems. A major pre-print study that re-examined the original mRNA vaccine clinical trials concluded that “[t]he excess risk of serious adverse events of special interest [caused by the mRNA vaccines] surpassed the risk reduction for Covid-19 hospitalization relative to the placebo group in both Pfizer and Moderna trials.”\n• Use of “leaky” vaccines. In March of 2021 Director of the CDC Rochelle Walensky said on CNN that “vaccinated people do not carry the virus, don’t get sick,” and a few months later Fauci guaranteed MSNBC host Chris Hayes that “when people get vaccinated they can feel safe that they are not going to get infected.” But we now know that although mRNA vaccines temporarily reduce symptoms of disease (an effect which did not decrease all-cause mortality in countries that used them), they fail to prevent infection or transmission. Even Gates himself acknowledges that the shots are “not good at infection blocking.”\n• Possible generation of new variants due to “leaky” products. Vaccinology expert Geert Vanden Bossche believes that mass vaccination with “leaky” mRNA shots is putting evolutionary pressure on the virus to generate new vaccine-resistant variants, and that mass mRNA vaccination has disrupted “the equilibrium in the viral-host ecosystem.” He has pointed to the Marek’s Disease vaccine in chickens as one potentially relevant precedent. We do not yet know whether he is right, but we do know that vaccine-resistant variants are emerging regularly. The new Omicron subvariants, BA.4 and BA.5, are highly resistant to vaccine-induced immunity. A study in the UK has shown that people who receive multiple boosters after being infected with the original strain of the virus are more susceptible to Omicron infection.\n• Perpetual escalation of the “war” against new variants in a vicious, but highly profitable, cycle. Pfizer CEO Albert Bourla sees no end to this cycle, as he predicts “constant waves” of Covid-19 variants accompanied by regular booster shots. Pfizer and its corporate partner BioNTech, along with Moderna, collectively had over $60 billion in vaccine revenue in 2021. They intend to keep the recurring-revenue business going for as long as possible, regardless of whether their own products are to blame for the emergence of variants.\n• The financial “capture” of government regulators. The FDA, the CDC, the National Institute for Allergy and Infectious Diseases (NIAID), the National Institutes of Health (NIH), and the World Health Organization (WHO) get much of their funding directly from the pharmaceutical industry, and from “charitable” foundations with close financial ties to that industry, including the Bill and Melinda Gates Foundation. Serious financial conflicts of interest exist at every level of the drug-approval process. Dr. Marty Makary of Johns Hopkins School of Medicine and Dr. Tracey Hoeg at the Florida Department of Health recently wrote an article about the relentless calls and text messages they are receiving from doctors and scientists at the top levels of the NIH, FDA and CDC regarding conflicts of interest and pressure to approve mRNA shots and boosters. Florida Governor Ron DeSantis summed it up best when he said, “What this whole year and a half has shown us is that these regulatory agencies of the federal government have basically become subsidiaries of the pharmaceutical industry.”\n\nIf we carefully analyze each aspect of “world war” on Covid-19, we can see how each tactic and high-tech “weapon” has harmed human health, destabilized civil society, and possibly disrupted the ecological balance between the human population and the virus, while enriching private interests and empowering financially captured government regulators.\n\nThe “war” has been characterized the distinct pattern that I described at the beginning of this essay:\n• Aggressive intervention in complex natural processes using new, poorly understood technologies designed to achieve narrowly defined short-term goals, with disregard for the potential long-term ramifications;\n• Profiteering by private interests that own the technologies, enabled by government entities and “experts” that have been financially captured by those interests;\n• Followed by a cascade of unintended consequences.\n\nThis destructive pattern appears to be deeply ingrained in our institutions and in the outlook of our leaders. It largely defines our society’s dysfunctional relationship with the natural world. An ecological perspective that keeps this pattern in mind, and takes into account all of the consequences of launching high-tech “wars” on pathogens or any other part of our environment may help us avoid similar catastrophes in the future, or at least to recognize them.", "opengraph": {"title": "The disastrous high-tech war on a pathogen", "type": "article", "url": "https://www.ecology.news/2022-09-08-disastrous-high-tech-war-on-a-pathogen.html", "site_name": "Ecology News", "description": "Bill Gates has called the global response to Covid-19 a “world war.” His militaristic language has been echoed by Anthony Fauci and other architects of Covid-19 policy for the last two and half years. (Article by W. Aaron Vandiver republished from BrownStone.org) To fight their “world war,” Gates and Fauci and their allies have deployed […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/09/Covid-19-Coronavirus-Blood-Cells.jpg"}, "tags": ["biological warfare", "conspiracy", "pandemic", "big government", "Big Pharma", "deception", "Anthony Fauci", "biological weapon", "covid-19", "bioterrorism", "vaccine", "weapons technology", "environment", "biotech", "Big Tech", "bill gates", "biowar", "Ecology", "mRNA", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.gatesnotes.com/Health/Pandemic-Innovation", "https://brownstone.org/articles/the-disastrous-high-tech-war-on-a-pathogen/", "https://kimgoldbergx1.substack.com/p/covid-19-and-the-green-void?s=r", "https://gbdeclaration.org/", "https://fs.blog/four-laws-of-ecology/", "https://www.sierraclub.org/michael-brune/2020/07/john-muir-early-history-sierra-club", "https://www.stockholmresilience.org/research/planetary-boundaries.html", "https://www.worldwildlife.org/publications/living-planet-report-2020", "https://www.cbsnews.com/news/endangered-species-animal-population-decline-world-wildlife-fund-new-report/", "https://www.amazon.com/Toxic-Legacy-Weedkiller-Glyphosate-Environment-ebook/dp/B0971R287S/ref=tmm_kin_swatch_0?_encoding=UTF8&qid=1658859073&sr=8-1", "https://aacrjournals.org/cebp/article/30/8/1480/671027/Grandmaternal-Perinatal-Serum-DDT-in-Relation-to", "https://harpers.org/2016/02/a-biocentrist-history-of-the-west/", "https://en.wikipedia.org/wiki/Trophic_cascade", "https://brownstone.org/articles/choice-quotes-from-bill-gatess-new-book/", "https://inthesetimes.com/article/vandana-shiva-bill-gates-war-against-life-extinction-pandemic", "https://pubmed.ncbi.nlm.nih.gov/29398104/", "https://www.cdc.gov/mmwr/preview/mmwrhtml/su48a7.htm", "https://nypost.com/2022/04/01/research-group-funded-by-faucis-nih-reportedly-worked-to-cast-doubt-on-lab-leak-theory/", "https://twitter.com/RnaudBertrand/status/1543259218995687424", "https://www.pnas.org/doi/10.1073/pnas.2202769119", "https://www.theatlantic.com/science/archive/2022/04/how-climate-change-impacts-pandemics/629699/", "https://www.cnn.com/2022/07/26/health/wuhan-market-covid-19/index.html", "https://unherd.com/2022/06/what-happened-to-the-lab-leak-hypothesis/", "https://www.realclearpolitics.com/video/2022/07/23/fauci_i_am_keeping_an_open_mind_that_coronavirus_originated_from_a_lab_leak.html", "https://www.cbsnews.com/news/niaids-anthony-fauci-nature-is-potentially-the-worst-bioterrorist/", "https://www.statnews.com/2021/01/08/mother-nature-is-not-the-ultimate-bioterrorist/", "https://www.forbes.com/sites/stevensalzberg/2022/07/05/the-us-is-funding-a-massive-virus-hunt-that-might-cause-another-pandemic-great-idea/?sh=b38511d6f75c", "https://thebulletin.org/2022/06/gain-of-function-research-cant-deliver-pandemic-predictions-are-there-alternatives/#.Yrop1Ab_Qzg.twitter", "https://twitter.com/SenRandPaul/status/1554919097502138369", "https://ayjchan.medium.com/the-evidence-for-a-natural-vs-lab-origin-of-covid-19-6946407f3310", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens-ebook/dp/B08X5YWRRP/ref=tmm_kin_swatch_0?_encoding=UTF8&qid=1658261769&sr=8-1", "https://www.aier.org/article/the-failure-of-imperial-college-modeling-is-far-worse-than-we-knew/", "https://gbdeclaration.org/", "https://collateralglobal.org/", "https://www.amnesty.org/en/latest/news/2022/05/covid-19-pandemic-restrictions-magnified-discrimination-against-most-marginalized-groups/", "https://www.oxfam.org/en/research/inequality-virus", "https://www.ilo.org/global/about-the-ilo/newsroom/news/WCMS_766949/lang--en/index.htm", "https://brownstone.org/articles/the-inflation-disaster-is-collateral-damage-from-lockdowns/", "https://apnews.com/press-release/business-wire/covid-health-mental-anxiety-f8e53c296b744ce0ad66ffbd846aba48", "https://www.thetimes.co.uk/article/lockdown-made-britain-sicker-covid-health-latest-drinking-fitness-dhbnfvpl5", "https://twitter.com/TheEconomist/status/1553777025953021953", "https://www.washingtonpost.com/health/2022/06/13/covid-flu-rsv-viruses/", "https://www.oxfam.org/en/press-releases/ten-richest-men-double-their-fortunes-pandemic-while-incomes-99-percent-humanity", "https://policy-practice.oxfam.org/resources/power-profits-and-the-pandemic-from-corporate-extraction-for-the-few-to-an-econ-621044/", "https://www.oxfam.org/en/press-releases/pandemic-creates-new-billionaire-every-30-hours-now-million-people-could-fall", "https://compactmag.com/article/the-logic-of-lockdowns-leads-to-shanghai", "https://grist.org/fix/disposable-plastic-masks-ocean-pollution/", "https://www.businessinsider.com/disposable-face-mask-waste-toxic-poison-water-nanoplastics-pollution-health-2022-2?op=1", "https://pubs.acs.org/doi/10.1021/acs.estlett.2c00019", "https://www.washingtonpost.com/climate-environment/2022/06/15/epa-pfas-forever-chemicals/", "https://www.theguardian.com/environment/2022/mar/24/microplastics-found-in-human-blood-for-first-time", "https://www.theguardian.com/environment/2022/apr/06/microplastics-found-deep-in-lungs-of-living-people-for-first-time", "https://www.japantimes.co.jp/news/2022/07/03/world/science-health-world/microplastics-oceans-air-human-body/", "https://www.wsj.com/articles/3ms-n95-mask-sales-climb-lifting-revenue-as-omicron-drives-demand-11643136555?mod=e2tw", "https://www.reuters.com/article/us-health-coronavirus-3m-idUSKBN22I2QG", "https://www.theguardian.com/environment/2021/apr/26/us-chemical-companies-lobbying-donation-defeated-regulation", "https://www.newsweek.com/risk-groups-avoid-reusing-face-masks-disposable-1726297", "https://collateralglobal.org/articles/education/", "https://www.washingtonpost.com/business/mask-mandates-didnt-make-much-of-a-difference-anyway/2022/02/11/57760db6-8b3b-11ec-838f-0cfdf69cce3c_story.html", "https://givingcompass.org/article/a-new-data-driven-model-shows-that-wearing-masks-saves-lives-and-the-earlier-you-start-the-better", "https://twitter.com/CDCgov/status/1359536382180544517?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1359536382180544517%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Ftownhall.com%2Ftipsheet%2Fkatiepavlich%2F2021%2F02%2F10%2Fthe-cdc-has-a-new-statement-about-double-maskingand-theres-a-catch-n2584535", "https://www.sandiegouniontribune.com/opinion/commentary/story/2022-07-29/san-diego-unified-school-district-mask-mandate", "https://www.statnews.com/2020/09/28/operation-warp-speed-vast-military-involvement/", "https://www.businessinsider.com/monsanto-beyer-merge-drop-monsanto-name-2018-6?op=1", "https://www.independentsciencenews.org/commentaries/gates-ag-one-the-recolonisation-of-agriculture/#_ftnref15", "https://www.epa.gov/ingredients-used-pesticide-products/glyphosate", "https://www.theguardian.com/us-news/2022/jun/17/glyphosate-roundup-weed-killer-bayer", "https://phys.org/news/2020-03-widely-weed-killer-biodiversity.html", "https://www.bbc.com/news/business-61886525", "https://hh-ra.org/challenges/pesticides/pest-resistance/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4638249/", "https://www.science.org/content/article/could-some-vaccines-make-diseases-more-deadly", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)00791-7/fulltext", "https://www.popsci.com/health/menstrual-changes-after-covid-19-vaccine/?taid=62d1c963f0954100015cd02e&utm_campaign=trueanthem_AI&utm_medium=social&utm_source=twitter&utm_term=popularscience", "https://www.israelnationalnews.com/news/355353", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4125239", "https://www.businessinsider.com/cdc-director-data-vaccinated-people-do-not-carry-covid-19-2021-3?op=1", "https://www.msnbc.com/transcripts/transcript-all-chris-hayes-5-17-21-n1267740", "https://brownstone.org/articles/have-people-been-given-the-wrong-vaccine/", "https://newspunch.com/bill-gates-giggles-as-he-admits-covid-shots-dont-last-long-or-block-infections/", "https://www.voiceforscienceandsolidarity.org/authors/geert-vanden-bossche", "https://www.voiceforscienceandsolidarity.org/videos-and-interviews/second-call-to-who-please-dont-vaccinate-against-omicron", "https://fortune.com/2022/06/28/ba5-ba-4-twin-omicron-subvariants-have-taken-over-the-us-but-theyre-not-quite-identical-one-is-the-worst-version-of-the-virus-weve-seen/", "https://fortune.com/2022/06/23/new-omicron-subvariant-swamping-us-escapes-immunity-from-vaccination-previous-infections-new-studies/?queryly=related_article", "https://www.theepochtimes.com/covid-19-vaccines-hinder-the-immune-system-lead-to-more-severe-illness-dr-robert-malone_4627115.html?", "https://www.businessinsider.com/pfizer-ceo-constant-waves-covid-19-coronavirus-complacency-albert-bourla-2022-5?amp", "https://www.oxfam.org/en/press-releases/pfizer-biontech-and-moderna-making-1000-profit-every-second-while-worlds-poorest", "https://www.fda.gov/about-fda/fda-basics/fact-sheet-fda-glance", "https://admin.cdcfoundation.org/FY2021/donors?group=corp", "https://www.bmj.com/content/377/bmj.o1538.full?ijkey=jPIowyCkUJwciSR&keytype=ref", "https://www.commonsense.news/p/us-public-health-agencies-arent-following", "https://twitter.com/jeffreyatucker/status/1539767279034007557", "https://brownstone.org/articles/the-disastrous-high-tech-war-on-a-pathogen/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2022-09-08-disastrous-high-tech-war-on-a-pathogen.html&linkname=The%20disastrous%20high-tech%20war%20on%20a%20pathogen", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}