{"result_id": "103021", "URL": "https://www.ecology.news/2023-01-06-microplastics-are-everywhere-including-new-zealand-rainfall.html", "timestamp": "2023-04-25 15:01:14 CEST+0200", "meta": {"description": "New research published in the journal Environmental Science & Technology reveals that in 2020 alone, some 74 metric tons of microplastics – that is, the plastic particulates released from waste into the environment – fell on the city of Auckland in New Zealand via rainfall. The first peer-reviewed study of its kind to calculate the […]", "lang": "en", "keywords": "badhealth,badpollution,Censored Science,Dangerous,Ecology,environment,microplastics,New Zealand,plastic pollution,pollution,rain,research,toxins", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.ecology.news/2023-01-06-microplastics-are-everywhere-including-new-zealand-rainfall.html", "encoding": "UTF-8"}, "image": null, "domain": "www.ecology.news", "title": "Microplastics are everywhere, including in New Zealand’s rainfall", "cleaned_text": "Microplastics are everywhere, including in New Zealand’s rainfall\n\nNew research published in the journal Environmental Science & Technology reveals that in 2020 alone, some 74 metric tons of microplastics – that is, the plastic particulates released from waste into the environment – fell on the city of Auckland in New Zealand via rainfall.\n\nThe first peer-reviewed study of its kind to calculate the total mass of microplastics in a city’s air, the paper found that the pollution equivalent of three million plastic bottles falls on Auckland in an average year – a truly astounding level that is much higher than generally accepted estimates.\n\nResearchers say the global prevalence of airborne microplastics appears to be much higher than previously believed. Most of these particulates are too small to be seen with the naked eye, though scientists were able to identify them using a colored, light-emitting dye.\n\nFor analysis, researchers also applied heat treatment, which allowed them to calculate an aggregate mass of the particulates in terms of volume and tonnage. (Related: The average person consumes a credit card’s worth of microplastics every week in tainted food.)\n\n“The smaller the size ranges we looked at, the more microplastics we saw,” said Joel Rindelaub, the study’s lead author and a chemical scientist at The University of Auckland. “This is notable because the smallest sizes are the most toxicologically relevant.”\n\nChances are you’re inhaling microplastics right now and don’t even know it\n\nThe smaller the size of a microplastic particulate, the easier time it has being inhaled and entering cells. If small enough, microplastics can even build up in vital organs such as the liver and cross the blood-brain barrier, accumulating in the brain.\n\nIn one square meter in one day in 2020, the average number of airborne plastics floating around Auckland was found to be 4,885. Comparatively for that same year in the same amount of space, London’s count was just 771.\n\nA 2019 study that looked at the cities of Hamburg and Paris found that airborne plastics in that same one-square-meter space were 275 and 110, respectively.\n\n“The discrepancy is largely because of the Auckland study’s inclusion of smaller size ranges, which were not part of previous research,” noted Bloomberg.\n\nRindelaub says that while more work needs to be done to quantify precisely how much plastic the average person is breathing in, it is clear from what we already know that inhalation of microplastics “is an important route of exposure” that cannot be ignored.\n\nSince the 1950s when plastics first started being mass produced, some 8.3 billion metric tons of it have been generated. Of that, 79 percent has ended up in landfills or been dumped in the wild where it gradually breaks down and turns into microplastics.\n\n“Once they enter the natural environment, they can pollute soil, kill wildlife and find their way into the food chain,” reports indicate.\n\nIn Auckland, the most-detected form of plastic was polyethylene, followed by polycarbonate. The former is a common packaging material while the latter is used in electrical and electronic appliances.\n\nSince Auckland is located near the ocean and gets heavy winds from the Hauraki Gulf of New Zealand’s North Island, it is speculated that this could be a reason why more microplastics are being detected there compared to other more inland cities in other parts of the world.\n\n“The production of airborne microplastics from breaking waves could be a key part of the global transport of microplastics,” Rindelaub explained. “And it could help explain how some microplastics get into the atmosphere and are carried to remote places, like here in New Zealand.”\n\nThe world’s growing microplastics problem is much more serious than many people realize. To learn more about the dangers and toxicity of exposure, be sure to check out Microplastics.news.", "opengraph": {"title": "Microplastics are everywhere, including in New Zealand’s rainfall", "type": "article", "url": "https://www.ecology.news/2023-01-06-microplastics-are-everywhere-including-new-zealand-rainfall.html", "site_name": "Ecology News", "description": "New research published in the journal Environmental Science & Technology reveals that in 2020 alone, some 74 metric tons of microplastics – that is, the plastic particulates released from waste into the environment – fell on the city of Auckland in New Zealand via rainfall. The first peer-reviewed study of its kind to calculate the […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2023/01/Plastic-Facility-Packaging-Production-Aqua-Automatic-Blue.jpg"}, "tags": ["rain", "research", "Dangerous", "Ecology", "New Zealand", "environment", "microplastics", "toxins", "Censored Science"], "tweets": [], "movies": [], "links": ["https://archive.vn/xWIXS", "https://naturalnews.com/2022-03-31-microplastics-tained-food-supply-altered-gut-composition.html", "https://www.auckland.ac.nz/en.html", "http://microplastics.news", "https://archive.vn/xWIXS", "https://naturalnews.com/2022-03-31-microplastics-tained-food-supply-altered-gut-composition.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2023-01-06-microplastics-are-everywhere-including-new-zealand-rainfall.html&linkname=Microplastics%20are%20everywhere%2C%20including%20in%20New%20Zealand%E2%80%99s%20rainfall", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}