{"result_id": "103033", "URL": "https://ecology.news/2022-05-10-gorilla-dies-multiple-organ-failure-covid-vaccination.html", "timestamp": "2023-04-25 15:01:23 CEST+0200", "meta": {"description": "Martha the gorilla, who lived at the Gladys Porter Zoo in Brownsville, Tex., recently died after getting “vaccinated” for the Wuhan coronavirus (Covid-19). According to reports, Martha was perfectly healthy before getting the shot. Afterwards, however, she quickly developed “multiple organ failure” and died unexpectedly on April 19. A Western Lowland Gorilla who had recently […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,COVID,Dangerous Medicine,depopulation,Ecology,genocide,Gladys Porter Zoo,gorilla,insanity,Martha,multiple organ failure,pharmaceutical fraud,Plandemic,spike protein,vaccine damage,Vaccine deaths,vaccine injury,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2022-05-10-gorilla-dies-multiple-organ-failure-covid-vaccination.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Previously healthy gorilla dies of multiple organ failure following covid vaccination", "cleaned_text": "Martha the gorilla, who lived at the Gladys Porter Zoo in Brownsville, Tex., recently died after getting “vaccinated” for the Wuhan coronavirus (Covid-19).\n\nAccording to reports, Martha was perfectly healthy before getting the shot. Afterwards, however, she quickly developed “multiple organ failure” and died unexpectedly on April 19.\n\nA Western Lowland Gorilla who had recently given birth, Martha was a very happy and very healthy creature before her immune system was corrupted by the Fauci Flu shot she was given. The following video shows Martha playing with and loving her baby.\n\nLast July, Gladys Porter Zoo announced plans to jab all of its animals for covid. Martha was no exception, and now she is no more because of the zoo’s failure to identify covid shots as a depopulation scam.\n\n“How dangerous was Covid to animals in Gladys Porter Zoo?” asked Igor Chudov on his Substack. “Not very dangerous. No animal ever contracted COVID, according to the zoo.”\n\n“So now we have a beautiful and thriving gorilla mommy dead for what exact reason? And her cubs are now orphans … The zoo, of course, is not confessing. But everything is painfully obvious.”\n\nYoung mother also died from “multiple organ failure” following Moderna jab; media says shot didn’t cause it\n\nHumans were never the only target of the globalists when it came to the plandemic extermination agenda. Animals and even plants were also slated for eradication under the plan.\n\nMartha’s tragic demise will certainly not be the last within the animal kingdom, especially if brainwashed zookeepers continue to embrace covid hysteria while buying into the government narrative pushing the shots.\n\nGladys Porter Zoo senior veterinarian Dr. Tom deMaar told the local media that upon necropsy, Martha was determined to have suffered “multiple organ abnormalities which, in turn, created a life-ending cascade.”\n\n“The cascade began with fibrosing heart disease, which led to renal failure,” he added, making no mention whatsoever about the injections that Martha had previously received.\n\nA similar situation occurred with 39-year-old Kassidi Kurill, a previously healthy single mom who “died of multiple organ failure” following injections with the Moderna shot.\n\nIn that case, the jab was mentioned by the media, but specifically in the context of it supposedly not being responsible for Kurill’s death.\n\n“Of course, the newspaper said, Kassidi ‘did not die from the jab,'” Chudov writes. “Yeah, she died from organ failure. Not the jab. Just as gorilla Martha, who also ‘suddenly died from multiple organ failure.’ Right. It was unrelated,” he added.\n\n“Loving moms Martha (a gorilla) and Kassidi Kurill (a human) did NOT have to die. Whose lives did they save, exactly? Everyone is having Covid so it is not like Martha and Kassidi stopped anything.”\n\nSomeone who reads Chudov’s Substack wrote that her own dad died the same way as Martha and Kurill. She waited in the hospital with him for six days hoping for a positive outcome that never came.\n\n“… the doctors kept coming in over the days to tell me what else was failing inside of him,” this person wrote. “It was a rollercoaster nightmare week.”\n\n“Sickens me to death that no one will ever admit it was the vaccine that did it! If they do, they’ll likely start talking about risk vs. reward, like it’s an acceptable loss. Like they do about Martha and Kassidi. I’m furious.”\n\nAnother wrote sarcastically that zoo animals also need to be protected against other human ailments such as French fries, cars, gun violence and mountain biking accidents.\n\n“Just inject them with as much stuff as you can and don’t ask questions,” this person added.\n\nThe latest news about the death toll from Fauci Flu shots can be found at Genocide.news.", "opengraph": {"title": "Previously healthy gorilla dies of multiple organ failure following covid vaccination", "type": "article", "url": "https://www.ecology.news/2022-05-10-gorilla-dies-multiple-organ-failure-covid-vaccination.html", "site_name": "Ecology News", "description": "Martha the gorilla, who lived at the Gladys Porter Zoo in Brownsville, Tex., recently died after getting “vaccinated” for the Wuhan coronavirus (Covid-19). According to reports, Martha was perfectly healthy before getting the shot. Afterwards, however, she quickly developed “multiple organ failure” and died unexpectedly on April 19. A Western Lowland Gorilla who had recently […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/05/Gorillas-Baby-Ape.jpg"}, "tags": ["vaccine wars", "Big Pharma", "Vaccine deaths", "COVID", "gorilla", "vaccine injury", "multiple organ failure", "genocide", "Ecology", "depopulation", "spike protein", "vaccine damage", "Martha", "insanity", "Gladys Porter Zoo", "Plandemic", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/x8-2goAs7ig\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/x8-2goAs7ig"}], "links": ["https://igorchudov.substack.com/p/fully-vaccinated-gorilla-dies-of?s=r", "https://naturalnews.com/2022-05-03-globalists-to-depopulate-humans-animals-plant-life.html", "http://genocide.news", "https://igorchudov.substack.com/p/fully-vaccinated-gorilla-dies-of?s=r", "https://naturalnews.com/2022-05-03-globalists-to-depopulate-humans-animals-plant-life.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2022-05-10-gorilla-dies-multiple-organ-failure-covid-vaccination.html&linkname=Previously%20healthy%20gorilla%20dies%20of%20multiple%20organ%20failure%20following%20covid%20vaccination", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}