{"result_id": "103039", "URL": "https://ecology.news/2020-10-07-humans-ignite-almost-every-home-threatening-wildfires.html", "timestamp": "2023-04-25 15:01:28 CEST+0200", "meta": {"description": "Historic wildfires have been blazing through the West Coast over the past two months, devastating not just forests but also entire neighborhoods and communities in their wake. Experts are also reporting higher air pollution levels due to the fires, which compound the threat of COVID-19 even further. While droughts, longer fire seasons and unexpected weather events […]", "lang": "en", "keywords": "disaster,Ecology,environment,Fact Check,fires,goodresearch,goodscience,natural disasters,wildfire prevention,wildfires", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2020-10-07-humans-ignite-almost-every-home-threatening-wildfires.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Humans directly responsible for 97% of all wildfires that threaten homes in the US", "cleaned_text": "Humans directly responsible for 97% of all wildfires that threaten homes in the US\n\nHistoric wildfires have been blazing through the West Coast over the past two months, devastating not just forests but also entire neighborhoods and communities in their wake. Experts are also reporting higher air pollution levels due to the fires, which compound the threat of COVID-19 even further.\n\nWhile droughts, longer fire seasons and unexpected weather events like lightning storms have all had a hand in starting wildfires over the past few decades, a new study shows that humans have ignited a staggering 97 percent of all wildfires that threatened to engulf homes in the U.S. between 1992 and 2015.\n\nPublished in the journal Fire, the report drew on both housing and wildfire data, concluding that humans have sparked almost all wildfires over the past two decades in the wildland-urban interface through activities like debris burning and arson, where communities face a greater risk of wildfires.\n\nMoreover, the report showed around a million homes have been sitting within the boundaries of wildfires, five times more than previous estimates. Close to another 59 million more homes in the wildland-urban interface have been just 0.6 miles from a wildfire at some point as well.\n\nCommenting on their startling findings, lead author Nathan Mietkiewicz, an ecologist with the University of Colorado Boulder (CU-Boulder), said that people have been underestimating the wildfire risk to homes.\n\n“We’ve been living with wildfire risk that we haven’t fully understood,” he added.\n\nTo better understand wildfire trends in America, Mietkiewicz and his colleagues looked at data from 1.6 million government spatial records of wildfire ignition from 1992 to 2015. They also studied 120,000 incident reports of wildfires from CU Boulder’s Earth Lab, as well as 200 million housing records from a real estate database.\n\nTheir findings showed that human-started wildfires threatened an average of 2.5 million homes in the wildland-urban interface on an annual basis. When accounting for wildfires in undeveloped areas, the researchers found that humans were responsible for 84 percent of those fires between 1992–2012. Lightning, the main natural cause of wildfires, trailed behind.\n\nFurthermore, the group found that human-started wildfires within the wildland-urban interface ate up about a third of the national wildfire control budget — or $4.1 billion. However, the wildland-urban interface constitutes just 10 percent of the total land area in the U.S. in 2010.\n\nNonetheless, the wildland-urban interface was the site of 32 percent of all wildfire ignitions. But this comes as no surprise. Between 1990–2015, 32 million new homes were built in the wildland-urban interface, an incredible 145 percent increase. That’s 32 million more homes that face the risk of catastrophic wildfire on an annual basis.\n\nDespite these troubling figures, current housing trends suggest that people will not stop building new homes in the wildland-urban interface in the near future. That’s more homes that could add fuel to wildfires, and more people engaging in activities that could start them in the first place.\n\nThat being said, the research findings shed light on how best to mitigate wildfire risk given vulnerable communities. Jennifer Balch, the director of Earth Lab and a member of the research team, said that their report offers greater justification that prescribed burns can mitigate the risk of future wildfires.\n\nMoreover, the research findings underscore the importance of fireproofing homes or building fireproof ones in flammable landscapes. (Related: Green and insulating: Researchers develop sustainable fireproofing materials from waste paper.)\n\nOther feasible solutions for wildfire prevention in the wildland-urban interface include doing routine maintenance of infrastructures that could spark fires, organizing campaigns to reduce fireworks, and banning debris burning during hot conditions.\n\nVisit ClimateScienceNews.com to learn more about the impact of wildfires on communities.", "opengraph": {"title": "Humans directly responsible for 97% of all wildfires that threaten homes in the US", "type": "article", "url": "https://www.ecology.news/2020-10-07-humans-ignite-almost-every-home-threatening-wildfires.html", "site_name": "Ecology News", "description": "Historic wildfires have been blazing through the West Coast over the past two months, devastating not just forests but also entire neighborhoods and communities in their wake. Experts are also reporting higher air pollution levels due to the fires, which compound the threat of COVID-19 even further. While droughts, longer fire seasons and unexpected weather events […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2020/10/wildfires-are-tearing-through-colorado-springs-again.jpg"}, "tags": ["Fact Check", "disaster", "Ecology", "natural disasters", "environment", "wildfire prevention", "wildfires", "fires", "goodresearch"], "tweets": [], "movies": [], "links": ["https://phys.org/news/2020-09-humans-ignite-wildfire-threatens-homes.html", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwjf553Coo3sAhUel3IEHYokAMUQFjAAegQIOBAC&url=https%3A%2F%2Fwww.colorado.edu%2F&usg=AOvVaw0QKS2xkFYLwjBtH_8SlOz3", "https://cires.colorado.edu/news/line-fire", "https://www.mdpi.com/2571-6255/3/3/50", "https://www.naturalnews.com/2019-04-28-researchers-develop-sustainable-fireproofing-materials-waste-paper.html", "https://climatesciencenews.com", "https://phys.org/news/2020-09-humans-ignite-wildfire-threatens-homes.html", "https://cires.colorado.edu/news/line-fire", "https://www.mdpi.com/2571-6255/3/3/50"], "authors": [], "publish_date": null}