{"result_id": "103023", "URL": "https://ecology.news/2022-03-17-climate-alarmists-now-against-greening-earth.html", "timestamp": "2023-04-25 15:01:16 CEST+0200", "meta": {"description": "The global warming narrative is shifting once again as climate change alarmists decry the “greening” of the planet. New climate models released by the University of Michigan claim that increased plant growth around the world due to supposedly warmer temperatures is a bad thing because, get this: it will supposedly boost pollen allergies. Planet Earth […]", "lang": "en", "keywords": "allergies,Australia,badhealth,badpollution,badscience,climate alarmists,climate change,disinfo,fake science,forests,global warming,Great Britain,greening,insanity,junk science,Libtards,pollen season,propaganda,research,stupid,University of Michigan", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2022-03-17-climate-alarmists-now-against-greening-earth.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Climate change alarmists now say they’re AGAINST greening planet Earth because plants cause pollen allergies", "cleaned_text": "Climate change alarmists now say they’re AGAINST greening planet Earth because plants cause pollen allergies\n\nThe global warming narrative is shifting once again as climate change alarmists decry the “greening” of the planet.\n\nNew climate models released by the University of Michigan claim that increased plant growth around the world due to supposedly warmer temperatures is a bad thing because, get this: it will supposedly boost pollen allergies.\n\nPlanet Earth should basically become a desert, the models suggest, because that will help to prevent people from getting sniffles during springtime.\n\n“Our latest study finds that the U.S. will face up to a 200 percent increase in total pollen this century if the world continues producing carbon dioxide emissions from vehicles, power plants and other sources at a high rate,” reads a new essay released by UMich’s Yingxiao Zhang and Allison L. Steiner.\n\n“Pollen season in general will start up to 40 days earlier in the spring and last up to 19 days longer than today under that scenario.”\n\nAs increasingly more plants appear due to allegedly rising temperatures, the pollen load released into the atmosphere will also increase. This could cause some people to experience a runny nose or feelings of a head cold.\n\n“Rising global temperatures will boost plant growth in many areas, and that, in turn, will affect pollen production,” the essay adds. “But temperature is only part of the equation. We found that the bigger driver of the future pollen increase will be rising carbon dioxide emissions.”\n\n“The higher temperature will extend the growing season, giving plants more time to emit pollen and reproduce. Carbon dioxide, meanwhile, fuels photosynthesis, so plants may grow larger and produce more pollen. We found that carbon dioxide levels may have a much larger impact on pollen increases than temperature in the future.”\n\n“Science” almost never seeks to get to the root of the problem\n\nThis essay corresponds with a paper published in the journal Nature that lays out a manifesto for why the greening of the planet is somehow a bad thing.\n\nCompletely ignored in the research is the fact that allergies are on the rise for reasons that have nothing to do with climate change or global warming. One of the most prominent triggers of allergies is vaccination, it turns out.\n\nAnother trigger of allergies is a lack of exposure to the outdoors. Research out of Sweden found that children who grow up on dairy farms tend to have stronger immune systems with fewer inflammatory episodes caused by allergens.\n\nPlaying in the dirt – and clean, pesticide-free dirt, just to be clear – is a powerful way for children to develop immunity to allergies, so to speak. None of this is mentioned in the Nature paper decrying planetary “greening,” by the way.\n\nAnother factor completely ignored in the Nature paper is the fact that warmer does not automatically mean more pollen. The author of the Watts Up With That? blog says that his allergies actually got better after he moved from cold Great Britain, where pollen season is shorter, to Australia, where pollen season is much longer.\n\n“Why? Even though the pollen season is longer in my new home, it seems more spread out,” he says.\n\n“The pollen explosion in cold places like Britain tends to be short duration but extremely intense. It has to be intense, because the growing season is short. Pollination for many plants must occur right at the start of the growing season, or fruits and seeds might not mature fast enough to be ready before the frost arrives.”\n\n“In warmer places, there is much less pressure on plants to seize every precious day of growing season. Plants flower most of the year, and fruits like citrus comfortably continue growing through winter, usually maturing the following Spring.”\n\nMore related news about climate hysteria can be found at Climate.news.", "opengraph": {"title": "Climate change alarmists now say they’re AGAINST greening planet Earth because plants cause pollen allergies", "type": "article", "url": "https://www.ecology.news/2022-03-17-climate-alarmists-now-against-greening-earth.html", "site_name": "Ecology News", "description": "The global warming narrative is shifting once again as climate change alarmists decry the “greening” of the planet. New climate models released by the University of Michigan claim that increased plant growth around the world due to supposedly warmer temperatures is a bad thing because, get this: it will supposedly boost pollen allergies. Planet Earth […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/03/Scared-Climate-Change.jpg"}, "tags": ["climate alarmists", "climate change", "Australia", "Great Britain", "greening", "Libtards", "research", "stupid", "allergies", "forests", "University of Michigan", "disinfo", "global warming", "insanity", "pollen season", "propaganda"], "tweets": [], "movies": [], "links": ["https://wattsupwiththat.com/2022/03/15/claim-climate-change-driven-plant-growth-is-bad/", "https://umich.edu/", "https://www.nature.com/articles/s41467-022-28764-0#article-info", "https://naturalnews.com/055457_vaccines_food_allergies_CDC_study.html", "https://naturalnews.com/046055_natures_vaccines_allergies_dairy_farms.html", "http://climate.news", "https://wattsupwiththat.com/2022/03/15/claim-climate-change-driven-plant-growth-is-bad/", "https://www.nature.com/articles/s41467-022-28764-0#article-info", "https://naturalnews.com/055457_vaccines_food_allergies_CDC_study.html", "https://naturalnews.com/046055_natures_vaccines_allergies_dairy_farms.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2022-03-17-climate-alarmists-now-against-greening-earth.html&linkname=Climate%20change%20alarmists%20now%20say%20they%E2%80%99re%20AGAINST%20greening%20planet%20Earth%20because%20plants%20cause%20pollen%20allergies", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}