{"result_id": "103018", "URL": "https://ecology.news/2018-06-03-oil-companies-in-saudi-arabia-nanotechnology-for-petroleum-extraction.html", "timestamp": "2023-04-25 15:01:12 CEST+0200", "meta": {"description": "There are few greater oxymorons than “environment-friendly oil company,” especially if said company is the biggest example in the world. But Saudi Aramco is trying to do just that, using nanotechnology to max out the petroleum from its oil wells while minimizing environmental pollution, an article in Nanowerks stated. Worcester Polytechnic Institute (WPI) professor Nancy Burnham […]", "lang": "en", "keywords": "discoveries,Ecology,energy source,energy technology,environ,environment,environment protection,future tech,goodpollution,goodscience,green living,nanoparticles,nanotechnology,oil companies,oil drill,oil extraction,oil fields,oil industry,oil well,petroleum,petroleum extraction,pollution", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://ecology.news/2018-06-03-oil-companies-in-saudi-arabia-nanotechnology-for-petroleum-extraction.html", "encoding": "UTF-8"}, "image": null, "domain": "ecology.news", "title": "Oil companies in Saudi Arabia use nanotechnology for petroleum extraction to minimize environmental pollution", "cleaned_text": "Oil companies in Saudi Arabia use nanotechnology for petroleum extraction to minimize environmental pollution\n\nThere are few greater oxymorons than “environment-friendly oil company,” especially if said company is the biggest example in the world. But Saudi Aramco is trying to do just that, using nanotechnology to max out the petroleum from its oil wells while minimizing environmental pollution, an article in Nanowerks stated.\n\nWorcester Polytechnic Institute (WPI) professor Nancy Burnham is an environmentalist at heart. But after working alongside the Saudi Arabian company for her recent sabbatical study, even she was impressed by the company’s conscious efforts to disrupt the environment as little as possible.\n\nSaudi Aramco is owned and operated by the Kingdom of Saudi Arabia. The oil company produces both petroleum and chemical products for customers around the world.\n\nBurnham admitted that the petroleum products from oil companies are valuable and vital. She also noted that many companies can see far enough into the future that they have invested in renewable energy sources for when the oil deposits run out.\n\nFor her sabbatical, Burnham cooperated with Saudi Aramco’s nanotechnology research center in Boston, Massachusetts. The unlikely allies looked into ways to get the most oil out of the ground. (Related: USDA scientists are reusing discarded almond shells and hulls to create renewable products, from biodegradable plastics to biofuel.)\n\nGetting the last drop from fewer oil wells is better for nature and economy\n\nOil does not come gushing out of the ground once a well has reached the reservoir. Only 10-25 percent of the oil rises to the surface on its own.\n\nIt takes more work to get the next 20-25 percent out of the ground. The last part, which can account for 50-70 percent of the total oil in the reservoir, will be even more challenging.\n\nOne option for oil companies is to get the first quarter or half of the oil before moving to a new site. But moving from one site to another is both inefficient and imprudent.\n\nExtracting half the oil from a well will need infrastructure to be built on-site. That massive investment cannot be transferred to the new site.\n\nFurthermore, oil spills at ground level cause many of the dangers during the extraction process. Burnham believed that reducing the number of oil wells lowered the chances of an accidental spill.\n\nIn addition, oil companies cannot waste available oil. It will take at least 30 years for the U.S. to complete its transition to all-renewable energy sources.\n\nRenewable sources like solar, wind, and hydroelectric power are also not 100 percent reliable. Automobiles, homes, and various production processes will still need oil for the time being.\n\nNanotechnology helps locate new drill sites and speeds up oil flow\n\nOil companies need technology and tools to extract that oil. First, they have to find that oil from within the many layers of rock that make up the field.\n\nA field with multiple wells makes detection easier because using one causes the underground oil to flow. Engineers can inject nanoparticles into that active well, where they will be carried away.\n\nAfter a few weeks, the nanoparticles will start popping up in the surrounding wells. This shows the direction of the flowing oil, which helps engineers determine where to place future wells.\n\nAnother complication is the tendency of oil particles to either clump together or cling to rock walls. This adhesive property slows down the movement of oil particles between wells.\n\nBurnham and Shannon Eichmann of Saudi Aramco detailed how to resolve that problem via nanotechnology. In their study, nanoparticles can change the chemistry of the oil particles and reduce their adhesion.\n\nKeep track of both good and bad things the oil companies are doing to the environment at FrackingWatch.com.", "opengraph": {"title": "Oil companies in Saudi Arabia use nanotechnology for petroleum extraction to minimize environmental pollution", "type": "article", "url": "https://www.ecology.news/2018-06-03-oil-companies-in-saudi-arabia-nanotechnology-for-petroleum-extraction.html", "site_name": "Ecology News", "description": "There are few greater oxymorons than “environment-friendly oil company,” especially if said company is the biggest example in the world. But Saudi Aramco is trying to do just that, using nanotechnology to max out the petroleum from its oil wells while minimizing environmental pollution, an article in Nanowerks stated. Worcester Polytechnic Institute (WPI) professor Nancy Burnham […]", "image": "https://www.ecology.news/wp-content/uploads/sites/344/2022/04/Oil-Well-Pumps-Field-Clouds.jpg"}, "tags": ["oil extraction", "petroleum extraction", "oil industry", "energy source", "oil fields", "future tech", "environment protection", "environment", "petroleum", "nanotechnology", "energy technology", "nanoparticles", "oil well", "green living", "oil companies", "environ", "Ecology", "oil drill", "discoveries"], "tweets": [], "movies": [], "links": ["https://www.nanowerk.com/nanotechnology-news/newsid=50000.php", "https://www.wpi.edu", "https://www.naturalnews.com/2018-04-23-usda-scientists-are-reusing-discarded-almond-shells-and-hulls-to-create-renewable-products.html", "https://www.wpi.edu/news/using-nanotechnology-improve-efficiency-petroleum-extraction", "http://frackingwatch.com/", "https://www.nanowerk.com/nanotechnology-news/newsid=50000.php", "https://www.wpi.edu/news/using-nanotechnology-improve-efficiency-petroleum-extraction", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fecologynews%2F2018-06-03-oil-companies-in-saudi-arabia-nanotechnology-for-petroleum-extraction.html&linkname=Oil%20companies%20in%20Saudi%20Arabia%20use%20nanotechnology%20for%20petroleum%20extraction%20to%20minimize%20environmental%20pollution", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}