{"result_id": "104005", "URL": "https://educateinspirechange.org/david-ickes-new-theory-moon-not-think/", "timestamp": "2023-04-25 15:01:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/david-ickes-new-theory-moon-not-think/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "David Icke's New Theory: The Moon Is Not What You Think It Is !!", "cleaned_text": "David Icke’s “Moon Matrix” theory is the point where people believe he has tipped into straight up madness. Anyone who has followed Icke’s progression of theories knows that he has transitioned into deeper and deeper levels of understanding, and if you’ve made it past his reptilian-shape shifting material, then the moon matrix stuff shouldn’t be so difficult to grasp.\n\nThe Moon Matrix theory stems from Icke’s virtual reality hypothesis. He says that our world was created by an advanced being for the purpose of experiencing something beyond the oneness-one consciousness existence that we have all originated from.\n\nThe Moon Matrix. What is the Moon(Video)\n\nWe experience this physical reality, and then go back to the one source when our physical bodies die. All of our laws of physics are just “software” rules created by this advanced being.\n\nThe virtual reality world we experience isn’t what it was intended to be, by our advanced creator. We aren’t able to access the full potential of what this earthly experience was meant to embody. We don’t understand this because all we’ve ever known is our five senses of touch, smell, see, taste, and hear.\n\nThere are several more senses and abilities that we can’t lock into.\n\nThis idea could be expressed as an example of when some spiritual mediums are able to communicate with the dead. Most people will discount the medium as scam artist, when in fact there are several legitimate mediums that can harness this ability. We all have these abilities, we just don’t know how to grasp them and use them properly. Why is this? It is because of the Moon Matrix theory.\n\nIcke believes that the reptilians have closed off the many frequencies that we can’t sense currently, similar to a firewall on a PC. This firewall/transmission comes from the moon and it blocks certain abilities that are embedded in our physical bodies, but unknown to us. He says black holes resonate at a frequency that in turn, dictates how much of the awareness is emitted by the sun in the form of photons. This begs the question; what would the emission of photons from the sun do that affects our bodies and prevents us from accessing our abilities?\n\nThere is an energy force called Ch’i, which flows through the body’s meridian network. Ch’i is sort of like the Star Wars’ force, where our life energy flows throughout our body and links our body to the environmental surroundings all around us. It enters our body through acupuncture points and flows through our tissues and illness occurs when these acupuncture points become blocked up (or any part of the energy path for that matter). This Ch’i energy is believed to be a form of photon energy. Photon energy is released by atomic processes and we observe this phenomenon as light. Whether or not Ch’i is in fact photon energy or not is beyond me, but Icke asserts that it is in his book. That being said, if we take our body’s life energy to be photon energy, then we could say that there might be a relation between photon energy emitted by the Sun and what we experience in bodily form.\n\nSince I’m no expert on astronomy or Chinese energy, we’ll just have to make these assumptions to be true so that we can press on with this theory to understand what Icke is saying.\n\nIcke believes that the moon is an interdimensional, interdensity portal for entities and energies from other dimensions. He believes that aliens use the moon as a home base for hijacking signals from the universe so that our bodily forms that are experiencing this virtual reality on Earth, can’t fully experience what our creator meant for it to be. These aliens are the same reptilian shape-shifters that Icke claims are responsible for much of the suffering on our planet. Reptilians want to filter anything beyond our five senses so that it manipulates what kind of world we can experience.\n\nThe reptilians keep us locked into these five states because it is a much lower density experience. Low frequency experiences include division, conflict, and emotional trauma, all of which are created by capitalistic, war hungry, religious zealot nations. The higher frequencies of experience are ones of harmony and understanding how we are all connected (similar to a life energy force of Ch’i, freely flowing). This higher state of consciousness is what the ancient cultures understood in the supposed Golden Ages of time and this is when the various mysteries were created. These megaliths such as the Great Pyramids of Giza, or the Puma Punku stones are all expressions of what our ancient cultures wanted us to be aware of.\n\nIcke claims that Einstein’s theory of light being the fastest anything can travel is false; it is simply the speed limit the reptilian firewall imposes on us. Icke says when you break this speed barrier you leave the matrix. This is how the UFOs and reptilians travel interdimensionally. This is why weird things appear to happen to us as we approach the speed of light (it is actually perceived by the observer since we can’t comprehend these things, thanks to the aforementioned firewall). At first I believed this part of Icke’s theory to be without merit, but in the news I read about an Italian professor who was challenging Einstein’s theory of relativity and how he arguably might’ve sent bits of matter whirling at speeds faster than the speed of light. This observation was later proven incorrect, but it appears that there may be challenges to Einstein still in process.\n\nAnother key element to support Icke’s theory of the existence of this reptilian firewall is the discussion of dark matter. Dark matter is called “dark” because it’s not in the spectrum that telescopes (or human beings) can see. Dark matter doesn’t emit electromagnetic radiation (e.g. infrared, UV, radio, xray or gamma) so it’s undetectable, hence “dark.” Dark matter just sits in a different frequency range than what we know (due to the firewall). The electromagnetic spectrum that we can detect is only 0.005 percent of what exists in the entire universe (with visible light being only a tiny fraction of that). By default, dark matter is a large majority of our universe that we cannot detect, so who are we to say that concepts like a firewall or virtual reality matrix are impossible.\n\nThe connection between the moon and earth is crystalline. There are quartz crystals all over the planet, and they generate/convert waveforms to a particular frequency. The crystals in earth are there to be receiver/transmitters, sort of like re-broadcasters of signals. These signals are from the sun’s photons. The moon has hacked that connection and transmits its own message to us, which our DNA picks up (our DNA is like an antenna) and it is used to manipulate our senses and emotions. Our bodies (the antennas) must be tuned to this moon frequency so they keep us in low frequency vibrations through the food we eat, pollution, vaccines, music, images, films, etc. that keep us held in states of fear from which the reptilians feed off of.\n\nThis is yet another bold step for the reader to take in order to follow along Icke’s journey. He believes that reptilians feed off of these “low-density” energies that we emit when we experience negative things such as fear, disaster, war, violence, etc. When our bodies experience these things we emit an energy that sits in a certain frequency range in which these reptilian shape shifters may feed off of. They use this as a form of sustenance to shape shift into more human forms so they can directly come to our planet and manipulate us for the time being. The reptilians have also created a hybrid bloodline (what we know as the “Illuminati”) who have mostly human attributes that can do the reptilians’ bidding here on Earth. They have been doped with a slightly different bodily composition that allows them to be more directly manipulated than the entire human race.\n\nThose are the basics of the Moon Matrix theory of David Icke. I’ve glossed over them very quickly, so feel free to read it straight from his book for more supporting facts. Whether or not I personally believe this is still in limbo. Setting the Moon Matrix idea aside, the moon has been known to influence human behavior. Icke asserts that the Moon is capable of blocking certain abilities of the pineal gland, which is our “third” eye that connects us with this one-consciousness idea. The ancient Egyptians did in fact hold this same worship of the pineal gland to be the third eye, so there could very well be a connection that needs explored. Icke’s Moon Matrix theory may sound far-fetched, but it sets a path up for which we can begin to explore the possibility.", "opengraph": {"locale": "en_US", "type": "article", "title": "David Icke's New Theory: The Moon Is Not What You Think It Is !!", "description": "The Moon Matrix. What is the Moon", "url": "https://educateinspirechange.org/david-ickes-new-theory-moon-not-think/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2017-03-18T16:31:02+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2017/03/hollow_moon.jpg", "image:width": "600", "image:height": "321"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/j2IGFbzGCeg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/j2IGFbzGCeg"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/VJorKZEbQsA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/VJorKZEbQsA"}], "links": ["http://www.activistpost.com/2012/04/david-ickes-moon-matrix-theory.html"], "authors": [], "publish_date": "2017-03-18T16:31:02+00:00"}