{"result_id": "104009", "URL": "https://educateinspirechange.org/unite-oppressors-must-agree-desire-free/", "timestamp": "2023-04-25 15:01:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/unite-oppressors-must-agree-desire-free/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "To Unite Against Our Oppressors We Must Agree on our Desire to be Free", "cleaned_text": "I’ve never seen a war like it. Here I am, attempting to sit as free as I can in my own space, watching the war of ideology and information reach unprecedented heights:\n\nThe list goes on.\n\nNow of course many of these battles have been going on since our very conception, but it really has come to a point where it is all so accentuated that we are saturated in innumerable sub-battles too. To cite one example, anarchists want zero government but then there are the minarchists who want very limited government.\n\nNow, I’m not saying we shouldn’t support what we most resonate with, nor am I knocking this process because it is all just part of a grander cycle, but I must admit I’m disappointed that so many allegedly ‘conscious’ people allow themselves to get fully sucked into it without recognising and respecting the greater goal of undermining the divide and conquer strategy.\n\nSimply, we need to achieve some sort of unification so we can actually bring sovereignty, truth, justice and honour back to our world. There’s just no denying it; it’s absolutely essential for us to move forward.\n\nAs I’ve been saying for a while now, if we create a mechanism or agreement for uniting those who understand the main event, which is quite obviously ‘control vs freedom’, then it would help our cause to heights never before seen.\n\nThat’s not to say that we shouldn’t stand up, for example, against the pharmaceutical-medico complex and their destruction of true health management and the suppression of sacred medicines. Nor am I saying that we shouldn’t have areas that we personally invest more energy in, such as freeing cannabis for health and other uses.\n\nWhat I am saying is that if the hundreds of thousands, if not millions of people who ‘consciously’ value liberty over oppression could just put the smaller stuff to the side for a moment and hold higher regard for the collective power we have, then all the other nuances could be respectfully debated and resolved as the future unfolds.\n\nEssentially, we have to take back our power first before we know exactly what we should do with it.\n\nHow can this be done? Well, I’ve put forward a proposal before but that’s beside the point. I don’t care how it’s achieved, but for right now very few people, including independent researchers and presenters, are even bothering to talk about it.\n\nI don’t care if it’s as simple as “we agree that pursuing individual and community sovereignty is paramount for creating an ethical future for humanity”.\n\nJust imagine if millions of people supported that statement by sharing it through their networks and talking about it with their family and friends. Make no mistake; at least half of the population wouldn’t even understand what it means, so it’s at least a catalyst for helping them to. The ironic thing is that most people believe they’re free, but they’re not. We’re all subject to the subtle but advanced enslavement of debt, corporate law and even ideology, so the previous statement will at the least help more people understand how the system is truly being run.\n\nIn any case, it’s one reason why I’ve been relatively quiet this year. It’s been confusing for me, as I’m sure it has for most of us. Granted, I have been busy growing organic food, getting more involved with my local community, completing my book and looking after my family and myself, but I haven’t seen any other angle to take on all this mess except for the one I have been advocating here and as a guest in various interviews.\n\nSo, I’ve simply watched what’s happening, sometimes less intensely than others, and tried to learn as much as I can without hardening my beliefs into dogmas. Just recently actually I had a series of experiences that forced me to evolve one of the deepest philosophies I have, yet that only happened because I was OPEN to it happening.\n\nI just wish we all valued our responsibility to change our minds when we need to. Like really, really respect it. After all, it’s been a bloody consistent process for all of us so I’m not sure why we get to a point where we think it will no longer happen.\n\nAdmittedly, it’s challenging at the moment because we are at peak division, however that’s about to change. The flow of the cycle will continue, which means that soon we’ll find it easier to agree more and fight less with each other.\n\nThe shift from ‘us vs them’ to ‘us’ is coming right up.\n\nPhillip J. Watt is an author, presenter, researcher and health coach who lives on the Mid North Coast of NSW Australia. His written and film work deals with topics from ideology to society, as well as self-development. Follow him on Facebook, listen to his Podcast on SoundCloud or Itunes, watch his films and video interviews at his YouTube Channel or visit his websites Pushing the Tipping Point and Vitality Guidance.", "opengraph": {"locale": "en_US", "type": "article", "title": "To Unite Against Our Oppressors We Must Agree on our Desire to be Free", "description": "I’ve never seen a war like it. Here I am, attempting to sit as free as I can in my own space, watching the war of ideology and information reach unprecedented heights: Left vs right. Alternative vs mainstream. Independent vs corporate. Women vs men. Non-gender vs gender. Religion vs atheism. Materialism vs idealism. External vs … To Unite Against Our Oppressors We Must Agree on our Desire to be Free Read More »", "url": "https://educateinspirechange.org/unite-oppressors-must-agree-desire-free/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2017-07-18T18:32:27+00:00", "article:modified_time": "2021-07-13T15:09:48+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2017/07/freedom.jpg", "image:width": "702", "image:height": "459"}, "tags": [], "tweets": [], "movies": [], "links": ["http://themindunleashed.com/2017/04/enjoy-meltdown-control-system-exposing.html", "https://www.facebook.com/PhillipJamesWatt", "https://web.archive.org/web/20170901090641/http://www.pushingthetippingpoint.com/podcast-intro.html", "https://itunes.apple.com/us/podcast/redesigning-society-w-powerhouse-guests/id1241963519?mt=2", "https://www.youtube.com/channel/UCVJWyS3TWJeIvyjETKunDYg/featured", "https://web.archive.org/web/20190608203931/https://www.pushingthetippingpoint.com/", "http://www.vitalityguidance.com/", "http://themindunleashed.com/2017/07/unite-agreement-desire-free.html"], "authors": [], "publish_date": "2017-07-18T18:32:27+00:00"}