{"result_id": "104004", "URL": "https://educateinspirechange.org/remarkable-new-alzheimers-treatment-fully-restores-memory-function/", "timestamp": "2023-04-25 15:01:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/remarkable-new-alzheimers-treatment-fully-restores-memory-function/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "This remarkable new Alzheimer’s treatment fully restores memory function", "cleaned_text": "Australian researchers have come up with a non-invasive ultrasound technology that clears the brain of neurotoxic amyloid plaques – structures that are responsible for memory loss and a decline in cognitive function in Alzheimer’s patients.\n\nIf a person has Alzheimer’s disease, it’s usually the result of a build-up of two types of lesions – amyloid plaques, and neurofibrillary tangles. Amyloid plaquessit between the neurons and end up as dense clusters of beta-amyloid molecules, a sticky type of protein that clumps together and forms plaques.\n\nNeurofibrillary tangles are found inside the neurons of the brain, and they’re caused by defective tau proteins that clump up into a thick, insoluble mass. This causes tiny filaments called microtubules to get all twisted, which disrupts the transportation of essential materials such as nutrients and organelles along them, just like when you twist up the vacuum cleaner tube.\n\nAs we don’t have any kind of vaccine or preventative measure for Alzheimer’s – a disease that affects 343,000 people in Australia, and 50 million worldwide – it’s been a race to figure out how best to treat it, starting with how to clear the build-up of defective beta-amyloid and tau proteins from a patient’s brain. Now a team from the Queensland Brain Institute (QBI) at the University of Queensland have come up with a pretty promising solution for removing the former.\n\nPublishing in Science Translational Medicine, the team describes the technique as using a particular type of ultrasound called a focused therapeutic ultrasound, which non-invasively beams sound waves into the brain tissue. By oscillating super-fast, these sound waves are able to gently open up the blood-brain barrier, which is a layer that protects the brain against bacteria, and stimulate the brain’s microglial cells to activate. Microglila cells are basically waste-removal cells, so they’re able to clear out the toxic beta-amyloid clumps that are responsible for the worst symptoms of Alzheimer’s.\n\nThe team reports fully restoring the memory function of 75 percent of the mice they tested it on, with zero damage to the surrounding brain tissue. They found that the treated mice displayed improved performance in three memory tasks – a maze, a test to get them to recognise new objects, and one to get them to remember the places they should avoid.\n\n“We’re extremely excited by this innovation of treating Alzheimer’s without using drug therapeutics,” one of the team, Jürgen Götz, said in a press release. “The word ‘breakthrough’ is often misused, but in this case I think this really does fundamentally change our understanding of how to treat this disease, and I foresee a great future for this approach.”\n\nThe team says they’re planning on starting trials with higher animal models, such as sheep, and hope to get their human trials underway in 2017.\n\nYou can hear an ABC radio interview with the team here.\n\nIf you enjoyed this article please SHARE it.\n\nYou can follow us on Instagram HERE\n\nAnd if you haven’t already please help us reach 3 million Facebook fans by following us HERE\n\nMy Name is Kasim Khan and I am the founder of Educate Inspire Change. I have just returned from a 1 week stay at the world’s first medically licensed plant medicine retreat, it’s called Rythmia and is in the beautiful country of Costa Rica. During this week I had the most profound and transformational experience of my life and it’s not only me . . .over 95% of people who embark on this journey at Rythmia reports that they too had a life changing miracle. This magical place had such a profound effect on me that I am now dedicating my time to sharing this healing opportunity of a lifetime with you all.\n\nPlease click HERE to find out more information and book yourself in for the most magical week of your life.", "opengraph": {"locale": "en_US", "type": "article", "title": "This remarkable new Alzheimer’s treatment fully restores memory function", "description": "Of the mice that received the treatment, 75 percent got their memory function back.", "url": "https://educateinspirechange.org/remarkable-new-alzheimers-treatment-fully-restores-memory-function/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2016-12-07T17:36:33+00:00", "article:modified_time": "2021-07-07T16:50:43+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2016/12/000brain-tangles_1024.jpg", "image:width": "755", "image:height": "415"}, "tags": [], "tweets": [], "movies": [], "links": ["http://thebrain.mcgill.ca/flash/d/d_08/d_08_cl/d_08_cl_alz/d_08_cl_alz.html", "http://thebrain.mcgill.ca/flash/d/d_08/d_08_cl/d_08_cl_alz/d_08_cl_alz.html", "http://stm.sciencemag.org/content/7/278/278ra33", "http://www.futuretimeline.net/blog/2015/03/14-2.htm#.VQkT21OUdjH", "http://www.futuretimeline.net/blog/2015/03/14-2.htm#.VQj_v1OUdjG", "http://www.abc.net.au/radio/programitem/peOWD0e2P3?play=true", "http://www.sciencealert.com/new-alzheimer-s-treatment-fully-restores-memory-function", "https://www.instagram.com/educate_inspire_change/", "https://web.archive.org/web/20210309164429/https://www.facebook.com/EducateInspireChange.org", "https://www.instagram.com/consciouskash/", "http://rythmia.link/khan", "http://rythmia.link/khan", "http://rythmia.link/khan"], "authors": [], "publish_date": "2016-12-07T17:36:33+00:00"}