{"result_id": "104006", "URL": "https://educateinspirechange.org/9-ways-activate-psychic-powers/", "timestamp": "2023-04-25 15:01:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/9-ways-activate-psychic-powers/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "9 Ways To Activate Your Psychic Powers", "cleaned_text": "Have you ever had a bad feeling about something and then it happened? While some people have more psychic abilities activated than others, there are still ways to help you navigate life and perhaps even help others by expanding your basic psychic abilities.\n\nThe main types of psychic powers are called the “clairs”.\n\nClairvoyance is “clear seeing”, including seeing spirits, auras, and/or visions or flashes of pictures with the 3rd eye.\n\nClairaudience is “clear hearing”, like hearing tones, voices, or music. If it is a voice, it could be the spirit’s voice, a guide’s voice, or the psychic’s own voice,\n\nClairsentience is “clear sensing or feeling”- which is the ability to sense energy fluctuations or having intuition (a gut feeling).\n\nClaircognizance is “clear knowing”…you just KNOW!\n\nEveryone is born with psychic abilities. Most babies and small children are able to see energy fields until around five or six years of age until the brain learns to distinguish between the inner field and the outer field. Some people have more innate abilities from birth than others, such as people who know that their life mission is to connect with the other side to bring forth messages in service to others. Psychics who do readings and mediumship for a living have usually had a lifetime of practice. Most messages are clues and aren’t meant to be taken literally, sometimes they have to be deciphered based on past experience with that same message.\n\nFor instance, world renowned psychic medium John Edward watched movies all of his life, and his team of guides play charades with him by bringing an actor’s picture to show him a first name clue. If he has strong clairvoyance but not strong clairaudience, he has to to put the pieces of the puzzle together rather than just hearing the name. For him, it seems to be way easier to send a flash picture than a voice through from the other side.\n\nActivating your psychic powers is as easy as making the intention. However, to truly get somewhere on the path to inner knowing and seeing, here are nine proven ways to help you to expand your abilities:\n• Release fears. Fears manifest in the form of energetic blocks and can clog up your abilities. Fears can come from trauma of a paranormal event (as a child for example, seeing the bogey man), a fear of being weird or different because you had something happen that your friends or family did not understand, or a fear of seeing the future (Precognition). When I was a teenager, I had a dream that a girl in my school (that I didn’t like) was in a terrible accident. A few days later, the dream “came true”, and I was so freaked out that it shut my abilities off at that time. I thought I had caused it when in fact I was peering into the future.\n• Close your eyes, take a few deep breaths, and intend. To begin working on your abilities, find a quiet spot where you can sit with your spine erect or lie down if that is more comfortable. Close your eyes and take a few deep breaths. Intend to activate your psychic abilities by focusing on your “third eye”.\n• Let go of expectations. Trying to force something will just block your energy field. Relax and “be” with yourself, and open your heart to receive.\n• Observe what comes through. Differentiate from higher frequency thoughts and 3d thoughts, like needing to wash clothes or run errands.\n• Focus on images or thoughts. If you get flashes of images, observe and intend for them to slow down. You may have to write the images down or talk into a recorder so that you can go back and focus on each picture. Some people see a movie. Images and movies can either be “inside” the head, or once you relax you can do an open eye meditation where they could appear “outside” of your head on a wall or in the corner of the room.\n• Ask for guidance and interpretation. We all have guides waiting to help us, but they need us to ask because of the law of free will. While you may not understand a message right away, the answer may come to you later on in many different ways.\n• Trust yourself and get confirmation. Trusting yourself is one of the hardest things, and also vitally important. It’s a good idea to hang out with a psychic that can tandem view with you so that you can verify or confirm the message.\n• Energy healing and decalcifying the pineal gland. Flouride and other toxins can “calcify” the pineal gland, which is an organ in the brain that connects us with the spiritual world. Stop using flouridated toothpaste and stop drinking tap water immediately. Work on a detox for heavy metals and do the best you can to follow a fresh organic diet free from GMO foods. Stay away from vaccines and turn your television off. These are just a few basic but important lifestyle changes to make if you are serious about activating your abilities. Energy healing such as reiki, massage, and pure bioenergy healing will clear and balance your energy field, allowing energy and thoughts to flow. Focus on the #1 blocked energy center- the heart, in combination with the third eye.\n• Use crystals. Crystals have the ability to store information as well as help you to tune into other frequencies. I use a clear quartz wand when I want to “tune in”, and if I get too far out there I’ll switch to a black tourmaline to bring me back to earth to analyze the message.\n\nHere is a great video Gregg Prescott did about opening your third eye. Everyone will find their own way that works for them, and sometimes it just happens spontaneously!\n\nAbout the author: Michelle Walling, CHLC is a Holistic Life Coach, international public speaker, writer, webmaster, and radio show host. In 2013, Michelle started her public career as a spiritual, metaphysical, and esoteric contributing writer for In5d.com and bodymindsoulspirit.com. Michelle is the creator and webmaster for MichelleWalling.com,cosmicstarseeds.com, thestarchildren.net, andhowtoexitthematrix.com, and is the co-creator for WooWoo Media.com. Michelle is the host of In5d’s Cosmic Awakening Showand In5d Network. Her personal Facebook page can be found here.", "opengraph": {"locale": "en_US", "type": "article", "title": "9 Ways To Activate Your Psychic Powers", "description": "By Michelle Walling Have you ever had a bad feeling about something and then it happened?  While some people have more psychic abilities activated than others, there are still ways to help you navigate life and perhaps even help others by expanding your basic psychic abilities. Basic types of Psychic Powers The main types of psychic … 9 Ways To Activate Your Psychic Powers Read More »", "url": "https://educateinspirechange.org/9-ways-activate-psychic-powers/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2018-07-23T06:49:49+00:00", "article:modified_time": "2021-07-13T16:45:52+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2018/07/3rd-eye-psychic-woman.jpeg", "image:width": "640", "image:height": "362"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1778", "height": "1000", "embed_code": "<iframe loading=\"lazy\" title=\"How To Open Your 3rd Eye - In5D Network\" width=\"1778\" height=\"1000\" src=\"https://www.youtube.com/embed/Kxvwuj3Dips?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Kxvwuj3Dips?feature=oembed"}], "links": ["http://in5d.com/how-to-refine-psychic-powers/", "http://johnedward.net/", "http://www.michellewalling.com/", "http://in5d.com/", "https://web.archive.org/web/20210712151514/http://bodymindsoulspirit.com/", "http://www.michellewalling.com/", "http://cosmicstarseeds.com/", "http://thestarchildren.net/", "http://howtoexitthematrix.com/", "http://www.woowoomedia.com/", "https://www.youtube.com/channel/UCPM3ZiWqAyDE8nA7vYHTQcg/videos", "http://in5d.com/category/in5d-network-videos/", "https://web.archive.org/web/20210125122705/https://www.facebook.com/michelle.sukup.9"], "authors": [], "publish_date": "2018-07-23T06:49:49+00:00"}