{"result_id": "104003", "URL": "https://educateinspirechange.org/scientists-create-antibody-attacks-99-percent-hiv-strains/", "timestamp": "2023-04-25 15:01:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/scientists-create-antibody-attacks-99-percent-hiv-strains/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "Scientists create an antibody that attacks 99 percent of HIV strains", "cleaned_text": "With the help of genetic engineering, scientists were able to develop a ‘revolutionary’ antibody that fights off 99 percent HIV, according to preliminary studies in primates.\n\nThus, this “three-headed” antiviral acts on three fundamental parts of the virus to eliminate it safely.\n\nThe achievement was possible after many years of research, say experts.\n\nIt happens that the human organism, in the presence of a virus, generates defenses to attack it.\n\nThis is not so simple in the case of HIV because the virus mutates and changes its appearance to the point of being unrecognizable to the body.\n\nHowever, to the surprise scientists, after several years of infection, some patients end up developing “broad-spectrum neutralizing antibodies”, that is, defenses that are capable of killing a large number of strains of the virus and containing their expansion.\n\nTaking advantage of this phenomenon, scientists have genetically combined three broad-spectrum neutralizing antibodies into one, notes the study published in the journal Science.\n\n“The development of an effective AIDS vaccine has been challenging because of viral genetic diversity and the difficulty of generating broadly neutralizing antibodies (bnAbs). We engineered trispecific antibodies (Abs) that allow a single molecule to interact with three independent HIV-1 envelope determinants: the CD4 binding site, the membrane-proximal external region (MPER), and the V1V2 glycan site.” (Source)\n\nDr. Gary Nabel, a chief scientific officer at pharmaceutical company Sanofi and one of the report authors, told the BBC the results were “impressive”.\n\n“Unlike natural antibodies, this triple antiviral attacks several infectious targets in a single molecule,” added Nabel, lead author of the study.\n\nScientists experimented on 24 monkeys and realized that none of the primates who were given the tri-specific antibody developed an infection when they were later injected with the virus.\n\nAccording to reports, scientists expect to test the antibody in humans next years.\n\n“They are more potent and have greater breadth than any single naturally occurring antibody that’s been discovered,” he said.\n\n“We’re getting 99 percent coverage, and getting coverage at very low concentrations of the antibody.”\n\nThe new research included experts from the Harvard Medical School, The Scripps Research Institute and the Massachusetts Institute of Technology.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists create an antibody that attacks 99 percent of HIV strains", "description": "With the help of genetic engineering, scientists were able to develop a ‘revolutionary’ antibody that fights off 99 percent HIV, according to preliminary studies in primates. Thus, this “three-headed” antiviral acts on three fundamental parts of the virus to eliminate it safely. The achievement was possible after many years of research, say experts. It happens … Scientists create an antibody that attacks 99 percent of HIV strains Read More »", "url": "https://educateinspirechange.org/scientists-create-antibody-attacks-99-percent-hiv-strains/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2017-12-11T13:53:57+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2017/12/HIV.jpg", "image:width": "1005", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["http://science.sciencemag.org/lookup/doi/10.1126/science.aan8630", "http://science.sciencemag.org/content/358/6359/85", "http://www.bbc.co.uk/news/health-41351159", "http://science.sciencemag.org/content/358/6359/85"], "authors": [], "publish_date": "2017-12-11T13:53:57+00:00"}