{"result_id": "104011", "URL": "https://educateinspirechange.org/there-are-diseases-hidden-in-ice-and-they-are-waking-up/", "timestamp": "2023-04-25 15:01:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/there-are-diseases-hidden-in-ice-and-they-are-waking-up/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "There are diseases hidden in ice, and they are waking up", "cleaned_text": "Bacteria and viruses are ancient. Human beings have fought off various forms for centuries, many outbreaks resulting in mass deaths. One doesn’t need to go too far back in history to remember these effects – think of the bubonic plague and smallpox.\n\nWe have tried to fight back, developing vaccines from penicillin for example. Bacteria responded with evolved, antibiotic resistant strains and we are in an endless battle.\n\nWhat exactly would happen though if our current selves were exposed to ancient, deadly bacteria or viruses? Some dead for thousands of years, many never even encountered by humans before.\n\nWell, if things keep heading in the same direction regarding climate change, we are sure about to find out. Permafrost is melting, exposing ancient soil which is home to some pathogens which have been dormant for a very, VERY long time.\n\nIn the summer of 2016, Yamal Peninsula in the Arctic Circle had a rather frightening event unfold.\n\nA 12 year old boy died from anthrax exposure and another 20 odd people were also hospitalized.\n\nThe theory goes that roughly 75 years ago, there must have been an infected reindeer who died in the area, frozen under permafrost. There was a heatwave in the summer of 2016 which may have exposed the carcass, releasing anthrax into the water, soil and food supply which infected 2,000 nearby reindeer, leading to the reported human cases. What is concerning is the fear that this case may not be isolated.\n\nThe Earth is constantly warming up, which in turn is slowly melting deeper layers of permafrost, which is of course the perfect hiding place for bacteria, being kept alive for as long as a million years.\n\nWe are literally sitting on a Pandora’s Box of potential diseases and with the temperature of the Arctic Circle rising 3 times faster than anywhere else in the world, things are moving rather swiftly.\n\n“Permafrost is a very good preserver of microbes and viruses, because it is cold, there is no oxygen, and it is dark,” says evolutionary biologist Jean-Michel Claverie at Aix-Marseille University in France. “Pathogenic viruses that can infect humans or animals might be preserved in old permafrost layers, including some that have caused global epidemics in the past.”\n\nIt has been recorded that over a million reindeer have perished in the 20th Century alone due to anthrax, with many carcasses scattered throughout northern Russia in shallow graves.\n\nThe real fear however is what else lurks below.\n\nAt this stage, centuries of people and animals which were infected with various diseases are buried all over, with scientists discovering the RNA from the Spanish Flu virus in corpses which were once buried in Alaska’s Tundra region. Smallpox and the Bubonic Plague are likely to be buried in the same region.\n\nIn a 2011 study, Boris Revich and Marina Podolnaya wrote: “As a consequence of permafrost melting, the vectors of deadly infections of the 18th and 19th Centuries may come back, especially near the cemeteries where the victims of these infections were buried.”\n\nIn the 1890’s, a smallpox epidemic was recorded in Siberia. It wiped out 40% of one town. These bodies were shallowly buried under the upper layer of permafrost right on the banks of the Kolyma River. It is now 120 years later and that exact area is melting.\n\nScientists from the State Research Center of Virology and Biotechnology in Novosibirsk tested remains of Stone Age people which were discovered in southern Siberia. The also performed tests on corpses which were buried in a time of viral epidemics in the 19th Century which were buried in the same region.\n\nMany of the corpses displayed the sores which were characteristic of smallpox. The did not actually extract the virus itself, but detected fragments of smallpox DNA.\n\nScientists managed to revive bacteria discovered in an Alaskan pond which dated back 32,000 years. The microbes, called Carnobacterium pleistocenium, dated back to the Pleistocene period, a time when woolly mammoths walked the Earth.\n\nOnly 2 short years passed before scientists revived 8 million old bacteria which was extracted from a glacier located in the Beacon and Mullins valley of Antarctica.\n\nNot all bacteria is this resilient. Anthrax survives so well because it forms spores which are hardy. Tetanus and Clostridium botulinum, the pathogen responsible for botulism: a rare illness that can cause paralysis and even prove fatal are also spore borne.\n\nMany viruses can do the same.\n\nA 2014 study yielded some interesting results. 2 viruses were revived after their discovery in Siberia which were laying dormant for over 30,000 years. Known as Pithovirus sibericum and Mollivirus sibericum, they are both “giant viruses”, because unlike most viruses they are so big they can be seen under a regular microscope.\n\nThey quickly became infectious but fortunately for us, they only affect single celled amoebas. The frightening thing is, what else lies beneath.\n\nThe Arctic sea ice is melting and it’s happening at an alarming rate.\n\n“At the moment, these regions are deserted and the deep permafrost layers are left alone,” says Claverie. “However, these ancient layers could be exposed by the digging involved in mining and drilling operations. If viable virions are still there, this could spell disaster.”\n\nGiant viruses may be the most likely culprits for any such viral outbreak.\n\n“Most viruses are rapidly inactivated outside host cells, due to light, desiccation, or spontaneous biochemical degradation,” says Claverie. “For instance, if their DNA is damaged beyond possible repair, the virions will no longer be infectious. However, among known viruses, the giant viruses tend to be very tough and almost impossible to break open.”\n\nAccording to Claverie, the first viruses to affect Neanderthals and Denisovans could crop up rather fast, affecting both quite tremendously in that period.\n\n“The possibility that we could catch a virus from a long-extinct Neanderthal suggests that the idea that a virus could be ‘eradicated’ from the planet is wrong, and gives us a false sense of security,” says Claverie. “This is why stocks of vaccine should be kept, just in case.”\n\nHe has been profiling his finds and has since discovered bacteria thought to be dangerous to humans. The bacteria display DNA which encode virulence factors such as pathogenic molecules.\n\nThey have discovered molecules thought to originate from herpes as well, but for obvious reasons, they never attempted to revive the pathogens.\n\nIt seems that permafrost isn’t the only source of these dangerous pathogens as NASA announced the discovery of 10-15,000 year old microbes in selenite crystals which were unearthed from the Cave of the Crystals in Mexico.\n\nOnce extracted, the unique bacteria revived and started multiplying at an alarming rate.\n\nOlder bacteria has been discovered in the Lechuguilla Cave in New Mexico at a depth of roughly 1,000ft. These particular microbes have not seen the surface in roughly 4 million years.\n\nSomehow, the bacteria has become resistant to 18 types of antibiotics and a study published in 2016 noted that the bacteria, known as Paenibacillus sp. LC231, was resistant to 70% of antibiotics and was able to totally inactivate many of them.\n\nThis in turn led scientists to believe that antibiotic resistance arose millions or even billions of years ago, which makes sense considering fungi and bacteria have been known to produce their very own antibiotics to gain a competitive advantage over others.\n\nThis is exactly how Flemming first discovered penicillin – bacteria died in a petri dish, one became contaminated and started excreting an antibiotic.\n\n“Our work, and the work of others, suggests that antibiotic resistance is not a novel concept,” says microbiologist Hazel Barton of the University of Akron, Ohio, who led the study. “Our organisms have been isolated from surface species from 4-7 million years, yet the resistance that they have is genetically identical to that found in surface species. This means that these genes are at least that old, and didn’t emerge from the human use of antibiotics for treatment.”\n\nPaenibacillus on its own is harmless to us, but its resistance to antibiotics could be passed on.\n\nA 2011 discovery of bacteria in permafrost between Russia and Canada indicated that a resistance to beta-lactam, tetracycline and glycopeptide antibiotics had already developed.\n\nShould this concern us?\n\n“Following our work and that of others, there is now a non-zero probability that pathogenic microbes could be revived, and infect us,” says Claverie. “How likely that is is not known, but it’s a possibility. It could be bacteria that are curable with antibiotics, or resistant bacteria, or a virus. If the pathogen hasn’t been in contact with humans for a long time, then our immune system would not be prepared. So yes, that could be dangerous.”\n\nIf you enjoyed this article please SHARE it.", "opengraph": {"locale": "en_US", "type": "article", "title": "There are diseases hidden in ice, and they are waking up", "description": "Bacteria and viruses are ancient. Human beings have fought off various forms for centuries, many outbreaks resulting in mass deaths. One doesn’t need to go too far back in history to remember these effects – think of the bubonic plague and smallpox. We have tried to fight back, developing vaccines from penicillin for example. Bacteria … There are diseases hidden in ice, and they are waking up Read More »", "url": "https://educateinspirechange.org/there-are-diseases-hidden-in-ice-and-they-are-waking-up/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2019-06-25T18:22:01+00:00", "article:modified_time": "2021-07-12T15:40:21+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2019/06/maxresdefault.jpg", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [], "links": ["https://web.archive.org/web/20180716022104/http://www.igs.cnrs-mrs.fr:80/spip.php?article39&lang=fr", "https://dx.doi.org/10.3402/gha.v4i0.8482", "http://www.cavescience.com/", "https://www.instagram.com/educate_inspire_change/", "https://web.archive.org/web/20210309164429/https://www.facebook.com/EducateInspireChange.org", "http://rythmia.link/khan", "http://rythmia.link/khan", "http://rythmia.link/khan"], "authors": [], "publish_date": "2019-06-25T18:22:01+00:00"}