{"result_id": "104002", "URL": "https://educateinspirechange.org/bill-gates-thinks-a-coming-disease-could-kill-30-million-people-within-6-months-and-says-we-should-get-prepared/", "timestamp": "2023-04-25 15:01:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/bill-gates-thinks-a-coming-disease-could-kill-30-million-people-within-6-months-and-says-we-should-get-prepared/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "Bill Gates thinks a coming disease could kill 30 million people within 6 months — and says we should get prepared", "cleaned_text": "If there’s one thing that we know from history, it’s that a deadly new disease will arise and spread around the globe.\n\nThat could happen easily within the next decade. And as Bill Gates told listeners on Friday at a discussion about epidemics hosted by the Massachusetts Medical Society and the New England Journal of Medicine, we’re not ready.\n\nGates acknowledged that he’s usually the optimist in the room, reminding people that we’re lifting children out of poverty around the globe and getting better at eliminating diseases like polio and malaria.\n\nBut “there’s one area though where the world isn’t making much progress,” Gates said, “and that’s pandemic preparedness.”\n\nThe likelihood that such a disease will appear continues to rise. New pathogensemerge all the time as the world population increases and humanity encroaches on wild environments. It’s becoming easier and easier for individual people or small groups to create weaponized diseases that could spread like wildfire around the globe.\n\nAccording to Gates, a small non-state actor could build an even deadlier form of smallpox in a lab.\n\nAnd in our interconnected world, people are always hopping on planes, crossing from cities on one continent to those on another in a matter of hours.\n\nGates presented a simulation by the Institute for Disease Modeling that found that a new flu like the one that killed 50 million people in the 1918 pandemic would now most likely kill 30 million people within six months.\n\nAnd the disease that next takes us by surprise is likely to be one we see for the first time at the start of an outbreak, like what happened recently with SARS and MERS viruses.\n\nIf you were to tell the world’s governments that weapons that could kill 30 million people were under construction right now, there’d be a sense of urgency about preparing for the threat, Gates said.\n\n“In the case of biological threats, that sense of urgency is lacking,” he said. “The world needs to prepare for pandemics in the same serious way it prepares for war.”\n\nThe one time the military tried a sort of simulated war game against a smallpox pandemic, the final score was “smallpox one, humanity zero,” Gates said.\n\nBut he reiterated that he’s an optimist, saying he thinks we could better prepare for the next viral or bacterial threat.\n\nIn some ways, we’re better prepared now than we were for previous pandemics. We have antiviral drugs that can in many cases do at least something to improve survival rates. We have antibiotics that can treat secondary infections like pneumonia associated with the flu.\n\nWe’re also getting closer to a universal flu vaccine; Gates announced on Friday that the Bill and Melinda Gates Foundation would offer $12 million in grants to encourage its development.\n\nAnd we’re getting better at rapid diagnosis too — which is essential, as the first step toward fighting a new disease is quarantine. Just this week, a new research paper in the journal Science touted the development of a way to use the gene-editing technology Crispr to rapidly detect diseases and identify them using the same sort of paper strip used in a home pregnancy test.\n\nBut we’re not yet good enough at rapidly identifying the threat from a disease and coordinating a response, as the global reaction to the latest Ebola epidemic showed.\n\nThere needs to be better communication between militaries and governments to help coordinate responses, Gates said. And he thinks governments need ways to quickly enlist the help of the private sector when it comes to developing technology and tools to fight an emerging deadly disease.\n\nMelinda Gates recently said that the threat of a global pandemic, whether it emerges naturally or is engineered, was perhaps the biggest risk to humanity.\n\n“Think of the number of people who leave New York City every day and go all over the world — we’re an interconnected world,” she said.\n\nThose connections make us all vulnerable.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates thinks a coming disease could kill 30 million people within 6 months — and says we should get prepared", "description": "If there’s one thing that we know from history, it’s that a deadly new disease will arise and spread around the globe. That could happen easily within the next decade. And as Bill Gates told listeners on Friday at a discussion about epidemics hosted by the Massachusetts Medical Society and the New England Journal of Medicine, we’re not … Bill Gates thinks a coming disease could kill 30 million people within 6 months — and says we should get prepared Read More »", "url": "https://educateinspirechange.org/bill-gates-thinks-a-coming-disease-could-kill-30-million-people-within-6-months-and-says-we-should-get-prepared/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2018-11-28T23:35:09+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2018/11/maxresdefault-1-1.jpg", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1778", "height": "1000", "embed_code": "<iframe loading=\"lazy\" title=\"Bill Gates Says A New Flu Could Kill 30 Million People In 6 Months\" width=\"1778\" height=\"1000\" src=\"https://www.youtube.com/embed/jAV_25Ak6FA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/jAV_25Ak6FA?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1778", "height": "1000", "embed_code": "<iframe loading=\"lazy\" title=\"Simulation: Global Flu Pandemic\" width=\"1778\" height=\"1000\" src=\"https://www.youtube.com/embed/9afTl9z5JHQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/9afTl9z5JHQ?feature=oembed"}], "links": ["http://www.businessinsider.com/pandemic-risk-to-humanity-2017-9", "http://epidemics.events.nejm.org/", "http://www.businessinsider.com/disease-x-who-lists-mystery-disease-as-potential-next-pandemic-2018-3", "https://www.businessinsider.com/plague-biological-weapon-2017-7", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3008208/", "http://www.businessinsider.com/disease-dangers-pandemic-influenza-ebola-2017-5", "http://science.sciencemag.org/content/360/6387/444.full", "http://www.businessinsider.com/crispr-genetic-modification-agriculture-food-2018-4", "https://www.businessinsider.com/pandemic-risk-to-humanity-2017-9", "http://uk.businessinsider.com/bill-gates-warns-the-next-pandemic-disease-is-coming-2018-4?utm_content=buffer1e12b&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer-insider-main&fbclid=IwAR374YFLzWtDAWDcqeUXxLohH3Urd8VQs60h0yl6WU1RfATnY2brDzTZj-U&r=US&IR=T"], "authors": [], "publish_date": "2018-11-28T23:35:09+00:00"}