{"result_id": "104001", "URL": "https://educateinspirechange.org/facebook-has-wiped-hundreds-of-millions-of-users-from-accessing-self-empowering-alternatives-in-the-name-of-censorship-fear-and-control/", "timestamp": "2023-04-25 15:01:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://educateinspirechange.org/wp-content/uploads/2014/06/cropped-1531634_549265021827446_552822793_o-1-32x32.jpg", "canonical": "https://educateinspirechange.org/facebook-has-wiped-hundreds-of-millions-of-users-from-accessing-self-empowering-alternatives-in-the-name-of-censorship-fear-and-control/", "encoding": "UTF-8"}, "image": null, "domain": "educateinspirechange.org", "title": "Facebook Wipes Millions From Accessing Self Empowering Alternatives", "cleaned_text": "The war on censorship and freedom of speech is riddled with many battles amongst the virtual landscape. After learning Facebook had taken down our page for allegedly going against their rules and regulations, we decided to dig deeper into a phenomenon that continues to affect alternative news sites and their audiences. When governments and corporations use their power to silence the people’s voice, it raises concern toward the motives of said agendas. Suppose the mere act of questioning mainstream narratives results in being wiped from a platform. What does this say about the progression of our society on both a personal and collective level?\n\nOn December 9, 2020, Facebook swiped several conscious news sites robbing over 60 million users from interacting with alternative ideas regarding healthy living, consciousness evolution, and self empowerment. Facebook has not provided a set reason why they removed such pages, however, hints lead to such termination for questioning vaccines. While EIC has never posted anti-vaccine related content, there is a lot to be said about a company that throws away anything that does not go with the mainstream script. Facebook is a leading figure when it comes to how people communicate online and their lack of objectivity raises heightened levels of concern for many reasons. The removal of dozens of pages is just one instance that scratches the tip of a monopolized iceberg with censorship at its core.\n\nThe Think Tank Behind the Purge\n\nThroughout our investigation and pursuit to reinstate our page (reaching over 3 million people), we learned the think tank, German Marshall Fund (GMF), was behind the significant sweep of large accounts. The graphic below showcases the list of pages recently taken down, including high-engagement accounts like The Idealist, The Hearty Soul, and more reaching over 16 million people.\n\nKeep in mind, the graphic below only showcases the accounts reported to Facebook which have not all been removed. Our goal is to raise enough awareness to help keep helpful pages published and continue to hold Facebook accountable for their actions.\n\nIn a recent post, the GMF brought forth their concerns about alternative and influential Facebook accounts stating, “This network of Facebook pages has helped these health outlets achieve popularity. As noted, the five sites received 71.1 million interactions in the first 11 months of this year. By comparison, the Centers for Disease Control and Prevention and the World Health Organization combined had 7.9 million interactions during the same period. These sites also have lifestyle stories in addition to health content, giving them broader audience reach potential.”\n\nIt is clear these world organizations feel threatened by the reach of conscious news pages that are assisting the world in learning more about healthier alternatives amidst a dark time in society. The GMF goes further into the relationships Facebook pages share when it comes to promoting content, suggesting it as a negative aspect when, in fact, collaboration is an occurrence often seen in the natural world. It seems big organizations, which favor the fear mentality, are starting to worry that the truth is reaching over 80 percent more people than their propaganda.\n\nFor those who are unfamiliar, The German Marshall Fund is an organization that “champions the principles of democracy, human rights, and international cooperation, which have served as the bedrock of peace and prosperity since the end of World War II, but are under increasing strain,” according to their about page. While the GMF prides itself on its non-partisan approach toward protecting democracy it is clear their involvement in siphoning out major Facebook accounts highlight their ever-growing bias toward the mainstream agenda.\n\nAs Facebook continues the gruesome purge of alternative media pages, not all accounts are being deleted but instead hidden from view. For example, the Children’s Health Defense (CHD), an organization that works to end childhood health epidemics by holding establishments accountable, has faced extreme censorship for questioning the push for vaccinations.\n\nOn November 13, the CHD filed a 150-page lawsuit against Facebook’s approach toward censorship through collaboration with subjective and biased “fact-checkers.” This document speaks directly to Facebook’s suppression of “vaccine safety speech by using a “warning label” and other similar types of notices which, while purporting to flag misinformation, in reality, censor valid and truthful speech.”\n\nThis is a fight against illusory practices that present individuals with resources from a biased opinion. Where the CHD presents a wide scope of information to assist people in making educated decisions, Facebook’s partnership with the Center for Disease Control (CDC) and the World Health Organization (WHO) push a narrative that is heavily one-sided.\n\nLean more about the German Marshall Fund and their supporters here\n\nFor years, Facebook has been in and out of headlines and courthouses, answering tricky questions regarding privacy, intent, and lack of accountability. In a recent hearing, the CEOs of Twitter and Facebook, Jack Dorsey and Mark Zuckerberg were presented before the Judiciary Committee chairman Lindsey Graham regarding censorship. “What I want to try to find out is if you’re not a newspaper at Twitter or Facebook, then why do you have editorial control over the New York Post?” Graham began as a segway into a conversation regarding the improper use of authority.\n\nNaturally, the controversy surrounding censorship finds itself front and center during election season. “There are instances in which your platforms are taking a very distinctively partisan approach, and not a neutral one, to election-related content moderation,” Senator Mike Lee begins. Lee provides an example where Twitter wrongfully suspended commissioner Mark Morgan’s account for violating hate speech rules.\n\nWhen confronted about this action, Dorsey quickly apologized for wrongfully censoring a tweet, responding with Morgan’s account’s reinstatement. “I understand mistakes happen, but what we’re going to see today is that mistakes happen a whole lot more, almost entirely on one side of the political aisle rather than the other,” Lee concluded.\n\nMore recently, 48 Attorneys General have filed lawsuits against the tech giant we have all known as Facebook. “For nearly a decade, Facebook has used its dominance and monopoly power to crush smaller rivals and snuff out competition, all at the expense of everyday users,” said New York Attorney General Letitia James, who led the states’ investigation. “Today, we are taking action to stand up for the millions of consumers and many small businesses that have been harmed by Facebook’s illegal behavior.”\n\nThese lawsuits hold Facebook accountable for it’s “buy or bury” approach in monopolizing through ownership of Instagram and WhatsApp. A separate case is being held to push Facebook to unwind its ownership of these platforms. It is clear that Facebook’s censorship of information is harming freedom of speech, and allowing them to continue monopolizing other media only says what they will continue to do to silence the voice of the people. Without fair competition in the social network domain, it becomes increasingly difficult for consumers and creators to opt for alternatives.\n\nOur Next Steps & A Call to Connect At A Deeper Level\n\nTrack records have proven Facebook’s business strategy is to buy out the competition in the name of weaponizing its monopoly of reach and control when it comes to other applications that might threaten its success. Why wouldn’t this stand true in their approach toward “buying” their users’ attention by silencing opposing voices that differ from their beliefs? We see it happen again and again as popular Facebook pages continue to disappear from their platform.\n\n\n\n Each one of us is in a position to decide whether we will rise or conform. There is a reason why we, among many other alternative news sites, have successfully connected with millions of individuals in the pursuit of leading healthy and sovereign lives. This deep connection to truth is something Facebook and other prominent media networks can never take away from us. The power of deception holds no weight when it comes to the light of truth. We strongly urge you to continue questioning everything, working on yourself, and actively supporting the businesses you strongly resonate with.\n\nAs we advance our investigation regarding our page’s deletion, we will continue to serve our audience by publishing helpful articles on our website, conducting interviews for our podcast, and sharing as much as we can. Please consider joining our mailing list to keep in touch, receive updates, and support our work. While the war on information breeds in the swamp of control and censorship, our mission at Educate Inspire Change has just begun, and we look forward to the growth that stems from this process.\n\n*UPDATE : We have launched our very own Conscious Community Application. Please visit www.eic.community to learn more and download the app. This is the best way to support us and to stay connected with other like mined conscious souls on a path of self-discovery and healing.", "opengraph": {"locale": "en_US", "type": "article", "title": "Facebook Wipes Millions From Accessing Self Empowering Alternatives", "description": "The war on censorship and freedom of speech is riddled with many battles amongst the virtual landscape. After learning Facebook had taken down our page for allegedly going against their rules and regulations, we decided to dig deeper into a phenomenon that continues to affect alternative news sites and their audiences. When governments and corporations … Facebook Wipes Millions From Accessing Self Empowering Alternatives Read More »", "url": "https://educateinspirechange.org/facebook-has-wiped-hundreds-of-millions-of-users-from-accessing-self-empowering-alternatives-in-the-name-of-censorship-fear-and-control/", "site_name": "Educate Inspire Change", "article:author": "https://www.facebook.com/EducateInspireChange.org/", "article:published_time": "2021-07-27T18:11:59+00:00", "article:modified_time": "2021-09-19T19:07:49+00:00", "image": "https://educateinspirechange.org/wp-content/uploads/2021/07/maxresdefault-9.jpg", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.gmfus.org/blog/2020/12/09/health-sites-built-coordinated-networks-facebook-pages-spread-false-content-increase", "https://childrenshealthdefense.org/wp-content/uploads/FACEBOOK-AMENDED-COMPLAINT-FINAL-DKT-64-11-13-2020.pdf", "https://www.gmfus.org/our-partners", "https://www.youtube.com/watch?v=BuDyJGw-bhE", "https://www.npr.org/2020/12/09/944073889/48-attorneys-general-sue-facebook-alleging-illegal-power-grabs-to-neutralize-riv", "https://www.eic.community/", "https://www.washingtonpost.com/politics/2020/12/09/technology-202-facebook-removes-some-pages-appearing-coordinate-push-health-misinformation/", "https://www.gmfus.org/blog/2020/12/09/health-sites-built-coordinated-networks-facebook-pages-spread-false-content-increase"], "authors": [], "publish_date": "2021-07-27T18:11:59+00:00"}