{"result_id": "105028", "URL": "https://educate-yourself.org/cn/fluvaccinepropaganda09nov10.shtml", "timestamp": "2023-04-25 15:02:01 CEST+0200", "meta": {"description": "Nov. 9, 2010. I caught a short segment on CBS news this morning on AM radio that reported a new study headed by Rachel Bailey, MPH (Master of Public Health), of the University of Pittsburg, that reported a savings to employers of $63 to $93 per employee if employees got their wonderful life-saving influenza shot earlier, rather than later.", "lang": "en", "keywords": "educate-yourself.org, ken Adachi, vaccine propaganda, rachel bailey, university of pittsburg, study, vaccine dangers, swine flu vaccine dangers, flu vaccination, cost savings to employers, false studies, misleading studies, dr linus pauling,", "favicon": "", "canonical": "https://educate-yourself.org/cn/fluvaccinepropaganda09nov10.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "New Pro-Vaccination 'Study' is Rehash of Pharma Propaganda (Nov. 9, 2010)", "cleaned_text": "New Pro-Vaccination 'Study' is Rehash of Pharma Propaganda (Nov. 9, 2010)\n\n\n\nI caught a short segment on CBS news this morning on AM radio that reported a new study headed by Rachel Bailey, MPH (Master of Public Health), of the University of Pittsburg, that reported a savings to employers of $63 to $93 per employee if employees got their wonderful life-saving influenza shot earlier, rather than later. The report suggestd that \"Vaccinating an entire firm of 150 employees earlier could save a business between $9,450 and $14,250. The potential cost savings of influenza immunization drop dramatically for vaccination after December.\"\n\nQuoting from an article titled \"Early Employer-Based Flu Vaccinations Can Protect Health and Improve Company’s Bottom Line\"\n\n...New data out today show that employer-sponsored influenza vaccination programs held early in the flu season not only protect employee health, but save businesses money. Researchers from the University of Pittsburgh, who presented the findings at the American Public Health Association’s 138th Annual Meeting & Exposition in Denver, developed an economic model to suggest that not only should employers get their employees vaccinated, they should do so as early as possible. “Employers have huge incentives to solve this widespread public health problem with timely vaccination,” said Rachel Bailey, MPH, lead researcher of the study. “Even though sponsoring workplace vaccination may appear expensive, the cost savings provided by preventing influenza-associated absenteeism with vaccination programs early in the influenza season more than compensates.”\n\nAfter failing miserably to panic a wary public into buying the Great 2009 Swine Flu 'Pandemic' hoax, propaganda shills for the pharmaceutical industry have now apparently reverted to more traditional schemes of deception in the face of mounting \"vaccine resistance\" (as the pharma shills like to call it). A university 'study' is one such tried and true vehicle.\n\nFor those too young or too inexperienced to know, I can shape the results of a university 'study' to say anything I want it to say. If I'm paying to underwrite the study and I'm the funding source (either directly or indirectly) for the 'researchers' involved in producing the study, then the study is going to produce the 'results' that I want it to produce. There is no such thing as 'honest' science today in any university receiving subsidies or grants from government or corporate sources. And how many universities exists in America who don't receive government or corporate underwriting?\n\nI started to awaken to the deception of falsified scientific 'studies' when I read the books of Dr. Linus Pauling in the 1970s. In many of his books, Dr. Pauling very carefully dissected the false presumptions and false conclusions reached in many 'studies' that were sponsored by the orthodox medical industry or their overlords in Big Pharma. If you actually take the time to read and examine the study, as Linus Pauling did, you can usually see the holes in the data without too much effort. Very often, flawed 'studies' defy basic common sense and present postulates that are simply illogical, as is the case in the University of Pittsburg study mentioned above.\n\nThere is no way on God's green earth that you can ACCURATELY predict with any scientific validity who will and who won't come down with influenza based on who did or who didn't get a flu vaccination. It's even more improbable to predict the \"savings\" that an employer might accrue from reduced employee absenteeism that will supposedly flow from a workplace vaccination program. These postulates are utter poppycock.\n\nVaccine propagandists constantly repeat an assumed postulate that has no basis in fact. The assumption is that a vaccine will produce antibodies that will prevent you from succumbing to the full force of the bug in question or experience no infective symptoms at all. They have been repeating this mantra for nearly 100 years.\n\nThat's the simpleton's explanation of how vaccines work, but modern vaccines are LOADED with toxic substances, and biological/genetic contaminants that will do far more harm than good. There are hundreds of books in print today (and thousands of articles) that reveal the lies and distortions of the vaccine industry and their duplicitous minions who front for them.\n\nThose who have made it their business to study the Dark Side of the vaccine industry know full well that you stand a far better chance of remaining flu-free if you DON'T get vaccinated. In 2009, many thousands of trusting and gullible people discovered the hard way that the wonderful life-saving flu vaccine (now combined with Swine Flu poisons) didn't save them from anything, and in many instances, gave them neurological disorders that may plague them for the rest of their lives. And, of course, many people DIED from that damn Swine Flu vaccine.\n\nVaccines don't help folks; but they certainly can harm you. Caveat emptor.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/cn/fluvaccinepropaganda09nov10.shtml", "http://thevalleyhitmusic.com/2010/11/09/study-says-getting-flu-vaccine-for-workers-saves-money/", "http://www.newswise.com/articles/early-employer-based-flu-vaccinations-can-protect-health-and-improve-company-s-bottom-line", "http://educate-yourself.org/vcd/"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}