{"result_id": "105041", "URL": "https://educate-yourself.org/cn/Urgent-Alert-Dr-Henrich-Fiechtner-Warns-German-Parliament-Its-a-Killer-Vaccination-06Jan2021.shtml", "timestamp": "2023-04-25 15:02:07 CEST+0200", "meta": {"description": "Member of the state parliament in Baden-Württemberg, Dr. Heinrich Fiechtner  slammed the German government and media for their endless propaganda, misinformation and fake news concerning the Chinese coronavirus. In an impassioned speech on the floor of the German Parliament, Dr. Fiechtner also warned the public of the dire consequences of the new “killer vaccination” and urged the public to resist the illegal government impositions.", "lang": "en", "keywords": "educate-yourself.org,covid vaccine killer, covid vaccine dangers, transhumanism, cyborg, mrna, dna altering, tracking and monitor of body by AI computers, big brother surveillance of body and mind, bill gates, eugenics, depopulation, genocide, human enslavement agenda, avoid covid vaccine, never take dovid vaccine, produces infertility in female and males, mind control, monitor and tracking by satellites, Dr Henrich Fiechtner, address to German parliament, covid killer vaccination,", "favicon": "", "canonical": "https://educate-yourself.org/cn/Urgent-Alert-Dr-Henrich-Fiechtner-Warns-German-Parliament-Its-a-Killer-Vaccination-06Jan2021.shtml", "encoding": "utf-8"}, "image": null, "domain": "educate-yourself.org", "title": "Urgent Alert: Dr Heinrich Fiechtner Warns German Parliament: ‘It’s a Killer Vaccination’", "cleaned_text": "Member of the state parliament in Baden-Württemberg, Dr. Heinrich Fiechtner slammed the German government and media for their endless propaganda, misinformation and fake news concerning the Chinese coronavirus. In an impassioned speech on the floor of the German Parliament, Dr. Fiechtner also warned the public of the dire consequences of the new “killer vaccination” and urged the public to resist the illegal government impositions.\n\nDr. Fiechtner, a licensed and trained hematologist and oncologist, explained that minutes after observing a national television report describing the coronavirus-strained capacity of hospital intensive care units (ICUs), he phoned his former hospital colleagues and learned that the hospital had not a single coronavirus patient in its ICU. Outraged by these irresponsible and politically motivated lies and exaggerations, Fiechnter lashed out at the fear mongering politicians and their media allies.\n\nI called his hospital’s ICU and requested to speak with the chief physician on duty, with whom I spoke. I asked him, “How many COVID patients have been admitted to your Intensive Care Unit?” This ICU has 19 beds, and as of yesterday there WASN’T A SINGLE PATIENT! With such half-truths and complete lies, the wool is being pulled over our eyes. These propagandists that are invited on these shows for the sole purpose of creating panic and fear among the population.\n\nIn addition, Dr. Fiechtner admonished politicians and the media for conflating the number of infected individuals by not distinguishing positively tested individuals from positive tests. More specifically, if the same person receives three positive tests in their medical care, the reckless media has been reporting triple the infection rate with three different infections.\n\nFurther, Dr. Fiechtner raises concerns over the practice of grouping inactive and active coronavirus positive results into a single bucket to heighten fear of infection. In actuality, the positive test results should be categorized as the test results from those actively carrying a contagious form of the virus and those inactive carriers who have recovered from the virus.\n\nDr. Fiechtner believes that impact of the coronavirus is being exaggerated to justify many of the draconian measures restricting the citizenry and the accelerate the government efforts to vaccinate the population.\n\nYou are destroying an entire country. You are leading people into suffering, panic, ruin and death! At this point, at this point, no, you can’t even justify these measures, the masks, social distancing, quarantine, and the lockdowns.\n\nThe medically trained politician highlights many of the risks of these new vaccines that range from infertility in women to deadly allergic reactions. The more fear instilled in the population, the more likely the people will rush to inoculate themselves with an unproven and risky vaccine.\n\nI’ve said it before: it’s a killer vaccine It’s a pharmaceutical product for which there isn’t even a toxicology report. It’s just going to be given to people. There’s a possibility that it may cause infertility in women, severe allergic reactions, and you want to inflict this unreasonable imposition upon citizens. That’s right, and you will, because you made them afraid beforehand. You are putting the lives of citizens at risk. You putting existences at risk.\n\nWith the German government illegally exercising power, Dr. Fiechtner implored the people to exercise their rights and resist these illegal government impositions. “The civic duty for the citizens to obey the rule of law is now broken.”\n\nWatch the following powerful speech by Dr. Heinrich Fiechtner exclusively translated by RAIR Foundation USA:\n\nMany thanks to MissPiggy for the translation,\n\nMadame President, ladies and gentlemen: yesterday evening at 10pm, prime-time TV, on the Anne Will talk show, there was an illustrious group discussion about the coming lockdown, which included Professor Dr. Uwe Janssens, President of the German Interdisciplinary Association for Intensive Care and Emergency Medicine. He made an emotional and lengthy plea about the importance these grave and drastic measures being implemented upon the German population. He explained how the ICU stations were being overwhelmed and overflowing with patients, causing a situation that was barely manageable. Around 10:13pm I called his hospital’s ICU and requested to speak with the chief physician on duty, with whom I spoke. I asked him, “How many COVID patients have been admitted to your Intensive Care Unit?” This ICU has 19 beds, and as of yesterday there WASN’T A SINGLE PATIENT! With such half-truths and complete lies, the wool is being pulled over our eyes. These propagandists that are invited on these shows for the sole purpose of creating panic and fear among the population. And then there’s the whole “infection” narrative and the test. This test isn’t even capable of making the distinction between an active virus and an inactive virus. Just as the Senate in Berlin had to admit. Regardless, it is being registered as an infection. So if a patient tests positive three times in one week, this increases the statistic of infection by exactly three. This test that is absolutely incapable of diagnosis is being used to implement drastic measures. And now the vaccine is coming. What nonsense. I’ve said it before: it’s a killer vaccine It’s a pharmaceutical product for which there isn’t even a toxicology report. It’s just going to be given to people. There’s a possibility that it may cause infertility in women, severe allergic reactions, and you want to inflict this unreasonable imposition upon citizens. That’s right, and you will, because you made them afraid beforehand. You are putting the lives of citizens at risk. You putting existences at risk. You are destroying an entire country. You are leading people into suffering, panic, ruin and death! At this point, at this point, no, you can’t even justify these measures, the masks, social distancing, quarantine, and the lockdowns. Following an enquiry, the answer I received was, “A review of non-pharmacological measures has not been documented. Accordingly, there are no administrative procedures or files pertaining to such results in existence.” The absolute capitulation! What nerve! You demand people endure quarantine, but can’t even give evidence why they should! You are leading our country into ruin! At this point, it is high time… Yes, please. —[?] Do you have a question? At this point, it is high time… —Dr. Fiechtner, it’s high time. At this point, it is high time, in light of the fact that it is no longer possible for citizens to exercise their rights, the civic duty for citizens to obey the rule of law is now broken. In Article 20 paragraph 4 [German constitution] citizens have the right of resistance in defense against an illegally exercised state power… Dr. Fiechtner, it is high time that you stop because your speaking time expired a long time ago. A legislative branch which acts accordingly is needed. https://rairfoundation.com/urgent-alert-mep-dr-heinrich-fiechtner-warns-its-a-killer-vaccination-must-watch/", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thetruthseeker.co.uk/?author=39262", "https://www.thetruthseeker.co.uk/?p=224505#respond", "https://rairfoundation.com/watch-german-politician-forcibly-removed-from-parliament-after-slamming-left-wing-stuttgart-riots-coming-to-america/", "https://rairfoundation.com/urgent-alert-mep-dr-heinrich-fiechtner-warns-its-a-killer-vaccination-must-watch/", "http://tapnewswire.com/2020/12/urgent-alert-doctor-heinrich-fiechtner-warns-its-a-killer-vaccination-must-watch/"], "authors": ["Ken Adachi", "Dr Henrich Fiechtner"], "publish_date": null}