{"result_id": "105034", "URL": "https://educate-yourself.org/cn/Dr-Mouldens-Breakthrough-Vaccine-Discovery-Every-Vaccine-Elicits-an-Immune-Response-that-Triggers-Impaired-Blood-Flow-in-the-Brain29jul15.shtml", "timestamp": "2023-04-25 15:02:03 CEST+0200", "meta": {"description": "I didn't realize the importance of what Dr Andrew Moulden had discovered about the precise mechanisms of vaccine vascular damage - and how easy it is to see evidence of this damage in the eyes of vaccinated children - until a few weeks ago, but now that I've watched his amazing three volume DVD video series called Tolerance Lost and read a number of his articles, I'm stunned by the depth and significance of his work and the realization that very, very few people know anything about his discoveries.", "lang": "en", "keywords": "educate-yourself.org, dr andrew moulden. vaccine damage, ischemia, blood clots, strokes, imparied blood flow, neural damage. do not vaccinate children,", "favicon": "", "canonical": "https://educate-yourself.org/cn/Dr-Mouldens-Breakthrough-Vaccine-Discovery-Every-Vaccine-Elicits-an-Immune-Response-that-Triggers-Impaired-Blood-Flow-in-the-Brain29jul15.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Dr Moulden's Breakthrough Vaccine Discovery: Every Vaccine Elicits an Immune Response that Triggers Impaired Blood Flow in the Brain", "cleaned_text": "Zeta potential is an abbreviation for electrokinetic potential in colloidal systems. In the colloidal chemistry literature, it is usually denoted using the Greek letter zeta [\"Z\"], hence-potential. From a theoretical viewpoint, zeta potential is electric potential in the interfacial double layer at the location of the slipping plane versus a point in the bulk fluid away from the interface. In other words, zeta potential is the potential difference between the dispersion medium and the stationary layer of fluid attached to the dispersed particle.\n\n \n\n One of the key “slipping planes” inside blood vessels is the smooth glyocalyx layer that lines the inside surface of all blood vessels. Glycocalyx to blood vessels is like the slime coating on a fish; the coating creates a slipstream surface in fluid dynamics. In the circulatory system this effect, MASS, has multiple triggers, however, the mechanism to disease and disorders is the same irrespective of the trigger. It is for this reason that we are now in the favorable position of knowing what to do in order to maximize health & wellness across broad categories of disease and chronic illness – including vaccine induced autism-spectrum.\n\n \n\n Zeta Potential, Blood vessel, Blood flow & MASS Disorders\n\n \n\n Schematic representation of Zeta potential & a blood vessel lumen. Note that even capillary blood vessels have their own, tiny, blood vessels called the vasa vasorum. If blood flow is impeded, then blood vessels of blood vessels are the first to be rendered hypoxic. Blood flow is governed by non-Newtonian fluid dynamics which represents any fluid with flow properties that are not described by a single constant value of viscosity. In a non-Newtonian fluid, the relation between the shear stress and the strain rate is nonlinear, and can even be time-dependent. Therefore a constant coefficient of viscosity can not be defined. MASS Disorders, and many pathological states as it turns out, has a common origin in non-Newtonian fluid mechanics. Blood flow, at the microscopic level, is crucial to health and wellness, for all organ systems, and all diseases.\n\n \n\n Rheology\n\n \n\n Rheology is the study of the flow of matter including liquids, soft solids, and solids under conditions in which they flow rather than deform elastically. Materials flow when subjected to a stress which is a force per area. Rheology is concerned with forces, stresses, and with extending the \"classical\" disciplines of elasticity and (Newtonian) fluid mechanics to materials whose mechanical behavior cannot be described with the classical theories.\n\n \n\n Since Isaac Newton originated the concept of viscosity, the study of variable viscosity liquids, such as blood and bodily fluids, is also often called Non-Newtonian fluid mechanics. One part of the answer to the cause of vaccine-Autism-neurodevelopment disorders is to be found in rheology and Non-Newtonian fluid dynamics at the microcirculation unit.\n\n \n\n Zeta potential is one of the main forces that mediate inter particle interactions. Particles with a high zeta potential of the same charge sign, either positive or negative, will repel each other.\n\n Conventionally, a high zeta potential [expressed as Voltage] can be high in a positive or negative sense, i.e. <-30mV and >+30mV [less than minus 30 millivolts and greater than plus 30 millivolts] would both be considered as high zeta potentials. For molecules and particles that are small enough, and of low enough density to remain in suspension, a high zeta potential will confer stability, i.e. the solution or dispersion will resist aggregation [clumping]. Intense microbial action (infection) or microbial agents cause a reduction in zeta potential which changes blood to \"sludge.\" The administration of more than one vaccine at a time multiplies this effect thereby increasing the amount of intravascular coagulation and blood clots.\n\n \n\n The use of aluminum salts to stabilize vaccines exacerbates the clotting effect by a multiple of 6000 times (see explanation below). Infection, whether by vaccine or other disease agents, lowers zeta potential causing clots. This is a component sub-process of MASS – Moulden Anoxia Spectra Syndromes.\n\nIn a person with high zeta potential of the blood, immunogenic challenge may cause reduction and aggravation. In cases, it can result in micro capillary clotting destroying and impairing organ function in clinically apparent, but also silent ways. Zeta potential changes, as a part of MASS brain and behavioral disorders, accounts for the of neuropsychiatric, neuromotor, neurocognitive, neurodevelopment, and neurosensory disorders as well as other organ pathological states since the site and degree of the microvascular clotting cascade is unpredictable. The effect may start out as only an adhesion and through further reduction of zeta potential may change to a clot or hemorrhage.\n\n \n\n Some tissue areas have high affinity for certain toxins (e.g. the substantia nigra and MPP+ and certain pesticides in Parkinson’s disease). In these instances, the tissue regions with affinity for a particular toxin or particulate matter, becomes a regional discrete area that is preferentially affected by low zeta and MASS.\n\nAlleged Shaken Baby Syndrome\n\n \n\n The hemorrhagic transformation from vaccine induced micro vascular ischemia, has been responsible for many wrongful criminal convictions of alleged “child abuse\" under the diagnosis of “shaken baby syndrome.\"\n\n \n\n Doctor’s rely on retinal hemorrhages and bleeding within the brain (intra-cerebral hemorrhage), specific hallmarks of “shaken baby syndrome.” Unfortunately, these “hallmarks” are also cardinal features of vaccine induced MASS and MAZE – MASS Anoxic Zone Encephalopathies, of which sudden infant death is a variant.\n\nSince MAZE is a process that deprives tissues of oxygen, this can precipitate seizures in the infant that can occur during sleep. Since the infant's long bines [skull suture lines] are not yet calcified, the tonic-clonic phase of seizures can precipitate fractures and fracture lines along bones that generally imply child abuse. If the parent brings their child to an emergency department and x-rays are done, the physician may find multiple fractures, of different stages of healing that imply abuse when in fact the forensic features actually reflect adversity from vaccination and/or infectious disease.\n\n \n\n This is not to say that no one is guilty of child abuse. It simply points out that the features which doctors, police, and courts rely upon to convict an individual of child abuse are not necessarily pathognomonnic (specific features of), a singular explanation for the infant's clinical and pathological findings in exammination. MASS and low Zeta can achieve the same effect as shaken baby. Criminal cases may not be criminal at all as the actus reus (physical act) and mens rea (mental intent) was never formed for MASS MAZE pathologies.\n\n \n\n VACCINE ADJUVANT\n\n \n\n Aluminum Neurocognitive Impairment\n\n \n\n Eliminating aluminum salts and monitoring of the blood vessels of the white of the eyes for intravascular coagulation would greatly reduce risks of vaccinations. However due to environment and aluminum accumulations, zeta potential tends to reduce with age. Thus, vaccination of the elderly, or those with hypercoagulable states, may reduce zeta potential close to the phase change point so that even an emotional upset can trigger a micro vascular clot – or heart attack for that matter.\n\n \n\n We now have 1 adult in 13 over the age of 65 diagnosed with dementia of the Alzheimer type. One person in three over the age of 85 is diagnosed with Alzheimer-type dementia. Aluminum, a vaccine adjuvant, is at the core of the pathological plaques and tangle in the human brain of Alzheimer’s type dementia patients. Aluminum salts are non-specific immune system accelerants used in all vaccines. Upwards of twenty percent of all Alzheimer deaths show micro vascular lesions in the brain in addition to the classic “plaque and tangle” microscopic features seen post-mortem. Notably, these micro vascular ischemic area (micro strokes) unfolded in clinically silent ways during life. This situation is not any different from Autism-spectrum, Parkinson disease, specific learning disabilities, attention deficit disorders, Gardasil deaths, Gulf War Syndrome, schizophrenia, and other morbid pathological states.\n\n \n\n The MASS intravascular clotting process and tissue healing process is happening in most if not all vaccine acquired neurodevelopment disorders , albeit in temporally compressed, discrete episodes. The damages, like Alzheimer’s disease, are cumulative albeit not necessarily progressive. Even skin reactions can occur immediately and continue for seven or eight years or may not appear until one to six years later. This happens in all mammals from vaccines . There are over 7000 references to aluminum toxicity. Some key ones including this can be found at \n\n http://www.scribd.com/doc/11564520/Ch-4-Mass-Zeta-Stress\n\nThe introduction of any bacteria or bacterial filtrates alive or dead (vaccine) causes a reaction of the body that results in blood clots from intense microbial action . These clots may be small adhesions that attach to the blood vessels or organs impairing their function or complete obstructions resulting in organ death. They are particularly common in kidney, lung, liver and brain.\n\n \n\n This intravascular (within blood vessels) coagulation (clotting) is readily apparent in an examination of the blood vessels in the sclera (whites) of the eyes from vaccines or other infections. Microorganisms take days to weeks to months to demonstrate their full effect on a system. This is known as the Sarannelli/Schwartzman phenomena. There are several hundred references to its occurrence in the National Library of Medicine. It is called “phenomena” because the cause has not been understood. It is precisely this missing medical physiology “pheneomena” that has been discovered and elucidated by MASS, – Moulden Anoxia Spectra Syndromes. MASS, as it turns out, in physiology and process, IS the cause of acquired mammalian disease states - all of them!\n\n \n\n MASS “phenomena” has now been elucidated right down to the microbiological processes, phases, and stages that are latently activated to cause mammalian disease, vaccine adversity, and autism-spectrum. Remarkably, solving the medical mystery behind vaccine induced neurodevelopment disorders has resulted in the solution for much human disease, in cause, prevention, and now on the horizon is the means to effect targeted cures. This includes many ailments, some cancers, Alzheimer’s disease, schizophrenia, and much more.\n\n \n\n Zeta potential is one of several physiological phases of MASS (and human disease). MASS can be immunologically triggered in the absence of lowered Zeta potentials. However, irrespective of which MASS phase comes first, lowered Zeta potential eventually emerges even if only at the microcirculation units in the body. The end result is clotting within the micro blood vessels and impaired oxygen delivery to cells and tissue. This is hypoxia (low oxygen), anoxia (no oxygen). and ischemia (low oxygen from low blood flow) and stroke (oxygen demand exceeding oxygen supply). This is human disease, chronic illness, disorders, death, vaccine induced autism-spectrum, sudden infant death syndrome, and multi-organ disease and functional impairments. MASS is like a “one-stop-shop” to health, wellness, and morbidity.\n\n \n\n Global Vaccinations\n\nMaking matters worse, every foreign substance, dead or alive, added to the vaccines, including aluminum additives, mercury preservatives, formaldehyde, human and animal cells, and contaminants, triggers a MASS response in their own right. It is the magnitude of MASS that determines disease. MASS is additive, summative, and has immunological memory. The magnitude of the MASS response is more a function of the net immunogenic load at a given point in time rather than the specific “pathogen” one is injected with.\n\n \n\n Considering the record profits that have been made selling vaccines to the world, one should think that society should hold accountable and responsible, financially, all who have profited from vaccines – including the physicians who have administered them. These funds must be directed to victims (we are all victims), recovery efforts, and solutions that are metered by parents and the public ~ not by corporations, politicians, governmental bodies and officials. The damages, globally, are astounding:\n\nThe autopsy reports of nine toddlers aged 13 hours to 11 ½ months are presented below. These are congenital rubella (German Measles) cases from 1964. The autopsy table demonstrates clearly that the intravascular coagulation effect from these “pathogens” cuts across all organ systems. The effects can take several months to manifest. This is intravascular clotting cascades at work. This is Zeta potential in action.. This is the means that these same pathogens, whether they are killed or attenuated,, albeit in an attenuated form, now that we are injecting them with mass vaccination programs.\n\n\n\n \n\n General Autopsy Findings (above): Diffuse Vascular Damages – All organ systems affected. These were clinically silent vascular ischemic lesions including the ischemic lesions to the brain. Many of these children were developmentally impaired and autistic (Autism in children with congenital rubella, Stella Chess. Journal of Autism and Childhood Schizophrenia 1971 Jan-Mar;1(1):33-47). These congenital rubella syndrome children exhibit hard neurological measures of ischemic brain injuries using our BrainGuardMD.com imaging protocols as do contemporary autistic children, post vaccination (as a function of any vaccine – not just MMR). Remarkably, we now show that these neurovascular lesions are emerging within hours and days of vaccination and the lesion are identical to those seem in the pre-vaccine era. All pathogens [found in vaccines] (DTaP, Gardasil Anthrax, Hepatitis A/B, MMR, influenza, etc..) are creating the same lesions across the [person's] life span and across all emergent medical diagnoses . This is a generic, non-specific response to any immune challenge and not a particular “germ.” This means no vaccination is \"safe\" as currently constituted.\n\n \n\n 1) Microscopic intravascular coagulation, 2) anoxic states, 3) MASS, and 4) low Zeta Potential is the cause of acquired disease in response to anything foreign entering the human body under conditions of immune hyper stimulation. Foreign substances that sequester in tissue lines and cannot be readily removed by normal immunological means, becomes a focal point for on-going non-specific immune assault to the area. This is a factor in diseases wherein tissue is slowly lost in focal areas such as insulin dependent diabetes mellitus, Parkinson’s disease, and Alzheimer’s type dementia.When all vaccines and infectious diseases create the same pathological symptoms in all people, then it is NOT the pathogen that is causing the disease. Rather, disease is emerging as a generic response to non-specific immunological challenge. Accordingly, vaccines do nothing to address the cause of disease or morbidity from infectious diseases. Vaccines simply weaken any particular “bug's” ability to elicit an intense non-specific immune response. Since this non-specific immune response is the same cause of morbidity across all pathogens, then prevention of morbidity is best suited by targeting the non-specific immune response directly – on an as-needed basis.\n\n \n\n MASS Ischemia:\n\nAutism-spectrum and learning disabilities are along the same continuum of range and breadth of brain injury from the same vaccine triggered MASS pathophysiological cascade and all vaccines. This is why universal one-size fits all vaccines, as currently constituted, have caused an epidemic of neurodevelopment disorders that includes:\n• 1 child in 87 [today 1 in 50] with Autism (it used to be 1 in 10,000)\n• 1 in 4 Gulf War vets (250,000 of 800,00 vaccinated) to suffer from Gulf War Syndrome, with 42,00 deaths (and rising).\n• 10,000 plus Gardasil adverse reactions and over 21 deaths, including blood clots and strokes. MASS is the same mechanism by which Merck’s Vioxx caused strokes. [Now over 140 VAERS reported deaths, with a known 1 to 10% reporting factor].\n• Allegations, charges & convictions [of innocent parents] for shaken baby syndrome that are vaccine damages.\n\nThe micro vascular and tissue bed damages caused by MASS responses are cumulative. MASS is the physiological process behind vaccine morbidities and Dr. Hans Selye’s “Stress” model of human disease. Dr. Hans Selye was a Canadian endocrinologist who did research on the hypothetical, non-specific response of the organism to stressors. Selye conceptualized the physiology of “stress” as having two components: 1) a set of responses which he called the general adaptation syndrome [GAS], and 2) the development of a pathological state from ongoing, unrelieved stress. The “stress” in Selye’s model, summated over the course of a lifetime, causes diseases at the organ and systems level.Dr. Selye’ is initial inspiration for General Adaptation Syndrome (GAS, a theory of stress) came from an endocrinological experiment in which he injected mice with extracts of various organs. He at first believed he had discovered a new hormone, but was proved wrong when every irritating substance he injected produced the same symptoms (swelling of the adrenal cortex, atrophy of the thymus, gastric and duodenal ulcers). This, paired with his observation that people with different diseases exhibit similar symptoms, led to his description of the effects of \"noxious agents\" as he at first called it. He later coined the term \"stress.”Dr. Selye’s “Stress & G.A.S.” is actually “M.A.S.S.” in human physiology, including vaccine induced autism-spectrum disorders and all other chronic ailments that emerge from foreign agents entering the mammalian body and bloodstream.Remarkably, our www.BrainGuardMD.com [no longer online] non-invasive, indirect neurovascular functional brain imaging protocols, constrained to clinical neurology and neuroanatomy, shows the exact same “stress” disease pattern as recorded by Dr. Selye. Irrespective of the vaccine strain, infectious disease source, pathogenic determinant, or emergent morbid sate, the neurologicalfrom Sudden Infant Death Syndrome to Autism, to learning disabilities, to Gardasil adversity, to Tourettes syndrome, to Chronic Fatigue, to Gulf War syndrome, to Dementia, to gastrointestinal pathology, to death. This is MASS in medical physiology. This is “Stress” in Selye’s terminology. This is vaccine induced autism-spectrum. This is human disease. This is a generic response to any foreign substances entering or injected into mammalian tissue, bloodstream, physiology and anatomy.The only reason the congenital form of rubella is harmful is because infection within the first trimester of gestation places the immune system in a state ofImmune tolerance causes a disproportionate increase in the non-specific immune response as the antibody-mediated arm of the immune system, specific to key antigens (germ-specific proteins that identify the pathogen as foreign) are “turned off or deleted”. This means antibodies, much like bullets, can be present, but they are duds – they will never “fire”. It is for this reason that some researchers (e.g. A. Wakefield et al., 1997, The Lancet ) have occasionally found vaccine strain measles in the guts of autistic children. The immune system has been partially paralyzed in its ability to eradicate the germ. However, it is not the germ that is causing morbidity; it is theto the germ which is causing disease and organ specific functional derailments and distress.Immune tolerance is an adaptive immune response by the body. Immune tolerance, once induced, becomes a trigger for cellular, tissue, micro vascular, and organ-specific collateral damages via hypoxia [low oxygen].The damages/disease/disorders that emerge are a function of the hyper stimulated white blood cell response. This is “friendly fire” and collateral damages from the act of microscopic war within the body.All repeat vaccines have the propensity to induce tolerance. All vaccines induce a white blood cell response. This non-specific response and, albeit in clinically imperceptible ways. This is the MASS response in physiology. It is causing death, disability, chronic illnesses, disorders, hypoxia, genetic derailments in cells from transcription errors under hypoxic states, and likely many cancers.Unfortunately, taking out the antibody response to a pathogen is equivalent to side-lining the cavalry on a battlefield – the soldiers on the ground must pick up the slack and increase their efforts and numbers in order to successfully wage war. It is theof the“ground soldier”and not the pathogens in and of themselves.We have beenin many of us by virtue of multiple,. Each of these activities A) increases the non-specific immune system response, B) lowers zeta potentials, and C) causes microscopic to macroscopic intravascular coagulation as ain mammalian tissue. It is this healing phase of tissue repair, when hyper stimulated, that is causing disease – from virulent organisms to inorganic particles to high frequency, high dosing, one size fits all attenuated multi-vaccinesThe body makes upwards of ten trillion white blood cell “neutrophil” soldiers/daily under conditions of “war.” Neutrophils have a lifespan of only six hours. They are “born to die.In battle, the white blood cells can cause considerable collateral damages especiallyover with multiple “battalions” over a protracted period of time.Vaccine adjuvant likeincrease the number of “battalions” and extends “the war” forThe, like any foreign substance in any tissue, once sequestered in the brain,. Dementia emerges as the collateral damage from an un-ending “war” that is waged between the white blood cells and their foe – in this case, a heavy metal for which the white blood cells lack the arsenal to destroy, – although they try. It is thethat. Death occurs by tissue specific hypoxic strangulation.This is MASS. This is largely a vascular and non-Newtonian fluid dynamics problem as a function of non-specific immune warfare to a foreign substance that the body cannot eradicate.\n\nThe Take Home Message, Part 4-1\n\n \n\n The important point is this: it is not any specific “germ” that is causing such wide-spread vascular damages throughout the body; it is the body’s non-specific immune response to ANY foreign substance entering the body (re: M.A.S.S. Disorders).\n\n \n\n MASS is a generic sequence of microbiological steps involved in tissue repair and healing.\n\n \n\n The MASS response is a common response across ALL pathogens and all foreign entities entering the body.\n\n \n\n It is the magnitude, chronicity, and frequency of the non-specific (white blood cell) immune response that is causing tissue damage, disease, and organ impairments and not the pathogens in and of themselves. \n\n \n\n The damages MASS cause are cumulative when MASS is activated systemically. Multiple organ systems are harmed by MASS, by ischemia, in clinically imperceptible ways. \n\n \n\n One-size fits-all, high frequency, repeat dosing, multi-vaccines, laced with a multitude of contaminants and immune accelerants, are causing a multitude of non-descript chronic ailments,of which autism-spectrum and the global epidemic of neurodevelopment disorders is but one category of vaccine induced pathology.\n\n \n\n The magnitude of the white blood cell response is a function of the virulence of the pathogen. We need not be vaccinating for every virulent organism on the planet, we need to be addressing the common cause of pathology across all of them – this is our body’s non-specific immune response which is the main cause of disease, disability, and morbidity for all.\n\n \n\n There are avenues for dealing with ALL infectious diseases now, in medical physiology, directed at the of disease (MASS) rather than individual vaccinations for every bug conceivable that an individual might someday acquire\n\n \n\n Source: http://www.scribd.com/doc/11564520/Ch-4-Mass-Zeta-Stress\n\n \n\n Related\n\nVaccination toxicity: The Zeta phase of MASS and “blood sludging”\n\n Iindex of articles\n\n http://www.vacfacts.info/vaccination-toxicity-the-zeta-phase-of-mass-and-ldquoblood-sludgingrdquo.html\n\n \n\n Shaken Babies by Dr. Archie Kalokerinos, MD\n\n http://www.whale.to/a/kalokerinos_sbs.html\n\n \n\n Brainwashed Police Prosecute Parents to Protect Vaccines | Vactruth.com\n\n http://vactruth.com/2012/11/08/brainwashed-police-ignore-vaccine-injuries/\n\n \n\n How the Medical Profession Covered Up Vaccine Injuries and Called it ‘Child Abuse’ | Vactruth.com\n\n http://vactruth.com/2012/02/14/medical-cover-up-child-abuse/\n\n \n\n Index-Articles\n\n http://www.vaclib.org/basic/sbsindex.htm\n\n \n\n [PDF] Mohammed Ali Al-Bayati, PhD, DABT, DABVT - Vacinfo.Org\n\n www.vacinfo.org/Man117_129.pdf\n\n \n\n Dr. Mohammad Ali Al-Bayati, PhD, DABT, DABVT Toxicologist & Pathologist\n\n http://www.toxi-health.com/falseaccusationsofsbs.html\n\n \n\n Shaken Baby Syndrome or Vaccine-Induced Encephalitis?\n\n Harold E. Buttram, MD\n\n \n\n http://www.jpands.org/hacienda/buttram.html\n\n \n\n http://www.profitableharm.com/Harold%20E.%20Buttram.html\n\n \n\n Shaken Baby Syndrome or Vaccine-Induced Encephalomyelitis?\n\n The Story of Baby Alan\n\n http://www.freeyurko.bizland.com/storyofbabyalan.html\n\n \n\n Shaken Baby Syndrome Diagnosis On Shaky Ground\n\n Viera Scheibner, PhD\n\n [PDF]www.medicalveritas.com/R0014.pdf\n\n \n\n Are mothers natural protectors or baby killers? Shaken Baby Syndrome and vaccines\n\n http://vactruth.com/2010/01/26/are-mothers-natural-protectors-or-baby-killers-shaken-baby-syndrome-and-vaccines/\n\n \n\n The Stepchildren of Modern Medicine, as Applied to Shaken Baby Syndrome (SBS)/Non-accidental Injury (NAI)\n\n http://www.vaccinationcouncil.org/2010/07/21/the-stepchildren-of-modern-medicine-as-app", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.scribd.com/doc/11564520/Ch-4-Mass-Zeta-Stress", "http://www.scribd.com/doc/11564520/Ch-4-Mass-Zeta-Stress", "http://www.scribd.com/doc/11564520/Ch-4-Mass-Zeta-Stress", "http://www.whale.to/a/kalokerinos_sbs.html", "http://vactruth.com/2012/11/08/brainwashed-police-ignore-vaccine-injuries/", "http://vactruth.com/2012/02/14/medical-cover-up-child-abuse/", "http://www.vaclib.org/basic/sbsindex.htm", "http://www.vacinfo.org/Man117_129.pdf", "http://www.toxi-health.com/falseaccusationsofsbs.html", "http://www.jpands.org/hacienda/buttram.html", "http://www.profitableharm.com/Harold%20E.%20Buttram.html", "http://www.freeyurko.bizland.com/storyofbabyalan.html", "http://www.medicalveritas.com/R0014.pdf", "http://vactruth.com/2010/01/26/are-mothers-natural-protectors-or-baby-killers-shaken-baby-syndrome-and-vaccines/", "http://www.vaccinationcouncil.org/2010/07/21/the-stepchildren-of-modern-medicine-as-applied-to-shaken-baby-syndrome-sbsnon-accidental-injury-nai/", "http://www.vaccinationcouncil.org/2010/07/21/the-stepchildren-of-modern-medicine-as-applied-to-shaken-baby-syndrome-sbsnon-accidental-injury-nai/"], "authors": ["Ken Adachi"], "publish_date": null}