{"result_id": "105007", "URL": "https://educate-yourself.org/cn/swinevaccinationinsanity07oct09.shtml", "timestamp": "2023-04-25 15:01:45 CEST+0200", "meta": {"description": "Oct. 7, 2009. Millions of people are now being poisoned in this country with an unproven, untested, uncertified, un-insurable, and un-idemnible, but PATENTED, lab-created cocktail of toxins that will cause -in a substantial percentage of those being vaccinated- its recipients to experience the very 'Swine flu' symptoms that it was suppose to 'protect' against.", "lang": "en", "keywords": "educate-yourself.org, ken adachi, swine flu vaccine dangers, swine flu hoax, dr true ott, genocide, population reduction, nwo, kathleen sebelius, Swine Flu Vaccination Insanity: Poisoning in the Name of 'Protection' (Oct. 7, 2009), http://educate-yourself.org/cn/swinevaccinationinsanity07oct09.shtml, novrtis, baster, pharmacutical vaccine mfg, liability protection, bsh, obama,", "favicon": "", "canonical": "https://educate-yourself.org/cn/swinevaccinationinsanity07oct09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Swine Flu Vaccination Insanity: Poisoning in the Name of 'Protection' (Oct. 7, 2009)", "cleaned_text": "Swine Flu Vaccination Insanity: Poisoning in the Name of 'Protection' (Oct. 7, 2009)\n\n\n\nSomeday, maybe, someone will chronicle the insanity now underway around this country (and the world) with a novel that begins something like this:\n\n\"It was the strangest of times, it was the nuttiest of times\"\n\nIf there ever was a case to be made for mass mind control via an unprecedented propaganda blitz organized by the Illuminated traitors in government, the 'health care' industry, and main stream media, this is it.\n\nMillions of people are now being poisoned in this country with an unproven, untested, uncertified, un-insurable, and un-idemnible, but PATENTED, lab-created cocktail of toxins that will cause -in a substantial percentage of those being vaccinated- its recipients to experience the very 'Swine flu' symptoms that it was suppose to 'protect' against.\n\nFor most people, those symptoms will manifest in about 2 weeks following their inoculations. The reaction will be anything from mild sniffles to a very bad, life-threatening reaction including high fever and may result in death for some. Those who experience no symptoms whatsoever, should consider themselves lucky. About 20-30% of the population will have natural immunity against anything thrown at them (a little gift from God, I suppose, in order to carry on the species).\n\nVery young people who experience the first wave of symptoms at the two week mark, may have another round of less severe symptoms two weeks after the first round and it may continue for a time at 14 day intervals. This is the now well documented 14 day-following-inoculation interval that Dr Vera Scheibner of Australia discovered and wrote about some years ago with babies who were vaccinated. I first heard of her work from a talk she gave at the Granada Forum in the mid 1990s, but I see that she is still active, having only recently completed a video interview with Gary Null in a new documentary that he's produced on the dangers of vaccines (I heard about it, but I haven't seen it).\n\nI mentioned in my October 5, 2009 article, The Great Poisoning of America Begins, the 14 day onset of symptoms interval-due to the Swine flu vaccine- that showed up aboard the Navy ship that left for Phukette Thailand on April 21, 2009 from San Diego and reported to radio host Drew Malone Raines.\n\nSome people won't have to wait for 14 days to get a reaction to this vaccine. Some will experience a severe reaction within hours of being vaccinated and some may die within hours of being vaccinated (it's happened before).\n\nBut you shouldn't worry because Kathleen Sebelius, Imposter Obama's Secretary of \"Health\" and 'Human Services' (whew, Kafka should be spinning like a top in his grave) said today -on every main stream media outlet- that the Swine flu vaccine is perfectly \"safe\"; nothing to worry about!\n\nAnd when your child or your spouse or your father or mother dies from \"Swine flu\" in the wake of receiving their \"safe\" Swine flu vaccination, you can write Kathleen and say: \"Hey, you said that it was safe!\" ~ but don't expect a reply.\n\nFailing to hear back from Kathleen, you may think about hiring a lawyer and suing the pharmaceutical company that made the vaccine (and earned billions in profit), or the person who administered the vaccine, or the school or health department or hospital that told you that your loved one \"had\" to get the vaccine, but you will find that they are ALL protected from lawsuits or liability claims. The Bush-era congressional traitors laid the groundwork for liability protection for all Complicit Criminals Concerned (the CCC) and the liability shielding was further consolidated by the Obama-era congressional traitors. So you're just flat out of luck when it comes to collecting any sort of monetary damages for the pain, suffering, and loss that you may experience from those 'safe\" Swine flu vaccines.\n\nOf course, the long term immune-compromising, poisoning effects from the 'safe' Swine flu vaccine will continue whether you experience the 14 day reaction or not. Just ask a family member of someone who got vaccinated by the military in Gulf War I and came down with \"Gulf War syndrome\" (over 200,000 died) due to the squalene adjuvant. For those children who get the live virus via nasal, Flu mist sprays, they will act as CARRIERS for a couple of weeks and shed the virus to other family members at home. While people who died from practically anything in the past few months, were being labeled \"Swine flu\" deaths in order to pump the Swine flu 'pandemic' hysteria, we will begin to see many more deaths in the months to come that can justifiably be labeled \"Swine flu deaths\", but those deaths will come in the wake of Swine flu vaccinations, or from acquiring the bio-weaponized Swine flu infection from those who had been vaccinated. As the death toll goes up, the call will go out from the Illuminated government swine and their media whores to push for mandatory nationwide vaccinations to \"protect\" the American public and \"save\" the nation.\n\nFor anyone who wishes to discover the documented PROOF that the Swine flu vaccine is a man-made, bio weapon, intended by Club of Rome planners to reduce world population by staggering numbers, you need only Google the name of Dr. A True Ott and start reading (or viewing his videos).\n\nI only wish that this insanity was a B grade Vincent Price horror movie that I could rent from a video store ~ and then return and forget about~ rather than a real life horror show. I can't believe this is happening.\n\nSwine Flu Hoax & the Genocidal Agenda Behind Swine Flu Vaccinations: Index of Articles\n\n http://educate-yourself.org/cn/swinefluindex.shtml\n\nI think I love Big Brother.\n\n \n\n Today on the NPR show \"On the Media\", the commentator interviewed the public relations chief of the CDC.\n\nWow. Now I get it. All the anti-vaccine hysteria is based on 'bad science' and misinformation-based rumor mongering. No original source research was discussed, but hey, NPR says it's all OK. Just get my shots, my shots, my shots...", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/cn/swinevaccinationinsanity07oct09.shtmlhttp://educate-yourself.org/cn/swinevaccinationinsanity07oct09.shtml", "http://educate-yourself.org/cn/poisoningamerica05oct09.shtml", "http://www.youtube.com/watch?v=Ro1WL5ketWg&feature=related", "http://apnews.myway.com/article/20091007/D9B6CGNO0.html", "http://www.independent.co.uk/news/business/analysis-and-features/the-great-swine-flu-mystery-1798679.html", "http://educate-yourself.org/vcd/mercolasqualenedangers17jul09.shtml", "http://www.cnn.com/2009/HEALTH/10/06/h1n1.vaccine.questions/index.html", "http://www.rense.com/general87/flumist.htm", "http://www.cnn.com/2009/HEALTH/10/06/h1n1.vaccine.questions/index.html", "http://educate-yourself.org/nwo/nwopopcontrol.shtml", "http://educate-yourself.org/cn/swinefluindex.shtml"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}