{"result_id": "105016", "URL": "https://educate-yourself.org/vcd/vdqandaonvaccines.shtml", "timestamp": "2023-04-25 15:01:52 CEST+0200", "meta": {"description": "Alternative Therapies - Electro-Medicine, Ozone Therapy, Nutritional Therapies, Colloidal Silver, etc.  Protection from new emerging diseases & biological attack through immunity boosting.", "lang": "en", "keywords": "blood electrolysis, non-drug therapies, electro-medicine, zapper, oxygen therapies, ozone, hulda clark, colloidal silver, royal raymond rife, georges lakhovsky, multi-wave oscillator, electromedicine, blood cleaners, gerson therapy, budwig diet, vaccines, nutitional, vaccinations, emerging diseases, nikola tesla, brain tuner, cure for AIDS, cure for cancer, scalar waves, magnetic pulser, alternative medicine, hanta, red tide, pfiesteria, curative plants, MRT, bob beck, dr joanna budwig, secret of life, waves that heal, dowsing, holistic, health, natural, len horowitz, immunity boosting, AIDS, cancer, Dr Robert O Becker, the body electric, cross currents, meditation, tesla coil, meningitus, flesh-eating bacteria, mad cow disease, suppressed, urine therapy, anthrax, virus, virii, ebola, flax seed oil, sodium ascorbate, cayenne pepper, capsicum, james clerk maxwell, F Batmanghelidj, mwo, juicing, supplements, vitamin c, vegetarianism, dairy, milk, fiber, your body's many cries for water, mcdougall program, immune system, diet for a new america, john robbins, borderlands", "favicon": "", "canonical": "https://educate-yourself.org/vcd/vdqandaonvaccines.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "-The Educate-Yourself Newsletter August 16, 2000", "cleaned_text": "The Thinktwice Global Vaccine Institute supports the right of every individual to make informed \n\nvaccine decisions. This website also contains numerous Personal Stories and other Disturbing \n\nInformation.\n\nWe wish to express our encouragement and support toward the many parents and other concerned \n\npeople seeking answers to their vaccination queries. We also want to applaud the wise individuals \n\nwho had the courage and foresight to investigate this subject prior to exercising their options. We are \n\nconfident that preventive healthcare measures will evolve. For all of our children, the American \n\nnotion of freedom, and future generations, thank you.\n\nAll rights reserved. No part of this information may be reproduced, transmitted, or utilized in any \n\nform or by any means, electronic, photographic or mechanical, including photocopying, recording, or \n\nby any information storage and retrieval system, without written permission from the author, except \n\nfor brief quotations in literary articles and reviews.\n\nWARNING: The decision of whether or not to vaccinate is a personal one. The authors of this \n\nwebsite are not health practitioners and make no claims in this regard. Nor do they recommend for \n\nor against vaccines. Most of the information on this site is taken from other sources and documented \n\nin many of the books that we offer. If you have any questions, doubts, or concerns regarding any of \n\nthe information on this site, research this topic even further so that you can make a wise and \n\ninformed choice.\n\nThe following information was minimally edited for syntax, brevity, and clarity. It is dedicated to \n\nparents and children everywhere. Your comments are welcome.\n\nQ. I found your internet articles on adverse reactions due to vaccines very informative and, \n\nI must say, heart wrenching. However, none of the information was surprising for I too \n\nhave dealt with my child's adverse reaction to her DPT shot. I would like to tell my story \n\nfor it does have a happy ending, thus far. I am very glad to say that my daughter has \n\nregained about 90 percent of her health. Her episode began when she was given her first \n\nshot at two months of age. Prior to her first shot she was a normal and healthy baby. After \n\nher first DPT shot, her appetite greatly decreased, she cried excessively and would arch \n\nher back as if in pain. She was also constipated and less active. X-rays and an MRI on the \n\nmid section of her body did not reflect anything unusual. Lexy was given her second DPT \n\nshot when she was four months old. She immediately displayed distress and a lack of \n\nappetite. All of her previous health problems magnified. By the next day, she was crying \n\nexcessively and was too weak to move her head. The pediatrician attributed this to the flu. \n\nThat night as I was trying to rest after comforting her all day, her crying ceased. I called \n\nout to my husband who had been in the next room to check on her, and then there was \n\ncomplete silence. I asked my husband if there was anything wrong, yet there was still \n\nsilence. I went into her room and found my husband giving her CPR. He yelled to call 911 \n\nwhich I immediately dialed. After completing the call, I watched in horror as my husband \n\ncontinued to give her CPR. She was bluish-gray and still not breathing on her own. Less \n\nthan five minutes later, I watched as if in slow motion the paramedics pick up my daughter \n\nand carry her into the awaiting ambulance. The same pediatrician was in the emergency \n\nroom with no answer to account for her grave condition. She began to breathe, yet every \n\nbreath was a struggle. A team from another hospital arrived and transferred her to the \n\nnearest PICU unit. She was placed on a ventilator that night. For the next week, my \n\ndaughter was put through every test imaginable, including numerous MRIs. Each test was \n\ninconclusive. My daughter remained on a ventilator as I painstakingly realized that \n\nmedicine was indeed not a perfect science. An MRI the next week confirmed that my \n\ndaughter had Transverse Myelitis, inflammation of the spinal cord including the brain \n\nstem. As the doctors told us this news, they informed us that her condition was grave. She \n\nremained on a ventilator for the next month; each day she slowly began to show signs of \n\nimprovement. She was eventually taken off the ventilator and two months after her being \n\nadmitted, she was finally discharged. As I stated previously, I am very pleased to say that \n\nmy daughter has almost completely recovered. That was four years ago, and today she is \n\nnow in kindergarten and doing very well. I thought this real life experience might make a \n\ndifference in one child's life whose parents are still contemplating the decision to vaccinate \n\ntheir child. I can only say that this is a personal decision, yet every parent should know just \n\nwhat might happen if they vaccinate their child.\n\nA. Thank you for sharing your story. We receive email every day and the stories are remarkably \n\nsimilar. We are trying to make a difference by educating parents regarding the serious problems \n\nassociated with vaccines. We are also trying to wake parents up to the criminal behavior of the \n\nperpetrators who refuse to acknowledge or inform parents of the associated risks. Best wishes to \n\nyour daughter. I'm sure that she has a bright future.\n\nQ. I have just completed reading your web site. It touches me and angers me to see the \n\nstories that sound all too familiar. My daughter had a reaction to her first immunizations at \n\nage two months. I am an RN and had been taught that immunizations were just something \n\nthat all children had to have. I never even realized one had a choice. My daughter had her \n\ninjection at 3:30 pm. She was a little off in the evening but fell asleep around 6:30 or so. \n\nNot being a great sleeper to begin with, I let her sleep on my shoulder while I relaxed on \n\nthe couch. I have no idea why I did this but something made me pick her up so I could look \n\nat her. Her face was grey, she was not breathing and when I checked she had no heart \n\nbeat. I immediately started CPR and called 911. By the time the paramedics had arrived \n\nshe was conscious and making an effort to cry. We went to the hospital. Her heart rate \n\nstayed at 250 for the next few hours in a very strange arythmia. Neither the doctor nor I \n\ncould figure it out. She also stayed mottled for the next three hours. When they felt her \n\ncrisis had passed they admitted her into the pediatric ward. This was 1:00 in the morning. \n\nThe hardest part was when they told us to call our family members in. I knew then that they \n\ndidn't expect her to live. But my little angel surprised us. They discovered that she had a \n\nUTI and started treatment. Six days later we went home with her on heart and lung \n\nmonitors and us having a lot of unanswered questions. No one was willing to admit she'd \n\nhad a reaction. When I phoned public health, the reaction had never been reported. I \n\nlooked everywhere for information and found little to none. I contacted every pediatrician I \n\ncould network with. The result of that was being called into my family doctors and being \n\nreprimanded for doing this. A big conference was held with us, the G.P., and pediatrician. \n\nSomehow I got conned into re-immunizing her at four months. They admitted her to the \n\nhospital for this one as it was the only way I would allow it. She turned grey around three \n\nhours after the injection, but otherwise being awake she pulled through it. She had what I \n\nfelt were petit mal seizures and one grand mal seizure following this at home. Each time I \n\nwas discredited by the doctors. Being a nurse I've seen enough to know what they were. \n\nShe also suffered long bouts of crying, totally inconsolable. I finally I went to see a \n\nchiropractor (out of sheer desperation because I really didn't think he could do anything) \n\nand he was able to work with her. Her manner and behavior changed so quickly it was \n\namazing. He also gave me the information I needed to fight the doctors, and my daughter \n\nhad no further immunizations. It was such a victory to finally be able to say No! A note of \n\nthanks for all the work that is now being done. My daughter is now three years old and is \n\nthe light of our lives. I educate other parents whenever I can. Little steps can make a big \n\ndifference.\n\nA. Thank you for sharing your story. I am glad to hear that your daughter is doing well and your \n\nstory had a happy ending. We receive email and letters just like yours almost daily. This madness \n\ncontinues, but we are doing everything we can to educate people before the damage is done. If you \n\nemail your mailing address, we will send you a complimentary book on vaccines, as well as a free \n\ncatalog with excellent resources on vaccines and natural health.\n\nQ. Mr. Miller, a couple of years ago you wrote about my son in your book. I would like to \n\nlet you know that his condition is worse now and he has had another brain surgery in May. \n\nThings seem to have gotten worse as far as his grand mal seizures. He used to have them \n\neither every 14 or 21 days and they would last for 15 hours. Now they are every 10 days \n\nand last for 22 hours with as many as 85 grand mals in this timeframe. I would like to write \n\na book on all the things that go into raising a vaccine damaged child. Are you going to be \n\nwriting any more books on this subject soon?\n\nA. Thank you for the update on your son. I am sorry to hear that his condition is worsening. I am still \n\ndiligently advocating vaccine awareness, and have written three books on the topic. I want to \n\nencourage you to tell your story. There is a great need for other parents and government officials to \n\nrealize the extent of damage being inflicted on our healthy children, and the toll that parents like \n\nyourself must pay. Feel free to contact me in the future when you have organized your thoughts to \n\nshare with others. Perhaps I can steer you in the right direction.\n\nQ. On August 28, 1997 I took my healthy five month old to the doctor for his well baby \n\ncheck-up. He received his third set of vaccinations, including a DPT shot. Two hours later \n\nhe began having severe diarrhea, vomiting and shortness of breath. His body was limp and \n\nhe was going in and out of consciousness. I took him to the children's hospital where he was \n\nexamined by a doctor who told us he was fine and to take him home and give him Pedialyte \n\nevery twenty minutes since he couldn't keep anything down. I looked at the nurse and said, \n\nI don't care what that doctor said, he's wrong...look at my son's eyes. His eyes had dark \n\ncircles underneath and they were sunken in. He was extremely pale and wouldn't smile or \n\nshow any emotions. It was only after my insisting that he was ill that they performed blood \n\nwork and determined he was severely dehydrated. We spent 16 hours in the emergency \n\nwaiting room before being admitted, and even then they had no idea what was wrong with \n\nhim. They kept saying it was a stomach virus, but I know better.\n\nA. We receive several letters like yours every week. Perfectly healthy babies are being damaged by \n\nthe vaccines, and doctors continue to deny it. I am sorry that you had to be awoken to this serious \n\nproblem the hard way. Please call the Vaccine Adverse Event Reporting System (VAERS) \n\nat 1-800-822-7967 to file a report. You may also want to read some of our books on vaccines to \n\nbetter understand the issues. We can send you a free catalog, or you may call 505-983-1856.\n\nQ. The story from the woman with the child injured by DPT vaccinations is very similar to \n\nthe story of my family. My brother was a normal, healthy two year old when he got his 3rd \n\nDPT vaccination from our doctor. Within a few days, he had forgotten how to talk, walk, \n\nuse the bathroom and use eating utensils. My mother confronted the doctor with what she \n\nthought were seizures. The doctor ruled out seizures saying they were tantrums and that \n\nmy mother should try more strict discipline. I had been the victim of viral meningitis at age \n\nsix months and had a lengthy stay at a hospital. The doctor said that because of my illness, \n\nmy mother was no longer able to discipline us correctly and that she enabled my brother's \n\ntantrums. My mother spent countless hours at the library researching vaccinations and \n\npossible side effects. Finally, she found a wonderful doctor willing to examine my brother. \n\nHe took one look at him and said it is obvious to me that this child is having seizure \n\nactivity. My brother then underwent various testing at John Hopkins Medical Center, and \n\nalthough no specific diagnosis has ever been assigned to his condition, at least we now \n\nknow that there is a true medical problem. The doctors who called them tantrums still don't \n\nbelieve to this day that my brother is having seizures. The story gets worse, however. \n\nWhen my mother tried to enroll my brother in the local school for mentally and physically \n\nchallenged young people they refused to admit him without a fourth DPT shot. My mother \n\ncalled our doctor who said a fourth shot would almost definitely kill him or make him a \n\nvegetable. Thanks for listening.\n\nA. Thank you for sharing your story.\n\nQ. Dear New-Atlantean, my sister has a heart wrenching story to tell about the death of \n\nher son due to the immunization policies regarding the use of the much hated DPT vaccine. \n\nHer memoirs include a horrific battle with the government over this DEATHLY practice. \n\nShe won her case against the government and was an initial force in bringing this to the \n\nattention of the world. This ongoing death-causing practice is still claiming children's lives \n\ntoday. She is very devoted to making her story available to concerned parents around the \n\nworld. I believe your interest in these memoirs would be of benefit to the world as well as to \n\nall parties concerned. I wonder if you can help us or direct us to someone who can. Thank \n\nyou.\n\nA. We would be interested in looking at a manuscript. It sounds like a story that needs to be shared \n\nwith society.\n\nQ. It is excellent to see that there are those who have the courage to tell others about the \n\ndangers of vaccines and the very real severe adverse reactions that are more common \n\nthan health authorities state. They play down the seriousness of the adverse reactions \n\nbecause of their own vested interests. In our country, Australia, they are giving GPs a pay \n\nbonus to step up immunization, because as more and more people ask questions and are \n\nbetter educated, less are willingly vaccinating their children. Now, when parents take an ill \n\nchild to a GP, the GP concerned with lining his or her own pocket will push parents to \n\nvaccinate. I have a sister who was born in 1972, and at six months received her third DPT \n\nshot. When she was approximately nine months my father noticed her having little seizures. \n\nMy mother took her to a GP and expressed concern that it was a reaction to the DPT. This \n\ninhumane man told her, \"It's just a spoiled reaction, take her home and start smacking \n\nher.\" By the time a doctor finally did listen it was way too late, the damage was done. She \n\nwas my parents fourth child, so who better to know that she was a normal healthy, \n\ndeveloping child, than those who had three children already. The medical practitioners and \n\nhealth authorities can deny the link to SIDS all they like, but the fact is there is a causal \n\nlink to vaccines. This has been proven by Dr. Vera Scheibner through the use of Cotwatch \n\nmonitors that record the baby's true breathing patterns. This instrument has proven that an \n\ninfant's breathing is affected by vaccines for months after they receive the DPT. [Data \n\nfrom the cotwatch studies is available from New Atlantean Press.] Keep on publishing the \n\nfacts about vaccines, as well as the real reason that vaccines were developed -- as a \n\nmoney-making venture for drug companies, which has been very profitable for them, but \n\nhorrifying for the recipients of these poisons.\n\nA. Thank you for your encouragement and support.\n\nQ. Dear Mr. Miller, our son received his vaccines at six months. His older sister had \n\nadverse reactions [to DPT] of high fever and high pitched screaming so his doctor \n\nrecommended pediatric DT. I was reassured that there was no reason to be concerned. \n\nWithin six hours after his dose of Hib and DT, our son was not himself. I laid him down for \n\na nap because he looked pale and his skin felt cold and clammy. Something told me to \n\ncheck on him moments after I laid him down. He was in his crib, blue, with his eyes rolling \n\nback then fixed in a strange stare, rigid limbs, foaming at the mouth, and his chest \n\nappeared to be laboring to breathe. My husband and I raced him to the emergency room \n\nwhich, thank God, was just down the street. I had to stimulate him by calling his name and \n\ngently shaking him. He stared in a strange way I had never seen and was barely breathing. \n\nEverything seemed surreal. My husband and I were so scared. We did not know if he \n\nwould make it to the hospital. When we arrived, seconds later, they quickly grabbed him \n\nout of my arms. They did not know his name and did not have time to ask. They called him \n\nCharlie Brown. They suctioned out his throat, but of course nothing was blocking his \n\nairway; it was just closing on it's own. As quickly as this started, he spontaneously came \n\nout of it. He was smiling up at the doctors and nurses who were trying to save him. \n\nEveryone applauded and laughed. We were just lucky. Our son is now two years old and \n\nthere appears to be no permanent damage. I always wonder what damage occurred that I \n\nam not aware of yet. My precious son almost died in my arms. Needless to say, I never \n\nvaccinated him again. I pray for those who don't know the dangers as well as those who \n\nwere not as lucky as we were. It has become my life's work to help with this issue, and \n\ninform other parents. Please allow me to help in any way.\n\nA. I am sorry about your frightening ordeal but pleased that it had a happy ending. Sadly, we receive \n\nmany vaccine horror stories that are quite similar to your own. There are several ways to take an \n\nactive role. Decide how you would like to contribute and jump into the fray. You may wish to start \n\nan organization, or work with one that is already established. You may wish to give talks, sell \n\nvaccine books, or lobby the government. Decide which avenue of expression is best for you and get \n\nstarted. We need more people like you so that positive changes can begin to take root. Once you \n\ndecide how you would like to contribute, let me know if I can be of further assistance.\n\nQ. My daughter had a severe reaction to the DPT vaccine. She has not had the DPT or the \n\nDT vaccine since her reaction. She is now entering the 5th grade. So far, the local school \n\nsystem has respected my wishes that she not receive the DT vaccine, but I wish to be \n\nprepared in case they become more forceful in their requests. Is there any data available \n\non reactions to a DT vaccine? Any help you can give me would be most appreciated.\n\nA. New Atlantean Press offers the exact state laws of each state. These laws indicate the type of \n\nexemption from the shots that your state permits. Arguing with the authorities over the dangers of the \n\nshots is not a course of action that I recommend. Find out your state laws and proceed from there.\n\nQ. We have been told that there is an epidemic of whooping cough heading our way. We \n\nlive in Washington and were told that it is currently in Idaho. We have four children. Our \n\noldest is 11, then we have two boys that are six and seven, and a three year old girl. Our \n\nchildren have never had the pertussis shot. They have only had DT (and dead polio) along \n\nwith the rest of the recommended shots. I didn't think there was any danger with anything \n\nother than pertussis and live polio. Our oldest had whooping cough when she was three \n\nyears old. Fortunately I took her in because I was concerned as soon as she started the \n\ncoughing. We were quarantined for five days while we all took eurithomiacin. We did not \n\nget the whooping cough shots for her because of two very serious reactions in two of my \n\nyounger cousins; one resulted in death. The children's hospital wouldn't say that it was \n\nbecause of the vaccination which her doctor in gave her baby when she was only five weeks \n\nold. That's right, five weeks old, because he was going on vacation. The other child was \n\ngiven DPT in 1/4 doses and the third 1/4 dose shot put her into seizures due to a high fever. \n\nShe was hospitalized, strapped to a board, etc. The doctors will never convince me that this \n\nwas a coincidence. Now the dilemma: I called the health department and was told that they \n\nhave a new vaccine against whooping cough. I was told that whooping cough is a fatal \n\ndisease in which there is no treatment and was given the normal \"good outweighs the bad\" \n\nspeech. I was told that this is safer with no known side effects other than a tender arm. I \n\nam aware that even if we get the shots it will take several weeks before any antibodies are \n\nbuilt up for this disease. I was told that they wouldn't give it to my boys that are six and \n\nseven because there is a higher risk of side effects. My kids haven't had all the \n\nrecommended shots at the ages they were supposed to mainly because I kept thinking \n\n\"what if,\" and I didn't want to hold my babies while they were playing Russian Roulette \n\nwith them and allow them to do it. So I think it is a good thing that I was nervous about it. I \n\nam terrified of anything \"new\" when it comes to shots. It wasn't long ago that everyone \n\nwas told to get the new flu shots and lots of people did. A little bit later people started \n\ndying. It turned out to be the shot! I guess I am rambling now. I need to know if I am \n\nmaking a mistake in not getting the shot for her. My gut feeling is no way. The risks are \n\ntoo high but I don't want to intentionally expose them to a fatal disease either. Our six year \n\nold has had milk allergies and was on soy formula as an infant. He now drinks some milk, \n\nbut in excess it causes him to get all stuffed up. Our 3 year old was on soy after she \n\nstopped breathing at 3 days old. At 7 months old she spent 4 days in an oxygen tent (after \n\nnumerous cat scans and neurological tests because of \"arching\" her back from birth). It \n\nturned out that she has asthma and got RSV. She was using a pulmo aid for several months \n\nwith albuterol. She isn't having asthma problems at the present. She was hospitalized in \n\nJanuary for 5 days with severe bladder and kidney infections and will remain on \n\nmacrodantin for a minimum of 6 months to a year. I am concerned about her immune \n\nsystem being weak and whether it will create a bigger risk not getting the shot. I called her \n\ndoctors office and talked to the nurse. She is going to do research about the new pertussis \n\nshot to see if it can be given in smaller doses and why it isn't safe for children over 4 \n\n(according to the health department). She said it would be safe to give her even with her \n\nmedical problems. I did read on the vaccine contradictions that this was not the case. Do \n\nyou have anything you can e-mail me to take to the doctors office to give them? I did print \n\nout the pages about that and the \"stories\" of families that have had problems. Because she \n\nis 3 is there less chance of a reaction? Is there also a better chance that she will be able to \n\nfight the whooping cough even with her past problems? This is an urgent issue for us since \n\nwe must make a decision one way or another. Thank you.\n\nA. Take a deep breath. Do not allow yourself to be rushed or forced into something that you are \n\nunsure of. Washington state does not ``mandate'' the shots. You are entitled to reject them without \n\nhaving to explain your reasons to doctors, nurses, or other individuals who may try to intimidate you \n\nwith scare tactics. Pertussis is usually more problematic with infants, and is rarely a serious threat for \n\nolder children. This is well-documented in the medical literature. There are many good books on \n\nvaccines. I recommend that you read up on this subject so that you are not so vulnerable to medical \n\nploys. Consider the following books: 1) Vaccines: Are They Really Safe and Effective? 2) \n\nImmunization Theory vs. Reality 3) DPT: A Shot in the Dark 4) Vaccination: 100 Years of \n\nOrthodox Research. A summary of each of these titles may be found on our web page containing \n\nvaccine books and laws: Vaccine Books and State Laws. Good luck and much peace to you with \n\nyour decision.\n\nQ. My daughter was in a government post natal care unit at the age of eight weeks \n\nbecause we were having feeding problems that we were being helped with. While there, her \n\nimmunizations fell due and I was encouraged to take her to the doctor down the road to \n\nreceive them. Not having any information on the subject I did so with the understanding \n\nthat I was being a responsible parent. That night when I was out of the room my daughter \n\nstopped breathing. I was told that the nurse had taken her away to give her oxygen. When \n\nI tried to get information on what actually took place it was as if nothing important \n\nhappened. It was never recorded on her records and I was told it was purely temper -- at \n\neight weeks old! When we left this hospital Nicole had developed a mild skin rash which \n\nover the past two years has worsened and no doctors can give me an explanation for it. I \n\nam grateful that when my daughter stopped breathing she was with someone and could be \n\nhelped, but what would have happened if she had been in bed at home? Would she have \n\nbeen another case of cot death? Wake up Australia! The government does not care about \n\nyour children. You need to be informed and make educated decisions for your children.\n\nA. Thanks for sharing your story. As you have learned, the damage to our children and the pervasive \n\ncover-up continues.\n\nQ. Hi. I was at your site today researching the Hepatitis b vaccine. My daughter was born \n\nin 1981 with a near perfect apgar. She thrived on breastmilk until her two-month checkup. \n\nWe had told the pediatrician when her brother was born in 1978 about our family history of \n\nseizure disorder [a contraindication to receiving vaccines] and reminded him again at her \n\nbirth. He insisted she get the DPT shots anyway and we were young and naive. I even \n\ntrusted him. Within several hours of getting her first shot she screamed inconsolably for \n\nhours. After about 24 hours she stopped screaming and became apathetic. She was limp \n\nand disinterested in eating or smiling. She no longer turned over or kicked vigorously when \n\nplaced on her back. She could no longer hold her head up when held on my shoulder. We \n\ncalled the doctor several times during the initial 24 hours and days that followed. They \n\nalways assured us her reaction was normal and told us to keep giving her Tylenol. \n\n(Looking back now I wonder how baby Tylenol heals damaged brain cells.) After a few \n\ndays she developed her first definable illness, \"coincidentally\" an upper respiratory \n\ninfection. We took her to the doctor and he diagnosed her as \"failure to thrive\" and \n\n\"complete loss of muscle tone.\" He still would not admit it was the shot! In fact, even \n\nthough we fought him she still received her four month and six month dose of pertussis. He \n\nwas the almighty doctor and therefore knew more than us. However, by her 18 month shot \n\nhe told us that because we insisted he would withhold the pertussis. Who knows though, \n\nbecause years later when he retired and we transferred her records, his records show that \n\nshe received DPT at 18 months.\n\nOur older son also reacted to the DPT. He began having night terrors and visual auras. \n\nThe night terrors continue to this day whenever he has a fever. He is in college now.\n\nSo what happened to our daughter? She was homeschooled until 1996 when she entered the \n\npublic schools. She is in special classes with a recorded I.Q. of 50. She is 16 years old now \n\nand struggles daily to complete a 2nd grade curriculum. Physically she has very poor \n\nmuscle tone, poor small and large motor coordination. The good news is that we just moved \n\nto another state and they are actually educating her rather than just babysitting. And the \n\nschools here are amazed that verbally and socially she is very able to fit in with the regular \n\ned kids. They actually told us they attribute this to our homeschooling.\n\nI am grateful my child is alive. I love her like she is but I do hurt for her when I realize \n\nmany of her dreams will not come true. And they are such easily attainable dreams for an \n\naverage person. She wants to marry and be a mommy like me. Meanwhile, life does go on. \n\nOur 3rd child is 5 years old and never had any immunizations! She is as healthy as a little \n\nhorse. The toughest part is that no one will admit it was the shot. We have been told in fact \n\nthat it absolutely was NOT the shot. Duhh! I was there. It WAS the shot! I hate being \n\npatronized and told I am only a mother. I have researched a lot, am very bright, and can \n\nprobably understand as much as most of the doctors we have seen. Thanks for listening.\n\nA. Thanks for sharing your story. The damage to our innocent children continues. Authorities have \n\nnot changed; they remain stubborn, arrogant, and in deep denial. I'm sorry that you had to learn the \n\nhard way. You are not alone, but more and more parents are waking up before it is too late. Best \n\nwishes to you and your family.\n\nQ. Dear Mr. Miller, I am the mother of a 22 year-old daughter who was first immunized at \n\nthree months of age. Today she is severely to profoundly mentally handicapped, and has \n\nirretractable seizures. She functions on about a two to three year-old level. Our story is \n\nmuch like those I read on your web page. Luckily we had a military doctor overseas who \n\nnoted on her shot record that she could have had a possible reaction to the shot. We were \n\nto only give her DT from that point on. I had no idea what that meant or why, but I always \n\nreminded the airman who would give her the shot. I am sure that this saved my daughter \n\nfrom any further damage. The sad thing was that although this early someone had \n\nrecognized that there could be a connection, NO ONE would say it was so. So I agonized \n\nover what to call it for ten years! I could only say she was ``mentally retarded and had \n\nuncontrollable seizures.'' That is, until ABC's ``20/20'' showed a program with many other \n\nfamilies in our same nameless, hopeless situation. When I confronted the doctor, she said \n\n\"Yes, of course that is what happened to your daughter, but you'll never be able to prove \n\nit.\" I thought that at least now I can go and look in a book to see what to expect. But there \n\nis no book that tells you what to expect when your vaccine injured child begins different \n\nphases of life. Every day is a learning process. These children don't fit into the convenient \n\nlittle special education slots that most school systems offer. My beautiful daughter is a \n\nsquare peg and the only things available for her are round holes. I spoke with a woman in \n\nTulsa, Oklahoma almost twelve years ago. She told me she held her screaming infant from \n\nthe time it received its shot until it breathed its last breath. The autopsy report read \n\n\"SIDS\"! I can never be swayed from believing that many deaths reported as SIDS were \n\nreally DPT reactions. As the former parents' group DPT (Dissatisfied Parents Together) \n\nused to state: \"When it happens to your child, the risks are 100 percent.\"\n\nMy three year-old grandson only received the DT. I had sworn for years that no grandchild \n\nof mine will get pertussis, but when it came time for that event, I retracted and told my \n\ndaughter and her husband that the decision had to be their own. I didn't want them to base \n\nit on what my heart and mouth had said for years. My daughter was in registered nursing \n\nschool at the time and based her decision on many factors. They opted not to give it to him, \n\nand their pediatrician agreed. She had also treated my disabled daughter and knew the \n\nhistory.\n\nI am still missing pieces of the pie. I know there are many parents with vaccine-damaged \n\nchildren that I could educate. Back then there just weren't a lot of them diagnosed \n\ncorrectly. Many parents just accepted that their child had \"problems.\" That was never \n\ngood enough for me.\n\nBesides the danger from seizures, could this shorten her lifespan? I really worry about the \n\nmassive amount of drugs necessary to give some control of her seizures. Brain surgery \n\nisn't an option because the damage is so global it wouldn't be possible. Plus, the results \n\nfrom such as a corpus colostomy aren't convincing enough for me to allow them to operate \n\non her. Hell, I can't even explain to her what her period is about! I am so baffled that she is \n\nso physically able yet so mentally unable to perform even simple tasks.\n\nI pray a lot because I know I can't do anything else. I would be willing to have others \n\ncontact me who have similar stories, or if their children are young and they don't know \n\nwhat tomorrow holds. I don't either, but I can tell them what happened yesterday. Thank \n\nyou.\n\nA. I am very sorry to hear of your story. Sadly, it is one that I hear all too often. Regarding how to \n\ndeal with the changes your daughter will go through, I suggest that you consider recording your \n\nexperiences. Perhaps you can write the book that is needed. It would be quite helpful, I'm sure, for \n\nother parents in your situation. From the way things look today, it doesn't appear that doctors and \n\n health officials are going to make the necessary changes any time soon to end this madness. Your \n\noffer to be a reference to other parents is generous. I will make a note of this. Best wishes to you \n\nand your family.\n\nQ. On August 28, 1997 I took my healthy 5 month old for his well baby check-up. He \n\nreceived his third set of vaccinations, including a DPT shot. Two hours later he began \n\nhaving severe diarrhea, vomiting and shortness of breath. His body was limp and he was \n\ngoing in and out of consciousness. I took him to the children's hospital where he was \n\nexamined by a doctor who told us he was fine, and to take him home and give him pedialyte \n\nevery twenty minutes since he couldn't keep anything down. I looked at the nurse and said \n\n\"I don't care what that doctor said, he's wrong..look at my son's eyes.\" His eye's were \n\nsunken in and he had dark circles underneath his eyes. He was extremely pale and \n\nwouldn't smile or show any emotions. It was only after my insisting he was ill that they \n\nperformed bloodwork and determined he was severly dehydrated. We spent 16 hours in the \n\nemergency lobby before being admitted, and even then they had no idea what was wrong \n\nwith him. They kept saying it was a stomach virus.\n\nA. We receive several letters like yours every week. Perfectly healthy babies are being damaged by \n\nthe vaccines, and doctors continue to deny it. I am sorry that you had to be awoken to this serious \n\nproblem the hard way. Please call 1-800-822-7967 to file a report. You may want to begin \n\nresearching this subject to better understand the issues.\n\nQ. My one year old daughter received the chickenpox vaccine last month. When I asked if \n\nit was a good idea, the doctor said he had three patients die from chickenpox, so therefore \n\nit was better to be safe than sorry. My other two children already had chickenpox a few \n\nyears ago, no vaccine. The doctor said that she would probably get a fever from the shot, \n\nwhich she did. This month she developed terrible looking, oozing blisters. I took her back \n\ninto the doctor and she said that my daughter had shingles from the vaccine, and that she \n\nhad seen increased cases of this lately. I was never advised of this side effect nor was it \n\nincluded on the form that I signed for the shot. When I asked the doctor if she was going to \n\nreport it to the drug company, she said no. It was no big deal. I now have a copy of the shot \n\ninsert. Have you heard of this before? What are your thoughts about this?\n\nA. I'm sorry, but you were duped like the rest of the sheep. The chickenpox vaccination is a sham \n\njust like most of the other shots. A few years ago, before the vaccine was available, doctors \n\nrecommended exposing your child to chickenpox because it was a tame illness that conferred lifelong \n\nimmunity. Now that they have a vaccine, we are warned about the grave dangers of this disease, and \n\ntold that everyone should get the shot. I recommend that you read How to Raise a Healthy \n\nChild...In Spite of Your Doctor. Also, call 1-800-822-7967 to file your own report on the \n\nunexpected -- but rather common -- side effect of chickenpox. Your doctor is part of the medical \n\nconspiracy to deny vaccine reactions. I also recommend Immunization Theory vs. Reality: \n\nExpose' on Vaccinations. This book has an excellent chapter on medical ploys. Both books are \n\navailable from New Atlantean Press.\n\nQ. I found your website while researching the hepatitis B vaccine. I have been facing \n\nopposition from my doctors for several years. I have chosen not to get these shots for my \n\nchildren. I vaccinated them against the other childhood diseases because I was not given \n\nall the information. I now regret my actions. Both of my children are relatively healthy and \n\nI thank God for that. The one vaccine that still causes us problems is the chickenpox \n\nvaccine. When my daughter was six weeks old my son had chickenpox. She never \n\ncontracted them. She was born with asthma and the doctor convinced me that because of \n\nthat I should have her vaccinated against chickenpox. I explained that my son had had \n\nthem with no problems. She said that because my daughter had been on so many different \n\nasthma medicines that if she got them it could kill her. She explained that some of the \n\ndrugs cause problems when you have chickenpox. I really couldn't see the connection, but I \n\nrelented and let them immunize her. She ran a temperature of 105 for the next 5 days. I \n\ntook her back to the doctor and she told me that my daughter had a stomach virus. She \n\nnever vomited or had diarrhea. I knew it was not a stomach virus. They just brushed my \n\nconcerns aside when I asked if it could be from the shot. Thank God she didn't have \n\nanything worse. The problem is that now every time she is exposed to chickenpox, she gets \n\nsick. She will run a high fever and be lethargic for 3-4 days. When anyone asks me about \n\nimmunizing their children, I tell them to make sure they thoroughly investigate all the risks \n\nbefore they take that chance. I have decided not to let them give my innocent children a \n\nvaccine for a disease that is spread through sexual contact and drug use [hepatitis B]. I \n\neven had the doctor tell me when I turned them down the first time that I better do it before \n\nthey were 12 because that was when most kids become sexually active. I was appalled. I \n\nwill sign whatever waiver that I need to keep them from any further vaccines. Thank you \n\nfor getting this information out to the public. We need to take back the control of our \n\nchildren's futures and not blindly allow the government to decide what is best for our \n\nchildren!\n\nA. Thank you for sharing your story.\n\nQ. My twins were vaccinated about a year ago with the new chickenpox vaccine. Since, \n\nthey have had reoccurring rash's that appear to look like chickenpox, mostly around the \n\ndiaper area and legs. They showed up 3 days after vaccinations. Nothing has worked to \n\ntreat the bumps. Have you had any other inquiries about this vaccine?\n\nA. The chickenpox vaccine causes chickenpox in numerous recipients of this vaccine. They may \n\nrecur as shingles. The FDA has received thousands of notices similar to yours, yet authorities deny \n\nthere is a problem.\n\nQ. Yes, the doctors here are also denying any problems associated with the \n\nvaccine(Overseas Military Hospital). I'm 100% sure this is the case, as the babies never \n\nonce had any pimple-like bumps until the vaccinations. The bumps are also concentrated in \n\none area, typical of shingles. So basically the babies just have to deal with this? I wish I'd \n\nnever vaccinated them against chickenpox. The one-time occurrence of chicken pox never \n\nhurt any of my other children. Please pass this letter on to others who are considering \n\nwhether or not to vaccinate against chickenpox so they can better make their decision.\n\nA. We'll post your letter for other parents. Good luck with your future health decisions.\n\nQ. Hi. Recently my mother-in-law developed a case of shingles in and around her eye. The \n\ndoctor that she went to told her that he has seen an unusually large number of these cases \n\nthis year. This got me to thinking about the fact that use of the new varicella-zoster vaccine \n\nis now common, and I looked up some information on this virus in my old Microbiology text \n\nbook.\n\nAccording my old text, individuals with previous exposure to chickenpox, which may be \n\nwaning, who are exposed again to chickenpox, can be \"provoked\" into developing shingles. \n\nSince the new vaccine is a live virus vaccine, and is likely to be \"shed\" by the children \n\nrecently immunized with it, AND since antigenically it might not be a \"perfect fit\" with the \n\nwild type chickenpox and therefore not offer good immunity against it, I wondered if \n\nperhaps there is a link here with a higher then normal incidence of shingles. Have you \n\nheard anything about this?\n\nQ. I need info on the Varivax vaccine for chickenpox. I research vaccines and do public \n\ntalks. This one is coming to our doctors office in January. Is there any info on reactions to \n\nthis one? At least with the regular round of DPT, MMR, OPV, HIB, etc., we are aware of \n\nthe risks. There is so little info on this one.\n\nA. The FDA has received numerous reports of adverse reactions following the administration of this \n\nvaccine. Shingles is probably the most common reaction. Also, a human fetus is used to manufacture \n\nthis vaccine. You may wish to read more about this in the Physician's Desk Reference (PDR) at your \n\nlocal library.\n\nQ. I have heard that the chickenpox vaccine was incubated or is incubated in fetal lung \n\ncells of aborted babies. Can you give me info. on this? I read an article by an MD about it \n\nyears ago. When I tell people now, no one believes me. Thanks.\n\nA. The Physician's Desk Reference (PDR) at the library has more information. (The MMR vaccine \n\nis made in a similar fashion.)\n\nQ. My son, who is 23 years old, never had chickenpox to our knowledge. I am interested to \n\nknow more about the vaccine available and the risks for someone his age to have this \n\nvaccine. I also would like to know the risks of the disease, chickenpox, in an adult, as he \n\nplans to have children someday and will be exposed at some time or another and we should \n\nprobably weigh the risks. I understand chickenpox can be serious in an adult. If you have \n\nmore info regarding this please email me. Thank you.\n\nA. The chickenpox vaccine is causing chickenpox and shingles in a large percentage of recipients. \n\nChickenpox is rarely a serious disease in childhood and usually confers lifetime immunity. The \n\nvaccine will prevent millions of children from contracting this disease, and will probably cause \n\nteenagers and adults to contract it -- age groups more susceptible to complications -- when it is \n\ndiscovered the vaccine is temporary and does not confer a true immunity. We provide vaccine \n\nbooks that have more to say on this.\n\nCHICKENPOX ARTICLE: Why The Chickenpox Vaccine is Nuts!\n\nQ. I had a flu shot in November of 1996. I became weak and continued to get weaker. I \n\ncollapsed in my bedroom and was taken to the hospital. I was surrounded with intravenous \n\nlines, a feeding tube, bladder catheter, helpless, totally paralyzed, with a tracheotomy for \n\nthe ventilator. I had Guillain-Barre Syndrome, a staphylococcus aureus blood infection, \n\npneumonia, and a temperature of 107.9, with a blood pressure of 44 over 0 taken by \n\ndoppler (it would not register by cuff). My wife was told to make arrangements for a \n\npost-mortem. I was in ICU for weeks, was transferred to a rehab center and was there for \n\nmonths, until I was released to come home. I could ambulate approximately 100 feet with a \n\nwalker. I continued rehab as an out-patient for three more months, at which time I could \n\nwalk with hand crutches. As of today, nearly one year later, I can walk with a cane. WHAT \n\nDO YOU RECOMMEND I DO? I did not sign a waiver, nor was I forewarned of any \n\npossible hazards from taking a flu shot.\n\nA. I'm sorry to hear of your incident. It is similar to the many stories of vaccine damage that we \n\nreceive almost daily. You should report this to the Vaccine Adverse Event Reporting System \n\n(VAERS): 1-800-822-7967. They will send you a packet. Generally speaking, however, nobody \n\ngives a damn that you were hurt by the shot (that is, nobody who is in a position to make the \n\nnecessary changes), and nothing will change until more people mobilize, begin contacting their \n\nrepresentatives and informing their local media. We are trying to awaken people to this serious \n\nproblem before the damage is done. Best wishes on your rehabilitation.\n\nQ. I need info on how to heal a person who received the flu shot 5 weeks ago and is having \n\nextreme pain in legs, arms, and neck with paralyzation. The doctors won't help. What info \n\ndo we need to take to the doctors? Reply soon. Thanks.\n\nA. This sounds like Guillain-Barre Syndrome, not uncommon from flu vaccines. Your friend needs to \n\ngo to another health practitioner. Document all reactions and conversations. This reaction must also \n\nbe reported to the Vaccine Adverse Event Reporting System (VAERS). Call 1-800-822-7967. \n\nGood luck.\n\nQ. Hello. This is a great resource. I was hoping you might have information on reactions to \n\nthe flu vaccine. I know someone who had a flu vaccine on Mon. By Tues., she was very \n\nsick. After many tests, the doctors said it was not a reaction to the flu vaccine. Diagnosis: \n\nreactivated mono -- despite the fact that she had never been diagnosed with mono. I have \n\nheard many others swear that they'll never get another flu vaccine. Do you have any info? \n\nThanks.\n\nA. Many doctors live in deep denial. Your friend obviously reacted to the flu vaccine -- the very \n\nvaccine doctors claim cannot cause a reaction. That is why they lie. Otherwise they would need to \n\nadmit they are peddling drugs that cause sickness rather than creating health. Your friend's \n\nexperience is one that we hear of quite often and is the very reason many people don't trust their \n\ndoctors and are afraid to take this vaccine.\n\nQ. I have really gained a lot of info from you site. Everyone is now being innundated with \n\npositive propaganda about flu shots. I've searched in vain for any information on problems \n\nwith the flu shots. I found some about adverse reactions to the swine flu, but not the current \n\ntypes of shots. Can you point me to some definitive info? Thanks.\n\nA. Definitive information is purposely difficult to locate. However, it takes several months and \n\nsometimes years to make a vaccine. How do the vaccine promoters know one year in advance \n\nexactly which strain of flu is going to affect our population? You may wish to reflect on this. Best \n\nwishes regarding your health decisions.\n\nQ. According to Hugh Fudenberg, MD, the world's leading immunogeneticist and 13th most \n\nquoted biologist of our times (nearly 850 papers in peer review journals), if an individual \n\nhas had five consecutive flu shots between 1970 and 1980 (the years studied) his/her \n\nchances of getting Alzheimer's Disease is ten times higher than if they had one, two or no \n\nshots. I asked Dr. Fudenberg why this was so and he said it was due to the mercury and \n\naluminum that is in every flu shot (and most childhood shots). The gradual mercury and \n\naluminum buildup in the brain causes cognitive dysfunction. Is that why alzheimer's is \n\nexpected to quadruple?\n\nA. Thanks for sharing that information.\n\nNotes: Dr. Fudenberg spoke at the NVIC International Vaccine Conference, Arlington, VA \n\nSeptember, 1997. \"Alzheimer's to quadruple\" statement is from John's Hopkin's Newsletter Nov \n\n1998.\n\nPlease visit our webpage devoted exclusively to Anthrax Vaccine, Gulf War Syndrome, and Armed \n\nService Immunization Concerns.\n\nQ. Dear Mr. Miller, we are parents of an eight year old boy who contracted Viral \n\nEncephalitis close to his 1st birthday. He was healthy and normal until that time. He had \n\nimmunizations about a week or two prior to his illness. The cause of the illness has never \n\nbeen determined. Since then, our son has had an extremely complicated medical history, \n\nand, unlike many of your correspondents, we have had a lot of help and support from the \n\nmedical community, although at times we have had to really get involved. As we get on in \n\nlife and our family continues to deal with the complications and ramifications of our son's \n\nbrain damage and seizures, I have a nagging question about the cause of his disease. The \n\nvector could have been a mosquito, as we lived in an area where there was some incidence \n\nof Eastern Equine Encephalitis, although the doctors have never been able to nail it down, \n\nand our son's illness didn't follow the clinical norm for that disease. I'm really interested in \n\npursuing whether our son's encephalitis might have been caused by vaccines, not because \n\nI'm vindictive against the medical profession or any of our providers, but we wish to know \n\nwhat happened to him, and I'm not too trustful of pharmaceutical companies either. Thanks \n\nfor any help you might offer.\n\nA. I have observed that \"viral encephalitis\" is a term commonly used by the medical community to \n\ndescribe brain damage that occurs shortly after the administration of vaccines. I believe that the \n\ndoctors who you describe in such loving terms are aware of how your child contracted his ailment. \n\nThey will quickly turn against you at the first suggestion by you that vaccines may be the cause -- and \n\nmost definitely if you decide to pursue compensation. You might also consider that the \"viral \n\nencephalitis germ\" may be isolated (and probably was) and is quite easily traced to a vaccine. It has \n\na particular signature. You may contact the Vaccine Adverse Event Reporting System (VAERS) to \n\nreport the incident (along with the other thousands and thousands of cases that are reported each \n\nyear but never investigated): 1-800-822-7967. They will send you a packet of information. Best \n\nwishes.\n\nQ. Dear Mr. Miller, my fiance's younger brother is physically and mentally disabled as a \n\nresult of a routine child vaccine. I am trying my best to gather any appropriate information \n\nwhich may help in the on-going legal case. Where can I get your books in England?\n\nA. Contact Vaccination Information Network at PO Box 43, Hull HU1 1AA United Kingdom. \n\nThey import and distribute my books.\n\nQ. With all my doubts regarding vaccinations, I became convinced that this was the cause \n\nof my daughter's illness. She is so-called asthmatic and I was never convinced that this \n\ncame on by itself. I only knew that after every vaccination she received, her symptoms \n\nworsened. I am thankful for your information. With all the concern about asthma today I \n\nwonder why nobody has considered it being linked to immunizations. I intend on letting as \n\nmany people as possible know that it might be a possibility. Thanks.\n\nA. A 1994 study published in the Journal of the American Medical Association (JAMA) (August \n\n24/31, vol. 272, no. 8, pp. 592-3) found a link between vaccines and asthma. You might want to \n\ncheck it out.\n\nQ. I have a son with Landau-Kleffner Syndrome (LKS) and wonder if there is a connection \n\nbetween his vaccinations and encephalitis. I read in a case study that this may be so, that \n\nthe vaccines may have created an abnormality in my sons IG levels. The use of \n\ncorticosteroids has been considered as well as anticonvulsants. What do you think of \n\ntherapy and is there an alternative. I would appreciate any information related to this \n\nsubject.\n\nA. We believe the vaccines are associated with several autoimmune diseases. However, we are \n\nunfamiliar with treatment protocols for LKS. You may wish to contact a naturopathic health \n\npractitioner. Good luck.\n\nQ. I am looking for information pertaining to a connection between diabetes and childhood \n\nimmunizations. I heard about this link between the two on a radio program. My daughter \n\nwas 10 years old when she was diagnosed with having diabetes. There is no history of this \n\nin either my nor my wife's family. The Doctors at Children's Mercy Hospital told us the \n\ndate that she contracted diabetes through blood testing. That is the time she was \n\nimmunized for school. Any information would be helpful and appreciated, including \n\ninformation that might reverse this condition.\n\nA. Please call Dr. Viera Scheibner in Australia. She may be able to help guide you in the right \n\ndirection.\n\nQ. I am looking for information on any cases of cerebellum damage from vaccines. My son \n\nwas vaccinated in the early seventies and had terrible reactions that the doctors ignored. \n\nHe started to have problems at about the age of 20 (he also had allergies) and now an MRI \n\nhas indicated a problem they are saying is congenital.\n\nA. I recommend Vaccination: 100 Years... This book documents the links between vaccines and \n\nvarious forms of brain damage.\n\nQ. Dear Friends at New Atlantean, I am writing from India. I have reason to believe that \n\nthe spiked tetanus vaccine is being used in India. Can anyone help me to progress further \n\non this issue. I have samples of vaccines. Please write back to... Thank you for your \n\nattention.\n\nA. Please begin by contacting Human Life International in Gaithersburg, Maryland. They were \n\none of the first organizations to expose this travesty [Tetanus Vaccines Laced with Anti-fertility \n\nDrugs] and may have better leads to follow up on. Thanks for your concerns and efforts in that area \n\nof the world.\n\nQ. Dear sir/madam, I am a medical student in England and am curious to know your \n\nopinion regarding the chickenpox vaccination. During my clinical sessions, many patients \n\nwant to find out about the possible side effects and harm this vaccination might possess. \n\nThe physician I am under is equally in the dark regarding this issue. We would be very \n\nhappy if you could fill us in.\n\nA. Our position on the chickenpox vaccine at New Atlantean Press is that it is likely to change the \n\nepidemiology of the disease, not unlike the measles vaccine. Chickenpox is a relatively tame \n\nchildhood illness. Before the vaccine was introduced, doctors recommended that children be \n\nexposed to the natural disease to prime the immune system and gain lifelong immunity. Now that the \n\nvaccine is available, everyone is being warned about the \"grave dangers\" of this disease. We predict \n\nthat within a few years chickenpox will begin striking more infants, teenagers, and adults -- groups \n\nthat are more susceptible to serious complications. In the meantime, we are receiving reports that \n\nvaccinated children are contracting chickenpox soon after getting the shot (doctors are calling the \n\npustular ailment a simple skin rash, a tactic we consider a form of denial, and one that skews the \n\nefficacy statistics as well.) Others are reporting an upsurge of shingles-like diseases.\n\nQ. Did you know that children are vaccinated against hepatitis? My wife suffers from \n\nrheumatoid arthritis. We had a letter from a Pasteur Institute scientist who said that this \n\nvaccine can cause rheumatoid arthritis, or any autoimmune disease in people with a genetic \n\npredisposition to the disease.\n\nA. The hepatitis vaccine is given to children because health authorities do not know how to reach \n\nadult IV drug users -- the real group in danger of contracting this disease. There is a scientifically \n\ndocumented association between the rubella vaccine (also found in the MMR shot) and arthritis in \n\nwomen.\n\nQ. Hello. I have a 14 month old son who was born at 39 weeks and weighed 8.5 pounds. He \n\nscored perfect on his apgar and is perfectly healthy. My husband and I have decided NOT \n\nto vaccinate; we have read all the books and information that was available on the subject. \n\nAlthough I am confident about my decision, I still question whether or not we have made \n\nthe right choice. Every time we go to his doctor I am asked to sign a waiver that states my \n\nobjection to having our son vaccinated. It makes me feel so unsure about my decision. \n\nHowever, when we get home I pull out my books and I am once again reassured. Does this \n\nfeeling of uncertainty ever go away? I am made to feel like I am putting my son at more of \n\na risk by not having him vaccinated. I would like to speak to other parents who feel the \n\nsame as I do, and to parents who have not vaccinated and have healthy children. Thank \n\nyou for all the information that you have provided. I do try to share it with other parents of \n\nnewborn children, but to no avail.\n\nA. Why do you go to this doctor? You keep placing yourself in a submissive position whereby you \n\nare forced to listen to potentially dangerous propaganda. I suggest you read the book How to Raise \n\na Healthy Child...In Spite of Your Doctor. Also, Immunization Theory vs. Reality: Expose' on \n\nVaccinations includes an excellent chapter on medical ploys used to intimidate parents like yourself. \n\nIt will give you a better understanding of what you are up against, how to protect your family, and \n\nhow to remain strong with your decision. Both of these books are available from New Atlantean \n\nPress, or you may request a free catalog, or visit our website.\n\nBy the way, I have two healthy children (ten and thirteen years old) who were never vaccinated. In \n\nfact, they were born at home and have never seen a doctor. They are healthier than their vaccinated \n\nfriends. My wife and I never questioned our decision. We question why anyone in their right mind \n\nwould allow a mixture of ungodly substances to be injected into their healthy children.\n\nQ. We contacted you a few months back and mentioned that we were opposed to \n\nvaccinating our children. Can you tell us which religions are opposed to immunization, and \n\ndo you know if there is any way the public school system can be forced to allow us to enroll \n\nour children in school? Any advice you might offer will be greatly appreciated. Thank you.\n\nA. Christian Scientists are federally recognized as being opposed to vaccinations (and other medical \n\ninterventions). I believe that public schools must honor state laws permitting vaccine exemptions, but \n\nprivate schools are free to disregard your opposition to the vaccines. New Atlantean Press offers \n\ncopies of the vaccine laws of each state. Best wishes.\n\nQ. I am in need of a medical expert witness for potential litigation regarding a vaccine \n\nincident resulting in autoimmune malfunctions (i.e., chronic fatigue syndrome). Can you \n\nrecommend one?\n\nQ. I found your website while looking for information about vaccines for my puppy. Of \n\ncourse, my local vet has me fearing heart worms and Parvo because I've refused to \n\nvaccinate Gizmo. It's bad enough that I've resorted to pills because of regular worms in his \n\nstool. I know there has to be information out there that will make me more comfortable \n\nabout my \"No vaccines\" choice for my puppy, yet I haven't found it. Please head me in the \n\nright direction. Thank You. (I'm very impressed with your sources. I know that my choice \n\nto not vaccinate my children is an educated one. Thank you for assisting in educating the \n\nopen-minded.)\n\n\"Life itself is a gift. It's a compliment just being born: to feel, breathe, think, play, dance, \n\nsing, work, make love. Let's give thanks for life, for simply being born!\" --Daphne Rose \n\nKingman\n\nA. Many animal owners have voiced their concerns about the problems with animal vaccines. We \n\nknow at least one pure breeder who is sure that the increasing number of diseases that their animals \n\nare experiencing is due to the shots. Other animal lovers say that their dog or cat contracted the \n\ndisease for which they were being vaccinated immediately after getting the shot (believing that the \n\nshot caused the ailment). Still others believe that the animal vaccine can spread to children and family \n\nmembers who play with their pet, and that this is one potential cause of autoimmune problems. New \n\nAtlantean Press is looking into publishing a book specific to this topic in the very near future.\n\nQ. We are considering getting our child immunized with the DPT shot. Before we do this we \n\nwould like to get information about what the shot contains, which shot company produces a \n\nbetter shot than others, etc. We live in Argentina. Are the quality standards for shots \n\nbetter in Argentina versus the USA? Where can we go in Argentina to get information \n\nabout child shots? We have a child that is three years old and another child that is six \n\nmonths. Our child's doctor is insisting that we get our child immunized immediately. Are we \n\nrequired by law or are we able to make a choice in this decision. Thank you for your help. \n\nYou have a great WWW page.\n\nA. I am not familiar with the vaccine laws in Argentina, but I would presume that you still have a \n\nchoice in the matter -- in spite of the pressure placed on you by your doctor. I recommend the book \n\nVaccines: Are They Really Safe and Effective? It discusses the DPT shot in addition to many of \n\nthe others. DPT: A Shot in the Dark is another great book on this topic. It covers the DPT vaccine \n\nin great detail. Please consider reading these books before making your decision. Both are available \n\nfrom our website.\n\nQ. After more than three months of research, I have whole-heartedly decided not to have \n\nmy child immunized any further. However, he did receive his DPT, Polio, Hib and Hep \n\nshots at two months old with no apparent reactions. Can you explain any negative \n\nconsequences he may suffer by receiving initial doses and then none further? Also, I care \n\nfor the same age baby of a friend in my home three days a week. I think she will continue \n\nto immunize her child. Can you explain any likely problems my son may encounter or \n\nprecautions I may take because they are together. What if she's worried about her son? In \n\nFlorida, which route is best, a letter from a chiropractor or a waiver? Thank you for your \n\nprompt reply.\n\nA. In reference to your first question, I am not aware of any special consequences other than the \n\nnormal risks associated with choosing not to vaccinate. In reference to your second question, some \n\npeople believe that your child will gain a passive immunity to the disease by coming into contact with \n\na recently vaccinated child. Other people believe that you place your child at risk of contracting the \n\ndisease. If you are concerned, you may wish to keep them in the open air for a few days following \n\nthe shots. To answer your third question, how can your child be a risk factor for her child if her child \n\nis vaccinated? If the shots do what the vaccinators say, her child should be protected. Finally, obtain \n\na current copy of Florida laws and follow their requirements for a waiver.\n\nQ. Do you have any books or listings that might help me find a doctor who will support my \n\nimmunization beliefs?\n\nA. We don't have listings, but if you tell us the name of your town, we may be able to offer you some \n\nsuggestions.\n\nQ. Could you please e-mail me information about tetanus shots. I'm trying to avoid having \n\nmy son receive a shot on Monday for a wound in his foot. I need facts for my husband. \n\nThanks.\n\nA. The information that we have is in the vaccine books we offer. I'm sorry that we can't help you \n\nbefore your self-imposed deadline.\n\nQ. I find your web page to be very informative. However, I am specifically looking for \n\ninformation on adult immunizations. I will be traveling in July to Africa and have a huge list \n\nof recommended vaccines from the CDC. I would like to find some alternatives and would \n\nappreciate any further information you could give. Thanks.\n\nA. The vaccines to travel overseas are not mandatory. Please contact Special Human Rights \n\nServices in Illinois. They are familiar with foreign requirements and possible alternatives.\n\nQ. The pro vaccinators are trying to say that DPT never causes one single case of SIDS. I \n\neven read a New Zealand report implying that DPT \"prevents\" cot-death. Yet, in Polio \n\nNetwork News it was reported that of all claims examined by the federal Department of \n\nHealth and Human Services, about half concerned death and injury following DPT and \n\npolio vaccinations. And of the awards granted for death caused by vaccination, 82 percent \n\nwere ruled to be misclassified as sudden infant death syndrome (SIDS). The court ruled \n\nthat the government is liable for vaccine injuries caused over several decades. You won't \n\nread about this in the major media. Is this really not something worth reporting on?\n\nA. The media does not report this information because they take their cues from the drug lobby, and \n\nmedical policymakers are afraid -- rightfully so -- that if more people were aware of the truth, fewer \n\nparents would consent to have their children vaccinated. Much of this information is now accessible \n\nonly through the Freedom of Information Act. It truly is atrocious how we have all been deceived.\n\nQ. Recently, my wife and I were awakened to some of the hidden dangers of immunizing. \n\nHowever, we are seeking proven reputable alternatives to immunizing but no complete \n\nsource of information has materialized. If you know of any safe and documented \n\nalternatives we would certainly appreciate the information.\n\nA. Breastfeeding offers a great start to a healthy lifestyle. Feeding your children with wholesome, \n\nnatural foods while allowing few sugars, preservatives, and other \"non-foods\" is also a good idea. \n\nHomeopathic remedies is another option. New Atlantean Press imports Homeopathy in Epidemic \n\nDiseases. This book provides an alternative to vaccines.\n\nQ. I became a grandmother last August. My son and daughter-in-law are afraid of vaccines \n\nfor my grandson, but I worry. I think my grandson will be exposed to many diseases. I had \n\nwhooping cough and other childhood diseases because I was not vaccinated until I was \n\ntwelve. I will purchase the vaccine books you suggest and read them. I will also share them \n\nwith my son and daughter-in-law. We have no history of vaccine reactions in our family. \n\nCan you suggest the basic vaccines that are safe for my eight month old grandson?\n\nA. You sound like a loving and concerned individual. However, it appears that your son and his wife \n\nhave investigated vaccines and have made their decision. You had whooping cough as a child, yet \n\nyou lived to a ripe age to tell about it. There are many problems with vaccines that the authorities do \n\nnot tell parents. I agree that you should read some of our books so that you can better understand \n\ntheir decision. Best wishes to you and your family.\n\nQ. There is a very lot of information on your website and I will be back. Can you put me in \n\ntouch with anyone who sells homeopathic vaccines? I also need recipes to detoxify after \n\nvaccines. I have a 17-year-old in dire straits after being forced by the army to get his \n\nvaccines. Thank you for any help.\n\nA. New Atlantean Press offers a book entitled Homeopathy in Epidemic Diseases. It covers \n\nhomeopathic vaccines. Many of these remedies are available over-the-counter at health stores.\n\nQ. Do you know of any information regarding a new vaccine being developed to immunize \n\nagainst e-coli that causes recurrent bladder infections?\n\nA. Dozens of vaccines -- for pregnancy, the common cold, etc. -- are being researched and under \n\nconsideration for eventual FDA approval. I am sure they are working on an e-coli vaccine as well. \n\nHowever, we have no specific information on it.\n\nQ. I am an Italian father whose daughter is going to spend her next school year in the \n\nUnited States. As I do not want her to be subjected to other vaccinations in addition to the \n\nones just undergone here in Italy, I am looking for information about states where the high \n\nschools do not require them, or allow exemptions. The association has just settled the \n\ndestination area. It is in the West, i.e. one of the following states: Arizona, California, \n\nColorado, Idaho, Montana, Nevada, New Mexico, Oregon, Utah, Washington and \n\nWyoming, so I only need information about these states. I would be greatly indebted to you \n\nif you could reply as soon as possible because the departure day is approaching. Let me \n\nknow, please, if your information service involves any charge.\n\nA. Several of the states that you selected offer a philosophical objection to the vaccines. This is the \n\nmost lenient waiver that states provide. These states include: AZ, CA, CO, ID, UT, and WA. Keep \n\nin mind that this does not mean that the authorities will not try to intimidate students into getting the \n\nshots, but the law will be on the side of the individual objecting to the shots. Good luck.\n\nQ. This week on our local news station they are having a major campaign for vaccines \n\ncalled \"Shots for Tots.\" It is deceiving because during the previous week they asked \n\nparents to mail in cute pictures of their kids to receive an award, and now this week we find \n\nout that it is connected to their campaign. Well, yesterday one of the doctors said that only \n\nirresponsible parents do not vaccinate. They mentioned today that if you do not vaccinate \n\nyour pet you can be dragged off to court...but that defenseless little children do not have \n\nthis protection. These statements made me mad, so I called the news station and talked to \n\nthe director for about an hour. We debated vaccines. It was good; he vaccinates his three \n\nyear old and did not agree with me, but I told him the bottom line was that if they plan on \n\nshowing all this pro vaccine stuff then they also need to show the flip side to the story. He \n\nagreed that there were two sides to every story. I asked him if he would like me to send \n\nhim copies of my research. He said yes, to send it and put my phone number in there so he \n\ncan call me back to debate it more. I am only going to send him information from the \n\nmedical journals that I have that supports my side of the debate. But the problem is that I \n\nam now afraid to add my phone number, because what if they want me to go on TV? I don't \n\nwant to do that. So is there anyone that you know of where you are at that would like to \n\ndebate this with the media, just in case they call? Just thought you might want to know what \n\nis going on in California, the not so \"golden state.\"\n\nA. Thanks for sharing that with us. Neil Z. Miller is available to discuss vaccines with the media, and \n\nto explain why many responsible parents choose not to vaccinate.\n\nQ. To Whom It May Concern: I am a sophomore in college who has recently become \n\ninterested in whether immunization is necessary. My judgment tells me no. I have decided \n\nto focus my twenty page research paper on immunization. The requirements for the paper \n\ninclude not only five scholarly journal sources, books, articles, and internet resources, but \n\nalso at least four email addresses of MD's knowledgeable on the topic -- preferably two for \n\nimmunization and two against. If I were to receive a response from the MD's I could use \n\nthem as another source. If you can help me in any way I would appreciate it.\n\nQ. Do you see any connections between the Gulf War Syndrome and biblical or historical \n\nfacts? Your comments and thoughts are appreciated.\n\nA. I believe in the law of karma -- as ye sow, so shall ye reap. Our \"patriotic warriors\" inflicted \n\ntragic devastation upon our human brothers and sisters. I see the GWS as a consequence of their \n\nchoices. We become victims only when we victimize. We receive grace when we practice toleration \n\nand forgiveness. I also acknowledge other perspectives, and would not find it difficult to accept \n\ncorrelations to Revelations or other historical prophecies. More importantly, though, is what can we \n\ndo to alleviate conditions that might lead to similar dilemmas in the future. And how can we help the \n\ndamaged veterans and their families cope with the problems associated with GWS.\n\nQ. Why aren't more parents doing something about this? I just started doing research \n\nabout immunizations and it scares me to death. I had a little girl two months ago, and that is \n\nwhen I started researching. I went to the doctor last week and I was treated like a piece of \n\ndirt! They told me that I could kill my child by not giving her the shots, and that if I waited \n\nuntil they made me give them to her (when she starts school) she would then be old enough \n\nto realize that shots hurt, and it would be a lot more painful for her. At that time I didn't \n\nargue because I didn't have enough information, but I found out the other day that you can \n\nget a form from the Health Department stating that your child does not have to have the \n\nshots. But the Health Department, and places like that, don't want to tell this to parents \n\nbecause they want us to think we don't have a choice regarding our own children, and that \n\nis what makes me so angry. We have got to educate parents and let them know that they \n\ndo have a choice.\n\nA. Thank you for your comments. You are just beginning to awaken to this horrible problem. We \n\ncan protect our own children and enlighten new parents to the whole truth. Get involved.\n\nQ. Do you have any information on the tetanus toxoid produced by the Connaught \n\nCompany of Canada. Our male child is unvaccinated. We are concerned about tetanus \n\nbecause our son attends a daycare in a rural setting. The lot number we are considering \n\nusing is 5H71002. We would prefer no vaccination at all but we are concerned about his \n\nexposure at daycare.\n\nA. Don't forget your shotgun for bear attacks, anti-toxin for spider bites, and protective mesh for \n\npossible bee stings. Excuse my sarcasm, but I am not a big fan of vaccinations, and feel that scare \n\ntactics are in operation here. You might want to check the Physician's Desk Reference (PDR) at \n\nyour local library or contact the National Vaccine Information Center.\n\nQ. Are there any reports or books explaining which vaccines do not contain the live virus?\n\nA. I recommend Vaccines: Are They Really Safe and Effective?\n\nQ. I am very against vaccinations. I don't believe they're right. I'm doing an assignment on \n\nvaccinations which is due in two weeks. Would you please send me information that tells \n\nboth sides of the argument?\n\nA. It seems that you ought to take your assignment a bit more seriously. New Atlantean Press offers \n\nmore than 20 excellent titles on the subject, but two weeks is not enough time to investigate. You \n\nmay wish to peruse our vaccine website.\n\nQ. Any news on how the chickenpox vaccination can affect a child with IgA. Your comments \n\nare appreciated.\n\nA. Check the PDR at the library for contraindications. Then talk to holistic health practitioners for \n\ntheir input.\n\nQ. I am a college senior studying biology and writing my final research essay for a \n\ncapstone class. I chose to write my essay on why people choose to not have their children \n\nimmunized and was having a very hard time finding information on this subject other than \n\ncost and lack of knowledge. Your web site has given me all kinds of great resources to look \n\ninto and I am extremely grateful to have discovered it. I am looking in particular for more \n\ninformation on the movement in England in the mid 1970s after the pertussis vaccine was \n\nshown to be dangerous. I was wondering if there were any particular resources that would \n\nbe helpful. I will definitely be coming back to your site.\n\nA. I am pleased that you are researching this subject and discovering that all of the pertinent \n\ninformation parents need to make an informed decision are not presented to them. Many parents \n\nrefuse the vaccines for their children because they have studied the issue on their own and have \n\nmade an intelligent decision to avoid the shots. \"Cost\" and \"Lack of Knowledge\" are lies perpetuated \n\nby authorities to increase vaccination rates. I have in my possession an private study funded by a \n\nlarge vaccine manufacturer that states the main reason parents avoid taking their kids to get the shots \n\nis a fear of adverse reactions. Knowledge, cost, and accessibility to the clinics are minimal concerns.\n\nAbout the DPT shot and England during the 1970s: The CDC and health authorities like to quote \n\nthat period of time to bolster their case. But they neglect to give the complete facts. Some children \n\ndied after getting the DPT, and the media informed the public. Parents refused to give their children \n\nthe shot, and vaccination rates dropped. Shortly thereafter, cases of pertussis increased, but fatalities \n\nfrom the ailment actually decreased. The authorities conveniently forget to inform the public about \n\nthat one small detail. Also, keep in mind that when parents stop getting the shots for their kids, \n\ndoctors tend to diagnose and report every little sniffle as pertussis, often without laboratory \n\nconfirmation. This serves to artificially increase apparent cases of the disease. This tactic is well \n\ndocumented in the literature.\n\nFor your research paper, I recommend Dr. Viera Scheibner's Vaccination: 100 Years... She \n\ndiscusses the England case and thoroughly documents each claim. I also recommend Vaccines: Are \n\nThey Really Safe and Effective? and Immunization Theory vs. Reality: Expose' on \n\nVaccinations. All three of these books are available from New Atlantean Press.\n\nQ. Dear Mr. Miller, my daughter is ready for her first DPT and polio shots and I'm really \n\nconfused! I've read some articles about the drawbacks of immunization but they didn't \n\ntotally convince me; they just managed to confused me more. I spoke to my doctor who is \n\npro-immunization and she had actually convinced me to go ahead with the vaccines until I \n\nread these terribly sad and frightening stories on your page. I've been told that if I don't \n\ngive my daughter the polio drops she could pick it up easily from other children who've \n\nreceived the vaccine as it could be transmitted through water at the swimming pool, for \n\nexample. If I don't vaccinate, what are the chances that my daughter could contract these \n\ndiseases? I've put off vaccinating for another week and can only hope that I make the right \n\ndecision. If there's any more information you can give me to make that decision easier I'd \n\nbe most grateful. Many thanks.\n\nA. I am sorry this is such a difficult decision for you. Regarding polio, in the United States about 10 \n\ncases per year are caused by the vaccine, mainly in immuno-compromised people. Whoever told \n\nyou that your child could easily contract polio from other children who received the vaccine is either \n\nignorant of the facts or is lying to frighten you into vaccinating your child. In fact, many doctors use \n\nthe opposite argument -- that unvaccinated children are reaping the benefits from the vaccinated \n\nones by gaining \"herd\" immunity -- to try and make parents feel guilty about their decision to raise \n\ntheir children without potentially harmful drugs. I suggest investigating this topic further until you are \n\ncomfortable with a decision.\n\nNew Atlantean Press offers many good books on vaccines. Or you may research further on the \n\ninternet, in medical libraries, or by querying an assortment of health professionals, including \n\nnaturopaths, homeopaths, chiropractors, and others.\n\nQ. Hi. I totally agree with the anti-vaccine \"theory.\" I am new at this. My first daughter \n\nhad all of her vaccinations and it was not until I had my 2nd child that I started hearing the \n\ntruth about vaccines. I was wishy-washy in my view but now I am 100 percent sure that my \n\nchildren will not be vaccinated. What I need to know is how I can still boost their \n\nimmunities, or whether I even need to? I need help on some of these issues. Any advice, \n\nbook titles, etc. will be highly appreciated.\n\nA. I recommend two books to get started: How to Raise a Healthy Child...In Spite of Your \n\nDoctor and Smart Medicine for a Healthier Child. Both are available from New Atlantean Press.\n\nQ. Are you aware of any information on the chickenpox vaccine? I am particularly \n\nconcerned about administration to adult healthcare workers. Thanks.\n\nA. I think the chickenpox vaccine is a stupid idea, public health will be adversely affected, and \n\nsociety will regret this foray into further immunological tampering.\n\nQ. I read Vaccines: Are They Really Safe and Effective? In the book, Mr. Miller gives a \n\nchart showing the decline of reported polio cases showing that the discovery of the polio \n\nvaccine came at the end of this decline. I would like to know where I could get the statistics \n\nthat the graph was made from. I have tried to go to the CDC website but is does not give \n\nstatistics back that far. I am a medical student doing a paper on epidemiology and would \n\nlike to use this information in my presentation but need statistical data that has been \n\ncompiled by a national data collection agency such as the CDC. I would really appreciate \n\nthe help.\n\nA. Welcome to the real world where the CDC controls the data we are permitted to see. It is \n\nvirtually impossible to get necessary public information from this organization. I recommend that you \n\nresearch the footnotes in the book you are referring to. Also, the section on measles has good \n\nreferences on how the vaccine has altered the natural epidemiology of the disease. It used to be a \n\nrelatively tame childhood illness. Today it affects more infants and adults -- groups with greater \n\nsusceptibility to complications. Look for this to occur in the near future with chickenpox as well, \n\nfollowing the introduction and marketing of the chickenpox vaccine.\n\nQ. I am a new mother of a four month old infant. My husband is a chiropractor and we are \n\nboth very against immunizing our son. I am trying to find out if there is an organization I \n\ncan join that brings parents like us together and also fights the immunization laws here in \n\nthe U.S. We are planning to move to another state, and although not being immunized is not \n\na problem socially at this young age, I am terrified of the upcoming battle. Immunizing is \n\nreally everywhere, on TV, in the media, and you are condemned for not doing it. I don't \n\nwant somebody doing it without my permission, and I don't want them saying I'm abusing \n\nmy son. I've heard cases of this already. I really don't want to lie and say it is a religious \n\nbelief. So I am also looking perhaps for a chat room so that I can share ideas and \n\ninformation with other parents and get ammunition to fight back, and perhaps help to \n\neducate others about vaccines. Any information on these topics is greatly appreciated. By \n\nthe way, your website was great -- informative and reassuring. I've already got some of \n\nthose books. Thank you.\n\nA. I suggest that you remain aware of the state vaccine laws in the state where you plan to reside. \n\nSome states are more accepting of your choice against the shots. Other states may try to intimidate \n\nyou, but there are always options. Usually, however, the authorities are bullies, and they rarely \n\npersist in their efforts if they feel they are going to be challenged. For example, they often harass \n\nsingle moms because they know they usually have weak support systems. I also suggest \n\nImmunization Theory vs. Reality: Expose' on Vaccinations. This book has a great chapter on \n\nmedical ploys -- how to spot them and protect yourself.\n\nRegarding a \"chat room,\" New Atlantean Press recently collaborated with another vaccine website \n\ndesigner to develop a Vaccine Forum. It is now available for use.\n\nQ. It would be nice if you had some free information on how a parent may legally have their \n\nchild admitted to school without having to subject them to the risks of immunization. \n\nThanks.\n\nA. Our website does provide free information regarding exemptions that are available to parents. \n\nVisit our Vaccine Resources and click on state exemptions. New Atlantean Press also offers the \n\nexact vaccine laws of each state, and publishes How to Legally Avoid Immunizations in All 50 \n\nStates.\n\nQ. I would like to find specific documented information on: 1) Number of people infected \n\nwith diphtheria, pertussis, and polio each year. 2) Number of people infected by the \n\nimmunization itself. 3) Any incidents where there was an outbreak of the above diseases, \n\nand the rate of effectiveness of the immunizations. Any information would be helpful. \n\nThank you.\n\nA. Vaccines: Are They Really Safe and Effective? systematically looks at the questions you pose, \n\nand provides references. Vaccination: 100 Years... is also highly recommended.\n\nQ. Hello, I want to know if you guys set up vaccination camps for low income families. If \n\nyou do, please let me know where in the USA or world. I am willing to participate in these \n\ntypes of vaccination camps.\n\nA. We are baffled by your query. Perhaps you ought to read our web page.\n\nQ. I found your website and was interested in knowing if anyone can help me find an active \n\ncase of measles. My five year old was diagnosed with a rare kidney disease that causes \n\nrenal failure. The prognosis is poor. For some reason measles sometimes puts this disease \n\ninto remission. I chose not to have my son vaccinated for measles, therefore we are \n\nactively trying to expose him to someone with measles. We have a letter from our \n\nnephrologist asking for exposure. If you could help me with this endeavor I'd appreciate it.\n\nA. You might contact the CDC to find out where recent outbreaks may be occurring. You might \n\nalso investigate having your child vaccinated with the measles shot. It contains the live measles virus \n\nand often causes the disease in children who receive it. Good luck.\n\nQ. I'm trying to get a copy of Vaccines: Are they Really Safe and Effective? by Neil Miller. \n\nI'm in London and want to read it as soon as possible as I've already delayed having my \n\ndaughter vaccinated and need to make a decision soon. I'd appreciate any information you \n\ncan offer in making my decision easier!\n\nA. Contact Vaccination Information Network. They import that book from New Atlantean Press.\n\nQ. Is it possible to develop idiopathic thrombocytopenia prupura after multiple \n\nvaccinations? Any help with this would be appreciated. Thank you.\n\nA. Our observations convince us that the medical establishment is quite savvy regarding their use of \n\nmedical terms to \"redefine\" a disease condition. They rarely admit an association with vaccines. You \n\nmay wish to contact Dr. Viera Scheibner for more specific correlations. She is an expert on \n\nvaccine-caused ailments.\n\nQ. Thank you for maintaining your web page. My three-year-old son as been on \n\ncorticosteroids for a year. Could it compromise his immune system? His gammaglobulin \n\ncount is very low. We are trying to find a causal link between the steroid and a low IgG -- \n\nimmuno-gammaglobulin count -- in his blood. The doctor wants more tests, including \n\ninjecting a bacteria into my son to see if he can fight it off! I say NO! Can you offer any \n\ninformation?\n\nA. The Physician's Desk Reference (PDR), to be found at your local library, will list the side effects \n\nof corticosteroids. I thought everyone knew that steroids lower the immune response, your doctor \n\nincluded. What? You think it's stupid to use your son as a guinea pig to inject him with bacteria and \n\nwait to see what damage is done? This is your son! Where do people find these doctors?\n\nQ. Do you know of any side effects of taking a TB test? Don't they put the virus into your \n\nskin? I have a possible job working in the local school district and they require such a test. \n\nI wonder if there is an alternative? Please email me as soon as possible. Thanks.\n\nA. Try contacting Ohio Parents for Vaccine Safety. They may be able to offer some suggestions.\n\nQ. I'm awake at 2:25 am because I'm experiencing Braxton Hicks with my second child, \n\ndue in 11 days. I did not vaccinate my first child, who just turned two, because of scary \n\nstories like the ones I'm reading on your website. My daughter has suffered a couple of \n\nminor colds, but other than that she is, and has been, the picture of health. I spoke to my \n\ndaughter's pediatrician about my concerns with vaccinating, and she assured me that she \n\nimmunized her own children and that while she was willing to let me postpone the decision, \n\nshe would ultimately stop seeing my daughter if I didn't immunize. She kept true to her \n\nword. Since I have not vaccinated my daughter, I'm no longer welcome at that \n\npediatrician's office. So now that I'm pregnant again, I need to find another pediatrician. I \n\ninterviewed one today who was very pleasant, but told me the same thing -- if I don't \n\nvaccinate my newborn we will not be welcome at his office. The pediatricians honestly \n\nbelieve that vaccinating is in the best interest of the child, and advocate it for their own \n\nchildren. I weigh that against the horrifying personal immunization stories. Millions of \n\nchildren receive vaccinations each year, right? So these few tragedies represent a tiny \n\npercentage of immunization results. But I completely empathize that if it were MY CHILD \n\nsuffering, I wouldn't care how small the odds were! If I DON'T immunize, am I putting my \n\nprecious children at risk to contract a disease that could easily have been prevented by \n\nvaccinating? Does immunization actually prevent children from diseases? Certainly the \n\ndeclining number of cases seems to indicate that they do. I don't know if anyone can \n\nanswer my questions.\n\nA. You are responsible for the care of your child -- not your mother, father, neighbor, or \n\npediatrician. In fact, if your child is hurt by one or more of the vaccines, your pediatrician will deny it \n\nand you will once again feel betrayed. So don't base your decisions on arrogant and insensitive \n\ndoctors who try to coerce you into doing something that you are uncomfortable doing. (Why do you \n\nneed a pediatrician, anyway? I recommend the book How to Raise a Healthy Child...In Spite of \n\nYour Doctor by Dr. Mendelsohn.) The incidence of damage to children is far greater than you have \n\nbeen lead to believe. Pediatricians who will not see you because you are making decisions on your \n\nown realize they are not able to control you. That is why they refuse to see you. This is a common \n\ntactic that we hear of by many, many parents. You are not alone. Therefore, make up your mind; \n\nthen be strong with your decision, whatever it may be. Then stand by your decision. Good luck.\n\nQ. I am interested in what you have to say but would first like to know more about where \n\nyou receive it from. Would you let me know your information sources, political viewpoints \n\n(if part of a movement) and any religious affiliations you may have. Thanks.\n\nA. Much of the information on the New Atlantean vaccine website comes from two vaccine books \n\nthat are published by New Atlantean Press: Vaccines: Are They Really Safe and Effective? and \n\nImmunization Theory vs. Reality. All of the information in these books is documented with more \n\nthan 300 references per book. The references were taken from scientific and medical journals, \n\nmedia citations, and other respected sources, all of which can be verified. We are not part of a \n\npolitical or religious movement. We are simply concerned parents who are horrified at the extent of \n\ndamage being perpetrated on our innocent children. We believe that this information needs to be \n\nmade available to all concerned parties, and that parents are entitled to decide the best course of \n\naction regarding the health and welfare of their children.\n\nQ. I have really gained a lot of information from your website. Everyone is now being \n\ninundated with propaganda about flu shots. I've searched in vain for information on \n\nproblems with the flu shots. I found some information about adverse reactions to the swine \n\nflu, but not the current types of shots. Can you point me to something more definitive? \n\nThanks.\n\nA. I recommend that you think this issue through. For example, it takes several months to several \n\nyears to make a vaccine. How do the vaccine promoters know one year in advance exactly which \n\nstrain of flu is going to hit the following year? Definitive information is purposely difficult to locate. \n\nThink that through as well. Why do you suppose it's nearly impossible to uncover unbiased \n\ninformation on current vaccines? Best wishes regarding your health decisions.\n\nQ. Dear Neil Miller, first I just wanted to say that I was reviewing some birth-related \n\nvideos and came across a Phil Donahue tape where you were on TV [talking about \n\nvaccines] with parents who were doing \"unusual\" things with their children, like sleeping in \n\nthe same bed with them. Anyway, I now have a face to your name. Now, on to the real \n\nissue. I live in West Virginia. We moved here 15 months ago and the vaccine laws are \n\nhorrible. In order for our children to go to public school they MUST be vaccinated. Prior to \n\nmoving to WV we lived in Missouri and took advantage of the religious waiver. There is no \n\nsuch thing here. Only medical reasons verified by the local director of health in our county \n\nwill exempt them. If you do not have your child vaccinated you can be fined $50 for each \n\noccurrence. We have seven children. We are required to get 2 MMRs, 3 DtaPs, and 3 \n\nIPVs. We opted for the DTap over the DPT and the IPV over the OPV. We were \n\ncompelled to sign a release form that says that we believe the vaccines are safe and \n\neffective, and that we are releasing the Department of Health from any responsibility in \n\ncase of a reaction. If we didn't sign the form they wouldn't give the shots, we would be \n\nfined, and our children couldn't go to school. People said we have the right to homeschool \n\nbut I should not have to homeschool just to avoid vaccination. And according to the law we \n\ncould still be fined. We talked to an attorney. He said that he would be happy to take the \n\ncase but it would be very expensive. I cannot afford it. I have seven children and we are \n\ntruly homesteaders. My husband does woodworking and I am a midwife. Our yearly \n\nincome is less than this guy makes in one month. Can you help us? I have three children \n\nthat are vaccinated now and two more that are halfway through. I have two more that are \n\nunvaccinated. I will wait until I am compelled to vaccinate before I even consider starting \n\nthem. It was so horrible when the got their shots. I had to physically restrain my \n\nfour-year-old while they injected poison into her, that I had to consent to. I have taught my \n\nchildren that vaccines are bad and here I am making then get them. I felt like a BAD \n\nmother Can you help me?\n\nA. I am sorry to hear of your predicament. I wouldn't have signed the forms, though. That is \n\ncoercion. Try contacting Kristine Severyn in Ohio. She publishes a vaccine newsletter and may be \n\nable to offer some guidance.\n\nQ. Please help me, I am suppose to take my 7 month old son to the doctor in the next \n\ncouple of days for his dtp, polio, and some other shots. I will explain to you his health from \n\nthe beginining. A..., born July 15th, 1998, weighed 10 lbs 2ozs., full term. A... was a perfect \n\nbreastfed baby for about the first 2 months of his life. At 2 months old he received his first \n\nimmunizations. I remember his right thigh swelling up horribly and leaving a big hard spot \n\nfor weeks. But this was when the inconsolable crying started. I thought he had colic but I \n\ngave up nursing about a week later and started formula. My husband and I dealt with the \n\ncolic, my 2 year old daughter had it and we thought we could just ride it out. At 4 months \n\nA... had another round of shots. This is when the real trouble began. He was very fussy that \n\nday and was beginning to have trouble breathing (much like cold symptoms). I thought he \n\nwas having an allergic reaction to the shots. I called the doctor and they recommened \n\ntylenol. At about 2:00 am, after a about 12 hours of constant crying and taking no fluids I \n\nrushed him to emergency. I was practically laughed out of the ER. The nurses said all \n\nbabies have trouble with shots but we will let you see a doctor. The doctor wanted to rule \n\nout pneumnoia so they did a chest x-ray. They came back saying A... had pneumonia. He \n\nwas hospitalized for 3 days. I brought him home on antibotics. I reported to the family \n\ndoctor one week later and had another chest x-ray, was told he still has pneumonia, there \n\nhas been no change. A... was improving but he was still very fussy, crying basically until he \n\npassed out from exhaustion, although he was eating. On the 2nd visit to the doctors office \n\nand another x-ray our doctor became worried because there was still no change in the right \n\nlung and he still had pneumonia. I was referred to a pulmonary specialist. Our pulmonary \n\nspec. said that he thought this was a thymus on his right lung but could be a hematoma. We \n\nhad a broncosopy done finding asthma and also a bacteria growing in his right lung. \n\nAnother round of 21 day augmentin should clear the bacteria, and breathing treatments \n\nfour times a day with a breathing machine will help the asthma. You should see a \n\ngastrointestinal doctor. A... has a lot of trouble swallowing his milk, he coughs and gags \n\nthrough most of it. On December 18, A... began having seizure-like symptoms. His whole \n\nbody was trembling and his eyes stared off as though he couldn't see you. He balled his \n\nhands up and would be unresponsive to you for a period of 5 to 10 minutes. Back to the ER. \n\nHe was seizing when I arrived. The ER staff took over and began an IV with dilantin and \n\nalso phenobarb. The seizures stopped and he was hospitalized again for 3 days. The \n\npediatric intensivist told us he thought it was reflux, and there is a syndrome called \n\nSandifers Syndrome that will send your body into tremors when the reflux is real bad. A... \n\nhad a CT scan of the chest stating 99% sure his lung problem was a thymus, an MRI and \n\nan EEG telling us his brain was ok and there was no seizure activity. Now on to the gastro \n\nspecialist, an endoscopy shows the reflux is not real bad not bad enough for him to have \n\ntremors. A... is still being treated with Propulsid, Zantac, Phenobarbital each and every \n\nday. We are not for sure if this is helping. He still has some seizure-like activity but after \n\ntwo EEGs coming back normal we don't know what to do. Occasionally he balls his hands \n\nup in his sleep and his head will shake, but you can bring him out of it quite quickly and he \n\nis very responsive. He also spends hours a day with his arms out to his sides and blowing \n\nlike spit bubbles. Some doctors say this is abnormal too. A... is 7 months old and sitting up \n\npretty good, using a walker, babbling, and eating solid foods. I feel that his progression is \n\nreal slow but not extremely abnormal. I spend every night sleeping with him for fear \n\nsomething else is gonna happen. He only sleeps about 2 to 3 hours at a time and is very \n\nrestless. Like I said, today is Thursday and I am supposed to take him to have his 6 month \n\nimmunizations tomorrow. Please give me some advice. Thank you for your time.\n\nA. Another baby has been damaged by vaccines. The doctors deny it, as usual. The mother \n\nobserves, not once but twice, a direct correlation between the vaccines her child received and the \n\nonset of his life-threatening ailments, she doubts the doctors' pathetic lies, but considers giving \n\nanother round of immunization poison to her child anyway.\n\nThe inconsolable crying is described in the medical literature as the \"cri encepahalique\" -- irreversible \n\nnervous system damage resulting from post-vaccinal encephalitis. Dr. Harris Coulter describes it in \n\nhis insightful book, \"Vaccination, Social Violence, and Criminality.\" In short, a 3rd set of shots will \n\nprobably kill your baby.\n\nCall 1-800-822-7967 to file a report with the Vaccine Adverse Event Reporting System. Then resist \n\nyour doctors' many lies. Your child is not required to receive the shots, and YOU are responsible for \n\nhis safety. Good luck.\n\nQ. I'm awake at 2:25 am because I'm experiencing Braxton Hicks with my second child, \n\ndue in 11 days. I have not vaccinated my first child, who just turned two, because of scary \n\nstories like the ones I'm reading in your website. My daughter has suffered a couple of \n\nminor colds but other than that is, and has been, the picture of health. I spoke to my \n\ndaughter's pediatrician about my concerns about vaccinating, and she assured me that she \n\nimmunized her own children and that while she was willing to let me postpone the decision, \n\nshe would ultimately stop seeing my daughter if I didn't immunize. She kept true to her \n\nword. Since I have not vaccinated my daughter, I'm no longer welcome at that \n\npediatrician's office. So now that I'm pregnant again, I need to find another pediatrician. I \n\ninterviewed a pediatrician today who was very pleasant, but told me the same thing -- if I \n\ndon't ultimately vaccinate my newborn we will not be welcome at his office.\n\nThe pediatricians honestly believe that vaccinating is in the best interest of the child, and \n\nadvocate it for their own children. I weigh that against the horrifying Personal \n\nImmunization Stories. Millions of children receive vaccinations each year, right? So these \n\nfew tragedies represent a tiny, tiny percentage of immunization results. But I completely \n\nempathize that if it were MY CHILD suffering, I wouldn't care how small the odds were!! If \n\nI DON'T immunize, am I putting my precious children at risk to contract a disease that \n\ncould easily have been prevented by vaccinating? Does immunization actually prevent \n\nchildren from diseases? Certainly the declining number of cases seems to indicate that \n\nthey do.\n\nA. You are responsible for the care of your child -- not your mother, father, neighbor, or \n\npediatrician. In fact, if your child is hurt by one or more of the vaccines, your pediatrician will deny it \n\nand you will once again feel betrayed. So don't base your decisions on arrogant and insensitive \n\ndoctors who try to coerce you into doing something that you are uncomfortable doing. I recommend \n\nthe book \"How to Raise a Healthy Child...In Spite of Your Doctor\" by Dr. Medelsohn.\n\nThe incidence of damage to children is far greater than you have been lead to believe. Make up your \n\nmind; then be strong with your decision -- whatever it may be. Stand by your decision. Pediatricians \n\nwho will not see you because you are making decisions on your own realize they are not able to \n\ncontrol you. That is why they refuse to see you. This is a common tactic that we hear of by many, \n\nmany parents. You are not alone. Good luck.\n\nQ. We recently discovered your website, and I'm writing to ask you for leads for a little \n\nmore information. Apparently there is a Vaccine Injury Compensation Act, and I'd be \n\ninterested in any info you could provide on it. We are parents of an 8 year old boy who \n\ncontracted Viral Encephalitis close to his 1st birthday. He was healthy and normal until that \n\ntime. He had immunizations about a week or two prior to his illness. The cause of the \n\nillness has never been determined. Our son has had an extremely complicated medical \n\nhistory, and, unlike many of your correspondents, we have had a lot of help and support \n\nfrom the medical community, although at times we have had to really get involved and be \n\nstrong advocates.\n\nAs we get on in life and our family continues to deal with the complications and \n\nramifications of our son's brain damage as a result of seizures, I have a nagging question \n\nabout the cause of his disease. The vector could have been mosquito etc., as we lived in an \n\narea where there was some incidence of Eastern Equine Encephalitis, although the doctors \n\nhave never been able to nail it down, and our son's illness didn't follow the clinical norm for \n\nthat disease. I'm really interested in pursuing whether our son's Encephalitis might have \n\nbeen caused by vaccines, not because I'm vindictive against the medical profession or any \n\nof our providers, but we wish we knew what happened to him, and I guess I'm not too \n\ntrustful of pharmaceutical companies either.\n\nWe are interested in info on the Compensation Act, and where we would find info on \n\nspecific cases which have been diagnosed as definitely related to Vaccines. Thanks for any \n\nhelp you might offer.\n\nA. \"Viral encephalitis\" is a term that is commonly used by the medical community to hide the fact that \n\nyour child was damaged by a vaccine. The doctors who you describe in such loving terms are aware \n\nof how your child contracted his ailment, and will will quickly turn against you at the first suggestion \n\nby you that vaccines may be the cause -- and most definitely if you decide to pursue compensation. \n\nIn fact, the viral encephalitis \"germ\" could have been isolated by the doctors and is traceable to the \n\nvaccine. It has a unique signature.\n\nYou may contact the Vaccine Adverse Event Reporting System (VAERS) to report the incident \n\n(along with the other thousands and thousands of cases that are reported but never investigated): \n\n1-800-822-7967. They will send you a packet of information. Best wishes.\n\nQ. Is it possible to develop Idiopathic Thrombocytopenia Prupura disorder after multiple \n\nvaccinations? Any help with this would be appreciated.\n\nA. Our observations convince us that the medical establishment is quite savvy regarding their use of \n\nmedical terms to \"redefine\" a disease condition. They do not admit an association with vaccines. You \n\nmay wish to contact Dr. Viera Scheibner for more specific correlations. She is an expert on \n\nvaccine-caused ailments. She lives in Australia, but has testified in Canada and the USA as an expert \n\nwitness. 011-61-47-87-8203. Fax: 011-61-47-87-8988.\n\nQ. On saturday morning my 15 month old had her immunizations (hib and mmr -- I believe). \n\nMonday evening she had difficulty breathing. We took her to the emergency room. They \n\nsaid it was croup (she was perfectly healthy--not even a cold before this came on suddenly \n\n-- not even a fever or runny nose). Do you think it's croup or a reaction to the vaccine?\n\nA. We believe that your child had a reaction to the vaccines. You should be extremely cautious on \n\nfuture shots -- if you elect to continue them. Dr. Viera Scheibner wrote an excellent book on \n\nvaccines: \"Vaccination: 100 Years of Orthodox Research...\" It is extremely well-documented and is \n\nquite scholarly and reputable -- just the sort of book for a medical doctor. You may read a brief \n\nsynopsis of this book at http://www.thinktwice.com/vaccine.htm\n\nQ. I am interested in any information that you might have on the subject of ADD and it's \n\ncorralation with vaccines if any. We have seen a great rise in this disorder in children over \n\nthe past 5 to 7 years alone. I have 4 children; the first 3 had all of their vaccines back in \n\nthe 70's and 80's. Thank God they lived through those. I had the 4th in the 90's and I did \n\nnot give him any vaccines. The health difference between the earlier children and the last \n\none is incredible. Three are sickly and the last one very healthy. I have several friends \n\nwith ADD children and they won't listen to me about the vaccines. I would be grateful for \n\nany info on this. Thank you.\n\nA. Dr. Harris Coulter wrote \"Vaccination, Social Violence, and Criminality.\" This book discusses \n\ncorrelations between vaccines and various neurological disorders, including autism, Attention Deficit \n\nHyperactivity Disorder, dyslexia, brain damage, and death. A summary of this book may be found at \n\nhttp://thinktwice.com/vaccine.htm\n\n1. Avoid Vaccines: a) Sign a legal waiver b) Take a blood test showing natural immunity c) Try \n\nhomeschooling d) Move to a better state\n\n4. Consider vitamin therapy (High doses of Vitamin C) prior to and following the shots", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://educate-yourself.org/cn/index.shtml#top", "/intro.shtml#top", "https://educate-yourself.org/cs/index.shtml#top", "/ct/index.shtml#top", "/cn/sylphandchemtrailindex.shtml", "/ed/", "/fc/", "/ozone/", "/immunboosting/", "/nutrition/", "/nch/", "/mbc/index.shtml#top", "http://educate-yourself.org/ozone/index.shtml#top", "/be/", "/fc/drugstory.shtml", "http://educate-yourself.org/vcd/index.shtml#top", "/cancer/", "/newsletter/", "/nwo/", "/nwo/nwonewsindex.shtml", "/ps/", "/mc/casboltintro08sep08.shtml", "/products/pslastlecturedescrip.shtml", "/ab/", "/tjc/", "/mc/", "http://educate-yourself.org/mc/index.shtml#top", "http://educate-yourself.org/tg/index.shtml#top", "http://www.metatech.org/wp/", "/fe/", "/pnl/index.shtml", "/cn/robertbitzer04oct05.shtml", "/cn/lobsangrampaintrograybarker07oct05.shtml", "/tjc/ruthdrownuntoldstory.shtml", "/zsl/index.shtml", "/db/index.shtml", "/lte/globalwarming13sep06.shtml", "/mc/spooklandtricks19oct06.shtml", "/cn/awakenedvetsindex.shtml", "http://educate-yourself.org/cn/eustacemullins2005videointerview05mar15.shtml#top", "http://educate-yourself.org/cn/billcoopernwostructure21oct14.shtml#top", "/du/index.shtml", "/dow/index.shtml", "/pnt/index.shtml", "/cn/britishisraelhiddenhand10jul05.shtml", "http://educate-yourself.org/cn/fundamentalistbrainwashing06jun05.shtml", "/cn/amygoodmangatekeeper27aug05.shtml", "/cn/noamchomskyindex.shtml", "/re/index.shtml", "/cn/projectbluebeam25jul05.shtml", "http://tarpley.net/online-books/george-bush-the-unauthorized-biography/", "http://educate-yourself.org/cn/familythatpreystogethercompared24aug07.shtml", "/cn/zetainfo16sep05.shtml", "/dc/dclatestonmctowerarrays25may02.shtml", "/cpd/index.shtml", "http://emfrefugee.blogspot.mx/", "http://educate-yourself.org/cn/cpsabuseinmichigan14aug05.shtml", "/cn/adrenalburnout19apr05.shtml", "/ww/index.shtml", "/dc/orgoneadventuresindex.shtml", "/cn/johncolemancommof300order14mar05.shtml", "/jm/index.shtml", "http://www.savethemales.ca/", "http://educate-yourself.org/vcd/kenadachiradiointerviewindex.shtml#top", "http://www.cabaltimes.com/2009/07/31/ten-best-conspiracy-websites/", "/cn/mercuryfreedentristy2000.shtml", "http://educate-yourself.org/cn/huldaclarkbooks.shtml#top", "/cn/planetXsequel15jul;04.shtml", "/cn/undocumentedimmigrants01may06.shtml", "http://educate-yourself.org/cn/donaldmarshallinterviews30jul14.shtml", "http://educate-yourself.org/cn/robertswaronterrorhoax04feb09.shtml", "/cn/tavistockarticlesindex04jun04.shtml", "/cn/uscconcentrationcamps28jun01.shtml", "/cn/femaoverview06sep05.shtml", "/cn/aliensarecomingprelude16apr05.shtml", "/cn/rulesoftheroad13principles06jul05.shtml", "/lte/globalwarming13sep06.shtml", "/cn/gangstalkingoverview15sep06.shtml", "/cn/monoatomicgoldthinktwice15aug05.shtml", "http://educate-yourself.org/mbc/sethcreationofmatter.shtml#top", "http://educate-yourself.org/cn/megrethoughtscreatereality12aug14.shtml#top", "http://educate-yourself.org/mbc/ethelrowespiritualismApart28nov11.shtml", "/cn/torkomsaraydarianhope24apr06.shtml", "/cn/greywolffeelingforms15mar06.shtml#top", "/cn/howtovanquishfear23may07.shtml", "http://educate-yourself.org/mc/preventalienmilitaryabductionsapr05.shtml", "/ga/RFcontents.shtml", "/cn/smedleywarisracket.shtml", "/lte/index.shtml", "http://educate-yourself.org/cn/sodomdocumentary17oct14.shtml#top", "http://educate-yourself.org/cn/johncolemangoalsofIlluminati.shtml#top", "http://educate-yourself.org/cn/strawmanillusion02apr10.shtml", "/cn/blogindex.shtml", "/hp/index.shtml", "http://educate-yourself.org/cn/protocolsofsion.shtml#top", "http://educate-yourself.org/cn/ericjonphelpsexposed1part24oct08.shtml#top", "http://educate-yourself.org/cn/eranefratiarrested03aug14.shtml", "http://educate-yourself.org", "http://educate-yourself.org/cn/fukushimaradiationhysteriaindex.shtml#top", "http://educate-yourself.org/cn/agenda21explained18may14.shtml#top", "http://educate-yourself.org/cn/detectandtreatparasites12aug12.shtml#top", "http://educate-yourself.org/vcd/swinefluindex.shtml", "/links.shtml", "http://educate-yourself.org/cn/janetrippintro20aug14.shtml#top", "http://groups.yahoo.com/group/Educate-Yourself_Forum/", "http://tinyurl.com/ya6noao6", "http://educate-yourself.org/dc/orgonegenindex.shtml#top", "http://educate-yourself.org/cs/index.shtml#top", "http://educate-yourself.org/cn/microwavedangersindex.shtml#top", "http://educate-yourself.org/contactus/index.shtml#top", "http://educate-yourself.org/contactus/index.shtml", "http://compassionatesouls.com/chickenpox.html", "http://educate-yourself.org/newsletter/", "http://groups.yahoo.com/group/Educate-Yourself_Forum/", "https://educate-yourself.org/cn/index.shtml#top", "/intro.shtml#top", "https://educate-yourself.org/cs/index.shtml#top", "/ct/index.shtml#top", "/cn/sylphandchemtrailindex.shtml", "/ed/", "/fc/", "/ozone/", "/immunboosting/", "/nutrition/", "/nch/", "/mbc/index.shtml#top", "http://educate-yourself.org/ozone/index.shtml#top", "/be/", "/fc/drugstory.shtml", "http://educate-yourself.org/vcd/index.shtml#top", "/cancer/", "/newsletter/", "/nwo/", "/nwo/nwonewsindex.shtml", "/ps/", "/mc/casboltintro08sep08.shtml", "/products/pslastlecturedescrip.shtml", "/ab/", "/tjc/", "/mc/", "http://educate-yourself.org/mc/index.shtml#top", "http://educate-yourself.org/tg/index.shtml#top", "http://www.metatech.org/wp/", "/fe/", "/pnl/index.shtml", "/cn/robertbitzer04oct05.shtml", "/cn/lobsangrampaintrograybarker07oct05.shtml", "/tjc/ruthdrownuntoldstory.shtml", "/zsl/index.shtml", "/db/index.shtml", "/lte/globalwarming13sep06.shtml", "/mc/spooklandtricks19oct06.shtml", "/cn/awakenedvetsindex.shtml", "http://educate-yourself.org/cn/eustacemullins2005videointerview05mar15.shtml#top", "http://educate-yourself.org/cn/billcoopernwostructure21oct14.shtml#top", "/du/index.shtml", "/dow/index.shtml", "/pnt/index.shtml", "/cn/britishisraelhiddenhand10jul05.shtml", "http://educate-yourself.org/cn/fundamentalistbrainwashing06jun05.shtml", "/cn/amygoodmangatekeeper27aug05.shtml", "/cn/noamchomskyindex.shtml", "/re/index.shtml", "/cn/projectbluebeam25jul05.shtml", "http://tarpley.net/online-books/george-bush-the-unauthorized-biography/", "http://educate-yourself.org/cn/familythatpreystogethercompared24aug07.shtml", "/cn/zetainfo16sep05.shtml", "/dc/dclatestonmctowerarrays25may02.shtml", "/cpd/index.shtml", "http://emfrefugee.blogspot.mx/", "http://educate-yourself.org/cn/cpsabuseinmichigan14aug05.shtml", "/cn/adrenalburnout19apr05.shtml", "/ww/index.shtml", "/dc/orgoneadventuresindex.shtml", "/cn/johncolemancommof300order14mar05.shtml", "/jm/index.shtml", "http://www.savethemales.ca/", "http://educate-yourself.org/vcd/kenadachiradiointerviewindex.shtml#top", "http://www.cabaltimes.com/2009/07/31/ten-best-conspiracy-websites/", "/cn/mercuryfreedentristy2000.shtml", "http://educate-yourself.org/cn/huldaclarkbooks.shtml#top", "/cn/planetXsequel15jul;04.shtml", "/cn/undocumentedimmigrants01may06.shtml", "http://educate-yourself.org/cn/donaldmarshallinterviews30jul14.shtml", "http://educate-yourself.org/cn/robertswaronterrorhoax04feb09.shtml", "/cn/tavistockarticlesindex04jun04.shtml", "/cn/uscconcentrationcamps28jun01.shtml", "/cn/femaoverview06sep05.shtml", "/cn/aliensarecomingprelude16apr05.shtml", "/cn/rulesoftheroad13principles06jul05.shtml", "/lte/globalwarming13sep06.shtml", "/cn/gangstalkingoverview15sep06.shtml", "/cn/monoatomicgoldthinktwice15aug05.shtml", "http://educate-yourself.org/mbc/sethcreationofmatter.shtml#top", "http://educate-yourself.org/cn/megrethoughtscreatereality12aug14.shtml#top", "http://educate-yourself.org/mbc/ethelrowespiritualismApart28nov11.shtml", "/cn/torkomsaraydarianhope24apr06.shtml", "/cn/greywolffeelingforms15mar06.shtml#top", "/cn/howtovanquishfear23may07.shtml", "http://educate-yourself.org/mc/preventalienmilitaryabductionsapr05.shtml", "/ga/RFcontents.shtml", "/cn/smedleywarisracket.shtml", "/lte/index.shtml", "http://educate-yourself.org/cn/sodomdocumentary17oct14.shtml#top", "http://educate-yourself.org/cn/johncolemangoalsofIlluminati.shtml#top", "http://educate-yourself.org/cn/strawmanillusion02apr10.shtml", "/cn/blogindex.shtml", "/hp/index.shtml", "http://educate-yourself.org/cn/protocolsofsion.shtml#top", "http://educate-yourself.org/cn/ericjonphelpsexposed1part24oct08.shtml#top", "http://educate-yourself.org/cn/eranefratiarrested03aug14.shtml", "http://educate-yourself.org", "http://educate-yourself.org/cn/fukushimaradiationhysteriaindex.shtml#top", "http://educate-yourself.org/cn/agenda21explained18may14.shtml#top", "http://educate-yourself.org/cn/detectandtreatparasites12aug12.shtml#top", "http://educate-yourself.org/vcd/swinefluindex.shtml", "/links.shtml", "http://educate-yourself.org/cn/janetrippintro20aug14.shtml#top", "http://groups.yahoo.com/group/Educate-Yourself_Forum/", "http://tinyurl.com/ya6noao6", "http://educate-yourself.org/dc/orgonegenindex.shtml#top", "http://educate-yourself.org/cs/index.shtml#top", "http://educate-yourself.org/cn/microwavedangersindex.shtml#top", "http://educate-yourself.org/contactus/index.shtml#top", "http://educate-yourself.org/contactus/index.shtml"], "authors": ["Ken Adachi"], "publish_date": null}