{"result_id": "105042", "URL": "https://educate-yourself.org/cn/ottimmunosterilization25sep09.shtml", "timestamp": "2023-04-25 15:02:08 CEST+0200", "meta": {"description": "Sep. 25, 2009. \n\nI would submit that these billionaires are men and women of action. When they come to a joint consensus, a detailed plan is quickly and decisively put into action ­ especially if they perceive that their \"plan\" is literally going to \"save the planet\". There should be little doubt that they would have a brilliant plan of action that they are most definitely implementing as you are reading this. These individuals did not get to be billionaires by being stupid, or by merely discussing ideas and concepts over dinner. They, of course, would also know how to keep their depopulation activities camouflaged and hidden from public scrutiny. After all, they reason that only THEY know what is best for the planet.", "lang": "en", "keywords": "educate-yourself.org, dr a true ott, depopulation, genocide,swine flu hoax, swine flu killer vaccine,   \"'Immuno-Sterilization' In Humans, A 2009 Vaccination Odyssey by Dr A True Ott (Sep 28, 2009)\", forced vaccinations, mass sterilizatin, population reduction, george soros, henry kissinger, davidn rockefeller, bill gates, billionaires club, good guy club,", "favicon": "", "canonical": "https://educate-yourself.org/cn/ottimmunosterilization25sep09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "'Immuno-Sterilization' In Humans, A 2009 Vaccination Odyssey by Dr A True Ott (Sep 28, 2009)", "cleaned_text": "According to the Los Angeles Sunday Times newspaper dated May 24, 2009, a meeting of some of the world's richest billionaires took place in Manhattan on May 5, 2009. (See addendum #1 below). These \"elite\" reached a uniform consensus during this meeting ­ that OVERPOPULATION is the single greatest threat facing Planet Earth.\n\n \n\n Mr. George Soros, international banker and agent of the Rothschild family, was also in attendance, and actually led much of the discussion, it was reported (for a biography and curriculum vitae of this warped individual, and his vision for mass sterilization/depopulation of the planet, see Addendum #2).\n\n \n\n The elite's agenda of mass depopulation is no longer covert. It is no longer the realm of \"National Secret Memorandums\" (see NSSM-200 authored by Henry Kissinger and Zbignew Brezinsky back in 1974) It is today public knowledge. It is indeed their top \"agenda\" item for immediate implementation this year - 2009.\n\n \n\n I would submit that these billionaires are men and women of action. When they come to a joint consensus, a detailed plan is quickly and decisively put into action ­ especially if they perceive that their \"plan\" is literally going to \"save the planet\". There should be little doubt that they would have a brilliant plan of action that they are most definitely implementing as you are reading this. These individuals did not get to be billionaires by being stupid, or by merely discussing ideas and concepts over dinner. They, of course, would also know how to keep their depopulation activities camouflaged and hidden from public scrutiny. After all, they reason that only THEY know what is best for the planet.\n\n \n\n Let's look at the elite's depopulation plan from a standpoint of logic and common sense. Of course they realize that only a very small fraction of the world's population (especially in the Western 1st World nations) would eagerly and willingly step forward and volunteer that their lineage and bloodlines would be severed by means of a permanent sterilization \"vaccination\". It is obvious, therefore, that such a \"sterilization vaccine\" would need to be disguised as something else, a truly global false-flag program fueled by their controlled media propaganda and fear-mongering. I would submit that a worldwide faux \"influenza pandemic\" would be an absolutely perfect cover.\n\n \n\n Prior to the year 1998, the available depopulation tools that could be utilized by such \"global elitists\" were fairly limited; diseases, famine, wars and even natural disasters could each be developed and actually implemented by a designed plan. These depopulation tools are rather messy, however, and often hard to completely control. However, thanks to the work of Dr. Richard A. Fayrer ­Hosken at the University of Georgia, a new and completely effective depopulation tool is now available ­ indeed, a simple little VACCINE SHOT can today cause permanent sterility. (See Addendum 3 attached for the international patent of this \"immunosterilization vaccine\".)\n\n \n\n Fayrer-Hosken's invention has been successfully tested and found to be effective on all mammals, including the African elephant, although the potential long-term side effects are still being compiled. What exactly is the active ingredients of this sterilization vaccine? Primarily the sterilization vaccine contains antigens from PORCINE (pig) glyco-proteins (viruses are a form of glyco-proteins) bonded with a powerful oil-in-water \"adjuvant\" called squalene. (See addendum 3).\n\n \n\n Is it just a coincidence that Novartis' master patent for the \"swine flu\" vaccine utilizes swine (porcine) glycol-proteins bonded with a powerful oil-in-water \"adjuvant\" called squalene?\n\n \n\n Is it just a coincidence that Novartis' \"swine flu\" vaccine product information circular, section 8.1, includes this warning paragraph: \"Animal reproduction studies have not been conducted with this ---[vaccine]. It is also not known whether the vaccine can cause fetal harm when administered to a pregnant woman, OR CAN AFFECT REPRODUCTION CAPACITY.\" (Emphasis added.)\n\n \n\n It would also seem highly logical that a sterilization vaccine disguised as a pandemic influenza vaccine would require a complete blanket shield against liability lawsuits and litigation as well ­ for such claims would undoubtedly number in the hundreds of millions. (Oops, sorry the vaccine made you sterile Mrs. Jones ­ we had absolutely no idea, you see!) Of course, such blanket immunity from lawsuits is exactly what has been given to the \"swine flu\" vaccine manufacturers and promoters by our corrupt federal government.\n\n \n\n It is clear that the \"swine flu\" pandemic is no more serious than the common cold ­ but it is also increasingly clear that the VACCINE is the real danger. If the squalene adjuvant cripples and even kills the victim in addition to making him/her permanently stable, then I am confident that is perfectly ok with George Soros and his breed. Make no mistake, however, the entire agenda behind this pandemic vaccine hype is very likely the covert \"immunosterilization\" of the human herd!\n\n \n\n --True Ott, PhD, ND\n\nADDENDUM #1\n\n \n\n Billionaire Club Meets to Curb Population Growth\n\n by John Harlow\n\n Los Angeles\n\n The Sunday Times\n\n May 24, 2009\n\n \n\n http://www.timesonline.co.uk/tol/news/world/us_and_americas/article6350303.ece\n\n \n\n America's richest people meet to discuss ways of tackling a 'disastrous' environmental, social and industrial threat\n\n \n\n SOME of America's leading billionaires have met secretly to consider how their wealth could be used to slow the growth of the world's population and speed up improvements in health and education.\n\n \n\n The philanthropists who attended a summit convened on the initiative of Bill Gates, the Microsoft co-founder, discussed joining forces to overcome political and religious obstacles to change.\n\n \n\n Described as the Good Club by one insider it included:\n\n \n\n David Rockefeller Jr, the patriarch of America's wealthiest dynasty [http://www.bibliotecapleyades.net/exopolitica/esp_exopolitics_G_3.htm ]\n\n \n\n Warren Buffett and George Soros [http://www.bibliotecapleyades.net/sociopolitica/secretsoc_20century/secretsoc_20century10.htm#CHAPTER%2056]\n\nthe financiers Michael Bloomberg, the mayor of New York and media moguls Ted Turner and Oprah Winfrey [http://www.bibliotecapleyades.net/esp_sociopol_mediacontrol.htm]\n\nThese members, along with Gates, have given away more than £45 billion since 1996 to causes ranging from health programs in developing countries to ghetto schools nearer to home.\n\n \n\n They gathered at the home of Sir Paul Nurse, a British Nobel prize biochemist and Rockefeller University, in Manhattan on May 5. The informal afternoon session was so discreet that some of the billionaires’ aides were told they were at “security briefings”.\n\nStacy Palmer, editor of the Chronicle of Philanthropy, said the summit was unprecedented. “We only learnt about it afterwards, by accident. Normally these people are happy to talk good causes, but this is different – maybe because they don’t want to be seen as a global cabal,” he said.\n\nSome details were emerging this weekend, however. The billionaires were each given 15 minutes to present their favourite cause. Over dinner they discussed how they might settle on an “umbrella cause” that could harness their interests.\n\nThe issues debated included reforming the supervision of overseas aid spending to setting up rural schools and water systems in developing countries. Taking their cue from Gates they agreed that overpopulation was a priority.\n\nThis could result in a challenge to some Third World politicians who believe contraception and female education weaken traditional values.\n\nGates, 53, who is giving away most of his fortune, argued that healthier families, freed from malaria and extreme poverty, would change their habits and have fewer children within half a generation.\n\nAt a conference in Long Beach, California, last February, he had made similar points. “Official projections say the world’s population will peak at 9.3 billion [up from 6.6 billion today] but with charitable initiatives, such as better reproductive healthcare, we think we can cap that at 8.3 billion,” Gates said then.\n\nPatricia Stonesifer, former chief executive of the Bill and Melinda Gates Foundation, which gives more than £2 billion a year to good causes, attended the Rockefeller summit. She said the billionaires met to “discuss how to increase giving” and they intended to “continue the dialogue” over the next few months.\n\nAnother guest said there was “nothing as crude as a vote” but a consensus emerged that they would back a strategy in which population growth would be tackled as a potentially disastrous environmental, social and industrial threat.\n\n“This is something so nightmarish that everyone in this group agreed it needs big-brain answers,” said the guest. “They need to be independent of government agencies, which are unable to head off the disaster we all see looming.”\n\nWhy all the secrecy? “They wanted to speak rich to rich without worrying anything they said would end up in the newspapers, painting them as an alternative world government,” he said.\n\nADDENDUM #2\n\n Monday, September 21, 2009\n\n \n\n \n\n by Jim O’Neill\n\n \n\n Updated with the link for the streaming archive of The Awakening, tonight ~ Read about Soros, the man who is making the Marxofascist insurrection happen, with America being destroyed, in it’s path. And listen to the author of this piece. Jim O’Neill was a special guest on The Awakening, this Monday night, 9/21, in the second hour (10-11pm ET). Obama eligibility plaintiff, Markham Robinson (Barnett, et. al. v. Obama) was our guest for the first hour (9-10pm ET). Mr. Robinson explained why he fired Orly Taitz and how Gary Kreep has saved the case… so far.\n\n \n\n “The main obstacle to a stable and just world order is the United States.”—George Soros\n\n “George Soros is an evil man. He’s anti-God, anti-family, anti-American, and anti-good.” —Rev. Jesse Lee Peterson\n\nIs it possible to lay the global financial meltdown, the radicalizing of the Democratic Party, and America’s moral decline, at the feet of one man?\n\n \n\n It is indeed possible.\n\n \n\n If George Soros isn’t the world’s preeminent “malignant messianic narcissist,” he’ll do until the real thing comes along. Move over, Hitler, Stalin, Mao, and Pol Pot. There’s a new kid on the block.\n\n \n\n What we have in Soros, is a multi-billionaire atheist, with skewed moral values, and a sociopath’s lack of conscience. He considers himself to be a world class philosopher, despises capitalism, and just loves social engineering. Uh oh. Can you say “trouble,” boys and girls?\n\n \n\n Soros is a real life version of Dr. Evil—with Obama in the role of Mini-Me. Which is not as humorous as it might at first sound. In fact, it’s bone-deep chilling.\n\n \n\n György Schwartz, better known to the world as George Soros, was born August 12, 1930 in Hungary. Soros’ father, Tivadar, was a fervent practitioner of Esperanto—a language invented in 1887, and designed to be the first global language, free of any national identity.\n\n The Schwartz’s, who were non-practicing Jews, changed the family name to Soros, in order to facilitate assimilation into the gentile population, as the Nazis spread into Hungary during the 1930s. Soros is an Esperanto word meaning “to soar.”\n\n \n\n In 1944 Hitler’s henchman Adolf Eichmann arrived in Hungary, to oversee the murder of that country’s Jews. The Soros children were all given fake identity papers, and were shipped out to various Christian families. George Soros ended up with a man whose job was confiscating property from the Jewish population. Soros went with him on his rounds.\n\n \n\n Soros has repeatedly called 1944 “the best year of his life.”\n\n \n\n In an article in the Wall Street Journal, Joshua Muravchik notes that, “70% of Mr. Soros’s fellow Jews in Hungary, nearly a half-million human beings, were annihilated in that year. They were dying and disappearing all around him, and their numbers no doubt included many whom he knew personally. Yet he gives no sign that this put any damper on his elation, either at the time or indeed in retrospect.”\n\n During an interview with “Sixty Minute’s” Steve Kroft, Soros was asked about his “best year:”\n\n Sweetness & Light\n\n KROFT: My understanding is that you went out with this protector of yours who\n\n swore that you were his adopted godson.\n\n SOROS: Yes. Yes.\n\n KROFT: Went out, in fact, and helped in the confiscation of property from the Jews.\n\n SOROS: Yes. That’s right. Yes.\n\n KROFT: I mean, that sounds like an experience that would send lots of people to the\n\n psychiatric couch for many, many years. Was it difficult?\n\n SOROS: Not, not at all. Not at all.\n\n KROFT: No feeling of guilt?\n\n SOROS: No.\n\n Of course he didn’t feel guilty. Soros has the moral depth of a clam. Nonetheless, he has said, “my goal is to become the conscience of the world.”\n\n In his article, Muravchik describes how Soros has admitted to having “carried some rather potent messianic fantasies with me from childhood, which I felt I had to control, otherwise they might get me in trouble.”\n\n Can you imagine the results of this messianic sociopath being “the conscience of the world?” Ye gods.\n\n Be that as it may. After WWII, Soros attended the London School of Economics, where he fell under the thrall of fellow atheist and Hungarian, Karl Popper, one of his professors. Popper was a mentor to Soros until Popper’s death in 1994. Two of Popper’s most influential teachings concerned “the open society,” and Fallibilism.\n\n Fallibilism is the philosophical doctrine that all claims of knowledge could, in principle, be mistaken. Then again, I could be wrong about that.\n\n The “open society” basically refers to a “test and evaluate” approach to social engineering. Regarding “open society” Roy Childs writes, “Since the Second World War, most of the Western democracies have followed Popper’s advice about piecemeal social engineering and democratic social reform, and it has gotten them into a grand mess.\n\n In 1956 Soros moved to New York City, where he worked on Wall Street, and started amassing his fortune. He specialized in hedge funds and currency speculation.\n\n Soros is absolutely ruthless, amoral, and clever in his business dealings, and quickly made his fortune. By the 1980s he was well on his way to becoming the global powerhouse that he is today.\n\n In an article Kyle-Anne Shiver wrote for “The American Thinker” she says, “Soros made his first billion in 1992 by shorting the British pound with leveraged billions in financial bets, and became known as the man who broke the Bank of England. He broke it on the backs of hard-working British citizens who immediately saw their homes severely devalued and their life savings cut drastically…almost overnight.”\n\n In 1994 Soros crowed in “The New Republic” that “the former Soviet Empire is now called the Soros Empire.” The Russia-gate scandal in 1999, which almost collapsed the Russian economy, was labeled by Rep. Jim Leach, then head of the House Banking Committee, to be “one of the greatest social robberies in human history.” The “Soros Empire” indeed.\n\n In 1997 Soros almost destroyed the economies of Thailand and Malaysia. At the time, Malaysia’s Prime Minister, Mahathir Mohamad, called Soros “a villain, and a moron.” Thai activist Weng Tojirakarn said, “We regard George Soros as a kind of Dracula. He sucks the blood from the people.” (Source)\n\n The website Greek national Pride reports, “[Soros] was part of the full court press that dismantled Yugoslavia and caused trouble in Georgia, Ukraine and Myanmar [Burma]. Calling himself a philanthropist, Soros’ role is to tighten the ideological stranglehold of globalization and the New World Order while promoting his own financial gain. He is without conscience; a capitalist who functions with absolute amorality.”\n\n France has upheld an earlier conviction against Soros, for felony insider trading. Soros was fined 2.9 million dollars. (Source)\n\n Recently, his native Hungary fined Soros 2.2 million dollars for “illegal market manipulation.” Elizabeth Crum writes that “The Hungarian economy has been in a state of transition as the country seeks to become more financially stable and westernized. [Soros’] deliberately driving down the share price of its largest bank put Hungary’s economy into a wicked tailspin, one from which it is still trying to recover.” (Source)\n\n Soros’ grasp, greed, gluttony have a global reach\n\n My point here is that Soros is a planetary parasite. His grasp, greed, and gluttony have a global reach. But what about America? Soros told Australia’s national newspaper “The Australian” “America, as the centre of the globalised financial markets, was sucking up the savings of the world. This is now over. The game is out,” he said, adding that the time has come for “a very serious adjustment” in American’s consumption habits.\n\n Ready to tighten your belts, America?\n\n World financial crisis was”stimulating” and “in a way, the culmination of my life’s work.”\n\n Soros also told “The Australian” that the world financial crisis was”stimulating” and “in a way, the culmination of my life’s work.”\n\n Stimulating. Have you found the job losses, house foreclosures, and incredible national debt—stimulating? Me neither.\n\n Obama has recently promised 10 billion of our tax dollars to Brazil (yes, billion with a “b”), in order to give them a leg-up in expanding their offshore oil fields. Obama’s largesse towards Brazil, came shortly after Soros invested heavily in Brazilian oil (Petrobras).\n\n Tait Trussel writes, “The Petrobras loan may be a windfall for Soros and Brazil, but it is a bad deal for the U.S. The American Petroleum Institute estimates that oil exploration in the U.S. could create 160,000 new, well-paying jobs, as well as $1.7 trillion in revenues to federal, state, and local governments, all while fostering greater energy security.”\n\n Do you get the feeling that American taxpayers are being treated like gullible suckers?\n\n (By the way, if you want a short primer on Far Left economics—and a great cartoon from a 1911 St. Louis Post-Dispatch—go to actor Michael Moriarty’s website).\n\n \n\n A blog you might want to keep an eye on is www.SorosWatch.com. This is their mission: “This blog is dedicated to all…who have suffered due to the ruthless financial pursuits of…George Soros. Your stories are many and varied, but the theme is the same: the destructive power of greed without conscience. We pledge to tirelessly watch Soros wherever he goes and to print the truth in the hope that he will one day stop preying upon the world’s poor…that justice will be served.”\n\n \n\n Back to America. Soros has been actively working to destroy America from the inside out for some years now. People have been warning us. Two years ago Bill O’Reilly said on “The O’Reilly Factor” that “Soros [is] an extremist who wants open borders, a one-world foreign policy, legalized drugs, euthanasia, and on and on. This is off-the-chart dangerous….” (Source)\n\n In 1997 Rachel Ehrenfeld wrote, “Soros uses his philanthropy to change—or more accurately deconstruct—the moral values and attitudes of the Western world, and particularly of the American people. His “open society” is not about freedom; it is about license. His vision rejects the notion of ordered liberty, in favor of an ideology of rights and entitlements.”\n\n \n\n Perhaps the most important of these “whistle blowers” are David Horowitz and Richard Poe. Their book “The Shadow Party” outlines in detail how Soros hijacked the Democratic Party, and now owns it lock, stock, and barrel.\n\n Soros has been packing the Democratic Party with radicals, and ousting moderate Democrats for years. I don’t have time to do the subject justice in this article, but FrontPage’s Jamie Glazov has an excellent interview with Richard Poe, which will fill you in on many of the facts.\n\n The Shadow Party became the Shadow Government, which became the Obama Administration.\n\n \n\n DiscoverTheNetworks.org (another good source) writes, “By his [Soros’] own admission, he helped engineer coups in Slovakia, Croatia, Georgia, and Yugoslavia. When Soros targets a country for “regime change,” he begins by creating a shadow government—a fully formed government-in-exile, ready to assume power when the opportunity arises. The Shadow Party he has built in America greatly resembles those he has created in other countries prior to instigating a coup.”\n\n The above quote was, of course, written before the Presidential Election. So was the following quote from a November 2008 edition of the German magazine “Der Spiegel,” in which Soros gives his opinion on what the next POTUS should do after taking office. “I think we need a large stimulus package….” Soros thought that around 600 billion would be about right.\n\n Soros also said that “I think this is a great opportunity to finally deal with global warming and energy dependence. The U.S. needs a cap and trade system with auctioning of licenses for emissions rights.”\n\n Any of this sound familiar?\n\n Although Soros doesn’t (yet) own the Republican Party, like he does the Democrats, make no mistake, his tentacles are spread throughout the Republican Party as well.\n\n \n\n Soros is a partner in the Carlyle Group where he has invested more than 100 million dollars. According to an article by “The Baltimore Chronicle’s” Alice Cherbonnier, the Carlye Group is run by “a veritable who’s who of former Republican leaders,” from CIA man Frank Carlucci, to CIA head [and ex-President] George Bush, Sr.\n\n \n\n In late 2006, Soros bought about 2 million shares of Halliburton—Dick Cheney’s old stomping grounds.\n\n When the Democrats and Republicans held their conventions in 2000, Soros held Shadow Party conventions in the same cities, at the same time. Republican Senator John McCain was the keynote speaker at the “Soros Convention” (so labelled by the late Robert Novak) in Philadelphia.\n\n Soros has dirtied both sides of the aisle, trust me. And if that weren’t bad enough, he has long held connections with the CIA.\n\n And I musn’t forget to mention Soros’ involvement with the LSM (Lame Stream Media), the entertainment industry (e.g. he owns 2.6 million shares of Time Warner), and the various political advertising organizations he funnels millions to.\n\n As Matthew Vadum writes, “The liberal billionaire-turned-philanthropist has been buying up media properties for years in order to drive home his message to the American public that they are too materialistic, too wasteful, too selfish, and too stupid to decide for themselves how to run their own lives.”\n\n Richard Poe writes, “Soros’ private philanthropy, totaling nearly $5 billion, continues undermining America’s traditional Western values. His giving has provided funding of abortion rights, atheism, drug legalization, sex education, euthanasia, feminism, gun control, globalization, mass immigration, gay marriage and other radical experiments\n\n in social engineering.”\n\n Some of the many NGOs (None Government Organizations) that Soros funds with his billions are: MoveOn.org, the Apollo Alliance, Media Matters for America, the Tides Foundation, the ACLU, ACORN, PDIA (Project on Death In America), La Raza, and many more. For a more complete list, with brief descriptions of the NGOs, go to DiscoverTheNetworks.org.\n\nPoe continues, “Through his global web of Open Society Institutes and Open Society Foundations, Soros has spent 25 years recruiting, training, indoctrinating and installing a network of loyal operatives in 50 countries, placing them in positions of influence and power in media, government, finance and academia.”\n\n As I’ve said before, America currently faces the greatest challenge to its existence as a free republic since the Civil War. And as we go, so goes the world.\n\n So is Soros to blame for all of America’s woes?\n\n Without Soros, would the Saul Alinsky Chicago machine still be rolling? Would SEIU, ACORN, and La Raza still be pursuing their nefarious activities? Would Big Money and lobbyists still be corrupting government? Would our college campuses still be retirement homes for 1960s radicals? Yes, yes, yes, and yes—but to much less of a degree.\n\n The purpose of this article is to point out that without the financial skullduggery and Machiavellian manipulations of Soros, America would be a considerably safer, saner, and stabler place to live.\n\n America stands at the brink of an abyss, and that fact is directly attributable to Soros. Soros has vigorously, cleverly, and insidiously planned the ruination of America.\n\n His conduct has been immoral, duplicitous, and traitorous. Stripping Soros of his U.S. citizenship, should be one of the first steps taken during the upcoming courtroom trials.\n\n And trials there must be. No matter the cost, the nest of vipers on Capitol Hill, and all of the traitors in the government at large, must be brought to task for their behavior, or a free America is doomed.\n\n The words of Patrick Henry are apropos: “Is life so dear, or peace so sweet, as to be purchased at the price of chains and slavery? Forbid it, Almighty God! I know not what course others may take, but as for me, give me liberty, or give me death!”\n\n These days, Patrick Henry’s sentiment is more than just some quaint hyperbole from long ago—it’s a slow burning, but intense, glow that fires our courage and heart.\n\n Laus Deo.\n\n Born in June of 1951 in Philadelphia, Pennsylvania, Jim O’Neill proudly served in the U.S. Navy from 1970-1974 in both UDT-21 (Underwater Demolition Team) and SEAL Team Two. A member of MENSA, he worked as a commercial diver in the waters off Scotland, India, and the United States. In 1998 while attending the University of South Florida as a journalism student, O’Neill won “First Place” in the “Carol Burnett/University of Hawaii AEJMC Research in Journalism Ethics Award. The annual contest was set up by Carol Burnett with the money she won from successfully suing the National Enquirer for libel.\n\nPub. No.: WO/1999/034825 International Application No.: PCT/US1998/027658\n\n Publication Date: 15.07.1999 International Filing Date: 30.12.1998\n\n Chapter 2 Demand Filed: 02.08.1999\n\n IPC: A61K 39/00 (2006.01), C07K 14/705 (2006.01) Applicants:THE UNIVERSITY OF GEORGIA RESEARCH FOUNDATION, INC. [US/US]; Boyd Graduate Studies Research Center Athens, GA 30602-7411 (US) (All Except US).\n\nFAYRER-HOSKEN, Richard, A. [US/US]; (US) (US Only). Inventor:FAYRER-HOSKEN, Richard, A.; (US). Agent:SANDBERG, Victoria, A.; Mueting, Raasch & Gebhardt P.O. Box 581415 Minneapolis, MN 55458-1415 (US). Priority Data:\n\n 60/070,375 02.01.1998 US\n\n 60/071,406 15.01.1998 US\n\n 60/076,368 27.02.1998 US\n\n Title: FERTILITY IMPAIRING VACCINE AND METHOD OF USE Abstract: A vaccine comprising an antigen derived from a zona pellucida glycoprotein is effective to impair fertility in animals, preferably carnivores. The vaccine can be used as an immunosterilant or an immunocontraceptive.\n\nFERTILITY IMPAIRING VACCINE AND METHOD OF USE This application claims the benefit of U. S. Provisional Application No. 60/070,375, filed January 2,1998, U. S. Provisional Application No. 60/071,406, filed January 15,1998, and U. S. Provisional Application No.\n\n 60/076,368, filed February 27,1998.\n\n Background of the Invention Traditional methods of population control in dogs have been unsuccessful. Surgical spaying is a laborious procedure, requiring the initial induction of the animal, gas anesthesia during surgery, a surgical pack with suture materials and post-operative medications. Common surgical complications include problems associated with the procedure itself, allergic reactions to anesthetics or post-operative medications, and adverse local or systemic effects during the recovery period. Examples include ovarian remnant syndrome, where dogs continue to cycle despite being spayed, uterine infections, abdominal hemorrhage, and premature opening of the suture line. A substantial recovery period is typically needed even after an uncomplicated procedure.\n\n Surgical spaying is also expensive, and pet owners are often unwilling to assume the costs.\n\n Hormonal therapies have also been used to curb pet overpopulation. However these methods usually require daily administration of the drug, and they only result in temporary infertility. Furthermore, most protracted hormonal therapies have undesirable side effects such as uterine infections, mammary cancer, and diabetes.\n\n Previous studies (e. g., C. Mahi-Brown et al., J. Exp. Zool., 222, 89-95 (1982)) have shown that fertility impairment in the female dog can be achieved by vaccinating with a preparation containing a glycoprotein associated with the mammalian egg, namely the pig zona pellucida (pZP). The vaccine contained a crude extract of porcine zona pellucida, obtained via collegenase digestion of ovarian material to remove follicular cells and an adjuvant, namely Freund’s Complete adjuvant, alum adjuvant, or CP-20,961 (C. Mahi-Brown et al., Biol. Reprod., 32,761-772 (1985)). Collegenase treatment of zona pellucida proteins is known to alter the proteins in a way that can be demonstrated immunocytochemically. Abnormal estrus cycles, characterized by constant or prolonged estrus, and other deleterious side effects, such as ovarian cyst formation, were found to be associated with the vaccinations (C. Mahi-Brown, Am. J. Reprod. Immunol. Microbiol., 18,94-103 (1988)), and were never satisfactorily explained.\n\n A vaccine comprising porcine zona pellucida and an adjuvant comprising synthetic trehalose dicorynomycolate has been successfully used to cause immunocontraception in horses (P. Willis et al., J. Equine Vet. Sci., 364- 370 (1994)) and elephants (R. F-H., Wildlife Soc. Bull., 25 (1): 18-21 (1997)).\n\n Dunbar et al. (e. g., EP 599822, U. S. Pat. No. 5,637,300) have experimented with reproductive control in non-rodent mammals using a recombinant zona pellucida protein. Due to limitations imposed by recombinant DNA technology and available expression systems, however, the recombinant protein lacks the glycosylation pattern of the native glycoprotein.\n\n In humane shelters population control of unwanted pets is currently achieved through euthanasia of the animals. In general, after capture, dogs are held for a period of one week. If they are not adopted, they are humanely destroyed.\n\n There is, therefore, a demonstrated need for a safe, simple method for sterilizing animals, particularly cats and dogs, that is both permanent and relatively inexpensive.\n\n Summary of the Invention The present invention provides a vaccine and a method for impairing fertility in an animal. The method for impairing fertility in the animal comprises administering to the animal a vaccine comprising substantially pure, nonrecombinant zona pellucida glycoprotein, or an antigenic fragment thereof.\n\n The vaccine is administered in a manner and an amount effective to cause fertility impairment in the animal. When administered as an immunocontraceptive, the fertility impairment vaccine causes temporary, reversible infertility in the animal. When administered as an immunosterilant, the fertility impairing vaccine causes permanent, irreversible infertility in the animal. Preferably, the animal to which the vaccine is administered is a carnivore. Preferably, the carnivore is a dog or a cat; more preferably, the carnivore is a dog. The vaccine preferably does not cause abnormal estrus cycles in a vaccinated dog.\n\n The fertility impairing vaccine of the invention preferably comprises porcine zona pellucida glycoprotein, and optionally includes an immunological adjuvant comprising an immunostimulant, preferably synthetic trehalose dicorynomycolate (STDCM). Also optionally, the vaccine contains an oil, preferably squalene oil.\n\n In a preferred embodiment, the fertility impairing vaccine is an immunosterilant vaccine. The immunosterilization method of the invention is far preferable to surgical sterilization and hormone regimens as a population control tool for domestic dogs and cats, and can further be used to control ferrel dog and cat populations, for example by development of a species-specific oral delivery vehicle.\n\n Brief Description of the Drawings Figure 1 shows one version of the oocyte purification apparatus of the invention.\n\n Figure 2 is a graph depicting serum anti-porcine zona pellucida antibody titers in experimental dogs (subjects 9727,9728,9729 and 9731) and clinical dogs (subjects 2-5) during the course of vaccination with a porcine zona pellucida (pZP) vaccine.\n\n Detailed Description of the Preferred Embodiments The fertility impairing vaccine of the invention comprises an antigen comprising zona pellucida glycoprotein, preferably substantially pure zona pellucida glycoprotein, or an antigenic fragment thereof. Preferably, zona pellucida glycoprotein is a total porcine zona pellucida glycoprotein. A total zona pellucida glycoprotein preparation obtained from pig ovaries includes all three major heavily glycosylated porcine zona pellucida glycoproteins: pZPI, pZP3a and pZP3,. pZP3a and pZP3 P each have reported molecular weights of about 55 kD, and pZP1 has a reported molecular weight of about 82 kD. The amino acid sequences of these three glycoproteins are known (J. D. Harris et al., DNA Seq., 4,361-393 (1994)). Other reported pZP glycoproteins are believed to be degradation products of pZP 1.\n\n Purity of the zona pellucida glycoprotein can be evaluated analytically using a combination or series of two-dimensional sodium dodecyl sulfate polyacrylamide gels (SDS-polyacrylamide gel electrophoresis, or SDS- PAGE) with silver staining, Coomassie Blue staining, and Western blot analysis, as described in the following Examples. Glycoproteins typically migrate electrophoretically in gels as broad smears rather than narrow bands, as a result of the variable levels of negative charge present in the constituent oligosaccharide chains. A”substantially pure”total zona pellucida glycoprotein preparation isolated from pig ovaries migrates as two distinct smears in the gel electrophoretic experiments (one smaller smear representing pZP 1, and one larger smear representing pZP3a and pZP3p), and shows immunological reactivity in Western blot analysis using a polyclonal antibody raised in rabbits to highly purified total porcine zona pellucida glycoprotein. In a substantially pure zona pellucida glycoprotein preparation used for fertility impairment, there are no detectable contaminating proteins. The absence of detectable contaminating proteins is determined by demonstrating that there are no proteins in the preparation that have electromigration patterns different from those exhibited by the zona pellucida glycoproteins as determined by two-dimensional SDS-PAGE (silver-stained) or Western blot analyses of two-dimensional SDS- PAGE gels. An antigenic fragment of a zona pellucida glycoprotein is a peptide fragment, preferably a glycosylated peptide fragment, that elicits an immune response characterized by detectable anti-pZP antibody levels in the subject using ELISA as described in Example II. The peptide fragment preferably contains more than seven amino acids, more preferably at least about 10 amino acids, most preferably at least about 20 amino acids.\n\n The zona pellucida glycoprotein used in the present vaccine is preferably a naturally occurring glycoprotein or a chemically or enzymatically synthesized glycoprotein. The glycoprotein is preferably not a recombinant glycoprotein, but use of a recombinant glycoprotein in the present vaccine is not necessarily excluded in alternative embodiments of the invention.\n\n The vaccine of the invention preferably additionally includes an immunological adjuvant to enhance the immunological response of the subject to the glycoprotein antigen. Examples of adjuvants include Freund’s Complete Adjuvant, Freund’s Incomplete Adjuvant, and an adjuvant comprising an immunostimulant such as synthetic trehalose dicorynomycolate (STDCM) and an oil such as squalene oil (see P. Willis et al., J. Equine Vet. Sci., 14,364-370 (1994)). An adjuvant comprising synthetic trehalose dicorynemycolate, squalene oil, and a surfactant such as lecithin is preferred. Lecithin typically includes phosphatidyl choline.\n\n In a preferred embodiment the vaccine comprises oil, preferably a biodegradable oil such as squalene oil, in an amount of about 2.5% to about 15%, preferably about 8% to about 12%. In preparing the vaccine it is advantageous to combine a concentrated oily adjuvant composition with an aqueous solution of the antigen, pZP glycoprotein. Typically, the vaccine is prepared using an adjuvant concentrate which contains lecithin (about 5% to about 15 % wt/vol, preferably about 12% wt/vol) and STDCM (preferably about 25 mg/mL to about 50 mg/mL) in squalene oil. The term % wt/vol means grams per 100 mL of liquid. The aqueous solution containing the isolated pZP glycoprotein is typically a phosphate-buffered saline (PBS) solution, and additionally preferably contains Tween 80 (about 0.2% vol/vol to about 0.8% vol/vol, preferably about 0.4% vol/vol). See J. A. Rudbach et al.,”Ribi Adjuvants: Chemistry, Biology and Utility in Vaccines for Human and Veterinary Medicine,”in The Theorv and Practical Application of Adjuvants, D. E. S. Stewart-Tull, Ed., John Wiley & Sons, New York, NY (1995)).\n\n Homogenization of the oily adjuvant concentrate with the aqueous pZP solution can be accomplished using any convenient means known in the art, such that the oil disperses within the aqueous solution to form an oil in water emulsion. Oil droplet sizes of about 200 nm or less are particularly preferred as they produce a more uniform and stable suspension. A particularly preferred vaccine comprises predetermined amounts of pZP and STDCM in an emulsion containing about 10% squalene oil and about 90% aqueous phase.\n\n The invention further includes a method for administering a fertility impairing vaccine as described herein in a manner effective to cause impaired fertility in an animal, preferably a carnivore (i. e., a member of the order Carnivora). Preferably the carnivore is not a primate, and is a dog or a cat, more preferably a dog. Impairment of fertility in an animal in accordance with the invention can take the form of either immunocontraception and immunosteriliztion. Immunosterilization means permanent, irreversible infertility, in contrast to immunocontraception wherein infertility is temporary or transient, and reversible. Immunocontraception and immunosterilization are both dependent on the antibody titer level in the serum of the subject, but immunosterilization is typically the result of ovarian pathology caused by vaccine administration and high titers of anti-pZP antibodies, as evidenced by, for example, total destruction of the zona pellucida glycoproteins and/or influx of leukocytes into the follicles. Reducing the number of boosters leads to lower antibody titers which results in immunocontraception (i. e., infertility that is temporary and reversible) instead of immunosterilization.\n\n The vaccine is administered in a manner and an amount effective to cause the desired infertility in the mammalian subject. For example, to immunosterilize a dog or a cat, the vaccine is preferably administered in the form of a plurality of doses (typically about 1.0 mL for a dog, 0.5 mL for a cat), each dose containing zona pellucida glycoprotein, or an antigenic fragment thereof, in an amount of about 100 g to about 2 mg, more preferably about 200 ug to about 400 u. g. An immunostimulant such as STDCM is typically present in a per dose amount of about 50 Hg to about 5 mg, preferably in an amount of about 1 mg to about 3.5 mg, more preferably in an amount of about 2 mg to about 3 mg. The animal is given an initial dose, usually via intramuscular injection although subcutaneous injection can also be used. The initial injection is followed by two or more booster injections at two to four week intervals, although the boosters can be administered from about 9 days to about twelve months following the previous vaccination. The body’s immunological response to the vaccine at this dosing regimen appears to render the ovaries permanently inactive as a result of, for example, follicle disruption or destruction, as evidenced by immunocytochemical analysis and histological evaluation of the ovarian tissue of vaccinated subjects. Sterility is permanent and irreversible. Immunosterilization of carnivores in accordance with the present method typically does not cause abnormal estrus cycles or other significant undesirable side effects in the vaccinated subjects.\n\n When the vaccine is administered to a dog or a cat as described above, but with only one booster instead of two or more boosters, the vaccine typically results in immunocontraception (i. e., temporary or transient, reversible infertility) rather than immunosterilization.\n\n EXAMPLES Advantages of the invention are illustrated by the following examples. However, the particular materials and amounts thereof recited in these examples, as well as other conditions and details, are to be interpreted to apply broadly in the art and should not be construed to unduly restrict or limit the invention in any way.\n\n Example I. Isolation of Porcine Zona Pellucide and Extraction of pZP Glycoproteins Buffers. Saline buffer (40 L) was made by addition 4 L of the following solution: 0.9% NaCI, 0.01 M dibasic sodium phosphate, 0.01 M monobasic sodium phosphate, and 0.002 M sodium citrate dihydrate, pH 7.2, in triple distilled water, to 36 L of triple distilled water. Tris buffer (3L) was made by adding 484 g Tris base, 119 g ethylenediaminetetraacetic acid (EDTA), 47 g sodium citrate dihydrate and 16 g sodium azide to 3L of triple distilled water, then adjusting the pH to 7.9. Tris detergent buffer (1L) was made by combining 2 mL of NP-40 (Cat. No. N-6507, Sigma Chemical Co., St. Louis, MO) with 998 mL Tris buffer.\n\n Other materials. The oocyte purification apparatus (Fig. 1) consisted of three chambers. Each chamber consisted of a stainless steel wire mesh container (Home Depot) suspended inside a buffer container set on an orbital shaker (shown in Fig. 1) or a rotary washing system with an internal agitator. The pore size of the wire mesh used to form the wire mesh containers in the first, second, and third chambers was 1000 pm, 500 um, and 150 um, respectively. Tubing connecting the chambers allowed fluid transfer from the buffer space external to the wire mesh of one chamber to a collection or holding carboy, or, alternatively, to the inside of the next succeeding downstream wire mesh container in a continuous flow process, as shown in Fig. 1. Peristaltic pumps are used to effect fluid movement within the tubing between chambers (as shown in Fig. I) or between the chambers and any collection carboys used (not shown in Fig. 1).\n\n Pig ovaries were obtained from pig slaughterhouses.\n\n Zona pellucida isolation. Porcine ovaries (5-6 Ibs.) were twice ground through a commercial meat grinder (Hobart), and the homogenate was collected. The homogenate and grinder were rinsed with 4L of saline buffer, and the homogenate solution was placed in the wire mesh container of the first chamber of the purification apparatus. The three buffer containers of the purification apparatus were filled with saline buffer. The shakers were operated at an orbital shaker rotation speed of about 20 revolutions per minute during the oocyte purification process. Periods of rotary agitation were alternated with periods of fluid removal from the region surrounding the mesh container.\n\n Filtered oocytes, together with a small amount of tissue, passed through the 1000 um mesh and were thus pumped from the buffer space of the first chamber into a collection carboy or into the wire mesh container in the second chamber. In purification procedures making use of a collection carboy, the filtered oocytes are subsequently pumped into the wire mesh container in the second chamber.\n\n With rotary agitation and new saline buffer addition, the oocytes were then passed through the 500 um mesh of the wire mesh container of the second chamber while the fibrous tissue remained in the mesh container. The oocytes and saline buffer were then pumped from the buffer space of the second chamber into a collection carboy or directly into the 150 um wire mesh container in the third chamber. Rotary agitation was continued in the third chamber and the solution surrounding the wire mesh (containing the oocytes) was removed.\n\n The solution containing the oocytes was then passed over a 75 um\n\n\n\nscreen (13/4 inches or 2/inches in diameter). The oocytes were collected on the 75 um screen and were then backwashed into a 100 mL beaker using Tris buffer.\n\n The 100 mL solution was divided into 2 x 50 mL vials and homogenized at 15,000 rpm for 3 to 5 minutes in a Powergen 700D (Fisher) homogenizer.\n\n The zona fragments were then poured onto a 13/4 inches or 2 1/2 inches diameter, 0.040mm (401lu) filter screen and washed with Tris detergent buffer. The zona fragments were removed from the screen by backwashing with Tris detergent buffer into a small polypropylene beaker, then incubated at 4°C with constant mechanical stirring to dissociate any undesired proteins, such as albumin. The zona material is preferably handled in polypropylene or siliconized glass beakers to prevent adherence to surfaces which results in loss of the material.\n\n After incubation and stirring, the zona fragments were again poured a 1 3/4 inch diameter, 0.040mm (40pm) filter screen and washed with Tris buffer to remove any protein contaminants. The zona fragments retained on the screen were collected by spooning or backwashing (using Tris buffer) into a small polypropylene beaker to a maximal volume of 25 mL. The beaker was covered and placed in a 75-76°C water bath and incubated for 20 minutes to solubilize the zona protein such that the temperature of the zona protein- containing solution was 73 1°C.\n\n \n\n After solubilization, the mixture was centrifuged at 21,000 rpm for 25 minutes or until a pellet was observed at the base of the tube. The supernatant was collected, and protein concentration was estimated. The supernatant was aliquoted (3mg/vial), lyophilized, and stored under N2 gas in a desiccator at 4°C. Typically about 1.5 mg to 1.9 mg of highly purified pZP protein per pound of ovaries can be produced, amounting to about 10 mg on a daily basis. Previous techniques produced only about 200-300 g quantities over a two day period. It is anticipated that this harvesting technique of the present invention can be increased to produce even greater amounts.\n\n \n\n Purity was demonstrated and confirme using two-dimensional sodium dodecyl sulfate polyacrylamide gel electrophoresis combined with Western blot analysis, silver staining, and, at times, Coomassie blue staining, using standard protocols. The preparation was tested for viral and bacterial contaminants at the Diagnostic Laboratory at the College of Veterinary Medicine at the University of Georgia.\n\n \n\n Example II. Preparation of pZP Vaccine The vaccine was prepared by homogenizing a concentrated oily adjuvant concentrate with an aqueous antigen solution containing isolated pZP glycoprotein. The oily adjuvant concentrate contained a surfactant, lecithin, and an immunostimulant, synthetic trehalose dicorynomycolate (SDTCM), in squalene oil. A typical adjuvant concentrate contained about 12% wt/vol (gram/100 mL) lecithin and about 25-50 mg/mL STDCM in squalene oil. The aqueous antigen solution contained the pZP glycoprotein preparation in saline or phosphate buffered saline (PBS) and Tween 80. When prepared for use in combination with an adjuvant concentrate to yield the vaccine composition, the aqueous composition typically contained 0.4% (vol/vol) Tween 80 and an amount of pZP calculated to yield a dose of about 200 g to about 400 llg per vaccination. Vaccine doses for dogs were about 1 mL in volume.\n\n \n\n Homogenizing was accomplished by combining adjuvant concentrate (to a final concentration of no greater than 10% vol/vol) with aqueous pZP solution and emulsifying using a Powerjam 700D homogenizer at 15,000 rpm for 6 minutes. The resulting emulsion is then homogenized with phosphate buffered saline (PBS) (containing 0.4% vol/vol Tween 80) at 20,000 for 8-12 minutes. The homogenization process resulted in a vaccine composition that is an oil-in-water emulsion or possibly a water-in-oil-in-water emulsion. While the inventors do not intend that the invention be bound by any particular scientific theory, it is believed that the STDCM, an amphiphilic glycolipid, partitions to the oil/water interfaces in the emulsion, and that the antigen is attracted to and associates with the STDCM at these interfaces.\n\n \n\n Example III. Immunosterilization of Dogs using pZP Vaccine Vaccinations. Four experimental dogs were vaccinated, and an FDA approved clinical trial has begun in which privately owned dogs in Clark and Walton Counties, Georgia, have also been vaccinated. To date, 43 dogs (four experimental dogs and 39 privately owned dogs) have been through the series of injections and have had serum antibody levels determined.\n\n Female dogs were vaccinated with 200 g of pZP per dose (I mL) in a vaccine adjuvanted with synthetic trehalose dicorynomycolate (STDCM, commercially available from RIBI Immunochem Co., Hamilton, MT) in squalene oil. The amount of STDCM per dose was about 2.5 mg. An adjuvant concentrate as described in Example II was provided by RIBI Immunochem Co., Hamilton, MT, and the vaccines were prepared as described in Example II. The dogs were vaccinated consecutive boosters (containing the same amount of pZP, 200 ug) administered at 30-day intervals. Under veterinary supervision, vaccinations were delivered to dogs intra-muscularly in the longissimus muscle (loin area), although subcutaneous vaccination is also acceptable. Follow up booster injections were administered on the contra-lateral side. No pain or adverse reactions were observed at the injection sites. In some cases boosters were administered subcutaneously with equivalent results.\n\n Antibody titers. Blood was drawn from each dog weekly, and serum antibody titers were determined using an enzyme linked immunosorbant assay (ELISA). Adjacent wells of a microwell plate were coated with 2 u. g pZP, and incubated for 6 hours. The wells were then blocked with 5% bovine serum albumin (Sigma Chemical Co., St. Louis, MO) in TBST (Tris-buffered saline + 5% Tween-20) and incubated overnight. Wells were then loaded with the primary antibody (canine serum) in TBST at a 1: 500 and 1: 1,000 dilution and incubated for 4 hours. The wells were then washed and loaded with 50 ul of the secondary antibody (rabbit anti-dog IgG) and incubated for 2 hours. Color change was observed after the addition of p-nitrophenyl phosphate for 30 minutes and the reaction terminated by the addition of 3 M NaOH. The optical density was read at a 405-492 nm range on a Spectramax spectrophotometer.\n\n \n\n The dogs pre-immune serum served as the negative controls.\n\n The ELISA trials (Fig. 2) revealed that there was a similar antibody profile in all eight dogs (experimental and clinical) characterized by a significant rise in antibody titers between the first and second booster. Antibody levels rose slightly after the initial vaccination and then significantly (p<0.05) after the first and second boosters. The rise in titer was the greatest in the clinical trial dogs (trials 2-5). These data clearly show that the there is a significant immune response to the pZP vaccine and synthetic adjuvant.\n\n Immunochemical and histochemical studies. The nature and extent of the immune response was investigated by performing histological and immunohistochemical studies on ovarian sections of the experimental dogs.\n\n Histological evaluation revealed that all tertiary follicles were significantly invaded by neutrophils. In these follicles all of the oocyte-granulosa cell complexes had been disrupted, and there were virtually no immunoreactive canine zona pellucida glycoproteins remaining in the ovary. Primary and secondary oocytes showed vacuolization and neutrophil infiltration.\n\nThe immunological response was further investigated by treating formalin fixed, paraffin embedded ovarian sections with anti-pZP antibodies raised in rabbits against highly purified pZP, and incubating for 1 hour. The sections were then treated with biotin-conjugated anti-rabbit IgG (Sigma Chemical Co., St. Louis, MO), followed by avidin-conjugated horseradish peroxidase (Sigma Chemical Co., St. Louis, MO). Finally, the sections were stained with diaminobenzidine and counterstained with Mayer's hematoxylin. In the vaccinated dogs, the integrity of all ovarian follicles was found to have been breached, and no immunodetectable zona material was present on the ovarian sections. In contrast, normal dog ovaries have distinct oocytes with a zona pellucida. These results suggest that canine sterility was achieved as a result of destruction of all ovarian follicles.\n\n None of the vaccinated dogs have shown any abnormal estrus cycles. Moreover, the vaccine is effective in pre-pubertal dogs, suggesting that if dogs are sterilized before their first estrus, their chances of developing mammary cancer or uterine infections are virtually zero.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/cn/ottimmunosterilization25sep09.shtml", "http://www.soroswatch.com/", "http://www.mathaba.net/0_index.shtml?x=90207", "http://www.timesonline.co.uk/tol/news/world/us_and_americas/article6350303.ece", "http://www.bibliotecapleyades.net/exopolitica/esp_exopolitics_G_3.htm", "http://www.bibliotecapleyades.net/sociopolitica/secretsoc_20century/secretsoc_20century10.htm#CHAPTER%2056", "http://www.bibliotecapleyades.net/esp_sociopol_mediacontrol.htm", "www.SorosWatch.com"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}