{"result_id": "105031", "URL": "https://educate-yourself.org/cn/mercuryvaccinesandmedicine13dec04.shtml", "timestamp": "2023-04-25 15:02:02 CEST+0200", "meta": {"description": "Dec. 13, 2004. Medicine today is more and more frequently described in terms of science. With the origin and development of drugs and surgical techniques modern medicine has thought itself to be evermore exact and evermore resembling the hard sciences of chemistry and physics. We would all like to think that medicine today is based on rock solid assumptions that stand the test of time. But since the 1930s medical science began a process of self-deception when it began relying on drug trials and 'studies' that were easily manipulated by conflicts of interests whose driving motive was the making of profit. Conflicts of interest may be very diverse in their character and effects but nowhere is the effect more nightmarish than in this story about mercury in vaccines.", "lang": "en", "keywords": "Mark Sircus Ac., OMD, Director International Medical Veritas Association,  (IMVA),", "favicon": "", "canonical": "https://educate-yourself.org/cn/mercuryvaccinesandmedicine13dec04.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Mercury, Vaccines and Medicine", "cleaned_text": "( Below is the first page and a half of a chapter published in July of this year by the IMVA on vaccines. Directly below that is addendum material added December 12, 2004 which presents some late breaking news and insights into the entire mercury question. )\n\n \n\n Medicine today is more and more frequently described in terms of science. With the origin and development of drugs and surgical techniques modern medicine has thought itself to be evermore exact and evermore resembling the hard sciences of chemistry and physics. We would all like to think that medicine today is based on rock solid assumptions that stand the test of time. But since the 1930s medical science began a process of self-deception when it began relying on drug trials and 'studies' that were easily manipulated by conflicts of interests whose driving motive was the making of profit. Conflicts of interest may be very diverse in their character and effects but nowhere is the effect more nightmarish than in this story about mercury in vaccines.\n\nOnly weeks after the IOM came out with their report in early 2004, stating that thimerosal is not connected in any way with autism, Columbia University researchers reported, “The mercury preservative used in some vaccines can cause behavioral abnormalities in newborn mice characteristic of autism, but only in mice with a specific genetic susceptibility.”[ii] These researchers’ findings challenge directly the statements of the IOM and the CDC, who are insisting that mercury is safe to use in vaccines. Dr. Steven Goodman of the Johns Hopkins School of Medicine, a member of the IOM commission that prepared the report, said those on the commission were aware of the research from Colombia University, published in the journal Molecular Psychiatry. Dr. Julio Licinio of UCLA, the editor of this medical journal said, \"I believe this has enormous implications for public health. Showing that genetic background impacts on the outcome of thimerosal exposure is a major breakthrough.” He added that the study clearly showed that there was a link between vaccines and autism \"for some groups and not for others.\"[iii]\n\nDr. Horning, Dr. Chian and Dr. Lipkin of the Department of Neurology and Pathology at Colombia University College of Physicians and Surgeons dismiss the CDC’s conclusion that thimerosal is safe and has nothing to do with autism. They state very clearly, “The developing brain is uniquely susceptible to the neurotoxic hazard posed by mercurials.”[v] They demonstrated that, “Autoimmune disease-sensitive SJL/J mice showed growth delay; reduced locomotion; exaggerated response to novelty; and densely packed hyperchronic hippocampal neurons with altered glutamate receptors and transporters.” The mice were exposed to thimerosal doses and timing equivalent to the pediatric immunization schedule. They found, “Profound behavioral and neuropathologic disturbances were observed after postnatal thimerosal in SJL/J mice, but not in strains without autoimmune sensitivity.” This study, and many others that back up its findings, was not enough to deflect the IOM and the CDC from approving new vaccines for the childhood vaccine program that contain thimerosal.\n\nMercury has been known to be hazardous for literally hundreds of years, and its dangers have been well documented. Thousands of parents have reported biological and neurodevelopment changes in their children directly following administration of mercury-containing vaccines with a broad range of symptoms, including sudden onset of shyness, GI distress, loss of motor skill function, allergies, the inability to speak, tremors and autonomic disturbances, all which mimic those associated with mercury poisoning.[vi]\n\nBy the end of 2004 yet another new study lays waste to the medical establishments official position that the mercury in thimerosal containing vaccines is safe. Led by Dr. Jill James of the University of Arkansas, the study found that 20 autistic children had less glutathione, an antioxidant that helps rid the body of toxic metals, when compared to a sample of healthy children. A glutathione deficit could leave children vulnerable to toxic substances, including mercury, and \"may contribute to the development and clinical manifestation of autism,\" concluded the report, published in the December issue of the American Journal of Clinical Nutrition.\n\nGluthathione is a small molecule found in almost every cell. The rate at which glutathione can be made by the cells depends on the availability of cysteine. The amino acid cysteine has a sulfur-containing portion which gives the whole glutathione molecule its ability to protect cells from free radicals and heavy metals, which when left unchecked, damage and destroy cells. According to Dr. Patricia Kongshavn, former professor, department of medicine at McGill University, “Glutathione is a very important detoxifying agent, enabling the body to get rid of undesirable toxins and pollutants. It forms a soluble compound with the toxin that can then be excreted through the urine or the gut. The liver and kidneys contain high levels of glutathione as they have the greatest exposure to toxins. The lungs are also rich in glutathione partly for the same reason. Many cancer-producing chemicals, heavy metals, drug metabolites etc. are disposed of in this way.”\n\nDr. Kongshavn goes on to say, “Glutathione is also required in many of the intricate steps needed to carry out an immune response. It is needed for the lymphocytes to multiply in order to develop a strong immune response, and for killer lymphocytes to be able to kill undesirable cells such as cancer cells or virally infected cells. The importance of glutathione cannot be overstated. It has multiple roles as indicated and, indeed, as one examines each system or organ more closely, the necessity for glutathione becomes increasingly evident. Glutathione values decline with age and higher values in older people are seen to correlate with better health, underscoring the importance of this remarkable substance for maintaining a healthy, well-functioning body.”\n\nWhat Dr. Jill James did not report is that the mercury toxicity itself is leading to declining glutathione production through an attack on cysteine and the all important sulfur-containing portion of the glutathione molecule. It is very important to pay attention to the fact that sufur bonds are the preferred targets of both mercury and lead.\n\nMercury binds most easily to sulfhydryl groups within proteins in the body. The sulfhydryl groups within cystein function to form “cross-links” or disulfide bridges between two cysteins as we can see in the diagram above. In general these vital cross-links are what give proteins their three dimensional structure essential for their biochemical activity. As we will see in the chapter on diabetes the hormone insulin and its receptor sites in the cells also have these disulfide bridges that mercury comes in and destroys. Essentially what this report is pointing to is that children with low gluthatione counts are more vulnerable to thimerosal in vaccines.\n\nWhat will become clear as researchers zero in on such fundamentals of body chemistry is that mercury attacks the very biochemical defence mechanisms responsible for eliminating and cleaning the cells of mercury. It is one of the very essence reasons mercury is capable of doing such damage, why it earns its title of being the most potent non-radioactive poison. The medical establishment lost all sense of reason when it came to using thimerosal in vaccines and has not a leg to stand on in defending its use. Having never proven its safety in all the long years of its use, the medical establishment, and especially the medical elite are literally destroying all semblenses of their integrity on this issue.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["mailto:director@imva.info", "http://www.imva.info", "http://www.worldpsychology.net", "http://www.nature.com", "http://www.latimes.com/news/science/la-sci-autism9jun09,1,5059086.story?coll=la-news-science", "http://proliberty.com/observer/20040602.htm"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}