{"result_id": "105024", "URL": "https://educate-yourself.org/vcd/forcedvaccinationinjunctionsought22jul09.shtml", "timestamp": "2023-04-25 15:01:58 CEST+0200", "meta": {"description": "July 22, 2009. Editor's Note: I can only HOPE that the Sheeple, that great mass of humanity who go about their daily lives utterly oblivious to the growing menace of the New World Order's Takeover and Takedown agendas, wake up in time to take action in their own interest to save their lives, their children's lives, and the lives of those to come. The individuals named in this complaint are DEAD SERIOUS about their intentions to FORCE everyone in this country to take \"Swine Flu\" vaccinations and they intend to fine you $250,000 if you don't cooperate with them and eventually put you into a FEMA concentration camp in order to \"quarantine\" you against a non-existent bio-weapon \"pandemic\". The individuals named in this complaint are ALL Rockefeller/Rothchild New World Order agents and minions who will do EXACLY what they are told to do, regardless of the cost to human life and health.", "lang": "en", "keywords": "educate-yourself.org, forced vaccinations, swine flu pandemic, janet napolitano, homeland security, swine flu hoax, genocide, ingri cassel, don nicoloff, ken adachi, dr rebecca carley, de a true ott, dr bill deagle, carmen reynolds, INJUNCTION AGAINST FORCED VACCINATION WITH MEXICAN A H1N1 VACCINE TO FILE AT USA DISTRICT ATTORNEY OFFICES -- STATE AND FEDERAL COURTS -- APPROPRIATE PROVINCIAL AND FEDERAL COURTS OF CANADA AND OTHER W, vaccine dangers, gary null,", "favicon": "", "canonical": "https://educate-yourself.org/vcd/forcedvaccinationinjunctionsought22jul09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Injunctions Sought to Stop Forced Swine Flu Vaccination Juggernaut (July 22, 2009)", "cleaned_text": "[Editor's Note: I can only HOPE that the Sheeple, that great mass of humanity who go about their daily lives utterly oblivious to the growing menace of the New World Order's Takeover and Takedown agendas, wake up in time to take action in their own interest to save their lives, their children's lives, and the lives of those to come. The individuals named in this complaint are DEAD SERIOUS about their intentions to FORCE everyone in this country to take \"Swine Flu\" vaccinations and they intend to fine you $250,000 if you don't cooperate with them and eventually put you into a FEMA concentration camp in order to \"quarantine\" you against a non-existent bio-weapon \"pandemic\". The individuals named in this complaint are ALL Rockefeller/Rothchild New World Order agents and minions who will do EXACLY what they are told to do, regardless of the cost to human life and health.\n\nUnderstand that these \"people\" are TRAITORS in the fullest sense of the word, to both the supreme right of people to decide for themselves what will or will not go into their blood streams, but also to ALREADY ESTABLISHED constitutions, Bill of Rights, rule of law, and treaty guarantees which PROHIBIT any government body from FORCING decisions upon your body AGAINST your will.\n\nDespite those prohibitions, these Illuminated swine go forward anyway, and try to convince the Sheeple that their UNDEBATED, and NON CITIZEN-APPROVED edicts referred to as \"Presidential Directives\", or \"The Model State Emergency Health Powers Act\" or \" the National Emergency Act\" are the \"law\" of the land and must be obeyed. These are NOT legitimate laws, as they are in total violations of our Constitution and international (E.g. Neuremberg) treaty agreements . They are FRAUDULENTLY acting under the color of law.\n\nIt's time for the thousands of lawyers, para-legals, teachers, doctors, dentists, nurses, university professors, insurance salesmen, housewives, policemen, firemen, waiters, store clerks, auto mechanics, and other ordinary citizens of this country to GET INVOLVED and stop waiting for the same handful of people who have been trying to warn the public of this impending abomination, do all the work and \"save\" them. It's NOT going to happen. Dr. A. True Ott, Dr. Rebecca Carley, Carmen Reynolds, and Dr Bill Deagle are NOT going to stop this Juggernaut. THOUSANDS of people must bring legal action and confront those who would attempt to enforce these \"mandatory\" acts of GENOCIDE.\n\nThe purpose behind the ELEVEN years of chemtrail spraying was to soften up and compromise the immune systems of all who have been breathing those poisons and absorbed that which got into the water or on crops. In earlier years, I had wondered how they were going to attempt to distribute their killer pathogens-- either by aerosol spraying or contaminating the water or food, I thought . But I now see that they want to INSURE your demise by DIRECTLY INJECTING you with their bio-weaponized pathogens and eliminate any chance of you escaping their genocidal agenda.\n\nPlease abandon any remaining naivety you may still cling to about the TRUE intentions behind forced \"vaccinations\" for a non-existent \"pandemic\", They want to infect you with a NON-CURABLE disease, such as the quarter million Gulf War I vets who HAVE ALREADY DIED from Gulf War Syndrome given to them via VACCINATIONS. Those American servicemen were used as GUNIEA PIGS to test how well their mycoplasma bio-weaponize pathogens and Squalene adjuvant would \"work.\".\n\nDownload Don Nicoloff's July 21, 2009 Interview with Ingri Cassel of www.vaclib.org about the Forced Vaccinations Coming this Fall \n\n http://educate-yourself.org/vcd/July 21 2009 IngriC Evident_Footprints_2009-07-21.mp3\n\nWAKE UP and GET INVOLVED. It's YOUR life that is at stake. Fight! ....Ken Adachi]\n\nINJUNCTION AGAINST FORCED VACCINATION WITH MEXICAN A H1N1 VACCINE TO FILE AT USA DISTRICT ATTORNEY OFFICES -- STATE AND FEDERAL COURTS -- APPROPRIATE PROVINCIAL AND FEDERAL COURTS OF CANADA AND OTHER WESTERN NATIONS -- TEAM OF JANE BURGERMEISTER -- DR TRUE OTT PhD ND -- DR REBECCA CARLEY -- ALEXANDER S JONES NIH WHISTLEBLOWER -- CARMEN REYNOLDS -- DR BILL DEAGLE MD -- WITH LEGAL ADVISERS June 22, 2009 \n\n\n\nA. Plaintiffs, known as AA, BB and CC, #1 through #X, bring this action on behalf of themselves and all other similarly situated individuals, against the Defendants President Barack Obama, President of the United States, David Nabarro, UN System Coordinator for Influenza, Margaret Chan, Director-General of World Health Organisation, Kathleen Sibelius, Secretary of Department of Health and Human Services (HHS), Secretary Janet Napolitano, the Department of Homeland Security, and Dr. Margaret Hamburg, newly confirmed Commissioner, Food and Drug Administration, seeking temporary and permanent injunctive relief from the government, UN?s, WHO?s, DHS's and HHS?s swine flu and other pandemic flu vaccination or other medication programs, as well as a declaratory judgment that those provisions of The Model State Emergency Health Powers Act, the National Emergency Act, NATIONAL SECURITY PRESIDENTIAL DIRECTIVE/NSPD 51 and HOMELAND SECURITY PRESIDENTIAL DIRECTIVE/HSPD-20, International Partnership on Avian and Pandemic Influenza, or any other presidential waiver or directive or international law or act that abolishes or modifies the primacy of the US Preamble, Constitution and Bill of Rights, and restricts the civic rights assigned to citizens thereby , including military personnel, to refuse a vaccination, classified as a bioweapon by the government's own definition, and is being administered to United States federal employees is in violation of federal law . Plaintiffs seek this relief pursuant to the Administrative Procedures Act, 5 U.S.C. 551, et seq., the Federal Declaratory Judgment Act, 28 U.S.C. 2201 and the All Writs Act, 28 U.S.C. 1651.\n\n1. Plaintiffs are citizens of the United States of America, and will be imminently ordered to submit to untested \"swine flu\" and other similar pandemic vaccines including \"bird flu\", which are classified by the US government as bioweapons, without their consent pursuant to the Model State Emergency Health Powers Act, National Emergency Act, NATIONAL SECURITY PRESIDENTIAL DIRECTIVE/NSPD 51 and HOMELAND SECURITY PRESIDENTIAL DIRECTIVE/HSPD-20, and the International Partnership on Avian and Pandemic Influenza after the World Health Organisation declared a pandemic level 6 on June 11th. Plaintiffs expect President Obama to impose martial law and deploy FEMA and the Department of Homeland Security \"Pandemic Task Forces\" any hour now that WHO has declared an official pandemic level 6. They expect their State Governor to be imminently notified that the provisions of the Model State Emergency Health Powers Act (MSEHPA) will be implemented in their state. Provisions therein mean that Americans must consent to mass vaccinations or forced relocation to a prepared \"quarantine compound\", or be guilty of a felony crime . Similarly situated individuals including everyone whose current residence is the United States of America, who have been ordered, or will imminently be ordered, to take the vaccinations, classified by the US government as bioweapons, in the event of a pandemic level 6 being declared by the World Health Organisation in Geneva or on another government declaration.\n\n \n\n 2. Defendant President Barack Obama, who as part of his Office, will oversee the implementation of the International Partnership on Avian and Pandemic Influenza, which would give primacy to the World Health Organisation (WHO) and United Nations over US law and government agencies in the event of a pandemic being declared. President Obama has also requested a $1.5 billion emergency appropriation to deal with swine flu, including development of a vaccine.\n\n \n\n 3. Defandant David Nabarro, who as Senior U.N. system influenza coordinator will implement an emergency response plan in the event of a declared pandemic on US territoriy operating through authorities under the WTO, North American Free Trade Agreement and the U.N. Food and Agriculture Organization, and taking precedence over US government agencies and law .\n\n \n\n 4. Defandant WHO, the organisation responsible for coordinating the global response, including the US response, to the \"swine flu\" and other pandemics.\n\n\n\n5. Defendant HHS is in the process of working with vaccine manufacturers to facilitate production of pilot vaccine lots for both H5N1 and H9N2 strains as well as contracting for the manufacturing of H5N1 vaccine. The HHS recently awarded contracts to Novartis AG worth $289 million; Sanofi Aventis SA for $191 million, and GlaxoSmithKline PLC for $181 million to produce H1N1 vaccine ingredients. HHS said it is also talking to additional manufacturers to find more capacity.\n\n\n\n6. Defendant DHS has prepared pandemic flu guidelines, including the National Strategy To Safeguard Against The Danger Of Pandemic Influenza (White House) and will coordinate between government officials and the public health, medical, veterinary, and law enforcement communities, as well as the private sector in the event of a declared pandemic.\n\n\n\n7. Defendant Department of Health and Human Services (\"HHS\") through its agent, Defendant Food and Drug Administration (\"FDA\"), is the federal agency responsible for licensing and quality control of drugs and biologic products, such as \"swine flu\" and other pandemic vaccines.\n\n\n\n8. The FDA is responsible for promulgating federal regulations that describe what makes a drug or vaccine an \"IND\" and how a drug is placed in IND status.\n\nJURISDICTION AND VENUE\n\n 9. There is a legitimate matter in controversy between the named parties because Plaintiffs claim that any pandemic flu vaccine is a) classed as a \"bioweapon\" according to the US government's own documents (see Attachment 1), b) the vaccine companies tasked with producing the vaccine have been involved in the activities of the type typical of bioweapons, including developing weapnized viruses, releasing them into the general public (Baxter, Austria), deliberate contamination of vaccines resulting in death and injury and designing trials of vaccine to cause death and injury (Novartis) and there is a high probability the vaccines will be cause injury or death, and c) the government is acting unconstituutionally and illegally in compelling them to take an injection of a substance classified as bioweapon d) in criminalising a refusal, and e) in waiving their right to claim compensation in the event of injury or damage, and f) by misusing them as \"vectors\" to spread the pandemic because the act of mass vaccination, that is to say, forced injections of of toxins under guise of offering prophylactic treatment into the population is the process, which will itself allow the virus to mutate and release a fully weaponized virus.\n\n\n\n10. Plaintiffs will suffer substantial and irreparable injury if they are forced to take the unproven vaccine, classified as a bioweapon by the government's own definition, and cite the fact that the government has introduced legislation to bar from financial compensation or legal redress in violation of Constitutional law as evidence of the government's intent.\n\n \n\n 11. In the event of a pandemic level 6 being declared, the Plaintiffs will also loose their civic rights guaranteeed by the Preamble, Constitution and Bill of Rights and will find themselves under a \"foreign\" government with the UN and WHO in control.\n\n\n\n12. Plaintiffs note a court case brought in the 1970's against vaccination by Ida Honorof and Eleanor McBean was dismised by the judge on the grounds that they would only have standing if they \"took a shot and dropped dead\" . Plaintiffs contend that if they are killed as a result of a vaccination injection, they will not be alive to claim standing, so making their right to standing de facto null and void, and any such judgement illegal.\n\n\n\n13. Jurisdiction is proper in this Court under the Administrative Procedures Act, 5 U.S.C. \" 702, and under 28 U.S.C. \" 2201, which states that actions involving controversies with federal agencies may be pursued in any United States District Court, and under 28 U.S.C. 1331 and\n\n 1346.\n\n\n\n14. Jurisdiction on infectious diseases is proper to this Court.\n\n\n\n15. Jurisdiction on the development, production, and stockpiling of biological and toxin weapons is proper to this court.\n\nA. The Model State Emergency Health Powers Act, the NATIONAL SECURITY PRESIDENTIAL DIRECTIVE/NSPD 51 and HOMELAND SECURITY PRESIDENTIAL DIRECTIVE/HSPD-20 and other laws.\n\n1. The Model State Emergency Health Powers Act adopted in 38 States makes it a misdemeanor to a felony to refuse to take a vaccine mandated by the federal government and/or other affiliated bodies if the government officially declares a pandemic . Law enforcement officers are allowed to use deadly force against felony suspects. For the specific versions of that Act enacted in each individual state.\n\n\n\n2. The \"Model State Emergency Heath Powers Act\" allows the Government to seize and/or quarantine a town and all the people within it. \n\n\n\n3. Once a town is quarantined, the government is allowed to seize all property and seize the rights of the people to resist government i.e. confiscating all civilian owned firearms. \n\n \n\n http://www.publichealthlaw.net/MSEHPA/MSEHPA%20Surveillance.pdf\n\n (Model State Emergency Health Powers Act)\n\n \n\n http://www.pandemicflu.gov/plan/states/stateplans.html\n\n4. People who suffer death or injury as a result of a government-mandated vaccine will be barred from seeking compensation under provisions of the laws and acts.\n\n5. Section 63, Vaccination and Treatment of The Model State Emergency Health Powers Act, A Checklist of Issues, indicates those unwilling to submit to a vaccine will be subject to isolation or quarantine. http://educate-yourself.org/vcd/NCSLmodelact.pdf\n\n6. Mandatory vaccine simulation drills are planned for at least three states including Texas, Ohio and Alaska. (Maloney, County plans to deal with unthinkable, 2009) http://www.seguingazette.com/story.lasso?ewcd=7067c6003405a409\n\n7. The Massachusetts Legislature is fast-tracking legislation for Martial Law and mandatory vaccines in response to the current \"swine flu outbreak\". (AP, 2009)\n\n http://news.bostonherald.com/news/politics/view/2009_04_28_Mass__Senate_approves_pandemic_flu_prep_bill/\n\n\n\n8. Under the National Emergency Act, the President \"may seize property, organize and control the means of production, seize commodities, assign military forces abroad, institute martial law, seize and control all transportation and communication, regulate the operation of private enterprise, restrict travel, and, in a variety of ways, control the lives of United States citizens.\"\n\n\n\n9. NSPD-51/ HSPD-20 have created the position of National Continuity Coordinator without any specific act of Congress authorizing the position. \n\n\n\n10. NSPD-51/ HSPD-20 appears to negate any a requirement that the President submit to Congress a determination that a national emergency exists, suggesting instead that the powers of the executive order can be implemented without any congressional approval or oversight. http://www.dhs.gov/xabout/laws/gc_1219263961449.shtm#1\n\n\n\n11. NATIONAL SECURITY PRESIDENTIAL DIRECTIVE/NSPD 51 and HOMELAND SECURITY PRESIDENTIAL DIRECTIVE/HSPD-20 allows the governors in each state to suspend the government and law and, among other things, confiscate and destroy facilities and resources in the interest of the public health without compensation to the owners, per Article IV Section 402(a). The State Legislatures are barred from intervening for a period of 60 days. \n\n\n\n12. Any physician or other health care provider who refuses to perform medical examination or vaccinations as directed shall be liable for delicensure and the inability to continue to practice in the State .\n\n13. t he Act criminalizes refusal of medical treatment, making citizens liable for a misdemeanor if they refuse mandatory vaccines , per Article V Section 504(b). The Act gives the public health authority the right to isolate or quarantine a person on an ex parte court order, with no hearing for at least 72 hours. If the public health authority decides that an unvaccinated person is a risk to others, even if uninfected, he could be quarantined, per Article V Section 503(e).\n\n14. The Act removes the States accountability for harm or deaths resulting from mandatory vaccines citing the state immunity clause : \"Neither the State, its political subdivisions, nor, except in cases of gross negligence or willful misconduct, the Governor, the public health authority, or any other State official referenced in this Act, is liable for the death of or any injury to persons, or damage to property, as a result of complying with or attempting to comply with this Act or any rule or regulations promulgated pursuant to this Act,\" per Article VIII Section 804.\n\n15. President Bush announced a new International Partnership on Avian and Pandemic Influenza to a High-Level Plenary Meeting of the U.N. General Assembly, in New York on Sept. 14, 2005. The 2005 plan, operative until Bush announced the International Partnership on Avian and Pandemic Influenza, directed the State Department to work with the WHO and U.N.\n\n16. The Security and Prosperity Partnership of North America Summit in Canada released a plan that establishes U.N. law along with regulations by the World Trade Organization and World Health Organization as supreme over U.S. law during a pandemic and sets the stage for militarizing the management of continental health emergencies.\n\n17. the SPP plan gives primacy for avian and pandemic influenza management to plans developed by the WHO, WTO, U.N. and NAFTA directives not to decisions made by U.S. agencies.\n\n18. the U.S. Northern Command, or NORTHCOM, has created a web page dedicated to avian flu and has been running exercises in preparation for the possible use of U.S. military forces in a continental domestic emergency involving avian flu or pandemic influenza.\n\n19. All 194 nation-states (members of U.N.) had until June 2007 to implement the WHO revised International Health Regulations (IHR) -- revised in 2005, which included passage of legislation empowering state surveillance and monitoring of their citizens under the guise of a potential worldwide pandemic (smallpox, polio, SARS or human cases of new strains of influenza). Stockpiling specific vaccines and anti-viral medications are part of compliance with IHR.\n\n20. The U.N.-WHO-WTO-NAFTA plan advanced by SPP features a prominent role for the U.N. system influenza coordinator as a central international director in the case of a North American avian flu or pandemic influenza outbreak.\n\n21. in Sept. 2005, Dr. David Nabarro was appointed the first U.N. system influenza coordinator, a position which also places him as a senior policy adviser to the U.N. director-general. Nabarro joined the WHO in 1999 and was appointed WHO executive director of sustainable development and health environments in July 2002.\n\n22. In a Sept. 29, 2005, press conference at the U.N., Nabarro made clear that his job was to prepare for the H5N1 virus, known as the avian flu.He quantified the deaths he expected as follows: \"I'm not, at the moment at liberty to give you a prediction on numbers, but I just want to stress, that, let's say, the range of deaths could be anything from 5 to 150 million.\"\n\n\n\n23. The National Security and Homeland Security Presidential Directive, signed on May 9, 2007 declares that in the event of a \"catastrophic event\", George W. Bush can become what is best described as \"a dictator\":\n\n\"The President shall lead the activities of the Federal Government for ensuring constitutional government.\"\n\nThis directive gives the White House unprecedented dictatorial power over the government and the country, bypassing the US Congress and obliterating the separation of powers. The directive also placed the Secretary of Homeland Security in charge of domestic \"security\".\n\n (1) this directive establishes a comprehensive national policy on the continuity of Federal Government structures and operations and a single National Continuity Coordinator responsible for coordinating the development and implementation of Federal continuity policies. This policy establishes \"National Essential Functions,\" prescribes continuity requirements for all executive departments and agencies, and provides guidance for State, local, territorial, and tribal governments, and private sector organizations in order to ensure a comprehensive and integrated national continuity program that will enhance the credibility of our national security posture and enable a more rapid and effective response to and recovery from a national emergency.\n\n\n\n24.(b) \"Catastrophic Emergency\" means any incident, regardless of location, that results in extraordinary levels of mass casualties, damage, or disruption severely affecting the U.S. population, infrastructure, environment, economy, or government functions.?\n\n25. The World Health Organization (WHO) is a specialized agency of the United Nations (UN) that acts as a coordinating authority on international public health. Established on 7 April 1948, and headquartered in Geneva, Switzerland, the agency inherited the mandate and resources of its predecessor, the Health Organization, which had been an agency of the League of Nations.\n\n\n\n26. The WHO's constitution states that its objective \"is the attainment by all peoples of the highest possible level of health.\"\n\n\n\n27. The WHO and UN will become the controlling agencies in the US in the event of a declared pandemic level 6.\n\n\n\n28. The World Health Organization (WHO) has developed a global influenza preparedness plan, which defines the stages of a pandemic, outlines WHO's role and makes recommendations for national measures before and during a pandemic.\n\nJournalist Files Charges against WHO and UN for Bioterrorism and Intent to Commit Mass Murder \n\n http://www.naturalnews.com/026503_pandemic_swine_flu_bioterrorism.html\n\nFrom: Martha Rose Crow <greathierophant@yahoo.com>\n\n To: Roland Michel Tremblay <rm@themarginal.com>, Roland Michel Tremblay <my.holmes@gmail.com>\n\n Subject: A UNIVERSAL DECLARATION OF RESISTANCE TO MANDATORY VACCINATIONS\n\n Date: Jul 23, 2009\n\nHey Everybody: Please read this carefully while you still have breath in you and then please pass it along to your list. The secret serpent puppet-masters of the world are going to kill a whole bunch of us in a few months if we don't stand up to them RIGHT NOW! ~Martha\n\nWe the undersigned, as Freemen & Freewomen, do not recognize the authority of The World Health Organization (WHO) to mandate general forced vaccinations. Our bodies are sovereign territory and subject to our exclusive self-determination. Any attempted violation of this trust must be construed as a breach of said basic right. We are thus holding our elected Governments accountable in this defense with an issuance of notice: a preemptive Class Action Lawsuit to be served in the event our inalienable rights to choose are forsaken.\n\nWORLD HEALTH ORGANIZATION checklist for influenza pandemic preparedness planning: Section 1.5.1 Legal and ethical issues -\n\n 'During a pandemic, it may be necessary to overrule existing legislation or (individual) human rights. Examples are the enforcement of quarantine (overruling individual freedom of movement), use of privately owned buildings for hospitals, off-license use of drugs, compulsory vaccination or implementation of emergency shifts in essential services. These decisions need a legal framework to ensure transparent assessment and justification of the measures that are being considered, and to ensure coherence with international legislation (International Health Regulations).\n\n \n\n http://www.who.int/csr/resources/publications/influenza/FluCheck6web.pdf\n\nThere is no forensic evidence showing the H1N1 virus as the direct cause of death in those who have died after contracting the virus (144 to date). The majority of deaths are caused by pre-existing complications and auto-immune deficiencies. Countries with low quality of health have the greatest number of fatal cases. Based on the Center for Disease Control's own guidelines H1N1 related symptoms are virtually indistinguishable from those of the common seasonal flu, and severity is comparable to mild seasonal flu,\n\n'The symptoms of this new H1N1 flu virus in people are similar to the symptoms of seasonal flu and include fever, cough, sore throat, runny or stuffy nose, body aches, headache, chills and fatigue. A significant number of people who have been infected with this new H1N1 virus also have reported diarrhea and vomiting. The high risk groups for novel H1N1 flu are not known at this time but it's possible that they may be the same as for seasonal influenza. People at higher risk of serious complications from seasonal flu include people age 65 years and older, children younger than 5 years old, pregnant women, people of any age with chronic medical conditions (such as asthma, diabetes, or heart disease), and people who are immunosuppressed (e.g., taking immunosuppressive medications, infected with HIV).'\n\n \n\n http://www.cdc.gov/h1n1flu/sick.htm\n\n \n\n GlaxoSmithKline are the major Pharmaceutical developers behind the H5N1 Avian Flu vaccine. Given the fact the new H1N1 strain is an Avian/Swine/Human hybrid it is likely this component will be used as part of the 3 shot regime,\n\n'GSK's proprietary adjuvant is called ASO4. It contains alum and MPL. MPL stands for monophosphoryl lipid A. The U.S. Army's proprietary (unlicensed) adjuvant developed prior to the first Gulf War for use in a second generation anthrax vaccine was called Tri-Mix or Triple Mix. Tri-Mix contained MPL (monophosphoryl lipid A) and squalene. After the war, Army scientists considered MPL to be too toxic, so they began working with Chiron Corporation of Emeryville, CA to develop an adjuvant that contained squalene and water only ... On the assumption that adjuvant toxicity with Tri-Mix was due to MPL. This assumption also proved incorrect. There are more than two dozen animal studies that generated data demonstrating squalene's ability to induce autoimmunity; and there is disputed evidence that nanodoses of squalene in anthrax vaccine sickened countless military personnel who received squalene-tainted vaccine during AVIP. MPL was also a component of the Ribi Adjuvant System. The Ribi Adjuvant System, or RAS, is a derivative of Tri-Mix, which is approved for use in animals only. There is no existing data showing whether MPL elicits an immune response specific to it. If MPL is immunogenic, it raises the possibility of a dangerous \"cross reaction.\" The human body is full of lipids. Antibodies and immune cells responding to MPL might also respond to other lipids in the body, thus breaking tolerance for endogenous lipids (those native to the human body) and initiating autoimmunity.' Gary Matsumoto - Journalist/Author of Vaccine A\n\n http://www.whale.to/vaccine/secret_adjuvant.html\n\nThe risk of a widespread outbreak of Gulf War Syndrome amongst the general population is inevitable - assuming the same H5N1 squaline adjuvant is utilized on H1N1 (Adjuvants are pharmacological or immunological agents that modify the effect of other agents). Further the vaccine administered produces little antibody response. Therefore it requires 12 times the normal dose in order to be 'effective'. Such a gamble where our lives are concerned is non-negotiable.\n\nPharmaceutical Companies (Novartis among others) stand to reap a huge windfall during such a crisis. We are not willing to wager our safety for Industry profits under any conditions,\n\n'The swine flu outbreak is going to benefit one of the most prolific and successful venture capital firms in the United States: Kleiner, Perkins, Caufield & Byers. Share prices have already risen for two of eight public traded companies in the firm's portfolio of Pandemic and Bio Defense investments. BioCryst, up more than 26 percent, to $2.21 per share, and Novavax, maker of viral vaccines, escalated 75 percent to $1.42 per share on the first announcement of the swine flu outbreak in Mexico.'\n\n http://drtenpenny.com/swine_flu.aspx\n\nThe lack of sufficient testing on this experimental vaccine raises many concerns. There is no criteria on its efficacy or valid statistics to speak of,\n\n 'Novavax uses genetic information and \"recombinant, virus-like particle technology\" to rapidly engineer a vaccine. Its technology has only been through Phase II clinical trials but might be released prematurely. Novavax's CEO, Rahul Singhvi announced Friday, \"There is an emergency authorization avenue that is available that would allow us to use the vaccine in an emergency without further testing.\" The Division-E provisions would protect the company from all liability.'\n\nH1N1 is an entirely unique strain, never seen before with all the hallmarks of a laboratory-produced designer virus,\n\n'Author of Emerging Viruses: AIDS And Ebola: Nature, Accident or Intentional?, Horowitz says the swine-bird-human flu strain, reported to be found first in Mexico in late-March 2009, could have only come from Dr James S. Robertson and his colleagues in association with the US Centre for Disease Control and vaccine manufacturer Novavax, Inc, which was ready to profit from the release he says. Nobody else takes H5N1 Asian-flu infected chickens, takes them to Europe, extracts their DNA, combines their proteins with H1N1 viruses from the 1918 Spanish flu isolate, additionally mixes in some swine-flu genes from pigs, then reverse engineers them to infect humans, he said.\n\n http://uncensored.co.nz/2009/04/30/dr-horowitz-mexicanswine-flu-made-in-lab/\n\nDuring the 1976 Swine scare the Swine Flu vaccine itself killed hundreds & sickened countless others,\n\n'Only young Lewis (19-year-old Pvt. David Lewis of Ashley Falls, Mass) died from the swine flu itself in 1976. But as the critics are quick to point out, hundreds of Americans were killed or seriously injured by the inoculation the government gave them to stave off the virus.'\n\n http://www.capitalcentury.com/1976.html\n\nThe United Nations which overseas the WHO has been implicated in the promotion of live viruses & eugenics-type sterilization programs throughout the past, based on verifiable data. We will not be their guinea-pigs any more. We unanimously uphold this decision. The onus then is on the WHO to prove its own safety record. Any reports or rebuttals issued by them are subject to an independent investigation by council of our choosing,\n\n National Security Council Document 20506: Implications of Worldwide Population Growth for U.S. Security and Overseas Interests\n\n\n\n This 1974 memorandum drafted by Henry Kissinger led directly to the unleashing of experimental vaccines on the unsuspecting public. It sighted countries as targets for \"initial population reduction experimentation to be implemented around the year 2000\". They identified India, Bangladesh, Pakistan, Nigeria, Mexico, Indonesia, Brazil, Philippines, Thailand, Egypt, Turkey, Ethiopia & Columbia for study. 3 million Filipinos ages 12-48 were given a test vaccine that ruined their health. North American Black & Native American Women were each given the same vaccine resulting in sterility rates of 25% & 35% respectively. The directive came from the WHO and was .\n\n http://www.scribd.com/doc/6474391/Henry-Kissinger-Population-Control-Document\n\nIt followed a 1972 report (Bulletin #47) issued by the World Health Organization which referred to an immune virus requested which would selectively destroy the Human T Cell System, to be distributed in conjunction with a Nationwide vaccination program \"to observe the results\". This coincided precisely with the extensive Small Pox vaccination program in central Africa - shortly preceding the outbreak of Aids in Africa,America & elsewhere. The determining factor most common in Aids victims is the breakdown of the T Cell System in the body. Another coincidence.\n\nIn the event that mandatory vaccinations are legislated under conditions of a supposed/genuine Pandemic we are calling for independent research of the vaccines - by a team of licensed health care professionals of our choosing, before delivering them to the distribution centers. All vaccines will be tested for contamination & safety. Ongoing monitoring of those vaccinated will be kept in an up-to-date data system. If the WHO or their distributors are discovered to be willfully spreading a toxic product they will be prosecuted to the fullest extent of the Law. We will mandate a public investigation to root out those responsible & justice will be served. In this respect we will also hold our own Governments fully accountable.\n\n We, the undersigned, stand united in support of this Petition.\n\n\n\n TO SIGN THIS PETITION PLEASE GO AT http://www.thepetitionsite.com/1/a-universal-declaration-of-resistance-to-mandatory-vaccinations\n\n\n\n Here's a quote from the petition:\n\n 'There is no pandemic potential unless mass vaccinations are carried out to weaponize the flu under the guise of protecting the population. There are reasonable grounds for believing that the mandatory vaccines will be purposely contaminated with diseases that are specifically designed to cause death.' Natural News/Journalist Files Charges against WHO and UN for Bioterrorism and Intent to Commit Mass Murder\n\n http://www.naturalnews.com/026503_pandemic_swine_flu_bioterrorism.html\n\nBIOLOGICAL INDEX\n\n \n\n chicken embryos (eggs)\n\n influenza virus, H5N1\n\n virus culture\n\n \n\n CHEMICAL INDEX\n\n \n\n alpha-tocopherol\n\n aluminum adjuvant\n\n AS03 adjuvant\n\n Daronrix\n\n disodium phosphate\n\n formaldehyde\n\n magnesium chloride\n\n octoxynol 10\n\n polysorbate 80 (Tween 80\n\n potassium chloride\n\n potassium dihydrogen phosphate\n\n sodium chloride\n\n sodium deoxycholate\n\n squalene\n\n thiomersal (thimerosol) (MERCURY)\n\n vitamin E\n\n \n\n \n\n The rest of the story...\n\n \n\n http://birdflu666.wordpress.com:80/2009/07/18/glaxos-vaccine-characterised-by-regulators-eu-and-usas-biodefense-stockpile-drug/\n\nLaw can force Norwegians to take H1N1 vaccine from GSK \n\n Belgium Health Minister passes law allowing use of police for forced mass vaccination »\n\n Glaxo’s vaccine characterised by regulators as EU and USA biodefense stockpile drug\n\n By birdflu666\n\nGlaxo’s pandemic influenza vaccine is characterised by regulatory authorities as a susbtance that needs to be stockpiled in the EU’s and USA’s biodefense stockpiles.\n\nThis classificiation by regulatory authorities underscores fears that the pandemic flu vaccines, which contain toxic adjuvants, are indeed actually bioweapons, designed to cause death and injury. Furthermore, the Glaxo vaccine is categorised as having “controlled or government distribution in the EU and USA” only. Below is the entry for the Glaxo pandemic influenza vaccine on a biopharma database. Scroll down to see the Regulatory/Status Index.\n\nCenters for Disease Control and Prevention (CDC) — R&D ; Tech. ; USA mark.\n\n GlaxoSmithKline Biologicals S.A. (GSK) — Manuf. ; R&D ; Tech. ; Europe mark.\n\n GlaxoSmithKline plc (GSK) — Parent\n\n Monograph size = 15988 characters (not including indexing, nomenclature, links, etc. on this page)\n\nStatus: vaccine approved in EU in May 2008; being added to U.S. and other countries’ stockpiles\n\nDescription: Prepandrix “prepandemic vaccine” is a conventional egg-cultured influenza virus H5N1 (A/VietNam/1194/2005 NIBRG-14) clade 2 inactivated split-antigen vaccine. The H5N1 clade 2 bulk material is being manufactured from a laboratory version seed virus of the wild-type virus provided by the U.S. Centers for Disease Control and Prevention (CDC). The reference virus, A/Vietnam/1194/2004 (H5N1) NIBRG-14, was developed using reverse genetics, with reassortment strain combining the H5 and N1 segments to with an influenza virus PR8 strain backbone. In addition the H5 was engineered to eliminate the polybasic stretch of amino-acids at the HA cleava … truncated (just the beginning)\n\nRegulatory/Status Index:\n\n EU200 Currently Approved in EU\n\n EU666 Biodefense stockpile\n\n UM100 Controlled/Gov’t Distribution in US\n\n US666 Biodefense stockpile\n\n EM160 Controlled/Gov’t Distribution in EU\n\n* Bird Flu : A Research Paper\n\n * Are vaccines ready for pandemic influenza?\n\n * Malaysia–Bird Flu Vaccine\n\n * Pharmaceutical Stocks Get Boost from Swine Flu?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/ct/", "http://educate-yourself.org/nwo/nwopopcgwiart1.shtml", "http://educate-yourself.org/vcd/mercolasqualenedangers17jul09.shtml", "http://educate-yourself.org/vcd/July 21 2009 IngriC Evident_Footprints_2009-07-21.mp3", "http://educate-yourself.org/vcd/forcedvaccinationinjunctionsought22jul09.shtml", "http://www.publichealthlaw.net/MSEHPA/MSEHPA Surveillance.pdf", "http://www.pandemicflu.gov/plan/states/stateplans.html", "http://educate-yourself.org/vcd/NCSLmodelact.pdf", "http://www.seguingazette.com/story.lasso?ewcd=7067c6003405a409", "http://news.bostonherald.com/news/politics/view/2009_04_28_Mass__Senate_approves_pandemic_flu_prep_bill/", "http://www.dhs.gov/xabout/laws/gc_1219263961449.shtm#1", "http://www.hhs.gov/pandemicflu/plan/appendixh.html", "http://www.nutrimedical.com/news.jhtml?method=view&news.id=2127", "http://www.naturalnews.com/026503_pandemic_swine_flu_bioterrorism.html", "http://worldgenocidewatch.blogspot.com", "http://www.who.int/csr/resources/publications/influenza/FluCheck6web.pdf", "http://www.cdc.gov/h1n1flu/sick.htm", "http://www.amazon.com/Vaccine-Government-Experiment-Killing-Soldiers/dp/046504400X/ref=sr_1_1?ie=UTF8&s=books&qid=1248386227&sr=1-1", "http://www.whale.to/vaccine/secret_adjuvant.html", "http://drtenpenny.com/swine_flu.aspx", "http://www.capitalcentury.com/1976.html", "http://www.scribd.com/doc/6474391/Henry-Kissinger-Population-Control-Document", "http://www.thepetitionsite.com/1/a-universal-declaration-of-resistance-to-mandatory-vaccinations", "http://www.naturalnews.com/026503_pandemic_swine_flu_bioterrorism.html", "http://birdflu666.wordpress.com:80/2009/07/18/glaxos-vaccine-characterised-by-regulators-eu-and-usas-biodefense-stockpile-drug/"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}