{"result_id": "105030", "URL": "https://educate-yourself.org/cn/Four-Thousand-Two-Hundred-and-Fifty-Percent-Increase-in-Fetal-Deaths-Following-Flu-Shot-Vaccination-toPregnant-Women20mar15.shtml", "timestamp": "2023-04-25 15:02:01 CEST+0200", "meta": {"description": "Documentation received from the National Coalition of Organized Women (NCOW) states that between 2009 and 2010 the mercury-laden combined flu vaccinations have increased Vaccine Adverse Events Reporting Systems (VAERS) fetal death reports by 4,250 percent in pregnant women. Eileen Dannemann, NCOW’s director, made abundantly clear that despite these figures being known to the Centers for Disease Control (CDC), the multiple-strain, inactivated flu vaccine containing mer", "lang": "en", "keywords": "educate-yourself.org, vaccine dangers, pregnant women increse fetal deaths vor 4000% with vaccination, flu vaccine dangers, not safe pregnant women,", "favicon": "", "canonical": "https://educate-yourself.org/cn/Four-Thousand-Two-Hundred-and-Fifty-Percent-Increase-in-Fetal-Deaths-Following-Flu-Shot-Vaccination-toPregnant-Women20mar15.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Four Thousand Two Hundred and Fifty Percent (4,250%) Increase in Fetal Deaths Following Flu Shot Vaccination to Pregnant Women (March 20, 2015)", "cleaned_text": "Documentation received from the National Coalition of Organized Women (NCOW) states that between 2009 and 2010 the mercury-laden combined flu vaccinations have increased Vaccine Adverse Events Reporting Systems (VAERS) fetal death reports by 4,250 percent in pregnant women. Eileen Dannemann, NCOW’s director, made abundantly clear that despite these figures being known to the Centers for Disease Control (CDC), the multiple-strain, inactivated flu vaccine containing mercury (Thimerosal) has once again been recommended to pregnant women as a safe vaccination this season. Outraged by the CDC’s total disregard for human life, Ms. Dannemann accused the CDC of ‘willful misconduct,’ saying that they are responsible for causing the deaths of thousands of unborn babies. She stated that the CDC deliberately misled the nation’s obstetricians and gynecologists and colluded with the American Journal of Obstetrics and Gynecology (AJOG) to mislead the public by advertising the flu vaccine as a safe vaccine for pregnant women when they knew fully well that it was causing a massive spike in fetal deaths. In a letter to Dr. Joseph Mercola, Ms. Dannemann wrote: “Not only did the CDC fail to disclose the spiraling spike in fetal death reports in real time during the 2009 pandemic season as to cut the fetal losses, but also we have documented by transcript Dr. Marie McCormick, chairperson of the Vaccine Safety Risk Assessment Working Group (VSRAWG) on September 3, 2010, denying any adverse events in the pregnant population during the 2009 Pandemic season.” [1]\n\nBecause the H1N1 pandemic vaccine had never been tested on the pregnant population, and to lessen the intensity of fears of the unknown risks, Dr. Marie McCormick of the CDC was employed to keep track of all adverse events during the 2009 pandemic season, including those adverse events in the pregnant population. Dr. McCormick was responsible for sending monthly reports to the Secretary of the Health and Human Services (HHS), citing any suspicious adverse events. According to Ms. Dannemann, NCOW has been unable to obtain access to these monthly reports. After sending a Freedom of Information Act request to the CDC, she was told that she may have to wait 36 months to access what should be published public reports. The Mercola letter continues: “The Advisory Committee on Childhood Vaccines (ACCV) and CDC were confronted with the VAERS data from NCOW on September 3, 2010, in Washington, D.C., and then again by conference call on September 10, and then again in Atlanta, Georgia, on October 28, 2010. On both September 3 and September 10, Dr. Marie McCormick clearly denied that there were any adverse events for pregnant women from the 2009 flu vaccine.”\n\nTo emphasize their point, on October 28, 2010, NCOW requested that Dr. Rene Tocco present their data at the CDC headquarters in Atlanta, Georgia. The CDC’s Dr. Shimabakuru gave a presentation on significant adverse reactions to the H1N1 vaccine, such as cases of Guillane-Barre Syndrome, which appeared to have risen three percent, claiming it as an insignificant signal. No mention at all was made of adverse events related to pregnant women. Unfortunately for Dr. Shimabakuru, his attempts to pull the wool over the eyes of the audience were foiled when he was challenged by a member of the audience asking if the vaccine caused adverse events in pregnancy. Feeling cornered, he reluctantly looked in his bag and sheepishly presented a slide that corroborated the NCOW data, confirming that the CDC knew of the spike in fetal deaths in the fall of 2010. [2] So, why did Dr. Shimabkauru have a slide containing compromising evidence in his bag? Why did he decide to hide the slide? Surely, if he had prepared a slide outlining this crucial data, it would have made sense to include the slide in his presentation. After all, a 4,250 percent increase in fetal deaths is far more significant that a three percent increase in Guillane-Barre Syndrome. Ms. Dannemann believes that the existence of this slide, along with the omission of it in his presentation, confirms that the CDC knew of the spike in fetal deaths by the fall of 2010 and was attempting by any means possible not to make it public. Outlining a catalog of events, Ms. Dannemann believes the CDC’s continual cover ups puts the lives of pregnant women and their unborn children in serious jeopardy. She maintained: “Continuing the vaccine program without notifying the public or the healthcare practitioners of the VAERS miscarriage/stillbirth incoming data was clearly a purposeful decision. The CDC, aware of their own incoming stream of early vaccine adverse events reports, clearly decided to allow the obstetricians to continue, unwittingly, murdering and damaging the unborn so that the CDC’s blunder of recommending the double-dose vaccination of pregnant women could be kept under the radar.”\n\nDespite evidence that the CDC knew of the 4,250 percent increase in fetal death reports in 2009/2010, in order to ensure the continuance of the vaccine program for pregnant women, the CDC published a study in AJOG authored by Dr. Pedro Moro of the CDC in the fall of 2010. The study articulated that there were only 23 miscarriages caused by the single flu vaccine in 19 years between 1990 – 2009, an average of 1.2 miscarriages per year. This study formed the basis of a CDC worldwide publicity campaign that the flu shot was safe for pregnant women by willfully and strategically excluding the 2009 pandemic data, which was available to them. Ms. Dannemann said: “Both the CDC and AJOG were well aware of the fact that physicians and the public were awaiting the results of the 2009 H1N1 untested vaccine on pregnant women, amid solid assurances to the public at the beginning of the pandemic season that the CDC was on top of collecting any adverse reactions to the vaccine by establishing the Vaccine Safety Risk Assessment Working Group chaired by Dr. Marie Mc Cormick (VSRAWG).” Ms. Dannemann stated that by including the 2008/2009 flu season’s data but excluding the available 2009 data from the 2009/2010 flu season in the study published in AJOG, Dr. Moro was able to give the impression that the 2009/2010 pandemic season was covered in the data, which of course it was not. Ms. Dannemann believes that this was a deliberate act on his part because he was aware of the fetal death spike in the 2009/2010 data at the time of preparing the study and purposely excluded the 2009 pandemic data from the study to hide this fact.\n\n“It is also not known whether these vaccines can cause fetal harm when administered to pregnant women or can affect reproduction capacity.’’(emphasis added) Dr. Goldman also pointed out that the developing fetus is indirectly exposed to mercury when thimerosal-containing vaccines are administered to a pregnant woman. He outlined a study written by A.R. Gasset, M. Itoi, Y. Ischii and R.M. Ramer who examined what happened after rabbits were vaccinated with thimerosal–containing radioactive mercury. Goldman stated that from one hour post-injection to six hours post-injection, the level of radioactive mercury in the blood dropped over 75 percent. Yet from two hours post-injection to six hours post-injection, there were significantly increased radioactivity levels in the fetal brain, liver, and kidney. Dr. Goldman concluded that because the rates of miscarriage reported to the Vaccine Adverse Events Reporting System (VAERS) for the single flu vaccine were relatively low, health care providers developed a false sense of security that flu vaccines administered during pregnancy were safe. Goldman explained that just because a single vaccine has been tested and considered to be relatively safe, this does not mean that vaccinating pregnant women with two or more Thimerosal containing vaccines will be safe for them or their unborn babies. Overall, Goldman firmly believes that the VAERS grossly underestimates the true rates of miscarriage and other adverse events encountered in the US population. Remember, it is estimated that less than a tenth of true adverse reactions are reported to the VAERS with a one percent reporting rate for serious adverse events, including death, according to a study led by former FDA Commissioner Dr. David A. Kessler. [5]\n\n As seen in the Goldman study, with the return to a single flu shot, the flu vaccine-related reports of fetal loss have returned to a significantly lower level compared to the high level of fetal loss reports in the two-dose 2009/2010 flu season. However, higher than background flu shot vaccine-related fetal losses continue to be reported to the VAERS.\n\n Furthermore, the Goldman study recommends that the babies who survived the deadly double dose in utero be monitored: “In addition, because of the order of magnitude increase in fetal-loss report rates, from 6.8 fetal loss reports per million pregnant women vaccinated in the single-dose 2008/2009 season to 77.8 in the two-dose 2009/2010 season, further long term studies are needed to assess adverse outcomes in the surviving children. Additional research concerning potential synergistic risk factors associated with the administration of Thimerosal-containing vaccines is warranted, and the exposure-effect association should be verified in further toxicological and case-control studies.” (emphasis added) Aside from fetal deaths, the CDC initiative to increase uptake of vaccines in pregnant women continues to fuel the increases in the levels of neurodevelopmental, developmental, behavioral abnormalities, and chronic illness in the surviving children. Due to omitting reports of fetal deaths, the CDC enjoys success in increasing the uptake and number of vaccines in the pregnant population. The Advisory Committee on Immunization Practices (ACIP) is now recommending not only the flu shot (with mercury) but also the Tdap vaccine.\n\n\n\nThe work of NCOW and Dr. Goldman has proven that potential lives are being destroyed before they are even old enough to draw their first breath. Developing fetuses who are fortunate enough to survive the onslaught of vaccinations now being recommended to pregnant women then need to play a form of Russian Roulette from the day they are born, because their caring parents followed the advice they were given by professionals who have been deliberately misguided. Eileen Dannemann and her team have proven with their remarkable work that both public and professionals alike are being lied to and deceived by organizations put in place by the government to sanction our vaccination programs. In my opinion, this is genocide and the sooner people realize that all vaccines come with an element of risk and begin to research the dangers for themselves, the sooner these insane experiments will end.", "opengraph": {}, "tags": ["National Coalitions of Organized Women", "VAERS", "fetal death", "flu shots", "willful misconduct", "H1N1pandemic vaccine", "CDC fraud"], "tweets": [], "movies": [], "links": ["http://www.progressiveconvergence.com/ACCVTranscript-p37-9-3-102.pdf", "http://www.progressiveconvergence.com/ACCVTranscript-p37-9-3-102.pdf", "http://www.progressiveconvergence.com/vaccine%20safety%20monitoring%20update%20slides.pdf", "http://het.sagepub.com/content/early/2012/09/12/0960327112455067.abstract?rss=1", "http://vactruth.com/2012/11/23/flu-shot-spikes-fetal-death/"], "authors": ["Ken Adachi"], "publish_date": null}