{"result_id": "105033", "URL": "https://educate-yourself.org/cn/trueottvaccineinducedepidemics24aug09.shtml", "timestamp": "2023-04-25 15:02:03 CEST+0200", "meta": {"description": "Aug. 24, 2009. The Engineering of “Pandemics\" The year was 1921. America was entering a decade of robust prosperity. Later called “The Roaring Twenties”, it was a time of unparalleled economic expansion. Debt money from Wall Street banks was plentiful and easy to obtain. The “Great War” was over. America was flexing her industrial muscles. Factories were being built and expanded in every major city. Automobiles began rolling off Detroit assembly lines in record numbers. The stock market began making millionaires. People were HEALTHY and HAPPY – largely because the dreaded “world mystery disease” (which decades later became known as the “1918 Flu Pandemic”) had disappeared. Two entire years had passed with no dreaded “mystery deaths” being reported. America had cause to celebrate, and celebrate they did!", "lang": "en", "keywords": "educate-yourself.org, dr a true ott, swine flu hoax, the making of a pandemic, 1918 spanish flu, swine flu hoax, Vaccine Induced Disease Epidemic Outbreaks, john rockefeller, drug sales, pandemic hoax, swine flu dangers, swine flu vaccine dangers, genocide, who , world health organization, dr margaret chan, satanists, new world order, population reduction, eugenics, engineering pandemics,", "favicon": "", "canonical": "https://educate-yourself.org/cn/trueottvaccineinducedepidemics24aug09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "The Engineering of “Pandemics\" Vaccine Induced Disease Epidemic Outbreaks by Dr A True Ott (Aug 24, 2009)", "cleaned_text": "The Engineering of “Pandemics\" Vaccine Induced Disease Epidemic Outbreaks by Dr A True Ott (Aug 24, 2009)\n\nThe year was 1921. America was entering a decade of robust prosperity. Later called “The Roaring Twenties”, it was a time of unparalleled economic expansion. Debt money from Wall Street banks was plentiful and easy to obtain. The “Great War” was over. America was flexing her industrial muscles. Factories were being built and expanded in every major city. Automobiles began rolling off Detroit assembly lines in record numbers. The stock market began making millionaires. People were HEALTHY and HAPPY – largely because the dreaded “world mystery disease” (which decades later became known as the “1918 Flu Pandemic”) had disappeared. Two entire years had passed with no dreaded “mystery deaths” being reported. America had cause to celebrate, and celebrate they did!\n\nAs a matter of fact, the American Public in general was so optimistic and HAPPY in 1921, that relatively few people were unhealthy as well. For the first time in decades, hospital beds were empty. The fledgling American Medical Association, formed by John D. Rockefeller just a few years earlier, was worried. Business was sagging. Profits from vaccines and drugs were spiraling. Something had to be done, and done immediately. False, faux epidemics of smallpox were created to solve the problem, and keep the Medical Mafia’s cash registers ringing.\n\nWe know this dastardly plan actually happened, thanks to a citizen’s WATCHDOG GROUP in Kansas City, Missouri named “The Advertiser’s Protective Bureau”, who filed, and successfully prosecuted criminal charges against the Missouri state chapter of the AMA – the Jackson Medical Society. The ‘Protective Bureau’s” official report of this cold-blooded plot reads as follows:\n\n“In the Fall of 1921, the health of the city was unusually good, but slow for the doctors. So the Jackson Medical Society met and resolved to make an epidemic in the city. According to the minutes of this meeting: ‘MOTION WAS MADE AND SECONDED, THAT A RECOMMENDATION BE MADE BY THE COMMITTEE, TO THE BOARD OF HEALTH, THAT AN EPIDEMIC OF SMALLPOX BE DECLARED IN THE CITY. (Investigation later revealed that there was NO SIGN OF AN EPIDEMIC at the time, in the city, or anywhere in the state or region!)\n\n‘It was moved and seconded that a day be set aside, termed VACCINATION DAY, on which physicians would be stationed at ALL SCHOOLS, clinics, public buildings and hospitals to vaccinate “free of charge”. (Vaccinations are never “free”. The taxpayers are always forced to pay for every one of the “free” vaccines.)\n\n“IT IS FURTHER RECOMMENDED THAT WIDE PUBLICITY BE GIVEN, STATING THAT VACCINATION IS A PREVENTIVE OF SMALLPOX, AND URGING THE ABSOLUTE NECESSITY OF VACCINATION FOR EVERY MAN, WOMAN, AND CHILD IN THE CITY.”\n\nThe Protective Bureau proved in court that there WAS NO EPIDEMIC before the vaccinations!! The court records show that the Medical Society manufactured vast amounts of posters, fliers, newspaper stories and ads featuring horrific and lurid pictures of diseased children covered with massive smallpox sores and open wounds. Some pictures actually showed children’s corpses covered with the same ugly sores. The PANIC-DRIVEN message was clear --- VACCINATE EVERYONE, or face a deadly public disease. There was a “sweeping epidemic” in the city; the disease was “highly contagious” and would “strike anyone who was not vaccinated” was the bill of goods sold! (Does this sound at all familiar today – 88 years later?)\n\nThe Medical Mafia’s propaganda blitz was successful, and over a million previously healthy and happy American citizens were hypnotized and terrorized into placing the vaccine toxins into their bloodstreams. All public school children in the region were vaccinated while at school! Parents who dared question the vaccination of their children were ostracized and publicly vilified.\n\nTHE COURT RECORD ON THIS CASE IS VERY CLEAR. In the weeks and months following the “mass vaccinations” – the area’s hospital beds were filled to over-flowing with VACCINE-INDUCED SMALLPOX CASES! Tens of thousands of people became ill, and many hundreds of innocents died, and many more were permanently crippled! Of course, THE NEWSPAPERS THEN TRUMPETED HOW WISE THE MEDICAL ESTABLISHMENT WAS TO PROMOTE THE VACCINES – stating how much worse the death toll would have been without the vaccination campaign!! Untold MILLIONS OF DOLLARS of profit was generated by this massive “medical” fraud.\n\nThanks to the ADVERTISER’S PROTECTIVE BUREAU, however; the massive fraud was exposed and criminally prosecuted to a successful conviction. During the trial, three amazing facts were proven beyond any “reasonable doubt”.\n\nFact 1: The poster and advertising pictures showing the diseased and dying children used so successfully by the “doctors”, WERE NOT EVEN CASES OF LOCAL SMALLPOX CASES AS THEY WERE BILLED TO BE! The Protective Bureau documented that they were pictures of ENGLISH CHILDREN who were victims of “court-proven” cases of SMALLPOX VACCINE POISONING!! One of the pictures was of a 5-week-old baby named Mona Stevenson, of Humphrey Street, Burnley, England. A previously healthy and happy baby, Little Mona had been vaccinated for smallpox at 5 weeks of age. Four weeks later, her pox-ridden little body was placed in a tiny coffin and buried. The horrific photos of Little Mona and others in England had previously been published in British newspapers where details of the resulting CRIMINAL TRIALS were also given. The full details of the trials, as well as the pictures, were also included in a comprehensively large medical boot titled “THE HISTORY AND PATHOLOGY OF VACCINATION” by Edgar M Crookshank, MD – professor of Bacteriology at the ultra-elite Kings College, London England.\n\nFact 2: Vaccines containing LIVE VIRUSES, weakened (i.e. attenuated) or otherwise universally causes more diseases than the vaccine ever could prevent.\n\nFact 3: Vaccine-Induced-Disease (VID) is an extremely effective socio-economic tool. It has the potential to generate BILLIONS OF DOLLARS OF WINDFALL PROFITS, while permanently changing the social structures of large groups of people.\n\nWhile the Protective Bureau won the criminal court case – the American People lost. The case should have made front-page headlines around the nation, showing the Modus Operandi of certain corrupt “medical practitioners”. How, by means of fraud, treachery, and trickery, they made millions of dollars in windfall profits while thousands of innocent, trusting, and naïve Americans suffered and died. The entire sordid affair, with all its damning details, was kept out of the American Press. John D. Rockefeller’s AMA, with its millions of dollars of influence – made sure of that!\n\nAmazingly, even though thousands of people had died or become crippled by this managed manslaughter, the doctors involved were only given a light penalty in the form of a token fine. The medical establishment as a whole was not upset in the least by the exposure – and has continued on unabated perpetuating the same crimes against humanity – creating vaccine-induced-diseases while fleecing the people continually until this present day.\n\nIt is a proven (albeit little-known) fact, EPIDEMIC/PANDEMIC MANUFACTURING IS STANDARD PRACTICE with the world-wide “Medical Mafia” circles. In order to maximize profits and re-shape geographical regions, they often manufacture a false-flag “emergency”. If there is an outbreak of mild seasonal virus, they call it an influenza pandemic, give it a fancy new name, and then actually CREATE THE PANDEMIC by means of mass vaccinations using ATTENUATED, or LIVE VIRUSES!! Remember the shocking words of the AMA’s Dr. Simon Louis Katzoff who said: “ DOCTORS LIVE BY DISEASE, SO THE PUBLIC CAN EXPECT THE SUPPLY OF DISEASE TO MEET THE DEMANDS OF THE MEDICAL PROFESSION.”\n\nCase 1: Following the lead of their colleagues in Kansas City, the exact same events occurred in Pittsburgh, PA under the direction of Pittsburgh’s “Health Director”, Dr. C.J. Voux in the autumn of 1924. As in Kansas City, a group of public watchdogs brought suit against Voux and his vaccine-promoters. As in Kansas City, the vaccine promoters were found guilty. The case documented that over 1,000,000 vaccine shots were “sold” to the residents of Pennsylvania, even though there had been ZERO documented cases of smallpox in the region. It was successfully proven that ONLY AFTER the million shots had been given, that a smallpox epidemic began. This vaccine-induced, manmade “epidemic” resulted in 330 deaths and at least 1,680 cases of severe smallpox that caused permanent, crippling damage to the survivors. Moreover, it cost the city a total monetary loss of $3,069,616; although Dr. Voux and his accomplices had collected more than $10 million in hospital and related care revenues – they were not forced to pay for damages or reparations. As in the Kansas City trial, a small, insignificant fine was levied, and the case was not widely publicized.\n\nCase 2: The initial batches of Dr. Jonas Salk’s polio vaccine produced thousands of cases of poliomyelitis in vaccinated individuals. (One such case was Franklin D. Roosevelt – who was stricken weeks after receiving a vaccine.) This was due to an unsafe amount of LIVE VIRUSES in the vaccine itself. Dr. Sabin then introduced his “improved” vaccine with “attenuated” or “weakened’ live viruses in 1958, and the following year his vaccine was made to be compulsory (mandatory) in all school-age children in a number of states. As a result, polio increased a whopping 300% in these states. For example, Tennessee reported 119 polio cases in 1958, after “vaccination” this total increased to 386 cases in 1959, Ohio – 17 cases in 1958, 52 cases in 1959, Connecticut – 45 cases in 1958, 123 cases in 1959, and North Carolina: 78 cases in 1958 compared to 312 cases in 1959 AFTER forcing compulsory shots in school children. The modern record is equally damning. The ONLY cases of recorded polio in the modern era is immediately following vaccinations. Poliomyelitis, you see, is a water-borne virus and is caused by drinking contaminated water. During the early 60’s, water-treatment facilities became standardized across America – small amounts of CHLORINATION effectively wiped out polio viruses. The conquering of polio had NOTHING TO DO with the vaccine needles and swallowing sugar cubes. In fact, as author Ed Haslem documents so well in his book, HYPERLINK \"http://doctormarysmonkey.com/\" Dr. Mary’s Monkey, the Sabin vaccines were actually contaminated with mutated GREEN MONKEY VIRUSES (SV-40 viruses to be specific) which has caused untold millions of SOFT-TISSUE CANCERS and deaths worldwide. (The cancer “industry” has reaped BILLIONS of dollars from this “contamination” over the years, of course.) HYPERLINK \"http://www.youtube.com/watch?v=edikv0zbAlU\" Dr. Maurice Hilleman has actually confessed as being a part of this very activity.\n\nCase 3: Knowingly added to “hepatitis” vaccines, HIV viruses were inoculated into thousands of homosexual men and intravenous drug users in America’s inner cities resulting in the “AIDS epidemic” in the 80’s. Purposefully placed in SMALLPOX VACCINE SYRINGES, HIV was also introduced into African nations as a tool of ethnic cleansing and GENOCIDE. The covert development and weaponization of the HIV/AIDS virus and its monkey-virus origins, along with the amazing story of how the scientists involved are tied to President Kennedy’s assassination is well documented in HYPERLINK \"http://doctormarysmonkey.com/\" Dr. Mary’s Monkey. The covert biological experimentation labs responsible for this mayhem are today consolidated into the NIH, the NAIDS, the National Cancer Institute, and Ft. Detrick, Maryland. The Centers for Disease Control (CDC) in Atlanta became the centralized hub of pandemic and epidemic creations and propagation.\n\nCase 4: The 1976 “Swine Flu” Fiasco and Fraud is perpetrated. A solitary soldier at Ft. Dix collapses and dies following a reaction to an “experimental” vaccine while completing an intense physical “forced march” exercise at Ft. Dix. Immediately, the CDC swings into action, declaring a nationwide SWINE FLU PANDEMIC is pending. Providentially, of course, the CDC just happens to have 200+MILLION DOSES of Swine Flu vaccine already stockpiled, prepared with ATTENUATED (live, yet weakened) viruses and experimental ADJUVANTS. President Gerald Ford, (with proven ties to Big Pharma and Nixon’s covert viral weapons labs – also a key member of the “Warren Commission’s” obfuscation of the JFK murder) rolls up his sleeves on national TV and dutifully takes the vaccine. 40 million vaccines are given to naïve American human guinea pigs. A rash of auto-immune disorders (Guillan-Barre Syndrome GBS, and lupus) as well as a large number of deaths is immediately attributed to the vaccine, and the mass vaccination campaign is halted. (What happened to the other 140 million vaccines, one may ask?) In 1979, the television news magazine 60 Minutes did a documentary investigation on this travesty-for-money scandal. Against all odds and the threats of Big Pharma, the OBJECTIVELY FAIR 60 Minutes program aired ONE TIME. There was no follow-up story, No criminal indictments were ever issued. There was no MASS- MURDER-FOR-HIRE trial. As a result, America has largely forgotten the 1976 SWINE FLU SCANDAL! Click here for HYPERLINK \"http://www.youtube.com/watch?v=5lcJt4jX1Vo\" Part I of the 60 Minutes story; and HYPERLINK \"http://www.youtube.com/watch?v=r4c9Is1T3z4\" Part II.\n\nCase 5: During the first Gulf War – Operation Desert Storm, an experimental anthrax vaccine was forcibly given to 140,000 rear-echelon support troops. This experimental vaccine included an oil-in-water adjuvant called squalene (aka MF-59 made by NOVARTIS). Despite voluminous studies showing dangerous toxicity factors conducted on “oil-in-water” adjuvants at such prestigious research labs as UCLA – the U.S. Military brass consented to the experimental injections. As a result, ALL 140,000 troops developed a condition subsequently named “Gulf War Syndrome”. This sordid tale is explained in a very honest and credible book by HYPERLINK \"http://www.vaccine-a.com/\" Gary Matsumoto, called, Vaccine-A.\n\nALL MODERN “PANDEMICS” ARE CAUSED BY VACCINE NEEDLES\n\nAs this author has repeatedly declared during many public radio interviews, the deadly 1918 Influenza Pandemic was the direct result of live-virus-contaminated Typhus Fever Vaccines mandatorily given to U.S. and Allied military personnel during World War I. During that era, viruses were not yet discovered and diseases were thought to be bacterial only. These deadly typhus fever vaccines were manufactured by John D. Rockefeller’s research labs and Chinese pharma factories. The vaccine “seed stock” consisted of viruses harvested from human typhoid fever patients, cross-injected into swine herds to create increased “seed stock”, and then injected into chicken and turkey eggs for further incubation of the pathogens. The final, harvested “vaccine material” then was injected into HUNDREDS OF MILLIONS OF HUMAN VEINS. The result was a massive ‘pandemic’ that claimed the lives of as many as 50 million people worldwide.\n\nIn 1918, the viral pandemic was an honest mistake – the result of a combination of a very bad vaccine and gross ignorance about viruses and the diseases they cause. However, the continued denial of these FACTS, and the subsequent REVERSE ENGINEERING OF THE KILLER VIRUS in Ft. Detrick labs (1997-2003) is inexcusable and constitutes a veritable crime against humanity.\n\nMoreover, the ONLY WAY a modern “SWINE FLU PANDEMIC” can actually materialize is by injection of certain LIVE VIRUSES via vaccine needles. Make no mistake, the world is NOT experiencing a true pandemic explosion at this time – but it most assuredly WILL when and if the planned mass influenza vaccinations are completed worldwide.\n\nTHE DANGERS INHERENT IN “DUPLEX” VACCINES FROM DESIGNER VIRUSES\n\n“Modern Medical Practitioners”, including some well-meaning “osteopaths”, would have the world believe the MYTH that vaccines containing attenuated (weakened) live viruses cannot cause the viral disease conditions they are targeting. This is a most dangerous misconception for the following SCIENTIFIC reasons.\n\nTraditional “common” vaccines targeting measles, mumps and rubella for instance, contain small amounts of “attenuated” live viruses which have been “weakened” but not 100% killed outright. Research has shown that these weakened “live” viruses create a very mild form of the disease in the human that has been vaccinated, which in turn creates a cellular immunity from that pathogen. The science behind this is correct, and valid for the most part. To keep the targeted viral pathogen in a perpetually weakened state, specific amounts of formaldehyde and ether are typically added, and in some formulations, mercury in the form of thimerasol is added as a preservative to keep the egg albumin cells from decaying and dying prematurely. The established theory behind all of this ‘vaccination’ is the “protect the herd” theory which originated with Pasteur in the late 19th century. As in all vaccines, a certain small percentage of the herd will develop severe, ‘full blown’ disease states CAUSED by the attenuated viruses in the vaccine itself, and another percentage will exhibit side effects from the chemicals added to the vaccine – but if the vast majority of the herd is “protected” from the disease condition – the vaccine is approved and stamped “safe and effective”.\n\nScience has also proven that each viral pathogen has its own unique characteristics that produce its own set of symptoms in the human hosts. Thus, each viral pathogen has its own unique fingerprints of replication and reproduction as well. Each virus also has a different level of effectiveness in its attenuated (weakened) state. Moreover, some viruses have shown the ability to “drift” and acquire additional genetic alterations over time. THIS IS ESPECIALLY TRUE OF THE SO-CALLED “NOVEL” RECOMBINATION VIRUSES that have been “reverse engineered” in the world’s weapons laboratories! When the RNA of the virus is spliced with other viral genes, the resulting “Franken-virus” is very unpredictable. Studies conducted (yet currently unpublished) by Terrence Tumpey, Jeffrey Taubenberger, and others at the NIH and CDC show that these ‘resurrected pandemic viruses’ do not exhibit the NORMAL tendencies of traditional, NATURAL influenza viruses such as seasonal H3N2 human strains. They are best described as “Viral Wild Cards”.\n\nThis is just one problem with the headlong, mad rush to vaccinate Americans with a series of reverse-engineered lab-created viruses, attenuated or otherwise, in an UNTESTED, UNTRIED, EXPERIMENTAL VACCINE that has not been subjected to LONG-TERM CLINICAL TRIALS TO DETERMINE THE LEVELS OF “DRIFT” or even ATTENUATED TENDENCIES OVER TIME.\n\nTo supposedly minimize this “safety” issue, the CDC is now recommending a DUPLEX vaccination, of all things. A “duplex” vaccination basically involves a two-shot series. The first shot consists of a VERY WEAK, HIGHLY ATTENUTATED dose of the live virus. This is intended to create an initial immune response patterning the specific virus injected. Within a couple of weeks of the 1st shot, a BOOSTER SHOT is given. The booster shot has only lightly attenuated, or even FULL STRENGTH VIRUSES in the injection. This 2nd shot is then intended to create a full-strength immune system response in the human subject.\n\nThis is, at the very least, BAD SCIENCE and borders on insanity for self-evident and fairly obvious reasons. By their own admissions, the NIH scientists in their various writings have declared that the level of potency of these REVERSE ENGINEERED VIRUSES show abnormal, almost RANDOM tendencies in their attenuated states. Nobody really knows what will happen over time as the inevitable “genetic drifts” occur. It is a literal crap shoot. It is highly probable that even the HIGHLY ATTENUATED FRANKEN-VIRUSES can swiftly regain their FULL POTENCY even in the presence of ether and formaldehyde. (See Addendum Below) Secondly, the full-strength BOOSTER shot viruses could just as easily “DRIFT” into something much more deadly than the “original’ recombinant virus that it is targeting.\n\nI submit that the scientists responsible for this “pandemic” are not stupid. They have to know these facts as well as I do.\n\nTherefore, I can only conclude that this entire affair is following the Modus Operandi of the medical elite since the 1920 engineered smallpox epidemics. It is all being ORCHESTRATED first and foremost for MONEY, and secondly, for social and geographical restructuring of the “human herd”.\n\nAlso, it must be understood that this “Novel 2009 Influenza” is not easily nor readily transmissible between humans. (See published study in the addendum). If this report is accurate, how then did the “Pandemic” begin, and why the need for mass vaccinations at all?? Like the “study” shows, the only way the test ferrets could contract or transmit the 2009 “Novel Swine Flu” was by and through INOCULATION OF THE DISEASE!! Humanity demands an answer, and demands it NOW!!!\n\nSequence of the 1918 pandemic influenza virus nonstructural gene (NS) segment and characterization of recombinant viruses bearing the 1918 NS genes.\n\nDepartment of Microbiology, Mount Sinai School of Medicine, New York, NY 10029, USA.\n\nThe influenza A virus pandemic of 1918-1919 resulted in an estimated 20-40 million deaths worldwide. The hemagglutinin and neuraminidase sequences of the 1918 virus were previously determined. We here report the sequence of the A/Brevig Mission/1/18 (H1N1) virus nonstructural (NS) segment encoding two proteins, NS1 and nuclear export protein. Phylogenetically, these genes appear to be close to the common ancestor of subsequent human and classical swine strain NS genes. Recently, the influenza A virus NS1 protein was shown to be a type I IFN antagonist that plays an important role in viral pathogenesis. By using the recently developed technique of generating influenza A viruses entirely from cloned cDNAs, the hypothesis that the 1918 virus NS1 gene played a role in virulence was tested in a mouse model. In a BSL3+ laboratory, viruses were generated that possessed either the 1918 NS1 gene alone or the entire 1918 NS segment in a background of influenza A/WSN/33 (H1N1), a mouse-adapted virus derived from a human influenza strain first isolated in 1933. These 1918 NS viruses replicated well in tissue culture but were attenuated in mice as compared with the isogenic control viruses. This attenuation in mice may be related to the human origin of the 1918 NS1 gene. These results suggest that interaction of the NS1 protein with host-cell factors plays a significant role in viral pathogenesis.\n\nI FIRST READ THIS FOLLOWING REPORT (No Laughing Matter) BACK IN 2004. IT HAS SINCE BEEN REMOVED FORM THE CDC DATABASE. IT IS TAUBENBERGER’S DECLARATION THAT THE “HEMAGLUTININ CLEAVAGE” OF THE “NOVEL” VIRUSES REACTS MUCH DIFFERENTLY THAN NORMAL VIRUSES – IT MAY “DRIFT” AND CAUSE VERY DANGEROUS MUTATIONS. --- Ott\n\nDivision of Molecular Pathology, Department of Cellular Pathology, Armed Forces Institute of Pathology, Washington, DC 20306-6000, USA. taubenbe@afip.osd.mil\n\nTransmission and pathogenesis of swine-origin 2009 A(H1N1) influenza viruses in ferrets and mice.\n\nInfluenza Division, National Center for Immunization and Respiratory Diseases, Centers for Disease Control and Prevention, Atlanta, GA 30333, USA.\n\nRecent reports of mild to severe influenza-like illness in humans caused by a novel swine-origin 2009 A(H1N1) influenza virus underscore the need to better understand the pathogenesis and transmission of these viruses in mammals. In this study, selected 2009 A(H1N1) influenza isolates were assessed for their ability to cause disease in mice and ferrets and compared with a contemporary seasonal H1N1 virus for their ability to transmit to naïve ferrets through respiratory droplets. In contrast to seasonal influenza H1N1 virus, 2009 A(H1N1) influenza viruses caused increased morbidity, replicated to higher titers in lung tissue, and were recovered from the intestinal tract of intranasally inoculated ferrets. The 2009 A(H1N1) influenza viruses exhibited less efficient respiratory droplet transmission in ferrets in comparison with the highly transmissible phenotype of a seasonal H1N1 virus. Transmission of the 2009 A(H1N1) influenza viruses was further corroborated by characterizing the binding specificity of the viral hemagglutinin to the sialylated glycan receptors (in the human host) by use of dose-dependent direct receptor-binding and human lung tissue-binding assays.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/cn/trueottvaccineinducedepidemics24aug09.shtml"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}