{"result_id": "105013", "URL": "https://educate-yourself.org/vcd/vcdvaccineslacedwithbirthcontrol.shtml", "timestamp": "2023-04-25 15:01:51 CEST+0200", "meta": {"description": "During the early 1990s, the World Health Organization (WHO) has been overseeing massive vaccination campaigns against tetanus in a number of countries, among them Nicaragua, Mexico, and the Philippines. In October 1994, HLI received a communication from its Mexican affiliate, the Comite' Pro Vida de Mexico, regarding that country's anti-tetanus campaign. Suspicious of the campaign protocols, the Comite' obtained several vials of the vaccine and had them analyzed by chemists. Some of the vials were found to contain human chorionic gonadotrophin (hCG), a naturally occurring hormone essential for maintaining a pregnancy.", "lang": "en", "keywords": "educate-yourself.org, vaccine dangers, birth contorl in vaccines, Are New Vaccines Laced With Birth-Control Drugs?\n who, nwo, population control, genocide, population reduction, the club of rome, World Health Organization (WHO), rockefeller , eugenics, genocide,", "favicon": "", "canonical": "https://educate-yourself.org/vcd/vcdvaccineslacedwithbirthcontrol.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Are New Vaccines Laced With Birth-Control Drugs?", "cleaned_text": "Are New Vaccines Laced With Birth-Control Drugs?\n\nDuring the early 1990s, the World Health Organization (WHO) has been overseeing massive vaccination campaigns against tetanus in a number of countries, among them Nicaragua, Mexico, and the Philippines. In October 1994, HLI received a communication from its Mexican affiliate, the Comite' Pro Vida de Mexico, regarding that country's anti-tetanus campaign. Suspicious of the campaign protocols, the Comite' obtained several vials of the vaccine and had them analyzed by chemists. Some of the vials were found to contain human chorionic gonadotrophin (hCG), a naturally occurring hormone essential for maintaining a pregnancy.\n\nIn nature the hCG hormone alerts the woman's body that she is pregnant and causes the release of other hormones to prepare the uterine lining for the implantation of the fertilized egg. The rapid rise in hCG levels after conception makes it an excellent marker for confirmation of pregnancy: when a woman takes a pregnancy test she is not tested for the pregnancy itself, but for the elevated presence of hCG.\n\nHowever, when introduced into the body coupled with a tetanus toxoid carrier, antibodies will be formed not only against tetanus but also against hCG. In this case the body fails to recognize hCG as a friend and will produce anti-hCG antibodies. The antibodies will attack subsequent pregnancies by killing the hCG which naturally sustains a pregnancy; when a woman has sufficient anti-hCG antibodies in her system, she is rendered incapable of maintaining a pregnancy.(1)\n\nHLI reported the sketchy facts regarding the Mexican tetanus vaccines to its World Council members and affiliates in more than 60 countries.(2) Soon additional reports of vaccines laced with hCG hormones began to drift in from the Philippines, where more than 3.4 million women were recently vaccinated. Similar reports came from Nicaragua, which had conducted its own vaccination campaign in 1993.\n\nHere are the known facts concerning the tetanus vaccination campaigns in Mexico and the Philippines:\n\n* Only women are vaccinated, and only the women between the ages of 15 and 45. (In Nicaragua the age range was 12-49.) But aren't men at least as likely as young women to come into contact with tetanus? And what of the children? Why are they excluded?\n\n* Human chorionic gonadotrophin (hCG) hormone has been found in the vaccines. It does not belong there -- in the parlance of the O.J. Simpson murder trial, the vaccine has been \"contaminated.\"\n\n* The vaccination protocols call for multiple injections -- three within three months and a total of five altogether. But, since tetanus vaccinations provide protection for ten years or more, why are multiple inoculations called for?(3)\n\n* WHO has been actively involved for more than 20 years in the development of an anti-fertility vaccine utilizing hCG tied to tetanus toxoid as a carrier -- the exact same coupling as has been found in the Mexican-Philippine-Nicaragua vaccines.(4)\n\nAllied with the WHO in the development of an anti-fertility vaccine (AFV) using hCG with tetanus and other carriers have been UNFPA, the UN Development Programme (UNDP), the World Bank, the Population Council, the Rockefeller Foundation, the All India Institute of Medical Sciences, and a number of universities, including Uppsala, Helsinki, and Ohio State.(5) The U.S. National Institute of Child Health and Human Development (part of NIH) was the supplier of the hCG hormone in some of the AFV experiments.(6)\n\nThe WHO begain its \"Special Programme\" in human reproduction in 1972, and by 1993 had spent more than $356 million on \"reproductive health\" research.(7) It is this \"Programme\" which has pioneered the development of the abortificant vaccine. Over $90 million of this Programme's funds were contributed by Sweden; Great Britain donated more than $52 million, while Norway, Denmark and Germany kicked in for $41 million , $27 million, and $12 million, respectively. The U.S., thanks to the cut-off of such funding during the Reagan-Bush administrations, has contributed \"only\" $5.7 million, including a new payment in 1993 by the Clinton administration of $2.5 million. Other major contibutors to the WHO Programme include UNFPA, $61 million; the World Bank, $15.5 million; the Rockefeller Foundation, $2.5 million; the Ford Foundation, over $1 million; and \n\n the IDRC (International Research and Development Centre of Canada), $716.5 thousand.\n\nWhen the first reports surfaced in the Philippines of tetanus toxoid vaccine being laced with hCG hormones, the WHO and the Philippine Department of Health (DOH) immediately denied that the vaccine contained hCG. Confronted with the results of laboratory tests which detected its presence in three of the four vials of tetanus toxoid examined, the WHO and DOH scoffed at the evidence coming from \"right-to-life and Catholic\" sources. Four new vials of the tetanus vaccine were submitted by DOH to St. Luke's (Lutheran) Medical Center in Manila -- and all four vials tested positive for hCG!\n\nFrom outright denial the stories now shifted to the allegedly \"insignificant\" quantity of the hCG present; the volume of hCG present is insufficient to produce anti-hCG antibodies. But new tests designed to detect the presence of hCG antibodies in the blood sera of women vaccinated with the tetauns toxoid vaccine were undertaken by Philippine pro-life and Catholic groups. Of thirty women tested subsequent to receiving tetanus toxoid vaccine, twenty-six tested positive for high levels of anti-hCG! If there were no hCG in the vaccine, or if it were present in only \"insignificant\" quantities, why were the vaccinated women found to be harboring anti-hCG antibodies? The WHO and the DOH had no answers.\n\nNew arguments surfaced: hCG's apparent presence in the vaccine was due to \"false positives\" resulting from the particular substances mixed in the vaccine or in the chemicals testing for hCG. And even if hCG was really there, its presence derived from the manufacturing process.\n\nBut the finding of hCG antibodies in the blood sera of vaccinated women obviated the need to get bogged down in such debates. It was no longer necessary to argue about what may or may not have been the cause of the hCG presence, when one now had the effect of the hCG. There is no known way for the vaccinated women to have hCG antibodies in their blood unless hCG had been artificially introduced into their bodies!\n\nBecause the human body does not attack its own naturally occurring hormone hCG, the body has to be fooled into treating hCG as an invading enemy in order to develop a successful anti-fertility vaccine utilizing hCG antibodies. A paper delivered at the 4th International Congress of Reproductive Immunology (Kiel, West Germany, 26-29 July 1989) spelled it out: \"Linkage to a carrier was done to overcome the immunological tolerance to hCG.\"(8)\n\nAfter the vaccine controversy had reached a fever pitch, a new bombshell exploded; none of the three different brands of tetanus vaccine being used had ever been licensed for sale and distribution or registered with the Philippine Bureau of Food and Drugs (BFAD), as required by law. The head of the BFAD lamely explained that the companies distributing these brands \"did not apply for registration.\"(9) The companies in question are Connaught Laboratories Ltd. and Intervex, both from Canada, and CSL Laboratories from Australia.\n\nIt seemed that the BFAD might belatedly require re-testing, but the idea was quickly rejected when the Secretary of Health declared that, since the vaccines had been certified by the WHO -- there they are again! -- there was assurance enough that the \"vaccines come from reputable manufacturers.\"(10)\n\nJust how \"reputable\" one of the manufacturers might be is open to some question. In the mid-`80s Connaught Laboratories was found to be knowingly distributing vials of AIDS-contaminated blood products.(11)\n\nAt this juncture, evidence is beginning to appear from Africa.(12) HLI has called for a Congressional investigation of the situation, inasmuch as nearly every agency involved in the development of an anti-fertility vaccine is funded, at least in part, with U.S. monies.\n\n(3) A call placed by this writer on 5 May 1995 to the Montgomery County (Maryland) Health Department, Epidemology Division -- Infectious Diseases -- Adult Immunizations, elicited the following information:\n\nQ. For how long a time does the tetanus vaccination offer protection? \n\n A. 10 years. \n\n Q. Have you ever heard of any adult requiring three tetanus vaccinations within a 3 or 4 month time period, and a total of 5 vaccinations in all within a year or so? \n\n A. Whaaaat! Never. No way!\n\nReports from the Philippines appear to confirm the 10-year immunity afforded by tetanus toxoid vaccinations: prior to the campaigns begun in 1993, the so-called booster shots were given only every 10 years.\n\n(4) More than a score of articles, many written by WHO researchers, document WHO's attempts to create an anti-fertility vaccine utilizing tetanus toxoid as a carrier. Some leading articles include:\n\n\"Clinical profile and Toxicology Studies on Four Women Immunized with Pr-B-hCG-TT,\" Contraception, February, 1976, pp. 253-268.\n\n\"Observations on the antigenicity and clinical effects of a candidate antipregnancy vaccine: B-subunit of human chorionic gonadotropin linked to tetanus toxoid,\" Fertility and Sterility, October 1980, pp. 328-335.\n\n\"Phase 1 Clinical Trials of a World Health Organisation Birth Control Vaccine,\" The Lancet, 11 June 1988, pp. 1295-1298. \"Vaccines for Fertility Regulation,\" Chapter 11, pp. 177-198, Research in Human Reproduction, Biennial Report (1986-1987), WHO Special Programme of Research, Development and Research Training in Human Reproduction (WHO, Geneva 1988).\n\n\"Anti-hCG Vaccines are in Clinical Trials,\" Scandinavian Journal of Immunology, Vol. 36, 1992, pp. 123-126.\n\n(5) These institutional names are garnered from the journal articles cited in the previous footnote.\n\n(8) G.P. Talwar, et al, \"Prospects of an anti-hCG vaccine inducing antibodies of high affinity...(etc),\" Reproductive Technology 1989, Elsevier Science Publishers, 1990, Amsterdam, New York, p. 231.\n\n(10) \"BFAD junks re-testing of controversial shot,\" Manila Standard, 7 April 1995; \"DOH: Toxoid vaccines are safe,\" The Philippine Star, 7 April 1995.\n\n(12) A nearly two-year old communique from Tanzania tells a familiar story: tetanus toxoid vaccinations, five in all, given only to women aged 15-45. Nigeria, too, may have been victimized; see The Lancet, 4 June 1988, p. 1273.\n\nCredit: Article by J.A. Miller, special correspondent for Human Life International. Copyright June/July 1995 by Human Life International. This article was originally published in HLI Reports, Human Life International, Gaithersburg, Maryland; June/July 1995, Volume 13, Number 8. Permission to reprint granted to New Atlantean News.\n\nFor more information about vaccines, please visit the Thinktwice Global Vaccine Institute http://www.thinktwice.com or the Thinktwice Vaccine http://www.thinktwice.com/vaccine.htm", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/vcd/vcdvaccineslacedwithbirthcontrol.shtml", "http://www.thinktwice.com", "http://www.thinktwice.com/vaccine.htm"], "authors": ["Ken Adachi", "J.A. Miller"], "publish_date": null}