{"result_id": "105019", "URL": "https://educate-yourself.org/cn/hpvshotmennotconvicnced03jun09.shtml", "timestamp": "2023-04-25 15:01:55 CEST+0200", "meta": {"description": "June 4, 2009. Editor's Note: I found this item linked at www.rense.com on June 3, 2009. I assumed it was an anti-vaccination article, as Jeff Rense is opposed to vaccines in general, but especially opposed to the promotion of HPV (human papillomavirus) vaccines, such as Merck's Gardasil, which the CDC reported (between June 8, 2006 and December 31, 2008) caused 11,916 adverse reactions to the vaccine and the death of 32 young women and girls so far including 22 year old Whitney Baird who died only 13 months after getting the Gardasil vaccine, and 15 year old Jenny Tetlock who died on March 15, 2009 from the degenerative paralysis of ALS (Lou Gehrig's disease) acquired soon after being vaccinated with Gardasil. After carefully reading this UPI article, I can see that it's more of a promotion of HPV vaccines rather than a criticism. Without identifying Gardasil by name, the statements made below by an assistant professor and graduate student at Florida State University College of Medicine, telegraph approval of the HPV vaccine with comments like \"... men are no more likely to want the vaccination just because they could help protect their female sexual partners.\" and \" \"Thinking about the benefit to their own health -- protection against rare genital cancers and genital warts -- is all men really need to know\"", "lang": "en", "keywords": "educate-yourself.org, gardasil, merck, gardasil deaths, gardasil adverse reactions, whitney baird,  jenny tetlock, lou gehrig's disease, als, texas govenor rick perry, gardasil mandatory vaccination progrm, Mary Gerend, assistant professor at the Florida State University College of Medicine, and Jessica Barley, a Florida State psychology graduate, spain recalls 76,000 gardasil doses, seizures,", "favicon": "", "canonical": "https://educate-yourself.org/cn/hpvshotmennotconvicnced03jun09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Florida State Study Promotes Gardasil 'Benefits', Despite 32 U.S. Deaths to Date (June 4, 2009)", "cleaned_text": "[Editor's Note: I found this item linked at www.rense.com on June 3, 2009. I assumed it was an anti-vaccination article, as Jeff Rense is opposed to vaccines in general, but especially opposed to the promotion of HPV (human papillomavirus) vaccines, such as Merck's Gardasil, which the CDC reported (between June 8, 2006 and December 31, 2008) caused 11,916 adverse reactions to the vaccine and the death of 32 young women and girls so far including 22 year old Whitney Baird who died only 13 months after getting the Gardasil vaccine, and 15 year old Jenny Tetlock who died on March 15, 2009 from the degenerative paralysis of ALS (Lou Gehrig's disease) acquired soon after being vaccinated with Gardasil. After carefully reading this UPI article, I can see that it's more of a promotion of HPV vaccines rather than a criticism. Without identifying Gardasil by name, the statements made below by an assistant professor and graduate student at Florida State University College of Medicine, with comments like \"... men are no more likely to want the vaccination just because they could help protect their female sexual partners.\" and \" \"Thinking about the benefit to their own health -- protection against rare genital cancers and genital warts -- is all men really need to know\"\n\nRecall that Texas Governor Rick Perry attempted to ram through a \"directive\" through the Texas legislature last year that attempted to make Gardasil vaccinations MANDATORY for pre-teen and young teenage girls in Texas. Fortunately, enough Texans saw through Perry's duplicitous and self-enriching motives for marketing Merck's poisons that the \"mandatory\" part was withdrawn (what needs to be withdrawn is Rick Perry {and Illuminati stooges like him} from ever holding public office again).\n\nRead the articles posted below by the cousin of Whitney Baird and watch the Youtube video embedded reviewing the deceit and fear mongering employed by Merck and their proxies to sell Gardasil as something safe and 'wonderful' when it's nothing more than a deadly money maker ($500 for a series of 4 shots) that has caused pain and suffering..and death for far too many deceived American families...Ken Adachi] \n\n\n\nFlorida State Study Promotes Gardasil 'Benefits', Despite 32 U.S. Deaths to Date (June 4, 2009)\n\nTALLAHASSEE, Fla., June 3 (UPI) -- Telling men that getting a human papillomavirus vaccine would help protect their female partners wouldn't convince them to get the shot, U.S. researchers say.\n\nMary Gerend, assistant professor at the Florida State University College of Medicine, and Jessica Barley, a Florida State psychology graduate who based her honors thesis on the study, found that men are no more likely to want the vaccination just because they could help protect their female sexual partners.\n\nThe HPV vaccine has been approved for women since 2006 and a vaccine for men is likely to be approved in the near future, the researchers said.\n\n\"You can probably interpret this finding in a number of ways,\" Gerend said in a statement. \"Thinking about the benefit to their own health -- protection against rare genital cancers and genital warts -- is all men really need to know; telling them all that extra stuff really isn't going to push them one way or another.\"\n\nThe study was published in the journal Sexually Transmitted Diseases. Gerend also presented the findings at the annual meeting of the Society of Behavioral Medicine in Montreal\n\nSpain Recalls 76,000 doses of Gardasil Following Siezures in Two Young Girls\n\nFriday, March 27, 2009 \n\n \n\n Two Girls Down; and Spain Withdraws Gardasil\n\n Category: News and Politics\n\nblogs.myspace.com/erin_brockovich\n\n by Erin Brocovich\n\n \n\n I'd like to take a moment here to remember, Jenny Tetlock, whose story has been publicized. Jenny Tetlock received the Gardasil shot at 15, was paralyzed and God rest her soul, passed last week.\n\nBless you Jenny. Your story is heartbreaking, and we all feel your loss.\n\nAnd Jenny, we want to find answers. Who knows where to look? Not to the CDC. Maybe to Spain. Why Spain?\n\nA month ago, Spain recalled 76,000 doses of the HPV vaccine when two adolescent girls got seriously sick after getting their shot. We've had more than two girls get sick, and to my knowledge NO doses of the vaccine were ever recalled here. The issue is that two girls got sick and Spain responded immediately.\n\nHas our FDA done anything? Not to my knowledge.\n\nIf we came across 50, 40, 30 or even a single dead person in the woods, our agencies would send out alerts; they would investigate. They would search and search and search for the answers until they were found. The VAER Database Gardasil line reports that list more than a dozen deaths among the serious adverse events of otherwise healthy girls should be enough of an alert that someone among us should step up and search and search and search for the answers until they were found. There is a common denominator that we haven't yet exposed. That's my point. We must uncover that lethal factor; we must identify it so that no more girls die needlessly.\n\nBut here it is in black and white Spain withdraws cervical cancer shot after illnesses.\n\nLet's let it pass that Gardasil is an HPV vaccine, not a cancer shot. (That's a marketing angle to avoid talking about the percentages. Let's let it pass that while it is marketed as a cancer preventative, it only goes after 4/30 of the HPV strains that cause 70% cervical cancers. That works out to something like 9%. Would you use a prophylactic that only guards against 9% of pregnancies? Should we let people go around thinking they're protected when they're 91% vulnerable?) Let's let all that pass, for now, and think about the human cost of rushing to market.\n\nThe two girls in Spain who had the vaccine both went into convulsions. They both went into convulsions within hours of taking the vaccine.\n\nSo Spain has decided to recall 76,000 doses of Gardasil after two girls had seizures. But the FDA has not --after more than two girls have died. Does Spain love its daughters more than the US?\n\nWhy hasn't the FDA acted on the incidents which have happened here? Are the FDA and CDC really on top of things? Is the US looking at the VAERS LIST to see how many girls in the US have had adverse reactions after taking Gardasil, let alone those who have died?\n\nBut in Spain, 2 girls had seizures--only seizures, they didn't die--and in Spain 76,000 doses of Gardasil were recalled.\n\nVAERS Reports are available online. You can run them yourself here. The results show significantly more than 2 incidents related to Gardasil. All girls had one thing in common; the Gardasil shot.\n\nSpain has recalled 76,000 doses of Gardasil. Meanwhile the US is trying to mandate its use. What is wrong with this picture?\n\nAt the very least, the use of Gardasil should be elective. Its use should be a matter of choice. As Americans, our young girls and their parents should have the choice to make their own decisions, good decisions, for the sake of their health. To avoid becoming statistics, to safeguard their health, they should go into making that choice armed with the knowledge of all of the contraindications and negative interactions. Shouldn't the FDA and CDC at least be LOOKING for contraindications and negative interactions?\n\nAnd of course, we still have the unanswered questions of why so many American girls have had adverse reactions and died after taking Gardasil. They and their families deserve an answer. But for the seven women I know whose daughters have died after taking Gardasil, and for Jenny, no matter how soon the answer is found, it is too late.\n\nWhitney Baird, 22, died in August 2008 from paralsis of ALS acquired by taking Gardasil vaccine 13 months earlier\n\nPosted by Leslie\n\n From Will n Tere’s Blog\n\n April 10, 2009\n\n\n\n9 Months ago I lost a cousin. Not just a cousin, the most amazing sweet spirited cousin ever! Her name was Whitney Baird. Most of you probably knew her, went to school with her, or were acquaintances with her some how. Whitney got ALS thru a shot called Gardasil. It is to help prevent HPV (sexually transmitted infections ) and also to protect girls from Cervical Cancer. Whitney was on her mission in Texas when it hit her. She tried everything she could do to stay on her mission. She kept on going even after her arms had stopped working, she couldn’t do a whole lot for her self. Luckily she had a great mission companion to help her through. When Whitney fell, it changed her life. She came back to Utah and went through test to find out that she had gotten ALS. During the last few month of Whitney’s life she couldn’t move her arms, she could hardly walk, and depended on her family. She is just one case of many that have passed away from this “life saving” shot. Whitney was 22 years old when she left us to continue her mission where God must have needed her.\n\nLast night, Chelsey (Whit’s sister) and I were talking about how they still have commercials and posters up about how this could save your life, save your daughters life how they can be one less to get Cervical Cancer and Chelsey informed me that the doctors get commission on each shot that they give to every girl [note from Ken Adachi: can anyone confirm this?]. So of course they are going to push it, tell you how wonderful it is. But it has ruined many lives, not just the young girls that have gotten sick from it but their families, friends, and loved ones.\n\nPlease re post either this or something about Gardasil to help prevent even just one girl, could be your sister, your friend, or your daughter from getting this shot and saving their life. Down below are links to many different websites that have more information on Gardasil and the risks and dangers of it.\n\nPlease visit these site. Share these sites.\n\nI dont know why, I just felt as if I needed to post or say something about this. Chelsey and I were talking about what we could do to get it out that it's not okay for girls to get this shot, and I just felt as if this is one step that I could take or that you could take to saving a life.\n\n Posted by will and tere at\n\nIf you liked my post, feel free to subscribe to my rss feeds\n\nThis entry was posted by Leslie on April 13, 2009 at 1:27 pm and filed under Cervarix, Cervical Cancer, Gardasil, HPV, Human Papillomavirus, Mothers & Daughters, Sexually Transmitted Diseases, Vaccinations. Bookmark the permalink. Follow any com\n\nThousands Have Gotten Sick from Gardasil HPV Vaccine\n\nThe safety of the HPV vaccine was studied in 5 clinical trials before it was licensed. There were over 21,000 girls and women ages 9 through 26 in these clinical trials. Since it was licensed, CDC and FDA have been closely monitoring the safety of the HPV vaccine. There are 3 systems used to monitor the safety of vaccines after they are licensed and being used in the U.S. These systems can monitor side effects already known to be caused by vaccines as well as detect rare side effects that were not identified during a vaccine's clinical trials. The 3 systems are:\n• The Vaccine Adverse Event Reporting System (VAERS)--a useful early warning public health system that helps CDC and FDA detect possible side effects or adverse events following vaccination.\n• The Vaccine Safety Datalink (VSD) Project--a project between CDC and 8 health care organizations to study patterns in reports detected by VAERS and determine if a vaccine is causing a side effect.\n• The Clinical Immunization Safety Assessment (CISA) Network--a project between 6 academic centers in the U.S. which conduct research on adverse events that might be caused by vaccines. As of December 31, 2008, more than 23 million doses of Gardasil were distributed in the United States. As of December 31, 2008, there were 11,916 VAERS reports of adverse events following Gardasil vaccination in the United States. Of these reports, 94% were reports of events considered to be non-serious, and 6% were reports of events considered to be serious. Based on all of the information we have today, CDC continues to recommend Gardasil vaccination for the prevention of 4 types of HPV. As with all approved vaccines, CDC and FDA will continue to closely monitor the safety of Gardasil. Any problems detected with this vaccine will be reported to health officials, healthcare providers, and the public, and needed action will be taken to ensure the public's health and safety. VAERS defines non-serious adverse events as those other than hospitalization, death, permanent disability, and life-threatening illness. The vast majority (94%) of the adverse events reports following Gardasil have been non-serious. Reports of non-serious adverse events after Gardasil vaccination have included fainting, pain and swelling at the injection site (the arm), headache, nausea and fever. Fainting is common after injections and vaccinations, especially in adolescents. Falls after fainting may sometimes cause serious injuries, such as head injuries, which can be easily prevented by closely observing the vaccinated person for 15 minutes after vaccination. VAERS defines serious adverse events as adverse events that involve hospitalization, death, permanent disability, and life-threatening illness. As with all VAERS reports, serious events may or may not have been caused by the vaccine. All serious reports (6%) for Gardasil have been carefully analyzed by medical experts. Experts have not found a common medical pattern to the reports of serious adverse events reported for Gardasil that would suggest that they were caused by the vaccine. The following is a summary of selected serious adverse event reports that were submitted to VAERS between June 8, 2006 and December 31, 2008. Guillain-Barré Syndrome (GBS) has been reported after vaccination with Gardasil. GBS is a rare disorder that causes muscle weakness. It occurs in 1-2 out of every 100,000 people in their teens. A number of infections can cause GBS. There has been no indication that Gardasil increases the rate of GBS in girls and women above the rate expected in the general population, whether or not they were vaccinated. Rarely, people have reported blood clots after getting Gardasil. These clots have occurred in the heart, lungs, and legs. Most of these people had a risk of getting blood clots, such as taking oral contraceptives (the birth control pill). As of December 31, 2008, there have been 32 U.S. reports of death among females who have received the vaccine. There was no common pattern to the deaths that would suggest that they were caused by the vaccine. More information is available at: Reports of adverse events after getting a vaccine can be submitted to VAERS by fax at 1-877-721-0366, online at https://secure.vaers.org/VaersDataEntryintro.htm, or by mail to Vaccine Adverse Event Reporting System, P.O. Box 1100, Rockville, MD 20849-1100.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "425", "height": "344", "embed_code": "<object width=\"425\" height=\"344\"><param name=\"movie\" value=\"http://www.youtube.com/v/XK97CHQZhq0&amp;hl=en&amp;fs=1&amp;\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/XK97CHQZhq0&amp;hl=en&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"425\" height=\"344\"/></object>", "src": "http://www.youtube.com/v/XK97CHQZhq0&hl=en&fs=1&"}], "links": ["#CDCGardasilReport", "#WhitneyBaird", "http://jenjensfamily.blogspot.com/2009/03/in-memory-of-jenny.html", "http://educate-yourself.org/cn/hpvshotmennotconvicnced03jun09.shtml", "http://www.gardasilhpv.com/2009/03/jennys-journey-ends-gardasil-questions.html", "http://drtenpenny.spaces.live.com/Blog/cns!A8A375DEBD233B9C!119.entry", "http://www.ennislaw.com/gardasil_news_03212009b.html", "http://vaccineawakening.blogspot.com/2009/02/gardasil-death-brain-damage-national.html", "http://www.youtube.com/watch?v=XK97CHQZhq0", "http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=68454", "http://www.judicialwatch.org/gardasil", "http://www.gztongyi.com/2009/HEALTH/expert.q.a/05/11/gardasil.safety.shu/index.html", "http://www.wired.com/wiredscience/2007/05/hpv_vaccine_gar/", "http://articles.mercola.com/sites/articles/archive/2007/12/22/thousands-have-gotten-sick-from-gardasil-hpv-vaccine.aspx", "http://www.nvic.org/Vaccines-and-Diseases/hpv.aspx", "http://www.cdc.gov/vaccines/recs/acip/downloads/mtg-slides-oct08/12-3-hpv.pdf", "https://secure.vaers.org/VaersDataEntryintro.htm"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}