{"result_id": "105039", "URL": "https://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "timestamp": "2023-04-25 15:02:06 CEST+0200", "meta": {"description": "Nov. 29, 2011. The pharmaceutical industry has a long history of of seeking a vaccine that would covertly sterilize whole populations So, in addition to being contaminated with cancer and other viruses, and with the bacteria mycoplasma, vaccines are intentionally \"contaminated\" with a chemical as well, which is, given the patent, a \"patently\" sought-after sterilizing agen", "lang": "en", "keywords": "ccine sterilize young women, population reduction, vaccine dangers, guardasil, polio vaccine dangers, maurice hellerman, merck pharmaceuticals, deception, population reduction, sterilize young females via vaccines, sterility by vaccines, hiv, aids,", "favicon": "", "canonical": "https://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "ALL the Vaccines Are Contaminated - Every Last One of Them (Nov. 29, 2011)", "cleaned_text": "ALL the Vaccines Are Contaminated - Every Last One of Them\n\n\"The chief, if not the sole, cause of the monstrous increase in cancer has been vaccination\" - Dr. Robert Bell, once Vice President International Society for Cancer Research at the British Cancer Hospital\n\n[Editor's Note: Recall that the Second Village Idiot from Texas, Rick Perry, attempted to make Gardasil, a mandatory vaccination for 14 year old girls in Texas a few years ago. Thankfully, the Texas legislature overturned his \"Governor's directive order\" ...Ken]\n\nALL the Vaccines Are Contaminated - Every Last One of Them (Nov. 29, 2011)\n\n(WASHINGTON, D.C.) - Have you been rushing out to get a yearly flu vaccine or diligently taking your children for the 40 or so mandated childhood vaccines?\n\nThat's really a shame because you have unwittingly been trading a run-of-the-mill flu or just the measles, for loading up your or your children's bodies with cancer and other deadly viruses, a destructive bacteria, a chemical selected to damage fertility, and with synthetic DNA that threatens to damage your own DNA - the biologic code for your existence.\n\nWho is saying the vaccines are contaminated?\n\nNone other than the (now deceased) head of vaccines at Merck, Dr. Maurice Hillerman, who on camera admitted that Merck's Hepatitis B vaccines, contaminated with a virus, caused the AIDS epidemic in the US. He went on to say that all of Merck's vaccines are contaminated with cancer and other viruses. (The US government has conceded the HEB B vaccine causes Lupus. That vaccine is mandated for every infant in the US on the day of birth, and is associated with MS as well.)\n\nThat vaccine is mandated for every infant in the US on the day of birth, and is associated with MS as well.)\n\nFor Jews who have almost religiously believed in medical authorities about vaccines and poo-pooed those worried about the safety of vaccines, they might want to notice that Hillerman was Jewish.\n\nOr they might recognize that so is Dr. Larry Palevsky, a board certified NY pediatrician, who for ten years routinely gave vaccines to his patients until he noticed them losing eye contact and then began looking into the vaccines he had blindly trusted. He found that they are ALL contaminated with viruses that are so small they can never be removed. He no longer gives any vaccines. He now treats his young patients for autism and other neurologic injuries from vaccines.\n\nDonald W. Scott, the editor of The Journal of Degenerative Diseases and the co-founder of the Common Cause Medical Research Foundation, links vaccines to AIDS (as did Hillerman) and to US bio-weapons research, and says they are contaminated with mycoplasma, a primitive bacteria that takes apart cell walls.\n\nPerhaps the highest scientific authority saying vaccines are contaminated is Dr. Garth Nicolson. He is a cell biologist and editor of the Journal of Clinical and Experimental Metastasis, and the Journal of Cellular Biochemistry. He is one of the most cited scientists in the world, having published over 600 medical and scientific peer-reviewed papers, edited over 14 books, and served on the editorial boards of 28 medical and scientific journals. He is not just saying that vaccines are contaminated with mycoplasma but is warning the US that they are. Nicolson goes further and says that we are all being damaged by them and contracting chronic degenerative diseases that.\n\nThat damage translates into lifelong patients (and thus life-long profit) for the pharmaceutical industry making the vaccines and he says doesn't appear to be accidental.\n\nAccording To CIA Statistics: As Shots Increase, U.S. Lifespan Is DECREASING\n\n1980: 9 vaccines, autism is rare\n\n 2009: 36 vaccine$ before age 5\n\n 2010: 55 vaccine$ before age 6\n\nAll the vaccines mandated to children and many other vaccines as well, including the seasonal flu vaccines being mandated to health care workers, are contaminated with polysorbate 80, the central ingredient in a pharmaceutical industry patent to damage fertility. The pharmaceutical industry has a long history of of seeking a vaccine that would covertly sterilize whole populations So, in addition to being contaminated with cancer and other viruses, and with the bacteria mycoplasma, vaccines are intentionally \"contaminated\" with a chemical as well, which is, given the patent, a \"patently\" sought-after sterilizing agen\n\nBeyond containing polysorbate 80 and cancer and other viruses, and likely mycoplasma, the Gardasil vaccines are contaminated in an additional way. It and all the new vaccines are contaminated with genetically engineered DNA. It can contaminate people's DNA, just a genetically engineered crops can contaminate normal crops. Gardasil itself is contaminated with a man-made version of the HPV DNA, the very virus it was supposed to protect against, which now it threatens not only altering kids' healthy DNA with synthetic DNA (!) but with a diseased version.\n\nGardasil was suspended in India after 4 girls died but the killing has gone on in the US despite the confirmed deaths of 100 girls. and now the CDC, with special ties to Merck, its maker, wants all boys to take it, too.\n\nInformed consent is the core of the Nuremberg Code that was created by the Nuremberg Tribunal to keep the pharmaceutical industry from ever again committing the hideous \"medical\" abuses it did during the Holocaust. In California, Jerry Brown is dismantling informed consent in order to get these deadly vaccines associated with infertility, into all school children. And it was during the Holocaust that the pharmaceutical experimented on Jewish women prisoners at Auschwitz to develop a vaccine that sterilized covertly. Henry Kissinger recommended the development of covertly sterilizing vaccines in a major report to the US government and as late as 2009 a Finnish Health Minister said he was behind the H1N1 vaccine that was meant to lower population.\n\nJerry Brown has just signed into law a bill that will allow children as young as 12 to decide whether to take a vaccine for sexually transmitted disease. Parental consent is not needed and parents will not even be allowed knowledge as to whether the child has taken the vaccine. Merck's Hepatitis B vaccine is one that is included, as is another Merck vaccine, Gardasil, allegedly for ovarian cancer. A Gardasil researcher says there is no evidence it works. \"This raises questions about the CDC's recommendation that the series of shots be given to girls as young as 11-years old. 'If we vaccinate 11 year olds and the protection doesn't last... we've put them at harm from side effects, small but real, for no benefit,' says Dr. Harper. 'The benefit to public health is nothing, there is no reduction in cervical cancers … ' \"\n\nCurrent Data for Gardasil up to AUG 12, 2011\n\nBut these figures are based on statistics from medical professionals who do not wish to be sued. In reality, \"less than 10% of deaths, seizures, paralysis, etc., are being reported as caused by the vaccinations that doctors gave in their office.\n\nThe following real-world estimates are based on reports from a law firm:\n\nThe California law even approves in advance, ALL yet-to-be made (and completely untested) vaccines for sexually transmitted diseases, though of the two current Merck vaccines they are pushing on children, one Merck vaccine caused AIDS and causes Lupus and the other Merck vaccine is contaminated in multiple ways and proving highly lethal. Children will be the ones decide whether to take the vaccines, and they will make that decision after being forced to see videos of people dying terrible deaths from cancer. Not only would the vaccine be given without parental consent, but parents are denied knowledge that the vaccine is going to be given or that it was given. If the child has a seizure or dies afterward, parents may not see their own children's medical records.\n\nThis is what is left of the \"informed consent\" meant to provide human rights to protect the world from pharmaceutical industry abuses against mankind.\n\nAfter World War II, it was Merck which received the flight capital of the pharmaceutical industry indicted for crimes against humanity, human enslavement and mass murder.\n\nIn the case of children, rather than their facing childhood diseases of insignificant threat, they are, by legal mandate, being bombarded repeatedly throughout their childhood with viruses that cause diseases (including cancer), a cell-destroying bacteria, a a threat to the very integrity of their DNA, and a chemical specifically chosen to impair fertility. And laws are being written to add to the already long list of vaccines they must take, including two mandated Merck vaccines. One is an old Merck vaccine that caused AIDS and is causing Lupus. The other is a Merck vaccine claiming to prevent cervical cancer though girls have little chance of contracting it in the first place (and boys, none!) and it can easily be detected by pap smear and treated successfully and there is NO evidence the vaccine prevents it. Meanwhile, it is killing children.\n\nContamination of the polio vaccine and the continuing effects\n\nFACT: Before the Polio Vaccine, there had never been a virus from another species deliberately injected into humans.\n\nFACT: 61% of all human tumors (at autopsy) now contain the SV40 monkey virus, traceable to the Polio vaccine of the 1950s and 60s\n\nFACT: CUTTER vaccine division and WYETH produced a deadly Polio vaccine with a live virus that actually gave the recipient POLIO\n\nFACT: All above information was withheld from the public for years to avoid a public panic and to prevent a loss of faith in vaccines. polio was a very rare infectious disease that presented little risk to the public, but the risk was greatly exaggerated by the Polio Foundation before the introduction of the polio vaccine, the miracle vaccine - contaminated with a monkey virus which has been the cause of soft tissue cancers for decades since.\n\nThough facing no serious health risk, people are paying to have their bodies contaminated by contaminated vaccines. In taking vaccines, they are trading the minimal risk of even contracting common diseases and which themselves are rarely dangerous and can be treated if contracted - for the absolute certainty of loading their bodies with\n\nThey are doing this because they are being terrorized by their own government with false information on the risks of various diseases and denied critical information on the scientific risk of the vaccines.\n\nThose vaccines without a doubt threaten their own and their children's fertility, and their very lives.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://educate-yourself.org/cn/index.shtml#top", "/intro.shtml#top", "https://educate-yourself.org/cs/index.shtml#top", "/ct/index.shtml#top", "/cn/sylphandchemtrailindex.shtml", "/ed/", "/fc/", "/ozone/", "/immunboosting/", "/nutrition/", "/nch/", "/mbc/index.shtml#top", "http://educate-yourself.org/ozone/index.shtml#top", "/be/", "/fc/drugstory.shtml", "http://educate-yourself.org/vcd/index.shtml#top", "/cancer/", "/newsletter/", "/nwo/", "/nwo/nwonewsindex.shtml", "/ps/", "/mc/casboltintro08sep08.shtml", "/products/pslastlecturedescrip.shtml", "/ab/", "/tjc/", "/mc/", "http://educate-yourself.org/mc/index.shtml#top", "http://educate-yourself.org/tg/index.shtml#top", "http://www.metatech.org/wp/", "/fe/", "/pnl/index.shtml", "/cn/robertbitzer04oct05.shtml", "/cn/lobsangrampaintrograybarker07oct05.shtml", "/tjc/ruthdrownuntoldstory.shtml", "/zsl/index.shtml", "/db/index.shtml", "/lte/globalwarming13sep06.shtml", "/mc/spooklandtricks19oct06.shtml", "/cn/awakenedvetsindex.shtml", "http://educate-yourself.org/cn/eustacemullins2005videointerview05mar15.shtml#top", "http://educate-yourself.org/cn/billcoopernwostructure21oct14.shtml#top", "/du/index.shtml", "/dow/index.shtml", "/pnt/index.shtml", "/cn/britishisraelhiddenhand10jul05.shtml", "http://educate-yourself.org/cn/fundamentalistbrainwashing06jun05.shtml", "/cn/amygoodmangatekeeper27aug05.shtml", "/cn/noamchomskyindex.shtml", "/re/index.shtml", "/cn/projectbluebeam25jul05.shtml", "http://tarpley.net/online-books/george-bush-the-unauthorized-biography/", "http://educate-yourself.org/cn/familythatpreystogethercompared24aug07.shtml", "/cn/zetainfo16sep05.shtml", "/dc/dclatestonmctowerarrays25may02.shtml", "/cpd/index.shtml", "http://emfrefugee.blogspot.mx/", "http://educate-yourself.org/cn/cpsabuseinmichigan14aug05.shtml", "/cn/adrenalburnout19apr05.shtml", "/ww/index.shtml", "/dc/orgoneadventuresindex.shtml", "/cn/johncolemancommof300order14mar05.shtml", "/jm/index.shtml", "http://www.savethemales.ca/", "http://educate-yourself.org/vcd/kenadachiradiointerviewindex.shtml#top", "http://www.cabaltimes.com/2009/07/31/ten-best-conspiracy-websites/", "/cn/mercuryfreedentristy2000.shtml", "http://educate-yourself.org/cn/huldaclarkbooks.shtml#top", "/cn/planetXsequel15jul;04.shtml", "/cn/undocumentedimmigrants01may06.shtml", "http://educate-yourself.org/cn/donaldmarshallinterviews30jul14.shtml", "http://educate-yourself.org/cn/robertswaronterrorhoax04feb09.shtml", "/cn/tavistockarticlesindex04jun04.shtml", "/cn/uscconcentrationcamps28jun01.shtml", "/cn/femaoverview06sep05.shtml", "/cn/aliensarecomingprelude16apr05.shtml", "/cn/rulesoftheroad13principles06jul05.shtml", "/lte/globalwarming13sep06.shtml", "/cn/gangstalkingoverview15sep06.shtml", "/cn/monoatomicgoldthinktwice15aug05.shtml", "http://educate-yourself.org/mbc/sethcreationofmatter.shtml#top", "http://educate-yourself.org/cn/megrethoughtscreatereality12aug14.shtml#top", "http://educate-yourself.org/mbc/ethelrowespiritualismApart28nov11.shtml", "/cn/torkomsaraydarianhope24apr06.shtml", "/cn/greywolffeelingforms15mar06.shtml#top", "/cn/howtovanquishfear23may07.shtml", "http://educate-yourself.org/mc/preventalienmilitaryabductionsapr05.shtml", "/ga/RFcontents.shtml", "/cn/smedleywarisracket.shtml", "/lte/index.shtml", "http://educate-yourself.org/cn/sodomdocumentary17oct14.shtml#top", "http://educate-yourself.org/cn/johncolemangoalsofIlluminati.shtml#top", "http://educate-yourself.org/cn/strawmanillusion02apr10.shtml", "/cn/blogindex.shtml", "/hp/index.shtml", "http://educate-yourself.org/cn/protocolsofsion.shtml#top", "http://educate-yourself.org/cn/ericjonphelpsexposed1part24oct08.shtml#top", "http://educate-yourself.org/cn/eranefratiarrested03aug14.shtml", "http://educate-yourself.org", "http://educate-yourself.org/cn/fukushimaradiationhysteriaindex.shtml#top", "http://educate-yourself.org/cn/agenda21explained18may14.shtml#top", "http://educate-yourself.org/cn/detectandtreatparasites12aug12.shtml#top", "http://educate-yourself.org/vcd/swinefluindex.shtml", "/links.shtml", "http://educate-yourself.org/cn/janetrippintro20aug14.shtml#top", "http://groups.yahoo.com/group/Educate-Yourself_Forum/", "http://tinyurl.com/ya6noao6", "http://educate-yourself.org/dc/orgonegenindex.shtml#top", "http://educate-yourself.org/cs/index.shtml#top", "http://educate-yourself.org/cn/microwavedangersindex.shtml#top", "http://educate-yourself.org/contactus/index.shtml#top", "http://educate-yourself.org/contactus/index.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=de&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=es&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=nl&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=fr&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=ru&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=et&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=cs&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=pl&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=el&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=pt&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=en&to=it&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=ja&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=fi&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=sv&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=ro&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=da&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=tr&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=hu&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.microsofttranslator.com/bv.aspx?from=&to=bg&a=http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://educate-yourself.org/cn/hpvshotmennotconvicnced03jun09.shtml", "http://educate-yourself.org/vcd/allvaccinescontaminated29nov11.shtml", "http://www.youtube.com/watch?v=GvsXrVkjyz4", "http://childhealthsafety.wordpress.com/2011/04/25/us-concedes-hep-b-causes-lupus/", "http://articles.mercola.com/sites/articles/archive/2009/11/14/Expert-Pediatrician-Exposes-Vaccine-Myths.aspx", "http://www.youtube.com/watch?v=Tk-RMI4qNvA", "http://www.youtube.com/watch?v=lU12h6lWi9I&NR=1", "http://voices.washingtonpost.com/checkup/2009/10/embargoed_till_monday_oct_5_12.html?wprss=checkup", "http://www.ncbi.nlm.nih.gov/pubmed/11015514?dopt=AbstractPlus", "http://www.ncbi.nlm.nih.gov/pubmed/11015514?dopt=AbstractPlus", "http://www.salem-news.com/articles/november072011/experiments-auschwitz-rg.php", "http://organichealthadviser.com/archives/polysorbate-80-in-swine-flu-vaccines-infertility-in-humans", "http://goog_1613772300/", "http://coto2.wordpress.com/2011/07/17/murdoch-and-vaccines-exposure-of-murdochs-crimes-expose-a-much-larger-story/", "http://coto2.wordpress.com/2011/09/15/in-6-countries-mercks-gardisil-contaminated-with-ge-viral-hpv/", "https://rdt.mercola.com/view.aspx?Email=llcohencole@gmail.com&ReturnURL=http://articles.mercola.com/sites/articles/archive/2011/11/15/bills-that-restrict-californian-health-freedom.aspx?e_cid=20111115_DNL_art_2", "http://community.babycenter.com/post/a7628435/gardasil_cause_of_infertility", "http://www.salem-news.com/articles/november072011/experiments-auschwitz-rg.php", "http://www.thepetitionsite.com/1/a-universal-declaration-of-resistance-to-mandatory-vaccinations/", "http://www.youtube.com/watch?v=AHur7u13woc", "http://educate-yourself.org/cn/hpvshotmennotconvicnced03jun09.shtml", "http://www.cbsnews.com/stories/2009/08/19/cbsnews_investigates/main5253431.shtml", "http://www.cdc.gov/std/hpv/STDFact-HPV-vaccine-young-women.htm", "http://www.monheit.com/vaccines/what.shtml", "http://www.monheit.com/vaccines/what.shtml", "http://www.whale.to/b/nazi_allopathy.html", "http://www.jinipatelthompson.com/html/2.html", "http://deathbyvaccination.com/", "http://rense.com/general94/bill.htm", "http://www.whale.to/vaccine/bayly.html", "http://articles.mercola.com/sites/articles/archive/2009/10/24/CBS-Reveals-that-Swine-Flu-Cases-Seriously-Overestimated.aspx", "http://www.thinktwice.com/s_misc.htm", "http://educate-yourself.org/vcd/"], "authors": ["Ken Adachi"], "publish_date": null}