{"result_id": "105029", "URL": "https://educate-yourself.org/cn/blockingmwsignals8may03.shtml", "timestamp": "2023-04-25 15:02:01 CEST+0200", "meta": {"description": "Alternative Therapies - Electro-Medicine, Ozone Therapy, Nutritional Therapies, Colloidal Silver, etc.  Protection from new emerging diseases & biological attack through immunity boosting.", "lang": "en", "keywords": "blood electrolysis, non-drug therapies, electro-medicine, zapper, oxygen therapies, ozone, hulda clark, colloidal silver, royal raymond rife, georges lakhovsky, multi-wave oscillator, electromedicine, blood cleaners, gerson therapy, budwig diet, vaccines, nutitional, vaccinations, emerging diseases, nikola tesla, brain tuner, cure for AIDS, cure for cancer, scalar waves, magnetic pulser, alternative medicine, hanta, red tide, pfiesteria, curative plants, MRT, bob beck, dr joanna budwig, secret of life, waves that heal, dowsing, holistic, health, natural, len horowitz, immunity boosting, AIDS, cancer, Dr Robert O Becker, the body electric, cross currents, meditation, tesla coil, meningitus, flesh-eating bacteria, mad cow disease, suppressed, urine therapy, anthrax, virus, virii, ebola, flax seed oil, sodium ascorbate, cayenne pepper, capsicum, james clerk maxwell, F Batmanghelidj, mwo, juicing, supplements, vitamin c, vegetarianism, dairy, milk, fiber, your body's many cries for water, mcdougall program, immune system, diet for a new america, john robbins, borderlands", "favicon": "", "canonical": "https://educate-yourself.org/cn/blockingmwsignals8may03.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "How to Block Microwave Mind-Programming Signals by Montalk", "cleaned_text": "This article describes a simple way to lessen intrusive EM radiation in your home or apartment. A large source of dangerous EM radiation comes in the form of microwaves emitted by cell phone towers. From personal experimentation, and hearing the experiences of others, I am convinced that some of these microwaves are being purposely beamed at us with the aim of muddling our thoughts, altering our physical energy levels, reducing our willpower, and maybe even subliminally implanting thoughts and coercive emotional signatures in our minds. They may also be used for monitoring purposes.\n\nCertain observations have been made about these signals:\n\n1) they tend to be beamed through the window of a room where one spends the most time, usually the window facing the\n\n2) they are specifically directed to target and track a person inside his home\n\n3) the tracking speed is slow, and when the target moves, the signal takes several seconds or minutes to search and find the target at his new location.\n\n4) when the target enters an area in his home that the signal cannot reach, the signal goes on a wide search mode, thinking the target has left his home and is traveling about town.\n\n5) when the primary window is blocked off, the signal finds another window or thin wall to penetrate\n\n6) one can feel the effects of this signal, which may induce a dull headache or pressure in the temples\n\nI believe cell phone towers are used to generate these signals. HAARP may play a part in this as well. A targeted person is tracked, either via some signature characterized by the resonant characteristics of his skull or DNA, or by tracking signals emitted by implants put into him during abductions, or perhaps by more sophisticated methods. Computers perform the calculations necessary to alter the signal of each of three cell phone towers so as to triangulate a hotspot of signal at the target's location. When the target moves, new calculations have to be made, which takes several seconds.\n\nThese signals consist of microwave carriers with ELF modulation and audio encoded messages.\n\n1) the microwaves resonate with DNA, can penetrate flesh and bone, pass through some walls and windows, and are already in use by cell phones.\n\n2) these signals entrain brainwaves into a high-beta state, which causes aggression and stress, or an alpha level that induces hypnotic states and muddled thinking.\n\n3) Besides the ELF waves that entrain one's brain, there are also other signals consisting of audio messages. I have not verified what these messages are, but they could be something along the lines of \"You are angry, You cannot think, You give up, You have no energy, etc...\" These audio messages could be modulated into the microwave carrier via frequency modulation, while the ELF brain-entrainment signals could be amplitude modulated.\n\n4) There may also be emotional signatures frequency-modulated into the carrier. These can induce anger, frustration, sadness, or essentially any human emotion into susceptible targets\n\nWho is responsible for all this? Probably shadow factions of the military/intelligence community associated with the One World Government. They wish to keep the population docile, and keep all dissenters from acting upon their dissenting thoughts. Maintaining order means that what is to be controlled must be predictable, and so as long as people are docile, they are predictable and hence controllable. This ensures the superiority and stability of those in control.\n\nThere are two things you can do. First, you can learn to better cope with these signals. The more you are in control of your own mind and emotions, and the more observant you are about your own behavior, the less influence these signals have upon your thoughts, feelings, and behavior. Knowing is half the battle. Second, you can take additional steps to reduce the level of EM radiation in your home, by blocking these signals.\n\nStandard methods of blocking microwave mind programming signals consist of Faraday cages and aluminum foil hats. But Faraday cages are difficult and expensive to build. Aluminum foil hats actually increase one's signal exposure unless they are grounded, and as long as one's skin does not touch the foil.\n\nAn easy, and relatively cost-effective, way to block microwaves goes as follows:\n\n*several emergency foil blankets, which come in small folded packs, found in the camping section of department stores ($3 each)\n\n *alligator clips, banana plugs, and speaker wire from Radio Shack\n\n *duct tape or masking tape\n\n * RF / MW signal detector, optional but recommended. They are expensive, and the cheapest one that works well is the \"Suresafe RF Signal Detector\", which costs $110.\n\n* If you cannot afford a signal detector, take your best guess at which windows or walls to cover. An ideal choice would be the corner or wall closest to your bed. Any protection is better than no protection.\n\n2) Use a soldering iron to make these:\n\n* (4) 3 feet sections of speaker wire. One end with a banana plug, other end with alligator clip\n\n * (4) 4 feet sections of speaker wire. Both ends with alligator clips.\n\n3) Use signal detector to record the relative signal strength from all windows in the room you wish to protect, preferably the office or bedroom.\n\n4) Without gaps, cover that entire wall with emergency foil blankets, using masking or duct tape to hang up and connect the pieces. It does not matter which side of the blankets faces the wall. If this is too much, then just cover the window. If this is too ugly for you, then you can make a safe room out of a large closet, or put your bed or desk in the corner and cover the half of the walls adjacent to it.\n\n4) Widen the banana plug, and stick into the ground jack on your electrical outlet. This is the middle one that's round, not slotted. Connect the alligator clip to the bottom edge of a blanket, so that it grips onto both sides of the foil.\n\n5) Use double-alligator wires to connect one blanket piece to another.\n\n6) Check for incoming radiation, add another blanket where necessary. After an hour or two, check the other windows and compare their signal strength to what you recorded previously. If they are now showing intense incoming radiation, the signal has re-oriented and you must cover that wall or window as well.\n\nYou will feel the difference. As an experiment, tape up only half of a grounded blanket, so that you stand before an uncovered window. Then tape up the rest so the window is covered. The pressure in your head may disappear, only to reappear if you pull the blanket down again.\n\nMicrowaves cannot easily penetrate metal, especially grounded metal such as the electrically grounded foil blankets. The reason why emergency blankets are recommended over Reynolds aluminum foil is that these blankets are larger, more durable, and easier to hang up. Though some signal still gets through, and foil does not block pure ELF waves (ones without a higher frequency carrier), this is one step to greatly reducing the level of incoming microwave radiation.\n\n* for temporary relief, go to the basement, lie on the floor, or move around. These prevent strong hot spots from locking onto you. This may seem paranoid, but test it with a signal detector and you will verify this for yourself.\n\n* use a negative ion generator (air ionizer) to improve the quality of air in your home. Keep the generator away from computer equipment. Negative ions improve your mood, and such generators also create EM noise which interferes slightly with monitoring device. Negative ions and the EM noise also counteracts negative astral and ethereal phenomena.\n\n* avoid ingesting fluoride. Among other places, fluoride is found in commercial soft drinks, bottled or canned ice tea, and tap water. Fluoride impairs willpower and clarity of thought, which makes one more susceptible to microwave mind programming signals.\n\n* if one has a choice, avoid spring mattresses. Use instead air mattresses, waterbeds, or futons. Platform beds made of wood are available to support a futon mattress. Springs are like antennas, and focus EM and ELF energy into your body while you sleep.\n\n* get proper nutrition. This means enough calories, protein, adequate minerals, plenty of clean water, and fresh fruits and vegetables. Being deficient in any of these will cause mental weakness and submissiveness to mind programming signals.\n\n* be in the moment and observe yourself. Question baseless thoughts or emotions you may have, especially negative emotions such as aggression or depression that urge you to act without thinking. Becoming aware of their presence is often enough to deactivate them.\n\n* don't let the means become an ends. Reducing mind programming signal influences should serve to increase your productivity and efficiency in what you truly desire to do, the goals you choose to follow. Don't let fear and paranoia usurp the importance of following your goals.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}