{"result_id": "105009", "URL": "https://www.educate-yourself.org/be/besciencenews.shtml", "timestamp": "2023-04-25 15:01:46 CEST+0200", "meta": {"description": "March 30, 1991. Zapping the AIDS virus with low voltage electric current can nearly eliminate its ability to infect human white blood cells cultured in the laboratory, reports a research team at the Albert Einstein College of Medicine in New York City. William D Lyman and his colleagues found that exposure to 50 to 100 microamperes of electricity - comparable to that produced by a cardiac pacemaker - reduced the infectivity of the AIDS virus (HIV) by 50 to 95 percent. g.", "lang": "en", "keywords": "blood electrolysis, non-drug therapies, electro-medicine, zapper, www.educate-yourself.org, dr  bob beck, dr robert c beck, dr steven kaali, dr william lyman, albert einstein college of medicine, new yor city, ny, aids, cids cure, hiv, herpes cure, educate-yourself.org, bob beck, dr royal rife, royal raymond rife, rife therapy, geroges lakhovsky,  dr bob beck, dr robert c beck, dr robert beck, deck zapper, blood electrifier, blood electrification, silver pulser, dr steven kaali, dr william lyman, albert einstein college of medicine,aids, hiv virus, bioelectrification, bioelectric medicine,", "favicon": "", "canonical": "https://www.educate-yourself.org/be/besciencenews.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "www.educate-yourself.org", "title": "Blood electrification, Science News article March 30, 1991", "cleaned_text": "Zapping the AIDS virus with low voltage electric current can nearly eliminate its ability to infect human white blood cells cultured in the laboratory, reports a research team at the Albert Einstein College of Medicine in New York City. William D Lyman and his colleagues found that exposure to 50 to 100 microamperes of electricity - comparable to that produced by a cardiac pacemaker - reduced the infectivity of the AIDS virus (HIV) by 50 to 95 percent .\n\nTheir experiments, described March 14 [1991] in Washington D.C., at the First International Symposium on Combination Therapies, showed that the shocked viruses lost the ability to make an enzyme crucial to their reproduction, and could no longer cause the white cells to clump together - two key signs of virus infection.\n\nThe finding could lead to tests of implantable electrical devices or dialysis-like blood treatments in HIV-infected patients Lyman says. In addition, he suggests that blood banks might use electricity to zap HIV, and vaccine developers might use electrically incapacitated viruses as the basis for an AIDS vaccine.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Ken Adachi"], "publish_date": null}