{"result_id": "105025", "URL": "https://educate-yourself.org/lte/abovetopsecretinterview11dec09.shtml", "timestamp": "2023-04-25 15:01:59 CEST+0200", "meta": {"description": "Dec. 15, 2009. After seeing just how empty, meaningless, and banal this pro-pharma propaganda \" interview\" was between Mark Allin, one of the three owners of Above Top Secret, and former CIA/military liaison Dr. Christopher \"Kit\" Green, I can only conclude that ATP's other videos interviews must be real barn burners, something to turn to when you suffer an allergy to pharmaceutical sleeping pills and just have to get some sleep.", "lang": "en", "keywords": "www.educate-yourself.org, educate-yourself.org, ken adachi, dr christopher kit green, mark allin, above top secret.com conspiracy , swine flu hoax, disinformation, deception, ats, baxter international, contaminated swine flu vaccine, jane bergermeister, swine flu hoax, vaccine dangers, who, world health organization, cia, dr jeffrey taubengerger, 1918 spanish flu, dr true ott, gary null,", "favicon": "", "canonical": "https://educate-yourself.org/lte/abovetopsecretinterview11dec09.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "AboveTopSecret.com & Dr Christopher Kit Green Expose Swine Flu Anti-Vaccine 'Hype' (Dec. 14, 2009)", "cleaned_text": "Subject: Swine Flu Above Top Secret Interview\n\n From: Edward D\n\n Date: Fri, December 11, 2009 \n\n To: Ken Adachi\n\nHope all is well with you; just finished listening to an interview on ATS [Above Top Secret] with one Dr. Christopher \"Kit\" Green. (Gee; I always wanted to be Kit or Buck, something like that). Dr. Green; acknowledged he works for DoD;CIA; etc. is being interviewed by a ATS person. Sounds like he is discrediting all of us \"conspiracy\" nuts. Have you an opportunity to listen to this? It is available on Abovetopsecret.com.\n\nThanks for your input. ED\n\nI've never really focused much attention on this web site until today. I vaguely viewed this site as a conspiracy blog of the Godlike Productions variety which I might land on once in a while while following Google links for something I am searching for. I really don't read conspiracy blogs anyway. I don't have the time and the info is often too insipid and low level to be of any real value. I suspect that the same sort of people who were fans of Star Trek when it was popular on television many years ago are the type of people who participate in this blog. However, it looks like there is serious money behind this web site, as it boasts a roster of 69 employees with three owners, so it's hardly a one man, kitchen tabletop operation like yours truly. Apparently, a lot of people read or use this web site as they have a very high Alexa ranking of 4,588.\n\nI guess having the money to record a high definition video with professional looking graphics with TV news-style intro music grants you the chutzpa to title your video a \"Special Report\" from \"ATS News\", even though Above Top Secret is a conspiracy chat forum and not a news organization.\n\nAfter seeing just how empty, meaningless, and banal this pro-pharma propaganda \" interview\" was between Mark Allin, one of the three owners of Above Top Secret, and former CIA/military liaison Dr. Christopher \"Kit\" Green, I can only conclude that ATP's other videos interviews must be real barn burners, something to turn to when you suffer an allergy to pharmaceutical sleeping pills and just have to get some sleep. .\n\nI forced myself to sit through all three parts of this gobbledygook and heard 'Kit' make one misleading, contradictory, or false statement after another. For example, in assuring us that the Swine Flu vaccine was a much safer bet than taking a chance on catching the dreadful Pandemic Swine Flu, Dr. Green said the following:\n\nIf the one in 2,000 or one in 4,000 statistical quotes refer to people who were NOT vaccinated with the Swine Flu vaccine, then those statements are erroneous in the extreme and patently false. Since 'Kit' says that he only puts credibility and stock in the statements of upper tier CREDENTIALED Class \"A1, 2, 3 or B 1, etc\" sources and \"sometimes\" C or D sources (his nomenclature), his disdain for internet web sites which \"may have well written articles\", but lack the necessary academic credentials (\"F\" sources according to him) is apparent and should be ignored as conspiracy wing nut stuff. . .\n\nThe \"esteemed\" forensic scientist Dr Green seems to contradict his own statements in claims of authority. He first informs us that he worked for the CIA from 1969 to 1985 and \"managed the biological and chemical division of the CIA\" , but twenty minutes later disavows any real expertise in biology (\"I'm not an epidemiologist\") He says that he's actually a neural forensic scientist who's expertise is in brain imaging (I have to wonder if that brain imaging included victims of the CIA's MK Ultra, Project Monarch, or Montauk Project mind control operation?). He says at one point that he \"confused\" by the all of \"complicated\" sequencing involved in deciphering the Swine flu progression and its manufactured vaccines.\n\nThen why does the CIA have him, of all people, \"manage\" their biological and chemical division?\n\nMaybe it's Mark Allin's obsequious genuflections before Dr Green that causes Green to present his comments and calm reassurances about the benign intentions of government as if he were talking to a room full of grade school children, but I found this guy's condescending demeanor extremely annoying while listening to his drivel. We're suppose to accept the most naive and innocent notions about the motivations and de-facto conduct of this government, its intelligence agencies, and the Pentagon for whom he says he so proudly served. He says that you'll find the entire history of how the Swine flu evolved NATURALLY into its current threat to our well being by reading a fantastic report in the New England Journal of Medicine.(\"the best medical journal in the world!\") authored by a couple of his pals who present absolutely unchallengeable, 100% genuine, honest-to-goodness REAL science in laying out the recombinant gyrations that the pig, bird, and human viruses boogied together in the past generation in order to bring us to this current state of 'pandemic' alert. I noticed that he never once mentioned the names of Fort Detrick, the CIA's Dr Jeffrey Taubenberger, or the PATENTED Swine flu vaccines of the WHO or the PATENTED Swine Flu bio-engineered bio-weapons owned by the World Homicide Organization.\n\nHere are a couple of Dr Green's \"conclusions\":\n\n1. The intentional distribution of 79 kilos of a lethal batch of Swine flu vaccine in April 2009 by Baxter International that instantly killed test ferrets in a Czech Republic lab which thankfully ran a routine test on the vaccine, was dismissed by Dr. Green as a case of corporate bungling and \"stupid people\" and certainly not a case of evil motivation or skullduggery involving the World Homicide Organization, or even the \"intelligentsia\" people working for Baxter (\"First of all, they're not the kind of people that would do something so evil and secondly, they're not smart enough, in any event, to pull something like this off\". )\n\nSo you see kids, it's really quite absurd and paranoid of us to even allow such a thing to enter our mind!\n\n\"Kit\" thinks that Baxter ought to fess up, though, to the many cases of accidental contamination of vaccines mixtures instead of not offering any sort of explanation for the \"mix up\" which occurred in April 2009.\n\n2. Government health officials and the CDC are innocent.of any genocidal \"conspiracy\" surrounding the Swine flu hoax and the promotion of the Swine flu vaccine. However, those greedy corporate connivers of Big Pharma are another matter. We should be focusing our attention on them and not the government, who, after all, are only trying to do their job to protect the public's health during this deadly flu pandemic.\n\nI could add more examples, but you get the idea. Watch the video and you'll see a classic exercise in \"plausible deniability\" as practiced so often by our military spokesmen. Notice how this is less of an \"interview\" than it's a Set Up and Pitch, two man tag team out to snow you while masquerading as a \"Special News Report\".\n\nHere's how the Set Up begins as posted on the pages linked below:\n\nATS News presents an exclusive interview with the esteemed forensic scientist, Dr .Christopher \"Kit\" Green, on several concerns and conspiracies related to swine flu. In part two, we ask Dr. Green about his opinion on several of the more prominent conspiracy theories related to swine flu, including the possible collusion of the mainstream media and pharmaceutical industry \"over hyping\" the threat. This second segment will be an important part for those of us who are looking for an informed opinion on some of the more prominent conspiracy speculation.\n\nListen and Learn who NOT to trust.\n\nSubject: Chemtrails and \"Above Top Secret\"\n\n From: Keith H \n\n Date: Mon, December 21, 2009 \n\n To: Ken Adachi\n\nHi Ken,\n\n \n\n Regarding your 12-15-09 commentary on the website “Above Top Secret”, it appears you were right on. “Above Top Secret’s” Mark Allin was on Coast to Coast with George Knapp on 12-20-09, and he seemed to be playing down chemtrails as being a weapon for population reduction. Sounded like a disinformation, spin-meister, pentagram schill!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/lte/abovetopsecretinterview11dec09.shtml", "http://media.abovetopsecret.com/media/5284/ATS_News_-_Swine_Flu_Conspiracies_with_Dr._Christopher_Green_-_Part_One/", "http://media.abovetopsecret.com/media/5285/ATS_News_-_Swine_Flu_Conspiracies_with_Dr._Christopher_Green_-_Part_Two/", "http://media.abovetopsecret.com/media/5286/ATS_News_-_Swine_Flu_Conspiracies_with_Dr._Christopher_Green_-_Part_Three/"], "authors": ["Ken Adachi"], "publish_date": null}