{"result_id": "105043", "URL": "https://educate-yourself.org/vcd/smallpoxbringingdeadbacktolife21nov02.shtml", "timestamp": "2023-04-25 15:02:08 CEST+0200", "meta": {"description": "Nov. 21, 2002. With a flair worthy of PT Barnum and Edward L Bernays, mainstream media is lately employing a brilliant menage of pseudoscience and well-edited history to concoct a new myth out of thin air: terrorists are about to release smallpox as a bioweapon that could decimate our population. But soft! - our ever-vigilant security forces are ready. Government leaders with degrees in law, not science, have decided to prepare enough vaccine to inoculate every American. And to empower themselves to legislate the vaccine's administration, sanctioned by severe penalties for refusal", "lang": "en", "keywords": "www.educate-yourself.org, educate-yourself.org, ken adachi, franklin roosevelt, pearl harbor betrayal, roosevelt's treason, dwayne whitloik", "favicon": "", "canonical": "https://educate-yourself.org/vcd/smallpoxbringingdeadbacktolife21nov02.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Smallpox, The Looming Disaster of Mandatory Vaccinations", "cleaned_text": "\n• the utter lack of science underlying Jenner's original claim of immunity from vaccines\n• the number of deaths and disfiguring cases his experiments brought to those unsuspecting patients who were unfortunate enough to be talked into trying Jenner's injections during those early years.\n• Jenner was no physician. He never passed a medical exam in his life, completed any course of medical study, or received a diploma from any medical school.\n• Jenner bought his medical degree for £15 from St Andrew's College in Scotland, which he never attended (Hume, p 174 , also Hadwen )\n• Jenner \"tested\" his theory on one patient, and then immediately claimed that he had \"immunized\" the patient against smallpox for life. Jenner also claimed that the vaccine would work universally. That's it. No controlled clinical trials, no years of research, nothing! One patient.\n\nBy Tim O'Sheahttp://educate-yourself.org/vcd/smallpoxbringingdeadbacktolife21nov02.shtmlNov. 21, 2002[excerpted from the forthcoming 6th ed. of, available 2003]With a flair worthy of PT Barnum and Edward L Bernays, mainstream media is lately employing a brilliant menage of pseudoscience and well-edited history to concoct a new myth out of thin air: terrorists are about to release smallpox as a bioweapon that could decimate our population. But soft! - our ever-vigilant security forces are ready. Government leaders with degrees in law, not science, have decided to prepare enough vaccine to inoculate every American. And to empower themselves to legislate the vaccine's administration, sanctioned by severe penalties for refusalPrice tag for the new doses: over $800 million.But what is money when compared with the health and security of the American people?Answer: it's still money.Almost every day, a new story comes out in the major news Matrix about the coming threat and the vaccine that will save us. In true Edward L Bernays fashion,the features are generally written by the \"health correspondent\" with the requisite lack of credentials, disregard of history, and the standard formidable barrage of uncited and anonymous sources.But we are not taken in, not us, because we know that forgetting history, we are destined to repeat it. So let's try something unknown to the meretricious press - let's review the actual history and science of smallpox and apply it to the present.Smallpox was an infectious viral disease which was evident for centuries in places with poor sanitation, poverty, and malnutrition. Hundreds of thousands died, and there was no cure. The infectious agent was Orthopox variola.By the end of the 18th century the disease was following the natural course: burning itself out on the human population,Smallpox was the first disease for which vaccination was tried. It all started with Edward Jenner at the end of the 1700s.The story that we find in 99% of standard references is that Jenner's vaccine saved the world from the dread smallpox, which had plagued the human race for centuries. Mass inoculation programs were instituted in many countries worldwide, usually backed by the government. The vaccine supposedly immunized people for life. If the legend starts to sound a little whitewashed, there's a reason why. So let's start at the beginning.As you may remember, Edward Jenner was the English \"physician\" in the late 1700s who took note of an old superstition that milk-maids who got a mild disease known as cowpox supposedly didn't get smallpox. As an experiment, Jenner came up with the idea of drawing serum from an infected cowpox pustule on the skin of an infected milkmaid. He then injected the infected pus into a perfectly healthy person, on the theory that contact with this \"milder\" disease would allow the subject to develop immunity to the more deadly smallpox.Jenner's theory was that this cow-pox is smallpox of the cow. Therefore, if you give a person cow-pox, it is the same as smallpox, only in a very mild form. And it would not be infectious.And at midnight, the coach would turn back into a pumpkin…Going even further out on a limb, Jenner himself absolutely declared that it is not that cow-pox is a preventive of smallpox, but that. (Hadwen)While Jenner is universally venerated today as mankind's deliverer from the scourge of infectious disease in probably 99% of references, a little different version of Jenner's rise to fame and wealth is summarized in Miller's book, p 24.Other sources from Jenner's own contemporaries who were less than enchanted with his idea of variolation appear throughout Anderson'sthe writings of Walter Hadwen,and the very thorough research by Alfred Russell Wallace.From these writers we can learn a few details that most edited modern drafts of this story omit, such as:Even from the beginning, after inoculating his very first patient - 8 year old James Phipps - Jenner absurdly maintained that his injections were conferring lifetime immunity:Many of Jenner's own contemporaries were shocked at how easily the scientific community was taken in by this auteur. Perusing the work of Walter Hadwen MD,celebrated English surgeon, author, and medical scholar of 100 years ago, we find a version of the Jenner story that is not so set in bronze as most of what we read today. Hadwen points out a few cracks in Jenner's pedestal:With no proof whatsoever, and a sample size of one, Jenner tricked the entire medical profession, then and now, into pretending that cowpox was smallpox in cows - a total scientific inaccuracy. And then he sold the idea that his vaccine was the cure.Not long after his \"breakthrough,\" Jenner's repeated petitions to the House of Commons struck gold. It finally dawned on the English government how millions of pounds sterling could be moved around by passing a law making the new smallpox vaccine compulsory. Jenner was promptly awarded the enormous sum of £30,000 by British Parliament and suddenly this uneducated poseur was a revered scientist! (WallaceLegitimate scientists of Jenner's day decried the smallpox vaccine from the start. Bechamp, Hadwen, Wallace, and others thought it appalling that the most basic facts concerning the distinction between cowpox and smallpox were simply never discussed. If the original axioms of vaccination were true, how could one disease vector immunize against a completely separate disease? This was the question that was never asked, and is still ignored today.Watch closely: the two diseases - cowpox and smallpox - are completely distinct conditions. Hadwen explains:Hadwen wrote this 100 years ago, but his objections are still valid. Doing a taxonomic check today in a standard index of viruses from a National Institutes of Health databasereadily points out that cowpox is caused by a virus calledand smallpox is caused by a virus called. These two viruses have different sizes, genetic sequences, and characteristics. To pretend that cows get a version of smallpox called cowpox is bizarre enough - but then to say that people who get the same disease are immune to smallpox is simply fantasy.This chart may be helpful:------------------Only in female cows ----- Only in humansNot infectious ------------ InfectiousOrthopox vaccinia ------- Orthopox variola( Microsoft Encarta, 2001How scientific was it to transfer diseases back and forth between humans and animals in the preparation and administration of vaccines? Real scientists were shocked at such a practice, but their views were suppressed. We'll see this sloppy science emerge again with polio vaccine and the invention of HIV. (Horowitz)From an original monograph by Dr Walter Hadwen, here is an account of how smallpox vaccine was first made:1. A 3 month old calf was tied down on its side.2. 30 - 50 one inch incisions were made in its stomach3. Smallpox pus rubbed into each incision4. Calf is returned to its pen, restrained so as to be unable to lick the sores5. Wait one week.6. Smallpox pustules form7. Calf strapped down again8. Encrusted pus is scraped off each sore and the remaining blood, lymph, and pus is then drained out.9. It is placed in a crucible and heated, adding glycerine as a binder10. Mixed and strained to remove hair and dead flesh.11. Poured into tubes as sold as pure calf lymph - or smallpox vaccine.Very scientific. This formula was used for decades, even up to modern times, continuing with Dryvax in 1944.The new smallpox vaccines are still made from this 'purified calf lymph' but with one modern twist: the post 9/11 vaccine is now cultured on the cells of an aborted human fetus.The majority of historical references found in mainstream sources have loudly proclaimed the safety and effectiveness of the smallpox vaccine. This erroneous general perception continues today. From a current MSN Encarta document:Likewise from The Columbia Encyclopedia, Sixth Edition. 2001:By 1853, Parliament began passing laws to make the untested vaccine compulsory throughout the British empire. Other countries of Europe followed suit. Once the economic implications of compulsory vaccinations were realized, few dared to disagree. Then, as now, the media were controlled by the vaccine manufacturers and the government, who stood to make huge money from the sale of these spurious vaccines. Hadwen put it like this:And this is how mass immunizations get started. Once the money machine started rolling, doctors who questioned the research were ignored. Despite the lack of scientific validation and hundreds of thousands of documented vaccine deaths, compulsory smallpox vaccination lasted for 120 years! The US was the last holdout, finally giving it up in 1971.Hadwen provides a rare window into the medical research of a century ago, one that has not received the usual whitewash. He tells the amazing story about Prussia, the most vaccinated country in Europe during the 1800s - also the country which kept the best records. Hadwen had access to these medical records before the media had the sense to suppress them. Here's what they showed:It happened that Prussia passed a mandatory vaccination law in 1834 for smallpox. The law provided that every infant be vaccinated, and then revaccinated when starting school. After graduation, the child had to be vaccinated again, and then once more upon entering the Army! And all healthy males had to go into the Army.; and so thoroughly was it done that he was vaccinated in ten places on each arm.\"OK, so we get the idea that almost 100% of Prussians got Jenner's smallpox vaccine. So what happened in Prussia 35 years after this vaccination law?How about England?A compulsory \"immunization\" program was set up in England in 1853 using Jenner's methods. (McBean p.13). Results of this \"immunization\":------1857-9 --- 14,2441863-5 --- 20,059In response, in 1867 Parliament enacted a stricter vaccination law, and 97% of the people were inoculated. Result:-------1868 -------- 44,840( Null, Part III, p23Great vaccine, huh?Alfred Russell Wallace offers abundant proof of how vaccine statistics were manipulated in England during the 1800s - the who and the why of it. After a thorough presentation charting actual deaths throughout the UK and the Continent from smallpox and from the vaccine, Wallace concludes that smallpox vaccine- Alfred R. Wallace, Chapter VI 1898What most people don't know is that just after the US began vaccinating for smallpox (1902) England stopped. By 1907, England finally got the message:. Holland, same thing in 1928. Australia - 1925 (Anderson, p 10) [7]How long did it take the US to figure out that the smallpox vaccine not only didn't work, but was dangerous and often fatal as well?The low ebb of the infectious diseases arrived in the 1970s. From 1950 to 1970, zero cases of smallpox were reported in the U.S. After several years passed, however, there are now a few cases of smallpox,(Scheibner)What's important to notice is that smallpox vaccination in the U.S. persisted another 30 years after the disease was at an incidence of practically zero.(Mendelsohn, p 232, World Book, 1994)Even though smallpox vaccination became mandatory in the US after 1902, what is less commonly known is that by 1929, all states, but nine no longer made it compulsory.. (H.B. Anderson, p 2)Other physicians of the smallpox era were not that impressed with the vaccine. William Howard Hay MD, at an address he gave on 25 June 1937, remarked:After WWI, there was a lot of surplus smallpox vaccine that didn't get used. So we looked to another market we could control. When the U.S. mandated a mass smallpox vaccination program in the Philippines in 1917, some 25 million shots were given to those people., and, quadrupling the death rate prior to the inoculation program. That's way more than the total number of Americans who died in the entire Vietnam war! American \"immunization\" of its Philippine territory caused several horrific epidemics there that didn't quite make the six o'clock news. (Anderson, p 69 W.H.Hay, also James, p 410)To sum up, what Jenner did was to take an old superstition of Gloucester dairymaids and pander it into a fortune for himself and the English government by the most ridiculous \"scientific\" posturing.Bringing the discussion into the present, post-9/11 politics has created marketing niches like the world has never seen. In classic Edward L Bernays style, the illusion of a smallpox threat has been created - an $800 million illusion. [Appleby)With no proof whatsoever, the scripted media daily barrages the unlettered public with likely scenarios of Muslim terrorists unleashing weaponized smallpox into metropolitan areas, supposedly resulting in epidemics of smallpox spreading like wildfire through an unvaccinated population, etc.In an eerie replay of the social politics of 200 years ago, scientific fact is brushed aside and we are distracted from the lessons of our own history, as though these events never took place:· smallpox disappeared worldwide in 1977· the only deaths from smallpox since 1970 have been from the vaccine· smallpox vaccine killed thousands in England, France, Prussia, and the Philippines· the sham premise of Jenner is still widely held· smallpox vaccine historically has killed the most people of any vaccine ever invented· the vaccine is for a completely different disease - a disease of cows· the vaccine does not confer immunity to smallpox· the reason that our country and every other country in the world stopped vaccinating was that the vaccine not only did not work, but was causing the disease and other pathological and fatal side effects· no biological viral or bacterial agent has ever been deployed as a weapon, either by a country of by an individualA few other small details that should not be missed:Despite all this, the FDA, CDC, Office of Home Security, plus many of the brave new 'defensive' offices which have recently emerged at the trough, decided that a few companies should start producing enough vaccine to give all 280 million Americans 'protection.The companies include:in France,in England, andin the US. The working sales slogan was that we only had 15 million doses and we need another 255.So the circus is on. The companies are pretending to be racing against the clock. It makes great press because the story provides both criteria for a successful media issue: fear and uncertainty.Awash in media overload with respect to the new smallpox vaccine as the solution to the vague, ill-defined, unfounded bioterrorist \"threat,\" we should try to remember a few facts based in physical reality:- the entire program is predicated upon a premise that is scientifically unproven: namely that one dose of the new vaccine would confer lasting immunity... to anything.- hundreds would die or suffer permanent injury from this 'protective' measure- illustrative of the mentality of our decision makers is a comment in a April 25, 2002editorial,whereby the author tries to comfort us by surmising that mass smallpox vaccination today would \"only\" kill 180 people, which is the same number who die on our highways every day and a half, he trivializes. (Bicknell)Such a ludicrous statement in our best medical journal makes the colossal assumption that those who did not die would be immune by virtue of the vaccination, a fact which cannot be proven. Perhaps this is why even such an irresponsible author as this recommends voluntary smallpox vaccinations to be available to anyone who wants them - a magnanimous offer indeed. This same genius later upped his death estimate when he was quoted in the Sept. 23, 2002, citing 500 deaths which would result from mass smallpox vaccination.- the original vaccine claimed to confer immunity to the natural disease. Bioterrorist smallpox would be an entirely different strain, being weaponized. So there could be no testing that could prove effectiveness or the wisdom of mass injecting this most dangerous vaccine- Acambis is in England. Aventis is in France. Yet England and France are not gearing up for mass smallpox vaccination. Why not? Because the only market in the world is here in the US.- with the ridiculous story on March 27, 2002 () that suddenly Aventis had \"discovered\" 70 to 90 million 'forgotten' doses of smallpox vaccine in one of their freezers, a few questions come to mind:Is it 70 or is it 90? 20 million doses is a lot to overlook. And isn't it odd that the company who has been given a $400 million contract that they couldn't possible meet in the one year time frame suddenly discovers these lost doses in one of its own freezers? And with no clinical trials whatsoever glibly postulates that the doses can be 'diluted' down five or ten times, which coincidentally takes the pressure off production deadlines? The mind boggles at this serendipitous synchronicity. And why doesn't this French company want the valuable vaccine for the French? How altruistic of them to sacrifice their own national safety, and put their old buds the Americans first. This virgin looks somewhat pregnant, n'est-ce pas?A major blow to the best laid plans of the New Vaccinators came on Sept. 10, 2002 with the Reuters articleabout the CDC announcing how the new smallpox vaccine isto be recommended for:- HIV people- anyone on immunosuppressive drugs- anyone with eczemaThe CDC quoted a new study in the, describing reactions that include blindness, scarring, and death.So the vaccine is therefore contraindicated in all these cases, according to the CDC.Eczema patients alone comprise half the US population. AIDS patients and those on immunosuppressive drugs add another significant proportion to the group of those who shouldn't be vaccinated.In addition, the omniscient media seem to have forgotten that most Americans over 31 years of age have already been vaccinated for smallpox, since the vaccine was only halted in 1971 in the US. Remember? So if the vaccine is supposed to work, then obviously these people will not need a new shot, right?Then who does that leave? Ten percent of the population would be a reasonable estimate.It's not much of a stretch to see how the threat of smallpox is a marketing tool, right out of classic Bernays Public Relations 101, that is being used to justify paying vaccine manufacturers $800 million for a vaccine that is unproven, untested, and contraindicated for 90% of the population.Why then are our new masters shrieking about the 280 million doses we need to protect the American people from this imminent bioterrorist threat?Could it just be the money?Tim O'SheaWeb posted at http://www.thedoctorwithin.com/articles/smallpox.html", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Tim O'Shea", "Ken Adachi"], "publish_date": null}