{"result_id": "105017", "URL": "https://educate-yourself.org/vcd/faqvaccineexemptionintexas01jun04.shtml", "timestamp": "2023-04-25 15:01:53 CEST+0200", "meta": {"description": "June 1, 2004. A. Parents or guardians need to request a vaccine exemption affidavit form in writing. Each child's name and date of birth must be included in the request. The requests must be submitted through the U.S. Postal Service, commercial carrier or hand delivered to: \n\nTexas Department of Health\nBureau of Immunization and Pharmacy Support\n1100 W. 49th Street\nAustin, Texas 78756", "lang": "en", "keywords": "vaccine exemptions in texas, vaccine dangers, school vaccine exemptions,", "favicon": "", "canonical": "https://educate-yourself.org/vcd/faqvaccineexemptionintexas01jun04.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Frequently Asked Questions About Vaccine Exemptions in Texas", "cleaned_text": "Q. How do I obtain a vaccine exemption for reasons of conscience for my child?\n\nA. Parents or guardians need to request a vaccine exemption affidavit form in writing. Each child's name and date of birth must be included in the request. The requests must be submitted through the U.S. Postal Service, commercial carrier or hand delivered to:\n\nTexas Department of Health\n\n Bureau of Immunization and Pharmacy Support\n\n 1100 W. 49th Street\n\n Austin, Texas 78756\n\nQ. What if I have already submitted a request for a vaccine exemption affidavit form by e-mail or fax?\n\nA. Any request submitted by e-mail or fax will need to be resubmitted in writing and sent through the U.S. Postal Service, commercial carrier or hand delivered to the above address.\n\nQ. How many vaccine exemption affidavit forms can a parent or guardian request at one time?\n\nA. Parents or guardians can request up to five vaccine exemption affidavit forms per child.\n\nQ. What information will be listed on the vaccine exemption affidavit form I receive?\n\nA. Information on the form will include the child's name; date of birth; a list of vaccines for which exemptions may be requested; a statement for the requesting parent or guardian to indicate their relationship to the child; and an acknowledgement that the parent or guardian has read attached information entitled The Benefits and Risks of Vaccinations. Parents or guardians will then have to sign the form in front of a notary public.\n\nQ. What will happen to the information collected on each child?\n\nA. Requests submitted to TDH will be destroyed once vaccine exemption affidavit forms are mailed to parents or guardians. TDH will track and report on the number of affidavit requests but no personal information will be maintained.\n\nQ. What should parents or guardians do with the vaccine exemption affidavit form?\n\nA After the original vaccine exemption affidavit form is signed and notarized, it must be submitted to the child's school.\n\nQ. For how long is each child's individual exemption affidavit valid?\n\nA. Each individual vaccine exemption affidavit is good for five years from the date notarized.\n\nQ. What happens if the parent or school loses the original vaccine exemption affidavit?\n\nA. Photocopies of the vaccine exemption affidavit form are not valid. If parents or schools lose the exemption affidavit, the parent or guardian needs to request another vaccine exemption affidavit in writing following the same procedures used to obtain the first form.\n\nQ. What if my child changes schools?\n\nA. The vaccine exemption affidavit is part of the child's school records and should be sent to the new school with other school records.\n\nQ. Does a child have a 90-day provisional enrollment in school while awaiting the vaccine exemption form?\n\nA. No. TEA policy requires school districts to provisionally enroll for no more than 30 days, those students whose parents or guardians wish to claim exemption from vaccine requirements for reasons of conscience.\n\nQ. What happens at the end of the 30-day provisional enrollment period?\n\nA. Once the 30-day provisional enrollment period ends, parents or guardians must present an official notarized TDH affidavit form, an up-to-date immunization record or a physician's affidavit of medical contraindication to school officials to attend school. If parents or guardians cannot produce one of these three documents, their child will be excluded from attendance.\n\nQ. What is required for school enrollment if I want my child exempt from some vaccines but not all of them?\n\nA. Two different immunization documents will be needed: 1) an official notarized TDH vaccine exemption affidavit for those vaccines the parent or guardian has chosen for reasons of conscience to have their child exempt from; and 2) a valid immunization record indicating the month, date and year each vaccine for which the child is not exempt was administered, with appropriate validation by a physician or public health clinic.\n\nQ. If a child currently has a religious exemption for vaccinations on file with the school, do they need to obtain a new vaccine exemption for reasons of conscience affidavit?\n\nA. No. Students who are currently exempt from vaccination for religious beliefs and already have an affidavit on file at the school they attend do not need a new vaccine exemption affidavit form. The religious exemption on file remains valid.\n\nQ. What if there is a vaccine-preventable disease-such as measles-outbreak at a school?\n\nA. Each parent or guardian who signs a vaccine exemption affidavit form also is acknowledging they understand that their child may be excluded from school attendance in times of emergency or epidemic declared by the Texas Commissioner of Health.\n\nQ. Does this new vaccine exemption option mean that my vaccinated child may be attending school with other children who are not fully vaccinated?\n\nQ. Can an expectant parent request a vaccination exemption affidavit form for an unborn child?\n\nA. No. Because the child's name and date of birth is required when the vaccine exemption affidavit form is requested, expectant parents must wait until after the child is born to request the vaccine exemption affidavit form.\n\nQ. Can schools accept any other documents, other than a TDH vaccine exemption affidavit for reasons of conscience, to exempt a child from vaccination requirements for enrollment?\n\nA. Yes. In addition to the vaccine exemption for reasons of conscience or religion, parents or guardians also may present for their child an affidavit or certificate signed by a licensed physician, which states that, in the physician's opinion, the immunization required would be injurious to the child's health and well-being or any of the child's family or household member. Unless a lifelong condition is specified, this affidavit or certificate is valid for only one year from the date signed by the physician and must be renewed every year for the exclusion to remain in effect.\n\nQ. Are there other reasons a child may be exempted from vaccination requirements?\n\nA. A child may be exempt from one or more vaccinations for medical reasons. The parent or guardian must provide the school with a certificate signed by a physician, registered and licensed to practice medicine in Texas, which states that, in the physician's opinion, the immunization required would be injurious to the child's health and well-being or to any of the child's family or household members. Unless a lifelong condition is specified, that certificate is valid for one year from the date signed by the physician and must be renewed every year for the exclusion to remain in effect.\n\n----- Original Message ----- \n\n From: A Friend in Texas\n\n To: <Editor@educate-yourself.org>\n\n Sent: Thursday, June 03, 2004 5:08 PM\n\n Subject: Vaccination laws addendum\n\nHi Ken,\n\n \n\n I wanted to add some thoughts on your new Texas vaccination laws article. For your, and others info, the Texas statute is located here:\n\n \n\n http://www.capitol.state.tx.us/statutes/docs/ED/content/htm/ed.002.00.000038.00.htm\n\n \n\n The law states in part:\"IMMUNIZATION; REQUIREMENTS; EXCEPTIONS.\n\n (a) Each student shall be fully immunized...\" , etc.\n\n \n\n Note the use of the word \"shall\" in this law, which, in a legal definition means, \"may\". In other words, the child \"may\" be vaccinated. (but is not\n\n legally required to be)\n\n .\n\n A mandate in legal terms would be phrased \"Each student must be immunized\", etc. The word \"must\" would be a legal mandate or requirement. This is\n\n never the case.\n\n \n\n I believe these vaccination laws are similar in all states, and, in the ones I know of, all read with the phrasing \"shall\", since mandating a medical\n\n test or proceedure is a gross violation of anyone's basic right to their body, etc. Thus, no state can have a legal, constitutional, law, mandating\n\n vaccination.\n\n \n\n I hope you and your readers will now better understand this bit of legal word-definition mumbo-jumbo double-speak. It is entirely intentional and designed\n\n to deceive.\n\n \n\n Parents not only don't have to immunize their children, but the state is mandated to educate all children in the school district. The parents can sue if the school refuses to educate their child for 'any' reason, as the school has no law to stand on. They certainly can't refuse to educate a child for medical reasons. If parents wish to file exemptions, they may, but the law does not require it. But the law does require the school to educate their child.\n\n \n\n I hope this information will help your readers as they struggle with their school authorities. :>)\n\n \n\n I also hope some parents will remove their children from the public brainwashing system, and educate their children at home!\n\n \n\n Thanks for the good work you do with your website, your friendly reader,\n\n \n\n A Friend in Texas", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.tea.state.tx.us/taa/comm081903a1.doc", "http://www.tea.state.tx.us/taa/comm081903a1.doc", "http://www.capitol.state.tx.us/statutes/docs/ED/content/htm/ed.002.00.000038.00.htm"], "authors": ["Ken Adachi"], "publish_date": null}