{"result_id": "105045", "URL": "https://educate-yourself.org/cn/vaccinationsinUganda22dec03.shtml", "timestamp": "2023-04-25 15:02:09 CEST+0200", "meta": {"description": "Alternative Therapies - Electro-Medicine, Ozone Therapy, Nutritional Therapies, Colloidal Silver, etc.  Protection from new emerging diseases & biological attack through immunity boosting.", "lang": "en", "keywords": "blood electrolysis, non-drug therapies, electro-medicine, zapper, oxygen therapies, ozone, hulda clark, colloidal silver, royal raymond rife, georges lakhovsky, multi-wave oscillator, electromedicine, blood cleaners, gerson therapy, budwig diet, vaccines, nutitional, vaccinations, emerging diseases, nikola tesla, brain tuner, cure for AIDS, cure for cancer, scalar waves, magnetic pulser, alternative medicine, hanta, red tide, pfiesteria, curative plants, MRT, bob beck, dr joanna budwig, secret of life, waves that heal, dowsing, holistic, health, natural, len horowitz, immunity boosting, AIDS, cancer, Dr Robert O Becker, the body electric, cross currents, meditation, tesla coil, meningitus, flesh-eating bacteria, mad cow disease, suppressed, urine therapy, anthrax, virus, virii, ebola, flax seed oil, sodium ascorbate, cayenne pepper, capsicum, james clerk maxwell, F Batmanghelidj, mwo, juicing, supplements, vitamin c, vegetarianism, dairy, milk, fiber, your body's many cries for water, mcdougall program, immune system, diet for a new america, john robbins, borderlands", "favicon": "", "canonical": "https://educate-yourself.org/cn/vaccinationsinUganda22dec03.shtml", "encoding": "iso-8859-1"}, "image": null, "domain": "educate-yourself.org", "title": "Genocide & Vaccinations in Uganda", "cleaned_text": "2. Oral polio vaccine contra-indicated for immune deficient or HIV people according to CDC and package inserts:\n\n\"OPV [Oral Polio Vaccine] must never be given to patients who are immunodeficient including persons known to be HIV infected.\"---POLIOVIRUS VACCINE LIVE ORAL TRIVALENT Connaught (package Insert) \"When I looked at the contra-indications it stated that inactivated polio vaccine and not oral polio vaccine should be used in situations where families had HIV - where there was a history of HIV in the family. And when I got this information I was really shocked because since 1984 Uganda has had a very difficult HIV and AIDS problem. In fact it says that if a child is inadvertently given the oral polio vaccine, that that child should be quarantined for four to seven weeks because oral polio vaccine is \"live\" and they keep shedding it between that period, and they could contaminate other people........It (CDC) says that persons who have congenitally acquired immune deficiency disease -e.g. combined immune deficiency, blah, blah - should not be given oral polio vaccine because of their substantially increased risk for vaccine associated disease. Now, they continue: they say \"inactivated polio vaccine and not oral polio vaccine should be used to vaccinate immunodeficient persons and their household contacts.\" .....I rang the Centers for Disease Control and they have a line of experts that you can ask different questions. And I said 'I am living in America and I want to go to Uganda, and my children have not received oral polio vaccination. And they said 'No, they can't receive oral polio vaccination in this country.' I said 'Why not ?' and they said 'Well, you can get polio from oral polio vaccination.' ......So I said 'What if I have a history of HIV and I receive oral polio ?' They said 'That would be really pretty dangerous. It could be a death sentence.' Kihura Nkuba (Nov 2002)\n\n\"I was told by this preacher that when the government introduced the National Immunization Days in 1997, most of the children after vaccination started dying. The preacher told me that they had so much death that his cassock, that he wears to go and conduct the burial ceremony, got old. He said \"I buried the children and my cassock got old.\" In the same room there was one mother who had four children, and she hid one and took three other children for vaccination, and three children died and that one survived. Now when I went to do my presentation and I asked most of the people who were there - about two, three thousand people - each person had the same story. .........At the main hospital in Mbarara during that month of 1977 more than 600 children had died following polio vaccination. 600 children ! So even some of the timid medical practitioners who were initially afraid to come out, started coming out giving information and saying 'Oh, we knew this oral polio vaccine was trouble because as soon as the child receives it, they get a temper- ature and their health goes downhill and there is nothing that you could do.' \"----Kihura Nkuba (Nov 2002)\n\n4. Money spent on vaccines when clean water and other diseases mostly ignored (45% of UNESCO funds is spent on vaccines):\n\n NB: About 1.2 billion people still have no access to safe drinking water, and 2.4 billion do not have adequate sanitation services. Some 2 million children die every year from water-related diseases. (Ref)\n\n\"The forcing of them to take a vaccine against a disease they know to be harmless and which they know how to cure in its harmful state was seen as government hell bent on killing its own population for the benefit of commanding whiteworld.....Uganda spent nine million of its meager resources marketing this European product (the money spent would have build 120,000 protected water springs giving 30% of the country access to clean water, it would have built ten ultra modern research centers looking at, for example, pests that are threatening the banana crop, but government chose European impose priorities.\" \"--Kihura Nkuba 2003 \"The army and the police move house to house looking for children to vaccinate. At the same time, things that kill children like malaria, cholera, issues of stunted growth, sanitation, are completely untackled.\"--- Kihura Nkuba (Nov 2002)\n\nAround 1.5 million third world babies die every year due to dirty water used to make baby milk ( http://www.whale.to/w/baby_milk2.html )\n\n\"According to government, measles was a threat to national interest, claiming more than 40,000 lives every year (a statistic which is laughable since most people who get measles stay at home and treat it and the majority of sick people go to private clinics that do not keep records this figure was of course trumped up). This of course is a questionable statistic since the majority of deaths in Uganda are not registered and few parents remember any measles death. No point in registering a person once he has died. Forty thousand people are far much less than those killed in Uganda annually due to the civil war, dwarfs the figure for malaria, which kills a child every five second and for which governments is happy to ignore.......The forcing of them to take a vaccine against a disease they know to be harmless and which they know how to cure in its harmful state was seen as government hell bent on killing its own population for the benefit of commanding whiteworld. All village people know that once you have recovered from measles you will never catch it again, but here they were telling people to vaccinate even those who have recovered from measles. \"--Kihura Nkuba 2003 \"And according to the information I had, there was really no polio in Uganda. There had been no polio. I grew up to be twenty five. I didn't see anybody with polio. I started seeing polio when I went to the cities where polio vaccination had taken place. ........Other people started throwing their own questions: In Africa polio does not kill anybody and they say it's very rare to catch. It's really very rare to get paralytic polio. They say it's in very rare circumstances, so what is it that is killing people in Africa ? Malaria. Every five seconds a child is dying of malaria in Africa. Now to get the dose of life-saving anti-malaria is about $5 but there is no government to give anti-malaria. When somebody gets malaria, if they have no money they even die. So the question I was asking and many people were asking was 'If you really want to help children, why begin with a disease that they don't have ? (applause) Why not look for something that is killing them and save them from what is killing them ?' ..........\n\n \n\n But you don't begin with the rarest disease and spend all the government's meagre resources fighting polio, which is not a threat to most people, and then ignore something that is killing them in large numbers like malaria, like AIDS, like cholera, issues to do with sanitation, stunted growth - all the main things that matter to people the government was not fighting .......And then I started asking myself - humanity has lived in Africa for 5.5 million years from the stage of Australopithecines to Homo sapiens. Polio vaccination in Uganda started in 1963. So if we were all to die of polio like the Minister of Health was telling us, we would have died by 1963 and it would have been 'case closed'. Kihura Nkuba (Nov 2002)\n\n6. Dirty needles still in use 40 years after invention of disposable ones (impossible to completely sterilise re-usable needles):\n\n[Dec 2001]\n\n Over One Million Die Every Year World Wide By Injections\n\n http://www.whale.to/v/inj.html\n\n\" My final conclusion after forty years or more in this business [medicine] is that the unofficial policy of the World Health Organization and the unoffical policy of the 'Save the Children's Fund' and ... [other vaccine promoting] organizations is one of murder and genocide. . . . I cannot see any other possible explanation. . . . You cannot immunize sick children, malnourished children, and expect to get away with it. You'll kill far more children than would have died from natural infection.\"--Dr Kalokerinos (International Vaccine Newsletter June 1995) \"It was similar with the measles vaccination. They went through Africa, South America and elsewhere, and vaccinated sick and starving children...They thought they were wiping out measles, but most of those susceptible to measles died from some other disease that they developed as a result of being vaccinated. The vaccination reduced their immune levels and acted like an infection. Many got septicaemia, gastro-enteritis, etcetera, or made their nutritional status worse and they died from malnutrition. So there were very few susceptible infants left alive to get measles. It's one way to get good statistics, kill all those that are susceptible, which is what they literally did.\" --Dr Kalokerinos, M.D. \"We know the cause of SIDS. We can and have prevented them. It's all done with a compound called ascorbate. Not to use it means deaths will continue. There is no other answer. There never will be. For our findings are based on scientific facts. Not medical opinion.\"---Dr Kalokerinos\n\n\n\n In an experiment to find out of they could give high-potency Edmonston Zagreb (EZ) measles vaccine to babies as young as four months old [completing disregarding developmental neurology and lack of myelinization in the nervous system of babies] in order to overwhelm their natural maternal antibodies and replace them with vaccine-induced antibodies, medical \"researchers\" at the CDC and Johns Hopkins University injected thousands of babies in the Third World with the experimental vaccine that reportedly caused chronic immune suppression and the deaths of an unknown number of babies. Also, in the United States, with the help of Kaiser Permanente, more than 1500 six-month old black and Hispanic babies in inner city Los Angeles were \"enrolled\" in the experiment starting in June 1990. [ During the administration of president and ex-CIA director George Bush.] The study was halted in October 1991, after more than one year of genocidal activity, after repeated reports from vaccine trial sites in Africa that girl babies were dying in higher than expected numbers six months to three years after injection. [ A less-than-admirable population control effort.]\n\n http://www.cco.net/~trufax/vaccine/0696.html\n\nScientist 'killed Amazon indians to test race theory'\n\n http://www.whale.to/v/exp4.html\n\n \n\n Dr. Samuel L. Katz, Edmonston B vaccine and Ethics Scandal over experiment on Isolated Indians\n\n http://www.whale.to/vaccine/katz1.html\n\n\"In 1995, a Catholic human rights organization called Human Life International accused the WHO of promoting a Canadian-made tetanus vaccine laced with a pregancy hormone called human choriogonadotropic hormone (HCG). Suspicions were aroused when the tetanus vaccine was prescribed in the unusual dose of five multiple injections over a three month period, and recommended only to women of reproductive age. When an unusual number of women experienced vaginal bleeding and miscarriages after the shots, a hormone additive was uncovered as the cause.\n\n \n\n Apparently the WHO has been developing and testing anti-fertility vaccines for over two decades. Women receiving the laced tetanus shot not only developed antibodies to tetanus, but they also developed dangerous antibodies to the pregnancy hormone as well. Without this HCG hormone the growth of the fetus is impaired. Consequently, the laced vaccine served as a covert contraceptive device. Commissioned to analyze the vaccine, the Philippines Medical Association found that 20 percent of the WHO tetanus vaccines were contaminated with the hormone. Not surprisingly, the WHO has denied all accusations as \"completely false and without basis,\" and the major media have never reported on the controversy. For futher details on this issue, consult the Human Life International website (www.hli.org).\"--- Dr Alan Cantwell MD \"But, at the highest levels of the medical cartel, vaccines are a top priority because they cause a weakening of the immune system. I know that may be hard to accept, but it's true. The medical cartel, at the highest level, is not out to help people, it is out to harm them, to weaken them. To kill them. At one point in my career, I had a long conversation with a man who occupied a high government position in an African nation. He told me that he was well aware of this. He told me that WHO is a front for these depopulation interests.\"--Jon Rappoport interview\n\n\"In laboratories throughout the United States and in a certain number in Canada including at the University of Alberta. the US Government provided the leadership for the development of AIDS for the purpose of population control. After the scientists had perfected it, the government sent medical teams from the Centers for Disease Control-under the direction of Dr Donald A. Henderson, their investigator into the 1957 chronic fatigue epidemic in Punta Gorda—during 1969 to 1971 to Africa and some countries such as India, Nepal and Pakistan where they thought the population was becoming too large.13 They gave them all a free vaccination against smallpox; but five years after receiving this vaccination, 60% of those inoculated were suffering from AIDS. They tried to blame it on a monkey, which is nonsense.\"--Donald W. Scott MA, MSc. \"Vaccination enables the selection of populations to be decimated. It facilitates targeted genocide. It permits one to kill people of a certain race, a certain group, a certain country. And to leave others untouched. In the name of health and well-being, of course.\"--Dr Lanctot MD \"To determine the effect of different amounts of the vaccines, researchers at the hospital inoculated newborns from mostly lower-income black families with doses ranging up to more than 100 times the dose recommended for adults.\"--Media (http://www.whale.to/m/sv403.html) \"At a conference in Christchurch, New Zealand, Dr. William Jordon, director of Infectious Diseases, stated, that virtually all field trials of new vaccines in the United States are done amongst indigenous tribes in Alaska and various other parts of the country.\"---Harry V. Martin http://www.freeamerica.com/GovernmentCtrl/govctrl8.html\n\nI learned about - for example - the Marburg virus which appeared in Germany in 1967 [unintelligible] from a [unintelligible] laboratory that they were developing oral polio vaccine, and actually the monkeys had come from Uganda. So the monkey viruses had jumped from - had been - some of the viruses that lie dormant in some of these species for a long time - if you take these viruses and put them in the human body, they could do anything. And one of the things they did was to give Marburg, which is a cousin to ebola. In fact, after reading that information I predicted [what year ? N.S.] that there would be ebola in Uganda because of these vaccinations, and there WAS ebola in Uganda a year after ! So they started saying I was a prophet !\n\nBut the government was ready for them - not really the government - the minister of health, the World Health Organization and the UNICEF. They mobilized the army, and the police and moved from house to house. They had asked the local authorities to do a list of people who had children, so they moved from house to house grabbing children at gunpoint and vaccinating them.\n\nUgandan Kids Die By 1,000s ---A Transcript of a talk given by Kihura Nkuba (Nov 2002)\n\n http://www.whale.to/a/nkuba.htm\n\nGenocide via vaccination against First Nations aboriginal people in Canada\n\n http://www.whale.to/m/geno2.html", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whale.to/v/rapp.html", "http://www.whale.to/v/hepb1.html", "http://www.whale.to/v/aids2.html", "http://www.whale.to/a/kihura.htm", "http://www.whale.to/a/kihura.htm", "http://www.whale.to/w/baby_milk2.html", "http://www.whale.to/a/bangladesh.html", "http://www.whale.to/a/sanitation.html", "http://www.whale.to/vaccine/sanitation.html", "http://www.whale.to/v/needle.html", "http://www.whale.to/v/inj.html", "http://www.whale.to/v/kalokerinos.html", "http://www.whale.to/a/nutrition.html", "http://www.whale.to/m/a%5Csv40a.html", "http://www.whale.to/v/cantwell.html", "http://www.cco.net/%7Etrufax/vaccine/0696.html", "http://www.7mac.com/catalog/reports2.htm", "http://www.whale.to/v/exp2.html", "http://www.whale.to/v/exp4.html", "http://www.whale.to/vaccine/katz1.html", "http://www.whale.to/vaccine/edmonston.html", "http://www.rense.com/general36/history.htm", "http://www.whale.to/m/scott7.html", "http://www.whale.to/vaccines/lanctot.html", "http://www.whale.to/m/sv403.html", "http://www.freeamerica.com/GovernmentCtrl/govctrl8.html", "http://www.whale.to/m/exp8.html", "http://www.whale.to/a/nkuba.htm", "http://www.whale.to/a/kihura.htm", "http://www.whale.to/m/geno2.html", "http://www.whale.to/vaccines/lanctot.html"], "authors": ["By Doreen Miller", "Ken Adachi"], "publish_date": null}