{"result_id": "105021", "URL": "https://educate-yourself.org/cn/My-Employer-Wants-Me-To-Get-The-Vaccine-What-Do-I-Do-30jul2021.shtml", "timestamp": "2023-04-25 15:01:56 CEST+0200", "meta": {"description": "There are millions of employees who will be bullied into taking the unapproved gene therapy Covid shots, many to their own harm and injury. This article provides some useful thoughts on how to prepare and respond. It is also necessary to count the potential cost of resistance; if you meekly comply, then you are complicit in ushering in tyranny and your freedoms are lost - forever.", "lang": "en", "keywords": "educate-yourself.org, , press release is not same as published government policy,  Covid vaccine mandatory vaccination to keep job, mandated vaccination is violation of federal and Constitutional law, nuremberg code, vaccine religious exemption, vaccine medical exemption,  do not fill out company-provided form for covid vaccination, Black's Law dictionary, demand letter sent to employer to refute covid vaccicnation,  don't open door to probing questions from the employer,  talk directly to CEO or supevisor,  keep your personal info private, do not provide ammunition to probe you.  avoid wearing mask, don't ever accept covid vaccination coercion, do not wear a mask, LewRockwell.com,", "favicon": "", "canonical": "https://educate-yourself.org/cn/My-Employer-Wants-Me-To-Get-The-Vaccine-What-Do-I-Do-30jul2021.shtml", "encoding": "utf-8"}, "image": null, "domain": "educate-yourself.org", "title": "My Employer Wants Me To Get The Vaccine! What Do I Do?", "cleaned_text": "My Employer Wants Me To Get The Vaccine! What Do I Do?\n\n[Editor's Note: If you don't already know just how deadly & destructive the Covid misnamed \"vaccine\" is, I encourage you to visit my Bitchute video channel and watch the dozens and dozens of videos that I've been posting since April of 2020 which explain in great detail what's in these Death Jabs and what they will do to your body and to your mind if you are dumb enough and foolish enough to allow yourself to be 'vaccicuted\" - because that's exactly what the Covid Death Jab will do to you. If you've already got one or two injections, DO NOT GET ANY MORE and find out what can be done to try to undo or at least mitigate the damage that you're already inflicted upon yourself. This author suggest a very intelligent and common sense approach in dealing with the legions of numb skulls and nitwits who abound in this arena of vaccine promotion and coercion: Human Resources, government Health Departments, school administrators, etc, etc. You CANNOT behave like a shrinking violet when dealing with Idiots - when your life is at stake. You MUST know your rights and remain FIRM in forcing the Idiots to JUSTIFY their demands upon you by quoting the LAW which says your MUST be vaccinated to keep your job, etc. Such laws do NOT exist. It's all bluff and bluster. It's YOUR life that's being destroyed if you get the Death Jab, not THEIRS. If THEY are also too stupid to not realize how deadly the Covid Death Jab is, and get it themselves, then they too will discover the truth -- when it's TOO LATE to reverse the damage. ... Ken Adachi Copyright educate-yourself.org 2021, All Rights Reserved]\n\nMy Employer Wants Me To Get The Vaccine! What Do I Do? (July 30, 2021)\n\nFacebook Censorship\n\n To post this article on Facebook, link to the TinyUrl seen below.\n\n Facebook will remove any article identified as coming from educate-yourself.org\n\n https://tinyurl.com/35kt6rrz\n\nMy Employer Wants Me To Get The Vaccine! What Do I Do?\n\nJust received the below email from my CEO this morning. So, it looks like the county now is forcing employers to require all staff to be vaccinated.\n\n“With the increasingly rapid rise of new infections and the increasingly rapid increase in hospitalizations due to the scientifically proven, highly contagious, far more lethal Delta variant, counties in our area are recommending employers require ALL staff to be vaccinated.\n\n“There are also recommendations regarding requiring tracking, testing, and masking.\n\n“Our team is reviewing this guidance. We are getting feedback and legal advice. We are determining next steps on when and how this will be implemented. Stay tuned for more. We may start with a new tracking app that will be required by all employees on and off the job as a way to stay ahead of compliance recommendations.\n\n“In the meantime, if you aren’t already vaccinated, be sure to get vaccinated (unless otherwise directed by your doctor). Keep wearing masks at work. Even if you are doubly vaccinated, a double mask can’t hurt.\n\n“If you are vaccinated, please always carry with you a picture or a copy of your vaccination certificate. You may be asked to prove your status at any time. Also be sure to send it to HR as well.\n\nAllan, what are my options for not taking the Covid shot?\n\n-They Are Finally Coming For Me\n\nThank you for your note.\n\nThey’ve always been coming for you. Now is no different. Take a deep breath. Evil loses battles like these all the time. Just keep your wits about you.\n\nI’d like to point out that you sent a bad policy. It’s a press release from a government office. Never, ever, under any circumstances read a press release and consider it the actual policy. If this topic is important enough for you to write me, then make it important enough to call the county and obtain the actual text of the actual policy that this press release is citing. Once you read that policy, you may realize that the press release — and by extrapolation your boss’s email — are total mischaracterizations of the actual policy.\n\nMany lawyers are total liars. I have observed something repeatedly during Covid though: the lawyers who write the actual policies tend to be very diligent and honest in the performance of their duties, whereas the government employed public relations representatives who draft press releases, journalists who act as their unquestioning stenographers, and politicians who will literally distort every sentence they speak at a press conference are all so incredibly prone to telling the grandest lies.\n\nThe press conferences and press releases mean next to nothing. The media stories mean nothing. If you are going to take an interest in the policy, get a hold of the actual policy, which is something you will probably be the first person at your company to have done. Unless your boss is a total piece of work, which, in your specific case, it sounds like he is, you may even be able to explain the actual policy to him, and he may alter his behavior and enforcement accordingly.\n\nI strongly recommend you obtain the actual policy mentioned in the press release before we go any further.\n\nNow let’s shift our focus to your company policy.\n\n1.) Please ask for a written copy of the company’s vaccine policy.\n\nA written policy is not well laid out with graphics from a website or poster. It is not a few sentences in an email from your boss. Unless you work at a mom and pop, the actual policy is probably between 4 and 10 pages long and written in legalese, written by a lawyer (more likely) or someone in human resources (less likely).\n\n2.) Until you have read it, don’t assume anything and don’t fill anything out.\n\nStop everything you are doing until you get that policy, read it, understand it, and have no remaining questions. If anyone pushes you to act before looking at the policy, say “I’d like more time to review and understand the policy.” Until you are satisfied, act as if the previously-in-place policy were still in place and indicate to others that you expect that until you’ve had time to properly review.\n\n3.) Somewhere in there are exemptions.\n\nYou do not have to take this vaccine. Your tool of a boss even says so in the note: unless otherwise directed by a doctor. There may be additional exemptions. Religious exemptions are also widely talked about at present.\n\n4.) You don’t even need to subject yourself to the policy, you can consider having a conversation with your boss.\n\nBefore we get any deeper, let me remind you that you always have the option of just talking to your boss. Many have had conversations with bosses in which they say the new policy doesn’t work for them and that they will not be complying. Some people even go so far as to let the boss know that if that means they will be fired, they accept that fate. This works better if you are a cherished member of the team and your boss is not a total sociopath. Sociopaths are disproportionately over-represented among the maskholes and vaccine nazis, but that is no reason for me to assume that your boss is a sociopath. Your boss may be quite reasonable in fact and, like many people, doing whatever it takes to get through the day as effortlessly as possible.\n\nI think the overwhelming majority of problems in the world, this included, can be solved with an honest conversation, often of less than three minutes in length. Both parties don’t even have to be honest for this to work. I strongly support the honest conversation approach.\n\nSome people take it a step further than a conversation with their boss. They even go so far as to send legal letters. You can send demand letters through an attorney and take the matter to court if the employer doesn’t comply. There are people who send their own legal demand letters without an attorney. A group of several hundred San Francisco city and county employees are doing exactly that. The Commoner Law Group at the website www.commonerlaw.com has more about the process they are using. Government employees and students all over the country can try the same. I consider this an untested method, but I do not dismiss it, as every effective process starts somewhere. It is an extension of the honest conversation.\n\n5.) Please feel free to send the policy to me as well if you’d like me to take a look.\n\nThey will make it seem like you have to, but if you read the policy, you are going to see that the exemptions are vast and at this point are going to be very easy to exempt yourself from.\n\nRead the policy, every word. Understand it. If there is legalese that you don’t understand, I recommend Black’s Law Dictionary. Old versions can be found online free of charge, with this website being one such example.\n\n7.) You don’t have to comply with the policy, but if you do, use the exemptions open to you.\n\nYou should understand all policies that apply to you. You should push back when policy isn’t followed. You should communicate when a policy is a dealbreaker to you or detrimental to you, your immediate role, or to the company. Exemptions in one-size-fits-all health mandates are included to help assure that there are channels for such conversations.\n\nI consider this an important distinction. The policy doesn’t likely require a specific form be used. If it does, the specific form is not likely mandated by government. The form is something someone in human resources made one afternoon last week.\n\nThe form likely asks for extraneous information and probably requires you to attest to something that is outside of what is required by the policy. These forms come into existence through malice, incompetence, and bad communication alike. Don’t give such forms too much credence.\n\nIt is my strong recommendation that you IGNORE THE FORM. Don’t mention it unless it’s first mentioned to you. Don’t reference it. Don’t quote it. Don’t imitate it. Just be yourself and honor your privacy by providing the bare minimum.\n\n9.) Send your own letter instead of using their form.\n\nI think a conversation is ideal. If that doesn’t work, then an email should do the job. If that still doesn’t seem like it will do the job, then write a letter invoking your exemption.\n\nThank you for sending me the policy. I am medically exempt.\n\nAlternately, you may want to indicate a religious or other exemption.\n\nThank you for sending me the policy. I am religiously exempt.\n\nDon’t name medical conditions. Don’t cite religions. Don’t quote scripture. Don’t share ideas. Leave that all private.\n\nFirst of all, you should leave that all private because it is private. Secondly, you should expect that every little detail you write will be nitpicked and one day fought over by some compliance clerk looking to prove a point. The less you give, the harder that is.\n\nIf you don’t cite Psalm 23 as the reason you won’t take a vaccine, then a Supreme Court ruling on Psalms 23 not being a legitimate reason not to take a vaccine does not affect you. The same goes for specific conditions. It’s none of their business.\n\n10.) Provide as little info as possible.\n\nAs a fully functioning adult, you should be very comfortable drawing boundaries with statements like these:\n\n“The details of that are private.”\n\n“I’d prefer not to talk about that, since it is personal.”\n\nUse them liberally. Don’t open up the door for probing conversations intended to pick away at your resolve and obtain compliance in the guise of caring concern.\n\nCan they legally demand a doctor’s note? I don’t know. They don’t either. We are in untested times.\n\nDon’t let their goofy policy be the reason you need to spend your resources getting a note from a doctor or pastor. Self-certify with your own note that you are exempt. Let them push the issue with you if they don’t like your note.\n\nDon’t look to an email for this either. If they challenge you, ask them to point to the place in the policy that says a doctor’s note is required (but only do this after you read the policy, so they can’t change it on you).\n\nIf it is in the policy, ask them to point to the place in the local government policy they claim to follow that says that. Push back against this every step of the way. Each time, turn around and put the onus on them to prove or disprove.\n\nBe very comfortable saying, “No, I will not be able to do that. I have fully complied with the policy. I do not want to be harassed any further about this.”\n\nSome people think if you don’t take a Covid shot, you must wear a mask. Don’t fall for that false dichotomy.\n\nSaturday night, after a 26-year old member of their congregation — Armoni Howard — sadly died from a Covid shot, I sat on a panel with a group of people at the bravely led Calvary Chapel in San Jose who were explaining the legality of saying no to vaccine mandates.\n\nMy role on the panel was to communicate “SAY NO TO THE UNSAFE, INEFFECTIVE, AND EXPERIMENTAL COVID SHOT AND SAY NO TO THE UNSAFE, INEFFECTIVE, AND EXPERIMENTAL FACE MASK.”\n\nDon’t accept either. Wearing a face mask is stupid. There’s no reason to do it. It’s totally ineffective against the spread of a respiratory virus. There is, in fact, negative reason to wear them. They cause medical harm, sociological harm, and psychological harm.\n\nBlood pressure is elevated while wearing them, more than half of people experience headaches, nighttime sleep apnea can emerge or increase if they are worn during the day, internal organs (including heart, lungs, brain, and kidneys) are harmed, fetuses are even harmed, so no pregnant woman should ever be in one, all activity is made measurably harder in a face mask, people have died wearing a face mask while exercising, OSHA has never until spring 2020 considered the forced wearing of a mask to be a minor matter. My next book contains another 250 or so other ways wearing a face mask harms you. No one should be wearing one — not you, not your kids, and not anyone who looks to you for advice.\n\nIf you need help saying “No!” to the face mask, read “Face Masks in One Lesson,” read these LewRockwell.com pieces, and sign up at RealStevo.com to receive videos and email methods for how to stop this nonsense.\n\nThe Best of Allan Stevo\n\nAllan Stevo [send him mail] writes about international politics and culture from a free market perspective at 52 Weeks in Slovakia (www.52inSk.com). He is the author of How to Win America, The Bitcoin Manifesto, and numerous other books.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bitchute.com/channel/FPuXuQf53s7M/", "https://www.lewrockwell.com/author/allan-stevo/?ptype=article", "https://educate-yourself.org/cn/My-Employer-Wants-Me-To-Get-The-Vaccine-What-Do-I-Do-30jul2021.shtml#top", "https://tinyurl.com/35kt6rrz", "https://covid19.sccgov.org/news-releases/pr-07-22-2021-public-health-officials-urge-employers-to-require-employee-vaccination?__cf_chl_jschl_tk__=pmd_95f067ceca0fe135c270c8f5e0eef953afdf5603-1627592079-0-gqNtZGzNAo2jcnBszQh6", "http://www.commonerlaw.com/", "https://thelawdictionary.org/", "https://rumble.com/vki3ij-allan-stevo-my-body-my-choice-medical-freedom-information-calvary-chapel-ju.html", "https://www.amazon.com/dp/1953847005?linkCode=ogi&psc=1&th=1&tag=lrc18-20", "https://www.lewrockwell.com/author/allan-stevo/?ptype=article", "https://realstevo.com/", "https://www.lewrockwell.com/author/allan-stevo/", "mailto:allanstevo@yahoo.com", "http://www.52insk.com/", "https://www.amazon.com/America-Paul-Cause-Freedom-2012/dp/1469988380?imprToken=GH1W0c-4juez1ANBuPx6Bw&slotNum=0&SubscriptionId=AKIAI63WS3YGA3Y5U2QA&tag=lrc18-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=1469988380", "https://www.amazon.com/Bitcoin-Manifesto-Allan-J-Stevo/dp/1539595137?SubscriptionId=AKIAI63WS3YGA3Y5U2QA&tag=lewrockwell&linkCode=xm2&camp=2025&creative=165953&creativeASIN=1539595137"], "authors": [" Allan Stevo ", "Ken Adachi"], "publish_date": null}