{"result_id": "105020", "URL": "https://mail.educate-yourself.org/", "timestamp": "2023-04-25 15:01:55 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "https://mail.educate-yourself.org/", "encoding": "iso-8859-1"}, "image": null, "domain": "mail.educate-yourself.org", "title": "", "cleaned_text": "The Freedom of Knowledge, The Power of Thought ©\n\nIf you are a first time visitor to this website, this home page will give you a brief summary of many of the major topics covered. I've placed the subjects of Chemtrail Dispersion, orgone generators, and Sylphs at the very top of the short overviews seen below because of their singular importance. If you are already familiar with this website, then go straight to Current News for newly posted information You will find links for the major subsections of this web site posted at the top of each page for easy access...Ken Adachi\n\nWrite Down this Mirror web site address of educate-yourself.org in Switzerland in case you cannot access any page at this web site (our thanks to Stephane Meier for maintaining this mirror site): http://mirrors.wordsforgood.org/educate-yourself.org/\n\nEducate-Yourself.org is a free educational forum dedicated to the dissemination of accurate information in the use of natural, non-pharmaceutical medicines and alternative healing therapies in the treatment of disease conditions. Free Energy, Earth Changes, and the growing reality of Big Brother are also explored since survival itself in the very near future may well depend on self acquired skills to face the growing threats of bioterrorism, emerging diseases, and the continuing abridgement of constitutional liberties. It is strongly recommended that visitors to this web site print out hard copies of the information that is of interest. Do not assume that your hard drive, this web site, or even the Internet itself will always be there to serve you....Ken Adachi, Editor\n\n9-11, The Greatest Act of Treason in American History\n\n\n\n (Always check here FIRST for the latest articles being posted to this web site.)\n\n\n\n In January of 2002, I posted an article to this web site titled Goodbye Chemtrails, Hello Blue Skies which described a simple, homemade invention called a Chembuster. This new invention, inspired by Wilhelm Reich's Cloudbuster, demonstrated that it was possible to disperse and break up chemtrails, allowing for a return of normal blueness to the sky, an invigoration of the air with a clean, fresh smell and the production of rain in those areas where drought is being artificially created by HAARP and other secret weather controlling technologies. The Chembuster incorporates three common elements that, when mixed together, produce an orgone generator, a device which transmutes the negative polarity of atmospheric orgone energy into the positive polarity of that energy. The negative polarity of orgone, coined \"DOR\" by Wilhelm Reich, is the \"glue\" which holds chemtrails together. Reversing the polarity of the atmospheric orgone envelope causes the chemtrails to break up and disperse. Over the next two years, as more Chembusters were being constructed and set up by readers who became aware of this phenomenon, the concentration of atmospheric DOR sufficiently reduced in those areas to allow an influx of Giant Sylphs into the 'chembusted' atmospere. Sylphs are intelligent air elementals which can literally overlay and transmute chemtrails into real clouds. I realize that it's hard to believe that ordinary people can destroy chemtrails in the manner described, but we have the photos and testimonials to confirm the claim. No one has to continue to tolerate chemtrail 'bombardments' any longer. You can clear your sky of chemtrails! Read the links and view the photos to understand more about Sylphs and chemtrails.\n\nA smaller orgone generating device which utilizes similar construction materials, was coined an HHG, but I find that a Pyramid or Dome shaped five crystal orgone generator more descriptive. The Pyramid or dome shaped Orgone Generator seems to intended for Mind Control and other nefarious purposes that are being radiated from underground facilities (Montauk), HAARP, microwave GWEN towers and affiliated ELF microwave antennaes (commonly called 'cell phone' towers) which have sprung up like daisies all over this country beginning in 2001.Orgone generators can also 'neutralize' underground military bases, masonic lodges, places of satanic ritual activity, etc.\n\nThe success being achieved to date by a of dedicated people who are building and deploying these devices is very impressive. I get E mail all the time from people asking me \"What can I do to stop the New World Order?\" . Well, this is one thing you can do! You can participate in rescuing your health, your mind, and your freedom by obtaining and deploying these saving inventions, orgone generators.\n\nTired of seeing the very air you breathe being poisoned with chemtrails by the satanic Illuminati criminals who are intent on eliminating 85 % of the world's population? Prefer to wait until they precipitate their next major national convulsion in order to shock and stampede the public into accepting total fascist tyranny which will eventually lead to door-to-door roundups of 'troublemakers' (meaning Americans who resist being inducted into the ranks of mind controlled robots) and their delivery into concentration camps (more accurately-liquidation camps)? The evidence is clear and compelling-- for those who are willing to look with open eyes and open minds.\n\nEducate-Yourself Discussion Forum\n\n I've have started a chat forum at Yahoo Groups. I get dozens of E mails every day from people who often have helpful and inspiring information to contribute, but I don't have enough time to repost these interesting anecdotes on this web site. The Discussion Forum is the place to exchange information and express your ideas or comments, but without any attempt to sell a product or promote a personal agenda. Let us assist each other in a spirit of friendly cooperation and mutual benefit...Many thanks, Ken\n\nWe want you to enjoy a long and full life in good health, without the concern for medical insurance or dependence on the orthodox \"health care\" system. You can learn to empower yourself and take full control of your health destiny through self education.\n\nCollodial Silver (CS)\n\n The FDA attempted to stiffle sales of colloidal silver from health food stores and web sites in the Fall of 2000. Read our Nov 12, 2000 Newsletter.\n\n ( http://educate-yourself.org/newsletter/eynewsletter12nov0.shtml ) . Sufficient resistance was generated by commercial interests to cause them to back down soemwhat, but new restrictions were imposed on what could be said regarding the uses and benefits of colloidal silver. You'll notice that the CS sold in health stores today will only state the contents of the bottle and not much more.\n\nJan 17, 2001\n\n The FDA has contacted web sites that provide colloidal silver (CS) and has informed them that any they now consider colloidal silver a drug and under their jurisdiction. They have stated that no therapeutic claims about CS can be made. We have removed articles about CS , but still offer CS generators on the Products page. You can always contact me at Ken Adachi, Editor if you wish obtain more information about colloidal silver. A general introduction follows:\n\nFew people are aware that silver has been used since ancient times to fight infections and eliminate disease conditions. It possesses unique germicidal properties that can interfere with the mechanisms of ALL bacteria, viruses, fungi, and molds while pharmaceutical antibiotics can typically only affect 5 or 6 species. It is a natural antibiotic that disease organisms can never develop a resistance to. You don't need a prescription ( so far ) and you can make it yourself using your own generator .\n\nBioengineered disease organisms are routinely being introduced into the atmosphee via chemtrails. Many \"mysterious' flu-like symptoms originate with chemtrails. Colloidal silver is one way to give yourself a fighting chance to avoid becoming ill from these organisms.\n\nChemtrails\n\n The secret government has been spraying the skies throughout North America since late 1997 on an almost daily basis with substances that were first identified as \"mystery contrails\", but later were dubbed \"chemtrails\" by investigative reporter and author William Thomas. When questioned, military and government officials either deny any knowledge of these sprayings outright or they offer unbelievable and ludicrous explanations that only a moron could believe. These sprayings are making many people sick and are the first phase of a bio-warfare operation designed to effect wide scale population reduction .. Find out what's going on.\n\nEmerging Diseases\n\n Ebola, Hanta Virus, AIDS, Gulf War Disease, Mad Cow Disease, Pfiesteria (\"Red Tide\"), Flesh-Eating Bacteria, Listeria, E-Coli H0197, are some of the new emerging diseases to hit the news in the past few years. The Hong Kong Bird Flu of '98, the outbreak of Viral Encephalitis in Malaysia which had caused the death of over 100 pig farmers and a million pigs, the outbreak of the West Nile Virus in New York, the explosive spread of Tuberculosis in Russia (25,000 Russians died of TB last year ), and the current worldwide \"Flu\" Epidemic are just some examples of an unprecedented explosion of new, virulent forms of disease. The evidence is strong and compelling that the overwhelming majority of these new diseases have been intentionally bioengineered by the New World Order elites for purposes of population reduction .\n\nForbidden Cures\n\n Natural Healing, Vibrational Medicine, BioElectro-Medicine, Oxygen Therapies, Urine Therapy, Color Therapy, Subtle Energy Medicine, Magnetic Therapies, and many other alternative healing therapies have been largely suppressed or intentionally ignored by the Big Boys in the medical orthodoxy precisely because they work. In fact, they work too well andthat, of course, is why they are ignored and suppressed. Big Medicine is Big Business and Big Business doesn't want any low cost, low tech, do-it-yourself natural cures. However, .\n\nImmunity Boosting\n\n The body's own immune system, if sufficiently strengthened and boosted by natural means, can resist or weather an attack by any biological organism. Learn how to treat and resist disease conditions naturally , without the need for drugs.\n\nNutrition\n\n Plant food that is grown with traditional, non-bioengineered seed, in organic soil, using natural light, and irrigated with clean water and natural fertilizers will produce the most potent and vitalizing source of nourishment for human consumption. Generally, the processed food obtained in supermarkets by the average American family is health robbing, energy depleting, and creates an ideal environment for disease to exist within the body.\n\nOzone\n\n Ozone is an unstable, but highly beneficial molecule. It's the tri-atomic form of oxygen: Instead of the normal arrangment of 2 atoms of oxygen (O2), ozone is comprised of 3 atoms of oxygen (O3). Ozone, however, doesn't want to stay in that tri-atomic state very long and unless held in check or bound by other molecular couplings, ozone will usually break down from O3 to O2 + O1 within 20 minutes of so (at atmospheric pressure at least). O1 is called a singlet oxygen atom and it's HIGHLY REACTIVE. with just about any substance that should NOT be in the human body including all pathogens (virus, bateria, etc.) and synthetic compounds or their metabolites such as drugs and their metabolite residues.\n\nBioelectrification\n\n In the Fall of 1990, two researchers at Albert Einstein College of Medicine in New York City found that a very small microcurrent of electricity prevented the HIV virus in blood from reproducing itself. A patent was granted in 1992 for a tiny implantable device that required major surgery and hospitalization. Dr Bob Beck figured out a way to apply this microcurrent of electricity non-invasively and opened the door wide for a do-it-yourself 'spontaneous remission', bypasing the AIDS Industry entirely with a small \"black box\". This device has demonstated remarkable success with many other serious health conditions as well.\n\nThe Story on Drugs\n\n \"The truth about cures without drugs is suppressed, unless it suits the purpose of the censor to garble it. Whether these cures are effected by Chiropractors, Naturopaths, Naprapaths, Osteopaths, Faith Healers, Spiritualists, Herbalists, Christian Scientists, or MDs who use the brains they have, you never read about it in the big newspapers.\" Hans Ruesch\n\nVaccine Dangers\n\n The dangers of vaccinations far outweigh any of their purported 'benefits'. Start reading about the many, many victims of vaccinations that have resulted in death (especially SIDS) or lifelong neurological damage such as autism. Become informed about the deceit, lies, and propanganda surrounding the promotion of vaccines.\n\nThe Mind-Body Connection\n\n If you study the subject of alternative healing long enough, you eventually come to the inescapable conclusion that all healing (and energy) is vibrational in nature. All forms of energy, whether detrimental or beneficial, first affect us on the etheric level and later translate to the physical level.Thought is the prime creative energy of the universe. Once created, thoughts (like energy) cannot be destroyed (but they can be modified). Since The Creator endowed us with the power to create thought , we can create healing energies with our mind alone. In addition, with proper training, you can access any information you wish to obtain through the mind.\n\nNCH Tone Generator\n\n If your computer has a sound card, this NCH audio tone generator can play audio tones through your computer speakers or earphones. You can set the frequency from 1 hz to 20,000 hz. Certain specific tone frequencies can modify and improve all kinds of health conditions. It's called Sound Therapy. If you wish, you can greatly augment this therapy by simultaneously applying Light Therapy, which is also simple and easy to set up.\n\nNatural Health Newsletter\n\n The newsletter originally focused exclusively on alternative health information, but now we include other areas of concern which we feel are important for the reader to be aware of. Back issues are only a click away.\n\nScroll down to the bottom of this page and subscribe to our free newslettter by sending in your E mail address. We now have an automated process for subscribing and unsubscribing.\n\nThe New World Order (NWO)\n\n There is a worldwide conspiracy being orchestrated by an elite group of genetically related individuals which include many of the very wealthy, politically powerful, and corporate elite of the world, as well as members of the so-called Black Nobility of Europe whose goal is to create a One World (fascist) Government, stripped of nationalistic and regional boundaries, that is obedient to their agenda. Events are moving at a frightening pace toward the total implementation of that agenda which includes utilizing mass Mind Control of an unprecendended scale and scope.You need to inform yourself of this diabolical scheme and takes steps to thwart their agenda\n\nNew World Order News\n\n There are so many daily news items that are in reality the unfoldment of the NWO Agenda; scripted, planned, and executed by their obliging minions in the mainstream media. It's easier and simpler to group these items under one index of the New World Order News.\n\nMind Control\n\n Very few people are aware of the extent to which this government has engaged in perfecting the terrible \"art\" of mind control. Mind control means exactly that:.total and complete control over your mind, your body , and your activities. A person who has been programmed under mind control is a robotic slave in every sense of the word. There are at least 12 million Americans who have already been programmed to be mind controlled slaves via the old programs of MK ULTRA, Project Monarch, and the Montauk Project . Now, the entire population of this country is soon to be subjected to total mind control via the microwave GWEN towers being erected everywhere. and recognize the GWEN towers in your part of town. Their use as cell phone transmission relays is a . Their real purpose is mind control.\n\nTed Gunderson\n\n Ted Gunderson retired from the FBI as Special-Agent-In-Charge for Los Angeles after 29 years of service. He has accumulated some of the most damning documentary evidence of wide-spread satanic ritual abuse (and murder) of young children in this country by very high level satanists whose grisly actively is being covered up and protected by governmental agencies of The United States of America. The recent accusation of radio talk show host Art Bell leveled at Ted Gunderson was intended to discredit and undermine Gunderson's credibility. Now why, I wonder, would anyone want to do that?\n\nLinks\n\n Here, I've listed some web sites, which I feel have something to say. I hope you'll also find them interesting and useful. Check often, as we will routinely add to this list.\n\nMembership\n\n Donations make it possible for this effort to go forward. Of course, it feels good to receive a helping hand when you need it, but the person responsible for providing that help gains a much richer gift, soul development. There is an immutable spiritual law at work in the universe that applies to any who give selflessly for the benefit of others (\"to the least of my brethren\"). It's called The Law of Giving and givers will always receive abundance many fold in return. You might think of that the next time you are presented with any opportunity to financially assist those who need some help (beggar, bum, drug addict, etc.) and assist them without judgement.\n\nMembership support will come in a variety of categories. All members will be privy to special \"perks\" in recognition of their support.\n\nDiscussion\n\n Readers who wish to express their thoughts about the issues raised at educate-yourself.org may do so providing posters refrain from personal attacks, flaming, selling, or crude language. Disruptive, provocative, or insulting individuals will be removed from the forum. This moderator is interested in a civilzed and cooperative exchange of ideas and comments. Thanks, Ken Adachi\n\nWanna help?\n\n Because of the sensitive nature of the information provided at this web site, it would be prudent to establish Mirror Sites in locations both inside and outside of the United States. If you can and wish to help in this regard, please let us know. We also need volunteer translators to translate some of this information into their native tongue as well as coordinators who can help in organizing local seminars, workshops, or natural healing health information centers. Let me know if you wish to participate in any capacity.\n\nContact Us\n\n You can reach us via this web site, E-Mail, telephone, or snail mail. Your choice.\n\nOn Sending E Mails:\n\n I try to answer most inquiries and E mail messages as soon as possible, however, I can't respond to unsigned E mails. You need to properly identify yourself if you wish to receive an answer. This rule does not apply to people who have special information to pass on to me, but fear for their personal safety. You can remain anonymous to any degree you desire. If you have inside information on the Illuminati, mind control operations, criminal conduct by intelligence agencies, the military, etc., the safest way to convey your informaiton is to send me ordinary, snail mail, not e-mail-if you are concerned about surveillance and monitoring. If you wish to remain completely hidden, then use the same two or three name pseudonym in all your correspondence and I can respond to you (if necessary) at the bottom of your published material (if it's appropriate and desired to publish your info). Otherwise, if I need to respond, I can leave a message for you on the covert message page found at the links at the top of each web page at this web site.\n\n Sincerely, K. Adachi\n\nLetters to The Editor\n\n I get some interesting mail, but I don't have the time to answer all of it. You can read some selected mail that I've answered from the above link. The mail ranges from health questions, to testimonials, to criticism, to advice, and everything in between. A lot of people ask specific questions that they could answer themselves if they put a little effort into researching it, but they think that I'm the 'answer man', sitting here at the keyboard ready to do their homework for them. I don't have time for that.\n\nHealth questions, especially, take a lot of time, and in most cases, you can get an idea of what to do by reading the links contained here more carefully. I've had more than a few people write to me with their obscure, esoteric questions and say \"OK, educate me!\" Good grief, .the name of the web site is Educate Yourself. It's necessary for uninformed people to pull themselves up by their own bootstraps and come up to speed. I'm merely opening a door or two. It's up to you to walk through it.\n\nI'm trying to give visitors to this web site the idea that they can take care of themselves without depending on the so called 'health' industry, which includes drug companies, the allopathic medical establishment and their pals in the insurance industry. I'm also trying to alert you to the dangers of the rapidly decending New World Order. The much ballyhooed \"End Times\" is a scripted and contrived strategy to justify the ushering in of a One World (fascist) government in response to the expected call and \"need\" for \"stabilization\" from beleagured people around the globe following the of those 'predicted' End Times conflicts.\n\nDifficult times may lay ahead, but we have the divine guidance and capacity to circumvent much of the intended misery by becoimng FULLY aware of the manipulation and deception being injected into our daily lives. Everything seen in national and international \"news\" is scripted and planned. There are no surprises. The Illuminati creates conflicts and 'crisis' scenarios in order to introduce their 'solution' to the 'problem', therby of total control and chainless enslavement of every single person on the planet.\n\nThe way to undo the New World Order enslavement agenda is through knowledge and honest information . Let's assist each other with that goal in mind.\n\nThis Page Last Updated: May 10, 2019", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/cn/missinglinksvideo31aug08.shtml", "http://educate-yourself.org/cn/missinglinksvideo31aug08.shtml", "http://video.google.com/videoplay?docid=7866929448192753501&hl=en", "http://educate-yourself.org/cn/index.shtml", "http://educate-yourself.org/ct/goodbyects10jan02.shtml", "http://educate-yourself.org/dc/orgonegenindex.shtml#chembusters", "http://educate-yourself.org/cn/chembustersexplained24feb03.shtml", "http://educate-yourself.org/ct/index.shtml", "http://educate-yourself.org/ct/ctpeanutbutterbariumsandwiches17apr02.shtml", "http://educate-yourself.org/dc/orgonegenindex.shtml", "http://educate-yourself.org/zsl/sylphsgasgiants23mar04.shtml", "http://educate-yourself.org/zsl/sylphstransmutechemtrails06jun04.shtml", "http://educate-yourself.org/zsl/sylphstransmutechemtrails06jun04.shtml", "http://educate-yourself.org/cn/sylphandchemtrailindex.shtml", "http://educate-yourself.org/mc/mctotalcontrol12jul02.shtml", "dc/gwentowersbybyronweeks.shtml", "dc/dclatestonmctowerarrays25may02.shtml", "nwo/brotherhoodindex.shtml", "nwo/nwopopcontrol.shtml", "http://educate-yourself.org/tg/stalag17camps22mar03.shtml", "cn/discussionforum11may02.shtml", "intro.shtml", "cn/csintro.shtml", "newsletter/eynewsletter12nov0.shtml", "http://educate-yourself.org/contactus/", "cn/99-00/alertnotice2.shtml", "http://educate-yourself.org/contactus/", "ct/index.shtml", "nwo/nwopopcontrol.shtml", "ed/index.shtml", "ed/ednycenceph2.shtml", "ed/edrussiantb.shtml", "ed/edrussiantb2.shtml", "ed/edfluindex.shtml", "nwo/nwopopcontrol.shtml", "fc/index.shtml", "immunboosting/index.shtml", "nutrition/index.shtml", "ozone/index.shtml", "be/index.shtml", "fc/drugstory.shtml", "vcd/index.shtml", "mbc/index.shtml", "nch/index.shtml", "newsletter/index.shtml", "fe/index.shtml", "nwo/index.shtml", "mc/index.shtml", "nwo/nwonewsindex.shtml", "mc/index.shtml", "dc/gwentowersbybyronweeks.shtml", "tg/index.shtml", "tg/nwogundersonsmear1may0.shtml", "links.shtml", "membership.shtml", "http://groups.yahoo.com/group/Educate-Yourself_Forum/", "http://educate-yourself.org/help.shtml", "http://educate-yourself.org/contactus/index.shtml", "http://educate-yourself.org/lte/index.shtml", "links.shtml", "http://educate-yourself.org/cn/britishisraelhiddenhand10jul05.shtml", "http://educate-yourself.org/cn/tavistockarticlesindex04jun04.shtml"], "authors": [], "publish_date": null}