{"result_id": "105040", "URL": "https://educate-yourself.org/intro.shtml", "timestamp": "2023-04-25 15:02:07 CEST+0200", "meta": {"description": "The purpose of this web site is to help people become self sufficient and self reliant in all matters of health care. The Western World's dependence on orthodox allopathic medicine (conventional physicians who prescribe drugs), pharmaceuticals, and the Standard Western Diet have brought us to a deplorable state of national health. There is no one more interested in maintaining your health, than you. In our opinion, you need to accept the primary responsibility and not delegate it to others. Millions and millions of Americans have suffered (and died) needlessly because of the foolish abandonment of personal health care responsibility into the hands of others.", "lang": "en", "keywords": "ken adachi, intoduciton, www.educate-yourself.org, organized medicine, alternative medicine, nature medicine, allopathic medicine, patient management, pharmaceuticals, drugs, self empowerment, self education, educate yourself,  mother nature,", "favicon": "", "canonical": "https://educate-yourself.org/intro.shtml", "encoding": "us-ascii"}, "image": null, "domain": "educate-yourself.org", "title": "Introduction to", "cleaned_text": "Facebook Censorship\n\n To post this article on Facebook, link to the TinyUrl seen below.\n\n Facebook will remove any article identified as coming from educate-yourself.org\n\n\n\nThe purpose of this web site is to help people become self sufficient and self dependent in all matters of health care. The Western World's over-reliance and dependence on orthodox allopathic medicine (conventional physicians who prescribe drugs), pharmaceuticals, and the Standard Western Diet have brought us to a deplorable state of national health. There is no one more interested in maintaining your health, than you. In our opinion, you need to accept the primary responsibility and not delegate it to others. Millions and millions of Americans have suffered (and died) needlessly because of the foolish abandonment of personal health care responsibility into the hands of others.\n\nFor most of this century, Organized Medicine has engaged in a deception. The public has been led to believe that:\n\nA) Allopathic medicine alone is legitimate, proven, and worthy of public trust (while all other forms of therapy are to be distrusted and branded as quackery, etc.) and that\n\nNeither is true. Allopathic physicians, while appearing to be healers, actually are involved in the business of ‘patient management'. The familiar routine goes like this: The patient visits the doctor and tells him what's wrong. The doctor writes a prescription to ameliorate the symptoms. The cause and prevention of the disease condition are never broached. For the overwhelming majority of chronic sufferers, the patient regularly returns again and again for ‘visits and checkups'. This system keeps the dutiful and obedient patient coming back for regular doctor appointments, while at the same time keeping your friendly pharmacist busy refilling those prescriptions. I'm afraid that's what the game is really all about. In fact, it was planned that way. All of this activity is fine with the insurance industry, since under this paradigm, medical insurance coverage becomes an absolute necessity in everyone's life.\n\nOf course, the average young allopathic physician is typically unaware of the game. He's plugged into a mind-set and conditioned to believe from medical school that's he's engaging in honest patient care using the best tools (and drugs) available to modern science. By maintaining a closed mind, however, and only being receptive to \"peer reviewed\" wisdom, our young Dr Kildaire usually winds up perpetuating the bias and scientific dishonesty that passes for most \"medical science\" today.\n\nWhat role has the Standard Western Diet played in determining our national health profile? .....Plenty. Today, millions of people suffer from chronic diseases that didn't even exist in previous centuries. Diabetes and heart disease, for example, are 20th Century conditions. Chronic Fatigue Syndrome wasn't even described in the literature until the mid 1980's. Yet, one study estimated that today, 70% of the adult American population suffers from Chronic Fatigue! Many modern afflictions largely arose as a result of a fundamental change in our national diet. The chronic use of drugs and vaccines has also played a major role.\n\nAt this web site, we'll explore both the questions and answers to modern ailments and how you can learn to take care of yourself. Everyone can learn to take control of their own health destiny and put an end to the worry and other desperate emotions engendered by reliance on the so-called ‘health care' system.\n\nHere's a few Questions and Answers to think about:\n\nWhat can I do ?\n\nTake charge and stop relying on your doctor, hospital, clinic, or pharmacist to take care of you. Learn how the body works, learn how to avoid disease, and learn how to treat ALL disease conditions yourself if you become sick.\n\nBut we need doctors and hospitals!\n\nOnly in very limited circumstances. For acute emergency medical situations like auto accidents or sudden heart attacks, sure, you want to go to an emergency room or a trauma center, but for routine illnesses, chronic disease, and even so-called 'terminal' diseases, you're better off educating yourself and learning how to treat the condition with a non-pharmaceutical approach. Your chances for long term survival are generally a lot greater if you go the alternative, natural route. Usually, taking drugs over a long period of time will serve to lower your immunity, toxify your body, cause organ degeneration, and lead to more serious, life-threatening disease.\n\nObviously, it would be much better if the American government allowed its citizens to choose the healing modality and healer of their choice, but in most states it's prohibited and enforced with Gestapo tactics. You can thank the drug cartels and their allies in allopathic medicine for that. Oh, and let's not forget the unthinking, uncaring, gutless, slimeball, corrupt politicians who sold out the American people to these vested interests by passing restrictive and limiting laws under the banner of \"protecting the public\".\n\nSo, do we really NEED doctors? No, you don't need them. Organized Medicine has been brain washing you since childhood with the notion that you need them. The fact is, they need you ...mainly to keep the money rolling in.\n\nHow can I take care of myself?\n\nThrough education and the realization that The Creator of All, working through Nature, has already supplied you with all the ‘equipment' necessary to take care of yourself.\n\nSo, what do I have to do?\n\nThe only thing you have to do, is to learn how to work with Mother Nature and observe her laws. She'll take care of everything else for you! We'll get you started on the education part.\n\n \n\n Ken Adachi", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://educate-yourself.org/contactus/index.shtml#top", "https://educate-yourself.org/intro.shtml#top", "http://educate-yourself.org/lte/failuresoforthodoxmedicine16oct06.shtml"], "authors": [" Ken Adachi", "Ken Adachi"], "publish_date": null}