{"result_id": "107004", "URL": "https://eluxemagazine.com/culture/cats-eat-a-vegan-diet/", "timestamp": "2023-04-25 15:02:26 CEST+0200", "meta": {"description": "can cats eat a vegan diet, can dogs be vegetarians, what's the best diet for a cat, can dogs be vegan, can cats be vegan, can dogs be vegan", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/cats-eat-a-vegan-diet/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "Can Cats Eat A Vegan Diet? What About Dogs?", "cleaned_text": "Can cats eat a vegan diet? Are vegetarian dogs healthy? What’s the best diet for your pet? We asked an expert for the answers!\n\nVegan pet owners love their dogs and cats. We buy them ‘ designer dog collars. We let them sleep on the bed. We even let them kiss us on the mouth! (well, sometimes). But the truth is, we’re often grossed out when we need to dump a mass of smelly ‘wet’ (or worse, raw) food into a dish for them.\n\nSome argue that pets are better off with home prepared foods rather than commercial processed pet food, and tend to feed their fur babies table scraps, or even make their own dishes for them! And no wonder: several contaminants have indeed been found in pet foods, including old restaurant grease that contains high concentrations of dangerous free radicals, trans fatty acids, PCBs and even heavy metals.\n\nToxic fish byproducts, which have bacterial, protozoal, fungal, viral, and prion contaminants, along with their associated endotoxins and mycotoxins, have been found in cat food. And let’s not forget that many dog and cat foods contain hormones, GMOs, glyphosate, antibiotic residues and dangerous preservatives. YUK!\n\nAs PETA has highlighted, supermarket pet foods are often composed of ground-up parts of animals like cartilage, bones, hoofs, noses and eyes, which the U.S. Department of Agriculture has deemed unfit for human consumption. Moreover, any flesh that is in pet food could actually be from animals that may have died of infections and other diseases – humans are not allowed to eat these, but animals are.\n\nIn fact, up to 50% of commercial pet food brands are comprised of byproducts. These include various body parts, such as brain, spinal cord tissue, bones, lungs, intestinal tracts, slaughterhouse wastes and what is known as “4-D meat” (from dead, dying, diseased or disabled animals). This kind of meat often is susceptible to the bovine spongiform encephalopathy, that we all know as mad cow disease.\n\nSome vets ascertain that the increases in pet cancer rates, kidney failure, and other degenerative diseases in our companion animals may be due to these harmful ingredients in many commercial meat-based pet foods. This makes some pet owners wonder:\n\nCan cats eat a vegan diet? What about dogs?\n\nNot all experts agree on whether vegan food can give all the nutrition needed for a healthy diet. Lew Olson for instance, author of Raw and Natural Nutrition for Dogs, believes that a vegan diet can work for dogs if there is a way to squeeze in some animal protein. However, for cats, it would completely go against their physiology.\n\nAccording to PhD laureate Olson, the risks of feeding dogs or cats vegetarian or vegan diet include an inadequate total protein intake, imbalance of the certain amino acids, such as taurine, and deficiency in vitamins and minerals. Puppies or kittens are the ones most at risk in this switch of potentially dangerous diet.\n\nSure, animals do normally eat quite a lot of plant matter. And to feed them the meat that they would naturally attain would mean you should allow them to hunt for themselves, which obviously isn’t recommendable if you live in a metropolis! So what’s the best kind of food for your pet? Can dogs and cats eat a vegan diet?\n\nTo find out, we interviewed a top vet, Dr Philipp Schledorn for some advice.\n\nFirst of all: what’s meant by ‘clean eating’ for pets?\n\nThe clean eating trend is extending to the whole household including our pets. Recent reports have demonstrated the huge surge in demand for more natural pet nutrition, and predict this will continue to grow. The Global Pet Food Market report stated this growth is driven by the increasing call for grain-free pet food products, along with the increasing demand for more natural or even organic pet food products.\n\nWhy do pets get so many cancers?\n\nSimilar cancers occur in dogs and humans. There are some types of cancer that have only been observed in dogs or that occur more frequently in dogs than in humans. The cancers in dogs can be distinguished either by cell type or by localization – that is, site of occurrence. Certain cell types occur more frequently on certain anatomical structures than other types of tissue. Like humans, cancer risk increases with increasing age. Since the average life expectancy of a dog has risen steadily due to improved veterinary care in recent years, the number of cancer cases has also increased. That’s why it’s essential to have good pet insurance to ensure you can give your pet the best care should they get sick.\n\nOne of the most common cancers we see in cats is lymphoma, which is associated with the feline leukemia virus (FeLV). Even though there’s a vaccine for feline leukemia now, we still see a number of cats that have been exposed to it, and exposure greatly increases a cat’s chance of developing feline lymphoma.\n\nWhich vaccinations are the most essential. Which can be avoided?\n\nAs a vet I wouldn’t say that there are any vaccines which are not important. Often I get asked by pet owners why they should vaccinate their pets, but the illness which we vaccinate animals against are important (see cat cancer, above). Fundamentally, you should always take your vet’s advice on vaccines for your pet so they don’t suffer from needless illnesses.\n\nWhich foods can never be given to cats?\n\nBesides wondering , you should also know there are a few foods that are toxic to cats. But chances are cats won’t be that attracted to them anyway. These include:\n• None Legumes such as beans, peas and lentils\n\nWhich foods can never be given to dogs?\n\nChocolate . Ensure all chocolate treats are not accessible to your pet. The darker the chocolate the more theobromine it contains, which is what is poisonous to your pet.\n\nG rapes and raisins can lead to serious adverse reactions from your pet. Symptoms such as vomiting and diarrhoea as well as lethargy could indicate your pet has eaten some fruit that they shouldn’t.\n\nAvoid feeding them nuts, especially macadamia nuts which can even cause a dog to collapse if consumed in large amounts as well as posing as a choking hazard.\n\nBo that can be toxic to dogs dependant on the dose and form. Garlic powder can be harmful if given in high doses. Onions are of the same family as garlic and are even more unsafe to dogs than garlic per ounce.\n\nM ints, gum and candy contain xylitol which is a natural, sugar-free sweetener. Consumption of it, even in smaller quantities, can cause life-threatening low blood sugar within 10-15 minutes. If a dog consumes a lot of xylitol it can lead to liver failure. Symptoms of this poisoning include collapse, vomiting, seizures, jaundice, malaise, and can in worse case scenarios prove to be fatal.\n\nWhat’s the best kind of pet food to give your cat or dog?\n\nA lot of dry pet food, particularly the more common supermarket brands, contains grains, which is actually not necessary for your pet’s nutrition; the grain is just a cheap filler. Dogs are meat eaters and do not need any grain in their diets. Ash in cat food is the most common filler can can lead to urinary tract issues for cats. Moreover, grain is often connected to intolerance, intestinal complaints and allergies. It’s best to avoid dry foods for cats with ash, or with grains for dogs.\n\nWet foods are probably the best commercial food for both cats and dogs, but ultimately, a mix of fresh meats and fish and grain-free store-bought foods are best for cats, while a dog’s diet is more versatile and can be based on pet food, most table scraps, and fresh meat.\n\nHow can you tell if your pet has a food intolerance?\n\nFood allergies and intolerances for pets can show themselves in a number of ways such as ear infections, itchy skin, or diarrhoea and vomiting, but which foods are triggering the reaction can be hard to work out. If your pet shows these symptoms, it’s best to eliminate one at a time to work out what is causing the reaction then avoid feeding them that from then onwards.\n\nThose who ask should remember many cats are actually allergic to the grains and cereals in dry cat food.\n\nA dog’s digestive tract is developed for protein and fat digestion, which makes the starch contained in dry dog food with grain hard for them to handle. Wet foods that contain a lot of meat can be easier to digest. A high quality food covers the needs of the dog and promotes its health and well-being.\n\nWhat are some of the best ingredients to look for in pet food?\n\nIf a pet’s coat starts to lose its shine and appear dull, it could be a sign that they aren’t receiving sufficient levels of nutrition in their food. Omega 3 is found in flaxseed oil, salmon oil, tuna and sardines, which are all rich in good fatty acids. They promote strong bones, prevent fur loss, boost metabolism and stimulate growth. Salmon oil has also been shown to have a preventative effect against many heart diseases, as it can lower cholesterol and improve blood flow. You can add these to your dog’s existing meals and should not receive any complaints, dogs find them delicious!\n\nOrganic kitchens across the country seem to be putting coconut oil in everything, and this should include the dog’s dinner! AniForte Coconut Oil for cats and dogs has many of the same positive benefits on pets. It supports soft and smooth skin and adds shine to coats. It also has a repellent effect on insects, ticks and mosquitoes which is about to be more of a problem now the temperatures are starting to rise. Can cats eat a vegan diet? Well, no. But they can at least enjoy coconut oil.\n\nOne of the main appeals of natural pet foods is they are free from additives, chemicals and artificial flavourings. High protein pet foods should have at least 80% meat content. High protein leaves less room for an upset digestion and intolerances to cereals and grains. Bones and raw food (BARF) is great for dogs. Be sure that your cat’s food has a minimum of around 60% protein.\n\nAdding some pure collagen supplements to your cat or dog’s food will help them avoid joint pain. Also look for this ingredient on the label of pet foods in the supermarket.\n\nNow for the big question: can cats be vegans? Dogs?\n\nThe domestic dog is, in zoological terms, a predator/carnivore. But this is only half of the picture, as the wolf, for example, is not comparable with a domestic dogs. It’s thought to be necessary for our dogs to eat meat, but unlike wolves, domestic dogs are no longer pure carnivores and can consume and digest a much wider range of nutrition as an adaptation to their human environment. My dog enjoys a mix of meat and some vegetables – but that’s not to say he’s a vegan.\n\nCan cats eat a vegan diet? Well, cats are different. Trying to feed a cat a vegan diet is like feeding horses meat – you’re taking a whole species of animal and trying to force it to eat something that it isn’t designed to handle by nature. For cats, I would say a vegan diet is inappropriate. It totally goes against their physiology and isn’t something I would recommend,\n\nFor dogs, certainly vegetarian and even vegan diets are possible, but they need to be done very, very carefully. There is a lot of room for error, and these diets probably are not as appropriate as diets that contain at least some animal protein.\n\nIf you are truly wondering: , you should meet with a veterinary nutritionist who can analyse your pet’s current diet and make recommendations for additional health safeguards.\n\nWe are a nation of pet lovers to the extreme. Our pets are like our family, and we want to spoil them! But we could be killing them with kindness. You don’t have to look far to find evidence of obesity amongst the nation’s pets. According to a recent survey by the Pet Food Manufacturing Association 81% of veterinary professionals believe the issue of pet obesity is getting worse.\n\nThere are a few easy ways to tell if your pet is carrying too much weight: ma ke sure you can feel your pet’s ribs and see that the curve to their lower body is visible. A pet should experience no difficulty when getting up, or jumping; if they look like they’re struggling to do so, excess weight could be a cause.\n\nWhat are your thoughts? Can cats eat a vegan diet? Can dogs? Have you tried a clean eating diet for your pets? Let us know in the comments, below!", "opengraph": {"locale": "en_US", "type": "article", "title": "Can Cats Eat A Vegan Diet? What About Dogs?", "description": "can cats eat a vegan diet, can dogs be vegetarians, what's the best diet for a cat, can dogs be vegan, can cats be vegan, can dogs be vegan", "url": "https://eluxemagazine.com/culture/cats-eat-a-vegan-diet/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2021-07-16T03:45:32+00:00", "article:modified_time": "2022-01-03T18:54:05+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2020/01/pexels-peng-louis-3073694.jpg", "image:width": "640", "image:height": "426", "image:type": "image/jpeg", "article:author": "https://www.facebook.com/EluxeMagazine?ref=br_rs"}, "tags": [], "tweets": [], "movies": [], "links": ["https://humix.com/redirect?url=https%3A%2F%2Fwomensswim.com%2Fhumix%2Fvideo%2Fa2b1d162c1684cb26c1fdc1102588542699291f1", "https://www.vetsmall.theclinics.com/article/S0195-5616(11)00223-3/pdf", "http://en.wikipedia.org/wiki/Polychlorinated_biphenyl", "https://www.catwhisperer.se/why-fish-is-bad-for-cats/", "https://www.researchgate.net/publication/261250327_Detection_of_glyphosate_residues_in_animals_and_humans", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3614097/", "http://www.peta.org/issues/companion-animal-issues/companion-animals-factsheets/meatless-meals-dogs-cats/", "https://www.usda.gov/", "https://books.google.com.pe/books?id=hd4CRyaDkKoC&pg=PA169&lpg=PA169&dq=up+to+50%25+of+commercial+pet+food+brands+are+comprised+of+byproducts,&source=bl&ots=l3-6j1PaG5&sig=ACfU3U1cT3FJ7JPs1EECjeUfndCPPydSDw&hl=en&sa=X&ved=2ahUKEwjlzIbs3dfmAhVLLLkGHW_iDRUQ6AEwAHoECAoQAQ#v=onepage&q=up%20to%2050%25%20of%20commercial%20pet%20food%20brands%20are%20comprised%20of%20byproducts%2C&f=false", "https://mysatisfieddog.com/4d-meats-in-dog-food/", "http://www.amazon.com/Raw-Natural-Nutrition-Dogs-Definitive/dp/1556439032", "https://www.facebook.com/pg/Tierarzt-Philipp-Schledorn-1642449515994490/posts/", "https://eluxemagazine.com/magazine/clean-eating-for-pets/attachment/dog-2210717_960_720/", "https://www.pumpkin.care/", "http://pets.webmd.com/cats/facts-about-feline-leukemia-virus", "https://eluxemagazine.com/magazine/clean-eating-for-pets/attachment/unnamed-16-21/", "https://dog-gear.com/best-wet-dog-food/", "https://eluxemagazine.com/magazine/clean-eating-for-pets/attachment/cat-323262_960_720-2/", "https://eluxemagazine.com/magazine/clean-eating-for-pets__trashed/attachment/lucky-cat-1196761_960_720/", "#abh_about", "#abh_posts", "https://eluxemagazine.com", "https://www.facebook.com/EluxeMagazine?ref=br_rs", "https://twitter.com/eluxemagazine", "https://eluxemagazine.com", "https://eluxemagazine.com", "https://go.skimresources.com/?id=88703X1541792&xs=1&isjs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fchere-di-boscio-56b2a1b%2F&xguid=01CXZQKRMG8R5WKD9TJS0C61E9&xuuid=8b7711adf522c99deb05fe5ce8f4e688&xsessid=&xcreo=0&xed=0&sref=https%3A%2F%2Feluxemagazine.com%2Fabout%2F&xtz=-480&jv=13.12.1-stackpath&bv=2.5.1", "https://eluxemagazine.com", "https://eluxemagazine.com/author/chere/", "https://eluxemagazine.com/culture/win-a-natural-tanning-kit-by-le-beach/", "https://eluxemagazine.com/culture/eluxe-horoscopes/", "https://eluxemagazine.com/fashion/jewellery/ethical-engagement-rings/"], "authors": ["Chere Di Boscio"], "publish_date": "2021-07-16T03:45:32+00:00"}