{"result_id": "107007", "URL": "https://eluxemagazine.com/culture/i-quit-social-media-heres-what-happened/", "timestamp": "2023-04-25 15:02:28 CEST+0200", "meta": {"description": "I Gave Up Social Media For A Week, what it's like to give up social media, how to quit social media, how to stop social media addiction", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/i-quit-social-media-heres-what-happened/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "I Quit Social Media. Here's What Happened", "cleaned_text": "I quit social media for over a week now. Here’s what happened, and how I feel\n\nAs the Editor of Eluxe, it’s virtually impossible for me to give up social media, even for a day. I have articles to share, messages to answer, and clients to attend to. But believe me – I would love to ditch the laptop, even for a mere 24 hours! Especially these days.\n\nWhile things seem to be more dire in this world than they ever have been in my lifetime, it always appears to be way, way, worse when I’m on social media. Food shortages are coming! Lockdowns have destroyed billions of jobs! Corrupt governments are putting nations into debt that will take generations to pay off! Mandatory vaccines are on the way! There’s gonna be a civil war! The virus is gonna kill us ALL!\n\nBut you know what? When I go outside and play with my animals in my garden – none of that is ‘real’. The sun is shining, my friends, family and neighbours are happy and healthy, and the birds are singing. All that doom and gloom? It’s ‘realest’ on social media!\n\nSo when I got an email about a woman who gave up her social media accounts, I was intrigued – and a bit jealous! Her story really inspired me, especially in these times of hysteria and fear. I hope it does the same for you.\n\nI decided last week to get off social media for a while. I felt sidetracked by my phone. Which I guess is a nice way to say: I was addicted to my smartphone . For years now.\n\nI tried many things to get off my iPhone. It started with turning off all sounds for my notifications, and then all notifications altogether. The next step was going off for a couple of hours a day, especially when I had to focus, or wanted to be with my friends – I would either put my phone on airplane mode or not take it with me. The result? I quickly got the reputation of “never being available”. I heard things like: “You’re harder to reach than Obama!” Crazy, isn’t it? How we expect people to be available to us 24/7?\n\nFor some time, I changed the colour settings on my phone to black and white, inspired by a good friend of mine. It’s unbelievable what colour can do with your mind. It’s incredible how boring your phone becomes when there are no colours to keep you hooked. Try it! But as I couldn’t use my camera either with those settings, I changed my phone back to a coloured screen. And hooked I was again.\n\nNone of my attempts were actually having the effect I was striving for. I still felt the stress of my phone addiction in my daily life. On most of my spare moments, I would grab my phone. I felt like a robot being used by my own phone instead of the other way around. Watching documentary last week was the final nudge I needed to really disengage for a while. I called it my own “Social Experiment”.\n\nIt’s now over a week that I quit social media. From day one, I felt a sense of peace, yet also a little disoriented. A dozen of times a day I’d pick up my phone and literally tap on the screen exactly where the apps used to be. So hooked! Feeling withdrawal symptoms, I found myself with so much more time during the day I hardly knew what to do with it. I felt a certain kind of emptiness. Quoting Hemingway here..\n\n“By then, I knew that everything good and bad left an emptiness when it stopped. But if it was bad, the emptiness filled up by itself. If it was good you could only fill it by finding something better.”\n\nAs the days passed, social media, surprisingly, was not at the top of my mind anymore. I started gazing at the sea whilst eating instead of scrolling my feed. I started speaking with friends when I had some free time instead of posting to my accounts. I started learning about the art of photography instead of sharing my daily photos online and engaging in the comments of others. I started writing instead of scrolling.\n\nIt felt like waking up to real life. I felt more connected to nature, the cosmos, and myself.\n\nGenerally, I started feeling calmer and more connected with my surroundings after I quit social media. Yet the most interesting things I witnessed is having more inspiration and much more focus! The effects are remarkable, really. I never expected it to be so.\n\nNow, two of the main reasons I was hesitant to get off social media were: one – I was scared I would lose connection with my friends. And two – I was afraid I wouldn’t get new clients as I wasn’t able to promote my services as much online.\n\nBut the results have been so positive since I quit social media, I decided I will keep going for a month and see how it goes. Results after just one week: I got more new clients than usually have in a month and I feel more connected to my friends than before. The fears in my mind now prove to just have been mental projections to keep me in the old and familiar and in the illusion that with social media I am fulfilling two of my basic human needs: s\n\nWhen you watch the documentary mentioned above, you’ll get more insight into the profound psychological manipulation these apps and platforms have literally built into them. And that’s from the people that actually created them! I highly recommend that you watch it.\n\nAs I watch the stars at night and stare into the cosmos instead of my screen, I wonder about the influence of the technology in our lives, in both good and bad ways…\n\nSince I work online I cannot deny the immense freedom and benefits I’ve gained from technology. It’s not all bad, of course. But it needs to be controlled. For sure.\n\nI think we have to honestly ask ourselves: which aspects of technology are actually beneficial, and which are not?\n\nI wonder what will happen when we all don’t have a phone to stare at for hours a day. How will we connect with people, do business, and contact emergency services if there’s no internet? How will we even take photos or listen to music without a phone? Aren’t we a bit too reliant on this technology?\n\nAnd…what would happen if we connected more directly with each other? Face to face? Or even if we put pen on paper and wrote letters and sent packages instead of emojis and messages?\n\nAs I spend more time contemplating, witnessing and engaging in my own daily life, I can’t help but philosophise about what is truly important in my life. And how social media fits in all that.\n\nMy 75-year old neighbor invites me almost daily for a coffee and most of the times I join her for a quick chat and some human connection, which I now have plenty of time for, by the way. I asked her what she thinks of social media and technology. As I stared at her old Nokia phone on the table, she told me her views.\n\nShe has a tablet she only uses for Skyping her grandchildren, who live on the Greek mainland. She tells me all about the fights she has to get her grandchildren to play together instead of fighting over gaming on their devices. She thinks we’ve lost the plot, and that slowly, we will lose our true human connections. We’re already losing the ability to converse and to write longer prose.\n\nShe compares her own children with her grandchildren, and tells me about the differences in focus, collaboration and needs. Fascinating, really. Just one generation apart.\n\nI wonder how we can bring up children with healthy boundaries towards technology and social media as a whole. If we can’t do it ourselves, how can we ever teach our children to do so? I don’t have children myself (yet), but I do wonder how we as a society can pull this off – especially given that schools are now pushing kids to study on tablets instead of using books and pens and paper.\n\nAnd then I have another big question.\n\nIs the way forward perhaps going back? Some things just don’t change, like our core human needs for Love. Connection. Safety. Peace. ‘Old school’ does not equal bad or less evolved. But we are all pressured to buy the newest/latest/coolest devices. And 5G is just around the corner…I think Mrs. Aliki, my neighbour, has some real wisdom here to share with us.\n\nI don’t have the answers myself. But I know I will stay off social media for a while more, enjoying the enhanced creativity and focus. This ditching of social media is new for me, but has already had some good effects on my mental, emotional, physical and even spiritual health.\n\nSo I’ll keep going back to basics, and delve a bit more into the mystical side of life. I’ll keep you posted! Not on social media, of course. but by ‘old school’ email, if you care to reach out.\n\nThe real world is really beautiful, and life has so much more to offer than the ‘virtual’ life of a screen.\n\nThat conclusion I have already made for sure.\n\nThank you for reading. On a screen, that is. Ha! The irony!\n\nSending you love and peace wherever you are.\n\nI quit social media. But could you? We’d love to hear from you in the comments, below!\n\nEleni’s inquisitive mind, passion for people and her life quest for the meaning of life led her to travel to over 45 countries, earn multiple degrees, explore multi-faceted career paths, and learn five languages. Eleni is of Greek-Dutch origin. She is a women’s life coach, branding consultant, website developer and writer. Eleni doesn’t have a career, she has a mission; a devotion to assist women in rediscovering their own light and helping them to create a life and business that feels true to themselves. You can find her at", "opengraph": {"locale": "en_US", "type": "article", "title": "I Quit Social Media. Here's What Happened", "description": "I Gave Up Social Media For A Week, what it's like to give up social media, how to quit social media, how to stop social media addiction", "url": "https://eluxemagazine.com/culture/i-quit-social-media-heres-what-happened/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2020-10-14T08:05:58+00:00", "article:modified_time": "2021-04-01T21:32:36+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2020/10/pexels-andrea-piacquadio-3764173.jpg", "image:width": "640", "image:height": "426", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://eluxemagazine.com/culture/articles/alternative-social-media-sites/", "https://humix.com/redirect?url=https%3A%2F%2Fsimplyecologist.com%2Fhumix%2Fvideo%2Fa30955bdae2a0e324f3e9579ae79d35c3bce903d67c516c96ae1c59607d46362", "https://www.imdb.com/title/tt11464826/", "https://eluxemagazine.com/culture/articles/dangers-of-5g/", "http://www.elenimeraki.com", "http://www.gutsandtales.com", "#abh_about", "#abh_posts", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/travel/green-skiing-in-morzine/", "https://eluxemagazine.com/fashion/ethical-wedding-guest-outfit-ideas/", "https://eluxemagazine.com/recipes/alternative-hummus-recipes/"], "authors": ["Guest"], "publish_date": "2020-10-14T08:05:58+00:00"}