{"result_id": "107011", "URL": "https://eluxemagazine.com/culture/articles/alternative-social-media-sites/", "timestamp": "2023-04-25 15:02:31 CEST+0200", "meta": {"description": "Alternative Social Media Sites, alternatives to facebook, alternative social networking sites, private social media sites", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/articles/alternative-social-media-sites/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "Alternative Social Media Sites To Facebook & Others", "cleaned_text": "Sick to death of the lack of privacy from Facebook (and Insta, and Whatsapp, which it owns) Try these alternative social media sites instead!\n\nRecently, many people have been searching for alternative social media sites after feeling seriously betrayed by the social media giants.\n\nWhistleblower Edward Snowden decried Facebook as being ‘surveillance disguised as social media‘, since the CIA and NSA have long been monitoring all of our activities on that platform – every like, post and comment.\n\nUsing nine internet firms including Facebook, Google, Microsoft and Yahoo, the NSA tracked online communications in a sweeping surveillance programme known as Prism. Britain’s electronic eavesdropping agency GCHQ was also accused of gathering information on the online companies via Prism.\n\nBut no matter where you live or who you are, through Facebook, Prism knows your name, address, and even has a database to be able to spot you via your personal pictures anywhere in the world, thanks to CCTV and facial recognition cameras and Facebook’s facial recognition software.\n\nFacebook has also been caught selling our data to every corporation and organization that comes a-knocking – even really nefarious ones like the CIA and Cambridge Analytica. And let’s not forget that Facebook also owns two of the other most popular social media sites in the world: Whatsapp and Instagram. Do you really feel comfortable using those now?\n\nAnd then there’s Google-owned YouTube. Once a way to communicate news and ideas to the world via video, it has more or less blacklisted many non-traditional ideologies it doesn’t like—for example, they’ve hidden LGBTQ content and censored or demonetized channels they consider to be ‘alt right’. No surprises there, since Google has also lowered the rankings of any sites they feel go against their political position, calling those ‘fake news’. (And if you’re looking for an alternative to Google, that’s a great idea too! Just click here).\n\nRight now, their focus is on anything against the mainstream narratives on political issues like Syria or Russia. But how long before they bury alternative health news that threatens mainstream medicine, information about veganism that threatens beef and milk lobby groups, or even corporate disasters similar to what happened at Rana Plaza? We have many reasons to worry.\n\nDespite all these pitfalls, social media still has its claws in us. We’re social creatures. It fills a need. We want to connect, to share, to stay informed. Social media is basically a newspaper, greeting card and a personal letter all rolled up in one—and interactive, to boot. No wonder some of us are hesitant to quit social media altogether, despite all the caveats.\n\nBut with mainstay sites like Facebook and YouTube behaving so badly, doesn’t it make sense to look for alternative social media sites for your connection fix, while also taking more control of your own privacy and data protection?\n\nBelow are what we think are seven of the best Facebook alternatives, and new options to choose instead of more mainstream social media sites.\n\n“Like Facebook, but with privacy.” That’s the motto of MeWe. Engineered with privacy in mind, MeWe sticks two fingers up to Facebook and other social media companies with a revolutionary service that emphasises privacy and social sharing where people can be their real, uncensored selves. Benefits include:\n• MeWe members are #Not4Sale and enjoy the protection of a Privacy Bill Of Rights.\n\nAvailable on iOS, Android, and desktop, MeWe is an integrated social network and chat app with all the features people love, including:\n\nMeWe members enjoy total control over what they share along with full ownership of their content and data, which will never be sold. The next-gen social networking platform allows members to see every post, chat, comment, etc., made by individuals and groups they are connected to, in true timeline order with no interference.\n\nCalling itself Ello is a Pinterest-like network launched in 2014 for those who create art or enjoy looking at others’ art. Your profile is based on your interests and your preferred content (writing, architecture, visual art, etc.). The more wide-ranging your interests, the more categories you can choose. Once you’re set up, your feed consists of posts catered to your specific interests. You can comment, like, repost, follow and buy, and meet new people in the ‘Discover’ section. Best of all? You can also share and your own content.\n\nEllo is free to use, although they’re considering the idea of offering some paid services in the future. And with the goal of being the alternative social media network of choice, Ello is marketed on three principles.\n• They don’t sell user data to advertisers or third parties. In fact, data collection is restricted to what you provide on the Settings page and in posts: name, email address, location, creator type, etc. The rest of your data is anonymized.\n• They don’t force you to use your real name.\n\nIf you’re the creative type, Ello could be the social network for you. It even offers an opportunity to earn commission on the sale of your art.\n\nDiaspora is an interesting case study. The creators of this open-source project were obviously very skeptical about centralized power, so they dreamed up a decentralized system. Launched in 2010, the Diaspora platform actually consists of many different networks, called pods.\n\nAd-free, Diaspora is built on three egalitarian philosophies: decentralization, freedom and privacy, thus returning social networking to the people. Similar to the Facebook setup, you can post status updates, share content and leave comments on others’ posts.\n\nDevelopers encourage users to report offensive content, as when ISIS propaganda surfaced on the network in 2014. Otherwise, censorship can only happen with approval by pod admins.\n\nSince it’s decentralized, Diaspora can’t be owned by any one individual or corporation. Data is carried on individual pods, rather than being held by a central provider. Indeed, with enough knowhow, you can even operate your own pod, which basically acts as a server. Thus you can be certain that your private data remains private.\n\nYou really do own your own data and control your own privacy settings. Otherwise, you can register at any pod of your choosing, communicate with any other user on any pod and download desired data from the network at your leisure. You choose who reads your posts. And you needn’t use your real name.\n\nAs far as I can tell, Vero is one of the most ethical Facebook alternatives out there. It’s a subscription based social network that presents itself as “a social network for anyone who loves anything enough to share it – and wants control over who they share it with. Just like we do in real life.”\n\nVero is ad-free and never collects your data. It can do this because it’s based on a totally different business model to Facebook. The latter actually to mine its users’ data in order to make a profit. On the other hand, Vero only collects some usage data, which is used to see how often the app is used, but note that this option by default is turned off. That’s quite unlike Facebook, where users can go into settings and adjust some of them to be more private, but ultimately have zero control over what is being done with their information.\n\nAlso, unlike Facebook, Vero won’t mess with algorithms, won’t shadowban posts, won’t censor information, and isn’t designed to be addictive.\n\nLaunched in 2017 in the wake of YouTube’s stricter censorship and demonetization policies, this YouTube competitor is a peer-to-peer video hosting service. The idea behind Bitchute is similar to Diaspora’s decentralization concept: the site uses WebTorrent to operate P2P video-sharing over the BitTorrent network. WebTorrent works inside web browsers and requires no installation.\n\nThe cost of bandwidth is normally the biggest obstacle for new video-sharing platforms. With their ad revenue, YouTube can afford it—but consequently, they must also toe their advertisers’ censorship line. This isn’t a problem for Bitchute: they needn’t provide bandwidth because users provide their own.\n\nTo register with Bitchute, you can give your name or remain anonymous. In order for Bitchute to collect your personal information, you must give consent. Rest assured, unlike YouTube and Facebook, they won’t sell it to third parties or advertisers. But refusal to offer your personal information may result in an inability to engage in certain service-related activities.\n\nThis blockchain-based blogging and social networking site started in 2016. Perhaps the most innovative alternative to mainstream social media sites, it rewards authors with payments for their contributions with a cryptocurrency called Steem. You don’t mine Steem with an expensive computer rig, but rather by creating and commenting on content, which then is written to the Steem blockchain and stored in a permanent blockchain ledger.\n\nSo far, Steemit claims over 900K user accounts and over USD$40,000,000 of payments to contributors – incredibly innovative, considering Facebook uses all our content that we give for free, in order for to make a profit. It’s free to create one account and post content, but if you want to create multiple accounts (which theoretically would allow you to post and vote on more content), you’re charged a fee.\n\nYou must provide an email address and phone number to join, thus allowing admin to verify that each user has signed up for only one free account. Anonymity isn’t discouraged, but if you claim to be someone specific, you must give evidence that you are that person.\n\nSteemit is ad-free, but according to their privacy policy, they will share your personal data if it helps ad partners “carry out work.” Getting paid to blog is an attractive idea, and it’s a neat introduction to cryptocurrency, to boot.\n\nThis is the perfect Whatsapp alternative. You can send messages and make voice calls the same way you would with Whatsapp, but the difference is that Telegram messages are heavily encrypted and can self-destruct.\n\nTelegram client apps are available for Android, iOS, Windows Phone, Windows NT, macOS and Linux. Users can send messages and exchange photos, videos, stickers, audio and files of any type.\n\nTelegram’s client-side code is open-source software but the source code for recent versions is not always immediately published, whereas its server-side code is closed-source and proprietary. So far, there are around 200 million monthly users, and numbers are growing!\n\nMessages and media in Telegram are encrypted when stored on its servers, and the client-server communication is also encrypted. The service provides end-to-end encryption for voice calls, and optional end-to-end encrypted “secret” chats between two online users, yet not for groups or channels.\n\nTelegram’s security model has been criticized for permanently storing all contacts, messages and media together with their decryption keys on its servers by default and by not enabling end-to-end encryption for messages by default. However, its founder, Pavel Durov, has argued that this is because it helps to avoid third-party unsecure backups, and to allow users to access messages and files from any device.\n\nThis is a community-owned social networking platform that rewards its users for their activities online, kind of like Steemit, mentioned above. They do this with paying users in crypto currency and providing members with more views on their posted content.\n\nThis Facebook alternative monitors its users’ daily contributions and relative to the community. Users can use their tokens to promote their content, or to crowdfund other users through monthly subscriptions to their exclusive content and services.\n\nMinds was co-founded in 2011 by Bill Ottman and John Ottman as an alternative to social networks such as Facebook, which they believe abuses digital rights. Other co-founders were Mark Harding, Ian Crossland, and Jack Ottman. The site launched in 2015, and now counts over 1.5 million registered users.\n\nMost importantly, the Minds social network was created on the concepts of freedom of speech, transparency, privacy and democracy.\n\nApparently, Edward Snowden himself uses this app every day! And no wonder. State-of-the-art end-to-end encryption (powered by the open source Signal Protocol) keeps your conversations secure.\n\nSignal uses the Internet to send one-to-one and group messages, which can include files, voice notes, emojis, GIFs, images and videos – just like Facebook’s Whatsapp or Messenger. Its mobile apps can also make one-to-one voice and video calls, and the Android version can optionally function as an SMS app.\n\nSignal uses standard cellular telephone numbers as identifiers. The number doesn’t have to be the same as the one on the device’s SIM card; it can also be a VoIP number or a landline, as long as the user can receive the verification code and have a separate device to set up the software. Although some have criticised this requirement, you can rest assured that your communications will be 100% private, as Signal uses end-to-end encryption to secure all messages sent to other Signal users.\n\nAll Signal software is free and open-source, and you needn’t worry about data of any kind being sold: Signal is actually a non-profit, and as such, raised initial funding of $50 million.\n\nHooray for this alternative social media site! With Google’s YouTube censoring hundreds of videos a day for reasons beyond comprehension, AltCensored offers a place for those videos to go.\n\nWhile BitChute is a YouTube alternative, AltCensored is pretty much a huge middle finger stuck up at YouTube. It features the content that YouTube has firmly decided the public shouldn’t know. The folks at AltCensored believe you should be able to make your own mind up about information regarding whether or not 5G is health-destroying; the lockdowns for Coronavirus are justified, or if vaccinations are safe or not, for example.\n\nWhat if the great library of Alexandria were online?\n\nThat’s the background concept the makers of LBRY.tv had in mind when they created this platform. This is a free-speech space where you’ll find everything from videos and music to ebooks, and more.\n\nThis is one of the best alternative social media sites for content producers, because LBRY.tv is also a new that allows anyone to build apps that interact with digital content on the LBRY network. Creators can upload their work to the LBRY network of hosts (like BitTorrent), set a price per stream or download (like iTunes), or give content away for free.\n\nThat’s important. While traditional sites such as YouTube, Instagram, and Spotify store your uploads on their servers and allow viewers to download them, there are some serious drawbacks. For example? Censorship, for one! Or even having your channel cancelled if it’s perceived as not being advertiser-friendly. LBRY aims to be an alternative to these sites, allowing publishers and their fans to interact directly without the risk of demonetisation or other meddling.\n\nDid we miss any alternative social media sites you love? Tell us in the comments, below!", "opengraph": {"locale": "en_US", "type": "article", "title": "Alternative Social Media Sites To Facebook & Others", "description": "Alternative Social Media Sites, alternatives to facebook, alternative social networking sites, private social media sites", "url": "https://eluxemagazine.com/culture/articles/alternative-social-media-sites/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2018-05-03T10:42:04+00:00", "article:modified_time": "2022-12-19T18:10:37+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2018/04/Vero-920x584.jpg", "image:width": "920", "image:height": "584", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://eluxemagazine.com/culture/i-quit-social-media-heres-what-happened/", "http://www.bbc.com/news/world-us-canada-23123964", "http://www.bbc.co.uk/news/technology-23027764", "http://www.guardian.co.uk/technology/2013/jun/07/uk-gathering-secret-intelligence-nsa-prism", "https://www.theverge.com/2017/3/19/14978318/youtube-lgbtq-videos-hidden-restricted-mode", "https://arstechnica.com/tech-policy/2017/10/prageru-sues-youtube-says-it-censors-conservative-videos/", "https://www.bloomberg.com/news/articles/2017-04-25/google-rewrites-its-powerful-search-rankings-to-bury-fake-news", "https://eluxemagazine.com/culture/articles/why-you-need-a-google-alternative-search-engine/", "https://eluxemagazine.com/culture/articles/why-you-need-a-google-alternative-search-engine/", "https://eluxemagazine.com/culture/articles/honest-news-sites/", "https://mewe.com/", "https://mewe.com/faq#", "https://humix.com/redirect?url=https%3A%2F%2Fwomensswim.com%2Fhumix%2Fvideo%2Fa2b1d162c1684cb26c1fdc1102588542699291f1", "https://eluxemagazine.com/magazine/alternative-social-media-sites/attachment/mewe-logo/", "https://ello.co/", "https://diasporafoundation.org/", "https://eluxemagazine.com/magazine/alternative-social-media-sites/attachment/diaspora-joined/", "https://vero.co/", "https://www.bitchute.com/", "https://eluxemagazine.com/magazine/alternative-social-media-sites/attachment/bitchutecheesy/", "https://steemit.com/", "https://steemit.com/privacy.html", "https://telegram.org/", "https://en.wikipedia.org/wiki/Telegram_(software)", "https://www.minds.com/", "https://en.wikipedia.org/wiki/Bill_Ottman", "https://en.wikipedia.org/wiki/Digital_rights", "https://signal.org/en/", "https://en.wikipedia.org/wiki/End-to-end_encryption", "https://en.wikipedia.org/wiki/Free_and_open-source_software", "https://www.altcensored.com/channel/new", "https://lbry.tv/", "#abh_about", "#abh_posts", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/culture/articles/nanoparticle-safety-tiny-particles-huge-problem/", "https://eluxemagazine.com/travel/green-skiing-in-morzine/", "https://eluxemagazine.com/fashion/ethical-wedding-guest-outfit-ideas/"], "authors": ["Guest"], "publish_date": "2018-05-03T10:42:04+00:00"}