{"result_id": "107013", "URL": "https://eluxemagazine.com/culture/articles/eco-friendly-pet/", "timestamp": "2023-04-25 15:02:33 CEST+0200", "meta": {"description": "how to be a more eco friendly pet owner, where to buy green kitty litter, how to be a more ethical pet owner, how to be a sustainable pet mom", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/articles/eco-friendly-pet/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "How to Be A More Eco Friendly Pet Owner", "cleaned_text": "Pets cause some terrible destruction of nature. Here’s how to be a more eco friendly pet owner\n\nWe here at Eluxe animals, both wild and domestic. There has undoubtedly been a strong connection between humans and animals since the dawn of civilisation. And as every pet owner knows, living closely with the wee beasties can enrich your life like nothing else.\n\nBut just like us, they have a carbon footprint that damages the planet, too. Sure, you may keep the thermostat down, drive a hybrid and buy organic. But – how green is your pet?\n\nI’ve learned that taking proper care of your animal is not only better for the Earth, but it’s better for the health of your faithful companion, too.\n\nHere are some of my best tips for how to be a more eco friendly pet owner, whether you have a dog, cat, or other beastie.\n\nHow to Be A More Eco Friendly Pet Owner\n\n1. Think About Their Food\n\nThe first step in how to be a more eco friendly pet owner is to think about their food.\n\nAs any good vegan knows, beef and pork production is extremely resource-heavy, polluting waterways with animal waste and taking much space for rearing. So try to feed your pet chicken or fish based food instead. Better yet, make your pet’s food yourself, using raw meats, vegetables and whole grains for dog food. Only meat and fish should be used for cat food, as felines should mainly be carnivorous.\n\nAnother benefit of homemade pet food is the many food tins you’ll forego. Often at least one ever single day of your pet’s lifespan! It may not seem like much to you every day, but did considering there are an estimated 69, 926, 000 dog and 74,059, 000 cat owners in the USA alone, that’s around being thrown out or recycled per year. In America only!\n\nSo to be an eco friendly pet owner, do be sure to buy pet feed in bulk to avoid filling landfill and recycling centres with packaging, and mix your dog’s food with rice or table scraps whenever possible to avoid buying more packaged, commercial food.\n\nIf you walk your dog in the streets, biodegradable bags from a company like www.theflushablebag.com or www.poopbags.com are essential–otherwise, the bags won’t decompose, and their trapped, smelly contents will never get a chance to return to the ground. Composting pet poop is best, in a pet-waste composter. Make sure to separate it from your vegetable garden, though, as composters don’t heat up enough to kill E. coli, which could contaminate your greens.\n\nWhile cats may take care of their own ‘business’, kitty litter is a huge source of waste. Americans alone discard an estimated two to four million tonnes of it per year. And what’s more, buying clumping litter for your kitty to poop into presents several serious eco-hazards.\n\nMost of it is clay-based, and clay strip-mining consumes mountains, creating infertile waste rock and adversely impacting vegetation and water resources. It also necessitates deforestation, which destroys biodiversity and promotes global warming.\n\nClay sediment also contains carcinogenic silica dust, which, when inhaled, can cause upper respiratory tract problems in cats and people. And clay won’t break down any further than the mineral that it is, so it just accumulates in landfills as people throw out more and more kitty litter.\n\nIf that’s not bad enough, the clay-based clumping agent, sodium bentonite, is potentially fatal to Fluffy if ingested. It can swell up to fifteen times its original volume and clog the cat’s gastrointestinal tract.\n\nThe greenest litter for your kitty contains reclaimed products or post-consumer waste, like wood shavings, sawdust or old newspapers. Baking soda is odour-absorbent, as is wheat-based litter. Corn and other vegetable derivatives also make effective, biodegradable litters.\n\nWe all try to choose the right kind of dog and cat for our lifestyle. And we love our pets so much, we tend to coddle them like little humans. We buy them gifts for holidays and other special occasions, for example. But is this extra shopping really necessary? While it’s nice to give your pet a treat, they really don’t care whether you get them a handcrafted leather ball from Louis Vuitton or throw them a dead tennis ball you found in the bin. They just want to play!\n\nTinfoil balls, string, elastic bands, long feathers and organic catnip are great ‘gifts’ for Fluffy. A good, strong stick, chew toys (byproducts from the meat industry) and old balls and rope are always welcome for Fido.\n\nKeep in mind too that if you buy your pet plastic based toys, not only is this harmful for the environment, but they could hurt your pet, too. Especially if they’re chewing on them. A recent study from the Environmental Working Group found that pets carry around 48 different industrial chemicals in their bodies, many of which are at higher levels than those found in humans.\n• plastic toys, food packaging, pet shampoos and even some medicines\n• flame retardants found in pet beds, carpeting (which they are closer to daily) and some pet ‘clothing’\n• chemicals found in floor cleaners and lawn pesticides (which cats in particular will lick off when they clean their paws)\n• plasticisers in the lining of tinned food\n\nProlonged exposure to these chemicals can cause hormonal problems, poor coat conditions, cancer, and other serious conditions. So when considering how to be a more eco friendly pet owner, it’s essential to think about how clean your floors and carpets, too.\n\nAlso: use a natural product and use no chemicals on your grass and in your garden. It’s also a good idea to only buy organic bedding for your pets (see below for some ideas).\n\nNote that cats in particular are prone to thyroid issues as they age, and some experts suspect this could be due to the BPA lining their food tins. All the more reason to follow my eco friendly pet advice on food, above.\n\nAnother thing to consider when learning how to be a more eco friendly pet owner is wildlife.\n\nMaybe your dog is a Chihuahua named Charro and she wouldn’t hurt a fly. Even so, when she excitedly barks at and chases squirrels, rabbits and birds in their natural habitats, it could do more harm than you’d imagine! These animals are nervous by nature, and become highly stressed when chased by other animals. Obviously!\n\nBut that’s not the worst damage dogs can do – they spread disease, too. For example, the Siberian tiger, which is already endangered, has recently become even more threatened by contracting Canine Distemper Virus, spread by dogs. The virus has already devastated several other species, ranging from lions to seals, after having been spread in the wild by dogs. If your animals are outdoors at all, it’s to get your cat or dog vaccinated. Not only to protect their own health, but the health of wild animals around them, too.\n\nAnd don’t even get us started on cats. Some say domestic cats are the most important cause of the demise of certain songbirds. Consider your own playful housecat, whom you frequently let out to roam overnight. Rested and well fed, it’s in fine fighting form. And if so inclined, it might kill or harm on average a night. While the birds are ! Like some kind of psycho serial killer.\n\nYour cat may not bring those birds home, so you’d never know it. But to give an example of just how devastating cats can be to wildlife, it has been documented that in Canada alone, domestic cats kill 60-70 wild birds a year. That’s not to mention all the mice and other small mammals that may fall victim to your cuddly little Fluffy.\n\nMoral of the story: . It’s safer for them, and the wildlife population, too. But if you insist on letting your cat outside, ensure she wears a cat bib. Bells are not effective at stopping her from killing wildlife, but bibs are more proven to do so. Even if they look a little strange.\n\nYet another good reason to keep cats indoors is to avoid their getting fleas and other parasites. There is no easy to rid an animal of these naturally. Chemical solutions pollute not only your home and pet with toxic chemicals, but waterways and soil, too, when the products are discarded.\n\nThere some greener products you can use, such as natural flea collars and herbal flea repellent sachets. These are safe enough to use in your pet’s bedding, carpeting, and furniture. But these don’t always work as well as chemicals, and prevention is really better than cure. In other words? Keep dogs away from wild wooded spaces, and keep cats inside.\n\nFinally, possibly the very best thing you can do when learning how to be a more eco friendly pet owner is to ensure your pet is neutered. Given the literal millions of stray dogs and cats suffering around the world, it’s not to ensure your pet is incapable of reproducing. Most shelters will only send out neutered animals for adoption, but if you get your pet another way, neutering should be a top priority after you get it home.\n\nAnd don’t even get me started on breeding. If you love animals – truly love them – you shouldn’t care what breed your pet it when you choose it. And you should get your pet from an animal shelter. Purchasing an animal from a breeder means another animal in a shelter that you could have adopted will die. You’ll only encouraging what we here at Eluxe to be the unethical practice of breeding dogs and cats. Not sure about that? Click here to see more about why we’re adamant about why pet stores and breeders suck.\n\nThe bottom line is this: healthy pets make happy pet owners, and happy pet owners make happy pets. Throw environmental health into the mix and wins – that’s the real cat’s meow!\n\nNow that you know how important it is for your pets not to be exposed to toxic chemicals in their food, flea powder or even on the floor, here are some suggestions to keep your little fur baby – and the planet – healthier.\n\nMade with organic wheatgrass, these are a detoxing treat your cat will meow for again and again! Great for cats that have been around too many household toxins.\n\nWhether you have a big dog like a silver lab or a chihuahua, your dog deserves to sleep on the best, right? Made from comfy organic cotton, this soft bed is perfect for Fido – or even Fluffy! Put it at the foot of your bed for cosy ‘family’ nights that won’t disturb your sleep.\n\nGrass is a healthy way for cats to detox their system and get some roughage. If your cat lives indoors, this is a great way to provide the nutrients they crave!\n\nMufei makes tiny black bags that are 100% biodegradable. Perfect for keeping in your purse when you’re going walksies!\n\nLet Fluffy have a bit of fun! She’ll either love this, or be indifferent to it. I have two cats and that’s been my experience, anyway: one goes bananas, rolling around on the floor with delight, and the other just ignores it. Who knows why…?!\n\nCoconut seems to be having a moment right now, in food, beauty products and now…cat litter! Made from coconut husks, this non-toxic litter is also non-clumping.\n\nThis one is especially important if you have cats. Remember that whatever you wash the floor with eventually ends up on their paws, and ultimately in their bodies when they lick it off.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Be A More Eco Friendly Pet Owner", "description": "how to be a more eco friendly pet owner, where to buy green kitty litter, how to be a more ethical pet owner, how to be a sustainable pet mom", "url": "https://eluxemagazine.com/culture/articles/eco-friendly-pet/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2022-05-15T17:19:48+00:00", "article:modified_time": "2022-12-19T18:06:02+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2013/11/Picture-27.jpg", "image:width": "639", "image:height": "349", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.linkedin.com/in/jody-mccutcheon-4303a6b5/?originalSubdomain=ca", "https://humix.com/redirect?url=https%3A%2F%2Fwomensswim.com%2Fhumix%2Fvideo%2Fa2b1d162c1684cb26c1fdc1102588542699291f1", "https://eluxemagazine.com/culture/articles/not-domestic-endangered-sand-cats/", "https://www.avma.org/KB/Resources/Statistics/Pages/Market-research-statistics-US-pet-ownership.aspx", "https://www.avma.org/KB/Resources/Statistics/Pages/Market-research-statistics-US-pet-ownership.aspx", "http://www.theflushablebag.com", "http://www.poopbags.com", "http://www.petco.com/Shop/ShoppingGuides/petco_ChooseCatLitter_ShoppingGuideID_4_Nav_288.aspx", "https://www.cancer.gov/about-cancer/causes-prevention/risk/substances/crystalline-silica", "https://pangopets.com/best-cat-litters/", "https://getyourpet.com/", "https://www.ewg.org/research/polluted-pets/chemical-exposures-and-pets-health", "https://www.ewg.org/research/polluted-pets", "https://eluxemagazine.com/culture/articles/is-genuine-leather-actually-chinese-dog-leather/", "https://www.ewg.org/research/polluted-pets", "http://en.wikipedia.org/wiki/Canine_distemper", "http://www.cbc.ca/news/politics/9-leading-causes-of-bird-deaths-in-canada-1.1873654", "https://eluxemagazine.com/culture/expert-answers-to-your-questions-about-cats/", "https://www.ecology.com/2013/08/27/global-impact-feral-cats/", "https://eluxemagazine.com/magazine/why-pet-stores-suck/", "https://eluxemagazine.com/culture/articles/which-essential-oils-can-hurt-your-pets/", "https://www.amazon.com/Pet-Greens-Treats-Semi-Moist-Treat/dp/B001L4YYYC?ref_=fsclp_pl_dp_1", "https://www.amazon.com/s?k=Organic+Pet+Bed&ref=nb_sb_noss", "https://chocolatelabradorretriever.ca/silver-lab-puppies-the-411/", "https://www.amazon.com/Organic-Cat-Grass-Seeds-Kit/dp/B08GN33LT2/ref=sr_1_3?crid=BBY2QKRMZACF&keywords=organic%2Bcat%2Bgrass&qid=1652635243&sprefix=organic%2Bcat%2Bgrass%2Caps%2C268&sr=8-3&th=1", "https://www.amazon.com/Organic-Cat-Grass-Seeds-Kit/dp/B08GN33LT2/ref=sr_1_3?crid=BBY2QKRMZACF&keywords=organic%2Bcat%2Bgrass&qid=1652635243&sprefix=organic%2Bcat%2Bgrass%2Caps%2C268&sr=8-3&th=1", "https://www.amazon.com/s?k=Biodegradable+Poop+Bags&ref=nb_sb_noss", "https://www.amazon.com/CatSpot-Litter-100-Coconut-Cat/dp/B01M6B9XXJ/ref=sr_1_5?keywords=Natural+Kitty+Litter&qid=1561534966&s=gateway&sr=8-5", "https://www.amazon.com/s?k=Natural+Kitty+Litter&ref=nb_sb_noss", "https://www.amazon.com/Eco-Me-Natural-Multi-Surface-Cleaner-Herbal/dp/B003B2FYSC", "#abh_about", "#abh_posts", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/culture/articles/nanoparticle-safety-tiny-particles-huge-problem/", "https://eluxemagazine.com/travel/green-skiing-in-morzine/", "https://eluxemagazine.com/fashion/ethical-wedding-guest-outfit-ideas/"], "authors": ["Guest"], "publish_date": "2022-05-15T17:19:48+00:00"}