{"result_id": "107009", "URL": "https://eluxemagazine.com/fashion/alexander-mcqueen-cloned/", "timestamp": "2023-04-25 15:02:30 CEST+0200", "meta": {"description": "Alexander McQueen Cloned, Human Leather, lab made human leather, is human leather ethical, human skin leather, cloned leather, Tina Gorjanc", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/fashion/alexander-mcqueen-cloned/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "What?! Alexander McQueen Cloned for Human Leather", "cleaned_text": "With collections that featured the inclusion of deer antlers, paint-throwing machines and human hair, Alexander McQueen was considered a fashion maverick, someone whose style was absolutely inimitable. It may be true that it’s not possible to replicate McQueen’s style, but one designer, Tina Gorjanc, is now creating a collection that literally replicates his DNA.\n\nGorjanc is currently working on a project that will use McQueen’s DNA – sourced from his hair, which was incorporated into his 1992 “Jack the Ripper Stalks His Victims” collection – to grow human skin, which she will then tan and turn into human leather jackets and bags. The skin will even feature McQueen’s moles, freckles and tattoos based on their original locations and sizes. Called “Pure Human,” the project has thus far produced works in pig skin to show what the final items could look like.\n\nWhile we find the idea of making fashion from human skin utterly repulsive, even if it is ‘just a clone,’ Gorjanc says the concept isn’t intended to create a new industry per se, but rather to raise questions about how corporations could one day exploit genetic information for luxury goods, and to highlight how the ownership of our DNA is vulnerable to corporate control.\n\nGorjanc got the idea after reading a book by Rebecca Skloot called ‘The Immortal Life of Henrietta Lacks‘ about a poor black woman in America whose DNA was taken without her knowledge in 1951 so that it could be used for medical research. Since then, Lack’s cells have been used to develop everything from polio vaccine to cloning technology. When Gorjanc discovered that luxury companies are investing in bioengineering to test cosmetics on cloned human skin instead of animals, that further motivated her to work on her McQueen project.\n\nHow much control we have over our own, genetic information is still something of a grey legal area. For example, in 1984, an American doctor patented a cell line taken from the tissue of a man named John Moore, who didn’t know his tissue was being used. Moore took the case to court but lost his fight to win the rights to the patent. Today, patients are normally asked to sign a form agreeing to give away any biospecimens that would contain their DNA and renounce any commercial interest, but it should be noted here that the use of human cells for medical research is now ‘common’. The use of those cells for fashion and cosmetics is quite another issue though.\n\nIn spring of this year, Gorjanc filed an application to patent what she called “bioengineered genetic material that is grown in the lab using tissue-engineering technology and the process of de-extinction.” In legal terms, ‘de-extinction’ need not refer solely to endangered species; rather it applies to any living creature that has died.\n\nThe designer discovered that she is not actually allowed to patent the DNA, but if she is granted the patent, it would in fact give her control over a material that does include the late fashion star’s DNA. Still, this is rather semantic: Gorjanc says if she is granted the patent for the material, she would “have ownership of this material that includes Alexander McQueen’s genetic information.”\n\nThe fashion industry is expecting a revolution in cloned material – namely laboratory-grown leather. The patent for this belongs to the Modern Meadow company, which managed to gain financial support from billionaire Peter Thiel (the owner of PayPal).\n\nSome, including Gorjanc, think this technology is the way forward for growing sustainable, lab-grown leather that doesn’t require killing animals. Even Mimi Bekhechi, the Director of the PETA Foundation, backs the concept.\n\nShe says: “If Gorjanc has permission to use the skins – from the estate or otherwise – this is a far better way to create leather bags and jackets than to murder other living beings and steal their hides, simply because you don’t know them or recognise their feelings and pain. Why humans want to wear or use animal skins in the 21st century, as if they were still deprived cavepeople, is a mystery and shows ignorance, arrogance, and a lack of imagination. Gorjanc’s idea would at least make buying leather items ethical, as she didn’t kill to obtain the skins. The future holds lab-grown meat, skins, and more. ”\n\nFor us, the idea of wearing human leather – no matter how it is obtained – is repugnant. As for animal leather, of course it is more sustainable to wear leather from a cloned cow than a slaughtered one, but this still makes the wearing of leather itself acceptable.\n\nIt’s kind of like the vintage vs. new fur debate: if you’re wearing a fur coat that was derived from an animal killed 50 years ago, sure, no ‘new’ animal died for your coat and sure, it’s better than dishonouring the sacrifice of that animal’s life by throwing the fur away. But aren’t you also saying that it’s ok to wear fur? How can people tell if the fur is vintage or new? And aren’t there better alternatives out there anyway, like a nice, warm cotton or recycled polyester coat?\n\nThe world is surely changing, and we need to keep abreast of the latest technology. If nothing else, Gorjanc forces us to ask some tough questions: something that provocative iconoclast, Alexander McQueen would have surely appreciated.\n\nWhat do you think of this article? We’d love to hear your thoughts below!", "opengraph": {"locale": "en_US", "type": "article", "title": "What?! Alexander McQueen Cloned for Human Leather", "description": "Alexander McQueen Cloned, Human Leather, lab made human leather, is human leather ethical, human skin leather, cloned leather, Tina Gorjanc", "url": "https://eluxemagazine.com/fashion/alexander-mcqueen-cloned/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2016-07-23T11:40:46+00:00", "article:modified_time": "2019-01-27T21:06:10+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2016/07/alexander-mcqueen-skin-jacketks-03.jpg", "image:width": "960", "image:height": "640", "image:type": "image/jpeg", "article:author": "https://www.facebook.com/EluxeMagazine?ref=br_rs"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.amazon.com/Immortal-Life-Henrietta-Lacks/dp/1400052173%3FSubscriptionId%3D0G81C5DAZ03ZR9WH9X82%26tag%3Dzemanta-20%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3D1400052173", "http://www.wipo.int/wipo_magazine/en/2006/05/article_0008.html", "http://en.wikipedia.org/wiki/Peter_Thiel", "http://www.paypal.com", "http://www.fastcoexist.com/1680605/in-five-years-you-may-be-wearing-a-lab-grown-leather-jacket", "http://www.peta.org/", "http://en.wikipedia.org/wiki/In_vitro_meat", "#abh_about", "#abh_posts", "https://eluxemagazine.com", "https://www.facebook.com/EluxeMagazine?ref=br_rs", "https://twitter.com/eluxemagazine", "https://eluxemagazine.com", "https://eluxemagazine.com", "https://go.skimresources.com/?id=88703X1541792&xs=1&isjs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fchere-di-boscio-56b2a1b%2F&xguid=01CXZQKRMG8R5WKD9TJS0C61E9&xuuid=8b7711adf522c99deb05fe5ce8f4e688&xsessid=&xcreo=0&xed=0&sref=https%3A%2F%2Feluxemagazine.com%2Fabout%2F&xtz=-480&jv=13.12.1-stackpath&bv=2.5.1", "https://eluxemagazine.com", "https://eluxemagazine.com/author/chere/", "https://eluxemagazine.com/culture/competitions/win-the-serum-by-empower-beaute-worth-120/", "https://eluxemagazine.com/living/is-living-off-grid-really-a-green-dream/", "https://eluxemagazine.com/culture/win-a-natural-tanning-kit-by-le-beach/"], "authors": ["Chere Di Boscio"], "publish_date": "2016-07-23T11:40:46+00:00"}