{"result_id": "107002", "URL": "https://eluxemagazine.com/culture/your-questions-about-dogs-answered-by-an-expert/", "timestamp": "2023-04-25 15:02:25 CEST+0200", "meta": {"description": "Questions About Dogs Answered By An Expert. everything you wanted to know about owning a dog, common problems with owning dogs", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/your-questions-about-dogs-answered-by-an-expert/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "Your Questions About Dogs Answered By An Expert", "cleaned_text": "Our readers asked questions about dogs, and we got an expert to answer!\n\nAh, doggies! They’re definitely woman’s best friend. Or at least, one of our best friends! They’re loyal, they’re goofy, and above all, they’re loving. But they’re also a bit difficult to take care of. And frankly, they fall so deeply in love with us, if you’re not prepared to spend the ten or more years of a dog’s lifetime with your pet, then you’re better off not getting one at all.\n\nIn short, having a dog is pretty much like having a kid. And as with having kids, most people are sometimes stumped about what to do in certain situations.\n\nI know this for sure, because I reached out to our readers on social media to get their questions about dogs, and sent those questions to canine expert\n\non a farm in South Africa, Mariette grew to love animals. She’s had dogs her entire life, and even as a little girl, she always wanted to take care of them. As an adult, she ended up living in the USA and launched a\n\nAfter a few years, she became a licensed groomer but she always knew she wanted to do more to help dogs and cats with emotional, behavioral and psychological needs so, she went back to school and became a certified pet psychologist and behaviorist. She now also has a podcast called Paws-n-Listen where she talks about everything dogs and cats.\n\nGot a furry companion that’s not behaving? Want to get a dog, but not sure which kind is best for you? Wondering how to make your pets get along? Check out Your Questions About Dogs, Answered By An Expert, below. And if you still have questions that weren’t addressed, Mariette has kindly offered to answer them directly via her email:\n\nYour Questions About Dogs Answered By An Expert\n\nI’m torn between getting a new puppy from a store, or a rescue dog. My fear about the rescue is that maybe it has already picked up bad habits. Is it possible to ‘teach an old dog new tricks’ as it were?\n\nMy advice is to never buy a puppy from a store. Over 90% of stores who sell p uppies buy them from, and support puppy mills. I could go on and on about puppy mills and their practices – how they breed their dogs constantly, the awful conditions they often breed their dogs in, and also the questionable health of the\n\nMore than often they breed their female dogs every single heat cycle. The females never get a chance to have their bodies recover from one litter to the next. They are constantly forced to breed, year after year, most from their very first heat cycle which means they are less than a year old when they are pregnant for the first time.\n\nThat being said, there are very reputable and responsible breeders here in the USA like Infinitypups. There you can find only the healthiest and happiest puppies for sale.\n\nAs for adopting a rescue dog, rescues have all kinds of dogs available for adoption, from puppies to senior dogs. If your heart is set on getting a puppy, you can definitely adopt one. Adopting a puppy will allow you to teach the puppy good habits from early on.\n\nIf you adopt an older dog, it is possible that he/she might have “bad habits” or behaviors. But you can absolutely teach an older dog good habits and “rehabilitate” them from any unwanted habits. It will take patience and consistency but it can definitely be done – and you’ll need to train a puppy with just as much effort, anyway!\n\nPlease reach out to me if you need any help. Giving a rescue dog a forever home, filled with love, is a\n\nI have a cat and am thinking of getting a dog to keep her company, but I’m afraid they might fight. Do you recommend getting another cat instead?\n\nThere is no guarantee that any two dogs or two cats or a dog and cat will become best friends. But that said, I have many clients with dogs and cats who are great friends and keep each other company, play together and snuggle together.\n\nare a few things to take into consideration. I don’t know how old your cat is? If she is a young/er cat, it will be easier to introduce a new dog friend to her. But even an older cat will love the companionship of a dog. She might just take a little longer to get used to it.\n\nAre you considering getting a puppy or an older dog? Puppies can be very energetic and rambunctious, and cats don’t usually like that. Getting a dog that is around 2 or 3 years old or older would be\n\nI recommend a slow introduction to each other. For instance, put up a puppy gate at the door of the bedroom or room where your cat spends most of her time. Let her and the dog sniff each other first without any physical contact. This way they get used to each other’s scent. If there’s any snarling, hissing, growling, or the cat runs away, keep the gate up for a couple of days.\n\nblanket that your cat has been sleeping and laying on and put it in the dog’s bed or where he/she can smell it and lay on it. Do the same with the dog’s blanket – put it where the cat can smell it and lay on it. This will help them get used to each\n\nYou can also use pheromone diffusers or spray – Feliway (for cats) and Adaptil ( for dogs) to relax both the cat and dog. After a couple of days when they’ve smelled and sniffed each other through the puppy gate allow them to meet. If they don’t get along right away please just give it time and have patience. They will come around! I cannot guarantee they will be best friends , but it’s not uncommon for dogs and cats to\n\nGetting another cat instead of a puppy as a friend is also a good idea but, again, there is no guarantee they will get along. In the end I think you have to decide whether you want another cat or adopt a dog? I’ve had many clients who got a second cat as a friend for the first one, and for whatever reason the first cat has a hard time accepting the new one. Once again you can use the Feliway to help with the transition and also reach out to me for more help!\n\nI am a certified pet psychologist and behaviorist but not a veterinarian or veterinary nutritionist, both of whom are far more qualified than me to answer you.\n\nThis is increasingly one of the most common questions about dogs. I have listened to many arguments for and against feeding dogs a vegan diet . Quoting a veterinary nutritionist when asked the question whether a vegan diet is safe for dogs: “Most dogs can do quite well on a “carefully designed” vegan diet that meets all of their nutritional needs”.\n\nMy advice is to talk to your veterinarian or a veterinary nutritionist about this and if you feel passionate about your dog having a vegan diet, please do your research to find a reputable company who makes balanced, nutritional vegan food for dogs. If you’re going to make your own vegan food for your dog definitely consult with a veterinary nutritionist to help you develop a diet plan that will minimize health risks for your dog.\n\nI would not recommend a vegan diet for puppies for at least the first year for small breed dogs and up to 18 months to 2 years for large breed dogs. I have a where he answers questions from the audience. I will definitely include your question to him for the next episode. If you’re interested you can follow the\n\nAfter Covid, my mom got depressed living in an apartment on her own. I want to get her a dog companion, but she’s not really able to go out and walk it daily. Do any dogs you know of do well living indoors?\n\nYes, I think getting a small breed dog for your mom such as a Chihuahua, great idea! Because these dogs are small and usually less active than large breed dogs they do very well living in an apartment. The nice thing with these small breed dogs is that you can train them to go potty on a potty pad that can be picked up afterwards and disposed of.\n\nThere are also imitation grass potty pads. A few different kinds are available online to order. They are easy to use, re-usable, easy to clean and they are odorless. Small dogs do very well when trained to use them instead of having to go outside.\n\nYou said your mom is not really able to walk a dog every day but perhaps she could hire a professional dog walker or ask a neighbor or friend to walk her pup once a day or a few times a week? Small dogs don’t need vigorous exercise or very long walks but they do need some exercise so a walk, even every other day, would be good.\n\nPersonally, I think getting your mom a dog for a companion is a wonderful idea! Studies have proven that owning a dog helps with lowering anxiety, high blood pressure, heart disease and helps with depression and loneliness. Dogs provide comfort and joy and statistics have also proven that people who have dogs or\n\nWhat are your thoughts on pedigree dogs compared to mutts?\n\nThis is one of the most common questions about dogs. But I love them both! Honestly, I think this is a personal preference. I love Golden Retrievers. Growing up on a farm in South Africa I had lots of “pavement specials” – South African slang for mutts. And they were all amazing! After I got my first Golden Retriever I fell in love with the breed and their gentle, sweet, cuddly nature, their happy disposition and fun-loving attitude. They are easy to train, and beyond just basic training, they can act as therapy dogs, search and rescue dogs and service dogs for the\n\nbreed you fall in love with and decide to get, please first research it before getting a puppy or adopting! It’s one thing to think you will love having a Husky, for example. After all they are smart, handsome, some have beautiful blue eyes, and so on. B ut, did you know that a Husky requires a lot of exercise and stimulation? They need a fenced yard to run around and play in, they need long walks or someone they can run with. They also need to be brushed often. In addition, they shed, they can be high strung – especially when they don’t get enough exercise or stimulation. Are you ready for that? Will you make the commitment in rain, snow, heat, wherever you live and your weather is like, to walk and exercise a Husky daily?\n\nThe sad fact is that many dogs end up in shelters and rescues because people are not always educated or prepared for having a certain breed of dog. Please consider rescuing instead of buying from a breeder.\n\nMy dog simply won’t stop barking and the neighbours are complaining. What can I do?\n\nIt would be helpful for me to answer your question if I knew “why” and “when” your dog is barking all the time? For instance, is he barking all the time when he is outside? Or, does he bark when he is outside and he sees your neighbor or their dog? Do you leave him outside for long periods of time unsupervised and he barks to get back into the house or for attention? Does he bark all the time in the house as well? Does he bark at people or dogs walking by? I’m going to answer the best I can. I encourage you to reach out to me and I will be happy to work with you and give you more advice.\n• None Do not yell at your dog to be quiet – this really accomplishes nothing and to your dog it sounds like your barking right along with him.\n• None Remove the motivation for barking. If he’s outside barking at the neighbor or dogs, bring him in the house immediately. Teach him the command: “no barking”. When he stops barking, praise him and give him a treat. Do this over and over until he realizes he is rewarded for not barking.\n• None If your dog is barking at you to get your attention, ignore him by turning your back on him or walking away. Ignore him for as long as it takes for him to stop barking. Do not talk to him, touch him, look at him. When he stops barking, turn around and give him a treat, praise him by telling him he’s a good boy, no barking. Do this over and over until he realizes he is rewarded when he doesn’t bark. Be patient!! This takes time.\n• None I firmly believe – “a tired dog is a good dog”! Make sure your dog is getting plenty of exercise, walking, playing ball or frisbee and mental stimulation, learning new tricks or playing with interactive toys or puzzle toys every day. More than often, dogs will use barking as a method to get your attention or because they are bored or frustrated.\n\nEvery time I leave my dog alone, he tips over all the bins and/or eats my shoes! Why? And is there a solution?\n\nThis is another of the most common questions about dogs.\n\nIt sounds to me like your dog is suffering from separation anxiety. I highly recommend the use of a pheromone collar, pheromone diffusers around your house and spraying his blanket or special toys with a pheromone spray. I recommend Adaptil. It is safe and recommended by safe and relaxed. It also reduces anxious behaviors such as chewing, destroying furniture, constant barking, etc. Also look for things that will keep your dog busy when you leave the house. For example? A Kong filled with treats, sturdy chew toys or bones. Play soothing, calm music for dogs available on Spotify, Amazon or iTunes – simply search for “soothing music for pets or dogs”.\n\nMy dog hates taking a bath or going to the groomer. How can I keep her clean?\n\nGetting a bath can be a stressful experience for some dogs. This is especially true when they’ve had a bad experience. This could be getting a bath in cold water or hot water (water for bathing a dog should be lukewarm) or getting hosed down in the getting a bath a good experience for your pup!\n\nwhen they are a puppy, or as soon as you get your pup. This will develop bath time into a good habit and routine. Here are my best tips for bathing a dog:\n• None Give your pup a bath when you have enough time to take it slow.\n• None Take your dog for a nice long walk before the bath. This will relax them and also tire them out so they won’t be fighting you during the bath.\n• None Use lukewarm water, and set the shower sprayer attachment on a gentle spray setting so it doesn’t scare your pup.\n• None careful to not get shampoo in their eyes and be careful to avoid getting water in\n• None Talk to them in a soft, soothing voice while bathing them or play\n• None Buy a lick mat (available at some pet stores, Amazon.com or Chewy.com) that you can attach to the side of the bathtub or to the wall or side of your bath or shower. Lick mats come in different sizes and shapes, with grooves and you smear peanut butter, banana or yogurt (whichever your dog will love to lick) on the mat. This will keep your pup busy licking the treat off the lick mat while you give him a bath. It’s worked wonders for my dogs and many of my\n\nHow do I know I’m ready to be a dog mom?\n\nThis is one of the most important questions about dogs! Are you ready to be a dog mom or dad? Ask yourself these questions and answer them honestly:\n• None Do you have the time to commit to a dog? If you get a dog, do you have time to train your pup, walk her every day, play with her every day, give her love and attention all the time, clean up after a puppy when he has accidents or is sick?\n• Do you work long hours? Will your puppy or dog be home alone for 8 or 10 hours a day? Will you leave him in a crate for 8 or 10 hours a day? Will you be tired after working a long day and not feel like taking him for a walk or playing with him?\n• Are you willing to give up time with your friends to stay home with your pup? When your friends go out after work and your pup’s been home alone for hours, will you go home to take care of him instead of going out with your friends?\n• Are you ready to get up early every morning to take your pup outside to potty and take her out late at night to potty?\n• Do you have the financial means to take care of a dog? Buy her good, healthy food, treats and toys? Take her to the vet regularly for check-ups, pay for mandatory, recommended vaccinations? If she’s sick or has chronic allergies or illness pay for the vet visits, get dog insurance, treatments and medications?\n• Can you afford to pay for a boarding facility or pet sitter to take care of him when you travel for work or go on a vacation? If you work long hours can you afford to hire a dog walker to take her for walk to get exercise and go potty?\n• Are you ready to make the commitment to a pup to love and take care of him for the entirety of his life? Dogs end up in shelters and rescues when people are not prepared for the commitment of owning a dog. I’m moving, getting a new job, getting married, having a baby, or, I don’t want him anymore … These are all the excuses we hear every day in rescue when people give up on their dogs and get rid of them!\n\nIt is not enough to just “want” a dog, you have to be ready and committed 100% to be a good dog mom or dog dad. So please, think carefully before getting a puppy or adopting a dog! If, after you’ve answered all these questions honestly and truthfully, you are 100% sure you still want a dog, you’re ready to commit to having a dog, you are ready to be a good dog mom or dog dad!\n\nGot further questions about dogs you want answered? Mariette can be reached at", "opengraph": {"locale": "en_US", "type": "article", "title": "Your Questions About Dogs Answered By An Expert", "description": "Questions About Dogs Answered By An Expert. everything you wanted to know about owning a dog, common problems with owning dogs", "url": "https://eluxemagazine.com/culture/your-questions-about-dogs-answered-by-an-expert/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2020-11-08T06:26:24+00:00", "article:modified_time": "2022-07-11T18:40:16+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2020/11/adorable-3344414_640.jpg", "image:width": "640", "image:height": "427", "image:type": "image/jpeg", "article:author": "https://www.facebook.com/EluxeMagazine?ref=br_rs"}, "tags": [], "tweets": [], "movies": [], "links": ["https://humix.com/redirect?url=https%3A%2F%2Fhappyliving.today%2Fhumix%2Fvideo%2Ffae95227f02cf89a334dcb862f5ba9a7226d237ad495e95248c7bba60e6ef963", "https://www.furrytailshack.com/", "https://www.furrytailshack.com/", "https://podcasts.apple.com/us/podcast/paws-n-listen/id1512465900", "https://www.infinitypups.com/breeds/", "https://eluxemagazine.com/culture/expert-answers-to-your-questions-about-cats/", "https://www.feliway.com/us/Products/FELIWAY-Range?msclkid=58e17fd920f11caac258207b66092292&utm_source=bing&utm_medium=cpc&utm_campaign=Feliway%20-%20Search%20-%20Branded%20Terms&utm_term=feliway&utm_content=Feliway%20(Only)", "https://www.adaptil.com/us/Products/ADAPTIL-Range?msclkid=92febc083ec91c6f314ce3aa79d97791&utm_source=bing&utm_medium=cpc&utm_campaign=Adaptil%20-%20Search%20-%20Branded%20Keywords&utm_term=adaptil&utm_content=Adaptil%20-%20Only", "https://eluxemagazine.com/culture/cats-eat-a-vegan-diet/", "https://dogfoodheaven.com/food/health/", "https://podcasts.apple.com/us/podcast/paws-n-listen/id1512465900", "https://eluxemagazine.com/culture/articles/why-pet-stores-suck/", "https://doggiedesigner.com/best-puppy-training-treats/", "https://bivvy.com/why-bivvy", "https://eluxemagazine.com/culture/articles/is-genuine-leather-actually-chinese-dog-leather/", "#abh_about", "#abh_posts", "https://eluxemagazine.com", "https://www.facebook.com/EluxeMagazine?ref=br_rs", "https://twitter.com/eluxemagazine", "https://eluxemagazine.com", "https://eluxemagazine.com", "https://go.skimresources.com/?id=88703X1541792&xs=1&isjs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fchere-di-boscio-56b2a1b%2F&xguid=01CXZQKRMG8R5WKD9TJS0C61E9&xuuid=8b7711adf522c99deb05fe5ce8f4e688&xsessid=&xcreo=0&xed=0&sref=https%3A%2F%2Feluxemagazine.com%2Fabout%2F&xtz=-480&jv=13.12.1-stackpath&bv=2.5.1", "https://eluxemagazine.com", "https://eluxemagazine.com/author/chere/", "https://eluxemagazine.com/culture/win-a-natural-tanning-kit-by-le-beach/", "https://eluxemagazine.com/culture/eluxe-horoscopes/", "https://eluxemagazine.com/fashion/jewellery/ethical-engagement-rings/"], "authors": ["Chere Di Boscio"], "publish_date": "2020-11-08T06:26:24+00:00"}