{"result_id": "107008", "URL": "https://eluxemagazine.com/culture/articles/fashion-robots-are-coming-what-does-it-mean-for-ethical-fashion/", "timestamp": "2023-04-25 15:02:29 CEST+0200", "meta": {"description": "Fashion Robots, sewbots, what does automation mean for the fashion industry, how is AI changing fashion, robots vs sweatshops, dangers of ubi", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/articles/fashion-robots-are-coming-what-does-it-mean-for-ethical-fashion/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "Are Fashion Robots Compatible With Ethical Fashion?", "cleaned_text": "It sounds unreal, but fashion robots are coming to replace humans. What does it mean for ethical fashion?\n\nFashion robots are the future in clothing manufacturing. Automation is already well under way in other industries, too—see the automotive and aviation sectors – and soon the apparel industry will follow suit.\n\nSuch a change would result in a transfer of the “dull, dirty and dangerous” work involved in garment production from those who’ve historically done it, i.e. people, to robots. Theoretically, this change will free up labourers to perform safer, more rewarding work.\n\nOn the surface, this seems like a big win for the ethical fashion movement. After all, its primary objective is eliminating sweatshops and creating better working conditions for wage earners.\n\nBut what if the workers displaced by fashion robots don’t find any safer work – or any work at all? What, then, will “ethical fashion” mean, exactly? Should consumers band together to reject clothing made by robots and instead stick with artisanal, or at least, human-made (and more expensive) brands?\n\nIn this light, the future of garment industry workers—and of ethical fashion—is very much up in the air.\n\nThe global garment industry is worth $3 trillion, or two percent of the world’s Gross Domestic Product. As of 2014, it employed 60 to 70 million people, three quarters of them being low-skilled females in developing countries. The Association of Southeast Asian Nations (Asean), an economic area comprising Thailand, Malaysia, Cambodia and Indonesia, employs nine million workers—mostly young women—in the textiles, clothing and footwear industries. And according to this report, almost ninety percent of them are at risk of losing their jobs due to automation.\n\nAs any ethical fashionistas knows, these labourers already face challenges aplenty. They’re overworked and underpaid, they endure unhealthy work conditions that contribute to problems like lung ailments, lost fingers, even death. Soon they’ll be facing their biggest threat yet: faster, cheaper robot labour.\n\nThe consequences of mass unemployment can be significant and devastating. Economic depression in the 1920’s corresponded with the rise of fascism. There are also strong links between unemployment and drug addiction, depression and even suicide.\n\nIndustry people see the looming threat and are trying to help garment workers. Copenhagen Fashion Summit organizer Global Fashion Agenda has urged industry players to “embrace environmentally and socially responsible practices,” and to monitor the impact of technological innovations on people within the supply chain.\n\nSummit panelists stated that policy makers and companies employing robotics must consider the impact of automation on workers worldwide, and that companies and governments must collaborate to support labourers in transition. However, reading between the lines, it seems they believe the automation of the fashion industry is inevitable. Is it, though?\n\nThere are multiple reasons fashion robots are creeping into the garment industry. First, the creation of machines that mimic nimble human hands and sharp eyes allows the machinery to better analyse and manipulate materials. Secondly, a novel fabric treatment that makes materials more solid (rather than flimsy) allows the materials themselves to be more easily handled by machines. Robots require no wages and demand no particular conditions. And when a robot can produce a fully finished t-shirt in twenty-two seconds, how can any human compete with that?\n\nIn short, fashion robot workers create an opportunity to lower production costs and standardize quality, especially in light of increasing labour prices and the emergence of new competitors, such as those based in East Africa. Ahead-of-the-curve garment manufacturers will be able to say they’ve removed exploitative human labour from the equation, thus improving brand image in the eyes of some consumers.\n\nBangladesh’s Rana Plaza factory collapse magnified worldwide scrutiny of the safety risks garment workers face daily. In the aftermath, factory owners had little choice but to seek improvements to worker safety, – which, perhaps ironically, they’ve found via robots. Unfortunately, it may also eliminate the work itself, making millions of people jobless.\n\nAside from cost and quality control, automation can produce plenty of good for ethical fashion. In theory, robots may help to literally clean up factories by allowing for less wasteful production lines. A PriceWaterhouseCooper report details how this can happen: they are calling it ‘the fourth industrial revolution’, and it depends heavily on artificial intelligence and the use of rather dangerous 5G technology.\n\nOf course, with machines performing the dangerous, dirty jobs, worker safety will improve. With dull, mindless labour also in the hands of robots, humans will be able to pursue more satisfying work – in theory. But here’s the catch—as mentioned, workers who lose their jobs must be redirected to more dignified work through skills upgrades, such as artisanal design or digital work that pays better.\n\nTo avoid catastrophe, companies must take an active role in education and retraining staff, as well as in redesigning new jobs. For example, upon changing its phone operating system to Microsoft Windows in 2011, Nokia implemented a “Bridge” program to help many of its 18,000 affected workers to find new jobs. Garment production companies must exhibit a similar blend of utility and compassion – but given that so many of them don’t even care enough about their workers to provide basic necessities, such as clean bathrooms, holiday time and 8 hour working days, this is not likely to happen.\n\nMeanwhile, in America, where the manufacturing sector has largely gone the way of the dodo in the last few decades, Chinese textile company Tianyuan Garments opened a factory in Arkansas earlier this year. One might wonder why the company didn’t choose China, where labour is far cheaper, more plentiful and less discerning. The answer is: because the work will be done by fashion robots. Specifically, by the Sewbots, as they’re cleverly called, designed by Soft-Wear (get it?) Automation. These machines were conceived with grant help from two unlikely sources: the Walmart Foundation and DARPA, the US Defense Department’s research branch.\n\nOne might be excused for accusing the US military of engaging in some sort of quiet warfare by helping to develop these Sewbots. After all, who knows what profound effects these automation platforms may have on the economies of various developing countries by putting millions of their labourers out of work?\n\nAnd when American workers are displaced by robots, there’s a program the government is considering that would give them near-total control over citizens’ lives: Universal Basic Income.\n\nThe idea of a Universal Basic Income, or UBI, is that everyone, rich and poor alike, receives a no-strings-attached monthly (or yearly) payment from the government—literally a living wage. It’s meant to cover the basic expenses of food, rent and clothing.\n\nThe concept has been around for decades—but it really took flight when the likelihood of robots stealing human jobs came too close for comfort. Rather worryingly, it’s particularly championed by some of the world’s wealthiest 1%, including Elon Musk, Mark Zuckerberg and Bill Gates – notice how these names are heavily associated with the tech industry. Presumably, they espouse UBI as a means for their current employees to earn money once robots take their jobs. It gets them off the hook for retraining them, after all.\n\nIndeed, UBI eliminates the need for unemployment benefits and other social safety-net payments, as well as the stigma attached to receiving them. Proponents will say a UBI will give individuals a sense of autonomy and the security to embark on entrepreneurial ventures without fear of losing everything. They’ll pshaw any suggested negative relationship between UBI and the incentive to work.\n\nCiting studies like this one, they’ll postulate that a UBI may well lead to happier, better-incentivized citizens who trust the government to look out for them. They’ll point to behavioural data from pilot studies on UBI implementations in Namibia and Finland that suggest spikes in hours worked and entrepreneurship. And they’ll likely cite Maslow’s Hierarchy of Needs as proof that people crave things, like self-actualization and social belonging through productivity and creativity, that aren’t sated by a UBI.\n\nAll this may be true. In reality, though, the concept is more fallacy than legitimate. There strings attached – and plenty of them.\n\nFirst and foremost, the UBI is not likely to ever be paid in the developing countries that will be hardest hit by robotization. Most of the companies using labor in developing nations are Western, and will use any savings gained by automation for UBI in Europe and North America, not Asia or Africa. Sweatshops are evil to be sure, but robotization could be even worse, rendering millions and millions of people unemployed, homeless and more impoverished than they were.\n\nIn the developed world, since universal basic income payments would be given to all citizens, including high-income earners, the proposal would likely actually transfer funds away from the most impoverished and vulnerable to the more affluent.\n\nAdditionally, it’s an economic fact that the more money goes into more people’s hands means one thing: inflation. As more dollars are handed out without being tied to any sort of material value creation, each individual dollar deteriorates in value. It’s highly likely that the poorest people—those a UBI is most meant to protect – will be no better off in terms of buying power.\n\nBeyond those concerns exist various others. For example, it has been proposed that in order to get your UBI, you will need a mandatory biometric ID marker—it’s being argued as a surefire way to expedite UBI processing, especially when tied to bank accounts. It may sound like a conspiracy theory, but in fact, trial runs of biometric repositories have already started in many places, most notably India, where the program is the world’s largest biometric database, with 1.2 billion participants. Some see this program as a first step toward UBI implementation, with dire consequences. Welcome to the true surveillance state.\n\nOr how about tying UBI to “civic responsibilities” such as compulsory military service, vaccinations and voting? A World Economic Forum panel literally discusses these ideas here. What’s next? Mandatory microchipping?\n\nThe bottom line is that UBI will put people’s livelihoods firmly in the hands of the government, when the balance of power should be the other way around. And job-stealing robots may play a big part in pushing citizens toward such a fate. Somehow, it seems somehow fitting that the US military had a hand in developing the contributing technology.\n\nEmploying various computer programs to create ethical, eco-friendly bespoke garments, Rapanui sells its clothes at boutique prices while employing a healthy balance of automated and human resources. Automation does the most “dull, dirty and dangerous” work, while actual human people still do the creative, quality-control and managing jobs. According to company co-founder Mart Drake-Knight, “If you take the humans out of the company, you take the humanity out of the company.”\n\nPerhaps this model is the solution: using fashion robots for the most difficult and dangerous jobs, such as dyeing clothing – but maintaining a human workforce for all other manufacturing tasks. It’s a sustainable model that still supports the majority of workers, but also allows the company to make some savings by improved productivity.\n\nGovernment must also play a role: although it seems in the USA they are currently pushing for AI and a UBI, but it’s vital that legislation be created to regulate the automation of production to avoid a massive deluge of unemployment and all of its related issues.\n\nConsumers also have a role to play: we should earnestly commit to buying clothing from companies that employ actual humans to make them, even if it means paying a little bit more.\n\nConsidering the potentially horrendous consequences of automation, it seems it could be just as unethical to buy a robot-made garment as it would a sweatshop-made one. Long live artisanal fashion!", "opengraph": {"locale": "en_US", "type": "article", "title": "Are Fashion Robots Compatible With Ethical Fashion?", "description": "Fashion Robots, sewbots, what does automation mean for the fashion industry, how is AI changing fashion, robots vs sweatshops, dangers of ubi", "url": "https://eluxemagazine.com/culture/articles/fashion-robots-are-coming-what-does-it-mean-for-ethical-fashion/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2019-05-21T08:30:20+00:00", "article:modified_time": "2022-12-19T18:09:16+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2018/08/robot-1797548_960_720.png", "image:width": "960", "image:height": "540", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://humix.com/redirect?url=https%3A%2F%2F440industries.com%2Fhumix%2Fvideo%2F5d33d9313eb836c263121eca8161210ad78742009a9133e37253895d718b8958", "https://fashionunited.com/global-fashion-industry-statistics", "http://www.ilo.org/wcmsp5/groups/public/---ed_dialogue/---act_emp/documents/publication/wcms_579553.pdf", "http://www.cleanclothes.org/issues/ohs", "https://www.ncbi.nlm.nih.gov/pubmed/21466502", "https://www.ncbi.nlm.nih.gov/pubmed/21466502", "https://www.ncbi.nlm.nih.gov/pubmed/29677604", "https://www.ncbi.nlm.nih.gov/pubmed/29677604", "http://www.globalfashionagenda.com/global-fashion-agenda/", "https://eluxemagazine.com/?attachment_id=114167", "https://www.mckinsey.com/industries/retail/our-insights/east-africa-the-next-hub-for-apparel-sourcing", "https://en.wikipedia.org/wiki/2013_Savar_building_collapse", "https://eluxemagazine.com/?attachment_id=114169", "https://www.pwc.com/ee/et/publications/pub/innovation-for-the-earth.pdf", "https://www.bloomberg.com/news/articles/2017-08-30/china-snaps-up-america-s-cheap-robot-labor", "https://www.darpa.mil/", "https://thenextweb.com/insider/2017/08/07/this-insanely-fast-robot-will-make-adidas-shirts-cheaper-and-kill-hundreds-of-jobs/", "https://www.weforum.org/agenda/2017/03/these-entrepreneurs-have-endorsed-universal-basic-income", "https://news.uchicago.edu/story/universal-basic-income-policies-dont-cause-people-leave-workforce-study-finds", "http://www.bignam.org/BIG_pilot.html", "https://www.independent.co.uk/news/business/news/finland-universal-basic-income-lower-stress-better-motivation-work-wages-salary-a7800741.html", "http://web.mit.edu/curhan/www/docs/Articles/15341_Readings/Motivation/Maslow_1943_A_theory_of_human_motivation.pdf", "https://economics.mit.edu/files/16000", "https://www.heritage.org/poverty-and-inequality/commentary/universal-basic-income-has-been-tried-it-didnt-work", "https://qz.com/india/1536015/can-congresss-universal-basic-income-idea-work-in-india/", "https://en.wikipedia.org/wiki/Aadhaar", "https://www.forbes.com/sites/cognitiveworld/2019/03/09/hacking-our-identity-the-emerging-threats-from-biometric-technology/#1b287e255682", "https://www.weforum.org/", "https://www.youtube.com/watch?v=7rL6gJkdlNU", "https://eluxemagazine.com/?attachment_id=114174", "https://rapanuiclothing.com/", "https://www.architecturaldigest.com/story/robots-to-radically-transform-fashion-industry", "http://behavioralscientist.org/wisdom-universal-basic-income/", "https://www.economist.com/science-and-technology/2017/08/24/sewing-clothes-still-needs-human-hands.-but-for-how-much-longer", "https://fashionista.com/2018/05/fashion-manufacturing-workers-robots", "https://www.fastcompany.com/3067149/is-this-sewing-robot-the-future-of-fashion", "https://www.fastcompany.com/40454692/this-t-shirt-sewing-robot-could-radically-shift-the-apparel-industry", "https://qz.com/india/1536015/can-congresss-universal-basic-income-idea-work-in-india/", "https://img03.en25.com/Web/FCBusinessIntelligenceLtd/%7Be6b42641-7e8a-4a6c-bc5e-0756e4236753%7D_4959_AI_Pack_06AUG18.pdf?elqTrackId=276D6DE27EAED6F341EC14E56BBC90B0&elqaid=21554&elqat=2", "https://img03.en25.com/Web/FCBusinessIntelligenceLtd/%7Be6b42641-7e8a-4a6c-bc5e-0756e4236753%7D_4959_AI_Pack_06AUG18.pdf?elqTrackId=276D6DE27EAED6F341EC14E56BBC90B0&elqaid=21554&elqat=2", "https://www.theguardian.com/sustainable-business/2016/jul/16/robot-factories-threaten-jobs-millions-garment-workers-south-east-asia-women", "https://www.wsj.com/articles/the-robots-are-coming-for-garment-workers-thats-good-for-the-u-s-bad-for-poor-countries-1518797631", "#abh_about", "#abh_posts", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/author/guest/", "https://eluxemagazine.com/travel/green-skiing-in-morzine/", "https://eluxemagazine.com/fashion/ethical-wedding-guest-outfit-ideas/", "https://eluxemagazine.com/recipes/alternative-hummus-recipes/"], "authors": ["Guest"], "publish_date": "2019-05-21T08:30:20+00:00"}