{"result_id": "107010", "URL": "https://eluxemagazine.com/culture/reasons-to-shop-small-now-and-always/", "timestamp": "2023-04-25 15:02:30 CEST+0200", "meta": {"description": "reasons to shop small businesses, why you should support small business, why it's important to buy from small companies, why shop local", "lang": "en", "keywords": "", "favicon": "https://eluxemagazine.com/wp-content/uploads/2020/03/cropped-Eluxe_Logo_512x512-32x32.jpg", "canonical": "https://eluxemagazine.com/culture/reasons-to-shop-small-now-and-always/", "encoding": "utf-8"}, "image": null, "domain": "eluxemagazine.com", "title": "Reasons To Shop Small Now And Always", "cleaned_text": "Still using Amazon? Here are some great reasons to ditch them and shop small, now and always!\n\nFunny, isn’t it, how Covid seems to be a threat to customers in small grocery and clothing stores – but is rendered absolutely harmless at Walgreen, Tesco and Asda? As a result, huge box stores have made record breaking profits, while small businesses are dying in vast numbers.\n\nAccording to the Small Business Association, the USA alone is home to 28.8 million small businesses. But get this: that figure accounts for 99.7% of all US businesses.\n\nAs of Aug. 31, some 163,735 businesses have indicated on Yelp that they have closed, and 60% of those companies will never re-open. Such sad figures are set to rise even further in 2021.\n\nWhat this means is that small and independent businesses need our support now more than ever before. Though it can be hard to patronise them thanks to lockdowns, you can actually find quite a few small clothing shops, beauty brands, restaurants and even farmers’ markets online if you just do a quick search in your area.\n\nStill not sure whether it’s worth the effort? Check out these reasons to shop small, below. And then decide!\n\nReasons To Shop Small Now And Always\n\nSmall, independent business bring originality and variety in a world that’s becoming increasingly globalised. Artisanal goods or items made by hand or in small production facilities not only have more personality, but they also help support traditional craftsmanship and small artisan communities.\n\nAny small business was started with a lot of hope. And so by supporting the hard work of small entrepreneurs, you support their hopes and dreams, as well. How sweet is that?\n\nWell, this one is most obvious reasons to shop small businesses, as stated in the introduction. Whether or not you believe the lockdowns were useful, there is no doubt that small businesses in your area suffered from them in the worst possible ways. Whether it’s your local cafe, fashion store, gym or hairdresser, they need your custom now more than ever, just to put food on the table.\n\nSince you’re supporting a small business owner’s hopes and dreams, they’ve very likely to be grateful to you for doing so. And that gratitude is expressed through excellent customer service. Whether it’s remembering how you take your tea at the local cafe, or aiming to create the perfect bouquet for your taste at the corner flower shop, when you’re in direct contact with local people, they’ve much more likely to pay attention to you and your needs.\n\nPlus: the close, personal relationships created between customers and those that work in independent business frequently go beyond just purchases — they can become downright familial. That’s definitely one of the best reasons to shop small!\n\nFact: when you order something online, you’re creating a huge chain of waste. That includes everything from the CO2 used to transport the goods to your home, right down to the (sometimes massive amounts of) packaging your item comes in. The solution? Save on CO2 and packaging by shopping locally, and taking your own bags to do so.\n\nWant to know which kinds of pesticides the farmers who grew your Whole Foods potatoes use? And how often they use them? Good luck! Want to know which chemicals, if any, were used on the spuds for sale at your local farmers’ market? Just ask the guy selling them! When you buy pretty much anything locally, you can learn more about the product and how it was made directly from the producer. And then you can make a decision as to which stuff you feel best about buying as a result. So, another of the best reasons to shop small is that you’ll have access to better information and transparency.\n\n7. Save your high street from becoming a ghost town\n\nLet’s face it: the shops in your area often define the character of your neighborhood or community.\n\nIf we all mainly shop online, the high street dies. And that’s very sad. Strolling down to the shops, stopping for a coffee along the way, greeting neighbours you bump into, is one of the greatest pleasures in life that we’ve enjoyed for centuries. Let’s keep that tradition alive by frequenting shops in our areas.\n\nAnother of the best reasons to shop small is to support diversity.\n\nThink about the biggest businesses in the world. Any large business, in fact. Who’s behind it? Betcha it’s not a woman. Or a person of colour. Small businesses, on the other hand, are owned by every type of person imaginable.\n\nIn fact, small businesses provide opportunities for women and minorities to establish themselves as independent business owners. According to the U.S. Committee on Small Business & Entrepreneurship, over the past decade, minority businesses represent 50 percent of the two million new businesses started in the USA. There are now more than four million minority-owned companies in the United States.\n\nAnd that should be great news. But the lockdowns have threatened those small businesses and put more money in the pockets of the likes of white billionaires like Jeff Bezos and the Walton family (owners of Walmart). Who wants that?\n\nSupporting small businesses means supporting inclusivity. Just do it.\n\nHere are some interesting facts:\n• When loads of people in your area are unemployed, crime tends to go up.\n• Small businesses tend to hire employees who live in or near the communities that they operate\n\nSo, keep your neighbours employed by supporting small businesses!\n\n10. You may save yourself some money\n\nAnother of the best reasons to shop small may come as a surprise. My dad always said: to get a better bargain, cut out the middleman. And Amazon.com is basically one giant middleman!\n\nThe behemoth takes a whopping 30% of each order. Sometimes, vendors raise prices to cover that take. Postmates or another food delivery services not only get 30-35% of the order, but also mark up the menu! That hurts both you, and the small business owners. Cut out the middleman, and save yourself some cash, and put more money in small business owners’ pockets! Oh, and to see more reasons NOT to shop at Amazon, click here.\n\n11. Help to create an economic ecosystem\n\nThis is one of the most important reasons to shop small.\n\nSmall business workers purchase goods and services at their local businesses, so that money is fueled back into other small businesses. Small businesses also keep disposable income and tax money within their local areas. Business tax income, sometimes called VAT, is paid by both employees and businesses. This income stays local and further benefits the communities through its support of schools, road and municipal services.\n\nAnd there’s more! Small business owners are more likely to help other local business owners by purchasing supplies nearby, partnering in marketing efforts and helping to create a cycle of support that helps local economies thrive. But this all starts with you: the consumer!\n\nPersonally, I think this is yet another of the most vital reasons to shop small.\n\nDid you know that throughout the pandemic, the rich have gotten way, way richer?\n\nProfiting from online sales and jumps in vaccine stocks, Jeff Bezos, Eric Yuan, former Microsoft chief Steve Ballmer, Bill Gates, Warren Buffett and Elon Musk each saw their fortunes jump by more than $1billion dollars. One. Billion. Dollars!\n\nThis is starkly contrasted with roughly 78% of people in the United States living paycheck to paycheck, 20% with no or negative net worth and without three months’ worth of emergency funds to survive on.\n\nDoes that seem fair to you?\n\nOne of the best reasons to shop small businesses is to help that impoverished 78% out. You’ll be aiding not only the business owner, but their staff and the local community, as mentioned above.", "opengraph": {"locale": "en_US", "type": "article", "title": "Reasons To Shop Small Now And Always", "description": "reasons to shop small businesses, why you should support small business, why it's important to buy from small companies, why shop local", "url": "https://eluxemagazine.com/culture/reasons-to-shop-small-now-and-always/", "site_name": "Eluxe Magazine", "article:publisher": "https://www.facebook.com/EluxeMagazine?ref=br_rs", "article:published_time": "2021-01-27T06:57:28+00:00", "article:modified_time": "2021-01-26T18:53:50+00:00", "image": "https://eluxemagazine.com/wp-content/uploads/2021/01/pexels-ketut-subiyanto-4473398.jpg", "image:width": "640", "image:height": "426", "image:type": "image/jpeg", "article:author": "https://www.facebook.com/EluxeMagazine?ref=br_rs"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sba.gov/sites/default/files/March_April_2016_FINAL_508_compliant.pdf", "https://humix.com/redirect?url=https%3A%2F%2Fwomensswim.com%2Fhumix%2Fvideo%2Fa2b1d162c1684cb26c1fdc1102588542699291f1", "https://www.cnbc.com/2020/09/16/yelp-data-shows-60percent-of-business-closures-due-to-the-coronavirus-pandemic-are-now-permanent.html", "https://eluxemagazine.com/culture/articles/the-true-cost-of-free-returns/", "https://eluxemagazine.com/fashion/meet-terra-thread-makers-of-truly-organic-vegan-bags/", "https://eluxemagazine.com/culture/articles/worst-foods-for-pesticides/", "https://eluxemagazine.com/beauty/the-article-i-thought-id-never-write-why-i-quit-coffee-for-good/", "https://www.sbc.senate.gov/public/index.cfm/minorityentrepreneurs", "https://cdn.advocacy.sba.gov/wp-content/uploads/2020/06/04144224/2020-Small-Business-Economic-Profile-US.pdf", "https://eluxemagazine.com/culture/articles/is-amazon-ethical/", "https://www.forbes.com/sites/jackkelly/2020/04/27/billionaires-are-getting-richer-during-the-covid-19-pandemic-while-most-americans-suffer/?sh=69346ac74804", "#abh_about", "#abh_posts", "https://eluxemagazine.com", "https://www.facebook.com/EluxeMagazine?ref=br_rs", "https://twitter.com/eluxemagazine", "https://eluxemagazine.com", "https://eluxemagazine.com", "https://go.skimresources.com/?id=88703X1541792&xs=1&isjs=1&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fchere-di-boscio-56b2a1b%2F&xguid=01CXZQKRMG8R5WKD9TJS0C61E9&xuuid=8b7711adf522c99deb05fe5ce8f4e688&xsessid=&xcreo=0&xed=0&sref=https%3A%2F%2Feluxemagazine.com%2Fabout%2F&xtz=-480&jv=13.12.1-stackpath&bv=2.5.1", "https://eluxemagazine.com", "https://eluxemagazine.com/author/chere/", "https://eluxemagazine.com/culture/win-a-natural-tanning-kit-by-le-beach/", "https://eluxemagazine.com/culture/eluxe-horoscopes/", "https://eluxemagazine.com/fashion/jewellery/ethical-engagement-rings/"], "authors": ["Chere Di Boscio"], "publish_date": "2021-01-27T06:57:28+00:00"}