{"result_id": "108041", "URL": "https://www.ewg.org/news-insights/news-release/2022/03/epa-must-prioritize-funds-meet-pfas-roadmap-deadlines", "timestamp": "2023-04-25 15:03:05 CEST+0200", "meta": {"description": "Environmental groups today sent a letter urging Environmental Protection Agency Administrator Michael Regan to prioritize funds for meeting deadlines in its “Roadmap” for tackling the “forever chemicals” known as PFAS.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2022/03/epa-must-prioritize-funds-meet-pfas-roadmap-deadlines", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EPA must prioritize funds to meet PFAS ‘Roadmap’ deadlines", "cleaned_text": "WASHINGTON – Environmental groups today sent a letter urging Environmental Protection Agency Administrator Michael Regan to prioritize funds for meeting deadlines in its “Roadmap” for tackling the “forever chemicals” known as PFAS.\n\nThe fiscal year 2022 appropriations law directs the EPA to provide Congress with a “spend plan” to address, within 60 days, the “forever chemicals” known as PFAS. The roadmap released in October set deadlines for EPA to develop a drinking water standard for PFOA and PFOS, two of the most notorious PFAS chemicals, among other deliverables.\n\n“Congress passed the buck to EPA,” said EWG’s Senior Vice President for Government Affairs Scott Faber. “It’s up to Administrator Regan to ensure the EPA meets the deadlines in its roadmap.”\n\nPFAS are a large family of fluorinated chemicals linked to an increased risk of cancer, harm to fetal development, reduced vaccine effectiveness and other serious health problems. They are known as forever chemicals because they do not break down in the environment and they build up in our organs.\n\nNearly everyone tested in the U.S. has PFAS compounds in their blood, with exposure from many sources, including food, water, consumer products and dust.\n\n“The ‘spend plan’ is a key test of Administrator Regan’s commitment to make PFAS a priority,” Faber said. “Communities in North Carolina and around the nation are counting on him to deliver.” Before being confirmed as EPA administrator, Regan was secretary of North Carolina's Department of Environmental Quality.\n\n“Communities have waited more than 20 years for EPA to act,” Faber said. “In the next few days, they will learn whether EPA will finally deliver or whether the roadmap is more empty promises.”\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2022/03/epa-must-prioritize-funds-meet-pfas-roadmap-deadlines", "title": "EPA must prioritize funds to meet PFAS ‘Roadmap’ deadlines", "description": "Environmental groups today sent a letter urging Environmental Protection Agency Administrator Michael Regan to prioritize funds for meeting deadlines in its “Roadmap” for tackling the “forever chemicals” known as PFAS.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/news/EPABlog_6.jpg?h=2e181f1f&itok=m99njpZq"}, "tags": [], "tweets": [], "movies": [], "links": ["https://static.ewg.org/upload/pdf/PFAS_budget_letter.pdf", "https://www.ewg.org/pfaschemicals/", "https://www.ewg.org/news-insights/news-release/2021/10/pfas-roadmap-sets-new-direction-epa", "https://www.ewg.org/release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/pfaschemicals/what-are-forever-chemicals.html", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1020459"], "authors": [], "publish_date": "March 25, 2022"}