{"result_id": "108039", "URL": "https://www.ewg.org/news-insights/news/court-case-highlights-childrens-vulnerability-exposures-linked-autism", "timestamp": "2023-04-25 15:03:04 CEST+0200", "meta": {"description": "Federal health officials have acknowledged that childhood vaccines contributed to a young girl developing a brain disorder \"with features of autism spectrum disorder.”", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/court-case-highlights-childrens-vulnerability-exposures-linked-autism", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Court Case Highlights Children's Vulnerability to Exposures Linked to Autism", "cleaned_text": "Federal health officials have acknowledged that childhood vaccines contributed to a young girl developing a brain disorder \"with features of autism spectrum disorder.” An underlying metabolic disorder increased her vulnerability to neurological damage. Newly available court documents from the case her parents brought against the government show federal officials conceding that the vaccines she received during the first two years of her life played a role in the change her parents witnessed, as their daughter Hannah regressed from a normal, verbal toddler to a child withdrawn from the world and, at one point, completely unable to speak. According to CDC,autism affects as many as 1 in 150 children in some communities.\n\nThis case reinforces the fact that some children are more vulnerable than others to exposures that can lead to health problems like autism. It is evidence that their bodies can be overwhelmed, while another child might suffer no ill effects at all from the same exposures. CDC's recommendations on vaccine schedules, that space vaccines out during early childhood, are in place to help protect children from harmful side effects and still provide for crucial protection from disease.\n\nThis case highlights the urgent need for policies that protect children from exposures that put them at risk for autism and other neurological diseases, including exposures to any of the more than 200 industrial chemicals identified by researchers in a landmark 2006 Lancet publication as posing risks to the human brain and nervous system.\n\nThese chemicals include mercury, a known human neurotoxin. Mercury was removed from childhood vaccines around 2001 but is still used as a preservative in the flu shot. Its potential link to autism is a matter of considerable scientific and political debate, and was not supported in a recent California study. But the continuing use of mercury in flu shots administered to pregnant women exposes children in utero to mercury at a time of particular vulnerability. Young children are at risk as well.\n\nThe Environmental Working Group (EWG) conducts innovative research to support strong, science-based policies that will protect children's health. In 2005 our biomonitoring research found 287 industrial chemicals, pollutants and pesticides in cord blood from 10 babies born in the US, including 157 chemicals toxic to the brain and nervous system. Our work also includes research on the potential role of toxic chemicals in the development of autism and autism spectrum disorder.\n\nHannah's case is yet another warning that we need policies that protect all children from exposures that can harm their health. And we need them soon.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/court-case-highlights-childrens-vulnerability-exposures-linked-autism", "title": "Court Case Highlights Children's Vulnerability to Exposures Linked to Autism", "description": "Federal health officials have acknowledged that childhood vaccines contributed to a young girl developing a brain disorder \"with features of autism spectrum disorder.”"}, "tags": [], "tweets": [], "movies": [], "links": ["/reports/bodyburden2", "/reports/autism"], "authors": [], "publish_date": "July 14, 2008"}