{"result_id": "108008", "URL": "https://www.ewg.org/interactive-maps/PFAS_tribal_lands/", "timestamp": "2023-04-25 15:02:43 CEST+0200", "meta": {"description": "140 confirmed, 2,815 suspected PFAS contamination sites within five-mile boundaries of Tribal Lands", "lang": "en", "keywords": "EWG, Environmental Working Group, Interactive Map, Map, PFAS", "favicon": "https://static.ewg.org/reports/interactive-maps/apple-touch-icon-144x144.png", "canonical": "https://www.ewg.org/interactive-maps/PFAS_tribal_lands/", "encoding": "UTF-8"}, "image": null, "domain": "www.ewg.org", "title": "Interactive Map: PFAS contamination across Tribal Lands", "cleaned_text": "Highly toxic fluorinated compounds known as PFAS, or per- and polyfluoroalkyl substances, are now detected in the environment and people worldwide, and across the United States. Thousands of locations in the U.S. have confirmed PFAS pollution in the water, and tens of thousands of industrial or municipal sites are either known to produce and/or use PFAS or are a suspected source for PFAS releases into air and water. This map compiles data on confirmed and suspected PFAS contamination sources within five miles of Tribal Land boundaries in the United States. The GIS layer representing Tribal Lands comes from the U.S. Census 2020 American Indian Area Geography data, serving only as a proxy for Tribal Lands and not constituting an endorsed or official boundary.\n\nPFAS are a class of chemicals that have been widely used to make water-, grease- and stain-repellent products and applications, from firefighting foam to consumer goods. PFAS are notoriously persistent in the environment and the human body. Studies show that exposure to very low levels of PFAS can increase the risk of cancer, harm fetal development and reduce vaccine effectiveness, in addition to other serious health harms such as changes in hormone balance, changes in cholesterol and weight gain. How was this map developed? The GIS analysis of Tribal Lands used the U.S. Census Bureau 2020 TIGER/Line® Shapefiles: American Indian Area Geography file (accessed at https://www.census.gov/cgi-bin/geo/shapefiles/index.php?year=2020&layergroup=American+Indian+Area+Geography on 08/05/2021). Information on the location of confirmed PFAS contamination sites in the United States was compiled by the Environmental Working Group and is viewable at https://www.ewg.org/interactive-maps/pfas_contamination/map/. Information on the location of suspected industrial discharges of PFAS in the United States was compiled by the Environmental Working Group and is viewable at https://www.ewg.org/interactive-maps/2021_suspected_industrial_discharges_of_pfas/map/", "opengraph": {"url": "http://www.ewg.org/interactive-maps/PFAS_tribal_lands/", "title": "Interactive Map: PFAS contamination across Tribal Lands", "description": "140 confirmed, 2,815 suspected PFAS contamination sites within five-mile boundaries of Tribal Lands", "image": "https://www.ewg.org/interactive-maps/PFAS_tribal_lands/img/TribalPFASShare.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.census.gov/cgi-bin/geo/shapefiles/index.php?year=2020&layergroup=American+Indian+Area+Geography", "map/", "map/", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.census.gov/cgi-bin/geo/shapefiles/index.php?year=2020&layergroup=American+Indian+Area+Geography", "https://www.ewg.org/interactive-maps/pfas_contamination/map/", "https://www.ewg.org/interactive-maps/2021_suspected_industrial_discharges_of_pfas/map/"], "authors": ["EWG"], "publish_date": null}