{"result_id": "108003", "URL": "https://www.ewg.org/news-insights/news/ewg-news-roundup-621-pfas-chemicals-reduce-vaccine-efficacy-and-harm-immune", "timestamp": "2023-04-25 15:02:37 CEST+0200", "meta": {"description": "EWG News Roundup (6/21): Here's some news you can use going into the weekend.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/ewg-news-roundup-621-pfas-chemicals-reduce-vaccine-efficacy-and-harm-immune", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG News Roundup (6/21): PFAS Chemicals Reduce Vaccine Efficacy and Harm Immune System, Trump Drops Clean Power Plan and More", "cleaned_text": "This week EWG reviewed recent studies showing that toxic fluorinated chemicals, known as PFAS, harm the immune system and lower vaccine effectiveness. The link between higher blood levels of PFAS and reduced antibody production following vaccination has been observed in studies of both children and adults.\n\nIn other PFAS news, a bipartisan package of legislation that will combat the nationwide PFAS contamination crisis cleared a key Senate committee this week. The legislation would dramatically expand the government’s scope and ability to monitor the growing pollution facing communities across the country.\n\n“The first step to addressing the PFAS contamination crisis is understanding where PFAS pollution is coming from and how far it has spread,” said Scott Faber, EWG’s senior vice president for government affairs. “The fact that we know so little is a scandal. Much more needs to be done to address the crisis, but monitoring the scope of PFAS pollution will lay the groundwork for further progress.”\n\nOn Wednesday, President Trump officially eliminated the Clean Power Plan, the only federal program designed to combat climate change by lowering carbon dioxide emissions from coal-burning power plants. Scientists estimated that the now-scuttled plan would have prevented up to 4,500 premature deaths and 140,000 to 150,000 asthma attacks in children.\n\nThe California General Assembly passed the Safe Jewelry Act, a bipartisan bill that would dramatically lower the allowable level of lead in jewelry marketed to older teens and adults. The next step for this vital legislation is to appear for consideration before the California Senate Appropriations Committee.\n\nAnd finally, EWG surveyed a number of recent studies that show links between heart disease and ultraprocessed foods, industrially processed foods that are hyperpalatable and highly profitable – and highly addictive – formulations of ingredients and additives.\n\nHere’s some news you can use going into the weekend.\n\nCBS News: Bayer, owner of Roundup, to invest $5.6 billion in new weed-killing methods\n\nThe Environmental Working Group said its tests found glyphosate levels above what it considers safe for children in all but four of the products. Reprinted by Business News Press; The Drive 92.9 (Tulsa, Okla.); Talk 1170 (Tulsa, Okla.)\n\nThe Bump: Weed-Killing Chemical Found in Even More Kid-Friendly Cereals, Granola Bars\n\nLast year, the nonprofit the Environmental Working Group (EWG) conducted tests showing the presence of a weed-killer, glyphosate, in certain General Mills and Quaker Oats products.\n\nFOX47 (Lansing, Mich.): Many breakfast cereals still contaminated by weed killer, environmental group says\n\nThe Environmental Working Group says 17 of them contained higher levels of glyphosate that what their scientists have deemed safe for kids.\n\nWebMD: Weedkillers in Cereals: What to Know\n\nIn a new round of testing, the nonprofit watchdog Environmental Working Group found the weedkiller glyphosate in all 21 cereal and snack products it sampled.\n\nA study was done by the Environmental Working Group (EWG) of 21 products made by General Mills. They include six kinds of Cheerios and 14 Nature Valley snacks (you know, the granola bars).\n\n\"Troubling levels\" of a cancer-causing ingredient have been found in many popular children's cereals and other foods, according to the Environmental Working Group.\n\nDes Moines Register: Nitrates in drinking water may be tied to 300 cases of cancer in Iowa each year, study shows\n\nFour states — Iowa, Delaware, Arizona and California — have \"average levels of nitrate contamination that, at the high end … could cause more than 10 cases of cancer per 100,000 people a year,\" according to the Environmental Working Group, a nonprofit research and advocacy group, based in Washington, D.C. Reprinted byIowa City Press-Citizen.\n\nRadio Iowa: Study finds possible link between nitrates and cancer\n\nResearchers from the Environmental Working Group and Duke University estimate as many as 12,000 cancer cases each year nationwide may be linked to nitrates in drinking water. Reprinted by KICD (Spencer, Iowa).\n\nMobile Health Times: AACR Conference Features Latest Research on Impact of Environmental Carcinogens and Potential Pathways to Cancer Prevention\n\nAlexis Temkin, PhD, Environmental Working Group, will present an abstract titled “Exposure-based assessment and economic valuation of adverse birth outcomes and cancer risk due to nitrate in United States drinking water.”\n\nKIOW (Forest City, Iowa): Forest City to Test Water for Lead and not Nitrates\n\nA nationwide study shows some north Iowans are at an increased risk of health effects from nitrate exposure. Researchers from the Environmental Working Group and Duke University estimate as many as 12,000 cancer cases each year nationwide may be linked to nitrates in drinking water. Alexis Temkin is one of the authors of the paper, published in the journal Environmental Research.\n\n13WHO-TV (Des Moines IA): Report Shows Link Between Nitrates in Drinking Water and Cancer\n\nThat report from The Environmental Working Group said Iowa is one of the leading states for those cancer diagnoses because of chemicals the agricultural industry uses and the nitrate runoff it produces.\n\nThe Environmental Defense Fund and the Environmental Working Group obtained the FDA presentation and provided it to The Associated Press.\n\n“…More helpful tips can be found in the EWG’s “Guide to Avoiding PFCS.”\n\nMichigan Live (MLive): The hunt for PFAS turns to Michigan farms using human waste as fertilizer\n\nAcross the U.S., about 47 percent of sewage sludge was land-applied in 2017, said Colin O’Neil of the Environmental Working Group.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment.\n\nAccording to Environmental Working Group (EWG), the amendment was proposed for a Senate version of an annual defense spending bill.\n\nTruthOut: Trump’s Plan to Save Coal Country Will Actually Hurt It\n\n“Sadly, the Trump administration’s futile and cynical attempt to prop up the coal industry — instead of pushing for renewable energy investments in coal country — will hit coal miners and their families the hardest,” said Environmental Working Group President Ken Cook, in an email.\n\nIn a separate analysis, the Environmental Working Group (EWG) reported nearly 3,500 farms – including about 110 dairy operations – received $125,000 or more in MFP payments under the 2018 program.\n\nLeading cosmetics firms such as Estée Lauder Co. are advocating for the bill alongside the American Academy of Pediatrics and the Environmental Working Group.\n\nThe Hill: Connecting the drops between farm fields and mounting water risks\n\nWhile no government agency tracks the number of algal blooms nationally, the Washington, D.C.-based Environmental Working Group found cases of almost 300 blooms in rivers, lakes and bays in 48 states and the Gulf of Mexico since 2010.\n\nNationwide, reports of algal blooms have increased since 2010, the Environmental Working Group reported earlier this month, with climate change exacerbating fertilizer runoff.\n\nMarket Watch: The most effective, best-rated bug sprays — all under $10\n\nThe nonprofit research organization Environmental Working Group notes that their top picks for bug repellents include those with ingredients like Picaridin (a 20% concentration can protect against ticks and mosquitoes all day) and DEET (a 20% to 30% concentration can protect against ticks and mosquitoes all day) — though they do have downsides (see below).\n\nMindBodyGreen: How To Protect Yourself (& Your Baby) From Lyme Disease During Pregnancy\n\nThe Centers for Disease Control and Prevention (CDC) advises against using oil of lemon eucalyptus (also known as PMD, its chemical acronym) on children, so theEnvironmental Working Group suggests you also avoid it during pregnancy. Citronella should also be avoided in the last trimester because it can cause contractions.\n\nIndependent Media Institute: The Scary New Math of Factory Farm Waste\n\nThe risk is particularly pressing for North Carolina, a state regularly smacked by hurricanes, because it houses more than 2,200 hog CAFOs and 3,900 poultry CAFOs, and produces up to 10 billion gallons of animal waste a year. These estimates come from the Environmental Working Group.\n\nNatural News: Factory farming contaminates our food, pollutes the environment, and poisons our water\n\nFor example, the Environmental Working Group analyzed water across 1,700 systems across the nation, and they found that it contained nitrogen at levels exceeding five parts per million. This is the amount that the National Cancer Institute has identified as raising the risk of bladder, ovarian, colon and kidney cancer.\n\nThe Montgomery Herald (Oak Hill, W.Va.): Why pay big bucks for toxic-laden cleaning supplies?\n\nThe non-profit Environmental Working Group (EWG) looked into the ingredients lists of more than 2,000 cleaning supplies commonly available on store shelves across the country and found that hundreds of them contain substances linked to serious health problems.\n\nThe News-Item (Shamokin, PA): Eco-friendly cleaning products: Now they’re everywhere\n\nThe non-profit Environmental Working Group (EWG) looking into the ingredients lists of more than 2,000 cleaning supplies commonly available on store shelves across the country…\n\nSanta Fe New Mexican (Santa Fe, N.M.): Seven things you can try to help the planet\n\nGo to www.EWG.org to look up stuff you want to buy and only purchase those with a score of 1 EWG’s app, which you can download on your phone, rates anything from cosmetics to cleaning supplies, so you can look up your shampoo and conditioner or even the bleach you use to clean your bathtub.\n\nThis product is non-toxic and certified by the stringent guidelines of the Environment Working Group (EWG). Great\n\nHenry Rose is the name of her group of fragrances that is the “first line of fine fragrances created with 100 percent ingredient transparency.” It’s even verified by the Environmental Working Group, which guarantees it’s swimming in beautiful fragrances, not toxic chemicals.\n\nBusiness Insider: The best natural makeup you can buy\n\nAn easy way to check product safety is to visit the EWG Skin Deep Cosmetics Database and verify the safety ratings of more than 73,000 beauty products. Reprinted by New Haven Register (CT); Connecticut Post (Bridgeport CT); Greenwich Time (CT); News Times (Danbury CT); Seattle PI; Advoacate Online (Stamford CT); SF Gate (San Francisco); 9 other media outlets\n\nBusiness Insider: 'Natural' labels on beauty products are meaningless, so look for options without fragrances, dyes, parabens, and preservatives instead\n\nIndeed, a 2008 study by the Organic Consumers Association found a \"carcinogenic petrochemical ingredient in more than 40% of products tested that claimed to be natural,\" according to the Environmental Working Group.\n\nIf you’re ever unsure of the ingredients in your sunscreen, check the Environmental Working Group’s Skin Deep database, which gives safety information on a wide range of products and ingredients.\n\nThe List: Makeup brands that aren’t worth the money\n\nNneka Leiba, director of Healthy Living Science at Environmental Working Group, agrees. \"The main problem with lead is that it's neurotoxin in that is has an effect on the brain,\" the expert told Reader's Digest, advising consumers to \"avoid lipsticks that they know have tested high in lead contamination.\"\n\nYahoo! Canada: Goop sunscreen controversy brings Health Canada loophole to light — here's what you need to know about sunscreen safety\n\nThe Washington, D.C.-based Environmental Working Group’s Skin Deep Cosmetics Database is one reputable online resource that helps people learn what’s in the products they put on their bodies and that penetrate the skin, including sunscreen.\n\nAsbury Park Press (Monmouth County, N.J.): Pesticides in vegetables and fruit? What has the most, and what has the least?\n\nEach year, the Environmental Working Group, a non-profit, non-partisan research organization, presents its \"Shopper's Guide to Pesticides in Produce,\" which ranks the pesticide contamination of 47 popular fruits and vegetables. Reprinted by Courier Post (Philadelphia PA); North Jersey (USA Today); other USA Today affiliates.\n\nWhile eating conventional produce is far healthier than not eating any, there's evidence that certain fruits and vegetables, like those in the Environmental Working Group's Dirty Dozen list, are best bought from the organic section of the grocery store.\n\nMercola: Protect your gums and your brain with K2\n\nNeedless to say, though, organic greens are optimal choice, in light of information from the Environmental Working Group's 2019 Dirty Dozen23 list: The plant-based foods with the heaviest toxic load from pesticide overspray include spinach and kale in the No. 1 and No. 2 spots. Reprinted by Health Nut News\n\nStar Advertiser (Honolulu, HI): The Electric Kitchen: Build recipes around ‘Clean 15’\n\nThe “Clean 15” list, compiled by the nonprofit, nonpartisan Environmental Working Group, ranks the pesticide contamination levels of 47 fruits and vegetables.\n\nByrdie: These Mineral Sunscreens Act Like a Shield Against Damaging UV Rays\n\nThe clean formula is free of a long list of potentially questionable chemicals (so much so that the Environmental Working Group, an organization that keeps tabs on ingredient safety, gave it top honors), it’s hypoallergenic, and you can grab it at Walmart.\n\nStyleCaster: The Underrated, Must-Try Mineral Sunscreens You Probably Didn’t Know Existed\n\nThis hypo-allergenic, sweat-resistant formula holds the rare distinction of the Environmental Working Group’s highest rating.\n\nSwirled: Daily Fit 06/17/2019: The best SPF for sun protection\n\nAccording to the Environmental Working Group, properly applied SPF 50 sunscreen blocks 98 percent of UVB rays and SPF 100 blocks 99 percent.\n\nThe Environmental Working Group has also published a guide to help consumers find sunscreens with safe ingredients.\n\nABC Action News: WFTS (Tampa Bay, Fla.): Full Circle: What's in your water and where does it comes from?\n\nThe Environmental Working Group, a non-profit, created an online database where you can search for your specific water utility , to see if it meets federal health standards.\n\nIn its June 10 comments, Environmental Working Group (EWG), which has long pushed for more stringent regulation of PFAS, advises EPA to apply reference dose data based on the latest toxicology research rather than on an “already outdated” 2016 drinking water health advisory, reiterates calls for designating the entire class of PFAS as “hazardous substances,” and calls for setting the PRG and screening levels based on total concentration for the sum of all PFAS at a site.\n\nThe Environmental Working Group (EWG) analyzed two EPA online databases and data from a New York survey to identify 475 industrial sites known to produce or use PFAS, or are suspected of using PFAS.\n\nAnd the Environmental Working Group (EWG) also urged policymakers to list PFAS as a “hazardous substance,” one of several issues they said still needs to be addressed. “We need to designate PFAS as a ‘hazardous substance’ to kickstart the cleanup process in the places with the worst PFAS contamination,” EWG Senior Vice President for Government Affairs Scott Faber said in a June 14 statement.\n\nWHYY (Philadephia, Penn.): Congress eyes ban on firefighting foams that have tainted drinking water in the Philly region\n\nScott Faber of the Environmental Working Group, a national advocate for stricter limits on PFAS chemicals, said firefighting foams are just one of the big sources of the toxic compounds. Reprinted by State Impact Pennsylvania and WITF-FM (Harrisburg, Penn.).\n\nThe Fayetteville Observer (N.C.): Chemical levels on Fort Bragg well below EPA guidelines\n\nMore than 100 military installations across the county have PFAS levels above the EPA’s health advisory, according to an analysis by the Environmental Working Group.\n\nThe national study mentioned earlier, conducted by advocacy nonprofit Environmental Working Group and a Northeastern University research group, is also accompanied by a steadily building database from two of the PFAS drinking water contamination incidents.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/ewg-news-roundup-621-pfas-chemicals-reduce-vaccine-efficacy-and-harm-immune", "title": "EWG News Roundup (6/21): PFAS Chemicals Reduce Vaccine Efficacy and Harm Immune System, Trump Drops Clean Power Plan and More", "description": "EWG News Roundup (6/21): Here's some news you can use going into the weekend.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/News%20Roundup%20Share%20Image_114.jpg?h=ec041e41&itok=osExzzy3"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/release/bipartisan-pfas-package-clears-key-senate-committee", "https://www.ewg.org/energy/release/22714/trump-officially-repeals-only-federal-mandate-combat-climate-change-lower-coal", "https://www.ewg.org/release/bipartisan-bill-protect-californians-toxic-jewelry-clears-key-committee-0", "https://www.ewg.org/news-and-analysis/2019/06/studies-heart-disease-and-death-tied-ultraprocessed-foods", "https://www.cbsnews.com/news/bayer-owner-of-monsantos-roundup-glyphosate-to-invest-5-6-billion-in-new-weed-killing-methods/", "https://businessnewspress.com/bayer-monsanto-and-roundup-owner-to-invest-5-6-billion-in-new-weedkillers-as-glyphosate-faces-legal-threats-cbs-news/", "https://www.929thedrive.com/story/40656769/bayer-roundup-owner-to-invest-dollar56-billion-in-new-weedkilling-methods", "https://www.1170kfaq.com/story/40656769/bayer-roundup-owner-to-invest-dollar56-billion-in-new-weedkilling-methods", "https://www.thebump.com/news/weed-killing-chemicals-cereals-granola-bars-june-2019", "https://www.fox47news.com/news/health/ask-dr-nandi/many-breakfast-cereals-still-contaminated-by-weed-killer-environmental-group-says", "https://www.webmd.com/diet/news/20190614/weedkillers-in-cereal-what-to-know", "https://www.webmd.com/cancer/herbicide-glyphosate-cancer", "https://power96radio.com/roundup-weed-killer-found-in-cheerios/", "https://wrrv.com/troubling-levels-of-cancer-causing-agent-found-in-kids-cereal/", "https://www.desmoinesregister.com/story/money/agriculture/2019/06/20/nitrates-iowas-drinking-water-may-tied-cancer-study-says/1487951001/", "https://www.press-citizen.com/story/money/agriculture/2019/06/20/nitrates-iowas-drinking-water-may-tied-cancer-study-says/1487951001/", "https://www.radioiowa.com/2019/06/17/study-finds-possible-link-between-nitrates-and-cancer/", "https://kicdam.com/news/170071-study-iowans-at-higher-risk-of-health-trouble-due-to-nitrates-in-water/", "http://www.mobilehealthtimes.com/aacr-conference-features-latest-research-on-impact-of-environmental-carcinogens-and-potential-pathways-to-cancer-prevention/", "http://icm-tracking.meltwater.com/link.php?DynEngagement=true&H=5eXH0qSKdBRphS6WO4YlQwwSTi8wtQOqejFjZKiddbCzZ5Bbl4XDYVUEN8CfbMg0cJJZKYIYU3pcWaf0jt%2FhcDCfrkAwJTpt8%2FZwtIgMOdwNmMzpLhoCIQm8hIqULwyv&G=0&R=https%3A%2F%2Fwww.ewg.org%2Fbio%2Falexis-temkin&I=20190618131934.000003c35d01%40mail6-43-usnbn1&X=MHwxMDQ2NzU4OjVkMDhlNGExZDdkNzRjY2IwYWNjMTMxNTs%3D&S=BVPSg3_PpSsLFhpSatrCT3Q4u9evd9qFmHda7QEkLck", "https://kiow.com/2019/06/21/higher-nitrates-in-water-pose-a-greater-area-health-risk/", "https://whotv.com/2019/06/17/report-shows-link-between-nitrates-in-drinking-water-and-cancer/", "http://www.fox26houston.com/health/fda-sampling-finds-toxic-nonstick-compounds-in-some-food", "https://articles.mercola.com/sites/articles/archive/2019/06/18/pfoa-chemicals-in-food-supply.aspx", "https://www.mlive.com/news/2019/06/the-hunt-for-pfas-turns-to-michigan-farms-using-human-waste-as-fertilizer.html", "https://www.wateronline.com/doc/m-study-found-pfas-in-food-nearly-years-ago-0001", "https://www.wqpmag.com/emerging-contaminants/senate-amendment-may-expand-pfas-monitoring", "https://truthout.org/articles/trumps-plan-to-save-coal-country-will-actually-hurt-it/", "https://www.progressivedairy.com/news/industry-news/dairy-received-about-2-of-initial-mfp-payments", "https://www.bloomberg.com/opinion/articles/2019-06-19/asbestos-in-makeup-shows-need-for-better-cosmetics-regulation?srnd=premium-africa", "https://thehill.com/opinion/energy-environment/449398-connecting-the-drops-between-farm-fields-and-mounting-water-risks", "https://www.thegazette.com/subject/news/government/iowa-dnr-wont-follow-stricter-epa-federal-standard-for-beach-water-quality-20190619", "https://www.marketwatch.com/story/why-this-effective-9-insect-repellent-scores-nearly-3000-rave-reviews-on-amazon-2019-06-12?mod=personal-finance", "https://www.mindbodygreen.com/articles/everything-you-need-to-know-about-lyme-disease-and-pregnancy", "https://www.ewg.org/research/ewgs-guide-bug-repellents/pregnant#I%27M%20PREGNANT%20AND%20NEED%20LYME%20DISEASE%20PROTECTION", "https://independentmediainstitute.org/how-much-factory-farm-waste-is-polluting-the-environment-a-new-algorithm-can-help-find-out/", "https://www.naturalnews.com/2019-06-20-factory-farming-contaminates-our-food-pollutes-the-environment.html", "https://www.montgomery-herald.com/community/why-pay-big-bucks-for-toxic-laden-cleaning-supplies/article_d2c3bc8c-8eb0-11e9-aaab-cf1472d1c6e4.html", "https://www.newsitem.com/arts_living/eco-friendly-cleaning-products-now-they-re-everywhere/article_61641c85-8177-5aa6-9770-eea9a257dc42.html", "https://www.santafenewmexican.com/life/teen/seven-things-you-can-try-to-help-the-planet/article_123dbe0e-b02f-5da2-aed9-f99d362716b1.html", "https://www.ewg.org/", "https://www.onegreenplanet.org/natural-health/cruelty-free-peptide-rich-face-creams-serums-masks/", "https://www.bostonherald.com/2019/06/20/summer-calls-for-light-fresh-scents/", "https://www.businessinsider.com/best-natural-makeup", "https://www.nhregister.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.ctpost.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.greenwichtime.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.newstimes.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.seattlepi.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.stamfordadvocate.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.sfgate.com/technology/businessinsider/article/The-best-natural-makeup-you-can-buy-13998474.php", "https://www.insider.com/what-do-natural-labels-on-beauty-products-mean-2019-6", "https://goop.com/wellness/detox/summer-detox-guide/", "https://www.ewg.org/skindeep/", "https://www.thelist.com/155573/makeup-brands-that-arent-worth-the-money/", "https://ca.style.yahoo.com/goop-sunscreen-controversy-brings-health-canada-loophole-to-light-heres-what-you-need-to-know-135743521.html", "https://www.app.com/story/life/wellness/2019/06/17/pesticides-vegetables-and-fruit-list-pesticides-produce-strawberries-kale-blueberries-spinach/1352538001/", "https://www.courierpostonline.com/story/life/wellness/2019/06/17/pesticides-vegetables-and-fruit-list-pesticides-produce-strawberries-kale-blueberries-spinach/1352538001/", "https://www.northjersey.com/story/life/wellness/2019/06/17/pesticides-vegetables-and-fruit-list-pesticides-produce-strawberries-kale-blueberries-spinach/1352538001/", "https://www.insider.com/greasy-food-doesnt-cause-acne-and-other-skin-diet-truths-2019-6", "https://articles.mercola.com/sites/articles/archive/2019/06/17/vitamin-k2-for-gum-and-brain.aspx", "https://www.healthnutnews.com/protect-your-gums-and-your-brain-with-k2/", "https://www.staradvertiser.com/2019/06/18/food/crave-electric-kitchen/the-electric-kitchen-build-recipes-around-clean-15/", "https://www.byrdie.com/best-mineral-sunscreens-4689569", "https://stylecaster.com/beauty/best-mineral-sunscreen/", "https://swirled.com/the-best-spf-for-sun-protection/", "https://6abc.com/health/can-a-base-tan-help-prevent-sunburns/5355480/", "https://www.ewg.org/sunscreen/", "https://www.abcactionnews.com/news/full-circle/full-circle-whats-in-your-water-and-where-does-it-comes-from", "https://insideepa.com/daily-news/epa%E2%80%99s-pfas-groundwater-guidance-draws-wide-ranging-criticisms", "https://insideepa.com/sites/insideepa.com/files/documents/2019/jun/epa2019_1036d.pdf", "https://insideepa.com/daily-feed/report-lists-475-facilities-may-be-discharging-pfas", "https://insideepa.com/daily-news/utilities-provide-cautious-response-senate-pfas-bill-ahead-markup", "https://whyy.org/articles/congress-eyes-ban-on-firefighting-foams-that-have-tainted-drinking-water-in-the-philly-region/", "https://stateimpact.npr.org/pennsylvania/2019/06/16/congress-eyes-ban-on-firefighting-foams-that-have-tainted-drinking-water/", "https://www.witf.org/news/2019/06/congress-eyes-ban-on-firefighting-foams-that-have-tainted-pa-drinking-water.php", "https://www.fayobserver.com/news/20190619/chemical-levels-on-fort-bragg-well-below-epa-guidelines", "https://www.sej.org/publications/reporters-toolbox/database-helps-track-pfas-drinking-water-contamination"], "authors": [], "publish_date": "June 21, 2019"}