{"result_id": "108025", "URL": "https://www.ewg.org/news-insights/news-release/2021/10/landmark-california-law-bans-forever-chemicals-products-infants", "timestamp": "2023-04-25 15:02:53 CEST+0200", "meta": {"description": "In a major victory for consumers, Gov. Gavin Newsom signed legislation to protect infants and children from the toxic “forever chemicals” known as PFAS by banning the compounds in cribs, playpens and many other products. The ban takes effect on July 1, 2023.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2021/10/landmark-california-law-bans-forever-chemicals-products-infants", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Landmark California law bans 'forever chemicals' in products for infants, children", "cleaned_text": "SACRAMENTO, Calif. – In a major victory for consumers, Gov. Gavin Newsom signed legislation today to protect infants and children from the toxic “forever chemicals” known as PFAS by banning the compounds in cribs, playpens and many other products. The ban takes effect on July 1, 2023.\n\nAuthored by Assemblymember Laura Friedman (D-Glendale), the law bans the use of PFAS in a wide range of “juvenile” products, as defined in the law.\n\n“As a mother, it’s hard for me to think of a greater priority than the safety and well-being of my child,” said Friedman. “PFAS have been linked to serious health problems, including hormone disruption, kidney and liver damage, thyroid disease and immune system disruption.\n\n“This new law ends the use of PFAS in products meant for our children,” she said.\n\nPFAS are a class of thousands of chemicals linked to increased risk of cancer, harm to fetal development and reduced vaccine effectiveness. They are known as forever chemicals because they do not break down in the environment and build up in our blood and organs.\n\n“This law puts California in the lead for protecting children’s health,” said Bill Allayaud, EWG’s director of California government affairs. “We applaud Gov. Newsom for giving parents confidence that the products they buy for their children are free from toxic PFAS.\n\n“It’s heartening that for this legislation, the chemical industry joined consumer advocates to create a reasonable solution, as public awareness increases of the health risks posed by PFAS exposure,” he said.\n\nThe PFAS coating on juvenile products such as infant seats and toddler mattresses can wear off and get into dust that children might inhale. In some cases, direct ingestion is possible for very young children, who explore the world through their mouths.\n\n“Children are particularly vulnerable to harm resulting from PFAS exposure,” said David Andrews, Ph.D., senior scientist at EWG. “Many PFAS chemicals bioaccumulate and are found in the blood of almost all Americans, including babies and infants.\n\n“Multiple studies have found toxic PFAS in every breast milk sample tested. Babies and children cannot escape exposure from these chemicals and should not be test subjects for the chemical industry. It is absolutely critical that we eliminate all unnecessary exposure to this family of chemicals as soon as possible,” he said.\n\nIn November 2017, two of the most notorious PFAS chemicals – PFOA, the Teflon chemical, and PFOS, formerly an ingredient in 3M’s Scotchgard – were added to California’s Proposition 65 registry of chemicals known to the state to cause reproductive toxicity. Inclusion on the registry means products that may expose consumers to PFOA or PFOS must carry warnings.\n\nThe chemical industry has long opposed the systemic regulation of PFAS as a class. However, California’s Department of Toxic Substances Control has firmly stated that the science shows these chemicals should be regulated as a class, not as individual chemicals, since the industry is adept at keeping ahead of regulation by rapidly developing new versions of PFAS that are just as troubling.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action. Visit www.ewg.org for more information.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2021/10/landmark-california-law-bans-forever-chemicals-products-infants", "title": "Landmark California law bans 'forever chemicals' in products for infants, children", "description": "In a major victory for consumers, Gov. Gavin Newsom signed legislation to protect infants and children from the toxic “forever chemicals” known as PFAS by banning the compounds in cribs, playpens and many other products. The ban takes effect on July 1, 2023. ", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/news/BabyPowderPR.jpg?h=2d11e82b&itok=fCANZ2Ga"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB652", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-insights/news/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review", "https://www.ewg.org/news-insights/our-experts/bill-allayaud", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://news.bloombergenvironment.com/environment-and-energy/insight-the-case-for-regulating-all-pfas-chemicals-as-a-class", "https://www.ewg.org/", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1020459"], "authors": [], "publish_date": "October 5, 2021"}