{"result_id": "108043", "URL": "https://www.ewg.org/news-insights/news/2022/11/ewgs-2022-gift-guide", "timestamp": "2023-04-25 15:03:08 CEST+0200", "meta": {"description": "Choosing a gift for someone is challenging enough without the added worry of whether the item you’re buying is full of potentially harmful chemicals.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/2022/11/ewgs-2022-gift-guide", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG’s 2022 gift guide", "cleaned_text": "Choosing a gift for someone is challenging enough without the added worry of whether the item you’re buying is full of potentially harmful chemicals.\n\nEWG is here to help – our 2022 gift guide contains our top ideas for presents that are good for your loved ones and the planet.\n\nFew things are more annoying than uncomfortable sneakers. If you’re buying a gift for someone who likes to walk or run, whatever the climate, consider giving them some breathable, temperature-regulating wool sneakers. Look for shoes made from organic materials that avoid harsh waterproofing substances, which may contain the toxic “forever chemicals” known as PFAS.\n\nFor the person who loves to read nonfiction and is always looking for the next big story consider the recently published “Profits of Distrust: Citizen-Consumers, Drinking Water, and the Crisis of Confidence in American Government,” by Manuel P. Teodoro, Samantha Zuhlke and David Switzer. This book on the water bottle industry is one you won’t be able to put down.\n\nWhether you’re shopping for a seasoned cook or budding baker, consider a silicon baking mat. Unlike baking paper, silicone mats are reusable and don’t contain some of the nasty chemicals you find in single-use options, like bleach.\n\nA collapsible, silicone cup is a great choice for the coffee or tea drinker in your life. Choose one that avoids some of the harmful chemicals and contaminants found in other reusable and disposable cups, like BPA and phthalates. They’re great for both cold and hot beverages on the go.\n\nAlmost any foodie will be excited to receive a mini cast iron skillet. This pan will make cooking smaller treats (like a decadent skillet cookie) a breeze, and will help eliminate the use of nonstick pans, which can contain PFAS.\n\nWho doesn’t love a good scent? But many people don’t realize the “fragrance” in a lot of these products is a mix of potentially thousands of chemicals, including phthalates, that could be linked to health harms.\n\nIf you want to give a gift of scent, consider the first EWG VERIFIED® fine fragrance collection, Henry Rose. The brand’s products are free from EWG’s chemicals of concern and meet our strictest standards for your health. Or look for other EWG VERIFIED products here.\n\nMost people love a clean kitchen, but few enjoy working to get it into that condition. Make the task a little easier – and more sustainable – with a European dish cloth. They’re durable and help cut down on paper towel waste. And they’re microwave and dishwasher safe. Bonus: They’re available in a variety of bright colors and patterns.\n\nIt’s great to have soft, clean clothes, fresh from the dryer. But dryer sheets often contain potentially hormone-disrupting fragrance and other chemicals, which can trigger asthma and skin irritation.\n\nWool dryer balls are a great solution: They help soften your laundry without harsh chemicals and last for thousands of loads. Look for a version made of organic wool.\n\nAre you or your loved one looking to reduce food waste? “The No-Waste Vegetable Cookbook: Recipes and Techniques for Whole Plant Cooking” may be just the thing. This book, which contains tons of recipes and techniques, challenges you to cook using the whole vegetable – roots and all.\n\nA beautiful bouquet of flowers can be a perfect gift, but fresh flowers are expensive, hard to come by in the winter months – and short-lived.\n\nInstead of giving a fresh bouquet, this holiday season, consider giving one of dried flowers. Dried bouquets are vibrantly colorful and will last a year or more. Just make sure they don’t contain “fragrance” of any kind.\n\nIf you’re buying a gift for someone who lives in a cold climate, or just someone who is always chilly, consider a rechargeable hand warmer, which helps reduce waste by replacing disposable hand-warming options.\n\nWith improved vaccine availability and better treatments for Covid-19, more people have started returning to the office or attending school in person. Help make the transition easier with a good lunch container.\n\nLook for an option that’s plastic-free and allows you to bring food with you, wherever you go, without worrying about leaks or spills.\n\nA good pan scraper is a must for anyone who knows the frustration of scrubbing stubborn food from a pan. Look for one gentle enough to be used on all pan materials.\n\nInstead of giving an object, consider making a donation in someone’s name or donating to give the gift of EWG’s 2022 Holiday Gift Box. This year’s box contains an assortment of fantastic products.\n\nFor a tax-deductible donation of $135, you support a worthy organization and we are able to continue our groundbreaking research and advocacy. It’s a win-win!", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/2022/11/ewgs-2022-gift-guide", "title": "EWG’s 2022 gift guide", "description": "Choosing a gift for someone is challenging enough without the added worry of whether the item you’re buying is full of potentially harmful chemicals.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2021-12/Screen%20Shot%202021-12-06%20at%2010.28.40%20AM%201.png?h=946a6ecd&itok=t1P7-uti"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://mannyteodoro.com/?page_id=2951", "https://organicallyaddison.com/mini-skillet-cookie/", "https://www.youtube.com/watch?v=6wAToqkcAow", "https://www.ewg.org/news-insights/news/2021/10/six-tips-avoid-phthalates-after-study-highlights-health-harms-billion", "https://henryrose.com/", "https://www.ewg.org/ewgverified/", "https://www.amazon.com/No-Waste-Vegetable-Cookbook-Recipes-Techniques/dp/1558329978?&linkCode=sl1&tag=greenthatlife-20&linkId=4281216f458c84f5fb02e9166144ecf6&language=en_US&ref_=as_li_ss_tl", "https://act.ewg.org/a/2022-holiday-gift-box?sourceid=1021255"], "authors": [], "publish_date": "November 16, 2022"}