{"result_id": "108001", "URL": "https://www.ewg.org/news-insights/news-release/2022/09/gov-newsom-vetoes-california-bill-track-and-report-toxic-forever", "timestamp": "2023-04-25 15:02:36 CEST+0200", "meta": {"description": "On Thursday, Gov. Gavin Newsom vetoed a bill that would have required collection and reporting of information on products and substances sold or brought into the state containing the toxic “forever chemicals” known as PFAS.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2022/09/gov-newsom-vetoes-california-bill-track-and-report-toxic-forever", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Gov. Newsom vetoes California bill to track and report toxic ‘forever chemicals’", "cleaned_text": "SACRAMENTO, Calif. – On Thursday, Gov. Gavin Newsom vetoed a bill that would have required collection and reporting of information on products and substances sold or brought into the state containing the toxic “forever chemicals” known as PFAS.\n\n“We are troubled that Gov. Newsom would veto legislation that would finally identify the PFAS coming into the state,” said Bill Allayaud, California director of government affairs at the Environmental Working Group.\n\n“How will the state prevent and clean up the contamination when we don’t know where these toxic PFAS come from? Without this information, we can’t take meaningful steps toward protecting the health of Californians and our environment in the long-term,” said Allayaud.\n\nAssemblymember Richard Bloom (D-Santa Monica) authored the legislation, A.B. 2247, with state Sen. Ben Allen (D-Santa Monica) and Assemblymember Phil Ting (D-San Francisco) as coauthors.\n\nThe law would have given regulators the tools to find out how many PFAS enter and are sold in California, and in what form.\n\n“State and local governments, water treatment services and businesses will continue to be in the dark about the various sources of PFAS,” said Susan Little, EWG’s senior advocate for government affairs.\n\n“The California’s sanitation and water agencies are struggling to clean up PFAS. They need to understand where the chemicals are coming from in order to reduce their harmful effects. We’re disappointed Gov. Newsom vetoed this bill,” said Little.\n\n“It’s unconscionable that PFAS are polluting our drinking water systems and harming some of our most vulnerable communities,” she said.\n\nAllayaud added, “Looking at the governor’s veto message, it is particularly disappointing that he pointed to some future action by U.S. EPA as to why California does not need to act now, instead of setting the pace. And he pointed to vague possible costs to state agencies. But this is a failure to acknowledge the costs of PFAS to public health, including pollution of drinking water supplies.”\n\nA broad coalition supported the bill, including all the state’s sanitation and water agencies, cities, counties and special districts, and dozens of clean water and public health advocates, including EWG.\n\nOn Thursday, Newsom signed into law the PFAS-Free Beauty Act, which bans the chemicals from being sold in cosmetics in the state.\n\nPFAS are among the most persistent toxic compounds in existence, contaminating everything from drinking water to food. Because of their grease-, stain- and water-resistant qualities, they are used widely in consumer products, such as food packaging, personal care products and textiles, as well as microchips and other components produced and used by Silicon Valley.\n\nPFAS are found in the blood of virtually everyone, including newborn babies. Very low doses of PFAS have been linked to suppression of the immune system, including reduced vaccine efficacy. These chemicals harm development and the reproductive system, such as reduced birth weight and impacts on fertility; increased risk of certain cancers; and affect metabolism, such as changes in cholesterol and weight gain.\n\nDecades of heavy PFAS use have resulted in contamination of water, soil and animals in the farthest corners of the world.\n\n“It is long past time we turned off the tap on PFAS pollution,” said Melanie Benesh, EWG vice president of government affairs. “To do that, we must first learn where this contamination is coming from. Then we can work to prevent more PFAS from getting into our water, food and air.”\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action. https://www.ewg.org", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2022/09/gov-newsom-vetoes-california-bill-track-and-report-toxic-forever", "title": "Gov. Newsom vetoes California bill to track and report toxic ‘forever chemicals’", "description": "On Thursday, Gov. Gavin Newsom vetoed a bill that would have required collection and reporting of information on products and substances sold or brought into the state containing the toxic “forever chemicals” known as PFAS.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/CaliBillsShare.jpg?h=ec041e41&itok=rkURJkAQ"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/areas-focus/toxic-chemicals/pfas-chemicals", "https://www.ewg.org/news-insights/our-experts/bill-allayaud", "https://a50.asmdc.org/", "https://legiscan.com/CA/bill/AB2247/2021", "https://www.ewg.org/news-insights/our-experts/susan-little", "https://static.ewg.org/upload/pdf/AB_2247_Senate_Floor_letter.pdf", "https://www.ewg.org/news-insights/news-release/2022/09/newsom-signs-law-banning-toxic-forever-chemicals-cosmetics", "https://www.ewg.org/key-issues/toxics/nonstick-chemicals", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/sites/default/files/u352/EWG_PFAS_Toxicity_C02.pdf?_ga=2.261156366.226128373.1596463302-1166909982.1546543464&_gac=1.186103003.1594309408.Cj0KCQjwgJv4BRCrARIsAB17JI76ePJXlJNzc67zHlqjxFXY10Ntg92CSH4GngKg_gjy_vA8DJtkkCgaAuCPEALw_wcB&_gl=1*gat5nn*_gcl_aw*R0NMLjE1OTQzMDk0MDguQ2owS0NRandnSnY0QlJDckFSSXNBQjE3Skk3NmVQSlhsSk56YzY3ekhscWp4RlhZMTBOdGc5MkNTSDRHbmdLZ19nanlfdkE4REp0a2tDZ2FBdUNQRUFMd193Y0I.", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/tapwater/reviewed-pfcs.php", "https://www.ewg.org/news-insights/news/2022/04/ewg-forever-chemicals-may-taint-nearly-20-million-cropland-acres", "https://pubmed.ncbi.nlm.nih.gov/27692342/", "https://www.ewg.org/news-insights/our-experts/melanie-benesh", "https://www.ewg.org/"], "authors": [], "publish_date": "September 19, 2022"}