{"result_id": "108024", "URL": "https://www.ewg.org/sites/humantoxome/chemicals/chemical.php?chemid=100375", "timestamp": "2023-04-25 15:02:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ewg.org/sites/humantoxome/chemicals/chemical.php?chemid=100375", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG || Human Toxome Project", "cleaned_text": "Tests for total mercury measure the concentration of several different forms of mercury in the body. These include metallic mercury (an inorganic form found in thermometers, dental fillings, fluorescent light bulbs, batteries, some skin lightening creams, antiseptic creams and ointments); ethylmercury (used in some vaccines and eye drops); and methylmercury (MeHg, an organic form found in seafood).\n\nThe majority of people's exposures to mercury are through the consumption of contaminated seafood. When we eat fish, the gut absorbs 95 percent of the methylmercury contained in the fish's tissues (ATSDR 1999). The human body also readily absorbs mercury vapors, with 80 percent of it entering the bloodstream directly from your lungs. This is important because research has shown that mercury-based dental fillings release mercury vapor over time, leading to low-level continuous exposure to inorganic mercury (PHS 1993).\n\nBlood mercury levels are a snapshot of what the body has been exposed to within the last month or so - the human body removes half of any given mercury exposure within about two months. However, when either metallic mercury, ethylmercury, or methylmercury reach the brain, they can be transformed into inorganic mercury and reside in the brain for much longer. Mercury in the blood of pregnant women accumulates in higher concentrations in her developing child (ATSDR 1999).\n\nShort-term high exposures to inorganic mercury can cause poisoning, respiratory and gastrointestinal problems, mood changes, nerve damage and memory loss in adults. Long-term, low-level exposures can cause kidney and nerve damage, muscle tremors, irritability, personality changes, and gingivitis (USEPA 1999).\n\nMethylmercury is toxic to the developing fetal brain, and exposure in the womb can cause learning deficiencies and a delay of mental development in children. The U.S. Centers for Disease Control (CDC) recently reported that 10 percent of American women of childbearing age - some 7 million women each year - have mercury in their blood at levels that the are potentially unsafe for the developing fetus (NAS 2000).\n\nThe nervous system is the primary target of MeHg to the developing fetus. Knowledge of the neurological effects in humans following developmental exposure to MeHg is based on accidental poisonings and studies looking at groups of people whose diets are high in MeHg-contaminated fish. These studies show that high exposure levels can lead to: spontaneous abortion; limb deformities; impaired growth; neurotoxicity (mental retardation, seizures, cerebral palsy); blindness and deafness. Lower exposure levels during development are associated with delays in cognitive developmental, abnormal muscle tone, and impaired reflex response.\n\nMethylmercury is classified by the US EPA and the International Agency for Research on Cancer (IARC) as being a 'possible' human carcinogen; it is associated with leukemia and possibly with liver cancer and chromosomal damage. Methylmercury exposure is also associated with changes in immune system, kidney, decreased fertility and possible cardiovascular effects (NAS 2000).", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["chemical_classes.php?class=Metals", "../participants/participant.php?subject=amr01", "../participants/participant.php?subject=amr02", "../participants/participant.php?subject=amr03", "../participants/participant.php?subject=amr04", "../participants/participant.php?subject=amr05", "../participants/participant.php?subject=amr06", "../participants/participant.php?subject=amr08", "../participants/participant.php?subject=mcb01", "../participants/participant.php?subject=mcb02", "../participants/participant.php?subject=mcb03", "../participants/participant.php?subject=mcb04", "../participants/participant.php?subject=mcb05", "../participants/participant.php?subject=mcb06", "../participants/participant.php?subject=mcb07", "../participants/participant.php?subject=mcb08", "../participants/participant.php?subject=mcb09", "../participants/participant.php?subject=mcb10", "../participants/participant.php?subject=TS-01", "../participants/participant.php?subject=TS-02", "../participants/participant.php?subject=TS-04", "../participants/participant.php?subject=TS-05", "../participants/participant.php?subject=TS-06", "../participants/participant.php?subject=TS-07", "../participants/participant.php?subject=TS-08", "../participants/participant.php?subject=TS-09", "../participants/participant.php?subject=TS-10", "../participants/participant.php?subject=TS-11", "../participants/participant.php?subject=TS-12", "../participants/participant.php?subject=TS-13", "../participants/participant.php?subject=TS-14", "../participants/participant.php?subject=TS-15", "../participants/participant.php?subject=TS-16", "../participants/participant.php?subject=TS-17", "../participants/participant.php?subject=TS-18", "../participants/participant.php?subject=TS-20", "../participants/participant.php?subject=TS-21"], "authors": [], "publish_date": null}