{"result_id": "108017", "URL": "https://www.ewg.org/news-insights/news/2022/11/new-baby-textile-product-tests-show-concerning-levels-toxic-forever", "timestamp": "2023-04-25 15:02:49 CEST+0200", "meta": {"description": "You may have noticed an uptick in media reports detailing new discoveries in various consumer products of the “forever chemicals” known as PFAS. They’re highly toxic and pervasive – and found in everything from drinking water to food packaging and many items we use every day.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/2022/11/new-baby-textile-product-tests-show-concerning-levels-toxic-forever", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "New baby textile product tests show concerning levels of toxic ‘forever chemicals’", "cleaned_text": "You may have noticed an uptick in media reports detailing new discoveries in various consumer products of the “forever chemicals” known as PFAS. They’re highly toxic and pervasive – and found in everything from drinking water to food packaging and many items we use every day.\n\nNow you can add baby and children’s products to the list.\n\nEarlier this year, EWG commissioned an independent laboratory to test for PFAS in baby and children’s textile products. The results showed fluorine, a good indicator of the likely presence of PFAS, in all 34 samples. Ten products with high fluorine levels were tested and confirmed to have detectable levels of individual PFAS for which testing methods exist.\n\nThe products we tested included a variety of baby supplies – bedding, bibs, changing pads, clothing, nursing pillows, outerwear, pacifier clips, playmats and activity gyms, snack bags and soft toys. EWG’s findings – likely the first to detail levels of PFAS in baby textiles – extend what we already know about the prevalence of these chemicals in consumer products.\n\nOn average, we found the highest levels of total fluorine in bedding. This is particularly a problem since kids and especially babies spend huge amounts of time in their cribs. The other categories with the highest fluorine concentrations were bibs, outerwear and snack bags.\n\nProducts are first tested for fluorine because it’s impossible to quickly and efficiently test for all 4,000 different PFAS in this class of chemicals. Tests for specific PFAS won’t show polymers – chains of individual PFAS molecules that create the grease-proof and waterproof coatings. Tests for total fluorine can capture individual PFAS and PFAS polymers.\n\nResults of PFAS concentrations are typically presented in parts per billion, or ppb, while results for total fluorine are referenced in parts per million, or ppm.\n\nThese initial fluorine test results made it simpler for us to screen rapidly for products that might contain higher concentrations of the 70 different PFAS that could be identified. We then tested the ten products with the highest concentrations of fluorine for specific kinds of PFAS. The products included three types of bedding, two types of bibs, three pieces of clothing and a single snack bag. (See Figures 1 and 2.)\n\nAll 10 products had detectable PFAS, with an average of 17 different compounds detected in each. Three products had very high concentrations of identified PFAS, compared to the others: a bib and two pieces of clothing. The snack bag had the fourth highest total concentration of identified PFAS. The most frequently found types of PFAS in all ten products were perfluoro-2-ethoxypropanoic acid, or PEPA; perfluorobutanoic acid, or PFBA; perfluorohexanoic acid, or PFHxA; and PPF acid.\n\nFor this research, we chose a diverse group of products and brands commonly bought by parents and sold in a range of prices, made by companies of various sizes. The products were purchased online from Amazon, Target and Old Navy (See Table 2.)\n\nIt’s easy to see why manufacturers in all categories would aim to make products stain-, water- and grease-resistant. And parents’ preference for these products for their babies and toddlers, who are constantly making messes, is understandable, especially when they're provided with no information on potential drawbacks or hidden costs.\n\nBut because the bodies of babies and young children are still developing, they are among the most vulnerable to harms from PFAS – their exposure to toxic chemicals is greater, pound for pound, than that of adults.\n\nPFAS are found in the blood of virtually everyone, including newborn babies. Very low doses of PFAS have been linked to suppression of the immune system, including reduced vaccine efficacy in children. These chemicals harm development and the reproductive system, such as reduced birth weight and impacts on fertility; increased risk of certain cancers; and affect metabolism, such as changes in cholesterol and weight gain.\n\nDecades of widespread PFAS use have resulted in contamination of water, soil and animals in the farthest corners of the world.\n\nDespite a rash of recent reports about PFAS in clothing, most don’t look at baby products.\n\nA study by Toxic-Free Future reported finding PFAS above 100 ppm in 35 of 60 products it tested, including bedding and yoga pants. Researchers at the Silent Spring Institute found PFAS are common in stain- and water-resistant products used by kids and teens. The study found pillow protectors and clothing had higher levels of PFAS than other product categories. Bedding has also been shown to contain these chemicals.\n\nAnother study recently found PFAS in school uniforms, weather-resistant outdoor wear and children’s products like hats, stroller covers, swimwear, sweatshirts and baby shoes. The levels of PFAS were like those in outerwear, which could be an important source of kids’ exposure.\n\nCalifornia’s Safer Clothes and Textiles Act was signed into law in September, making the Golden State the first to phase PFAS out of clothes and textiles, effective January 2025. Because of the size of the California market, the new law is likely to influence the manufacturing of products sold throughout the country.\n\nThese toxic chemicals must be regulated and banned\n\nOur scientists caution that these findings don’t mean parents need to throw out all their children’s products. Our study, with its small sample size, is intended to show that PFAS are everywhere, including in children’s products.\n\nSo it’s difficult, if not impossible, to outfit your child’s nursery entirely with PFAS-free textile items. If a product claims to be free from a specific type of PFAS chemical – like PFOA, for instance – it may contain any one or more of the thousands of other PFAS chemicals.\n\nYou can look for products made without these chemicals, but they’re difficult to find, since companies are not required to disclose their use of PFAS. A product is more likely not to contain forever chemicals if it says “PFAS free,” but these claims aren’t verified by a third party.\n\nUntil it’s possible to be certain whether your baby and toddler textile products contain PFAS, your best bet is to avoid anything labeled stain-, water- or grease-resistant, or spill-proof, since these are more likely to have detectable levels of total fluorine and higher levels of PFAS. Even products labeled “green” or “organic” may contain them. Consult our PFAS-free products page for help finding items made without the intentional addition of these chemicals.\n\nIn the meantime, recognize that we can’t control most sources of exposure, but there are steps to reduce your own, and your children’s, exposure to PFAS.\n\nPFAS accumulate in household dust – near and on the floor where young children often play. A high-quality vacuum with a HEPA filter and regular sweeping can help limit their exposure. A carbon-activated water filter can eliminate up to about three-quarters of the PFAS in your drinking water, but it’s critical to follow the directions when it comes to changing the filter, or you risk making the problem worse.\n\nRemoving these toxic chemicals from our environment\n\nThese results confirm what EWG has said for years: Regulators must act immediately to eliminate these harmful chemicals from products used by babies and children.\n\nIn the absence of swift and decisive action by the federal government, states have begun to step up. Maine and Colorado have passed sweeping bans on the chemicals. Restrictions on sales of specific categories of PFAS-contaminated products have been imposed in some states. California has banned the chemicals in a range of cosmetics and other categories, in addition to textiles. New York legislation banning PFAS in textiles is awaiting the governor’s signature.\n\nOther states are taking action to ban PFAS from a range of consumer products, and some companies have pledged to manufacture their products without the chemicals.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/2022/11/new-baby-textile-product-tests-show-concerning-levels-toxic-forever", "title": "New baby textile product tests show concerning levels of toxic ‘forever chemicals’", "description": "You may have noticed an uptick in media reports detailing new discoveries in various consumer products of the “forever chemicals” known as PFAS. They’re highly toxic and pervasive – and found in everything from drinking water to food packaging and many items we use every day.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2022-10/TextileShare.jpg?h=ec041e41&itok=XzF-pU7P"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://www.ewg.org/key-issues/toxics/nonstick-chemicals", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/sites/default/files/u352/EWG_PFAS_Toxicity_C02.pdf?_ga=2.261156366.226128373.1596463302-1166909982.1546543464&_gac=1.186103003.1594309408.Cj0KCQjwgJv4BRCrARIsAB17JI76ePJXlJNzc67zHlqjxFXY10Ntg92CSH4GngKg_gjy_vA8DJtkkCgaAuCPEALw_wcB&_gl=1*gat5nn*_gcl_aw*R0NMLjE1OTQzMDk0MDguQ2owS0NRandnSnY0QlJDckFSSXNBQjE3Skk3NmVQSlhsSk56YzY3ekhscWp4RlhZMTBOdGc5MkNTSDRHbmdLZ19nanlfdkE4REp0a2tDZ2FBdUNQRUFMd193Y0I.", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/tapwater/reviewed-pfcs.php", "https://www.ewg.org/news-insights/news/2022/04/ewg-forever-chemicals-may-taint-nearly-20-million-cropland-acres", "https://pubmed.ncbi.nlm.nih.gov/27692342/", "https://toxicfreefuture.org/research/pfas-in-stain-water-resistant-products-study/", "https://www.ewg.org/news-insights/news/2022/01/new-tests-find-toxic-forever-chemicals-bedding-yoga-pants-and-other", "https://silentspring.org/news/many-eco-friendly-childrens-textiles-found-contain-toxic-pfas-chemicals", "https://pubs.acs.org/doi/10.1021/acs.est.1c051", "https://www.mamavation.com/product-investigations/best-non-toxic-bedding-mattress-covers-sheets-comforters.html", "https://pubs.acs.org/doi/10.1021/acs.est.2c02111", "https://www.nrdc.org/experts/avinash-kar/ca-first-state-ban-toxic-forever-pfas-textiles", "https://pubs.acs.org/doi/10.1021/acs.est.1c05175", "https://theconversation.com/pfas-are-showing-up-in-childrens-stain-and-water-resistant-products-including-those-labeled-nontoxic-and-green-182215", "https://www.ewg.org/withoutintentionallyaddedpfaspfc", "https://www.saferstates.org/assets/Resources/PFAS-Momentum-Factsheet-7.21.2022.pdf", "https://static.ewg.org/upload/pdf/EWG_Report_PFAS-Textiles_Table_C02.pdf"], "authors": [], "publish_date": "November 3, 2022"}