{"result_id": "108040", "URL": "https://www.ewg.org/news-insights/news/2022/12/five-ways-hidden-pentagon-health-study-undercounts-forever-chemicals", "timestamp": "2023-04-25 15:03:04 CEST+0200", "meta": {"description": "The Defense Department may be underestimating by hundreds of thousands the number of people at military installations drinking water contaminated with the “forever chemicals” known as PFAS. The DOD’s analysis also downplays the health hazards of these dangerous chemicals.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/2022/12/five-ways-hidden-pentagon-health-study-undercounts-forever-chemicals", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Five ways a hidden Pentagon health study undercounts ‘forever chemicals’ risks", "cleaned_text": "The Defense Department may be underestimating by hundreds of thousands the number of people at military installations drinking water contaminated with the “forever chemicals” known as PFAS. The DOD’s analysis also downplays the health hazards of these dangerous chemicals.\n\nEWG reviewed an April 2022 DOD PFAS assessment and other Pentagon records, and found the study to be incomplete in several ways. Congress mandated the analysis in the 2019 defense appropriations law, but the report has not been published on the department's public PFAS website, so it is unavailable to the public or service members except upon request.\n\nThe DOD says 24 military installations with a combined population of 175,000 people were served drinking water contaminated with PFOA and PFOS, the two most notorious PFAS. But there are at least 116 installations with a population over 640,000 who likely received water above levels currently deemed safe by the Environmental Protection Agency.\n\nThe April assessment counted only service members stationed at installations where DOD-operated water systems supplied them with water containing levels of PFOA and PFOS above 70 parts per trillion, or ppt. The EPA in 2016 set a non-enforceable lifetime health advisory level of 70 ppt for the two chemicals.\n\nBut in June 2022, the EPA updated the level to less than 1 ppt. The DOD’s analysis fails to include drinking water contaminated with PFAS above the new levels that was given to service members either by the DOD itself, privatized on-base water systems or bought from local water utilities.\n\nPFAS are called “forever chemicals” because they never break down in the environment. They are associated with cancer, reproductive and developmental harms, and reduced effectiveness of vaccines, among other health problems.\n\n2. The DOD’s own estimate of contaminated water is incomplete\n\nThe DOD’s identification of 24 installations serving contaminated water is incomplete.t,. By the assessment’s April 18 publication date, over 70 ppt. of PFOA and PFOS had been detected in DOD drinking water systems on at least four other installations. These bases were not included in the report, and include:\n• None of PFOA and PFOS was found in drinking water\n• None of PFOA and PFOS was found in drinking water\n• None of PFOA and PFOS was found in drinking water\n• None of PFOA and PFOS was found in drinking water\n\n3. The DOD failed to look at past drinking water exposure\n\nThe DOD’s estimate of service members who were provided contaminated drinking water doesn’t include people who served or lived at those installations in the past. The estimate of 175,000 gives a snapshot of how many people might be drinking contaminated water at any given time.\n\nThe armed services have used firefighting foams containing PFAS at least since the 1970s. But the DOD’s report does not account for the number of service members and their families who lived on bases with contaminated water in the time since then, about 50 years.\n\nAnd service members and their families often move between installations, likely increasing the number of people exposed to contaminated drinking water on base.\n\n4. The DOD didn’t consider all possible PFAS health effects\n\nThe DOD’s study failed to complete a meta-analysis of all possible PFAS harms, citing a lack of evidence from the nearly 300 other PFAS health studies they identified.\n\nThe DOD could have identified specific PFAS used in firefighting foams, along with the related types of PFAS typically found in drinking water on their bases, and based its meta-analysis on the identified compounds, to which service members would have been exposed.\n\nThe report did single out some specific health effects of PFOA and PFOS exposure, including that it may decrease vaccine effectiveness, affect liver functionality, and increase cholesterol levels. But the assessment did not include “increased risk of kidney or testicular cancer,” a health effect recognized by the Agency for Toxic Substances and Disease Registry, or ATSDR, and the National Academy of Sciences. ATSDR is a federal agency that specializes in conducting public health assessments.\n\nBecause of these health harms, the National Academy of Sciences recently released a report calling for expanded testing of people with elevated PFAS exposures.\n\n5. The DOD ignored the impact of PFAS on pregnant people\n\nThe report did not use any of the 239 available studies of how PFAS can affect maternal or fetal health because, as the department says, “These categories were excluded from our review as this effort focused on military members and veterans.”\n\nThis assumes service members are unable to get pregnant and that no active service member or veteran has ever been pregnant while on base. A separate study published by the DOD shows that approximately 13,000 active duty service members give birth annually.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/2022/12/five-ways-hidden-pentagon-health-study-undercounts-forever-chemicals", "title": "Five ways a hidden Pentagon health study undercounts ‘forever chemicals’ risks", "description": "The Defense Department may be underestimating by hundreds of thousands the number of people at military installations drinking water contaminated with the “forever chemicals” known as PFAS. The DOD’s analysis also downplays the health hazards of these dangerous chemicals."}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://static.ewg.org/upload/pdf/DOD_health_Assessment.pdf", "https://www.congress.gov/bill/115th-congress/house-bill/5515/text", "https://www.acq.osd.mil/eie/eer/ecc/pfas/tf/reports.html", "https://web.archive.org/web/20221206181418/https://www.acq.osd.mil/eie/eer/ecc/pfas/tf/reports.html", "https://www.ewg.org/key-issues/toxics/nonstick-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://aec.army.mil/index.php/PFAS/KS/FTL", "https://aec.army.mil/index.php/PFAS/NJ/PICA", "https://aec.army.mil/index.php/PFAS/WA/YTC", "https://aec.army.mil/index.php/PFAS/NC/FTBR", "https://www.ewg.org/research/decades-department-defense-knew-firefighting-foams-forever-chemicals-were-dangerous", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.nationalacademies.org/news/2022/07/new-report-calls-for-expanded-pfas-testing-for-people-with-history-of-elevated-exposure-offers-advice-for-clinical-treatment", "https://www.nationalacademies.org/news/2022/07/new-report-calls-for-expanded-pfas-testing-for-people-with-history-of-elevated-exposure-offers-advice-for-clinical-treatment", "https://apps.dtic.mil/sti/pdfs/AD1071402.pdf", "https://www.congress.gov/bill/115th-congress/house-bill/5515/text"], "authors": [], "publish_date": "December 15, 2022"}