{"result_id": "108020", "URL": "https://www.ewg.org/sites/humantoxome/chemicals/chemical.php?chemid=200149", "timestamp": "2023-04-25 15:02:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ewg.org/sites/humantoxome/chemicals/chemical.php?chemid=200149", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG || Human Toxome Project", "cleaned_text": "Heavy metals are age old industrial toxins that cause multiple impacts to human health. Most heavy metals impact several body systems. Lead and mercury are highly toxic to the brain, nervous system, kidneys, reproductive system, and immune system. (ATSDR 1999; ATSDR 1999) Many are probable or known carcinogens. (NTP 2002) Scientific research is beginning to question the role that a lifetime of metals exposure may play in degenerative diseases of aging like Parkinsons and Alzheimers. (Zawia 2005)\n\nUnlike many other chemicals detected in the human body, much more is known about the toxic effects of heavy metal exposures, sources of exposure to the chemical, and typical concentrations in modern populations. However, despite this knowledge, millions of Americans suffer from chronic exposures to heavy metals, including lead, mercury, arsenic and cadmium. The CDC recently reported 10% of American women of childbearing age (7 million women each year) have mercury in their blood at levels that the are potentially unsafe for the developing fetus. (NAS 2000).\n\nPeople are exposed to heavy metals via many common sources: house paint (lead), dental fillings (mercury), vaccines (mercury), cigarettes (cadmium), food, drinking water and hazardous waste sites.\n\nBlood measurements of heavy metals are often a snapshot of what the body has been exposed to within the last month or so. The human body removes half of any given mercury exposure within about two months. However, when mercury reaches the brain, it can be transformed into inorganic mercury and reside in the brain for much longer. Lead is stored in the bone for years, and remobilized into the bloodstream during pregnancy. Mercury in the blood of pregnant women accumulates in higher concentrations in her developing child. (ATSDR 1999)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["chemical_classes.php?class=Metals"], "authors": [], "publish_date": null}