{"result_id": "108037", "URL": "https://www.ewg.org/news-insights/news-release/2023/01/ewg-study-eating-one-freshwater-fish-equals-month-drinking", "timestamp": "2023-04-25 15:03:02 CEST+0200", "meta": {"description": "A new study by Environmental Working Group scientists finds that consumption of just a single serving of freshwater fish per year could be equal to a month of drinking water laced with the “forever chemical” PFOS at high levels that may be harmful.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2023/01/ewg-study-eating-one-freshwater-fish-equals-month-drinking", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG study: Eating one freshwater fish equals a month of drinking ‘forever chemicals’ water", "cleaned_text": "WASHINGTON – A new study by Environmental Working Group scientists finds that consumption of just a single serving of freshwater fish per year could be equal to a month of drinking water laced with the “forever chemical” PFOS at high levels that may be harmful.\n\nResearchers calculated that eating one fish in a year equated to ingesting water with PFOS at 48 parts per trillion, or ppt, for one month.\n\nThe study bolsters EWG’s long-running calls for strict regulation of PFOS and the other toxic “forever chemicals” known as PFAS, in addition to more tests of food such as fish, since diet is thought to be a major source of PFAS exposure for Americans. The findings are a particular issue for communities with environmental justice concerns, whose survival often depends on eating freshwater fish they’ve caught.\n\nEWG found the median amounts of PFAS in freshwater fish were an astounding 280 times greater than forever chemicals detected in some commercially caught and sold fish. The testing data, from the Environmental Protection Agency and Food and Drug Administration, showed that consuming a single meal of freshwater fish could lead to similar PFAS exposure as ingesting store-bought fish every day for a year.\n\n“People who consume freshwater fish, especially those who catch and eat fish regularly, are at risk of alarming levels of PFAS in their bodies,” said David Andrews, Ph.D., EWG senior scientist and one of the study’s lead authors. “Growing up, I went fishing every week and ate those fish. But now when I see fish, all I think about is PFAS contamination.”\n\nThe forever chemical found at greatest concentrations in freshwater fish was PFOS, formerly an ingredient in 3M’s Scotchgard, averaging roughly three in four of total PFAS detections.\n\n“These test results are breathtaking,” said Scott Faber, EWG’s senior vice president for government affairs. “Eating one bass is equivalent to drinking PFOS-tainted water for a month.”\n\nConsumption of PFOS-contaminated freshwater fish can cause significant increases in peoples’ blood serum levels of the forever chemical, creating potential health risks. Even infrequent consumption of freshwater fish can raise PFOS levels in the body.\n\n\"The extent that PFAS has contaminated fish is staggering”, said Nadia Barbo, a graduate student at Duke University and lead researcher on this project. “There should be a single health protective fish consumption advisory for freshwater fish across the country.”\n\nThe researchers analyzed data from more than 500 samples of fish fillets collected in the U.S. from 2013 to 2015 under monitoring programs by the EPA, the National Rivers and Streams Assessment and the Great Lakes Human Health Fish Fillet Tissue Study. The median level of total PFAS in fish fillets was 9,500 nanograms per kilogram, with a median level of 11,800 nanograms per kilogram in the Great Lakes.\n\n“PFAS contaminate fish across the U.S., with higher levels in the Great Lakes and fish caught in urban areas,” said Tasha Stoiber, Ph.D., an EWG senior scientist and another co-author. “PFAS do not disappear when products are thrown or flushed away. Our research shows that the most common disposal methods may end up leading to further environmental pollution.”\n\nFreshwater fish are an important source of protein for many people, and PFAS contamination threatens those who cannot afford to purchase commercial seafood. Communities that depend on fishing for sustenance and for traditional cultural practices are inordinately harmed. This makes exposure to chemical pollutants in freshwater fish a textbook case of environmental injustice.\n\n“Identifying sources of PFAS exposure is an urgent public health priority,” said Stoiber.\n\nThe widespread contamination of fish in rivers and streams across the country further emphasizes the need to end industrial discharges of PFAS.\n\nEWG estimates there may be more than 40,000 industrial polluters of PFAS in the U.S. Tens of thousands of manufacturing facilities, municipal landfills and wastewater treatment plants, airports, and sites where PFAS-containing firefighting foams have been used are potential sources of PFAS discharges into surface water.\n\nThis contamination of water has spread PFAS to soil, crops and wildlife, including fish.\n\n“For decades, polluters have dumped as much PFAS as they wanted into our rivers, streams, lakes and bays with impunity. We must turn off the tap of PFAS pollution from industrial discharges, which affect more and more Americans every day,” said EWG’s Faber.\n\nThe EPA and the FDA test differently to detect PFAS in fish. The EPA uses what’s known as draft Method 1633 to test for up to 40 PFAS compounds in fish tissue, as well as in wastewater, surface water, groundwater, soil, biosolids, sediment and the liquid that forms when waste breaks down in landfills.\n\nNational EPA tests show nearly all fish in U.S. rivers and streams are contaminated with PFAS in the parts-per-billion range – even greater than parts per trillion. Although the most recent test results found decreasing PFAS levels, freshwater fish are still contaminated at high levels.\n\nThe FDA improved its scientific method to test for 20 different PFAS compounds. Its approach is used to test seafood samples, as well as processed foods. In its 2022 survey of seafood, the FDA found much lower levels of PFAS in seafood from grocery stores. The median levels of total PFAS detected by the EPA were 280 times higher than levels in commercially sold fish tested by the FDA.\n\nPFAS are among the most persistent compounds in existence, contaminating everything from drinking water to food, food packaging and personal care products. PFAS build up in our bodies and never break down in the environment. They are found in the blood of virtually everyone, including newborn babies.\n\nVery low doses of PFAS in drinking water have been linked to suppression of the immune system, including reduced vaccine efficacy, and an increased risk of certain cancers. PFAS are linked with increased cholesterol, reproductive and developmental problems and other health harms.\n\nMore than 200 million Americans could be drinking water contaminated with PFAS. The problem is likely worse than has already been confirmed, further underscoring the need for swift regulatory action.\n\n“The EPA needs to move swiftly to set regulations for the industries most likely to be dumping PFAS into the environment. Downstream communities especially have suffered the consequences of unregulated PFAS discharges for far too long,” added Faber.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2023/01/ewg-study-eating-one-freshwater-fish-equals-month-drinking", "title": "EWG study: Eating one freshwater fish equals a month of drinking ‘forever chemicals’ water", "description": "A new study by Environmental Working Group scientists finds that consumption of just a single serving of freshwater fish per year could be equal to a month of drinking water laced with the “forever chemical” PFOS at high levels that may be harmful.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2023-01/PFASFishShare.jpg?h=ec041e41&itok=WQSFV3iU"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/node/7657", "https://www.sciencedirect.com/science/article/abs/pii/S0013935122024926?via%3Dihub", "https://www.ewg.org/pfaschemicals/", "https://www.epa.gov/sites/default/files/2016-05/documents/pfos_health_advisory_final_508.pdf", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://www.ewg.org/news-insights/our-experts/scott-faber", "https://www.ewg.org/news-insights/our-experts/tasha-stoiber-phd", "https://www.ewg.org/news-insights/news/feeding-waste-cycle-how-pfas-disposal-perpetuates-contamination", "https://www.ewg.org/interactive-maps/pfas_in_US_fish/map/", "https://www.ewg.org/interactive-maps/2021_suspected_industrial_discharges_of_pfas/map/", "https://www.epa.gov/newsreleases/epa-announces-first-validated-laboratory-method-test-pfas-wastewater-surface-water", "https://www.fda.gov/food/process-contaminants-food/testing-food-pfas-and-assessing-dietary-exposure", "https://www.ewg.org/key-issues/toxics/nonstick-chemicals", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-insights/news-release/study-more-200-million-americans-could-have-toxic-pfas-their-drinking", "https://www.ewg.org/interactive-maps/pfas_contamination/"], "authors": [], "publish_date": "January 17, 2023"}