{"result_id": "108005", "URL": "https://www.ewg.org/news-insights/news-release/cdc-investigates-potential-link-between-forever-chemicals-and-decreased", "timestamp": "2023-04-25 15:02:39 CEST+0200", "meta": {"description": "A federal health agency is investigating whether exposure to the fluorinated \"forever chemicals\" called PFAS could affect the potential effectiveness and duration of a Covid-19 vaccine.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/cdc-investigates-potential-link-between-forever-chemicals-and-decreased", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "CDC Investigates Potential Link Between ‘Forever Chemicals’ and Decreased Effectiveness of Covid-19 Vaccines", "cleaned_text": "WASHINGTON – A federal health agency is investigating whether exposure to the fluorinated \"forever chemicals\" called PFAS could affect the potential effectiveness and duration of a Covid-19 vaccine.\n\nIn a Nov. 6 letter to Rep. Dan Kildee (D-Mich.), Dr. Robert Redfield, director of the Centers for Disease Control and Prevention, said the CDC’s Agency for Toxic Substances and Disease Registry, or ATSDR, is “assessing the intersection between PFAS exposure and COVID-19,” the disease caused by the coronavirus.\n\nThe CDC is currently carrying out a study looking at Covid-19 among healthcare workers and first responders. Redfield said as part of that study, ATSDR will measure PFAS levels in the participants “to determine the association” between PFAS in their blood and the risk of coronavirus infection and contracting Covid-19.\n\nThe study will also gauge the connection of PFAS levels and antibody response to the coronavirus that “may shed light on the potential impact of PFAS exposure on vaccine response and potential duration of vaccine protection,” including for any future Covid-19 vaccines.\n\n“Many first responders who are at high risk of being exposed to COVID-19, including firefighters and servicemembers, already have elevated levels of PFAS in their blood. The Centers for Disease Control and Prevention must assess whether PFAS chemicals have an impact on the effectiveness of COVID-19 vaccines,” said Kildee. “When it comes to protecting public health, we must always promote transparency and make information available to the public. In Congress, I will continue to make every effort possible to clean up and reduce PFAS chemicals in our environment.”\n\nPFAS compounds are in the blood of virtually all Americans, including the umbilical cord blood of newborn babies. PFAS are called “forever chemicals” because they build up in our bodies and don’t break down in the environment.\n\nSome population groups are exposed to higher levels of PFAS than others, including firefighters, military personnel and communities who are located near PFAS manufacturing plants or have PFAS-contaminated drinking water.\n\nIn his letter, Redfield notes that the CDC and ATSDR are looking at how to incorporate Covid-19 research into the current epidemiological PFAS study taking place in eight states across the U.S.\n\nA growing body of scientific research links elevated PFAS exposure with immune system harm and decreased response to vaccines, including studies showing a weaker response to tetanus and diphtheria vaccinations in infants and influenza vaccines for adults.\n\nIn a Nov. 17 article in The Guardian, Dr. Philippe Grandjean, who led the study on PFAS exposure and diminished response to tetanus and diphtheria vaccinations, raised concerns about the potential for people with high levels of PFAS to experience similar reactions to a Covid-19 vaccine.\n\n“People with high exposure to PFAS have non-protective and very low antibody levels after four vaccinations for diphtheria and tetanus,” Grandjean said. “So if a vaccine for Covid is similar, the PFAS will likely inhibit the response from a vaccine. But it is an unknown at this stage.”\n\n“We would have to cross our fingers and hope for the best,” he said.\n\nCDC’s announcement comes at a critical moment, as Covid-19 cases and deaths from the virus are near record levels in almost every state. Yesterday, the Food and Drug Administration's advisory committee recommended the agency grant emergency-use authorization to one of the Covid-19 vaccines that has been developed.\n\n“Everyone should get vaccinated once safe and effective vaccines are available,” said Scott Faber, EWG’s senior vice president for government affairs. “To ensure that these and future vaccines are as effective as possible, we must address the PFAS contamination crisis. No one should have to worry that the toxic chemicals building up in our blood are making our vaccines less effective.”\n\nMore than 200 million Americans are likely drinking water and eating food contaminated with PFAS. Nevertheless, the Environmental Protection Agency, the Food and Drug Administration and the Defense Department have for decades failed to address the chemicals’ health risks. There are no federal limits on PFAS releases into air and drinking water sources, and no requirements to clean up PFAS pollution where it has been detected. PFAS chemicals are allowed for use in food packaging, personal products, clothing and many other consumers products.\n\nPresident-elect Joe Biden and Vice President-elect Kamala Harris have made cleaning up PFAS pollution a top priority for their incoming administration, pledging to set enforceable legal limits for PFAS in drinking water and designating PFAS as hazardous substances under the federal Superfund cleanup law.\n\nThe president-elect has also pledged to prioritize PFAS substitutes in the marketplace. That means Biden could direct the EPA and the FDA to quickly phase out non-essential uses of PFAS in food packaging and other everyday products.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/cdc-investigates-potential-link-between-forever-chemicals-and-decreased", "title": "CDC Investigates Potential Link Between ‘Forever Chemicals’ and Decreased Effectiveness of Covid-19 Vaccines", "description": "A federal health agency is investigating whether exposure to the fluorinated \"forever chemicals\" called PFAS could affect the potential effectiveness and duration of a Covid-19 vaccine."}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://cdn3.ewg.org/sites/default/files/u352/00256729_Kildee_Final.pdf", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.ewg.org/news-and-analysis/2020/11/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.theguardian.com/world/2020/nov/17/chemicals-found-in-everyday-products-could-hinder-covid-19-vaccine", "https://www.ewg.org/release/study-more-200-million-americans-could-have-toxic-pfas-their-drinking-water", "https://www.ewg.org/epa-pfas-timeline/", "https://www.ewg.org/dodpfastimeline/", "https://www.ewg.org/news-and-analysis/2020/11/how-will-biden-administration-tackle-forever-chemicals"], "authors": [], "publish_date": "December 11, 2020"}