{"result_id": "108035", "URL": "https://www.ewg.org/news-insights/news-release/2022/08/ewg-applauds-congressional-letter-urging-epa-designate-pfas", "timestamp": "2023-04-25 15:03:00 CEST+0200", "meta": {"description": "The Environmental Working Group applauds the 127 House of Representatives members who sent a letter today urging the Environmental Protection Agency to designate two PFAS “forever chemicals” as hazardous substances.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2022/08/ewg-applauds-congressional-letter-urging-epa-designate-pfas", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG applauds congressional letter urging EPA to designate PFAS hazardous substances", "cleaned_text": "WASHINGTON – The Environmental Working Group applauds the 127 House of Representatives members who sent a letter today urging the Environmental Protection Agency to designate two PFAS “forever chemicals” as hazardous substances.\n\nThe agency is behind schedule on classifying perfluorooctanoic acid, or PFOA, and perfluorooctane sulfonic acid, or PFOS, two of the most common PFAS, as hazardous substances under the Comprehensive Environmental Response, Compensation, and Liability Act, or CERCLA, better known as Superfund. The move would be a crucial step in tackling PFAS contamination.\n\nIn their letter to EPA Administrator Michael Regan, the House lawmakers say they recognize the Biden administration’s accelerated efforts across the federal government to tackle PFAS. But they also emphasize the need for additional agency action.\n\n“We are grateful for your commitment and efforts to address the PFAS crisis in the United States. As more and more communities nationwide discover PFAS contamination, the greater the need grows for federal action,” says the letter to Regan, which is signed by Rep. Debbie Dingell (D-Mich.), House Energy and Commerce Committee Chairman Frank Pallone (D-N.J.), the energy committee’s Environment and Climate Change Subcommittee Chairman Paul Tonko (D-N.Y.) and dozens of other lawmakers.\n\n“We urge you and the administration to follow through on your commitment by designating the two most harmful ‘forever chemicals’ – PFOA and PFOS – as the hazardous substances we know they are as expeditiously as possible,” the letter says.\n\nDesignating a substance hazardous under CERCLA does not ban its use, and many such chemicals remain on the market and are widely used in commercial products.\n\nThe designation would be an important step toward helping hold polluters accountable, encouraging more responsible stewardship of these chemicals, and cleaning up contaminated sites.\n\n“We applaud Rep. Dingell and Chairs Pallone and Tonko for making PFAS a priority and urging the EPA to move swiftly on this designation. PFAS are forever and everywhere; as more communities nationwide identify PFAS pollution, this designation will help them to ensure their communities get cleaned up and polluters are held accountable,” said Jay Lucey, EWG legislative director.\n\nEWG estimates that more than 200 million Americans could be drinking tap water contaminated with PFAS. PFAS have been linked to serious health concerns, including cancer, harm to fetal development and reduced vaccine effectiveness.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2022/08/ewg-applauds-congressional-letter-urging-epa-designate-pfas", "title": "EWG applauds congressional letter urging EPA to designate PFAS hazardous substances", "description": "The Environmental Working Group applauds the 127 House of Representatives members who sent a letter today urging the Environmental Protection Agency to designate two PFAS “forever chemicals” as hazardous substances.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/DrinkingWaterShare_4.jpg?h=ec041e41&itok=WSK5q7ZU"}, "tags": [], "tweets": [], "movies": [], "links": ["https://debbiedingell.house.gov/uploadedfiles/220803_117_q_potus_pfas_cercla_designation_final.pdf", "https://www.ewg.org/pfaschemicals/", "https://www.ewg.org/news-insights/news/2022/06/fact-versus-fiction-forever-chemicals-hazardous-substance-designation", "https://www.ewg.org/news-insights/news-release/study-more-200-million-americans-could-have-toxic-pfas-their-drinking", "https://www.ewg.org/news-insights/news-release/california-list-notorious-forever-chemical-cause-cancer-people", "https://www.ewg.org/news-insights/news/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1020459"], "authors": [], "publish_date": "August 3, 2022"}