{"result_id": "108021", "URL": "https://www.ewg.org/news-insights/news/ewg-news-roundup-1218-biden-announces-top-environmental-and-energy-nominees", "timestamp": "2023-04-25 15:02:51 CEST+0200", "meta": {"description": "EWG News Roundup (12/18): Here's some news you can use going into the weekend.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/ewg-news-roundup-1218-biden-announces-top-environmental-and-energy-nominees", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG News Roundup (12/18): Biden Announces Top Environmental and Energy Nominees, Winter Healthy Skin Tips and More", "cleaned_text": "On Thursday, the New York Times reported that President-elect Biden will nominate Michael Regan, secretary of the North Carolina Department of Environmental Quality, as administrator of the Environmental Protection Agency.\n\n“There is no other agency that has seen its mission undermined more during the Trump administration than the EPA,” said EWG President Ken Cook. “Michael’s experience at the state and federal levels, and his deep commitment to public health, are exactly what is required to rebuild the agency, its reputation and its critical mission to ensure clean air and safe drinking water, protect Americans from toxic chemicals and combat the climate crisis.”\n\nOne huge opportunity, and challenge, facing the incoming Biden administration is to designate the two most notorious PFAS chemicals – PFOA, formerly used to make DuPont’s Teflon, and PFOS, once the key ingredient in 3M’s Scotchgard – as hazardous substances under the EPA’s federal Superfund law.\n\nEarlier in the week, Biden announced he would be nominating former Michigan Gov. Jennifer Granholm to lead the Department of Energy.\n\n“We applaud President-elect Biden for his choice of Gov. Granholm to be the next secretary of energy,” said Ken Cook. “Biden campaigned on a renewed investment by the federal government in clean, carbon-free sources of energy to power homes, buildings and transportation, and now it falls on Granholm to turn those pledges into policy. If confirmed, she will play a central role in advancing the federal government’s role in the rapid transition to renewables, which will save lives, create jobs and combat the climate crisis.”\n\nRecently, regulators in Minnesota refused to hear arguments from citizens to hold potato giant R.G. Offutt accountable for decades of harm and pollution they’ve waged on the environmentally sensitive Pineland Sands land. Despite not hearing from members of the community, the regulators welcomed arguments from a fringe Minnesota lawmaker who believes “water cleans itself.”\n\nAnd finally, EWG has provided some helpful tips on keeping your skin healthy during this chilly winter.\n\nHere’s some news you can use going into the weekend.\n\nUPI: Experts: Prioritize COVID-19 vaccine for those with high exposure to PFAS chemicals\n\nPeople with higher levels of toxic, manmade chemicals in their bloodstream should be given priority for a COVID-19 vaccine, scientists who represent the Environmental Working Group said Thursday.\n\nThe Washington Post: The Energy 202: The campaign heats up for Biden to pick a Native American for his Cabinet\n\nThe Environmental Working Group, an advocacy organization, publicized a Nov. 6 letter in which CDC Director Robert Redfield said the agency was studying the association between PFAS levels and antibody response to the virus.\n\n\"It's really hard to tell people now to not have takeout food,\" Burnbaum said during a Zoom press conference Thursday with the nonprofit Environmental Working Group. \"We do know that people who eat more fast food have higher levels of PFAS in their bodies.\"\n\nBirnbaum and Jamie DeWitt, a pharmacology and toxicology professor at East Carolina University’s Brody School of Medicine, spoke Thursday on a call with reporters hosted by the Environmental Working Group (EWG), which advocates for stronger PFAS regulations.\n\nThe scientists spoke during a press briefing by the Environmental Working Group, an environmental nonprofit that researches drinking water pollution and toxic chemicals.\n\nNC Policy Watch: COVID-19 vaccine could be less effective in people with high PFAS levels in blood\n\nThe scientists on the press call, hosted by the Environmental Working Group, emphasized people should still get the vaccine, currently given in two doses. After those doses, people can be tested to determine their level of antibodies; if those levels are low, a third booster could be necessary, Birnbaum said.\n\nWhile research has shown PFAS to produce decreased immune response for other vaccines, little is known about how the chemicals affect COVID-19 vaccines, and that justifies more study, said Tasha Stoiber, senior scientist at Environmental Working Group, a national nonprofit that advocates for national PFAS regulation.\n\nMilitary Times: Toxic chemical exposure can increase risk for COVID-19 complications — and adverse reactions to vaccine\n\nToxic “forever chemicals” found in the drinking water on many military bases are known to cause immune system issues and, according to the Environmental Working Group, could be a concern for service members and their dependents when it comes to both the risks of contracting the novel coronavirus and getting the vaccine to prevent it.\n\nSpeakers on a Zoom conference put on by the Environmental Working Group stopped short of saying definitively that PFAS exposure increases the risk or susceptibility to COVID. But there was some evidence, with animal experiments as well as some early observations, suggesting that could be the case.\n\nWSHU (Fairfield, Conn.): Advocates to CDC: Study Link Between PFAS and Covid-19 Severity\n\nAdvocates at the Environmental Working Group (EWG) want more studies that explore how PFAS exposure may affect COVID-19 severity and vaccine efficacy. Toxicoligists say they are concerned about communities with high traces of so-called forever chemicals in drinking water, because residents may get sicker with Coronavirus and may respond less to the COVID-19 vaccine.\n\nBirnbaum says PFAS chemicals cause a number of adverse health effects, including on the thyroid and pancreas. They can be toxic to the liver and the kidneys, are linked to kidney and testicular cancer and impact the immune system, among other effects. Dr. Tasha Stoiber is senior scientist with the Environmental Working Group.\n\n“The days of dirty fossil fuels and exorbitantly expensive nuclear reactors as the nation’s primary energy are in the rearview mirror,” said Ken Cook, president of the Environmental Working Group, a Washington-based advocacy group.\n\nThe selection of Michael Regan, now secretary of the N.C. Department of Environmental Quality, “shows Biden’s commitment to rebuild EPA, protect public health and advance environmental justice,” the national Environmental Working Group said in a statement.\n\nThe Fayetteville Observer (N.C.): Here's what a Biden administration could mean for the fight against GenX and other PFAS\n\nScott Faber, senior vice president for government affairs at the Environmental Working Group, said he’s optimistic about how the Biden administration will deal with the chemicals. The group is a nonprofit organization based in Washington.\n\nNew Hampshire Union Leader: Letter: Lawmakers must take action on PFAS to protect NH\n\nTo address the PFAS crisis, I urge Reps. Chris Pappas and Annie Kuster, along with Sens. Maggie Hassen and Jeanne Shaheen to work aggressively with advocacy groups like the Environmental Working Group (EWG) and the Biden administration to stringently regulate the amount of PFAS discharged into the environment, end non-essential uses of PFAS, limit new PFAS compounds, and clean-up polluted communities.\n\n“It’s too early to know exactly how Vilsack’s overweening boosterism for commodity crop agriculture will deflect and undercut meaningful efforts to confront agriculture’s contribution to global warming,” Ken Cook, president of the Environmental Working Group, told Sierra.\n\n\"For four years, this administration has waged war on public health by kowtowing to polluters\", said EWG President Ken Cook.\n\nU.S. PIRG: Gift Guide: How to avoid toxics in beauty products\n\nAs a result, we’ve seen evidence of asbestos contaminating talc products that have made it into stores. In 2018, our lab testing found asbestos in Claire’s makeup, a brand marketed to children, prompting the FDA to confirm our results. This year, our partners at the EWG found asbestos in more makeup. The evidence is clear: talc isn’t worth the risk of asbestos contamination.\n\nHealth Thoroughfare: Is There Asbestos in Food Items at the Supermarket? Find Out Here…\n\nThe Environmental Working Group have actually estimated that around 1,200 people a year die from gastrointestinal cancer due to asbestos exposure.\n\nThe Kansas City Star (Mo.): While Missouri farmers fight plan for 10,000 hogs as neighbors, state sides with big ag\n\nJust to the North, the number of CAFOs in Iowa has increased fivefold in the last three decades, according to the Environmental Working Group.\n\nNBC LX: Makeup Companies Don't Have to Prove Their Products Are Safe — California Wants to Change That\n\nSusan Little, EWG senior advocate for California Government Affairs, was interviewed about the new California Toxic-Free Cosmetics Act for a new NBC platform called Lx, which targets a younger demographic and streams on its new Peacock service/apps.\n\nNatural News: Chemical reaction between pipe alloy and water disinfectants produce cancer-causing chromium in drinking water\n\nIn a 2016 report by the Environmental Working Group (EWG), a nonprofit research organization based in Washington D.C., more than 200 million Americans are estimated to be drinking tap water that contains dangerous levels of chromium-6.\n\nBob Vila: The Best Soap Scum Removers for the Bathroom\n\nThe best soap scum remover may also be certified by the USDA and the EPA. You can also check out the Environmental Working Group (EWG)’s Guide to Healthy Cleaning for product toxicity and ratings.\n\nGoop: The Greatest Last-Minute Gifts of All Time\n\nGOOP includes EWG at the very bottom under the section “For Others.” The EWG blurb links back to the GOOP podcast episode “Why Are There Still Toxic Ingredients in Beauty Products,” with Nneka Leiba, EWG VP of Healthy Living Science.\n\nTry looking them up on EWG or the FTC for guidelines and informed ratings. It’s up to us to look beyond the cheesy leaf illustrations and green sheen.\n\nTown & Country: The Best Organic Makeup Brands For Clean Beauty Obsessives\n\nOrganically farmed, naturally derived, and minimally processed ingredients have earned Vapour Beauty “Champion Safety Status” from the Environmental Working Group (EWG), but their products speak for themselves.\n\nBustle: The Best Grapeseed Oils For Hair\n\n\"My hair is so soft after using this conditioner and shampoo combo. Flyaways seem to be reduced and the smell is wonderful. I typically wash my hair every third day and my hair is not greasy using this product. For the price and being EWG certified, I will be using this for as long as it’s available.\"\n\nThat amount is substantial: according to the Environmental Working Group’s compilation of Department of Agriculture data, for example, the federal government has provided approximately $424.4 billion in current‐​dollar subsidies—crop insurance, commodity payments, conservation payments, and disaster payments—to U.S. farms since 1995 (the 2020 data are incomplete)…\n\nEasy Health Options: How Your Home Hampers Your Ability to Fight off Disease and Infection\n\nThe Environmental Working Group is an excellent source if you want to learn more about what products you should and shouldn’t bring into your home to lessen its toxic load.\n\nEnsia: From Alaska To Florida, Harmful PFAS Compounds Pollute Water at Multiple Sites in Every State\n\n“PFAS really seem to interact with the full range of biological functions in our body,” says David Andrews, a senior scientist with the nonprofit Environmental Working Group (EWG, a collaborator on this reporting project). “Even at the levels that the average person has in this country, these chemicals are likely having an impact.”\n\nDavid Andrews, senior scientist at the Environmental Working Group, which has long campaigned against the chemicals, said the new short-chain PFAS are \"slightly less toxic\" than the legacy compounds.\n\nThe industry has largely traded on those concerns to create today’s $50 billion organic market: The Environmental Working Group’s popular Dirty Dozen shoppers’ guides emphasize the potential dangers of pesticide residue for consumers (without mentioning the crops with the highest environmental impact), and a 2018 OTA ad campaign shared a long list of chemicals banned in organic.\n\nThe non-profit Environmental Working Group (EWG) suggests only buying organic for their so-called “dirty dozen” list of common produce items that do tend to harbor larger amounts of chemicals: strawberries, spinach, nectarines, apples, peaches, pears, cherries, grapes, celery, tomatoes, sweet bell peppers and potatoes.\n\nMSN: 50 ways to save money at the grocery store\n\nThe Environmental Working Group has a list that outlines conventionally farmed fruits and vegetables that you don't have to buy organic.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/ewg-news-roundup-1218-biden-announces-top-environmental-and-energy-nominees", "title": "EWG News Roundup (12/18): Biden Announces Top Environmental and Energy Nominees, Winter Healthy Skin Tips and More", "description": "EWG News Roundup (12/18): Here's some news you can use going into the weekend.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/News%20Roundup%20Share%20Image_176.jpg?h=ec041e41&itok=V8-P-MH7"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2020/12/17/climate/michael-regan-epa.html", "https://www.ewg.org/release/nomination-michael-regan-shows-biden-s-commitment-rebuild-epa-protect-public-health-and", "https://www.ewg.org/news-and-analysis/2020/12/biden-must-keep-pledge-designate-forever-chemicals-hazardous-substances", "https://www.ewg.org/news-and-analysis/2019/07/it-s-time-designate-pfas-hazardous-substance#:~:text=That's%20why%20it's%20so%20important,can%20stay%20there%20for%20decades.", "https://www.ewg.org/energy/release/23440/biden-s-choice-granholm-energy-secretary-heralds-shift-clean-renewable-sources", "https://www.ewg.org/news-and-analysis/2020/12/minnesota-legislator-who-believes-water-cleans-itself-defends-potato-giant", "https://www.ewg.org/news-and-analysis/2020/12/protecting-your-skin-winter-weather", "https://www.upi.com/Health_News/2020/12/17/Experts-Prioritize-COVID-19-vaccine-for-those-with-high-exposure-to-PFAS-chemicals/6161608220952/?ur3=1", "https://www.washingtonpost.com/politics/2020/12/14/energy-202-campaign-heats-up-biden-pick-native-american-his-cabinet/", "https://www.floridatoday.com/story/news/2020/12/17/pfas-forever-chemicals-could-render-covid-19-vaccines-less-effective/3937380001/", "https://www.mlive.com/public-interest/2020/12/pfas-exposure-may-reduce-covid-19-vaccine-potency-experts-warn.html", "https://www.newsobserver.com/news/coronavirus/article247915835.html", "http://pulse.ncpolicywatch.org/2020/12/17/covid-19-vaccine-could-be-less-effective-in-people-with-high-pfas-levels-in-blood/", "https://www.njspotlight.com/2020/12/covid-19-pfas-epa-vaccine-efficacy-study-environmentalists/", "https://www.militarytimes.com/news/your-military/2020/12/17/toxic-chemical-exposure-can-increase-risk-for-covid-19-complications-and-adverse-reactions-to-the-vaccine/", "https://www.timesunion.com/news/article/Activists-worry-that-PFAS-exposure-could-15812200.php", "https://www.wshu.org/post/advocates-cdc-study-link-between-pfas-and-covid-19-severity#stream/0", "https://www.wamc.org/post/scientists-consider-pfas-covid-19-and-vaccine-efficacy", "https://apnews.com/article/joe-biden-technology-climate-climate-change-michigan-cb1809c943dd6e8c0dcc6759415772a9", "https://www.northcarolinahealthnews.org/2020/12/18/biden-chooses-n-c-environmental-chief-to-head-epa/", "https://www.fayobserver.com/story/news/2020/12/17/environmental-advocates-take-optimistic-view-biden-stance-pfas/3795721001/", "https://www.unionleader.com/opinion/letters_to_editor/letter-lawmakers-must-take-action-on-pfas-to-protect-nh/article_009a77b4-6ac6-53c8-928e-196936e2ea2d.html", "https://www.sierraclub.org/sierra/tom-vilsack-for-agriculture-secretary-worries-environmentalists", "https://newburghgazette.com/2020/12/11/american-petroleum-institute-backs-epa-decision-to-maintain/", "https://uspirg.org/blogs/blog/usf/gift-guide-how-avoid-toxics-beauty-products", "https://www.healththoroughfare.com/news/is-there-asbestos-in-food-items-at-the-supermarket-find-out-here/28125", "https://www.kansascity.com/news/politics-government/article247739430.html", "https://www.lx.com/politics/makeup-companies-dont-have-to-prove-their-products-are-safe-california-wants-to-change-that/26722/", "https://www.naturalnews.com/2020-12-13-pipe-alloy-water-disinfectants-produce-chromium.html", "https://www.bobvila.com/articles/best-soap-scum-remover/", "https://goop.com/style/gift-guides/best-last-minute-gifts/", "https://poosh.com/how-to-spot-greenwashing/", "https://www.townandcountrymag.com/style/beauty-products/g34979842/best-natural-organic-makeup-brands/", "https://www.bustle.com/style/best-grapeseed-oils-for-hair", "https://www.cato.org/publications/commentary/examining-americas-farm-subsidy-problem", "https://easyhealthoptions.com/how-your-home-hampers-your-ability-to-fight-off-disease-and-infection/", "https://ensia.com/features/drinking-water-contamination-pfas-health/", "https://www.startribune.com/investigation-targets-discharges-of-next-generation-forever-chemicals-from-3m-s-cottage-grove-plant/573421701/", "https://civileats.com/2020/12/15/can-organic-farming-solve-the-climate-crisis/", "https://emagazine.com/which-foods-are-worth-organic/", "https://www.msn.com/en-us/money/other/50-ways-to-save-money-at-the-grocery-store/ss-BB1bUFtU#image=29"], "authors": [], "publish_date": "December 18, 2020"}