{"result_id": "108032", "URL": "https://www.ewg.org/news-insights/news-release/2022/11/california-sues-manufacturers-3m-and-dupont-over-toxic-forever", "timestamp": "2023-04-25 15:02:58 CEST+0200", "meta": {"description": "On November 10, California Attorney General Rob Bonta filed a lawsuit against chemical companies like 3M and DuPont for endangering public health and harming and destroying the state’s natural resources with the toxic “forever chemicals” known as PFAS.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2022/11/california-sues-manufacturers-3m-and-dupont-over-toxic-forever", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "California sues manufacturers like 3M and DuPont over toxic ‘forever chemicals’", "cleaned_text": "SACRAMENTO – On November 10, California Attorney General Rob Bonta filed a lawsuit against chemical companies like 3M and DuPont for endangering public health, and harming and destroying the state’s natural resources with the toxic “forever chemicals” known as PFAS.\n\nIn the lawsuit, Bonta alleges manufacturers knew PFAS were toxic yet continued to produce them while hiding their risks from the public.\n\n“Toxic PFAS contaminate California’s water, food, soil and air,” said Bill Allayaud, California director of government affairs for the Environmental Working Group. “Forever chemicals are used in countless consumer products – from personal care to textiles to food packaging.”\n\n“PFAS polluters must pay for contaminating our state and our bodies with these insidious chemicals,” he added.\n\nStates and consumers have sought remedy from the courts as they’ve grown more aware of the staggering costs of treating water for PFAS contamination and the many health harms linked to these toxic compounds.\n\nThe California suit seeks damages from 18 companies and asks them to pay for treatment of drinking water and wastewater systems for PFAS statewide. It also seeks funds for environmental tests for PFAS, medical monitoring, and safe disposal and destruction of the chemicals.\n\nPFAS have been detected in public water systems serving more than 16 million Californians.\n\nSeparately, the attorneys general of 15 other states have each sued companies allegedly responsible for PFAS contamination, seeking damages for the harm caused by the pollution. Minnesota settled with 3M for $850 million in 2018. Delaware also reached a settlement.\n\nMeanwhile, more than 6,400 PFAS-related lawsuits were filed in federal court between July 2005 and March 2022.\n\n“PFAS contamination is a national crisis,” said Melanie Benesh, EWG’s vice president of government affairs. “The scale of contamination is stunning – the more we test, the more we find.”\n\n“It’s manufacturers like 3M and DuPont that have gotten us here today. They’ve known for 70 years that they were poisoning the water and didn’t tell the EPA. They didn’t tell anyone, because they were making too much money,\" she added.\n\nIn the absence of enforceable federal standards, California has been hard-hitting in its efforts to regulate PFAS.\n\nIn 2019, the California Office of Environmental Health Hazard Assessment, or OEHHA, proposed bold limits to regulate PFAS in drinking water. The state’s Public Health Goals submitted for public review, would limit the amounts in drinking water for the two most notorious PFAS compounds: PFOA, formerly used to make DuPont’s Teflon, and PFOS, formerly an ingredient in 3M’s Scotchgard.\n\nState environmental health officials recommend a health-protective limit of 7 parts per quadrillion for PFOA, and 1 part per trillion, or ppt, for PFOS.\n\nCalifornia also has recently addressed the PFAS problem with strong new laws. In 2020, it was the first state to ban 13 PFAS from personal care products. That year, it also banned the use of PFAS in most applications of firefighting foam. Last year, Gov. Gavin Newsom signed into law a landmark bill banning the use of PFAS in children’s products, as well as a ban on these chemicals in food packaging.\n\nIn September, Newsom signed a law prohibiting the sale in California of personal care products like cosmetics containing intentionally added PFAS.\n\n“California has repeatedly stood up for public health and for safeguarding its residents from further unnecessary exposure to toxic PFAS,” said Allayaud.\n\n“We applaud Attorney General Bonta for filing suit against these polluters. California has the fifth biggest economy in the world and the largest population of any state, and the attorney general is acting to protect our people, our economy and our environment,” he said.\n\nPFAS are called “forever chemicals” because they do not break down in the environment and they build up in our blood and organs. They are among the most persistent toxic compounds in existence.\n\nAccording to the Centers for Disease Control and Prevention, fluorinated chemicals contaminate the bodies of nearly all Americans. Very low doses of PFAS in drinking water have been linked to an array of serious health harms. Some PFAS have been linked to a higher risk of harm to the immune system, such as reduced vaccine efficacy; harm to development and the reproductive system, such as reduced birth weight and impacts on fertility; increased risk of certain cancers, like breast cancer; and effects on metabolism, such as changes in cholesterol and weight gain.\n\nIn June, the EPA proposed new lifetime health advisories for four PFAS compounds in water.\n\nThe Environmental Working Group (EWG) is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2022/11/california-sues-manufacturers-3m-and-dupont-over-toxic-forever", "title": "California sues manufacturers like 3M and DuPont over toxic ‘forever chemicals’", "description": "On November 10, California Attorney General Rob Bonta filed a lawsuit against chemical companies like 3M and DuPont for endangering public health and harming and destroying the state’s natural resources with the toxic “forever chemicals” known as PFAS.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2021-02/Stocksy_girl_drinking_water.jpg?h=4052ea32&itok=HlKCEAdF"}, "tags": [], "tweets": [], "movies": [], "links": ["https://oag.ca.gov/system/files/attachments/press-docs/11.10.22%20PFAS%20Complaint.Final_.pdf", "https://www.ewg.org/areas-focus/toxic-chemicals/pfas-chemicals", "https://www.ewg.org/research/decades-polluters-knew-pfas-chemicals-were-dangerous-hid-risks-public", "https://www.ewg.org/news-insights/our-experts/bill-allayaud", "https://www.ewg.org/interactive-maps/pfas_contamination/map/", "https://news.bloomberglaw.com/pfas-project/companies-face-billions-in-damages-as-pfas-lawsuits-flood-courts", "https://www.ewg.org/news-insights/our-experts/melanie-benesh", "https://static.ewg.org/reports/2019/pfa-timeline/3M-DuPont-Timeline_sm.pdf", "https://oehha.ca.gov/media/downloads/crnr/pfoapfosphgdraft061021.pdf", "https://oehha.ca.gov/water/crnr/announcement-availability-draft-technical-support-document-and-public-workshop-proposed", "https://www.ewg.org/news-insights/news-release/california-first-state-ban-24-toxic-chemicals-personal-care-products-and", "https://www.ewg.org/news-insights/news-release/2020/09/california-law-bans-toxic-pfas-firefighting-foam", "https://www.ewg.org/news-insights/news-release/2021/10/landmark-california-law-bans-forever-chemicals-products-infants", "https://www.ewg.org/news-insights/news-release/2021/10/california-bans-toxic-forever-chemicals-food-packaging-and-paper", "https://www.ewg.org/news-insights/news-release/2022/09/newsom-signs-law-banning-toxic-forever-chemicals-cosmetics", "https://www.cdc.gov/exposurereport/index.html", "https://nap.nationalacademies.org/catalog/26156/guidance-on-pfas-exposure-testing-and-clinical-follow-up", "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/sites/default/files/u352/EWG_PFAS_Toxicity_C02.pdf?_ga=2.261156366.226128373.1596463302-1166909982.1546543464&_gac=1.186103003.1594309408.Cj0KCQjwgJv4BRCrARIsAB17JI76ePJXlJNzc67zHlqjxFXY10Ntg92CSH4GngKg_gjy_vA8DJtkkCgaAuCPEALw_wcB&_gl=1*gat5nn*_gcl_aw*R0NMLjE1OTQzMDk0MDguQ2owS0NRandnSnY0QlJDckFSSXNBQjE3Skk3NmVQSlhsSk56YzY3ekhscWp4RlhZMTBOdGc5MkNTSDRHbmdLZ19nanlfdkE4REp0a2tDZ2FBdUNQRUFMd193Y0I.", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-insights/news-release/2022/06/epa-toxic-forever-chemicals-levels-drinking-water-should-be-much"], "authors": [], "publish_date": "November 15, 2022"}