{"result_id": "108009", "URL": "https://www.ewg.org/news-insights/news-release/2021/08/fda-fails-ban-forever-chemicals-food-containers-despite-known", "timestamp": "2023-04-25 15:02:43 CEST+0200", "meta": {"description": "The Food and Drug Administration is again failing to protect consumers from the toxic “forever chemicals” known as PFAS. Despite evidence that PFAS from these containers can contaminate the food in them, the FDA is reminding food packaging makers against unauthorized use of the substances, instead of banning them.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2021/08/fda-fails-ban-forever-chemicals-food-containers-despite-known", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "FDA fails to ban ‘forever chemicals’ from food containers, despite known health risks", "cleaned_text": "WASHINGTON – The Food and Drug Administration is again failing to protect consumers from the toxic “forever chemicals” known as PFAS. Despite evidence that PFAS from these containers can contaminate the food in them, the FDA is merely reminding food packaging makers against unauthorized use of the substances, instead of banning them.\n\nThe FDA today sent a public letter to food packaging manufacturers and users explaining when companies can use fluorine gas to create plastic containers. The letter fails even to promise enforcement action for unauthorized uses of prohibited chemicals. Fluorine gas can produce PFAS when it is applied to plastic containers. The PFAS then can leach into food, posing health risks.\n\nPFAS are a large group of chemicals that cause increased risk of cancer, harm to fetal development and reduced vaccine effectiveness. They are known as “forever chemicals” because they do not break down in the environment and they build up in our blood and organs. Fluorine is a chemical that indicates the presence of PFAS.\n\n“Our food should not contain toxic forever chemicals,” said David Andrews, an EWG senior scientist. “Once again, the FDA has put the needs of the chemical and food companies ahead of the needs of the public.”\n\nThe FDA approved the use of fluorinated food containers in 1983, but there is no evidence the agency has reviewed either the safety of these containers or studies measuring the amount of PFAS from these containers that may contaminate food.\n\nEnvironmental Protection Agency tests of similar containers used for storing pesticides found significant PFAS migration from the containers.\n\nBetween 2002 and 2016, the FDA approved 19 PFAS for use in food packaging. Collaborating with the EPA, non-governmental organizations and academic colleagues, EWG found nearly half of fast food wrappers collected in 2014 and 2015 had detectable levels of PFAS.\n\nIn 2020, the FDA announced that manufacturers of 15 different approved types of food packaging made using PFAS would phase out all ongoing uses. But the FDA has not yet banned all PFAS from food packaging.\n\nMore than a dozen states have adopted policies or regulations limiting the use of PFAS in food packaging and many more are considering taking similar steps. California is considering legislation to ban PFAS from plant-based food packaging\n\nIn June, EWG and others petitioned the FDA to end all uses of PFAS in food packaging.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2021/08/fda-fails-ban-forever-chemicals-food-containers-despite-known", "title": "FDA fails to ban ‘forever chemicals’ from food containers, despite known health risks", "description": "The Food and Drug Administration is again failing to protect consumers from the toxic “forever chemicals” known as PFAS. Despite evidence that PFAS from these containers can contaminate the food in them, the FDA is reminding food packaging makers against unauthorized use of the substances, instead of banning them.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/blog/PFASKidBlog_0.jpg?h=57ac3c9e&itok=lj3yZWk1"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://www.fda.gov/food/cfsan-constituent-updates/fda-issues-letter-industry-fluorinated-polyethylene-food-contact-containers", "https://www.ewg.org/release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfCFR/CFRSearch.cfm?fr=177.1615", "https://www.epa.gov/newsreleases/epa-releases-testing-data-showing-pfas-contamination-fluorinated-containers", "http://blogs.edf.org/health/files/2018/05/EDF-PFAS-FDA-FCN-Environmental-Assessments-Full-5-17-18.pdf", "https://pubs.acs.org/doi/10.1021/acs.estlett.6b00435", "https://www.fda.gov/food/cfsan-constituent-updates/fda-announces-voluntary-phase-out-industry-certain-pfas-used-food-packaging", "https://www.saferstates.com/toxic-chemicals/food-packaging/", "https://www.ewg.org/news-insights/news-release/calif-bill-would-ban-toxic-forever-chemicals-food-packaging", "http://blogs.edf.org/health/files/2021/06/PFAS-Petition-to-FDA-FINAL-6-1-21.pdf", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1020459"], "authors": [], "publish_date": "August 5, 2021"}