{"result_id": "108045", "URL": "https://www.ewg.org/research/covid-stimulus/atlas-pfas.html", "timestamp": "2023-04-25 15:03:08 CEST+0200", "meta": {"description": "PFAS, also known as per- and polyfluorinated substances, are a family of more than 3,000 chemicals used in hundreds of products, from nonstick pans to firefighting foam. Even at low levels, exposure to some of these chemicals may result in serious health effects, including cancer, endocrine disruption and liver damage.", "lang": "en", "keywords": "", "favicon": "https://static.ewg.org/img/favicons/android-icon-192x192.png", "canonical": "https://www.ewg.org/research/covid-stimulus/atlas-pfas.html", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG Tap Water Atlas: Perfluorinated Chemicals (PFAS)", "cleaned_text": "PFAS, also known as per- and polyfluorinated substances, are a family of more than 3,000 chemicals used in hundreds of products, from nonstick pans to firefighting foam. Even at low levels, exposure to some of these chemicals may result in serious health effects, including cancer, endocrine disruption and liver damage.\n\nWe do not know the extent of PFAS contamination of U.S. tap water, because the EPA does not require utilities to test water for it. Utilities that voluntarily test for PFAS chemicals are not required to report results to either the EPA or consumers. EWG estimates that up to 110 million Americans in at least 34 states could be drinking PFAS-contaminated water and that most if not all of the nation’s major water supplies are contaminated. PFAS chemicals do not readily break down in the environment, and they accumulate in people. Significant sources of PFAS pollution include military base firefighting training sites, airports, and industrial plants and dumps.\n\nThere is no federal legal limit for PFAS in tap water. EWG’s health guideline for the two most concerning chemicals in the class, PFAS and PFOA, is 0.001 parts per billion, or 1 part per trillion. This is based on research by Philippe Grandjean, Ph.D. and Esben Budtz-Jørgensen, Ph.D. Their study found decreased vaccine response in children that correlated with their body burden levels of PFOA and PFOS. The authors used these epidemiological data to recommend a limit of 1 ppt in water for PFOA or PFOS.\n\nThe most effective utility-level options for removing PFAS from tap water depend on the specific types of PFAS present, their concentrations and the presence of other contaminants. Reverse osmosis is the most effective but also the most expensive. Granular activated carbon and ion exchange can also be used in certain cases. For home water filtration, both reverse osmosis and activated carbon filters can reduce or eliminate PFOA and some other, though perhaps not all, PFAS contaminants.", "opengraph": {"title": "EWG Tap Water Atlas: Perfluorinated Chemicals (PFAS)", "description": "PFAS, also known as per- and polyfluorinated substances, are a family of more than 3,000 chemicals used in hundreds of products, from nonstick pans to firefighting foam. Even at low levels, exposure to some of these chemicals may result in serious health effects, including cancer, endocrine disruption and liver damage.", "image": "https://static.ewg.org/reports/2020/covid-stimulus/img/EWG_Social_Share_COVIDMapAtlas_C01.jpg", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/tapwater/reviewed-pfcs.php", "https://www.ewg.org/research/report-110-million-americans-could-have-pfas-contaminated-drinking-water", "https://www.ewg.org/research/national-pfas-testing/", "https://www.ewg.org/research/ewg-proposes-pfas-standards-fully-protect-children-s-health", "https://ehjournal.biomedcentral.com/articles/10.1186/1476-069X-12-35", "https://www.ewg.org/interactive-maps/2019_pfas_contamination/map/"], "authors": ["Environmental Working Group"], "publish_date": null}