{"result_id": "108023", "URL": "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review-0", "timestamp": "2023-04-25 15:02:52 CEST+0200", "meta": {"description": "Toxic PFAS chemicals, notorious for contaminating drinking water supplies across the U.S., are harmful to nearly every human organ, and the immune system is particularly vulnerable. PFAS mixtures, which are used in a variety of consumer products, can be found in the body of nearly every American and in the developing fetus.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review-0", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "PFAS Chemicals Harm the Immune System, Decrease Response to Vaccines, New EWG Review Finds", "cleaned_text": "Toxic PFAS chemicals, notorious for contaminating drinking water supplies across the U.S., are harmful to nearly every human organ, and the immune system is particularly vulnerable. PFAS mixtures, which are used in a variety of consumer products, can be found in the body of nearly every American and in the developing fetus.\n\nStudies suggest a connection between PFAS exposure and suppressed immune function, lower vaccine effectiveness, hypersensitivity and greater risk of autoimmune diseases. A recent review of human epidemiological studies by Rappazzo et al. shows that PFAS may influence antibody response to vaccination and other health issues, such as asthma.[i]\n\nA study published in October by renowned environmental health expert Philippe Grandjean, M.D., and colleagues at the Harvard T.H Chan School of Public Health found that higher levels of PFAS in the blood, specifically PFBA, were associated with increased severity of Covid-19 infections. PFBS is one of the only known PFAS to substantially accumulate in lung tissue, and this connection may be linked to the study findings.\n\nThe Centers for Disease Control and Prevention and the Agency for Toxic Substances and Disease Registry have acknowledged in a statement that PFAS exposure harms the immune system and may put certain populations at greater risk of contracting Covid-19 and greater risk of increased severity of infection.\n\nTests commissioned by Environmental Working Group, Commonweal and Rachel’s Network, in 2005 and 2009, revealed that American babies are born contaminated, via the umbilical cord, with PFAS and other toxic chemicals.[ii]\n\nIn a 2016 review of PFAS immunotoxicity, the National Toxicology Program concluded that two of the most studied members of this large family of chemicals, PFOA and PFOS, can pose “an immune hazard to humans based on a high level of evidence that PFOA (and PFOS) suppressed the antibody response from animal studies and a moderate level of evidence from studies in humans.”[iii] These studies on antibody response are some of the strongest evidence of adverse effects on the human immune system.\n\nThe link between higher blood levels of PFAS and reduced antibody production following vaccination has been observed in studies of both children and adults. Although nutrition, exercise and other factors affect immune response, PFAS also clearly plays a role. The developing immune system may be particularly vulnerable to immunotoxicity in the earliest stages of life, so it is essential to protect children’s health from PFAS during that time.\n\nA study published in 2017 reported that elevated PFAS levels during the first six months of infancy were associated with a weaker response to tetanus vaccination.[iv] In a 2013 study of 431 Danish children, PFOS and PFOA levels in blood were linked to decreased levels of antibodies against tetanus and diphtheria.[v] A drinking water guideline for PFOA and PFOS of 1 part per trillion, or ppt, would protect children from this health harm.\n\nResearch presented at a national conference on PFAS in June 2019 showed a lower response to the measles vaccination among a group of 237 West African children who had been exposed to low levels of PFAS.[vi] A 22 and 26 percent decreased antibody response was associated with a doubling of PFOS and PFDA levels in blood, respectively. Children at four and a half months in this study had levels of PFAS in their blood ranging from medians of 0.1 ng/ml, for PFHxS, to 0.68 ng/ml, for PFOA, and 0.77 ng/ml, for PFOS, demonstrating immunotoxicity even at very low levels. In 2008, EWG tested American newborns’ cord blood and found medians of 0.69 ng/ml for PFOA and 1.54 ng/ml for PFOS.[vii]\n\nPFAS immunotoxicity can also affect vaccine response later in life, as PFOA levels in adults’ blood corresponded to reduced immunity from a flu vaccine.[viii] In a small study of adults, PFAS chemicals, especially in long-chain versions, were linked to decreased response following tetanus-diphtheria boosters.[ix]\n\nChildren are especially vulnerable to asthma, an example of immune system hypersensitivity also linked to exposure to multiple PFAS chemicals. A 2013 study of Taiwanese children was one of the first to connect nine PFAS chemicals with juvenile asthma, asthma severity and immune system markers.[x] A 2019 study connected the sum of PFAS in blood, as well as PFOS and PFHxS, with asthma in a study of Norwegian adolescents.[xi] A 2016 analysis related PFOS, PFOA and PFHxS levels with significant increases in adolescent food allergies, another immune system hypersensitivity.[xii]\n\nSome studies also point to lower resistance to disease, yet another result of immune system suppression. Higher maternal levels of PFOS and PFOA during pregnancy were linked to increased fever in young children, which shows an increased risk of infections.[xiii] In another Norwegian study, prenatal PFAS exposure affected people’s ability to fight off cold and stomach infections.[xiv]\n\nEWG’s child-protective drinking water standard for PFAS chemicals of 1 ppt represents a concentration that, according to current epidemiological research, would safeguard the immune system. This standard would ensure drinking water is not at risk but would not eliminate exposure through contaminated food, food wrappers, dust and consumer products, all of which would need to have lower levels of PFAS for the immune system to be protected.\n\nIn July, a peer-reviewed study by EWG published in the journal Chemosphere concluded that PFAS disposal approaches of incineration, landfilling and wastewater treatment all further contribute to environmental contamination that can lead to exposure to PFAS from air or water. This exposure can further compromise the immune system and put people at greater risk of falling seriously ill from Covid-19.\n\nIn addition to causing immune system harm, PFAS has been linked to cancer. A peer-reviewed study by EWG and a team of scientists at Indiana University published in March in the International Journal of Environmental Health and Public Health found strong and moderate evidence that multiple PFAS chemicals exhibit several of the key characteristics of carcinogens.\n\nThe scientific research, including epidemiological studies, that shows damage to the immune system and decreased response to vital vaccines with early life PFAS exposure should strengthen the argument made to policymakers about a sweeping package of reforms to address the unfolding\n\nPresident-elect Joe Biden has pledged to make protecting the environment and the public from these “forever chemicals” a top priority in his administration, including setting enforceable limits for PFAS in drinking water and designating PFAS as hazardous substances under the Superfund cleanup law.\n\nEWG will work with the incoming Biden-Harris administration and Congress to take a series of steps to protect the public from further exposure to PFAS chemicals, including:\n• Reduce industrial emissions of PFAS in the air and water.\n• Designate PFAS as hazardous substances under the federal Superfund law.\n• Phase out the use of PFAS in household products.\n• Place a moratorium on the approval of new PFAS.\n\nLook for information about PFAS chemicals here.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review-0", "title": "PFAS Chemicals Harm the Immune System, Decrease Response to Vaccines, New EWG Review Finds", "description": "Toxic PFAS chemicals, notorious for contaminating drinking water supplies across the U.S., are harmful to nearly every human organ, and the immune system is particularly vulnerable. PFAS mixtures, which are used in a variety of consumer products, can be found in the body of nearly every American and in the developing fetus.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/PFASImmuneShare_0.jpg?h=ec041e41&itok=TU3516wV"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/interactive-maps/2019_pfas_contamination/", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn1", "https://www.medrxiv.org/content/10.1101/2020.10.22.20217562v1.full.pdf", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn2", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn3", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn4", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn5", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn6", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn7", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn8", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn9", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn10", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn11", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn12", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn13", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg#_edn14", "https://www.ewg.org/research/ewg-proposes-pfas-standards-fully-protect-children-s-health", "https://www.sciencedirect.com/science/article/abs/pii/S0045653520318543?via%3Dihub", "https://www.mdpi.com/1660-4601/17/5/1668/htm", "https://joebiden.com/environmental-justice-plan/", "https://www.ewg.org/news-and-analysis/2020/11/how-will-biden-administration-tackle-forever-chemicals", "https://www.ewg.org/release/trump-pfas-plan-recipe-more-contamination", "https://www.ewg.org/key-issues/toxics/nonstick-chemicals"], "authors": [], "publish_date": "November 12, 2020"}