{"result_id": "108022", "URL": "https://www.ewg.org/news-insights/news-release/2023/01/ewg-urgency-lacking-epa-plan-address-forever-chemicals", "timestamp": "2023-04-25 15:02:52 CEST+0200", "meta": {"description": "Today the Environmental Protection Agency released a plan for regulating wastewater pollution, including discharges of the “forever chemicals” known as PFAS. But the plan doesn’t reflect the urgent need to tackle these discharges more quickly.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2023/01/ewg-urgency-lacking-epa-plan-address-forever-chemicals", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG: ‘Urgency’ lacking from EPA plan to address ‘forever chemicals’ discharges", "cleaned_text": "WASHINGTON – Today the Environmental Protection Agency released a plan for regulating wastewater pollution, including discharges of the “forever chemicals” known as PFAS. But the plan doesn’t reflect the urgent need to tackle these discharges more quickly.\n\nThe agency’s long-awaited plan will take years to complete, delaying much-needed restrictions on PFAS discharges into waterways. The plan, the Effluent Guidelines Program Plan 15, falls short of the EPA’s vow in its 2021 PFAS Strategic Roadmap to “get upstream” of the forever chemicals problem.\n\nThe EPA confirmed that by spring 2024 – nine months later than previously scheduled – it will release a draft regulation for manufacturers of PFAS or those that create mixtures of PFAS. The agency will do the same for metal finishers and electroplaters by the end of 2024, a delay of six months. The EPA did not announce when final rules will be available for these industries.\n\nThe agency will also begin regulating PFAS releases from landfills but did not provide a timeline for a final rule.\n\nFor all other industrial categories the EPA considered for PFAS wastewater limitation guidelines, the new plan includes more studies and monitoring, likely delaying restrictions on these sources indefinitely.\n\n“Polluters have gotten a free pass for far too long to contaminate thousands of communities. Now they need aggressive action from the EPA to stop PFAS at the source,” said Melanie Benesh, Environmental Working Group vice president of government affairs. “But the EPA’s plan lacks the urgency those communities rightfully expect.\n\n“We are deeply concerned that the EPA is punting on restrictions for PFAS polluting industries like electronics manufacturers, leather tanners, paint formulators and plastics molders,” said Benesh. “We are also alarmed that the EPA’s proposed restrictions on some of the most serious PFAS polluters – chemical manufacturers and metal finishers – are also getting delayed, with no timeline for when those limits will be final, if ever.\n\n“Although it’s a good thing the EPA is committing to address PFAS discharges from landfills – a source of pollution that disproportionately affects vulnerable communities – it’s also frustratingly unclear from EPA’s plan when, if ever, those limits will materialize.\n\n“Given the glacial pace of change in the EPA’s plan, states should not wait for the EPA to act on PFAS,” she said.\n\nIndustrial discharges of PFAS have caused significant contamination in places like the Cape Fear River Basin in North Carolina and Parkersburg, West Virginia.\n\nEWG has used EPA enforcement data to identify nearly 40,000 potential industrial dischargers.\n\nVery low doses of PFAS in drinking water have been linked to suppression of the immune system, including reduced vaccine efficacy, and an increased risk of certain cancers. PFAS are linked with increased cholesterol, reproductive and developmental problems and other health harms.\n\nSome lawmakers are also trying to force the EPA to address PFAS more quickly. The Clean Water Standards for PFAS Act, introduced by Rep. Chris Pappas (D-N.H.) and Sen. Kirsten Gillibrand (D-N.Y.) last year, would require the agency to develop PFAS wastewater limitation guidelines and water standards for PFAS in nine different industry categories by the end of 2026.\n\nThe EPA is planning to propose industry-wide regulations for certain industries, but regulators can update facility permits to address PFAS any time. The EPA released guidance for federal permit writers in April and guidance for state permit writers in December.\n\nThe Environmental Working Group (EWG) is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2023/01/ewg-urgency-lacking-epa-plan-address-forever-chemicals", "title": "EWG: ‘Urgency’ lacking from EPA plan to address ‘forever chemicals’ discharges", "description": "Today the Environmental Protection Agency released a plan for regulating wastewater pollution, including discharges of the “forever chemicals” known as PFAS. But the plan doesn’t reflect the urgent need to tackle these discharges more quickly.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/news/EPABlog_6.jpg?h=2e181f1f&itok=m99njpZq"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfas", "https://www.epa.gov/eg/current-effluent-guidelines-program-plan", "https://www.ewg.org/news-insights/our-experts/melanie-benesh", "https://www.theguardian.com/us-news/2021/apr/02/pfas-testing-forever-chemicals-pittsboro-north-carolina", "https://highline.huffingtonpost.com/articles/en/welcome-to-beautiful-parkersburg/", "https://www.ewg.org/news-insights/news-release/2021/10/ewg-study-almost-42000-sources-toxic-forever-chemicals-could-be", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.congress.gov/bill/117th-congress/senate-bill/4161/text", "https://www.epa.gov/system/files/documents/2022-04/npdes_pfas-memo.pdf", "https://www.ewg.org/news-insights/news-release/2022/12/forever-chemicals-polluters-could-soon-face-new-limits"], "authors": [], "publish_date": "January 20, 2023"}