{"result_id": "108012", "URL": "https://www.ewg.org/news-insights/news/2022/11/quibble-kibbles-forever-chemicals-pet-food-packaging-add-perils-home", "timestamp": "2023-04-25 15:02:47 CEST+0200", "meta": {"description": "The toxic “forever chemicals” known as PFAS create health hazards at home, since they’re used in everyday items like cookware and cosmetics – and new EWG research finds some popular pet food packaging can be yet another way we’re exposed to the perils of PFAS.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/2022/11/quibble-kibbles-forever-chemicals-pet-food-packaging-add-perils-home", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Quibble with Kibbles: ‘Forever chemicals’ in pet food packaging add to perils at home", "cleaned_text": "The toxic “forever chemicals” known as PFAS create health hazards at home, since they’re used in everyday items like cookware and cosmetics – and new EWG research finds some popular pet food packaging can be yet another way we’re exposed to the perils of PFAS.\n\nSeven pet food brands found at Walmart and other retailers were found to contain some PFAS. Exposure to these forever chemicals have been linked to serious health concerns for people, including cancer, harm to fetal development and reduced vaccine effectiveness.\n\nThe tests uncovered individual PFAS in some of the pet food bags: the chemicals PFBA, PFPeA, PFHxA, PFHpA, x62FTCA, x62diPAP and PFPrA.\n\nPurina Cat Chow Complete Chicken had the highest concentration of total PFAS, at 245 parts per billion, or ppb, followed by Kibbles n’ Bits Bacon and Steak flavor, with almost 15 ppb total PFAS. The other bags tested had less than 15 ppb total PFAS.\n\nPFAS are found in the blood of almost every American, and tests have revealed their presence in our beloved pets, risking their health as well. EWG’s research aimed to find out whether pet food packaging might also be a concern.\n\nIt’s almost impossible to avoid PFAS, because they’re so prevalent in almost all aspects of our daily lives. Not only do we come into contact with these chemicals through the products in which they’re used, but these items shed PFAS-laced dust that further contaminates households and can pollute air and water once disposed in the trash.\n\nJust as children ingest pollutants with tap water, play on lawns with pesticide residues and breathe in an array of indoor air contaminants, so do our pets. But with compressed life spans – many animals mature and age seven or more times faster than children – pets also develop health problems from exposure much more rapidly, EWG has previously found.\n\nTo uncover the PFAS that may hide in pet food bags, EWG commissioned an independent, certified laboratory to conduct tests for total fluorine on 11 bags of pet food from seven popular brands. Tests for total fluorine, usually stated in parts per million, or ppm, indicate the likely presence of PFAS, but they don’t show which PFAS are present.\n\nFurther tests from our new research show that the packaging of some well-known pet food brands also hava detectable levels of specific PFAS, which are typically reported in ppb. The lab tested for specific PFAS on four bags with the highest concentrations of fluorine.\n\nFor cats, one of the highest results for total fluorine came from Meow Mix Tender Centers Salmon & Chicken Flavors Dry Cat Food, notching more than 600 ppm.\n\nOf the samples, Purina Cat Chow Complete Chicken was next highest at just over 310 ppm of total fluorine. Three other cat food products – Blue Buffalo, Iams and Rachael Ray Nutrish – all had detections of under 100 ppm of total fluorine.\n\nFor dogs, Kibbles n’ Bits Bacon and Steak flavor registered just under 600 ppm of total fluorine, followed by Blue Buffalo’s Life Protection Formula Puppy Chicken and Brown Rice Recipe food, with just over 150 ppm. Other dog foods, two produced by Purina, one by Iams, and one by Pedigree, had much lower amounts of total fluorine detected.\n\nAlthough our research found the suggestion of PFAS in pet food bags, we haven’t concluded that the chemicals had migrated from the packaging to the food itself.\n\nBut other research has established the potential for PFAS in packaging to contaminate the food within, which would put families and their four-legged friends at further risk.\n\nResearch shows PFAS are present in fast food packaging, creating a further risk of exposure, given the millions of Americans who eat from these places every day. Some companies have agreed under pressure from consumers to phase out use of these chemicals.\n\nBut no top pet food manufacturers appear to have committed publicly to stop using forever chemicals in their packaging. And voluntary action will only go so far to lower the risk of pet food bags exposing people to PFAS at home.\n\nWe need strong new state and federal actions to eliminate sources of PFAS pollution. That includes preventing industrial discharges of forever chemicals, which can contaminate drinking water, and ending unnecessary uses of PFAS in pet food packaging and in products found in and around the home, including cosmetics, food and clothing.\n\nThe Biden administration has committed to several actions that will help to turn off the tap of PFAS pollution, particularly actions by the Environmental Protection Agency.\n\nNow it’s time for other agencies to step up, in particular the Food and Drug Administration. which could do more to keep forever chemicals out of food.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/2022/11/quibble-kibbles-forever-chemicals-pet-food-packaging-add-perils-home", "title": "Quibble with Kibbles: ‘Forever chemicals’ in pet food packaging add to perils at home", "description": "The toxic “forever chemicals” known as PFAS create health hazards at home, since they’re used in everyday items like cookware and cosmetics – and new EWG research finds some popular pet food packaging can be yet another way we’re exposed to the perils of PFAS.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2022-10/PetFoodPackagingShare.jpg?h=ec041e41&itok=yjWlYlwd"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfas-chemicals", "https://www.ewg.org/news-insights/news/2022/01/new-tests-find-toxic-forever-chemicals-bedding-yoga-pants-and-other", "https://www.ewg.org/news-insights/news-release/california-list-notorious-forever-chemical-cause-cancer-people", "https://www.ewg.org/news-insights/news/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-insights/news/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg-review", "https://www.consumerreports.org/toxic-chemicals-substances/i-tested-my-blood-tap-water-household-products-and-cat-for-pfas-toxic-forever-chemicals-a8299795055/", "https://pubs.acs.org/doi/10.1021/acs.estlett.9b00786", "https://www.ewg.org/research/polluted-pets", "https://www.ewg.org/news-insights/news-release/2022/03/new-tests-find-forever-chemicals-still-many-fast-food-wrappers", "https://www.ewg.org/news-insights/news-release/2022/10/ewg-updates-report-card-tracking-federal-agencies-deadlines"], "authors": [], "publish_date": "November 3, 2022"}