{"result_id": "108014", "URL": "https://www.ewg.org/news-insights/news-release/2021/11/epa-finds-pfas-are-more-toxic-previously-thought", "timestamp": "2023-04-25 15:02:48 CEST+0200", "meta": {"description": "Today, the Environmental Protection Agency announced that safe levels of exposure to PFAS – the levels at which harms might not occur – should be thousands of times lower than limits it first proposed in 2016.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2021/11/epa-finds-pfas-are-more-toxic-previously-thought", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EPA finds PFAS are more toxic than previously thought", "cleaned_text": "WASHINGTON – Today, the Environmental Protection Agency announced that safe levels of exposure to PFAS – the levels at which harms might not occur – should be thousands of times lower than limits it first proposed in 2016.\n\nThe agency sent four draft scientific documents on the two notorious “forever chemicals,” PFOA and PFOS, to its Science Advisory Board, including a finding that PFOA likely causes cancer.\n\nIn the documents, the EPA for the first time relied on studies about PFAS’ impact on human health, which show that exposure to the substances reduces vaccine efficacy. As a result, the agency has changed its position on safe levels of exposure.\n\nIn the documents, which the advisory board will review, EPA says the latest scientific data “indicate that negative health effects may occur at much lower levels of exposure to PFOA and PFOS than previously understood and that PFOA is a likely carcinogen.”\n\nFollowing the advisory board’s peer review, the new information will be used to develop enforceable drinking water limits for the two PFAS, which have contaminated water nationwide.\n\n“PFOA and PFOS are highly toxic substances that remain pervasive in the drinking water of millions of Americans,” said David Andrews, Ph.D. a senior scientist at the Environmental Working Group.\n\n“No one should have to worry about increased cancer risk, reproductive harms, or immune system harms from PFOA and PFOS in their tap water,” Andrews added. “Today’s action is an important step towards setting health protective drinking water limits for PFOA and PFOS that reflect the latest science finding harm to people.”\n\nPFOA and PFOS are two of the best-studied substances in the family of chemicals known as PFAS. PFOA, created by DuPont, was used to make Teflon, and 3M manufactured PFOS for use in Scotchgard. Both substances were used in a variety of applications for decades before being largely phased out under pressure from the EPA in 2015.\n\n“It’s long past time for the EPA to act,” said Robert Bilott, PFAS attorney and author. “Today’s announcement confirms what we have known for decades – that very low levels of PFAS can pose serious health risks, including cancer.\n\n“It’s good news that the EPA’s decisions finally seem to reflect what the agency knows and has known about the science,” Bilott added.\n\nThe EPA set non-enforceable drinking water advisory levels of 70 parts per trillion, or ppt, for the two chemicals individually or combined in 2016. EWG and other leading scientific organizations have long criticized those limits as inadequate and argued for a 1 ppt limit.\n\nEWG researchers have estimated that more than 200 million people in the U.S. are exposed to PFAS in their drinking water, creating potential health risks.\n\nThe new white papers from the EPA bolster calls from EWG and others for much stricter regulation of all PFAS. To protect the health of people, communities and the environment, PFAS should not be regulated one by one but as a class.\n\nTreating PFAS as a class and ending non-essential uses could help avoid “regrettable substitution” – replacing one toxic chemical for another that may be just as hazardous.\n\nIn October, the EPA published a toxicity assessment for the PFAS chemical GenX with a reference dose – the amount a person can ingest over a lifetime without suffering health harms – 25 times lower than stated in an earlier version of the review, from 2018.\n\nThe EPA says the updated stricter value, which aims to better protect public health, is in large part due to ongoing data gaps about the hazards of GenX.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2021/11/epa-finds-pfas-are-more-toxic-previously-thought", "title": "EPA finds PFAS are more toxic than previously thought", "description": "Today, the Environmental Protection Agency announced that safe levels of exposure to PFAS – the levels at which harms might not occur – should be thousands of times lower than limits it first proposed in 2016.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/news/EPABlog_6.jpg?h=2e181f1f&itok=m99njpZq"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.epa.gov/newsreleases/epa-advances-science-protect-public-pfoa-and-pfos-drinking-water", "https://www.ewg.org/pfaschemicals/", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://www.ewg.org/pfastimeline/", "https://www.ewg.org/news-insights/news-release/study-more-200-million-americans-could-have-toxic-pfas-their-drinking", "https://www.ewg.org/news-insights/news/forever-chemicals-must-be-regulated-class", "https://www.ewg.org/news-insights/news/new-generation-forever-chemicals-toxicity-exposure-contamination-and-regulation", "https://www.epa.gov/chemical-research/human-health-toxicity-assessments-genx-chemicals", "https://www.ewg.org/news-insights/statement/2021/10/forever-chemical-genx-more-toxic-previously-acknowledged-says-epa", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1020459"], "authors": [], "publish_date": "November 16, 2021"}