{"result_id": "108034", "URL": "https://www.ewg.org/news-insights/news/ewg-news-roundup-18-ewg-calls-president-trumps-removal-office-pfas-detected-100", "timestamp": "2023-04-25 15:03:00 CEST+0200", "meta": {"description": "EWG News Roundup (1/8): Here's some news you can use going into the weekend.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news/ewg-news-roundup-18-ewg-calls-president-trumps-removal-office-pfas-detected-100", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG News Roundup (1/8): EWG Calls for President Trump’s Removal From Office, PFAS Detected in 100 Ohio Water Systems and More", "cleaned_text": "The Wednesday assault on the U.S. Capitol by a riotous mob incited by President Trump was horrific and deadly. On Thursday, EWG President Ken Cook called for Trump’s immediate removal from office.\n\n“President Trump will not subdue the lawless domestic enemies who would test ways to overthrow or neuter our duly elected government,” said Cook. “Trump will abet those dark forces for his personal benefit. Every day he is allowed to do so with the full authority of the presidency constitutes a mortal threat to our nation, and an abdication of duty on the part of individuals sworn to protect and defend our Constitution.”\n\nEarlier in the week, the Trump Environmental Protection Agency issued an 11th-hour rule that will restrict the agency’s use of important scientific studies when considering regulatory action on pollution and toxic chemicals.\n\nNewly released data from the Ohio Environmental Protection Agency shows that more than 100 public water systems in the state are contaminated with the toxic “forever chemicals” known as PFAS.\n\n“Whenever states look for PFAS, they find contaminated water supplies,” said Scott Faber, senior vice president for government affairs at EWG. “The new test results from Ohio underscore how pervasive PFAS contamination is in drinking water throughout the country. Ohio and the U.S. EPA should act swiftly to protect the public by regulating PFAS in drinking water, protecting drinking water sources with more stringent regulations on industrial discharges of PFAS, and cleaning up contaminated sites.”\n\nAnd finally, as we ring in the new year, take a look at some helpful tips from EWG for a healthy and happy 2021.\n\nHere’s some news you can use going into the weekend.\n\nAtlanta Journal Constitution: Sonny Perdue is a rarity: A Trump cabinet member who went the distance\n\nHis critics saw it differently. “Just because children would rather eat heavily salted, processed foods at school doesn’t mean they should,” said Ken Cook of the Environmental Working Group.\n\nCleveland Clinic: Does Your Child Want to Wear Makeup? 5 Things You Should Know\n\nCheck out the Environmental Working Group’s Skin Deep® database, where you can search for items by brand name or product category, and choose products based on safety rating.\n\nAllure: Follain's Skin-Care Products With EWG Verified Marks Are Now Available at Ulta Beauty\n\nBut as more and more brands called themselves \"clean,\" and with no universally agreed-upon definition of what \"clean\" even means, she wanted to pursue the Environmental Working Group's EWG Verified mark.\n\nWomen’s Wear Daily: Follain to Help Black-owned Beauty Brands Get EWG-verified\n\nThe clean beauty retailer has achieved certification from the Environmental Working Group for its Follain Skincare products, making it the newest EWG-Verified brand at Ulta, where it is carried online and in nearly 400 doors.\n\nCommon Dreams: A Growing List of Lawmakers and Groups Support Impeaching Trump or Invoking the 25th Amendment\n\n\"By baselessly insisting, as he has in virtually every public utterance for months now, that the office of president of the United States is rightfully and lawfully his, Trump willfully infects our body politic with a seditious poison whose antidemocratic effects will linger for years…”\n\nEnvironmental groups quickly hailed the selection. The national Environmental Working Group said in a statement that it “shows Biden’s commitment to rebuild EPA, protect public health and advance environmental justice.”\n\nNew York Times: Biden’s Choice of Vilsack for U.S.D.A. Raises Fears for Small Farmers\n\n“I think he’ll fold under pressure from the ag lobby, the subsidy lobby and big agriculture,” said Ken Cook, president of Environmental Working Group, a nonpartisan organization that is critical of industrial agriculture. “I really do feel as if we needed fresh leadership there on a number of grounds.”\n\nWashington Post: Biden’s pick for agriculture is a safe, solid choice. But U.S. farm policy needs fresh thinking.\n\nBuoyed by federal aid, both for the trade war and $5 billion related to coronavirus (a fifth of which went to just 1 percent of recipients, according to the Environmental Working Group), net farm income is set to reach $120 billion in fiscal 2020.\n\nFood and Water Watch, a consumer and environmental watchdog group, said it opposes Vilsack's nomination. Ken Cook, president of the Environmental Working Group, said \"I think he'll fold under pressure from the ag lobby, the subsidy lobby and big agriculture.\" EWG is a nonpartisan organization that is critical of industrial agriculture.\n\nOfficials of the Biden-Harris administration will be legally bound by the regulation, making it a “lasting and significant challenge for the incoming administration,” says Ken Cook, president of the Environmental Working Group, an advocacy organization.\n\nEnvironmental Working Group (EWG) Senior Vice President of Government Affairs Scott Faber in a Dec. 3 written statement applauded the inclusion in the bill of provisions to bar Defense Department (DOD) purchases of some PFAS-containing items, expand PFAS research and speed development of PFAS-free firefighting foams and gear, but said the legislation “falls far short” of addressing the contamination crisis affecting service members and communities.\n\nIn a study commissioned by the Environmental Working Group in the United States and published on Nov 24 in the journal Environmental Health Insights, researchers found asbestos in 15% of 21 talc-based cosmetics samples analysed using electron microscopy.\n\n“The FDA recognizes this is a problem, but there's no required testing,” said Tasha Stoiber, Senior Scientist at the Environmental Working Group.\n\nInside EPA: Environmentalists Boost Pressure On Automakers To Pivot On GHG Rules\n\nThe statement also echoes a Dec. 1 statement from Environmental Working Group President Ken Cook specifically urging Toyota and Fiat Chrysler to drop their support of Trump’s auto GHG policies.\n\nProducts used every day in homes often contain toxins with health concerns that range from skin irritation, developmental/endocrine/reproductive effects, cancer, and damage to DNA, according to the Environmental Working Group.\n\nMSN: Getting These Stainless Steel Cleaners Will Instantly Make Your Kitchen Look Nicer\n\nBon Ami is a powder cleanser that works on a multitude of different surface materials. It's a step up from baking soda in terms of abrasiveness, but it cleans thoroughly without any harsh chemicals added — this product even has an A rating from the Environmental Working Group.\n\nVogue: Why Savannah, Georgia Could Be the Country’s New Clean Beauty Capital\n\nSwift started researching the toxic effects of conventional cosmetics and launched beautytruth.com in 2004—before the Environmental Working Group’s Skin Deep database, before Goop, before anyone, really, was talking about it.\n\nSynthetic fragrance in particular can cause a whole host of negative reactions and is high on the Environmental Working Group’s list of potential irritants.\n\nMSN: 50 ways to start over in 2021\n\nTake some time to go through your medicine cupboard and use a tool like EWG’s Skin Deep database to see if your items are safe for use.\n\nAsia One: What clean beauty looks like, according to these brands in Singapore\n\nIt is the first beauty brand from Singapore and South-east Asia to receive the “EWG Verified” mark from the world’s leading ingredient-safety police, Environmental Working Group, for two of its products.\n\nHer World: What Clean Beauty Looks Like, According To These Brands In Singapore\n\nIt is the first beauty brand from Singapore and South-east Asia to receive the “EWG Verified” mark from the world’s leading ingredient-safety police, Environmental Working Group, for two of its products.\n\nSince 1995, members of the family, including Ms. Loeffler’s father, who is now retired, and her brother Brian, who last year was named the county’s farmer of the year, have received $3.2 million in federal farm subsidies, according to data from the Environmental Working Group, a nonprofit. (Nearly a quarter of that came from money Mr. Trump used to compensate farmers for his trade war with China.)\n\nEat This, Not That!: Dangerous Side Effects of Eating Frozen Foods, According to Experts\n\nA report from health watchdog Environmental Working Group estimated that a whopping 2,000 synthetic chemicals may be used in processed foods like frozen meals, and that these chemicals don't need to be approved by the FDA.\n\nAs many as one of every six foods containing GMOs may be exempt from labeling because of USDA loopholes, says the Environmental Working Group.\n\nA recent report that found nitrate pollution in drinking water is linked to negative health repercussions, which are costing people in Wisconsin up to $80 million each year in medical expenses, reported the EWG.\n\nVery Well Health: Experts: Nitrate Water Contamination Is Now a Public Health Threat\n\nConducted by researchers affiliated with the organizations Clean Wisconsin and the Environmental Working Group, the study aimed to put a number on the healthcare costs incurred by nitrate exposure in Wisconsin between January 1, 2010, and December 31, 2017, by quantifying associated disease diagnoses and adverse birth outcomes.\n\nInside EPA: New CDC Study Slated To Assess PFAS Effects On COVID Vaccine Efficacy\n\nIn a Dec. 11 statement from the Environmental Working Group distributing Redfield’s letter, Grandjean added that people with high exposure to PFAS have “non-protective and very low antibody levels after four vaccinations for diphtheria and tetanus. “So if a vaccine for Covid is similar, the PFAS will likely inhibit the response from a vaccine. But it is an unknown at this stage.”\n\nThe Fayetteville Observer (N.C.): Could PFAS levels in blood impact effectiveness of COVID-19 vaccine?\n\nThe Environmental Working Group, a nonprofit organization in Washington, D.C., hosted an online presentation Thursday about how per- and polyfluoroalkyl substances (PFAS) are known to have toxic effects on the immune system, which can make vaccines less effective.\n\nThe Herald Sun (Durham, S.C.): Scientists warn ‘forever chemicals’ could limit effectiveness of COVID-19 vaccines\n\nThe scientists spoke during a press briefing by the Environmental Working Group, an environmental nonprofit that researches drinking water pollution and toxic chemicals.\n\nEarlier in the year, for example, an Environmental Working Group (EWG) analysis found that these chemicals are likely detectable in all major U.S. water supplies. Scientists are also worried that PFAS chemicals might hinder the effectiveness of COVID-19 vaccines.\n\nMichigan Advance: COVID-19 vaccine could be less effective in people with high PFAS levels in blood\n\nThe scientists on the press call last month, hosted by the Washington, D.C.-based Environmental Working Group, emphasized people should still get the vaccine, currently given in two doses.\n\nTasha Stoiber, senior scientist with nonprofit Environmental Working Group, suggested special pandemic consideration may be appropriate for those exposed to PFAS chemicals.\n\nLawyers and Settlements: PFAS Association With COVID – Advice Is Confusing\n\nTasha Stoiber, senior scientist with nonprofit Environmental Working Group, has advised health authorities to “consider moving those exposed to PFAS up the priority list for COVID-19 inoculation and perhaps even offer them extra vaccine booster doses to ensure adequate antibody response.”\n\nAdvocates at the Environmental Working Group want more studies of how exposure to so-called “forever chemicals” may affect COVID-19 severity and vaccine efficacy. They’re concerned about communities with high levels of PFAS, like Long Island.\n\nBut environmentalists are criticizing the strategy for failing to take tough action on PFAS, with Environmental Working Group (EWG) Senior Vice President Scott Faber calling it in a Nov. 30 statement “an insult to the millions of Americans who are drinking water contaminated with PFAS.”\n\nAmong the groups signing the letter are representatives of Breast Cancer Prevention Partners, Center for Environmental Health, Earthjustice, Environmental Working Group, Testing for Pease and many others.\n\nThe Guardian: ‘Forever chemicals’ pollute water from Alaska to Florida\n\nMore than 200 million Americans may be drinking PFAS-contaminated water, suggests research by the nonprofit Environmental Working group (EWG), an advocacy group which is collaborating with Ensia on its Troubled Waters reporting project.\n\nThe non-partisan Environmental Working Group said major PFAS-related clean up funds are included in several budgets — from defense and veterans affairs, to the EPA and health and human services.\n\nIn order to be strategic about your organic purchasing, the Environmental Working Group's Dirty Dozen and Clean Fifteen is a good way to hone in on foods that are most or least likely to have heavy pesticide loads.\n\nThe non-profit Environmental Working Group (EWG) suggests only buying organic for their so-called “dirty dozen” list of common produce items that do tend to harbor larger amounts of chemicals: strawberries, spinach, nectarines, apples, peaches, pears, cherries, grapes, celery, tomatoes, sweet bell peppers and potatoes.\n\nSimply Sun Safe: Best Sunscreen for Redheads in 2021\n\nThe most toxic of these chemicals, oxybenzone, is blacklisted by human health authority EWG because it acts like estrogen in the body, alters sperm production in animals, and is associated with endometriosis in women.\n\nIndependent Tribune (Concord, N.C.): KOSTER: Is America being naughty or nice?\n\nChemical pollution in our drinking water is rising, but government efforts to halt it are being cut. A massive study done by The Environmental Working Group (note that this is not a governmental agency) found over 260 contaminants in public drinking water.\n\nMidwest Center for Investigative Reporting: Midwest Center sensors find potentially hazardous pesticides near schools, parks and homes\n\nA 2018 Environmental Working Group analysis of drinking water found atrazine, whose main manufacturer is Syngenta, in the tap water of more than 30 million people.\n\nIrish Examiner: President Trump has delivered bumper year for US farmers\n\nThe Environmental Working Group, a health and environmental advocacy group, accused Trump of buying farmers’ vote. But USDA Secretary Sonny Perdue said the government designed a plan to help farmers and ranchers impacted by the pandemic.\n\nBuoyed by federal aid, both for the trade war and $5 billion related to coronavirus (a fifth of which went to just 1% of recipients, according to the Environmental Working Group), net farm income is set to reach $120 billion in fiscal 2020.\n\nNPR: Farmers Got A Government Bailout In 2020, Even Those Who Didn't Need It\n\nLeman's farm received more than $700,000 in government payments in 2020, according to USDA data obtained by the Environmental Working Group, a long-time critic of many farm subsidies.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news/ewg-news-roundup-18-ewg-calls-president-trumps-removal-office-pfas-detected-100", "title": "EWG News Roundup (1/8): EWG Calls for President Trump’s Removal From Office, PFAS Detected in 100 Ohio Water Systems and More", "description": "EWG News Roundup (1/8): Here's some news you can use going into the weekend.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/News%20Roundup%20Share%20Image_175.jpg?h=ec041e41&itok=2ULWy4Rt"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/release/ewg-calls-immediate-removal-president-trump-office", "https://www.ewg.org/release/another-last-minute-poison-pill-trump-administration-kneecaps-epa-s-use-sound-science", "https://www.ewg.org/release/new-state-data-more-100-ohio-water-systems-contaminated-toxic-forever-chemicals", "https://www.ewg.org/news-and-analysis/2021/01/5-new-year-s-resolutions-healthier-living", "https://www.ajc.com/politics/sonny-perdue-is-a-rarity-a-trump-cabinet-member-who-went-the-distance/P32SCV6GFJATFOTMFC2WB6ZCCU/", "https://health.clevelandclinic.org/does-your-child-want-to-wear-makeup-5-things-you-should-know/", "https://www.allure.com/story/follain-ewg-verified-ulta-black-owned-brands", "https://wwd.com/beauty-industry-news/beauty-features/follain-ewg-verification-initiative-black-owned-beauty-brands-1234690848/", "https://www.commondreams.org/news/2021/01/07/growing-list-lawmakers-and-groups-support-impeaching-trump-or-invoking-25th?cd-origin=rss", "https://www.northcarolinahealthnews.org/2021/01/04/covid-still-looms-large-in-2021/", "https://www.nytimes.com/2020/12/21/us/politics/vilsack-usda-small-farmers.html", "https://www.washingtonpost.com/opinions/bidens-pick-for-agriculture-is-a-safe-solid-choice-but-us-farm-policy-needs-fresh-thinking/2020/12/24/3bbcddca-4082-11eb-9453-fc36ba051781_story.html", "https://www.dtnpf.com/agriculture/web/ag/columns/washington-insider/article/2020/12/24/sparks-ag", "https://cen.acs.org/environment/Trump-administration-limits-science-EPA/99/i2", "https://insideepa.com/daily-news/fy21-defense-conference-bill-drops-several-provisions-pfas-cleanups", "https://www.thestar.com.my/opinion/letters/2020/12/25/corn-rice-flour-powder-safer", "https://wset.com/news/local/asbestos-tainted-makeup-still-a-threat-for-consumers", "https://insideepa.com/daily-news/environmentalists-boost-pressure-automakers-pivot-ghg-rules", "https://www.theintelligencer.com/shopping/article/non-toxic-cleaning-and-disinfecting-products-15819270.php", "https://www.msn.com/en-us/lifestyle/shopping-all/getting-these-stainless-steel-cleaners-will-instantly-make-your-kitchen-look-nicer/ss-BBVojBy#image=7", "https://www.vogue.com/article/savannah-georgia-new-clean-beauty-capital", "https://coveteur.com/2021/01/01/fragrance-free-moisturizers/", "https://www.msn.com/en-gb/health/mindandbody/50-ways-to-start-over-in-2021/ss-BB1cbFQE#image=5", "https://www.asiaone.com/lifestyle/what-clean-beauty-looks-according-these-brands-singapore", "https://www.herworld.com/gallery/beauty/clean-beauty-brands-singapore/", "https://www.nytimes.com/2020/12/21/us/politics/kelly-loeffler-georgia-senate.html", "https://www.eatthis.com/news-side-effects-eating-frozen-foods-experts/", "https://www.agriculture.com/news/business/countdown-begins-for-compliance-with-gmo-food-labeling-rule", "https://www.wwdmag.com/industrial-water/dairy-environmental-groups-join-forces-support-farmers-improve-water-quality", "https://www.verywellhealth.com/wisconsin-water-contamination-public-health-threat-5094052", "https://insideepa.com/daily-news/new-cdc-study-slated-assess-pfas-effects-covid-vaccine-efficacy", "https://www.fayobserver.com/story/news/2020/12/19/scientists-say-pfas-genx-could-limit-covid-19-vaccine-effectiveness/3901709001/", "https://www.heraldsun.com/news/coronavirus/article247915835.html", "https://www.laprogressive.com/environmental-year-in-review/", "https://www.michiganadvance.com/2021/01/04/covid-19-vaccine-could-be-less-effective-in-people-with-high-pfas-levels-in-blood/", "https://www.record-eagle.com/news/local_news/scientists-pfas-and-covid-19-dont-mix/article_96fedfc2-4090-11eb-81db-4337fd35a0c6.html", "https://www.lawyersandsettlements.com/legal-news/personal-injury/pfas-association-with-covid-advice-confusing-23352.html", "https://www.wshu.org/post/environmentalists-question-how-harmful-chemicals-could-affect-covid-19-vaccination#stream/0", "https://insideepa.com/daily-news/epa-s-interim-cwa-permitting-pfas-plan-targets-monitoring-management", "https://insideepa.com/daily-news/health-environmental-groups-back-pfas-testing-petition", "https://www.theguardian.com/us-news/2020/dec/22/forever-chemicals-pollute-water-dozens-of-sites-in-every-us-state", "https://www.wshu.org/post/environmentalists-cheer-pfas-regulation-spending-bill#stream/0", "https://www.salon.com/2021/01/05/tips-for-sustainable-grocery-shopping_partner/", "https://www.americantowns.com/news/earthtalk-which-foods-are-worth-organic-price-premiums-31009708-weston-ct.html", "https://simplysunsafe.com/best-sunscreen-for-redheads/", "https://independenttribune.com/opinion/columnists/koster-is-america-being-naughty-or-nice/article_a1ca2fe0-4623-11eb-9e16-779cb8a3124a.html", "https://investigatemidwest.org/2020/12/17/midwest-center-sensors-find-potentially-hazardous-pesticides-near-schools-parks-and-homes/", "https://www.irishexaminer.com/farming/arid-40202312.html", "https://www.samessenger.com/opinion/editorials/ag-policy-needs-a-shakeup/article_8a666564-4892-11eb-bb4f-bba6f017528f.html", "https://www.npr.org/2020/12/30/949329557/farmers-got-a-government-bailout-in-2020-even-those-who-didnt-need-it"], "authors": [], "publish_date": "January 8, 2021"}