{"result_id": "108027", "URL": "https://www.ewg.org/news-insights/news-release/2023/02/groundbreaking-map-shows-toxic-forever-chemicals-more-330", "timestamp": "2023-04-25 15:02:55 CEST+0200", "meta": {"description": "Today the Environmental Working Group published an analysis of peer-reviewed data that for the first time shows the global scope of contamination by the “forever chemicals” known as PFAS, which may be harming over 330 wildlife species around the world.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/2023/02/groundbreaking-map-shows-toxic-forever-chemicals-more-330", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Groundbreaking map shows toxic ‘forever chemicals’ in more than 330 wildlife species", "cleaned_text": "WASHINGTON – Today the Environmental Working Group published an analysis of peer-reviewed data that for the first time shows the global scope of contamination by the “forever chemicals” known as PFAS, which may be harming over 330 wildlife species around the world.\n\nThe analysis, based on more than 100 recent peer-reviewed studies, detected over 120 unique PFAS compounds in these animals, not just the legacy forever chemicals PFOA and PFOS. Polluted animals were found on every continent except Antarctica. The absence of PFAS in species in Antarctica is not due to a lack of contamination but instead because of the absence of recent test results in the research we studied.\n\n“This new analysis shows that when species are tested for PFAS, these chemicals are detected,” said David Andrews, Ph.D., senior scientist at EWG. “This is not an exhaustive catalog of all animal studies, but predominantly those published from the past few years.\n\n“PFAS pollution is not just a problem for humans. It’s a problem for species across the globe. PFAS are ubiquitous, and this first-of-its-kind map clearly captures the extent to which PFAS have contaminated wildlife around the globe,” said Andrews.\n\nThe new interactive map plots a great variety of wildlife, including many types of fish, birds, reptiles, frogs and other amphibians, large mammals such as horses and polar bears, and small mammals such as cats. Some are already endangered or threatened.\n\n“From the polar bear in the far reaches of the Arctic to the hawksbill turtle in the tropics of the Pacific Ocean, the world’s most critically imperiled species have yet another danger to contend with: PFAS chemical pollution,” said Nathan Donley, Ph.D., environmental health science director at the Center for Biological Diversity. “Our choice is either to keep enabling extinction with widespread chemical contamination or take action to prevent it.”\n\nPFAS bioaccumulate and do not break down in the environment. The findings raise serious health concerns for animals, since exposure to PFAS is linked to a range of health harms in people.\n\nThe chemicals are found in the blood of virtually everyone, including newborn babies. Very low doses of PFAS in drinking water have been linked to suppression of the immune system, including reduced vaccine efficacy, and an increased risk of certain cancers. PFAS are linked with increased cholesterol, reproductive and developmental problems and other health harms.\n\n“Together these studies show how hundreds of types of animals are exposed to PFAS,” said Tasha Stoiber, Ph.D., a senior scientist at EWG. “The map tells a story about these chemicals – that they’re global, they’re persistent and toxic, and they’re being spread to animals and humans through the air, water and soil.\n\n“Our research found that the most common methods we have for getting rid of PFAS may end up leading to further pollution. And we can expect that contamination to ripple through the food chain, potentially affecting even more species, including humans,” said Stoiber.\n\nOne study included in the EWG analysis suggests that cardinals are being exposed to PFAS from soil, groundwater and air, with 12 different PFAS compounds found in their blood serum. Another study, on sea turtles in the north Pacific, finds PFAS can affect the development of these animals at every stage, from their eggs to immune systems.\n\nTests of animals were conducted most often on blood serum and plasma; on organs like the liver, kidney, and muscle, where PFAS are most likely to bioaccumulate; and eggs and other tissue samples.\n\n“EWG has fought against PFAS for almost 25 years,” said EWG President Ken Cook. “In that time, our researchers have analyzed scientific studies, conducted our own investigations, and plotted where toxic PFAS are detected. Now we’ve shown that these chemicals have polluted the bodies of animals in almost every corner of the world.\n\n“There are still countless locations and species across the globe that are likely contaminated but have not yet been tested. PFAS pollution is a global problem. This map is just the beginning,” said Cook.\n\nPFAS are used in a wide range of consumer products, including personal care products, food packaging, textiles like waterproof clothing, and many other products. They have also been widely used in firefighting foams and gear, a major source of contamination in the environment.\n\nThe extent of PFAS contamination is still being studied. EWG will add new studies to this map when new species and locations are tested for PFAS exposure.\n\n“The EWG initial global mapping of PFAS in wildlife provides evidence and reveals patterns in the distribution of these ‘forever chemicals,’” said Patricia Fair, M.D., of the Medical University of South Carolina in Charleston, S.C.\n\n“As the map becomes more comprehensive, it will continue to serve as guidance to close knowledge gaps and identify research needs for the harmful persistent chemicals found throughout our environment.”\n\nBecause of the health risks associated with PFAS exposure, it is important to try to minimize exposure wherever possible.\n\n“We need to accelerate – not delay – efforts to turn off the tap of PFAS pollution from industrial sources,” said Scott Faber, EWG’s senior vice president for government affairs.\n\nThe widespread global contamination of wildlife further shows the need to end industrial discharges of PFAS. EWG estimates there may be more than 40,000 industrial polluters of PFAS in the U.S. Tens of thousands of manufacturing facilities, municipal landfills and wastewater treatment plants, airports and sites where PFAS-containing firefighting foams have been used may be sources of PFAS discharges into surface water.\n\n“For decades, polluters have with impunity dumped as much PFAS as they wanted into our air, rivers, streams, lakes and bays,” said Faber. “But the Biden Environmental Protection Agency would let many PFAS polluters off the hook and rely instead on cash-strapped state regulators to turn off the tap. That’s unacceptable.”\n\nVarious wildlife experts have reviewed the analysis and commented on EWG’s analysis of PFAS contamination. Here are more quotes for use in stories:\n\nScott Belcher, Ph.D., professor, Department of Biological Sciences, Center for Human Health and the Environment, North Carolina State University, Raleigh, N.C. ([email protected])\n\nThis exhaustive compilation of PFAS testing around the world has confirmed what many of us have long feared: No living thing is safe from the scourge of our own pollution. We are contaminating the very web of life that we rely on for our own existence. But far from an inevitability, polluting our world with PFAS is a choice. Because it is a choice, we alone have the power to stop it. We are currently living in the midst of Earth’s sixth mass extinction event – and it’s one entirely of our own making. It’s quite ironic that many species on the brink of being lost forever are loaded with synthetic ‘forever chemicals’ designed to never break down. Now is the time to decide whether we want our children and grandchildren to grow up in a world full of life or one where our pollution outlives everything.\n\nThe Environmental Working Group (EWG) is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/2023/02/groundbreaking-map-shows-toxic-forever-chemicals-more-330", "title": "Groundbreaking map shows toxic ‘forever chemicals’ in more than 330 wildlife species", "description": "Today the Environmental Working Group published an analysis of peer-reviewed data that for the first time shows the global scope of contamination by the “forever chemicals” known as PFAS, which may be harming over 330 wildlife species around the world.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/2023-01/PFASWildlife2Blog.jpg?h=2e181f1f&itok=XtVlyBZS"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/news-insights/news/2023/02/wildlife-warning-more-330-species-contaminated-forever-chemicals", "https://www.ewg.org/areas-focus/toxic-chemicals/pfas-chemicals", "https://www.ewg.org/interactive-maps/pfas_in_wildlife/map/", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://www.ewg.org/interactive-maps/pfas_in_wildlife/map/", "https://www.ewg.org/news-and-analysis/2019/02/children-s-exposure-pfas-chemicals-begins-womb", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/news-insights/news-release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.atsdr.cdc.gov/pfas/health-effects/index.html", "https://www.ewg.org/news-insights/our-experts/tasha-stoiber-phd", "https://www.ewg.org/news-insights/news/feeding-waste-cycle-how-pfas-disposal-perpetuates-contamination", "https://pubmed.ncbi.nlm.nih.gov/30710759/", "https://pubmed.ncbi.nlm.nih.gov/33770650/", "https://www.ewg.org/news-insights/news/ewg-and-toxic-fluorinated-chemicals-20-years-fight-against-pfas", "https://www.ewg.org/news-insights/our-experts/ken-cook", "https://www.ewg.org/news-insights/news-release/study-toxic-forever-chemicals-widespread-across-many-cosmetics", "https://www.consumerreports.org/health/food-contaminants/dangerous-pfas-chemicals-are-in-your-food-packaging-a3786252074/", "https://www.ewg.org/news-insights/news/2022/11/new-baby-textile-product-tests-show-concerning-levels-toxic-forever", "https://static.ewg.org/ewg-tip-sheets/EWG-AvoidingPFCs.pdf", "https://www.ewg.org/research/timeline-forever-chemicals-and-firefighters", "https://www.ewg.org/news-insights/our-experts/scott-faber", "https://www.ewg.org/interactive-maps/2021_suspected_industrial_discharges_of_pfas/map/", "https://act.ewg.org/nLwkgp-CmkukmMJDiFShNw2?sourceid=1021624", "/cdn-cgi/l/email-protection#a1d2ccc3c4cdc2c993e1cfc2d2d48fc4c5d4", "/cdn-cgi/l/email-protection#b4faf0dbdad8d1cdf4d6dddbd8dbd3ddd7d5d8d0ddc2d1c6c7ddc0cd9adbc6d3", "/cdn-cgi/l/email-protection#354750575056565446754653505c1b5a4752"], "authors": [], "publish_date": "February 22, 2023"}