{"result_id": "108019", "URL": "https://www.ewg.org/news-insights/news-release/calif-bill-would-ban-forever-chemicals-products-children", "timestamp": "2023-04-25 15:02:50 CEST+0200", "meta": {"description": "State legislation that would ban the toxic “forever chemicals” known as PFAS from a wide range of children’s products passed out of the California Assembly Environmental Safety and Toxic Materials Committee on Wednesday.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/calif-bill-would-ban-forever-chemicals-products-children", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "Calif. bill would ban ‘forever chemicals’ in products for children", "cleaned_text": "SACRAMENTO, Calif. – State legislation that would ban the toxic “forever chemicals” known as PFAS from a wide range of children’s products passed out of the California Assembly Environmental Safety and Toxic Materials Committee on Wednesday.\n\nAssembly Bill 652, authored by Assemblymembers Laura Friedman (D-Burbank), with co-authors Phil Ting (D-San Francisco) and Al Muratsuchi (D-Torrance), would assure parents that a wide variety of baby and kids products they purchase are free from PFAS, a group of chemicals that cause increased risk of cancer, harm to fetal development and reduced vaccine effectiveness. PFAS are known as “forever chemicals” because they do not break down in the environment and they build up in our blood and organs.\n\n“PFAS contamination is a national environmental and public health emergency,” said David Andrews, Ph.D., a senior scientist at the Environmental Working Group. “Children are particularly vulnerable to harm resulting from PFAS exposure. Many PFAS chemicals bioaccumulate and are found in the blood of almost all Americans, including infants and children. It is critical that we eliminate unnecessary exposure to this family of chemicals as much as possible.”\n\nThe U.S. Environmental Protection Agency has not set a legal limit for PFAS under the Safe Drinking Water Act, but independent studies have found that a safe level is no more than 1 part per trillion, or ppt, a finding that is endorsed by EWG.\n\nIn a study published by Environmental Science & Technology Letters, a group of U.S. and international scientists emphasized that the current approach to regulating and managing PFAS has failed to protect public health. The study recommended a new approach that classifies all PFAS as concerning and calls for an end to all non-essential use.\n\n“This bill puts California in the lead of protecting children,” said Bill Allayaud, EWG’s director of California government affairs. “The new so-called short-chain PFAS behave much like the long-chain chemicals they are replacing. We need to be proactive in regulating exposure to this entire family of toxic chemicals.”\n\n“PFAS are stain-resistant,” said Assemblymember Friedman during the committee hearing. “Are you willing to risk the health of your baby or child for that convenience? I’d take the stain over the toxic exposure any day of the week.”\n\n“As a mother there is only so much I can do,” said Assemblymember Rebecca Bauer-Kahan, a member of the committee. She noted that the state’s “green chemistry” program “is really important and has been around for more than a decade, but only made three rules. Clearly they’re not moving fast enough.”\n\nA number of studies have found PFAS in childrens sleeping products such as crib mattresses and in car seats. The PFAS coating on these products wears off and gets into dust that can be inhaled or ingested by children. In some cases direct ingestion is possible for very young children, who explore the world through their mouths.\n\nThe chemical industry has long opposed the systemic regulation of PFAS as a class. However, California’s Department of Toxic Substance Control has firmly stated that the science shows these chemicals should be regulated as a class and not as individual chemicals, since the industry is adept at keeping ahead of research and regulation by rapidly developing new versions of PFAS.\n\nThe legislation is sponsored by EWG. The bill will be heard by the Assembly Appropriations Committee next month.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/calif-bill-would-ban-forever-chemicals-products-children", "title": "Calif. bill would ban ‘forever chemicals’ in products for children", "description": "State legislation that would ban the toxic “forever chemicals” known as PFAS from a wide range of children’s products passed out of the California Assembly Environmental Safety and Toxic Materials Committee on Wednesday.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/social_media_share/CHBedBugShare.jpg?h=ec041e41&itok=rqFWIKnu"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB652", "https://www.ewg.org/release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg", "https://www.ewg.org/news-insights/our-experts/david-andrews-phd", "https://www.ewg.org/research/ewg-proposes-pfas-standards-fully-protect-children-s-health", "https://dx.doi.org/10.1021/acs.estlett.0c00255", "https://www.ewg.org/news-insights/our-experts/bill-allayaud", "https://ehp.niehs.nih.gov/doi/10.1289/EHP7431"], "authors": [], "publish_date": "April 8, 2021"}