{"result_id": "108011", "URL": "https://www.ewg.org/news-insights/news-release/ewg-applauds-forever-chemicals-provisions-biden-budget", "timestamp": "2023-04-25 15:02:46 CEST+0200", "meta": {"description": "The Environmental Working Group today applauded the Biden administration for making the toxic “forever chemicals” known as PFAS a priority in its annual budget request.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ewg/favicon.ico", "canonical": "https://www.ewg.org/news-insights/news-release/ewg-applauds-forever-chemicals-provisions-biden-budget", "encoding": "utf-8"}, "image": null, "domain": "www.ewg.org", "title": "EWG applauds ‘forever chemicals’ provisions in Biden budget", "cleaned_text": "WASHINGTON – The Environmental Working Group today applauded the Biden administration for making the toxic “forever chemicals known as PFAS a priority in its annual budget request.\n\nBiden’s Fiscal Year 2022 budget proposal provided $75 million to accelerate critical toxicity studies of PFAS and to designate PFAS as “hazardous substances,\" which will speed the cleanup of contamination and ensure that polluters share that cost.\n\nBy contrast, the Trump administration’s FY 2021 budget proposal provided only $6 million and did not mention the “hazardous substance” designation.\n\n“This is further evidence that President Biden is making good on his campaign pledge to designate PFAS as hazardous substances,” said Scott Faber, EWG’s senior vice president for government affairs.\n\nThe Department of Defense has cited the absence of a hazardous substance designation under the nation’s cleanup laws as a reason to delay efforts to clean up groundwater contaminated by fire-fighting foam made with PFAS.\n\n“This budget is good news for hundreds of communities near military installations contaminated by PFAS pollution,” Faber said.\n\nMore than 300 bases and neighboring communities are contaminated with PFAS, and hundreds more may be contaminated.\n\nPresident Biden has also pledged to set a national drinking water standard for PFAS, and the Environmental Protection Agency recently took the next step toward setting drinking water limits that utilities must meet. The Biden administration also proposed spending $10 billion to upgrade water treatment infrastructure to address PFAS pollution.\n\nMore than 200 million Americans are likely drinking water contaminated with PFAS, the family of chemicals with health impacts that include increased risk of cancer, harm to fetal development and reduced vaccine effectiveness. They are known as “forever chemicals” because they do not break down in the environment and they build up in our blood and organs.\n\nThe Environmental Working Group is a nonprofit, non-partisan organization that empowers people to live healthier lives in a healthier environment. Through research, advocacy and unique education tools, EWG drives consumer choice and civic action.", "opengraph": {"site_name": "Environmental Working Group", "url": "http://www.ewg.org/news-insights/news-release/ewg-applauds-forever-chemicals-provisions-biden-budget", "title": "EWG applauds ‘forever chemicals’ provisions in Biden budget", "description": "The Environmental Working Group today applauded the Biden administration for making the toxic “forever chemicals” known as PFAS a priority in its annual budget request.", "image": "http://www.ewg.org/sites/default/files/styles/social_std/public/news/PFASBlog.jpg?h=2e181f1f&itok=Sbx-_dx2"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ewg.org/pfaschemicals/", "https://www.whitehouse.gov/wp-content/uploads/2021/04/FY2022-Discretionary-Request.pdf", "https://www.ewg.org/interactive-maps/pfas_contamination/map", "https://www.govinfo.gov/content/pkg/BUDGET-2021-BUD/pdf/BUDGET-2021-BUD.pdf", "https://www.ewg.org/interactive-maps/2020-military-pfas-sites/map/", "https://joebiden.com/environmental-justice-plan/", "https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/", "https://www.ewg.org/news-insights/news-release/study-more-200-million-americans-could-have-toxic-pfas-their-drinking", "https://www.ewg.org/release/study-pfas-act-similar-known-cancer-causing-chemicals", "https://www.ewg.org/news-and-analysis/2019/09/pfas-and-developmental-and-reproductive-toxicity-ewg-fact-sheet", "https://www.ewg.org/news-and-analysis/2019/06/pfas-chemicals-harm-immune-system-decrease-response-vaccines-new-ewg"], "authors": [], "publish_date": "April 9, 2021"}