{"result_id": "109014", "URL": "https://escapeallthesethings.com/pandemic-prophecy/", "timestamp": "2023-04-25 15:03:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/pandemic-prophecy/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Beat the Coronavirus Pandemic Fears With Biblical Wisdom – Escape All These Things (Luke 21:36)", "cleaned_text": "The COVID-19 outbreak is already considered a pandemic by some experts, like the 2009 H1N1/swine-flu pandemic. For prophecy students, it is even worse because the Bible seems to say \"pestilence\" is one of the signs of the end times. Or does it? What should you do if it happens? Discover a forgotten health tool for the flu that Jesus talked about but Christians do not much practice.\n\nIs this novel coronavirus COVID-19 from Wuhan, China an end-time event or fulfillment of end-time prophecy? Yes and no. Let's look at two related prophecies and see where they fit in time.\n\nThe first prophecy to examine is from the Olivet Discourse:\n\nThis passage was explained in my Seven Prophecy Pitfalls newsletter and the part where I talk about how the pretrib doctrine of imminency is contradicted by the Bible. Here's an excerpt from it:\n\nTherefore we will not see the prophesied global plagues until the 6th seal (which is caused by Wormwood's passage). Thankfully we can be sure that this prophecy will not be fulfilled anytime soon. If you're not sure about this yourself then I encourage you to check out my book, Know the Future, where this is shown using a literal interpretation of the Bible with clear and simple English.\n\nPestilence Prophecy From Revelation's Pale Horseman of the 4th Seal\n\nThe next prophecy we will look at is the 4th seal or the “pale horseman:”\n\nThe four horsemen are decidedly not easy to figure out. There is only a verse of description about each and they are vague at that. Yet with wisdom, they are understandable. The next step to solving this puzzle is, believe it or not, to skip it. Move on to the more verbose and clearer prophecies of the 6th seal and seven trumpets and get them settled first. Those global catastrophes from space are unmistakably in the future.\n\nEventually, you can prove that the Great Tribulation begins at the 5th trumpet (Dan 12:1=Rev 12:7-17=Rev 8:12-13=Rev 9:1-6,11-13). That being the case, the 1st seal cannot be the future Great Tribulation as is commonly assumed. If the first five seals do not have to be tied to the future, then it is possible they are already past. The vague descriptions we have for them do fit several trends in history that continue to this day. Jesus outlined these same trends at the beginning of the Olivet Discourse where he said to take heed no man deceives you. These trends include:\n• False religions in Christ's name Catholicism and its daughters (Protestantism, etc.), deceiving many (Rev 6:2=Mt 24:4-5)\n• Belligerent ideologies that are responsible for most wars in the last two millennia, such as Islam and Communism (Rev 6:4=Mt 24:6)\n• The economic slavery of the masses by the policies the rich and powerful have created (Rev 6:5-6=no parallel)\n\nTherefore like the rest, this fourth horseman also fits a trend that began in the past, sometime after the first three horsemen. It describes the increased deaths that we have already seen in history from man's growing influence. As knowledge has increased man has made advances that have increased his negative impact on Earth. Man's weapons are more effective resulting in more casualties of war. Famines are caused by many factors mostly having to do with man's sinful nature—not just a shortage of rain. The same goes for plagues. It is said that the Jewish people did not suffer from the Bubonic Plague because of the health and quarantine standards they follow from the Old Testament. All of these problems compound together. It is no coincidence that the worst pandemic of the last century was in 1918, the last year of World War I. Fatigued soldiers in trenches and other close quarters gave the virus the perfect environment to spread and take the stressed population down.\n\nIn other words, if this current flu outbreak is a fulfillment of any prophecy, it fits the historical trend that the Bible predicted with the 4th seal.\n\nDid Man, God or Nature Cause Viruses Like Influenza?\n\nPlagues have been with us throughout recorded history. Yet for most people in their short life experience, these events are the first they have seen. With no frame of reference or understanding of history, they entertain some pretty wild conspiracy theories about why they are happening. Some think man has engineered these viruses. Others say these viruses are God's judgment. The most probable cause is less terrifying than either of those theories.\n\nIn many ways, the wisdom for how to control your anxiety over the flu is the same as the wisdom I gave in my last newsletter for confronting economic crisis fears. You must be a student of history. If you are, you know that economic crises are a natural part of the cycle of life. Likewise, cases of flu happen every year and cause the deaths of hundreds of thousands annually. Even flu pandemics are not new. We have had three influenza pandemics in the last century alone:\n\nWe can even recognize plagues from up to 400 years ago as influenza. But even 1918 was long before genetic engineering was invented, and that was the worst of the last three influenza pandemics. Of course, I cannot rule out genetic engineering as a cause. But if the worst pandemic we know of was before genetic engineering was invented, it casts doubt on the genetic engineering theory or whether genetic engineering should be feared more than nature.\n\nAs for the idea that this is a judgment from God, we must remember that God's judgment has a narrow range of meaning. When it happens, you do not have to wonder if it was God or not. When fire and brimstone fell on Sodom killing everyone, it was obviously God's judgment. When rain fell for the first time in history to bring a global flood according to Noah's warning, there was no mystery about who caused it. When the ten plagues fell on Egypt, even Pharaoh's magicians finally had to admit “this is the finger of God” (Ex 8:19). In the future, when Wormwood brings the end of civilization, prophecy tells us everyone will know God is behind that, too (Rev 6:16).\n\nUnlike those events, there is nothing supernatural about an economic crisis or a flu pandemic. We can find similar events in history and explain them from natural causes. This may sound like common sense, but judging from the conversations I have had with people since the Great Recession of 2008 and SARS and MERS pandemics, it is not obvious to everyone. They cannot discern the conspiracy theories or false prophetic words out there that ascribe these natural events to diabolical men or spirits.\n\nThis is no doubt because we are all at different levels of growth and coming from different experiences. What is common sense to one is news to another, especially the young and inexperienced. When I turned 40, I finally understood the truth of the expression, “life begins at 40.” It seems like it took me that long to learn how to navigate around enough of the scams, pitfalls, unwise choices, dead ends, bad habits and wrong belief systems in the world that stand in the way of consistent success and happiness.\n\nOf course, even without God's or man's help, the coronavirus can still turn into a pandemic and kill many as virus outbreaks of the past have done. But you should know that it is highly unlikely it ever will. Biologist Paul Ewald explains why in an interview with Esquire magazine:\n\nCoping With Viruses Naturally Without Risks of Vaccines\n\nDid you notice the decreasing trend of fatalities from influenza pandemics of the last century? Improvements in medicine have diminished influenza's impact. Back in 1918, vaccines were primitive at best, there were no antibiotics or mechanical ventilators so even simple infections killed people (which is typically what kills influenza sufferers, not the virus). Thus, despite the population of the world increasing, with modern medicine and technology, flu pandemics have taken fewer lives. This realization alone should reduce our fear of the flu.\n\nIn China, the standard of living and health care are at a lower level than in the developed world. In general, the poor eat less healthily and have less access to medical care. This is another clue for us on how to not be a victim of the coronavirus. If you can afford to, it would be a good idea to invest in better foods and supplements to boost your health, especially those that protect and strengthen the immune system (like garlic and zinc). There is much information online for what works in this regard if you do your research.\n\nWhat about vaccines? I am not an anti-vaxxer, however common sense says before putting it in your body, you ought to first know the risks and benefits of that particular vaccine. Besides the fact that vaccines are expensive, the last time there was a swine flu breakout, the vaccine killed more people than the virus did. Time Magazine has an article mentioning the mistakes of the past swine flu outbreak of 1976.\n\nDr. Russell Blaylock had firsthand experience with the 1976 outbreak in which he refused to take the vaccine. Here is his story.\n\nI was in the military during the first swine flu scare in 1976. At the time it became policy that all soldiers would be vaccinated for swine flu. As a medical officer I refused and almost faced a court martial, but the military didn’t want the bad publicity. Despite the assurance by all the experts in virology, including Dr. Sabin, the epidemic never materialized. What did materialize were 500 cases of Gullian-Barre paralysis, including 25 deaths—not due to the swine flu itself, but as a direct result of the vaccine. At the time President Gerald Ford, on advice from the CDC, called for vaccination of the entire population of the United States. Today, some 33 years later, we are hearing the same cries of alarm from a similar lineup of virology experts. The pharmaceutical companies are busy designing a vaccine for the swine flu in hope that this administration will make the vaccine mandatory before another vaccine-related disaster can ruin their party. And as before, a number of equally qualified experts are calling for calm, based on a number of carefully conducted studies. To no one’s surprise, they too are being ignored by the media and government planners. According to science reports, this current strain of flu is H1N1. It can be forcibly inoculated into pigs, but it has been shown not to spread among the pig population. This means that the danger of a swine-based epidemic is small. There are several strains of this flu virus however, including H1N1, H1N2, H3N1, H3N2 and H2N3. What the science has shown is that when the virus passes through the pig, it becomes less virulent—that is, it is less likely to cause serious disease in people. With each passage, it becomes even weaker. Since this is not the answer that the pseudo-scientists wanted, they next announced that it is “possible” that the pigs could be infected with both the bird flu (strain H5N1) and the swine flu (strain H1N1), resulting in a mutant, highly virulent strain that could lead to a pandemic. Note this is pure speculation and that no scientist has ever performed this trick. It is purely hypothetical—like global warming. CDC virologists claim that in the past they performed a similar virological trick, but they never published their results and thus have kept the data close to the vest. In science, especially medical science, speculation is taboo. But, politicized scientists perform this bit of smoke and mirrors all the time. So, you may ask, \"What about all the people dying in Mexico?\" Overcrowding, poor nutrition and overall poor immunity, all of which are indigenous to Mexico, are a certain prescription for death from almost any infection. [Note that despite 46 cases of this very same flu in the United States there have been no deaths. This is because Americans, comparatively, have better nutrition and medical care.] Like SARS and bird flu before it, this swine flu scare is a lot of nonsense. Just take your high dose vitamin D3 (5000 IU a day), eat a healthy diet and take a few immune boosting supplements (such as beta-1, 3/1, 6 glucan) and you will not have to worry about this flu.\n\nBy the way, speaking of supplements, I've been hearing again about megadoses of Vitamin C. They say it is effective in fighting viruses like flu and COVID-19. Megadosing C was promoted by Dr. Linus Pauling but then after he died other vitamins like D3 came into vogue. Liposomal C is the form that is repeatedly promoted for megadosing since it absorbs better than our old ascorbic acid C (which was always hard bowels). Look into it for yourself as part of your illness arsenal.\n\nSecret Weapon Against the Flu (and Most Every Disease)\n\nI realize that the advice to not take the flu vaccine is unconventional. Most people trust modern medicine to give them the best advice and tools available for health-care. If the government, medical field, and CDC think creating and distributing a vaccine is the best approach then how can the average person disagree and be right?\n\nThe reason I personally feel confident in this advice is because of my past “adventures in health.” I learned from them that regular people can know better than their doctors on what is right for them. I also gleaned a secret health tool against the flu in the process.\n\nI was diagnosed with ulcerative colitis when I was 22 (a gastrointestinal inflammation). My doctor told me there was no cure and that diet makes no difference. He said that I would have to take medication for the rest of my life to suppress the symptoms. Idealist that I am, I was not satisfied with that prognosis. So I took matters into my own hands and began to investigate health.\n\nWhat I found was that people had indeed overcome my condition without medication. They did it through adopting a biblical whole food vegan diet and through fasting (which is also biblical). In fact, I read that people have recovered from just about any condition you can name through dietary changes and extended fasts. Even “incurable” diseases. So I decided to try it (with supervision—I do not recommend fasting without expert care as you learn about it).\n\nI fasted to calm down my colon inflammation. I don't remember how many days it was, but it made a huge difference. And then I changed to a diet of much more raw and whole foods than the standard American diet (SAD) consists of. The result was I was able to wean myself off the anti-inflammatory medication I was prescribed and have better health than ever before. I even went back to the doctor and told him what I did to get off the meds. His response was that “it could not have been my diet change.” Yet as time went on I found that if I stayed on my new healthier diet, I could be free of meds and symptoms indefinitely. If I fell off the wagon and cheated, I would experience a return of symptoms soon enough. Going back to fasting and raw foods would then bring me back to health again. Although this is less than ideal, it did confirm for me beyond any doubt what works and what does not. Fasting and the ancient vegan diet outlined in Genesis 1:11 bring superior health and freedom from diseases compared to the standard, overly artificial and processed foods that people consume in modern times. (Here's a book about another man's 42-day fast to overcome his case of colitis.)\n\nDoes this have any application to influenza and maybe coronavirus? If you study what is commonly taught on how to beat or recover from the flu, the conventional wisdom is to “drink plenty of fluids” with nary a word about what to eat. The only dietary advice you might hear is to have “chicken soup.” But if I ever caught the flu, I would not do that. I would immediately start fasting with confidence from past experience that it is the fastest way to recover. I do it every time I get a cold or the flu and I resolve it in a few days or a week at most. It does not drag on for weeks as it does for many people I know.\n\nIf you want proof, check out the book Fasting and Man's Correct Diet by R. B. Pearson. It was written the year after the 1918 influenza pandemic. On pages 48-50, Pearson relates some interesting data about death rates by doctor type: allopathic/drugging doctors vs. alternative doctors (those who used fasting and enemas, such as chiropractors and osteopaths). The allopathic doctors had a death rate of around 14%. The alternative doctors had a fraction of the death rate of less than 1% and in some cases zero deaths out of 1500 cases!\n\nOf course, that is not the only reason we as believers should look into fasting. Jesus clearly expected after he was gone for his disciples to practice fasting just as John's disciples and the Pharisees did (Lk 5:33; Mt 6:16). It should be a regular part of our life along with prayer and Bible study because it draws us closer to God. Sadly, few believers today practice it just as they do not read the Bible or pray as much as they should. I must admit that if it was not for my health condition, I probably would not be a habitual faster either. When we pray for God to guide your life, he has a way of giving you additional (sometimes unpleasant) reasons to do what we already should be doing. I am convinced that my health issue helped to answer that regular prayer of mine. Perhaps this flu epidemic will be used by God to lead the reader to rediscover and practice fasting for themselves.\n\nHow To Incorporate Fasting Into Your Life Now\n\nIf you do not already fast and want to start, I recommend you take action on it now. You never know when you might need to fast. The 1918 pandemic had a lull before the much worse second wave hit.\n\nBy the way, God made sure that his people would have this experience and knowledge by commanding them to fast on Yom Kippur every year. I used to keep this fast day when I attended the WCG and I still fast on the Day of Atonement every year. With all my experience fasting and with proper diet, it has always been easy for me. But that was not the case for people who only fasted one day per year. I noticed that most would complain of headaches that day (especially coffee drinkers). The sooner you start your fasting habit, the sooner it will be no big deal for you to fast either when called upon.\n\nStart with a prayer to God admitting your negligence and ask him for help to grow in this area. Then take action immediately. There is a lot of information now on the internet and Youtube on fasting especially since intermittent-fasting/time-restricted eating has become popular. This very well written book about one man's fast of 42 days is very inspiring and shows you what to expect day by day on extended fasts. You can start slow by skipping meals and work up to an entire day of fasting.\n\nIn your research, you will find fasting has one other benefit of special interest to believers like us: life extension. Several of the Bible heroes had above average life spans for this reason. The prophetess Anna from Luke 2 was said to be always in the temple praying and fasting. When she met baby Jesus during his visit to the temple on the eighth day, her age was given as a minimum of 103 (if you assume she married at the earliest marriageable age of 12). That's a very impressive age for those times (Luke 2:36-38).\n\nI share this final point because so many older readers of my book have lamented that they feel they will not be around long enough to see the Messiah's Second Coming. A person in their 60s recently told me this. But 60 does not have to be old age. It can be middle age if you apply all the wisdom that is available today free on the Internet about life extension. If you are like me, you do not want to let anything stop you from “escaping all these things and being able to stand before the Son of Man” when he comes (Luke 21:36).", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm#order", "http://www.bible.ca/cath-overview-false-teaching.htm", "https://escapeallthesethings.com/when-atheism-ends/", "/2026-in-prophecy/", "https://web.archive.org/web/20130826203507/http://www.time.com/time/health/article/0,8599,1894129,00.html", "http://web.archive.org/web/20090510092430/http://www.augustreview.com:80/news_commentary/general/pandemic_nonsense%3A_flying_pig_flu_20090428118/:/", "https://escapeallthesethings.com/FastingUC/", "http://books.google.com/books?id=xbRnI0aN95EC&pg=PA48&dq=fasting+influenza", "https://escapeallthesethings.com/holy-day-calendar", "/fastinguc", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://mistape.com", "https://escapeallthesethings.com/pandemic-prophecy/print/", "https://escapeallthesethings.com/pandemic-prophecy/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/last-days-people-prophecy/", "https://escapeallthesethings.com/covid-19-prophecy-questions/"], "authors": [], "publish_date": null}