{"result_id": "109027", "URL": "https://escapeallthesethings.com/why-you-will-miss-elijah/", "timestamp": "2023-04-25 15:03:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/why-you-will-miss-elijah/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Why You Will Probably Miss Elijah, the “Sinner” (Unless You Change This) – Escape All These Things (Luke 21:36)", "cleaned_text": "I used to teach that no one could miss the end-time Elijah's appearance. Now I see that I was overlooking the pattern in Jesus' ministry which caused the religious to miss him and will cause the religious today to reject God's end-time prophets as \"a sinner...not from God\" (like they said of Jesus in John 9:16).\n\nAs a youth reading the account in the Gospels of the Jews rejecting Jesus, I had a thought that I bet nearly all Christians do:\n\n\"If I was there in Jesus' day I would not have rejected him as the Jews did.\"\n\nIt's a positive affirmation, but a bit naive. Certainly, if any Christian were sent back in time with their current religious and cultural understanding, they would want to become Jesus' disciple. On the other hand, if you, like the Jews who rejected Jesus, were born and raised in Judaism to adulthood before seeing this \"Yeshua from Nazareth\" arrive, it would be a different story. Much of what you would know from your religion would lead you to reject him because your judgment would be centered on the wrong concepts. I think this passage from John sums up the problem:\n\nDo you see where their mistake lies?\n\nThey judged Jesus by whether he followed the same religious rules and regulations that they did. The assumption by anyone following a religion is that it is the right one, even infallible. (This is what many Catholics believe about the Catholic Church or Pope.) It's natural to judge as wrong those who do not keep what you keep. We all have done it. If you assume your understanding is right, you assume those with a different understanding are wrong. This is an unreliable way to judge who is of God and who is not.\n\nWhat they should have judged Jesus by was his love for people and love for God (Mt 22:36-40).\n\nWhy didn't they? Because their religion did not instill that same core value. Religions give so many rules and values mixed in with love that the prime importance of love is easily missed. Even if you read the Bible many times, seeing the primacy of love is like finding a needle in a haystack. There are just so many verses talking about other interesting topics and they distract you from realizing what is most important.\n\nThis is ironic considering Jesus summed up the entire Bible as love and all its teachings fulfilled by acting in love (Mt 7:12)!\n\nIf the Jews had that same core value as Jesus taught, then they would have been looking for someone who focused on love. They would have recognized Jesus as a true prophet of God and later have been able to accept his proof for his messiahship, too. If you do not want to miss Elijah, you must be sure your core value is also love.\n\nYou must also understand that God leads his prophets to \"break the rules\" in an offensive manner to see who will not be offended and lose their focus on the love.\n\n\"Does This Offend You?\" (John 6:61-62)\n\nLet's make this real and personal now so this teaching impacts your life instead of just stimulating your brain.\n\nI am going to give you some plausible, practical possibilities of what Elijah might teach when he comes. See if any of them are a sacred cow for you, or \"an idea, custom, or institution held, especially unreasonably, to be above criticism (with reference to the Hindus' respect for the cow as a sacred animal)\":\n• Not a Sabbath-Keeper - Regular Christians have no problem with this, but Hebrew Roots and Messianic Christians think that \"the Sabbath is eternal from creation for all men.\" Upon hearing about someone people think is Elijah who does not keep Sabbath, they would reject him without a second thought as a sinner.\n• \"Church attendance is not necessary\" - Christians are expected to belong to a local church at which they attend Sunday service. If Elijah is Jewish, he is unlikely to endorse this doctrine. He may not even endorse synagogue attendance. What will Christians, think?\n• Not a Trinitarian - Not all branches of Christianity see the Trinity in the Bible. What if Elijah comes from a nontrinitarian denomination and affirms the same interpretation?\n• \"Abortion is not murder\" - Most Christians would reject a prophet of God who stated this (just as much as they reject presidential candidates who do). Yet in much of Judaism, they teach exactly this, that it is not a person until birth, so it is not murder. Again, if Elijah is a Jewish prophet, conceivably he would not follow Christian interpretation of the Bible, but Jewish interpretation such as on abortion. This will be a problem for most Christians!\n• \"Homosexual sex is not a sin\" - These days, there are more and more denominations of Christianity that affirm homosexuals or marry them because they do not interpret the \"homosexuality clobber passages\" (like Romans 1:26-27) the same way as most of Christianity does. They see those passages as addressing such things as pederasty and cult prostitution acts (in worship other gods). Judaism has long ignored lesbianism and now Reform (1990) and Conservative Judaism (2006) accept all homosexuals. (Orthodox Judaism still condemns it). Elijah could come from one of these faith traditions where he learned to interpret the Bible with the same affirming view on homosexuality. This would convict most of us to reject him out of principle while the non-religious world would largely find this inclusive position surprisingly \"woke\" for someone who otherwise seems Christian.\n• Uses profanity - One of the holiness values of Christians is to avoid using four-letter words or vulgar language. But there is evidence that Paul and other prophets of God used such language under the inspiration of the HS to write their part of the Bible. Many Christians would reject a man of God who spoke like that.\n• Uses Other \"Wrong\" Words: Right after I sent this article to my subscribers, someone replied, \"I made the mistake of thinking You, because of YOUR KNOWLEDGE, would know that 'God' and Gad are one & the same. In fact, Gad is pronounced the same way \"God\" is pronounced. Gad rhymes with sod. I know more than enough about WHO God IS. Please unsubscribe me from your G.D. mailing list.\" It's hard to imagine someone who read the warning in my article would respond by doing exactly that against me, over a harmless word I use: \"God.\" Be warned, this man is not a \"nut\" but someone just like you who judges others by their own \"more reasonable\" sacred cows.\n• Gay Prophet - Another update from reader feedback: A homosexual pastor who reads my articles suggested the possibility \"What if Elijah was gay and wore a rainbow shawl?\" I thought that this was a good thought experiment indeed because it would make even the best of us want to reject him. What if?\n\nIf your reaction to any of these was something like, \"No way would a true prophet of God believe/be that! That's sin/heresy!\" then bingo, you just found a sacred cow.\n\nWhy? Because the whole Bible is summarized as love and fulfilled by love (Mt 7:12) and not in any of those doctrines above. You have to hold to your opinion of \"truth\" loosely or it will get you into trouble in the end times. You can be sure Elijah will teach something you find detestable because Jesus did the same thing before him.\n\nIn case you're not quite convinced yet that Elijah will have some offensive positions, then let us go back to Jesus, also a prophet, and the pattern he showed.\n\nJesus broke Sabbath consistently throughout the Gospels and never denied it. It never once says either \"and Jesus rested because it was Sabbath.\" Never! What we have instead is lots of Sabbath-breaking which twice he explained as having the divine right to do (John 5:17; Mt 12:8). His Sabbath-breaking was one of the two reasons the Jews wanted to kill him (John 5:18), along with blasphemy. Ultimately he was convicted for the cause of blasphemy alone (Mt 26:65-66).\n\nThink about it, with his focus on teaching the Good News why did Jesus have to \"slow himself down\" with the Sabbath controversy? It's obvious that Jesus was breaking their rules on purpose. Observers with the wrong focus or a religious spirit would stumble in offense at seeing Jesus do things they held as despicable. They would miss the Messiah because of their religious spirit being triggered.\n\nIt was not just Sabbath-breaking but they also rejected him or left him when he told them to eat his flesh and drink his blood with a straight face (John 6:53, 66). The suggestion of cannibalism is detestable and offensive.\n\nThrough these controversies, he was shaking the tree to see who was not focusing 100% on his Godly love and would be offended away by lesser concerns.\n\nGod always has his prophets do detestable things to reveal the hearts of the people (e.g., remember Hosea marrying a promiscuous woman and having three children with her?). If the people do not fully love God and the truth and are not willing to change and accept uncomfortable things for that truth, then they will miss out. God will not let into his kingdom anyone who has not been tested to reveal if they \"received a love for the truth\" or if they still love any other things ahead of that.\n\nWhat is the change you need to make so you do not miss (reject) Elijah?\n\nYou must change in the same way I have been saying for years now in my writing. You must repent and get on the same page as Jesus about love being the identifying characteristic of those who are humbly serving God in a state of repentance:\n\n\"It's about love, stupid\" (and I'm including myself in that descriptor with how many decades of Bible study it took me to see this). If you do not cultivate love like Jesus and his disciples then you are not anything like Christ or obeying Christ:\n\nAnd by the way, according to Jesus' words, you also are not saved/entering the kingdom until you switch over to be love-centered:\n\nAs I explained in another article on this passage, the will/law of the Father Jesus referred to can only be the two greatest commandments above. If you do not choose to adopt and apply that law of love to all people (however imperfectly), even to the detestable or to those who have hurt you, then you are considered a \"worker of lawlessness,\" and Jesus will reject you for entrance to the kingdom. This requirement is not about performance or perfection but the heart and actions. The kingdom will be a place of peace, harmony, and joy when everyone there has the love and humility of Jesus, yes?\n\nIf we all just agree on a non-moral, non-ethical command like resting on Sabbath, that in itself does not create harmony. Trust me, once I invited a Sabbath-keeper to live with me to help him only to discover he did not have integrity or love for us. It was constant strife and we had to kick him out!\n\nJohn 13:35 is not the only passage teaching us to identify trained servants of God by their love. Jesus directly warned in the Sermon on the Mount that if you did not discern prophets by the correct yardstick, you would be deceived:\n\nYou can read about the fruit of God's spirit in Galatians 5:22-23. In brief, God's prophets are associated with humility, love, and freedom. The false prophets are not about love, but bondage and other negative fruits (Galatians 5:19-21).\n\nTo be precise, if you judge a prophet of Yehovah by:\n• the words he uses,\n• his Bible interpretations that may differ from yours,\n• his behavior when under the Holy Spirit (crying, convulsing, laughing, etc.),\n• his history including a strange backstory to his calling as a prophet,\n• or anything else that your religious or human spirit judges as wrong...\n\n...then you're going to reject and miss what God is doing on the earth just as the Jews missed the Messiah because he did not keep Sabbath or wash his hands as they expected.\n\nI am convinced that if you do not center on and daily practice the love of God yourself (from repentance), then you will not be able to properly discern those who are doing the same for God.\n\nDo not be fooled: you cannot love others like Jesus unless you are humble like Jesus, too (Mt 11:29). Your pride, rights, entitlement, expectations and so much more that comes from pride will get in the way of loving others consistently. That is why Jesus said quite shockingly that if you do not seek humility, forget about salvation:\n\nSo, how do you become this humble? We must \"humble ourselves\" and this works up to a point. Ultimately it is only God who can guide us to true humility in the repentance process.\n\nYou can start the process by tapping into things you feel guilty about but continue to do by ignoring or excusing the feeling with some justification. For example, say you feel guilty about watching too many TV shows in this Golden Age of Television, or when you play video games. That's a problem already and you know it. Paul explains:\n\nIn the repentance process, you stop justifying these behaviors and ignoring your conscience about them and focus on the painful truth that is behind those negative feelings. The hard truth may be that these activities are taking too much time away from your family, God, or from your own self-care that you are neglecting. You may admit you are addicted or doing these things to feel better and cover up the fact that you do not feel good about yourself or that you are unloveable.\n\nYou then confess these things to God and to those you have hurt and hear another hard truth regarding how much you hurt them. After you get a fuller understanding of the impact of these behaviors that you already felt guilty about, you will loathe them. You will lose interest and want to cease them. You will be better connected to God, yourself, and your loved ones. That connection will help you to feel loved and better about yourself without the need for the activities you once said to yourself, \"I need this. I need this to be happy. I cannot give this up.\"\n\nGod will then lead you onto the next item, perhaps your worst fear, an idol, or thing you do not like about yourself, always with encouragement along the way to help you move forward. Your faith will grow and your joy along with it. You will rapidly transform into who you always wanted to be.\n\nThis is true repentance in nutshell.\n\nWhy isn't it taught and why doesn't every Christian do it? Because they are taught repentance is just about confessing sins and accepting Jesus to cover them. Real repentance is not so short and easy but is a painful, vulnerable experience that may cause you to lose everything (when you get real about yourself to others, especially). However, when you give up everything you're holding on to, God is faithful to reward you. There's no way he will not see what you lost and the price in pain you paid and not pay you back doubly like he did Job who received double after his repentance process that stripped him down to nothing (Job 1:3; Job 42:12; Heb 11:6).\n\nOnce you make the changes above and become humble and love-centered, you will have the proper discernment that is necessary to change how you judge or discern who is a prophet of God and who is not. You will be able to recognize Elijah when he comes by his love and not reject him by his beliefs and doctrines you may find impossible, heretical, and even detestable.\n\nAlso, you will be able to discern who is false and not be deluded by it like the rest of the world who are not love-centered yet:\n\nThe truth that Paul is referring to is of course what the Bible teaches from start to end: love your neighbor as yourself for God. \"The truth\" is not any of the alternative things listed above that Christians consider more or equally important (and frankly do not agree on anyway). We can all agree that God is love, Jesus loved, his disciples were identified by their love, love sums up the Bible and that loving your neighbor is the requirement for entering the Kingdom according to Jesus (Mt 19:17-19).\n\nWhy COVID-19 is Happening Now\n\nTime is short and it's time to do this now.\n\nIn April I received confirmation from a prophet that the end is indeed about to begin just as I had concluded. That statement may shock you because I have said in the past that I do not see or receive any prophets today. But we're in the end times for sure now, and prophets are being activated, finally, Praise God! This person is a newly activated prophet. (Their identity is not mine to reveal yet, so please do not ask me to do that ahead of God's timing.) It's confirmed that we are about to begin the end-time events just as I have been writing to you all for years.\n\nCOVID-19 was the start of the preparation for the end, especially for the Bride of Christ. If you are like me (and as I previously wrote), I instinctively knew that there is no way this pandemic is an accident or coincidence when we're just two years away from the Psalm 83 war that kicks off the end time events.\n\nThis prophet confirmed that Satan himself was behind this virus. I had already concluded that it was not man-made and not an accident. But the prophet explained that God allowed Satan to create this because God could use it for his purpose of preparing us who are consenting to be humbled to be the Bride. That makes complete sense to me. What Satan intends for evil God works for good.\n\nIf you doubt that, just think about how bad COVID-19 really is for a moment. The news each day just gets worse and worse. I never imagined it could get this bad at the start. Now I'm reading that it's like the common cold (another coronavirus) in that there is no evidence of immunity from it. Plus, it's far more contagious than the flu, it spreads like a Trojan horse in asymptomatic people, and it viciously attacks the lungs so that healthy people of all ages are dying. It seems unaffected by temperature like the flu which is limited to colder months. This is not. Like the cold and flu, it's not going away on its own but will spike in waves according to experts. It's almost the perfect virus a Devil could design to hurt humanity, isn't it? Not too deadly so it spreads and there may never be a vaccine for it just like the cold.\n\nIf you're like me in this time of restrictions and sheltering, you already have been humbled and confronted with your guilt, fears, and other personal issues. Why not use this as a springboard to go onto full repentance and draw close to God like you always wanted but did not know how to? The Holy Spirit is ready to guide you in at a higher level now so you are not alone and can accomplish it:\n\nIt's time to get ready and no one can make you ready but yourself by the guidance of the Holy Spirit. Push into the pain and repent and soon you will find joy. That's a reward in itself (plus salvation) whether you are around to discern Elijah or not.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/true-false-prophet", "https://www.myjewishlearning.com/article/abortion-in-jewish-thought/", "http://www.bibleandhomosexuality.org/", "https://www.haaretz.com/jewish/.premium.MAGAZINE-judaism-and-homosexuality-a-brief-history-1.5390687", "https://relevantmagazine.com/life5/what-bleep-does-bible-say-about-profanity/", "https://escapeallthesethings.com/mt-24-14-meaning", "/2026-in-prophecy/", "https://escapeallthesethings.com/salvation-missing-3rd-ingredient/", "https://escapeallthesethings.com/yahweh/", "https://escapeallthesethings.com/covid-19-prophecy-questions/", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://mistape.com", "https://escapeallthesethings.com/why-you-will-miss-elijah/print/", "https://escapeallthesethings.com/why-you-will-miss-elijah/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/covid-19-prophecy-questions/", "https://escapeallthesethings.com/why-no-timeline-change-2020/"], "authors": [], "publish_date": null}