{"result_id": "109009", "URL": "https://escapeallthesethings.com/60-reasons-iraq-not-mystery-babylon/", "timestamp": "2023-04-25 15:03:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/60-reasons-iraq-not-mystery-babylon/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "60 Reasons America is Mystery Babylon (Not Iraq) – Escape All These Things (Luke 21:36)", "cleaned_text": "Just who is \"Babylon the Great\" of Revelation 17-18? Popular answers are the Vatican or Catholic Church, Rome (\"the city on seven hills\"), Jerusalem, and Iraq where the literal city Babylon is found. These answers may seem to be adequate when you focus on only a few verses or traits of Mystery Babylon. However, when you consider all 60 characteristics of Daughter Babylon or Babylon the Great found throughout Bible prophecy, only one answer fits the many verses literally without forcing: America the Great. This article was written by the late R. A. Coombes.\n\nNote: Although I host and recommend Rick Coombes article here, it does not mean I agree with all of it. Many of the \"60 proofs\" are on the vague side and, in my opinion, forced, while others are great, high quality proofs I never heard before his book. For me quantity is less important that quality. Please disregard the lower quality proofs and focus on the detailed, specific quality proofs that only fit America (such as the mother country, deep sea water port, economy, military, etc.) to get the rare benefit of this article. — Tim\n\nMuch of this article's material has been adapted from chapter 4 of Volume 2 of \"America, The Babylon\" but since publication of the book in 2002 which featured 57 reasons, this article provides an added 3 new reasons and composed in May of 2006.\n\nThere are some prophecy \"experts\" who have proposed the theory that Iraq and the ancient archaeological site of Babylon is the location for the \"Mystery Babylon\" of Prophecy. That theory considers the ancient prophecies of Revelation chapters 17 and 18 primarily. Some of those experts also refer to other prophecies of Isaiah 13, 14, 18, 47, and Jeremiah 50 and 51. The theoretical lines of reasoning revolve around the central notion that the prophecies must be literal and applicable only to the ancient location site of Babylon with its current nationality being Iraq. That is the main line of proof for such a view.\n\nThe site of ancient Babylon can be the only literal rendering of this prophecy according to those theorists. They proudly claim that they are the only, holy LITERAL interpreters of the text. To take the text LITERALLY one must assume then, that ancient Babylon is the LITERAL Babylon of the prophecies written by the Old and New Testament authors. Such a view assumes way too much, particularly in the translation work. Is it possible that there could be a different and more literal view based on a sharper rendering of the original Hebrew and Greek texts? Yes. Why?\n\nThis researcher has done 16 years of extensive research into such theories. The results of my research indicate that the \"Iraq is Mystery Babylon\" theory is incorrect and invalid. Why? It is really very simple. Follow the exact rendering of the original Hebrew and Greek texts for themselves and you will find numerous character traits for the future nation of Mystery Babylon. Yes, I did use the term \"nation\" because again, what seems to be merely a city being described is not just a city. Most literally, the prophecies not only refer to a city but to cities, PLURAL. Also the prophecies refer to farming and the farmers of Babylon. There are no farms in a city.\n\nThere are numerous character traits listed for this city/state/nation that is referred to as either \"Babylon\" or \"Mystery Babylon\". These character traits serve as identifying markers that give us the clues as to the identity of such a city/nation. Those traits must all match perfectly to one identity. We cannot ignore some and select others. These traits are numerous and 60 of those traits clearly can not be identified with Iraq. The following list shows what traits do NOT match up with Iraq.\n\nThese are all references to Jewish people living in this future \"Mystery Babylon\" in the ancient Babylon, from the 6th Century BC till well into the early Church Age, the majority of the Jewish population lived in ancient Babylon. It was the home to most of the world’s Jews even in the time of Christ. Today, the largest population of Jewish people is found in the United States. The next two nations combined, Israel (home to the 2nd largest Jewish population) and Russia (home to the 3rd largest Jewish population) do not equal the population of Jewish people living in America. Iraq on the other hand has only a relative handful of Jews living within its borders. Some estimate the Jewish population in Iraq at perhaps 10,000. That is not very many people, particularly in regards to the population of most other nations hosting the Jewish remnant. This character trait of being the lead host for Jewry is not indicative that Iraq today fulfills the prophecies of \"mystery Babylon.\" Therefore, this trait alone disqualifies the theory of \"Iraq = Mystery\" Babylon.\n\nBut, for those who are hard-headed, let us press on with the other 56 reasons why Iraq can NOT be Mystery Babylon based upon a literal rendering of the texts.\n\n#2. The chief city of Mystery Babylon is a \"DEEPWATER PORT CITY\"!!!\n\nRevelation 18: 17-19. This passage tells us that merchant ships are standing off the shoreline of Babylon. These ships have either just unloaded in the port city of Mystery Babylon, or are waiting to dock when the fiery judgment hits. These ship captains, crew and passengers are witnesses to the destruction. Question: Why would these folks be standing on deck of merchant ships unless there were port facilities in this city? Answer: The city is a port city. In this day and age, especially by virtue of the list of commodities that are traded in \"Mystery Babylon,\" (see Revelation 18:11-13) there must be at least one deepwater port in the nation of Mystery Babylon. One thing can be noted regard to modern day port facilities. In order for Babylon to have the kind of merchandise (described in Revelation 18:11-13) coming by ships then those ships must be going to and from a DEEPWATER SEA- PORT CITY. Why? For today's ships to bring such merchandise requires them to be large commercial freighters with DEEP drawing drafts. These ships require deep-water port facilities to dock and load/unload because their hulls are so deep. They are BIG ships. [Note Reason #2 seems to be like our #57 reason, but there are significant differences between them.]\n\nNow here is the problem for the Iraq=Babylon theorists: Iraq has no deepwater seaport!!! That's right, there is no DEEPWater port facility in all of Iraq. During GulfWar2, there were and still are small freighters coming into the little town harbor of Basra. In a recent United States CIA publication on Iraq, the CIA noted that a significant problem with sea transport was the lack of deepwater shipping facilities. Harbor draft measurements up the mouth of the Euphrates river to Basra are around the eight foot (that's 8 feet) level. That makes it hard to even get big fishing boats into the harbor. At best, draft levels further out only range to less than 20 feet.\n\nThere is no way that the typical international commercial freighters could dock in Basra or anywhere else in Iraq's very short shoreline because they would easily run aground and become stuck in the shallow, muddy waters. Only small ships carrying small quantities of goods can dock in Basra. Those large ore-carrying freighters, or big cargo container ships carrying cars or trucks are simply too big to be able to dock at the shallow harbor of Basra or any other little harbor on Iraq's shoreline. Those super-large oil tankers can not get near to the small snippet of coastline that Iraq has because it is so shallow. The oil from Iraq is therefore either piped to Jordan, or is piped out for miles into the Persian Gulf into the deeper waters where these oil tankers won’t run aground.\n\nBut that is not all that shoots the Literalists balloon out from underneath them on this issue of deepwater port facilities.\n\nAccording to the \"Literalists,\" Ancient Babylon, we are told must be the only literal interpretation. However, ancient Babylon is 400+ miles from the Persian Gulf and over 350 miles from Basra. The LITERAL description found in Revelation 18: 17-19 shows these huge ships will be within visual distance of the city skyline and will witness her destruction up close and personal. Being 400 miles away is just a bit too far to be able to see any kind of destruction of a city, even if it were from nuclear bombs. The curvature of the earth is just a bit too much at 400 miles even with flat terrain to be able to see what has transpired that far away. Now although this is in itself a fatal flaw exposed in the \"Iraq = Mystery Babylon\" theory it is just one of many theoretical flaws. One thing it really points to though is how NOT Literal is the concept that Iraq is Mystery Babylon.\n\n#3. It is the KEY Commercial Nation and Engine of Wealth for the World’s Economy\n\nIsaiah 47:15. Revelation 17:2; Revelation 18: 3, 9, 11-13, 15, 16, 17-19, 22, 23, & 19:2. In these passages we see just what relationship Babylon enjoys with the rest of the world. Here she is clearly the critical factor in the world economy. When she goes down in flames…what is the lament? \"What was like unto this mega city? Who will buy our goods now that she is gone\"? The answer is that no one will be able to buy the products of the world’s merchants. What does this tell us??? It should be a clear warning indicator that whoever this nation is… the rest of the world depends on her for buying their merchandise. With her destruction, there is no one left to buy these goods. That tells us just how vital this nation is and it means this nation is the engine of wealth for the world. Now, Iraq does NOT now nor can it fit that role…at least in the next 30 years, unless the rest of the world is wiped out first. Once again, we see a character trait that Iraq does not exemplify in anyway, shape or form.\n\n#4-#21. It is the principal Commodities Trading Center\n\nThese are all commodities in a list that are the chief trading products as cited in Rev 18:11-13, for which the merchants and sailors later lament that no one will buy these products anymore. This includes Gold, Silver and Copper. Now on these items alone… there is more Gold traded in New York City on the COMEX in one day than in all the rest of the world combined !!! The same is true for Silver and Copper and Crude Oil. In fact, the volume of trade is so heavy that in one day alone there is more gold traded than had been traded in all of human history up until 1974 when gold trading was allowed on a futures contractual basis. That is how massive and dominant the USA and NYC are in the commodities trading markets. Revelation 18: 12 & 13, lists many other commodities as well, including grains and livestock. Now, Chicago is the Host City for such record trading in that arena. It too is a port city on as it sits on Lake Michigan. The fact of the matter: Iraq has no economic power… it has no ability to be the economic engine of wealth for the whole world. If Iraq vanished from the face of the earth today it would not even cause a ripple in the world’s economy.\n\nHowever, if the USA vanished today it would decimate the world’s economy and bankrupt every nation on earth, instantly. In essence, there would be no one left to buy the foreigner’s goods. That’s because no one else wants to import goods. They only want to export not import. The USA is the big promoter of international trade and promotes imports plus free trade. Iraq plays no such role in the world economy. As a nation, Iraq is simply too poor.\n\nRevelation 18: 11, 17-19. These passages tell us the economic picture of this nation. Note that this nation is not only involved in the trade of these products, but that she is also the leading importer… because when she is destroyed…\"no one buys\"… their merchandise anymore. The folks doing the lamenting are the international merchants who export goods to this mystery Babylon. Therefore, she is the leading import nation. She is therefore, by virtue of her importer status, the chief consuming nation. This also is not a description of Iraq. Iraq has no such status in the world today, tomorrow or the foreseeable future! It is this aspect which negates the Iraq theory…because the contention is that we are living in the \"last days\" and the fulfillment of the end-times prophecies are at hand. IF this is true, and I assert that it indeed is true, then how can Iraq match these character traits in so short a span of time??? Answer: she can’t. Iraq is not the nation being described. There is only one nation that fits these traits, and more. That nation is the United States of America.\n\n#23. She is also a manufacturing nation\n\nRevelation 18: 22. This passage tells us manufacturing is no longer found in her after the judgment. This tells us that she was a manufacturing nation prior to her destruction. Iraq is not a nation noted for manufacturing.\n\nRevelation 18: 3, 23; 19:2. Her merchants were the mega-merchants of the earth. This again does not fit the character traits of Iraq. It does, however, fit the picture of America.\n\n#25. Known as the World’s \"policeman\"\n\nJeremiah 50:23 gives us a Hebrew idiom, \"hammer of the whole earth.\" It had been used at one time to describe the way the empires of Persia, Greece and Rome had applied their power to keep the world at peace. Today, after the decline and fall of the Iron Curtain, major news media refer to America as the world’s policeman, in the same kind of role that the Hebrew idiom references. Iraq does not fit this role.\n\n#26. Known for \"showing the flag\" or \"gunboat diplomacy\"\n\nIsaiah 18:1-2 Here we have two Hebrew idioms for the idea of a nation’s navy showing its power. The phrase in verse 1 relates to the idea of \"air travel.\" The first phrase of verse 2…\"that sends ambassadors by the sea,\" another Hebrew idiom for when ancient naval powers would send warships to \"show the flag\" of friendship or threaten war to unfriendly nations or cities. Today, one nation engages in such actions: The USA sends out naval units usually as aircraft carrier battle groups. The notion of verse 1 with air travel, combined with verse 2 and the naval aspect, thus combines to send a notion of naval and air power… or suggesting aircraft carriers!!!\n\n#27. Noted for its elegant, luxurious, refined and rich lifestyles\n\nIsaiah 47: 1-8; Revelation 17: 4-5; 18: 2 –24. This does not match up with Iraq, as it is not capable of reaching such levels of wealthy living standards in our lifetime.\n\n#31. Intoxicating high-society lifestyle as a world example to emulate\n\n#33. Noted for its bright gaudy-colored lights and nightlife with round the-clock partying.\n\nRevelation 18:14. Note the words \"dainty\" and \"goodly.\" Dainty is a word in Greek that connotes to 24-hour parties, and is connoted with orgies and debauchery. The word for \"goodly\" is the Greek word \"lampra\" from which we get the English word for lamp. In this case it carries the idea of bright, gaudy-colored lights, with idea of \"glitzy\" lights. Could it be the bright lights of Broadway, Times Square or perhaps even Las Vegas???\n\n#34. Noted for its Drugs and Drug use\n\nIsaiah 47: 9, 12. Revelation 18:23 Do we even need to comment on this one??? I think not…the text clearly speaks for itself on this one.\n\n#36. Noted for being Wasteful and Extravagant\n\n#39. Unique and awe-inspiring from its birth right up to its demise\n\n#41. Respected-envied and yet HATED by the whole world also\n\n#44. Land of Rebels in its birth\n\n#50. Where the world’s leaders \"stream\" to meet\n\n#51. Last of the Super Powers\n\nJeremiah 50:12; Rev 17:18, 19; and in the Revelation 18:18 passage \"what city is like the ‘mega’ city\"…\n\n#54. Occult aspects, especially within the governmental leadership\n\n#55. Alliances/Treaties allowing physical military bases of operation for the Satanic forces.\n\nRev 17. Robed woman with a cup-like container in one hand that smells like natural gas odors inside the container…and the woman is connected to water and immigration…and is considered to be a mother-figure of spiritual prostitution…a.k.a. Ishtar, the mother of ‘literal’ and ‘physical’ prostitutes within religious worship centers. That is what the Babylonian goddess Ishtar was--the promoter of physical prostitution… salvation by sex… have sex with a temple priest or priestess and you are purified from sin. And of course, you pay a ‘gift offering’ for this salvation activity. Ishtar was never a physical ‘mother’… but rather a ‘madam’ over the priestesses. Ishtar was never married and never had a child but she was called \"mother\" of the temple priestesses. Now having said all of this… I am referring to the Statue of Liberty.\n\nIn my book, \"America, The Babylon\" Vol. 1, I explain the meticulous research involved that shows that the Statue of Liberty is, in fact, the brainchild of the sculptor Bartholdi. Later in Volume 2, you will find even more data on this subject. I would like to note at this point that it was Bartholdi's idea to create the image of the goddess Liberty of Rome. You will see later on in Volume 2 just how the Romans had in fact borrowed the Babylonian goddess.\n\nBabylonians first worshiped Ishtar the goddess of Babylon and the Romans also adopted her but they changed the name to Libertas in Latin, (Liberty, in English). So that, the Statue of Liberty is actually a pagan idol image of Ishtar--the woman pictured in Revelation 17. If you don’t believe it…look at Revelation 17: 4 & 5. Note the word for abomination. The word used here is \"bdelugma\" and its root word is \"bdeoh.\" Strong’s Code # 946 … \" A foul thing, detestable, usually of idols … the root word means to \"break wind\", or to \"pass gas\"… indicating the odor smells like natural gas.\n\nSpeaking of natural gas …did you know that the torch-cup of the Statue of Liberty burns an eternal flame…fueled by smelly natural gas? Also of course, the Statue is referred to as the Mother of Exiles … an immigrant connection…just as the woman of Rev. 17: 1, 15 is also connected to immigrants. So too was Ishtar. She was the goddess of personal freedom … and an encouragement to immigrants.\n\nIraq is now extremely \"radioactive\" because of America's use of ammunition that uses depleted uranium, the same basic component used for nuclear weapons, only in lesser strength in and of itself. Rifle bullets and artillery shells were packed with small amounts of radioactive, depleted uranium. Once fired, the shells and bullets spread small doses of radio-activity throughout much of Iraq and especially in hot spots like ancient Babylon. Each bullet or shell, was thought to be seemingly harmless in terms of radioactivity. What was not anticipated was the voluminous use of such radioactive materials scattered across the battlefields of Iraq. Such voluminous use has created large quantities of low-level radioactivity that in volume has created a dangerous atmosphere and environment for virtually all of Iraq.\n\nThe radioactive dust has found its way into the soil and water supplies, contaminating every-thing it comes into contact with. The radioactivity levels are high enough that Iraq is experiencing contamination levels much like that of a \"nuclear dirty-bomb\" in terms of the after-effects. Not only are Iraqi's dying from exposure but so are US and allied soldiers.\n\nUranium is a very reactive metal, easily oxidising to U3O8 and UO2.\n\nA single 120mm Abrams tank DU shell contains 3kg of U-238 (111MBq of activity) and there is 275g (10.1MBq) in a 30mm GAU-8A A-10 Thunderbolt cannon shell. These ‘penetrators’ explode on impact, with up to 80% conversion to tiny long-lived glassy beads of Uranium Oxide from these ‘hot particles’ can travel for very large distances, even hundreds of miles, under the influence of wind, fire and are easily resuspended. The smaller particles can easily pass through the lung into the blood and lymphatic system.\n\nDepleted Uranium has a half-life of 4.5 BILLION YEARS! Radiation levels in Iraq are between 1,000 and 1,900 times above normal. That's 1,000x to 1,900x more than normal.\n\nWould you want to build the world's capital city on top of that kind of radiation rating with a half life of 4.5 Billion years of radioactivity??? We think not. So does the Illuminati. Here's further technical information on depleted uranium.\n\n\"On impact, uranium penetrators burn fiercely to give an aerosol of sub micron diameter oxide particles which are largely insoluble and remain in the environment for many years. There is considerable public and scientific concern that these radioactive particles may remain suspended for long periods, or may become resuspended and are therefore available for inhalation by non combatants at some distance from the point of impact. Little research seems to have been carried out on the distance traveled by the uranium aerosols. The military maintain that the uranium remains near the point of impact, and the Royal Society report (2002) also states that the material does not travel more than some tens of metres. On the other hand, measurements of uranium in local populations in Kosovo some nine months after the use of uranium weapons all tested positive for depleted uranium in urine (Priest 2004) and The United Nations (UNEP) found uranium particles in air filters in Bosnia some years after its use. The question of the dispersion of uranium aerosols from the battlefield is of significant legal interest, since if a radioactive weapon resulted in the general contamination of the public in the country of deployment or elsewhere, the weapon would be classifiable as one of indiscriminate effect. There is now conceded to be no safe level of exposure to radiation. Further, there are major scientific questions over the risk models used to assess the health effects of uranium particle exposure from weapons use. In addition there is evidence of ill health in many of those exposed to uranium particles from Gulf veterans to the population of Iraq.\"\n\n\"Terry Jemison at the U.S. Department of Veterans Affairs stated in August 2004 that over 518,000 Gulf-era veterans (14-year period) are now on medical disability, and that 7,039 were wounded on the battlefield in that same period. Over 500,000 U.S. veterans are homeless.\"\n\n* In some studies of soldiers who had normal babies before the war, 67 percent of the post-war babies are born with severe birth defects - missing brains, eyes, organs, legs and arms, and blood diseases.\n\n* In southern Iraq, scientists are reporting five times higher levels of gamma radiation in the air, which increases the radioactive body burden daily of inhabitants. In fact, Iraq, Yugoslavia and Afghanistan are uninhabitable.\n\n* Cancer starts with one alpha particle under the right conditions. One gram of DU is the size of a period in this sentence and releases 12,000 alpha particles per second.\n\nThe above depleted uranium information can be found at the links below.\n\nFrom Gulf War 1 usage of depleted uranium, the Babylon region had one of the highest ratings of radioactivity levels as late as 1997.\n\nHere's a link to a film on DU in Iraq.\n\n#58 The Messianic Covenant To Abraham Included Babylonia and Babylon\n\nThe promises made to Abraham regarding a Promised Land were for Abraham and his descendants and the lands were far more extensive than ever used by Israel up until this point in time.\n\nOften overlooked by many Bible Prophecy “experts” are the prophecies concerning the future borders of Israel when Jesus Christ returns and establishes new borders for Israel’s Millennial Kingdom that will finally fulfill the promises made to Abraham and his descendants.\n\nIsrael’s future borders will be extended eastward to encompass much of what today is called Iraq. The area will include all of the old Hittite and Chaldean Empire. Joshua 1:4 notes that it will include “ALL” of the land, which means the ancient site of Babylon and all of Babylonia are to be part of the new Messianic Israel. Scholars now believe that the Chaldeans originally were the Hittites. Not only is the promise made to Abraham in Genesis 15:18-20 [and the Hittite empire is mentioned (which included Babylon) ] but again in Deuteronomy 1:7 to Moses and again to Joshua in Deuteronomy 11:24.\n\nThese Messianic prophecies come into direct conflict with the identity theory, which proposes that Iraq or ancient Babylon is the Mystery Babylon of Bible Prophecy. The conflict arises because the Babylon prophecies indicate that the land of Babylon and all of her cities and the land will remain uninhabited forever.\n\nIt should also be noted that there are some anthropologists who have strong linguistic and archaeological evidence to support their claims that the Hittites were in fact the Chaldeans with Hititites begin just a different linguistic name for the same people. Such information again, only underscores the assertion that Babylon and Babylonia of Mesopotamia are to be a part of Jesus Christ's Messianic Kingdom and not buried underwater forever as the Mystery Babylon prophecies of Jeremiah and Revelation 18 indicate because those prophecies refer to a different, end-time super-power that exists outside of the Middle East.\n\nWe simply can't have the Millenial Kingdom of Christ and the Israeli boundaries including the lands of Mystery Babylon which are to remain uninhabited forever and under water. Keep in mind that all of the millennial kingdom will be inhabited and prosperous. Clearly, we can not have a destroyed Mystery Babylon being part of Christ's Millennial Kingdom.\n\nIf Mystery Babylon is Iraq and ancient Babylon then it cannot be part of the Messianic Kingdom of Jesus Christ because it cannot be both occupied and unoccupied at the same time. The prophecies dealing with Babylon's judgment tell us that this future Babylon will never be inhabited again and will be under water. If, Babylon of Iraq is the \"Mystery Babylon\" then we have a clear-cut contradiction for which the Bible never contradicts itself. The contradiction is a result of misunderstandings, misapplications, and misinterpretations of the scriptural passages to Iraq as Mystery Babylon when clearly, there are 60 reasons - why Iraq can NOT be Mystery Babylon. Thus, we have no contradiction once we rule out Iraq and ancient Babylon as the future Babylon of prophecy.\n\n#59 America Conquered Iraq and Babylon in 2003 and retains strategic control of that land and will retain that control most likely until America, the Babylon is destroyed in Divine Judgment as the Mystery Babylon.\n\nIn March of 2003, The United States of America launched an invasion and military conquest of Iraq. America captured the ancient archaeological site of Babylon. America retains strategic control of that region as well as the actual nation of Iraq which was the originally Babylonia of Nebuchadnezzar's day. Iraq and the ancient ruins of Babylon are under the strategic control of American military forces with a puppet government that appears to be splitting Iraq into three separate regions. There is now talk of being forced to realize three separate regional entities that will no doubt become \"protectorates\" of the United States, much like Guam became a protectorate after World War 2 or Puerto Rico after the Spanish American War. During the war, America trashed the ancient archaeological site when it established \"Camp Babylon.\" There have been reports that the United States military spirited away from Babylon and Iraq's Museum of Antiquities, key occult artifacts that may well be the fulfillment of the Isaiah 47: 12-13:\n\n12. - Stand now with thine enchantments, and with the multitude of thy sorceries, wherein thou hast laboured from thy youth; if so be thou shalt be able to profit, if so be thou mayest prevail.\n\n13. - Thou art wearied in the multitude of thy counsels. Let now the astrologers, the stargazers, the monthly prognosticators, stand up, and save thee from these things that shall come upon thee.\n\nLet's not forget also Zechariah 5: 5-11, as we hear of stories in which the US Military and Black Operations Intelligence Groups such as the CIA, DIA and other covert intelligence units may have spirited away certain occult artifacts and put them aboard giant cargo planes and air-shipped them to the United States to join other occult symbols such as The Statue of Liberty and the Goddess of Freedom atop the US Capitol Dome. Do you recall that just after the US took Baghdad, the Iraqi Museum of ancient artifacts was vandalized by thieves shortly after US soldiers on guard were pulled out? Reports indicated that before the general public began looting the museum, special ops forces dressed in black with ski masks entered the building and raided the locked vaults containing secret occult artifacts of ancient Babylon. These have never been returned but most of the remaining looted items have been located and either returned or in the process of return.\n\nWe also understand that on Easter Sunday of 2006, an occult ceremony was conducted in secret by US intelligence agents in conjunction with a US military guard and waiting nearby giant air cargo transport planes. This secret operation reportedly involved occult ceremonialism and the removal of key on-site artifacts. Let's see if the Zechariah passage might just fit with such stories.\n\n5 - Then the angel that talked with me went forth, and said unto me, Lift up now thine eyes, and see what is this that goeth forth.\n\n6 - And I said, What is it? And he said, This is an ephah that goeth forth. He said moreover, This is their resemblance through all the earth.\n\n7 - And, behold, there was lifted up a talent of lead: and this is a woman that sitteth in the midst of the ephah.\n\n8 - And he said, This is wickedness. And he cast it into the midst of the ephah; and he cast the weight of lead upon the mouth thereof.\n\n9 - Then lifted I up mine eyes, and looked, and, behold, there came out two women, and the wind was in their wings; for they had wings like the wings of a stork: and they lifted up the ephah between the earth and the heaven.\n\n10 - Then said I to the angel that talked with me, Whither do these bear the ephah?\n\n11 - And he said unto me, To build it an house in the land of Shinar: and it shall be established, and set there upon her own base.\n\nRegardless of such stories, the fact that America retains strategic control of the land means that from a prophetic standpoint, America IS Babylon. But if you don't wish to believe even this, consider ...\n\nTHE MOST LITERAL OF ALL\n\n#60. A Populated city named Babylon on a Deepwater Port entryway to New York City\n\nRevelation 17:18; & 18: 11-19… Did you know that when ships coming in to the harbor facilities of New York City make their final approach to the Harbor channel shipping lanes…they have to come in from the south… heading due North straight for a spot on Long Island called … BABYLON !!! That is right. The city of Babylon, New York features a tall water tower that ship captains use to navigate directly into the harbor channel. They come within view of Babylon before turning west to head into the ports of New York City. It is from this vantage point that I believe Revelation 18: 17-19 takes place.\n\nFrom this vantage point…on the deck of a ship…one could quite easily read the letters of the name Babylon on the city water tower!!! Talk about literal?? Now that is indeed literal. This is something that theorists who promote the Iraq = Babylon idea can’t match, because ancient Babylon is not a deepwater seaport. It's so far away from the ocean that it can not possibly fit the description of Revelation 18: 17-19… in no way. But the USA can… and especially its chief city… a seaport named NYC/Babylon. Also, Babylon on Long Island derived its name because immigrant Jews founded it in 1872. The group’s rabbis chose the name almost prophetically, because they believed it would be home to a new diaspora.\n\nWhy would they think this? Because rabbinical opinions had held that ancient Babylon’s power would be moved… Zechariah 5: 5-11… and Isaiah 18:1 tells us what direction it would be moving. Isaiah 18:1 says that the spirit of Babylon would move west of the most outermost boundaries of ancient Babylon’s western-most border, beyond the rivers of Ethiopia and Egypt. [That is what is meant by the KJV term \"Ethiopia\"] By virtue of Isaiah’s point of observation being from Jerusalem…then the direction of movement was westward from Jerusalem…beyond the most outer of Babylon’s oldest boundaries… meaning… the occultic power that fueled Babylon would move and take up residence elsewhere in the end times.\n\nThus, scripture itself negates the \"Iraq = Babylon\" theory. Why will our \"expert\" scholars not accept the scriptural passages on this? Is it due to Pride? Is it due to ignorance? However, it seems to me that their hypocrisy shows. Clearly, the only logical interpretation from scripture is that it literally cannot be Iraq because the text tells us it moved. Isaiah 18:1-7 and Zechariah 5:5-11.\n\nEarly rabbinical writers commented on this well before the time of Christ. They made note that the \"mystical woman of Babylon\" had moved out of the Babylonian Empire and had been taken westward beyond the ancient boundaries of Babylonia. Those most westward boundaries were considered to be Egypt and Ethiopia. The woman was taken west of those two countries. They noted that the woman would not be found in its old location of Mesopotamia for the fulfillment of the final prophecies, which would be fulfilled at the coming of Messiah.\n\nThese rabbinical commentators believed that a future Babylon that was prophesied by Isaiah and Jeremiah would be located west of Egypt and Ethiopia. They believed the woman of Zechariah 5 was headed west of those boundaries and hence out of uttermost regions of Babylonia/Shinar/Chaldea. Yes, they believed she was being taken west of Egypt and Ethiopia in that basket. Why? Note that the observer's vantage point was already in the land of Shinar.\n\nShinar is yet another term for the ancient nation of Babylonia or Chaldea. Therefore we must pay attention to that scriptural direction and realize that it must be a new nation that carries the old Babylonian character traits. You'll note that the verse is indicating it is a different Shinar than the Chaldean or Babylonian land called Shinar. How do we know that? Isaiah 18:1-2 tells us from the observer's vantage point of Jerusalem that the phrase beyond the rivers of Ethiopia is an ancient idiomatic reference to the farthest borders of Babylon at the time of Cush, father of Nimrod. Nimrod inherited that land from his father and so that Egypt and Ethiopia were the extreme western border of Babylonia or Shinar or Chaldea.\n\nNow, Isaiah is telling us that a future Babylon would exist at the time of the coming of Messiah and it would be located beyond the old Babylonian Empirical boundaries of Egypt and Ethiopia, which was the Cush empire that Nimrod inherited. It too was Shinar. Zechariah is then referencing that the woman is being flown out of Babylonia/Chaldea/Shinar to a new land of Shinar. This confirms what the prophet Isaiah had written earlier concerning a future Babylon being located west of the old Babylon.\n\nThere is reportedly a team of archaeological experts preparing to publish the results of many years of work in which they claim to have documentation that the Babylonians occupied North America and Mexico as colonies as early as around 3,000 BC. If this were true then it may further highlight and underscore the reason for these statements made by the prophets and the rabbinical commentaries.\n\nWe do know this…that the nation being referred to is none other than … … America, The Babylon.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["/2026-in-prophecy/", "https://mistape.com", "https://escapeallthesethings.com/60-reasons-iraq-not-mystery-babylon/print/", "https://escapeallthesethings.com/60-reasons-iraq-not-mystery-babylon/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/gaza-pullout-end-times-timeline/", "https://escapeallthesethings.com/prince-william-antichrist/"], "authors": [], "publish_date": null}