{"result_id": "109025", "URL": "https://escapeallthesethings.com/psalm-83-gospel-insight/", "timestamp": "2023-04-25 15:03:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/psalm-83-gospel-insight/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Mideast Nuclear War – New Insight Confirms 2022 and 2024? – Escape All These Things (Luke 21:36)", "cleaned_text": "Psalm 83 predicts more than just the next end-time event. When I asked God if my date 2022 projection was going to fail, he showed me the next prophecy after that in the last three verses that are parallel to the prophecy Jesus gave as the preparation before the end comes... And later gave someone I trust a specific date...\n\nAs the main article below (published in March) relates, I prayed for confirmation about \"April 2022\" as the deadline by which Damascus was destroyed, then just over a year away, and received encouraging new revelation from God on Psalm 83 in response.\n\nSoon after that confirmation, a saint who I fellowship with messaged me. They had received a word about the exact date of the destruction of Damascus \"400 days\" from the day they received the word! However, the date did not fall in April as I had in mind. This gave me some trouble at first until I prayed about it. Then two things came to light:\n• The date was still in the same timeframe of Spring 2022 which is all God may have intended to confirm below.\n• After that, I searched through all my articles for the word \"April.\" To my surprise, I learned that I never specified exactly April as the war timing. What I had written in my main article on the topic was \"The end of Damascus can happen before or after Zach's healing [in April]\". I think April got stuck in my head because I had talked about the war so much in fellowship that I began saying \"April 2022\" as shorthand for the timing.\n\nShortly before or after April of any year would be best referred to quickly as spring. Spring 2022 is the original deadline by which I expect Damascus to be gone. That's what I wished to make clear in this update. I'm sorry if I confused anyone (after confusing myself).\n\nHonestly, I expected to simply wake up one morning with the news that Damascus was destroyed. I expected to take it on faith without further confirmation. So to have not just one but two now from two different sources is very humbling. For me personally, this matter is established. Take it to your prayer closet and ask God for your own confirmation and more importantly, what you should do about it if it's true that the kick-off event to the end time timeline is imminent.\n\nApril 2022 Is Under A Year Away 🙁\n\nA few years ago, I shared publicly my conviction on a deadline for the destruction of Damascus (Isa 17 = Ps 83): April 2022.\n\nAs the time left for this deadline was whittled down to only a year or so, I felt some anxiety. Would I turn out to be wrong and branded a false prophet by those who glossed over the fact that I never said “thus saith the Lord” but was only sharing my conviction for their consideration to take to their prayer closet? It was a real possibility. As Paul said that we “see through a glass darkly” when it comes to what we hear from God (1Co 13:12). We may easily misunderstand, get it wrong, and have a humbling “learning experience” when we put ourselves out there regarding what we are convicted that God has shown us.\n\nAs is my custom with nearly everything, I immediately talked to God about it. I told him that if I misunderstood what he had shared with me then I will look like a fool, just another failed date-setter but that’s OK, I can accept that. When you follow God be prepared to look wrong or foolish some of the time, just like the Israelites did as God led them into a dead-end at the shore of the Red Sea with the Egyptian army bearing down on them.\n\nGod’s response to that thought floored me. A few days later when I was unable to sleep I opened up my Bible to continue reading through it in the hope of finding some comfort. I was in the psalms and happened to reach Psalm 83, the prophetic psalm about this coming Mideast nuclear war that ends with the destruction of Damascus. I know it so well that I was tempted to skip it, not expecting to find any comfort for my suffering there. I reread it anyway, and, to my surprise, I saw something new and exciting I had completely missed until now…\n\nSo how did I get myself in this position? To be sure, I never wanted to be a “date-setter.” Long-time readers will remember the many articles I have written to debunk popular prophecy theories attached to dates (like 2012, the Shemitah, the Revelation 12 Woman). Even as early as after “Y2K” (Jan 2000), I could see how obvious it was that as soon as someone published a prophecy theory with a date attached to it the theory was destined to fail and be proven false every time. No exceptions. Therefore to set a date of my own for a Bible prophecy was the last thing I wanted to do.\n\nBut God got a hold of me and changed my thinking that it was foolish to ever set a date. I got there by an unexpected turn of events in my life. Starting in 2012 to my surprise God began to give me dreams about my and my family’s future and even the end times (see my Support Team content to read them). Through some reasonable deduction, a couple of the dreams seemed to reveal the timing of this very first event on my Revelation Roadmap end time timeline, the Mideast Nuclear war that leaves Damascus a ruinous heap (Isaiah 17:1).\n\nI doubted that this revelation on timing was some reward just for me. I felt I was to share it—not with the world, mind you, as if to warn everyone like some kind of watchman which I am not. Rather, only with those readers who valued my work enough to support it. Those were the ones who could possibly entertain the idea that God gave me a date to plug into the timeline he had helped me put together. I already knew well the value of having a real approaching date attached to a prophecy to make people pay better attention to God’s word. We’re all distracted by the cares of this world and could use a sense of urgency to convict us to prepare spiritually for the end. Sharing my conviction on timing could provide a valuable benefit for readers, which is why I considered going against my better judgment on date setting.\n\nStill, in my mind, only someone who is not familiar with the failed track record of Christian date-setting would put out dates of their own. I did not want to be a fool.\n\nDate Setting As A Red Flag Depends On Its Rationale\n\nMy dreams got me to see something I was missing in my conclusion after decades of debunking prophecy dates theories. Namely that prophetic dates always fail and only fools set dates. That was not accurate. I saw instead that the real problem was that all of the popular theories that readers asked me to debunk were conceived by taking Bible verses out of context and making humanistic reasoning on their meaning or timing based on some arbitrary calculation. These always failed because the human mind does not see the future. The prophets and saints in the Bible came up with dates differently. When giving timing for a prophecy, it always came by divine revelation from the only One who does see the future.\n\nFor example, Joseph’s prophecy of seven years of plenty followed by seven years of famine came directly from the dream God gave Pharoah. As you may recall, Pharaoh’s dream pictured seven healthy cows and seven healthy heads of grain along with seven thin, sickly cows and seven thin, scorched heads of grain. Joseph did not have to invent anything or read into the Word of God to make his date-based prediction about what was going to happen over the next 14 years in Egypt.\n\nIn other words, I was reminded from my own dreams that date-setting of itself was not wrong as I thought since the prophets themselves sometimes set dates. The problem was date-setting based on humanistic reasoning apart from revelation from God.\n\nIronically, the only prophecy theories that spread widely were those with some persuasive argument for why they must happen at such and such a time. This makes sense as you are not likely to put much stock in what a stranger on the Internet says God told them. You cannot verify that. Yet if they pull verses out of context in the Bible and give you an intriguing explanation for why they are about some planetary conjunction coming in a few months, you can follow their deductions and come to the same conclusion. At least to the point that you are left afraid to just ignore their theory in case they are right. Uncertain either way, you then forward it to your friends to ask their opinion...who then do the same, making it go viral.\n\nThe New Insight Into Psalm 83\n\nSo what did God show me about Psalm 83 that I had missed all these years? It had to do with the final three verses: 16-18. Once the prophetic description of the outcome of the Mideast War ends in verse 15:\n\nDo you see anything strange about the psalmist’s requests in these verses? What I noticed for the first time that night was how these verses implied there were three results from the war:\n• People would see some connection between the defeat of Israel’s enemies with nuclear bombs and the hand of God.\n• That the enemies of Israel just burnt up or even those left alive watching would seek God.\n• That they would know God’s personal name.\n\nNone of those apparent outcomes of the war made sense to me. You would not expect the unleashing of weapons of mass destruction on people for them to learn anything, or for those watching to conclude that God was involved, or to seek him. Least of all would you expect God’s personal name to be learned from it.\n\nThe next moment it came to me that these verses are not implying that the war directly causes any of this. These verses are instead merely telling us that the war is a prerequisite or dependency for a following prophetic event that will accomplish all three of those requests of the psalmist.\n\nWhat’s next, even on my timeline, is not definite from the clues in end-time prophecy. The grave loss of life from the Psalm 83 war causes Israel to open up immigration for non-Jews. This allows saints of all nationalities to move to the place of safety in Judea when the time comes. It also allows for the Third Temple to be built although no prophecy tells us when exactly that happens, only that it must happen before the Great Tribulation. Yet before the temple is built and before saints begin to move to Judea, I would argue that the next prophetic event is the one that Jesus said signals the end:\n\nI’m convinced that Elijah is the one who will restore that good news that Jesus taught but Christianity does not. Elijah already must appear as the one who calls the saints to Judea (Mal 4:5-6=Joel 2:32). I believe the warning call to gather is sent out along with the gospel of the kingdom.\n\nHow does this connect to Psalm 83? One thing I have known for a long time is that Elijah restores the knowledge of God’s name that the prophets of the Old Testament used: YHVH or, with the full vowels, “Yehovah”. Joel 2:32 tells us that the survivors in Judea called there will know God’s name and call upon it. This requires a prophet to reveal and teach this since Christianity does not know or teach God’s name and Judaism has a tradition of suppressing God's personal name.\n\nThat’s how the answer to the Psalm 83:16-18 mystery came to me. It says twice that after the war, people will seek and know “your name [is] Yehovah.” Nowhere else in the Bible can you find a prophecy where it says that “...God, whose name is Yehovah,...” It’s just assumed in every passage that this is known. Psalm 83 seems to prophecy when it will be taught to the world that, “God is the most high over the whole earth, whose name, by the way, is Yehovah”. This for me is a clear reference to the work of Elijah in preaching the Good News of the Kingdom. I expect Elijah to do this in Israel after the war opens up the borders for him and those who respond to his call to relocate there.\n\nBy the way, the year I expect the Good News of the Kingdom to go out is 2024. It continues until 2026 when Wormwood hits and ends civilization and the Internet infrastructure used to spread the Gospel into every country (and even if not everyone has internet access, TV, newspaper, and word of mouth takes care of the offline population once the internet delivers it to their country). At that point, the baton of continuing the witness across the world goes from Elijah to the specially protected 144,000 who spread it by word of mouth like the apostles did. That’s why I say Psalm 83 may give us the events of both 2022 and 2024.\n\nWas God Reassuring Me About 2022?\n\nFor me, this is not just an exciting revelation for a fuller understanding of a key prophecy that I get to share with you. I also feel it is God’s answer to my prayer above about whether I should brace myself to look like a fool or a “false prophet” should no Psalm 83 fulfillment happen over the next year.\n\nThis of course is highly subjective and open to interpretation, but for God to expand my knowledge on the very prophecy I asked him about struck me immediately as intended to give me reassurance. Something like:\n\n“Don’t worry, I got you, Tim. In fact, let me reveal even more about this prophecy that you’re asking about because it is indeed coming soon on schedule. It’s time you understood it fully.”\n\nAnother reason I think this insight was sent now to confirm the timing is that I don’t get insights like this frequently anymore. It has been a long time since I have gotten one. They used to come regularly, enough to write an article based on a new insight almost every month. When I entered my season of trials in spring 2020, the insights stopped coming. I did not have to wonder why. I knew God was not wanting me to worry about writing for a time so I could focus on how he was teaching and growing me up in faith and in other matters. I have prayed a long time for “gold refined in the fire” (Rev 3:18) and it definitely came in this season. Insights on prophecy were replaced with insights on overcoming anxiety, fear, loss of control, and how to trust God for more things than I ever imagined (like sleep when my insomnia is bad). If you noticed that my writing and email output has slowed during this time period, this is why.\n\nOnce again, I could very well be wrong as God has never spoken to me or given me a vision of a bright neon sign saying “Isaiah 17 happens in 2022!”. All I know is that with this coming sabbath year cycle of 2024-2031 things continue to develop in the world (2 Tim 3, COVID-19) and my own personal life (hard testing, meeting prophets) that never did in the lead up to any of the other cycles I was watching (2003-2010; 2010-2017; 2017-2024).\n\nIt's up to you to seek God yourself on this in light of what the Bible teaches on proving all things (1Th 5:21) and judging every prophetic word shared in the church body carefully (1Co 14:29).\n\nIf you hear also that time is short, then I encourage you to use that as inspiration to seek God on what to do to prepare spiritually so that when you wake up that morning in 2022 with the confirmation in the news that the end really is nigh, you will at least know you are as ready as you could be. If you want help, my support team articles have plenty of guidance on areas of repentance to trust God for answers and guidance like he gives me more and more regularly.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/400-days-damascus-word/", "https://escapeallthesethings.com/2022-dreams/", "https://escapeallthesethings.com/support-team-options/#content", "/depart-from-me-i-never-knew-you-meaning/", "https://escapeallthesethings.com/elijahs-coming-and-immigration-to-israel/", "https://escapeallthesethings.com/faith-to-escape-tribulation/", "https://escapeallthesethings.com/third-temple-prophecy", "https://escapeallthesethings.com/mt-24-14-meaning", "https://escapeallthesethings.com/2022-dreams/", "https://escapeallthesethings.com/144000-woman", "https://escapeallthesethings.com/last-days-people-prophecy/", "https://escapeallthesethings.com/holy-spirit-activation/", "https://escapeallthesethings.com/support-team-options/#content", "https://mistape.com", "https://escapeallthesethings.com/psalm-83-gospel-insight/print/", "https://escapeallthesethings.com/psalm-83-gospel-insight/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/america-vs-salvation/", "https://escapeallthesethings.com/400-days-damascus-word/"], "authors": [], "publish_date": null}