{"result_id": "109006", "URL": "https://escapeallthesethings.com/mark-of-the-beast/", "timestamp": "2023-04-25 15:03:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/mark-of-the-beast/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "The Mark of the Beast – If You See It, It’s Too Late (Not COVID Vaccine) – Escape All These Things (Luke 21:36)", "cleaned_text": "If the Antichrist is the most dreaded threat of the Book of Revelation, then his mark would have to be a close second. Just as people wonder who might be the Antichrist today, they also wonder whether the Mark of the Beast is already here, such as in the COVID vaccines or passports. As a result, the following passage from Revelation about the Mark of the Beast is one of the most quoted passages in the Bible:\n\nThe Mark of the Beast Passage\n\nThis passage is talking about the Great Tribulation (Mt 24:21) or the time when the Antichrist (or first Beast of Revelation 13) rules the entire earth. The second beast of Revelation 13, also called the False Prophet (Rev 16:13; 19:20; 20:10), will put in place a system of total control. They will attempt to brand every human with a mark that is needed for commerce. Obviously, without being able to buy or sell anything, you are not going to function in society or last long.\n\nIt's very important to note two things that everyone seems to ignore: the mark cannot be here until the Antichrist and False Prophet rule. Most mark theorists overlook that.\n\nNot A Warning to Bible Readers! (New Insight)\n\nMore importantly, everyone misses that this passage is not a warning to us, the readers about the mark. It is a prophecy of a warning being proclaimed to the entire world at the start of the Great Tribulation! It goes out because the mark is then present. The warning prophecy gives readers a concept of what it will be like, but not enough detail to figure out exactly what it will be in advance; yet there's no need to, right? When it is here, then the warning will go out. Also, there will be no need for more \"clues\" to identify it as it will be made plainly clear that the mark is what the False Prophet is pushing on people. See how different that is from speculating about what it is today? You see then, there is no need to worry about the mark being here today nor any pressure to identify it now. You can't take it, and \"precursors\" (if such a thing were to exist) don't count!\n\nDespite the negatives to refusing the mark, it's plain from another passage that you do have the freewill choice to do that:\n\nThis passage should reassure those who worry that they can be tricked into taking the mark or forced to take it without their permission. It seems that the False Prophet will need your permission. Otherwise, there would be nobody who \"had not accepted the mark.\" The bad news is that they will not accept your response of \"no, thank you\" kindly. They will try to persuade all people to take the mark through at least four separate pressures or methods of persuasion.\n\nClick here to jump to the update on Covid in prophecy\n\nFour Powerful Pressures For Taking the Mark\n\nThe first pressure is what Paul calls the strong delusion (2Th 2:11). The Antichrist will actually succeed in pawning himself off as God on earth ruling from the Third Temple in Jerusalem (2Th 2:4). Jesus said that this deception would be so convincing that even the \"very elect\" would be taken by it if it were possible. Thankfully, it's not possible because God intervenes with the Two Witnesses and 144,000 to preach the truth as an alternative to the popular lie (Mt 24:24). Despite God's counter-programming, the vast majority of the people are going to be convinced that the Antichrist is indeed God. This is due to the convincing signs performed at the hand of the False Prophet. These include calling fire down from heaven and making the image (statue) of the Beast that speaks (Rev 13:13-15).\n\nThe second pressure takes care of the minority of defiant skeptics who do not fall for the strong delusion. It appears from the passage above that the False Prophet will command death for those who refuse the mark. This is just as he does to those who refuse to worship the image/statue of the beast (Rev 13:15 = Rev 20:4). Many Christians will have read their Bibles or heard and believed the warning of the mark, but they simply are not martyr-material. They will crumble under the pressure. As Jesus said, the love of believers will wax cold and believers will betray each other to save their own skin (Mt 24:12, 10).\n\nUnderstanding the third and fourth pressures requires a correct understanding of the prophetic roadmap and especially where the Great Tribulation fits in it. Most believe or have been taught that the Great Tribulation begins at the 1st seal. While the white horseman does indeed seem to fit the Antichrist, that's an incorrect conclusion; it actually refers to what Jesus said about the many (religions) that would come in his name, talk about him, and deceive many (Mt 24:5). The real match for the rise of Antichrist and the start of the Great Tribulation is the 5th trumpet. When someone shows you the proof of how the Great Tribulation starts when Satan is cast out of heaven (he has not been cast out yet) as the start of three \"woes,\" the Great Tribulation / 5th trumpet connection becomes pretty self-evident (cf. Dan 12:1=Rev 12:7-17=Mt 24:15,21=Rev 9:1-6, 11-13).\n\nOnce you get that crucial point correct, it opens up the possibility of seeing a couple of other key insights. First, obviously, the 5th Trumpet follows the 4th Trumpet. The 4th Trumpet concludes the sequence of severe global catastrophes on earth caused by near-earth objects (such as Star Wormwood) starting at the 6th seal. This will leave the world in a state of devastation (Rev 6:14; 8:7, 9), fear, panic, chaos (Rev 6:15-16), dark , cold (Rev 8:12), smoke, fires (Rev 8:8-9), water scarcity (Rev 8:10-11) and famine (Rev 8:7, 9, 12). Second, this answers how the Antichrist comes to power. It provides the perfect scenario for the Antichrist as the would-be God and \"Savior of the world\" to appear as the only solution to so many problems—including the severe food shortage. Probably the mark will be presented as part of his plan to solve both the security (identification) and shortages of basic necessities (rationing). (Americans saw a similar thing after the 9-11 attack with the push for a national ID called Real ID.)\n\nThus, the third pressure would be that, given the clear scarcity of food and clean water prior to the rise of the Beast, you will not get your basic living needs met without accepting the mark. The threat of death from thirst and starvation will already be mounting by the time the mark is presented to offer relief. If you do not take it, death will be knocking at the door. Principles and skepticism go out the window in such extreme situations.\n\nBut there are always stubborn, crafty, and prepared people who would still refuse the mark and scratch out an existence \"off the grid.\" There is apparently another, fourth pressure that will take care of even them. At the 5th Trumpet, we are told that an army of deadly scorpion-like locusts with teeth and stingers are released from imprisonment in the Abyss (Rev 9:1-3). Although lethal-looking (Rev 9:7-9), they do not go out to kill people; they only go out to torture everyone except the 144,000 and the other gathered-protected servants of God (Rev 9:4-5; 7:3-4; 12:13-17). It actually says people will seek death but be unable to find it (Rev 9:6). These demonic creatures will be able to search out every nook and cranny where survivalists and other resistors with stashes of food and ammunition are hiding (Joel 2:9). Their fortification, walls, and weapons will not protect them from the locusts (Joel 2:9). The torture will no doubt be very effective in getting them to accept the mark.\n\nThe passage telling us that these tortured people \"will seek death and not find it\" during the five months seems like a contradiction with what we said above that the False Prophet will cause those refusing the mark to be killed. But if you think it through carefully, you'll see there is a resolution.\n\nIt points to a terrifying new realization about the mark that you probably never heard of before: Refusing the mark is not rewarded instantly with death. On the contrary, it is rewarded first with up to five months of torture to persuade you to accept the mark. At the end of the five months of the locusts' torture tour, they finally will put you to death. Why the delay? They may be sadists or they may simply prefer to have Beast kingdom subjects than dead defeated martyrs.\n\nIn summary, then, here are the four pressures on people that will make most people accept the mark:\n\nThe 4 Reasons Why Most People Will Take the Mark\n• To avoid (up to) five months of torture\n\nTerrifying, isn't it? Anyone understanding just a fraction of the pressures coming to push the mark on people will naturally want to know exactly what it is now so they can be sure to see it coming. Actually, we'll see later why it is that if you want to successfully avoid it (and keep your life), you must never see it.\n\nYet people still persist in wanting to know what it is now. The first question, then, is to ask is what is the intended meaning of the passage describing the mark? Should we read it literally, as a visible marking on the skin of the hand or forehead or figuratively as something completely different (such as, say, \"Sabbath-breaking/Sunday worship\" like the Seventh Day Adventists and others believe)?\n\nA big reason for doubt about the interpretation of the mark passage comes from an uncannily similar instruction to ancient Israel recorded in the Torah about a sign/symbol in their forehead and hand (Ex 13:9, 16; Dt 6:8; 11:18):\n\nOrthodox Judaism uses this command to justify their tradition of binding \"phylacteries\" to the forehead and hands. However, most agree that ancient Israel did not follow this verse the way modern Judaism does. Instead, they understood it figuratively as telling them to keep the Torah firmly in mind (\"forehead\") and in their actions (the \"hand\"). If you agree with this interpretation, then it's natural to read the very similar passage in Revelation exactly the same way: figuratively (especially in a book like Revelation that is already assumed to be mostly symbolically figurative).\n\nBut we have to decide how to read a verse individually and in its own context. We cannot assume that every instance of every construct will be used the same, or misinterpretation will result. For example, there are at least three different meanings for the word translated \"star\" in the Book of Revelation alone (angels, meteors/\"shooting stars\", and literal stars)! In fact, the use of similar constructs for different purposes seems to be one of the ways that God made the Bible tricky on purpose as Isaiah and Jesus declared about God's word (Isa 6:9-10; Mk 4:11; Mt 13:11; Lk 8:10; 10:21-24).\n\nWhenever you are in doubt after carefully considering a verse in context, you can usually resolve it by looking at related passages or in other words by looking at it in the greater Biblical context. Revelation 14:9 is another passage dealing with the Mark of the Beast which we can consult for help. Using it, we can dispel any doubt about the literal meaning of the Mark of the Beast.\n\nThis passage is the third of three angel's warnings delivered to mankind. This third message specifically warns everyone about the grave consequences of receiving the Mark of the Beast in the \"forehead\" or \"hand:\"\n\nNow think about the theory of a figurative mark in the context of this dire warning. The unsuspecting general public is going to be given this warning so that they are able to know what to do to avoid God's wrath, a very serious thing indeed. They will need simple clear understandable instructions that they can act on. But a message referencing a forbidden figurative mark is not clear but requires further explanation or thought before people can know what it is they must avoid. This would leave people uncertain and unable to follow the instructions.\n\nIf the warning tells you to reject any future leader who wants to put a literal mark on your skin (forehead or right hand), that's very understandable and actionable. If it's figurative, where the mark can be anything like keeping Sunday vs. Sabbath, how would you be sure?\n\nSince a figurative mark does not work in the warning here, then why did God use figurative language to \"warn\" Israel about keeping Torah in their thoughts and deeds? It worked for that because that earlier hand/forehead sign referenced something that he had already told them volumes about: the Torah. He wanted to communicate to them how integral they needed to make Torah to their life and he did so using a powerful metaphorical illustration. In contrast, the Mark of the Beast warning is a stand-alone command to the general public to whom God has only spoken two other messages ever in total. Metaphorical language does not get the job done. The warning about receiving a \"mark in the head or hand\" can only refer to a literal marking on the forehead or hand which people can readily understand, identify, and know what to do when they encounter it.\n\nBut Wait...If There Will Be a Universal Warning, Why Won't Everyone Just Listen and Avoid the Mark?\n\nWith that question settled by the third angel worldwide warning text, another question is raised. If the warning about the mark is going to be as global and clear as stated above, then why will anyone get trapped into taking the mark?\n\nThis is a simple question with a not-so-simple answer. It requires knowing several aspects of the end times in order to understand it. To help with that, let me outline the distinct categories people will fall into when the mark is out:\n\n3 Categories of People When the Mark Comes\n• Mark rejecters/martyrs (dead or soon-to-be-dead(see below) but destined for the First Resurrection)\n• Mark evaders (alive and destined for the rapture)\n\nThe first two categories are obvious and self-explanatory, but the last one, of mark evader, requires explanation. The mark evaders are obviously similar to the mark rejecters in wanting to heed the universal warning about not taking the mark. However, they differ from the mark rejecters in the two aspects of proactivity and of faith. We shall see that to evade the mark is not as simple or foolproof as it may seem to you now.\n\nBy way of illustration, you could compare it to the challenge of getting a girl to evade teen pregnancy by giving her a warning about it when she is ten years old. She may agree at that age that teen pregnancy is a bad outcome which she does not want. Yet, after she passes puberty, certain temptations must be resisted or certain actions be taken for the teen pregnancy warning to work out well.\n\nSimilarly, when you hear the warning about the mark, you must take a specific action before the mark even arrives. If you do not do so, it will be too late and you will get pregnant, as the analogy goes, or be left with choices 1 and 2 above only. That's the proactive aspect of evading the mark.\n\nThe faith aspect of evading the mark comes in because the action required to avoid the mark will be to \"come out of Babylon\" (Rev 18:4; Jer 50:8; 51:6, 9, 45). The end-time prophecies of the Bible repeatedly speak of God leading his faithful servants out of their home countries to a place he prepares to feed them during the Great Tribulation (Rev 12:12-17). However, it will not be so clear that this is right to do, as it is to, say, exit a burning house when someone shouts \"Fire! Get out!\" Probably everything in the world will look as fine (if you can call it that) as it does today. It will be counter-intuitive.\n\nIt has been my experience that when this clear (future) travel prophecy from the Bible is shared with normal church-going Christians, they reflexively reject it. It sounds ridiculous to the average Christian that God would ever require his people to do something so radical as to leave their homes. Many of them miss the obvious irony in their objection to a future God-given travel command in light of the fact that God has done this very thing repeatedly in the past with his faithful servants as the OT records. He told Abraham to leave his country. Lot had to leave Sodom. He told the entire nation of Israel to leave Egypt. Sure, they were slaves there anyway, but there are many parallels to their literal slavery and our modern slavery to sin, addictions, distractions, etc. in our home countries that an end-time exodus would release us from, too.\n\nAnother reason that faith will tie in greatly is that most likely, the instructions of the three angels will be spoken to people not by the three angels themselves, but by humans; prophets. This probably sounds ridiculous at first but if you read the passage carefully you'll note that it never quite says that the angels themselves do the preaching of their own messages (Rev 14:6). It simply says they \"have\" the messages to be preached. This leaves room for someone else to do the preaching. This phrasing is good because it does not make the passage break with precedent for how angels are tasked by God in the Bible. Angels usually interface only with the righteous or small groups of the public. When God deals with the general public or nations, he uses men exclusively.\n\nI think the answer to which men it will be this time is found, by no coincidence, in the verses immediately preceding (Rev 14:1-5). If you ever wondered who the 144,000 are and why they are given such special protection so that the Beast's forces cannot touch them, this would answer that. Their message of warning must go out without encumbrance to counteract the powerful dragnet that the Beast will be allowed to unleash on humanity. However, like all prophets before them, they are mere men and not as fearsome and compelling as an angel of light speaking before your eyes. People will be able to doubt and ignore the warnings and call to action of the 144,000 men.\n\n\"My pastor said not to go\"\n\nIt should not be hard for the reader to imagine how most Christians will scoff at even a real miracle-working Bible-conforming prophet sent by God telling people to \"come out of Babylon\" per the prophecies. Christians by nature rely on their pastors and other Christians to tell them what is right or what to do. They sincerely believe \"all these churches can't be wrong.\" Thus, when most churches advise people to ignore the crazy prophet message to leave and just stay \"safe in Jesus\" where they are and/or await the \"pretrib rapture,\" it will be largely followed. They will not have the faith or guts to obey the command to leave early enough in order to avoid the mark.\n\nThen, when they actually see the Abomination of Desolation (military takeover of Jerusalem and the Temple by the Antichrist) that they were warned would come, they will want to obey the \"crazy\" instructions they ignored years before. However, if they are not close to the location that God told them to move to, there will be no chance of them making it there in time before the Great Tribulation begins (30 days later).\n\nThe mark edict will soon be issued and they will be faced with the tough choice of option 1 or option 2.\n\nOption 3, of mark evasion, will have expired.\n\nWhy It's Not Already Here\n\nYou may have noticed that this article so far has not even touched on what most articles about this topic center on: speculation about which technology today is the Mark of the Beast. This is what is called \"newspaper exegesis,\" the popular practice of trying to interpret prophecy by the current events. As already covered, the mark does not come until the Antichrist rises after we leave. It's that simple.\n\nThat said, it would not hurt for me to share some other reasons why things popularly pushed as the mark cannot be it. Because, if you had not noticed, practically every popular new consumer technology ever invented, whether it be barcodes, credit cards, bio-chips, and RFID, have at one point been proposed as \"mark technology\" or a sign that the mark and Antichrist are near. Of course, after those technologies become prominent, ubiquitous and prove harmless and the Antichrist \"delays his coming\" (Lk 12:45) nobody remembers the speculation and people move on to newer technology.\n\nAlong those lines, these days the latest theory is that the COVID vaccines or passports are the mark or a \"precursor.\" Again, precursors don't count. But here's why COVID does not fit:\n• People say COVID passports stop you from buying and selling if you don't submit to get the vaccine. But you can still buy anything online and most everything offline like groceries. You may also have to change jobs. When you don't have the mark, you can buy or sell nothing. You starve. Quite different!\n• More importantly, the mark is first and foremost about submitting to worship of the Beast as God; not about the ability to trade, which is a benefit to that worship. Vaccines have no such component of a person you must worship as God.\n• The mark is put on the skin of the forehead or hand (Rev 20:4). Vaccines are injected under the skin typically in the shoulder and are not at all an identifying mark related to the beast's name or 666.\n\nSo you see, the only way to make a vaccine or its passport fit the mark of the beast is to ignore the most important characteristic of the mark. That's not good exegesis. A theory for the mark must fit all the details given on it, not just one.\n\nWhat Do I Think the Mark Is?\n\nThen what is my pick for the mark? In short, it's something we have not seen yet because the power of the mark is beyond our comprehension today. I say that because when you consider the Mark of the Beast verse, it's not so simple as people understand it, such as a cashless society.\n\nConsidering that verse you can rule out a few things right off:\n• The mark is not mainly a currency: It always seemed odd to me that the mark was needed for selling, not just buying. If the mark were simply a new currency that everyone must adopt, there is no need to mention \"selling.\" You don't need currency to sell; you only need currency to buy as the seller receives currency from the buyer. (That's another reason why Bitcoin/cryptocurrency does not fit the mark.). So I rule out \"only currency\" off of that.\n• The mark is not (only) identification: I've used to think of the mark as an identification required to do (digital) commerce. Much like how a credit card number is needed for online purchases. Cash only works in person; you can't slide it into your PC or phone to buy something online. In fact, you could say \"no one can buy or sell [on the internet] unless he has a credit/debit card.\"\n• Is trade/bartering stopped, too?: What I also ask myself is can you get away with trade and bartering without the mark? If the mark is only an ID/currency account, then I doubt trade/bartering by people without the mark can be stopped. How powerful is it then and why mention its part in (some) economic transactions? I tend to think that the power policing and enforcing the mark will make it absolutely required to buy or sell anything just as the simple words imply. If it's that powerful then a simple digital technology like a chip does not really do it justice.\n• Beast UBI? With the talk these days \"universal basic income\" (UBI) or a default minimal income for all citizens from the government, I wonder if the mark won't tie into something like that. Given the world will be devastated for the Antichrist to come to power, a UBI might be needed for people to survive while the economy rebuilds using the supernatural/nephilim help of the Antichrist. Perhaps the mark will be tied to your UBI (Univeral Beast Income) and the currency it is issued in and the account you depend on for any commerce.\n\nAll that to say, when I consider the buying/selling power of the mark and the power of the Beast behind it, I lean towards the mark being like nothing we have seen today. To compare it to optional, voluntary, technologies like credit cards, chips, RFIDs, and the like, to me, vastly underestimates what Revelation is trying to convey about the mark and its necessity to commerce under the Beast.\n\nWhat To Do Today To Escape the Mark\n\nClearly, every believer prefers to avoid ending up in that no-win situation of having to choose between martyrdom and markdom. We all want choice 3: neither! To have that option, the challenge at that point of no return will be in having the discernment to recognize which way God is leading; \"should I stay or should I go?\" Even if you do recognize the truth spoken by God's prophets on leaving, you will also need the faith to go ahead with the minority in following such radical and hard instructions.\n\nThe question, then, is how do we develop the faith and boldness needed to take the hard early action required to avoid the mark? Jesus gave us the clearest advice I know:\n\nEver notice that nowhere in the Gospels can you find Jesus directly answering the question of how one increases their faith? I was frustrated at that for a while when I was wanting more faith, like the apostles. Finally, I realized that the Bible gives us the answer elsewhere and everywhere.\n\nIn the many stories of the Bible, we see God's servants walking prayerfully with him through hardships and learning several things in the process. They learn how to recognize his hand leading. This normally does not consist of voices, dreams, and visions, but of coincidences or \"God-incidences\" or \"open doors\" (Rev 3:8, 20) and \"closed doors\" (Rev 3:7). They learn what he is likely to do or lead us to do and what he is not likely to do nor lead us to do. They learn how to trust him when the situation looks like he has abandoned them and just wait in patience and peace until the clear direction to act comes if any action is required. In other words, they learn faith and how to act on it.\n\nIf you pray daily about having faith and strength as Jesus instructed, then you can be sure that God will hear that prayer according to his will. In response, he will direct you just as he did the servants in the Bible who wanted the same thing. You will be put in sometimes uncomfortable situations like they were which require you to be bold and radical at times, and to be inactive or meek at other times; the whole gamut. This will prepare you for all situations including the coming crisis of decision over leaving your home country early enough to escape the Mark of the Beast.\n\nBy the way, as far as finances and other logistics, when the time to escape comes, God has a plan to give provision to all those who choose in faith to obey the command to escape. See my article on the faith to escape to understand that situation.\n\nWhat Not To Do...\n\nLastly, a warning: Emigration to Israel for non-Jews is generally not possible today. The way must be opened up, not just for our move, but several end-time events also require a major change in Israel. For example, the construction of the Third Temple or the sealing of the 144,000 on the Temple Mount can't happen today without Arab control of the Temple Mount being eradicated. I expect the prophesied M.E. nuclear war against Israel where Damascus is laid waste to bring that about.\n\nThe Mark of the Beast is going to be far more irresistible than most Christians can imagine. But the solution to its challenge is not to get distracted today by trying to figure out exactly what it is in advance. Even if you did figure that out, it would do you no good. If you see the mark, it will already be too late to escape it with your life intact.\n\nThe proper escape plan will instead require faith and proactive, radical action. Unfortunately, as Jesus insinuated, faith will be a rare trait in the end times (Lk 18:8). Further, you do not learn bold and radical action by just going to church every Sunday and listening to your pastor. The answer is to follow Jesus' advice to stay awake and to pray daily for \"the strength to escape what is coming\" (Lk 21:36). God will be sure to answer that prayer by guiding your life so that you get the experiences and information which will develop the faith and radical streak you will need when the time comes. What's more, these two things will help you to serve God and shine your light even better every day along the way, just like the faithful maverick Jesus did.\n\nFor help on what aspects to focus on changing in your life, from Jesus' words, see my article on Rapture Requirements.\n\nP.S. Regarding the 666 bar code diagram above, it's one of the ideas for what the Mark of the Beast may turn out to be...", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://escapeallthesethings.com/last-pope-prophecy/", "https://escapeallthesethings.com/true-false-prophet", "#covidupate", "https://escapeallthesethings.com/144000-woman", "/depart-from-me-i-never-knew-you-meaning/", "http://timmchyde.com/mark-of-the-beast-sunday-worship/", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/petra-bible-prophecy", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/true-false-prophet", "https://escapeallthesethings.com/abomination-desolation", "https://escapeallthesethings.com/nephlim-bible-prophecy/", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/elijahs-coming-and-immigration-to-israel/", "https://escapeallthesethings.com/third-temple-prophecy", "https://escapeallthesethings.com/144000-woman", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/faith-to-escape-tribulation/", "https://escapeallthesethings.com/rapture-requirements/", "https://mistape.com", "https://escapeallthesethings.com/mark-of-the-beast/print/", "https://escapeallthesethings.com/mark-of-the-beast/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/irans-role-in-the-mideast-nuclear-war/", "https://escapeallthesethings.com/tim-passing/"], "authors": [], "publish_date": null}