{"result_id": "109018", "URL": "https://escapeallthesethings.com/why-no-timeline-change-2020/", "timestamp": "2023-04-25 15:03:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/why-no-timeline-change-2020/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "“Tim, Has Your Timeline Changed Given 2020’s Awful Events?” – Escape All These Things (Luke 21:36)", "cleaned_text": "2020 has been a tumultuous year like no other in recent memory. Does that mean that the end is nearer than you or even I thought? Is my prophetic timeline that says we’re still years from the end starting wrong? Find out why nothing and at the same time one other aspect has changed regarding my timeline.\n\nTo say this has been a notable year would be the understatement of the year. I have seen articles arguing that 2020 was the worst year ever in modern history, and it’s only halfway over. Let’s review the awfulness that has happened so far:\n• Assassination: Back in January Trump ordered the airstrike on the Iranian general who felt he could travel with impunity in Iraq. People were announcing World War 3 off that.\n• Australian bush fires came next, killing almost 500 million animals, including putting the beloved Koala near extinction.\n• China coronavirus ” was already a major epidemic there. But many of us including myself expected it to be just another third-world problem like SARS or bird flu which would not heavily impact countries with better medical systems. We were wrong and deaths began to mount in the West, too. Social distancing restrictions were rolled out in March in many first-world nations, completely disrupting freedom, lifestyle, and prosperity there.\n• Global Recession : The social distancing restrictions soon led to layoffs and shutdowns of key companies starting around April. This caused an economic crisis around the world including unemployment in the US higher than it was during the Great Depression.\n• US Race Riots: Finally, as if everything was not bad enough, protests, riots, looting, and burning in response to police brutality and racism broke out in over 200 US cities (and some international cities, too). George Floyd’s death by suffocation from being pinned with a policeman’s knee on his neck (\"I can't breathe\") was the spark that lit the powder keg which social distancing, recession, and decades of racism in the US had filled up. Even as an American living overseas since 1999, I was devastated to see my homeland burning for its national sins and crimes that had become due.\n\nIndeed it is hard to imagine a worse year or how this year can get any worse than it is (although many argue 1968 was still worse). Yet every time one of the events above happened, something worse always followed despite it feeling like we had seen the worst possible already, right? I did not even mention the “murder hornets” that came during COVID when we all had that same thought—\"Seriously? Now, this?\" Yes, the hits just keep coming as 2020 is \"the gift that keeps on giving the whole year.\" (See a clip from National Lampoon's Christmas Vacation below for the reference.)\n\nEvery time the world has even one calamity as we’ve seen in 2020, Christians who are aware of prophetic events from the Bible like the Great Tribulation and Rapture begin to wonder if this is God telling us they are near. Some Christians react by speculating about other possible meanings of the bad news, including inventing brand new prophecies loosely based on often a single verse of the Bible taken out of its context. We saw this distinctly with the “4 blood moons prophecy” a few years back based on the single blood moon mention of the greater Wormwood prophecy (Rev 6:12=Joel 2:30). Of course, nothing that was predicted happened as this was only a man-made prophecy misusing a Bible passage for some credibility.\n\nThis type of prophetic speculation spreads and impacts my readers. They hit my website looking for better answers. Often they begin to doubt the answers they previously found on my website which gave them satisfaction and comfort because of disturbing new events and widespread speculation over them. The doubts right now are about my prophetic end-time timeline of 2024-2030 that has the Great Tribulation and rapture still over seven and ten years away, respectively. Here are two examples I received this month:\n\nWhy Generic Bad News Is Not an End-time\n\nExtremes in the news are not and cannot be an end-time sign. It has to be the right news exactly as is found in prophecy. And it can even be good news, actually (Mt 24:14).\n\nTo understand this, just think about all the extremely bad events in history since Jesus left the earth. The black death or bubonic plague, WW1 and WW2, the Great Depression, and the Holocaust. Each time believers felt things could not get any worse and the end must be coming soon based on their subjective judgment of the situation. Yet each time they were wrong and things got better and continued on. Why? Because none of those events were clearly and exactly described in end-time prophecy as signs or even milestone markers.\n\nRecognizing and applying this principle has been a great key to my success at debunking for my readers every worrisome invented prophecy or prophetic speculation that has come down the pike since Y2K/Year 2000 Bug. Y2K did dupe me at the very start of my foray into becoming a student of Bible prophecy in 1998, and in the process gave me important discernment. In that year I heard a shortwave radio preacher say that America was Mystery Babylon the Great contradicting what I had been taught at church that it was the Vatican. He was right and I only found even more evidence for that.\n\nThat truth about America as Babylon was the beginning of being able to slowly unlock end-time prophecy, one brick of truth at a time to form a foundation to see more truth from. (It also helped greatly that I never was taught the false pretrib rapture doctrine. It throws the end time structure in Revelation into hopeless disarray by making chapter 4 of John going up to heaven “the rapture” instead of Revelation 11’s 7th trumpet where the rapture really is).\n\nWhy No Change In My Timeline\n\nAs bad as 2020 has been, perhaps you can begin to understand why it does not change my timeline. None of the events we have seen in their current context are found in end-time prophecy. I mention context because, for example, while there is “pestilence” mentioned which COVID-19 definitely falls under, that pestilence is in a different grouping and context. Notice:\n\nSee why COVID-19 does not fit? It was not preceded by great earthquakes and famines globally or in “all places,” the original intent of the Hebrew word translated “various places” in the Greek. In other words, Luke 21:11 is a direct parallel of Revelation 6, 7 and 8 which talk about Wormwood appearing in the sky and then disintegrating and falling upon the earth in differently sized chunks from meteorite to asteroid:\n\nIf you keep reading through chapter 8 you find that tsunamis are caused, the sun is blocked, the grass and trees are burned. This will directly cause the famine Luke recorded. That will result in great deaths and loss of civilization and infrastructure including medical systems. The pestilence that we are able to lock down now will spread anew. Possibly COVID-19 itself is what is mentioned as it will spike again without any vaccine or antibody injection cure we develop that then becomes unavailable with the mass destruction. But you hopefully see how COVID-19 in the context of 2020’s events does not match the Biblical context.\n\nSimilarly, the Psalm 83/Isaiah 17 Mideast Nuclear War has not happened yet which must happen for other events to take place (like the gathering of the saints to safety in Judea) before even Wormwood described above can come.\n\nGiven all that, there is no change to my timeline. Horrible things are happening, but they are generic bad events, not prophetic bad events. The next potential Sabbath year for Jesus’ return is still 2030. Of course, seven years before that, 2023-24 is a Sabbath year, too. However, Wormwood would have happened last year (Pentecost 2019) followed by the Tribulation (2020-2023) if the Sabbath year cycle of 2017-2023 were the 70th Week. Because of the way the seven-year windows spread hot spots in the calendar out, we have a few years of safety before things fall apart at this time.\n\nThe Timeline Aspect That Has Ended\n\nHaving explained why my 2024-2030 timeline is not impacted by generic bad news not found in end-time prophecy, there is one aspect of the timeline that I can say has ended. 2020’s sequence of horrible events confirms my warnings to you last year about my 2024-2030 timeline looking more and more confirmed by current developments in the world. This means the end of allowing for more seven-year windows like previous timelines did. Why?\n\nFirst, I saw President Donald Trump’s continued maverick actions in the Mideast were changing the dynamic there, pushing Israel’s enemies, the Arab Muslims, and Persians into a corner. While every other president before Trump maintained the status quo for “security concerns” by not moving the US embassy to Jerusalem and other things like that, Trump was doing the opposite over and over. This seemed to finally be moving the conflict forward to the point that the Arabs, who had not attacked Israel in confederacy since 1973, might have a reason, at last, to foolishly (and probably emotionally) attack the nuclear power that Israel is.\n\nSecond, by the help of God, I finally understood Paul’s “last day’s people” prophecy in 2nd Timothy 3 and shared how it had been fulfilled already for several years since the advent and the proliferation of the smartphone and social media from the mid-2000s on. Because that pair of technologies led to people grouping up by interests online with constant access at their fingers wherever they were, the worst ideas and behaviors of humanity were being united, concentrated, and radicalized just as “groupthink” psychology explains. This is the “us vs. them” polarization that we have seen worsen the political divide in the same time period. This is the “mob justice” behavior that led to lynching mobs in the past and happens every day on social media like Twitter.\n\nAt the time, I said that I feared that civilization had literally peaked already and we had already seen the best it would ever have to offer this side of the Millennium. It had already begun with a long-eradicated disease in America returning (the measles), highway fatalities increasing because of distracted driving (smartphones), and even \"flat earth theory\" making an unlikely resurgence just when you would think everyone would get smarter because of more information being available and of course truth winning out. Not so, just as group psychology explains. People end up grouping up and remaining in echo chambers with people who think just like they do (\"ingroups\"), affirming their wrong ideas with better propaganda than they had before so they feel more confident than ever to ignore anyone else (in the \"outgroups\") who disagree with them. Things go from bad to worse. This dynamic has been linked to the increase in mass shootings and so many other things that are now going wrong in the last decade and a half.\n\nNow because of social media, there are many people who believe COVID-19 is fake and some great conspiracy to get us all vaccinated. So they group up in rebellion against the government health mandates designed to “flatten the curve.” We’re already seeing at the time of this writing in June a second spike in cases in the US and most places where restrictions have been lifted or certain groups have flouted the safety measures often because of the bad financial situation the restrictions have created for them. I do not blame or judge them, but just as social media echo chambers brought the measles back, it seems to be bringing COVID-19 back. I think this cycle will repeat until we have a cure. People can only handle so much economic duress and social distancing before they get lax and spread the virus again.\n\nWhat I never saw coming before the end was that God would allow civilization to crest and peak and then go downhill first. I truly believed it would continue to just keep getting better with the release of more advanced technologies. Not so. And because of that, I see how it makes sense that if God is going to wreck civilization divinely by sending Wormwood literally from Heaven to suddenly appear out of thin air on earth, then he had better have an answer to his critics. Some would object saying he ended civilization prematurely, “We were just about to get things right by inventing social media to spread good information and the smartphone and other technologies to make it always available!” Riiiight. God has covered himself well by allowing civilization to peak and regress. No one will be able to say that humanity was just about to figure things out and make utopia. We already were going backward for years. We see now despite all our advanced medical knowledge and having learned lessons from influenza multiple times from 1918 on, our civilization was disrupted mightily by a tiny coronavirus. Because of how God chose to do it, the arguments of any critics of God's ending of civilization will not fly any better than Job’s in trying to accuse God of impropriety to justify himself (Job 40:8).\n\nCivilization has peaked, gone backward and Wormwood can come on schedule in 2026. Between Trump and COVID-19, the Damascus destruction prophecy can happen on schedule on or before 2022 according to my understanding of the divine dreams I have received.\n\nIf nothing at all like the above was happening yet, I would be sitting here already questioning the next timeline window set to begin in 2024 about whether we will need to add another 7 years again, same as I did a little under seven years ago (maybe in 2015 or 2016 at the latest) when I ruled out 2017-2023 window. Nothing was happening. Instead, this time more radical things than I even could imagine would happen (Paul’s last day prophecy fulfilled, Trump’s actions in the Mideast, COVID-19) are happening and they all seem to work together to set the stage for the key prophecies of the Mideast war and Wormwood. It’s sobering, folks because I would have wished nothing was happening again and we could add another seven years. But I have wondered from the start of my timeline in the early 2000s when I wrote Know the Future if 2024-2030 was not the one seven-year period to fulfill the 70th Week. This was because I saw that John’s Gospel account seemed to indicate that there were exactly two millennial days (John 4:40, 43) from 30 AD when Jesus was with the Gentile Samaritans who accepted him as Messiah until he returned and the Jews would finally accept him (30 + 2000 = 2030, a sabbath year).\n\nOf course, back there at the beginning, I could not imagine we would go another nearly three decades without Jesus’ returning! But here we are, just like in the movies where at the end of the story after going through many false candidates for romance, the guy or girl tells the best friend of the opposite sex, “It was you; it was always you.” Yes, 2024-2030, it was you; it was always you.”\n\nFinally, An Endtime Prophet and True Repentance is Spreading\n\nIf all the above was not enough, in my last article I revealed contact with the first end-time prophet on the earth. They revealed that COVID-19 is being used by God to slow down the saints, get them in a listening mode for repentance, and then activation with the Holy Spirit. I’ve seen it happen with several of my supporters now who have reached out for help with the pull they feel unlike ever before to drop everything and seek God.\n\nThe spread of repentance this soon (before Mt 24:14 happens globally) is another thing I did not see coming. But it makes sense in hindsight. Leaders must repent first to be prepared and then they inspire another round to do likewise who like ever-growing concentric circles, are able to bring in and support more of the Bride needing to “make herself ready” (Rev 19:7 = repent).\n\nOther Questions I’ve Had Lately:\n\nSince I know that if one person asks a question, there are probably at least tenfold more with the same question who did not take the time to ask, I will address some further questions that I have been fielding lately (and add more as I see them come up):\n\nNo, it’s impossible for the rapture to come that soon when the 3½ year Great Tribulation has not even started yet. And that is before you properly factor in the prophetic Sabbath year (shemitah) cycles which provide a window for the rapture only every seven years, ruling six out of every seven years from ever seeing the Great Tribulation start. The same goes for the rapture which comes at the end of the Great Tribulation.\n\nQ. \"Seems like on your timeline you think 2026 is the start of the 3½ years?\"\n\nNo, late winter 2027 would be the start of the 3½-year-Great Tribulation. Pentecost, 2026 is when Wormwood would come to end civilization which allows the antichrist to rise from the ashes and come to power within nine months of that devastation from earthquakes, famines, and pestilence.\n\nQ. \"Who is the prophet? Why can’t you tell more about them?\"\n\nI’m still not released by God to reveal their identity. The prophets (yes, now plural after more activations by the first prophet, just as John the Baptist activated Jesus as a prophet for his ministry) are not ready and actually need training.\n\nThis is another thing I did not realize before. But I always wondered why Samuel and Kings talk about there being the “school of the prophets” (1 Samuel 19:18–24; 2 Kings 2:3,5,7,15; 4:38–44). What do they need \"school\" for? Doesn’t God just clearly speak to prophets, “do X, Y, Z, OK?”\n\nNope. I have been told that there is much to learn about how to walk with God at that level and God is still not as clear as you would hope. It takes great discipline and sacrifice to stay slow to hear what God does say and be sure to get it right and not be distracted by other things. It’s just like dreams some of us have received from God or what it took to understand Bible prophecy. It is not at all 100% clear. It seems like it takes a lot of care for a prophet to not go beyond what they understood, not fill in gaps with their own interests, and to not go ahead of or behind God’s plan.\n\nBecause that prophet and others now activated since then are still in training, they are not ready to be revealed to the world. Trust me, you would not think much of a prophet in training! Talk about underwhelming. Your expectations of a prophet gained from reading about fully trained prophets described in the Bible after their ministry has begun would make you reject a prophet in training as not of God. If you remember the young prophet who seems to have died from a rookie mistake in his training in 1 Kings 13:11-25, you get the idea. A prophet who dies from a mistake in his prophet role? What a letdown! Seeing a prophet like that would ruin prophets for you.\n\nI did not understand any of this yet last time, but now that I do I am glad that I can share that explanation for why they must all remain anonymous for now. That will change, so be patient. It is an exciting time, this coming from someone who for years said there are no prophets on the earth. Well, I was not wrong. It's just that it was true...until it wasn’t.\n\nFinally, this school of the prophets is not an \"elective.\" The office of prophet is a calling God gives you through usually another prophet contacting you. That connects you to the company/school of prophets to then begin learning. You do not enroll yourself =).\n\nQ. I don’t care who it is, but I feel convicted to send some support. How do I do that?\n\nA few have said exactly this and approached me even though I have not solicited on their behalf. There is no need. God takes care of his saints without them needing to ask (Mt 6:33) by putting it on people’s hearts. It’s exactly how I have been able to survive all these years with not enough book sales through the love gifts of people whose lives and walk with God have been impacted by my writing.\n\nIf you are one of those people who do feel that way, I can say I have been given responsibility for providing for their travel and other ministry costs. (Yes, on top of a family.) If you have given to my work in the past then if you give now it will also contribute to that new ministry of God. Just go to the donate page or better yet the support team payment page so you get a supporter account to access support articles or credited time for your existing account.\n\nIf you choose to, I want to remind you of the special blessing waiting for you which Jesus himself pronounced:\n\nThank you and I will have more for you as soon as I am able.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe title=\"Jelly of the Month Club\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Q7TdoGj0XJI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Q7TdoGj0XJI?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Unrequited Love (Four Weddings and a Funeral, 1994)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/sAufqxmyCQA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/sAufqxmyCQA?feature=oembed"}], "links": ["https://www.theatlantic.com/ideas/archive/2020/05/1968-and-2020-lessons-from-americas-worst-year-so-far/612415/", "https://escapeallthesethings.com/2015-blood-eclipses", "https://escapeallthesethings.com/mt-24-14-meaning", "https://escapeallthesethings.com/60-reasons-iraq-not-mystery-babylon", "https://escapeallthesethings.com/america-mystery-babylon-great", "http://escapeallthesethings.com/rapture-secrets", "https://escapeallthesethings.com/earthquakes-in-prophecy", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "/2026-in-prophecy/", "https://escapeallthesethings.com/us-embassy-jerusalem-in-prophecy/", "https://escapeallthesethings.com/last-days-people-prophecy/", "https://escapeallthesethings.com/wormwood-nasa/", "https://escapeallthesethings.com/2026-in-prophecy/", "https://escapeallthesethings.com/2022-dreams/", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://www.youtube.com/watch?v=jTmZHDb_sP8", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/antichrist-myths", "https://escapeallthesethings.com/donate", "https://escapeallthesethings.com/support-team-options/#payments", "https://mistape.com", "https://escapeallthesethings.com/why-no-timeline-change-2020/print/", "https://escapeallthesethings.com/why-no-timeline-change-2020/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/why-you-will-miss-elijah/", "https://escapeallthesethings.com/holy-spirit-activation/"], "authors": [], "publish_date": null}