{"result_id": "109026", "URL": "https://escapeallthesethings.com/2026-in-prophecy/", "timestamp": "2023-04-25 15:03:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/2026-in-prophecy/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Why I’m Convinced The End Begins in 2026—And What You Can Do About It – Escape All These Things (Luke 21:36)", "cleaned_text": "[I'm only releasing this information to supporters:] Since learning in 2001 that Yeshua must return in a Sabbath year, I've had to rule out three consecutive Sabbath year cycle windows for the final 7 years (2003-2009, 2010-2016, 2017-2023). This same insight enabled me to easily rule out every date-setting prophecy theory along the way, bringing comfort to many scared readers. With the next possible window for the 70th week coming next decade (2024-2030), I'm ready to share why I believe, based on the real end time sign of Mt 24:14, that this can be the one. If it is, the nasty birth pains (WW3 + Wormwood) would start near its middle in 2026 and Yeshua would return at its end in 2030. Why am I now sharing a “doomsday year” myself and how am I not a “hypocrite” for doing so? How is my 2026 conviction different from what prophecy theory date setters have done? What about \"no man knows the day or hour\"? Read on to understand what has changed, why I'm so convinced about 2026 and, most importantly, what the Bible says to do if the end is indeed coming in your lifetime.\n\nI've added this introduction to help people who spot this article, do not read it, come to a wrong conclusion from the summary above, and then email me with concerns. Their comments reflect common misunderstandings of what I'm saying and what I'm not saying about the year 2026. I hope this new section will help dispel confusion for concerned readers and put them at ease!\n\nTo be clear as possible about my position on 2026:\n• I'm not saying \"thus saith the Lord\" or doing this \"in God's name.\" I offer you no hard proof in signs or wonders that would accompany such a statement by the prophets.\n• As such, I am not a prophet nor making myself out to be one.\n• I am not a \"watchman\" nor am I here to \"warn\" anyone, either.\n• I am not even making a \"prediction\" nor a definitive statement that \"the end will for sure come in 2026.\" For an example of a definitive statement from me, go to my article \"Jesus cannot/will not come back in 2018.\" Note that those who make doomsday date predictions are usually surprised or confused when they fail to happen. I won't be because I already know it is possible I misunderstood given I did not hear the audible voice of God explicitly say \"2026 is it.\"\n• I'm only sharing my conviction that 2026 is the end. Paul said believers shared revelation they received from God with the church (1Co 14:26). That's what I'm doing, to help \"build up the body\" as he said. But it's only my conviction, like one might have and pass along after, say, overhearing an expert insider on cryptocurrency promise \"one Bitcoin will be worth a million dollars.\" You passing along what you think you overheard (and are convinced of) does not turn your statement into a prediction. We see through a glass darkly (1Co 13:12).\n• I'm sharing this revelation to bless and build up brethren (1Co 14:26) who want or are waiting for confirmation that time is short. This insight can give their repentance and spiritual growth extra impetus or urgency. I've seen positive fruit from people who think time is short—as long as they are also instructed on properly dealing with it. (When people hear a doomsday date without any guidance on how to deal with it and escape it, they tend to get scared, hopeless or make bad life decisions.)\n• Unlike my peers who make predictions and then disappear or make excuses after the date fails, I will be able to rule out this next possible 70th week window (2024-2030) before it begins, early next decade. This is what I have always done with every single 70th week window as they approach (as already described in the summary above).\n• If 2026 must be ruled out early in the 2020s, I will be relieved with nothing to apologize for because my conviction shared below coupled with my teaching on repentance to escape what is coming will only help listeners to prioritize God in their life. Urgency about the end is a blessing when you have been told what the Bible says to do about it.\n• Finally, my \"reputation as a teacher\" is not \"on the line\" as my 2026 date is not a teaching as much as sharing a revelation I am convinced is from God (1Co 14:26). In other words, a teaching of mine would be that the 70th week will come in some Sabbath year cycle. My conviction is that God has confirmed that 2024-2030 is the right cycle, making 2026 the \"beginning of sorrows.\" Even if my conviction about 2026 is wrong, my teaching will remain the same about Jesus returning in a Sabbath year at the end of a Sabbath year cycle. (If not 2024-2030, then 2031-2037, and so on.)\n\nI hope this helps clarify my position and rationale for those who are confused or concerned after reading my 2026 summary above.\n\nThose who read the full article below know that there is no cause for fear about 2026 given what I explain about God's plan to help us deal with it.\n\nBy the way, I hope my conviction is wrong. I want more time like most of you. I did not ask for or seek confirmation about 2026 but it was dramatically given in a way I cannot ignore or deny. Those who listen to me and follow my instructions on how to deal with the end will be closer to God than ever. God bless!\n\nNow after the above disclaimer, read on to understand what has happened to convince me about 2026...\n\nPart 1 – Why Do Popular Date Setting Theories Always Fail?\n\nTo read the rest of this 9,000 word study and understand how little time we may have left based on Mt 24:14 , please join my support team monthly or even for just one month (no monthly financial commitment required). I appreciate your material support in exchange for helping me to continue to bring forth spiritual support (as Paul taught in 1Co 9:11, 14) for the saints to finally learn God's will and to do it (Lk 8:21=Mt 12:49-50=Mk 3:34-35). If you cannot afford to join the Support Team at this time, I understand. Please enjoy the hundreds of other free studies on this site instead!", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/no-man-knows-the-day-or-hour", "https://escapeallthesethings.com/2018-prophecies", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://escapeallthesethings.com/parallel-great-tribulation-dreams/", "https://escapeallthesethings.com/rapture-requirements/", "/support-team-options/", "/wp-login.php", "https://mistape.com", "https://escapeallthesethings.com/2026-in-prophecy/print/", "https://escapeallthesethings.com/2026-in-prophecy/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/third-temple-prophecy/", "https://escapeallthesethings.com/sam-millers-testimony-support-team/"], "authors": [], "publish_date": null}