{"result_id": "109016", "URL": "https://escapeallthesethings.com/last-days-people-prophecy/", "timestamp": "2023-04-25 15:03:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/last-days-people-prophecy/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Paul’s “Last Days People” Sign Here: Why Does God End Civilization? – Escape All These Things (Luke 21:36)", "cleaned_text": "When God sends Wormwood to demolish civilization (Rev 6-8), is it because time's up (6000 years) or are there conditions in society that give God cause, such as the negative attributes Paul warned Timothy about in \"people of the last days?\" (2Tm 3:1-3)? I could never explain this prophecy until I stopped trying to ignore how people are more rude, outraged, and angry than ever and researched the cause, a technology now infecting nearly all of us. Understand and see the writing on the wall for yourself so you can prepare for 2026. Learn three errors in judgment I see Christians using social media make and what they are forgetting. Update: The 5 battle-tested keys for success at doing what Jesus said that I use...\n\n\n\nThe good news is that if you're not content with my personal-dream-based conviction about 2026 being when Wormwood brings the end of civilization (rather than some later sabbath year cycle/70th-week timeframe like 2032/2039/etc.) I have a new explanation for an end-time sign in the Bible that's easier to confirm than praying for your own revelation from God to confirm my dreams.\n\nThe bad news is that if you had hoped my dreams were wrong about 2026 and that we had more time, this new sign is hard to miss once I show it to you. It is covered regularly in the news and witnessed by most of us on an almost daily basis. Once you see it, it will change how you view our modern, digital life.\n\nThe sign I'm referring to is a prophecy I have ignored for 20 years now. Paul warned Timothy about how degenerate people will be in the \"last days\" with a list of 19 descriptors:\n\nThis is no easy prophecy.\n\nCan you see the problem I had with this? Take a look at the list of negative characteristics of people. They are not exactly what we would call unique; most have been manifested to varying degrees in all societies throughout history. Paul confirms the universality of them by including a warning to Timothy to avoid people like that in his time. A warning about last-days people which applies already 2000 years earlier left me perplexed.\n\nHow do we know when the prophecy is fulfilled? Is it a matter of scale, an unprecedented level of anti-social tendencies in people that would be impossible to miss? Paul's statement later in the chapter seems to confirm this:\n\nIndeed, that seems like the only possibility. Somehow, people will become much worse. Since \"worse\" is so relative and not quantifiable, we cannot hope to truly understand what this prophecy really looks like until we get there. Along the way, it's will be unavoidable that we think it has arrived when really it has not. I have seen Christians claim this prophecy was fulfilled many times over the past decades. When Democratic presidents such as Bill Clinton and Barack Obama are in the White House, or when \"Christian values\" (like not making cakes for homosexual couples) are knocked back, or even when “Happy holidays” is substituted for \"Merry Christmas,\" Christians express that the end is near \"because we cannot go on much longer like this.\"\n\nI think most making such claims do not realize that they are simply repeating what people in nearly every generation have thought and said. Because of biased, selective memories and subjective judgment, we tend to believe things are worse than we remember from our youth—in the \"good old days.\" This is so common it even has a name, the “Golden Age Fallacy.” As far back as in Ancient Greece, Aristotle thought that the next generation was worse than his and wrote about it.\n\nBut remember, Paul's full prophecy is not about just any subjective worsening, but rather specific characteristics multiplying in people. No surprise then that we're still here and the much-proclaimed end still is not.\n\nProblem #2: What Could Cause All 19 Attributes?\n\nThe other problem with this prophecy comes when you try to explain how such a broad spectrum of negative characteristics would manifest in people. Some characteristics seem incompatible with the development of others. What could go so wrong in society to make them all develop? Here are two ideas I ruled out:\n• Global Crisis? - Say we had another Great Depression, world war, or a similar global crisis. With lower security or standard of living foisted upon the population, we would expect them to become \"brutal, treacherous.\" But why \"disobedient to parents\" or \"proud, arrogant, ungrateful?\" Bad circumstances tend to humble us and make us grateful for what we can get when we see lack all around us. A global crisis would not seem able to cause Paul's prophecy.\n• Prosperity? - On the other hand, increasing prosperity and standards of living would easily explain people becoming \"lovers of self, pleasure, proud, arrogant, ungrateful.\" We get narcissistic, spoiled and entitled from wealth as we already are seeing in affluent Western democracies for decades. But prosperity does not naturally explain people becoming \"brutal, treacherous, disobedient to parents, abusive, without self-control, not loving good.\"\n\nWhat could possibly explain a rise in all these negative characteristics if the normal cycles of boom and bust, crisis and recovery do not? Heck, you would almost have to insert most of humanity into mobs personalized to their likes and interests. Peer pressure can lead good people to do horrendous things like torture, lynching, or even genocide against the Jews as the Nazis did. But that's never going to happen, right? (wink, wink...)\n\nI was stumped. Hence, I decided to leave Paul's prophecy alone and, as long-time readers know, focus on other more quantifiable prophecies, like Wormwood and WW3, as I wrote about in my book Know the Future.\n\nTo be honest, I completely forgot about Paul's prophecy. I wrote it off as hopelessly unclear and unhelpful. I had put together so much of the end time roadmap from other prophecies that I was OK with that.\n\nNevertheless, it seems that God acted to end my ignorance on this prophecy as he had done with others. I was provoked to think in a new direction because of a question. A supporter who is not thrilled that the end may be coming soon in her lifetime (as I believe) asked the following of me:\n\nMy immediate answer was, no, nothing had changed in my position. She already knew that the Psalm 83 war was the next prophetic event and there was no other sign before that. However, later in the same conversation, I ended up sharing some new thoughts I had on recent negative trends in society. These trends kept being covered in podcasts and news articles I was consuming so that I finally started thinking and talking about them.\n\nLater that same day after the meeting, like a bolt of lightning, a thought occurred to me: It wasn't true what I said about there not being another sign before Psalm 83; I was wrong.\n\nThe negative trends I had shared were actually related to Paul's \"last days people\" prophecy sign which I had forgotten and there was one cause behind both the trends and Paul's predicted societal change. This cause finally covered all the negative characteristics that could not be explained by anything else before.\n\nA Brief History of the World ('70s, '80s, '90s, and '00s)\n\nIn order to appreciate these new trends, it may help to back up and revisit how technology and innovation have reliably delivered decades of consistent progress to civilization. From my childhood in the 1970s and onward, quality of life has steadily improved. Products and services became better, safer, faster, cheaper, and more powerful, lifting our standard of living. We went from wall phones to cordless phones to pagers to cell phones to smartphones; from reel-to-reel to 8-track to cassette tape to CD to DVD to Blu-ray. Standards in society continually rose, too, providing better education, human rights, and opportunities.\n\nThe Cold War that had been ongoing since 1945 ended effectively with the fall of the Berlin Wall in 1991. A few years later, in 1995 the free web browser Netscape brought the ten-year-old internet to the attention of the masses in the fulfillment of prophecy that \"many\" in the end times would google (\"go to and fro\" is not about travel but is a Hebrew idiom for \"searching\") and \"increase knowledge\" (Dan 12:4). As all of us know, even with only \"primitive\" Yahoo search available then (compared to Google now), this was a game-changer for humanity. What else could you ask for after such an incredible gift? Not much, yet the internet continued to expand and improve our lives. (I, for one, was able to start to work from home in 2000, years before that became a common thing.)\n\nIf there were any major regressions to progress in the '70s, '80s, '90s, and 00's, I cannot recall them. They were either minor or aberrations that did not last long before they were coaxed forward again. For example, back in the 2000s, there was much talk about a coming serious energy shortage due to \"peak oil.\" The theory stated that the discovery of new oil fields had peaked and was slowing while the demand was still rising which spelled an inevitable global crisis. Although conventional crude oil production did indeed peak in 2006, along came the innovation of hydraulic fracturing (fracking), increasing oil production once again.\n\nIn summary, the first four decades of my life up until 2008 impressed me as a period of constant progress and improvements to life.\n\nAgainst that backdrop, now consider these anti-progress developments in three different areas of modern life:\n• Traffic deaths on the rise? - After 15 years of decline, traffic deaths in America rose in 2015 by a startling 9 percent, according to data recently released by the National Highway Traffic Safety Administration (NHTSA). From 2000 to 2014, traffic fatalities declined by more than 22 percent. Distracted driving especially related to smartphones is blamed. As smartphone ownership skyrocketed from 55 percent in 2013 to 77 percent in 2017, the number of accidents escalated from 5.7 million to 6.4 million, an increase of 12.3 percent.\n• \"Eradicated\" measles returns? - Measles was declared eradicated in America in 2000. Yet in 2019 more cases of the disease were reported than since 1992, mostly among people who have never been vaccinated. The anti-vaccination movement spread on social media (stating that vaccines are dangerous or cause autism) is mainly blamed for lower vaccination rates. UPDATE: For all those commenting, I'm not judging the anti-vaccination movement. I'm judging the tragic return of an eradicated disease, OK?\n• Flat earth resurgence?? - The most disturbing \"progress reversal headline\" of all for me is the bizarre resurgence of \"flat-earthers.\" Just as it sounds and despite the overwhelming 2,500 years of scientific evidence to the contrary, flat-earthers believe that the earth is a flat disc, not a sphere. This means that 100 years after the first occurrence of the term \"flat-earth-man,\" you can no longer use that term to refer to someone holding \"ridiculously antiquated views.\" It's a current view again, held by no doubt millions globally (the Flat Earth Society twitter feed alone has around 100K followers). The next time you are tempted to express how ridiculous an idea is by comparing it to flat earth belief, be careful, as you may get the awkward response back, \"I believe in flat-earth.\" (It's happened to me more than once.)\n\nCan you see why these headlines reminded me of Paul's prophecy? Maybe not yet. Viewed independently, they are saddening yet can be dismissed as relatively unimportant. After all, who dies from measles (only 0.02% of cases); who really is up in arms about the carnage on the highways (few compared to much lower death rates from many diseases); and \"so what if conspiracy nuts are spreading yet another ridiculous conspiracy\" (as most would say in response to flat-Earthism )?\n\nYet taken together, all of these trends relate to \"people getting worse\" (2Ti 3:13) in areas of longstanding progress, all thanks to the new potent technological combo of smartphones and social media.\n\nEveryone readily understands how dangerously seductive even old cellphones are, in that they lure drivers to their deaths as the sirens did to sailors in Greek mythology. Few of us can 100% of the time \"just say no\" to taking our eyes off the road when our phone alerts us to a text or call. What's harder to understand is how enough people became convinced it's \"unsafe\" to vaccinate their kids that measles returned or especially how an easily disproven, outdated belief like flat earth could have a modern, mainstream resurgence. The answer to both questions explains how Paul's prophecy is already being fulfilled in people all around you, including probably you, too. They are also a key part of the answer to a new question I never could have answered before now:\n\n\"What will God say when we ask him in the Millennium why it was he sent Wormwood to punish civilization when he did?\"\n\nThe Proliferation of Smartphones and Social Media\n\nSkeptical? It's understandable when smartphones bring so many benefits. If you ever leave home, GPS mapping apps alone make smartphones worth the upgrade from an old flip phone. Social media also has been wonderful, especially in the early years. It enables us to find and communicate with long lost friends and far-flung relatives or to share a personal problem and get a flood of crowd-sourced solutions even more tailored to your needs than a Google search can do.\n\nThere was also the Arab Spring overthrow of Egypt's dictator Mubarak in 2011 thanks to a Facebook group started by a dissident. The potential for good and positive change from social media seemed so promising! Nevertheless, as time has gone on and this pair of technologies has spread into more people's hands, cracks have begun to appear in that rosy facade.\n\nBut spread they have. You may be surprised to learn how widespread these technologies have been with humanity around the globe, not just in the wealthy nations:\n• 5.5 billion smartphones are in use across the world today.\n• In rich countries (with near-universal internet), almost all young people use social media .\n• On average, the world’s internet users spend 6 hours and 42 minutes online each day, over 2 hours of which is social media .\n• More than 50% of the content viewed on Twitter includes .\n\nJust stop and consider how fast and remarkable the spread of these technologies has been. Most of the world is poor; one third live on less than $2/day. But who doesn't have a cellphone or a smartphone? A minority. I remember when we lived in poor Third World Costa Rica, even there everyone had cell phones. (We knew of one person with a cellphone despite living under a bridge!)\n\nLikewise, while in the '90s and even '00s it was common to refer to \"online life vs real life.\" The reality now, because of mobile internet on our phones and tablets, is that we're all online every day for hours. Modern life is a fusion of offline and online.\n\nSo what are the effects of most of us, including the poor of the world, being connected to each other through our phones, the internet, and social media for so much of our daily life?\n\n\"Reach Out and Abuse Someone\"\n\nWith all the benefits of our online life, we only gradually have been becoming aware of its dark side. The chief of this is online abuse in its many forms. Americans will remember how AT&T used to promote its service with the slogan, \"Reach out and touch someone.\" Telemarketers and others spoiled the early positive association of hearing your phone ring. The same has happened with the internet long since. People are reaching out to harass someone through the internet in ways that make telephone harassment seem like the good old days. When you learn how bad it is, you will be shocked and hope you are never the target of doxxing, swatting, revenge porn, cyberbullying, or cyber-mob attacks.\n\nMany people have lost their jobs, careers, marriages and even their lives—often by suicide because online abuse is so devastating. Consider just this one horrifying tale of a woman who was cyber-mob attacked as a result of a satirical joke she shared on Twitter and because she appeared to be a \"person of privilege\" who \"deserved\" to be shamed.\n\nThe reason people do such vicious things online, the reason that bad or false ideas like flat-earth belief spread and the reason that all the negative characteristics of \"last days people\" are manifesting now is one and the same cause: mob-mentality facilitated by social media. Social media enables every person, no matter how strange or obscure their likes or dislikes, to find and connect with like-minded people. Everyone on social media is part of one or more online groupings that exert a powerful effect on their thinking.\n\nMob or herd mentality \"describes how people can be influenced by their peers to adopt certain behaviors on a largely emotional, rather than rational, basis.\" As we all know, individuals connected in a group agree with and do things that they normally would never do because \"groupthink\" overtakes their individual thinking. If you want to bring out the worst in people, grouping them with others is a historically proven highly effective way.\n\nThere are several groupthink dynamics that psychologists have observed:\n• , whether right or wrong, good or bad. This increases your confidence in them and makes you reluctant to listen to opposing views.\n• Individuals in groups desire acceptance, approval and to fit in so they conform by suppressing their dissenting thoughts and opinions. They also go along with the group and its decisions rather than stay true to their individualized values. They become \"deindividualized.\"\n• Groups tend to have a radicalizing effect on our initial beliefs (\"smoking is bad...smoking kills...smoking should be banned\"). Like-minded people share far more arguments for why they are right than evidence to the contrary which confirmation bias also tends to filter out.\n• \"Us vs. them\" thinking is a natural outcome of this. The radicalization of belief includes the view that your group, the ingroup, is more right or virtuous while those outside your group, the outgroup, are more wrong or villainous. This leads to more and more polarization of the opposing groups.\n\nIf you have wondered why mass shootings in America are steadily increasing, from once every few years, to once a year, to at times weekly, social media groupthink is a major cause.\n\nOne such contributing group is a recent cultural online movement called \"incels.\" Incel stands for \"involuntary celibate.\" These are the stereotypical, sad, dateless males living in their parents' basement. This class of antisocial or introverted people in the past would stay brooding alone or among their friends and family. Their feelings and thoughts would not find so much affirmation among a normally heterogeneous social circle that includes some socially successful individuals.\n\nHowever, thanks to the internet, incels are able to connect with each other and group up. All the group dynamics described above occur. What started out as a support group for shy men has evolved into a brutal movement that promotes and encourages misogyny, rape, and even murder. Incels have been linked to several mass murders.\n\nThis outcome is no surprise considering how well-known the wisdom is of preventing certain elements from affirming each other. I remember back in grade school how there were two classmates that were particularly unruly. My teacher separated them to opposite sides of the classroom while explaining, \"Michael is gasoline and Frank is the match.\" In college the rule was that two freshmen were not allowed to room together in our two-person dorms; freshmen had to be paired up with an upper-classman. When I naively asked my senior roommate the reason for this rule that was preventing him from rooming with his brother also attending the college, he explained, \"Because if two freshmen are together one will suggest a bad idea to the other and he'll agree, 'sound's great, let's do it!'\"\n\nSocial media is effectively not only telling all the \"freshmen\" out there that their ideas are great, but also why not take them even further?\n\nThe detrimental groupthink of social media is its most potent drawback. But it only partially explains, for example, why flat earth has returned.\n\nThe other problematic aspect of social media (among many others) is that its greatest benefit of allowing everyone, even the marginalized, to have a voice and broadcast to the world, is also its greatest problem. Anyone with any idea, no matter how meritless, also gets a voice. They can share their ideas in a very persuasive, personal manner through video and through memes. Memes are a significant development that should not be underestimated. They have proven highly effective because as they say, a picture is worth a thousand words.\n\nWhen anyone can broadcast it is not the better authority who gets listened to but rather the better storyteller. Obviously, scientists and other experts are not in their position because of their ability to tell stories. They lose competing on social media against \"real people\" with a story to tell of how they used to believe the earth was round and did not want to hear that the earth was flat, but a transformation happened and their eyes were opened to the Satanic conspiracy trying to keep this secret information from us, etc.\n\nSocial media does not care which is most accurate or true. It promotes what is most popular. An MIT study found that false stories were 70% more likely to be retweeted on Twitter than true ones. It comes as no surprise that most people who believe in flat-earth reported that they learned of it through YouTube. They were not even interested in the idea, but YouTube's algorithm served it up based on other conspiratorial videos they were exploring. Many initially watch such videos wanting to debunk them in the comments. Instead, after being overwhelmed with \"200 proofs the Earth is not a spinning ball\" that they cannot refute (including Scriptural ones), they often come away convinced. Then, after being infected with the \"flat earth virus,\" many go on to become flat-earth evangelists to infect others. It's like Paul said:\n\nBut so what, flat earth belief is just a harmless, cosmological view that has no practical impact on one's daily life, right? On the contrary, it's having great negative effects. On Facebook, flat-earthers are some of the most unpleasant and divisive people you will meet. It is so bad, I have frequently seen Facebook posts announcing flat-earthers and their trolling will no longer be tolerated on their wall. Offline, flat-earthism (similar to the incels) has led to damaging effects such as breaking up marriages, families, and churches.\n\nIsn't it ironic that by achieving the ideal of a worldwide shared resource of knowledge that one would expect to create peace, harmony and a common interpretation of reality, that quite the opposite has happened? As knowledge has been increasingly \"democratized\" and competing narratives have emerged, populism has won, rather than truth or idealism.\n\nBefore moving on, I want to explain something to flat earth believers reading this. I do not condemn, criticize or even mock you. I have love and compassion for you because I have believed discredited conspiracy theories of my own, such as KJV-onlyism. In time, I came around to see the error of that theory and I trust the same will happen with all flat-earthers eventually, hopefully without spending $250,000 on a Virgin Galactic flight into space.\n\nThen why do I have to make an example of flat earth belief? Because I know that the vast majority of readers see flat earth's resurgence as a shocking and perplexing development. I certainly did. I struggled to understand it until I studied it in depth. I consider this resurgence as a perfect case study to explain the key dynamics of social media that contribute to so many negative outcomes and trends since the advent of the smartphone (2007) and social media (2004, Facebook) in the mid-2000s.\n\nFinally, since I already have proven for myself the earth is indeed a globe, I'm not interested in debating this topic or hearing from flat earthers who want to tell me I am wrong. Don't expect a response if you do.\n\nIf social media can resurrect an inferior belief like flat earth and make people worse by it, what else is possible? I think every negative attribute that Paul said is also possible. It's a challenge but I will try to explain how each has been enabled and amplified by social media, its economy, and the groupthink that it creates:\n• \"lovers of themselves\" - The first item on Paul's list deserves its lead position as it's the most important. The clinical word for this is narcissism, defined as excessive self-admiration. Narcissism has been steadily increasing for decades due to many factors but has spiked in the last decade. The epitome of the narcissism explosion, the selfie photograph, exists because smartphones let you take them and social media gives you the reason why: to share them with the world. Not too long ago, anyone posting so many snapshots of themselves would have been ridiculed as full of themselves. Now many narcissistic behaviors like this have been normalized by social media; monkey see, monkey do.\n• \"lovers of money\" - You don't love something you never see or have. People love to show off their riches and people who want to have that lifestyle are eager watchers. In the past, people would consider such a focus shallow and shameful, but social media has normalized this, too.\n• \"boastful\" - One of the behaviors of narcissists which social media makes into a new occupation is being a show-off. For example, I read there was an Instagram channel of a woman where she makes money by only sharing \"butt shots\", i.e., pictures of her attractive derriere. That's a new form of boasting without words and it even pays the bills. Show-offs never had it so good. It helps to have no dignity, which is also spreading. Another form is taking daredevil photographs and videos, too many attempts at which have resulted in death.\n• \"proud/arrogant\" - Everyone online is very confident in their particular ingroup's knowledge and rightness. After all, they googled it and now they are an expert! Hubris is foolish pride, ignorant arrogance or overconfidence that leads to disaster.\n• \"abusive/blasphemers\" - Abuse and harassment have skyrocketed thanks to how easy it is to accomplish online and how readily people fall into us vs. them mentality, thereby justifying their retaliation on outgroups. One particular class of abuse takes place offline still because the victims are not (yet) online, yet the internet is overrun with images of the abuse, labeled \"CSAM.\" (Warning: you could lose your faith in humanity if you research that topic or read this NYT article.)\n• \"disobedient to their parents\" - I have witnessed shocking disobedience in my children, my siblings' children and friends' children compared to how our generation had to behave or get whooped. I could not figure out what we were doing wrong to not get the same results. Then it dawned on me that my child and the rest were connected with others from a young age already texting on dumbphones, internet sites, and game chats, even before they all had smartphones and social media as they do today. You don't have to be an adult for a communication network like that to affirm your bad ideas and behaviors and give you ideas for new ones you never would have thought of. Children get corrupted by groupthink, too, if you let them, just as I shared above about elementary children being separated by teachers to prevent it. It's extremely hard now not to let them, to tell your kid they cannot have a digital life like all their friends and be the cyber-leper. Trying to get your digitally connected kids to obey today is like doing an intervention for a drunk friend and letting his drinking buddy come and sit by his side and whisper in his ear. It doesn't work.\n• \"ungrateful\" - With all the outrage, \"important\" causes, and envy spread on social media, it's hard to be slow, thoughtful and experience gratitude for things.\n• \"unholy\" - Unholy is not set apart to honor or glorify God. If long disproven flat-earth belief has been propped up through social media, how much more is atheism going to spread?\n• \"without love/unloving/heartless\" - To be without heart or love means you're indifferent or hateful. Narcissism leads to indifference and unmoderated, online tribalism promotes hate.\n• \"unforgiving/irreconcilable/unappeasable\" - People hold a grudge like never before because groupthink reinforces the conviction of their own rightness or virtue. Ever try to get someone on social media to see that the \"other side\" are human beings, and not just \"liberals\" or not really evil or wrong on some point? When I tried that recently, I was told by a Christian, \"you sound like the liberals.\" End of discussion. There is no reasoning with the \"us vs. them\" mindset that dehumanizes people.\n• \"slanderous\" - Social media increases and promotes outrage while at the same time offering you an all-too-easy method to verbally attack anyone whose viewpoint offends you.\n• \"without self-control\" - Imagine having a weakness in the area of self-control (drugs, alcohol, porn, food) and connecting with others like yourself—not in a 12 step program setting: \"Eh, you're fine, I've seen worse, in fact, you are too hard on yourself.\" Even then, long-time AAs who harken to the original intent of AA doctrine and traditions call the groups in which the more modern and less-stringently moderated groups have extremely low success rates \"Let's all go to hell together\" groups.\n• \"brutal\" - Angry mobs have always been brutal. Social media brings angry mobs together as the video above about shaming demonstrates all too well.\n• \"not lovers of the good\" - With every conceivable interest and outrage being promoted and affirmed on social media, the truly good gets left behind. It's boring and not so sensational so it gets fewer shares. People don't fall in love with what they hardly ever see or experience.\n• \"treacherous/traitors\" - Online relationships are shallow and easily replaceable (Tinder, etc.), so why do you need loyalty?\n• \"rash/reckless\" - Facts, truth and nuance no longer matter as much so people now rush to judgment and outrage. It feels good and enough others who agree with you will affirm your choice, so why hold back and be careful?\n• \"conceited\" - Vanity is no longer such a vice. Just get a social media account and do your thing and you may get rich or at least famous in the process.\n• \"lovers of pleasure rather than lovers of God\" - Every obscure, hedonistic deviancy such as sexual fetishes of all kinds have their own online cultural subgroup now. If you love pleasure, however weird, now you can find the group that will affirm you and will join you. You no longer need to be alone, keep your interests secret and practice them rarely if ever at all. What do you need God for when you can have everything you care about all the time so easily?\n• \"have a form of godliness but denying its power\" - In the past, I could only imagine this characteristic in a religious context, which is why I was left stumped. One synonym for godliness is \"virtue\" and if this is only a form of godliness or virtue, then this may fit: The light went on once I learned about the popular social media behavior of virtue signalling. People who are not religious at all love to express their superior moral values in a conspicuous way. Often it takes the form of expressing something they know people will agree with such as calling out someone else's norm-breaking behavior, rather than doing something constructive in real life about it in an inconspicuous way (that takes more work, has more risk and gets you no kudos or glory). It's a form of virtue that's powerless because it's talk and not action. It's only increasing.\n\nWhat Does It All Mean?\n\nSo I have shared a lot. In my opinion, the evidence is overwhelming that the smartphone and social media are a bane for society, humanity, and decency. The smartphone is already so psychologically powerful on its own with the promise of text messages from your social circle, it's not very far off from Gollum's \"precious\" powerful ring of invisibility calling to him in the Hobbit and Lord of the Rings movies to put it on (and same to its next Hobbit owners Bilbo and Frodo). It's a fitting metaphor when you consider people continue to text and drive, how even in college classes, plays or other paid venues people cannot help being glued to their screens. They are off somewhere else instead of being present with those around them. When they are asked to surrender their phones at the start of events so they can pay attention to what they paid for, they resist saying, \"I can't; someone may want me.\" They fear missing out or being alone. Gollum would not give up his precious readily, either.\n\nSocial media makes the smartphone even more seductive which in turn makes social media more available and intertwined into our lives. At that level of engagement, social media's cyber-mobs take over our thinking, dragging it down, degenerating us. Who could have ever imagined a mobile technology combo so present and capable of modifying human behavior in so many negative ways?\n\nWhat does this mean and spell for us?\n\nIn a previous article, I shared the unexpected realization that when God fulfills Revelation by devastating Earth with a rogue planet, it will be so obvious who did it that it not only brings the end of civilization but the end of atheism with it (Rev 6:16-17). How could anyone continue to deny the existence of God when a catastrophic miracle happens which the whole world witnesses (Rev 6:15)?\n\nAs pivotal as that event will be, I must admit that I never stopped to ask a very important question about it: why does God disrupt civilization when he does? Before seeing this connection between social media and Paul's \"last days people,\" I would have answered it's because the end of the 6000 years allotted to man to fully test self-rule is near its end; \"time's up.\" Also, I would have pointed out that the end of civilization is needed to give rise to the Antichrist for the final 3½ of the 6000 years. The Antichrist uses the global crisis to be welcomed as \"God\" himself coming as the savior of the world (2Th 2:4).\n\nBut now I see all around me that God has a more directly justifiable cause for judging our society when he does, so soon now in 2026. I believe when God is asked later why he sent Wormwood on our society, he will answer that humanity had already peaked and was degenerating. Having more time would not change or reverse that.\n\nThe new, digital lifestyle that settled in during the 2010s has promoted learning of narcissism and demoted learning of empathy, the ability to put yourself in someone else's shoes. That's a big problem for God and his plan for this \"eternal life training simulation\" he put us all in. As I explained in my last article on the Bad News of the Kingdom, this life is designed to teach us what we need to live peacefully and joyfully in eternity with God and his other children. We cannot get along with God if we are encouraged to be narcissists who love ourselves more than God. We cannot get along with others if we are discouraged from learning empathy. The best way to learn empathy is to have a face to face conversation with someone.\n\nYet today we often hear or say ourselves, \"I'd rather text than talk.\" We even get bothered when someone shows up unannounced without texting or calling first.\n\nI saw a post on Facebook recently by a young man asking the best way to get out of unwanted conversations with taxi drivers who want to tell him about their lives. Talk about something a narcissist would say. The very thing that he needs to build empathy he's too self-important to bother with. That more and more widespread attitude is leading us to avoid the character-improving interactions that God designed life to revolve around.\n\nWhat If Virtual Reality Were Here?\n\nIf you don't follow my point yet about digital life defeating God's purposes to the point that we're degenerating too far, let me explain it another way.\n\nWhile researching this article, I listened on and off to a Joe Rogan interview of John Carmack, the legendary developer of 3D games Wolfenstein 3D, Doom, and Quake. He is now the CTO of a virtual reality hardware company. Virtual reality allows you to put on a headset that syncs with you as you turn your head to make it seem like you are in another world.\n\nCarmack sang the virtues of virtual reality, \"to make the world as you want it.\" Poorer people who could never have a mansion or home theatre could have one in VR. There are not enough islands in the world for everyone to have their own private island like Richard Branson, but with VR they all could.\n\nAs I was listening to this pitch, my mind immediately said, \"Bullshit! VR is not a panacea any more than the smartphone has turned out to be.\" He's missing the ramifications of letting people \"make the world as they want.\" If you want an idea of what a world with VR looks like then you need not look further than the first minute of Steven Spielberg's Ready Player One (2018):\n\nThe clip above depicts the protagonist descending a \"stack\" of trailers in a trailer park called The Stacks. As he passes his neighbors' trailers, you can see each of them wearing VR headsets while motioning in ways that make sense in whatever fantasy world their equipment is \"making\" for them. Who can blame them when you can escape your depressing world into the world of your making. But, see, it would not just be poor people who live in squalor doing this. Nearly everyone would like to make the world of their dreams. They'd be saying, \"I'd rather VR than R [reality]\" just as we say, \"I'd rather text than talk.\" But what would they learn about real life and real people that God had intended? Next to nothing.\n\nIn other words, if VR like that were ubiquitous today we would clearly understand why God would pull the plug on civilization immediately. God would see everyone opting out of the world he made to be in their own world. Today we are already in a more primitive digital/cyber world more and more and in face-to-face reality less and less with the consequent degeneration of our characters. Over the next seven years until 2026, this will only continue to worsen, and probably at an accelerated pace. I don't think we'll have anything like Ready Player One by 2026, but we'll be closer. Close enough and degenerated enough that God will still say, \"game over.\"\n\nNow that you heard my very heavy and depressing take on our degrading world and the technology that you yourself no doubt use that's causing it... how do I conclude this article and give you some encouragement?\n\nWell, as I did, you will have to process all this first. Take moments away from the phone and reflect. I was quite a bit sad to learn the things above and you may be, too. This does seem to be the death knell for this civilization, which has been retreating for years already. I see that the writing is on the wall. It's like learning the \"mark of the beast\" is here. I did not want to see or know it.\n\nSince processing this research, I'm more aware and wary when I'm on my phone or social media than ever before. I'm cognizant of how I'm playing with fire by using the very tool of our civilization's demise. Likewise, I'm more aware when others are \"using\" around me and remember to be patient when they do not give me human attention because of it. I realize they probably do not consider how the device is influencing them.\n\nIn the past, I'd be more like the man who wanted to avoid unwanted interactions with taxi drivers. Since learning the importance of conversation and interactions with others to gain empathy I'm less resistant when opportunities come up to engage like that. I gained a lot of empathy in Costa Rica and saw how that enabled me to stop making people wrong, stop judging them and love them more easily. Since that's what it's all about (Mt 7:12), I want to keep moving in that direction rather than become more narcissistic and less empathetic like the world as a whole.\n\nFinally, I am more aware now when I reach for my phone out of dumb habit, not from intention. I am aware that the phone has cut down on my solitude and prayer time. When I'm on the phone sometimes I ask if the time would not be better spent talking to God and inviting him into my life more. I ask if the phone occupying my mind is not blocking me from hearing something from God that would benefit me or my readers. This helps me to get off the phone. If time really is running out, cultivating that connection with God is a priority.\n\nThat is how the insights above have impacted me. I hope this inspires you to make similar adjustments.\n\nUpdate: Someone sent me this excellent article by a social psychologist, joking that maybe he read my article above? Actually, I saw the author on a Joe Rogan podcast months before writing my article when I was just beginning to comprehend that social media was more powerful and pernicious than we realized, despite our initial optimism and other good experiences with it.\n\nLast month's article (above) must have resonated with readers as many more than normal took the time to respond. Most expressed that the article confirmed their own concerns about smartphones, social media and “people getting worse.” One said they had already quit Facebook because of their convictions. Conversely, another urged me to amend the article with the advisement that people not quit their social media in case my conclusions were wrong and inspired them to do so. For the record, I never suggested we all quit social media; I only warned about its dangers and advised we all be more conscious of how it's affecting us as we use it.\n\nSpeaking of which, although I was as pleased as most readers were with the article, I was not happy with that rushed conclusion directly above. I had more observations to share to help people make a practical application of what I shared, but due to time constraints, I had to leave them out and finish the article for release (it had already been over a month in the making with many delays). In the following days, I intended to add another section to the article with those observations but I never got around to it. The positive responses that continued to pour in may have biased me against making additions.\n\nYet, it continued to nag me on and off until I got a long critical email, ten days after my post. When I read the email, I knew I had to go ahead and write the expansion you are reading now. Here's the email. (As you read it and see if you can understand why it convicted me):\n\nWhat do you think? Do you agree with my correspondent? He describes what many conservatives do not like about the world. I think many, if not most, readers will agree with him since my readership is mostly conservative Christians. I cannot say I completely disagree, either, especially on how the narcissism epidemic began (as stated above) in the decades before smartphones and social media with the self-esteem movement, replacement of free play with structured playtime and several other factors. For sure he has named several other real concerns beyond the ones I did.\n\nHowever, did you notice how we're talking about two different things:\n• He's speaking of long-term liberal agendas and trends that he and many conservatives feel spell disaster for their nation or way of life.\n• I, in contrast, was focusing above on negative trends across the whole spectrum of society that have been caused by groupthink enabled by very recent, revolutionary technology.\n\nBecause there is some overlap of trends between the subjects, I can understand why my correspondent missed my point (“Paul's 19 last days negative characteristics are all here now because of new, digitally connected mobs”) and instead he thought I was overlooking a much more pressing matter (“liberals have been destroying society for decades in many more ways than Tim listed”). As the writer, I take responsibility for this disconnect and consider that if he missed my point then I'm sure other readers did, too. That alone gives me reason enough to write this update.\n\nMoreover, his many statements directly relate to the issue I neglected to address in the first part of my article: what I see many Christians on social media doing and focusing on in conflict with what I see as the teaching of Jesus. This is why I was convicted that I had to write this update.\n\nHow Are Christians Getting Worse, Too?\n\nFair warning: you may not enjoy this “last days Christians” part of the article as much as the generalized commentary on “last days people” in Part 1 above. You may feel that I have “moved on from preaching to meddling,” as the saying goes.\n\nDespite that risk, I feel it is my job to point out what I have been noticing since getting on Facebook in 2006. The email above epitomizes it. In the early days of Facebook, Christians mainly used the platform to share sermons, scripture, testimonies, and events; many still use it for that. The biggest challenge back then was expressing your doctrinal position and discovering through an ensuing debate thread that not all Christians agree on the doctrines that you have received. The rampant division and infighting in Christianity were shock enough for most of us in the early days to handle. That continues today and is still sad in itself, however, increasingly, a bigger problem has eclipsed and maybe even lessened it: Christians are drifting further away from Christ's teaching as they get distracted with what I would express as “exposing and fighting the enemy to save the country.”\n\nThe sad truth is that Christians have always tended to follow what other Christians do (especially charismatic thought-leaders) rather than what Christ did and taught. It's what's easy and obvious. Jesus is hard to relate to, separated from us by 2000 years and his foreign culture and language. Modern Christians are relatable, speak our language and about the issues that concern us. It's hard to get excited about looking at and modifying your sinful thoughts and actions like Jesus instructed (Mt 5:48) but comparatively easy to plug into with your social group and get caught up with its \"heroic struggle\" against the enemy to save our way of life and nation.\n\nWhen you take Christians who already have a herd mentality (instead of a Christ mentality) and connect them into an online, digital “herd” through social media, all the bad things I already laid out for you in Part 1 happen to them just the same as it happens to everyone else. They fall into “us vs. them” mentality (ingroup vs outgroup), they vilify and dehumanize the outgroup, and they radicalize in their opinions, words, and actions against the outgroup. It's one thing for non-believers to fall for this, but quite another for believers who profess they follow a Savior who practiced and taught love, even love for “enemies” (Mt 5:44).\n\nLet me highlight three major errors in thinking that I see Christians fall into at an accelerated pace because of social media groupthink:\n\nHave you noticed how many “enemies” Christians rant about on Facebook, trying to expose and combat them? Here are the regular targets of posts by my Christian Facebook friends (by no means an exhaustive list):\n• Muslims (E.g. “Did you know by 2050 they project the Muslim population will overtake the Christian population? Christians need to have more babies!”)\n• ISIS (“It's OK to hate them, they are God's enemy.”)\n\nBecause Christians feel their lifestyle or values threatened are under attack by these groups we can understand how easily this translates to dislike and even hate of them. I get it and do not judge anyone for obsessing over their perceived enemies. Let me get that out of the way that I am not here to judge.\n\nYet I do want to shed light on how allowing yourself to follow the crowd (or your base impulses and emotions) in this can bring you far removed from what Christ taught. Jesus taught to love thy enemies (Mt 5:44) including enemy groups. In his day the equivalent of Muslims, ISIS and LGBTQs were the Samaritans, Romans, and eunuchs, respectively. Philip converted a eunuch (Acts 8:26-40), Jesus healed a Roman centurion's servant (Mt 8:5-13) and he used a Samaritan as the central character in one of his most famous parables, the Parable of the Good Samaritan (Luke 10:25-37). That parable portrayed a hated Samaritan (think Muslim) as far more compassionate than a Levite (think Christian pastor) to teach Christ's audience that it's not about who you are (“Abraham's offspring/”) or what you call yourself (“Jew/Christian”) but whether you overcome your biases, emotions, and apathy to love others (see Matthew 25's Parable of the Sheep and Goats if you have any doubts about Jesus clear emphasis on loving others in action).\n\nSpeaking of which, that's the real enemy Christ said to focus on, the enemy within, our carnal nature, our prideful self. Everything within us that leads us to break the Golden Rule eventually needs to be identified, exposed and defeated so we can do what Christ said was the greatest commandment, the one that summed up the whole Bible at that time:\n\nYou may say, “Tim, but can't a Christian be an activist against Antifa and do what they can to prevent them from hurting others?” Sure. I'm not saying it's wrong to take part in a good cause against a harmful organization. That said, what I see often is that Christians are so busy focusing on various external enemies that they neglect to work on themselves. They never improve to become loving like Christ. It's like that saying evangelists often use: \"if you were put on trial for being a follower of Christ, would there be enough evidence to convict you?\" When we focus on all the sins of enemies we are fighting, we minimize our own sins as comparatively inconsequential to theirs, and not worrisome.\n\nI personally am so busy with the unloving thoughts, attitudes, and habits I have which God reveals within me that I have no time to join the fight against “climate alarmists scaring children.” You may say, “Tim what if everyone was like that, then nobody would fight against these evil forces and they would win.” That argument ignores the fact that not everyone thinks the same and makes the same choices, a \"what if\" that will never happen. “Many are called, few are chosen, few are faithful” means that if one person chooses to take his calling seriously by choosing it every day and saying no to other distractions, it will not change how the majority will go on choosing against their calling, not remaining faithful. Jesus said this would be the case in the Parable of the Sower:\n\nUnfortunately, most Christians fit in the category of the seed that fell among the thorns. They hear the Word but get distracted by worldly cares and concerns. I am choosing (and praying) to focus on being a “hundred-folder” which for me personally requires saying no to fighting Antifa, climate alarmists, LGBTQs, and anyone else. There are plenty of “Christians in thorns” who will decide a different focus, or \"thirty- and sixty-folders\" who can handle battling both the internal and external enemies—leaving no pressure on me to abandon my Lord's high calling.\n\nLet's say you are one of those rare Christians who can multitask well enough to “major” in carrying on your calling (to overcome your enemy within) and to “minor” in engaging in a cause against an external enemy. Note well I am not saying this is impossible or such people do not exist, even if I know I am not one of them.\n\nEven then, there is still danger and risk for such a person to lose focus and fall into apostasy. When you put someone into a group that is working together against that enemy, they become susceptible to all the groupthink effects described in Part 1. Remember, a group tends to dehumanize outgroups and radicalize (worsen) the group member's feelings and actions against them. In other words, feelings can move from “they are deceived; we have to stop them” to “they are evil; I hope they die. Did you hear what they did this time?!”\n\nAs the language becomes more vitriolic the Christian can forget that they are to be different in speech and character, especially with adversaries. In fact, dealing with adversaries is the best opportunity to demonstrate the difference of the way of Christ. Instead, I regularly see Christians on Facebook resort to slander, gossip, mockery, ridicule, and hate speech against others. When I ask them about it they always justify it.\n\nOne time I saw a Hebraic Christian post an article titled “China bans burqas and 'abnormal' beards in Muslim province” with her comment “HURRAY!” I commented that she seemed to not be shy about her schadenfreude (pleasure in others' misfortune) and perhaps (giving the benefit of the doubt) it was because she lives in fear of Muslims in that province? Her response was:\n\nIn her defense, she elaborated later that her rejoicing was as I offered over the safety issue of burqas (preventing identification of potential Muslim perpetrators). However, all the things she said before that show there is much more than a concern for the Chinese going on in her heart. The sarcastic tone in mocking and villainizing the Muslims was revolting. She not only spread misinformation that Muslims worship a “moon God” but went further to state that they actually worship \"Satan.\" (Note that whoever Muslims actually worship does not matter; we still are to love everyone. Claims about who they worship is just an attempt to justify bad behavior towards them.) In simply asking her to explain her jubilant reaction to the news story, she turned on me and suggested I must be one of them.\n\nThis is by no means an isolated incident. I am sure you have also seen Christians speak in an offputting manner about hated groups. In researching this article I have dared to ask more than a few friends about their posts and paid the consequences. As they justify their unkind words, I almost always get insulted or accused of “being one of them, too.” Once when I responded to a friend's post comparing climate change alarmists to Nazis by posting a reference to Godwin's law, they replied that they needed to reevaluate my book they had bought and highly praised the previous year, as I was “not sounding Biblical or very truthful.”\n\nHere are some justifications I have heard for hateful, mocking, slanderous, or even clearly untrue posts by Facebook friends:\n• “What they do is far worse than the words I'm posting” (My response: Mt 6:14?)\n• “The mainstream media is suppressing this information so I am sharing it here” (My response: Is our calling to become like Jesus or to spread “information”?)\n• “I am trying to wake other Christians up to the truth” (My response: Jesus said he was the truth in John 14:6 and by the looks of it, Christians desperately need more of this truth than anything else.)\n• “It may be false, but it's funny” (Yes, I shared this one already above, but include it again in this because I think it's a common motivation that is indefensible.)\n• “Yes, I admit I do this sometimes in retaliation for what I see the other side saying against us.” (One honest reader admitted this and I praised her for her honesty. Jesus said in Matthew 5:38-42 that it was highly blessed to resist the temptation to retaliate and instead do the opposite of retaliation and “go the extra mile,” blessing them instead.)\n\nI could say a lot more about each justification, but I think you can see on your own that most of them are not very good, especially in light of the speech ethic that Jesus' brother James described:\n\nOuch, right? That's just a taste of what James and the Bible have to say on standards of speech for the righteous. (More below.)\n\nUltimately, for what big cause are Christians retaliating against “the enemy” and fighting so dirty? Are they trying to “convert people to Christ?” Are they trying to “shine their light?” Nope.\n\nYou saw the actual reason mentioned in the email quoted above. The common understanding is that these enemies are “destroying America” which some also see as liable to “bring down the world.” (Most of my readers are Americans but I imagine non-American Christians also want to see America preserved in addition to saving their own nations from the liberal onslaught there.)\n\nWho does not feel justified and even obligated to defend their home country or, for people outside America, to defend “the defender of freedom and democracy?” If it were not for America, WWI and WW2 may have turned out differently. How could we let America fall?\n\nAgain, I think Christians who talk like this are forgetting what their calling is supposed to be about. It is not to save a nation or even to save this world, but to save themselves and let their light shine before men so that they may enter the Kingdom of God later. Jesus' main message was the Gospel/Good News of the Kingdom of God (Mt 4:17) and he told us to seek the kingdom and his righteousness “first” (Mt 6:33). In the model prayer he gave his disciples, the kingdom is featured prominently:\n\nWhat did he mean by the kingdom of God? Most Christians have no clue, so it's easy for them to forget what Christ said and get busy fighting for the kingdom they currently live in, instead! Jesus addressed that very issue when Peter fell into the similar trap of fighting for a cause Christ never asked him to fight, defending Jesus from “his enemies:”\n\nJesus strongly disapproved of Peter's actions to the point that he even reversed the damage Peter had done to the enemy! That's the strongest rebuke. Further, Jesus stated that, as far as “his servants” are concerned, they were not to fight on his behalf. Lest there be any confusion, note that I am not saying Jesus taught pacifism or that we cannot fight for other causes as we did against the actual Nazis. (Veterans, thank you for your service defending the country from real enemies.) However, on his behalf, he's specifically stating that his servants are not to fight because this is not his kingdom. That situation has not changed; the kingdom is still in heaven only and has not arrived on earth. We see in prophecy that when the kingdom of God has enveloped the earth after the 7th trumpet (Rev 11:15) that Jesus and his servants arrive to fight (Rev 19:11-15).\n• If you fight to save America for Jesus,\n• If you fight to save America for Jesus, anymore because those who serve him are told not to fight but to love (John 13:35=Mt 7:12). You're a vigilante, actually serving yourself.\n\nAgain, I'm not judging you if you fight anything or anyone for whatever reason you choose. I'm merely pointing out that the calling which Jesus gave his servants precludes saving other kingdoms for him or fighting his enemies before his kingdom comes. If you want to fight liberals go ahead, knock yourself out. I still do not judge you. I would recommend you stop telling yourself that you are doing it for God or because they are “God's enemies” as that is not compatible with Jesus' plain instructions to his servants.\n\nAs I strive to be a servant of God, Jesus' instructions on this point are clear enough for me to have a clean conscience about letting America fall to the liberals, the Russians and whoever else comes. If you still want to keep fighting, it may be wise to ask yourself what your actual reason is for doing it. You may discover that in all truth you despise liberals or you fear ever losing your country or your way of life...or you may find something else important you would want to know about yourself. It might also be fruitful to ask what your faith is based on and what you are willing or unwilling to sacrifice for your calling to be God's servant. Not all of us have faith in God's total goodness if it means seeing the nation we identify with defeated. I mean, imagine the faith Jesus had to have in God's wisdom and goodness to follow through with the plan of his enemies defeating him? The narrow path is not easy at all which is why few are on it (Mt 7:13).\n\nFinally, as most of you know, I teach that America is Mystery Babylon which is prophesied to fall in WW3 about when Wormwood appears in the sky. If you believe this doctrine then you understand why I often say that anything we fight or do today in America is “like rearranging deck chairs on the Titanic.” It's temporary and impotent to change the ultimate outcome and therefore arguably a wasteful focus or waste of time. If you believe this prophecy, too, and are still \"fighting liberals\" to save America, it might be a good idea to ask why and even reconsider that tack. It is up to you.\n\nHow to Get Back On Track\n\nIn Part 1 one of Paul's 19 characteristics I covered was about “having a form of godliness but denying the power thereof” (2Ti 3:5). I argued that it can apply to secular people, such as “social justice warriors” having a form of “virtue” (another possible rendering of the Greek word) just as the other 18 characteristics clearly apply to all people, not just religious ones. However, if godliness is the right translation it would apply more correctly to folks with that facade of godliness called religion.\n\nFollowing the religion of Christianity is pretty easy. You mostly just need to go to church and pay your tithes. No one polices your online behavior and takes away your Christian membership if they catch you being horrible to others. (I always say that compared to Judaism with Sabbath and the rest of the 613 commandments, Christianity is a walk in the park.) This makes Christianity a form of godliness “denying power” because it requires nothing of its adherents. No one is impressed with a Christian for sacrificing an hour at church weekly and the rest of the time acting no better than anyone else in actual situations that test or measure our character.\n\nBeing a servant of God, subject to Jesus' instructions requires tremendous sacrifice, humility, and willingness to change yourself to become more like Jesus little by little. The rare people who take on that calling do shine a powerful light by their loving example (Mt 5:16) when it is not natural or easy. God often enhances their light with his own power through divine appointments and even miracles. We have all heard testimonies of this.\n\nIf you want to get back on track with Jesus and see that power in your life, how do you do it? Where do you start? When John the Baptist was asked this very question in the first century, he gave an answer that perfectly fit the temptations and challenges of his audience's primitive civilization (“soldiers, don't extort; tax collectors, do not embezzle; those with surplus, share it with those in lack” - Luke 3:10-14).\n\nToday, we have different temptations and challenges and I am certain his focus for repentance would be different today. If John the Baptist were here today, I think his number one instruction would relate to how we are time-challenged with too many things vying for our attention, so many good things to do, watch and consume. We could all do better by slowing down and doing less to leave room to hear from God and see his leading and then to make better choices based on that (Rev 3:15-18). That's number one for this modern, 21st-century world.\n\nI think right behind that one, his number two for saints would be something like James' warning about our speech. Back in his day, you probably did not know how to write nor have the paper to write on if you did, nor many potential readers. Words were limited to what the tongue could project out to those within hearing range. Nevertheless, James in his epistle warned about the dangerous power of “the tongue, the tongue, the tongue” (James 1:26; 3:5, 6, 8, 9). How much more pertinent is James' warning today when practically everyone is literate and can project their words around the entire world with social media? Because of this amplification of the power of our words, social media is one of the most potent weapons ever invented. It has done a lot of good because of this, but as we have already covered, it is being used even by the saints to do a lot of harm. Christians simply do not realize that they have unwittingly become part of a Christian mob that is just as bad as that sounds when you consider the dozens of groups Christians consider as justifiable targets of their verbal mob violence.\n\nAgain, I am not going to suggest you quit social media. That's up to you to decide, to do if you feel convicted about it. What I want to do to help you with your speech is first to let the Bible speak to you on the subject. Then I want to share some testimonies on kind speech.\n\nI already shared a little from James above. He has the highest ethics on words in the entire Bible so I am including everything he says on the subject this time:\n\nHere's a collection of assorted verses from the rest of the Bible:\n\nWow! The Bible is powerfully convicting on this subject when taking so many verses together at once, isn't it? I have read James alone many times and always felt humbled by what he said because I knew I did not control my tongue well enough and therefore was far from “mastery” as he said, bordering on the worthless religion for most of my life (James 1:26). I have said my fair share of unkind things about others, despite feeling the sting of others doing that to me. How could I ever stop it?\n\nIn the past year even before thinking of writing on this topic I felt convicted to start at least changing my habit of cursing when feeling suddenly out of control in a situation. It took me many failures over many months to make any progress; it was discouraging. Yet gradually I began to gain awareness of what was triggering me and the reason why. With that insight and I was was able to make a new habit of reassuring myself in prayer that all would be fine when things look wrong and out of control. I do not feel the need to curse and instead ask myself in faith how even this is going to \"work out for good\" (Rom 8:28)?\n\nSometime later, God then convicted me to try to avoid saying snarky, critical things. I saw a conservative video about Michelle Obama saying something inaudible on camera during a 9/11 memorial while a flag ritual was being done. Nevertheless, people were trying to make out what she said by reading her lips. How embarrassing it would be if she actually did say something snarky and disrespectful about the 9/11 memorial thinking it was in private only to discover the whole world was listening in an unforeseen way? I thought about how I say snarky things, too, and considered that I may never know when I am around a \"hot mic.\" With doorbell cams, nanny cams and spy cams everywhere in people's dwellings now, this is not as paranoid as it sounds. I felt convicted that it was finally time to work on my critical and unkind comments so that even when I think no one is listening, I have trained myself not to utter them...just in case I am wrong.\n\nHas God convicted you personally yet on your speech? Few of us are above saying uncalled for critical things at times as it's socially acceptable and shows we are \"above it all.\" In my experience as a Bible teacher I know that simply sharing what the Bible says to do (e.g., speak kindly) is often not enough to convict people. Christians have heard most of the Bible many times before, reducing the impact of hearing those verses again. It often helps more to hear the specific reasons for the Bible's instructions or specific examples of outcomes from following or not following them.\n\nTo help with that, I am going to share two true stories that I heard in sermons on the power of positive or kind words. They may inspire you to work on your speech better than the conviction from Bible instructions alone.\n\nKind Words Story #1: An Essay in Math Class? “Write All the Good Things\"\n\nThis is a true story that you may have already heard since it circulated widely as a chain email in the early days of the internet (the late 1990s):\n\nHow rare sincere, positive words are! They are so rare and valuable to people that if they get any, they hold onto them like gold. Most never realize this potential to their words because they do not say enough kind words to hear feedback such as this.\n\nWhat To Do Next: Challenge Time\n\nInspiring stories, yes? Wouldn't we all like to have our words save a life like Steve the manager's or deeply impact several lives like Sister Mrosla's math students' words did under her direction? Sure we would. Talk about “having a form of godliness [with] the power thereof!” (2Ti 3:5). But...what chance do we have of ever being skilled enough at speaking kindly to achieve such powerful results?\n\nPlenty, if we only stop practicing the negative speech we currently do and start practicing positive speech instead. With time we will improve and our kind words will multiply enough to have some return to us as kind stories.\n\nBut first, again, you absolutely must be convicted that you need to change this and are willing to put in the work. If you're not fully convicted yet, then pray for God to help you as he did me. It may take multiple “doses” of conviction.\n\nIt did in my case. I already shared a couple of episodes of conviction above. Yet I was convicted further a third time before deciding to write this update. I was visiting my son's apartment to drop off his laundry. While there I noticed the sink was full of dirty dishes, a filled trash bin was swarming with fruit flies and it did not smell nice. I reflexively commented about “how disgusting” it was. Later that day my son called and informed me that he was in the apartment and sleeping in the next room when I made my critical comment about the horrid state of his apartment. He said he did not enjoy waking up to hearing my negative words. I was mortified. I apologized that I did that to him, not knowing he was there. I hung up and went out for a bike ride, listening to sermons I had loaded previously on my iPod like I usually do. One sermon I heard was on the power of our words and included the two stories I shared above. I knew it was no accident that it came up when it did, right after getting off the phone with my son. As you can imagine the combination of feeling terrible my son heard my words in conjunction with the inspiring stories convinced me that God was signaling to me to press forward harder with improving the nature of my speech.\n\nIf you now are convicted enough to make changes in your daily habits, then I suggest you do what the sermon I was listening to suggested at the end: set a goal to change your speech and hold yourself accountable for a set time, whether it be 24 hours or 30 days. Can you stop saying unkind things about or to anyone else? Can you practice saying kind things or nothing at all? Can you do this for even one day? I bet you can't; it's not easy at all. That, of course, must include things you share on social media! Can you stop being a part of Paul's prophecy about last days' people being “boastful” “brutal” “slanderers” “denying the power of godliness?\" If you challenge yourself to meet the Biblical standards of righteous speech, I think you can.\n\nBy the way, the sermon included the testimony of a non-Christian writer from Salon magazine who attempted the 30-day challenge of “no snark.” You can read about it here and hopefully use her insights as a springboard for your own self-improvement on this front.\n\nI hope this article inspires you to reconsider all of your use of social media and its effects on you, what you say everywhere, who your enemy really is, and which calling in life you want to make your main focus.\n\nUpdate: \"How do we 'have nothing to do with such people'?\"\n\nA few of the people who were convicted by the article to act on Paul's warning questioned me on how to comply with this part of the passage I quoted above:\n\nIf most of the world now is on social media and the fulfillment of Paul's prophecy, how can we possibly avoid involvement with \"such people?\" Well, we can't but thankfully we do not have to.\n\nRemember how I explained above that this chapter seems to have a first-century application for Timothy and a broader last days fulfillment for all of us? This becomes clearer if you continue beyond the part I quoted above:\n\nIf any of this sounds familiar, that's because Jesus warned about how the corrupt Pharisee ministers did similar things:\n\nTherefore my conclusion is that this \"no contact\" stipulation is referring to corrupt ministers who Timothy, himself a minster, would encounter. This is easier to accept if you disregard the chapter break that groups verse 5 with 1-4 in English Bibles. Chapter breaks were added arbitrarily and do not come from the original manuscripts. Without them, it is possible to group the \"no contact\" command of verse 5 with the more specialized description of people in verses 6-9.\n\nClearly, Paul could not have been telling anyone, even Timothy, to avoid nearly all people as described in verses 1-4. Instead, I think Paul is telling Timothy specifically not to associate with corrupt ministers. It is one thing that the world is now mostly narcissistic, but another to associate with ministers who are supposed to be far different from that (John 13:35). It would ruin the reputation of a servant of God to associate with reprobates like that. Although this is a specific command to Timothy, Jesus gave a general command to us on the same topic of avoiding false prophets/teachers who he described as wolves in sheep's clothing (Mt 7:15). That is something we all would be wise to heed.\n\nPart 3 – 5 Keys to Success At Doing What Jesus Said\n\nOnce again I received enthusiastic responses to the latest part of the article (posted directly above). As before, I did not plan on writing another part, but the content of some of the responses made it clear I needed to address another aspect of this subject for completeness. Here's one of the responses:\n\nAnyone who has been convicted to improve their behavior and then commits to making changes can relate to my correspondent's letter. Ironically, as you try to be better you inevitably feel worse. With each incident of failure there comes a greater awareness that you are not doing what you committed to doing; \"you are failing, you hypocrite!\" You start to feel out of control then hopeless and alone. Yet you are not alone; 1900 years ago, Paul already expressed the same frustration:\n\nOur Proven Keys and Strategies To Success\n\nWe have experienced this despair many times since we were convicted by God years ago to watch our speech. It started with a conviction about our complaining which we felt directly denied what Jesus said about God providing all our needs (Mt 6:33). Complaining about each other, complaining about third world Costa Rica conditions (where we lived at the start of this repentance journey), complaining about what we do not have, and so on. It took many attempts, failures and new insights to finally change that behavior across the better part of a year. (We together talk about that journey in a couple of our podcasts in the supporter content.)\n\nThen, as I related above, I moved on to my outbursts of cursing and also critical, judgmental comments about others. I was met with the same frustration of failure in the face of my intention to change the nature of my speech. This time, however, it was a little easier because I knew the keys to success from before and that I was not alone. God was certainly going to bless this goal of repentance.\n\nIn this update, I will share the keys and strategies we have learned and leveraged to modify our attitudes and behavior according to what Jesus taught and demonstrated.\n• See hard people as a gift, hard experiences as training\n• Be curious and quiet to uncover the heart source of failures\n\nI can tell you that of all the areas of repentance we can talk about, controlling your tongue is probably the most difficult for the average person as James alludes to (James 1:26). That might sound like a discouraging point to make, but it actually makes it a great starting point for learning how to overcome the right way: with God's help like Paul concluded in his rant quoted above. When it comes to speech, your own effort will fail so frequently that you can more easily understand how insufficient your limited strength is. This will drive you to your knees to seek God in a greater way than perhaps you ever did or knew how to do before.\n\nLet me illustrate what I mean by this. My first career, starting when I was twenty, was doing application programming. I did this throughout my youth for twenty years. In that time I cannot recall ever praying for God to help me do my job. I figured God gave me a brain and it was up to me to use it to do my work because it was not something related to salvation or repentance and therefore not something to include God in. Yes, we can both probably chuckle at that naive perspective now, but that is really how I saw God. Do not bother God for things you should be able to do yourself!\n\nThe same thing happens to many when they embark on a new goal of controlling their behavior. As adults, we're expected to control ourselves and thereby distinguish ourselves from children who cannot. We “should” all be able to stop saying mean things and start saying kind things without any help, right? So we think. Then we try and fail, and fail again. We have heard this many times from people who have consulted with us. When we ask how they are including God in it, it usually is revealed they were mostly doing the repentance on their own strength.\n\nWhat we recommend is to include God in all phases of the process:\n• “Spot-pray” before and during dealings with difficult people or situations.\n• After a failure, confess it to God and tell him it goes to show that you need more of his help. After a success, praise and thank God for his great job as your life teacher.\n\nDo your part but learn to rely on God more than you ever have before.\n\nFinally, do these prayers with full confidence knowing that God is pleased you are taking his command to love your neighbor as yourself (Mt 7:12) seriously. He is also pleased you are humble enough and faithful enough to come to him for help. He will bless your efforts quickly.\n\nThe next most common mistake people make in personal change (after not including God enough) is to expect too much of themselves and then to beat themselves up for their failures. Basically it's the trap of perfectionism. As you may have seen or experienced personally, perfectionistic people withhold forgiveness of themselves thinking they do not deserve it and that this self-abuse will motivate them to improve. However, the truth is that it's neither fair nor effective.\n\nFirstly, it's just not realistic to expect perfection or no failures. We have to realize that the habits we want to change have usually been forming for decades. We have grown up in a culture that has normalized being less than loving in our speech and actions. This goes for church culture, too. Let's just say Christians are not known for their impressive ability to never gossip and never judge or criticize each other. (I do not have to say more than that for longtime church-going readers who have been verbally abused by not-very-Christlike Christians.)\n\nSo when you see the verses on loving speech as I quoted above or like this one for example:\n\n...stop and consider that the culture that holy angels like Michael are immersed in is very different from the unholy culture we are immersed in. As covered in part 2 above, slander is part of the \"last day's people culture\" that Paul predicted as easily seen on social media (2Ti 3:3). But can you imagine Michael the archangel engaging in “trash talking” against Satan? I cannot imagine that any more than I can imagine a UFC fighter in a promotional appearance saying “The LORD rebuke you” to someone trash-talking him. My point is that we have been surrounded by examples of and practicing ourselves mainly trash talk. We need to give ourselves a break while we stumble and look stupid in the processing of learning a new way of “treasure talking” =).\n\nSecondly, beating yourself up or hating yourself only reinforces a view that you are trash and cannot change. Not only that, you project this perception on God thinking he must certainly see you the same way and is impatient with you and not willing to help you until you \"repent.\" When you do not forgive yourself, you are often implying that God does not forgive you either. That's a lie as God says his mercy endures forever and his forgiveness is available to all who turn to him. He did not say he only forgives those who are perfect enough or performing well enough on their own first.\n\nStrive to see yourself as God sees you. Even better, make that part of your daily prayer (something I have done for years). God loves you and is pleased with your efforts to seek and obey him. He does not expect perfection. His “yoke is easy and his burden is light.” Stop making artificial yokes and standards that are harsher on you than God is. It will help you to see yourself as someone God will help. That faith boost will move God's hand to bring help and encouragement to you quickly on your speech.\n\nKey #3: See Hard People as a Gift, Hard Experiences as Training\n\nWe try to control our lives to make things easier and more comfortable for ourselves; “avoid pain, seek pleasure” as the mantra goes. So when “life happens” and wrecks our plans, causing discomfort or inconvenience, we easily resent it and complain. If certain people are to blame for “disturbing of the peace” of our life we feel resentment towards them. We may even resent God for \"not helping us more\" or fall into a victim mentality or persecution complex.\n\nThis is quite common and understandable up to a point. That point would be where we review again these central promises of the Gospel of the Kingdom:\n\nIn other words, God provides all our needs. This includes not just our physical needs but also our educational needs such as discipline and new information. He does not just do this when we're bad but also when we're good and righteous as we see in many Bible stories such as the trial of Job. There are many things in life we cannot learn simply by instruction but must learn through personal experience, often unpleasant ones at that.\n\nTherefore, when we feel persecuted by life or victimized by others, we are forgetting that God put these things in place to provide us with the correction and training we need. Hard circumstances are sent by God in love for our good. Hard people also are sent by God for our good. When we resent life, people or circumstances, we are forgetting this hidden yet fundamental purpose of life revealed in the Bible. We deny the Good News and the faith itself by judging these things as wrong or that they should not be happening to us. Additionally, when has the conclusion that we are \"forsaken by God,\" needlessly persecuted or victimized ever solved anything or brought peace or happiness?\n\nWhat does improve our mental state and can even bring peace is choosing to see meaning and purpose in our suffering and trials. This worked even in the Holocaust as Viktor Frankl wrote about in Man's Search For Meaning. Difficult people are a gift from God. They help us to see where we are weak and lacking in faith. The same for hard circumstances. This is why James said to \"count it all joy when you find yourself in a trial\" (James 1:2-8). It's going to improve you and likely bring a blessing from God when you pass the test. What I'm suggesting is to consciously make a paradigm shift about difficult people and difficult situations. See them both as gifts from God to help you.\n\nWhile you are at it, stop trying to change people. They are perfect the way they are to help you be perfected. You can be happy with everyone staying just the way they are if you change yourself. As Paul said, he could be content in all circumstances (with only imperfect people around him) (Php 4:11-12).\n\nTry it; it works. But don't take it from me, read about how the Norwegians use paradigm-shifting to be happy about their long winter with the sun not rising above the horizon for months.\n\nKey #4: Be curious and quiet to uncover the heart source of failures\n\nThe three keys above will go a long way to help you to handle frustration and avoid giving up on your repentance so you can endure long enough to see some encouraging improvement and victories with God's help.\n\nHowever, if you want to move on to mastery, especially in difficult areas, you are going to have to do something most of us try to avoid: examining our hearts and thoughts. Because as Jesus taught, “out of the abundance of the heart, the mouth speaks:”\n\nIn other words, if you find you continually fail to control your tongue in a certain situation or with certain people, most likely there is a deeper issue behind it such as a strong fear, trauma or false belief. In that case, no amount of will-power or brute-forcing will keep your heart from expressing something other than the love you intend.\n\nAfter these failures, it's still important to exercise the forgiveness and release of guilt mentioned above. Then if you are able, replace the guilt with curiosity. Be curious about what is triggering this. Pray for God to reveal it if you cannot see it. Then take the time to listen to what comes to mind.\n\nThis is the process we follow to make breakthroughs where you are stuck or break habits. I touched on this above how in attempting to stop cursing when angry that I struggled and seemed to get nowhere for months of intention and focus. After doing prayer and contemplation post-failure, I started to get insight into why I was feeling the need to curse. I saw that I felt threatened by being out of control which in turn made me feel unsafe. However, I could immediately see that this belief was a lie since God is with me and has always been with me. Despite setbacks, things always turn around for the better with God's help in my life. When something breaks and it invariably gets fixed or replaced—sometimes with something even better. It's never been the end of the world although it felt that way many times. After gaining those insights, I decided to make it a point to not react immediately from something bad but to count to ten, pray and remind myself of all these truths. Instead of cursing the world, myself or someone else, I quickly adjust to the unexpected or unwanted situation and return to peace.\n\nHaving said all this, I must also point out that self-reflection is something not everyone is comfortable with. Most of us do our best to ignore being alone with our thoughts because we find them ugly, embarrassing or downright frightening. Along these lines, the French philosopher Blaise Pascal stated that “All of man’s troubles come from his inability to sit quietly in a room by himself.” If this is the case with you then your first step is to take that to God as well. Also, whatever dark things you discover in looking inward, you must trust that God can heal it all and be confident that “he who began a good work in you will continue to perfect it until the day of Christ Jesus” (Php 1:6).\n\nFinally, I have to warn you that if you do not want to look inward because you have issues with self-rejection, self-loathing and lack a healthy self-love (\"love your neighbor as YOURSELF\" - Mt 7:21) , then I do not recommend you do so until you have gotten healing on those issues from God (Rev 21:4). I have seen a few who took our advice to look inward only unravel in depression because of unhealed abuse or other trauma in their past that caused them to be more easily triggered into self-rejection and depression.\n\nI wrote an email my correspondent quoted above. It contained the four keys above albeit in a much-abbreviated form. Nevertheless, weeks later she shared the following report:\n\nBy practicing the keys above, you too can make progress and even gain some level of mastery in certain aspects of your speech. You'll never be perfect, but again perfection is not necessary. God just wants to see you adopt his law in faith so he knows you will be in harmony with him in eternity. Nevertheless, what you focus on and practice will grow. You will become “better than the average bear” at expressing love in word and deed. People may even take notice and comment that you do not complain, do not speak evil of others who are not present, let alone gossip. They may express appreciation about the kind words “fitly spoken is like apples of gold” (Pr 25:11) that come out of you (thanks to practice and the inspiration of God).\n\nSuccess! Changing bad habits and becoming more like Christ than you ever imagined does make you start to feel good about yourself and proud of your changes. As always, even healthy pride and good success can “precede a fall” (Pr 16:18).\n\nI used to take that proverb very negatively. Now I see it as part of a natural cycle of human nature. Psychologists have found repeatedly in their research that entitlement and vanity come to us very quickly with any feeling of elevation we receive or achieve. This goes for even the righteous and vigilant who are walking the narrow path Jesus described.\n\nGod in his love may orchestrate new, harder and different situations to continue your education. Part of it is to give some needed dose of humility, some of it is to reveal more of your heart in need of healing, and many other possible things for your good.\n\nYou could call it “leveling up.” Before the leveling up, you may have a test or two in a row that you pass well or even with flying colors. You will be partly surprised that you did not handle the situation badly the way you used to, and partly not surprised, knowing you have been making steps towards this achievement. Your expectations of yourself and your behavior will rise accordingly (despite what I said above in Key #2 about staying realistic). It's natural.\n\nSince the old situations no longer challenge you or cause you to grow, you need a new much harder situation or one that triggers you in a new way. You can guess what happens. To your horror, you fail, perhaps “epically.”\n\nAt this point, you can easily fall back to self-loathing (despite Key #2). Better is to pause, think, reject that idea and replace it with faith in God's goodness. You may even be able to see God's fingerprints all over the event so that you were “set up to fail” as we say, but with the twist that a loving Father in heaven did it as part of your “continuing education classes” on loving your neighbor as yourself (Mt 7:12).\n\nI had an experience just like that very recently. After writing at length above on the importance of controlling our tongue, I had my own epic failure. Although it was very embarrassing, I will share it here as it makes for a good example of what I am trying to convey about God leveling-up the difficulty and value level of your trials.\n\nRemember how I wrote above that I decided to watch any criticism or negativity coming out of my mouth because after thinking about the Michelle Obama soundless video that people were lip-reading her to have said something disrespectful during a 9/11 commemoration ceremony involving a US flag? Between that and a friend installing surveillance cams throughout his house plus all the doorbell cams now, I have been on my guard ever since to guard my mouth like David said (Ps 39:1) and like Solomon warned about little birds telling the king that you cursed him (Ecc 10:20). I was practicing the four keys above and gaining awareness when I said negative things, feeling my conscience convicted and moving forward to do better with God's help and any inspirations I gained. I was making some small progress just like I did at first with cursing when I broke something.\n\nThen three weeks after writing the last update, I was praying about what to do with my Monday, like I often do when it's not plainly obvious what needs my attention next. Later in the afternoon, I remembered that I had received a notification from the local customs office of a package from Australia for me to come and pay for before receiving. It could wait, but the weather was clear and just warm enough (39°F) to use the errand as an excuse to go for a decent 30-mile bike ride to the customs office and back. Something clicked and was excited in my spirit to take care of both my health and the package together this way. So I departed.\n\nWhen I arrived at customs, I was disappointed to see who the agent attending me was. Unlike the nice woman who helped me last time, this was a man who gave me the impression he did not want to help me much. He always spoke German quickly despite it being obvious I'm an “Amerikaner” with poor German proficiency. The previous time when I arrived twenty minutes before closing, he at first said my paperwork did not have the file number and to come back Monday. When I found it on my phone a minute later, he refused to come back over to the counter to help and told me again to come back on Monday because the other agent who spoke English would be there. I got the impression that he did not like dealing with me, perhaps because of the language barrier.\n\nThis time he wavered between helping me to get my package and sending me away empty-handed twice more. At first, he proceeded to process me until he requested an invoice (that I did not have). Then I showed him the value of the goods from a previous invoice on my phone. Seemingly satisfied, he set out to calculate the tax so I could pay. Then...he suddenly decided I really did need to have an actual invoice. Fortunately, when I opened the box I had carefully removed the paperwork taped in that plastic sleeve on the outside and left it on the table. While I tried to accept that once again I was not getting my package thanks to this guy's whims, he noticed that among the papers from the package was an invoice. He took it and calculated the taxes so I could pay and be on my merry way after all.\n\nBut there was one hitch still. I came on a bike with a backpack big enough for the contents of the box, but not the box itself. I had handled this previously with another agent by asking if they could dispose of the box for me. (Every home and place of business in Germany has a big blue paper recycling bin for this). This time when I asked, this agent inexplicably denied the request and told me to take the box with me...on a bike. As petty as all this sounds in hindsight and in the telling, you could definitely say at the moment I was offended and thought, “Why does this guy always seem to want to make things hard for me?!” I felt like I had a bully who was picking on me for being a foreigner who did not speak the language.\n\nNevertheless, I told him “OK” and picked up the empty box and began to collapse it as I went out the door with the hopes of finding a way to properly dispose of it nearby. As luck would have it, the office had a garbage bin out there with enough space to fit my box if I flattened and folded it completely. As I was doing so, the agent followed me out, something no agent had ever done before. \"Was he suspicious and checking up on me to see if I just dumped the box like a criminal?\", I wondered while fitting the box into the bin. He passed by me to do something in his car and then went back inside just as I finished disposing of the box.\n\nAt that moment as I went towards my bike in front of the entrance, I uttered “asshole” to myself. Immediately I heard his voice inside the foyer of the office angrily repeating “What? What? What?” He came right up to my face and said in plain English (surprise, surprise) “What did you say?!” I was surprised he had heard me. Also horrified. I had thought he was inside already and safely out of earshot, but I was dead wrong. Was he angry enough to get violent? I hoped not and I quickly decided that repeating the curse word would probably not help the situation at all. In the hopes he was not sure what exactly he heard, I replied, “Nothing.” Thanks to God the lie worked and he immediately left me. I was embarrassed again that I had to deny what I actually said, but I was relieved at the same time to avoid an altercation or an argument with a German man as a clueless foreigner.\n\nI thought about it a lot on the ride home. How could this have happened, that a word like that which I never said to anyone before would come out of my mouth about someone when I thought I was alone but I was not...all this despite me already having made the conscious plan to work on myself to eliminate curses like that from my talk? How indeed! I had no doubt it was a perfect setup by the master Coordinator of life on earth.\n\nWould God really set me up for such a humiliating public embarrassment? I'm convinced he did because humbling is always good for our pride plus I learned in an unforgettable way that I had a persecution complex that needed to be dealt with or more ugliness would come out of me. I already knew I had some latent trauma from a few bullying incidents back in grade school. I just did not know how serious it still was. Certainly, as a writer who has an established career as a truth-teller and who plans two more books on the unpleasant truth about Christianity's deception and the unpopular narrow path of repentance Jesus taught, I need to work on my persecution complex. That way when real persecution comes, I can handle it in love, rather than with retaliation out of emotion as had just happened.\n\nWhen I got home I knew I had to make things right by writing a letter of apology. That evening and over the next day I thought about what to say, wrote and edited a letter. The next day I asked a friend to help translate it to German (and also to edit it for any German cultural differences). With the translation done and the next day free and with a clear weather forecast, I decided I would deliver it tomorrow and went to bed. I got up the next day and biked to the office again to face the music. I honestly did not want to do it, but I forced myself. I sheepishly entered the office, presented the letter, waiting to see if the agent would come to the counter, read it in my presence and maybe “tell me off” in German or whatever. Mercifully, he directed me from where he sat at his desk to leave it there at the counter for him. So that's what I did and left. Phew! (Although I included my email address in the letter in case he wanted to respond, so far more than a week later it's “all quiet on the Western front.” =)\n\nI find that when I face my fears or do other hard things for righteousness' sake (Mt 6:33), God often responds immediately with a big blessing. In this case, I had been praying intensely for days about the next book (the “Missing Manual” concept for believers). I had lots of topics planned and just arrived at a title I liked after many iterations and much prayer. A structure I loved came to me as well near about the same time. But how to start the book's first chapter? Nothing was more important to me than to figure that out. For several nights during my frequent bouts of insomnia, I had now moved onto praying about how to open the book in a compelling and inviting way for the entire audience I envisioned of mainly Christians and atheists. As you may already have guessed, an answer to the prayer came finally, after the incident with the agent. I loved the concept instantly as would make for a compelling opening that is also inclusive to both segments of my main audience.\n\nHowever, the inspiration did not come the night after I delivered the letter as you might have assumed. It came the night before when I made up my mind that I was delivering the finished apology the following day. I have seen this before in my life that when I make up my mind to do something hard for God, God often blesses me strongly the same day. The letter was written and it was as good as delivered, so God answered my prayer for inspiration. Stay tuned (and pray for me) as I hope to begin writing soon and have something to share early in 2020.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"How I Proved the Earth is Round (with my Bike and Two Sticks)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/YaPa4esJJx4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/YaPa4esJJx4?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Taking a Lonely | Sebastian Maniscalco: Aren't You Embarrassed\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/W1HGe6TEYHY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/W1HGe6TEYHY?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Adult Baby Dress Up | Sebastian Maniscalco: Aren&#x2019;t You Embarrassed?\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/chahtq-x-n4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/chahtq-x-n4?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe loading=\"lazy\" title=\"When ur door bell rang 20yrs ago vs Now\" width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/9hv0M4mnrE8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/9hv0M4mnrE8?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Ready Player One (2018) - The Stacks Introduction | Movie Clip on The Cloud\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/NWsHoXA0cn8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/NWsHoXA0cn8?feature=oembed"}], "links": ["https://escapeallthesethings.com/2026-in-prophecy/", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://rationalwiki.org/wiki/Good_old_days", "https://www.theguardian.com/commentisfree/2014/jul/08/the-age-of-entitlement-how-wealth-breeds-narcissism", "https://www.newscientist.com/article/dn6727-everyone-is-a-potential-torturer/", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/2026-in-prophecy/", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "/depart-from-me-i-never-knew-you-meaning/", "https://www.cdc.gov/measles/cases-outbreaks.html", "https://en.wikipedia.org/wiki/Flat_Earth", "https://www.techrepublic.com/article/a-conversation-with-mits-sherry-turkle-about-conscious-consumption-of-tech/", "https://escapeallthesethings.com/wormwood-nasa/", "https://wearesocial.com/blog/2019/01/digital-2019-global-internet-use-accelerates", "https://wearesocial.com/blog/2019/01/digital-2019-global-internet-use-accelerates", "https://onlineharassmentfieldmanual.pen.org/defining-online-harassment-a-glossary-of-terms/", "https://owlcation.com/social-sciences/Kim-Social-Psychology-and-Mob-Mentality", "https://www.psychologytoday.com/us/blog/after-service/201705/the-science-behind-why-people-follow-the-crowd", "https://www.psychologytoday.com/us/blog/friction/201807/why-social-media-makes-us-angrier-and-more-extreme", "http://en.wikipedia.org/wiki/Confirmation_bias", "https://www.scientificamerican.com/article/biases-make-people-vulnerable-to-misinformation-spread-by-social-media/", "https://www.vox.com/the-highlight/2019/4/16/18287446/incel-definition-reddit", "https://medium.com/s/world-wide-wtf/how-the-internet-made-us-believe-in-a-flat-earth-2e42c3206223", "http://www.bbc.com/future/story/20180104-is-social-media-bad-for-you-the-evidence-and-the-unknowns", "https://science.sciencemag.org/content/359/6380/1146", "https://www.theguardian.com/science/2019/feb/17/study-blames-youtube-for-rise-in-number-of-flat-earthers", "https://answersingenesis.org/astronomy/earth/reflections-flat-earth-movement/", "http://evangelicaloutreach.org/kjvo.htm", "https://www.greenwichtime.com/news/article/How-much-does-a-ticket-to-space-cost-Meet-the-14485562.php", "https://www.popsci.com/10-ways-you-can-prove-earth-is-round/", "https://en.wikipedia.org/wiki/Narcissism", "https://www.theatlantic.com/health/archive/2011/10/all-work-and-no-play-why-your-kids-are-more-anxious-depressed/246422/", "https://onlineharassmentfieldmanual.pen.org/defining-online-harassment-a-glossary-of-terms/", "https://www.nytimes.com/interactive/2019/09/28/us/child-sex-abuse.html", "https://en.wikipedia.org/wiki/Virtue_signalling", "https://escapeallthesethings.com/when-atheism-ends/", "https://escapeallthesethings.com/6000-year-timeline", "https://escapeallthesethings.com/satan-in-prophecy", "https://escapeallthesethings.com/antichrist-myths", "https://escapeallthesethings.com/the-bad-news/", "https://www.theatlantic.com/technology/archive/2015/10/reclaiming-conversation-sherry-turkle/409273/", "https://www.theatlantic.com/magazine/archive/2019/12/social-media-democracy/600763/", "https://en.wikipedia.org/wiki/Allah_as_a_lunar_deity", "https://en.wikipedia.org/wiki/Godwin%27s_law", "https://escapeallthesethings.com/mt-24-14-meaning", "https://escapeallthesethings.com/america-mystery-babylon-great", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://www.snopes.com/fact-check/all-the-good-things/", "https://www.latimes.com/archives/la-xpm-1999-feb-07-mn-5664-story.html", "http://sanderssays.typepad.com/XBOX%20Story%20Sanders.pdf", "https://www.salon.com/2011/03/29/my_month_of_no_snark/", "https://escapeallthesethings.com/support-team-options/#content", "https://www.fastcompany.com/3052970/the-norwegian-secret-to-enjoying-a-long-winter", "https://mistape.com", "https://escapeallthesethings.com/last-days-people-prophecy/print/", "https://escapeallthesethings.com/last-days-people-prophecy/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/the-bad-news/", "https://escapeallthesethings.com/pandemic-prophecy/"], "authors": [], "publish_date": null}