{"result_id": "109019", "URL": "https://escapeallthesethings.com/september-2015-prophecy/", "timestamp": "2023-04-25 15:03:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/september-2015-prophecy/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Seven Prophecies for September 2015 and Why They Annoy Me – Escape All These Things (Luke 21:36)", "cleaned_text": "Will September 2015 bring about the rapture? An economic collapse? Military takeover and martial by Obama through Jade Helm? Or CERN’s LHC destroying the planet? More importantly, what basic common truth are we forgetting when we even entertain or ask such questions? Find out that and why September, 2015 is just like December, 2012...\n\nYou may have heard some of the speculation about September, 2015 for prophetic things to happen. There are more than the usual amount of notable events coming in September that are driving interest in the month:\n\nSeeing rare events like these stack up in the same month really gets the prophecy and conspiracy theory mills into overdrive. The resulting theories lead plenty of Christians hearing them to get nervous if not outright worried and scared.\n\nBut not me. Instead, I'm a mix of bored and annoyed with the hoopla over September, 2015.\n\nWhy bored? Well, let's look at the big theories talked about or predicted for September, 2015:\n• The Rapture: It does not take much for pretrib rapturist Christians to smell the rapture coming. \"Rosh HaShanah\" (actually called Yom Teruah in the Bible or the Day of Trumpets) is a perennial magnet for rapture speculation each year. The supposed end of Sabbath year on Rosh HaShanah 2015 makes it doubly tempting to see a rapture there.\n• \"Financial Collapse\" - Jonathan Cahn says the shemitah is about punishing disobedient nations financially. With the shemitah ending in September, it's the last chance for his theory to come true. Therefore many are watching that date as expectantly as Jonah watched Nineveh to see what would happen (Jonah 4:5).\n• Martial Law: Because Jade Helm This US domestic military exercise starts in July and ends in September. It is the focus of much conspiracy theory such as being a \"pretext to install martial law and allow Obama to stay in office.\" Or that \"Christians will be put in FEMA/concentration camps.\"\n• \"Something Big\" - The lunar eclipse tetrad of 2014-2015 ends September 28th, 2015 and this has been associated with everything from the Great Tribulation, the rapture and \"something big\" for Israel. Yes, that's no joke. That's what John Hagee's book actually predicts in the title itself.\n• \"Asteroid Impact\" - Supposedly the government knows about some asteroid coming. It is due September 24th. Why then? \"It's the Jewish Day of Atonement.\" Actually Atonement in 2015 falls Sept 22nd-23th. Yes, this is like \"prophet\" Efrain Rodriguez's asteroid prediction all over again.\n• \"CERN\" (LHC) - Speculation that the end of the world can happen because of the Large Hadron Collider (LHC) will \"open the abyss\" in September, 2015. This on top of the past speculation that \"CERN\" would cause a mini black hole to swallow the earth. (By the way, I think Christians would sound less silly on this topic if they stopped referring to the LHC by the name \"CERN\" which is the organization behind LHC and several other scientific researches.)\n• - \"Comet Sept 18-26th\": I've updated this article with a 7th September prediction. As I explained in the previous (six prediction) edition, these things have a way of snowballing like December 2012 did going from just the Mayan calendar end of the world to many other reasons to fear the end. So now we have a comet prediction for September, too. See the new section below for why this specific prediction is nothing to fear.\n\nReviewing the list above, can you begin to understand why I'm bored?\n\nIt's because everything on that list has been predicted before. Most of them have been predicted recently before. All of them have been predicted multiple times in the past. And, of course, all of them still have not happened despite so many predictions and expectations.\n\nIf you ran a Bible prophecy website like me, you would hear about every single major prediction, over and over and get a little bored when the same events are predicted over and over with the same lame outcome.\n\nFor example, the rapture has probably been predicted to happen on multiple thousands of dates since Christ came 2000 years ago. Probably tens of thousands. Most of the Jewish holidays each year attract rapture predictions. Yet here we still all are.\n\nThe same goes for \"financial collapse.\" It is definitely the runner-up on this list in terms of number of failed predictions. It's a very common fear that another Great Depression or something even worse would come upon us. Ever since the Great Recession of 2008, predictions of \"the other shoe dropping\" have been rampant. Again, here we still all are, out of recession and in recovery (albeit uneven).\n\nRegarding \"CERN\" or, more accurately, the LHC, the end of the world through a mini-blackhole was predicted before it went live. Nothing happened. Then the Christian speculation shifted to the idea that the LHC opens a portal to hell or the abyss each time it's fired letting demons or fallen angels or Satan in. But this is silly. As the book of Job shows, Satan can only do what God allows him to. He can go to Heaven only because God lets him and one day he won't let him, but send him to earth. He already visits the earth and there are fallen angels with him and demons already. Man playing with atoms does not change any of that! The abyss will be opened at the start of the tribulation to release the locusts who enforce the mark of the beast. No amount of LHC activity will make that happen sooner.\n\nMartial Law? Conspiracies of this have cropped up under every president, especially democratic ones as they near the end of their second term. A friend commented to me on this:\n\nBeginning around June, 2015, rumors spread online that a comet was on its way to strike the earth between September 15-28th. These appeared on the usual conspiracy news outlets like BeforeItsNews.com and in amateur Youtube videos, but of course not NASA.com.\n\nThere are several good reasons why these comet rumors are nothing to fear.\n• NASA is not predicting any passing comets for September (although Siding Spring is approaching Mars in October) as they report on their site:\n\n NASA knows of no asteroid or comet currently on a collision course with Earth, so the probability of a major collision is quite small. In fact, as best as we can tell, no large object is likely to strike the Earth any time in the next several hundred years.\n• If this comet were bringing doomsday to earth, it would be in Bible prophecy. We can be certain of this because the Wormwood space object that is going to impact the earth (after fragmenting first, thankfully) is in Bible prophecy. Wormwood won't be a few mile-sized comet but must be something dwarf planet-sized. Wormwood is not coming for years.\n• Before Wormwood is close to threatening earth, God will warn us by sending the promised end time Elijah prophet who will also call us to safety (Mal 4:5=Joel 2:31). That means even if NASA for whatever reason does not warn us about Wormwood, God will be sure to do so. (If he did not, his few of saints would make it as Rev 12 predicts they will).\n\nFor these reasons, there is no reason to fear online predictions about comets for September 2015 or any other timeframe (unless a sign and miracle-working prophet is the one giving the warning online, as is covered below).\n\n...Back to making sense of this month-sized block of predictions. What should we conclude from it? Is it safe to say these predictions are always false and will always fail?\n\nOf course not. The rapture is in Bible prophecy and will definitely happen.\n\nSimilarly, the collapse of the global economy is not just a conspiracy theory fear. It's actually in Bible prophecy, too. When America is \"burned with fire\" (Rev 18:8) after God calls his faithful servants out (Rev 18:4), it says the international merchants made rich by trading with America go completely out of business. It says \"nobody\" buys their goods anymore (Rev 18:11); not \"Babylon no longer buys their goods anymore.\" They weep because of this abrupt and tragic end to their livelihood (and the end of civilization that follows financial Armageddon).\n\nWhat we should gather from these repeated tired old failed predictions is that there is something wrong with the rationale behind the predictions, or they would not keep coming and keep failing all the time. Right?\n\nSo what is being missed? How will a reliable prediction differ so we would know we should pay attention?\n\nThe Silly Reason Why Predictions Get Made...and Believed\n\nThe people who make these predictions and those who believe the prognosticators have the same misconception or fallacy in common. You're going to laugh when you hear it.\n\nThey both are forgetting a truism that should be evident to every person once they get out of childhood and have just a little life experience or have ever followed weather forecasts.\n\nHere it is: \"Humans cannot accurately predict what will happen about things outside their control.\"\n\nWhen I state that, it certainly sounds pretty dumb and self-evident. But think about it...\n\nWhen people believe someone who says they know when the world ends...or when the stock market will crash...or when LHC will blow up the world on a specific date...or when martial law will happen, well that requires they \"suspend disbelief\" in precognition or people seeing the future..and to begin to believe \"yes, they can see the future!\"\n\nThe ones making these predictions are guilty of the same suspension of disbelief in precognition. They think they see something everyone else is missing that makes the future seeable after all.\n\nThe Annoying Part To This - Snowballing\n\nNow we come to the annoying aspect for me that I mentioned earlier.\n\nWith the month of September 2015, we are seeing an additional step that (thankfully) does not always happen: snowballing. The last time I recall it happening was in 2012.\n\nYou may remember the 2012 Mayan Calendar prophecy. The idea that the Mayan calendar's ending in 2012 somehow signified they knew the world would end there. As with all of these, that theory included the same element of suspension of disbelief in what good common sense tells you about humans (apart from God) being able to accurately predict future events.\n\nSomehow we were expected to believe that the mysterious ancient pagan civilization of Maya could do what no other civilization (apart from ancient Israel) could do.\n\nThe next step was the snowballing. The 2012 calendar speculation gained attention. As it spread, it gave support and timing to other theories people had in mind either for 2012 or the end of the world. Thus, 2012 became the (next) date for Planet X to pummel the earth. It became the date for the rapture (of course). People saw there was a galactic divide which earth would cross in 2012, so that was lumped on as proof we knew 2012 would be bad. And so on.\n\nJust like that, 2012 snowballed into a modern version of \"88 reasons why Jesus will come back in 1988\" (yes, that was a real book). We basically had 112 reasons why 2012 would be bad.\n\nWhat's annoying about this to me is the flawed thinking that more bad arguments for why the impossible is possible (non-prophet humans seeing the future) is somehow better than or improves upon one argument. It's like saying \"112 times 0\" yields a different result than \"1 times 0.\" They both equal zero because no matter how many zeros you line up and add together, you still end up with nothing.\n\nA regular human's argument for having precognition about dates and events on a world scale is always a big zero. No matter how many arguments they have for their precognition, it's still claiming something humans cannot do that only God can.\n\nWe as Bible readers ought to know better when it comes to people claiming to be able to foretell the future (even if they are Christians). Jesus said quite plainly that \"no man knows\" when the day of his return will be. Why not? Because it has not been revealed by God yet let alone put in the Bible. Jesus said even he and the angels did not know this. If it was in the Bible they would read it and know!\n\nWe ought to know that unless the future is revealed by God, humans don't know exactly what will happen for sure on what date for events out of human control.\n\nThe way God reveals the future is through his servants the prophets (Amos 3:7). The authors of the prophecies of the Bible were prophets.\n\nNote that Amos does not say \"his servants the pastors,\" nor \"his servants the rabbis,\" nor \"his servants the Mayans\" nor \"his servants the prophecy novelists\" (Left Behind, The Harbinger, etc.), nor \"even his servants the conspiracy theorists on the internet.\"\n\nTherefore, let's stop listening to them and worrying about what they predict. They can tell a compelling and persuasive tale of why they think things will happen a certain way or at a certain timing, but they do not know what will happen. History shows listening to them is a waste of time. Only by reading (and understanding) the Bible written by prophets or by hearing modern prophets is knowing the future possible (which is what Revelation 1:1 promises to those who read it which is why I named my book Know the Future as it explains what the Bible reveals). And even then it does not give us exact timing for things. (It gives relative timing and sequence of events.)\n\n\"But So Many Things Are Lining Up!\"\n\nIn some people's minds, there is no prediction needed by anyone; just the fact that so many negative things are lining up in the news for one month is significant. As one person wrote me:\n\nWhat do I say to that?\n• None of those things are prophetic signs of the end from the Bible. Jesus gave one sign of the end when asked and it was unique and unprecedented; not a general worsening of conditions that one would have to subjectively judge.\n• In any given month you can always find multiple negative events to point to as proof of things lining up. September got picked this time because of the last blood moon and the supposed last day of the shemitah. (But even those things are wrong and not prophetic.) Last time it was December, 2012 because of the Mayan Calendar. Clearly, if signs are not prophetic but subjectively assigned significance by people, it does not matter if you find 100 or 1000. They still don't predict the end.\n• Every generation has thought they saw \"signs of the end\" in news events but nothing expected ever happens. We're still here. What might we learn from this history? Prediction/speculations based on cherry-picking negative events that paint a picture of the world getting worse will never tell you when the end is. It is not predictively reliable or useful. It's just scared people subjectively concluding \"I can't imagine things getting much worse than they have gotten without it being the end of the world.\"\n\nNow to answer the last part of what the person quoted above asked:\n\nNo, I'm Not Predicting Anything\n\nNote: Don't get me wrong; I'm not declaring or predicting \"nothing will happen in September, 2015\". That would be just as incorrect as the predictions I'm debunking. Also, kind of dumb as \"something\" happens all the time. Something will happen in September. You cannot predict nothing will happen. That's also why vague unspecific predictions with wide goalposts are worthless. Like a horoscope, they are bound to be at least partially correct.\n\nThe question is, will September be the end of the world or the military takeover of America, etc.? The odds are against it and the proofs given for such things are weak. Extraordinary claims require extraordinary proof.\n\nTherefore what I'm saying is this: there is no reason to fear bad things in September based on the common speculation of normal humans spread throughout the internet. A prophet of God is not behind these predictions.\n\nIf you want to save yourself time, money and needless worry, only pay attention to doomsday predictions that come from an established prophet of YHVH God.\n\nThat sounds simple enough, but unfortunately Christians are surrounded by many brothers who claim to be prophets yet they also fail the biblical test of a prophet. The result is that Christians accept false prophets as prophets because they don't know any better. It's like if all you have ever seen are counterfeit dollar bills so that you do not know what a genuine dollar bill should look and feel like.\n\nThankfully, with the help of the Bible we can learn how to discern a true prophet. My previous article will teach you how:", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["/depart-from-me-i-never-knew-you-meaning/", "http://escapeallthesethings.com/true-false-prophet/", "https://mistape.com", "https://escapeallthesethings.com/september-2015-prophecy/print/", "https://escapeallthesethings.com/september-2015-prophecy/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/planet-7x/", "https://escapeallthesethings.com/gay-marriage-america-judgment/"], "authors": [], "publish_date": null}