{"result_id": "109005", "URL": "https://escapeallthesethings.com/2021-prophecies/", "timestamp": "2023-04-25 15:03:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://escapeallthesethings.com/wp-content/uploads/2017/04/cropped-favicon-1.jpg", "canonical": "https://escapeallthesethings.com/2021-prophecies/", "encoding": "UTF-8"}, "image": null, "domain": "escapeallthesethings.com", "title": "Why Jesus Can’t Come Back in 2021—But 2020 Began The Last Decade – Escape All These Things (Luke 21:36)", "cleaned_text": "Can Jesus come back this year or are certain events missing before any end-time prophecies can occur including the rapture? Learn the comforting answer of Scripture from someone who has correctly helped others know what not to expect now 14 years straight! Also, find out how COVID-19 confirms the end is near and three questions to tell if you are saved according to Jesus.\n\nIt happens early every January: a spike in visitors to my website. At the prospect of a new year, \"many go to and fro\" (i.e., searching \"to increase knowledge\") on the Internet (Dan 12:4) looking for predictions. With all the prophecies in the Bible, Christians wonder if some of them are about to be fulfilled. The perennial favorites among them are the Second Coming of Christ and the Rapture.\n\nA large percentage of Christians continue to think every year that \"this could be the year that Christ returns...\" or \"...that the Rapture happens.\" That's not just my opinion as someone who has run a prophecy website since 1999. An Ipsos poll asking how likely certain events were to happen in the coming year confirmed this. According to the poll, here's what percentage of different subgroups of Christians thought it was at least \"somewhat likely that Jesus Christ would return to earth in the next year.\"\n\nWhy the Poll Results Blindsided Me\n\nWhen I heard the results of that poll back in December 2006, I was surprised. I had not been expecting so many Christians to think it was still possible for Jesus to come in the next twelve months. Here are two reasons why it blindsided me back then fourteen years ago:\n• Even before 2006, there have been many years of failed expectations for Christ's coming (\"Y2K\"/2000 being the biggest one up till then). Pretty much every year since Christ left, people have been hoping or predicting he would return with no show. Why would anyone expect it imminently anymore after so many failed hopes?\n• Back in 2006, I assumed that more Christians were aware of some basics of prophecy as I had known since my teens. For example, Paul wrote that Jesus cannot return to gather us to him until the \"man of sin\" (Antichrist) takes over \"first\" (2Th 2:2-4). Certainly, I thought, most Christians know that this \"Great Tribulation\" of the Antichrist they heard of must arrive before the Second Coming? Not so...\n\nIn other words, I was a bit naive =). The poll helped to fix that by learning how blessed I was to be exposed to the history of rapture predictions and key NT verses about Christ's return. I had been in a bubble, in a way, as a person who has studied prophecy and helped those also interested in the topic away from the greater Christian audience who mostly never receive any teaching on prophecy. In fact, I would say most Christians have never even read Revelation because it frightens them. Finally, while I hear about every popular prophecy prediction each year from readers who ask my opinion on them, most Christians hear nothing of them except when they go up on billboards across America as Harold Camping did in 2011.\n\nMy Response to the Poll?\n\nAfter better understanding this Christian blind spot on end-time prophecy, I wrote an article to help. It was the first version of this article called \"Why Jesus Can't Come Back in 2007.\" The title was designed to get people to stop and pay attention. In it, I explained why it was impossible for Jesus to come back in 2007 based on what Bible prophecy literally says. I covered the many missing prophetic events that have to come before not just the Second Coming, but also the Rapture (see below for the list).\n\nMost readers thanked me for shedding needed light on this confusing subject, but some were miffed. For example:\n• \"Aren't you claiming to know the day or hour that Jesus said we can't?\"\n• \"How dare you claim to know such a thing, as if you're God?\"\n• \"You're a terrible person for saying this and dashing people's hopes.\" (People hate buzzkills!)\n\nI learned from all that, too, something that I notice most of my readers have not picked up on about their church peers yet: not everyone delights in the truth. Paul explained this in his warning about why people get deceived by the Antichrist in the end time:\n\nIn the past few years, I've become convinced that \"those who are perishing\" refers to not just non-Christians but also Christians, \"few\" of whom are saved according to Jesus' warning This happens because Satan deceives the whole world (Rev 12:9) including Christians (Mt 24:4-5), most of whom want to be left in their comforting reassurance of salvation rather than investigate Revelation's warning about deception (had they read it). If you burst someone's bubble, they may become very \"unchristian-like\" on you, just as Jesus warned about truth-telling (Mt 7:6).\n\nIf you have \"received a love for the truth\" that is above your desire for reassurance and acceptance (which truth-loving and -seeking will cost you), then read on to learn what most Christians are misunderstanding about end-time prophecy...\n\nMy Track Record of Proclaiming \"The end is not yet\" (Lk 21:9) and the Legal Requirements Behind That\n\nNothing prophetic happened in 2007 just as my article argued from Scripture. It was not much of a gamble to publish that claim. The numerous prerequisite events (listed below) could not have possibly been completed in such a short time. It was as safe as stating that the moon will not descend to earth. Just as it would take some major new force or event for the moon to descend, likewise Jesus is not descending here until certain unprecedented events happen. The requirements for both events were and are simply still not present.\n\nAs history consistently shows, the real gamble is stating when Jesus will come back or the year of the fulfillment of any other Biblical prophecy, for that matter—unless you have a prophetic revelation from God on that, like the Biblical prophets were known to receive. (When it's not speculation or Bible interpretation but the Word of God then it's not a gamble.)\n\nAfter that year passed, I updated this article and went on record again for the next year, 2008. I knew that Christians would again expect or predict the Second Coming for that year. I also knew that just as with 2007, the requirements were not present and it would not and did not happen. Every year since then I have updated this article to let people know that the requirements for Jesus to come back that year are simply not present:\n\nThat's fourteen years so far of going out on record that Jesus will not come back in the next year.\n\nWhy point this out? Am I just \"tooting my own horn?\" Wasn't I just lucky?\n\nNo. Really I point to my track record to help people who are looking for a different approach and answer in this area than is typical of prophecy researchers out there. The vast majority of prophecy experts either:\n• Make \"invented prophecy\" predictions that always fail (because they are invented, or read into one or more verses) whether they are specific or vague (\"something big will happen\")...\n• ...or claim we don't have enough information to know if Jesus is coming in the next year or not. These views keep the church in alternatively fear and anxiety or confusion and ignorance.\n\nIn contrast, I have consistently gone on record that popular predictions won't happen and I have shown how we can at least rule out Jesus' coming in certain years, especially in the short term. For people trying to find someone worth listening to on prophecy, a distinction like this is very helpful to note.\n\nThe Secret to My Good Track Record Helps You, Too\n\nWhat's my secret? And how can knowing it help you avoid being confused or troubled by the invented prophecy predictions made every year about the Second Coming and other prophecies?\n\nMy secret is recognizing the many major events listed in prophecy that must come before Jesus \"returns to earth.\"\n\nIf you recognize these prerequisite events in your own Bible, too, you will be far ahead of most prophecy researchers in terms of discernment. More importantly, you won't fall for their predictions anymore.\n\nWhy are these prerequisite events not common knowledge? Because most Christians are taught to believe in the \"pretrib rapture\" doctrine and the related doctrine of \"imminency.\" This imminency doctrine states that the \"pretrib rapture can come at any moment without any prerequisite event.\" Just as the pretrib rapture is false and unscriptural, so is the imminency teaching used to justify it.\n\nIt's false because there is no plain verse saying that \"Jesus can come back at any moment\" or \"without any prerequisite.\" Instead, this theory relies on verses saying other things that perhaps could be \"because the Second Coming is imminent.\" For example, Jesus said \"always be ready\" (Lk 12:40). Did he say that because he can come any second (again, not stated elsewhere in the Bible)...or because when you backslide you can become deceived with the \"strong delusion\" (2Th 2:11) and miss or misunderstand the signs of Jesus' coming (1Th 5:4-5) as the religious Jews did before (clearly taught throughout Jesus' parables)?\n\nIf \"imminency\" is not biblical, then how can it be so popular? Two reasons:\n• Few Christians are Bible experts able to discern whether a doctrine they hear from other Christians is really taught by the Bible or not.\n• Further, this doctrine is telling them exactly what they want to hear, so they are not looking to disprove it. As alluded to earlier, Christians naturally hope that Jesus will come back soon for many reasons. At the very least they are fed up with this evil world and look forward to him cleaning it up. The idea that \"Jesus can come at any moment\" or any year sounds wonderful and comforting. Remember, most Christians prefer comfort to inconvenient truth when push comes to shove.\n\nDespite supposed imminency, here we are nearly 2000 years after Jesus left without his return. Isn't it time to move on from the dubious doctrine of imminency (along with the pretrib rapture)?\n\nIf Jesus' coming was really \"imminent\" for every single one of over 1,990 years since he left in 30 AD, why has he not shown up?\n\nWhy Jesus has not come back yet is not commonly understood.\n\nIn simple terms, contrary to what most Christians believe and are taught, Jesus said that there are indeed prerequisites to his return and the start of his reign in the Millennium. Until these preliminary events happen, he said that the \"end is not yet/by and by\" (Mt 24:6; Lk 21:9) and he will not be appearing. He cannot come until the end does and the end is not here yet.\n\nWhere do I get all this? Straight from the Bible as read plainly at face value (John 10:35). It is hard to read it that way until you put any preconceptions (and emotionally-charged hopes) aside. Once you do, this literal approach unlocks a sequence of future events described in the key prophecies of Revelation, Daniel, and Jesus (in Mt 24). Put together properly, these prophecies draw a roadmap revealing what we are to expect to happen as God's servants (Rev 1:1).\n\nUnfortunately, it is not easy to do this. Many Bible prophecies are labeled difficult \"mysteries\" (Rev 10:7; 17:5, 7) or call for \"understanding\" and \"wisdom\" (Dan 12:10; Mt 24:15; Rev 13:18). As such, it is like putting together a large jigsaw puzzle—a puzzle where you have to scavenge for and identify the pieces first if you will. The pieces to this puzzle are not all conveniently in one place and in order but are scattered throughout several books of both the Old and New Testament.\n\nSimilar to working with a real jigsaw puzzle, if you have one piece out of place, it can stop you from completing the puzzle to see the picture that it was intended to reveal. The surer you are about that out-of-place piece being right, the more blocked you will be. For example, having the Rapture in the wrong place (before the Great Tribulation) in the sequence of events effectively blocks understanding of end-time prophecy.\n\nIf you get past those obstacles to assembling the end time prophecy puzzle pieces, the picture emerges that there is much more than just the Great Tribulation, Rapture, and Second Coming ahead (which is what sums up the eschatology of most Christians). There are more events ahead than Christians have imagined. Importantly, most of these unknown prophetic events precede the Second Coming. That means the Second Coming or the Rapture are not \"next\" or \"imminent.\"\n\n\n\nIn other words, if Jesus' return to earth is \"Event C,\" then it cannot come until \"Event B\" has already happened. Likewise, \"Event B\" will not be seen unless \"Event A\" has already been fulfilled. It's really that simple:\n\nNow, if hypothetical Event A has not happened, this means that the end has not even begun.\n\nBut does that mean we cannot have any clue at all as to when the end is or when the end is not? Thankfully, no.\n\nAlthough the exact timing of Jesus' Second Coming has been unknown to the general public just as Jesus said in Matthew 24:36 \"no man knows the day or hour\" (read: exact time), that does not mean that the general public will never know the exact time even after nearly two millennia have passed. Nor does it preclude a few with the wisdom of God from knowing the timing before the general public does! Jesus never said, \"no man WILL EVER know.\"\n\nEven before then, you can be sure that the end is \"not yet\" (Mt 24:6; Mk 13:7) without knowing absolutely when it will be yet. We can do this by working from the relatively few potential years of his return to rule out the many years when he cannot come. The potential years come from the many timing clues given in the end-time prophecies.\n\nThis is similar to how we can know what years are not leap years and which are. A leap year is almost always every fourth year, in the years divisible by four—but not divisible by 100 unless also divisible by 400. This means, for example, that 2096 and 2104 will be leap years but not 2100.\n\nWith similar use of rules-based logic, we can know what years Jesus cannot return ahead of time. As long as the end times and Revelation roadmap have not begun, this fact itself continually rules out the next several years from Jesus' appearing. This is because the missing prerequisite events on the roadmap take substantial time to play out, several years, in fact.\n\nThis describes exactly the situation we have been in ever since the New Testament was written, in a holding pattern waiting for the first end-time event. Unmistakably, therefore \"the end is not yet.\" (Note that other prophecies not related to the final seven years have been fulfilled, such as the resurgence of Israel in 1948 per Isaiah 11:10-12 and also the fulfillment of Paul's \"last days people\" prophecy here in the last decade)\n\nIf the Body of Christ had understood Jesus' words on the preconditions of his coming, they would not be pronouncing or expecting the Rapture or imminent return of Jesus every year, just the same as we would not pronounce a new US president every single year. Because few believers have understood these overlooked prerequisites, each generation has naturally maintained hope that perhaps they were already in the end times and that Jesus could come back at any moment. Yet this has been proven to be false hope.\n\nThen what typically happens is that we justify this belief through other misread prophecies. For example, some might see a world figure who seems to fit the Antichrist (like Emperor Nero) or a technological development that seems to fulfill the mark of the beast (like bar codes or bio-chips) and conclude that it is a sign that the time must be near or in their lifetime. That kind of reasoning has been used innumerable times and always resulted in disappointment. It is important to put aside these pseudo-signs and look only to the real milestones listed in the Bible if you want to correctly know when there really is something prophetic coming to worry about.\n\nGiven the fact that none of the prerequisite end-time events have transpired, it is safe to say that it is impossible for Jesus to come in 2021—or any year this decade of the 2020s!\n\nSo, what are these prerequisite events? Here are several examples from my book starting with the first event to come:\n• Psalm 83/Isaiah 17 War - Damascus Destroyed/Second Holocaust — Rather than the Rapture, the next event in prophecy is a swift nuclear war in the Middle East between Israel and many of her Arab/Islamic neighbors. You do not need a Bible to tell you this, as many secular sources fear one due to the tensions between Israel and the Arabs and Iran (not Arab, but Persian). The concern over Iran's uranium enrichment program has only added to this. The outcome of this war will be the destruction of Damascus (Isa 17:1) and several other major Arab cities and regions, along with enough devastation in Israel to classify it a second holocaust! Obviously, this event has still not happened because Damascus remains a city to this day (whether you consider it \"in ruins\" by your First World nation standards or not :-). If you are wondering when this will happen, God gave me dreams that lead me to conclude the year 2022.\n• The Sixth Seal/Wormwood — If you read Revelation 6:12-17 carefully you will see that it depicts the entire world panicking and running for cover in response to signs in the heavens and a tremendous global earthquake on earth that shakes every mountain and island out of place. It is obvious that a global cataclysm like this has not happened since the first century when this prophecy was written. This event is a \"sign of the end\" that Jesus told his followers to expect when they asked about his return (Mt 24:7-8=Lk 21:10-11=Joel 2:30-32=Rev 6:12-17). God's end-time escape instructions shared by Jesus, Joel, and Revelation would then become relevant for the faithful. (By the way, ignore anyone saying they have pictures of Wormwood since it is not here yet.)\n• Third Temple — Several passages describe a Third Temple on the Temple Mount with sacrifices going during the Great Tribulation (Rev 11:1-2; Mt 24:15; 2Th 2:3-4). The Antichrist is even going to sit in this end-time temple as part of his declaration of himself as God (2Th 2:4). Obviously, there is as yet still no temple or even a construction project underway for one, nor sacrifices yet. Speaking of the construction, some say that everything is already being prepared for this temple and it can go up fast, in less than a year. Even if that's true, under the current political situation they still could not break ground on the Temple Mount without the Arabs approval given their historic belligerence against any Jewish worship on the Temple Mount. The Arab control and power need to be broken first, and that is not going to happen without a war, probably the future Psalm 83 war as above.\n• The Abomination of Desolation — The Great Tribulation starts 30 days (as in the 1290 - 1260 days) after the Abomination of Desolation is \"stood\" up at the Temple Mount (Mk 13:14). The abomination refers to the Image of the Beast statue being erected for worship (Rev 13:14). At the same time, the Third Temple sacrifices are halted by the Antichrist. This is another unfulfilled prophecy as only the Antichrist can accomplish this and he is not here yet.\n• Great Tribulation — This is the most obvious and well-known end-time event. According to Daniel 9:27 = Matthew 24:21, Jesus must return after a period of \"Great Tribulation.\" During this Great Tribulation, the Antichrist will rule over the world for 42 months (Rev 13). He will force all the unsaved (Rev 13:8) to take a mark in their right hand or forehead during that time. Plainly, we are not in the Great Tribulation and no mark of the beast has been issued yet.\n• The Rapture — The Rapture comes after the Great Tribulation or post-trib, yet not to save anyone from any threat on earth as Christians suppose. The Rapture arrives right on time for the faithful to be \"rewarded\" (Rev 11:18) with glorified eternal bodies (1Co 15:52) so they can then rule for the entire 1000 year Millennium along with those in the first resurrection (Rev 20:4-5). (But you have to qualify for the Rapture by listening to what Jesus said to do.)\n• The Wrath of God/7 Bowls — The seven bowls of God's wrath immediately fall when the faithful leave temporarily to heaven (Rev 15:5-8) apparently for the marriage supper of the lamb (Rev 19:9), just as Jesus described in saying it would be just like as in the days of Noah and Lot when one is taken (the righteous) and one is left (the wicked).\n• The Second Coming — Finally, Jesus \"returns to earth\" on Yom Kippur/The Day of the LORD to fight the Battle of Armageddon (Rev 19:11-21). He brings back with him the raptured and resurrected saints from the marriage supper of the lamb (Rev 19:9) in Heaven (Rev 15:5-8). Then they/we reign for the Millennium on earth—not in heaven.\n\nThese are only some of the events from the full end time roadmap as covered in my comprehensive book:\n\nNevertheless, the above list does include the \"Event A\" from my earlier explanation: the Psalm 83 War. Until we see that event, the end time roadmap/final seven years has not begun. This has meant in the past that we could still have years or even a decade (or two?) before the end times events start and finish with Jesus' return. Since the events of 2020, I feel we are definitely under a decade now until Jesus' return. For sure, as long as the Damascus war and destruction are unfulfilled, we have a good minimum of seven years before Jesus can come back, which is the length of the 70th Week of Daniel time frame in which all but one of the events above must take place.\n\nThe Prophetic \"Sabbath Years\" Narrow It Down Even Further\n\nUsually, you can rule out Jesus' coming even more than seven years in advance.\n\nHow? Through the special insight that Jesus can only return in one out of every seven years: a Sabbath year. The Sabbath year commanded to ancient Israel not only gave them a blessing of a year of rest from planting their fields with the associated promise of bounty in the sixth year before that. It also was prophetic like all the Torah (Mt 5:17-18). That means it had an end-time meaning and fulfillment.\n\nThe fulfillment of the Sabbath year is that it pictures the Millennium peace and rest, the 1000-year period that begins with Jesus' return. Just as the ancient Israelites rested their fields and experienced God's blessing, provision, and peace in that year, so will the entire earth during the Millennium (and after).\n\nPutting this together, it means that the final seven years or 70th week of Daniel (Dan 9:27) are aligned on a Sabbath year cycle or a \"week of years\" (Dan 9:26). This cycle consists of six regular years followed by a special Sabbath year. Jesus returns in that final Sabbath year of the 70th Week, whenever that is. It's impossible for him to return during one of the six non-Sabbath years. This rules out six out of seven years on the calendar, right off the bat!\n\nFor example, here in 2021, we are in the Sabbath year cycle of 2017-2024. Because of the missing events listed above, it's impossible for this cycle to be the one Jesus returns in. That rules out the entire period from 2017-2024 and makes the next period the first possible after that (2024-2030). This means Jesus cannot return from 2021-2029.\n\n2030 is the next possible Sabbath year for Jesus' return.\n\nFor more on why the 70 Weeks are aligned on Sabbath year cycles, see my free study on that.\n\n2026 - Why I'm Convinced It's the Year the End Starts\n\nIf 2030 is the year Jesus returns, then the 70th week spans 2024-2030, ending in the fall 6 months before the Sabbath year completes in spring, 2031 because \"he cuts short the time\" (Mt 24:22). But that does not mean the bad stuff or \"beginning of sorrows\" starts in 2024. It actually would begin in 2026.\n\n2026 is not too far off which is why I'm sad to report that the closer we get to it, the more confirmation keeps falling into my lap about it, despite my not wanting it to be true. For example, I already have had several dreams and developments in my own life that led me to share publicly why I am convinced the end begins in 2026.\n\nThen in 2017, when Trump announced the decision to recognize Jerusalem as Israel's capital and move the US Embassy to Jerusalem, God gave me a dream. I never asked for confirmation about 2026 for obvious reasons, but it came anyway in a remarkable fashion: a dream in three separate interrupted sleep segments. That morning I released my article on how God had confirmed through the dream that Trump's provocative announcement was prophetic and leading to the nuclear Middle East war. It was very angering to the Muslims with immediate demonstrations and followed by calls to make a bigger Arab alliance against Israel. Many others have written me since then to say they also heard from God that Trump's announcement was a move towards end-time prophecy. But time will tell on that and whether I understood my dream properly (1Co 14:26, 29).\n\nFurther confirmation came in early 2019. If asked I would have told you that no end-time prophecy had been fulfilled so far until Damascus is gone. But I would have been wrong. I was overlooking Paul's \"last days people\" prophecy (2Ti 3:1-3) which I could never understand and ignored for 20 years. An inspiration struck me that finally demystified it and I wrote a major article explaining how a seductive recent technology has brought out the worst in people in all 19 ways Paul predicted!\n\nHow COVID-19 Confirms No More Delay\n\n2020's events are the greatest confirmation so far that the end is now due this decade. This is ironic because, as I've shared previously, I did not see this early downturn of civilization coming. There is no pandemic in Bible prophecy before the pestilence Jesus spoke of that is associated with Wormwood's global devastation (the earthquakes, famine, pestilence of Lk 21:11). Did it just happen naturally and by chance, now, as scientists conclude? Or was COVID-19 part of God's plan for humanity, just as Wormwood is? I see a pattern in this event that makes me conclude the latter.\n\nIn hindsight, something akin to 2020's lockdowns, restrictions, economic devastation, and isolation had to happen. The pandemic has provided what Jesus told this generation to pray for: \"gold refined in the fire\" of trials bad enough to bring us to the breaking point (Rev 3:18). This is Jesus' prescription for the illness of spiritual poverty, nakedness, and blindness that characterize \"Laodiceans\" like us who have lived rich, sensual, comfortable lives in the modern world. When Jesus said that it was hard for a rich man to enter the kingdom, this is why (Mt 19:23). We do not need God nor do we get sufficiently humbled and aligned with love when life is working for us pretty well as is.\n\nJesus 3 Tests of Whether You Are Saved\n\nI hate to break it to you, but if you live in the developed world, you qualify as rich by the standard of Jesus' day. What he said about the rich not entering the kingdom applies to you. Odds are that you are not yet saved or headed to the kingdom. You may believe in God and want to serve him but belief and intention are not enough according to Jesus' own words demanding we bear fruit of a radically changed life. Here are three requirements found in Jesus' words to determine whether you are saved:\n• Are you \"as humble as a child\" (Mt 18:3-4)?\n• Does your \"righteousness exceed that of the Scribes and Pharisees\" who were zealous for God, too (Mt 5:20)?\n• Is your life philosophy to love others for God (Mt 7:12=Mt 7:21) so you bear fruit and don't hear \"depart from me I never knew you\" (Mt 7:23)?\n\nIf not, don't feel ashamed to admit it. Christianity did not teach us or disciple us in these things like Jesus did with his followers. God is really the only teacher for making us ready for the kingdom. You need that gold refined in the fire to become the bride of Christ who God protects in the end. That is why COVID-19 happened now and why I'm so convinced it is confirmation that the end is about to begin. The bride is getting the \"makeover\" that she needs through this disruption to life as we are used to it.\n\nSince the beginning of the pandemic, I have witnessed this refining process in my life, my household, and the saints I fellowship with. I have heard testimonies from several readers about God also leading their lives into hard times that brought them closer to him than ever. Without COVID-19 or something like it, we would mostly be stuck poor, naked, and blind spiritually, lacking the faith and trust in God to be able to escape all these things. To see COVID-19 as necessary for us and part of God's loving plan for us makes acceptance of and submission to our new reality easier. The next step is to then ask God what he has for you to learn in this with the time we have left before the end begins.\n\nTo summarize, while I'm happy to say that the end can't come this year or even the next few years, sadly developments like COVID-19 have convinced me that the end is starting this decade, probably in 2026 :-(.\n\nCommon Objections To Hearing Jesus Can't Come Back\n\nTo state that Jesus is not coming this year (even without ruling out the rest of the decade, too) may sound plain wrong or at least arrogant to many. Most don't realize Jesus himself said \"the end is not yet\" and gave the conditions for discerning that ourselves (Mt 24:6; Lk 21:9). To help you see the truth of what Jesus plainly said about not expecting his return until \"the end\" conditions arrive, here are a few of the common objections I hear with my responses:\n\nObjection #1: \"The world is falling apart too fast to last as long as you say...\"\n\nPeople often point to the multiplying and worsening problems in the world as proof that \"the end is nigh\"...(for sure this time!). However, if you study history, every generation has been able to point to something getting worse as proof that they were the \"last generation\" yet here we are. Relative and subjective arguments like that don't compare to the absolute specific description Jesus gave of the end-time sign.\n\nObjection #2: \"Jesus comes as a thief in the night, by surprise, so you won't have any clue as to years...\"\n\nThere are verses implying that Jesus will come suddenly and unexpectedly like a \"thief in the night\" (1Th 5:2; 2Pe 3:10). However, if you check out the passages in their context you will find that this thief-like surprise applies to the world and not to the \"sons of light and sons of the day\" (1Th 5:4)! God's children have \"a more sure word of prophecy\" about the circumstances of the coming of Jesus, a few of which this article has shared above. If Christians keep them in mind, they will not find that Jesus' coming surprises them like the world (1Th 5:4).\n\nObjection #3: \"You're claiming to know the day or hour!\"\n\nSome always argue that my proclamation about 2021 contradicts \"no man knows the day or the hour\" (Mt 24:36). This seems valid at first until you understand what was covered already above about Jesus' statement not meaning we were forever prohibited from knowing. The public will know when the end is close, once it is. Also, a prohibition on knowing when something will happen does not mean you don't have enough clues to know certain times when it cannot possibly happen.\n\nFor example, say a friend tells you he will drop by on one of his days off to catch up, but he does not tell you which one. You don't know the \"day or hour\" (which means \"time\") of his coming. Yet say you know his day off from work is Saturday. Would you sit there on Sunday or Monday hoping or believing he might just come \"today?\" Or would you know he can't be coming that day for a major visit like he promised? The answer is obvious.\n\nIt is the same with Jesus' Second Coming. Although the absolute timing of his coming is not publicly known, we still can know many years when he cannot come according to his own words. Jesus' coming has conditions and circumstances to it that mean he cannot come just any random time even if we don't know the-one-and-only-time he will come.\n\nObjection #4: \"You're effectively telling Christians to relax and not be ready for the return. (Shame on you!)\"\n\nOthers complain that to say \"Jesus is not coming this year\" translates to saying people don't have to be alert, pray and stay close to God (Lk 21:36). However, knowing Jesus cannot come back soon does not change anything about needing to \"always be ready\" and not backslide into sin.\n\nAlso, we all are still mortal. We can lose our life tomorrow through \"time and chance\" that the Bible says happens to us all (Ecc 9:11-12). Because we can \"meet our maker\" at any moment, we \"always need to be ready\" as Jesus taught (Mt 24:44; Lk 12:40).\n\nUltimately, let's not forget that Jesus himself is the origin of this message that \"the end is not yet\"; or \"the end is not by and by\" (Mk 13:7; Lk 21:9) until certain (unmistakable) global conditions appear. Jesus did not teach \"imminency\" or to expect his coming any and every day. Instead, He encouraged constant prayer and vigilance to not allow yourself to backslide because you don't know when you will die or when he will come (Lk 12:45).\n\nSo, rather than this end-time wisdom having disadvantages or a curse, there is a clear advantage to it compared to the popular \"the end is nigh\" thinking which focuses people on something that is not going to happen yet. The continual \"invented prophecy\" predictions about the end coming around every corner every year keep many people in fear. That needless anxiety (Php 4:6; Mt 6:25) can lead people to live under costly short-term thinking and make very poor decisions for themselves and their families. I've seen many sad cases of this (including my own experience for a time when I still had not discovered what this article shares). It truly is better to know the truth and act off of that—prayerfully and righteously—rather than act off a misunderstanding that opens you up to constant false alarms or paranoia or influences you to make bad choices or live in dread.\n\nThe popular hope and expectation that Jesus is coming \"this year\" persists among Christians despite a \"no show\" every year so far. Not surprisingly, it turns out that this belief is based more on fantasy than fact. The doctrine that \"the pretrib rapture is the next event in prophecy\" is mainly to blame for this. That the Second Coming can happen imminently or without lead-up events breaks Scripture (John 10:35) and is to be rejected by Bereans who test religious doctrine against God's revelation (Acts 17:11).\n\nScripture teaches that there are prerequisites or events that must come first. If we put aside popular Christian speculation and prophecy invention and consult the Bible's prophetic roadmap directly, we can know that Jesus certainly cannot return in 2021. Even more, he won't return for several years after that for sure because of Sabbath year cycles.\n\nI agree that it is disappointing to hear that Jesus is not coming in 2021 or any time soon after that. The good part of this is that by the same principle, many bad things like Wormwood and the Great Tribulation are also certain to not come next year either! It means you can stop worrying about the end coming suddenly and unexpectedly as long as the situation of the past 2000 years of no prerequisite events continues.\n\nYou can focus instead on making sure you are saved by getting right with God through Biblical repentance. My best writing for preparing yourself teaches how to not lose your faith when bad things happen (including when everyone knows God caused them!).\n\nIf you are interested in learning all the things you do not have to worry about in 2021 without it taking years of personal study and/or in supporting this ministry and \"help get the word out,\" check out the book Know the Future offered on this site. Orders directly support my writing of free articles.\n\nIf you want help on seeking the narrow path Jesus spoke about as the only one \"leading to life\" that \"few find,\" my supporter content will help you greatly.\n\nIf you want to understand why I finally wrote an article to answer the question that people always email me on \"When do you think the end is?\" see my in-depth study on 2026 in prophecy.", "opengraph": {}, "tags": ["the Woman (2)", "144000 (2)", "conspiracy theories (3)", "conspiracy theory (2)", "beginning of birth pains (2)", "place prepared (2)", "Elijah (4)", "Great Tribulation (4)", "gospel of the kingdom (3)", "beheading (2)", "Babylon the Great (3)", "Damascus (4)", "animal sacrifices (2)", "covid-19 (4)", "repentance (3)", "salvation (4)", "middle east nuclear war (5)", "john hagee (2)", "flat earth (2)", "Judea (10)", "mark of the beast (3)", "this year in prophecy (2)", "end time fears (3)", "the two witnesses (2)", "666 (2)", "1260 days (2)", "Muslim Antichrist (2)", "israel (5)", "david wilkerson (2)", "Wormwood (8)", "Abomination of Desolation (2)", "depart from me (5)", "mark biltz (2)", "Mystery Babylon (3)", "place of safety (2)", "false prophet (2)", "Nibiru (2)", "strength to escape (6)", "wrath of God (2)", "good news of the kingdom (3)", "hell (2)", "prince charles (2)", "Sermon on the Mount (5)", "gog magog (2)", "third temple (2)"], "tweets": [], "movies": [], "links": ["https://escapeallthesethings.com/doomsday-date-setting/", "https://escapeallthesethings.com/antichrist-myths", "https://escapeallthesethings.com/salvation-missing-3rd-ingredient/", "https://escapeallthesethings.com/doomsday-date-setting", "https://escapeallthesethings.com/doomsday-date-setting", "https://escapeallthesethings.com/something-is-about-to-change/", "/depart-from-me-i-never-knew-you-meaning/", "https://escapeallthesethings.com/rapture-secrets/", "https://escapeallthesethings.com/parable-of-the-fig-tree", "https://escapeallthesethings.com/rapture-secrets/", "https://escapeallthesethings.com/no-man-knows-the-day-or-hour", "https://escapeallthesethings.com/no-man-knows-the-day-or-hour", "https://escapeallthesethings.com/last-days-people-prophecy/", "https://escapeallthesethings.com/mark-of-the-beast", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "/next-in-prophecy", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/another-holocaust/", "https://escapeallthesethings.com/2022-dreams/", "https://escapeallthesethings.com/earthquakes-in-prophecy", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "/petra-bible-prophecy/", "https://escapeallthesethings.com/faith-to-escape-tribulation", "https://escapeallthesethings.com/wormwood-nasa/", "https://escapeallthesethings.com/third-temple-prophecy", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/1260-day-42-month-tribulation/", "https://escapeallthesethings.com/abomination-desolation", "https://escapeallthesethings.com/image-beast/", "https://escapeallthesethings.com/1260-day-42-month-tribulation/", "https://escapeallthesethings.com/mark-of-the-beast/", "https://escapeallthesethings.com/rapture-secrets/", "https://escapeallthesethings.com/the-millennium", "https://escapeallthesethings.com/3-resurrections", "https://escapeallthesethings.com/rapture-requirements/", "https://escapeallthesethings.com/7-bowls-wrath-ten-days/", "/days-noah-one-taken-left/", "https://escapeallthesethings.com/7-bowls-wrath-ten-days/", "https://escapeallthesethings.com/the-millennium", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://escapeallthesethings.com/the-millennium", "https://escapeallthesethings.com/great-tribulation-sabbath-year", "https://escapeallthesethings.com/2026-in-prophecy/", "https://escapeallthesethings.com/parallel-great-tribulation-dreams/", "https://escapeallthesethings.com/damascus-israel-isaiah-nuke", "https://escapeallthesethings.com/last-days-people-prophecy/", "https://escapeallthesethings.com/salvation-missing-3rd-ingredient/", "https://escapeallthesethings.com/salvation-missing-3rd-ingredient/", "https://escapeallthesethings.com/holy-spirit-activation/", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/mt-24-14-meaning", "https://escapeallthesethings.com/no-man-knows-the-day-or-hour", "https://escapeallthesethings.com/sign-of-jesus-coming-end-age", "https://escapeallthesethings.com/faith-to-escape-tribulation/", "https://escapeallthesethings.com/doomsday-date-setting", "https://escapeallthesethings.com/end-time-preparation", "https://escapeallthesethings.com/ninth-planet-prophecy", "https://escapeallthesethings.com/depart-from-me-i-never-knew-you-meaning", "https://escapeallthesethings.com/end-time-preparation-checklist/", "https://escapeallthesethings.com/the-bad-news/", "https://escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/support-team-options/#content", "https://escapeallthesethings.com/2026-in-prophecy/", "https://mistape.com", "https://escapeallthesethings.com/2021-prophecies/print/", "https://escapeallthesethings.com/2021-prophecies/print/", "https://escapeallthesethings.com/support-team-options/#content", "/support-team-options/#payments", "//escapeallthesethings.com/planet-x-nibiru-wormwood.htm", "//EscapeAllTheseThings.com/planet-x-nibiru-wormwood.htm", "#", "https://twitter.com/TimMcHyde", "https://facebook.com/timmchyde", "/planet-x-nibiru-wormwood.htm", "https://escapeallthesethings.com/us-embassy-jerusalem-in-prophecy/", "https://escapeallthesethings.com/america-vs-salvation/"], "authors": [], "publish_date": null}