{"result_id": "110008", "URL": "https://eugenics.news/2021-05-05-gates-foundation-darpa-funding-self-replicating-weaponized-vaccine-apartheid-exterminate-blacks.html", "timestamp": "2023-04-25 15:03:57 CEST+0200", "meta": {"description": "Bombshell story synopsis: Research on race-specific, self-replicating (self-spreading), weaponized vaccines was being conducted by doctors and scientists under the Apartheid regime in the 1990s, with the goal of causing self-spreading infertility and deaths among Blacks. This same research continues today, predominantly in the United States, funded by DARPA and the Gates Foundation. The technology, known […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,crimes against humanity,DARPA,depopulation,extermination,Gates Foundation,genocide,Medical Tyranny,Project Coast,self-replicating vaccines,self-spreading vaccines,Vaccine deaths,Vaccine injuries,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2021-05-05-gates-foundation-darpa-funding-self-replicating-weaponized-vaccine-apartheid-exterminate-blacks.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "BOMBSHELL: Gates Foundation, DARPA funding self-replicating, weaponized vaccine technology that began under Apartheid, to exterminate Blacks… and now it’s powering the covid vax", "cleaned_text": "BOMBSHELL: Gates Foundation, DARPA funding self-replicating, weaponized vaccine technology that began under Apartheid, to exterminate Blacks… and now it’s powering the covid vax\n\nBombshell story synopsis: Research on race-specific, self-replicating (self-spreading), weaponized vaccines was being conducted by doctors and scientists under the Apartheid regime in the 1990s, with the goal of causing self-spreading infertility and deaths among Blacks.\n• This same research continues today, predominantly in the United States, funded by DARPA and the Gates Foundation.\n• The technology, known as “self-replicating vaccines,” spreads through the population like a virus, causing the spread of infertility and death, all for the purpose of extermination and population reduction.\n• This same technology is now believed to be behind covid-19 vaccines, which are transmitting harmful spike proteins to the unvaccinated, causing widespread bleeding, bruising, blood clots and other harmful effects, even in the unvaccinated.\n• Proponents of self-replicating vaccine technology are self-avowed depopulation advocates who wish to exterminate most of the human beings living today.\n\nIn 2020, the Bulletin of the Atomic Scientists published a well-researched article documenting the history of self-spreading vaccines, warning about its implications for humanity. Such technology is prone to “unintended consequences” and cannot be undone, warns The Bulletin in this article entitled, “Scientists are working on vaccines that spread like a disease. What could possibly go wrong?”\n\nThat article documents the horrifying history of our self-replicating, race-specific weaponized “vaccines” were under development by the Apartheid regime to exterminate Blacks and keep the White racist regime in power.\n\nThe article is outstanding and is extensively quoted below. The authors are Filippa Lentzos and Guy Reeves, both Europeans, which explains why they are able to publish dangerous truths that no American journalist would dare utter, out of fear of retribution from the tyrannical medical science establishment that now controls nearly every institution in the United States.\n\nFor the record, these two authors are not asserting in their article that covid-19 vaccines are self-replicating vaccines. That’s a connection that we have only been able to make recently, after witnessing the explosion of bizarre symptoms emerging in unvaccinated people who are merely in close proximity to the vaccinated. Over the last two weeks, thousands of reports of this phenomenon have been received by the top whistleblowers and front line doctors who are sounding the alarm over the experimental “vaccine” injections being aggressively, coercively pushed in the United States, despite the complete lack of any credible evidence that shows such vaccines are safe and effective for widespread, long-term use in healthy, asymptomatic individuals.\n\nFrom the Bulletin article (selected passages, edited for length):\n\nA small, but growing number of scientists think it’s possible to exploit the self-propagating properties of viruses and use them to spread immunity instead of disease.\n\nFor at least 20 years, scientists have been experimenting with such self-spreading vaccines, work that continues to this day, and which has gained the attention of the US military.\n\nThe biologists Scott Nuismer and James Bull generated fresh media attention to self-spreading vaccines over the summer after publishing an article in the journal Nature Ecology & Evolution.\n\nOnce released, scientists will no longer be in control of the virus. It could mutate, as viruses naturally do. It may jump species. It will cross borders. There will be unexpected outcomes and unintended consequences. There always are.\n\nSelf-spreading vaccines are essentially genetically engineered viruses designed to move through populations in the same way as infectious diseases, but rather than causing disease, they confer protection. Built on the chassis of a benign virus, the vaccines have genetic material from a pathogen added to them that stimulates the creation of antibodies or white blood cells in “infected” hosts.\n\nThe idea, essentially, is to vaccinate a small proportion of a population through direct inoculation. These so-called founders will then passively spread the vaccine to other animals they encounter either by touch, sex, nursing, or breathing the same air. Gradually, these interactions could build up population-level immunity.\n\nThe principal security concern is that of dual-use. In essence, this means that the same research that is used to develop self-spreading vaccines to prevent disease, could also be used to deliberately cause harm. You could, for instance, engineer triggers into a virus that cause immune system failures in infected people or animals, a bit like HIV does naturally. Or you could create triggers in a virus that cause a harmful autoimmune response, where the body starts attacking its own healthy cells and tissues.\n\nThe bioweapon question. While researchers may intend to make self-spreading vaccines, others could repurpose their science and develop biological weapons. Such a self-spreading weapon may prove uncontrollable and irreversible.\n\nCodenamed Project Coast, South Africa’s program was primarily focused on covert assassination weapons for use against individuals deemed a threat to the racist apartheid government.\n\nOne of Project Coast’s research projects aimed at developing a human anti-fertility vaccine.\n\nThe idea took hold during a time of widespread concern over worldwide population explosion. Schalk Van Rensburg, who oversaw fertility-related work at a Project Coast laboratory, told South Africa’s post-apartheid Truth and Reconciliation Commission…\n\nVan Rensburg and Daniel Goosen, a lab director, told the Truth and Reconciliation Commission that the real intention behind the project was to selectively administer the contraceptive in secret to unwitting Black South African women.\n\nIt doesn’t take a massive leap of the imagination to see how the aims of South Africa’s anti-fertility vaccine project would have benefited from research into self-spreading vaccines, particularly if you combine it with current developments in pharmacogenomics, drug development, and personalized medicine. Taken together, these strands of research could help enable ultra-targeted biological warfare.\n\nSelf-spreading vaccine research is a small but growing field. At the moment, about 10 institutions are doing significant work in the area. These laboratories are primarily located in the United States, but some are in Europe and Australia, as well. As the field expands, so does the potential for abuse.\n\nSo far research has primarily been bankrolled by US government science and health funders like the National Science Foundation, the National Institutes of Health, and the Department of Health and Human Services. Private organizations like the Gates Foundation and academic institutions have also financed projects. Recently, the Defense Advanced Research Projects Agency (DARPA), sometimes thought of as the US military’s research and development wing, has gotten involved in the research. The University of California, Davis, for example, is working on a DARPA administered project called Prediction of Spillover Potential and Interventional En Masse Animal Vaccination to Prevent Emerging Pathogen Threats in Current and Future Zones of US Military Operation. According to a pamphlet, the project is “creating the world’s first prototype of a self-disseminating vaccine designed to induce a high level of herd immunity (wildlife population level protection) against Lassa virus … and Ebola.”\n\nLearn the shocking truth about how covid-19 vaccines are deliberately designed as biological weapons to exterminate human populations… and why they’re being pushed so aggressively before the death wave becomes undeniable\n\nI cover this bombshell breaking story in three podcasts below: A short, medium and long version of this information.\n\nHere’s the shortest version, a 10-minute summary and introduction to Project Coast and the weaponization of self-replicating vaccines:\n\nHere’s a medium-length, 26-minute version, which provides more details from The Bulletin article, and explains why world governments are so desperate to silence all whistleblowers who have come to realize how covid-19 vaccines are a global extermination weapon system:\n\nAnd here’s the full-length Situation Update podcast, which contains the medium-length version above, plus other news about vaccines and censorship:\n\nIn the 1990s, they were trying to exterminate Blacks to keep Apartheid in power. Today, they’re using the same technology to exterminate the masses of humanity in order to prevent a global populist uprising and keep the globalist criminal cartel in power.\n\nEvery covid-19 vaccine injection is a war crimes violation. These war crimes are taking place at your neighborhood pharmacy right now. Right under your nose. And nobody is doing a damn thing to stop it.\n\nFind more coverage each day — with another massive bombshell coming tomorrow — at Brighteon.com:", "opengraph": {"title": "BOMBSHELL: Gates Foundation, DARPA funding self-replicating, weaponized vaccine technology that began under Apartheid, to exterminate Blacks… and now it’s powering the covid vax", "type": "article", "url": "https://www.eugenics.news/2021-05-05-gates-foundation-darpa-funding-self-replicating-weaponized-vaccine-apartheid-exterminate-blacks.html", "site_name": "Eugenics News", "description": "Bombshell story synopsis: Research on race-specific, self-replicating (self-spreading), weaponized vaccines was being conducted by doctors and scientists under the Apartheid regime in the 1990s, with the goal of causing self-spreading infertility and deaths among Blacks. This same research continues today, predominantly in the United States, funded by DARPA and the Gates Foundation. The technology, known […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2021/05/HRR-2021-05-05-Project-Coast-proves-existence-of-self-replicating-vaccine.jpg"}, "tags": ["crimes against humanity", "extermination", "self-spreading vaccines", "vaccine wars", "Vaccine deaths", "Gates Foundation", "genocide", "Project Coast", "depopulation", "Medical Tyranny", "self-replicating vaccines", "Vaccine injuries", "vaccines", "DARPA"], "tweets": [], "movies": [], "links": ["https://thebulletin.org/2020/09/scientists-are-working-on-vaccines-that-spread-like-a-disease-what-could-possibly-go-wrong/", "http://Brighteon.com/1a0b71ff-da6e-4111-9e35-df8d914fdbbc", "http://Brighteon.com/fa7bb3f6-a548-4d0e-9ce8-5087f04252de", "http://Brighteon.com/9c4989d2-2e8e-4c27-93c9-44d34edbe6df", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}