{"result_id": "110029", "URL": "https://www.eugenics.news/2022-12-09-gates-donates-7-billion-to-promote-abortion.html", "timestamp": "2023-04-25 15:04:14 CEST+0200", "meta": {"description": "Big Tech mogul Bill Gates, co-chair of the Bill & Melinda Gates Foundation, has vowed to spend more than $7 billion in the next four years to develop and implement innovative approaches to control the population and promote abortion. “Constantly reducing maternal mortality, constantly reducing neonatal mortality, under-five mortality, that’s really the metric that drives our […]", "lang": "en", "keywords": "abortion,Africa,big government,Bill &Melinda Gates Foundation,bill gates,black babies,conspiracy,deception,depopulation,eugenics,Geneva Consensus Declaration,genocide,globalists,infant's health,infanticide,Planned Parenthood,population control,propaganda,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.eugenics.news/2022-12-09-gates-donates-7-billion-to-promote-abortion.html", "encoding": "UTF-8"}, "image": null, "domain": "www.eugenics.news", "title": "Bill Gates pledges $7 billion to control population and promote abortion in Africa", "cleaned_text": "Bill Gates pledges $7 billion to control population and promote abortion in Africa\n\nBig Tech mogul Bill Gates, co-chair of the Bill & Melinda Gates Foundation, has vowed to spend more than $7 billion in the next four years to develop and implement innovative approaches to control the population and promote abortion.\n\n“Constantly reducing maternal mortality, constantly reducing neonatal mortality, under-five mortality, that’s really the metric that drives our foundation,” Gates said on November 17 while speaking with University of Nairobi students on his first trip to Africa since the Wuhan coronavirus (COVID-19) pandemic began.\n\nAccording to the foundation’s website, this new commitment to support African countries is on top of existing Gates Foundation funding to multilateral organizations, including Gavi, the Vaccine Alliance and the Global Fund to Fight AIDS, tuberculosis and malaria.\n\n“The big global challenges we face are persistent. But we have to remember, so are the people solving them,” Gates emphasized. Our foundation will continue to support solutions in health, agriculture and other critical areas and the systems to get them out of the labs and to the people who need them.”\n\nHowever, critics believe that these “charitable works” are tied to ideological agendas – especially since the billionaire’s foundation has been associated with the promotion of abortion, which stands in sharp contrast to the predominantly pro-life culture of many African countries. (Related: Melinda Gates makes a $375 MILLION donation to the abortion industry to accelerate DEPOPULATION of blacks.)\n\nCoalition of pro-life nations commemorate second anniversary of Geneva Consensus Declaration\n\nOn the same day of Gates’ visit to Kenya, a coalition of governments promoting women’s health policy convened at the U.S. Capitol to commemorate the second anniversary of the Geneva Consensus Declaration, an anti-abortion declaration cosponsored by the governments of Brazil, Egypt, Hungary, Indonesia, Uganda and the United States.\n\nThe 36 countries across five continents that signed the declaration are bound by the belief that women’s health should not be held hostage by ideological agendas and supports both women and unborn children in the pursuit of actual health care. The U.S. was a founding member of the coalition, but its membership was withdrawn by President Joe Biden immediately upon taking office.\n\nThe ambassador of Hungary to the U.S. Szabolcs Takács said during the occasion that the Hungarian government holds firm to the view that “every human being should have the right to life … and fetal life shall be subject to protection from the moment of conception.”\n\nAmbassador Alfonso Quiñonez of Guatemala agreed. “Life starts at conception. For us there is no question,” he said. Quiñonez also relayed the message of Guatemalan President Alejandro Giammattei, that their country “will continue to fight for life in all stages from conception to natural death.”\n\nThe ambassador cited recent efforts of Guatemala to combat abortion activism at the United Nations as a testament to their pro-life commitment.\n\nMeanwhile, an opinion piece published by LifeNews stated: “Big donors such as the Gates Foundation and the U.S. government should take heed of the Geneva Consensus. Governments at the receiving end of their ‘help’ can speak for themselves, and together, they are speaking loud and clear that every person is born with inherent dignity and the right to life, and real women’s health gains should never be held hostage by the abortion agenda.”\n\nFollow Genocide.news for more stories related to the globalists’ moves to push depopulation.\n\nWatch Bill Gates admit his involvement in depopulation programs in the video below.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nBill Gates funded the creation of a “vaccine passport” tracking system long before the coronavirus pandemic.\n\nThe Bill Gates globalist vaccine depopulation agenda… as revealed by Robert F. Kennedy, Jr.\n\nThe Bill Gates depopulation plan is succeeding at culling human populations: Fertility rates plummeting around the world.", "opengraph": {"title": "Bill Gates pledges $7 billion to control population and promote abortion in Africa", "type": "article", "url": "https://www.eugenics.news/2022-12-09-gates-donates-7-billion-to-promote-abortion.html", "site_name": "Eugenics News", "description": "Big Tech mogul Bill Gates, co-chair of the Bill & Melinda Gates Foundation, has vowed to spend more than $7 billion in the next four years to develop and implement innovative approaches to control the population and promote abortion. “Constantly reducing maternal mortality, constantly reducing neonatal mortality, under-five mortality, that’s really the metric that drives our […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/12/Editorial-Use-Bill-Gates-2.jpg"}, "tags": ["Planned Parenthood", "conspiracy", "big government", "infanticide", "Africa", "deception", "Geneva Consensus Declaration", "women's health", "globalists", "infant's health", "propaganda", "bill gates", "Bill &Melinda Gates Foundation", "depopulation", "abortion", "population control", "black babies", "eugenics", "genocide"], "tweets": [], "movies": [], "links": ["https://newspunch.com/african-holocaust-bill-gates-spending-7-billion-to-murder-black-babies/", "https://www.uonbi.ac.ke/", "https://www.gatesfoundation.org/ideas/media-center/press-releases/2022/11/gates-foundation-commits-7-billion-to-african-countries", "https://naturalnews.com/2017-07-29-melinda-gates-doubles-down-on-population-control-depopulation-blacks.html", "https://adfinternational.org/37-governments-recommit-to-pro-life-womens-health-policy/", "https://www.lifenews.com/2022/12/06/bill-gates-sends-7-billion-to-africa-that-will-promote-abortion-as-population-control/", "https://genocide.news/", "https://www.brighteon.com/59c1242a-6314-4c70-8133-bc3e87b9bb79", "https://www.brighteon.com/channels/infowarsnetwork", "https://naturalnews.com/2021-07-21-gates-funded-vaccine-passport-before-covid-pandemic.html", "https://depopulation.news/2021-02-14-germany-ratifies-agenda-id2020-bill-gates-vaccination.html", "https://pandemic.news/2020-04-13-bill-gates-globalist-vaccine-depopulation-agenda-revealed.html", "https://genocide.news/2020-07-31-bill-gates-depopulation-plan-coming-along-fertility-rates-plummeting.html", "https://newspunch.com/african-holocaust-bill-gates-spending-7-billion-to-murder-black-babies/", "https://www.gatesfoundation.org/ideas/media-center/press-releases/2022/11/gates-foundation-commits-7-billion-to-african-countries", "https://adfinternational.org/37-governments-recommit-to-pro-life-womens-health-policy/", "https://www.lifenews.com/2022/12/06/bill-gates-sends-7-billion-to-africa-that-will-promote-abortion-as-population-control/", "https://www.brighteon.com/59c1242a-6314-4c70-8133-bc3e87b9bb79", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-12-09-gates-donates-7-billion-to-promote-abortion.html&linkname=Bill%20Gates%20pledges%20%247%20billion%20to%20control%20population%20and%20promote%20abortion%20in%20Africa", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}