{"result_id": "110005", "URL": "https://eugenics.news/2022-03-18-nazi-policies-covid-policies-similar-holocaust-survivor.html", "timestamp": "2023-04-25 15:03:55 CEST+0200", "meta": {"description": "A survivor of the Holocaust campaign said government policies against those not injected with the Wuhan coronavirus (COVID-19) vaccine share similarities with Nazi Germany’s policies against the Jews. Alliance for Human Research Protection (AHRP) President Vera Sharav noted this comparison in a March 9 interview with Rebel News. She told the media outlet’s Drea Humphrey that both […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid-19,discrimination,eugenics,health freedom,Holocaust,medical fascism,medical martial law,Medical Tyranny,Nazi Germany,pandemic,propaganda,unvaccinated,vaccine passports,vaccine wars,vaccines,Vera Sharav,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-03-18-nazi-policies-covid-policies-similar-holocaust-survivor.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Holocaust survivor: Nazi-era policies and COVID policies share many similarities", "cleaned_text": "A survivor of the Holocaust campaign said government policies against those not injected with the Wuhan coronavirus (COVID-19) vaccine share similarities with Nazi Germany’s policies against the Jews.\n\nAlliance for Human Research Protection (AHRP) President Vera Sharav noted this comparison in a March 9 interview with Rebel News. She told the media outlet’s Drea Humphrey that both the Nazis of the 1930s and the governments of today dehumanized people refusing to get injected with the COVID-19 shot.\n\nShe explained: “The Nazis used the fearmongering [tactic] of Jews [being the] spreaders of infectious diseases. That’s exactly the accusation against the unvaccinated – they’re spreaders of the virus, which they are not.”\n\nHumphrey cited research stating that the Nazis utilized the deaths from the 1918 Spanish flu pandemic to gain political power. In line with this, they used propaganda to convince the German population that Jews and other “undesirables” were responsible for spreading threats to public health such as typhus and lice.\n\nIn the same vein, governments worldwide used the COVID-19 pandemic to solidify their control on their respective populations. They also dehumanized unvaccinated individuals in their countries, with some even declaring a “pandemic of the unvaccinated.” However, data revealed that the fully vaccinated comprise a larger number of COVID-19 infections, hospitalizations and deaths.\n\nBack when she was still a child, the AHRP president and her family were sent to a Nazi concentration camp in Ukraine from their home in Romania. Her father died of an infectious disease while interned in the camp. In 1944, Sharav’s mother managed to ransom her through an orphan organization, where she was sent back to her homeland.\n\nAccording to Sharav, having been “disobedient” at one point during that time – by refusing to follow “government dictates” – saved her life and served as a “big lesson” for her. She also recommended that those “looking into history and recognizing parallels to the current [time]” continue to do so.\n\n“I wish that most people would stop obeying. Because by obeying, you are allowing the dictators to flourish. They couldn’t do it without obedience,” said the AHRP president.\n\nVaccine passports are the modern version of Nazi-era identity papers\n\nSharav also pointed out the role of vaccine passports in segregating the unvaccinated from the rest of society. People were required to show identity papers during the Nazi regime and World War II, similar to how people are required to show proof of vaccination in the current period.\n\nThis requirement allowed the Nazis to set aside and demonize a whole segment of the population. “[The vaccine passport decides] who may go to the public square, who is allowed to go into a restaurant, etc.” (Related: Nearly HALF of all Democrats favor rounding up unvaccinated people and forcing them into concentration camps… the LEFT have become vaccine Nazi extremists.)\n\nThe Holocaust survivor added that such measures were implemented in an insidious manner. “The Holocaust happened in stages; it didn’t happen overnight,” she said.\n\nSharav also stressed the role of the medical establishment in allowing laws that infringe on health freedom and eventually lead to genocides. “The medical establishment, during the [rule of] the Nazis and now, is the pivotal enabler. Without the medical establishment, neither regimes would have been able to get away with it. The medical establishment provides the veneer of legitimacy [for] genocides,” she explained.\n\nThe AHRP president ultimately pointed her finger at eugenics as the underlying ideology behind the Holocaust and the ongoing COVID-19 medical tyranny, describing it as “the devaluing of some human beings.”\n\nAccording to Sharav, the draconian COVID-19 mandates “that essentially resulted in deaths” were issued for both financial reasons and eugenics. She added that this eugenics-based ideology, which the societal elites espouse and serves as a bedrock of the tyrannical mandates, has “never been repudiated.”\n\nFind more stories like this at MedicalTyranny.com.\n\nWatch Vera Sharav calling on parents to “be the rescuers of their own children” from the dangers of medical tyranny.\n\nThis video is from the Qual2828 channel on Brighteon.com.\n\n“Sounds like Nazi Germany”: Video shows McDonald’s kiosk in Israel denying service to customers without a COVID vaccine card.\n\nHighly disturbing child indoctrination video from Canada shows brainwashed vaccine Nazis calling for the arrest of innocent people.\n\n‘Right out of the Nazi playbook’: Chabad Rabbi defends Marjorie Greene’s comparison of vaccine mandates to yellow stars in Germany.\n\nDon’t bother vacationing in Hawaii: Honolulu goes full “vaccine Nazi” and will deny you entry into restaurants, museums and movie theaters.", "opengraph": {"title": "Holocaust survivor: Nazi-era policies and COVID policies share many similarities", "type": "article", "url": "https://www.eugenics.news/2022-03-18-nazi-policies-covid-policies-similar-holocaust-survivor.html", "site_name": "Eugenics News", "description": "A survivor of the Holocaust campaign said government policies against those not injected with the Wuhan coronavirus (COVID-19) vaccine share similarities with Nazi Germany’s policies against the Jews. Alliance for Human Research Protection (AHRP) President Vera Sharav noted this comparison in a March 9 interview with Rebel News. She told the media outlet’s Drea Humphrey that both […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/03/auschwitz-holocaust-jews-nazis.jpg"}, "tags": ["pandemic", "vaccine passports", "big government", "covid-19", "medical fascism", "vaccine wars", "propaganda", "Nazi Germany", "eugenics", "Vera Sharav", "Medical Tyranny", "vaccines", "unvaccinated", "Wuhan coronavirus", "health freedom", "discrimination", "Holocaust", "medical martial law"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/holocaust-survivor-draws-parallel-between-covid-tyranny-and-nazi-policies/", "http://biggovernment.news", "https://www.rebelnews.com/holocaust_survivor_vera_sharav_warns_about_history_repeating_itself_in_north_america", "https://naturalnews.com/2022-01-19-democrats-favor-rounding-up-unvaccinated-people-forcing-them-into-concentration-camps.html", "http://MedicalTyranny.com", "https://www.brighteon.com/991d80dc-d714-454c-8d91-d44cc9e88f56", "https://www.brighteon.com/channels/odracir", "https://medicalfascism.news/2022-01-11-video-shows-mcdonalds-kiosk-israel-denying-service-without-covid-vaccine-card.html", "https://brainwashed.news/2022-01-20-disturbing-child-indoctrination-video-canada-vaccine-nazis.html", "https://vaccines.news/2021-06-13-chabad-rabbi-defends-marjorie-greene.html", "https://pandemic.news/2021-09-03-hawaii-honolulu-vaccine-nazi-deny-entry-passports.html", "https://www.lifesitenews.com/news/holocaust-survivor-draws-parallel-between-covid-tyranny-and-nazi-policies/", "https://www.rebelnews.com/holocaust_survivor_vera_sharav_warns_about_history_repeating_itself_in_north_america", "https://www.brighteon.com/991d80dc-d714-454c-8d91-d44cc9e88f56", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-03-18-nazi-policies-covid-policies-similar-holocaust-survivor.html&linkname=Holocaust%20survivor%3A%20Nazi-era%20policies%20and%20COVID%20policies%20share%20many%20similarities", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}