{"result_id": "110025", "URL": "https://eugenics.news/2022-11-22-big-pharma-blames-covid-russian-invasion-of-ukraine-massive-cancer-epidemic.html", "timestamp": "2023-04-25 15:04:11 CEST+0200", "meta": {"description": "Supposedly, because of the pandemic, people all over the world were developing cancer and refusing to go to the hospitals to be diagnosed, for fear they would catch Fauci Flu. According to the pharma industrial complex, this went on for two years, and an estimated one million cancer cases were missed and over 100 million […]", "lang": "en", "keywords": "ADE,badhealth,badmedicine,badscience,cancer,cancer causes,cancer epidemic,Dangerous Medicine,depopulation,fauci flu,immune deficiency,immune systems,pandemic,Russian invasion,spike proteins,toxins,Vaccine deaths,vaccine injury,vaccines,wuhan virus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-11-22-big-pharma-blames-covid-russian-invasion-of-ukraine-massive-cancer-epidemic.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Big Pharma blames Covid and the Russian invasion of Ukraine, instead of toxic spike protein injections, for exploding cancer epidemic in Europe", "cleaned_text": "Big Pharma blames Covid and the Russian invasion of Ukraine, instead of toxic spike protein injections, for exploding cancer epidemic in Europe\n\nSupposedly, because of the pandemic, people all over the world were developing cancer and refusing to go to the hospitals to be diagnosed, for fear they would catch Fauci Flu. According to the pharma industrial complex, this went on for two years, and an estimated one million cancer cases were missed and over 100 million cancer screenings “lost because of the pandemic.” But that’s not all.\n\nThe goons at Big Pharma in Europe are also blaming the Russians for the new cancer epidemic, and say that if the Russians had not invaded Ukraine, then two of the largest contributors to clinical cancer research, diagnosis, and treatment (Russia and Ukraine) would not have been incapacitated. However, there’s a sub-plot here that nobody is talking about, and it could be the MAIN reason the world is experiencing a major uptick in cancer cases. What in the world could that be?\n\nCovid “vaccine” spike proteins significantly inhibit the ability of damaged DNA to repair itself, thus enabling cancer to develop and spread easily\n\nLockdowns and Fauci Flu fear were definitely responsible for damage to societies, economies, and overall mental health, but the tsunami of cancer cases may be hinged on a more realistic explanation – toxic spike prions in the blood and cleansing organs. Yes, the doctors lied and said the injections would remain at in the muscular tissue at the site of injection. Yes, the pandemic was mostly fear-based, as less than 1% of the population of the planet were at risk of dying from the Wuhan virus.\n\nResearch published in the journal MDPI (Multidisciplinary Digital Publishing Institute) shows how spike proteins significantly prevent human DNA that’s damaged from repairing itself. Goodbye adaptive immunity, in other words, because the BRCA1 and 53BP1 are KEY DNA repair proteins that can no longer do their job, thanks to the Fauci Flu gene mutation injections. Do all the pharma goons at Pfizer and Moderna already know this? What about Fauci, Walensky, and Bill Gates? Is this one of the reasons health advocates call it the “scamdemic” and the “plandemic?”\n\nSo while everyone who was injected with millions (if not billions by now) of spike proteins, they were much more likely to develop certain cancers, and since they weren’t visiting hospitals and doctor’s offices regularly to get screened, the cancer epidemic compounded and became a ‘pandemic’ of its own.\n\nEurope and America now facing “cancer epidemic” thanks to the spike protein injections, lockdowns, and compromised immune systems\n\nIn their effort to avoid getting the Wuhan Flu, a few billion humans put themselves directly in harms way, subjecting themselves to multiple gene therapy injections that make them much more vulnerable to cancer, heart attacks, strokes, and immune deficiency syndrome. The question for the vaccinated masses is can the damage be undone?\n\nHow can these toxic spike proteins be flushed from the body, or broken down, or dissolved possibly, so they don’t cause all these short-and-long-term effects? Is it even possible? Now that many autopsies have been done on the Covid-vaccinated who have died, it’s been revealed that these toxic spike prions have invaded vital cleansing organs, the heart, the brain, the ovaries, and much more. Will the cancer cases just keep rising? Only time will tell.\n\nKeep your truth news in check by adding Preparedness.news to your favorites list and tuning in daily for updates on real news about the surviving and thriving in the near future, and news that’s being scrubbed from MSM and social media as you read this.", "opengraph": {"title": "Big Pharma blames Covid and the Russian invasion of Ukraine, instead of toxic spike protein injections, for exploding cancer epidemic in Europe", "type": "article", "url": "https://www.eugenics.news/2022-11-22-big-pharma-blames-covid-russian-invasion-of-ukraine-massive-cancer-epidemic.html", "site_name": "Eugenics News", "description": "Supposedly, because of the pandemic, people all over the world were developing cancer and refusing to go to the hospitals to be diagnosed, for fear they would catch Fauci Flu. According to the pharma industrial complex, this went on for two years, and an estimated one million cancer cases were missed and over 100 million […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/11/Leukemia-Cancer-Blood-Treatment-Cell-Hematology-Leukaemia.jpg"}, "tags": ["pandemic", "wuhan virus", "cancer", "Vaccine deaths", "ADE", "spike proteins", "cancer epidemic", "vaccine injury", "Russian invasion", "depopulation", "vaccines", "immune deficiency", "toxins", "immune systems", "fauci flu"], "tweets": [], "movies": [], "links": ["https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://naturalnews.com/2021-11-02-covid-vaccines-inhibit-dna-repair-cause-cancer.html", "https://www.theguardian.com/society/2022/nov/15/europe-faces-cancer-epidemic-after-estimated-1m-cases-missed-during-covid", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.preparedness.news/2022-08-19-12-ways-prep-without-spending-too-much.html", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://www.theguardian.com/society/2022/nov/15/europe-faces-cancer-epidemic-after-estimated-1m-cases-missed-during-covid", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-11-22-big-pharma-blames-covid-russian-invasion-of-ukraine-massive-cancer-epidemic.html&linkname=Big%20Pharma%20blames%20Covid%20and%20the%20Russian%20invasion%20of%20Ukraine%2C%20instead%20of%20toxic%20spike%20protein%20injections%2C%20for%20exploding%20cancer%20epidemic%20in%20Europe", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}