{"result_id": "110007", "URL": "https://eugenics.news/2023-01-03-bill-gates-globalist-cabal-done-worldwide-takeover.html", "timestamp": "2023-04-25 15:03:56 CEST+0200", "meta": {"description": "It is no longer a secret that the World Health Organization (WHO) has been weaponized for the purpose of establishing a global health police state fully controlled by the globalists. We also now know that the WHO’s top donor and controller is none other than billionaire eugenicist Bill Gates. With Gates at the helm, the […]", "lang": "en", "keywords": "badhealth,Bill &Melinda Gates Foundation,bill gates,deception,deepstate,depopulation,enslaved,eugenics,FAO,GAVI,global takeover,Globalism,globalist,health freedom,Medical Tyranny,money supply,new world order,obey,outrage,overlords,pandemic treaty,Trump,Tyranny,UNICEF,vaccine passports,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2023-01-03-bill-gates-globalist-cabal-done-worldwide-takeover.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Bill Gates and his globalist cabal are about to WRAP UP their worldwide takeover", "cleaned_text": "Bill Gates and his globalist cabal are about to WRAP UP their worldwide takeover\n\nIt is no longer a secret that the World Health Organization (WHO) has been weaponized for the purpose of establishing a global health police state fully controlled by the globalists. We also now know that the WHO’s top donor and controller is none other than billionaire eugenicist Bill Gates.\n\nWith Gates at the helm, the WHO is moving full-steam ahead toward implementing a worldwide system of medical tyranny, perhaps most notably through the impending implementation of the so-called “Pandemic Treaty.”\n\nEvery WHO member state will be legally bound by this Pandemic Tyranny. They do not have to individually pass or even acknowledge it – if the WHO enshrines it, then everyone must follow and obey.\n\nIn short, the Pandemic Treaty will erase the concepts of respect for individual human dignity, human rights and fundamental freedoms. It will also give WHO’s director-general, as well as unelected regional directors, dictatorial powers and control over the world.\n\nThere will be no more privacy either as censorship is expanded to every last crevice of human life. And finally, to top it all off, “vaccine passports” and digital global identification tools will be mandated globally.\n\nThe Wuhan coronavirus (COVID-19) was just the test run for all these things. Next time, as promised by Gates himself, the live-action exercise will become a full reality, plunging the world into absolute darkness. (Related: Remember when Gates developed an enzyme called luciferase for inclusion into vaccine injections?)\n\nTrump cut off WHO funding but simply redirected it to GAVI, which is also controlled by Bill Gates\n\nSince its founding in 1948, the same year that Israel the state was reborn, the WHO has functioned as a mouthpiece for industry. From Big Tobacco to Big Pharma to everything in between, the WHO has operated on behalf of Big Business at the expense of We the People.\n\nUp until now, the WHO’s tentacles have been limited. The plan, though, is to have them reach and control every last nook and cranny of Planet Earth. And we largely have Bill Gates and his globalist cabal to blame for what is soon to befall this place that many call home.\n\nFormer President Donald Trump suspended all United States funding to the WHO. However, what many did not realize at the time is that Trump simply redirected that funding to GAVI, a “charity” controlled by, you guessed it: Bill Gates.\n\nThat GAVI money was likely sent by Gates right back to the WHO in a sleight-of-hand that has become the norm in American politics. The left fights the right, and the right fights the left, but it is always the same bird pulling the strings.\n\nKeep in mind that Gates has multiple avenues of directing funding to the WHO and its globalist agenda. He does so not only through GAVI but also through the infamous Bill & Melinda Gates Foundation, as well as through the Strategic Advisory Group of Experts (SAGE), UNICEF and Rotary International.\n\nThe WHO has a biennial budget of around $4.84 billion, and $1 billion of that comes from Gates. In short, Gates holds extreme influence over the WHO because he pays for much of its operations, allowing him to control world affairs in an undue way.\n\nGates’ plan is to unleash a “One World” health plan controlled by the WHO itself, along with the Food and Agriculture Organization (FAO), the United Nations Environment Program (UNEP), and the World Organization for Animal Health (WOAH).\n\nTogether, all of these groups plan to eliminate human rights and subdue the entire planet under a new health tyranny paradigm dreamed up by Gates and his ilk. It is their envisioned new world order coming to fruition right in plain sight.\n\nThe latest news about Bill Gates can be found at Evil.news.", "opengraph": {"title": "Bill Gates and his globalist cabal are about to WRAP UP their worldwide takeover", "type": "article", "url": "https://www.eugenics.news/2023-01-03-bill-gates-globalist-cabal-done-worldwide-takeover.html", "site_name": "Eugenics News", "description": "It is no longer a secret that the World Health Organization (WHO) has been weaponized for the purpose of establishing a global health police state fully controlled by the globalists. We also now know that the WHO’s top donor and controller is none other than billionaire eugenicist Bill Gates. With Gates at the helm, the […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/01/Editorial-Use-Bill-Gates-Speech.jpg"}, "tags": ["deception", "overlords", "money supply", "vaccine passports", "Trump", "obey", "new world order", "pandemic treaty", "UNICEF", "globalist", "enslaved", "bill gates", "Bill &Melinda Gates Foundation", "depopulation", "Medical Tyranny", "outrage", "WHO", "Tyranny", "FAO", "deepstate", "GAVI", "global takeover", "eugenics", "health freedom", "Globalism"], "tweets": [], "movies": [], "links": ["https://articles.mercola.com/sites/articles/archive/2022/12/26/bill-gates-global-takeover-is-official.aspx?v=1672090536", "https://naturalnews.com/2020-05-15-enzyme-bill-gates-vaccine-microchip-implant-luciferase.html", "http://evil.news", "https://articles.mercola.com/sites/articles/archive/2022/12/26/bill-gates-global-takeover-is-official.aspx?v=1672090536", "https://naturalnews.com/2020-05-15-enzyme-bill-gates-vaccine-microchip-implant-luciferase.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-01-03-bill-gates-globalist-cabal-done-worldwide-takeover.html&linkname=Bill%20Gates%20and%20his%20globalist%20cabal%20are%20about%20to%20WRAP%20UP%20their%20worldwide%20takeover", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}