{"result_id": "110016", "URL": "https://eugenics.news/2020-07-23-bill-gates-pushing-for-7-billion-mandatory-experimental-rna-injections.html", "timestamp": "2023-04-25 15:04:03 CEST+0200", "meta": {"description": "Operation Warp Speed is underway in the United States as the federal government moves forward with approximately $2 billion in contracts with pharmaceutical and biotechnology companies to produce and deliver up to 300 million experimental vaccine doses by January 2021. In the meantime, state governments and health departments are coercing people into indefinite mask wearing, […]", "lang": "en", "keywords": "adverse events,badhealth,badmedicine,badscience,bill gates,biotechnology,cellular programming,coercion,control,depopulation,Dr Fauci,eugenics,genetic modifications,germ line editing,Globalism,guinea pigs,health risks,insanity,medical experiments,Moderna,outbreak,pandemic,RNA therapy,vaccine crimes,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2020-07-23-bill-gates-pushing-for-7-billion-mandatory-experimental-rna-injections.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Bill Gates pushing for 7 billion mandatory experimental RNA injections that re-program human cells to produce coronavirus spike proteins", "cleaned_text": "Bill Gates pushing for 7 billion mandatory experimental RNA injections that re-program human cells to produce coronavirus spike proteins\n\nOperation Warp Speed is underway in the United States as the federal government moves forward with approximately $2 billion in contracts with pharmaceutical and biotechnology companies to produce and deliver up to 300 million experimental vaccine doses by January 2021.\n\nIn the meantime, state governments and health departments are coercing people into indefinite mask wearing, contact tracing, restrictions on personal liberty, and continued shutdowns and restrictions on certain activities, until new experimental vaccines are consumed en masse.\n\nUS President Donald Trump, seeking stock market growth for reelection, is caught up in a conflict of interest as he becomes Big Pharma’s greatest spokesperson to advance new biologics and RNA injections.\n\nGates and Fauci pushing controversial trans-generational germ line editing vaccine for every human being\n\nBig Pharma has over 170 covid-19 vaccines in development, but Bill Gates and Dr. Anthony Fauci are pushing an experimental RNA technology to the front of the line. This technology, delivered via injection, is a type of genetic engineering called germ line editing. Bill Gates has been pushing this technology for over a decade and has the financial resources in place to carry out these genetic alterations on populations around the world. The technology inserts coronavirus genetic code into each person, forever changing genetics and cellular processes in their body. The coronavirus RNA reprograms human cells to produce spike proteins, forcing the immune system to fight properties of a virus that are being artificially manufactured by the body’s own cells. The effects of this technology are trans-generational; the cellular manipulation can be passed down to future generations. Leading ethicists and scientists called for an end to this kind of trans-generational human genome editing in a January 2020 Geneva Statement.\n\nJanuary 2020 was also the time when Dr. Fauci and the NIH moved forward with licensure of this controversial technology to be used in Moderna’s experimental RNA coronavirus vaccine. (The NIH owns half of Moderna’s vaccine and stands to profit.) Even though Moderna has never brought a product to market, their latest controversial technology has been irresponsibly pushed through clinical trials, bypassing animal studies that are critically important to understand toxicity, histopathology, and disease processes. (Previous attempts to manufacture a coronavirus vaccine for SARS resulted in animal fatalities after injection and upon subsequent infection.)\n\nIn the first round of hasty human trials approved by Dr. Fauci, Moderna’s results were embellished by the pharmaceutical-controlled media, despite the injection causing complications and hospitalizations in 20 percent of the participants in the high dose group. It has also proven to cause side effects in half of study participants and its effectiveness wanes in 2 to 3 months. Imagine this kind of damage being carried out among larger populations! It’s reasonable to assume that wide-scale hospitalizations from the injection will be blamed on those who did not get the vaccine in the first place. These “anti-vaxxers” (which could represent well over half the population) will be shamed by the media and blamed for new outbreaks, resulting in government emergencies that force everyone to comply.\n\nDespite the apparent risks, Moderna was given the green light to continue pushing their experiment forward. Moderna even received $483 million in federal funds from the Biomedical Advanced Research and Development Authority (BARDA) to warp speed the process along. Bill Gates wants to make the technology mandatory for the world’s population. He even said that anyone who refuses the injection is making the science less effective, putting everyone at risk. It’s this kind of false guilt, mental degradation, and bondage that is coercing millions of people to follow along with ongoing fear-based mandates that do nothing to address our ability to overcome the virus with healthy immune function. This kind of illegal medical coercion will result in people being physically abused as they submit to experimental, inherently-dangerous injections just to get a sense of their freedom back.\n\nBut that’s not freedom. It’s all about control. Will you continue to go along?", "opengraph": {"title": "Bill Gates pushing for 7 billion mandatory experimental RNA injections that re-program human cells to produce coronavirus spike proteins", "type": "article", "url": "https://www.eugenics.news/2020-07-23-bill-gates-pushing-for-7-billion-mandatory-experimental-rna-injections.html", "site_name": "Eugenics News", "description": "Operation Warp Speed is underway in the United States as the federal government moves forward with approximately $2 billion in contracts with pharmaceutical and biotechnology companies to produce and deliver up to 300 million experimental vaccine doses by January 2021. In the meantime, state governments and health departments are coercing people into indefinite mask wearing, […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2020/07/Bill-Gates.jpg"}, "tags": ["pandemic", "outbreak", "medical experiments", "RNA therapy", "germ line editing", "cellular programming", "guinea pigs", "control", "vaccine crimes", "vaccine wars", "biotechnology", "genetic modifications", "bill gates", "depopulation", "health risks", "insanity", "Dr Fauci", "Moderna", "eugenics", "adverse events", "coercion", "vaccines", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.washingtonpost.com/nation/2020/07/22/covid-live-updates-us/", "https://childrenshealthdefense.org/news/vaccines/gates-pushes-gene-altering-technology-on-seven-billion-humans/", "https://www.geneticsandsociety.org/biopolitical-times/geneva-statement-calls-course-correction-heritable-genome-editing", "https://www.naturalnews.com/2020-07-10-nih-owns-half-of-moderna-vaccine.html", "https://www.naturalnews.com/2020-05-25-moderna-mrna-coronavirus-vaccine-caused-serious-injury.html", "https://www.naturalnews.com/2020-05-21-dr-faucis-warp-speed-vaccine-gets-media-applause-concerns-surface.html", "https://www.naturalnews.com/2020-05-28-americans-increasingly-distrustful-warp-speed-coronavirus-vaccine.html", "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine", "http://liberty.news", "https://childrenshealthdefense.org/news/vaccines/gates-pushes-gene-altering-technology-on-seven-billion-humans/", "https://www.geneticsandsociety.org/biopolitical-times/geneva-statement-calls-course-correction-heritable-genome-editing", "https://www.naturalnews.com/2020-07-10-nih-owns-half-of-moderna-vaccine.html", "https://www.naturalnews.com/2020-05-25-moderna-mrna-coronavirus-vaccine-caused-serious-injury.html", "https://www.naturalnews.com/2020-05-21-dr-faucis-warp-speed-vaccine-gets-media-applause-concerns-surface.html", "https://www.naturalnews.com/2020-05-28-americans-increasingly-distrustful-warp-speed-coronavirus-vaccine.html"], "authors": [], "publish_date": null}