{"result_id": "110032", "URL": "https://eugenics.news/2022-09-12-former-harvard-professor-science-public-health-broken.html", "timestamp": "2023-04-25 15:04:16 CEST+0200", "meta": {"description": "Dr. Martin Kulldorff, a prominent epidemiologist and statistician from Harvard University, says that the current paradigm of science and public health is clearly “broken.” The Wuhan coronavirus (Covid-19) plandemic has exposed the corruption of the system to a degree not seen perhaps ever. When the average person is really starting to question the legitimacy of […]", "lang": "en", "keywords": "broken,Censored Science,chemical violence,COVID,Great Barrington Declaration,Martin Kulldorff,medical experiments,medical extremism,Medical Tyranny,medical violence,pandemic,Plandemic,Public Health,research,science,Sweden", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-09-12-former-harvard-professor-science-public-health-broken.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Former Harvard professor warns that “science and public health are broken”", "cleaned_text": "Former Harvard professor warns that “science and public health are broken”\n\nDr. Martin Kulldorff, a prominent epidemiologist and statistician from Harvard University, says that the current paradigm of science and public health is clearly “broken.”\n\nThe Wuhan coronavirus (Covid-19) plandemic has exposed the corruption of the system to a degree not seen perhaps ever. When the average person is really starting to question the legitimacy of the government and its “public health” impositions, you know something is not quite right.\n\n“For some reason, a public official narrative was established, and you weren’t allowed to question it – which, of course, is very detrimental, both to the pandemic and how to deal with the pandemic, because you have to have a vibrant discussion to figure out how best to deal with these things,” Kulldorff told The Epoch Times in a recent interview.\n\nEarly on in the plandemic, you may recall that Kulldorff put himself in the crosshairs by exposing the plandemic for what it was, even when people were still being told that it would just take two weeks to “flatten the curve.”\n\nIn March 2020 when the plandemic first began, Kulldorff, a native of Sweden, was already trying to publish studies showing that the Fauci Flu was really not all that big of a deal. He tried to present evidence of what people could do to help minimize their risk of infection as opposed to just panicking and living in fear.\n\nKulldorff’s research was patently rejected, as you might expect – but he did not stop fighting. In fact, he has continued to tell the truth, putting his entire career and reputation on the line.\n\n“I was able to publish in Sweden, in the major daily newspapers there during the spring of 2020, so that was not a problem,” he says. “But the United States was not allowed to have a debate, which is very troubling.”\n\nKulldorff has been fighting the good fight since the beginning of the plandemic\n\nKulldorff’s early efforts culminated in the release of the Great Barrington Declaration, which was published by Drs. Sunetra Gupta and Jay Bhattacharya in October 2020. This declaration called for a more nuanced approach to the plandemic as opposed to the one-size-fits-all restrictions that were forced on primarily Westerners.\n\n“The most compassionate approach that balances the risks and benefits of reaching herd immunity, is to allow those who are at minimal risk of death to live their lives normally to build up immunity to the virus through natural infection, while better protecting those who are at highest risk,” that declaration states.\n\nGupta, by the way, is an epidemiologist with an expertise in immunology, vaccine development and mathematical modeling of infectious diseases who also works as a professor at the University of Oxford. Bhattacharya is an epidemiologist, health economist and public health policy expert who focuses on infectious diseases and vulnerable populations, and also teaches at the Stanford University Medical System.\n\n“It’s just the basic fundamental principles of public health that existed in the pandemic preparedness plan that was prepared many years before,” Kulldorff says about the Great Barrington Declaration. “It’s sort of astonishing that it wasn’t followed from the very beginning of the pandemic.”\n\nKulldorff says that the Great Barrington Declaration was not intended for politicians, scientists or even doctors, despite the fact that thousands of them signed it. Instead, it was intended for the general public.\n\n“The most important audience was the public,” he says. “Because it’s the public that ultimately will end these misguided public health policies. It’s the public, regular people, who are suffering the consequences.”\n\n“The key thing was to break the pretense that there was scientific consensus for these lockdowns – which there wasn’t.”\n\nThe latest news coverage about the plandemic can be found at Pandemic.news.", "opengraph": {"title": "Former Harvard professor warns that “science and public health are broken”", "type": "article", "url": "https://www.eugenics.news/2022-09-12-former-harvard-professor-science-public-health-broken.html", "site_name": "Eugenics News", "description": "Dr. Martin Kulldorff, a prominent epidemiologist and statistician from Harvard University, says that the current paradigm of science and public health is clearly “broken.” The Wuhan coronavirus (Covid-19) plandemic has exposed the corruption of the system to a degree not seen perhaps ever. When the average person is really starting to question the legitimacy of […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/09/covid-lockdown-chains.jpg"}, "tags": ["Martin Kulldorff", "pandemic", "Great Barrington Declaration", "Plandemic", "science", "research", "COVID", "medical experiments", "medical violence", "Public Health", "Medical Tyranny", "medical extremism", "Sweden", "chemical violence", "Censored Science", "broken"], "tweets": [], "movies": [], "links": ["http://www.harvard.edu", "https://www.theepochtimes.com/exclusive-former-harvard-prof-martin-kulldorff-science-and-public-health-are-broken_4270247.html", "https://naturalnews.com/2021-09-02-harvard-study-obliterates-case-covid-vaccine-passports.html", "https://www.ox.ac.uk/", "http://www.stanford.edu", "http://pandemic.news", "https://www.theepochtimes.com/exclusive-former-harvard-prof-martin-kulldorff-science-and-public-health-are-broken_4270247.html", "https://naturalnews.com/2021-09-02-harvard-study-obliterates-case-covid-vaccine-passports.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-09-12-former-harvard-professor-science-public-health-broken.html&linkname=Former%20Harvard%20professor%20warns%20that%20%E2%80%9Cscience%20and%20public%20health%20are%20broken%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}