{"result_id": "110001", "URL": "https://eugenics.news/2023-02-17-yale-professor-suggests-mass-suicide-for-elderly.html", "timestamp": "2023-04-25 15:03:52 CEST+0200", "meta": {"description": "A professor at Yale University recently suggested a controversial solution to Japan’s population problem: mass “seppuku” – a form of ritual suicide that originated from Japan’s ancient warrior class of samurai – for the elderly. In other words, mass suicide for the country’s senior citizens. Yusuke Narita, who teaches economics at the Ivy League school, also predicted that the […]", "lang": "en", "keywords": "birth rate,Collapse,conspiracy,depopulation,euthanasia,evil,genocide,Globalism,insanity,Japan,Kishida Fumio,lunatics,Mass suicide,population collapse,population control,population crisis,propaganda,psycho,wef,Yale,Yusuke Narita", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2023-02-17-yale-professor-suggests-mass-suicide-for-elderly.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Yale professor suggests mass suicide for the elderly to address Japan’s population issues", "cleaned_text": "Yale professor suggests mass suicide for the elderly to address Japan’s population issues\n\nA professor at Yale University recently suggested a controversial solution to Japan’s population problem: mass “seppuku” – a form of ritual suicide that originated from Japan’s ancient warrior class of samurai – for the elderly. In other words, mass suicide for the country’s senior citizens.\n\nYusuke Narita, who teaches economics at the Ivy League school, also predicted that the “possibility of making euthanasia mandatory in the future will come up in discussion.”\n\nPodcaster Martin Brodel slammed the professor, saying that he is wrongheaded and desperate for attention. “If he’s going to insist on mass suicide, we need to start with him,” Brodel said.\n\nAnalysts think the professor’s rhetoric is very close to World Economic Forum (WEF) Founder Klaus Schwab’s ideologies and desire to depopulate the planet. Self-proclaimed world health czar and tech mogul Bill Gates has also endorsed “death panels” to sentence ordinary, law-abiding people to death for the crime of being of no use to the elite, NewsPunch‘s Baxter Dmitry noted.\n\nNarita’s suggestion received a fierce wave of backlash, with critics branding him “irresponsible” as many of his supporters “believed old people should just die already.” He reportedly became somewhat famous in the youth of Japan, garnering half a million Twitter followers.\n\nJournalist Masaki Kubota reportedly said the Japanese “might think, ‘oh, my grandparents are the ones who are living longer and we should just get rid of them.'”\n\nAlexis Dudden, a historian at the University of Connecticut, said Narita isn’t “focusing on helpful strategies such as better access to daycare or broader inclusion of women in the workforce or broader inclusion of immigrants,” or other “things that might actually invigorate Japanese society.”\n\nMeanwhile, Narita told New York Times that his words were “taken out of context.” He claimed that he simply wants the elderly to be removed from positions of power.\n\n“I should have been more careful about their potential negative connotation,” Narita reportedly said of his use of the term “seppuku,” adding that it was “an abstract metaphor.” He told the media outlet that, “after some self-reflection,” he stopped using that term sometime last year. He also later retracted his statement on euthanasia, saying he is not advocating its introduction as it is a complex and nuanced issue.\n\nOlder generations are traditionally revered and honored in Japan, and Narita’s views and the views of his supporters indicate a growing cohort of youth bucking those traditions.\n\nJapanese Prime Minister Kishida Fumio noted back in January that the nation’s birth rate fell below 800,000 in 2022, reaching that landmark of decline eight years ahead of projections. According to official estimates, the total population shrank by 0.43 percent, at 124.77 million as of Jan. 1 versus 125.308 million on the same day in 2022. The pace of decline eased slightly from 2021 when the population fell 0.6 percent.\n\n“Our nation is on the cusp of whether it can maintain its societal functions. It is now or never when it comes to policies regarding births and child-rearing – it is an issue that simply cannot wait any longer,” Kishida said. (Related: Demographers warn of looming population collapse.)\n\nNikkei Asia reported that Japan’s population peaked in 2008 at just over 128 million. But the number of newborns has been falling for years. The latest estimate showed the population of 0-4 year-olds is at 4.22 million. That is only about two-thirds of the 6.24 million people in the 20-24 age bracket.\n\nMeanwhile, there are about 36.21 million people aged 65 and above, making up for 29 percent of the total population. Narita, it appears, wants to drastically lower that number.\n\nFind more stories about population decline at PopulationCollapse.com.\n\nThis video is from Martin Brodel’s channel on Brighteon.com.\n\nWEF’s Yuval Noah Harari believes the world does not need so many people.\n\nThe Bill Gates depopulation plan is succeeding at culling human populations: Fertility rates plummeting around the world.\n\nThe goal of the “elite” with all their climate hysteria is to wipe out the food supply and depopulate the planet.\n\nThe Biden cabal will scurry away like cowardly RATS with their tails between their legs to their bunkers before triggering nuclear Armageddon in their rush to depopulate the planet.", "opengraph": {"title": "Yale professor suggests mass suicide for the elderly to address Japan’s population issues", "type": "article", "url": "https://www.eugenics.news/2023-02-17-yale-professor-suggests-mass-suicide-for-elderly.html", "site_name": "Eugenics News", "description": "A professor at Yale University recently suggested a controversial solution to Japan’s population problem: mass “seppuku” – a form of ritual suicide that originated from Japan’s ancient warrior class of samurai – for the elderly. In other words, mass suicide for the country’s senior citizens. Yusuke Narita, who teaches economics at the Ivy League school, also predicted that the […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/02/Elderly-Asian-Woman-Park-Green-Smoothie-Drink.jpg"}, "tags": ["Yusuke Narita", "conspiracy", "birth rate", "lunatics", "population crisis", "Japan", "psycho", "euthanasia", "wef", "propaganda", "population collapse", "Kishida Fumio", "depopulation", "Yale", "insanity", "Mass suicide", "population control", "evil", "Collapse", "genocide", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.yale.edu/", "https://www.brighteon.com/4dd63d7c-694d-4d53-8a41-dde3fa11d5f8", "https://www.breitbart.com/politics/2023/02/14/nolte-mass-suicide-of-the-elderly-is-being-proposed-and-accepted/", "https://newspunch.com/yale-professor-its-time-to-talk-about-forcing-seniors-to-commit-mass-suicide/", "https://uconn.edu/", "https://ktvl.com/news/nation-world/japans-elderly-should-commit-mass-suicide-says-yale-professor-who-is-now-clarifying-after-backlash-yusuke-narita", "https://asia.nikkei.com/Economy/Japan-population-drops-0.43-in-2022-as-Kishida-vows-to-stem-decline", "https://naturalnews.com/2022-06-10-demographers-population-collapse-toward-end-of-century.html", "http://PopulationCollapse.com", "http://PopulationCollapse.com", "https://www.brighteon.com/4dd63d7c-694d-4d53-8a41-dde3fa11d5f8", "https://www.brighteon.com/channels/martinbrodel", "https://naturalnews.com/2022-10-25-evil-wef-leader-caught-planning-mass-extinction-event.html", "https://depopulation.news/2022-10-12-wef-harari-world-doesnt-need-many-people.html", "https://genocide.news/2020-07-31-bill-gates-depopulation-plan-coming-along-fertility-rates-plummeting.html", "https://globalism.news/2022-08-08-elite-climate-hysteria-end-food-supply-depopulate.html", "https://joebiden.news/2022-10-07-biden-cabal-scurry-away-like-cowardly-rats.html", "https://www.brighteon.com/4dd63d7c-694d-4d53-8a41-dde3fa11d5f8", "https://www.breitbart.com/politics/2023/02/14/nolte-mass-suicide-of-the-elderly-is-being-proposed-and-accepted/", "https://newspunch.com/yale-professor-its-time-to-talk-about-forcing-seniors-to-commit-mass-suicide/", "https://ktvl.com/news/nation-world/japans-elderly-should-commit-mass-suicide-says-yale-professor-who-is-now-clarifying-after-backlash-yusuke-narita", "https://asia.nikkei.com/Economy/Japan-population-drops-0.43-in-2022-as-Kishida-vows-to-stem-decline", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-02-17-yale-professor-suggests-mass-suicide-for-elderly.html&linkname=Yale%20professor%20suggests%20mass%20suicide%20for%20the%20elderly%20to%20address%20Japan%E2%80%99s%20population%20issues", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}