{"result_id": "110013", "URL": "https://www.eugenics.news/2020-04-03-eugenicist-bill-gates-demands-digital-certificates-coronavirus-vaccination.html", "timestamp": "2023-04-25 15:04:01 CEST+0200", "meta": {"description": "On March 18, outspoken eugenicist Bill Gates participated in an “Ask Me Anything” (AMA) event on Reddit entitled, “I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. AMA about COVID-19.” And during this event, Gates openly admitted to the world that the agenda moving forward is to vaccinate every person on the planet […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Brother,bill gates,China,Chinese Virus,coronavirus,coronavirus vaccine,covid-19,digital certificate,disease,eugenicist,eugenics,fascis,global emergency,Global Pandemic,health freedom,infection,medical fascism,novel coronavirus,Orwellian,outbreak,pandemic,Tyranny,vaccine wars,vaccines,virus,Wuhan,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.eugenics.news/2020-04-03-eugenicist-bill-gates-demands-digital-certificates-coronavirus-vaccination.html", "encoding": "UTF-8"}, "image": null, "domain": "www.eugenics.news", "title": "No vaccine, no job: Eugenicist Bill Gates demands “digital certificates” to prove coronavirus vaccination status", "cleaned_text": "No vaccine, no job: Eugenicist Bill Gates demands “digital certificates” to prove coronavirus vaccination status\n\nOn March 18, outspoken eugenicist Bill Gates participated in an “Ask Me Anything” (AMA) event on Reddit entitled, “I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. AMA about COVID-19.” And during this event, Gates openly admitted to the world that the agenda moving forward is to vaccinate every person on the planet with coronavirus vaccines as well as track them with Mark of the Beast-type “digital certificates.”\n\nTaking place just five days after he conveniently stepped down from the public board of Microsoft to “dedicate more time to philanthropic priorities including global health and development, education, and climate change,” this AMA event with Bill Gates ended up revealing the blueprints of the globalist endgame for humanity, which includes tagging people like cattle and controlling what they’re allowed to do based on their vaccination status.\n\nIf you agree to get vaccinated with a Wuhan coronavirus (COVID-19) vaccine once it becomes available, in other words, then the government will grant you permission to join back up with society and resume at least some of the “normalcy” of your former life. If you don’t, however, then you’ll presumably be ostracized from the rest of the world and forced into permanent isolation, left to fend for yourself with no means to buy, sell, or conduct any type of business in order to make a living and survive.\n\nThis is the book of Revelation in action, and Bill Gates is laying it all out for you – assuming you’re paying attention. Everything he’s presenting as the “solution” to the Wuhan coronavirus (COVID-19) crisis was foretold long ago by the prophets, and now it’s coming to fruition under the guise of stopping a global pandemic and ensuring that everyone has a proper “digital identity.”\n\nIt was October 2019 when Bill Gates held his infamous Event 201 forum, which included discussions about a “hypothetical” coronavirus pandemic and how to handle it. Fast-forward a few months and here we are, exactly as Bill Gates and his globalist cronies “predicted” – or rather planned – it all to happen, along with their “solutions” waiting in the wings for a grand unveiling.\n\nWhen asked, “What changes are we going to have to make to how businesses operate to maintain our economy while providing social distancing?” Bill Gates responded:\n\n“The question of which businesses should keep going is tricky. Certainly food supply and the health system. We still need water, electricity and the internet. Supply chains for critical things need to be maintained. Countries are still figuring out what to keep running.”\n\nAnd here’s the real kicker at the conclusion of his answer:\n\n“Eventually we will have some digital certificates to show who has recovered or been tested recently or when we have a vaccine, who has received it.”\n\nDid you catch that? Bill Gates wants to digitally track everyone who contracts the Wuhan coronavirus (COVID-19) and recovers from it, along with everyone who’s been tested for it. He also wants to know who takes the coronavirus vaccine once it becomes publicly available.\n\nListen below to The Health Ranger Report as Mike Adams, the Health Ranger, talks about how the world economy has now come to an end due to the Wuhan coronavirus (COVID-19):\n\nBill Gates wants everyone to have a “quantum dot tattoo” microchip inserted in their bodies\n\nIt should be noted that the number-one up-voted response to this admission by Bill Gates was from a user who pointed out that it directly aligns with Revelation 13, which states, beginning in verse 16, concerning the Mark of the Beast:\n\n“He causes all, both small and great, rich and poor, free and slave, to receive a mark on their right hand or on their foreheads, and that no one may buy or sell except one who has the mark of the name of the beast, or the number of his name. Here is wisdom. Let him who has understanding calculate the number of the beast, for it is the number of a man: His number is 666.”\n\nKeep in mind that this all coincides with the ID2020 agenda, which aims to create a global digital identification system for every person on Earth. As we’ve reported in the past, ID2020 and vaccines are being used together to harvest the biometric identities of all mankind, and all for the purpose of creating the global system of tracking and control that was foretold in the book of Revelation.\n\nThey’ve already begun to test ID2020 in Bangladesh, inserting digital IDs in the bodies of newborn babies along with their vaccinations. And Bill Gates is now talking about how so-called “quantum dot tattoos” are the next wave of biometrics identification, also to be inserted in people’s bodies through vaccination.\n\nA report from Futurism explains the quantum dot tattoo as “tiny semiconducting crystals that reflect light” and that “glows under infrared light.” This pattern, along with the vaccine it’s hidden in, gets “delivered into the skin using hi-tech dissolvable microneedles made of a mixture of polymers and sugar,” and is coming to a vaccine clinic near you in the very near future.\n\n“This short (and unexpected answer) opened a gigantic Pandora’s box of what could be in store in the near future: The inevitable mass vaccination campaign to eradicate COVID-19 would be the perfect opportunity to introduce a worldwide digital ID,” warns Vigilant Citizen.\n\nTo keep up with the latest Wuhan coronavirus (COVID-19) news, be sure to check out Pandemic.news.", "opengraph": {"title": "No vaccine, no job: Eugenicist Bill Gates demands “digital certificates” to prove coronavirus vaccination status", "type": "article", "url": "https://www.eugenics.news/2020-04-03-eugenicist-bill-gates-demands-digital-certificates-coronavirus-vaccination.html", "site_name": "Eugenics News", "description": "On March 18, outspoken eugenicist Bill Gates participated in an “Ask Me Anything” (AMA) event on Reddit entitled, “I’m Bill Gates, co-chair of the Bill & Melinda Gates Foundation. AMA about COVID-19.” And during this event, Gates openly admitted to the world that the agenda moving forward is to vaccinate every person on the planet […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2020/04/bill-gates.jpg"}, "tags": ["pandemic", "outbreak", "Big Brother", "coronavirus vaccine", "China", "global emergency", "covid-19", "disease", "digital certificate", "coronavirus", "virus", "Global Pandemic", "Wuhan coronavirus", "vaccine wars", "infection", "bill gates", "novel coronavirus", "fascis", "Tyranny", "medical fascism", "Orwellian", "eugenicist", "Chinese Virus", "eugenics", "vaccines", "Wuhan", "health freedom"], "tweets": [], "movies": [], "links": ["https://vigilantcitizen.com/latestnews/bill-gates-calls-for-a-digital-certificate-to-identify-who-is-vaccinated/", "https://www.naturalnews.com/2019-10-23-vaccines-used-global-biometric-identities-for-surveillance.html", "http://pandemic.news", "https://vigilantcitizen.com/latestnews/bill-gates-calls-for-a-digital-certificate-to-identify-who-is-vaccinated/", "https://www.naturalnews.com/2019-10-23-vaccines-used-global-biometric-identities-for-surveillance.html"], "authors": [], "publish_date": null}