{"result_id": "110010", "URL": "https://www.eugenics.news/2022-07-06-taiwan-catastrophic-23-percent-drop-birth-rate.html", "timestamp": "2023-04-25 15:03:59 CEST+0200", "meta": {"description": "Taiwan has recorded something horrendous with its population, something that would be statistically improbable under normal circumstances, and practically impossible even by random chance. But the world is not living under normal circumstances. In 2021, vaccine manufacturers were lifted to “savior” status by global health authorities and governments. Freedoms were threatened, bribery ensued as a […]", "lang": "en", "keywords": "biological warfare,birth rates,Censored Science,depopulation schemes,depopulation weapons,failed vaccines,Infertility,medical malpractice,mindless obedience,placenta,regret,reproductive harm,sigma events,sperm count,Taiwan", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.eugenics.news/2022-07-06-taiwan-catastrophic-23-percent-drop-birth-rate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.eugenics.news", "title": "Taiwan witnesses catastrophic 23% drop in birth rate in May of 2022, as global depopulation schemes take effect", "cleaned_text": "Taiwan witnesses catastrophic 23% drop in birth rate in May of 2022, as global depopulation schemes take effect\n\nTaiwan has recorded something horrendous with its population, something that would be statistically improbable under normal circumstances, and practically impossible even by random chance.\n\nBut the world is not living under normal circumstances. In 2021, vaccine manufacturers were lifted to “savior” status by global health authorities and governments. Freedoms were threatened, bribery ensued as a series of medical experiments were coercively injected into populations around the world. This led to historic levels of mindless obedience, medical malpractice and wrongful death. Now birth rates are falling around the world, as global depopulation schemes take effect.\n\nTaiwan witnesses improbable 23% drop in birth rate in May\n\nIn just one year, the birth rate dropped by approximately 23 percent across the entire country of Taiwan. This appalling statistic comes from an official Taiwanese government report, comparing birth rates from May 2021 and May 2022. If the trend continues, Taiwan will record a 26-sigma event, something that is statistically impossible by chance.\n\nUpon closer observation of the data, Taiwan’s birth rate remained steady from 2009 to 2021. By 2022, a drop-off of unthinkable proportions was recorded in May. If the May birth rate data is replicated throughout the remainder of 2022, then the Taiwanese birth rate for all of 2022 will have fallen by 23.24 percent!\n\nStatistically, this birth rate drop-off can be expressed as a 26-sigma event. Sigma refers to units of standard deviation. The standard deviation in the birth rate for 2009 through 2021 is .07412921843. The absolute drop is recorded at 1.9526248, rendering a 26.34 drop in sigmas!\n\nWhen Wolfram-Alpha developed the mathematical calculation for sigma, they only explained this improbability up to 10 sigmas. They reasoned it was pointless to show more than 10 sigmas due to the improbability of the equation. However, Taiwan just witnessed a 26-sigma event, as the world woke up from its hypnosis of mass propaganda and obedience training. Global birth rates are falling now. Germany recently reported a 13 percent decline in birth rates.\n\nAccording to vaccine records, at least 91% of all Taiwanese residents received at least one dose of the covid-19 vaccine by September 2021. Just nine months later, the country is beginning to see an improbable drop in birth rates. Despite being 91 percent vaccinated, the population of Taiwan is experiencing the toughest wave of covid-19 infections to date. It does paint a harrowing picture of multiple vaccine failures. On top of that, the obedient majority must deal with the regret of wasting years following the oppressive, failed advice of criminals.\n\nEvidence previously showed that the mRNA vaccines attacked endogenous proteins in the placenta of women. The laboratory-derived spike proteins translated by these vaccines cross-react with retrovirus protein envelopes called syncytin. Before the vaccines were unleashed, Dr. Janci Chun Lindsay warned the CDC and the Advisory Committee on Immunization Practices that this process would harm reproductive proteins in sperm, ova and placenta in ways that may “impair fertility and reproductive outcomes.”\n\nNow, there is evidence that the covid-19 vaccines harm sperm counts directly. A peer-reviewed study published in Andrology shows a 22 percent drop off in the number of sperm in the ejaculated semen, three to five months after the second dose of covid-19 vaccine. By the time the third dose was administered, the sperm count remained 19% below the pre-vaccine levels.\n\nIn the film, Infertility: a Diabolical Agenda, researchers document global depopulation schemes carried out through forceful vaccination programs. Global predators seek to destroy populations by controlling their healthcare systems, by forcing dangerous drugs and protocols down people’s throats. These global predators continue to commit crimes against humanity by engineering pathogens and controlling people through fear, while obliterating medical ethics and informed consent, as they coerce the world population to take so-called vaccines that injure and kill.", "opengraph": {"title": "Taiwan witnesses catastrophic 23% drop in birth rate in May of 2022, as global depopulation schemes take effect", "type": "article", "url": "https://www.eugenics.news/2022-07-06-taiwan-catastrophic-23-percent-drop-birth-rate.html", "site_name": "Eugenics News", "description": "Taiwan has recorded something horrendous with its population, something that would be statistically improbable under normal circumstances, and practically impossible even by random chance. But the world is not living under normal circumstances. In 2021, vaccine manufacturers were lifted to “savior” status by global health authorities and governments. Freedoms were threatened, bribery ensued as a […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/09/Sperm-Human-Mitochondria-Semen-Acrosome-Analysis-Bio.jpg"}, "tags": ["biological warfare", "reproductive harm", "placenta", "depopulation weapons", "birth rates", "Infertility", "failed vaccines", "Taiwan", "depopulation schemes", "regret", "sperm count", "sigma events", "mindless obedience", "Censored Science", "medical malpractice"], "tweets": [], "movies": [], "links": ["https://igorchudov.substack.com/p/depopulation-of-taiwan", "https://www.ris.gov.tw/app/en/2121?sn=22161405", "https://igorchudov.substack.com/p/dramatic-decrease-in-births-in-germany?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://naturalnews.com/2021-12-10-sterilizing-entire-generation-with-covid-vaccines.html", "https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://infertilitymovie.org/", "http://vaccines.news", "https://igorchudov.substack.com/p/depopulation-of-taiwan", "https://www.ris.gov.tw/app/en/2121?sn=22161405", "https://igorchudov.substack.com/p/dramatic-decrease-in-births-in-germany?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://naturalnews.com/2021-12-10-sterilizing-entire-generation-with-covid-vaccines.html", "https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://infertilitymovie.org/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-07-06-taiwan-catastrophic-23-percent-drop-birth-rate.html&linkname=Taiwan%20witnesses%20catastrophic%2023%25%20drop%20in%20birth%20rate%20in%20May%20of%202022%2C%20as%20global%20depopulation%20schemes%20take%20effect", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}