{"result_id": "110021", "URL": "https://eugenics.news/2023-01-30-covid-vaccine-spike-proteins-invade-all-organs.html", "timestamp": "2023-04-25 15:04:09 CEST+0200", "meta": {"description": "French researchers are warning that covid “vaccine” spike proteins invade all major organs of the body and proceed to hyper-accelerate cellular aging, resulting in early death. Citing a paper out of China, the researchers, who published their findings in the French newspaper France Soir, explained that biological aging goes into hyperdrive upon exposure to jab […]", "lang": "en", "keywords": "aging,badhealth,badmedicine,Censored Science,chemical violence,COVID,death,depopulation,medical violence,mRNA,spike proteins,vaccine,vaccine damge,vaccine death,vaccine injury,vaccine wars,vaccines,vital organs", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2023-01-30-covid-vaccine-spike-proteins-invade-all-organs.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Covid jab spike proteins invade “all major organs,” accelerate cellular aging", "cleaned_text": "French researchers are warning that covid “vaccine” spike proteins invade all major organs of the body and proceed to hyper-accelerate cellular aging, resulting in early death.\n\nCiting a paper out of China, the researchers, who published their findings in the French newspaper France Soir, explained that biological aging goes into hyperdrive upon exposure to jab spike proteins, which shorten DNA sequences known as telomeres, which protect the ends of chromosomes.\n\nIn guinea pigs given mRNA injections, the animals’ endothelial function was impaired by spike protein exposure. In humans, the same outcome was observed when the experiment was replicated.\n\n“The [Chinese research] team reproduced the in vitro experiment on healthy human endothelial cells: the spike protein thus bound to ACE2 receptors, damaging the cells’ mitochondria, causing micro-thrombosis and endotheliitis,” reads an English translation of the French article.\n\nWhile the spike proteins used in the experiment did not come from one of the currently available covid injections, the team further wrote that there is no reason to believe that those from the shots behave any differently after being dispensed inside the body.\n\n“If it is proven that SARS-CoV2 induces accelerated cellular aging, and that the [thing] responsible for this senescence is none other than the Spike protein, how can we be absolutely certain that the vaccines currently on the market, all based on Spike, do not also lead to the accelerated degradation of the cells of vaccinated persons?”\n\nOne of the paper’s co-authors is none other than Nobel Prize laureate and virologist Luc Montagnier, who has been delving deep into the connection between covid and covid jabs, and shortened telomeres and oxidative stress.\n\nNumerous papers have identified strong links between covid infections and shortened telomeres, which lead to rapid cellular biological aging. Covid shots do the same thing by triggering oxidative stress and inflammation, which further accelerates the aging process by damaging DNA and RNA building blocks known as guanines.\n\n“Indeed, with aging, telomeres deteriorate and affect cell reproduction,” the new study covering all this reads. “SARS-CoV2 is thought to cause biological age aging or accelerated biological age through increased telomere shortening.”\n\n“The question that can legitimately be asked is the following: isn’t the spike protein active in vaccines (Pfizer, Moderna, etc.) by soliciting / blocking the ACE2 receptor likely to inhibit the beneficial function of protecting telomeres and thus also activate aging?”\n\nThose who contract what they are calling “covid” already suffered advanced biological aging. Those who then get the shot(s) accelerate that process further by sending another blast of spike proteins and other poisons from the vial(s) into their arms.\n\n“By letting the [covid] disease progress beyond the first days and by using vaccines as the only solution, there is a risk that we will lead to a reduction in the lifespan of both adults and children,” the study further explains.\n\n“Given the desire to vaccinate children who are not affected by SARS-CoV-2, the remedy should not be worse than the disease.”\n\nResearcher Walter M. Chesnut came up with a name for this phenomenon: Spike Protein Endothelial Disease, or SPED. This refers to the spike proteins that are “delivered” to all vital organs in the body via the endothelium, which then induces systemic nonsense mRNA translations resulting in hyper-accelerated aging.\n\n“The spike protein, in essence, acts as a progeria drug,” Chesnut wrote in a Substack post that he also tweeted.\n\nThe latest news coverage about dangerous and ineffective covid shots can be found at ChemicalViolence.com.", "opengraph": {"title": "Covid jab spike proteins invade “all major organs,” accelerate cellular aging", "type": "article", "url": "https://www.eugenics.news/2023-01-30-covid-vaccine-spike-proteins-invade-all-organs.html", "site_name": "Eugenics News", "description": "French researchers are warning that covid “vaccine” spike proteins invade all major organs of the body and proceed to hyper-accelerate cellular aging, resulting in early death. Citing a paper out of China, the researchers, who published their findings in the French newspaper France Soir, explained that biological aging goes into hyperdrive upon exposure to jab […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/01/Covid-vaccine-world.jpg"}, "tags": ["vaccine wars", "death", "COVID", "spike proteins", "medical violence", "aging", "vaccine", "vaccine death", "vaccine injury", "depopulation", "vaccines", "vaccine damge", "chemical violence", "Censored Science", "mRNA", "vital organs"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2021-06-09-mikovits-covid-vaccine-spike-protein-injections-kill.html", "https://naturalnews.com/2021-06-09-mikovits-covid-vaccine-spike-protein-injections-kill.html", "http://chemicalviolence.com", "https://www.newswars.com/bombshell-report-spike-proteins-invade-all-major-organs-induce-hyperaccelerated-cellular-aging-prompting-shorter-lifespan/", "https://naturalnews.com/2021-06-09-mikovits-covid-vaccine-spike-protein-injections-kill.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-01-30-covid-vaccine-spike-proteins-invade-all-organs.html&linkname=Covid%20jab%20spike%20proteins%20invade%20%E2%80%9Call%20major%20organs%2C%E2%80%9D%20accelerate%20cellular%20aging", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}