{"result_id": "110019", "URL": "https://eugenics.news/2022-03-28-how-long-until-nuremberg-style-murder-trials-scientists-moderna-pfizer-jj.html", "timestamp": "2023-04-25 15:04:08 CEST+0200", "meta": {"description": "The CDC has become a “purely political organization,” says Dr. Robert Malone, one of the creators of mRNA injections, as they are the ones spreading medical misinformation and hiding critical data from physicians, scientists, health authorities and the American public. This misinformation constitutes fraud and is criminal. Also, according to Dr. Robert Malone, regarding the […]", "lang": "en", "keywords": "covid pandemic,crimes against humanity,depopulation,ethnic cleansing,eugenics,genocide,mass murder,Medical genocide,medical murder,murder,nuremberg,vaccine death,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-03-28-how-long-until-nuremberg-style-murder-trials-scientists-moderna-pfizer-jj.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "HOW LONG until the world launches “Nuremberg” style murder trials for the evil scientists at Moderna, Pfizer, and J&J who created the deadly Covid jabs? (op-ed)", "cleaned_text": "HOW LONG until the world launches “Nuremberg” style murder trials for the evil scientists at Moderna, Pfizer, and J&J who created the deadly Covid jabs? (op-ed)\n\nThe CDC has become a “purely political organization,” says Dr. Robert Malone, one of the creators of mRNA injections, as they are the ones spreading medical misinformation and hiding critical data from physicians, scientists, health authorities and the American public. This misinformation constitutes fraud and is criminal. Also, according to Dr. Robert Malone, regarding the CDC government employees hiding crucial data that reveals what he and other prominent doctors have been exposing for two years now, “There are going to be legal consequences, and I believe they have a choice. These government employees have been participating in hiding this data. They can either be defendants or they can be witnesses.”\n\nToday, we have reached a point where many Americans serving leadership roles in different realms appear guilty of medical fascism and promoting deadly, blood-clotting, gene therapy injections that are responsible for countless grave injuries and thousands (if not millions) of deaths of American citizens.\n\nNuremberg-style murder trials may be coming for the scientists, government employees, media journo-terrorists who have knowingly pushed deadly Covid jab propaganda\n\nAfter World War II, the Allies held the Nuremberg trials for the leadership of Nazi Germany, which included surviving members from different areas, including political, military, judicial, science, medical and economic. Hitler’s army of yes-men were guilty of mass murder and participating in genocidal warfare, and were tried as such. Just because they were “taking orders” from higher-ups did not make them innocent of these horrific crimes.\n\nThe same could be said today about certain government officials at regulatory agencies, in all branches of government, journalists, scientists, physicians and even the billionaires funding and pushing “vaccine” propaganda that’s responsible for millions of deaths across the globe, not just in the United States.\n\nDuring the Nazi regime’s attempted takeover of the world, very few people knew what was REALLY going on in the concentration camps. Hitler was using medical experiments and deadly gas to exterminate millions of innocent people he deemed were a burden on society and the economy. It was eugenics. It was mass murder. It was genocide. And it was all done under a canopy of greed, lust for power and psychotic plans to reduce the population of the world dramatically. However, many of the people near the top knew what was going on, and they went along with it anyway, disregarding the consequences they would face later when put on trial for mass murder.\n\nToday, most people have no clue that the Covid “vaccines” are the new population reduction mechanism, changing the genes of humans to create toxic prions and nanobots in the blood that are already wiping out humans who are a “drain” on the system–those who are already suffering from chronic diseases and disorders, like cancer, diabetes, heart disease, obesity and dementia.\n\nIt’s just a matter of time before enough humans die from the Covid jabs and the guilty perpetrators are indicted for their crimes\n\nAccording to the “Corona Investigative Committee,” there is already compelling evidence that the so-called “vaccines” for Covid are designed to intentionally kill people. This would constitute premeditative murder, and lawyers in India have already filed complaints in this regard. Even perfectly healthy people are already suffering from the deadly effects, labeled “side effects,” of the Fauci Flu jabs, including blood clots, myocarditis and severe neurological disorders. This is just the beginning, and that’s why it’s so hard for the general populace to “see the forest for the trees.”\n\nThe CDC is lying. The FDA is lying. The scientists who created these deadly vaccines are lying. There are even key whistleblowers from the “inside” already who helped create the eugenics injections (mRNA), like Dr. Robert Malone, trying to warn the world of this mass population reduction scheme.\n\nThe Covid-19 vaccines are not “safe and effective,” in fact, they’re just the opposite, dangerous and deadly. They are mass experiments that contain lethal doses of poison. Just because they don’t kill people instantly, like the gas chambers of WWII, doesn’t mean they’re not deadly weapons of mass destruction.\n\nNow, it’s coming out that death statistics from the “vaccines” can be traced back to specific batches, as some are more lethal than others. Even airline pilots, elite athletes and military members are dropping like flies after getting the prion injections from Pfizer, Moderna and J&J. The next round of “Nuremberg” trials are coming soon for the people who are pushing these shots (pardon the pun). The only question is what legal structure will be used for the upcoming court hearings, and what media platforms will show the world what’s happening?\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental scamdemic Covid “vaccines” and “boosters” that cause blood clots and other horrific side effects.", "opengraph": {"title": "HOW LONG until the world launches “Nuremberg” style murder trials for the evil scientists at Moderna, Pfizer, and J&J who created the deadly Covid jabs? (op-ed)", "type": "article", "url": "https://www.eugenics.news/2022-03-28-how-long-until-nuremberg-style-murder-trials-scientists-moderna-pfizer-jj.html", "site_name": "Eugenics News", "description": "The CDC has become a “purely political organization,” says Dr. Robert Malone, one of the creators of mRNA injections, as they are the ones spreading medical misinformation and hiding critical data from physicians, scientists, health authorities and the American public. This misinformation constitutes fraud and is criminal. Also, according to Dr. Robert Malone, regarding the […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/03/Coronavirus-DNA-Science.jpg"}, "tags": ["nuremberg", "crimes against humanity", "Medical genocide", "murder", "medical murder", "mass murder", "covid pandemic", "vaccine injury", "eugenics", "genocide", "depopulation", "vaccine death", "ethnic cleansing"], "tweets": [], "movies": [], "links": ["https://citizenfreepress.com/breaking/strong-words-from-dr-malone/", "https://naturalnews.com/2021-12-07-holocaust-eu-abolish-nuremberg-code-medical-fascism.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.naturalnews.com/2022-02-09-pfizer-profiteering-from-covid-clot-shots-destroy-lives.html", "https://dailyexpose.uk/2021/12/24/nano-technology-in-covid-injections-its-for-communications-its-technological-parasitism/", "https://naturalnews.com/2022-01-25-covid-vaccines-are-permanently-damaging-children.html", "https://naturalnews.com/2022-01-24-reiner-fullmich-vaccines-designed-kill-depopulate-planet.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://citizenfreepress.com/breaking/naomi-wolf-fauci-wallensky-collins-this-could-be-conspiracy-for-murder/", "https://dailyexpose.uk/2021/12/24/nano-technology-in-covid-injections-its-for-communications-its-technological-parasitism/", "https://naturalnews.com/2022-01-24-reiner-fullmich-vaccines-designed-kill-depopulate-planet.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-03-28-how-long-until-nuremberg-style-murder-trials-scientists-moderna-pfizer-jj.html&linkname=HOW%20LONG%20until%20the%20world%20launches%20%E2%80%9CNuremberg%E2%80%9D%20style%20murder%20trials%20for%20the%20evil%20scientists%20at%20Moderna%2C%20Pfizer%2C%20and%20J%26J%20who%20created%20the%20deadly%20Covid%20jabs%3F%20%28op-ed%29", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}