{"result_id": "110002", "URL": "https://eugenics.news/2022-09-12-cdc-half-babies-systemic-reaction-covid-vaccination.html", "timestamp": "2023-04-25 15:03:54 CEST+0200", "meta": {"description": "New data from the U.S. Centers for Disease Control and Prevention (CDC) suggests that 55 percent of children between the ages of six months and two years suffer a “systemic reaction” after getting their first dose of an mRNA (messenger RNA) “vaccine” from either Pfizer-BioNTech or Moderna. Following the second dose, the CDC survey found, […]", "lang": "en", "keywords": "babies,badhealth,badmedicine,CDC,chemcial violence,children's health,COVID,disease causes,health impacts,Immunizations,medical violence,Plandemic,survey,systemic reaction,toddlers,vaccination,vaccine reaction,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-09-12-cdc-half-babies-systemic-reaction-covid-vaccination.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "CDC survey finds that more than half of all babies, toddlers suffer a “systemic reaction” following covid injection", "cleaned_text": "CDC survey finds that more than half of all babies, toddlers suffer a “systemic reaction” following covid injection\n\nNew data from the U.S. Centers for Disease Control and Prevention (CDC) suggests that 55 percent of children between the ages of six months and two years suffer a “systemic reaction” after getting their first dose of an mRNA (messenger RNA) “vaccine” from either Pfizer-BioNTech or Moderna.\n\nFollowing the second dose, the CDC survey found, a whopping 60 percent of children suffer some kind of negative reaction. This is based on an assessment of more than 13,000 children who were evaluated as part of a post-market analysis.\n\n“A system reaction is a response beyond the injection site,” reported Margaret Menge from The Epoch Times.\n\n“While the most common systemic reactions were fatigue, fever, irritability, and crying, parents of more than 6 percent of the children in the study said their child was unable to perform normal activities after the second dose of either the Pfizer-BioNTech or Moderna vaccine.”\n\nThe CDC collected this data between July 18 and August 21 of this year using a smartphone-based monitoring app called V-Safe. Parents can download the app and track the health of their children post-injection. (Related: Christine Grady, Tony Fauci’s wife, played a major role in unleashing Chinese Virus injections on children and babies.)\n\nParents of 8,338 children ranging in age from six months to two years who received the Moderna shot reported a 55.7 percent systemic reaction rate following the first dose, and a 58 percent systemic reaction rate following the second dose.\n\nParents of Pfizer-injected children, which numbered at 4,749, reported a 55.8 percent systemic reaction rate following the first dose, and a 47 percent systemic reaction rate following the second dose.\n\nThese are astounding figures that suggest the shots harm children more often than not while providing minimal, if any, benefits.\n\n“The most frequently reported reactions for children 6 months to 2 years were irritability or crying, sleepiness, and fever,” Menge explained. “The most common reactions for children aged 3 to 5 years were injection site pain, fatigue, and fever.”\n\nOne in 10 children between six months and two years of age suffers a more serious “health impact” post-mRNA injection\n\nA special section of the CDC survey also looked at more serious health reactions, which were dubbed “any health impact.” Amazingly, about 10 percent of children in the six month-to-two years age demographic suffered a “health impact” after their first dose of either Pfizer or Moderna.\n\nOnce again, the injury rate after the second injection was slightly worse for Moderna’s shot than for Pfizer’s shot, possibly because the Moderna shot contains a higher dose of mRNA chemicals.\n\nThe data was released on September 1 before the CDC’s Advisory Committee on Immunization Practices (ACIP), which is supposed to be keeping track of this kind of stuff for guidance purposes.\n\nAlso presented before ACIP was data collected from the government’s official Vaccine Adverse Event Reporting System (VAERS), as well as data from several large health maintenance organizations across the United States.\n\nDespite a profusion of evidence to the contrary, CDC vaccine safety team head Tom Shimabukuro claimed before the committee that there are no “statistical signals” to suggest that the injections are in any way unsafe for children. Parents, he suggested, should still line their children up for whatever shots the government tells them to get.\n\n“What are these parents thinking?” asked a commenter at the Times about parents who choose to inject their children for covid. “I guess some people still think the government would never kill anyone with a vaccine on purpose. This has gone too far.”\n\n“Parents aren’t thinking – that’s the problem,” responded someone else. “They are afraid to question the government or the media propaganda.”\n\nTo learn more about the dangers and ineffectiveness of Fauci Flu shots, visit ChemicalViolence.com.", "opengraph": {"title": "CDC survey finds that more than half of all babies, toddlers suffer a “systemic reaction” following covid injection", "type": "article", "url": "https://www.eugenics.news/2022-09-12-cdc-half-babies-systemic-reaction-covid-vaccination.html", "site_name": "Eugenics News", "description": "New data from the U.S. Centers for Disease Control and Prevention (CDC) suggests that 55 percent of children between the ages of six months and two years suffer a “systemic reaction” after getting their first dose of an mRNA (messenger RNA) “vaccine” from either Pfizer-BioNTech or Moderna. Following the second dose, the CDC survey found, […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/09/Child-Vaccine-Shop-Baby-Doctor-Nurse.jpg"}, "tags": ["babies", "vaccination", "toddlers", "Immunizations", "COVID", "survey", "medical violence", "vaccine reaction", "disease causes", "chemcial violence", "vaccines", "children's health", "health impacts", "Plandemic", "systemic reaction", "CDC"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/more-than-half-of-babies-toddlers-surveyed-had-systemic-reaction-after-covid-19-vaccine_4707948.html", "https://naturalnews.com/2022-07-29-fauci-wife-christine-children-enrolled-covid-vaccine-trials.html", "http://chemicalviolence.com", "https://www.theepochtimes.com/more-than-half-of-babies-toddlers-surveyed-had-systemic-reaction-after-covid-19-vaccine_4707948.html", "https://naturalnews.com/2022-07-29-fauci-wife-christine-children-enrolled-covid-vaccine-trials.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-09-12-cdc-half-babies-systemic-reaction-covid-vaccination.html&linkname=CDC%20survey%20finds%20that%20more%20than%20half%20of%20all%20babies%2C%20toddlers%20suffer%20a%20%E2%80%9Csystemic%20reaction%E2%80%9D%20following%20covid%20injection", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}