{"result_id": "110018", "URL": "https://www.eugenics.news/2023-01-02-if-covid-jabs-save-lives-why-excess-death-spike-globally.html", "timestamp": "2023-04-25 15:04:05 CEST+0200", "meta": {"description": "Governments around the world are reporting excess deaths in 2021 and 2022. These excess deaths are astronomical compared to 2020, when an alleged pandemic was taking place. Between the United States, Canada, Australia, the UK, New Zealand, Australia, and most of Europe, there have been a staggering 1.8 million excess deaths since the launch of […]", "lang": "en", "keywords": "badhealth,badmedicine,Censored Science,death by medicine,death stats,depopulation,Euromomo,excess deaths,false savior,global depopulation,manipulation,mass death,medical establishment,medical fraud,Medical Tyranny,pharmaceutical fraud,population control,science deception,vaccine death,Vaccine deaths,vaccine terror,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.eugenics.news/2023-01-02-if-covid-jabs-save-lives-why-excess-death-spike-globally.html", "encoding": "UTF-8"}, "image": null, "domain": "www.eugenics.news", "title": "If the covid jab is a “lifesaving vaccine,” why did excess death spike globally in 2021 and 2022?", "cleaned_text": "If the covid jab is a “lifesaving vaccine,” why did excess death spike globally in 2021 and 2022?\n\nGovernments around the world are reporting excess deaths in 2021 and 2022. These excess deaths are astronomical compared to 2020, when an alleged pandemic was taking place. Between the United States, Canada, Australia, the UK, New Zealand, Australia, and most of Europe, there have been a staggering 1.8 million excess deaths since the launch of the “lifesaving” covid-19 vaccine. How can public health officials continue to call the covid-19 vaccines “lifesaving” when excess deaths continue to spike year after year?\n\nAfter covid vaccine launch, at least 1.8 million excess deaths were recorded in the US, Europe, Canada, Australia, and New Zealand\n\nThe mortality data was received from two organizations that collect death statistics from individual governments. The first, the Organization for Economic Co-Operation and Development (OECD), released data on excess deaths across 15 percent of the countries in the world. The OECD is an intergovernmental organization that includes 38 member countries. It was founded in 1961 to promote world trade and economic progress around the world. The second organization is the EuroMOMO, a European mortality project that tracks death statistics across Europe. The data provided to these organizations comes directly from the governments of each country. For example, in the US, the Centers for Disease Control provides the mortality statistics to OECD.\n\nTo determine excess deaths, the mortality statistics of 2021 and 2022 were compared respectively to the average deaths in the years 2015-2019. In the United States, there were roughly 700,000 excess deaths in 2021 and an additional 360,000 excess deaths by week 40 of 2022. Across 28 countries in Europe, there were roughly 382,000 excess deaths in 2021 and 309,000 excess deaths by week 46 of 2022. These statistics do not include Ukraine and the fatalities of the war that is going on there.\n\nIn Australia, there was 1,303 excess deaths in 2020, during the “worst pandemic in 100 years.” Strangely enough, Australia’s excess deaths jumped by 747 percent in 2021, when a “lifesaving” vaccine had already been rolled out. The 11,042 excess deaths in 2021 made the pandemic of 2020 seem trivial in comparison. Even worse, by the end of July 2022, Australia recorded more excess death in seven months than the previous two years combined. The country suffered from 18,973 excess deaths in the first seven months of 2022!\n\nAccording to the OECD database, there were over 1 million excess deaths between Jan 1, 2021 and week 40 of 2022 in the United States alone. According to EuroMOMO, there were 690,000 excess deaths across 28 European countries, beginning in 2021 and ending week 46 of 2022. When these excess deaths are combined Canada’s 54,176 excess deaths and Australia and New Zealand’s 36,710 excess deaths, that’s at least 1.8 million excess deaths in a little over a year and a half!\n\nUnvaccinated less likely to die in official government statistics, pointing to a likely culprit behind the mass population die-off\n\nThe global public health emergency that was declared in 2020 is nothing compared to the current state of excess death that is taking place all around the world. As planned, using medical fraud and propaganda, the medical establishment knew exactly why people were dying in 2020, and this fear was used to subjugate and manipulate people into sacrificing their lives for an experiment that was advertised as a savior. Strangely enough, the medical establishment is now mum on the official cause for the continued and increasing die-off in 2021 and 2022.\n\nAccording to the UK’s Office for National Statistics, between January and May of 2022, the unvaccinated were the least likely to die in England, whether they were compared to the single vaccinated cohort or the double vaccinated cohort. In most instances, the unvaccinated were also least likely to die when compared to the triple vaccinated (which is a smaller percentage of the population to begin with). The greater survival rates for the unvaccinated held true over the first five months of 2022. The statistical trends were true across each age group as well, from 18- to 90-year-olds. This data is evidence that the covid-19 vaccines are the greatest driving force for the excess mortality being recorded globally. It’s time for governments and medical authorities to take a cold, hard look at how the covid-19 vaccine and the effects of medical tyranny may be driving depopulation on a global scale.", "opengraph": {"title": "If the covid jab is a “lifesaving vaccine,” why did excess death spike globally in 2021 and 2022?", "type": "article", "url": "https://www.eugenics.news/2023-01-02-if-covid-jabs-save-lives-why-excess-death-spike-globally.html", "site_name": "Eugenics News", "description": "Governments around the world are reporting excess deaths in 2021 and 2022. These excess deaths are astronomical compared to 2020, when an alleged pandemic was taking place. Between the United States, Canada, Australia, the UK, New Zealand, Australia, and most of Europe, there have been a staggering 1.8 million excess deaths since the launch of […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/01/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["manipulation", "medical fraud", "false savior", "vaccine terror", "Censored Science", "science deception", "mass death", "medical establishment", "vaccine wars", "death by medicine", "depopulation", "Medical Tyranny", "population control", "global depopulation", "excess deaths", "Vaccine deaths", "death stats", "Euromomo", "vaccines", "vaccine death", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/12/21/gov-pfizer-reports-depopulation-covid-vaccine/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "http://vaccines.news", "https://expose-news.com/2022/12/21/gov-pfizer-reports-depopulation-covid-vaccine/", "https://stats.oecd.org/index.aspx?queryid=104676", "https://www.euromomo.eu/graphs-and-maps", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/deathsbyvaccinationstatusengland", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-01-02-if-covid-jabs-save-lives-why-excess-death-spike-globally.html&linkname=If%20the%20covid%20jab%20is%20a%20%E2%80%9Clifesaving%20vaccine%2C%E2%80%9D%20why%20did%20excess%20death%20spike%20globally%20in%202021%20and%202022%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}