{"result_id": "110011", "URL": "https://eugenics.news/2022-08-16-top-8-admissions-cdc-fda-fauci-immunologists-about-covid-19-vaccines.html", "timestamp": "2023-04-25 15:04:00 CEST+0200", "meta": {"description": "No officials from the FDA, CDC, scientists, or media “doctors” ever said (admitted) that the COVID-19 vaccine would NOT remain at the injection site in the deltoid muscle. Not a single word about it. Come to find out, this was blatant misinformation. In fact, this is the premise of all the highly toxic COVID-19 so-called […]", "lang": "en", "keywords": "abortion,biomedical warfare,bioweapons,cdc lies,clot shots,conspiracy,deception,depopulation,fda lies,health freedom,lies,medical experiment,medical violence,pharma lies,prions,spike protein,vaccine damage,Vaccine dangers,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-08-16-top-8-admissions-cdc-fda-fauci-immunologists-about-covid-19-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Top 8 GUILTY ADMISSIONS by the CDC, FDA, Fauci, top immunologists about how ineffective, experimental and unsafe COVID-19 “vaccines” really are", "cleaned_text": "Top 8 GUILTY ADMISSIONS by the CDC, FDA, Fauci, top immunologists about how ineffective, experimental and unsafe COVID-19 “vaccines” really are\n\nNo officials from the FDA, CDC, scientists, or media “doctors” ever said (admitted) that the COVID-19 vaccine would NOT remain at the injection site in the deltoid muscle. Not a single word about it. Come to find out, this was blatant misinformation. In fact, this is the premise of all the highly toxic COVID-19 so-called “vaccines” and the truth is out. The nanoparticles are known to get distributed THROUGHOUT the entire body, and according to research from two in-depth studies, for women, those lipid nanoparticles (cargo of the messenger RNA) concentrate in the ovaries. This all happens within 48 hours, according to unveiled documents and scientific research.\n\nOnce internal documents like these are revealed, usually thanks to the Freedom of Information Act, pharma gurus and regulatory agency heads often “come out of the closet” and admit at least some of the truth to the public. Now we know. All of the human organs, including vital cleansing organs and reproductive organs, are exposed to toxic substances that can have catastrophic effects on function and fertility. These toxic particles stick to adrenal glands and vital organs, including the spleen, ovaries, liver and more.\n\nIt should come as no surprise to those well-aware of the pharmaceutical industrial complex’s long history of corruption and scandals that they knew of this unequivocal science-based evidence before the “vaccines” were ever administered to the populace.\n\nDuring clinical trials, severe adverse effects and deaths mounted to nearly 50% for pregnant women who received these toxic nanoparticle jabs\n\n“A high local accumulation of nanoparticles, nanocapsules and nanoemulsions in specific locations of the ovaries was found in all animals,” read the report that the pharmaceutical industry buried. They all knew for years that the mRNA injections and the protein payload injections leave the injection site and spread throughout the entire body using the vascular system as its roadways and spike protein “technology” as the Trojan horse to enter cells and change human DNA forever.\n\nWake up and smell the nanoparticles. Obviously, these sticky spike protein nanoparticles, also known as prions, can cause myocarditis, pericarditis, strokes, cancer and abortions. In other words, the COVID-19 vaccines are population reduction mechanisms and part of a secret biomedical terrorism campaign waged around the world. It’s no conspiracy theory when the proof comes out from internal documents that completely counter the narrative LIE we’ve all heard over and over.\n\nThis is Pandora’s box. This is just the tip of the iceberg. Now that we KNOW 100 percent for sure that the spike protein toxins leave the injection site and spread throughout the body, harming all vital systems, we also know about many other avenues of misinformation spread by the FDA, CDC, Fauci, Walensky and other pharma shills and charlatans.\n\nTop 8 ADMISSIONS of GUILT by the CDC, FDA, Fauci, and top immunologists about COVID-19 vaccine dangers\n\n#1. CDC Director Rochelle Walensky admitted the vaccines “will not stop transmission of the virus” (August 2021)\n\n#2. Fauci admits vaccines do NOT protect against infection: “I knew these vaccines were not going to protect against infection and I think we overplayed the vaccines”\n\n#3. Fauci admits the jabs DO cause menstrual irregularities, including major adverse effects for women of reproductive age\n\n#5. “Gain of function” research on bat viruses was (partially) funded by Fauci and kept secret for years\n\n#6. SARS-CoV-2 virus has NEVER been isolated or purified to confirm the actual virus’s existence\n\n#7. FDA makes J&J include blood clot risk warning on their single-dose COVID-19 jabs after CDC lifts suspension\n\n#8. Fauci and Biden catch COVID after being triple and quadruple vaxxed against it\n\nSo there you have it. The truth comes out thanks to truth media and the Freedom of Information Act. Remember to bookmark Vaccines.news to your favorite independent websites for updates on experimental “vaccines” that cause blood clots, myocarditis and severe, chronic inflammation.", "opengraph": {"title": "Top 8 GUILTY ADMISSIONS by the CDC, FDA, Fauci, top immunologists about how ineffective, experimental and unsafe COVID-19 “vaccines” really are", "type": "article", "url": "https://www.eugenics.news/2022-08-16-top-8-admissions-cdc-fda-fauci-immunologists-about-covid-19-vaccines.html", "site_name": "Eugenics News", "description": "No officials from the FDA, CDC, scientists, or media “doctors” ever said (admitted) that the COVID-19 vaccine would NOT remain at the injection site in the deltoid muscle. Not a single word about it. Come to find out, this was blatant misinformation. In fact, this is the premise of all the highly toxic COVID-19 so-called […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/08/Dna-Gmo-Enzyme-Biopharmaceutical-Pencil-Chemical-Medical.jpg"}, "tags": ["conspiracy", "deception", "medical violence", "lies", "bioweapons", "prions", "women's health", "medical experiment", "spike protein", "pharma lies", "Vaccine dangers", "cdc lies", "clot shots", "fda lies", "biomedical warfare", "depopulation", "abortion", "health freedom", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/what-ive-seen-in-the-last-two-years-is-unprecedented-physician-on-covid-vaccine-side-effects-on-pregnant-women_4428291.html", "http://vital organs,", "https://www.stardem.com/news/national/cdc-covid-vaccines-won-t-stop-transmission-fully-vaccinated-can-still-get-spread-delta-strain/article_5f83d0cb-8b0a-535d-bbad-3f571754e5ae.html", "https://www.zerohedge.com/covid-19/doctors-criticize-fauci-saying-covid-vaccines-induce-temporary-menstrual-irregularities", "https://naturalnews.com/2022-08-05-congress-not-allowed-to-know-secret-research.html", "https://naturalnews.com/2021-08-11-covid-does-not-exist-novel-isolated-virus.html", "https://naturalnews.com/2021-05-13-fda-add-blood-clot-warning-jnj-vaccine.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.stardem.com/news/national/cdc-covid-vaccines-won-t-stop-transmission-fully-vaccinated-can-still-get-spread-delta-strain/article_5f83d0cb-8b0a-535d-bbad-3f571754e5ae.html", "https://www.zerohedge.com/covid-19/doctors-criticize-fauci-saying-covid-vaccines-induce-temporary-menstrual-irregularities", "https://naturalnews.com/2021-05-13-fda-add-blood-clot-warning-jnj-vaccine.html", "https://www.theepochtimes.com/what-ive-seen-in-the-last-two-years-is-unprecedented-physician-on-covid-vaccine-side-effects-on-pregnant-women_4428291.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-08-16-top-8-admissions-cdc-fda-fauci-immunologists-about-covid-19-vaccines.html&linkname=Top%208%20GUILTY%20ADMISSIONS%20by%20the%20CDC%2C%20FDA%2C%20Fauci%2C%20top%20immunologists%20about%20how%20ineffective%2C%20experimental%20and%20unsafe%20COVID-19%20%E2%80%9Cvaccines%E2%80%9D%20really%20are", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}