{"result_id": "110036", "URL": "https://eugenics.news/2023-01-12-globalist-lefts-net-zero-emissions-agenda-will-destroy-modern-civilization.html", "timestamp": "2023-04-25 15:04:19 CEST+0200", "meta": {"description": "A top scientist is revealing the end game for the world’s left-wing, authoritarian globalist elite: To turn the entire planet into billions of slaves serving only them by destroying modern civilization under the false guise of controlling “climate change.” In a recently published paper, Dr. Wallace Manheimer, a renowned nuclear physicist, ripped the globalist left’s “Net […]", "lang": "en", "keywords": "carbon dioxide,civilization,Climate,climate alarmism,climate change,climate change hoax,climate hoax,climate science,Collapse,control,depopulation,electricity,environment,eugenics,Fact Check,fossil fuels,fuel supply,genocide,green tyranny,left cult,media fact check,modern civilization,Modern Society,nuclear power,power,power grid,propaganda,scientific,solar power,suppressed,Wallace Manheimer,wind power", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2023-01-12-globalist-lefts-net-zero-emissions-agenda-will-destroy-modern-civilization.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Top scientist says globalist left’s ‘net zero’ emissions agenda will destroy modern civilization", "cleaned_text": "A top scientist is revealing the end game for the world’s left-wing, authoritarian globalist elite: To turn the entire planet into billions of slaves serving only them by destroying modern civilization under the false guise of controlling “climate change.”\n\nIn a recently published paper, Dr. Wallace Manheimer, a renowned nuclear physicist, ripped the globalist left’s “Net Zero” climate emissions plan as a sure-fire way to reverse more than a hundred years worth of technical accomplishment and progress in terms of creating a better way of life for most humans.\n\nIn an abstract of the paper, Manheimer notes that the climate is changing and always has changed, but there is no “climate crisis” and little, if any, of the changes have to do with modern life.\n\n“The emphasis on a false climate crisis is becoming a tragedy for modern civilization, which depends on reliable, economic, and environmentally viable energy. The windmills, solar panels and backup batteries have none if these qualities,” the abstract says.\n\n“This falsehood is pushed by a powerful lobby which Bjorn Lomborg has called a climate industrial complex, comprising some scientists, most media, industrialists, and legislators. It has somehow managed to convince many that CO in the atmosphere, a gas necessary for life on earth, one which we exhale with every breath, is an environmental poison,” the summary continues.\n\n“Multiple scientific theories and measurements show that there is no climate crisis. Radiation forcing calculations by both skeptics and believers show that the carbon dioxide radiation forcing is about 0.3% of the incident radiation, far less than other effects on climate,” it adds.\n\n“Over the period of human civilization, the temperature has oscillated between quite a few warm and cold periods, with many of the warm periods being warmer than today. During geological times, it and the carbon dioxide level have been all over the place with no correlation between them,” the abstract noted further.\n\nIn the paper, he argues that an overreliance on ‘green’ energy sources like wind and solar is a path to ruin and failure, as we’ve already begun to see in Germany after sanctions cut off Russian fossil fuels following Moscow’s invasion of Ukraine, forcing the country to re-start coal- and other power plants.\n\n“Not only will this new infrastructure fail, but will cost trillions, trash large portions of the environment, and be entirely unnecessary,” he warns, adding that the stakes for the salvation of modern life for all of humanity “are enormous.”\n\nDr. Manheimer holds a physics PhD from MIT and has had a 50-year career in nuclear research. His work includes research at the Plasma Physics Division at the U.S. Naval Research Laboratory.\n\nManheimer has published over 150 scientific papers. In his view, there is “certainly no scientific basis” for expecting a climate crisis from too much carbon dioxide in the atmosphere in the next century or so. He argues that there is no reason why civilization cannot advance using both fossil fuel power and nuclear power. Manheimer says the efforts should then focus on gradually shifting to more nuclear power.\n\nWhile spent nuclear fuel does present transfer and storage issues, the fact is nuclear plants generate a huge amount of power and are completely emissions-free. Plus, they are far more reliable than wind and solar power, each of which literally depend on the weather in order to operate at capacity. What’s more, it takes far less land and resources to build one nuclear plant that it does to erect a solar or wind farm, which takes hundreds or thousands of acres and requires constant maintenance.\n\nManheimer noted that while the use of fossil fuels has led to vast improvements in the livelihoods of billions of people, “To spread the benefits of modern civilization to the entire human family would require much more energy, as well as newer sources,” he notes.", "opengraph": {"title": "Top scientist says globalist left’s ‘net zero’ emissions agenda will destroy modern civilization", "type": "article", "url": "https://www.eugenics.news/2023-01-12-globalist-lefts-net-zero-emissions-agenda-will-destroy-modern-civilization.html", "site_name": "Eugenics News", "description": "A top scientist is revealing the end game for the world’s left-wing, authoritarian globalist elite: To turn the entire planet into billions of slaves serving only them by destroying modern civilization under the false guise of controlling “climate change.” In a recently published paper, Dr. Wallace Manheimer, a renowned nuclear physicist, ripped the globalist left’s “Net […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/01/Electrical-grid-solar-wind-power-energy.jpg"}, "tags": ["climate change", "fuel supply", "modern civilization", "left cult", "climate hoax", "media fact check", "climate science", "Modern Society", "Fact Check", "Climate", "nuclear power", "scientific", "electricity", "environment", "solar power", "carbon dioxide", "control", "propaganda", "power grid", "depopulation", "power", "wind power", "Wallace Manheimer", "suppressed", "fossil fuels", "civilization", "Collapse", "eugenics", "genocide", "climate change hoax", "green tyranny"], "tweets": [], "movies": [], "links": ["https://ccsenet.org/journal/index.php/jsd/article/view/0/47745", "https://slaynews.com/news/net-zero-agenda-will-end-modern-civilization-top-scientist-warns/", "https://slaynews.com/news/net-zero-agenda-will-end-modern-civilization-top-scientist-warns/", "https://ccsenet.org/journal/index.php/jsd/article/view/0/47745", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-01-12-globalist-lefts-net-zero-emissions-agenda-will-destroy-modern-civilization.html&linkname=Top%20scientist%20says%20globalist%20left%E2%80%99s%20%E2%80%98net%20zero%E2%80%99%20emissions%20agenda%20will%20destroy%20modern%20civilization", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}