{"result_id": "110039", "URL": "https://eugenics.news/2023-04-03-philly-joy-bank-pays-women-have-babies.html", "timestamp": "2023-04-25 15:04:21 CEST+0200", "meta": {"description": "When the Wuhan coronavirus (COVID-19) clot shots came out, several healthcare agencies advised pregnant and breastfeeding women to avoid getting the vaccine due to “no or limited data” on its effects, even warning “women of childbearing age” that “pregnancy should be excluded before vaccination.” Even the World Health Organization said, “the use of this vaccine […]", "lang": "en", "keywords": "abortions,clot shots,covid stillbirth,covid vaccines,depopulation,eugenecist,genocide,Infertility,joy bank,philadelphia stillbirths,philly,stillbirth,vaccine damage,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2023-04-03-philly-joy-bank-pays-women-have-babies.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Philly “Joy Bank” pays women to have babies while “Birthplace of America” has HIGHEST RATE of INFANT MORTALITY in America – cover for the clot shot effect?", "cleaned_text": "Philly “Joy Bank” pays women to have babies while “Birthplace of America” has HIGHEST RATE of INFANT MORTALITY in America – cover for the clot shot effect?\n\nWhen the Wuhan coronavirus (COVID-19) clot shots came out, several healthcare agencies advised pregnant and breastfeeding women to avoid getting the vaccine due to “no or limited data” on its effects, even warning “women of childbearing age” that “pregnancy should be excluded before vaccination.” Even the World Health Organization said, “the use of this vaccine [Moderna’s COVID vaccine] in pregnant women is currently not recommended unless they are at risk of high exposure.” Now, due to the highest infant mortality rates (and falling fertility rates) of any major city in the United States, Philadelphia, ironically nicknamed the “Birthplace of America,” is offering women $1,000 per month ‘with no strings attached’ just to have babies. Is this to cover up for the horrid clot-shot effect? It would appear so.\n\nPhiladelphia now paying women to get pregnant, after COVID jabs cause spontaneous abortions, miscarriages and stillbirths\n\nAccording to a study based on VAERS reports, the most frequently reported pregnancy-related adverse event from COVID clot shots was spontaneous abortion, followed by stillbirth and premature rupturing of membranes. Areas of Philly with the highest rates of low birth weights will be the first to get the free money for new pregnancies, including Cobbs Creek, Strawberry Mansion and Nicetown-Tioga.\n\nThough mainstream media and the CDC run cover for these atrocities, they’re still happening, so now the city of brotherly love has decided to pay women to get pregnant. Big bucks. At least 250 women will get the free money from their third month of pregnancy and every month after until the baby reaches age one. This is an incentive, like a game show or lottery for having babies, and the ‘pilot program’ has been named the Philly Joy Bank.\n\nThis “baby bust” is not just happening in Philadelphia, by the way, but all across America, where women are having fewer children. The mass media are blaming “changing family values,” but that’s just a cover for the clot[shot effect. Of course, the CDC and UK authorities changed their tune quickly after the jabs went “viral” and now highly recommend all pregnant women get stabbed with millions of toxic spike prions (part of the worldwide depopulation scheme). Check out the (infertility) depopulation statistics on the chart below.\n\nVaccine-induced infertility is SO BAD they now want to pay women to have babies, but what about Planned Un-Parenthood?\n\nEveryone knows by now that “Planned Parenthood” targets black women in metropolitan cities to have abortions, and that the organization was founded by Margaret Sanger, who once referred to black people as weeds. She was a eugenicist. That’s why it is so very suspect that the city of Philadelphia would pay women to have babies. It’s obviously a cover for the atrocity of low fertility rates and mass abortion caused by the coronavirus injections.\n\nPhilly’s infant mortality rate is 1.5 times higher than the national average, and BLACK BABIES are 4 times more likely to die before their very first birthday when compared to white babies. Coincidence? Remember the MMR vaccine that was shown to be killing black boys in Atlanta when Dr. William Thompson, lead scientist at the CDC at the time, blew the whistle.\n\nCities in Canada are doing the same, paying women more than $80 per month to get pregnant and have new babies. They better tell them to avoid the clot shots so the babies will survive long enough for them to be counted, huh? The same goes for the “Abundant Birth Project” in San Francisco. The Philly budget is set for $6 million for 2024. Is that because since the clot shots came out, Pennsylvania had the lowest fertility rates in 10 years? Notice that it’s mainly happening to minority babies.\n\nThe US suffers more than 5 infant deaths per every 1,000 births each year – the most of any of the 13 countries in the study, plus it also experienced over 23 maternal deaths per 100,000 births – that’s ten more than any comparable countries. Bookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections that cause infertility rates to rise so high that the government has to pay women to have babies just to cover up the genocidal atrocity.", "opengraph": {"title": "Philly “Joy Bank” pays women to have babies while “Birthplace of America” has HIGHEST RATE of INFANT MORTALITY in America – cover for the clot shot effect?", "type": "article", "url": "https://www.eugenics.news/2023-04-03-philly-joy-bank-pays-women-have-babies.html", "site_name": "Eugenics News", "description": "When the Wuhan coronavirus (COVID-19) clot shots came out, several healthcare agencies advised pregnant and breastfeeding women to avoid getting the vaccine due to “no or limited data” on its effects, even warning “women of childbearing age” that “pregnancy should be excluded before vaccination.” Even the World Health Organization said, “the use of this vaccine […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2023/04/Refuse-Vaccine-Pregnant.jpg"}, "tags": ["joy bank", "eugenecist", "covid vaccines", "clot shots", "abortions", "stillbirth", "vaccine wars", "philadelphia stillbirths", "covid stillbirth", "Infertility", "philly", "genocide", "depopulation", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["http://www.truthwiki.org/margaret-sanger-founder-of-planned-parenthood/", "https://www.dailymail.co.uk/health/article-11890655/Philadelphia-PAY-pregnant-women-1-000-month-curb-falling-fertility-rates.html", "https://naturalnews.com/2021-05-09-uk-pushing-pregnant-women-to-take-vaccine.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.dailymail.co.uk/health/article-11890655/Philadelphia-PAY-pregnant-women-1-000-month-curb-falling-fertility-rates.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2023-04-03-philly-joy-bank-pays-women-have-babies.html&linkname=Philly%20%E2%80%9CJoy%20Bank%E2%80%9D%20pays%20women%20to%20have%20babies%20while%20%E2%80%9CBirthplace%20of%20America%E2%80%9D%20has%20HIGHEST%20RATE%20of%20INFANT%20MORTALITY%20in%20America%20%E2%80%93%20cover%20for%20the%20clot%20shot%20effect%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}