{"result_id": "110027", "URL": "https://www.eugenics.news/2021-08-03-georgia-guidestones-decree-massive-population-reduction-necessary-conservation.html", "timestamp": "2023-04-25 15:04:13 CEST+0200", "meta": {"description": "Currently, the world’s population is approaching eight billion, but that number can easily be brought down to about 15 percent of that, or 500 million, if about 2 billion more doses of Covid vaccines are injected into the populace. So far, over 4 billion blood-clotting jabs have been stuck into the arms of humans, with about […]", "lang": "en", "keywords": "apocalypse,Blood clots,depopulation,eugenics,future,Globalism,Holocaust,vaccine death,Vaccine Holocaust,vaccine horror,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.eugenics.news/2021-08-03-georgia-guidestones-decree-massive-population-reduction-necessary-conservation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.eugenics.news", "title": "“Maintain humanity under 500,000,000?” Anonymous Stonehenge-like “Georgia Guidestones” decree massive population reduction necessary under the guise of “conservation”", "cleaned_text": "“Maintain humanity under 500,000,000?” Anonymous Stonehenge-like “Georgia Guidestones” decree massive population reduction necessary under the guise of “conservation”\n\nCurrently, the world’s population is approaching eight billion, but that number can easily be brought down to about 15 percent of that, or 500 million, if about 2 billion more doses of Covid vaccines are injected into the populace. So far, over 4 billion blood-clotting jabs have been stuck into the arms of humans, with about 40 million more injections happening every new day, mostly in the developed world. Several billionaires around the world support the “global reset” and have funded their “weapon of mass destruction” – the Covid vaccines that were made to supposedly combat the lab-manipulated animal viruses they’ve had scientists concoct, that garner “gain of function” ability to attack humans and spread among them.\n\nThis evil “Nazi-style” hope of reducing the world’s population by 85 percent has also become popular among people who worship the devil, money, power and control. Now it’s even carved into massive slabs of polished granite, called the Georgia “Guidestones,” where inscribed in the igneous rock are directions for rebuilding civilization after the vaccine-induced apocalypse that Bill Gates brags about at TED conferences.\n\nDid someone foresee or plan the vaccine-induced Holocaust? Genocide-worshipping Stonehenge erected in Georgia in 1980\n\nAnonymously erected in Georgia in 1980, five huge slabs of granite weighing in total about 100 tons stand tall and represent some sick hope that 85 percent of the world will die soon, thus saving the planet from sure destruction. The top “commandment” reads: “Maintain humanity under 500,000,000 in perpetual balance with nature.”\n\nThe second commandment reads: “Guide reproduction wisely improving fitness and diversity.” That fits right in line with Adolf Hitler’s creed of creating a “master race” (of only White people with blonde hair, no birth defects, and lots of muscles) while eliminating everyone else who was a “burden on society,” (meaning they cost the economy extra money to take care of) including Blacks, Jews, anyone with a handicap, and mentally challenged people, including children. This was all “for the greater good” then, just like they say Covid vaccines are now.\n\nPoster shows the “ideal man and woman” as desired by the state.\n\nPoster shows a handicapped man with no legs “who costs extra money to care for.”\n\nPoster shows a deformed or autistic child who’s a “burden on the state’s economy.”\n\nAnother of the “10 commandments” carved into the polished Georgia Guidestones tells the world to: “Avoid petty laws and useless officials,” which sounds a lot like the creed of Black Lives Matter and Antifa as they ignore laws about assaulting police, rioting, breaking and entering, theft, arson and the list goes on. Take a look for yourself in this short video of the Genocide Stonehenge.\n\n“Prophesy” of depopulation is being carried out right now using dirty, deadly Covid vaccines\n\nIf the message isn’t clear enough coming from the genocidal billionaires (it’s guessed that Ted Turner funded the “8th wonder of Georgia”) there’s even more population reductionism “commandments” on the stone structure: “Be not a cancer on the earth, leave room for nature.” So if the buffalo and deer don’t have enough room to roam, then kill off billions of humans until you get back down to 500 million, is the message there.\n\nThe far-less-than-astronomical monument stands about 20 feet high, with 5 standing pieces, each weighing about 15 tons. The commandments are inscribed in several languages, including Hebrew (probably to resemble the Ten Commandments).\n\nThis psycho-babble inscribed into rock wasn’t brought down by Moses from the top of the mountain, and it’s no mystery how it was made, or how it got to its location, since it was carved and erected in 1980 by rich depopulation freaks with technology resources and plenty of money to waste on their “secret society” wishes, or maybe it’s just some morons with extra cash and too much time on their hands, horsing around with some apocalyptic Lego-rocks.\n\nBe sure not to miss the secret ceremonies happening now all over the world, where they sacrifice millions of children at the Covid-19-Luciferianism alter with toxic Covid vaccines that cause trillions of blood clots, all in the name of “conservation.”\n\nCheck out Pandemic.news for updates on these crimes against humanity and the upcoming “Delta” and Covid “booster-vaccine” Holocaust. Also, if you know someone who already got pricked with the blood-clotting Covid inoculations, and they’re suffering from lethargy, pain, clouded thinking or an inflamed heart, that’s called CoVax Syndrome, so tell them to report it to VAERS.", "opengraph": {"title": "“Maintain humanity under 500,000,000?” Anonymous Stonehenge-like “Georgia Guidestones” decree massive population reduction necessary under the guise of “conservation”", "type": "article", "url": "https://www.eugenics.news/2021-08-03-georgia-guidestones-decree-massive-population-reduction-necessary-conservation.html", "site_name": "Eugenics News", "description": "Currently, the world’s population is approaching eight billion, but that number can easily be brought down to about 15 percent of that, or 500 million, if about 2 billion more doses of Covid vaccines are injected into the populace. So far, over 4 billion blood-clotting jabs have been stuck into the arms of humans, with about […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2021/08/Ga-stones.jpg"}, "tags": ["vaccine horror", "vaccine injury", "eugenics", "Blood clots", "depopulation", "apocalypse", "Holocaust", "vaccine death", "Vaccine Holocaust", "future", "Globalism"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/YNPpB_BRZJ8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/YNPpB_BRZJ8?feature=oembed"}], "links": ["https://www.naturalnews.com/2021-07-18-dead-injured-adverse-reactions-covid-19-shots.html", "https://www.naturalnews.com/2021-07-13-doctor-says-mrna-vaccines-kill-most-people.html", "https://www.naturalnews.com/2020-04-30-bill-gates-says-we-can-reduce-the-worlds-population-with-vaccines.html", "https://www.naturalnews.com/048735_vaccine_propaganda_nazi_science_eugenics.html", "https://www.naturalnews.com/2020-08-20-antifa-black-lives-matter-burn-down-portland-building.html", "https://www.naturalnews.com/2021-07-26-canadian-doctor-warns-worst-yet-to-come.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-06-01-zelenko-covid-vaccine-mandates-children-human-experimentation.html", "https://www.naturalnews.com/2021-06-22-permanent-lethargy-loss-of-motor-skills-common-side-effects-covid-19-vaccines.html", "https://vaers.hhs.gov/esubhelp.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-07-04-vaccinated-speeding-up-evolution-of-variants-spreading-them.html", "http://www.truthwiki.org/cdc-centers-for-disease-control-and-prevention/", "https://ourworldindata.org/covid-vaccinations?country=OWID_WRL"], "authors": [], "publish_date": null}