{"result_id": "110028", "URL": "https://eugenics.news/2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html", "timestamp": "2023-04-25 15:04:13 CEST+0200", "meta": {"description": "In anticipation of the coming Nuremberg 2.0 criminal trials that will seek the indictment of covid co-conspirators who mass murdered millions of people across the globe, Democrats are now begging for “amnesty,” hoping we will all forgive and forget what they did to the victims. The raw tyranny and authoritarian spite demonstrated by Democrats in […]", "lang": "en", "keywords": "amnesty,biowar,bioweapons,conspiracy,COVID,democrats,depopulation,forgiveness,genocide,nuremberg,pandemic,spike protein,trials,virus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://eugenics.news/2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html", "encoding": "UTF-8"}, "image": null, "domain": "eugenics.news", "title": "Democrats BEG for covid forgiveness after DESTROYING the lives of millions", "cleaned_text": "Democrats BEG for covid forgiveness after DESTROYING the lives of millions\n\nIn anticipation of the coming Nuremberg 2.0 criminal trials that will seek the indictment of covid co-conspirators who mass murdered millions of people across the globe, Democrats are now begging for “amnesty,” hoping we will all forgive and forget what they did to the victims. The raw tyranny and authoritarian spite demonstrated by Democrats in their mad push for mandatory vaccines, cruel lockdowns of children and the economic destruction of small businesses is simply supposed to be waved away and forgotten, according to Emily Oster, writing for The Atlantic, a left-wing globalist propaganda mouthpiece.\n\nOster — who pushed for vaccines, social distancing and masks — claims that the people pushing all the covid tyranny simply didn’t know what they were doing.\n\nIn other words, they were all just following orders and should therefore be forgiven. This is the same excuse offered by Nazis in East Berlin, who begged for mercy after slaughtering innocent civilians who were merely trying to escape tyranny.\n\nAccording to rigorous estimates published by Steve Kirsh, Ed Dowd and others, covid vaccines have already likely killed more than one million people in America alone. Globally, at least 20 million people have been killed by these vaccines, with billions facing disability due to vaccine injuries.\n\nAn epic backlash against the tyrants\n\nThe backlash against Oster’s article has been truly epic. Across the ‘net, pundits and truthers unleashed a backlash of fury against Oster and The Atlantic for daring to suggest that all their crimes against humanity should simply be forgotten and forgiven without even an apology from those who mercilessly pushed covid tyranny (and destroyed millions of lives in the process). John Nolte from Breitbart.com probably said it best in a recent article, stating:\n\nThere will be no forgiveness before there’s a reckoning for the mercenary liars who abused our elderly and children.\n\nThere will be no moving on before there’s justice for those who were bankrupted, fined, jailed, mourned alone, forced into lonely despair, and stripped of youth’s magic and irreplaceable moments.\n\nMost of all, there will be no reprieve because you are not sorry; because given the opportunity, you will do it all over again; because you are vicious, heartless, mercenary, politically-driven bullies only asking for amnesty so you can catch us off guard the next time.\n\nNolte is correct. The left-wing covid tyrants — sometimes called covidians — have no remorse. They offer no apology. They are begging for mercy simply because they got caught abusing others, and they hope to never face the consequences for their own actions.\n\nIf you want forgiveness, here’s what needs to happen\n\nWe call for a legal and lawful process of investigating and indicting all those who pushed covid crimes upon the world, followed by prosecutions and due process court hearings. Nuremberg 2.0 needs to get under way so that the truth is told and those responsible are exposed for their crimes.\n\nIn addition, we suggest all the following actions:\n\n1) A nationwide apology by all the media outlets who pushed covid lies, vaccine propaganda, mask nonsense and social distancing disinformation. Front page. Large font. Full admission of guilt.\n\n2) The reinstatement of all the people fired for refusing masks, vaccines, etc., with full back pay.\n\n3) The construction of a “COVID Wall of SHAME” monument specifically naming the criminals who are found guilty in taking part in this global covid conspiracy that targeted humanity. At the same time, we must also erect a “COVID Wall of HEROES” to publicly acknowledge those who told the truth, who stood up to tyranny and who saved lives by resisting the covid insanity. (Let’s start with Z for Zelenko…)\n\n4) We need some guarantee that left-wing tyrants won’t try this again, because they are constantly seeking new ways to control people, destroy lives and achieve global depopulation. How can we be assured they aren’t already cooking up another nefarious toxin or pathogen to unleash upon the world?\n\nI cover all this and more in today’s podcast via Brighteon.com:\n\n– Democrats are begging for covid AMNESTY because they got caught\n\n – But they have NO remorse, and they aren’t sorry. They are EVIL.\n\n – Dems need to offer nationwide APOLOGY for covid tyranny, censorship and lies\n\n – Those who were FIRED need to be reinstated with back pay\n\n – All assets of vax pharma executives should be SEIZED\n\n – Funds should be used to pay families of VACCINE VICTIMS\n\n – We donate nearly $14K to California attorneys suing hospitals for covid murder\n\n – Why God rewards those who pay it forward and don’t hoard money for themselves\n\n – Eurozone inflation soars beyond 10% as Europe faces winter of collapse\n\n – Nearly 40% of small businesses in USA can’t pay rent\n\n – The US economy has been WRECKED by Biden and the Dems\n\n – Important thoughts about FORGIVENESS – but only after apologies are given\n\n – Which items still work after an EMP attack\n\nDiscover more interviews and podcasts each day at:\n\nBrighteon.social: Brighteon.social/@HealthRanger (my breaking news gets posted here first)\n\nTelegram: t.me/RealHealthRanger (breaking news is posted here second)\n\nJoin the free NaturalNews.com email newsletter to stay alerted about breaking news each day.\n\nDownload my current audio books — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audio book, “Resilient Prepping” at ResilientPrepping.com – it teaches you how to survive the total collapse of civilization and the loss of both the power grid and combustion engines.", "opengraph": {"title": "Democrats BEG for covid forgiveness after DESTROYING the lives of millions", "type": "article", "url": "https://www.eugenics.news/2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html", "site_name": "Eugenics News", "description": "In anticipation of the coming Nuremberg 2.0 criminal trials that will seek the indictment of covid co-conspirators who mass murdered millions of people across the globe, Democrats are now begging for “amnesty,” hoping we will all forgive and forget what they did to the victims. The raw tyranny and authoritarian spite demonstrated by Democrats in […]", "image": "https://www.eugenics.news/wp-content/uploads/sites/358/2022/11/America-Divided-Red-Blue-Vaccine-Covid-19.jpg"}, "tags": ["bioweapons", "conspiracy", "nuremberg", "pandemic", "trials", "biowar", "amnesty", "COVID", "forgiveness", "genocide", "depopulation", "spike protein", "democrats", "virus"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/the-media/2022/11/01/nolte-covid-tyrants-at-left-wing-atlantic-beg-for-amnesty/", "http://Brighteon.com/de3a9e26-dd44-40b3-b594-8be16369a12e", "http://Healthrangerreport.com/situation-update-nov-2-2022-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions", "http://Bitchute.com/video/6HtWeu3EUSoz/", "https://Rumble.com/v1r2t9w-situation-update-11222-democrats-beg-for-covid-forgiveness.html", "http://Banned.video/watch?id=636266333f5060081608dcc1", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "http://Banned.video/channel/mike-adams", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Feugenicsnews%2F2022-11-02-democrats-beg-for-covid-forgiveness-after-destroying-the-lives-of-millions.html&linkname=Democrats%20BEG%20for%20covid%20forgiveness%20after%20DESTROYING%20the%20lives%20of%20millions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}