{"result_id": "111034", "URL": "https://www.europereloaded.com/karl-lauterbach-in-substantial-reversal-says-vaccine-injuries-are-dismaying-complains-of-exorbitant-pharmaceutical-profits-calls-for-vaccine-manufacturers-to-fund-an-institute-for-those-ha/", "timestamp": "2023-04-25 15:04:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/karl-lauterbach-in-substantial-reversal-says-vaccine-injuries-are-dismaying-complains-of-exorbitant-pharmaceutical-profits-calls-for-vaccine-manufacturers-to-fund-an-institute-for-those-ha/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Karl Lauterbach, in substantial reversal, says vaccine injuries are \"dismaying,\" complains of \"exorbitant\" pharmaceutical profits, calls for vaccine manufacturers to fund an institute for those harmed", "cleaned_text": "Under these gathering clouds, Lauterbach granted an interview yesterday to the state media programme ZDF Heute Journal, for a segment on vaccine injuries. In the course of the remarkable conversation, Lauterbach was confronted with and forced to disavow his earlier claims from 2021 that the vaccines are “side-effect free”; recognised that every injury is one injury too many and called these cases “dismaying”; likened the so-called “post-vaccination syndrome” (Post-Vac) to Long Covid; emphasised that he wasn’t responsible for negotiating the contracts which exclude pharmaceuticals from liability; and twice called pharmaceutical company profits “exorbitant,” agreeing that these firms should fund an institute to help those those who have been injured by their products.\n\nBecause the interview will be selectively clipped, I provide this full translation:\n\nChristian Sievers of the ZDF Heute Journal (henceforth S): The Federal Minister of Health is with us. Many thanks and good evening, Mr Lauterbach.\n\nS: What do you say to those who have been affected [by vaccine injuries]?\n\nL: First of all, what’s happened to these people is absolutely dismaying, and every single case is one too many. I honestly feel very sorry for these people. There are severe disabilities, and some of them will be permanent. So it’s hard. What we do as a state is that the health insurance companies pay the treatment costs, and, well, the federal states bear the support costs, if support is necessary. But in fact we have problems on both sides, because we don’t yet have the drugs for treating them. These are being feverishly researched. The entitlement to benefits is also often very bureaucratically tied-up. So I really do understand the people who are complaining here.\n\nS : Now you’re making it sound like everything is settled. But when you talk to these people, you hear exactly the opposite. A year of fighting, being turned away again and again – many officials simply don’t believe them, sometimes they never get an answer at all, and then after running the gauntlet to get their vaccine injuries recognised, all they receive is a small sum. That can’t be all the state has to offer these people right now, can it?\n\nL: Absolutely not, and I don’t want to give that impression, because that’s not how I see things. These cases must be more quickly recognised, these vaccine injuries, and we’re now slowly getting a clearer picture. But I should also point out, just so I don’t leave a false impression: severe vaccine injuries happen in less than 1 in 10,000 vaccinations, according to the Paul Ehrlich Institute or the European licensing authorities. So it’s not that common. But because our understanding of these injuries is getting clearer and clearer, it should also be possible in future to identify those who are affected more quickly, so that we can get them quicker help.\n\nS: Why did you, Mr Lauterbach, still claim in the summer of 2021 that the vaccines had no side effects?\n\nL: Well, that was an exaggeration that I once made in a misguided tweet. But it wasn’t fundamentally my position. I had already commented very, very often on the side effects of vaccinations. For example, I …\n\nS: But you often said afterwards that there were hardly any or practically no [side effects. You said this again on the [television talkshow] Anne Will. So, you’ve always given the impression that side effects aren’t really an issue at all.\n\nL: Well, that’s not right, as I just said. I was aware of the figures at the time, and they’ve remained relatively stable. These vaccines have been used worldwide, 1 in 10,000 [are injured], so you can say it’s a lot, or you can say it’s not so many. But the vaccine really does protect against serious illness and, by the way, very often also reduces the risk of Long Covid. This is similar to what we’re talking about here, with the Post-Vac syndrome, so the vaccinations – there’s an outweighing benefit, but it’s true, 1 in 10,000 is the frequency of serious side effects.\n\nS: Now the first lawsuits are pending against BioNTech, and also against other vaccine manufacturers. What do you think that’ll go?\n\nL: I can’t speculate, that’s not my job. As minister I have to be careful. It’s true that within the framework of these EU contracts, the companies were largely exempted from liability and that the liability therefore lies with the German state, so to speak, as just described, with the federal states … but the most important thing is, looking ahead, we need treatments, and I’ll therefore set up a programme with the Ministry of Health, where we’ll investigate the consequences of Long Covid, and also Post-Vac syndrome, where we’ll look into this and improve care. That’s a contribution we can make.\n\nS: When will this happen, in concrete terms? It’s precisely these affected people who are suffering all these delays, who want to know.\n\nL: That’s true, but I’m negotiating with the budget committee, and indeed it’s a programme I’d like to launch as soon as possible, and I’m in budget negotiations for this money. So it’s something that we also have to bring to fruition, it’s an obligation, and it would network the experts in this field in such a way that the probability of good therapy in Germany would grow.\n\nS: Now, you just mentioned the liability waiver for pharmaceutical companies. It means that the pharmaceuticals can, so to speak, relax in all these lawsuits, because the state has assumed the risk. So it’s the state – that is, you, the federal government – that has to answer for any damages claims that may arise. Does you feel good about that?\n\nL: What does feeling good mean? First of all, I didn’t negotiate the contracts; as far as my office is concerned, I inherited them, and I believe that it was due to the situation at that time that people wanted to get the vaccines as quickly as possible, and so the state assumed liability. Maybe that was the right thing to do, because it’s better for the state to be liable than to have to go through long settlements or lawsuits with companies.\n\nS: But we’ve just seen how difficult it is to actually get money from the state. What do you think will happen now? Do you think that in view of the situation, for example, pharmaceuticals could voluntarily put money into a foundation? Would that be an idea if they don’t have any liability?\n\nL: It would definitely be a good idea if companies would show a willingness to help out here, because the profits have been exorbitant – exorbitant profits. So that wouldn’t just be a good gesture, we should expect it. But you ask me, what will happen next? I’d say the optimistic scenario is that we finally learn how to deal with Long Covid and Post-Vac, how we can manage that, and that we moreover recognise cases faster so that people don’t have to wait so long to be recognised as having Post-Vac syndrome in the first place.\n\nS: That’s a promise from the Federal Minister of Health, Karl Lauterbach. Thank you very much for the interview this evening.", "opengraph": {"locale": "en_US", "type": "article", "title": "Karl Lauterbach, in substantial reversal, says vaccine injuries are \"dismaying,\" complains of \"exorbitant\" pharmaceutical profits, calls for vaccine manufacturers to fund an institute for those harmed - Europe Reloaded", "description": "ER Editor: Not only do we see German health minister, Karl Lauterbach, a very weird individual indeed, accepting the reality of vaccine injuries and more, but we have a media outlet on the level of [...]", "url": "https://www.europereloaded.com/karl-lauterbach-in-substantial-reversal-says-vaccine-injuries-are-dismaying-complains-of-exorbitant-pharmaceutical-profits-calls-for-vaccine-manufacturers-to-fund-an-institute-for-those-ha/", "site_name": "Europe Reloaded", "article:published_time": "2023-03-14T08:46:14+00:00", "article:modified_time": "2023-03-14T08:49:42+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/03/Lauterbachinterviewvax-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["German health minister Karl Lauterbach", "eugyppius", "Dr. Byram Bridle", "ZDF Heute Journal"], "tweets": [], "movies": [], "links": [], "authors": ["Pam Barker"], "publish_date": "2023-03-14T08:46:14+00:00"}