{"result_id": "111031", "URL": "https://www.europereloaded.com/ican-wins-lawsuit-forcing-cdc-to-turn-over-v-safe-covid-vaccine-injury-data/", "timestamp": "2023-04-25 15:04:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/ican-wins-lawsuit-forcing-cdc-to-turn-over-v-safe-covid-vaccine-injury-data/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "ICAN Wins Lawsuit Forcing CDC to Turn Over V-SAFE Covid Vaccine Injury Data", "cleaned_text": "And 6,458,751 health impacts were reported by v-safe users.\n• unable to do your normal daily activities; and/or\n• get care from a doctor or other healthcare professional.’\n\nIt took 463 days and two lawsuits for CDC to turn over the data to Aaron Siri.\n\n“Of the 10 million users within V-safe, 7.7% of them had to seek medical care after vaccination. That is an incredibly high percentage, it appears to me,” Siri said.\n\n“7.7 required medical care, talking about emergency rooms, hospitalizations. And on top of that, another 2.5 million, we’re talking 25% missed work or school or had bad reactions to the vaccine,” Gallagher said.\n\nICAN has now obtained CDC data for the approximate 10 million v-safe users.\n\nAs explained in our prior update, v-safe is a new smartphone-based CDC program that allows users to register after getting a Covid-19 vaccine and provide health check-ins.\n\nICAN wanted to obtain this data. So, it deployed its legal team, headed by Aaron Siri, to obtain the v-safe data.\n\nAfter suing the CDC twice, and following months of legal wrangling, the CDC finally capitulated, resulting in a court order that required it to produce this data. The first batch of data, containing 144 million rows of health entries by v-safe users, has now been obtained by ICAN and you can search it using a user-friendly interface that ICAN worked around the clock to create.\n\nThis first batch of data includes the responses v-safe users provided to pre-populated ‘check-the-box’ fields. It does not include data from the fields that allowed free-text responses. It nonetheless reveals shocking information that should have caused the CDC to immediately shut down its Covid-19 vaccine program.\n\nAmong numerous alarming results, out of the approximate 10 million individuals that registered and submitted data to v-safe, 782,913 individuals, or over 7.7% of v-safe users, had a health event requiring medical attention, emergency room intervention, and/or hospitalization. Over 25% had an event that required them to miss school or work and/or prevented normal activities.\n\nThere were also 71 million reports of symptoms in the pre-populated fields from the approximately 10 million users. This is an average of over 7 symptoms reported per v-safe registrant. Reported symptoms include, for example, over 4 million reports of joint pain, a very concerning immune reaction. While around 2 million of these joint pain reports were mild, over 1.8 million of the reports were for moderate joint pain and over 400,000 were for severe joint pain. Since v-safe only included less than 4 percent of people that received a Covid-19 vaccine, tens of millions of Americans likely had an immune reaction to the Covid-19 vaccine in their joints that resulted in debilitating pain and potential long-term harm.\n\nThere were also approximately 13,000 infants under 2 years of age who were registered for v-safe. For these 13,000 children, there were over 33,000 symptoms experienced that were significant enough to report, with the most common symptoms being irritability, sleeplessness, pain, and loss of appetite. These are very concerning since babies cannot speak and hence these symptoms are how they often communicate that something is wrong.\n\nThese data also reflect a disproportionate amount of negative health impacts, including medical events, following the Moderna vaccine versus the Pfizer vaccine. There was also a disproportionate number of negative events reported by women versus men. This is consistent with what was seen in Pfizer’s initial post-authorization safety report sent to the FDA (a report which likewise had to be obtained by lawsuit) which similarly showed a disproportionate number of neurological events experienced by women following the Pfizer Covid-19 vaccine.\n\nBut please do your own research. The data is voluminous (one of the files, alone, is over 23 gigabytes) and so ICAN worked diligently and around the clock to get it into a user-friendly format for you to review, which you can do here.\n\nAnd remember, the data produced thus far is only from the pre-populated fields within v-safe, which supplied v-safe registrants with only a limited number of options to choose from. There are also numerous free-text fields within v-safe where registrants were able to enter additional information. No doubt a lot of the detailed and interesting information is in these free-text fields. ICAN’s legal team continues to litigate to obtain that data.\n\nThis is a big win in the nearly two-year-long fight for transparency from our federal health agencies on the real safety data for Covid-19 vaccines. As additional v-safe data is produced, ICAN will immediately bring it to your attention and make it available.\n\nWatch Del Bigtree break down this historic win here", "opengraph": {"locale": "en_US", "type": "article", "title": "ICAN Wins Lawsuit Forcing CDC to Turn Over V-SAFE Covid Vaccine Injury Data - Europe Reloaded", "description": "ER Editor: We’re putting out Dr. Paul Alexander’s reaction first to what the ICAN team have found from data so far obtained from the CDC’s so-called ‘v-safe’ data app, used by those who chose to [...]", "url": "https://www.europereloaded.com/ican-wins-lawsuit-forcing-cdc-to-turn-over-v-safe-covid-vaccine-injury-data/", "site_name": "Europe Reloaded", "article:published_time": "2022-10-05T07:37:11+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/10/ICANDelDataObtained-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Dr. Paul Alexander", "ICAN obtains v-safe data", "ICAN", "Aaron Siri", "Del Bigtree", "V-safe Program", "CDC"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/10/breaking-ican-wins-lawsuit-forcing-cdc-turn-v-safe-covid-vaccine-injury-data-shows-7-7-seek-medical-care-vaccination-25-serious-side-effects-video/", "https://www.icandecide.org/ican_press/breaking-news-ican-obtains-court-order-requiring-cdc-to-release-v-safe-data-that-includes-over-137-million-health-entries-made-after-covid-19-vaccines/", "https://www.icandecide.org/wp-content/uploads/2021/12/001-COMPLAINT-24.pdf", "https://www.icandecide.org/wp-content/uploads/2022/09/0738-Complaint-Exhibits-1-4.pdf", "https://www.icandecide.org/wp-content/uploads/2022/09/019-Agreed-Scheduling-Order.pdf", "https://www.icandecide.org/v-safe/", "https://www.icandecide.org/v-safe/", "https://thehighwire.com/videos/breaking-news-ican-obtains-cdc-v-safe-data/", "https://www.icandecide.org/ican_press/breaking-news-ican-obtains-cdc-v-safe-data/"], "authors": ["Pam Barker"], "publish_date": "2022-10-05T07:37:11+00:00"}