{"result_id": "111030", "URL": "https://www.europereloaded.com/mep-cristian-terhes-grills-astrazeneca-moderna-about-vaccines-and-vaccine-contracts-during-eu-covid-committee-meeting/", "timestamp": "2023-04-25 15:04:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/mep-cristian-terhes-grills-astrazeneca-moderna-about-vaccines-and-vaccine-contracts-during-eu-covid-committee-meeting/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "MEP Cristian Terhes Grills AstraZeneca, Moderna About Vaccines and Contracts During EU Covid Committee Meeting", "cleaned_text": "On Monday, Member of the European Parliament (“MEP”) Cristian Terheș put a barrage of hard-hitting questions to Moderna CEO Stéphane Bancel and AstraZeneca Vice-President of Europe and Canada, Iskra Reic.\n\nHe asked them to clarify if their companies, themselves, had decoded the DNA sequence of the SARS-CoV-2 virus; if they had tested whether their vaccines stopped the spread of the virus; if any vaccine trial participants died; and about the indemnity and “secret” contracts they made with governments.\n\nTerhes raised these questions directly with the two during a session of the European Union (“EU”) Special Committee on Covid-19 pandemic. In April the newly formed Committee elected Kathleen van Brempt as its Chair. The Committee meeting with pharmaceutical companies was held on 5 September and was attended by representatives from Gilead Sciences, Sanofi, AstraZeneca, and Moderna.\n\nHe posted an 8-minute video clip, included below, of his questions and the company representatives’ answers on his Facebook page with the following comments [Romanian-English using Google translate with some editing]:\n\nThe representatives of Moderna and AstraZeneca said in their answers that they produced vaccines upon request by the states/governments that asked them to make the vaccines quickly. And so, they asked for protection, indemnity, from the payment of compensation for potential damages.\n\n“On the liabilities – as has been done by all the manufacturers – we wanted, sorry, governments wanted a quick approval of a vaccine. And so, for the conditional approval, it was important to give us some guarantees in terms of indemnification, because we cannot have a cake and eat it too. We wanted the vaccine quick without giving time to manufacturers to have long-term studies because of the nature of a pandemic,” Moderna CEO Stéphane Bancel said.\n\n“Liability indemnity clause was discussed and agreed with many governments around the world because everybody wanted to try to see how we can accelerate the development and the delivery on the vaccine. And again, as I mentioned that is something that is considered to be a standard practice in the emergencies and equally that protects and support everybody to move at utmost speed and do their utmost best for on developing or manufacturing [vaccines],” Vice-President of AstraZeneca Iskra Reic said.\n\nBancel also admitted that the bivalent boosters recently approved in the US have not previously been tested on humans.\n\nAnother important statement made by Bancel was that the vaccines were products based on a DNA segment of the virus provided by Chinese authorities at the beginning of 2020 and not the entire DNA.\n\nAt the end of the video clip, Terhes stated his conclusions:\n\n“Everything was done on the basis of contracts that [to this day] are not public. In short, we are witnessing the biggest corruption scandal in history, the price of which is also endangering people’s lives,” Terheș wrote in the description accompanying his video post [Romanian-English using Google translate].\n\nYou can watch the full session of the EU Special Committee on Covid-19 pandemic HERE and view the briefing notes or “fact sheets” given to the committee by each of the pharmaceutical companies HERE.\n\nMEP Cristian Terheș: The first set of questions It is for both AstraZeneca and Moderna.\n\nSo that the first question is: I would like to I know the date, if it is possible, when you decoded the full DNA sequence of this virus or you solely relied on the sequence provided to you by the Chinese government.\n\nSecond question: Have you tested if the vaccines are stopping the spread of the virus or not? Because the data clearly shows the products are not stopping the spread of this virus.\n\nThird question: Have you had people who died during human trials? And if so, what were the illnesses that they died from?\n\nNow, I have certain questions for Moderna, for Mr. Bancel.\n\nYou stated here that you relied on the sequence provided to you by the Chinese government when you developed your vaccine.\n\nI have here an answer from EMA, which is showing for every vaccine the kind of tests that were done. So, in the case of Moderna, for example, you provided data showing that you tested these vaccines since 2017, 2018, 2019. So how are you able to test these vaccines back then when we found out about this virus in December of 2019?\n\nSecond question: the contracts. You mentioned here that there are some secrets or some confidential information in these contracts that should protect your interests. Now, the question that I addressed to you: what about the interests of us and the interests of the European citizens? Because this is how some of the pages from the contract between Moderna and the European Commission is showing.\n\nSo, I’m asking you, do you think this is fair to all of us? To talk about these vaccines, to talk about boosters, to talk about medical products when we don’t know the clauses of these contracts. So, the direct question to you, Mr. Bancel, is when are you going to fully publish the contracts that you have both with the European Commission and with the member states of the European Union?\n\nAnother question, the issue of liabilities. You were asked by our colleague here about the liabilities and you avoided to answer this question. So, my question is: why are you pushing the liabilities on the states and on the people who receive these vaccines, and my head, and I say on my head, adverse effects while you get all the profits? Nevertheless, the bivalent boosters.\n\nThis is the last question. You just stated here that these boosters were requested by the US government who also approved the boosters without trials on humans. So, I’m asking you, do you think this is fair? Do you think we can go and ask the European citizens to be vaccinated with some medical products that were not properly tested or not at all tested in humans?\n\nKathleen van Brempt: Mr. Terhes, next time I’ll deduct 40 seconds from your speaking time.\n\nTerhes: Due respect, it’s an important issue and the reason why they are here is to answer questions. And I see that they are all avoiding answering concrete questions from my colleagues.\n\nvan Brempt: Yeah, but it’s also respectful for your …\n\nTerhes: Well, they have to be transparent here and so far they haven’t been transparent. Thank you.\n\nvan Brempt: I start with Mr. Bancel, and then I come to Mrs. Reic. And please, very specific answer to the specific questions, please. Thank you very much.\n\nBancel: So, on the first question, as I said before, yes, we use the sequence of a virus published by Chinese government that was online and tested by many scientists in academic labs and government labs that we use for the design of a vaccine.\n\nYou make a statement on the poor efficacy of a vaccine against preventing infection. That actually was not correct in the 2021 timeframe, where it was mostly alpha and delta. As you recall, the vaccines were holding very well to infection and, of course, hospitalisation and death, which was really important.\n\nWhat happened was a change with Omicron. As you know, the Omicron virus was a big, big genetic drift from the original sequence coming out of China, which is why the vaccine needed to be retooled. The good news for public health is the vaccine held very well against hospitalisation and which, as we all know, is the number one priority of those vaccines.\n\nOn the phase III clinical trial, I’m not aware of any death that happened during the phase III of a clinical trial.\n\nYou mentioned the document from EMA which I’m not aware of. But the vaccine that we tested before is what I mentioned to one of your colleagues in my previous set of answers, which is: since 2015, we have been doing clinical trial with our vaccines. This is not, of course, against SARS-CoV-2, because virus did not exist. It was against flu, RSV and also pandemic flu strain. So that is why we were able to get validation of a platform in a clinic.\n\nOn the liabilities – as has been done by all the manufacturers – we wanted, sorry, governments wanted a quick approval of a vaccine. And so, for the conditional approval, it was important to give us some guarantees in terms of indemnification, because we cannot have a cake and eat it too. We wanted the vaccine quick without giving time to manufacturers to have long-term studies because of the nature of a pandemic.\n\nAnd then the last question around testing in human, as I answered in the previous set of questions, the vaccine that has a conditional approval for booster bivalent against Omicron that has been approved in Europe last week, did have clinical study happening for this vaccine. It’s the one in the US that did not. But the one in Europe, there was human testing.\n\nvan Brempt: This is right. Thank you.\n\nReic: So, first, to try to add on Mr. Bancel reply to your question, Mr Terhes, I can say that, as you probably know, our vaccine was developed from the ChAdOx platform, the adenovirus vaccine that already existed as a platform before Covid-19 and the preliminary preclinical work was done in the University of Oxford.\n\nWhen it comes to liability, I do believe that, I’m sorry to hear that you are not satisfied with the responses but I think we are trying here to be as transparent as possible. Liability indemnity clause was discussed and agreed with many governments around the world because everybody wanted to try to see how we can accelerate the development and the delivery on the vaccine. And again, as I mentioned that is something that is considered to be a standard practice in the emergencies and equally that protects and support everybody to move at utmost speed and do their utmost best for on developing or manufacturing side. Also, the liability indemnity clause is valid only for the certain, those that are contracting, only for the pandemic fix.", "opengraph": {"locale": "en_US", "type": "article", "title": "MEP Cristian Terhes Grills AstraZeneca, Moderna About Vaccines and Contracts During EU Covid Committee Meeting - Europe Reloaded", "description": "ER Editor: We recommend other articles on MEP Cristian Terhes and some of his colleagues such as Christine Anderson. They’re the precious few who are going to bat for EU citizens. ******** MEP Grills AstraZeneca [...]", "url": "https://www.europereloaded.com/mep-cristian-terhes-grills-astrazeneca-moderna-about-vaccines-and-vaccine-contracts-during-eu-covid-committee-meeting/", "site_name": "Europe Reloaded", "article:published_time": "2022-09-08T11:29:53+00:00", "article:modified_time": "2022-09-08T11:34:18+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/09/TerhesAZModernaReps-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Stephane Bancel", "Kathleen van Brempt", "Cristian Terhes", "EU Special Committee on Covid-19 pandemic", "Rhoda Wilson The Expose", "Iskra Reic"], "tweets": [], "movies": [], "links": ["https://www.europarl.europa.eu/meps/en/197655/CRISTIAN_TERHES/home", "https://www.europarl.europa.eu/news/en/press-room/20220412IPR27113/ep-special-committee-on-covid-19-pandemic-starts-work", "https://www.facebook.com/CristianVTerhes/videos/1910061899182390/", "https://www.facebook.com/CristianVTerhes/videos/1910061899182390/", "https://multimedia.europarl.europa.eu/en/webstreaming/special-committee-on-covid-19-pandemic_20220905-1500-COMMITTEE-COVI", "https://emeeting.europarl.europa.eu/emeeting/committee/en/agenda/202209/COVI", "https://expose-news.com/2022/09/07/mep-grills-pharma-about-vaccines-and-contracts/"], "authors": ["Pam Barker"], "publish_date": "2022-09-08T11:29:53+00:00"}