{"result_id": "111008", "URL": "https://www.europereloaded.com/about/", "timestamp": "2023-04-25 15:04:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/about/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "ABOUT", "cleaned_text": "WHO ARE WE & WHAT DO WE STAND FOR?\n\nCOVID UPDATE: We support REAL science led by doctors and researchers such as Michael Yeadon, Wolfgang Wodarg, Sucharit Bhakdi, Dolores Cahill, Judy Mikovits, Andrew Kaufmann, &etc.\n\nWe do not endorse liberty- and economy-destroying measures such as lockdowns, the wearing of masks, and the fear propaganda of the media-government machine based on lies about ‘cases’ and death rates.\n\nWe oppose the Great Reset policy of the Davos crowd. We oppose the massive election fraud that has been proven to exist in the November 2020 US presidential election. We oppose forced vaccine policies and vaccine passports.\n\nWe support natural health, support for our immune systems, and proven treatments such as HCQ and ivermectin, &etc.\n\nWhat is abundantly clear today is that we’re ruled by an exceptionally hostile elite – a corporate/banking cabal who use our top politicians (more correctly called technocrats) as their executive arm. The Big State, with its locked-in mechanisms, allows the true masters of our governments to implement all manner of nefarious policies anonymously, without citizen consent or recourse. Democracy is no more than very expensive theatre that we mindlessly pay for. At every opportunity, citizens’ taxes – which rightfully belong to them – are sucked up through various elaborate pretexts. The elite-owned media – ‘public’ or private – does no more than convince us that black is white, that our natural views, impulses and culture are wrong and beneath contempt. Our history has been breathtakingly distorted so as to confuse and destabilize us. Globalist economic policies, including jobs’ outsourcing to China, utilising cheap labour from within the EU, and forced mass migration producing a dirt-cheap labour pool, have been rendering local people increasingly poorer over the last 40 years. The destruction of our working classes has been decisive and brutal, taking down with it the middle class. All by design.\n\nProbably not since the days of the Kennedys and De Gaulle have we had leading political figures that truly aim to serve the people, who have a personal vision and strength of character, and are willing to go up against the deep state. All of them were either murdered or, in the case of De Gaulle, had many assassination attempts made on him.\n\nAt ER, we defy labels, pigeonholing and reductive theoretical positions; we proudly aim to be ideology-free. We choose articles and videos for publication that reflect the following ideas at a minimum:\n• What is good for the bottom 80% of the population?\n• What does the majority of that 80% judge to be good for themselves?\n• Are they informed truthfully and sufficiently to make the best, most considered decisions on their own behalf?\n• Are they able to obtain through legitimate political mechanisms what is good for them?\n\nThe perspectives we choose on various topics – for example, neoliberal economics, forced mass migration, Brexit and the EU, the neoconservative assault on countries around the world, the ‘progressive’ agenda at home, the Big Pharma agenda, &etc. – can be viewed through this basic prism.\n\nThe Left/Right agenda is no more than an artificial division, a construct imposed on us to convince us that our ‘enemy’ is just another ordinary person like ourselves – a form of perception management. Nothing could be further from the truth. It also compartmentalises our thinking on important political, economic and social issues, rendering people unable to pursue a more comprehensive and coherent agenda in their own interest. For example, there is nothing incompatible about universal, at-cost healthcare and gun carry, but our left-right divide tells us there is.\n\nMost ordinary people simply want a decent, meaningful life in the company of other like-minded people. A large group of people, we believe, will be sensible, practical and compassionate in making key decisions through citizen-initiated referenda. An effective constitution should be in place at all costs to protect basic liberties. The people should own their own money supply.\n\nAbove all, the citizen is NEVER the property of the state, which should be there to merely serve.\n\nWe probably sound a lot like France’s Yellow Vests (Gilets Jaunes), a cause we defend wholeheartedly.\n\nTrusted authors and sites we regularly use and consult (alphabetical):\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "type": "article", "title": "ABOUT - Europe Reloaded", "description": "WHO ARE WE & WHAT DO WE STAND FOR? COVID UPDATE: We support REAL science led by doctors and researchers such as Michael Yeadon, Wolfgang Wodarg, Sucharit Bhakdi, Dolores Cahill, Judy Mikovits, Andrew Kaufmann, &etc. [...]", "url": "https://www.europereloaded.com/about/", "site_name": "Europe Reloaded", "article:modified_time": "2022-08-14T19:03:00+00:00", "image": "http://www.europereloaded.com/wp-content/uploads/2017/02/Europe-Reloaded-4.png"}, "tags": [], "tweets": [], "movies": [], "links": ["hhttp://www.europereloaded.com/wp-content/uploads/2017/02/Europe-Reloaded-4.png", "https://www.europereloaded.com/about/?share=twitter", "https://www.europereloaded.com/about/?share=facebook"], "authors": [], "publish_date": null}