{"result_id": "111010", "URL": "https://www.europereloaded.com/eu-opens-probe-into-vaccine-deals/", "timestamp": "2023-04-25 15:04:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/eu-opens-probe-into-vaccine-deals/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "EU Opens Probe Into Vaccine Deals", "cleaned_text": "The European Union prosecutor’s office has launched an investigation into the bloc’s procurement of billions of Covid-19 vaccine doses, amid allegations of corruption and secret backroom dealings from several members of parliament.\n\nEU officials announced the probe in a brief statement on Friday, confirming an “ongoing investigation into the acquisition of Covid-19 vaccines in the European Union.” They added that the case follows “extremely high public interest” around the issue, though declined to share any other details.\n\nWhile prosecutors were tight-lipped about the exact nature of the probe, the announcement follows allegations from MEPs that European Commission President Ursula von der Leyen conducted vaccine negotiations with Pfizer CEO Albert Bourla in secret. Despite requests from journalists, lawmakers and an EU watchdog, von der Leyen’s office has failed to produce personal text messages sent to Bourla during talks for nearly 2 billion vaccine doses, prompting accusations of corruption.\n\nCroatian MEP Mislav Kolakusic noted the new investigation later on Friday, saying the decision was made thanks to pressure from lawmakers. Though he was unable to shed additional light on the probe, Kolakusic has been highly critical of the EU’s vaccine procurement process, claiming deals for billions of doses were marred by “corruption” and secrecy.\n\nLast month, the European Court of Auditors said that it has asked the commission to provide information on “preliminary negotiations” for the EU’s largest Pfizer purchase – including “scientific experts consulted and advice received, timing of the talks, records of the discussions, and details of the agreed terms and conditions” – but added that “none was forthcoming.” The European Commission still has yet to make the information public, fueling corruption allegations from MEPs.", "opengraph": {"locale": "en_US", "type": "article", "title": "EU Opens Probe Into Vaccine Deals - Europe Reloaded", "description": "ER Editor: See this we published yesterday — Covid Vaccines Are the Biggest Corruption Scandal in the History of the World says MEP See also this from MEP Cristian Terhes’ group: EU Press Conference After [...]", "url": "https://www.europereloaded.com/eu-opens-probe-into-vaccine-deals/", "site_name": "Europe Reloaded", "article:published_time": "2022-10-15T05:59:45+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/10/EPPOProbeVaxPurchase-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["European Public Prosecutor's Office", "EU vaccine deals", "EU purchases billions of covid vaccines", "RT", "MEP Mislav Kolakusic"], "tweets": [], "movies": [], "links": ["https://www.eppo.europa.eu/en/news/ongoing-eppo-investigation-acquisition-covid-19-vaccines-eu", "https://www.rt.com/news/554394-european-mps-sue-ec-vaccines/", "https://twitter.com/mislavkolakusic/status/1580924517526175747", "https://twitter.com/mislavkolakusic/status/1580132343758540800", "https://www.politico.eu/wp-content/uploads/2022/09/12/SR-19-2022-COVID-19-vaccine-procurement.pdf", "https://www.rt.com/news/564700-eu-prosecutor-vaccine-purchases/?utm_source=feedly&utm_medium=rss&utm_campaign=RSS"], "authors": ["Pam Barker"], "publish_date": "2022-10-15T05:59:45+00:00"}