{"result_id": "111015", "URL": "https://www.europereloaded.com/first-ever-official-apology-for-covid-vaccine-mandates/", "timestamp": "2023-04-25 15:04:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/first-ever-official-apology-for-covid-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "First-Ever Official Apology for COVID Vaccine Mandates", "cleaned_text": "I believe we have just seen the first-ever sincere and complete apology for vaccine mandates coming from a government official.\n\n(If I am mistaken, and it is not the first one, let me know. Danielle Smith also “apologized to the unvaccinated.” Danielle is awesome, but she apologized for other people’s acts – she was not the premier of Alberta when vaccine mandates were enacted).\n\nIn this moving video, a town councilor in West Nipissing, Ontario, Canada, Anne Tessier, officially apologizes for vaccine mandates.\n\nAnne acknowledges that the mandates were wrong. She admits that they were wrong when enacted and that the council was aware of that.\n\nAnne’s voice breaks as she realizes the importance of her apology.\n\nI want to acknowledge that this policy has caused a lot of unnecessary harm and animosity within our Workforce and community. I believe that this policy was mistakenly adopted 12 months ago. The general population knows today that the Covid vaccine does not stop the spread of the virus. 12 months ago, the municipal council was well aware that the virus spread did not correlate with vaccination status prior to this policy being adopted. A constituent had presented to the council the Public Health Ontario data showing that by January 2022, more cases were reported per capita in vaccinated people versus unvaccinated people. Unfortunately, the outcome of the vote from the municipal council resulted in the implementation of this punitive policy. With all my heart, I extend my apologies to those who were affected negatively by this policy, and I hope that as a municipality and a community, we can move forward. Thank you.\n\nI am moved by her statement. Anne, a small-town official, has done what no one else has done to date. She apologized. She did not issue a “non-apology apology” – she fully admitted the city’s wrongdoings, acknowledged their harm, and apologized unequivocally.\n\nCompare Anne’s sincerity with the German minister Karl Lauterbach. Karl falsely blamed unnamed “scientists” (he was a multiple-degreed scientist himself) and refused to ask for forgiveness.\n\nMs. Tessier, a small-town official, rose above Karl Lauterbach and apologized.\n\nWhile no one should be exempt from future investigations into the Covid vaccine disaster, Anne Tessier’s sincere remorse and heartfelt apology should factor towards forgiveness.\n\nAnne Tessier’s apology is hopefully the beginning of a new trend. Not all future apologies will be sincere. I can see, however, that Anne is sincere, and I wish her and her town the best.", "opengraph": {"locale": "en_US", "type": "article", "title": "First-Ever Official Apology for COVID Vaccine Mandates - Europe Reloaded", "description": "First-Ever Official Apology for COVID Vaccine Mandates A Powerful, Sincere and Emotional Apology Worth Watching   IGOR CHUDOV I believe we have just seen the first-ever sincere and complete apology for vaccine mandates coming from a [...]", "url": "https://www.europereloaded.com/first-ever-official-apology-for-covid-vaccine-mandates/", "site_name": "Europe Reloaded", "article:published_time": "2023-03-05T12:16:34+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/03/TissierNipissingApology-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Public Health Ontario", "apology for Covid vaccine policies", "apology for Covid policies", "Karl Lauterbach", "Anne Tessier councillor West Nipissing", "Igor Chudov"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/iBSppvX6MwM?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" width=\"728\" height=\"409\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube-nocookie.com/embed/iBSppvX6MwM?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://igorchudov.substack.com/p/first-ever-official-apology-for-covid?utm_source=post-email-title&publication_id=441185&post_id=106489850&isFreemail=true&utm_medium=email"], "authors": ["Pam Barker"], "publish_date": "2023-03-05T12:16:34+00:00"}