{"result_id": "111044", "URL": "https://www.europereloaded.com/vaccinated-blood-is-contaminated-with-covid-vaccine-mrna-study-finds/", "timestamp": "2023-04-25 15:05:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/vaccinated-blood-is-contaminated-with-covid-vaccine-mrna-study-finds/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Vaccinated Blood is Contaminated with COVID Vaccine mRNA, Study Finds", "cleaned_text": "A was just published by Castruita et al.\n\nThe scientists, while studying “something else” related to hepatitis, decided to test blood samples of their patients who got vaccinated for COVID-19 with mRNA vaccines for the presence of vaccine mRNA.\n• They looked at vaccinated and unvaccinated persons to have a control group.\n• They distinguished between vaccine mRNA and viral RNA of Sars-Cov-2\n• They were careful to avoid contaminants showing up as positive reads for vaccine mRNA\n• They distinguished, in their analyses, between Moderna and Pfizer mRNA genetic codes. These two vaccines encode the same spike proteins but contain different nucleotides (this is called codon optimization)\n\nI am proud of Castruita et al. for being meticulous with their analyses. I wish all “COVID research” was done with such in-depth safeguards against mistakes.\n\nThis is what they found:\n\nof the 108 patient samples, 10 samples (9.3%) had partial or up to full sequences of the vaccine mRNA sequence (Fig. 1), identified from one to 28 days postvaccination. There was ~100% identity between the detected mRNA nucleotide sequences found in plasma and the specific mRNA vaccine given. The 10 samples had a median of 5.5 million raw read pairs available (see Table S1). Breadth and depth of coverage of the vaccine mRNA sequences ranged from completeness and >20 000, respectively, to short fragments with a depth of coverage of 100 (Fig. 1). None of the negative or the HCV-positive controls had SARS-CoV-2 matching reads.\n\nThey identified blood samples containing vaccine mRNA as late as 28 days after administering vaccine doses.\n\nI am not sure how the 108 samples were spaced temporally. Therefore, we do not know with certainty whether much fewer patients have mRNA in their blood by Day 28, compared to, for example, Day 14. Various samples (compare the day 14 sample from one patient with Day 15 Pfizer sample from another patient) contain wildly inconsistent amounts of mRNA. If I were to guess, if more samples were analyzed, the authors would find greatly varying amounts of mRNA, even for the same sampling days post-vaccine, in different persons.\n\nThe question is rhetorical, and the above study proved that the answer is no.\n\nmRNA Covid vaccine is present in some vaccinated blood for at least 28 days (this is the maximum that the study authors tested for).\n\nIs such blood safe or unsafe? It is not a question that I can answer based on just the above study. However, there was a sad story of a baby who developed a blood clot and died after getting a vaccinated blood transfusion.\n\nAccording to the study results, 9.3% of vaccinated blood samples could be contaminated with Covid vaccine mRNA.\n\nIt is possible that “baby Alex” was one of the unlucky recipients of blood having a large amount of Covid vaccine mRNA.\n\nDespite debunking the myth of “vaccine staying at the injection site” and another myth of “vaccinated blood does not contain vaccine mRNA,” the study also shows that 98 samples out of 108 did NOT have vaccine mRNA detected. This means that while we should be upset about being lied to, most people who received Covid vaccines did not have their blood contaminated with the vaccine. Only a minority (a sizable one) did.\n\nPeople’s concerns about accepting Covid-vaccinated blood transfusions are not baseless, as we know. The study shows 9.3% of blood samples contain mRNA nanoparticles from Covid vaccines. However, as time passes after the last dose, the amount of contamination likely declines in quantity and frequency of occurrence.\n\nThe problem is that we never know what blood we are receiving!\n\nRejecting a much-needed blood transfusion is also very risky. Transfusions are given when the recipient is at risk of dying, after all. All this explains strong demand for unvaccinated blood.\n\nWhat do you think we should do about this?", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccinated Blood is Contaminated with COVID Vaccine mRNA, Study Finds - Europe Reloaded", "description": "Vaccinated Blood is Contaminated with COVID Vaccine mRNA, Study Finds Is “Vaccinated Blood” Safe?   IGOR CHUDOV A new study was just published by Castruita et al. The scientists, while studying “something else” related to hepatitis, decided [...]", "url": "https://www.europereloaded.com/vaccinated-blood-is-contaminated-with-covid-vaccine-mrna-study-finds/", "site_name": "Europe Reloaded", "article:published_time": "2023-02-20T09:35:08+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/02/DonatedBloodmRNAcontaminated-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["baby Alex Washington State", "mRNA vaccines blood contamination", "vaccinated blood", "Castruita et al", "Igor Chudov", "donated blood is mRNA contaminated"], "tweets": [], "movies": [], "links": ["https://onlinelibrary.wiley.com/doi/10.1111/apm.13294", "https://onlinelibrary.wiley.com/doi/10.1111/apm.13294#apm13294-fig-0001", "https://onlinelibrary.wiley.com/doi/10.1111/apm.13294#support-information-section", "https://onlinelibrary.wiley.com/doi/10.1111/apm.13294#apm13294-fig-0001", "https://margaretannaalice.substack.com/p/baby-alex-the-definitive-accountin", "https://igorchudov.substack.com/p/demand-for-unvaccinated-blood-is", "https://igorchudov.substack.com/p/vaccinated-blood-is-contaminated?utm_source=post-email-title&publication_id=441185&post_id=103900532&isFreemail=true&utm_medium=email"], "authors": ["Pam Barker"], "publish_date": "2023-02-20T09:35:08+00:00"}