{"result_id": "111019", "URL": "https://www.europereloaded.com/now-is-the-time-for-a-ban-on-all-mrna-and-dna-vaccines-and-treatments/", "timestamp": "2023-04-25 15:04:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/now-is-the-time-for-a-ban-on-all-mrna-and-dna-vaccines-and-treatments/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Now is the Time for a Ban on all mRNA and DNA Vaccines and Treatments", "cleaned_text": "ER Editor: For the record, while we are completely against a) toxic injection technology (the mRNA cocktail is highly toxic to the human body), and b) injection technology that changes our genetic code, it is still not entirely clear what is hurting people from the Covid shots. Graphene oxide nanotechnology is still being swept under the carpet yet it is clearly present in certain shots. Damaging, proliferating spike proteins – have they been really identified? Some say yes, which they say can be seen on lab pictures. Toxic mRNA – to what degree is it present in these shots? Some researchers, noting the graphene structures, have found no mRNA whatever. A hospital in Valencia, Spain treats Covid with magnets. It still remains unclear, from what we have published, what Covid really is and what is in the vaccines. Regarding the mRNA platform, which is indeed highly toxic, Moderna has developed a shot for people who have had a heart attack. Which would be injected directly into the heart. (Is this a real story, we wonder? Is this part of the movie? At this point, we’re not sure.) But we do join Dr. Peter Breggin and Ginger Breggin in calling for a HALT to mRNA technology for vaccines. It is certainly the case that ‘they’ have wanted us universally injected for quite some time. Gates is just the frontman. For Dr. Paul Alexander‘s take on this mRNA heart attack shot, see What can possibly go wrong? “Moderna begins trialing mRNA shot that is injected directly into the HEART to treat heart attack patients”; are these people insane? Huge risk for cardiac disaster!! From the Daily Mail article that broke the story and is cited below: Moderna is developing an mRNA shot that is injected directly into the hearts of heart attack and heart failure patients. The ‘vaccine’ uses the same technology as the company’s flagship Covid jab and is designed for people weeks or months after a heart attack to help them recover. It works by instructing human heart cells to generate a hormone that is known to improve blood flow, helping restore damaged heart muscles. During a heart attack, muscle cells can start to die and cannot be re-generated. Roughly one in five people who have had a heart attack will be readmitted to the hospital for a second one within five years. … Now is the Time for a Ban on all mRNA and DNA Vaccines and Treatments Moderna MUST NOT Be Allowed to Market Its mRNA Heart Attack “Shots”\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "type": "article", "title": "Now is the Time for a Ban on all mRNA and DNA Vaccines and Treatments - Europe Reloaded", "description": "ER Editor: For the record, while we are completely against a) toxic injection technology (the mRNA cocktail is highly toxic to the human body), and b) injection technology that changes our genetic code, it is [...]", "url": "https://www.europereloaded.com/now-is-the-time-for-a-ban-on-all-mrna-and-dna-vaccines-and-treatments/", "site_name": "Europe Reloaded", "article:published_time": "2023-01-30T07:50:25+00:00", "article:modified_time": "2023-01-30T07:55:30+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/01/BanmRNAvaxUniversalVax-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Dr. Paul Alexander", "ban mRNA", "Moderna heart attack shot", "mRNA vaccines", "Karen Kingston", "Ginger Breggin", "Dr. Peter Breggin", "universal flu vaccine Moderna"], "tweets": [], "movies": [], "links": ["https://palexander.substack.com/p/what-can-possibly-go-wrong-moderna?utm_source=post-email-title&publication_id=579356&post_id=99700574&isFreemail=true&utm_medium=email", "https://www.dailymail.co.uk/news/moderna/index.html", "https://www.dailymail.co.uk/health/article-11624959/FDA-vaccine-advisers-angry-early-data-Covid-19-booster-shot-withheld-year.html", "https://www.dailymail.co.uk/health/article-11627695/Moderna-begins-trialing-mRNA-shot-injected-directly-HEART.html", "http://www.breggin.com/", "https://www.americaoutloud.com/author/peter-breggin-md-and-ginger-ross-breggin/", "https://karenkingston.substack.com/?utm_source=substack&utm_medium=web&utm_campaign=reader2&utm_source=/search/Karen%252520kingston&utm_medium=reader2", "https://palexander.substack.com/p/lei-et-al-sars-cov-2-spike-protein?utm_source=post-email-title&publication_id=579356&post_id=87408949&isFreemail=false&utm_medium=email", "https://www.thegatewaypundit.com/2022/11/renowned-oncologist-sends-urgent-letter-calling-uk-end-covid-vaccine-program-immediately-cancers-diseases-rapidly-progressing-boosted-people/", "https://www.theepochtimes.com/what-ive-seen-in-the-last-two-years-is-unprecedented-physician-on-covid-vaccine-side-effects-on-pregnant-women_4428291.html", "https://totalityofevidence.com/dr-james-thorp/", "https://www.digitaljournal.com/pr/horrifying-new-report-on-the-drastic-spike-in-miscarriages-since-the-rollout-of-the-covid-19-injections", "https://palexander.substack.com/p/breast-milk-and-transmission-or-passage", "https://breggin.com/article-detail/post_detail/Sucharit-Bhakdi-in-Athens-September-24-2022", "https://rumble.com/v1yh9zo-dr.-peter-mccullough-mrna-is-transferring-from-the-vaccinated-to-the-unvacc.html", "https://expose-news.com/2022/12/01/secret-gov-reports-2-mllion-died-suddenly/", "https://twitter.com/DiedSuddenly_", "https://thehill.com/changing-america/well-being/longevity/588738-huge-huge-numbers-death-rates-up-40-percent-over-pre/", "https://www.nih.gov/news-events/nih-research-matters/using-mrna-technology-universal-flu-vaccine", "https://www.americaoutloud.com/why-dont-we-blow-the-system-up/", "https://www.merriam-webster.com/dictionary/blood%2520money", "https://gingerbreggin.substack.com/p/now-is-the-time-for-a-ban-on-all?utm_source=post-email-title&publication_id=731509&post_id=99535050&isFreemail=true&utm_medium=email", "https://www.europereloaded.com/now-is-the-time-for-a-ban-on-all-mrna-and-dna-vaccines-and-treatments/?share=twitter", "https://www.europereloaded.com/now-is-the-time-for-a-ban-on-all-mrna-and-dna-vaccines-and-treatments/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2023-01-30T07:50:25+00:00"}