{"result_id": "111016", "URL": "https://www.europereloaded.com/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/", "timestamp": "2023-04-25 15:04:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Pfizer Exec Admits “We Never Tested Vaccine Against Transmission”", "cleaned_text": "ER Editor: Here’s another tweet featuring Man of the Hour, Dutch MEP Rob Roos speaking to Tucker Carlson. Kudos to him: “Governments pushed millions of people worldwide to get vxntd … they tricked perfectly healthy young people into taking this jab using false arguments. And they used big words such as ‘anti-social’ to sow immense hatred against people who refused to comply” – Rob Roos, Dutch MEP pic.twitter.com/BQbnskegwa In COVID hearing, #Pfizer director admits: #vaccine was never tested on preventing transmission. “Get vaccinated for others” was always a lie. The only purpose of the #COVID passport: forcing people to get vaccinated. The world needs to know. Share this video! ⤵️ pic.twitter.com/su1WqgB4dO\n\nA senior Pfizer executive has admitted under oath that the company never tested their Covid “vaccine” to see if it prevented transmission. Pfizer’s Chief Executive in Charge of Developing Markets Janine Small was testifying in front of the European Parliament’s Special Committee on Covid19 on Monday, when Dutch MEP Rob Roos asked: “Was the Pfizer Covid vaccine tested on stopping the transmission of the virus before it entered the market?” “Regarding the question around, um, did we know about stopping the immunisation [sic] before it entered the market? No, heh,” She further defended that decision by arguing Pfizer had to “move at the speed of science”. Watch as Pfizer executive Janine Small admits to EU parliament that Pfizer did not test the vaccine for preventing transmission of Covid prior to it being made available to the public. Small says, “We had to really move at the speed of science..we had to do everything at risk.” pic.twitter.com/FvTn01zv3J Now, that the so-called “vaccines” don’t prevent transmission of the alleged virus knowns as “SARSCOV2” is far from news. We’ve known that for well over a year. It’s as undeniable as the fact this “virus” has never been associated with any new disease or that “COVID” is just a new name for old symptoms. The fact the whole thing is a scam has been clearly defined in the official literature for some time. However, Pfizer admitting they never even tried to test it is news. It has long been suspected, given the incredibly short development time, but now it is confirmed. To repeat, they have now admitted on record that from the very beginning they had no idea if their “vaccine” prevented transmission or not. So everyone who said it did was knowingly lying. The mainstream media has gone into revisionist history mode over this news, saying that nobody ever claimed the vaccines prevented transmission. That is a complete and utter lie. See this handy video: Everyone who claimed you needed to get vaccinated to “slow the spread” was lying. Everyone who claimed it was a duty to “protect others” was lying. Covid passports, qr codes, none of it was based on any science at all. To quote Rob Roos MEP again: “Get vaccinated for others” was always a lie. The only purpose of the #COVID passport: forcing people to get vaccinated.\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer Exec Admits “We Never Tested Vaccine Against Transmission” - Europe Reloaded", "description": "ER Editor: Here’s another tweet featuring Man of the Hour, Dutch MEP Rob Roos speaking to Tucker Carlson. Kudos to him: “Governments pushed millions of people worldwide to get vxntd … they tricked perfectly healthy [...]", "url": "https://www.europereloaded.com/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/", "site_name": "Europe Reloaded", "article:published_time": "2022-10-12T11:34:39+00:00", "article:modified_time": "2022-10-12T11:37:26+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/10/PfizerRobRoos-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Off-Guardian", "Janine Small Pfizer", "vaccine does not prevent transmission", "Rob Roos MEP"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">“Governments pushed millions of people worldwide to get vxntd … they tricked perfectly healthy young people into taking this jab using false arguments. And they used big words such as ‘anti-social’ to sow immense hatred against people who refused to comply” – Rob Roos, Dutch MEP <a href=\"https://t.co/BQbnskegwa\">pic.twitter.com/BQbnskegwa</a></p>\n<p>— Know Your Human Rights (@HumanRights4UK) <a href=\"https://twitter.com/HumanRights4UK/status/1580122331204419584?ref_src=twsrc%5Etfw\">October 12, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">🚨 BREAKING:</p>\n<p>In COVID hearing, <a href=\"https://twitter.com/hashtag/Pfizer?src=hash&amp;ref_src=twsrc%5Etfw\">#Pfizer</a> director admits: <a href=\"https://twitter.com/hashtag/vaccine?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccine</a> was never tested on preventing transmission.</p>\n<p>“Get vaccinated for others” was always a lie.</p>\n<p>The only purpose of the <a href=\"https://twitter.com/hashtag/COVID?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID</a> passport: forcing people to get vaccinated.</p>\n<p>The world needs to know. Share this video! ⤵️ <a href=\"https://t.co/su1WqgB4dO\">pic.twitter.com/su1WqgB4dO</a></p>\n<p>— Rob Roos MEP 🇳🇱 (@Rob_Roos) <a href=\"https://twitter.com/Rob_Roos/status/1579759795225198593?ref_src=twsrc%5Etfw\">October 11, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Watch as Pfizer executive Janine Small admits to EU parliament that Pfizer did not test the vaccine for preventing transmission of Covid prior to it being made available to the public.</p>\n<p>Small says, “We had to really move at the speed of science..we had to do everything at risk.” <a href=\"https://t.co/FvTn01zv3J\">pic.twitter.com/FvTn01zv3J</a></p>\n<p>— True North (@TrueNorthCentre) <a href=\"https://twitter.com/TrueNorthCentre/status/1579830040858329089?ref_src=twsrc%5Etfw\">October 11, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://twitter.com/Rob_Roos", "https://t.co/BQbnskegwa", "https://twitter.com/HumanRights4UK/status/1580122331204419584?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Pfizer?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/vaccine?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/COVID?src=hash&ref_src=twsrc%5Etfw", "https://t.co/su1WqgB4dO", "https://twitter.com/Rob_Roos/status/1579759795225198593?ref_src=twsrc%5Etfw", "https://www.news.com.au/technology/science/human-body/pfizer-did-not-know-whether-covid-vaccine-stopped-transmission-before-rollout-executive-admits/news-story/f307f28f794e173ac017a62784fec414", "https://t.co/FvTn01zv3J", "https://twitter.com/TrueNorthCentre/status/1579830040858329089?ref_src=twsrc%5Etfw", "https://off-guardian.org/2021/07/23/new-normal-newspeak-2-vaccine/", "https://www.bmj.com/content/371/bmj.m4037", "https://off-guardian.org/2022/10/12/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/", "https://www.europereloaded.com/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/?share=twitter", "https://www.europereloaded.com/pfizer-exec-admits-we-never-tested-vaccine-against-transmission/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2022-10-12T11:34:39+00:00"}