{"result_id": "111038", "URL": "https://www.europereloaded.com/blame-game-begins-as-mhra-passes-the-buck-all-the-covid-vaccine-authorisation-decisions-were-taken-by-the-government-minister/", "timestamp": "2023-04-25 15:04:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/blame-game-begins-as-mhra-passes-the-buck-all-the-covid-vaccine-authorisation-decisions-were-taken-by-the-government-minister/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Blame Game Begins as MHRA Passes the Buck: “All the Covid Vaccine Authorisation Decisions Were Taken by the Government Minister”", "cleaned_text": "What makes this so interesting is the wider context. Under the Human Medicines Regulations, the Licensing Authority is the Secretary of State for Health. He or she delegates to MHRA all the work associated with that – licensing of medicines, pharmacovigilance, inspection of manufacturers, enforcement and so on.\n\nBut for the Covid vaccines, MHRA is saying that the Secretary of State personally took all the decisions.\n\nI read that as the blame game having started. I’ll explain why.\n\nBack in 2020, MHRA would have known only too well that the clinical trials had been rushed (10 months compared with typical time to market of 5-10 years), had not been comprehensive (e.g. limited pharmacokinetics/pharmacodynamics) and wouldn’t finish until 2024. There were many warnings from experts around the world. MHRA’s line about ‘rolling review’ was, and remains, bunkum.\n\nMHRA scientists and officials would have known about the problems (with all medicines) of scaling up production from small-scale, laboratory-based production for trials purposes to full-scale production. For example, larger quantities of ingredients can be more difficult to mix. They wouldn’t therefore have been surprised to have seen batch problems with the Covid vaccines around the world. One batch resulted in the hospitalisation of 120 children in Vietnam. One batch caused ocular injury to nurses when a vial was broken. In Japan, 1.63 million doses were recalled due to metallic contamination. Probably just the tip of the iceberg.\n\nMHRA then saw adverse event reporting starting to reveal serious safety issues in the U.K. and around the world. First, myocarditis and blood clots, in March 2021, a few weeks after approval of the AstraZeneca vaccine (now effectively withdrawn) and later other heart issues, neurological problems and immunosuppression with Pfizer and Moderna.\n\nMHRA knew in 2020 that the risk to younger age groups from Covid was very low and after rollout it would have seen assessments of vaccine effectiveness falling month on month. It wriggled hard against the evidence in the UKHSA weekly surveillance reports that vaccine effectiveness was even negative for younger age groups.\n\nSince then the Covid vaccine narrative has continued to take a pounding as more clinicians around the world speak up, the research evidence about cardiac, neurological and immunosuppression problems continues to pile up, and the 1,000 per week excess deaths have still not been explained.\n\nMHRA might have been criticised by Baroness Cumberlege for being “unresponsive and defensive”, but its staff aren’t all deaf, blind or stupid. They knew.\n\nSo my inference is that the blame game has started.\n\nMind you, MHRA is on a sticky wicket in any blame game. There are serious shortfalls in its own safety management:\n• It doesn’t have a process for investigating individual Yellow Card reports. It says it tries to investigate individual fatal and serious Yellow Card reports but it doesn’t have a process so it doesn’t know how many it has investigated (FOI 21/1109);\n• It doesn’t actively seek out real-world data – for example, real-world population-level data such as hospitalisation for ‘adverse events of special interest’ segmented by vaccination status and age. In January 2022, MHRA did not hold such data (CSC 88243) and in August 2022, UKHSA (FOI 22/472) only held population level info on thrombosis with thrombocytopenia syndrome (TTS). Instead, it wait [sic] for signal detection from Yellow Card reports of adverse events, which are massively under-reported;\n• It doesn’t (or can’t) define the quantitative level of risk which is ‘acceptable’ as the basis of “acceptably safe” (FOI 22/390);\n• It lost 20% of posts in 2021 due to funding cuts and has 20% vacancies below that new baseline (FOI 22/1007);\n• It doesn’t have a process for delegating the authority to approve medicines for public use (FOI 22/1002) or governance of individuals competence (qualification, experience and training) (FOI 22/1007) to MHRA officers;\n• It has (FOI 22/1083), redacting numbers in tables on the pretext of maintaining patient confidentiality;\n• It appears quietly to have dropped a key strand of its Covid vaccine surveillance: Targeted Active Monitoring. FOI 22/1083 asked for a copy of the latest report but it was 15 months old (August 2021).\n\nBut back to “All the Covid vaccines and therapeutics authorisation decisions were taken by the Licensing Minister and were not delegated.” I’m left wondering what safety advice MHRA gave to Chris Whitty and ministers about the Covid vaccines back in late 2020 and early 2021 and subsequently as the serious safety issues started to emerge. And I wonder what briefings MHRA gave to the Commission on Human Medicines Expert Working Group on Covid Vaccine Benefits and Risks and to the COVID-19 Vaccines Safety Surveillance Methodologies Expert Working Group – neither publishes minutes.\n\nIt’s high time MPs and the Covid Inquiry started to ask some searching questions.\n\nUntil Nick retired a few years ago, he was a Senior Civil Servant in a Government Department.\n\nStop Press: A couple of rogue reporters tried to interview the CEO of Pfizer, Albert Bourla, as he made his way into Davos. He refused to answer a single question.", "opengraph": {"locale": "en_US", "type": "article", "title": "Blame Game Begins as MHRA Passes the Buck: “All the Covid Vaccine Authorisation Decisions Were Taken by the Government Minister” - Europe Reloaded", "description": "ER Editor: This comes belatedly from Mike Yeadon on the Telegram account he shares with Robin Monotti: It just gets worse. Now we learn that the much vaunted U.K. medicines regulator, the MHRA, did not, [...]", "url": "https://www.europereloaded.com/blame-game-begins-as-mhra-passes-the-buck-all-the-covid-vaccine-authorisation-decisions-were-taken-by-the-government-minister/", "site_name": "Europe Reloaded", "article:published_time": "2023-01-20T09:44:21+00:00", "article:modified_time": "2023-01-23T12:22:43+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/01/MHRABlamesHealthMinisterUK-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["FOI request", "responsibility for Covid vaccines", "MHRA", "UK Secretary of State for Health", "Nick Denim Daily Sceptic", "UK Human Medicines Regulations"], "tweets": [], "movies": [], "links": ["https://e.vnexpress.net/news/news/120-children-hospitalized-province-suspends-pfizer-vaccine-batch-4397748.html", "https://www.karger.com/Article/FullText/520500", "https://www.reuters.com/business/healthcare-pharmaceuticals/japan-finds-stainless-steel-particles-suspended-doses-moderna-vaccine-2021-09-01/", "https://dailysceptic.org/2021/10/30/hide-the-vaccine-failure-ukhsa-caves-to-pressure-and-removes-chart-showing-higher-infection-rates-in-the-vaccinated-as-effectiveness-hits-new-low-of-minus-132/", "https://www.immdsreview.org.uk/downloads/IMMDSReview_Web.pdf", "https://www.gov.uk/government/publications/freedom-of-information-responses-from-the-mhra-week-commencing-1-november-2021/freedom-of-information-request-on-yellow-card-data-relating-to-covid-19-vaccinations-foi-211109", "https://dailysceptic.org/2022/08/05/u-k-medicines-regulator-mhra-says-it-has-no-process-to-follow-up-vaccine-adverse-event-yellow-card-reports/", "https://dailysceptic.org/wp-content/uploads/2023/01/CSC-82243-Population-Data.pdf", "https://dailysceptic.org/wp-content/uploads/2023/01/FOI-22_472-Population-Data.pdf", "https://www.gov.uk/government/publications/freedom-of-information-responses-from-the-mhra-week-commencing-14-february-2022/freedom-of-information-request-on-the-regulatory-approval-of-the-covid-19-vaccinations-foi-22390", "https://dailysceptic.org/wp-content/uploads/2023/01/FOI-22_1007-Competency-1.pdf", "https://dailysceptic.org/wp-content/uploads/2023/01/FOI-22_1002-Delegation.pdf", "https://dailysceptic.org/wp-content/uploads/2023/01/FOI-22_1007-Competency.pdf", "https://dailysceptic.org/wp-content/uploads/2023/01/PEAG-Yellow-Card-Vaccine-Monitor.pdf", "https://dailysceptic.org/wp-content/uploads/2023/01/PEAG-Yellow-Card-Vaccine-Monitor.pdf", "https://twitter.com/claytravis/status/1615846954616950784?s=43&t=ooiyQu3nZIkZqx7yrUbnDw", "https://dailysceptic.org/2023/01/19/blame-game-begins-as-mhra-passes-the-buck-all-the-covid-vaccine-authorisation-decisions-were-taken-by-the-government-minister/"], "authors": ["Pam Barker"], "publish_date": "2023-01-20T09:44:21+00:00"}