{"result_id": "111028", "URL": "https://www.europereloaded.com/german-press-discusses-pfizer-vaccine-trial-fraud-will-covid-reckoning-follow/", "timestamp": "2023-04-25 15:04:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/german-press-discusses-pfizer-vaccine-trial-fraud-will-covid-reckoning-follow/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "German Press Discusses Pfizer Vaccine Trial Fraud. Will \"Covid Reckoning\" Follow?", "cleaned_text": "I am pleasantly surprised to see the mainstream German publication Die Welt openly asserting that clinical trials of the “Pfizer COVID vaccine” were rife with fraud. ( , ) What a change!\n\nAgain, click here for the English version saved as a PDF file.\n\nThe article explains that Pfizer unblinded and removed numerous patients who suffered adverse events from the Covid vaccine trial. It also gives examples of Pfizer subjects whose deaths were covered up. One of the victims described by Die Welt is Pfizer subject C4591001 1162 11621327, whose story I unearthed in July of 2022.\n\nAs you remember, Pfizer’s investigators falsely ruled these deaths unrelated.\n\nDie Welt also describes Argentine lawyer Augusto Roux, who remained alive, but whose sufferings were written off as “anxiety.”\n\nThree weeks later, test candidate Roux received the second dose. He remained under observation for 40 minutes, then left the hospital feeling good. In the taxi home he felt uncomfortable, and later he had shortness of breath, burning chest pain, nausea and fever. His urine turned black like cola and he passed out. Three days later, Roux was in the Alemán Hospital, several PCR tests for Covid were negative. Senior physician Gisela di Stilio noted in the discharge report, which is available to WELT: “Adverse reaction to the coronavirus vaccine (high probability)”. The computer tomograph had provided images of fluid in Roux’s heart. A pericardial effusion. Over the next few months, Roux lost 14 kilos, he had liver problems, and his heart sometimes beat irregularly. … The diagnosis for the symptoms after the second vaccination is very likely to be “pericarditis”, inflammation of the heart. All of this fits exactly with a clinical picture that the Paul Ehrlich Institute also has in its list of “rare side effects” for mRNA vaccines.\n\n… He found amazing things there. His story, one might think, should appear in Pfizer’s pivotal study papers, but it doesn’t. The pharmaceutical company’s papers say Roux informed the research team that he was hospitalized with pneumonia on both sides, following the initial report, which was classified as an “adverse event of toxicity level 1”. That could have nothing to do with the vaccine, the file goes on to say, it is probably a Covid infection. Not a word that Roux had tested negative for Corona in several PCR tests.\n\nThe paper finds more cases of Pfizer fraud:\n\nAlmost at the same time as the Roux case, there must have been an incident in the Buenos Aires test center. In one fell swoop, the test management said goodbye to 53 subjects on August 31, 2020. The test candidates were “unblinded”, which means they were informed about their vaccination status, a process that the Pfizer study protocol expressly only provides for “in emergencies”. But there is nothing about it in the approval study. In protocol documents that are available to WELT, and which are actually not intended for the public, those responsible get caught up in contradictions. “\n\nWhile Die Welt does an excellent job at exposing Pfizer’s trial fraud, which the FDA wanted to hide for 75 years, most of what it discussed is not new to us. What is new is that mainstream newspapers are now discussing it.\n\nDie Welt mentions that Pfizer’s contracts included a liability waiver even for Pfizer’s negligence and for “fraud or bad faith on the part of Pfizer itself.“\n\nI expect this “fraud waiver” will be litigated furiously in many countries. In the United States, liability for certain misdeeds, such as fraud, cannot be waived in advance because it would “violate public policy” and encourage fraud. Thus, I expect Ed Dowd’s “fraud vitiates all contracts” doctrine to prevail legally in many localities.\n\nA question that many of us are asking is, “will there be trials?” A friend of this substack, Eugyppius, concludes with regret that “there will be no Corona reckoning in Germany.”\n\nI am not an expert on German politics, but I would like to make a statement: in more than one country, though possibly not in Germany, there WILL be Corona reckoning. A mini-reckoning is already happening in Florida, which gives us a hint of the future. (ER: There is a possibility of this in Thailand)\n\nThe governor of Florida, Ron DeSantis, is a shrewd political operator who expects to benefit politically from defending the public from Covid vaccines.\n\nI am optimistic that some reckoning and some punishments will happen. Consider this:\n• Almost everyone was affected by Corona vaccinations. People were either vaccinated or discriminated against, with the extent of discrimination varying from country to country.\n• Covid vaccination harmed a significant fraction of vaccine recipients. The harms are numerous. A Thailand study found 29% of young males having subclinical heart damage, for example. I discussed, numerous times, immune system damage affecting vaccinated people who suffer Covid reinfections and endless other illnesses.\n• While many vaccinated individuals do not realize that Covid vaccines affected them, they can be easily convinced that they are vaccine victims when presented with evidence.\n• Many vaccinated people had multiple COVID infections. If nudged, they will see the apparent disconnect between promises and the ugly reality.\n• Lawsuits against Big Pharma, and possibly against Google and Facebook, will, naturally, make many people consider whether they are also victims when financial compensation becomes a possibility.\n• People understandably fear death, and the excess mortality we are experiencing worldwide should unsettle any person whose risk of death is heightened in a mysterious, unknowable way.\n• Many political operators will realize they can build a career by being anti-Covid-vaccine and demanding retributions. While this has the potential of turning ugly, it is an important factor.\n• There is a possibility of mass hysteria created around “will the Covid vaccine kill me,” which the above-mentioned political operators can turn to their advantage.\n\nThe most important determinant of how much “Corona reckoning” we will see is the future fate of humanity and the disturbing trends of excess mortality and infertility.\n\nI want these trends to reverse, and mortality and fertility to return to normal. Such a fortunate turn of events would necessitate only a moderately serious reckoning.\n\nIn the highly undesirable case of the general public’s health trends taking a turn for the worse, stricter punishments against people who lied to us and forced the public to take the deadly experimental vaccines would be perfectly acceptable.\n\nNational laws may need to be revised to allow legal punishment of wrongdoers who participated in a novel global biomedical crime that harmed billions of humans. In plenty of precedents, crimes against humanity committed under the color of national laws were successfully prosecuted.\n\nSo… do you think at least one country will see any “Corona reckoning”?", "opengraph": {"locale": "en_US", "type": "article", "title": "German Press Discusses Pfizer Vaccine Trial Fraud. Will \"Covid Reckoning\" Follow? - Europe Reloaded", "description": "German Press Discusses Pfizer Vaccine Trial Fraud. Will “Covid Reckoning” Follow? “Pfizer fraud” now openly discussed in mainstream national press   IGOR CHUDOV I am pleasantly surprised to see the mainstream German publication Die Welt [...]", "url": "https://www.europereloaded.com/german-press-discusses-pfizer-vaccine-trial-fraud-will-covid-reckoning-follow/", "site_name": "Europe Reloaded", "article:published_time": "2023-02-18T08:31:27+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/02/PfizerfraudGermanpress.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Augusto Roux Argentina", "Pfizer fraud", "Igor Chudov", "Pfizer vaccine trials", "Die Welt"], "tweets": [], "movies": [], "links": ["https://archive.is/m3snI", "http://igor.chudov.com/tmp/Die-Welt.pdf", "http://igor.chudov.com/tmp/Die-Welt.pdf", "http://igor.chudov.com/tmp/Die-Welt.pdf", "https://www.eugyppius.com/p/dont-be-fooled-by-dumb-talkshows", "https://www.mdpi.com/2414-6366/7/8/196", "https://igorchudov.substack.com/p/yes-covid-vaccines-unset-and-erase", "https://igorchudov.substack.com/p/google-and-facebook-owe-compensation", "https://igorchudov.substack.com/p/is-depopulation-we-are-seeing-planned", "https://igorchudov.substack.com/p/german-press-discusses-pfizer-vaccine?utm_source=cross-post&publication_id=441185&post_id=103552464&isFreemail=true&utm_campaign=1032096&utm_medium=email"], "authors": ["Pam Barker"], "publish_date": "2023-02-18T08:31:27+00:00"}