{"result_id": "111001", "URL": "https://www.europereloaded.com/andrew-bridgen-mp-speaks-out-for-vaccine-truth/", "timestamp": "2023-04-25 15:04:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/andrew-bridgen-mp-speaks-out-for-vaccine-truth/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Andrew Bridgen MP Speaks Out for Vaccine Truth", "cleaned_text": "ER Editor: Kudos to now independent MP Andrew Bridgen. Bridgen was speaking briefly (3 minutes) at a Truth Be Told rally this past weekend, which took place outside the BBC studios in London.\n\nHere is the site link: https://covileaks.co.uk/awareness-month. Of note:\n\nThe purpose of this campaign is to raise awareness about the damage, including life changing injuries and fatalities as a direct result of the COVID-19 Vaccines; with a view to support various groups in their missions and campaigns. We need to change the public perception that is a result of mainstream media suppression of facts. Most importantly we intend to give a voice to the injured and bereaved. Here you will find information on our COVID Vaccine Victim Awareness Month and how you can get involved.\n\nOther short speeches at last weekend’s Truth Be Told rally can be found here on Rumble at the Oracle Films channel:\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.\n\nDisclaimer: The information and opinions shared are for informational purposes only including, but not limited to, text, graphics, images and other material are not intended as medical advice or instruction. Nothing mentioned is intended to be a substitute for professional medical advice, diagnosis or treatment.", "opengraph": {"locale": "en_US", "type": "article", "title": "Andrew Bridgen MP Speaks Out for Vaccine Truth - Europe Reloaded", "description": "ER Editor: Kudos to now independent MP Andrew Bridgen. Bridgen was speaking briefly (3 minutes) at a Truth Be Told rally this past weekend, which took place outside the BBC studios in London. Search Andrew [...]", "url": "https://www.europereloaded.com/andrew-bridgen-mp-speaks-out-for-vaccine-truth/", "site_name": "Europe Reloaded", "article:published_time": "2023-01-24T08:25:42+00:00", "article:modified_time": "2023-01-24T08:30:03+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/01/BridgentruthbetoldJan2023-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Andrew Bridgen MP", "COVID-19 vaccines", "Truth Be Told rally Jan 2023", "covileaks.co.uk"], "tweets": [], "movies": [], "links": ["https://www.europereloaded.com/?s=bridgen", "https://covileaks.co.uk/awareness-month", "https://rumble.com/user/OracleFilms", "https://rumble.com/v26rqrm-andrew-bridgen-truth-be-told-london-21.01.2023.html", "https://www.europereloaded.com/andrew-bridgen-mp-speaks-out-for-vaccine-truth/?share=twitter", "https://www.europereloaded.com/andrew-bridgen-mp-speaks-out-for-vaccine-truth/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2023-01-24T08:25:42+00:00"}