{"result_id": "111027", "URL": "https://www.europereloaded.com/analysis-of-a-single-drop-of-the-pfizer-vaccine-on-december-26-2022/", "timestamp": "2023-04-25 15:04:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/analysis-of-a-single-drop-of-the-pfizer-vaccine-on-december-26-2022/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Analysis of a single drop of the Pfizer “vaccine” on December 26, 2022", "cleaned_text": "ER Editor: This video shows some very important things and highlights a fracture in the narrative being pushed by certain ‘doctors for truth‘. Biostatistician Ricardo Delgado of La Quinta Columna (5th Column) pulls no punches in this video about there not only being different graphene structures in these vaccines, but that the medical freedom movement has some well-placed, very high-profile traitors in it. We agree.\n\nThis is the link to the La Quinta Columna site.\n\n#English – Analysis of a single drop of the Pfizer “vaccine” on December 26, 2022. Graphene-based carbon nanotubes, graphene microfilaments, graphene sheets, all in a single drop. There is no mRNA in the vaccine. What it contains is not organic.\n\n. We are very grateful. ER: Marie De Plume has kindly provided us with an English transcript from the. We are very grateful.\n\n“ANALYSIS OF A SINGLE DROP OF THE PFIZER «VACCINE», AS OF DECEMBER 26, 2022. GRAPHENE-BASED CARBON NANOTUBES, GRAPHENE MICROFILAMENTS, GRAPHENE SHEETS. ONLY AND EXCLUSIVELY GRAPHENE. THERE IS NO MRNA IN THE ‘VACCINE’. WHAT IS INSIDE IS NOT BIOLOGICAL.” –\n\n”All this is technological. It is not biological. The latest research by both Dr Nagase and Juan Garberi and also from Lorena Diblasi show that neither phosphorus nor hydrogen are present in the sample. Therefore the fundamental atoms of life do not exist. No genetic material either. The mNRA platform as such doesn’t exist. M. Malone is probably another impostor.\n\n […]\n\n The Pfizer vaccine famous lipid nanoparticules, we were told. Of course, “we have found the patent for lipid nanoparticles and they have two graphene faces!” Do you understand [that this is a lie] now? By the way, this is not going to stay like this. I say this to all those who have lied and continue to lie: what you’re protecting today is your arse, but we’re going to chase you down the street. Somehow at La Quinta Columna, we decree that these people who have blatantly lied, are enemies and criminals for all humanity, who do not have or shouldn’t have the capacity to even live in our world, much less to go out on the streets.\n\n […]\n\n See here how that formation is dragged by a little dot. These are already single-walled carbon nanotubes, more elaborately shaped, which is graphene geometrically arranged in a tubular fashion. It’s used in the field of neuroscience as branches or neural networks. What it’s going to do is establish connections between one neuron and another. And from there, since this material absorbs radiation, the phenomenon of neuromodulation and neurostimulation is possible, as well as altering certain brain areas to obtain certain patterns of behaviour in the population. This isn’t science fiction, this is science. Neuroscience and nanotechnology that go hand in hand here.\n\n […]\n\n We also have to count on the complicity of a series of individuals who called themselves to be dissidents in groups called for the truth. Not all of those who were part of these groups, most of them had good intentions. But their heads were directed towards certain focuses of interpretation, such as certain nonexistent proteins, or even the official version of a biological pathogen such as SARS-CoV-2 etc. They’ve been people who are really part of the ruling party, and that the ruling party sends as the front line to directly battle with the real dissidents that was going to discover exactly what is inside the injectables. I’m referring to the famous groups for the truth, doctors for the truth, biologists for the truth. False dissidents. Criminals sent directly by the pro-government political forces to precisely combat the evidence in the face of their real misinformation. They’re the guardians of the truth, precisely to allow concealing the introduction of the interface. Remember that there’s a lot of money here — all they want and more — just to cover, cover and cover. By the way, these people have been characterised throughout this time, I’m talking about the famous collectives for the truth, for telling everyone that the analyses we do are worthless, when they have done absolutely no analysis at all, and have directly discredited ours, and have even launched accusations, personal messages, direct threats and accusations against me and Dr. Sevillano, and Dr. Campra himself. However, as time goes by, I can say and I promise that you will be hunted practically until eternity. It’s also the engine that drives La Quinta Columna: that the criminals pay directly, that they end up hanging in a public square or just where they really deserve to be, in jail. Another of their notions was that analysing of the vaccine was a waste of time, they told the dissident camp. You had to read the papers that precisely spewed up the above version. […] We have the direct source of information. There is no intermediary. (…) Well, now you are the ones looking through the microscope, aren’t you, Dr Ryan Cole and Ms Natalia Prego? We are not only interested in the damage, but also in what causes the damage. (…) Indeed, you are traitors to the entire human species. We don’t know what they promised you, except money and funding. (…) A series of characters have appeared in our country and in other parts of the world as well, to help call sects all those who present evidence. And ultimately you will also be persecuted, not only by the Quinta Columna, but by the whole of humanity that you have betrayed.\n\n […]\n\n Someone comments: ‘An article has come out saying that in Barcelona they have sequenced the virus’. How have they done it? Indeed, with computer methods, which doesn’t mean, sequencing doesn’t mean isolation. Isolation is physical. That is I have the pathogen introduced in an urn, in a culture broth if it’s bacterial, I have it there, in situ. Sequencing is virtual using computer algorithms. They take a lettuce seed, and from there, from a genetic information which is usually a tiny amount of less than 1%. They extrapolate, that is, they invent the rest, okay? Therefore, do not see sequencing as isolation. Neither as characterisation, nor isolation, nor purification, and much less compliance with Koch’s postulates, which is to introduce it and see that it is responsible for the disease. Logically, they’re not even going to introduce anything because they do not have isolation, as I’ve said, of the real pathogen, nor will they ever have it.\n\n And by the way, the images that appear in the media, on the official television broadcasts, are CGI, i.e. images made with a computer. Remember that saying things clearly and loudly is not the same as giving up, much less cowardice. In this case, it’s a matter of being a little bit brave. But regardless of that, the truth is protection and shelter for those of us who defend it and we will continue to do so. It stands the test of time. The consequence of lying is that at some point it can betray you. Which indeed will happen to these people.\n\n […]\n\n When you look into the microscope and you look at one of those vials called vaccine, when you look at one of them, then see if you dare to even mention La Quinta Columna. In the meantime, wash your mouth out with bleach if necessary. You keep talking about climate change and all those other antics to keep the system warm, that’s directly providing you with the cushion to get home, although it’s also killing you with sclerosis, because you suffer from multiple sclerosis. We’re going to see it in one of the news, which is also a consequence of radiation. But you tell us, Don Bruno, that you have hope. You are hopeful that the new mRNA platform has made progress in its pseudo-scientific fight against sclerosis, when in fact the famous mRNA platform does not exist as such. It is only a nanotechnology based on graphene (…) But the ‘science’ you defend is made precisely for the naive, eh? Not only are you protecting the system, but you are also fuelling your own death.\n\n […]\n\n More graphene filaments. Now we have a view, let’s say a panorama with low magnification, only 100 magnification here. And these are single-walled carbon nanotubes, used in the neuroscientific field as neural networks. Here we see it at a wider wheel. Look at what’s going on. We’re looking at a single drop, right? Not ten drops, not four or five. A single drop of one half square centimeter under the Haxon Aquiles II optical microscope, an upper midrange microscope, but this would be visible under even a low end microscope. The camera is the H-Aptina 5.0. (…) Well, what is this? A telephone network? That’s amazing. Here, fortunately or unfortunately, we no longer know how to say it anymore, we’re normalising the fact that we see this in injections. We have looked at over 400 injectables already. We have over 1,000 hours of observation with optical microscopy, so we don’t take lessons from anyone. It doesn’t matter how many degrees they put on top, precisely the titles are only good for that, for the headlines, but nothing else.”\n\n […]", "opengraph": {"locale": "en_US", "type": "article", "title": "Analysis of a single drop of the Pfizer “vaccine” on December 26, 2022 - Europe Reloaded", "description": "ER Editor: This video shows some very important things and highlights a fracture in the narrative being pushed by certain ‘doctors for truth‘. Biostatistician Ricardo Delgado of La Quinta Columna (5th Column) pulls no punches [...]", "url": "https://www.europereloaded.com/analysis-of-a-single-drop-of-the-pfizer-vaccine-on-december-26-2022/", "site_name": "Europe Reloaded", "article:published_time": "2023-01-08T11:11:29+00:00", "article:modified_time": "2023-01-09T07:23:35+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/01/GrapheneFakeDoctors-min1.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Dr. Jose L. Sevillano", "La Quinta Columna", "neurones & nanotechnology", "neuroscience", "Ricardo Delgado", "graphene oxide", "single drop of Pfizer vaccine", "Dr. Pablo Campra", "Dr. Robert Malone", "Dr. Ryan Cole"], "tweets": [], "movies": [], "links": ["https://www.laquintacolumna.info/translations/analyse-dune-seule-goutte-du-vaccin-pfizer-le-26-decembre-2022/", "https://www.laquintacolumna.info/translations/analyse-dune-seule-goutte-du-vaccin-pfizer-le-26-decembre-2022/", "https://www.laquintacolumna.info/translations/analyse-dune-seule-goutte-du-vaccin-pfizer-le-26-decembre-2022/", "https://www.profession-gendarme.com/analyse-dune-seule-goutte-du-vaccin-pfizer-le-26-decembre-2022/"], "authors": ["Pam Barker"], "publish_date": "2023-01-08T11:11:29+00:00"}