{"result_id": "111040", "URL": "https://www.europereloaded.com/denmark-bans-covid-vaccine-for-youth-under-18/", "timestamp": "2023-04-25 15:04:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/denmark-bans-covid-vaccine-for-youth-under-18/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Denmark Bans COVID Vaccine for Youth Under 18", "cleaned_text": "Denmark has announced that people under the age of 18 are no longer allowed to get the COVID vaccine.\n\nThose wanting their first shot were cut off after July 1, and no one in the age group — aside from those who are considered “high risk” and have a doctor’s note — will be allowed to get a second shot after September 1.\n\n“Children and adolescents only very rarely become seriously ill from COVID-19 with the omicron variant. Therefore, from July 1, 2022, it will no longer be possible for children and adolescents under the age of 18 to get the 1st [shot], and from September 1, 2022, it will no longer be possible to get the 2nd [shot],” reads a government statement. [translated from Danish]\n\nWhile many are likely relieved because it means that vaccine mandates won’t be coming back to school, few have followed Denmark’s lead, and if the science is universal, it’s a wonder why they haven’t.\n\nFor example, despite this decision from Denmark, babies are now eligible to receive three rounds of Moderna’s Covid vaccine in Canada, even though COVID poses no greater threat to babies than the flu does, and Health Canada admits they lack long-term safety data.\n\nMoreover, various health authorities have recently highlighted the risks of adverse effects that exist from the COVID vaccines.\n\nGermany’s ministry of health recently tweeted there’s a 1 in 5,000 chance people receive a “serious adverse effect” from the vaccines.\n\nThis came just days after Ontario’s CMHO refused to say healthy people “should” get boosted with what he referred to as a “therapeutic” due to the risk of myocarditis being 1 in 5,000.\n\nWhile it seems that more and more authorities are warning of the risks of vaccines — which, according to Denmark, are greater than the risk of COVID for the young and healthy — few countries are willing to say outright that the risks outweigh the benefits.", "opengraph": {"locale": "en_US", "type": "article", "title": "Denmark Bans COVID Vaccine for Youth Under 18 - Europe Reloaded", "description": "ER Editor: See also this by Dr. Paul Alexander – Denmark: it is over! We are done with fraud fake COVID vaccines; none for kids! “Danish News Round-Up: Danish government no longer recommending vaccines for [...]", "url": "https://www.europereloaded.com/denmark-bans-covid-vaccine-for-youth-under-18/", "site_name": "Europe Reloaded", "article:published_time": "2022-08-10T09:54:08+00:00", "article:modified_time": "2022-08-10T10:59:50+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/08/DenmarkbansCVshotsyouth-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Covid vaccines banned", "under 18s", "Denmark", "Mike Campbell Countersignal"], "tweets": [], "movies": [], "links": ["https://www.sst.dk/da/corona/vaccination", "https://thecountersignal.com/health-canada-approves-covid-vaccines-for-babies/", "https://thecountersignal.com/fda-authorizes-mrna-covid-vaccine-for-babies/", "https://thecountersignal.com/germany-admits-adverse-reaction-risk-from-covid-vaccine/", "https://thecountersignal.com/ontario-expands-4th-vaccine-eligibility-warns-of-myocarditis/", "https://thecountersignal.com/denmark-bans-covid-vaccine-for-youth-under-18/"], "authors": ["Pam Barker"], "publish_date": "2022-08-10T09:54:08+00:00"}