{"result_id": "111005", "URL": "https://www.europereloaded.com/uk-mp-is-suspended-from-parliament-a-week-after-vaccine-harms-speech-but-he-has-not-been-silenced/", "timestamp": "2023-04-25 15:04:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/uk-mp-is-suspended-from-parliament-a-week-after-vaccine-harms-speech-but-he-has-not-been-silenced/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "UK MP is Suspended from Parliament a Week after “Vaccine Harms\" Speech But He Has Not Been Silenced [VIDEO]", "cleaned_text": "He has since been suspended from attending Parliament. But this hasn’t stopped him from speaking out. This week he has given interviews with Irreverend and, a few days later, James Delingpole. In this article, we refer to the first interview. You can watch Mr. Bridgen’s interview with Delingpole HERE.\n\nMr. Bridgen’s speech is on both Parliament TV and YouTube. And, despite Mr. Bridgen sending them a press pack, corporate media have gaslighted it except for an article the next day in the Express and Scottish Daily Express.\n\nOf course, Full Fact has written a blog. “Yellow Card reporting rate estimates shouldn’t be applied to Covid-19 vaccines,” they wrote. Why? Because “it is estimated that only 10% of serious reactions and between 2 and 4% of non-serious reactions are reported,” Full Fact said without so much as a hint of recognising the irony in their reasoning.\n\nAnother argument Full Fact attempted to make was that absolute risk reduction and relative risk reduction are two different things – a point Mr. Bridgen had already highlighted in his speech. On another point, simply because Full Fact’s bloggers weren’t able to replicate statistics Mr. Bridgen used from a study regarding children under 5, the blogger determines Mr. Bridgen’s statistics can’t be true.\n\nThe final point Full Fact made beggars belief. The conscientious bloggers overlooked the part in Mr. Bridgen’s speech regarding the conflicts of interest and corruption in the UK’s regulatory bodies and boldly argued Mr. Briggen must be wrong because “mRNA Covid-19 vaccines have been approved as safe and effective.” You couldn’t make it up!\n\nA week to the day after Mr. Bridgen courageously gave his speech calling for the suspension of Covid injections, he was given a 5-day suspension from Parliament and could be in danger of losing almost a month’s pay.\n\nThe reasons given for the suspension were:\n• two days for failing to declare that he received a paid trip to Ghana in eight emails to ministers; and\n• three days for writing to the Standards Commissioner Kathryn Stone asking if she had been lobbying to receive a peerage.\n\nExpress UK reported that there had been concerns that he could have had his suspension doubled to 10 days after an appeal, which would have triggered a recall vote in his constituency but his suspension remains at five days.\n\nAs the news of Mr. Bridgen’s suspension was breaking, Darren McCaffrey of GB News reported that Mr. Bridgen’s suspension was in no way related to his speaking out against vaccine harms because it dates back to a couple of months ago. Mr. Bridgen had filed an appeal and it was his appeal that was denied on Tuesday.\n\nHowever, we cannot ignore that Mr. Bridgen was suspended from Parliament and is also the one who publicly called out the safety of the Covid injections in no uncertain terms. Mr. Bridgen may have been found guilty of breaking the rules, but is he the only one?\n\nThere have been 11 MPs suspended from Parliament since the beginning of 2020, each being given between one and five days suspension. Installed Prime Minister Rishi Sunak is not one of them. Whatever Mr. Bridgen’s trip to Ghana was worth, it’s nowhere near the amount of £2.1m per year income tax Sunak’s wife avoided paying. This tax avoidance was also happening when Sunak was Chancellor of the Exchequer and was responsible for raising revenue through taxation or borrowing and for controlling public spending.\n\nSunak is not the only MP who as acted dubiously over the last three years. For more than a year, Good Law Project has been working to uncover the politically-connected firms that benefitted from the Government’s £37 billion Test and Trace programme. “We know that 50 companies with close links to Ministers, Peers and Government officials were given access to a priority route through which they secured lucrative Covid testing contracts,” they wrote in June. Michael Gove was one of those who referred firms down a fast track ‘VIP’ route to bid for lucrative Test and Trace contracts.\n\nThere were also VIP Lanes for personal protective equipment (“PPE”) referred by, for example, Siobhan Baillie, MP for Stroud. According to a National Audit Office (“NOA”) report in March 2022, the Department of Health & Social Care (“DHSC”) had awarded 394 PPE contracts worth £7.9 billion. Of the 394 contracts awarded, 115 were awarded to 51 VIP lane suppliers. And surprisingly little of the PPE reached its intended destination. NOA’s report stated that DHSC had received 31.5 billion items of PPE in the UK (of which only 55% had been actually distributed to health and social care settings), with another 1.4 billion stored in China and 5.0 billion still to be received.\n\nHow many of the MPs involved in VIP Lanes have been investigated or suspended?\n\nOn Saturday Irreverend interviewed Mr. Bridgen about the emerging evidence that calls into question the safety of mRNA injections.\n\nThe scientific evidence does not support the further use of the mRNA vaccines, Mr. Bridgen said.\n\nMr. Bridgen had read biological sciences at Nottingham University. He specialised, mostly, in genetics and behaviour. His dissertation in his final year was on viruses and viroids.\n\nHe was uncomfortable with the Government’s lockdown policies and approach to the so-called Covid pandemic. (Yes Mr. Bridgen used the term “so-called Covid pandemic”!) “I was very reluctant to vote for the lockdowns,” he said.\n\n“I didn’t vote for the last two lockdowns. I voted against ‘Plan B’. I’m sceptical about the mask-wearing.” However, to begin with, Mr. Bridgen wasn’t sceptical about the Covid injection. He has had two doses of Oxford-AstraZeneca. But “the data that’s coming in from harms – the Yellow Card data – and then when you actually speak to sceptical professionals but they take you through the scientific papers and the evidence … [its] deeply worrying,” he said. “[The vaccines] are not safe, they’re not effective and they’re not necessary.”\n\nMr. Bridgen met with Pfizer in November 2020. “These people [from Pfizer] told me then … that we’ll be taking these vaccines every three months for the rest of our lives and, basically, they were going to make a fortune out of us,” he said.\n\nMr. Bridgen is hoping that, following his appeal, scientists, doctors, nurses and those in the media who know but aren’t saying anything will take some strength and courage from his remarks. “Now’s the Time to come forward,” he said.\n\nThere are other MPs, from both sides of the House, who have the same concerns, said Mr. Bridgen, but they’re scared and afraid to speak out.\n\nIf the video above is removed from YouTube you can watch it on Rumble HERE or Odysee HERE.\n\nHow should we, the people, respond to what is happening. We need to stand up and let our voices be heard. GB News’ Neil Oliver sums it up in one of his world-famous monologues: “If our MPs don’t care enough about harms to population, it’s time we reminded the whole damned lot of them we are still here.”", "opengraph": {"locale": "en_US", "type": "article", "title": "UK MP is Suspended from Parliament a Week after “Vaccine Harms\" Speech But He Has Not Been Silenced [VIDEO] - Europe Reloaded", "description": "ER Editor: We published UK MP Andrew Bridgen‘s famous 17 minute speech to a scandalously empty Parliament chamber. See Leading Figure in British Heart Foundation is Suppressing Evidence of Vax Heart Damage, MP We’re putting [...]", "url": "https://www.europereloaded.com/uk-mp-is-suspended-from-parliament-a-week-after-vaccine-harms-speech-but-he-has-not-been-silenced/", "site_name": "Europe Reloaded", "article:published_time": "2022-12-23T09:24:40+00:00", "article:modified_time": "2022-12-23T09:42:34+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/12/BridgenSuspended-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["James Delingpole", "Rhoda Wilson The Expose", "Andrew Bridgen MP", "Ghana", "Neil Oliver"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "639", "height": "360", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" src=\"https://www.youtube.com/embed/ryzvDNIcEn0?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" width=\"639\" height=\"360\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/ryzvDNIcEn0?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://irreverendpod.com/", "http://delingpoleworld.com/", "https://www.bitchute.com/video/nuSM403eyGME/", "https://www.express.co.uk/news/politics/1709123/tory-mp-covid-vaccine-inflaming-heart-arteries-commons-debate-update", "https://www.scottishdailyexpress.co.uk/news/uk-news/mp-compares-blind-eye-over-28727959", "https://fullfact.org/health/andrew-bridgen-vaccine-safety-debate/", "https://www.express.co.uk/news/politics/1711726/Andrew-Bridgen-suspended-Parliament-breaching-MP-lobbying-rules-appeal-fail", "https://twitter.com/GBNEWS/status/1605161624624541697", "https://commonslibrary.parliament.uk/research-briefings/sn02430/", "https://www.bbc.co.uk/news/uk-politics-61045825", "https://www.gov.uk/government/ministers/chancellor-of-the-exchequer", "https://goodlawproject.org/page/1/?s=VIP+Lane", "https://goodlawproject.org/ministers-vip-test-trace-contracts/", "https://goodlawproject.org/michael-gove-lord-agnew-testing-vip-lane/", "https://www.nao.org.uk/reports/investigation-into-the-management-of-ppe-contracts/", "https://www.nao.org.uk/wp-content/uploads/2022/03/Investigation-into-the-management-of-PPE-contracts_with-CS-Summary.pdf", "https://expose-news.com/2022/11/02/strong-correlation-vaccine-and-excess-deaths-says-mp/", "https://rumble.com/v21016o-stop-the-vaccine-roll-out-with-mp-andrew-bridgen.html", "https://odysee.com/@irreverend:5/vaccines-potential-harms-with-andrew:2", "https://expose-news.com/2022/12/22/mp-is-suspended-from-parliament/"], "authors": ["Pam Barker"], "publish_date": "2022-12-23T09:24:40+00:00"}