{"result_id": "111026", "URL": "https://www.europereloaded.com/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "timestamp": "2023-04-25 15:04:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Experts Estimate 20 Million Are Already Dead Due to Covid Vaccination & Over 2 Billion Injured", "cleaned_text": "ER Editor: These calculations, provided by Peter Halligan on his substack account (linked to below), are based on the Lazarus Report or as is more commonly known, the Harvard-Pilgrim study from 2011, which estimated that less than 1% of vaccine adverse events are ever reported. To our knowlege, this claim has stood the test of time.\n\nAs many independent doctors have noted, this ‘vaccine’ has been the deadliest so far produced.\n\nExperts estimate 20 million are already dead due to COVID Vaccination & over 2 billion injured\n\nPeeling back the layers of deception and obfuscation reveals a shocking truth that may not be all that shocking to our informed readers: Covid-19 “vaccines” are injuring and killing far more people than the government is letting on. Estimates compiled from pieced-together data suggest that as many as 20 million people worldwide have died so far from the shots, while another 2.2 billion have suffered injuries – and we are only just getting started. “Add the EUDRA and VAERS adverse event data on deaths and “events” together, multiply by an under-reporting factor of 40, globalize the EU+US one-eighth share of 12.5 billion global doses. VAERS (take only the US data) 13,972 deaths and 854,084 adverse reactions to 5 August 2022 EUDRA (ignore the headline and scoot to the first image on the landing page) – 46,999 deaths and 4,731,833 injuries 76,789 Deaths, 6,089,773 Injuries Reported in U.S. and European Databases Following COVID-19 Vaccines – Vaccine Impact Number of US injections = around 600m (increased to 608 million in the last few weeks) CDC COVID Data Tracker: Vaccinations in the US Number of EU injections = around 900m (increased to 915 million in the last few weeks) Number of global injections = around 12 billion (increased to 12.5 billion in the last few weeks) The showing less than one in 100 vaccination injuries are reported – see page 6 of 7 that states – “..fewer than 1% of vaccine adverse events are reported. Low reporting rates preclude or slow the identification of “problem” drugs and vaccines that endanger public health.” Using a one in 100 under-reporting factor (URF) would make the injections horribly deadly and injurious (1.4 million deaths and 85 million injuries for the 600 million doses administered). A more recent attempt at estimating the URF is around 40, here: and EU+US injuries = 854,084 + 6,089,773 = 6,943,857 (multiple per person, half of which are “serious”). Multiply by 40 for URF and then by 8 to “globalize” Global deaths are around 19.5 million SO FAR and global injuries are around 2.2 billion. In the coming months and years, these figures will balloon even higher as lingering spike proteins progressively damage the bodies of the “fully vaccinated,” leaving them prone not only to every illness that comes along (autoimmune disease) but also to deadly clots (i.e., myocarditis and pericarditis). It requires a bit of digging to come up with the aforementioned figures as governments work overtime to keep all pertinent data hidden, or at least confusing. The way post-injection injuries and deaths are calculated varies from country to country and even from municipality to municipality, making it difficult to come up with accurate numbers. The safety and effectiveness claims for the shots are also highly skewed, one way being how “cases” of the Fauci Flu are determined. All throughout the alleged pandemic, illnesses and deaths were falsely attributed to the “virus” so that later the injections could be framed as the “cure.” In 2020, before the official launch of the vaccines, the annualized rate of covid “cases” was around 70 million – and keep in mind that the official definition of a “case” is still just as murky today as it was at the beginning of the “pandemic”. Following the launch of Operation Warp Speed in the USA, the annualized number of Covid cases increased nearly fivefold to 330 million. The annualized mortality rate also increased from 1.7 million pre-Operation Warp Speed to 2.9 million post-Operation Warp Speed. This is significant because it shows that the shots are not “saving lives” as is still being claimed. The opposite is actually true as many more people are getting sick and dying in the injection era. “Rather than a 95% (or 91% in the trials) reduction in cases and deaths, there has been a 370% INCREASE in the annualized case rate,” . “Annualized Deaths have INCREASED by 180%.” Halligan looked at data in the government’s Vaccine Adverse Event Reporting System (VAERS) to come up with the 20 million dead and 2.2 billion injured figures. Since VAERS only captures a very small percentage of actual vaccine-related adverse events, Halligan extrapolated true figure estimates using multiplication. The “butcher’s bill from the battlefield,” as he calls it, points to these figures being far more accurate than anything the government or Big Pharma are admitting. And were these figures to spread widely across the population, there would surely be a whole lot of angry folks with a lot of questions for the powers that be.\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "type": "article", "title": "Experts Estimate 20 Million Are Already Dead Due to Covid Vaccination & Over 2 Billion Injured - Europe Reloaded", "description": "ER Editor: These calculations, provided by Peter Halligan on his substack account (linked to below), are based on the Lazarus Report or as is more commonly known, the Harvard-Pilgrim study from 2011, which estimated that [...]", "url": "https://www.europereloaded.com/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/", "site_name": "Europe Reloaded", "article:published_time": "2022-10-01T11:42:43+00:00", "article:modified_time": "2022-10-01T11:51:40+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2022/10/20MillionDeadVVV-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["adverse events from Covid vaccine", "Peter Halligan", "VAERS", "The Expose", "Harvard Pilgrim Healthcare study 2011", "COVID vaccines", "EudraVigilance", "Lazarus Report", "deaths from Covid vaccine"], "tweets": [], "movies": [], "links": ["https://peterhalligan.substack.com/p/call-to-arms-the-spike-wars", "https://peterhalligan.substack.com/p/20-million-saved-or-20-million-killed", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://peterhalligan.substack.com/p/call-to-arms-the-spike-wars", "https://expose-news.com/2022/10/01/20milllion-dead-covid-vaccination/", "https://www.europereloaded.com/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/?share=twitter", "https://www.europereloaded.com/experts-estimate-20-million-are-already-dead-due-to-covid-vaccination-over-2-billion-injured/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2022-10-01T11:42:43+00:00"}