{"result_id": "111048", "URL": "https://www.europereloaded.com/leaked-documents-show-vaccine-conspiracy-in-austria/", "timestamp": "2023-04-25 15:05:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/leaked-documents-show-vaccine-conspiracy-in-austria/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Leaked Documents Show 'Vaccine' Conspiracy in Austria", "cleaned_text": "This is literally ‘hot off the ‘presses’: Austrian alternative media outlet Der Status published leaked documents from the Austrian Chamber of Physicians (Ärztekammer) that show, beyond reasonable doubt, the grand conspiracy between government, the Chamber, and its protagonists.\n\nWithout much further ado, here’s my translation; as always, emphases and bottom lines mine. The text below has been lightly edited for clarity.\n\nThe Austrian Medical Association, under the ousted red [i.e., Social-Democratic] president Szekeres and its current president Steinhart, worked closely with the Health Ministers for years. And in doing so, it betrayed the interests of doctors. [to say nothing about patients]\n\nIn April 2020, Szekeres, Steinhart, and Minister Anschober [Greens, since retired] signed a ‘Memorandum of Understanding Concerning COVID-19 Vaccinations’. That is, at a time—more than half a year—before the conditional approval of these injectable products, this Memorandum dealt with, among other things, advertising campaigns by doctors for the vaccinations, the vaccination of health-care workers and their family members, vaccinations in homes and schools, and reimbursement agreements.\n\nYet, secretly, an additional deal was also negotiated: it was literally agreed that ‘clear blanket vaccination recommendations will be made via the National Immunisation Consortium (Nationales Impfgremium, or NlG) on the suitability of the various vaccines and their applicability, esp. for various high-risk groups’.\n\nExplosive: the Minister of Health and the Austrian Medical Association leadership signed a contract in which they go over the head of the National Immunisation Consortium—and they did so long before the injections were even available—to determine what the National Immunisation Consortium will recommend.\n\n[this means, in other words, that the NIG never had anything to say about the data or the underlying clinical trials; this much we already knew, but now we have the receipts: these people have failed the public, betrayed the trust of patients, and soiled themselves]\n\nIt was never about Facts or Truth\n\nUntil now, the public was not aware of any document that so clearly showed that various ‘expert panels’ and ‘commissions’ obviously only served to obligingly recommend what politicians and the medical association leadership wanted.\n\nIt was never about expertise, about advice, about objective science, about health.\n\nLong before the beginning of the mass vaccination campaign, when vaccines did not even exist (!), it was only about one thing: vaccinate, vaccinate, vaccinate! The various ‘expert committees’ and doctors served only as Komparsen [extras, in German, one may also use the term Statisten, which literally implies undue influence of the state]. And it is obvious that the medical association leadership was ‘bought’ off with the reimbursement fee agreement [I’ve omitted the screen shots of some original documents, which can be checked out, if you read German, in the original article; it suffices to say that the fees are extraordinarily high, esp. in light of the incidence of injection: 25 Euros for the first jab and 20 Euros for every successive jab; this piece of evidence is reproduced below in the same position as in the original article]. April 2020 thus was the decisive moment in the history of the Medical Association in which its leadership handed the soul of the medical profession to politicians for the equivalent of thirty pieces of silver.\n\nThe Persecution of Doctors is Decided Upon\n\nThat was not all: in an ‘Amendments to the Memorandum of Understanding on COVID-19 Vaccinations between the Austrian Chamber of Physicians and the Ministry of Health, concluded in April 2020’, dated 2 Sept. 2021, the medical association leadership ‘promised action with respect to the services rendered by the medical profession’. These, too, signed off by both parties:\n\nAs is well known, what constituted ‘misinformation’ was left to the arbitrary whims of the leadership of the Chamber of Physicians. This disgraceful agreement formed the basis for the persecution of critical doctors, which continues to this day. The medical disciplinary law was, in fact, misused for intimidation and propaganda purposes. In doing so, the leadership of the Chamber of Physicians had turned against its paying members [membership is mandatory in Austria as the Chamber also certifies physicians, much like these boards and associations in the U.S.], which cemented into place the persecution of doctors in the style of the Inquisition.\n\nDisciplinary Proceedings by the Medical Association Were (Are) Illegal\n\nThe behaviour of the leadership of the Chamber of Physicians’ leadership in recent years is now coming back to haunt them. For months, the medical association has been attacked, ridiculed, and had its very existence openly questioned by politicians. Having done their duty for politicians in the last three years without a peep, the Chamber is apparently no longer needed and may well be let go of. The Chamber of Physicians is sinking more and more into political insignificance. According to insiders, it is now even regarded as a political opponent, a situation that can also be seen in legacy media. After having served as a ‘doormat’ for politicians of all stripes for years, the Chamber of Physicians is now also being treated as such. Various scandals internal to the medical association reinforce this tendency. [talk about Karma, eh? Those who don’t have self-respect will have a hard time getting others’ respect…]\n\nIn the meantime, the Regional Administrative Courts of Vienna, Lower Austria, and Vorarlberg have petitioned the Constitutional Court to repeal parts or the entire Disciplinary Law in the Physicians’ Act [Ärztegesetz, these parts of the Act permit the Chamber of Physicians to enforce standards] on grounds of their suspected unconstitutionality; it is possible that the Constitutional Court will rule even the entire Physicians’ Act unconstitutional. The Chamber of Physicians is a self-governing body. All its committees are to be selected from among its members, i.e., from medical professionals. However, the Disciplinary Commission consists of two medical assessors and a ‘judicially competent chairman’ who is appointed by the Minister of Health in agreement with the Minister of Justice, i.e., someone who must not be a trained physician and who does not come out of the Chamber of Physicians. Thus, the composition of the Disciplinary Commission is a violation of the Federal Constitution. This is the unanimous legal opinion of three state administrative courts [Verwaltungsgerichtshof] and countless jurists.\n\n[I’ll have more to say about this particularity below, for time being: this is potentially huge—and it would be akin to completely re-writing the rules of medicine]\n\nThe Chamber of Physicians has unintentionally awakened sleeping dogs with its wave of ill-advised disciplinary hearings against critical doctors. The consequence may be that it now has to be completely re-imagined. But this could also be an opportunity for the medical profession after all the repression of doctors in recent years. For in its current form, the Chamber of Physicians is a politically superfluous enemy and, for its members, the doctors, a very expensive mandatory association whose dues are used to finance the functionaries’ luxury salaries.\n\nFrom time immemorial, we’ve all known that a man’s—or woman’s—price is about, in purely monetary terms, 30 pieces of silver, to say nothing about the amorality and, yes, cowardice of most physicians everywhere.\n\nThe notion of buying off support has been well-established in the U.S. (see, e.g., here).\n\nHere, we’re talking individual doctors who are paid handsomely for jabbing people.\n\nYet, this isn’t even the worst part of this.\n\nThe Three Axioms of Governance-by-Bureaucracy\n\nYou’ve gotta love them German-speakers for being so stupid to actually put these things into writing.\n\nWe now have definitive proof that the subsequent shenanigans—first and foremost the obnoxious Covid Passports—were based on the unholy trinity of questionable medical ethics (ahem), government coercion, and arbitrary definitions.\n\nRemember that ‘fully vaccinated’ used to be two injections? Now it’s at least three, with the fourth jab ‘optional’ (haha, see above), and the Covid Passports come with expiration dates varying from 3-6 months, irrespective whether you’re ‘vaccinated’ or ‘recovered’.\n\nIn other words: arbitrary categories by government fiat, arrived at with the collaboration of the overwhelming majority of the medical profession.\n\nIf history is any guide, the Covid Passports are the functional equivalent of Aryan Certificate deployed by Nazi Germany: both documents were clearly politically motivated and based on sham ‘The Science™’.\n\nYet, Covid is revelatory: we’ve seen the abject lack of integrity, morality, and compassion on part of the political caste, its willing executioners in legacy media, and its perpetrators among medical professionals.\n\nDon’t ask what’s wrong with individuals. It’s the bloody ‘system’ that stands exposed.\n\nWe’ve known this for quite some time; sure, I could cite the Nazi and Stalinist atrocities here, but I’d like to point you also to the Asch Conformity, the Milgram, and the Stanford Prison Experiments. Or the book The Wave.\n\nAnd yet, despite all of this, there’s also a bright spot in all of this: contrary to the claims of postmodernist woke-fied agents-provocateurs, not everything in human society and relations is ‘socially constructed’ or about ‘power’.\n\nA sizeable share of people everywhere has resisted the pressure to ‘get vaccinated’.\n\nA group of doctors have resisted the pressures and temptations—remember the 30 pieces of silver—of collaboration and compliance with government tyranny.\n\nIf ‘booster’ uptake is any guide, more and more people are realising that they’ve been had.\n\nOur highly complex societies are, of course, more than the sum of its moving parts. Yet, given the highly integrated structures, it would be far-fetched to believe that anyone is able to control everything.\n\nTrue, a lot can be dominated, but in the end, the ‘normative power of the factual’ (Georg Jellinek), in combination with individual experiences, is a powerful antidote to tyranny.\n\nStill, this ain’t over yet, far from it.\n\nIf history is any guide, all that humans have ever been able to do is punish the perpetrators in the (vain) hope of establishing deterrence.\n\nIt has happened before, it is happening again, and it will happen again.\n\nThe next step is to see this through, re-establish the rule of law, and hold these people to account.\n\nThis is the moment. This is the time.", "opengraph": {"locale": "en_US", "type": "article", "title": "Leaked Documents Show 'Vaccine' Conspiracy in Austria - Europe Reloaded", "description": "ER Editor: Just to be clear, epimetheus is outlining the following steps to show overall that the ‘vaccine’ policy was a thoroughly politicized decision and nothing to do with genuine public health considerations: a policy [...]", "url": "https://www.europereloaded.com/leaked-documents-show-vaccine-conspiracy-in-austria/", "site_name": "Europe Reloaded", "article:published_time": "2023-03-14T06:49:26+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/03/AustriaVaxPolicyCorruption-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Dr. Thomas Szekeres", "Austrian Medical Association", "Chamber of Physicians Austria", "fee per vaccine", "epimetheus", "Austrian doctors", "Arztekammer Austria"], "tweets": [], "movies": [], "links": ["https://www.aha.org/advisory/2020-04-16-coronavirus-update-cms-releases-guidance-implementing-cares-act-provisions", "https://www.statistik.at/en/statistics/population-and-society/income-and-living-conditions/monthly-income", "https://en.wikipedia.org/wiki/Aryan_certificate", "https://fackel.substack.com/p/leaked-documents-show-vaccine-conspiracy?utm_source=cross-post&publication_id=502999&post_id=108111532&isFreemail=true&utm_campaign=1032096&utm_medium=email"], "authors": ["Pam Barker"], "publish_date": "2023-03-14T06:49:26+00:00"}