{"result_id": "111047", "URL": "https://www.europereloaded.com/132-canadian-doctors-have-died-suddenly-or-unexpectedly-since-covid-19-vaccine-rollout/", "timestamp": "2023-04-25 15:05:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/132-canadian-doctors-have-died-suddenly-or-unexpectedly-since-covid-19-vaccine-rollout/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "132 Canadian doctors have died suddenly or unexpectedly since COVID-19 vaccine rollout", "cleaned_text": "In 2021, Canadian doctors were mandated to be fully COVID-19 vaccinated, in order to keep their jobs. Very few escaped these mandates. No exemptions given. Since the rollout of COVID-19 vaccines in December 2020, a total of 132 actively practicing Canadian doctors under age 70 have died suddenly or unexpectedly. Canadian physician mortality in 2022 was 53% higher than 2019, based on the largest database of its kind assembled diligently by our team (a total of 2,250 doctor deaths documented, spanning the years 2019-2023). This data is solid. I have sent a third letter to the Canadian Medical Association (“CMA”) about these sudden deaths. To date, CMA has refused to respond. CMA fully supported unscientific and unethical COVID-19 vaccine mandates that were forced on their own physician members. Now this Ottawa-based bureaucracy ignores the damage done. Letter sent to the Canadian Medical Association:\n\nThe Liberty Beacon Project is now expanding at a near exponential rate, and for this we are grateful and excited! But we must also be practical. For 7 years we have not asked for any donations, and have built this project with our own funds as we grew. We are now experiencing ever increasing growing pains due to the large number of websites and projects we represent. So we have just installed donation buttons on our websites and ask that you consider this when you visit them. Nothing is too small. We thank you for all your support and your considerations … (TLB)\n\nComment Policy: As a privately owned web site, we reserve the right to remove comments that contain spam, advertising, vulgarity, threats of violence, racism, or personal/abusive attacks on other users. This also applies to trolling, the use of more than one alias, or just intentional mischief. Enforcement of this policy is at the discretion of this websites administrators. Repeat offenders may be blocked or permanently banned without prior warning.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.\n\nDisclaimer: The information and opinions shared are for informational purposes only including, but not limited to, text, graphics, images and other material are not intended as medical advice or instruction. Nothing mentioned is intended to be a substitute for professional medical advice, diagnosis or treatment.", "opengraph": {"locale": "en_US", "type": "article", "title": "132 Canadian doctors have died suddenly or unexpectedly since COVID-19 vaccine rollout - Europe Reloaded", "description": "NEWS: 132 Canadian doctors have died suddenly or unexpectedly since COVID-19 vaccine rollout (Part 1/2) Canadian Medical Associations maintain a conspiracy of silence   DR. WILLIAM MAKIS MD In 2021, Canadian doctors were mandated to [...]", "url": "https://www.europereloaded.com/132-canadian-doctors-have-died-suddenly-or-unexpectedly-since-covid-19-vaccine-rollout/", "site_name": "Europe Reloaded", "article:published_time": "2023-02-20T09:35:36+00:00", "article:modified_time": "2023-02-20T09:36:01+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/02/132DeadCDNdoctorsMakis-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["132 Canadian doctors dead", "Dr. William Makis", "Canadian Medical Association (CMA)"], "tweets": [], "movies": [], "links": ["https://www.europereloaded.com/132-canadian-doctors-have-died-suddenly-or-unexpectedly-since-covid-19-vaccine-rollout/?share=twitter", "https://www.europereloaded.com/132-canadian-doctors-have-died-suddenly-or-unexpectedly-since-covid-19-vaccine-rollout/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2023-02-20T09:35:36+00:00"}