{"result_id": "111029", "URL": "https://www.europereloaded.com/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/", "timestamp": "2023-04-25 15:04:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "Putin Orders Destruction of All Covid-19 Vaccines in Russia", "cleaned_text": "ER Editor: Has Putin really done this? And for the reasons given? And if so, when? Real Raw News is known for reporting (at least some) largely true events which happened some time before they are put out. We will be keeping our eyes open for confirmation of this. Some themes are worth pointing out from this story.\n\nFirst, were the original Sputnik vaccines and CoviVac vaccines ‘spiked’ in some way? We know from data in the US that 5% of all batches were responsible for most of the harms done at that point in the plandemic. We also know that data in the West is now showing more harm related to the boosters and 4th, etc. vaccines. The basic technology of these injections has been problematic anyway (mRNA with nanolipid platforms), but additional elements found show evidence of intention to harm. We have in mind the nanoparticle/graphene components. Why would Russia be any different?\n\nSecond, we know of the intention to bring down Russia by the western deep state. That was done in modern times with the Bolshevik Revolution and the alleged end of the Cold War in 1989 when the west’s neoliberals essentially raped Russia with Yeltsin as the enabler. But smart historians like Dimitry Orlov say this has been a thousand-year war against Russia now coming to fruition. Why wouldn’t the Covid ‘vaccine’ agenda play right into that? We also know about Ukraine / US biolabs, and the gathering of Russian DNA.\n\nThird, as to the HIV component, Karen Kingston has plausibly demonstrated the insertion of up to seven different types of elements added to the spike of the SARS-CoV-2 lab-constructed crown. One is HIV, which was demonstrated by Indian researchers back in 2020, but was quickly censored. Two of those seven inserts correspond to two different types of snake venom. Why wouldn’t the Russian ‘vaccines’ have this contamination?\n\nAs to the personal element of Putin’s daughter, whether this is true or not, it mirrors the reports of the Thai princess who went into a coma in mid-December. Stories have appeared about the Thai royal family going after Pfizer with the help of Prof. Sucharit Bhakdi. Plus the work of Pascal Najadi, a retired Swiss banker who is vaccine-injured and taking criminal action against the Swiss government. Lots of people who are in a position to know better were duped by this global tissue of lies.\n\nExecutions of vaccine scientists and others? We recommend readers scour the Real Raw News website for stories of numerous executions as a sort of smell test. Backchannels say that executions have indeed happened on our side over quite some time. Of late we have seen a proliferation of famous people in masks, evident use of doubles, CGI and more. And many have simply vanished without a trace.\n\nPutin Orders Destruction of All Covid-19 Vaccines in Russia\n\nRussian President Vladimir Putin has ordered the destruction of all Covid-19 vaccine stockpiles on Russian soil, citing an undeniable connection between what has been dubbed the “Moscow Vax” and a sudden surge of HIV infections in vaccinated persons, Federal Service Bureau agent Andrei Zakharov told Real Raw News. Although Putin has not made a formal announcement, he has tasked his right-hand man, Defense Minister Sergei Shoigu, with purging hospitals, clinics, and pharmacies of the Sputnik and CoviVac vaccine variants. The military will ensure compliance by auditing vaccine repositories and performing spot inspections. Like President Trump, Putin was deceived by a lie (ER: This aspect still needs a satisfactory explanation as nobody would accuse either Trump or Putin of gullibility or stupidity; this is a sticking point in the American truther/patriot community); a global consortium of devious doctors, health professionals, and government stooges spun a convincing yarn about a virus that would ravage the world unless vaccines were developed to inoculate the population as soon as possible. The WHO had infiltrated the Russian Ministry of Health and planted agents of evil within the Council of Ministers and State Duma, and Western propaganda—fables of people sick with Covid falling dead on the street—seeped through Russia’s once secure borders. No nation was immune to the most elaborate disinformation campaign in the history of humanity. On 2 December 2020, Russia launched its first mass vaccination experiment, beating other nations to the punch and delivering 6.9 million doses in the first week. As of 21 June 2022, 81.5 million people have received at least one dose, with 74.3 million fully vaccinated. In the West and Russia, vaccine recipients presented side effects such as cardiac ailments, seizures, and blood clots, with many dropping dead at home, at work, or in the streets. “The American CIA is brilliant. When harmless Covid spread, they made up stories of so many people dying to get us all to beg for the vaccine. Then when the vaccines came, we did start dying, and the governments can blame it on Covid, not vaccines. It was such a clever plot, the world believed it,” Zakharov said. In December 2022, the Ministry of Health reported a dramatic, countrywide spike in HIV infections among persons who had received three or more Covid-19 vaccinations and did not fit the standard demographic—homosexuals and needle users. Between 2015-2019, Russia averaged 16,000 new infections per year. In 2022, that figure skyrocketed to 63,000 to include celibate, non-drug users. Vladimir Putin, Zakharov said, arrived at the inescapable conclusion that vaccines could cause a person to develop HIV and AIDS. The evidence was unassailable; the more jabs a person got, the greater the odds of contracting HIV. Putin viewed the correlation as more than a simple coincidence—the vaccine was tailored to deliver Acquired Immune Deficiency Syndrome. “A fake sickness tricks people into getting a vaccine that gives them real sicknesses,” Zakharov said. “Only satanic people could have dreamed this up. For President Putin, this is a very personal affair.” Putin, he added, has remained “pureblood,” or unvaccinated, but one of his daughters was diagnosed with HIV two weeks after she’d taken her third jab. “President Putin told her not to get any more vaccines, but she is Westernized, she accepted the lies, and now she must stay on medicine her whole life. This infuriated President Putin,” Zakharov said. The daughter’s diagnosis was the last straw. On Wednesday, Putin decreed that Covid-19 vaccines be destroyed, and he banned all vaccine imports. The Russian military, our source said, has already destroyed vaccines at hospitals in Moscow, Saint Petersburg, Kazan, Chelyabinsk, Samara, Nizhny Novgorod, and Saratov, and was forced to “put down” hospital staff that resisted the vaccine purge. Putin has reportedly said he will not rest until every vial is shattered. Also, Putin has ordered the execution of 130 scientists responsible for creating the Sputnik vaccines. “Here we don’t bring the guilty to trial—a waste of time. Why waste time when we know they are guilty. We deal with these matters severely,” Zakharov said. In closing, we asked Zakharov whether Putin would have ordered such drastic action had his daughter not been diagnosed with HIV. “No, he still would take care of these criminals. But her diagnosis crystallized his hatred for these evil people. There will be no more vaccines in Russia,” he said.\n\nDisclaimer: TLB websites contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available to our readers under the provisions of “fair use” in an effort to advance a better understanding of political, health, economic and social issues. The material on this site is distributed without profit to those who have expressed a prior interest in receiving it for research and educational purposes. If you wish to use copyrighted material for purposes other than “fair use” you must request permission from the copyright owner.", "opengraph": {"locale": "en_US", "type": "article", "title": "Putin Orders Destruction of All Covid-19 Vaccines in Russia - Europe Reloaded", "description": "ER Editor: Has Putin really done this? And for the reasons given? And if so, when? Real Raw News is known for reporting (at least some) largely true events which happened some time before they [...]", "url": "https://www.europereloaded.com/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/", "site_name": "Europe Reloaded", "article:published_time": "2023-03-05T11:45:07+00:00", "article:modified_time": "2023-03-05T11:50:22+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/03/PutinBansCovidInjections-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Andrei Zakharov FSB agent", "HIV infections Russia", "Sputnik vaccine", "CoviVac vaccine", "Sergei Shoigu", "Vladimir Putin"], "tweets": [], "movies": [], "links": ["https://realrawnews.com/2023/03/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/", "https://www.europereloaded.com/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/?share=twitter", "https://www.europereloaded.com/putin-orders-destruction-of-all-covid-19-vaccines-in-russia/?share=facebook"], "authors": ["Pam Barker"], "publish_date": "2023-03-05T11:45:07+00:00"}