{"result_id": "111004", "URL": "https://www.europereloaded.com/the-miracle-of-the-ineffective-vaccines/", "timestamp": "2023-04-25 15:04:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/the-miracle-of-the-ineffective-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "The Miracle of the Ineffective Vaccines", "cleaned_text": "Before I start, this isn’t about people dying who may not have died with an effective vaccine. It’s not about that. In an ideal world, for people vulnerable to Covid, there would be a safe and effective vaccine, available to anyone who wanted it and no pressure on those who didn’t. But we don’t live in an ideal world.\n\nI call it ‘the miracle of the ineffective vaccines’ because think what a different world we would be living in right now if the vaccines WERE effective. Imagine what your life would be like if the Covid vaccines DID stop infections and DID stop transmission. There’s no doubt about it, we would be living in some dystopian nightmare.\n\nFortunately, many of us could see that the vaccines didn’t stop infections or transmission in 2021. The authorities knew it, too. It was clear as day in the UKHSA data which showed that the rate of infections per 100,000 individuals was much higher in the vaccinated. The worse those stats became, the more they tried to hide it until they were removed for good.\n\nEven with that information and the appearance of Omicron, segregating the unvaccinated was top of the agenda. The infrastructure had been created and the power-hungry who were taking advantage of the situation, were keen to use it. Restrictions, mandates and passports were all part of the new tools the authoritarians had at their disposal.\n\nEven in 2022, 50 countries had mandates in place and over 100 countries had restrictions to access public services, facilities or schools. This map (from the University of Oxford) shows the countries (in blue) around the world that had some kind of restrictions on the unvaccinated in place.\n• Israel introduced a Green Pass only allowing the vaccinated to do various things;\n• had lockdowns only for the unvaccinated;\n• had different access rights to cultural and leisure facilities, transport and long-term care facilities;\n• Turkmenistan required all of its adult population to be vaccinated;\n• Ecuador mandated vaccination for everyone over 5;\n• Puerto Rico required over 5s to be vaccinated to attend school;\n• Cost Rica mandated children between 3-18 to be vaccinated;\n• America had various mandates, for example municipal workers in New York had to be vaccinated, many health care workers had to be vaccinated or lose their jobs and the military all had to be vaccinated;\n• The UK sacked almost 40,000 care home staff and were close to mandating vaccination for all health care workers.\n• Australia only allowed vaccinated individuals to access facilities after they reopened post lockdowns.\n\nThe list goes on and on.\n\nAll around the world, travel was exclusively for the vaccinated. Some countries allowed you to enter if you were unvaccinated but required that you quarantined. Others just flat-out refused entry to the unvaccinated. Even today, if I want to visit the ‘Land of the Free’ and see the Statue of Liberty, I can’t because of my vaccination status.\n\nAnd it got even worse than that. People were denied hospital treatment and there was increasing hostility towards the unvaccinated. There were calls for further segregation and the media whipped the vaccinated into a frenzy. ‘Deny them access to hospitals’, ‘Leave them to die at home’, ‘Send people round to their homes to pin them down and vaccinate them’ and ‘Don’t let their kids attend school unless they’re vaccinated’. These are just some of the daily remarks you could hear on TV or read in newspapers.\n\nI’ve always wondered how the Germans, as a highly civilised society, could have produced Nazis. I wrongly concluded that it was something to do with their culture and the same couldn’t happen in the UK or the US. Oh how I was wrong. It was a great example of how normal people could turn on their fellow citizens and call for unimaginable discrimination. Possibly worse than that were the people that didn’t have strong opinions on these things but said or did nothing.\n\nIn the UK and probably more so in the US, a large proportion of black people weren’t vaccinated. So in places like New York, segregation returned and nobody batted an eyelid. Racism was suddenly allowed again, authorised by the vaccine.\n\nA shocking couple of years. Things happened which many will want to forget about. They will deny they happened or twist the facts in their heads. At the very best, they will tell themselves it was all necessary at the time, they were saving lives.\n\nThat is why the ineffectiveness of the vaccines can be seen as a miracle. Without that miracle we would be in a terrible place today.\n\nHowever, the battle may be won (for most) but the war is most definitely not over. The powers that be are still fighting to bring vaccine passports or digital IDs into place. They have invested heavily in the infrastructure and it is all ready to go. New ICD codes are in place to distinguish between the vaccinated and unvaccinated, including the reasons for not being vaccinated.\n\nAt some point in the future, a new panic will occur, the media will scare the population again and discriminative and controlling digital vaccine passes will try to make a come back. Let’s make sure that they don’t.\n\nWrite in the comments below what restrictions, mandates and passes you had/have in your country so that there is a record of all the absurdities that occurred.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Miracle of the Ineffective Vaccines - Europe Reloaded", "description": "The Miracle of the Ineffective Vaccines Where would we all be now? NAKED EMPEROR Before I start, this isn’t about people dying who may not have died with an effective vaccine. It’s not about that. [...]", "url": "https://www.europereloaded.com/the-miracle-of-the-ineffective-vaccines/", "site_name": "Europe Reloaded", "article:published_time": "2023-02-03T10:54:03+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/02/IneffectiveVaccinesaMiracle-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Naked Emperor", "ineffective vaccines", "miracle vaccines don't work", "Ivor Cummings"], "tweets": [], "movies": [], "links": ["https://www.bsg.ox.ac.uk/blog/restrictions-and-mandates-unvaccinated-new-normal", "https://www.bbc.co.uk/news/world-europe-59283128", "https://web.archive.org/web/20220210095345/https://www.gouvernement.fr/info-coronavirus/pass-vaccinal", "https://web.archive.org/web/20220126181506/https://www.bundesregierung.de/breg-de/themen/coronavirus/corona-regeln-und-einschrankungen-1734724", "https://www.wsj.com/articles/in-some-african-nations-armed-police-enforce-covid-19-vaccinations-11646056306", "https://nakedemperor.substack.com/p/z28310-the-code-designated-for-the", "https://nakedemperor.substack.com/p/the-miracle-of-the-ineffective-vaccines"], "authors": ["Pam Barker"], "publish_date": "2023-02-03T10:54:03+00:00"}