{"result_id": "111002", "URL": "https://www.europereloaded.com/foia-doc-shows-govt-anticipated-mass-vaccine-injuries-then-observed-them-from-day-one/", "timestamp": "2023-04-25 15:04:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.europereloaded.com/foia-doc-shows-govt-anticipated-mass-vaccine-injuries-then-observed-them-from-day-one/", "encoding": "UTF-8"}, "image": null, "domain": "www.europereloaded.com", "title": "FOIA doc shows US govt anticipated mass vaccine injuries, then observed them from day one", "cleaned_text": "Nobody disagrees at this point that there is a plethora of excess deaths and a dearth of births, a trend that should be the number-one alarming public policy issue. Yet when any of us suggest that the gene therapy ubiquitously given to the world right around the time of the jump in these numbers might be responsible, people look at us like we are from Mars.\n\nHowever, it turns out, based on newly released FOIA documents from the CDC, that our government knew about and even anticipated massive reports of injuries from these shots from day one.\n\nThroughout the past two years, the government and media have concocted a conspiracy theory that somehow the CDC’s own VAERS reporting is scammed with fraud by people who have nothing better to do with their lives but spend hours filling out fraudulent vaccine injury reports. They pretend it’s a sort of ex post facto anomaly that nobody expected and that has no credibility in their eyes. Except, as Hebrew University Professor Josh Guetzkow reveals, not only did the CDC know about the vaccine injuries blowing up VAERS at record levels (even before the general public had access to them), the agency contracted with defense contractor General Dynamics to handle the database in anticipation of record use. Then, when the vaccines were released, the CDC had to up the contract to account for even more entries, yet showed no moral qualms about continuing with the campaign without disclosing these revelations to the public.\n\nGuetzkow, who has secured numerous FOIA’ed documents both in the U.S. and Israel throughout COVID, posted 69 pages of FOIA’ed documents and contracts from General Dynamics Information Technology to the CDC’s immunization safety office. Thanks to his work, we already know from the previous FOIA’ed documents that the CDC’s $9.45 million contract with General Dynamics in August 2020 stated that officials anticipated 1,000 adverse event reports a day, with 40% of them being serious. Yet, like a cold serial killer soullessly counting his casualty list, the CDC was completely fine with going through with this campaign, as if it were the price that had to be paid to worship the spirit of the age – the modern-day Moloch. However, this document shows that as early as Jan. 15, 2020 (ER: Covid-19 as a ‘pandemic’ didn’t happen until the first lockdown in March, 2020; vaccines were rolled out in December 2020 to medical staff, then the general public in January 2021 – we’re wondering if this date should be Jan. 15, 2021, that ‘2020’ is a typo) – when most people still could have avoided these shots – the CDC was aware of record-setting reports that crushed even the agency’s initial cold-hearted, morbid expectations.\n\nAs you can see from page 8 of the pdf, General Dynamics warned the CDC that VAERS had blown through the expected 1,000 cases per day and even reached a level above 4,500 – to the point that GD couldn’t process the data. Mind you, they were never concerned with the human toll, just the logistics of the contract labor. They predicted a need for “reforecasting of staffing needs” to process all these reports.\n\nAlready in December 2020, when the shots were only available for select people like doctors, there were over 19,000 reports and close to 344,000 website visits. It’s hard to see how this wasn’t organic from people genuinely in pain because there was no organized campaign in the United States to inform people of VAERS at the time. I myself (who obsessively focused on this) hadn’t heard of it until two months later.\n\nBy Feb. 15 2021, General Dynamics reported a continued record-setting pace of reports and website visits, to the point that workers had to expand their VAERS ID reports to allow for seven digits instead of six. In April, officials reported that they had to hire an additional 200 staffers to deal with the backlog and continue to process 25,000 reports per week, well beyond the threshold they originally contracted for. As eligibility for the shots expanded for all age groups, they continued to process over 30,000 injury reports a week, yet the CDC never said a word about it. Not only did officials not take the products off the market, they began mandating them over late summer 2021, with some mandates that remain in place to this very day.\n\nIt’s nearly impossible to astroturf these sorts of injury reports. Clearly, our government saw how organic they were and how they coincided perfectly with the uptake of the vaccine. Indeed, the FDA had access to the infamous Pfizer document in Feb. 2021 – before almost any younger adult was vaccinated – showing that the shot killed over 1,200 people and was associated with over 1,400 categories of serious maladies that were chronicled in a list eight pages long.\n\nNow, keep in mind that after the government observed all these adverse events, and after officials knew about the 7.7% clinical injury rate from the CDC’s own V-SAFE program, perfectly corroborating the VAERS data, they accelerated the approval of these shots for children and then the mandates for everyone.\n\nEmails released via FOIA show that in July 2021, when the shots should have been canceled, Peter Marks, head of the FDA’s Center for Biologics Evaluation and Research, pressured Marion Gruber, then head of the office of vaccines research and review, to truncate the already accelerated timeline to fully approve the Comirnaty (Pfizer) shot (which is still not commercially available 2.5 years later).\n\nA copy of the July 19 email response from Marion Gruber is below:\n\nA week after the infamous Aug. 23 approval, which triggered the mandates, Gruber resigned from the agency in protest. But notice how even Gruber couched her reticence to approve this thing in terms of not undermining “confidence in the vaccine,” rather than expressing actual concern this was already killing and maiming people in droves.\n\nWe’re at the point where at a minimum, the government doesn’t care how many people die from this experimentation. Dr. Tom Merritt, who was part of the Oxford University team who developed the AstraZeneca vaccine, best summed up the sentiment of the biomedical state toward the people when he admitted that those injured by the gene therapy were “collateral damage to the bigger scheme.” He added: “Some tragically died, a number had their lives changed forever. They believed in vaccines; now they don’t.”\n\nIt’s all a matter of what the bigger scheme really is.", "opengraph": {"locale": "en_US", "type": "article", "title": "FOIA doc shows US govt anticipated mass vaccine injuries, then observed them from day one - Europe Reloaded", "description": "ER Editor: Here is a fabulous 3-minute discussion with Edward Dowd on just this topic below: Bigger than excess deaths are the disabilities in the US workforce. 1.36 million disabled. 13.3 million injured. Impacting 10% [...]", "url": "https://www.europereloaded.com/foia-doc-shows-govt-anticipated-mass-vaccine-injuries-then-observed-them-from-day-one/", "site_name": "Europe Reloaded", "article:published_time": "2023-03-27T09:52:56+00:00", "article:modified_time": "2023-03-27T09:53:14+00:00", "image": "https://www.europereloaded.com/wp-content/uploads/2023/03/CDCGeneralDynamicsVAERS-min.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["VAERS", "Marion Gruber", "FDA Director Peter Marks", "Edward Dowd", "Karen Kingston", "Daniel Horowitz", "Dr. Josh Guetzkow", "General Dynamics", "V-safe Program", "CDC"], "tweets": [], "movies": [], "links": ["https://jackanapes.substack.com/p/the-banality-of-vaers", "https://jackanapes.substack.com/p/foiad-contracts-show-cdc-expected?utm_source=profile&utm_medium=reader2", "https://phmpt.org/wp-content/uploads/2022/04/reissue_5.3.6-postmarketing-experience.pdf", "https://maryannedemasi.substack.com/p/did-the-fda-rush-to-license-pfizers", "https://www.fda.gov/media/164300/download#page=188", "https://www.politico.com/news/2021/08/31/biden-booster-plan-fda-508149", "https://www.express.co.uk/life-style/health/1746755/Covid-jab-victims-fight-for-compensation"], "authors": ["Pam Barker"], "publish_date": "2023-03-27T09:52:56+00:00"}