{"result_id": "112003", "URL": "https://evolutionnews.org/2020/04/physicians-diary-our-remarkable-healing-processes-and-the-coronavirus-infection/", "timestamp": "2023-04-25 15:05:12 CEST+0200", "meta": {"description": "There are several ways to fight this pandemic besides social isolation, wearing masks, and proper hand-washing.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2020/04/physicians-diary-our-remarkable-healing-processes-and-the-coronavirus-infection/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Physician’s Diary: Our Remarkable Healing Processes and the Coronavirus Infection", "cleaned_text": "Editor’s note: Dr. Simmons is the author most recently of Are We Here to Re-Create Ourselves? He is a Fellow with Discovery Institute’s Center for Science & Culture.\n\nGiven the increasing sadness associated with the coronavirus pandemic, I was slow to write about our remarkable abilities to fight infections. Yet, watching how international medical researchers are capitalizing on the normal human body’s defense mechanisms to heal and protect us, I was reminded that there is much to marvel at here. These physiological wonders are beyond simple accidents of nature. They are beyond just trial and error and Darwinian natural selection. There is evidence of design here.\n\nNothing Random About It\n\nNormally, billions of white cells, including complex B and T lymphocytes, neutrophils, macrophages, dendritic cells, and plasma cells, stand guard throughout the body. They are like sentinels with a whole host of weapons in hand. When confronted by a foreign intruder, they quickly determine if this new protein, DNA or RNA particle, bacteria, fungus, virus, or a changed cell (cancer) is a friend or foe. If they deem it worrisome, they immediately punch holes in it with tiny grenades called “complement” and tear it apart, figuratively limb-by-limb. Select pieces are sent back to the rear-lines (lymph nodes) for analysis. No one knows quite how all this is accomplished, but nothing about it is random.\n\nThe analysis leads to manufacturing antibodies, often Y-shaped chemicals to capture all or part of the intruder in the wedge of the Y. Antibodies will often attach to invaders at specific locations along their outer shell. Think of a submicroscopic porcupine rolled into a ball. If the virus foreigner were covered with triangular spikes, the antibodies might have “catcher’s mitts” with triangular-shaped pouches. Electrical charges and specific chemical bonds also play a role. After that, the foreigner is beaten to a pulp, damaged beyond recognition, taken to be eaten by select cells or destroyed by acid.\n\nNewly manufactured, shorter-lived antibodies are the first on the scene. Days to weeks later, smaller, often lifelong, antibodies begin arriving. They may also become part of your permanent immunity. For example, if you were exposed to or caught the mumps, your antibodies would keep you immune to mumps forever. The memory banks in the immune system remember all details. Think of a library with tens of millions of books, with a means to retrieve precise information from a single sentence, maybe phrase, in any book, in any language, in a nanosecond. It’s similar to our search engines, but much faster and more precise.\n\nIf there is an overwhelming army of invaders, the sentinels will send for emergency reinforcements. White cells, like the cavalry, rapidly arrive by the millions. They travel through lymph channels, race from other organs, and squeeze in and out of blood vessels. Pus is often the result of these battles. This material is composed of millions of dead invaders and white cells, various bodily fluids, and all sorts of spent biological weapons, tools, and chemicals. Recall teenage pimples or any abscess; the fight is concluded when the body moves these pus pockets to the skin surface for drainage. Analgesics help us with pain, like endorphins, and they treat fever. It should be noted, however, that a fever is a natural defense and many invading organisms cannot tolerate heat. We used to treat patients with saunas, “to sweat out a fever,” and maybe that therapy should be revisited.\n\nMillions of different foreign proteins enter our body every day through breaks in the skin, our gums and gut while eating, our nose and lungs while inhaling, and even through portals in the eyes from another person’s sneeze or cough. Most intruders are benign. Many others are non-life threatening irritants, as with allergies, which prompt a slightly different response. The deadly invasions, of course, must be confronted immediately.\n\nImmunization (vaccination) is the ultimate tool in fighting these kinds of infections. Doctors maximize what the body normally does. One must keep in mind that we have never seen this new coronavirus before. If it were the measles and you had been vaccinated as a child (as would be the case with tetanus, mumps, and hepatitis C), your body would quickly recognize the intruder, immediately call for antibodies, and destroy it.\n\nUnfortunately, pandemics are not new. With urban crowding, international travel, our encroachment on forests and jungles, increasing antibiotic resistance, poverty, lack of knowledge, the eating of certain wildlife, and bioterrorism, they have or likely will become more common. The closest parallel to the corona scourge is the 2009 flu pandemic, aka swine flu (H1N1). In that case, an estimated 250,000 people died worldwide. The swine flu primarily attacked young adults, the most healthy members of society. These were the ones who should be able to mount the most vigorous response. But, it was too vigorous sometimes. The body’s cure became worse than the disease. Think of a house-fire or a one-alarm fire, where the response is more appropriate to a twenty-alarm blaze and the entire neighborhood is mistakenly destroyed in the fight against the flames. With H1N1, patients’ lungs were destroyed by the response.\n\nThere are several ways to fight this pandemic besides social isolation, wearing masks, and proper hand-washing. Certain medications interfere with the viral processes. Many are being tested. Some think hydroxychloroquine (a malaria medicine) shows promise. It may prevent the virus from entering human cells. Remdesivir (an antiviral) is another candidate. It causes the RNA blueprint inside the virus to mutate and thereby become ineffective.\n\nVaccines prompt the body to make antibodies by mimicking aspects of the virus, but the trick is creating the right antibodies. Sometimes, the created antibodies get in the way. Hyperimmune globulin (IGG, consisting of antibodies collected from donors) was used during the polio epidemic in the 1950s; it was given to patients with the worst cases, with paralysis, and many improved.\n\nScientists are drawing on that experience. We are now testing and giving monoclonal antibodies and convalescent serum to the sickest. Both have the antibodies (IGG) from previously infected patients. They mimic our antibodies, which, by intelligent design — not accident — help keep us healthy.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2020/03/COVID-19.jpg", "image:width": "770", "image:height": "447", "locale": "en_US", "type": "article", "title": "Physician’s Diary: Our Remarkable Healing Processes and the Coronavirus Infection | Evolution News", "description": "There are several ways to fight this pandemic besides social isolation, wearing masks, and proper hand-washing.", "url": "https://evolutionnews.org/2020/04/physicians-diary-our-remarkable-healing-processes-and-the-coronavirus-infection/", "site_name": "Evolution News", "updated_time": "2020-04-20T22:02+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2020-04-15T12:54+00:00", "article:modified_time": "2020-04-20T22:02+00:00"}, "tags": ["pandemic", "lungs", "allergies", "abscess", "measles", "neutrophils", "natural selection", "vaccination", "health", "tetanus", "DNA", "lymphocytes", "Immune System", "pimples", "coronavirus", "virus", "plasma cells", "immunization", "Swine Flu", "white cells", "dendritic cells", "hepatitis C", "fungus", "H1N1", "antibodies", "paralysis", "bacteria", "RNA", "cancer", "lymph channels", "intelligent design", "mumps", "macrophages", "polio", "hyperimmune globulin", "bodily fluids"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/ARE-HERE-RE-CREATE-OURSELVES-Convergence/dp/1695012933/", "https://www.peterson.af.mil/News/Photos/igphoto/2002267796/"], "authors": [], "publish_date": "2020-04-15T12:54+00:00"}