{"result_id": "112030", "URL": "https://evolutionnews.org/2020/04/viruses-an-intelligent-design-perspective/", "timestamp": "2023-04-25 15:05:29 CEST+0200", "meta": {"description": "Certainly, in a context of global anxiety, this is a subject that needs to be approached with sensitivity and humility.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2020/04/viruses-an-intelligent-design-perspective/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Viruses: An Intelligent Design Perspective", "cleaned_text": "The COVID-19 virus is on a rampage in the world, killing thousands in the U.S. so far, shutting down whole countries’ economies, and possibly altering aspects of modern life for the future, after the virus has waned. What the complete impact will be is of course unknowable. In the meantime, though, questions arise about this and other, related sub-microscopic entities. Viruses seem so evil. What is their place in life? And like other aspects of nature, do they give evidence of intelligent design?\n\nCertainly, in a context of global anxiety, this is a subject that needs to be approached with sensitivity and humility. It isn’t the purpose of this article to adequately address great philosophical questions. That can wait for another occasion. But before such questions can even be considered, it’s necessary to look at viruses dispassionately. Then it will be helpful to evaluate whether they are, on the whole, beneficial or harmful. Here are some scientific findings to help make those determinations.\n\nThere are viruses that look like lunar landers from the Apollo era. Others look like alien spaceships. They can locate and land on a cell membrane, puncture the lipid bilayer, and insert their genetic material through a tube with a twisting motion. Most fundamentally, viruses carry and transmit information. Or perhaps better put, they require pre-existing information-copying systems, such as those found in cells, in order to replicate. Their “capsules” contain the genetic material — information-carrying genetic molecules, needed to hijack a cell’s machinery in order to make copies of themselves.\n\nViruses are, to all appearances, very clever little machines. In some viruses the genetic material is entirely DNA, in others it is RNA. These can then be broken down into single- or double-stranded DNA viruses, or single- or double-stranded RNA viruses. RNA viruses are more efficient than DNA viruses because they can skip the process of transcription and their RNA molecules can be directly translated into proteins. Single-stranded RNA viruses can be further broken down into two types: “positive-sense” RNA which can be directly translated into protein, and “negative-sense” RNA which carries genetic information on a complementary strand. The latter must first be converted to positive-sense RNA before it can be translated, however the former is most efficient because it can be immediately translated into protein.\n\nThe SARS-CoV-2 virus which is causing the current pandemic is the most “efficient” type: it is a positive-sense single-strained RNA virus. Compared to DNA viruses, RNA viruses are also generally harder to combat through modern medicine. This is because RNA replication error-checking machinery is less efficient than DNA replication error-checking machinery. That means RNA viruses are more prone to mutations, which makes it harder to develop a vaccine to target the virus.\n\nAfter the viral genetic material enters a cell, it commandeers the translation machinery (and in the case of a DNA virus, the transcription machinery), forcing the cell to make copies of the virus. The cell then dies, splitting open to release hundreds of new virus particles ready to repeat the process on other cells. Growth would be exponential were the immune system not prepared to attack them. It’s easy to imagine viruses as enemy combatants in all-out war, and tempting to root for the immune system as a national defense program in a desperate attempt to stamp out the invaders. Such personifications can be misleading, however, and should be avoided. Even an enemy tank can show strong evidence of intelligent design. Details of their construction can help determine if viruses pass the design filter.\n\nThe protein coat covering the viral genome often resembles a polyhedron, a geometrical solid comprised of polygons. Think of a soccer ball. News from the University of California at Riverside describes soccer ball geometry and expands it into the class of other polyhedra, including the icosahedron shape that some viruses build:\n\nThe author, Iqbal Pittalwala, is interested primarily in the energetics of how viruses build their protein coats, called capsids. Dr. Zandi studies them with her team in hopes of learning how engineers might mimic the production for nano-vehicles. “What makes them highly promising for drug delivery and gene delivery purposes is that they are stable, have a high uptake efficiency, and have low toxicity,” she says. Learning about their construction can also help pharmaceutical companies devise drugs to interfere with or block viral assembly.\n\nTheir lab has found that the capsids self-assemble very quickly, on the order of milliseconds. On the way, the proteins have to circumvent many energy barriers.\n\nThe paper by Zandi’s team, published in ACS Nano, describes how the shells, even if disordered, can break apart and reassemble into symmetrical forms by physical forces like elastic energy. As the proteins attract,\n\nThe self-assembly of symmetric geometrical capsids by natural forces is interesting, but insufficient for detecting design. Snowflakes, buckyballs, and other crystals can do that. More instructive is how the viruses pack their DNA or RNA and inject it into cells.\n\nIn 2008, Purdue University learned about a “powerful molecular motor” that packs the DNA into the capsid of a T4 virus (a virus that infects and kills bacteria). “Parts of the motor move in sequence like the pistons in a car’s engine,” the researchers found. Now this is sounding more like an irreducibly complex molecular machine!\n\nA more recent article (2014) from University of California at San Diego makes a capsid motor look smarter still. The motor can relax when the density of DNA in the capsid gets too tight, allowing it to readjust so that the motor can continue. Without that flexibility, the DNA could start tangling and forming knots. The image shows the DNA neatly wrapped inside.\n\nIf a flagellar motor or ATP synthase is sufficient to conclude intelligent design, there is no good reason to exclude a capsid motor just because of the harm a virus might do. The design filter does not concern itself with the purpose of a design, whether for good or bad, but just whether a purpose exists. OK. So it seems that viruses are intelligently designed.\n\nIn a timely podcast for ID the Future, Michael Behe shed light on why “bad” viruses like COVID-19 exist. He compares them to storms at sea. Most design advocates wouldn’t hesitate to say that the Earth is well-designed for life. That includes the oceans. Sometimes, however, there are violent storms at sea. A ship caught in a storm might perish just because of the way the laws of nature operate in a designed biosphere that needs oceans. COVID-19 has been quietly at work in some animals, Professor Behe says, but made the jump to humans, perhaps through mutations that expanded its affinity for other species. Our immune systems were caught off guard and have not had time to develop immunity.\n\nEven more interesting, Behe adds, is growing evidence for beneficial functions in viruses. Biologists tell us that our bodies carry 10 times more microbes than our own cells. That number is even higher for viruses by two orders of magnitude. And yet we usually thrive in this ocean of viruses we move about in. For one thing, our immune systems become adjusted to viruses and know how to keep them in check.\n\nAnother more design-friendly finding is that “viral DNA” in the human genome — once thought to represent invasions that became established as useless junk — is actually being transcribed. This suggests that these retrotransposons are actually beneficial. If so, another kind of “junk DNA” should be viewed as “gems” that help us in ways we cannot imagine. In 2011, Elizabeth Pennisi, writing for Science, opened the door to a positive attitude about viruses.\n\nMicrobiologists already know that a class of internal viruses called bacteriophages help us by destroying invasive bacteria. Phages are, in fact, essential to our health. So there is one known benefit. More research from a design perspective might discover other benefits of viruses. Could they provide local information and protection as we move about into new habitats? Could they act as checks against unrestricted growth of other threats? Could they keep our immune systems in peak condition?\n\nWhile it tests our ability as human beings to think from a larger perspective, perhaps we can start considering viruses as essential partners, welcoming our numerous passengers along as we seek to weather the current storm.\n\nPhoto: Bacteriophages help us by destroying invasive bacteria, by Dr. Graham Beards / CC BY-SA.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2020/04/Phage.jpg", "image:width": "417", "image:height": "233", "locale": "en_US", "type": "article", "title": "Viruses: An Intelligent Design Perspective | Evolution News", "description": "Certainly, in a context of global anxiety, this is a subject that needs to be approached with sensitivity and humility.", "url": "https://evolutionnews.org/2020/04/viruses-an-intelligent-design-perspective/", "site_name": "Evolution News", "updated_time": "2020-04-03T04:13+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2020-04-01T23:21+00:00", "article:modified_time": "2020-04-03T04:13+00:00"}, "tags": ["viruses", "bacteriophages", "capsid", "Roya Zandi", "polyhedron", "U.C. Riverside", "ID the Future", "viral genome", "icosahedron", "cell machinery", "vaccine", "DNA", "protein", "U.C. San Diego", "snowflakes", "Michael Behe", "nano-vehicles", "ACS Nano", "COVID-19", "lipid bilayer", "cell membrane", "Science (journal)", "Apollo moon landings", "buckyballs", "Iqbal Pittalwala", "bacteria", "RNA", "Purdue University", "T4 virus", "intelligent design", "molecular motor", "SARS-CoV-2", "Elizabeth Pennisi", "crystals"], "tweets": [], "movies": [], "links": ["https://news.ucr.edu/articles/2020/03/09/how-virus-forms-its-symmetric-shells", "https://pubs.acs.org/doi/pdf/10.1021/acsnano.9b08354", "https://news.uns.purdue.edu/x/2008b/081224RossmannMotors.html", "https://ucsdnews.ucsd.edu/pressrelease/relaxation_helps_pack_dna_into_a_virus", "https://www.discovery.org/multimedia/audio/2020/03/michael-behe-on-covid-19-and-why-are-there-viruses-anyway/", "https://science.sciencemag.org/content/331/6024/1513.summary", "https://commons.wikimedia.org/wiki/File:Phage.jpg", "https://creativecommons.org/licenses/by-sa/3.0"], "authors": [], "publish_date": "2020-04-01T23:21+00:00"}