{"result_id": "112035", "URL": "https://evolutionnews.org/2021/10/recalling-francis-collinss-the-language-of-god/", "timestamp": "2023-04-25 15:05:33 CEST+0200", "meta": {"description": "President Bill Clinton announced, in a speech Collins helped to write, “we are learning the language in which God created life.”", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2021/10/recalling-francis-collinss-the-language-of-god/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Francis Collins’s <i>The Language of God</i>", "cleaned_text": "Dr. Francis Collins has just announced his intention to step down as Director of the U.S. National Institutes of Health. Collins made the announcement after coming under scrutiny for allegedly lying about authorizing the funding of controversial and dangerous research at the notorious virus lab in Wuhan, China.\n\nBut Collins continues to receive high praise in some quarters. According to political commentator David A. French, he “is a national treasure. Thank you for your faithful service.” The “faithful” part might refer to Collins’s reputation as an evangelical Christian. In 2019, the Religion News Service reported that his “dedication to Christianity has earned him star power” among some evangelicals.\n\nYet the same day Collins made his announcement, Dr. John West (Managing Director of Discovery Institute’s Center for Science & Culture) posted an essay titled, “The Appalling Moral Failure of Francis Collins.” West faulted Collins for supporting the funding of “gruesome experiments with baby parts” and for demonizing people who have religious objections to compulsory COVID-19 vaccinations.\n\nI have another problem with Francis Collins. In the past 15 years, scores of people — some of them my personal friends — have told me how Collins’s 2006 book, The Language of God: A Scientist Presents Evidence for Belief, convinced them that a devout Christian can also be a Darwinist. Most of those people, I’m afraid, never read the book, or at least did not read past the first few pages. On those first pages Collins reported that in 2000 scientists released a rough draft of a sampling of human DNA. President Bill Clinton then announced, in a speech Collins helped to write, “we are learning the language in which God created life.”\n\nYet the remainder of Collins’s book was an argument against that idea. Instead, Collins argued that data from DNA sequencing provide “powerful support for Darwin’s theory of evolution, that is, descent from a common ancestor with natural selection operating on randomly occurring variations.” Probably the most powerful support came from what Collins called “junk DNA.” A creator, he argued, would not have put so much junk in our DNA, so it must have come from unguided evolution. (This is an odd way to argue for a supposedly scientific theory, namely that God wouldn’t have done it that way. Darwin argued similarly in The Origin of Species. But let’s overlook this theological aspect of Darwin’s and Collins’s argument.)\n\nBy the following year, 2007, Collins’s “powerful support for Darwin’s theory” was collapsing. The ENCODE Project reported “convincing evidence that the genome is pervasively transcribed.” That is, most of our DNA is transcribed into RNAs, the molecular intermediates between DNA and proteins. Since cells invest considerable energy in the process, this suggested that most non-protein-coding DNA is not junk, but functional.\n\nSo in 2007, Collins was quoted as saying “I’ve stopped using the term” junk DNA. Since then, the evidence for function in non-protein-coding DNA has vastly increased. The first line of one recent article in a scientific journal is, “The days of ‘junk DNA’ are over.”\n\nIt’s not a moral failure to be mistaken about evidence that supposedly supports Darwinian evolution. But the title of Collins’s Language of God was deceptive from the start. And Collins has looked the other way as it has continued to deceive. I consider this one more moral failure of Francis Collins.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2021/10/Francis-Collins.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Francis Collins’s <i>The Language of God</i> | Evolution News", "description": "President Bill Clinton announced, in a speech Collins helped to write, “we are learning the language in which God created life.”", "url": "https://evolutionnews.org/2021/10/recalling-francis-collinss-the-language-of-god/", "site_name": "Evolution News", "updated_time": "2021-10-08T02:39+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2021-10-08T13:58+00:00", "article:modified_time": "2021-10-08T02:39+00:00"}, "tags": ["National Institutes of Health", "Center for Science & Culture", "China", "David French", "ENCODE", "Junk DNA", "Darwinian evolution", "Francis Collins", "theology", "COVID-19", "John West", "proteins", "The Language of God", "Religion News Service", "vaccinations", "evolution", "Wuhan", "The Origin of Species", "Bill Clinton"], "tweets": [], "movies": [], "links": ["https://www.nih.gov/news-events/news-releases/francis-collins-step-down-director-national-institutes-health", "https://www.theepochtimes.com/dr-francis-collins-stepping-down-as-head-of-nih_4032517.html", "https://twitter.com/davidafrench/status/1445400222780301321", "https://religionnews.com/2019/04/01/nih-director-francis-collins-on-why-christians-must-reconcile-with-science/", "https://evolutionnews.org/2021/10/the-appalling-moral-failure-of-francis-collins/", "https://thefederalist.com/2021/05/07/university-of-pittsburgh-uses-taxpayer-funded-aborted-babies-for-medical-research/", "https://stream.org/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/", "https://www.discovery.org/a/4529/", "https://www.discovery.org/a/8101/", "https://www.nature.com/articles/nature05874.pdf", "https://www.wired.com/2007/06/one-scientists-junk-is-a-creationists-treasure/", "https://www.discovery.org/b/the-myth-of-junk-dna/", "https://academic.oup.com/gbe/article/13/10/evab217/6380869?searchresult=1"], "authors": [], "publish_date": "2021-10-08T13:58+00:00"}