{"result_id": "112033", "URL": "https://evolutionnews.org/2021/05/anti-meat-propaganda-flops-as-chicken-consumption-soars/", "timestamp": "2023-04-25 15:05:32 CEST+0200", "meta": {"description": "Me? I don’t care what people eat. That’s a personal choice — kind of like taking the COVID vaccine should be.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2021/05/anti-meat-propaganda-flops-as-chicken-consumption-soars/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Anti-Meat Propaganda Flops as Chicken Consumption Soars", "cleaned_text": "The animal rights/radical environmentalist cabal wants to get us to quit eating meat. The vegans claim the mantle of compassion — ignoring the fact that human beings are naturally omnivores and that the only way to go totally meat and dairy free is to take supplements. Even then, such diets are bad for children.\n\nThe environmentalists want to make us quit eating meat because of food animals’ supposed contributions to global warming. Much of the focus is on cattle, but we are told that the CLIMATE CRISIS! requires drastic cuts in meat consumption.\n\nAmerica apparently isn’t buying it. Instead, we are purchasing fried chicken at record rates. From the Bloomberg story:\n\nThe popularity of chicken — from sandwiches and tenders to nuggets and wings — is fueling such demand for fried poultry that America is starting to run short. KFC says it’s struggling to keep up with soaring demand for its new sandwich, while North Carolina-based chicken-and-biscuits-chain Bojangles reported outages of tenders across its 750 locations. KFC saw its comparable-store sales soar 14% in the most recent quarter in the U.S., due in part to its new chicken sandwich that’s selling twice as much as past new sandwiches. McDonald’s, which also reported higher-than-expected first-quarter sales, didn’t mention any supply constraints when it reported earnings Thursday but did say sales so far of its new chicken sandwich line are “far exceeding expectations.” Poultry companies have been struggling to keep up with demand from quick-service restaurants. The biggest challenge for Pilgrim’s Pride Corp., the second-biggest U.S. chicken producer, is labor, according to Chief Executive Officer Fabio Sandri. The company expects to pay $40 million more this year to pay and retain workers, Sandri said Thursday.\n\nMe? I don’t care what people eat. That’s a personal choice — kind of like taking the COVID vaccine should be. I respect vegetarians and vegans, but also those who like to barbecue the night away. I don’t see one side of the food divide as superior to the other.\n\nI do get tired, however, of the constant haranguing from those who think their vegetarian food choices are morally superior, or who claim the high ground of compassion because they favor polices that would make meat — that splendid source of essential nutrition — too expensive for poor people to buy.\n\nThose types of advocacy articles get most of the play in the media — liberal, conservative, and mainstream. I have to say, it’s kind of refreshing to see the apparent failure of anti-meat propagandizing.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2021/05/KFC-scaled.jpg", "image:width": "2560", "image:height": "1344", "locale": "en_US", "type": "article", "title": "Anti-Meat Propaganda Flops as Chicken Consumption Soars | Evolution News", "description": "Me? I don’t care what people eat. That’s a personal choice — kind of like taking the COVID vaccine should be.", "url": "https://evolutionnews.org/2021/05/anti-meat-propaganda-flops-as-chicken-consumption-soars/", "site_name": "Evolution News", "updated_time": "2021-05-22T01:21+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2021-05-22T14:17+00:00", "article:modified_time": "2021-05-22T01:21+00:00"}, "tags": ["chicken", "media", "children", "vegans", "animal rights", "Bojangles", "Fabio Sandri", "compassion", "food animals", "fried chicken", "vegetarians", "radical environmentalists", "Bloomberg", "global warming", "environmentalists", "KFC", "anti-meat"], "tweets": [], "movies": [], "links": ["https://www.nationalreview.com/human-exceptionalism/abuse-make-infants-vegans-wesley-j-smith/", "https://www.dailymail.co.uk/sciencetech/article-6805151/Stop-eating-meat-save-planet-report-suggests.html", "https://www.bloomberg.com/news/articles/2021-04-29/fried-chicken-craze-is-causing-u-s-to-run-low-on-poultry", "https://www.nationalreview.com/2020/04/chinas-wet-markets-americas-factory-farming-both-violate-moral-common-sense/", "https://www.nationalreview.com/corner/how-much-more-should-we-pay-for-costcos-chickens/", "https://www.nationalreview.com/corner/eating-chicken-is-so-popular-stocks-are-running-low/"], "authors": [], "publish_date": "2021-05-22T14:17+00:00"}