{"result_id": "112009", "URL": "https://evolutionnews.org/2023/01/remembering-paul-johnsons-assessment-of-darwin/", "timestamp": "2023-04-25 15:05:15 CEST+0200", "meta": {"description": "The reviewers that insist this work is “ludicrous,” a “smear,” or a “hatchet job” are wrong; it is none of these.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2023/01/remembering-paul-johnsons-assessment-of-darwin/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Remembering Paul Johnson’s Assessment of Darwin", "cleaned_text": "Editor’s note: The wonderful historian and journalist Paul Johnson died today at age 94. His 2012 biography Darwin: Portrait of a Genius provoked discussion and disagreement at Evolution News when it was published. We offer science historian Michael Flannery’s review below.\n\nAn eminent historian and author of numerous bestsellers, Paul Johnson has just published a book that is provoking hysterical responses. The book is Darwin: Portrait of a Genius. Writing at Slate, Mark Joseph Stern calls it an “effort to smear evolution.” Stern complains, “He [Johnson] got it horribly, almost comically wrong.” But Stern isn’t laughing, and he concludes that “no thoughtful reader could possibly tolerate Johnson’s stunning intellectual dishonesty.” Similarly, Rowan Hooper, writing for the New Scientist (posted at Culture Lab), called the book “ludicrous . . . a vendetta, an agenda-driven hatchet job.”\n\nWhy all the fuss? What is “horribly wrong” and who is driving the “agenda”? Anyone familiar with the controversial nature of Darwin’s theory should immediately step back and at least ask, Who exactly is wielding the hatchet?\n\nJohnson’s work is not strictly speaking a biography; it is a historian’s assessment of modern evolutionary theory and the man behind it. It takes the form not of an exhaustive account of the life and work of Charles Darwin but rather of an essay, a 151-page essay to be precise. There is much value in a work of this kind. After all, few but the most committed specialist or obligated graduate student would plod through Janet Browne’s 1,040-page (not counting references and index!) two-volume biography of the man. More serviceable is Adrian Desmond and James Moore’s Darwin: The Life of a Tormented Evolutionist, but at 677 pages of text it too can be a daunting task. While a careful reading of both (especially the latter) will offer permanent rewards, the considered opinion of a seasoned historian on the importance and impact of Darwin’s theory of evolution, stripped of the minutiae, has real value.\n\nAs Johnson emphasizes, Darwin produced an explanation for the diversity of life (common descent by means of natural selection) that was transformative of how people viewed themselves and the world. It was an idea whose time had come. From its publication on November 24, 1859, the Origin of Species quickly became the must-read volume for much of England, and not just the elite. The accession of five hundred copies by Mudie’s circulating library (an extraordinarily large order) helped to introduce Darwin to the rising middle class. In fact, Johnson correctly notes that Mudie’s enthusiastic acquisition and distribution of the Origin was tantamount to society’s seal of approval.\n\nDespite the popularity of Darwin’s magnum opus, Johnson further explains that his complete theory was really contained in three books. First, of course, was the Origin (his best, a succinct and accessible exposition of his theory), then in 1871 the Descent of Man (the explicit connection of his evolutionary principles to humanity), and finally one year later his Expression of the Emotions (an odd compilation whose purpose was to provide “evidence” that man was different from animal by degree not kind).\n\nWhere Origin succeeded, Descent and Expressions failed. Darwin’s handling of human attributes was superficial and, when comparing mankind with other species, often naïvely anthropomorphic.\n\nMuch of Descent, writes Johnson, consisted of “rambling stuff of no scientific value whatever” (p. 105) while other parts merely served to justify racial stereotypes. Darwin’s handling of sexual selection when applied to Homo sapiens was patronizing and patriarchal. The reason that the Descent was such an inferior production, Johnson astutely observes, is that Darwin was a poor anthropologist. He “did not bring to his observation of humans the same care, objectivity, acute notation, and calmness he always showed when studying birds and sea creatures, insects, plants, and animals. He jumped to conclusion and believed gossip . . .” (p. 29). Darwin’s Expression book wasn’t any better, a strange collection of extrapolations of animal reactions to human emotions augmented with “photographs of hysterics, lunatics, savages, and other interesting mug shots” (p. 102).\n\nAll of this may have passed with varying degrees of reviewer tolerance but for two important points made by Johnson. First, he links Darwin’s theory to the most unseemly aspects of social Darwinism. It’s not that Darwin is personally responsible for this; but the book proposed an idea that took on a life of its own. As Johnson puts it:\n\nDarwin’s idea of life emerging from the wholly random activity of natural selection driven by chance and necessity (emphasizing domestic breeding as a primary example and proof of this process) paved the way for eugenics, forced sterilizations, and even the “racial hygiene” of Nazi Germany. Richard Weikart has written in depth on these themes in From Darwin to Hitler and Hitler’s Ethic, but Johnson also brings up the influence of social Darwinism (direct or indirect) on the thought of Mao Tse-tung, Stalin, and Pol Pot, among others.\n\nAs for its tragic effects in America, one need only read Samuel J. Holmes’s comments in 1939 to appreciate the influence of American eugenics on the eve of Nazi expansion and its overt Darwinian connection. Harry Bruinius has estimated that forced sterilizations of the “unfit” in America during the pre-World War II years may be modestly estimated at 65,000. Iowa-born Harry Laughlin would become America’s leading eugenicist, and his enthusiasm for “racial betterment” was matched only by his admiration for Germany in pursuing it. It was not by mere whimsy that Heidelberg University awarded him an honorary doctorate for his contributions to “race hygiene” in 1936 (see Bruinius, Better for All the World: The Secret History of Forced Sterilization and America’s Quest for Racial Purity).\n\nDarwin’s apologists can engage in indignant handwaving but they cannot refute these sad facts. But their reaction is expected. Such is the response of ideologues faced with the baring of their favored patron saint’s gospel and its consequences.\n\nHere is Johnson’s second offense. He correctly objects to\n\nThere are a few flaws in Johnson’s treatment. For example, he claims Wallace first read Thomas Malthus’s Essay on Population about the same time as Darwin did in 1836, but this is doubtful as Wallace would have been only 13 years old. Wallace states in his autobiography My Life that he read it in the town library at Leicester in 1844. More serious is Johnson’s assertion that Darwin and Alfred Russel Wallace were poor mathematicians (in fact, having once been a surveyor, Wallace was exceptionally good in math and geometry) and that their uncritical evaluation of Malthus’s poor statistical analysis caused them to accept a flawed economic “law” that claimed food supplies rise arithmetically while population increase geometrically.\n\nAccording to Johnson, this fit “the horror scenario” of Darwin’s view of nature’s struggle, a view that Johnson believes Wallace shared. But Johnson is apparently unfamiliar with how Wallace actually incorporated Malthus into his own evolutionary theory. I have pointed out that Wallace read Malthus quite differently from Darwin (Alfred Russel Wallace: A Rediscovered Life, p. 63).\n\nJohnson too readily lumps Wallace together with Darwin’s theory. Actually, Wallace presented a teleological view of evolution and of humanity’s place that was strikingly different from Darwin’s. Another error is Johnson’s mention at several points in the book of Darwin’s opposition to vaccination. This is simply false. Darwin did write in the Descent that vaccination helped to preserve weak members of society and thus permitted them to “propagate their kind.” Nevertheless, Darwin himself was a fastidious vaccinator when it came to his own children, and he never supported the growing and powerful anti-vaccination movement in Victorian England.\n\nJohnson also errs in stating that Darwin handled the God question in the Origin with “fine judgment and exquisite tact” (p. 82). If duplicity may be counted as complementary to judgment and tact then perhaps this assessment may stand, but there is little question that Darwin was less than honest here. He told Joseph Hooker in a letter dated March 29, 1863, of his regret that he had “truckled to public opinion & used Pentateuchal term of creation, by which I really meant ‘appeared’ by some wholly unknown process.” For promotional reasons, however, he never removed the “Pentateuchal term of creation” from any subsequent edition. While this leaves Johnson’s appraisal dubious, it does substantiate his claim that Darwin had “stealthy self-promoting instincts” (p. 92).\n\nPaul Johnson at His Best\n\nDespite these missteps, Johnson’s analytic powers are at their best when he is assessing the impact of Darwinian theory on society and indeed on Darwin himself. Darwin’s disciples can bemoan the connection all they want, but the materialistic chance-driven world ushered in by their Down House hero had devastating human consequences. “In the twentieth century,” Johnson concludes, “it is likely that over 100 million people were killed or starved to death as a result of totalitarian regimes infected with varieties of social Darwinism” (p. 136).\n\nOn a personal level the evolutionary theory that Darwin spent much of his life fostering — his “child” — weighed heavily on him in later years. Darwin’s genius — what “genius” there was — came from his powers of observation, not his ability to think abstractly or for that matter particularly deeply. Johnson astutely observes that Darwin “deliberately shut his eyes to the ultimate consequences of his work, in terms of the human condition and the purpose of life or the absence of one. Though he sometimes, in his published works, put in a reassuring phrase, his private views tended to be bleak” (pp. 144-145). It was a fate that his “Bulldog Defender” Thomas Henry Huxley also met over the question of morality in a blind, purposeless nature. Nihilism haunted them both.\n\nThe reviewers that insist this work is “ludicrous,” a “smear,” or a “hatchet job” are wrong; it is none of these. It is a book that follows some excellent and courageous scholars like Jacques Barzun, Gertrude Himmelfarb, R. F. Baum, Stanley Jaki, Phillip Johnson, and Benjamin Wiker in suggesting that Darwin’s evolutionary theory is built upon questionable premises and has had a deleterious effect upon every society it has touched. The Darwinian fundamentalists hate to admit it, but more than twenty years after attorney Phillip Johnson’s Darwin on Trial, the relentless questioning continues.\n\nThis time a different Johnson examines the witness. Darwin: Portrait of a Genius was certainly titled in a spirit of irony, but nonetheless it represents an interesting and valuable brief to an ever-expanding minority opinion.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2019/11/Charles-Darwin.jpg", "image:width": "1200", "image:height": "630", "image:alt": "Charles Darwin", "locale": "en_US", "type": "article", "title": "Remembering Paul Johnson’s Assessment of Darwin | Evolution News", "description": "The reviewers that insist this work is “ludicrous,” a “smear,” or a “hatchet job” are wrong; it is none of these.", "url": "https://evolutionnews.org/2023/01/remembering-paul-johnsons-assessment-of-darwin/", "site_name": "Evolution News", "updated_time": "2023-01-12T20:32+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2023-01-12T20:25+00:00", "article:modified_time": "2023-01-12T20:32+00:00"}, "tags": ["From Darwin to Hitler", "forced sterilization", "Slate", "history", "Stanley Jaki", "Thomas Malthus", "The Descent of Man", "Leicester", "Jacques Barzun", "James Moore", "Janet Browne", "Victorian England", "R. F. Baum", "Darwin: Portrait of a Genius", "Gertrude Himmelfarb", "Darwin: The Life of a Tormented Evolutionist", "Germany", "Social Darwinism", "Phillip Johnson", "Racism", "Richard Weikart", "New Scientist", "Pol Pot", "Heidelberg University", "Samuel J. Holmes", "Harry Bruinius", "The Expression of the Emotions in Man and Animals", "Origin of Species", "Paul Johnson", "Mao Tse-tung", "Alfred Russel Wallace", "Mark Joseph Stern", "Hitler's Ethic", "Benjamin Wiker", "eugenics", "Rowan Hooper", "evolution", "Joseph Stalin", "Harry Laughlin", "Adrian Desmond", "United States"], "tweets": [], "movies": [], "links": ["http://www.amazon.com/Darwin-Portrait-Genius-Paul-Johnson/dp/0670025712", "http://www.slate.com/articles/health_and_science/science/2012/10/paul_johnson_s_darwin_portrait_of_a_genius_conservatives_smear_darwin_by.html", "http://www.newscientist.com/blogs/culturelab/2012/10/darwin-johnson.ht", "http://www.amazon.com/Darwin-Hitler-Evolutionary-Eugenics-Germany/dp/140397201X", "http://www.amazon.com/Hitlers-Ethic-Pursuit-Evolutionary-Progress/dp/0230618073", "https://evolutionnews.org/2011/10/american_eugenics_on_the_eve_o_1051991.html", "http://www.amazon.com/Better-All-World-Sterilization-Americas/dp/0375713050", "http://www.amazon.com/Alfred-Russel-Wallace-Rediscovered-Life/dp/0979014190"], "authors": [], "publish_date": "2023-01-12T20:25+00:00"}