{"result_id": "112029", "URL": "https://evolutionnews.org/2022/07/scientists-are-undermining-our-trust-in-science/", "timestamp": "2023-04-25 15:05:29 CEST+0200", "meta": {"description": "Falsification of scientific research has been a chronic problem for the sector in recent years.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/07/scientists-are-undermining-our-trust-in-science/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Scientists Are Undermining Our Trust in Science", "cleaned_text": "A just-published exposé in the journal Science claims that a seminal study on the causes of Alzheimer’s disease may contain falsified data.\n\nThe 2006 report concluded that Alzheimer’s is caused by a buildup of a certain type of plaque in the brain — a finding that has guided research into cures for Alzheimer’s ever since. But now, critics claim that the original authors “appeared to have composed figures by piecing together parts of photos from different experiments” calling their conclusions into significant question.\n\nIf true, this is a scientific scandal of the worst order. As the Science article notes, the questionable study strongly influenced the funding of research into treatments, with the National Institutes of Health (NIH) spending $1.6 billion pursuing the plaque hypothesis this fiscal year. Even worse, if scientific mistakes in the study were not caught during peer review because of data manipulation, it deprived Alzheimer’s researchers investigating other hypotheses of badly needed funding, perhaps delaying the development of effective treatments.\n\nFalsification of scientific research has been a chronic problem for the sector in recent years. For example, a South Korean researcher committed outright research fraud when in 2004 and again in 2005, he convinced Science — the same publication now exposing the problems with Alzheimer’s plaque research — that he had perfected a method of cloning human embryos and created 11 patient-specific embryonic stem cell lines. Despite peer review, it was all bogus, and eventually the papers were withdrawn. But those reports had a major political impact, influencing the government’s funding of embryonic versus adult stem cell research and affecting political debates around this controversial area of biotechnology. (Experiments to create cloned human embryos eventually succeeded in 2013.)\n\nPerhaps the most famous — and deleterious — research fraud of recent times was published in The Lancet, claiming that the MMR (measles, mumps, rubella) childhood vaccines can cause autism. Despite the paper subsequently being retracted by The Lancet, repeated follow-up investigations showing that the author allegedly committed blatant research fraud, and even the eventual revoking of his medical license, millions of people still believe the claim.\n\nOf course, not all false studies are fraudulent or based on manipulated data. As in all human endeavors, scientists sometimes make mistakes. That appears to be the case with long-accepted research showing that clinical depression is caused by a chemical imbalance of serotonin in the brain. But a new, in-depth review of the data reached the startling conclusion that “the huge research effort based on the serotonin hypothesis has not produced convincing evidence of a biochemical basis to depression,” which serves as the starting point behind many antidepressant medications.\n\nDoes that mean that anti-depressants don’t work? The new study doesn’t say. But that crucial question will now require — you guessed it — more research. Let’s hope the correct answer comes quickly as these medications can cause suicidal ideation and other potentially serious side effects.\n\nAt this point many scientists will be screaming that catching fraud and research mistakes is part of the scientific method, which allows questioning of — and challenges to — even the most seemingly settled scientific findings. That’s true, at least in theory. But lately, that fail-safe process has been increasingly short-circuited by non-scientific ideological or political gamesmanship at the highest levels of the public health and science sectors.\n\nThis article was originally published by The Epoch Times. Read the rest at Mind Matters News.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/07/microscope.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Scientists Are Undermining Our Trust in Science | Evolution News", "description": "Falsification of scientific research has been a chronic problem for the sector in recent years.", "url": "https://evolutionnews.org/2022/07/scientists-are-undermining-our-trust-in-science/", "site_name": "Evolution News", "updated_time": "2022-07-29T23:58+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-07-30T14:57+00:00", "article:modified_time": "2022-07-29T23:58+00:00"}, "tags": ["Research", "fraud", "measles", "funding", "rubella", "peer review", "South Korean", "plaque", "public health", "brain", "biotechnology", "treatments", "Science (journal)", "serotonin", "autism", "Alzheimer’s disease", "The Lancet", "depression", "mumps", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.science.org/content/article/potential-fabrication-research-images-threatens-key-theory-alzheimers-disease", "https://www.theepochtimes.com/t-scientific-research", "https://www.bmj.com/content/342/bmj.c7452.full", "https://www.nature.com/articles/s41380-022-01661-0", "https://mindmatters.ai/2022/07/trust-in-science-fraud-now-claimed-re-key-alzheimer-paper/"], "authors": [], "publish_date": "2022-07-30T14:57+00:00"}