{"result_id": "112025", "URL": "https://evolutionnews.org/2022/11/is-information-the-future-of-biology-and-medicine/", "timestamp": "2023-04-25 15:05:26 CEST+0200", "meta": {"description": "University of Washington’s Georg Seelig wants to “design molecules” and “write genetic information.”", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/11/is-information-the-future-of-biology-and-medicine/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Information: The Future of Biology and Medicine?", "cleaned_text": "At a Thursday afternoon panel at Discovery Institute’s tech summit COSM 2022, pioneers in biology had a chance to talk to the public about the code that is written into our genomes.\n\nFirst up was Georg Seelig, a Swiss synthetic biologist and researcher at the Paul Allen School of Computer Science at the University of Washington. He described his bioengineering research as aiming to learn “to read and write the language of the genome,” which is a “sort of a code” written in a “language.”\n\nPopular wisdom might hold that we have fully deciphered this language — and Seelig acknowledges that “over the last few decades, we’ve really learned a lot about the syntax of this language.” But he explains there’s still much to learn: “We’ve learned about the words of the language, but we still can’t quite put it all together.” (November 10, 2022)\n\nSeelig then explained the goal of the field of synthetic biology: “We don’t only want to be able to really read and interpret this language, we want to be able to write in this language. And the reason we want to do this is because we want to be able to essentially design molecules” — molecules like proteins, antibodies, mRNAs, and one day “entire cells.” One day “we might even want to engineer cellular populations,” he said.\n\nThe key to all of this, he explained to the gathering, is “to learn is how to write genetic information.”\n\nOne way to do this is to observe the millions of variants of the human genome within the human population. Some of these variants “might make us susceptible to some disease, others might make us more resilient,” and still others “probably don’t do anything at all, right.” We can decode the language of the genome by studying these variants and reverse-engineering them to figure out what they do.\n\nAnother way to unlock the language of life is to make libraries of genetic variants and see what happens in the lab. Seelig gave the example of producing mRNA vaccines, where mRNA sequences contain “leader and trailer sequences” which determine “how much protein is made, where the mRNA goes, how stable it is.”\n\nTo understand the language encoding these leader sequences, we can make a huge library of mRNA variants and “use machine learning to learn the relationship between the sequence and the function” and thereby “learn the rules of how much protein is made.”\n\nThe next speaker was Matt Scholz, CEO of Oisín Biotechnologies a Seattle-based biotech company that seeks to address the process of aging. He explained that “the North star” for his firm’s research is “effectively that the essence of life is information.”\n\nTo continue the analogy, Scholz views chemistry as the “substrate” of life, but when you “tinker with the substrate” you get “unintended consequences” — much like “trying to debug Microsoft Word by changing the microchips in your computer.” This is why so many drugs have so many unexpected side effects.\n\nThe solution proposed by Oisín is to create “delivery technology” that allows one to upload information into cells — akin to how we upload data into a computer through a USB port.\n\nScholz’s dream is that one day everyone might have their own “DNA printer,” much like a 3D printer but one that prints out DNA sequences. As biotechnology develops, information could be sent to that machine to give DNA sequences that provide health benefits or treat diseases that can then be imported into a person’s body in the comfort of their kitchen.\n\nThe key to this technology is the fact that biology runs on information, and information is easy to send. Even astronauts could receive information beamed from earth, print out the needed DNA sequences, and treat their own diseases while in space.\n\nRead the rest at Mind Matters News, published by Discovery Institute’s Bradley Center for Natural and Artificial Intelligence.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2021/06/DNA.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Information: The Future of Biology and Medicine? | Evolution News", "description": "University of Washington’s Georg Seelig wants to “design molecules” and “write genetic information.”", "url": "https://evolutionnews.org/2022/11/is-information-the-future-of-biology-and-medicine/", "site_name": "Evolution News", "updated_time": "2022-11-15T01:12+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-11-15T01:11+00:00", "article:modified_time": "2022-11-15T01:12+00:00"}, "tags": ["diseases", "biology", "mRNAs", "microchips", "health", "bioengineering", "USB port", "COSM 2022", "Georg Seelig", "Matt Scholz", "medicine", "Paul Allen School of Computer Science", "information", "astronauts", "space", "mRNA vaccines", "proteins", "antibodies", "genome", "unintended consequences", "Microsoft Word", "cells", "University of Washington"], "tweets": [], "movies": [], "links": ["https://unsplash.com/@nci?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/dna?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://cosm.tech/", "https://people.ece.uw.edu/seelig_georg/", "https://www.linkedin.com/in/matthewscholz/", "https://mindmatters.ai/2022/11/is-information-the-future-of-medicine-and-biology/"], "authors": [], "publish_date": "2022-11-15T01:11+00:00"}