{"result_id": "112002", "URL": "https://evolutionnews.org/2020/05/from-pfizer-scientism-and-self-congratulation/", "timestamp": "2023-04-25 15:05:11 CEST+0200", "meta": {"description": "Amidst a controversial national lockdown, economic ruin, and mounting intelligence evidence pointing to an origin in a Chinese lab, the coronavirus has reminded us of a number of things.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2020/05/from-pfizer-scientism-and-self-congratulation/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "From Pfizer, Scientism and Self-Congratulation", "cleaned_text": "In the race to defeat the coronavirus, good fortune to Pfizer Inc., among others. The drug giant said last week “it will begin testing of its experimental vaccine in the U.S. as early as next week.” But this new ad from Pfizer goes over the top in its self-congratulation:\n\nAt a time when things are most uncertain, we turn to the most certain thing there is: Science. Science can overcome diseases, create cures, and yes, beat pandemics. Because when it’s faced with a new opponent, it doesn’t back down. It revs up, asking questions till it finds what it’s looking for. That’s the power of science.\n\nWell actually, that’s the power of creative ingenuity in general, a capacity unique to human beings, that is put to use in a range of fields. Those fields include art, music, philosophy, history, religion, politics, entertainment, natural science, and yes, medical science. The idea of the ad, that science stands alone as “the most certain thing there is,” comes from putting on ideological blinders. It’s what we call scientism. That is one very timely focus of the upcoming free webinar with Discovery Institute scientists and scholars on Saturday, May 16. John West, joined by Brian Miller and Robert J. Marks, will discuss “Science and Scientism in the Age of COVID-19: Wisdom from C. S. Lewis.” Find more information about the event here. Registration is required.\n\nAmidst a controversial national lockdown, economic ruin, and mounting intelligence evidence pointing to an origin in a Chinese lab, the coronavirus has reminded us of a number of things. One is the limitations of science, and the need for independent criticism of it.\n\nThat kind of criticism has emerged as Discovery Institute’s contribution in the discussion of the virus.\n• At Evolution News, Wesley Smith points to the limits of the technocratic elite, the bureaucratic bioethicists with their “immoral and amoral values,” to whom we increasingly assign the task of establishing health policy.\n• Michael Egnor, himself a physician at New York’s viral frontline, argues that it was our trusting too much in scientists that got us into the present crisis in the first place: “As this pandemic shows, we need to question scientific experts, constantly and rigorously. We need scientific controversy, not ‘consensus.’”\n• Our colleague Douglas Axe strikes a similarly skeptical note about the lockdown, arguing that “Our Heroic Efforts to Stop the Coronavirus Could Be Great Pain for Little Gain.”\n\nOur culture is at war with itself over science. One side advocates a blind, worshipful fealty, and complains when others fail to get in line to worship. It has its sacred totems — the lockdown, extreme social distancing, the mask. Resistance to these things comes from worries about economic depression, social control, and misplaced piety. As National Review’s Rich Lowry wrote recently, “Social Distancing Isn’t a Religion.” His implication was that some people treat it as if it were a religion.\n\nAnother side in the dispute is more rational. It appreciates what science can contribute, but it also recognizes the problems with many statements made in the name of science. It understands the peril in an overly awestruck attitude, and the potential for abuse of science’s authority. What science needs now isn’t applause from itself or adoration from the rest of us. Neither is in the interest of the public, which is supposed to be served by Pfizer.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2020/05/Pfizer-1.jpg", "image:width": "417", "image:height": "233", "locale": "en_US", "type": "article", "title": "From Pfizer, Scientism and Self-Congratulation | Evolution News", "description": "Amidst a controversial national lockdown, economic ruin, and mounting intelligence evidence pointing to an origin in a Chinese lab, the coronavirus has reminded us of a number of things.", "url": "https://evolutionnews.org/2020/05/from-pfizer-scientism-and-self-congratulation/", "site_name": "Evolution News", "updated_time": "2021-01-09T00:16+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2020-05-05T12:34+00:00", "article:modified_time": "2021-01-09T00:16+00:00"}, "tags": ["pandemic", "scientism", "Brian Miller", "China", "history", "totem", "creativity", "C.S. Lewis", "religion", "music", "economic collapse", "Michael Egnor", "coronavirus", "Robert J. Marks", "Pfizer Inc.", "art", "authority", "COVID-19", "mask", "Wesley Smith", "Rich Lowry", "social distancing", "medical science", "worship", "Politics", "Douglas Axe", "Discovery Institute", "entertainment", "Wuhan", "philosophy"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1300", "height": "731", "embed_code": "<iframe title=\"Science Will Win\" width=\"1300\" height=\"731\" src=\"https://www.youtube.com/embed/Xl0tEfLve1U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Xl0tEfLve1U?feature=oembed"}], "links": ["https://www.wsj.com/articles/pfizer-coronavirus-vaccine-could-be-ready-for-emergency-use-by-fall-11588094064", "https://www.discovery.org/e/isi-webinar-on-science-scientism-and-society/", "https://abcnews.go.com/Politics/pompeo-enormous-evidence-unproven-theory-coronavirus-lab/story?id=70472857", "https://evolutionnews.org/2020/05/the-bioethicist-pandemic/", "https://evolutionnews.org/2020/04/herd-immunity-not-herd-mentality/", "https://stream.org/our-heroic-efforts-to-stop-the-coronavirus-could-be-great-pain-for-little-gain/", "https://www.nationalreview.com/2020/04/coronavirus-restrictions-identical-lockdowns-not-needed-everywhere/"], "authors": [], "publish_date": "2020-05-05T12:34+00:00"}