{"result_id": "112013", "URL": "https://evolutionnews.org/2021/11/harvard-u-press-computer-science-author-gives-ai-a-reality-check/", "timestamp": "2023-04-25 15:05:18 CEST+0200", "meta": {"description": "The key missing ingredient in machine intelligence is the ability to appreciate context, do analysis, and make appropriate inferences.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2021/11/harvard-u-press-computer-science-author-gives-ai-a-reality-check/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Giving AI a Reality Check", "cleaned_text": "Who is “they” in the sentence you just read? The audience or computers?\n\nYou immediately know the answer. It’s computers, because we know that researchers are struggling with how to figure out how to endow computers with AI. It makes no sense to talk about an audience having artificial intelligence. You intuitively understanding the meaning of “they” in the sentence without even having to think about it.\n\nWhat if the sentence had read:\n\nAgain, it is obvious to a typical human that “they” refers to the audience. But surprisingly, computers have an incredibly hard time answering such basic questions. Hence, “they” will never achieve artificial intelligence.\n\nThat was the central message of a talk last week at Discovery Institute’s COSM 2021 by Erik J. Larson, author of The Myth of Artificial Intelligence: Why Computers Can’t Think the Way We Do, published this year by Harvard University Press.\n\nLarson, who studied the philosophy of computer science for his PhD from the University of Texas at Austin, argues in his book that “The myth of artificial intelligence is that its arrival is inevitable, and only a matter of time — that we have already embarked on the path that will lead to human-level AI, and then superintelligence. We have not. The path exists only in our imaginations.” He continues, “All evidence suggests that human and machine intelligence are radically different.”\n\nFor Larson, computers can do calculations, but the key missing ingredient in machine intelligence is the ability to appreciate context, do analysis, and make appropriate inferences.\n\n“Calculation is connecting known dots; applying the rules of algebra, say. Analysis is making sense of the dots, making a leap or guess that explains them — and then, given some insight, using calculation to test it,” he writes. This is why it is so difficult for computers to identify who “they” are in the sentence.\n\nHe provides example after example of sentences with ambiguously defined pronouns. Humans can look at the context of the sentence and instantly understand who the pronoun refers to. Computers lack this analytical inference-making ability, and get stuck.\n\nDuring his talk, Larson explained that supercomputers can be trained to play Jeopardy, or get directions to the grocery store — and these accomplishments are often hyped in the media. Yet “in the meantime, nobody can talk to Alexa,” because computers lack the intuition or inference-making abilities to understand the meaning of human speech.\n\nThis imposes impassable limits on what computers can accomplish:\n\nLarson told the audience that, absent a fundamental innovation in our technology, the quest to create artificial intelligencesthat can do everything that humans can do (artificial general intelligence) is “doomed to failure.”\n\nThis view does not make Larson popular with people in his field. But he thinks a reality check is needed if the field of AI is to progress. He explains in his book how the myth of artificial intelligence is preventing us from making the breakthroughs that will enable progress in AI:\n\nMythology about AI is bad, then, because it covers up a scientific mystery in endless talk of ongoing progress. The myth props up belief in inevitable success, but genuine respect for science should bring us back to the drawing board. … [W]e are unlikely to get innovation if we choose to ignore a core mystery rather than face up to it. A healthy culture for innovation emphasizes exploring unknowns, not hyping extensions of existing methods-especially when these methods have been shown to be inadequate to take us much further. Mythology about inevitable success in AI tends to extinguish the very culture of invention necessary for real progress — with or without human-level AI.\n\nThus Larson told the crowd that, “The ultimate irony is we need human innovation to figure out how to compute, how to make general intelligence on a computer, if that’s what we want to do. But make no mistake, the AI we have today is inadequate for that task.”\n\nCross-posted at Mind Matters News, published by Discovery Institute’s Walter Bradley Center for Natural and Artificial Intelligence.", "opengraph": {"image": "https://mindmatters.ai/wp-content/uploads/sites/2/2021/04/the-myth-of-artificial-intelligence-1050x1597.jpg", "image:width": "1200", "image:height": "630", "image:alt": "COSM", "locale": "en_US", "type": "article", "title": "Giving AI a Reality Check | Evolution News", "description": "The key missing ingredient in machine intelligence is the ability to appreciate context, do analysis, and make appropriate inferences.", "url": "https://evolutionnews.org/2021/11/harvard-u-press-computer-science-author-gives-ai-a-reality-check/", "site_name": "Evolution News", "updated_time": "2021-11-17T01:30+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2021-11-17T01:30+00:00", "article:modified_time": "2021-11-17T01:30+00:00"}, "tags": ["superintelligence", "The Myth of Artificial Intelligence", "artificial intelligence", "ambiguity", "computer science", "COSM 2021", "algebra", "grocery store", "Discovery Institute", "Harvard University Press", "reality check", "artificial general intelligence", "audience", "Jeopardy", "philosophy", "computers", "Erik Larson", "humans"], "tweets": [], "movies": [], "links": ["https://cosm.technology/", "https://www.hup.harvard.edu/results-list.php?author=46847", "https://www.hup.harvard.edu/catalog.php?isbn=9780674983519"], "authors": [], "publish_date": "2021-11-17T01:30+00:00"}