{"result_id": "112005", "URL": "https://evolutionnews.org/2022/12/a-christmas-nightmare-for-the-covid-era-2/", "timestamp": "2023-04-25 15:05:13 CEST+0200", "meta": {"description": "The Christmas horror-comedy <i>Silent Night</i> offers a shrewd indictment of both mindless secularism and authoritarian science.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/12/a-christmas-nightmare-for-the-covid-era-2/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "A Christmas Nightmare for the COVID Era", "cleaned_text": "What if scientists declared that you and your loved ones would be dead by tomorrow? What would you do?\n\nThat’s the startling premise of last year’s most unconventional Christmas movie, Silent Night (2021). Now available for streaming on Amazon Prime and at Apple’s iTunes store, the film offers a shrewd indictment of both mindless secularism and authoritarian science.\n\nIn short, it’s the perfect Christmas movie for the COVID era. (Warning: Spoilers ahead, including how the film ends!)\n\nLike many Christmas stories, this holiday film centers on a group of family and friends who gather at someone’s house for Christmas. The setting in the British countryside is picture perfect, suitable for a Hallmark movie or a House Beautiful photo shoot. But hints are soon dropped that something is seriously amiss, and we eventually learn why: A monstrous cloud of poisonous gas is headed to Britain, scheduled to arrive early Christmas morning. According to the government, everyone exposed to it will die horrific and agonizing deaths.\n\nNot to worry — helpful government officials have come up with solution, a “final” solution, you might say: “exit pills” for everyone except the homeless and illegal immigrants. The pills promise a painless “death with dignity” — or so the government’s public service announcements constantly tell people on their mobile devices. “Avoid suffering. Take your exit pill and die with dignity,” a neutral middle-aged female voice advises.\n\nStarting out as a dark comedy, Silent Night gets progressively more somber as it explores life and death, the freedom to choose for oneself, and the tyranny of experts speaking in the name of science.\n\nThe focal point for much of the film is the boy Art (played by Roman Griffin Davis, the real-life son of writer/director Camille Griffin) and his onscreen parents Simon (Matthew Goode) and Nell (Keira Knightley), the hosts of the Christmas gathering.\n\nArt is frustrated that the adults won’t discuss the impending disaster. He tells his parents and the other adults that they don’t need to pretend before their children, because “we’ve seen the news.” What did Art and his fellow children learn from the “news”?\n\nA girl named Kitty (Davida McKenzie) suggests that the poison cloud must have been sent by Russia — because everyone knows “the Russians want us all dead” and “they’re obsessed with world domination.” Art and his two brothers express exasperation at what they regard as Kitty’s stupid claim.\n\nIt’s not Russia, they tell her, “it’s the planet… It’s very upset.”\n\n“For years, the planet’s absorbed everyone’s filthy rubbish, and it’s had enough. It can’t take it anymore, so it’s spitting it back out,” says Art. And why does he think that?\n\n“Greta warned us!” he says passionately. “She missed all that school. She spent weeks seasick. She even met Leonardo DeCaprio! And still, no one listened to her!”\n\nIn case you can’t tell, this is pure mockery — mockery of standard progressive talking points.\n\nIn interviews, the film’s writer/director Camille Griffin has made clear she regards herself as part of the secular left. “This is a pro-socialist film,” she says unabashedly, explaining that her intended targets of scorn included “Republican Conservatives” and those who supported Trump.\n\nYet “Republican Conservatives” and Trump supporters aren’t the ones who have idolized child environmental activist Greta Thunberg. It’s to Griffin’s credit that much of her film skewers the obsessions and pretensions of her own class and social set rather than just taking potshots at the conservatives she so despises. Unlike an overrated filmmaker like Oliver Stone (whose one-sided sermonizing easily becomes trite as well as tedious), Griffin is no propagandist. “I just wanted to ask questions with the film,” she says. “I’m not trying to give the answers.”\n\nThe result is an unflinching portrait of the hollowness of secular liberalism. The characters Griffin has created are ultimately difficult to like. They are a muddle-headed bunch who don’t seem to believe in anything other than their own personal needs and physical comfort. Truth, courage, thinking for yourself, self-sacrifice: These are alien concepts in their social set.\n\nSo is the reality of God. One of the most powerful aspects of the film is the way it counterposes the music and words of religious Christmas carols (yes, including “Silent Night”) with the characters’ empty secularism.\n\nTo be sure, the characters still deploy the cultural vestiges of religion, but they don’t really believe what they are saying. At one point, Nell tries to get her foul-mouthed son to temper his swearing by telling him: “It’s Christmas, darling. What would baby Jesus say?” Even her son knows the comment is vacuous and so pays no attention. At another point, Simon agrees to say grace over dinner. However, he doesn’t know how to begin. “Where to start?” he mumbles. “God,” his wife answers dryly. Simon then stumbles through a series of meaningless platitudes.\n\nTo invoke C. S. Lewis in The Abolition of Man, the characters in this movie are “men without chests” — people without rightly trained sentiments grounded in anything above themselves. Even liberalism’s lowest-common denominator commitment to “self-determination” doesn’t bind them. Since physical pain is the ultimate evil, their conclusion that everyone must take the exit pill is regarded as an iron consensus from which no one is allowed to dissent.\n\n“All we can do is take our pills and choose not to suffer,” Simon tells his son Art. When Art responds that “We have a choice” not to take the pill, his father quickly retorts: “No, no. We don’t have a choice. No.”\n\nLater, Art has an even more emphatic exchange with his father, leading him to realize that his father doesn’t even believe in God:\n\nAs Art becomes increasingly disillusioned by the pat answers offered by his parents and the government, he begins questioning more and more what he’s been told, culminating in a discussion with the adult James (Sope Dirisu), a seemingly kindly cancer doctor, whose own wife Sophie (Lily-Rose Depp) doesn’t want to take the “exit pill” because she is pregnant. “I don’t want to kill my baby,” she insists.\n\nThe boy tells James that he doesn’t plan to take the pill either, and James first tries to frighten him into submission. “Pain… is intolerable,” he tells Art. “Well I don’t care, I’m not taking it,” Art replies stubbornly. He then enters into a remarkable dialogue with James that pushes back against the pretensions of both the government and its scientists.\n\nWhen Art suggests that perhaps some people may have survived the gas cloud, James dogmatically replies with utter confidence: “Not one single being has survived.” But Art is no longer cowed by adults making assertions they can’t back up, so he responds: “Says who?” The doctor’s answer is telling:\n\nArt goes on to say his math teacher once made a mistake and was called on it by a student. The math teacher refused to believe he was wrong and berated the student. But later the teacher discovered he really had made a mistake, and he apologized.\n\nJames patronizingly responds by suggesting that unlike math teachers, top scientists are above error: “This isn’t pretend, Art. There isn’t someone somewhere who’s made a mistake.”\n\nArt sensibly replies: “People don’t generally know they made a mistake until they’ve made it, and then we’ll all be dead, and then there won’t be anyone to apologize to.”\n\nBy the end of the film, it has become apparent that the adults are the real children in this tale of woe. They don’t take responsibility. (“We just want to make sure that you understand that as your parents, we are not to blame… this is not our fault,” they tell their children.) They don’t demonstrate independence of thought. They don’t question. They don’t value anything above the avoidance of pain. They don’t support the freedom of others to make their own choices. And they don’t have courage.\n\nBy contrast, when Art discovers that James’s wife Sophie doesn’t want to take the pill, he offers to stay with her so she won’t die alone when the poisonous cloud comes.\n\nCourageous though he may be, even Art understands that in the natural order of things, he needs the care and protection of adults. For me as a father, the film’s most moving scene is when Art begs Simon to join him in not taking the exit pill. “Please, Dad, stay with me,” Art implores. “We can hide from the poison together. We can — we can shut the windows, and we can barricade the doors, and we can wait it out. Please, Dad, I need a grown up. I can’t do it on my own.”\n\nBut Simon isn’t moved, not even by entreaties from his son. The scene is heart-rending.\n\nWhen the poison cloud is about to arrive, Simon and another father don’t seem quite ready to follow through with mass suicide. But the voice of science intervenes in the character of the medical doctor James. “It’s time,” he tells the other men; and they commence the process of killing themselves and their families. James’s own wife still doesn’t want to die, so he emotionally manipulates her to get her to take the suicide pill along with him. So much for self-determination.\n\nSimon, Nell, Art, and his brothers play out their own drama. Earlier in the film, Art had gone outside and was exposed to a poisonous twister that came before the main cloud. He first seems fine, but they check on him again and his face is now bloody — seemingly confirming the government’s claim that “fatal hemorrhaging” is the final result of exposure to the cloud. Terrified, Simon and Nell hurriedly rush the rest of their family to take their suicide pills.\n\nThe menacing cloud finally engulfs the house in the night. The next morning, a new day dawns. The poisonous cloud is gone. The countryside is peaceful again with new falling snow. Inside the house, dead bodies litter the rooms.\n\nIn the very last scene, we see Art lying on a bed next to the lifeless bodies of his parents and brothers.\n\nAnd then his eyes open.\n\nThe government and its scientists were wrong after all. Appallingly, unbelievably, catastrophically wrong.\n\nBut there are no adults left to note the error because they all meekly submitted to the scientists. Only the child who was willing to question the consensus survives.\n\nIt’s hard to see how the moral of the story could be any clearer. If this film isn’t a searing indictment of the tyranny of government authoritarianism in the name of science, I don’t know what is.\n\nFew films can be described as genuinely prophetic, but this is one of them. Amazingly, it was scripted and mostly filmed before the COVID-19 pandemic. However, instead of fully embracing what she has created, writer/director Griffin has taken pains to distance her film from any applicability to the authoritarian policies growing out of the pandemic. She even expresses regret about using the term “scientist” in the film. When asked about what about what people should take away from her film, she responds that she hopes “It’ll make us think, are we doing enough? Are we recycling enough? Are we paying enough taxes? Is our government making the right decisions? Are we getting vaccinated?”\n\nPerhaps Griffin actually believes that this is her film’s takeaway. Or perhaps she is embarrassed to acknowledge the film’s anti-scientism message in the era of COVID-19. Or maybe she is just trying to keep from being blacklisted from doing her next film.\n\nIf she really wanted to undercut her film’s critique of scientific authoritarianism, there was an easy way to do it. According to actress Keira Knightley, two endings were filmed. In one of them, Art doesn’t wake up — which would have validated the arguments for infallible scientific authority.\n\nThankfully, Griffin didn’t use that ending. As a consequence, her film is an absorbing, fascinating, and astute cautionary tale about both the human condition and the dangers of government and scientific hubris.\n\nSilent Night is a great film, and a terrific discussion starter. If you can tolerate the non-stop profanity, it’s well worth adding to your watch list this Christmas season.\n\nThis article was originally published on December 17, 2021.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2021/12/Silent-Night.jpeg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "A Christmas Nightmare for the COVID Era | Evolution News", "description": "The Christmas horror-comedy <i>Silent Night</i> offers a shrewd indictment of both mindless secularism and authoritarian science.", "url": "https://evolutionnews.org/2022/12/a-christmas-nightmare-for-the-covid-era-2/", "site_name": "Evolution News", "updated_time": "2022-12-22T06:52+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-12-22T17:50+00:00", "article:modified_time": "2022-12-22T06:52+00:00"}, "tags": ["Christmas", "government", "pandemic", "Davida McKenzie", "Roman Griffin Davis", "movies", "House Beautiful", "Matthew Goode", "Great Britain", "secularism", "Republicans", "spoilers", "Keira Knightley", "Silent Night", "scientists", "Russia", "COVID-19", "C. S. Lewis", "The Abolition of Man", "experts", "Sope Dirisu", "Greta Thunberg", "profanity", "Lily-Rose Depp", "Camille Griffin", "Christmas carols", "authoritarianism"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1300", "height": "731", "embed_code": "<iframe title=\"SILENT NIGHT Official Trailer\" width=\"1300\" height=\"731\" src=\"https://www.youtube.com/embed/ras0H9GEz5I?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ras0H9GEz5I?feature=oembed"}], "links": ["https://nam10.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.imdb.com%2Ftitle%2Ftt11628854%2F&data=05%7C01%7Cklinghoffer%40discovery.org%7Cdea1312879a84348259e08dae3e0f90d%7C9bf06663c0d64ce089ef1a87c52bdb32%7C0%7C0%7C638072852641901065%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=%2Bktbk3JAR6QtWQVM3b4djUWx9RS%2Bt1v39nd3vXhY%2Bsg%3D&reserved=0", "https://www.imdb.com/name/nm9877392/", "https://www.imdb.com/name/nm0341132/", "https://www.imdb.com/name/nm0328828/", "https://www.imdb.com/name/nm0461136/", "https://www.imdb.com/name/nm7290633/", "https://www.dreadcentral.com/interviews/419145/silent-night-director-defends-her-divisive-christmas-horror-story/", "https://www.moviefone.com/2021/09/15/camille-griffin-on-her-film-silent-night-starring-keira-knightley/", "https://evolutionnews.org/2020/08/the-main-argument-of-the-abolition-of-man/", "https://evolutionnews.org/2020/08/the-main-argument-of-the-abolition-of-man/", "https://www.imdb.com/name/nm5444837/", "https://www.imdb.com/name/nm6675440/", "https://www.nightmarishconjurings.com/2021/12/06/interview-camille-griffin-for-silent-night/", "https://www.moviefone.com/2021/09/15/camille-griffin-on-her-film-silent-night-starring-keira-knightley/", "https://ew.com/movies/silent-night-ending-explained/"], "authors": [], "publish_date": "2022-12-22T17:50+00:00"}