{"result_id": "112014", "URL": "https://evolutionnews.org/2021/04/why-an-argument-for-gods-existence-is-scientific/", "timestamp": "2023-04-25 15:05:19 CEST+0200", "meta": {"description": "Atheist evolutionary biologist Jerry Coyne is a fountain of nonsensical arguments against the existence of God.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2021/04/why-an-argument-for-gods-existence-is-scientific/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Why an Argument for God’s Existence Is Scientific", "cleaned_text": "Atheist evolutionary biologist Jerry Coyne is a fountain of nonsensical arguments against the existence of God. If a scholar wanted to write a review paper on the most ridiculous arguments against God’s existence so far in the 21st century, he would need look no further than Coyne’s blog.\n\nCoyne’s latest post denying God’s existence takes issue with an essay by Samuel Benson in the Deseret News in which Benson makes the case that invoking both a miracle and a scientific achievement in the development of the COVID vaccine is not necessarily contradictory. Benson points out that the natural world, properly understood, can only be explained using both science and theology. In support of his view, he quotes the president of the Church of Jesus Christ of Latter Day Saints:\n\nPresident Nelson’s words appear prophetic: “I have great admiration for medical professionals, scientists and all who are working around the clock to curb the spread of COVID-19,” he said a year ago. “I am also a man of faith, and I know that during these challenging times, we can be strengthened and lifted as we call upon God and his Son, Jesus Christ — the Master Healer.” I give thanks to modern medicine and science — and all of its brilliant disciples — for creating a cure. And in the same breath, I give thanks to God. The two need not be mutually exclusive.\n\nYes, of course science and god are “congruent” if you’re willing, as is Benson, to admit that we can’t prove that there’s no god. (Well, as a superannuated scientist I’d say that there is not only no evidence for gods, but also that, given that theistic gods are supposed to interact with the world, we have evidence against Abrahamic gods.)\n\nCoyne misunderstands both the nature of scientific evidence and the nature of the evidence for God’s existence.\n\nThere are two methods of proof that we might try to apply to God’s existence: The first is deductive proof — we proceed from abstract premises to a conclusion using rules of logic. For example: Tom lives in Manhattan. Manhattan is in New York State. Therefore Tom lives in New York State.\n\nBut, as Thomas Aquinas pointed out in the 13th century, nothing can be proven to exist using deductive proof because deductive proofs only work with logical forms, which are essences. Essence and existence are separate concepts. For example, to prove that wolves, dinosaurs, or unicorns exist, we would need evidence. We can’t prove (or disprove) that they exist by deduction alone.\n\nAll of science depends on inductive reasoning. Inductive reasoning begins with evidence and then proceeds by a logical chain to the most reasonable conclusion. Newton used inductive reasoning when he began by studying the motion of objects in gravitational fields and applying logical and mathematical rules to arrive at his law of gravitation. Darwin used inductive reasoning by studying the diversity and distribution of species and animal breeding. Then, by using logical rules, he drew analogies to speciation in nature. All scientific theories, whatever their merit, depend on inductive reasoning.\n\nProofs for God’s existence depend on inductive reasoning in the same way. They follow exactly the same structure as theories in natural science; in fact theories about God’s existence are theories in natural science.\n\nAll theories about God’s existence begin with observations of the world — observations about change and causation in nature, life and death, the degrees of various qualities, and the existence of apparent design (i.e. Aquinas’ First through Fifth Ways). They proceed by logical inference to the conclusion that the structure and nature of the world point to a supernatural Creator. That structure, as for Newton and Darwin, is: evidence ➤ logic ➤ conclusion.\n\nRead the rest at Mind Matters News, published by Discovery Institute’s Walter Bradley Center for Natural and Artificial Intelligence.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2018/08/Aquinas.jpg", "image:width": "1200", "image:height": "630", "image:alt": "Nautilus at S.E.A. Aquarium, Singapore", "locale": "en_US", "type": "article", "title": "Why an Argument for God’s Existence Is Scientific | Evolution News", "description": "Atheist evolutionary biologist Jerry Coyne is a fountain of nonsensical arguments against the existence of God.", "url": "https://evolutionnews.org/2021/04/why-an-argument-for-gods-existence-is-scientific/", "site_name": "Evolution News", "updated_time": "2021-04-13T18:18+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2021-04-12T18:12+00:00", "article:modified_time": "2021-04-13T18:18+00:00"}, "tags": ["Jesus Christ", "Church of Jesus Christ of Latter Day Saints", "New York State", "Deseret News", "wolves", "dinosaurs", "unicorns", "Isaac Newton", "deductive proof", "Charles Darwin", "natural science", "Thomas Aquinas", "Manhattan", "COVID-19", "Jerry Coyne", "inductive reasoning", "gravitational field", "atheists", "intelligent design"], "tweets": [], "movies": [], "links": ["https://pondside.uchicago.edu/ecol-evol/people/coyne.html", "https://whyevolutionistrue.com/2021/04/05/the-covid-vaccines-science-or-miracles/", "https://www.deseret.com/opinion/2021/4/1/22357416/miracle-covid-19-vaccine-worldwide-fast-pandemic-science-faith-easter", "https://www.deseret.com/authors/samuel-benson", "https://www.deseret.com/faith/2020/3/26/21196285/coronavirus-covid-19-russell-m-nelson-pandemic-faith-mormon-lds-church-prayer-fasting", "https://www.deseret.com/faith/2020/3/26/21196285/coronavirus-covid-19-russell-m-nelson-pandemic-faith-mormon-lds-church-prayer-fasting", "https://whyevolutionistrue.com/2021/04/05/the-covid-vaccines-science-or-miracles/", "https://www.iep.utm.edu/aquinas/", "https://evolutionnews.org/2019/10/essence-and-existence-in-modern-science/", "https://mindmatters.ai/2021/04/heres-why-an-argument-for-gods-existence-is-scientific/"], "authors": [], "publish_date": "2021-04-12T18:12+00:00"}