{"result_id": "112031", "URL": "https://evolutionnews.org/2022/05/transfer-rnas-wear-special-gear-for-hot-water/", "timestamp": "2023-04-25 15:05:30 CEST+0200", "meta": {"description": "As usual, evolution-talk is inversely proportional to the amount of detail presented about cellular workings.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/05/transfer-rnas-wear-special-gear-for-hot-water/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Transfer RNAs Wear Special Gear for Hot Water", "cleaned_text": "Thermophiles are bacteria and archaea that live in hot water. Some of these “extremophiles” thrive at temperatures right up to the boiling point. Ever since thermophiles gained attention decades ago, scientists have been intrigued at their specializations for surviving conditions that would kill most organisms. Because heat can quickly degrade biomolecules, those in thermophiles must be equipped with special survival gear.\n\nThe family of 20 canonical transfer RNAs (tRNAs) comprises the essential carrier of genetic information between DNA and protein. When charged by corresponding members of the family of aminoacyl-tRNA-synthetases (which know both the genetic code and the protein code), tRNAs connect amino acids together in the sequence specified by the messenger RNA. This takes place in the ribosome, the translation factory of the cell. That’s the simple story, but there’s more. Numerous modifications to tRNAs have been found in all cells — eukaryotes, bacteria, and archaea.\n\nWriting in Nature, Ohira et al. from the University of Tokyo investigated how transfer RNAs in thermophiles beat the heat.\n\nIn their open-access paper, “Reversible RNA phosphorylation stabilizes tRNA for cellular thermotolerance,” the authors found a unique modification that stabilizes tRNAs in archaea. And it’s reversible. After reviewing some of the RNA modifications that were previously known, they announced their discovery:\n\nThis modification (we can call it a “mod” like the trendy word for add-ons in devices) is an unusual kind of kinase — an enzyme that spends ATP to attach a phosphate group to a substrate. Up47 acts in an unusual spot on the tRNA; it “protrudes from the tRNA core and prevents backbone rotation during thermal denaturation.” Without this mod, the tRNA for valine would “melt” (fall apart) at around 65°C (149 °F); with it, the tRNA remained stable at 70°C (154 °F). “These observations clearly demonstrate that a single Up47 modification increases the thermal stability of tRNAVal3 by 6.6 °C.” In fact, it did not melt until 85 °C (185 °F).\n\nAlso of interest, this mod comes complete with a “writer” and “eraser” for adding and removing the stabilizer as needed. With this toolkit, the cell can fine-tune its adaptation to heat.\n\nThe team identified the writer and eraser for this gadget named Up47.\n\nWhat does Up47 look like? It stands for “2′-phosphouridine (Up) at position 47 of tRNAs.” While phosphouridine is a fairly common biomolecule (a uracil nucleotide with a phosphate group attached; see diagram and info on PubChem), its specific targeting to spot 47 on the tRNA is essential to prevent thermal disruption. At that specific locus, it prevents the backbone from rotating, and stabilizes the correct angle of “puckering” in the ribose sugar.\n\nFurthermore, no benefit would be incurred without the writer and eraser present in the correct quantities. How do they know when to act? The paper does not say when they become active. Presumably the stabilizer must be removed during translation or at other operational moments, but those times must be brief to prevent thermal damage.\n\nWhether or not evolutionists can come up with a story of how this phosphouridine was recruited for its stabilizing role on tRNA, the specificity of its position and writer/eraser combo is remarkable. And it’s not the only required player the thermophile needs to survive in hot water. Another “mod” is found at position 54 in the T-loop of tRNAs. More are found in the anticodon loop at positions 34 and 37. Additional specialized “mods” have been found in other species. These authors are adding just one more to a pool of essential players in these thermophiles.\n\nDid these essential players evolve? At only one point do the authors mention evolution. Discussing mods to the V-loop in tRNAs, they say, “It is interesting that similar functions are evolutionarily conserved in different V-loop modifications across the domains of life.” That’s a statement about stasis, not evolution. As usual, evolution-talk is inversely proportional to the amount of detail presented about cellular workings.\n\nTo make matters worse, some evolutionists argue that thermophiles were the first organisms at the origin of life. One popular approach surmises that simple metabolic cycles began at hydrothermal vents, and then somehow became incorporated within primitive membranes. This compounds their hassles, because additional “gear” for thermal stabilization would have been needed right at the time they imagine primitive cells were trying to emerge. It also tosses the difficult problem of the origin of genetic coding to someone else to figure out.\n\nFor the Awe of It\n\nVisitors by the millions walk by the hot springs of Yellowstone, unaware of the complex systems at work in the colorful runoff channels where these thermophiles live. Even if readers of Evolution News don’t wish to memorize the details in this article, it’s good for the soul to gain an appreciation for the real specified complexity at work in even the most “primitive” of life forms. It encourages awe of nature, which psychologists recognize as a healthy attitude (see video by Science with Sam). So don’t worry about remembering Up47. If your awe rose a few degrees while reading this, it was worth it.\n\nAnecdote in closing: it was through the study of thermophiles in Yellowstone hot springs that biochemists discovered the enzyme “taq polymerase.” Subsequent study of this enzyme revealed that it can amplify DNA at high temperatures. This led to the lab technique called polymerase chain reaction (PCR), a method that made possible the rapid amplification of biomolecules for research and essentially started the biotechnology revolution. PCR was even essential during the development of vaccines and therapeutics for COVID-19. For the awe-inspiring story, see an article at USGS.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/05/Grand-Prismatic-Spring-in-Yellowstone.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Transfer RNAs Wear Special Gear for Hot Water | Evolution News", "description": "As usual, evolution-talk is inversely proportional to the amount of detail presented about cellular workings.", "url": "https://evolutionnews.org/2022/05/transfer-rnas-wear-special-gear-for-hot-water/", "site_name": "Evolution News", "updated_time": "2022-05-12T01:42+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-05-12T13:41+00:00", "article:modified_time": "2022-05-12T01:42+00:00"}, "tags": ["biology", "enzyme", "thermophiles", "puckering", "archaea", "hot water", "therapeutics", "PubChem", "eukaryotes", "Nature (journal)", "tRNA", "arkI", "taq polymerase", "biotechnology", "hot springs", "COVID-19", "heat", "ribose", "Evolution News", "Up47", "bacteria", "kinase", "University of Tokyo", "RNA", "conservation", "Yellowstone", "transfer RNAs", "intelligent design", "evolution", "Vaccines", "hydrothermal vents", "ATP"], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s41586-022-04677-2", "https://pubchem.ncbi.nlm.nih.gov/compound/Uridine-2_-phosphate", "https://www.youtube.com/watch?v=9xg9iv9Yd9o", "https://www.usgs.gov/observatories/yvo/news/how-thermophilic-bacterium-yellowstone-hot-spring-helping-fight-against"], "authors": [], "publish_date": "2022-05-12T13:41+00:00"}