{"result_id": "112006", "URL": "https://evolutionnews.org/2022/09/stephen-meyer-no-the-big-bang-hasnt-been-disproven/", "timestamp": "2023-04-25 15:05:14 CEST+0200", "meta": {"description": "Today, the mark of genuine disinformation is, often, the repeated, robotic use of the word “disinformation.”", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/09/stephen-meyer-no-the-big-bang-hasnt-been-disproven/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Meyer: No, the Big Bang Hasn’t Been “Disproven”", "cleaned_text": "As soon as I see multiple uses of scare words like “denial,” “disinformation,” and “pseudoscience,” my eyebrow goes up. Today, the mark of genuine disinformation is, often, the repeated, robotic use of the word “disinformation.” A piece at Space.com seems to be competing to see how densely it can sprinkle such terms across a short article. Keith Cooper writes, “The James Webb Space Telescope never disproved the Big Bang. Here’s how that falsehood spread.” He’s referring to “an article about a pseudoscientific theory that went viral in August, and which mischaracterized quotes from an astrophysicist to create a false narrative that the Big Bang didn’t happen.”\n\nWe’ve addressed that already here. And Cooper is correct that the original story was highly misleading. But count the number of variations on the phrase “science denial” in just two paragraphs. This is verging on hysteria:\n\nScience denial is a growing problem. While science denial has existed for as long as science, in recent years it seems to have grown more pervasive, perhaps encouraged by social media. And although somebody choosing not to believe in the Big Bang won’t cause society to unravel, other examples of science denial are not so benign: not believing in vaccines, for example, saw millions of people around the world die unnecessarily from COVID-19, while climate denial has stymied efforts to bring in legislation to combat the planet’s rising global temperatures. “Science denial has gotten worse because it’s now more of a threat to the wellbeing of our society,” [How to Talk to a Science Denier author Lee] McIntyre said. “Denialism costs lives.”\n\nI was much more interested to hear what philosopher of science Stephen Meyer, author of Return of the God Hypothesis, had to say about the same viral story in a conversation with podcaster Frank Turek. The two ask, “Has the Big Bang Been Disproven?”\n\nThe answer is no: observations so far from the Webb Space Telescope have strengthened the case for a cosmic beginning, as Meyer shows, not weakened it. He explains why science writer Eric Lerner and his “pet theory” about the Big Bang are wrong. It’s much more persuasive to say so, lucidly and soberly, without trashing other people as “serial deniers” or pushers of “pseudoscience.” I highly recommend Dr. Meyer’s detailed discussion of why, yes, the universe began with a “bang.”", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/08/galaxy-cluster-SMACS-0723.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Meyer: No, the Big Bang Hasn’t Been “Disproven” | Evolution News", "description": "Today, the mark of genuine disinformation is, often, the repeated, robotic use of the word “disinformation.”", "url": "https://evolutionnews.org/2022/09/stephen-meyer-no-the-big-bang-hasnt-been-disproven/", "site_name": "Evolution News", "updated_time": "2022-09-07T21:26+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-09-07T21:26+00:00", "article:modified_time": "2022-09-07T21:26+00:00"}, "tags": ["Space.com", "Return of the God Hypothesis", "denialism", "Frank Turek", "James Webb Space Telescope", "Eric Lerner", "Big Bang", "COVID-19", "Stephen Meyer", "cosmology", "disinformation", "physics", "Keith Cooper", "pseudoscience", "denial", "astrophysicists", "hysteria", "intelligent design", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.space.com/james-webb-space-telescope-science-denial", "https://evolutionnews.org/2022/08/calm-down-yes-the-big-bang-happened/", "https://www.space.com/topics/coronavirus", "https://www.space.com/what-is-climate-change-explained", "https://returnofthegodhypothesis.com", "https://crossexamined.org/has-the-big-bang-been-disproven-with-stephen-c-meyer/", "https://crossexamined.org/has-the-big-bang-been-disproven-with-stephen-c-meyer/"], "authors": [], "publish_date": "2022-09-07T21:26+00:00"}