{"result_id": "112012", "URL": "https://evolutionnews.org/2022/02/royal-society-dont-censor-misinformation-it-makes-things-worse/", "timestamp": "2023-04-25 15:05:18 CEST+0200", "meta": {"description": "While others demand crackdowns on “fake news,” the Society reminds us that the history of science is one of error correction.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/02/royal-society-dont-censor-misinformation-it-makes-things-worse/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Royal Society: Don’t Censor Misinformation", "cleaned_text": "Editor’s note: See also, “The Rise of Totalitarian Science, 2022 Edition.”\n\nA leading science organization, the Royal Society (Britain’s equivalent of the National Academy of Sciences), has put out a report discouraging social media censorship, with special reference to the COVID-19 pandemic:\n\nThe Royal Society, the U.K.’s academy of sciences, published a study of online scientific and health misinformation Wednesday, investigating its root causes and brainstorming possible solutions. The scientists concluded that censoring content deemed to be misinformation is often harmful and antithetical to the principles of scientific inquiry… The report found that online censorship risked pushing misinformation underground and off of major social media platforms, where it is less likely to be exposed to countervailing opinions. Censorship also risks removing or suppressing content that may be true or helpful to the evolving scientific understanding of certain concepts. AILAN EVANS, “DON’T CENSOR MISINFORMATION ON SOCIAL MEDIA, LEADING SCIENTISTS SAY” AT THE STREAM (JANUARY 19, 2022)\n\nThe Royal Society report seeks to establish a rational basis for public trust in science:\n\nWhile misinformation isn’t a new problem — and uncertainty and debate are intrinsic parts of science–the internet has drastically magnified the speed and scale at which poor quality information can spread. The report highlights how online misinformation on scientific issues, like climate change or vaccine safety, can harm individuals and society. It stresses that censoring or removing inaccurate, misleading and false content, whether it’s shared unwittingly or deliberately, is not a silver bullet and may undermine the scientific process and public trust. Instead, there needs to be a focus on building resilience against harmful misinformation across the population and the promotion of a “healthy” online information environment…\n\n“In the early days of the pandemic, science was too often painted as absolute and somehow not to be trusted when it corrects itself, but that prodding and testing of received wisdom is integral to the advancement of science, and society. “This is important to bear in mind when we are looking to limit scientific misinformation’s harms to society. Clamping down on claims outside the consensus may seem desirable, but it can hamper the scientific process and force genuinely malicious content underground.”\n\nThe Royal Society’s stance is wise. For one thing, terms like “misinformation” (and “fake news”) have become manipulative terms of art, to justify cracking down on unpopular (but not disproven or even disprovable) viewpoints. Trust in science, as they emphasize, should be rational trust, alert to evidence and aware of the possibility that strongly held views can be mistaken.\n\nBut there is another factor to consider. If we look at — for example — the COVID news vortex, the difficulty is that much information that was later thought to need correction was in fact purveyed by official sources, not by conspiracy sites or social media.\n\nWhen Fake News Comes Straight from the Top\n\nConsider the case of Anthony Fauci. One freelance writer started keeping track of his rapid shifts in opinion:\n\n“To start, we need to focus on Dr. Fauci’s perspective on the virus itself and it’s risk to the United States. In late January 2020, Fauci said that COVID was a ‘very, very low risk to the United States,’” Holden wrote. “I think it goes without saying that his perspective has evolved since.” “One big, obvious area of flipping is around the benefits of wearing a mask. Dr. Fauci originally said that masks weren’t effective & publicly encouraged Americans not to buy them (guidance he doesn’t regret). Now even vaccinated people need to wear masks,” Holden wrote to accompany images of various headlines showing changing positions on masks. BRIAN FLOOD, “CONTRADICTIONS FROM FAUCI, CDC THROUGHOUT COVID PANDEMIC OUTLINED IN VIRAL TWITTER THREAD” AT FOX NEWS (JULY 29, 2021)\n\nThose are hardly the only examples.\n\nOfficial sources, including Dr. Fauci, have, at times, attempted to persuade the public that the claim that the COVID virus originated at a Level 4 virus lab in Wuhan was just a conspiracy theory. But for anyone familiar with the circumstances, there was no reason to dismiss the idea. If there was any conspiracy, it was on the part of respected, major institutions:\n\nFrom almost the moment the Covid-19 pandemic broke out in the city of Wuhan, the medical-research establishment in Washington and London insisted that the virus had emerged naturally. Only conspiracy theorists, they said, would give credence to the idea that the virus had escaped from the Wuhan Institute of Virology. Now a string of unearthed emails — the most recent being a batch viewed by the House Oversight and Reform Committee and referred to in its January 11, 2022 letter — is making it seem increasingly likely that there was, in fact, a conspiracy, its aim being to suppress the notion that the virus had emerged from research funded by the National Institute of Allergy and Infectious Diseases (NIAID), headed by Anthony Fauci. The latest emails don’t prove such a conspiracy, but they make it more plausible, for two reasons: because the expert virologists therein present such a strong case for thinking that the virus had lab-made features and because of the wholly political reaction to this bombshell on the part of Francis Collins, then-director of the National Institutes of Health.\n\nYet shortly afterward, the lead virologist suddenly proclaimed a different view:\n\nThe rest of his article details how the United States came to be involved in the Wuhan research.\n\nBut for the rest of us, the key question should be: In this atmosphere, do we really want Big Tech companies deciding what constitutes a “crackpot” theory and then censoring information that is currently unpopular with government?\n\nIt’s not just news-dominant COVID where this sort of thing happens. Recently, a court reporter at National Public Radio (NPR) appears to have dropped a fake news story on the public concerning face masks on the U.S. Supreme Court. The claim, made by NPR’s Nina Totenberg — apparently relying on a single anonymous source — was that Justice Gorsuch didn’t mask despite Justice Sotomayor’s COVID worries, leading her to telework instead of sit at the bench.\n\nThat led to a wild flurry of denunciations of Gorsuch on social media, as might be expected. The only problem is, the claim apparently wasn’t true. Not only did the two justices concerned deny the story but the chief justice, Roberts, discredited the story as well.\n\nReliance on a single, anonymous source is the sort of thing one might expect of an ignorable Facebook page or discreditable blog. So if NPR turns out to be doing it, there is certainly something unjust about targeting a social media account with vastly less reach and prominence.\n\nThere is no a priori reason to believe that censorship targets are chosen simply because they are especially wrong or dangerous. Politicized situations simply do not work that way.\n\nConsidering the current high state of public anxiety about COVID-19, the consequences of attempts to control “misinformation” could lay the foundations for a totalitarian state. Consider the results of a recent poll:\n\nYet if we look at the actual history of official statements about anything to do with COVID, the proposal that these respondents support would merely ensure that, should government prove wrong about something once again, anyone who talks about it will face fines or imprisonment. And that’s the signature of a totalitarian state.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/02/covid-mask.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Royal Society: Don’t Censor Misinformation | Evolution News", "description": "While others demand crackdowns on “fake news,” the Society reminds us that the history of science is one of error correction.", "url": "https://evolutionnews.org/2022/02/royal-society-dont-censor-misinformation-it-makes-things-worse/", "site_name": "Evolution News", "updated_time": "2022-02-01T23:29+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-02-01T23:29+00:00", "article:modified_time": "2022-02-01T23:29+00:00"}, "tags": ["pandemic", "Anthony Fauci", "National Public Radio", "Nicholas Wade", "misinformation", "fake news", "Royal Society", "Ailan Evans", "COVID-19", "City Journal", "censorship", "Facebook", "Nina Totenberg", "National Academy of Sciences", "Supreme Court", "The Stream", "Wuhan", "free speech", "United States", "totalitarianism"], "tweets": [], "movies": [], "links": ["https://evolutionnews.org/2022/01/the-rise-of-totalitarian-science-2022-edition/", "https://stream.org/dont-censor-misinformation-on-social-media-leading-scientists-say/", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://stream.org/dont-censor-misinformation-on-social-media-leading-scientists-say/", "https://royalsociety.org/news/2022/01/scientific-misinformation-report/", "https://royalsociety.org/news/2022/01/scientific-misinformation-report/", "https://royalsociety.org/news/2022/01/scientific-misinformation-report/", "https://royalsociety.org/-/media/policy/projects/online-information-environment/the-online-information-environment.pdf?la=en-GB&hash=691F34A269075C0001A0E647C503DB8F", "https://www.niaid.nih.gov/about/director", "https://www.foxnews.com/media/twitter-thread-fauci-cdc-contradictions", "https://www.foxnews.com/media/twitter-thread-fauci-cdc-contradictions", "https://www.foxnews.com/media/twitter-thread-fauci-cdc-contradictions", "https://www.city-journal.org/covid-origin-conspiracy", "https://republicans-oversight.house.gov/wp-content/uploads/2022/01/Letter-Re.-Feb-1-Emails-011122.pdf", "https://www.city-journal.org/covid-origin-conspiracy", "https://republicans-oversight.house.gov/wp-content/uploads/2022/01/Letter-Re.-Feb-1-Emails-011122.pdf", "https://www.city-journal.org/covid-origin-conspiracy", "https://www.city-journal.org/covid-origin-conspiracy", "https://www.city-journal.org/covid-origin-conspiracy", "https://www.npr.org/2022/01/18/1073428376/supreme-court-justices-arent-scorpions-but-not-happy-campers-either", "https://www.foxnews.com/media/totenberg-stand-by-npr-report-scotus", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.rasmussenreports.com/public_content/politics/partner_surveys/jan_2022/covid_19_democratic_voters_support_harsh_measures_against_unvaccinated", "https://www.rasmussenreports.com/public_content/politics/partner_surveys/jan_2022/covid_19_democratic_voters_support_harsh_measures_against_unvaccinated"], "authors": [], "publish_date": "2022-02-01T23:29+00:00"}