{"result_id": "112008", "URL": "https://evolutionnews.org/2022/11/science-journal-recognizes-the-reality-of-covid-censorship/", "timestamp": "2023-04-25 15:05:15 CEST+0200", "meta": {"description": "A peer-reviewed article uncovers how medical professionals were silenced for their views on the pandemic.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/11/science-journal-recognizes-the-reality-of-covid-censorship/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Science Journal Recognizes COVID Censorship", "cleaned_text": "Almost three years have passed since COVID-19 lockdowns and mandates upended our world. At first, the virus seemed to be an obscure, distant problem, posing little threat. Today, it’s hard to think of a world event more significant, talked about, and politically controversial than the response to COVID.\n\nEarlier this month, the peer-reviewed journal Minerva: A Review of Science, Learning, and Policy published an important article on COVID-related censorship and heterodoxy. Founded in 1962, Minerva is a well-established academic journal from Springer, one of the world’s top publishers of science journals. The article is an indication of just how mainstream concerns about censorship during the COVID era have become.\n\nThe authors are five researchers from universities and colleges in Israel and Australia. They interviewed a sample of leading medical professionals, doctors, and scientists who questioned the prevailing COVID orthodoxy and were heavily reprimanded, censored, or otherwise harassed and suppressed for their views.\n\nThe authors state in their abstract:\n\nThe researchers began by reviewing some of the early pandemic controversies. As they discovered, and as you may find unsurprising, there was no obvious consensus about how to “handle” COVID. While governments around the world argued for nationwide lockdowns and limited social gatherings, many scientists and other leaders questioned the ethics and efficacy of such mandates. As they authors note, Anthony Fauci, director of the National Institute of Allergic and Infectious Diseases, objected to wearing masks in March 2020, only to backtrack a month later.\n\nMeanwhile, social media networks including Facebook, Twitter, and LinkedIn, with the government’s help, censored scientists, doctors, and others for expressing dissent or even questioning the prevailing pandemic dogma. This still goes on. The researchers paid special attention to the way tech companies suppressed COVID heterodoxy under the guise of “fact-checking” and countering “misinformation.” As the pandemic progressed, it became harder and harder for medical professionals to openly express their views.\n\nHowever, if the doctors and scientists they surveyed are “heterodox,” what is COVID orthodoxy? The researchers give a helpful definition:\n\nLiester (2022) provides a list comparing what he refers to as the dominant versus dissenting views with respect to COVID-19, which includes the origin of SARS CoV-2 (zoonotic vs. laboratory), mask mandates (will prevent spread vs. will not prevent spread), early treatment with drugs such as hydroxychloroquine and ivermectin (ineffective and dangerous vs. effective and safe), the usefulness of lockdown measures and other restrictions (effective and beneficial vs. ineffective and harmful), COVID-19 vaccines (safe and effective vs. unsafe and dangerous), and COVID-19 vaccine mandates and passports (necessary and ethical vs. harmful and unethical). While it may be true that none of these dominant positions have been universally adopted by all governments worldwide to the same degree or down to every last detail, nevertheless a dominant or orthodox position on all of these issues can be identified on a country-by-country basis with strong similarities across national borders.\n\nThey also recognize that orthodoxy is prone to change, and that some formerly forbidden viewpoints have gained legitimacy. Just last month, The Atlantic ran a piece by economist Emily Oster asking, “Let’s Declare a Pandemic Amnesty.” She wrote this in regard to masking and social distancing:\n\nWhile Oster makes a fair point about the lack of knowledge, this study is asking why governmental and other powers acted so adamantly as if they did know, and others didn’t. Why weren’t they more permissive of dissent and open to other views? “Amnesty” in other contexts implies an admission of fault in return for forgiveness. Yet the government, social media platforms, and a range of media pundits have yet to acknowledge the ways they demonized and intimidated doctors, scientists, and others for making common-sense observations about COVID-19, and perhaps even more so, about the vaccine. According to the researchers, much of the pandemic orthodoxy was formed, not out of scientific conviction, but from economic and political interests.\n\nIn another article, I will look at how the researchers conducted their survey and the specific ways their sample group experienced censorship and suppression.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2020/04/COVID19.jpg", "image:width": "1200", "image:height": "630", "image:alt": "COVID-19", "locale": "en_US", "type": "article", "title": "Science Journal Recognizes COVID Censorship | Evolution News", "description": "A peer-reviewed article uncovers how medical professionals were silenced for their views on the pandemic.", "url": "https://evolutionnews.org/2022/11/science-journal-recognizes-the-reality-of-covid-censorship/", "site_name": "Evolution News", "updated_time": "2022-11-17T21:27+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-11-17T21:26+00:00", "article:modified_time": "2022-11-17T21:27+00:00"}, "tags": ["pandemic", "government", "Minerva", "Australia", "forgiveness", "Twitter", "health", "masks", "economics", "researchers", "Emily Oster", "suppression", "misinformation", "scientists", "COVID-19", "Israel", "doctors", "censorship", "bandanas", "social media", "Facebook", "media", "LinkedIn", "pundits", "social distancing", "amnesty", "orthodoxy", "Politics", "social gatherings", "fact-checking", "free speech", "The Atlantic"], "tweets": [], "movies": [], "links": ["https://link.springer.com/article/10.1007/s11024-022-09479-4", "https://www.theatlantic.com/ideas/archive/2022/10/covid-response-forgiveness/671879/"], "authors": [], "publish_date": "2022-11-17T21:26+00:00"}