{"result_id": "112032", "URL": "https://evolutionnews.org/2012/10/science_left_b/", "timestamp": "2023-04-25 15:05:31 CEST+0200", "meta": {"description": "The right is not more anti-science than the left; it just has terrible public relations.\"", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2012/10/science_left_b/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Science Left Behind Can Teach Us about Political Tactics of Intelligent Design Critics", "cleaned_text": "While Chris Mooney is of course correct in his book The Republican Brain that sometimes people don’t behave rationally or don’t follow the evidence, what’s wrong about his thesis is his unwavering claim that liberals have some superior ability to be rational when it comes to evaluating science. He states this explicitly: “today’s liberals are usually right and today’s conservative usually wrong.” Or again: “denying facts is not a phenomenon equally distributed across the political spectrum.” (pp. 7, 4, emphases in original)\n\nThis is what is refreshing about Alex B. Berezow and Hank Campbell’s book Science Left Behind: Feel-Good Fallacies and the Rise of the Anti-Scientific Left. These authors acknowledge that some conservatives believe kooky things, but they don’t try to pretend that an entire political view has the monopoly on kookiness, and therefore ought to be rejected. The reality, of course, is that there’s plenty of rationality and irrationality to be found within all sides of the political spectrum.\n\nScience Left Behind doesn’t try to bully people into ignoring or mocking the arguments of opponents because they’re supposedly mentally deficient. Rather, this book’s argument is that we need a return to unpoliticized scientific inquiry — especially in science journalism.\n\nMuch of Berezow and Campbell’s book looks at the rise of radical environmentalism, the anti-vaccine movement, or the anti-GMO movement. They conclude that denial of scientific facts is not peculiar to one particular political ideology:\n\nIf you were to substitute the word “Darwin lobby” for “progressives,” and “media” for “scientific community,” you’d have a reasonably good description of the debate over evolution. In fact, Berezow and Campbell appear well-aware of problems created by the media’s partisan bias on scientific debates.\n\nHere on ENV, we’ve documented numerous cases where the news media have unashamedly published inaccurate information biased toward Darwinian evolution. Science Left Behind‘s analysis of science journalism also has much to teach about the evolution debate. Berezow and Campbell conclude that science journalism has experienced its own “death,” shifting “its focus from telling a news story toward opinion and even political activism, and this has hurt the credibility of the field.” (p. 195) They believe “science journalism specifically has been overrun by partisan interests who do not love science as much as they hate their political opponents.” (p. 195) They correctly write:\n\nOf course, this is exactly what we see in the debate over intelligent design. Skeptics of Darwinian evolution are routinely ridiculed in the press, and the scientific claims of Darwinian evolutionists are rarely (if ever) questioned or scrutinized. Though Science Left Behind doesn’t deal much with the topic of evolution, it’s analysis of the tactics of the “anti-scientific left” is highly relevant:\n\nHave you noticed who dresses up in ridiculous animal costumes to protest medical research? Or who wears gas masks to protest nuclear power? Kooky progressives. Are journalists quick to label any of them “progressive crazies”? No, of course not. They are careful to ignore the obvious political demographic of these movements. But any conservative who is opposed to evolution is immediately labeled a “religious nut.” Similarly, journalists frame progressive opponents of genetically modification as being anti-corporation rather than anti-science — even though all the arguments they make against GM technology are anti-scientific. And compare all that to how conservatives have been treated in regard to the human embryonic stem cell research controversy. Conservatives are, once again, called anti-science religious zealots — and then that label is applied to the entire Republican Party as well. The double standard is truly stunning.(pp. 204-205)\n\nThis is dead right. And given that Chris Mooney styles himself as a science journalist, Berezow and Campbell might well be talking about Chris Mooney in his book Republican War on Science.\n\nMooney aims to win scientific debates by defining his position as the only right one, and branding his opponents as intellectually deficient. Thankfully, his tactics don’t work very well: When dealing with a populace like ours full of reasonably intelligent people, you can’t win a debate simply by defining your opponents as “irrational.” People see through this tactic. Berezow and Campbell offer a much better way forward — getting politics out of science:\n\nWhat a contrast between The Republican Brain and Science Left Behind: The former book thinks it’s depoliticizing science by delegitimizing scientific debate and branding people who hold certain scientific views as intellectually inferior. The latter book aims to depoliticize science by calling people back to scientific integrity where the evidence, rather than politics, settles scientific questions. Which do you think is a wiser path?", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2017/02/cropped-DISCO_170130_ENVDontate_BiggerMasthead.jpg.jpeg", "image:width": "572", "image:height": "300", "locale": "en_US", "type": "article", "title": "Science Left Behind Can Teach Us about Political Tactics of Intelligent Design Critics | Evolution News", "description": "The right is not more anti-science than the left; it just has terrible public relations.\"", "url": "https://evolutionnews.org/2012/10/science_left_b/", "site_name": "Evolution News", "updated_time": "2017-04-17T10:49+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2012-10-30T05:17+00:00", "article:modified_time": "2017-04-17T10:49+00:00"}, "tags": ["Chris Mooney", "science", "Politics", "Incivility"], "tweets": [], "movies": [], "links": ["https://evolutionnews.org/2012/10/the_republica/", "http://www.amazon.com/dp/1610391640", "https://evolutionnews.org/2006/10/proof_the_media/", "https://evolutionnews.org/2007/10/alt_ctrl_scopes_new_york_times/", "https://evolutionnews.org/2006/11/associated_press_regurgitates/", "https://evolutionnews.org/2007/09/thar_she_blows_again/", "https://evolutionnews.org/2008/03/the_darwinist_misinformation_t/", "https://evolutionnews.org/2006/10/celeste_bievers_history_of_rep/", "https://evolutionnews.org/2008/07/advocate_newspaper_knowingly_p/", "https://evolutionnews.org/2008/10/texas_media_bites_on_tfns_bait/", "https://evolutionnews.org/2009/04/npr_interview_on_texas_evoluti/", "https://evolutionnews.org/2010/03/new_york_times_front_page_high/", "https://evolutionnews.org/2008/08/new_york_times_rehashes_darwin/", "https://evolutionnews.org/2011/03/lauri_lebos_amnesia/", "https://evolutionnews.org/2011/07/reuters_gets_it_wrong_intellig/", "https://evolutionnews.org/2012/01/discovery_insti/", "https://evolutionnews.org/2012/03/reporting_on_th/", "https://evolutionnews.org/2012/04/reuters_probabl/"], "authors": [], "publish_date": "2012-10-30T05:17+00:00"}