{"result_id": "112015", "URL": "https://evolutionnews.org/2022/12/how-media-and-the-medical-establishment-suppressed-covid-heterodoxy/", "timestamp": "2023-04-25 15:05:20 CEST+0200", "meta": {"description": "That Twitter blacklisted and “shadow-banned” prominent medical experts like Stanford’s Dr. Jay Bhattacharya has since been confirmed.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/12/how-media-and-the-medical-establishment-suppressed-covid-heterodoxy/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Media and Medicine Suppressed COVID Heterodoxy", "cleaned_text": "Last month, the peer-reviewed journal Minerva: A Review of Science, Learning, and Policy published an important article on COVID-related censorship. I’ve written about it already here. The researchers introduced their article by defining some terms, recalling certain COVID controversies, and noting how multiple respected medical professionals were hurt in the fallout of the pandemic controversy.\n\nThey went on to describe the specific experiences of their study participants, including 13 established doctors, scientists, and medical professionals who were censored, suppressed, or otherwise punished for expressing dissent with regard to the prevailing COVID-19 orthodoxy. All those who participated have either an MD or PhD in their respective fields, and four have both. These are not, then, conspiracy types or Internet trolls. They are reputable minds who simply transgressed against the “consensus” view, which, as I said in my earlier article, has changed drastically since March 2020.\n\nThe researchers kept these participants anonymous to protect them, but emphasized their standing and credibility. In interviews, they gathered firsthand quotes to show just how harsh and brazen the censorship was in some cases, listing the tactics the medical establishment and media used against them. They reported:\n\nThe study respondents noted that publications that formerly endorsed and published them began excluding their work and refusing to publish or interview them. One participant said,\n\nNeither X nor Y [two major newspapers in the respondent’s country] wanted to publish my articles. Without a proper explanation. …It was quite blatant, that they stopped accepting articles expressing a different opinion from that of the Ministry of Health (MOH). The number of journalists who can really be talked to, who are willing to listen to another opinion, to publish, has been greatly reduced, and most health reporters today are very biased towards the MOH.\n\nBeyond mere exclusion from publication privileges, respondents also experienced outright denigration. News headlines called them out for their criticisms, defaming them, harming their reputations, and distorting their views. One participant said, “I have been vilified…I’ve been called a quack…, an anti-vaxxer and a COVID denier, a conspiracy theorist.” Facing ridicule of that sort, other likeminded medical professionals understandably kept silent. So, the silencing tactic may have suppressed many more medical professionals, as the researchers note in their introduction.\n\nNot the Only Casualties\n\nThe study also showed how reputations weren’t the only casualties. Whole careers were destroyed. Another respondent reported:\n\nOther respondents described being censored by social media. Sites such as Twitter, Facebook, TikTok, YouTube, and LinkedIn, removed heterodox posts, and in some cases, suspended the respondent’s account. That Twitter blacklisted and “shadow-banned” prominent medical experts like Stanford’s Dr. Jay Bhattacharya has since been confirmed. One study participant said:\n\nI’ve always had videos, just my teaching material I’ve been putting up on YouTube…, but I also started to put up materials around this, just sort of talking through some of the research… looking at the vaccine efficacy data… YouTube started taking it down. And so now…, I cannot post, I can’t even mention vaccines, because within seconds, as soon as I’m actually trying to upload the video, YouTube will say this video goes against our guidelines…\n\nBeyond media censorship, the medical establishment suppressed research and viewpoint diversity. Academic institutions, peer-reviewed journals, and scientific committees played a hand in excluding certain respondents and refusing to give their voices a fair hearing. One respondent said he was “stripped” from a committee and editorial position with no explanation or due process. The respondent had been on this particular committee for decades, but still was cut off without a word. In addition, the researchers noted that some respondents “recounted how their research had been retracted by the journal after publication.” During the pandemic, it became increasingly difficult for some of the respondents to publish in journals where their work had been formerly welcomed.\n\nThe study went on to document how the participants initially responded to these tactics of suppression, and the tactics they used to fight back. I’ll cover that in my next and final post in this series.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/01/Covid.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "Media and Medicine Suppressed COVID Heterodoxy | Evolution News", "description": "That Twitter blacklisted and “shadow-banned” prominent medical experts like Stanford’s Dr. Jay Bhattacharya has since been confirmed.", "url": "https://evolutionnews.org/2022/12/how-media-and-the-medical-establishment-suppressed-covid-heterodoxy/", "site_name": "Evolution News", "updated_time": "2022-12-14T01:47+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-12-14T14:43+00:00", "article:modified_time": "2022-12-14T01:47+00:00"}, "tags": ["pandemic", "TikTok", "Research", "Minerva", "journals", "Twitter", "Internet trolls", "medical establishment", "Jay Bhattacharya", "viewpoint diversity", "peer-reviewed journals", "scientists", "denigration", "COVID-19", "conspiracy theorists", "Ministry of Health", "doctors", "censorship", "Facebook", "media", "LinkedIn", "consensus", "due process", "youtube", "free speech", "medical professionals", "shadow-banning"], "tweets": [], "movies": [], "links": ["https://link.springer.com/article/10.1007/s11024-022-09479-4", "https://evolutionnews.org/2022/11/science-journal-recognizes-the-reality-of-covid-censorship/", "https://www.wsj.com/articles/the-twitter-blacklisting-of-jay-bhattacharya-medical-expert-covid-lockdown-stanford-doctor-shadow-banned-censorship-11670621083"], "authors": [], "publish_date": "2022-12-14T14:43+00:00"}