{"result_id": "112022", "URL": "https://evolutionnews.org/2016/06/public_opinion/", "timestamp": "2023-04-25 15:05:24 CEST+0200", "meta": {"description": "People aren't stupid. Science is a public enterprise, and public acceptance has always been its most significant seal of approval.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2016/06/public_opinion/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Public Opinion Is the Ultimate Peer Review", "cleaned_text": "In his recent Caltech commencement address, surgeon and New Yorker staff writer Atul Gawande offered advice on how to rebuild the public’s confidence in the scientific community. He ends with the right idea, but only after showing that even he needs to take that idea more seriously.\n\nWhat does truth-seeking look like? Gawande concludes by saying that “it is the effort not of a single person but of a group of people — the bigger the better — pursuing ideas with curiosity, inquisitiveness, openness, and discipline.” I agree… more wholeheartedly now than I would have back in 1990, when I was wearing the Caltech mortarboard.\n\nBack then I considered scientists to be a breed apart — a privileged class of gifted people trained to think in a different way. That this different way of thinking was better than other ways of thinking didn’t have to be proclaimed aloud. We all knew it with quiet confidence. Had Gawande been the commencement speaker in 1990, I would have interpreted his call for inclusivity and openness as a call for members of this elite community to conduct themselves in a way that would sustain our elevated status.\n\nThe “we” versus “they” stance that characterizes Gawande’s speech would have resonated with me then, I think. When he said, “People are prone to resist scientific claims when they clash with intuitive beliefs,” I would have understood the coded language. “People” here means mere people — those who haven’t been inducted into the superior scientific “way of being.” So, what are we scientists to do when those unenlightened outsiders don’t follow us? Using smaller words and speaking more slowly only goes so far, because “once an idea has got embedded and become widespread, it becomes very difficult to dig it out of people’s brains — especially when they do not trust scientific authorities.”\n\nYes, indeed. People tend to be wary of that kind of brain surgery.\n\nMaybe the better way to restore public confidence is to abandon the condescending mindset and embrace a much more radically inclusive view of science. Maybe the moms Gawande referred to — the ones who jumped to the conclusion that vaccines were dangerous — aren’t all that different from professional scientists who jump to the conclusion that public dissent is dangerous. Gawande gave five handy tips for writing people off as pseudoscientists, but instead of alienating people by dismissing them in this way, what if we were to view public opinion as the ultimate form of peer review?\n\nIf the safety of well-studied vaccines and the danger of forgoing them are observable facts, perhaps we should trust public peer review to affirm this. Indeed, it already has. Gawande mentioned the tragic human cost of a drop in vaccination rates in the US from 1989 to 1991. Ten years after that drop, Gallop results showed that “parents with the most information, both positive and negative, are most likely to get their children vaccinated.” And this public verdict has held. According to a recent Pew Research Center report: “A vast majority of Americans view childhood vaccines as safe.”\n\nPeople aren’t stupid. Science is a public enterprise, and public acceptance has always been its most significant seal of approval. Professional scientists should embrace this by doing more free sharing of information and less complaining about public opinion.\n\nEditor’s note: Dr. Axe is Director of Biologic Institute and author of the forthcoming book Undeniable — How Biology Confirms Our Intuition That Life Is Designed (HarperOne). Undeniable will be published on July 12, but you can pre-order before then and participate in an exclusive, private conference call with Dr. Axe and talk-show host Michael Medved. You’ll also receive digital versions of three complete books from Discovery Institute Press.\n\nGo to the new Undeniable website for easy instructions.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/mt-import/Axe%20Undeniable%20Cover.png", "locale": "en_US", "type": "article", "title": "Public Opinion Is the Ultimate Peer Review | Evolution News", "description": "People aren't stupid. Science is a public enterprise, and public acceptance has always been its most significant seal of approval.", "url": "https://evolutionnews.org/2016/06/public_opinion/", "site_name": "Evolution News", "updated_time": "2016-06-15T10:32+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2016-06-15T10:32+00:00", "article:modified_time": "2016-06-15T10:32+00:00"}, "tags": ["Nation", "Views", "Science", "Undeniable"], "tweets": [], "movies": [], "links": ["http://www.newyorker.com/news/news-desk/the-mistrust-of-science?utm_source=Viber&utm_medium=Chat&utm_campaign=Private", "http://www.newyorker.com/contributors/atul-gawande", "https://www.amazon.com/Undeniable-Biology-Confirms-Intuition-Designed/dp/0062349589", "http://www.gallup.com/poll/4768/americans-supportive-childhood-vaccinations.aspx", "http://www.pewresearch.org/fact-tank/2015/07/17/5-facts-about-vaccines-in-the-u-s/", "https://www.amazon.com/Undeniable-Biology-Confirms-Intuition-Designed/dp/0062349589", "http://www.discoveryinstitutepress.com/", "http://www.undeniabledesign.com/", "http://creativecommons.org/licenses/by-sa/4.0", "https://commons.wikimedia.org/wiki/File%3AAtul-Gawande_final-photo.jpg"], "authors": [], "publish_date": "2016-06-15T10:32+00:00"}