{"result_id": "112036", "URL": "https://evolutionnews.org/2022/12/the-200th-birthday-of-louis-pasteur-a-man-of-science-and-faith/", "timestamp": "2023-04-25 15:05:34 CEST+0200", "meta": {"description": "In the 19th century, it was widely believed that the spontaneous generation of life from non-life was common and unremarkable.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/12/the-200th-birthday-of-louis-pasteur-a-man-of-science-and-faith/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Louis Pasteur: A Man of Science and Faith", "cleaned_text": "December 27, 2022, marks the 200th anniversary of the birth of Louis Pasteur, the French scientist whose scientific breakthroughs have saved millions of lives, and whose work on microbes sounded the death knell for the idea of spontaneous generation. On a new episode of ID the Future, biologist Ann Gauger describes the triumphs, flaws, and tragedies in the life of this extraordinary individual. Download the podcast or listen to it here.\n\nIn the 19th century, it was widely believed that the spontaneous generation of life from non-life was common and unremarkable, since it was thought that spontaneous generation of worms, mold, and other life forms occurred all the time in rotting meat and dirty rags. Pasteur constructed an experiment demonstrating that these “spontaneously” arising worms and such in fact sprang from microorganisms contained in the dust of the air. In this way Pasteur lent decisive support to the view summarized in the Latin phrase, “Omne vivum ex vivo” — all life is from life. This is sometimes referred to as the law of biogenesis and it holds that organisms do not spontaneously arise in nature from non-life.\n\nThanks in no small part to Pasteur’s work in this area, the origin of the first life on Earth came to be seen as a powerful mystery for scientists committed to the chance origin of the first life, a mystery deepened by discoveries in the 20th and 21st centuries showing that even the simplest single-celled life is vastly more sophisticated than even our most advanced manmade factories.\n\nThere is much more to the fascinating life and work of Louis Pasteur, from his pioneering and life-saving work on vaccines and the special relationship he had with his wife to his Christian faith that bore him up through the death of three of his children. Tune in to learn about this complex man of science and faith. And for more on the enigma of the first life, see the 2020 book from Discovery Institute Press, The Mystery of Life’s Origin: The Continuing Controversy.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2018/02/Louis-Pasteur.jpg", "image:width": "1200", "image:height": "630", "locale": "en_US", "type": "article", "title": "Louis Pasteur: A Man of Science and Faith | Evolution News", "description": "In the 19th century, it was widely believed that the spontaneous generation of life from non-life was common and unremarkable.", "url": "https://evolutionnews.org/2022/12/the-200th-birthday-of-louis-pasteur-a-man-of-science-and-faith/", "site_name": "Evolution News", "updated_time": "2022-12-21T19:33+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-12-21T19:22+00:00", "article:modified_time": "2022-12-21T19:33+00:00"}, "tags": ["abiogenesis", "mold", "single-celled life", "ID the Future", "Ann Gauger", "worms", "Latin", "microbes", "microorganisms", "Louis Pasteur", "Christianity", "spontaneous generation", "children", "faith", "law of biogenesis", "factories", "podcast", "origin of life", "Vaccines"], "tweets": [], "movies": [], "links": ["https://idthefuture.com/1690/", "https://www.amazon.com/dp/1936599740/"], "authors": [], "publish_date": "2022-12-21T19:22+00:00"}