{"result_id": "112016", "URL": "https://evolutionnews.org/2022/12/5-story-of-2022-the-rise-of-totalitarian-science/", "timestamp": "2023-04-25 15:05:20 CEST+0200", "meta": {"description": "Now, facts are becoming clearer — and so are the momentous consequences of the pandemic for our culture.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/12/5-story-of-2022-the-rise-of-totalitarian-science/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "#5 Story of 2022: Rise of Totalitarian Science", "cleaned_text": "Editor’s note: Welcome to an Evolution News tradition: a countdown of our Top 10 favorite stories of the past year, concluding on New Year’s Day. Our staff are enjoying the holidays, as we hope that you are, too! Help keep the daily voice of intelligent design going strong. Please give whatever you can to support the Center for Science & Culture before the end of the year!\n\nThe following was originally published on January 31, 2022.\n\nIn 2007, I published Darwin Day in America, a critical history of social Darwinism in the United States and, more broadly, an exploration of the abuse of science in American public policy in the last century-and-a-half. In 2015, I wrote a new chapter for the paperback edition, highlighting a worrisome trend. I warned:\n\nSome predictions you don’t want to turn out to be true. Unfortunately, in my view we’ve gone pretty far down the path toward totalitarian science during the past two years.\n\nI understand some readers may find this statement offensive. We have many different views about COVID-19 and the public policies designed to combat it. Our views are affected both by our understanding of the facts and by our own experiences. If someone you loved died from COVID-19, that tragedy will affect your view of the pandemic. If you or someone you love has been injured by a COVID-19 vaccine, that experience will influence you as well. If your small business or job did not survive the pandemic, ditto. Because of the pandemic’s deeply personal costs, it can be painful to engage in a candid discussion of the changes COVID-19 policies have wrought on our society.\n\nYet such a discussion is long overdue. Evolution News and Science Today focuses primarily on the scientific, philosophical, and metaphysical debates over Darwinian evolution and intelligent design. But from the start, the impact of “scientism” on public policy, freedom of speech, and human dignity have been central to our mission as well. For the past two years, we’ve largely refrained from wading into the debates over COVID-19. In part this was because it was hard to weigh in on debates when the facts were so unclear. But it also was because the issue was so polarizing.\n\nNow, after two years, facts are becoming clearer — and so are the momentous consequences of the pandemic for our culture. Those consequences are so serious that they can’t be ignored. That’s why from here on you can expect more coverage at Evolution News of the societal challenges raised by scientism during the COVID era. In this article, let me highlight just three.\n\n1. The Dangerous Expansion of Government Power in the Name of Science\n\nCOVID-19 has been used as the rationale for an extraordinary expansion of government power in the name of science: lengthy “lockdowns” of businesses and churches, vaccination mandates, government-imposed discrimination against people based on their medical choices, government-encouraged censorship of dissenting scientific views, and more. Perhaps you support some of these policies as necessary. Perhaps you don’t. But even if you support each and every one of the policies adopted, you ought to be concerned by how they have been imposed. Almost none of the policies were enacted by legislative bodies after an open public debate. Almost all of the policies were enacted unilaterally by executive branch officials asserting emergency powers or by unelected public health officials immune from public accountability.\n\nCOVID has shown government officials how to do an end-run around the normal system of checks and balances. They simply need to invoke “science” and declare an emergency — and then extend their emergency orders time and again. Anyone who dares challenge the emergency orders will be stigmatized as “anti-science,” or they will be told they aren’t scientists so they have no right to be heard. Regardless of your view of specific anti-COVID policies, policymaking during the pandemic has set a terrible precedent for the future.\n\nThe genie of unaccountable government power in the name of science has been let out of the bottle. Will we be able to put it back in?\n\n2. The Dramatic Rise of Censorship in the Name of Science\n\nThe COVID era also has seen a dramatic rise of censorship in the name of science. We are told continuously now that “misinformation” or “disinformation” must be stopped. No decent person favors the spread of “misinformation.” But who is to judge what constitutes “misinformation”? Those warning of “misinformation” seem to assume that existing elites are always right, and so they should be in charge of determining what is true or false. But anyone conversant with the history of science or government knows that this claim can’t hold up to scrutiny. Neither elite scientists nor government officials have a monopoly on the truth. Truth often arises from dissenters. That’s why we have free speech in the first place.\n\nWe are also told that allowing free speech about COVID and related policies is too dangerous to permit. But the claim that speech is too dangerous to permit is always the go-to argument for totalitarians. If they had their way, we wouldn’t have free speech about anything.\n\nYes, there is misinformation in public discussions of COVID and many other topics. Some of it comes from private parties. Some of it comes from government officials. But the way to combat such misinformation is by adding speech, not suppressing it. As John Milton wrote in his famous defense of free speech, we are wrong to restrict free speech because we “misdoubt” the strength of truth in open debate. “Let her [Truth] and Falsehood grapple; who ever knew Truth put to the worse, in a free and open encounter?”\n\nUnfortunately, instead of defending free speech, we are seeing increased demands for the censorship of disfavored speech in the name of science. Arguments for science censorship have been made before about Darwinian evolution and climate change. But COVID-19 has raised the lobbying for suppression to a whole new level. The President and the Surgeon General are now actively pressuring journalists and tech companies to censor messages disfavored by the government. Taxpayer-funded NPR has all but urged medical licensing boards to strip medical licenses from doctors who offer dissenting opinions about COVID and its treatments. According to the Washington Post, the former head of the NIH, Francis Collins, believes we should “identify those who are purposefully spreading false information online and bring them to justice.” The CEO of Pfizer has branded those circulating criticisms of his company’s vaccines as “criminals because they have literally cost millions of lives.” Criminals. And criminals are supposed to be punished, right? Accordingly, a New York state legislator has proposed a bill he says “will force social media companies to be held accountable for the dangers they promote” by allowing people to express “disinformation” like “anti-vaccine falsehoods.” The bill would authorize both government and private parties to seek court orders and damages against offenders. In the words of law professor Jonathan Turley, “the New York legislation would gut free speech by creating criminal penalties for views deemed ‘false’ despite the continuing debates over issues like the efficacy of masks or vaccine protocols.”\n\nLost in current debates is the fact that much so-called “misinformation” targeted for suppression actually represents legitimate differences of opinion held by scientists and policy experts. Other pieces of so-called “misinformation” are in reality true facts that those in charge would rather not be forced to address.\n\nFor example, it is fact, not fiction, that the government’s Vaccine Adverse Event Reporting System (VAERS) has had more adverse reaction reports filed for the COVID-19 vaccines than for any other vaccine since VAERS started collecting data in 1990. Indeed, as of mid-January, 55 percent of all adverse reactions, 59 percent of all hospitalizations, and 71 percent of all deaths reported to VAERS are from the COVID-19 vaccines. What these data mean is subject to legitimate differences of opinion. But the fact that the data exist is unquestionable. Yet if you spend much time discussing VAERS in social media or on YouTube, you are likely to be banned.\n\nThe British Medical Journal (BMJ) is one the world’s oldest medical journals, published by the British Medical Association. That didn’t stop Facebook from limiting Facebook users’ ability to share an article from the medical journal last fall because of a disputed “fact check.” The offending article, which was peer-reviewed, raised questions about “poor clinical trial research practices at… a contract research company helping carry out the main Pfizer covid-19 vaccine trial.” BMJ has attempted to appeal Facebook’s censorship, thus far without success. Is Facebook combatting “misinformation” here — or simply suppressing legitimate criticisms of Big Pharma?\n\nIt gets worse. Tech companies are now blocking citizen access to their elected officials’ statements and deliberations about science and public policy. Public officials are being banned or suspended by Twitter and/or Facebook for voicing their views. In one especially notorious case, hearings and expert panels convened by U.S. Senator Ron Johnson from Wisconsin have been repeatedly censored by YouTube because they featured scientists and experts who offer evidence-based critiques of current COVID policies.\n\nIn reality, the current campaign to eliminate scientific “misinformation” is a Trojan Horse. The real goal appears to be the elimination of dissenting scientific opinions and analysis, no matter how well substantiated.\n\n3. Mass Dehumanization in the Name of Science\n\nThe third challenge posed to civilized societies by the COVID era is dehumanization in the name of science. The issue here is not whether you favor the COVID vaccines or think they are effective or moral. The issue is how we treat sincere and decent people who make different medical choices than we would. Following past abuses of medical science in Nazi Germany and America, there developed strong support for a person’s right to determine what medical treatments he or she receives. This was regarded as a fundamental human right. In less than two years, the COVID pandemic has obliterated that cultural consensus.\n\nAs a result, we are witnessing a mass campaign to dehumanize an entire class of people because of their medical choices. Fellow citizens who choose not to be vaccinated are being branded “narcissists,” “child abusers” and “parasites.” They are accused of “killing off their fellow citizens.” They are denounced as “dangerous” people “from poorer or less educated parts of society.” They are described as “a leech on everyone else’s participation in making America healthy and safe.” A sitting federal judge has declared that “the vast majority of unvaccinated adults” are either (take your pick) “uninformed and irrational” or “selfish and unpatriotic.” A member of a famous rock band has labeled them “an enemy”of society with a “delusional, evil idea.” The Prime Minister of Canada has called them “misogynistic and racist.” A New York newspaper derides them as low in IQ. The Republican governor of Alabama urges that “it’s time to start blaming the unvaccinated folks,” accusing them of embracing “a horrible lifestyle.” A former speechwriter for George W. Bush has compared the unvaccinated to cancer, calling them “the malignant minority.” The president of France claims the unvaccinated are not even citizens.\n\nThis kind of othering in the name of science is repulsive. The closest analogue I can find to anything like this goes back to the social Darwinist eugenics movement in the early 20th century, where eugenists like Margaret Sanger succeeded in invoking science to sterilize people they similarly labeled “parasites,” “leeches,” “cancerous growths,” and more (see pp. 139-140 of Darwin Day in America).\n\nSadly, too many religious leaders have been silent about the current demonization, or worse, they have been complicit. Francis Collins, the nation’s most noted evangelical Christian scientist, has fanned the flames of hatred against the unvaccinated. Evangelical political commentator David French has lashed out at unvaccinated Christians for espousing views that are “extreme and dangerous” and for have having “a hardened heart” where “reason and virtue have difficulty penetrating.”\n\nThis kind of rhetoric against others has cruel real-world consequences. Unvaccinated people are losing their jobs and their livelihoods, often by government decree. They are being denied unemployment benefits — benefits they paid for through their payroll taxes. Doctors have announced that they will not serve unvaccinated people, and unvaccinated patients are being denied life-saving organ transplants. Unvaccinated people are being denied access to marriage licenses. Judges have tried to deny child visitation rights to parents who are not vaccinated. In many jurisdictions, healthy unvaccinated people are now banned from stores, theaters, and sporting events. In Canada, one province even authorized grocery stores to ban the unvaccinated, only relenting after a massive backlash. Just ponder for a moment the type of mindset someone must have to authorize the denial of access to food.\n\nBut apparently the current degradation of the unvaccinated isn’t enough. The editorial board of the Salt Lake City Tribune opined recently that the government should “deploy the National Guard to ensure that people without proof of vaccination would not be allowed, well, anywhere.”\n\nIn Quebec, a television talk show featured children promoting more authoritarianism. “What should we do with the people who don’t want the vaccine?” the host asks the children. “We should call the police!” says a young boy. “If they don’t have the vaccine it can make a lot of people in danger,” a girl chimes in, adding that “we should cut everything from them [the unvaccinated] — little by little — until they submit and get vaccinated.”\n\nAccording to a nationwide survey earlier this month in the United States, many voters affiliated with one of America’s main political parties have all but abandoned their support for civil liberties in the COVID era. Nearly 60 percent “would favor a government policy requiring that citizens remain confined to their homes at all times, except for emergencies, if they refuse to get a COVID-19 vaccine.” Almost 50 percent “think federal and state governments should be able to fine or imprison individuals who publicly question the efficacy of the existing COVID-19 vaccines on social media, television, radio, or in online or digital publications.” Nearly the same amount “favor governments requiring citizens to temporarily live in designated facilities or locations if they refuse to get a COVID-19 vaccine.”\n\nWith Civilization in Crisis, Here Is What You Can Do\n\nThese repressive measures are justified in the name of “the science.” But are they really based on science?\n\nConsider the uncontroverted fact that millions of unvaccinated Americans have had COVID-19 already. According to research just released by the Centers for Disease Control, unvaccinated persons who already had COVID-19 are three times less likely to get COVID than vaccinated individuals who haven’t had COVID. That’s right — unvaccinated individuals who have had COVID are far more protected than vaccinated individuals who haven’t. So there is absolutely no scientific basis for punishing or segregating the millions of unvaccinated people who already had COVID. Yet punitive policies targeting unvaccinated Americans make no distinction between those who have or haven’t had COVID, and advocates for such policies don’t even attempt to explain why.\n\nMake no mistake. Our civilization is in crisis right now — a crisis tied to an abusive view of science. How we respond will affect the lives of our children and our children’s children. This is not a counsel of despair. It is a call to action. As Ronald Reagan said in his First Inaugural Address, “I do not believe in a fate that will fall on us no matter what we do. I do believe in a fate that will fall on us if we do nothing.”\n\nSo what can you do?\n\nWhen you hear a friend or colleague demonizing others for being unvaccinated, call them out on their dehumanization of others.\n\nWhen you hear people advocating suppression of “misinformation” in the name of science, advocate for free speech — and share some true scientific information that is being suppressed.\n\nWhen local government officials push increasingly repressive measures, let them know you strongly oppose those measures and why.\n\nAnd keep yourself informed by reading Evolution News for more news and analysis about the challenges of scientism in our culture!", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2022/01/Covid.jpg", "image:width": "2400", "image:height": "1260", "locale": "en_US", "type": "article", "title": "#5 Story of 2022: Rise of Totalitarian Science | Evolution News", "description": "Now, facts are becoming clearer — and so are the momentous consequences of the pandemic for our culture.", "url": "https://evolutionnews.org/2022/12/5-story-of-2022-the-rise-of-totalitarian-science/", "site_name": "Evolution News", "updated_time": "2023-01-16T21:06+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-12-28T14:33+00:00", "article:modified_time": "2023-01-16T21:06+00:00"}, "tags": ["government", "scientism", "Justin Trudeau", "Nazi Germany", "Quebec", "discrimination", "Twitter", "Ron Johnson", "National Public Radio", "churches", "vaccine", "totalitarian science", "Jonathan Turley", "Pfizer Inc.", "Surgeon General", "misinformation", "Social Darwinism", "Joe Biden", "YouTube videos", "British Medical Journal", "Canada", "COVID-19", "censorship", "disinformation", "Facebook", "vaccination mandates", "Evolution News", "civilization", "Darwin Day in America", "eugenics", "Wisconsin", "unvaccinated", "Vaccine Adverse Event Reporting System", "free speech", "United States"], "tweets": [], "movies": [], "links": ["https://evolutionnews.org/donate/", "https://darwindayinamerica.com/", "https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/burden.html", "https://www.realnotrare.com/", "https://www.wsj.com/articles/covid-19s-toll-on-u-s-business-200-000-extra-closures-in-pandemics-first-year-11618580619", "https://www.nationalreview.com/2021/02/time-to-pull-back-on-emergency-powers-for-governors/", "https://www.realclearscience.com/blog/2022/01/24/how_is_sonia_sotomayor_so_misinformed_about_covid_813303.html", "https://milton.host.dartmouth.edu/reading_room/areopagitica/text.html", "https://freescience.today/", "https://www.heritage.org/environment/commentary/prosecuting-climate-change-deniers-abuse-power", "https://www.dailywire.com/news/biden-calls-for-social-media-censorship-on-virus-deal-with-the-misinformation-and-disinformation", "https://www.hhs.gov/sites/default/files/surgeon-general-misinformation-advisory.pdf", "https://www.npr.org/sections/health-shots/2021/09/14/1035915598/doctors-covid-misinformation-medical-license", "https://www.washingtonpost.com/politics/2021/11/19/nih-director-conspiracies-are-winning-here/", "https://www.cnbc.com/2021/11/09/covid-vaccines-pfizer-ceo-says-people-who-spread-misinformation-on-shots-are-criminals.html", "https://www.nysenate.gov/newsroom/press-releases/brad-hoylman/anniversary-january-6-insurrection-approaches-senator-brad", "https://www.nysenate.gov/legislation/bills/2021/s7568", "https://jonathanturley.org/2021/12/30/new-york-considers-legislation-to-curtail-free-speech-in-the-name-of-democracy/", "https://thefederalist.com/2021/12/14/forcing-people-into-covid-vaccines-ignores-important-scientific-information/", "https://openvaers.com/", "https://www.bmj.com/", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://twitter.com/SenRonJohnson/status/1459346068131524609", "https://www.yakimaherald.com/opinion/letter-stop-mincing-words-theyre-parasites-not-patriots/article_7513f68b-20ab-5a6c-8543-f937767e2acd.html", "https://www.latimes.com/opinion/letters-to-the-editor/story/2022-01-01/readers-end-2021-angry-over-covid", "https://www.verywellhealth.com/unvaccinated-people-are-not-oppressed-5210475", "https://www.msn.com/en-us/news/us/letters-to-the-editor-i-ve-had-enough-readers-are-furious-at-vaccine-refusers/ar-AAMoqNx", "https://www.washingtontimes.com/news/2022/jan/20/robert-n-scola-jr-federal-judge-blasts-unvaccinate/", "https://guitar.com/news/music-news/gene-simmons-antivax-antii-vaccine-flat-earth-enemy/", "https://citizenfreepress.com/column-3/justin-trudeau-the-unvaccinated-are-usually-racist-and-misogynist/", "https://www.nydailynews.com/news/national/ny-states-lowest-highest-vaccination-rates-iq-score-covid-20210524-ubkwdphohrabbi77vurazmwehe-story.html", "https://www.cnn.com/videos/us/2021/07/23/alabama-governor-ivey-covid-19-vaccinations-newsroom-vpx.cnn", "https://twitter.com/davidfrum/status/1470030543953838088", "https://www.newsweek.com/french-president-emmanuel-macron-says-someone-who-refuses-covid-vaccine-not-citizen-1665669", "https://www.verywellmind.com/what-is-othering-5084425", "https://stream.org/francis-collins-rhetoric-about-the-unvaccinated-is-anything-but-christian/", "https://frenchpress.thedispatch.com/p/its-time-to-stop-rationalizing-christian", "https://news.yahoo.com/vaccine-mandates-lost-job-being-004347955.html", "https://www.msn.com/en-us/money/personalfinance/workers-fired-for-being-unvaccinated-may-not-be-able-to-collect-unemployment-benefits/ar-AAN74ld", "https://news.yahoo.com/medical-ethicists-criticize-doctors-refusing-to-treat-the-unvaccinated-202958236.html", "https://www.dailymail.co.uk/news/article-10439735/Boston-father-two-31-removed-heart-transplant-list-hes-not-vaccinated.html?ito=social-twitter_mailonline", "https://www.oakville.ca/townhall/proof-of-vaccination.html", "https://www.dailysignal.com/2021/08/30/judge-denies-mom-custody-of-son-because-shes-unvaccinated/", "https://tnc.news/2021/12/17/new-brunswick-backtracks-on-vaccine-passports-for-grocery-stores/", "https://www.sltrib.com/opinion/editorial/2022/01/15/utah-leaders-have/", "https://spectator.com.au/2022/01/the-terrifying-quebec-covid-youth/", "https://www.rasmussenreports.com/public_content/politics/partner_surveys/jan_2022/covid_19_democratic_voters_support_harsh_measures_against_unvaccinated", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7104e1.htm?s_cid=mm7104e1_w"], "authors": [], "publish_date": "2022-12-28T14:33+00:00"}