{"result_id": "112004", "URL": "https://evolutionnews.org/2012/11/paul_johnson/", "timestamp": "2023-04-25 15:05:12 CEST+0200", "meta": {"description": "Johnson tries to tar far too many historical figures with the social Darwinist brush.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2012/11/paul_johnson/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Paul Johnson on Social Darwinism", "cleaned_text": "Editor’s note: For more of ENV’s commentary on Paul Johnson’s book, see here and here. The first part of Professor Weikart’s review is here.\n\n One of the most serious instances of overstatement in Johnson’s biography of Charles Darwin, Darwin: Portrait of a Genius, is his treatment of social Darwinism. This is a shame, because Johnson makes many good points about social Darwinism, too. He correctly argues that Darwin believed in superior and inferior races, and that Darwinism was used extensively in the nineteenth century to justify imperialism (as I have also shown in my book, From Darwin to Hitler: Evolutionary Ethics, Eugenics, and Racism in Germany). He correctly notes that Hitler embraced social Darwinism. Of course I heartily agree, having written an entire book on the subject: Hitler’s Ethic: The Nazi Pursuit of Evolutionary Progress.\n\n While some of his discussion about social Darwinism makes sense, he overplays his hand, damaging his credibility. While he correctly argues that Darwin was a bona fide social Darwinist, he mistakenly insists that Darwin opposed vaccinations and other medical interventions that allowed the weak and sickly to reproduce. This is a widespread myth among anti-Darwinists that has been propagated by quoting Darwin out of context. It is true that in Descent of Man Darwin mentioned that vaccinations (and other public health measures) could promote the reproduction of the weak, but Darwin immediately added that because of our social instincts, “we must bear without complaining the undoubtedly bad effects of the weak surviving and propagating their kind.”\n\n Johnson tries to tar far too many historical figures with the social Darwinist brush. Despite my expertise in social Darwinism in Germany, I cannot figure out why he thinks Heinrich von Treitschke is a “leading Darwinian historian of Germany,” and calling Bismarck’s slogan “Blood and Iron” a Darwinian phrase is quite a stretch.\n\n Worse yet, Johnson overstates the link between Darwinism and Marxism. He claims that Marx and Engels used Darwin’s concept of the struggle for existence to justify the class struggle. I can understand why Johnson might think this, because Marx did once privately make some sort of connection between the two. However, as I have explained in great detail in Socialist Darwinism: Evolution in German Socialist Thought from Marx to Bernstein (available here), more often Marx and Engels rejected applying natural selection to human society. Marx and Engels liked Darwin’s theory for its materialistic implications, but they didn’t like his reliance on the Malthusian population principle, nor his stress on the human struggle for existence. Further, Johnson’s argument is anachronistic, since Marx and Engels both developed their social theories before they knew anything about Darwin. Marxism was based on Hegel, French socialist thought, and British political economy, but not on Darwin.\n\n Johnson then blames Darwinism for Marxist atrocities of the twentieth century, including Stalin’s mass murders: “Stalin had Darwin’s ‘struggle’ and ‘survival of the fittest’ in mind when dealing with the Kulaks and when relocating the minorities of Greater Russia: extermination of groups was a natural event if the party, redefined as the elite of the politically ‘fit,’ was to survive.” While it is true that biological evolution influenced Stalin, especially in his adoption of atheism, the form of biological evolution that Stalin embraced was Lamarckism, not Darwinism. Stalin patronized the Soviet biologist Lysenko, who promoted a Lamarckian theory that claimed evolutionary change occurred through environmental influence, not through Darwinian struggle. Since Stalin preferred Lamarckism to Darwin’s concept of the struggle for existence, his murder of kulaks could hardly have been an application of Darwinian struggle to society. Johnson’s claim that Pol Pot learned about biological evolution from the existentialist philosopher Jean-Paul Sartre and then applied it to society by massacring multitudes is downright bizarre.\n\n Critics of Darwinism should beware of Johnson’s biography. Some elements of it are alluring, but it contains so much misinformation that it damages the cause of the truth. Anyone relying on it will be leaning on a broken reed.\n\n Richard Weikart is professor of history at California State University, Stanislaus, and author of From Darwin to Hitler: Evolutionary Ethics, Eugenics, and Racism in Germany and Hitler’s Ethic: The Nazi Pursuit of Evolutionary Progress.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/mt-import/Darwin%20Portrait%20of%20a%20Genius.jpeg", "locale": "en_US", "type": "article", "title": "Paul Johnson on Social Darwinism | Evolution News", "description": "Johnson tries to tar far too many historical figures with the social Darwinist brush.", "url": "https://evolutionnews.org/2012/11/paul_johnson/", "site_name": "Evolution News", "updated_time": "2012-11-24T06:50+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2012-11-24T06:50+00:00", "article:modified_time": "2012-11-24T06:50+00:00"}, "tags": ["History"], "tweets": [], "movies": [], "links": ["https://evolutionnews.org/2012/10/historian_paul_065281.html", "https://evolutionnews.org/2012/10/paul_johnsons_d065641.html", "https://evolutionnews.org/2012/11/from_paul_johns066691.html", "http://www.amazon.com/Darwin-Portrait-Genius-Paul-Johnson/dp/0670025712", "http://www.amazon.com/Darwin-Portrait-Genius-Paul-Johnson/dp/0670025712", "http://www.csustan.edu/history/faculty/weikart/sd-toc.htm", "http://www.amazon.com/Darwin-Hitler-Evolutionary-Eugenics-Germany/dp/140397201X", "http://www.amazon.com/Hitlers-Ethic-Pursuit-Evolutionary-Progress/dp/0230618073"], "authors": [], "publish_date": "2012-11-24T06:50+00:00"}