{"result_id": "112021", "URL": "https://evolutionnews.org/2016/01/inquiry-based_s/", "timestamp": "2023-04-25 15:05:24 CEST+0200", "meta": {"description": "Case in point: here is physician Danielle Teller writing over at Quartz.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2016/01/inquiry-based_s/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Inquiry-Based Science Education — on Everything but Evolution", "cleaned_text": "Unfortunately, it’s typical for advocates of inquiry-based science teaching to apply their good ideas to everything but evolution. Case in point: here is physician Danielle Teller writing over at Quartz to suggest that teaching science as a collection of facts, rather than a process, has contributed to a lack of “science savvy.” Yet in the same article she denounces the public’s doubts on evolution — as if Darwinian theory were one “fact” that they ought to have simply swallowed whole.\n\nDr. Teller laments that “[a]bout a third of Americans think there is no sound evidence for the existence of evolution.” She wrongly lumps doubt over the scientific accuracy of evolution with vaccine and climate skepticism, and she is certainly mistaken in dismissing questions about Darwinian theory as a sign of scientific illiteracy. However, Teller is correct in describing science as a process of inquiry rather than the mere gathering of data.\n\nOne reason science should be taught as a process, Teller says, is because facts change. Or rather, the body of facts we know expands. This is well recognized. Indeed, one of the precursors to modern national science standards, Project 2061, focused on scientific inquiry rather than facts. Developed in the 1980s, it aimed to prepare a scientifically knowledgeable population in time for the return of Halley’s comet in 2061. The project’s director, Jo Ellen Roseman, told Ars Technica: “While we had no idea what the world would be like, we could guarantee that it would be shaped by science, mathematics, and technology.”\n\nBut macroevolutionary theory has run into trouble precisely because it is a 19th-century idea in a world where the body of known facts has broadened dramatically. Consider Darwin’s explanation of the evolution of the eye. He thought that one could go from a light-sensitive spot to our complex human eyes. But that was understandable. In his era, no one recognized the eye’s intricacies as we do now. Or take the case of so-called vestigial organs. To cite two examples, much of what we thought we knew about the appendix and tonsils as “vestigial” by-products of evolution has been falsified as scientists find important immune and other functions.\n\nYet neo-Darwinism’s defenders hang on because humans have a tendency to reject ideas that challenge preconceived notions. As Thomas Kuhn wrote in The Structure of Scientific Revolutions, when faced with an anomaly, a theory’s defenders “will devise numerous articulations and ad hoc modifications of their theory in order to eliminate any apparent conflict.”\n\nThe result in the context of origins science is a sort of “fundamentalist” evolutionary thinking that rejects counterevidence and dismisses any suggestion that evolution might have weaknesses. Teller writes of her own experience in learning to follow the evidence instead of what she had been taught, noting, “my own personal coda is that I never rejected out-of-hand a theory that challenged my preconceived notions again.” Why the exception, then, for neo-Darwinism?\n\nScience, finally, should be taught as a process because the interpretation of data requires critical thinking. Science education theorists agree. In a joint issue on the theme of reform in STEM (Science, Technology, Engineering, Math) education, Nature and Scientific American noted, “[S]tudents gain a much deeper understanding of science when they actively grapple with questions than when they passively listen to answers.”\n\nNevertheless, in public school science classrooms, evolution is often presented in a one-sided, dogmatic manner. At Discovery Institute, we support education that promotes critical thinking by teaching the evolution controversy. What would that look like in the classroom? Teachers could engage their biology students on such questions as: Do Galápagos finches provide evidence for macro-, or only micro-evolution? Are vertebrate embryos really similar in their earliest stages? How likely is it that the Miller-Urey experiment represents conditions present on early earth? Such analysis makes students confront the data before them and look at it from multiple angles, considering a variety of possible interpretations. That, after all, is what the scientific method is all about.\n\nIn fact, you don’t have to be a student, a teacher, or a scientist to engage in scientific inquiry. Thinking critically is for adults, all adults, too. Teller notes:\n\nIt’s not possible for everyone — or anyone — to be sufficiently well trained in science to analyze data from multiple fields and come up with sound, independent interpretations. I spent decades in medical research, but I will never understand particle physics, and I’ve forgotten almost everything I ever learned about inorganic chemistry. It is possible, however, to learn enough about the powers and limitations of the scientific method to intelligently determine which claims made by scientists are likely to be true and which deserve skepticism. [Emphasis added.]\n\nYes, exactly! It is possible. Although Teller goes on to echo the media’s normal neo-Darwinian rhetoric — extol inquiry, but affirm the validity of dogmatic belief in evolution — what she says there could not be more right.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/mt-import/Inquiry-Based%20Science%20Education.jpg", "locale": "en_US", "type": "article", "title": "Inquiry-Based Science Education — on Everything but Evolution | Evolution News", "description": "Case in point: here is physician Danielle Teller writing over at Quartz.", "url": "https://evolutionnews.org/2016/01/inquiry-based_s/", "site_name": "Evolution News", "updated_time": "2016-01-22T03:11+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2016-01-22T03:11+00:00", "article:modified_time": "2016-01-22T03:11+00:00"}, "tags": ["Views", "Science"], "tweets": [], "movies": [], "links": ["http://qz.com/588126/theres-a-good-reason-americans-are-horrible-at-science/", "http://arstechnica.com/science/2015/10/the-us-is-still-learning-how-to-teach-kids-about-science/", "https://evolutionnews.org/2012/06/the_useless_app_1060521.html", "file:///C:/Users/schaffee/AppData/Local/Microsoft/Windows/INetCache/Content.Outlook/2PZMJ8B4/Problem%2010:%20Neo-Darwinism's%20Long%20History%20of%20Inaccurate%20Predictions%20about%20Junk%20Organs%20and%20Junk%20DNA", "https://evolutionnews.org/2015/09/unanswered_ques099081.html", "http://www.nature.com/news/the-scientist-of-the-future-1.17965", "http://www.discovery.org/a/3164", "https://evolutionnews.org/2012/09/back_to_school_064601.html", "https://evolutionnews.org/2015/02/problem_8_diffe091171.html", "http://www.discovery.org/a/24041"], "authors": [], "publish_date": "2016-01-22T03:11+00:00"}