{"result_id": "112026", "URL": "https://evolutionnews.org/2022/02/major-scandal-new-york-times-reports-cdc-withholding-massive-amounts-of-covid-19-data/", "timestamp": "2023-04-25 15:05:27 CEST+0200", "meta": {"description": "To get the Washington State data, I’ve had to make repeated inquiries, and ultimately file a formal public documents request.", "lang": "en", "keywords": "", "favicon": "https://evolutionnews.org/wp-content/themes/evolutionary/bases/images/favicon/favicon.ico", "canonical": "https://evolutionnews.org/2022/02/major-scandal-new-york-times-reports-cdc-withholding-massive-amounts-of-covid-19-data/", "encoding": "UTF-8"}, "image": null, "domain": "evolutionnews.org", "title": "Major Scandal: COVID-19 Data Withheld", "cleaned_text": "A new bombshell article from the New York Times claims that the Centers for Disease Control (CDC) has been withholding massive amounts of data relating to COVID-19 from both the general public and state and local officials. If true, this story ought to be a major scandal.\n\nNote: I’m intentionally linking to the syndicated version of the article, because it is publicly available and not behind a paywall.\n\nFor more than a year, the Centers for Disease Control and Prevention has collected data on hospitalizations for COVID-19 in the United States and broken it down by age, race and vaccination status. But it has not made most of the information public. When the CDC published the first significant data two weeks ago on the effectiveness of boosters in adults younger than 65, it left out the numbers for a huge portion of that population: 18- to 49-year-olds, the group the data showed was least likely to benefit from extra shots, because the first two doses already left them well-protected. …Two full years into the pandemic, the agency leading the country’s response to the public health emergency has published only a tiny fraction of the data it has collected, several people familiar with the data said. Much of the withheld information could help state and local health officials better target their efforts to bring the virus under control.\n\nWhat’s the CDC’s justification for hiding this information from the public as well as state and local officials? CDC spokesperson Kristen Nordlund told the Times that “it’s not yet ready for prime time.”\n\nBut it turns out that this explanation may not be the real answer after all:\n\nAnother reason is fear that the information might be misinterpreted, Nordlund said… Last year, the agency repeatedly came under fire for not tracking so-called breakthrough infections in vaccinated Americans, and focusing only on individuals who became ill enough to be hospitalized or die. The agency presented that information as risk comparisons with unvaccinated adults, rather than provide timely snapshots of hospitalized patients stratified by age, sex, race and vaccination status. But the CDC has been routinely collecting information since the COVID-19 vaccines were first rolled out last year, according to a federal official familiar with the effort. The agency has been reluctant to make those figures public, the official said, because they might be misinterpreted as the vaccines being ineffective. Nordlund confirmed that as one of the reasons. Another reason, she said, is that the data represents only 10% of the population of the U.S. But the CDC has relied on the same level of sampling to track influenza for years. Some outside public health experts were stunned to hear that information exists.\n\nAgain, this is scandalous if true. For the past two years, we’ve heard government officials complain ad nauseum about the spread of misinformation and conspiracy theories regarding COVID-19. Well, misinformation and conspiracy theories rise in inverse proportion to good data. If you really want to combat misinformation, you shouldn’t be hiding the data collected by the government. When data is hidden or missing, people start trying to fill the gaps by speculation. You pretty much guarantee misinformation and conspiracy theories when you withhold data.\n\nFar from the First Time\n\nUnfortunately, this is far from the first time the government science establishment has tried to prevent the release of important data. As I recounted in the paperback edition of my book Darwin Day in America, during the Obama Administration the Environmental Protection Agency (EPA) tried to keep secret the scientific data it used to establish sweeping new air pollution standards. The EPA wanted to keep this information not just from the public, but from the United States Congress! The EPA director at the time, Gina McCarthy, actually denounced those seeking more transparency from the agency.\n\nThe COVID-19 pandemic is far too important to allow the federal science establishment to play these kinds of games. Data transparency should have been a top priority for government officials handling the crisis, especially as the pandemic dragged on. Alas, the opposite has been true. Much of the data released has been highly massaged to fit certain talking points. Trying to get access to the raw data so you can analyze it for yourself can be next to impossible. I know this from personal experience.\n\nI live in Washington State. I am interested in data about cases, hospitalizations, and deaths of the vaccinated versus unvaccinated. I’m especially interested in how the data trends have changed as new COVID-19 variants have arisen. However, the Washington State Department of Health only reports data trends for “rates” of hospitalizations and deaths, not the underlying raw data. While these “rates” do show important things, they are crafted with many different assumptions. They are no substitute for the raw data. Indeed, the raw data is required for anyone to be able to double-check the validity of the rates computed by government scientists (and the relevance of the assumptions they are using to compute the rates).\n\nYou’d think it would be easy to get access to underlying data. But you’d be wrong. To get the Washington State data, I’ve had to make repeated inquiries, ultimately file a formal public documents request, and then wait months to get the information.\n\nWe hear a constant refrain about the need to “follow the science” when it comes to COVID-19. But many of the people offering this refrain seem to ignore something: It’s hard to base your views on science if the scientific data is willfully withheld from the public and independent researchers.\n\nData transparency is something everyone ought to be able to get behind. Whatever your view of COVID-19 and the policies being employed to address it, you should want the government to make its data available for all to inspect. Data transparency should be non-negotiable in the fight against COVID-19. And it’s needed now, not two years from now.", "opengraph": {"image": "https://evolutionnews.org/wp-content/uploads/2020/07/COVID-19.jpeg", "image:width": "2400", "image:height": "1260", "image:alt": "COVID-19", "locale": "en_US", "type": "article", "title": "Major Scandal: COVID-19 Data Withheld | Evolution News", "description": "To get the Washington State data, I’ve had to make repeated inquiries, and ultimately file a formal public documents request.", "url": "https://evolutionnews.org/2022/02/major-scandal-new-york-times-reports-cdc-withholding-massive-amounts-of-covid-19-data/", "site_name": "Evolution News", "updated_time": "2022-02-23T18:57+00:00", "article:publisher": "https://www.facebook.com/discoverycsc", "article:published_time": "2022-02-22T15:31+00:00", "article:modified_time": "2022-02-23T18:57+00:00"}, "tags": ["cases", "Kristen Nordlund", "EPA", "talking points", "race", "CDC", "New York Times", "data", "Centers for Disease Control", "misinformation", "information", "COVID-19", "transparency", "Washington State", "conspiracy theories", "Darwin Day in America", "Obama Administration", "vaccination status", "hospitalizations", "government scientists", "Environmental Protection Agency", "deaths"], "tweets": [], "movies": [], "links": ["https://news.yahoo.com/cdc-isnt-publishing-large-portions-124915536.html", "https://www.amazon.com/Darwin-Day-America-Politics-Dehumanized/dp/1610171357"], "authors": [], "publish_date": "2022-02-22T15:31+00:00"}