{"result_id": "114006", "URL": "https://faithit.com/medical-professional-debunks-flu-vaccine-myths/", "timestamp": "2023-04-25 15:05:44 CEST+0200", "meta": {"description": "I advocate for the flu vaccine because I’ve held a newborn with fever while the doctor does a lumbar puncture. Because I’ve put a grandfather on a ventilator who couldn’t breathe and because I’ve put the final drape over a mother of 3’s face after she beat breast cancer but died of the flu. I did all of this knowing full well that it was preventable.", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/medical-professional-debunks-flu-vaccine-myths/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "\"You Cannot Get the Flu from the Flu Vaccine. Ever. No Matter What Anyone’s Told You\": Certified Medical Professional Explains Misconceptions About the Flu Shot", "cleaned_text": "“Welp, I went and did it. I read the comments on someone’s flu vaccine post and in the process lost 5,642 brain cells that I can never have back. I’m going to say this real clear so that hopefully someone hears my voice louder than Lindsey the bartender who identifies as a ‘health wellness coach’ because she was ‘certified’ by DoTerra essential oils company. At least I can sleep at night knowing that my friends list (and whomever they share this with) heard the voice of an ACTUAL certified medical professional.\n\n1. You cannot get the flu from the flu vaccine. Ever. No matter what anyone’s told you. You CAN get an immune response such as low grade fever, mild inflammation, or local redness and swelling. This is GOOD. It means your body is fighting the inactivated virus it’s been exposed to and it will build immune cells specific to fighting that virus if it ever sees it again….. hence the entire premise behind getting vaccinated. It takes your body about two weeks to build fighter cells and for the vaccine to reach its maximum protectiveness. If you get sick within a week or two of receiving the vaccine, then you were exposed to influenza and hadn’t yet received protection from your vaccine. Crappy timing. Period.\n\n2. The vaccine does NOT cause strokes, auto-immune diseases, or severe allergic reactions. There is a very small percentage of people who’s bodies do not react normally and therefore those people should not receive the flu vaccine. Let me put it this way; I swell up like Violet in the Willy Wonka factory if I eat avocado. I think we can all agree that avocados aren’t dangerous, my body is the problem, not the food. Likewise, the vaccine is safe but like all things (even avocados) it can be dangerous for certain people. I cannot stress enough how rare this is, even though literally every online guru with a degree in alternative wellness claims to know someone it’s happened to.\n\n3. If you’re healthy, good for you. No, seriously, good for you. You have the luxury of deciding whether or not you want to get poked. If you get the flu, you’ll miss a couple days of school, maybe a week off of work and then you’ll return to your life. That’s not the case for many people in our community. When healthy people vaccinate, we protect the newborns and the grandparents and the chemo patients and the ones who truly cannot receive the vaccine. It’s called herd immunity, and it’s the cornerstone of a healthy society.", "opengraph": {"type": "article", "title": "\"You Cannot Get the Flu from the Flu Vaccine. Ever. No Matter What Anyone’s Told You\": Certified Medical Professional Explains Misconceptions About the Flu Shot", "description": "I advocate for vaccines because I’ve held a newborn with fever while the doctor does a lumbar puncture. Because I’ve put a grandfather on a ventilator who couldn’t breathe and because I’ve put the final drape over a mother of 3’s face after she beat breast cancer but died of the flu. I did all of this knowing full well that it was preventable.", "image": "https://cdn.faithit.com/wp-content/uploads/2019/10/bethpurkey.jpg", "url": "https://faithit.com/medical-professional-debunks-flu-vaccine-myths/", "site_name": "Faithit", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2019-10-23T12:28:36-06:00", "article:modified_time": "2019-10-23T12:29:33-06:00", "updated_time": "2019-10-23T12:29:33-06:00", "image:width": "707", "image:height": "398"}, "tags": ["flu vaccine"], "tweets": [], "movies": [], "links": ["https://faithit.com/medical-professional-debunks-flu-vaccine-myths/2/", "https://faithit.com/medical-professional-debunks-flu-vaccine-myths/2/"], "authors": [""], "publish_date": "2019-10-23T12:28:36-06:00"}