{"result_id": "114004", "URL": "https://faithit.com/mom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling/", "timestamp": "2023-04-25 15:05:42 CEST+0200", "meta": {"description": "Her son was experiencing pain, fever, vomiting, diarrhea, and sore muscles. He woke up with the worst rash she's ever seen & told her \"I’m going to die.\"", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/mom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "Doctors Dismiss Boy’s Rash as a Virus—When He Says “I’m Going to Die,” Mom Knows They’re Wrong", "cleaned_text": "It’s a scary thing when your child gets sick and you don’t know what’s wrong with them or how to fix it. It’s even scarier when doctors don’t know what’s wrong with your child and can’t tell you how to fix it.\n\nThat’s the nightmare that Natasha Durling found herself in when her son Oliver was experiencing symptoms of pain, fever, vomiting, diarrhea and sore muscles.\n\nNow, the mother of two is encouraging parents everywhere to stick with their gut when it comes to getting help for their kids.\n\nAfter calling the doctor about Oliver’s symptoms, they weren’t certain what was causing the illness. They told Natasha it was likely just a virus and to bring him in for an appointment if his fever got dangerously high or lasted more than five days.\n\nOver the next few days, Oliver’s condition got worse. Additional symptoms caused the little boy to lose his appetite and stop eating and drinking.\n\nShe rushed her son to the hospital after an unusual rash broke out across his face and neck.\n\nWhen they arrived, the emergency nurse immediately quarantined them, fearful that the cause was measles.\n\nAccording to the CDC, measles is still common in many parts of the world including some countries in Europe, Asia, the Pacific and Africa. In 2016, only 70 people from 11 states were reported to have measles—most of which were unvaccinated.\n\nOliver had previously been vaccinated with two MMR (measles-mumps-rubella) shots. Though his symptoms were similar to that of measles, it was clear that wasn’t what Oliver was suffering from. The doctor verified that it wasn’t measles, and suggested Tylenol and Benadryl.\n\nWhen the little boy woke up the next morning, he refused to get out of bed, complaining that his leg hurt too bad and he thought he might be dying.\n\nNatasha says he was covered from head to toe in the worst rash she’s ever seen. Even with Tylenol and Benadryl, Oliver’s fever was 104°F, and his lips were so swollen they had begun to crack and bleed.\n\nMortified, the mother packed up both of her kiddos again and rushed her son to a different hospital, where the three of them were quarantined for measles a second time, only for the doctor to once again suggest it’s just a virus and prescribe Tylenol and Benadryl.\n\nBy this point, Natasha had had enough.\n\nHer little boy was in pure agony. He had endured days of muscle pain, fever, constant diarrhea, puking, shuffling from one doctor to another, and had told his mom he thought he was dying.\n\nNatasha demanded that her son, at the very least, gets some blood work done, and that doctors get some fluid into his “obviously dehydrated body!”\n\nShe says upon her outburst, the doctor was hesitant so Natasha pushed further and demanded to see a pediatrician immediately.\n\n“After some humming and hawing and getting me calmed down, they finally get Oliver a pediatrician. At this point the pediatrician is very concerned and completely perplexed over Ollie. His rash was unlike anything he’s ever seen. He showed similar signs of measles, but he’s been vaccinated, didn’t have the mouth sores and didn’t have a runny nose, but he decided to have him tested just to be safe.”\n\nOliver was given an IV once his blood work was completed, and that’s when things turned from bad to worse.", "opengraph": {"type": "article", "title": "Doctors Dismiss Boy’s Rash as a Virus—When He Says “I’m Going to Die,” Mom Knows They’re Wrong", "description": "Her son was experiencing pain, fever, vomiting, diarrhea and sore muscles. Then he woke up with the worst rash she's ever seen and told her, \"I’m Going to Die.\"", "image": "https://cdn.faithit.com/wp-content/uploads/2017/06/rash6.8.17.jpg", "url": "https://faithit.com/mom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling/", "site_name": "Faithit", "article:author": "https://www.facebook.com/BriLamm/", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2021-10-24T11:02:17-06:00", "article:modified_time": "2021-10-20T12:04:55-06:00", "updated_time": "2021-10-20T12:04:55-06:00", "image:width": "707", "image:height": "471"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fmom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling%2F&media=https%3A%2F%2Ffaithit.com%2Fwp-content%2Fuploads%2F2017%2F06%2FScreen-Shot-2017-06-08-at-9.28.29-AM.jpg", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fmom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling%2F&media=https%3A%2F%2Ffaithit.com%2Fwp-content%2Fuploads%2F2017%2F06%2FScreen-Shot-2017-06-08-at-9.28.29-AM.jpg", "https://www.gofundme.com/olivers-medical-travel-expenses", "https://faithit.com/become-a-contributor/", "https://www.gofundme.com/olivers-medical-travel-expenses", "https://www.cdc.gov/measles/cases-outbreaks.html", "https://www.gofundme.com/olivers-medical-travel-expenses", "https://faithit.com/mom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling/2/", "https://faithit.com/mom-trusts-gut-doctors-say-symptoms-just-virus-boy-says-hes-dying-oliver-durling/2/"], "authors": [""], "publish_date": "2021-10-24T11:02:17-06:00"}