{"result_id": "114001", "URL": "https://faithit.com/dont-question-someones-faith-getting-covid-vaccine-brie-gowen/", "timestamp": "2023-04-25 15:05:37 CEST+0200", "meta": {"description": "I have forgiven the offense, but I cannot forget the trauma I experienced. I know I’m not alone in this.", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/dont-question-someones-faith-getting-covid-vaccine-brie-gowen/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "‘Don’t Question Someone’s Faith Over Getting the COVID Vaccine’: A Brokenhearted Nurse’s Plea", "cleaned_text": "Numbers have been declining, face mask mandates rescinded, and I try to be hopeful. I haven’t taken care of a COVID positive patient in two weeks! I want this to end more than you know. I want life to return to normal. I want my outgoing husband to go back to ministering to strangers in love, and I desire for my daughters to play with other children without concern or worry. It’s not fear, you see, that drives me, but rather things I saw and cannot forget.\n\nA few months ago I received my first dose of the COVID vaccine. I felt hopeful. In all honesty, I cried happy tears. I wanted an end to this pandemic more than anyone could ever imagine. I posted a picture to Instagram of me smiling with my vaccination card. A stranger commented about my lack of faith, and my obvious succumbing to fear. That broke my heart.\n\nThis morning my husband and I talked about it on the front porch. Before children wake, with coffee in hand, we’re allowed these private conversations. I mentioned how I wanted to see him engage with neighbors more readily, like he used to do. You see, the past year has not just impacted me. It had also scarred my best friend, my spouse who heard my pain after a long day at the ICU bedside. He knew the truth of it.\n\nAs we spoke of hope, of how things seemed to be getting better, I was taken back to this past summer. June and July of 2020. I had been working in a major, metropolitan area of Central Florida, and we had been hit brutally by the pandemic.\n\nI said to my husband, “I remember reaching that breaking point where I knew we couldn’t take much more. There were more patients than we could handle. Every shift another person died. A woman my age with young children like us died. Then that man with daughters the same age as ours. Followed by the death of a coworker’s spouse. I took care of him. I helped her put on the PPE right before he died. I remember thinking that could be me, losing you.”\n\nHe listened in that understanding way of his. Then I added, “I think a part of my depression at the worst of it had a lot to do with public perception. I would try to escape to social media to take my mind off what I was seeing at work, but I was met with people who made light of the very thing that was breaking me.”\n\nI had to take a big step away from the world during all of this. I didn’t fear a virus, but I did fear the way my heart was feeling towards others who could not fathom what I was going through. Here I was crying into the phone with family who couldn’t hold their dying loved one, and the rest of the country was complaining about not having prom or how uncomfortable a thin piece of paper felt on their face for 20 minutes a day. I rubbed ointment of the reddened bridge of my nose, scarred by a respirator I wore for 13 hours a day, and I rubbed my bruised ego even harder.", "opengraph": {"type": "article", "title": "‘Don’t Question Someone’s Faith Over Getting the COVID Vaccine’: A Brokenhearted Nurse’s Plea", "description": "\"I have forgiven the offense, but I cannot forget the trauma I experienced. I know I’m not alone in this. Don’t belittle what someone else decides to do, or God-forbid, question their belief system or faith.\"", "image": "https://cdn.faithit.com/wp-content/uploads/2021/03/nurseplea.png", "url": "https://faithit.com/dont-question-someones-faith-getting-covid-vaccine-brie-gowen/", "site_name": "Faithit", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2021-05-25T10:00:10-06:00", "article:modified_time": "2021-05-24T14:00:57-06:00", "updated_time": "2021-05-24T14:00:57-06:00", "image:width": "707", "image:height": "398"}, "tags": ["Trauma", "covid", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fdont-question-someones-faith-getting-covid-vaccine-brie-gowen%2F&media=https%3A%2F%2Fcdn.briegowen.com%2Fwp-content%2Fuploads%2F2021%2F03%2Fimg_8315-768x1024.jpg", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fdont-question-someones-faith-getting-covid-vaccine-brie-gowen%2F&media=https%3A%2F%2Fcdn.briegowen.com%2Fwp-content%2Fuploads%2F2021%2F03%2Fimg_8315-768x1024.jpg", "https://faithit.com/become-a-contributor/", "https://faithit.com/dont-question-someones-faith-getting-covid-vaccine-brie-gowen/2/", "https://faithit.com/dont-question-someones-faith-getting-covid-vaccine-brie-gowen/2/"], "authors": [""], "publish_date": "2021-05-25T10:00:10-06:00"}