{"result_id": "114019", "URL": "https://faithit.com/covid-survivor-warns-post-viral-syndrome/", "timestamp": "2023-04-25 15:05:59 CEST+0200", "meta": {"description": "If you get Covid-19 and recover, you might permanently have a residual \"post-viral syndrome,\" or Myalgic Encephalomyelitis. It's estimated that between 10 and 29% of survivors will.", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/covid-survivor-warns-post-viral-syndrome/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "COVID Survivor Warns of Permanent ‘Post-Viral Syndrome’: \"Imagine Feeling Like You Have a Hangover or the Flu for the REST. OF. YOUR. LIFE.\"", "cleaned_text": "“Imagine feeling like you have a HANGOVER or the flu for the REST. OF. YOUR. LIFE.\n\nIf you get Covid-19 and recover, you might permanently have a residual “post-viral syndrome,” or Myalgic Encephalomyelitis. It’s estimated that between 10 and 29% of survivors will. So just because you’re young and healthy and will likely not be the ~1% to die, doesn’t mean you’re going to get well. Imagine this:\n\nYou wake up with a headache. Your joints ache and it hurts to move. You feel like the Tin Man from The Wizard of Oz when he needs his oil. Your brain feels foggy. You try to remember what you’re supposed to do today, but your brains are mush. You feel flushed and clammy and a little nauseous. When you walk to the kitchen for your coffee, the world tips and swims just a little, as if it’s just not stable around you.\n\nOnce you are up and moving and drink your cuppa, maybe you start to feel a little better, or maybe a migraine sets in. Lights and sounds and smells- everything is just too much! Just getting dressed or taking a shower might be too strenuous and send you back to bed.\n\nSounds awful, huh? The unfortunate part is that it’s NOT a hangover. There was no fun last night; no choice in the matter, and it won’t go away after a good sleep. It’s what it is like to live with a post-viral syndrome, as many survivors of Covid-19 are finding out.\n\nIt’s exertion intolerance, too, so imagine never being able to work out again. How fit you are now is likely the best you’ll ever get, and your condition will likely decrease significantly. Going up the stairs will leave you breathless, heart racing.", "opengraph": {"type": "article", "title": "COVID Survivor Warns of Permanent ‘Post-Viral Syndrome’: \"Imagine Feeling Like You Have a Hangover or the Flu for the REST. OF. YOUR. LIFE.\"", "description": "\"Even though I just finished my master's degree right before getting sick, I'm not sure if I will ever be able to work again, which devastates me. I have 4 sons who know I can't go on hikes with them anymore and that I have to abruptly end family outings because I feel too ill. My husband has to pick up the slack. It's not fair to any of them.\"", "image": "https://cdn.faithit.com/wp-content/uploads/2020/06/survivors81.jpg", "url": "https://faithit.com/covid-survivor-warns-post-viral-syndrome/", "site_name": "Faithit", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2021-04-06T13:16:35-06:00", "article:modified_time": "2021-04-06T13:58:47-06:00", "updated_time": "2021-04-06T13:58:47-06:00", "image:width": "707", "image:height": "398"}, "tags": ["post-viral syndrome"], "tweets": [], "movies": [], "links": ["https://faithit.com/become-a-contributor/", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fcovid-survivor-warns-post-viral-syndrome%2F&media=https%3A%2F%2Ffaithit.com%2Fwp-content%2Fuploads%2F2020%2F06%2F105488187_10116252124154850_4620325569500317030_o.jpg", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Ffaithit.com%2Fcovid-survivor-warns-post-viral-syndrome%2F&media=https%3A%2F%2Ffaithit.com%2Fwp-content%2Fuploads%2F2020%2F06%2F105488187_10116252124154850_4620325569500317030_o.jpg", "https://faithit.com/covid-survivor-warns-post-viral-syndrome/2/", "https://faithit.com/covid-survivor-warns-post-viral-syndrome/2/"], "authors": [""], "publish_date": "2021-04-06T13:16:35-06:00"}