{"result_id": "114020", "URL": "https://faithit.com/health-professionals-urge-parents-30-children-die-flu/", "timestamp": "2023-04-25 15:06:00 CEST+0200", "meta": {"description": "\"We want to continue to emphasize that there's still a lot of flu activity to come, people that haven't been vaccinated should still get the vaccine.\"", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/health-professionals-urge-parents-30-children-die-flu/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "\"Get the Vaccine,\" Health Professionals Urge Parents After 30 Children Die From Flu", "cleaned_text": "Vaccinations have forever been a controversial topic among the parenting community.\n\nWhile anti-vaxxers argue that children’s immune systems can ward off most infections naturally, the Centers for Disease Control (CDC) “recommends getting 29 doses of 9 vaccines (plus a yearly flu shot after six months old) for kids aged 0 to six.”\n\nThis flu season, in particular, the CDC warns, is one in which the importance of the flu shot should not be ignored.\n\nRanking among the most severe flu season experts have seen in years, influenza activity has spread rapidly across every state except Hawaii. According to the CDC’s weekly flu report released on January 13th, 14,401 new cases were confirmed, bringing the season total of laboratory-confirmed cases to a whopping 74,562.\n\nAnd those numbers do not even reflect all cases, as many people do not visit a physician when ill.\n\nTen children also reportedly died in the week of the 13th, bringing the season’s death toll to thirty.\n\nInfluenza and pneumonia accounted for 8.2% of all deaths that occurred that week according to the National Center for Health Statistics, which is far above what is considered normal for this period.\n\n“Hopefully we’re at the peak now, but until we see it go down for a couple of weeks we won’t know that we have reached peak yet,” said head of CDC’s Domestic Flu Surveillance team, Lynnette Brammer. “Some areas of the country may have, but I think some areas are probably still going up.”\n\nA big part of the problem is that the dominant strain this season has been H3N2, which is the virus strain associated with more deaths, especially in those who already have existing health conditions.\n\n“We want to continue to emphasize that there’s still a lot of flu activity to come, people that haven’t been vaccinated should still get the vaccine,” urged Brammer.\n\nShe says those at particularly high risk include “the elderly, children under 2, pregnant women, and people with chronic health problems.”\n\n“There’s no question that the people who got their flu shots this year got less sick than the people who didn’t,” said the Chairman of Emergency Medicine at Staten Island University Hospital, Dr. Brahim Ardolic. “The sickest people are still clearly the ones who did not get their flu shots.”\n\n“This is one of those flu seasons they’re gonna be comparing other flu seasons to,” he added. “This is the year where those chickens came home to roost.”", "opengraph": {"type": "article", "title": "\"Get the Vaccine,\" Health Professionals Urge Parents After 30 Children Die From Flu", "description": "\"This is one of those flu seasons they're gonna be comparing other flu seasons to.\"", "image": "https://cdn.faithit.com/wp-content/uploads/2018/01/childrensick1.20.18.jpg", "url": "https://faithit.com/health-professionals-urge-parents-30-children-die-flu/", "site_name": "Faithit", "article:author": "https://www.facebook.com/kelseystraeter/", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2018-01-19T15:58:37-07:00", "article:modified_time": "2018-01-19T16:57:50-07:00", "updated_time": "2018-01-19T16:57:50-07:00", "image:width": "707", "image:height": "398"}, "tags": ["Death", "Parenting", "Flu"], "tweets": [], "movies": [], "links": ["https://vaccines.procon.org/", "https://www.cdc.gov/flu/weekly/index.htm", "https://faithit.com/become-a-contributor/", "http://www.cnn.com/2018/01/19/health/flu-widespread-jan-19-cdc-numbers/index.html", "https://faithit.com/health-professionals-urge-parents-30-children-die-flu/2/", "https://faithit.com/health-professionals-urge-parents-30-children-die-flu/2/"], "authors": [""], "publish_date": "2018-01-19T15:58:37-07:00"}