{"result_id": "114023", "URL": "https://faithit.com/greg-locke-yells-ask-you-leave-church-members-wear-mask/2/", "timestamp": "2023-04-25 15:06:04 CEST+0200", "meta": {"description": "Controversial pastor Greg Locke of Global Vision Bible Church in Mount Juliet, Tennessee, made his thoughts clear about recent government murmurs of a second lockdown due to the uptick in COVID-19 resulting from the Delta variant.", "lang": "en", "keywords": "", "favicon": "https://cdn.faithit.com/wp-content/uploads/2016/10/favicon.png", "canonical": "https://faithit.com/greg-locke-yells-ask-you-leave-church-members-wear-mask/2/", "encoding": "UTF-8"}, "image": null, "domain": "faithit.com", "title": "Fired Up Greg Locke Yells \"I Will Ask You to Leave!\" if Church Members Wear a Mask Again", "cleaned_text": "“Modern medicine is the creation & blessing from God. I have always trusted it. We all take meds & go to the doctor when we’re sick,” Reeves added. He posted an update on July 26, 2021, urging others to get vaccinated. “Praise be 2 God! Thanks for all who have shared this journey! A HUGE thanks to the team @ Baylor hospital! Pls go get the vaccine! Pls recognize that U can use your freedom to get vaxxed. There’s no freedom on a vent! If you’ve never been open to Jesus, it will be joy to share how Christ has changed my life! And just in case you want to know what the scene looks like…here it is!”\n\nDuring an interview with Axios on HBO, Reverend Franklin Graham encouraged pastors to inform their congregations where they could get the vaccine. “We are leaders in a community, and we have a responsibility to inform of the truth.”\n\nCalling modern-day medicine “pro-life,” Graham told host Mike Allen, “I want people to know that COVID-19 can kill you, but we have a vaccine out there that could possibly save your life. If you wait, it can be too late.”\n\nEarlier this year Graham was questioned about previously saying, “I think if there were vaccines available in the time of Christ, Jesus would have made reference to them and used them.” A few days later Graham clarified his statement, referencing the parable of the Good Samaritan. “Jesus Christ would advocate for people using vaccines and medicines to treat suffering and save lives.”\n\n“We also know that Jesus went from town to town healing ‘every disease and sickness.’ He came to save life—to offer us eternal life,” Graham said. “Did Jesus need a vaccine Himself? Of course not. He is God.”\n\nHillsong recently experienced the loss of one of its members, Stephen Harmon, after he died from the COVID-19 virus.\n\nHarmon chose not to get vaccinated and posted comments on social media such as: “When you can’t trust the Bible cause it was written by man, but you trust the CDC/Fauci guidelines cause they were written by man. Makes total sense.”\n\nEven after Harmon was hospitalized, he said getting the vaccine was not an option for him.\n\nIn a statement Brian Houston said: “The death of Stephen Harmon was a sad day for those who knew him and called him a friend…While many of our staff, leadership and congregation have already received the COVID-19 vaccine, we recognize this is a personal decision for each individual to make with the counsel of medical professionals.”", "opengraph": {"type": "article", "title": "Fired Up Greg Locke Yells \"I Will Ask You to Leave!\" if Church Members Wear a Mask Again", "description": "“They will be serving Frosties in hell before we shut this place down,\" said Locke. \"Just because a buck-wild, demon-possessed government tells us to.”", "image": "https://cdn.faithit.com/wp-content/uploads/2021/08/lockefeat.jpg", "url": "https://faithit.com/greg-locke-yells-ask-you-leave-church-members-wear-mask/", "site_name": "Faithit", "article:publisher": "https://facebook.com/sharefaithit", "article:published_time": "2021-08-04T10:55:06-06:00", "article:modified_time": "2021-08-04T10:55:37-06:00", "updated_time": "2021-08-04T10:55:37-06:00", "image:width": "707", "image:height": "398"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/i/status/1419760947636412417", "https://youtu.be/vmYKQaihcUw", "https://churchleaders.com/coronavirus-updates-stories/397331-franklin-graham-encourages-all-pastors-to-inform-their-congregation-where-to-get-the-covid-vaccine.html", "https://churchleaders.com/news/392754-franklin-graham-jesus-would-have-taken-the-covid-19-vaccine.html", "https://churchleaders.com/news/391579-is-the-johnson-johnson-covid-19-vaccine-unethical.html", "https://faithit.com/become-a-contributor/", "https://churchleaders.com/news/402175-vaccine-brian-houston-death-stephen-harmon.html", "https://churchleaders.com/news/402175-vaccine-brian-houston-death-stephen-harmon.html", "https://faithit.com/greg-locke-yells-ask-you-leave-church-members-wear-mask/", "https://faithit.com/greg-locke-yells-ask-you-leave-church-members-wear-mask/"], "authors": [""], "publish_date": "2021-08-04T10:55:06-06:00"}