{"result_id": "115001", "URL": "https://faithpanda.com/younger-brother-asks-his-sister-with-down-syndrome-to-be-maid-of-honor-at-his-wedding/", "timestamp": "2023-04-25 15:06:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://faithpanda.com/wp-content/uploads/2022/12/cropped-favicon-32x32.png", "canonical": "https://faithpanda.com/younger-brother-asks-his-sister-with-down-syndrome-to-be-maid-of-honor-at-his-wedding/", "encoding": "UTF-8"}, "image": null, "domain": "faithpanda.com", "title": "Younger brother asks his sister with Down Syndrome to be Maid of Honor at his wedding", "cleaned_text": "The bond between siblings is unique because it is built on unconditional love. Despite all the fighting, name-calling, and frustration that can occur, brothers and sisters will always stand by each other’s side.\n\nOne story that showcases this special bond involves Chris Garafola, a man from Vermont, and his older sister, Brittany, who has Down Syndrome. It is a heartwarming tale that resonates deeply with many people.\n\nAccording to reports, Chris Garafola felt very lucky growing up because he had a loving family and a close relationship with his older sister, Brittany. Even though they were two years apart in age, they were always together and Chris considered them to be a “package deal”.\n\nHe expressed his love for his sister in a heartfelt Instagram post, saying that Brittany always showed him love, challenged him, and taught him important lessons that helped him grow into a better person and a better brother.\n\n“Always poured her love onto him, challenged him, and taught him timeless lessons—giving him countless opportunities to grow (quickly) as a man, and become the best BROTHER he could possibly be,” Chris posted.\n\nBrittany has Down Syndrome and has faced many challenges in her life. Her younger brother Chris has always been by her side to help her overcome these challenges. As they grew up, their bond became stronger. When Chris fell in love with Tatiana and proposed to her, he wanted Brittany to play a big role at their wedding.\n\nChris and Tatiana decided to wait to get married until Brittany could be there to watch them. However, Brittany’s immune system was vulnerable due to her condition, so she needed to get the COVID-19 shot before she could attend any gatherings with others.\n\nIn February 2021, Brittany received her vaccine, which allowed her siblings Chris and Tatiana to start planning for their upcoming wedding. In late March of that same year, Chris, who works as a male model, shared a video on his YouTube channel. In the video, Chris and Tatiana were having a conversation with Brittany over FaceTime. Brittany was amazed to hear that her younger brother was going to tie the knot, but what Tatiana asked her next left her completely speechless.\n\n“And you know what I wanted to ask you? Can you be my maid of honor?” Tatiana said.\n\nIn April 2021, Chris and Tatiana got married while Brittany, their friend and maid of honor, watched and cried tears of joy. They surprised Brittany with a special ring to commemorate the occasion. Chris said that even after he’s married, Brittany will still be his best friend. The pictures of the three friends went viral online because they showed a lot of love and happiness.\n\nLet us know your thoughts about this article in the comment section below.", "opengraph": {"locale": "en_US", "type": "article", "title": "Younger brother asks his sister with Down Syndrome to be Maid of Honor at his wedding", "description": "The bond between siblings is unique because it is built on unconditional love. Despite all the fighting, name-calling, and frustration that can occur, brothers and sisters will always stand by each other’s side. One story that showcases this special bond involves Chris Garafola, a man from Vermont, and his older sister, Brittany, who has Down […]", "url": "https://faithpanda.com/younger-brother-asks-his-sister-with-down-syndrome-to-be-maid-of-honor-at-his-wedding/", "site_name": "Faith Panda", "article:publisher": "https://www.facebook.com/faithpandapage", "article:published_time": "2023-03-22T19:19:03+00:00", "image": "https://faithpanda.com/wp-content/uploads/2023/03/chris.jpg", "image:width": "1201", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe title=\"Brittany's Emotional Reaction to Wedding Surprise &amp; Maid of Honor Request!\" src=\"https://www.youtube.com/embed/5unFh4MHHv8\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/5unFh4MHHv8"}], "links": ["https://www.instagram.com/p/CKcytGLFpHK/?utm_source=ig_embed&utm_campaign=loading", "https://www.instagram.com/p/Bf7YHqSDrig/?utm_source=ig_embed&utm_campaign=loading", "https://www.instagram.com/p/CN0fz0Dlm1j/?utm_source=ig_embed&utm_campaign=loading", "https://www.youtube.com/watch?v=5unFh4MHHv8"], "authors": ["", "Faith Panda"], "publish_date": "2023-03-22T19:19:03+00:00"}