{"result_id": "116017", "URL": "https://foodbabe.com/food-revolution-wins-2017-happened-whats-next/", "timestamp": "2023-04-25 15:06:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/food-revolution-wins-2017-happened-whats-next/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Food Revolution Wins in 2017... What Happened and What's Next", "cleaned_text": "This year has been LIFE CHANGING and full of adventures and surprises. Two big developments happened in 2017, in case you missed it…\n\n#1 – First and foremost in my heart, I became a mom. Harley was born in January and being her mom has brought me the greatest joy I’ve ever experienced. My biggest hope is that when she’s all grown up, our food will not look like it does today – full of synthetic additives and dangerous pesticides. This has strengthened my resolve to keep fighting for a safer food system.\n\n#2 – I (finally!) launched my own product line, called Truvani. This is how I will fight the food industry in 2018. Keep reading below for more on this!\n\nOne thing I like to do at the end of the year is remember all the great things that the last 12 months have brought us and how far we’ve come. All the work we are doing, sharing information, asking companies to change, spreading the word about the dangers of GMO crops, synthetic pesticides, and chemical additives, and choosing to buy organic food at the grocery store is working. I’m so proud of my fellow activists and the Food Babe Army!\n\nAt times it can seem like our food is just getting worse or that good changes take FOREVER, but the truth is that we are winning the battle and I truly believe we’ll win the war.\n\nHere are some highlights from 2017 that show how much we are WINNING…\n\nGirl Scouts launch first non-GMO cookie (January 2017) – The Girl Scout S’mores sandwich cookie sold in some markets is made with verified non-GMO ingredients. Will there be more next season? They also added a GMO label to their other cookies, giving more transparency to consumers. Along with other amazing activists, we called them out in 2016 for their use of shady ingredients and GMOs and it’s time for them to clean up their act!\n\nFrito-Lay makes Organic Doritos (February 2017) – Two years ago, we asked Frito-Lay to go organic and over 20k of you signed this petition. Organic Doritos still contain “natural flavors”, so although I won’t be eating them, I am super excited that the industry is creating more organic products and heading in the RIGHT direction.\n\nEarth Fare removes GMOs from store-brand products (February 2017) -They transitioned more than 500 products to non-GMO and are launching hundreds more.\n\nIn-N-Out Burger nixes cottonseed oil in some locations (February 2017) – The Food Babe Army called out In-N-Out for using cottonseed oil last year and this post was shared thousands of times because of you. They have since replaced cottonseed oil with non-GMO sunflower oil in some locations.\n\nBojangles’ Chicken & Biscuits is stopping routine antibiotics (February 2017) -Thousands of you signed this petition asking Bojangles’ to disclose their ingredients and stop using chicken raised on routine antibiotics. I joined arms with consumer advocacy group U.S. PIRG to deliver our combined petition signatures totaling more that 12,000 to Bojangles’ headquarters in Charlotte. The following day, they sent us an email and told the press that “tremendous progress is being made toward eliminating their use of antibiotics important to human medicine by 2020.”\n\nA whistleblower inspired by our petition contacted us and we were able to publish never before disclosed ingredients for Bojangles here.\n\nNestle commits to dropping artificial colors (March 2017) – They announced plans to remove artificial food dyes from all their products (not just candy) by 2020.\n\nChipotle becomes the first national restaurant chain with no added colors, flavors, or preservatives (March 2017) – They have really come a long way since I first wrote about them in 2012.\n\nPapa John’s begins testing organic ingredients (April 2017) – Back in 2014 when I first investigated pizza chains, Papa John’s was VERY secretive about their ingredients and used some very controversial additives. Since this investigation went viral – Papa John’s has removed some of these additives and started sourcing antibiotic-free chicken for their pizzas. They also published ingredients on their website (although it is not entirely complete). And now they’re testing organic ingredients! Let’s keep pushing them to go organic all the way – their cheese and meat should be a top priority.\n\nKFC finally moves to eliminate antibiotics (April 2017) – KFC commits to eliminating antibiotics important to human medicine from its chicken by the end of 2018. Given that they’re such a huge chain, this will make a big impact! KFC would not have taken this action if it wasn’t for the hard work of fellow activists at the NRDC (Natural Resources Defense Council), U.S. PIRG, Food Animal Concerns Trust (FACT), Center for Science in the Public Interest (CSPI), Consumers Union, and the Food Babe Army, who have been asking them to make this change.\n\nFazoli’s restaurants removes synthetic additives from all their food (April 2017) – Say bye-bye to artificial food dyes, nitrates, artificial sweeteners, sodium benzoate – and all the other 81 artificial additives that Fazoli’s got rid of. They completed this move in April at all of their ~220 locations.\n\nNew food label launched to help you avoid glyphosate weedkiller in your food (April 2017) – I’m so excited about the new Glyphosate Residue Free label by my partner The Detox Project. In 2016, tests found glyphosate in many popular American foods…Cheerios, Stacy’s Pita Chips, Ritz Crackers… even some products that are organic and non-GMO! My reporting on this was my most shared post of 2016, with millions of views. It struck a chord with so many of you and for good reason. That’s why this new food label is a real game-changer!\n\nBaskin Robbins and Dunkin Donuts move to ditch artificial colors (May 2017) – All those brightly colored donuts and ice creams may not be healthy, but at least they no longer will contain artificial colors derived from petroleum like Yellow #5 and Red #40 which are linked to hyperactivity in children, cancer, and other health problems. Both brands will remove artificial dyes by the end of 2018.\n\nCaribou Coffee eliminates caramel color, artificial colors, flavors, high fructose corn syrup from their brand (May 2017) We called out Starbucks for the use of caramel color and synthetic additives in their drinks and our reporting went viral, causing them to change… and now other big coffee companies are cleaning up their act too.\n\nCalifornia to slap warning labels on Roundup weedkiller as a substance known to cause cancer (July 2017) – Following the ruling by the WHO International Agency for Research on Cancer (IARC) that glyphosate is probably carcinogenic to humans, California added it to added to California’s list of chemicals that can cause cancer. This is the active ingredient in the world’s most popular herbicide Roundup. Hopefully this warning label brings more awareness and that Roundup becomes ancient history!\n\nCampbell’s leaves the biggest food industry lobby group – the Grocery Manufacturer’s Association (July 2017) – Campbell’s CEO said the move was “not financial” but rather “driven by purpose and principles”. She also said they want to be “the leading health and well-being food company” who provides transparency to their customers. The Grocery Manufacturers Association, is guilty of spending millions of dollars fighting GMO labeling campaigns and lobbies for policies that support junk food brands who fill their foods with artificial additives. Looks like their actions are starting to bite them!\n\nGlyphosate weedkiller found in Ben & Jerry’s Ice Cream samples (July 2017) This may not sound like a win… but in a way it is. This campaign by the Organic Consumer’s Association has raised massive public awareness about how out of control the use of Roundup has gotten and how it is contaminating popular foods that millions eat every day.\n\nTarget ditches artificial additives from their line of foods aimed at children. (August 2017) – They’ll be free of artificial flavors, artificial preservatives, artificial sweeteners, artificial food dyes, and high fructose corn syrup by the end of 2018.\n\nTriscuits get Non-GMO Project verified (August 2017) – This just goes to show that the demand for non-GMO food is mainstream.\n\nHy-Vee grocery stores start to eliminate more than 200 artificial additives and synthetic chemicals (August 2017) – They’re removing ingredients like high-fructose corn syrup, artificial flavors and colors and partially hydrogenated oils from their store-brand products. The move should be completed by July of next year.\n\nMcDonald’s moves to limit antibiotic use in their beef and pork (August 2017) – As the biggest purchaser of beef in this country, this is huge! However, they have yet to set a timeline.\n\nMonsanto is EXPOSED in groundbreaking book Whitewash (October 2017) – Carey Gillam wrote this brave book about Monsanto and the dirty tricks they play in an attempt to keep Roundup weedkiller on the market, despite all the threats it poses to our health and environment. Just as Rachel Carson started the environmental revolution which led to getting the dangerous pesticide DDT banned over 40 years ago, I believe Carey’s book will have the same impact on our world. Pick up a copy here.\n\nNestle and Dean Foods join Campbell’s in leaving the Grocery Manufacturer’s Association (October 2017) – Big brands are leaving this corrupt organization in droves!\n\nGeneral Mills cuts artificial flavors and colors from baking products (November 2017) – Let’s take this headline with a grain of salt, as General Mills went back on their word and started selling Trix with artificial colors again this year (after they had removed them with big fanfare last year). We really can’t trust Big Food to keep their promises.\n\nWhich brings me to my next point… Last, but not least…\n\nI launched my own product line, Truvani in November! Check out the trailer video below:\n\nSince our official launch, I cannot believe all the incredible thoughtful messages from you Food Babe Army – your support means the world to me! I can’t thank you enough for having such profound faith in me to see this through.\n\nMany people have asked… why did it take you so long?\n\nThe reality of starting your own product line is that it’s expensive. We thought about raising outside capital to fund the creation of Truvani. But, outside money comes with outside expectations that put profits over people. At our core, we believe in real food without added chemicals, products without toxins, labels without lies, and we never want outside money to try and “dictate” what we include in our products.\n\nSo, our path was clear. Instead of raising outside money, we knew we could accomplish the same effect by pre-selling our first product, the Truvani Daily Turmeric Supplement. This is expected to begin shipping in February 2018. We are starting with turmeric because it is something I personally wanted to consume immediately – but we plan to create a wide variety of products. The vision for Truvani is extensive and we have several new products in development right now!\n\nWe’ve accomplished so much in such a short period of time. This is the next step and your continued support will help!\n\nHere’s to an INCREDIBLE 2018! I know it will be our best year yet. Onward!", "opengraph": {"locale": "en_US", "type": "article", "title": "Food Revolution Wins in 2017... What Happened and What's Next", "description": "This year has been LIFE CHANGING and full of adventures and surprises. Two big developments happened in 2017, in case you missed it… #1 – First and foremost in my heart, I became a mom. Harley was born in January and being her mom has brought me the greatest joy I’ve ever experienced. My biggest hope … Read More", "url": "https://foodbabe.com/food-revolution-wins-2017-happened-whats-next/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2017-12-27T16:54:11+00:00", "article:modified_time": "2018-01-30T03:18:53+00:00", "image": "https://foodbabe.com/app/uploads/2017/12/winning-2017.jpg", "image:width": "640", "image:height": "365", "image:type": "image/jpeg"}, "tags": ["2017", "Nestle", "fazoli's", "Target", "General Mills", "caribou coffee", "organic", "Hy-Vee", "chipotle", "whitewash", "roundup", "Ben & Jerry's", "baskin Robbins", "girl scouts", "bojangles", "companies changing", "Organic Doritos", "KFC", "girl scout cookies", "Monsanto", "in-n-out", "year end review", "Dunkin Donuts", "recap", "Papa John's", "glyphosate", "earth fare", "Campbell's", "truvani"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300", "height": "150", "embed_code": "<iframe loading=\"lazy\" class=\"embed-responsive-item\" src=\"https://www.youtube.com/embed/1z66Y6APGfA?l=0&amp;modestbranding=1&amp;autohide=1&amp;showinfo=0&amp;controls=0&amp;rel=0\" width=\"300\" height=\"150\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><br/></iframe>", "src": "https://www.youtube.com/embed/1z66Y6APGfA?l=0&modestbranding=1&autohide=1&showinfo=0&controls=0&rel=0"}], "links": ["https://foodbabe.com/app/uploads/2017/11/Turmeric_tablescape.jpg", "http://www.littlebrowniebakers.com/products/girlscoutsmores/", "http://www.littlebrowniebakers.com/media/filebrowser/lbb_smore_faqs_012017.pdf", "https://foodbabe.com/dissecting-thin-mint-girl-scout-cookies-isnt-pretty/", "https://www.facebook.com/thefoodbabe/photos/a.208386335862752.56063.132535093447877/1449253791775994/?type=3&theater", "https://foodbabe.com/frito-lay-organic/", "http://www.theshelbyreport.com/2017/02/20/earth-fare-removes-gm-ingredients/", "https://www.facebook.com/thefoodbabe/photos/a.208386335862752.56063.132535093447877/1461506337217406/?type=3&theater", "https://foodbabe.com/dissecting-in-n-out-burger-gross-or-healthy-you-decide/", "http://www.charlotteobserver.com/news/business/biz-columns-blogs/whats-in-store/article134264309.html", "https://foodbabe.com/bojangles/", "https://www.facebook.com/thefoodbabe/videos/1458315977536442/", "http://www.charlotteobserver.com/news/business/biz-columns-blogs/whats-in-store/article134264309.html", "https://foodbabe.com/bojangles-chicken-n-biscuits-whistleblower-sends-us-never-released-ingredients/", "https://www.instagram.com/p/BQx6NZSjkFx/", "<Macro 'profile_link'>", "http://www.nestle.com/csv/individuals-families/natural-ingredients", "http://www.nestle.com/csv/individuals-families/natural-ingredients", "http://www.foxnews.com/food-drink/2017/03/29/chipotle-removes-artificial-ingredients-preservatives-from-entire-menu.html", "https://foodbabe.com/a-food-babe-investigates-win-chipotle-posts-ingredients/", "http://fortune.com/2017/04/04/papa-johns-pizza-organic-gluten-free/", "https://foodbabe.com/if-youve-ever-eaten-pizza-before-this-will-blow-your-mind/", "http://www.reuters.com/article/us-yumbrands-kfc-antibiotics-exclusive-idUSKBN1790EE", "https://finance.yahoo.com/news/fazolis-announces-removal-artificial-sweeteners-142600734.html", "https://foodbabe.com/this-new-label-on-food-will-keep-you-from-getting-poisoned-by-monsantos-weedkiller/", "https://foodbabe.com/this-new-label-on-food-will-keep-you-from-getting-poisoned-by-monsantos-weedkiller/", "https://foodbabe.com/monsanto/", "https://consumerist.com/2017/03/02/dunkin-donuts-baskin-robbins-to-eliminate-artificial-colors-from-products-by-2018/", "https://consumerist.com/2017/03/13/caribou-coffee-ditching-artificial-ingredients-from-beverages/", "https://foodbabe.com/starbucks-pumpkin-spice-latte/", "https://foodbabe.com/youll-never-guess-starbucks-just-announced-hint-made-happen/", "http://sanfrancisco.cbslocal.com/2017/07/07/california-glyphosate-monsanto-cancer-causing-fda-crops/", "http://www.iarc.fr/en/media-centre/iarcnews/pdf/MonographVolume112.pdf", "https://oehha.ca.gov/proposition-65/crnr/glyphosate-listed-effective-july-7-2017-known-state-california-cause-cancer#_ftnref3", "https://www.marketwatch.com/story/campbell-soup-to-withdraw-from-food-industry-group-by-year-end-2017-07-19", "https://www.facebook.com/thefoodbabe/posts/1632003193501052", "https://www.organicconsumers.org/press/ben-jerry%E2%80%99s-ice-cream-tests-positive-roundup-herbicide-ingredient-glyphosate", "https://www.bakeryandsnacks.com/Article/2017/08/16/Target-pledges-zero-artificial-ingredients-for-brands-aimed-at-kids", "http://markets.businessinsider.com/news/stocks/Triscuit-Announces-Non-GMO-Project-Verification-Across-Entire-Portfolio-1002237201", "http://www.supermarketnews.com/private-label/hy-vee-cleaning-store-brand-products", "http://www.chicagotribune.com/business/ct-mcdonalds-antibiotics-0824-biz-20170823-story.html", "https://foodbabe.com/whitewash-book-get-monsantos-roundup-glyphosate-banned-forever/", "http://amzn.to/2xuL0Uh", "https://www.politico.com/story/2017/11/26/food-lobby-consumer-tastes-washington-190528", "https://usrtk.org/hall-of-shame/grocery-manufacturers-association/", "https://www.fooddive.com/news/general-mills-cuts-artificial-flavors-and-colors-from-its-baking-products/511915/", "https://www.facebook.com/thefoodbabe/photos/a.208386335862752.56063.132535093447877/1696483110386393/?type=3&theater", "http://www.startribune.com/general-mills-to-remove-artificial-colors-flavors-from-cereals/309001751/", "https://foodbabe.com/the-food-industry-needs-to-stop-treating-us-like-a-bunch-of-idiots/", "https://www.truvanihealth.com/", "https://www.truvanihealth.com/preordertruvani/", "https://foodbabe.com/take-daily-organic-turmeric-supplement/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2017-12-27T16:54:11+00:00"}