{"result_id": "116018", "URL": "https://foodbabe.com/this-drug-has-sickened-thousands-of-animals-will-it-be-at-your-holiday-feast/", "timestamp": "2023-04-25 15:06:30 CEST+0200", "meta": {"description": "This Drug Has Sickened Thousands of Animals - Will It Be At Your Holiday Feast?", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/this-drug-has-sickened-thousands-of-animals-will-it-be-at-your-holiday-feast/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "This Drug Has Sickened Thousands of Animals - Will It Be At Your Holiday Feast?", "cleaned_text": "I have been to countless holiday meals when I had no control over the ingredients. Of course, I ate what was offered and was polite but knowing what I know now about what’s really in food – it’s hard for me to just shut up and take it. The more we shut up and take it, the more disgusting things like what I am about to share with you continue to happen. That’s why I am sharing these important facts about how to avoid drugged up turkeys this holiday season.\n\nI know it’s tempting this time of year when you get coupons from the grocery store offering a whole turkey for FREE in exchange for shopping in their store. These “FREE” store-brand turkeys generally aren’t free of antibiotics and are raised on a diet of GMOs. Most conventionally raised (non-organic) turkeys are pumped full of antibiotics, and this overuse of antibiotics is creating a major human health issue. Thankfully, because so many of us have raised concerns, including government agencies like the CDC, meat companies are beginning to transition away from using antibiotics. Hopefully in a few years the abusive use of unnecessary growth-promoting antibiotics will be a thing of the past!\n\nBut, there’s something else that deserves your full attention.\n\nThere is another drug that is permitted to be fed to turkeys in the U.S. that is banned in dozens of countries due to health issues. You won’t find it on the label, it’s been shown to leave residues in the meat, and the meat companies are not required to tell you whether they use it.\n\nI’m talking about Topmax (otherwise known as Ractopamine).\n\nRactopamine is a growth enhancing drug that’s fed to some turkeys to increase their muscle mass. Basically, it’s used to make big turkeys look perfect for a big Holiday feast. We’ve been conditioned to think that “bigger is better” – but when it comes to turkey, its not!\n\nThis drug has been shown to cause horrible health problems (and even the death of) animals, as can be witnessed by it’s rampant use on pigs during the last decade. As reported by NBC News, “Since it was introduced, ractopamine had sickened or killed more than 218,000 pigs as of March 2011, more than any other animal drug on the market, a review of FDA veterinary records shows. Pigs suffered from hyperactivity, trembling, broken limbs, inability to walk and death, according to FDA reports released under a Freedom of Information Act request.”\n\nIt’s fed to some conventional turkeys, and we might be eating it too.\n\nResidues of ractopamine have been found in meat samples tested by the USDA and Consumer Reports. This is because there’s no mandatory withdrawal period for the drug, which can be fed to turkeys right up until the day they are slaughtered. The FDA established some “safe maximum residue limits” (MRLs) for ractopamine residue, so they are allowing some of this residue to remain in the meat sold at the store. Most meat is never tested for ractopamine residues, so it’s anyone’s guess how much we are really eating. That’s frightening, considering that ractopamine carries a bold warning label that states:\n\nWhy is this permitted?\n\nThe FDA has allowed widespread use of ractopamine in turkey feed since its approval in 2008. This led the Animal Legal Defense Fund and the Center For Food Safety to file a legal petition with FDA demanding that they conduct comprehensive scientific studies that document the risks of ractopamine to human and animal health – because clearly more needed to be done before it gained FDA approval. The FDA approved ractopamine based on safety studies submitted by the company that makes it (Elanco), which is standard for most food and drugs on the market, and have reportedly refused to share their records. To date, ractopamine is still allowed to be fed to turkeys, cows, and pigs (up to 80% of pigs eat ractopamine-laced feed).\n\nOther countries don’t take the use of ractopamine so lightly. For instance, China and Taiwan prohibit any traces of ractopamine residue in meat, and have rejected some U.S. exports. Also any meat exported to the European Union needs to be certified as ractopamine-free or it will be rejected.\n\nHow To Avoid Ractopamine Treated Turkey In The U.S.:\n\nMy team contacted several major turkey companies, most don’t use this drug, however, some admitted to us that they use ractopamine.\n\nJennie-O’s – Their customer service agent told us over the phone that it’s not routinely used and only used on a limited basis if necessary — whatever that means, because ractopamine is not a “necessary” drug used to treat disease. Jennie-O indicated that there would be no way of knowing at the store if their turkeys were fed ractopamine because it’s not labeled or otherwise indicated.\n\nAccording to Safeway Grocery Stores – “Ractopamine is a growth promotant that can be feed to turkeys so our Safeway Farms turkey may or may not have the promotant in their feed. To guarantee that growth promotant was not part of the diet, please choose our Open Nature or O Organics brands which do not allow growth promotants.”\n\nAccording to Kroger Grocery Stores – “Thank you for contacting Kroger regarding Kroger and Simple Truth whole turkey… This question has been researched with our Corporate Food Technology Department and our suppliers. The Kroger and Private Selection Turkey could have used ractopamine in production. The Simple Truth Organic turkey does not use it”.\n\nAs these companies aren’t required to disclose whether ractopamine is used, and their claims are not third-party certified, it’s difficult to confirm its use. Even turkeys that are labeled “No Hormones Added” or “Raised Without Hormones” may have still been fed ractopamine to promote growth (because it is not a hormone), so don’t be fooled by this label. Growth hormones aren’t allowed to be used in raising poultry, so this label is meaningless and used as a marketing trick when labeled on turkeys (such as Butterball).\n\nThe best way to make sure that you’re avoiding ractopamine is to only choose certified organic turkey.\n\nRactopamine, along with antibiotics and GMOs, are prohibited in organic farming.\n\nIf you’re ordering an organic turkey make sure you put your order in early, as supply goes fast and it may be hard to find the week before a holiday. Below are a few ways to order:\n• None Order an organic turkey from a local farmer or farmer’s market.\n• None Head to a specialty grocer such as Whole Foods or Earth Fare.\n• None Order your turkey from an organic online supplier\n\nEven if you have to order one now and freeze it and thaw it out later, it is better than consuming this nasty growth-enhancing drug during the holiday season!\n\nIf you know someone buying a turkey, please share this post with them – the more people know, the less this nasty ingredient will be used!\n\nP.S. This information could hold true for some of the turkey meat on supermarket shelves or served at restaurants – even cold cuts, so beware!", "opengraph": {"locale": "en_US", "type": "article", "title": "This Drug Has Sickened Thousands of Animals - Will It Be At Your Holiday Feast?", "description": "This Drug Has Sickened Thousands of Animals - Will It Be At Your Holiday Feast?", "url": "https://foodbabe.com/this-drug-has-sickened-thousands-of-animals-will-it-be-at-your-holiday-feast/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2014-11-06T19:29:50+00:00", "article:modified_time": "2021-11-01T18:26:22+00:00", "image": "https://foodbabe.com/app/uploads/2014/11/thanksgiving-turkey1.jpg", "image:width": "200", "image:height": "114", "image:type": "image/jpeg"}, "tags": ["Ractopamine", "Turkey", "Meat", "Vani Hari", "drug", "growth hormones", "thanksgiving", "drugs", "Antibiotics", "Holiday", "organic", "gmo"], "tweets": [], "movies": [], "links": ["https://foodbabe.com/navigating-a-holiday-party/", "http://www.cdc.gov/drugresistance/threat-report-2013/pdf/ar-threats-2013-508.pdf#page=36", "http://online.wsj.com/articles/meat-companies-go-antibiotics-free-as-more-consumers-demand-it-1415071802", "http://thefern.org/2012/01/dispute-over-drug-in-feed-limiting-u-s-meat-exports/", "http://www.consumerreports.org/cro/magazine/2013/01/what-s-in-that-pork/index.htm", "http://www.foodsafetynews.com/2012/12/fda-petitioned-to-lower-ractopamine-limits-for-meat-review-animal-health-impact/#.VFwLSRbsCfR", "http://www.centerforfoodsafety.org/files/ractopamine_factsheet_02211.pdf", "http://www.federalregister.com/Browse/Document/usa/na/fr/2008/12/1/e8-28384", "http://www.centerforfoodsafety.org/files/fda-petitionractopamine12202012-final-e-signatures_46780.pdf", "http://www.fda.gov/downloads/animalveterinary/products/approvedanimaldrugproducts/foiadrugsummaries/ucm091516.pdf", "http://www.centerforfoodsafety.org/press-releases/2630/public-interest-groups-sue-fda-demanding-records-on-controversial-animal-growth-drugs-under-freedom-of-information-act", "http://www.foodsafetynews.com/2012/12/fda-petitioned-to-lower-ractopamine-limits-for-meat-review-animal-health-impact/#.VFlJSPnF-Sp", "http://thefern.org/2012/01/dispute-over-drug-in-feed-limiting-u-s-meat-exports/", "http://www.cornucopia.org/2013/10/ractopamine-meat-additive-plate-thats-banned-almost-everywhere-america/", "http://www.biologicaldiversity.org/campaigns/toxics_and_endangered_species/pdfs/2014-11-6_Ractopamine_Complaint.pdf", "https://www.dropbox.com/s/b28rbk171iyl00g/HSUS%20v%20%20FDA%20as%20filed.pdf?dl=0", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2014-11-06T19:29:50+00:00"}