{"result_id": "116028", "URL": "https://foodbabe.com/never-pack-childs-lunch-back-school-recipe/", "timestamp": "2023-04-25 15:06:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/never-pack-childs-lunch-back-school-recipe/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Never Pack This In Your Child's Lunch + Back-To-School Recipe", "cleaned_text": "The quality of food served by school lunchrooms across the country is appalling. Although my little one isn’t in school (yet), I am saddened that many school districts feed children hot dogs, greasy pizza, and nachos for lunch. How this has even become acceptable is the subject of a future investigation… but in the meantime, do whatever you can to take control of the situation by packing your own lunches.\n\nPeople who eat homemade food avoid thousands of unnecessary food additives they’d otherwise be exposed to. If your kids are away from home during lunchtime Monday through Friday – that adds up to about 22 lunches a month… or 22 opportunities to choose something healthy and homemade. Think of all the GMOs, preservatives, and other chemicals your children can avoid by packing a lunch.\n\nBut… don’t go down the path of buying all those conveniently packaged “Back To School” snacks and drinks that line the shelves at the grocery store. Not only do they get expensive, but they’re just as unhealthy (maybe worse) than what they serve in school lunchrooms, filled with GMOs and additives to avoid like BHT, TBHQ, artificial colors, flavors, and tons of added sugar…\n\nIt’s especially ridiculous they keep selling products with yellow 5 and red 40 which are linked to hyperactivity in children (requiring a warning label in Europe). How are children expected to pay attention to learn in school after eating food like this?\n\nEven organic packaged foods can be extremely processed and unhealthy without any real nutrition. Take the new Organic Lunchables for example. These might be certified organic, but I’d NEVER buy them…\n\nWhen children grow up eating processed foods regularly, they grow up less likely to crave fresh foods like fruits and veggies. I want to teach my daughter to love all that real food has to offer, the tastes, the textures, and the amazing nutrition that it provides her body – and not trick her tastebuds with processed foods full of added sugar and fake flavors.\n\nWhen my daughter starts going to school, this is the type of REAL FOOD lunch I’ll make for her…\n\nIt’s not complicated or expensive… just a simple wrap, some fresh fruit or veggie sticks, and baked homemade chips.\n\nThe main course in this lunchbox recipe are some fun Hummus Roll-ups that you can put together the evening before so it’s all ready to go in the morning. I like to make my own hummus because most store-bought versions are made with GMOs and inflammatory oils (like canola and soybean) instead of olive oil. This is my go-to hummus recipe. If you buy store-bought hummus, just look for one that is organic and made with olive oil.\n\nTo assemble your Hummus Roll-ups, start out with either an organic sprouted grain or coconut wrap (I like to use wraps by Food For Life, found in the freezer section at most natural food stores). Spread on a couple spoonfuls of hummus and top it with a couple slices of cheese and crunchy romaine lettuce. Thinly slice a cucumber lengthwise and layer it on top…\n\nThen just roll it up tightly and cut into pinwheel slices that are easy for little hands to hold and eat…\n\nInstead of traditional potato chips, try baking up these parsnip chips… They’re healthier, inexpensive, and taste even better than store-bought chips!\n\nAll you do is thinly slice a couple fresh parsnips and spread them out on a baking sheet lined with parchment…\n\nDrizzle them with a touch of coconut or olive oil, sprinkle on some salt and pepper, and bake at 375° for about 10 minutes. Take them out when the edges start to get brown and crispy.\n\nIf you know anyone who would love some back-to-school lunch tips like this, please share this post with them!", "opengraph": {"locale": "en_US", "type": "article", "title": "Never Pack This In Your Child's Lunch + Back-To-School Recipe", "description": "The quality of food served by school lunchrooms across the country is appalling. Although my little one isn’t in school (yet), I am saddened that many school districts feed children hot dogs, greasy pizza, and nachos for lunch. How this has even become acceptable is the subject of a future investigation… but in the meantime, … Read More", "url": "https://foodbabe.com/never-pack-childs-lunch-back-school-recipe/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2017-08-17T15:08:00+00:00", "article:modified_time": "2018-01-05T00:15:30+00:00", "image": "https://foodbabe.com/app/uploads/2017/08/quaker-CHEWY-BARS-GMO.jpg", "image:width": "640", "image:height": "614", "image:type": "image/jpeg"}, "tags": ["highschool", "cheezit", "lunch", "kid", "kids", "organic lunchables", "UKonserve", "school lunch", "middle school", "Fruit By The Foot", "elementary school", "lunchables", "school", "Children", "lunchbox", "gatorade", "lunches", "high school", "Welch's", "Motts Apple Sauce", "child", "back to school", "kid-friendly", "packing", "Quaker Chewy Bars", "fruit snacks", "Little Debbie", "pack lunch"], "tweets": [], "movies": [], "links": ["https://foodbabe.com/hummus-mezze-plate/", "https://foodbabe.com/easyrecipe-print/29196-0/", "https://foodbabe.com/easyrecipe-print/29196-1/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2017-08-17T15:08:00+00:00"}