{"result_id": "116002", "URL": "https://foodbabe.com/is-butter-secretly-ruining-your-health/", "timestamp": "2023-04-25 15:06:12 CEST+0200", "meta": {"description": "Is Butter Secretly Ruining Your Health? Here's a look at what's really going on and how to choose the healthiest butter for you and your family.", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/is-butter-secretly-ruining-your-health/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Is Butter Secretly Ruining Your Health?", "cleaned_text": "Growing up, butter was an absolute staple in my household. We thankfully never got into the margarine craze because my mother believed that butter was good for the brain. Turns out, she was right about that and scientists have now concluded that butter is actually good for you in other areas too. It’s high in a compound call CLA that protects you from tumor growth and cancer, is not inflammatory like man-made oils from corn, canola or soy, and provides a nice dose of Omega 3 fatty acids, if you get it from the right source. But finding the right source can be tricky given all the buzz words and fancy marketing these days. Choosing the wrong type of butter can secretly ruin your health without you even knowing it! Here’s a look at what’s really going on and how to choose the healthiest butter for you and your family.\n\n***Updated Graphic: Shortly after this blog post was published, Smart Balance announced they would go Non-GMO***\n\nI call conventional butter “Monsanto Butter,” because it comes from cows fed almost entirely genetically engineered or GMO grains and Monsanto is the largest producer of GMOs.\n\nConventionally raised cows are most commonly fed GMO corn and soy, however, some farmers fatten up their feed with additional sugar from GMO sugar beets and cottonseed. Cotton is the most toxic crop because it isn’t treated as a food crop but as a textile (it has less regulation.) And then conventional dairy cow feed is sometimes fortified with additional protein, Omega 3 fatty acids and CLA from GMO rapeseed (canola) because the cows are not getting these nutrients naturally from the grass. GMO alfalfa hay is also commonly fed to cows. So basically, conventionally raised cows are almost entirely getting their food from GMOs – food that was created in a laboratory, that hasn’t been tested long term, but has produced horrific results in several alarming animals studies.\n\nOver 49% of all GMO corn is fed to animals or livestock. Only 2% of the GMO soybeans grown are actually fed to humans, the other 98% get fed to animals. Those figures are pretty scary once you consider the astronomical amounts of herbicides being sprayed on these GMO crops and what they are doing to the increase cancer rates, harm the environment and ourselves.\n\nLand O’ Lakes was a staple in my household growing up. We’d use the whipped butter like it was nobody’s business – my mom would use it on her infamous parathas (Indian stuffed flat bread), in countless desserts and to make homemade ghee. Once I found out what was really happening at Land O’Lakes, my Mom and I had a little chat. I explained to her that Land O’Lakes is owned by a pro-GMO company called Dean Foods. Land O’Lakes co-developed genetically engineered alfalfa, directly contributing to the GMO animal feed supply. I also explained that Land O’Lakes contributed nearly $100,000 to the “No on I-522 Lobby” – the bill to label GMOs in Washington State. This is all on top of the fact that Land O’Lakes is not organic, raises their cows with growth hormones linked to cancer, antibiotics and harmful pesticide ridden GMO feed. I told my Mom she has to stop buying Land O’Lakes if we are going to change this world!\n\nKnowing all these facts, plus the health risks of consuming GMOs, my Mom finally asked “what butter can I buy?” Well there are many brands out there that are light years ahead of Land O’Lakes. Here’s a Butter Buying Guide that will help you (and my Mama) navigate the butter aisle next time you hit the market:\n\nHow to Choose The Most Nutritious Butter\n• Organic – First and foremost, look for organic butter. This will ensure there are no growth hormones, antibiotics, harmful pesticides and GMOs being fed to the cows. Growth hormone or rbGH that is used to raise cows conventionally is linked to cancer and often accumulates in highest concentration in animal fat. One organic brand I’m suspicious of however, is Horizon, they are owned by Dean Foods (the same company that owns Land O’Lakes). The Cornucopia Institute has filed complaints for labeling their product organic while maintaining factory farm production methods. I won’t buy Horizon organic for that reason.\n• Grass-fed – Grass-fed or pastured raised cows are going to be more nutritious than cows raised with grains. Remember, the highest amounts of the most beneficial CLA and Omega 3 fatty acids naturally come from grass-fed cows. Also grass-fed cows produce butter with 50 percent more vitamin A and E and 400 percent more beta carotene (which gives the grass-fed butter a deeper yellow color).\n• Ghee – Ghee is clarified butter where all the proteins, milk solids and lactose is removed. This makes the butter more digestible, concentrated with nutrients and really great for immunity building. Ghee does not need to be refrigerated, it can stay on the counter for a few months without going bad. People with dairy allergies or sensitives often do ok consuming this type of butter. Pure Indian Foods, Purity Farms and Ancient Organics have the best offerings in that they are both high quality, organic and grass-fed.\n• In an ideal world, you would be able to find butter that is both organic, grass-fed and no additives like Organic Valley (in the green foil wrapper) , but sometimes that’s just not the case. In that circumstance, I would go for either an organic butter or grass-fed butter like Kerrygold (please note – Kerrygold uses some grains that could be GMOs a couple of months out of the year because grass doesn’t grow year round in Ireland – they admit that 3% of their feed could contain GMOs). Choosing regular organic butter will lessen your exposure to pesticides but will also provide less nutrition since the cows will mostly be fed organic grains vs. grass. Regardless, these choices are superior choices over conventional butter and both options (in light green on the chart above) will lessen your exposure to GMOs.\n• Beware of butter mixes with labels like “with olive oil” – 9 times out of 10, these butters will have one or more GMO ingredients like soybean, corn or canola oil. These mixes may have questionable additives in them too – check the ingredient list just to be sure!\n• Don’t Eat Butter? Here are some Vegan Substitutes – If you are vegan, skip all the “butter like” or fake butter spreads like Smart Balance that contain GMO oils, artificial ingredients made from petroleum and unnecessary preservatives. Instead, choose 100% coconut oil, olive oil, red palm oil (that is sustainably harvested from Ecuador and does not hurt the rainforest) or hemp oil instead. Also coconut manna, or butter works well too, when slightly heated it spreads just like butter. (These are also much healthier than organic spreads like Earth Balance that are usually a combo of inflammation causing oils).\n\nSharing the truth is the first step in changing the food system. If you know someone who is buying Monsanto butter, please share this information with them. Our choices can really change the marketplace, make us healthier and change companies decisions to use these unhealthy ingredients.", "opengraph": {"locale": "en_US", "type": "article", "title": "Is Butter Secretly Ruining Your Health?", "description": "Is Butter Secretly Ruining Your Health? Here's a look at what's really going on and how to choose the healthiest butter for you and your family.", "url": "https://foodbabe.com/is-butter-secretly-ruining-your-health/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2014-01-20T17:04:19+00:00", "article:modified_time": "2020-10-17T01:09:02+00:00", "image": "https://foodbabe.com/app/uploads/2014/01/Slide21-1.jpg", "image:width": "640", "image:height": "480", "image:type": "image/jpeg"}, "tags": ["dairy", "genetically engineered", "GMOs", "healthiest butter", "Monsanto", "butter", "cows", "butter substitutes", "vegan butter"], "tweets": [], "movies": [], "links": ["http://onlinelibrary.wiley.com/doi/10.1111/j.1753-4887.1995.tb01525.x/abstract", "http://beef.msu.edu/Resources/Nutrition/FeedingCarrotsorSugarBeetstoCattle/tabid/598/Default.aspx", "https://d3n8a8pro7vhmx.cloudfront.net/prop37/pages/67/attachments/original/1348032282/Peer_reviewed_studies_on_GM_food_health_risks.pdf?1348032282", "http://gmoinside.org/gmos-in-animal-feed/", "http://www.motherjones.com/tom-philpott/2012/10/how-gmos-ramped-us-pesticide-use", "http://gmoinside.org/take-action/tell-dean-foods-use-non-gmo-feed-cows/", "https://foodbabe.com/app/uploads/2014/01/Slide21.jpg", "http://gmoinside.org/take-action/tell-dean-foods-use-non-gmo-feed-cows/", "http://www.cornucopia.org/dairysurvey/FarmID_134.html", "http://www.cornucopia.org/dairysurvey/FarmID_134.html", "http://www.cornucopia.org/horizon-factory-farm-photo-gallery/horizon-factory-farm-photos/", "http://amzn.to/SnD1dI", "http://amzn.to/1dKCO0e", "http://amzn.to/1e4GfLv", "http://www.organicvalley.coop/products/butter/pasture/", "https://amzn.to/2NnI1UP", "https://amzn.to/2wIW90G", "https://amzn.to/2wOvBf9", "https://amzn.to/2MU4RUP", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2014-01-20T17:04:19+00:00"}