{"result_id": "116030", "URL": "https://foodbabe.com/birth-story-little-angel/comment-page-1/", "timestamp": "2023-04-25 15:06:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/birth-story-little-angel/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "My Birth Story. Our Little Angel Is Here!", "cleaned_text": "Our little angel is here and we are so crazy in love. Meet Harley Diane, 6.5 pounds and 20 inches. Every time I look at her, my heart feels like it is going to explode! This is my birth story…\n\nI prepared right from the start for a natural child birth\n\nWhen I became pregnant back in April 2016, I knew right away I wanted to have a natural birth and my commitment became even stronger after talking to several experts, reading many books about child birth, taking a natural birth course and talking to my doctor & doula about the risks associated with some interventions and drugs. Hearing all my friends and family’s birth stories, as well as reading and watching many online, there was one big common theme – there are no two births that are the same and things don’t always go as planned! So I decided to go into all of this with a very easy going attitude and not get too worked up if things did not turn out the way I expected them to go. I said to myself “whatever happens, happens, as long as I have a healthy baby at the end, nothing else matters.” And I also repeated the mantra “My body was designed to do this” to prime my brain to stay focused on the goal.\n\nOne of the biggest reasons I wanted a natural birth was because I know how my body reacts to foreign substances and pharmaceutical drugs – I don’t feel good after taking them and often feel the bad side effects for weeks. Not only did I not want those substances to get to my newborn baby, but I wanted to have the fastest recovery possible after birth. I also have undergone two different abdominal surgeries in my lifetime and know the recovery is not for the faint of heart. These experiences have given me a very strong conviction to do what I can in my power to avoid medical interventions. Feeling the way I do now – a week later – I know I made the right decision for me to focus on a natural birth. I remain in awe that everything worked out the way I envisioned it to.\n\nI thought I would deliver early… but no!\n\nThe month leading up to the birth, I started to get Braxton Hicks contractions and at first they didn’t hurt at all, and then suddenly on Christmas Eve (38 weeks) they began to hurt. The entire day on Christmas Eve, I was having contractions and even contracting at my brother’s Christmas Eve party that evening. It was nothing too painful at this point, but I for sure thought I would have a Christmas baby (and my family thought so too!). A doctor friend at the party even wanted me to go to the hospital to get checked but I didn’t go and eventually on Christmas Day all the contractions fizzled out.\n\nWhen you hit your due date everyone in the world starts calling and texting you, wondering when you are going to give birth. This can be stressful if you let it… but after she didn’t come early during the holiday break, I became super patient leading up to her birthday. “Babies are born on their birthdays” is one of my affirmation cards that I read every night and this kept me focused on taking care of myself, staying calm and relaxed before birth, knowing that my baby would arrive when she was ready. The extra week, gave me time to continue organizing closets and cabinets throughout the house – which I am so glad to have done now!\n\nThe week leading up to the birth…\n\nI have been using acupuncture for years as preventative medicine, but when I became pregnant, I started to go to acupuncture almost every week. Not only did this help my pregnancy symptoms (just ask my best friend, who said I never complained during my pregnancy!) but it primed my body for the best birth possible. When I hit 39.5 weeks, I had 3 acupuncture treatments over the course of one week to get my body ready for big day. Acupuncture can help start labor if your baby is ready! After these treatments, I started a type of early labor on Tuesday and Wednesday – both nights I woke up at around 3am with painful contractions that hit every 20 mins or so but would tinker on and off throughout the day.\n\nOn Thursday, the day before 41 weeks, I saw my doctor and we did a quick safety ultrasound check just to make sure I still had enough amniotic fluid and to see if the baby was doing well in there. As long as everything looked good, she was going to just let me keep going in my late pregnancy until the baby was ready. This was very exciting – I hadn’t seen my baby for over 24 weeks! Everything turned out perfectly! She also checked my cervix and reported that I was 3 cm dilated and 75% effaced, all that early labor was working! This put me at so much ease and I was relaxed enough to go to the Bechtler Museum of Modern Art that afternoon (even though I was still contracting!) to walk around and keep my body moving. We bought the baby an art book to remember the moment and eventually my contractions fizzled out again to relax a bit for dinner.\n\n41 weeks pregnant! Last belly shot before the hospital…\n\nAfter 2 nights of no sleep, I finally went into REAL labor late Thursday night – actually at about 2:30am Friday morning. The contractions had sped up significantly to every 8-10 minutes all night long. At about 5:30am I texted my doula and she wanted me to keep her posted on progress and we kept in touch throughout the morning. I labored at home finding any position to get me through – hands and knees and bending over with my arms on a wall were the best positions. At around noon, I knew it was time for my doula to come over, it was getting intense and I was having contractions every 5 minutes.\n\nFor those of you who have never given birth or experienced contractions, it feels like the worst stomach cramp you have ever experienced, and like a wave of sensation with a strong peak that you absolutely have to breathe to get through if you want to be able to handle the pain. It takes all of your focus and concentration during the contraction just to get to the next one. The key is to relax in between the contractions as much as possible so you can get through the next one.\n\nIs it time to go to the hospital yet?\n\nI had been in my bedroom all morning by the time my doula arrived. She got me up out of bed and said “take me on a tour of your house” and so we went through and walked my entire house – going up and down the stairs in my house, I contracted on each wall! I had to hold on to her or the wall and bend down for every contraction. After the tour, I thought it would be a good time to eat something, my doula suggested soup and my husband warmed me up some butternut squash soup I had made for our freezer meals after the baby was born. I ate that with some crackers and water. It was so good! I was starving! Then it was finally time for the tub. This was my doula’s “last resort” before getting to the hospital, getting from the stage of early labor to active labor so I would not be in the hospital for too long before giving birth.\n\nAccording to many natural birth experts, if you get to the hospital too early, there is more time for interventions, so the key is to get there at just the right time to avoid that. My doula was very experienced in knowing when to go and without her, I probably would have left earlier… my husband was definitely getting antsy and a bit nervous at this point!\n\nI had a ginger blackberry popsicle in the bath – it was delicious, but I couldn’t finish it – the contractions were coming too strong! The bath helped me get through them until about 5:00pm, and then I started feeling an intense amount of pelvic pressure that made me want to push.\n\nWhen my doula witnessed this, she knew it was time to head to the hospital. My husband put the last minute things in the car, handed me my labor robe and nightgown to wear and walked me down the stairs to the car. I was worried about the car ride to the hospital, because even though we were close to the hospital, I was contracting every two minutes. I didn’t want to get out of the bath either because it was such an amazing feeling and the soothing warmth of the water was helping so much with the intense contractions.\n\nWe arrived at the hospital at 5:30pm…\n\nOnce I got to the hospital, I completed a cervical exam (my least favorite thing to do while being pregnant!) – I was at 6 cm and a midwife had to double check it because they thought I had broke my water already too. My doula and I were stunned that they said that I broke it because I didn’t feel anything at all! That same day, I had lost my mucus plug however, which I had been looking forward to seeing as a sign of labor. It was one of those things I was looking for every time I used the bathroom but never found prior to that day. As soon as we got settled into the delivery room, one of my first contractions broke my water. It was the loudest pop I’d ever heard inside my body and it brought on a flood of emotions (no pun intended!). It still baffles me that they thought I had already broke it!\n\nMy doula whispered to me, things are about to speed up, so let’s get the tub ready. The tub in the delivery room had these magical massaging jets that I didn’t have at home and I was really excited about that. My contractions were coming really fast and very hard in the tub. So hard that the jets no longer felt good and after a few minutes, I begged and screamed to turn the jets off. It got so hot, I thought I was going to melt. Thank goodness for the cooler of coconut water my husband brought to the delivery room – I think I drank about 4 bottles within just a few hours. And this whole time, my sweet nurse was trying to monitor the baby’s heart beat which for some reason really made me uncomfortable, the tiny bit of pressure from the hand held doppler on my pelvis was driving me nuts!\n\nIn transition, I was loud like an animal!\n\nI screamed like an animal for a couple of hours (my throat hurt so bad the next day – so remember to bring some organic throat drops with you mamas!). Giving birth is such a primal experience, and I never thought I would hear the sounds that would come out of my mouth. I was in full gorilla ape mode! Leading up to my birth, I thought I would be a quiet birther but heck no! Making the animal sounds really helped me get through the intensity.\n\nMy doctor, who is a huge advocate for natural birth and very supportive of my birth plan, arrived at the scene. I was SO HAPPY to see her. I was progressing so fast and when I got out of the tub, I couldn’t believe it – I was fully dilated and ready to push about 8:45pm.\n\nI got back to the delivery bed and tried to find some positions that would be the best to push in. As many mama’s know, laying on your back is not really the most comfortable position during contractions or pushing, and my birth team had some other tricks up their sleeve. It ended up being that a squat bar and laying on my side were what worked best for me. So I used both of those positions throughout my pushing.\n\nAt this point, I had been laboring for about 18 hours and I was tired! But the pain was not that bad, nothing worse than what I had already experienced up until that point.\n\nAt first it took me awhile to get a hang of pushing. I had been breathing heavily through contractions, and my birth team really wanted me to push through contractions while holding my breath – the opposite of what I had been doing all day long! That was difficult for me and really stressed out my body. I felt intense pain on my chest, holding my breath and almost like I was drowning from the lack of oxygen!\n\nI eventually got the hang of it and only pushed for an hour and a half before my daughter was born at 10:11pm.\n\nThe final pushes were really athletic and it took everything in me to focus – I felt the ring of fire, but it wasn’t as bad as I expected. When she finally came out, I heard the doctor do something (but didn’t really know what was happening at the time because I couldn’t believe I just pushed her out…) and then she checked to see if I tore, and said everything looked great – no tears to stitch!\n\nI was so stunned and so in awe when my daughter was born… the sense of accomplishment… the excitement of seeing her for the first time… everything that you dream about. It is so magical and the feeling of relief is so instant that everything you did up until that point becomes a BILLION times worth it!\n\nFor every birth video I had seen since I became pregnant, I cried at the end when the baby was born. Even reading a birth story, I would cry at the end. But when my own baby came, I didn’t cry. I was just so happy and I felt my heart exploding with love! I will never ever be able to equate giving birth to anything else I’ve ever accomplished in my life. It is definitely my greatest achievement and was so thankful everything went as I had hoped.\n\nAfter the birth, we waited until the cord stopped pulsating and my husband cut the cord, I got to spend a lot of time skin to skin with my baby and breastfeeding, but the baby nurse did take her away to weigh her, measure her, clean out her nasal passages and mouth and take a blood sample to test her blood sugar (which in hindsight – I wish I would have waited for). It felt like an eternity those few minutes she was out of my arms!\n\nWe spent about 36 hours more at the hospital before going home…\n\nThe next morning, I really just wanted to take my baby in my arms and say peace out, but I had to stay to monitor my blood pressure that was high after birth. Thankfully it has been treated naturally since leaving the hospital and is back down. They did prescribe me some pharmaceuticals for high blood pressure to take at home before I left (which I didn’t end up taking). I know my body, and knew it would be back to normal in a flash, if I rested and allowed my body recover from the lack of sleep and exhaustion! I also had a wonderful at home acupuncture treatment about 5 days later that worked like a miracle for my blood pressure and sore muscles.\n\nMore details emerge about my birth…\n\nWhen my doula came over for a postpartum visit, I learned that my baby was born with the cord wrapped around her neck, this is what I heard my doctor taking care of, but didn’t see it when she was coming out. My doctor gently looped the cord back over her head before the rest of her body came out, and the cord was long enough that it didn’t pose any danger during the delivery, thank God! It was kinda scary learning about this days later, but it is a really very common thing to happen. It’s amazing that a safe natural birth is still possible in circumstances like this!\n\nHaving strong support is a must!\n\nI know I couldn’t have achieved a natural child birth without the coaching of a doula, a supportive doctor, and a very positive and helpful nurse – I had the A Team for sure! Giving birth is like a marathon. At a marathon, at every water stop along the way, you have people cheering you on with motivational signs and encouraging you to finish. You need the same support while giving birth because there are so many times you think to yourself that you can’t do it or you’re not sure if it is possible or if something will go wrong and you are tired! You need that positive energy in the room to get you through it. There were a few moments during labor where I asked the team “can I do this?” and they would say “yes, you can do this”, and that really motivated me. Taking drugs, however, did not enter my mind once! I credit this to my daily practice of birth affirmation cards leading up to the birth.\n\nI feel incredibly lucky I got to experience natural hospital birth, which I know is not often the case for many.\n\nThere were times when I thought I will never, ever, ever have another child while I was going through the really tough parts of labor (the point where my water broke to the point where I started pushing), but that thought went 100% out the window after meeting my baby and the high that I felt of accomplishing my goal of a natural childbirth. I will take 10 babies please!!!! Mr. Food Babe, are you ready? haha.\n\nA heartfelt thank you to my extended birth team!\n\nI want to thank my magical birth team: my dear husband who was 100% supportive of my decision to go natural and even more incredible now as a new Dad, all of the women in my life that shared their advice, birth stories and wisdom with me, Genevieve from Mama Natural for her amazing birth course and affirmation cards, Megan from Detoxinista, Latham Thomas from Mama Glow, my sister-in-law Judy who has given natural birth twice!, my trainers at Hilliard Studio Method and K.O. Fitness who kept me in tip top shape all the way to 40 weeks, Charlotte OB/GYN, Carolina Medical Center Maternity Center, my doula Melissa Fehr, my acupuncturist and prenatal massage therapist.\n\nI’ll be sharing much more about my pregnancy and motherhood in future posts to come, until then… if you know someone who is pregnant, a mom or wants some inspiration for a natural child birth, please share this post with them and feel free to ask any questions in the comments below! I want to help as many mamas as possible achieve a natural birth, if that is what they want to do.\n\nFollow me on @thefoodbabe over on Instagram for my daily adventures into motherhood!\n\nThank you for all the sweet comments and well wishes you sent this week on social media when I announced our daughter’s birth. I love this community so much and it brings me so much joy to share this very personal story with you.", "opengraph": {"locale": "en_US", "type": "article", "title": "My Birth Story. Our Little Angel Is Here!", "description": "Our little angel is here and we are so crazy in love. Meet Harley Diane, 6.5 pounds and 20 inches. Every time I look at her, my heart feels like it is going to explode! This is my birth story…  I prepared right from the start for a natural child birth When I became pregnant back … Read More", "url": "https://foodbabe.com/birth-story-little-angel/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2017-01-24T14:56:51+00:00", "article:modified_time": "2020-12-19T15:36:43+00:00", "image": "https://foodbabe.com/app/uploads/2017/01/IMG_1968.jpg", "image:width": "640", "image:height": "394", "image:type": "image/jpeg"}, "tags": ["doula", "Food Babe Mama", "mother", "natural birth", "labor", "FoodBabeMama", "mom", "birth plan", "baby", "Pregnancy", "pregnant", "birth story", "childbirth", "birth", "child", "contractions"], "tweets": [], "movies": [], "links": ["https://www.mamanatural.com/due-date-calculator/", "http://amzn.to/2jVVAfP", "http://mn.ontraport.com/t?orid=205559&opid=1", "http://amzn.to/2jVVAfP", "http://detoxinista.com", "http://mamaglow.com", "http://www.hilliardstudiomethod.com/", "http://www.kobootcamp.com/", "https://www.instagram.com/thefoodbabe", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2017-01-24T14:56:51+00:00"}