{"result_id": "116016", "URL": "https://foodbabe.com/fda-banned-ingredients-linked-to-cancer-but-they-are-still-all-over-shelves/", "timestamp": "2023-04-25 15:06:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/fda-banned-ingredients-linked-to-cancer-but-they-are-still-all-over-shelves/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "FDA banned ingredients linked to cancer - but they are still all over shelves", "cleaned_text": "I went into a news stand at the airport with my 2-year old daughter trying to occupy her for a moment before our flight. The next thing you know, she was playing with the packages of M&Ms, Skittles, and Twix – just going back and forth, admiring all the colorful packages. They were all lined up at her eye level and I can only imagine how captivating they looked. She’s two, you know?\n\nThen I said to her, “Hey, I just want to let you know, these things are yucky, and these are things that Mom is teaching people about. The ingredients in them are not good for your body.”\n\nShe just kind of looked at me, and goes, “Yucky?” And I go, “Yup, yucky.”\n\nNow anytime we see those candies… guess what she says?\n\nThe food industry doesn’t want people to know the truth. They want you to believe everything in stores is “safe” to eat…\n\nBut the safety of our food system is a lie.\n\nThere are products (many marketed towards children) on store shelves right now with ingredients that have been banned by the FDA… and no one is doing anything to prevent it. Please share this information with those that you love, here’s what’s happening…\n\nThe FDA recently banned 7 ingredients used to make “artificial flavors” that have been shown to cause cancer in laboratory animals (1-2). These ingredients were originally approved in 1964, so have been in our food for decades. This ban would have never happened if it wasn’t for the FDA petition and lawsuit filed by several consumer protection organizations who put persistent pressure on the FDA to take action (3-4).\n\nThese ingredients all fall under the term “artificial flavors” on the ingredient list.\n\nThe banned ingredients are benzophenone, ethyl acrylate, eugenyl methyl ether, myrcene, pulegone, pyridine, and styrene* – but you won’t see them on an ingredient label\n\nSo any product that lists artificial flavors as an ingredient may contain them, but food manufacturers are not required to tell you.\n\n\n\nArtificial flavors are complex chemical mixtures made in a lab using various substances like crude oil or coal tar, and can contain upwards of 100 ingredients (including those just banned). Food companies don’t need to tell you anything about the ingredients actually in their artificial flavors – they just slap “artificial flavors” on the ingredient label – and we are left in the dark about what we are really eating.\n\nAny food company using artificial flavors has been notified of the 7 ingredients banned, but the FDA has given them TWO YEARS to remove them from their artificial flavors.\n\nIn the meantime, these banned ingredients are still on store shelves, and may be in ANY product with artificial flavors.\n\nThe FDA and the industry trade group representing these companies has refused to disclose which companies use the banned flavors. And there haven’t been any companies voluntarily telling the public either, because they are not required to.\n\nIn other words – if you see “artificial flavors” on an ingredient label, it could contain these banned cancerous substances and food companies are not going to warn you. Up until October 9, 2020 this is perfectly legal!\n\nThis is what’s wrong with our food system. Food companies are allowed to continue selling you products with ingredients known to cause cancer in animal studies – without any warning. It’s so outrageous.\n\nThe FDA doesn’t care either. In their statement about the banned flavors they said,”rigorous scientific analysis has determined that they do not pose a risk to public health under the conditions of their intended use. The synthetic flavoring substances that are the subject of this petition are typically used in foods available in the U.S. marketplace in very small amounts and their use results in very low levels of exposure and low risk.”\n\nShould we have cancerous ingredients in our food in any amount? Why take that risk? What about children, who may be more susceptible to these substances? How much are we really eating if we eat multiple products with artificial flavors each day? This is not being addressed. This is why I wrote my new book, Feeding You Lies. You can’t trust food companies or government agencies to care about our health.\n\nAvailable in stores everywhere\n\nAs soon as I learned that the FDA banned these ingredients, I started investigating which food brands were using artificial flavors… Doritos, Cheetos, Jell-O, Oreos, Trix, and Lucky Charms are all spiked with them. But there is one food corporation that I noticed as a BIG offender.\n\nMars Wrigley has artificial flavors in almost every candy and gum they make…\n\nMy team reached out to Mars about the use of these banned substances in their artificial flavors…\n\nThey admitted they’re in the process of removing the banned ingredients from their artificial flavors. This means, yes, these ingredients shown to cause cancer in animals have been used in their products. They are complying with FDA regulations requiring companies to remove them within 2 years.\n\nWhat products are these in? Are these banned ingredients in M&Ms? What about Snickers? Skittles? Eclipse Gum?\n\nHere’s the kicker. They refused to tell us.\n\nTheir reasoning is that they didn’t want to give us inaccurate information because they are in the process of removing them. We then asked how long they anticipate it will take, and they simply said “as fast as possible”. How fast this is, is anyone’s guess. Remember, the FDA has given food companies two years to stop making products with these flavors – so this does not include products already on store shelves, vending machines, or in your own house. As candy and gum has a very long shelf life, it is likely that even after two years some of the products with these banned ingredients will still be on shelves.\n\nMars should tell the public which products currently contain the ingredients banned by the FDA…\n\nSince they won’t, you might want to err on the side of caution and just avoid ALL of their products with artificial flavors. And that isn’t the only reason to avoid these products – as they are filled with other risky additives like artificial dyes (5) and BHT (6)…\n\nWith Valentine’s Day coming up, I can’t help but think of all of the children exchanging these candies with their friends…\n\nRemember – it’s not just this candy and gum. Any product you see at the store with “Artificial Flavors” may have the banned ingredients in it.\n\nThe best way to change the food industry is with a grassroots movement. This is why I’ve done petitions – they are quick and effective at making people aware as to what is really in the food they’re buying. This is also why I recommend voting with your dollars by refusing to buy products from companies who are poisoning us for profit with cheap and dangerous ingredients. How you choose to spend your money is VERY powerful.\n\nOn the other hand, expecting our government agencies (like the FDA and the USDA) to take action often takes decades of intense pressure. Consumer advocacy groups spent YEARS pushing the FDA to take action on these carcinogenic flavors – and even had to file a lawsuit in the U.S. Court of Appeals (4) to force them to do anything. We cannot rely on the FDA to protect us. And we certainly can’t trust Big Food to self-police. After all, the food industry has consistently shown that it will only remove dangerous and unhealthy ingredients when they are forced to do so.\n\nPlease SHARE THIS POST and warn your friends that it is a lie that everything on the shelf is safe.\n\nP.S. If this makes you as MAD as I am, you need to read my latest book. It blows the lid off the lies we are being told about our food…\n\nAvailable in stores everywhere\n\n* Styrene is the only one banned that is no longer used by the food industry.", "opengraph": {"locale": "en_US", "type": "article", "title": "FDA banned ingredients linked to cancer - but they are still all over shelves", "description": "I went into a news stand at the airport with my 2-year old daughter trying to occupy her for a moment before our flight. The next thing you know, she was playing with the packages of M&Ms, Skittles, and Twix – just going back and forth, admiring all the colorful packages. They were all lined … Read More", "url": "https://foodbabe.com/fda-banned-ingredients-linked-to-cancer-but-they-are-still-all-over-shelves/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2019-02-12T15:03:24+00:00", "article:modified_time": "2019-02-12T15:09:26+00:00", "image": "https://foodbabe.com/app/uploads/2019/02/banned-ingredients.jpg", "image:width": "200", "image:height": "150", "image:type": "image/jpeg"}, "tags": ["Milky Way", "Twix", "lifesavers", "doublemint", "mars", "candy", "extra", "snicker's", "wrigley", "banned", "M&Ms", "big red", "dove", "fda approved", "fda", "artificial flavors", "hubba bubba", "starburst", "eclipse", "chocolate", "juicy fruit", "5 gum", "skittles", "3 musketeers", "gum", "orbit"], "tweets": [], "movies": [], "links": ["#footnotes", "#footnotes", "https://feedingyoulies.com/", "https://www.amazon.com/gp/product/1401954545/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954545&linkId=9a5cef928bf361ee6087541b7085cf23", "https://www.barnesandnoble.com/w/feeding-you-lies-vani-hari/1128022434?ean=9781401954543", "https://www.indiebound.org/book/9781401954543", "https://www.amazon.com/gp/product/B07TSF5BRV/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=B07TSF5BRV&linkId=793e1bf36818658164c1f58ef71f9b4d", "https://www.amazon.com/gp/product/1401954561/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954561&linkId=5783a1c6c7bb63b79b0a4be75c2a552b", "https://www.parkroadbooks.com/book/9781401954543", "https://www.booksamillion.com/p/Feeding-Lies/Vani-Hari/9781401954543", "#footnotes", "#footnotes", "#footnotes", "https://www.amazon.com/gp/product/1401954545/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954545&linkId=9a5cef928bf361ee6087541b7085cf23", "https://www.barnesandnoble.com/w/feeding-you-lies-vani-hari/1128022434?ean=9781401954543", "https://www.indiebound.org/book/9781401954543", "https://www.amazon.com/gp/product/B07TSF5BRV/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=B07TSF5BRV&linkId=793e1bf36818658164c1f58ef71f9b4d", "https://www.amazon.com/gp/product/1401954561/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954561&linkId=5783a1c6c7bb63b79b0a4be75c2a552b", "https://www.parkroadbooks.com/book/9781401954543", "https://www.booksamillion.com/p/Feeding-Lies/Vani-Hari/9781401954543", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2019-02-12T15:03:24+00:00"}