{"result_id": "116010", "URL": "https://foodbabe.com/the-food-babe-way/", "timestamp": "2023-04-25 15:06:21 CEST+0200", "meta": {"description": "Who can you trust? The FDA? The food industry? Find out what made me fat, sick and depressed. The Book Trailer For The Food Babe Way - Vani Hari", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/the-food-babe-way/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "What I Used To Look Like Before The Food Babe Way", "cleaned_text": "A couple of months ago, My mom came by and dropped off a lot of stuff from my old room. She’s been waiting years for me to clean it out and finally she just did it herself (sorry and thank you Mom!). While I was putting up some of the boxes in my storage closet, I came across my old debate trophies, lots of fun notes I used to pass in class with my girlfriends and old pictures. When I was looking through the pictures, my jaw dropped open. I have changed so much from that time and tears started rolling down my face. Memories of the way I used to feel flooded over me. When I showed these pictures to my husband, he couldn’t believe it either – he’s never seen me that way. I didn’t meet him until after I started looking and feeling better. I know many of you wonder where I get my intense passion from, so today I’m going to share those pictures with you in my new The Food Babe Way book trailer video.\n\nMy hope is that these pictures inspire you to make the health change you’ve been wanting to make for yourself. For most of my life I lived in what felt like a foreign body – the food and chemicals I was eating were not serving my health, my weight, or my beauty. I suffered a myriad of health issues that kept me on several prescription drugs just to cope – now I’m on zero. I truly look older in these pictures, while I was over a decade younger!\n\nI never thought sharing old pictures would bring up so much emotion. This video is serious and intense but explains the reality we live in. There’s only one person you can trust.\n\nWatch The Food Babe Way Book Trailer Video Here:\n\nGet your copy of The Food Babe Way right now using any of the links below:\n\nPlease share this video with your friends and family who refuse to recognize what’s happening or need to know why we need a safer food system – we truly can change the world together.\n\nP.S. Your love and support gives me so much courage to keep moving forward – I can’t thank you enough for being part of the Food Babe Army!", "opengraph": {"locale": "en_US", "type": "article", "title": "What I Used To Look Like Before The Food Babe Way", "description": "Who can you trust? The FDA? The food industry? Find out what made me fat, sick and depressed. The Book Trailer For The Food Babe Way - Vani Hari", "url": "https://foodbabe.com/the-food-babe-way/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-02-02T18:35:45+00:00", "article:modified_time": "2018-01-21T04:01:23+00:00", "image": "https://foodbabe.com/app/uploads/2015/02/What-I-Used-To-Look-Like.jpg", "image:width": "640", "image:height": "375", "image:type": "image/jpeg"}, "tags": ["Food Babe", "Food Industry", "GMOs", "Vani Hari", "Food Babe Book", "fda", "The Food Babe Way", "Food Babe Army", "Author", "Activism"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe allowfullscreen=\"true\" class=\"embed-responsive-item\" frameborder=\"0\" src=\"https://www.youtube.com/embed/ddQhI8Bvo-0?l=0&amp;modestbranding=1&amp;autohide=1&amp;showinfo=0&amp;controls=0&amp;rel=0\"><br/></iframe>", "src": "https://www.youtube.com/embed/ddQhI8Bvo-0?l=0&modestbranding=1&autohide=1&showinfo=0&controls=0&rel=0"}], "links": ["http://foodbabeway.com", "http://thefoodbabeway.com", "http://thefoodbabeway.com", "http://www.barnesandnoble.com/w/the-food-babe-way-vani-hari/1119678070?ean=9780316376464", "http://amzn.to/1xwoMIg", "http://www.indiebound.org/book/9780316376464", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-02-02T18:35:45+00:00"}