{"result_id": "116020", "URL": "https://foodbabe.com/misting-booths-disinfecting-humans-is-this-where-we-are-headed-please-beware/", "timestamp": "2023-04-25 15:06:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/misting-booths-disinfecting-humans-is-this-where-we-are-headed-please-beware/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Misting Booths Disinfecting Humans - Is This Where We Are Headed? (Please Beware)", "cleaned_text": "When I saw this, I couldn’t believe this was real – but it is. The Denver Broncos installed walk-through misting booths filled with hand sanitizer to disinfect their players.\n\nYou can watch the players being sprayed with hand sanitizer in this short video:\n\nMicrosure the company that makes the ingredients for this human disinfectant misting system, is actively lobbying school districts. We’ll likely see disinfectant booths like this in airports, stores, and other public places too – they are already doing them in Asia.\n\nRemember – your skin is your largest organ. And what are these chemicals going to do when they get in your ears and eyes?\n\nWhat do these disinfectants do to the microbiome, which is crucial to our immune system and overall health?\n\nThere are a lot of questions we need to be asking before we just conform to this madness.\n\nWhen you destroy all germs that our bodies encounter, you weaken your body’s defenses.\n\nI cannot sit back and let our world get over-sanitized without saying something. I’m not saying there’s not a place for sanitizers – like if you’re a medical professional (Purell stations by the thousands in every office are quite the sight, though).\n\nThe constant use by the general public is out of control and creating a bigger problem.\n\nGood old fashioned hand washing is the best alternative. I use wipes that contain 99% water and 1% citrus extract on the go for my daughter.\n\nIf you don’t want to be subjected to disinfectant spray booths everywhere you go, it’s time to make your voice heard!\n\nPlease share this post with your friends and family to warn them what might be coming. Now is the time to speak up, before it is too late.\n\nPlease note: An active ingredient in this sanitizer – Benzalkonium Chloride – promotes antibiotic resistance, decreased fertility and can irritate the skin, eyes, and lungs.\n\nWe campaigned in the past to get restaurants to stop using meat raised on antibiotics (and we won!) (8) That’s because the overuse of antibiotics in the meat supply creates resistant bacteria that is spreading to humans, making antibiotics less effective when we need them. (9) Antibiotic-resistant bacteria infects at least 2.8 million people and kills more than 35,000 each year in the U.S. (10) We need to do whatever we can to protect the integrity of our antibiotics – and the overuse of disinfectants is detrimental!\n\nP.S. Please don’t forget to share this post to spread the word about these chemicals and what they do to our bodies. This is how we make a difference.", "opengraph": {"locale": "en_US", "type": "article", "title": "Misting Booths Disinfecting Humans - Is This Where We Are Headed? (Please Beware)", "description": "When I saw this, I couldn’t believe this was real – but it is. The Denver Broncos installed walk-through misting booths filled with hand sanitizer to disinfect their players. You can watch the players being sprayed with hand sanitizer in this short video:   Microsure the company that makes the ingredients for this human disinfectant … Read More", "url": "https://foodbabe.com/misting-booths-disinfecting-humans-is-this-where-we-are-headed-please-beware/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2020-08-12T20:20:45+00:00", "image": "https://foodbabe.com/app/uploads/2020/08/sanitizer-misting-booth-e1597326027235.png", "image:width": "500", "image:height": "263", "image:type": "image/png"}, "tags": ["disinfectant", "sanitizer", "misting booth", "hand sanitizer", "coronavirus", "immune system", "virus", "germs", "microsure", "football players", "covid", "sanitizing booth", "disinfecting", "8-hour defense", "bacteria", "football", "booths", "booth", "denver broncos"], "tweets": [], "movies": [], "links": ["https://foodbabe.com/app/uploads/2020/08/denver-broncos-misting-booth.mp4", "#footnotes", "#footnotes", "#footnotes", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2020-08-12T20:20:45+00:00"}