{"result_id": "116006", "URL": "https://foodbabe.com/secret/", "timestamp": "2023-04-25 15:06:16 CEST+0200", "meta": {"description": "My next big investigation - it's been so hard to keep this news from you!", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/secret/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "The Time I Almost Ate At Taco Bell... (I've Been Keeping A Tiny Little Secret!)", "cleaned_text": "I am thrilled to announce we are expecting our own little Food Babe this winter.\n\nI know all you moms and dads out there have been waiting for this moment for a long time… I laugh just thinking about all the times you said to me “Just wait, until you have kids”…\n\nWell – that time is almost here and you can finally get all your “I told ya so’s” ready to fire!\n\nNo, but seriously, we are SO EXCITED. It’s been really hard to keep this secret from you! I’ve been walking around with a ridiculous smile on my face for months trying to hold it in.\n\nI’ve been reading every natural pregnancy and baby book under the sun for the past several months.\n\nWell I am not going to go into all the exact details (I’ll let you use your imagination – haha)… but late last year, I knew I was finally ready to be a Mom. My parents weren’t getting any younger, Mr. Food Babe and I were about to celebrate 10 years of marriage and the more I thought about my role in this life, I knew I really wanted to bring another force for good into the world. I have so many hopes for her – to be brave, confident, powerful, smart and have lots of tenacity!\n\nWhen I looked at my husband and said I was ready, things happened quick. BOOM. I was pregnant. I honestly couldn’t believe it – I thought it would take a long time considering all the pregnancy stories and experiences I have heard about with loved ones and close friends, but I am incredibly grateful that it happened so easily for us. We are truly blessed – I can’t help but think the years of getting my health to its optimal state had to help – practicing my healthy habits, regular acupuncture and staying away from processed food!\n\nI’ve never been more hungry in my life!\n\nNow that I am pregnant – wow – have my eating habits changed. First of all, not in a million years did I think I would ever crave Taco Bell again. But it happened. I was walking by one on the way to another restaurant and I could literally taste a chicken soft taco and bean burrito in my mouth. Of course I didn’t get any – But man! It was the weirdest sensation I have ever experienced, especially considering I haven’t eaten at Taco Bell since it was like 2am in the morning and I was in college.\n\nAnd then Burger King happened. Yes. That nasty excuse for food. I was in Spain (of all places!) promoting the Spanish version of The Food Babe Way and was stuck in an airport terminal with the smell of charbroiled hamburgers radiating the whole waiting area. I thought I was going to DIE if I didn’t have one. But thankfully my years of personal investigation and study of food toxins and industrial factory farming kept me FAR FAR away – there was no way I was going to feed my growing baby that tainted meat on that processed to death sesame seed bun!\n\nAs you can see, my pregnancy cravings have been INTENSE! To tame them, I’ve spent a lot of time making organic comfort food at home – I’ve made just about all my childhood favorites – grilled cheese, biscuits, pancakes and more. (Have you seen all the cooking on Snapchat? Follow me at “thefoodbabe”).\n\nI have heard most mamas stop enjoying green vegetables during this time – thankfully that is not the case for me, I still LOVE kale and all things green (with a slice of hot cheese pizza please – haha). Actually my Melt In Your Mouth Kale Salad has been on serious repeat lately and is the one dish that doesn’t give me the pregnancy burbs! I’ll be sharing some more of the comfort food recipes I’ve been making soon.\n\nI have so many more pregnancy stories to share. Like in true Food Babe fashion, I have been reading every book under the sun to prepare for this moment and can’t wait to share all the good health principles I am putting in place.\n\nIf you’d like to follow along on my pregnancy journey, I’ll be sharing my insights here on occasion but also more frequently on my new Instagram account – Food Babe Mama – come on over and follow me there!\n\nPregnancy Q&A Coming – Let Me Know Your Questions!\n\nAlso – I know there are many of you mamas and dads out there that might have questions for me and wondering how I am handling all the ins and outs of child bearing, so I’ll be doing periodic Pregnancy Q&As. If you have a question you’d like to have the answer to, just let me know in the comments below.\n\nThis is such a wonderful time in my life – thank you for being part of this community, celebrating with us and for all your love and support!", "opengraph": {"locale": "en_US", "type": "article", "title": "The Time I Almost Ate At Taco Bell... (I've Been Keeping A Tiny Little Secret!)", "description": "My next big investigation - it's been so hard to keep this news from you!", "url": "https://foodbabe.com/secret/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2016-07-18T21:54:10+00:00", "image": "https://foodbabe.com/app/uploads/2016/07/IMG_1916.jpg", "image:width": "640", "image:height": "427", "image:type": "image/jpeg"}, "tags": ["Food Babe Mama", "mother", "babies", "mom", "announcement", "baby", "Pregnancy", "pregnant", "mama", "father", "Pregnant Women", "pregnancy announcement", "new baby"], "tweets": [], "movies": [], "links": ["http://amzn.to/2a49mqr", "http://thefoodbabeway.com", "https://foodbabe.com/when-you-see-whats-in-these-popular-fast-food-buns-youll-run/", "https://foodbabe.com/melt-in-your-mouth-kale-salad/", "https://www.instagram.com/foodbabemama/", "https://www.instagram.com/foodbabemama/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2016-07-18T21:54:10+00:00"}