{"result_id": "116036", "URL": "https://foodbabe.com/emails-reveal-coca-colas-shocking-plot-to-take-us-down/", "timestamp": "2023-04-25 15:06:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/emails-reveal-coca-colas-shocking-plot-to-take-us-down/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Emails Reveal: Coca-Cola's Shocking Plot To Take Us Down", "cleaned_text": "While working on my new book last year, I received a STARTLING email from U.S. Right To Know. They had obtained an internal email from Coca-Cola… and when I read it, I was shocked.\n\nRight there in black in white, I read how Coca-Cola tried to lobby the FDA against us, the Food Babe Army.\n\nIn the months following our successful campaigns to get “yoga mat” out of Subway, the artificial dyes out of Kraft Mac & Cheese, and the caramel coloring out of Starbucks Pumpkin Spice Latte, Coca-Cola took aim at our ability to convince major food companies to change. You see, we were hurting their bottom line, and they wanted to put that to a halt.\n\nAs I read through Coca-Cola’s correspondence I couldn’t believe the lengths they had gone to try to stop our movement. An email proposal was sent to the head of the FDA, written by none other than Alex Malaspina. Alex is a former senior vice president at Coca-Cola who founded the front group International Life Sciences Institute (ILSI) way back in the 70’s (1). This front group still operates today, funded by Coca-Cola, Nestlé, McDonald’s, Pepsico, and other processed food and chemical companies (2). Notice how Alex greets FDA head Michael Taylor in his email…\n\n“Dear Mike: How are you? I hope with the summer you have slowed down a little; Our friend Mat Echols, whom you met at our breakfast is asking, as per his email, if you would have an interest in becoming involved in this most important debate. i assume that, if your time would allow you, you will try to consider this task as this would be so important in FDA bringing good science to the table and as a result help people make the proper choices in such critical health issues. If you are interested, and could do it, please contact Mat directly to obtain all the details. Many, many thanks. Warmest personal regards. Your Friend. Alex”\n\nPretty interesting to see that “friend” Alex Malaspina, Mat Echols (a senior vice-president at Coca-Cola), and the head of the FDA had been breaking bread together. Makes you wonder if they’ve worked together in the past, doesn’t it? Sure sounds like they have a close relationship.\n\nAnd, there’s more. The email thread included a FDA Roundtable proposal written by Coca-Cola…\n\nHah. I’ve heard many outlandish things from Big Food companies, but I never thought I’d hear someone defend soda as “beneficial.” And, this is what they wanted the FDA to do…\n\nRisks to consumer health and wellbeing? Isn’t removing risky additives linked to cancer and other health issues helping consumer health and wellbeing? Who’s really risking consumer health here? Could it be that Coca-Cola’s PROFITS were at risk because of all the caramel coloring and additives they use in their products?\n\nI’m not the first person to be targeted by Big Soda… and I certainly won’t be the last. They will try every tactic under the sun to trick the public into buying their unhealthy products, and that includes infiltrating our government agencies. When the food industry can’t get people to trust them, they use front groups to help weasel their way in. And ILSI (that front group partially funded by Coca-Cola mentioned above) has been successful at this…\n\nA new report published in The BMJ and The Journal of Public Health Policy document that ILSI has huge influence in China (3). So much in fact, that ILSI operates from inside the government’s Centre for Disease Control and Prevention in Beijing. Pretty crazy.\n\nWhat’s most ludicrous is that ILSI is supposedly “fighting” the obesity epidemic in China… organizing obesity conferences and paying scientists to attend these events. They’ve launched public health campaigns heavily promoting the idea that obesity is caused by a lack of exercise – and not from drinking sugary sodas and processed food. Anything to make sure people keep loading up their grocery carts up with Coke, right?\n\nYou may remember that Coca-Cola tried the same tactics here in the U.S. and it backfired BIG TIME when they were caught secretly funding a nonprofit group called the Global Energy Balance Network. Emails obtained by the Associated Press and U.S. Right To Know outlined how “the group would use social media and run a political-style campaign to counter the ‘shrill rhetoric’ of ‘public health extremists’ who want to tax or limit foods they deem unhealthy” and “quickly establish itself as the place the media goes to for comment on any obesity issue.” (4) The group disbanded and Coca-Cola’s chief health and science officer retired after the scandal broke. (5) They might have been caught then – but we both know they are going to try another tactic. And another. And then, another.\n\nThis is the reason why I wrote my book Feeding You Lies. Not only are the food companies using front groups to feed us lies in the U.S., but they are doing it across the globe. It’s happening everywhere and they won’t stop until they are exposed.\n\nThere’s more to this story too. I have so much more to share and put all of the information you need to know in Feeding You Lies. Just like the tobacco industry lied to us about the dangers of cigarettes, the same untruths, cover-ups, and deceptive practices are occurring in the food industry.\n\nIt’s more important than ever that people know about this. Feeding You Lies is written for you – it’s a tell-all on the food industry in one book that’s super easy to share with your friends and family.\n\nI hope you pre-order a copy of the book today so you can be one of the very first people to read it! Plus, when you pre-order before it’s released on February 19th, you’ll get an incredible bonus (I can’t wait to tell you all about it next week!)\n\nClaim your bonus after you pre-order a copy today here\n\nAnd for all of you who have already pre-ordered, thank you SO MUCH for your love and support. Make sure you claim your bonus too!\n\nI can’t wait for you to receive the book and share its important message with your loved ones. We can change the world one person at a time.\n\nPlease take a second to hit share on this post and spread the word about this book.", "opengraph": {"locale": "en_US", "type": "article", "title": "Emails Reveal: Coca-Cola's Shocking Plot To Take Us Down", "description": "While working on my new book last year, I received a STARTLING email from U.S. Right To Know. They had obtained an internal email from Coca-Cola… and when I read it, I was shocked. Right there in black in white, I read how Coca-Cola tried to lobby the FDA against us, the Food Babe Army. … Read More", "url": "https://foodbabe.com/emails-reveal-coca-colas-shocking-plot-to-take-us-down/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2019-01-22T14:09:16+00:00", "article:modified_time": "2019-01-22T16:36:31+00:00", "image": "https://foodbabe.com/app/uploads/2019/01/food-babe-with-diet-coke-e1548166102910.jpg", "image:width": "640", "image:height": "494", "image:type": "image/jpeg"}, "tags": ["front group", "global energy balance network", "email", "U.S. Right To Know", "CDC", "emails", "international life sciences institute", "michael taylor", "ilsi", "Diet Coke", "front groups", "fda", "china", "alex malaspina", "big soda", "Coca Cola", "Coke", "Feeding You Lies", "Obesity", "book", "Soda", "Food Babe Army", "mike taylor"], "tweets": [], "movies": [], "links": ["https://feedingyoulies.com/", "#footnotes", "#footnotes", "https://foodbabe.com/app/uploads/2019/01/redacted-2.pdf", "#footnotes", "#footnotes", "#footnotes", "https://feedingyoulies.com/", "https://feedingyoulies.com/", "https://feedingyoulies.com/", "https://www.amazon.com/gp/product/1401954545/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954545&linkId=9a5cef928bf361ee6087541b7085cf23", "https://www.barnesandnoble.com/w/feeding-you-lies-vani-hari/1128022434?ean=9781401954543", "https://www.indiebound.org/book/9781401954543", "https://www.amazon.com/gp/product/B07TSF5BRV/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=B07TSF5BRV&linkId=793e1bf36818658164c1f58ef71f9b4d", "https://www.amazon.com/gp/product/1401954561/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954561&linkId=5783a1c6c7bb63b79b0a4be75c2a552b", "https://www.parkroadbooks.com/book/9781401954543", "https://www.booksamillion.com/p/Feeding-Lies/Vani-Hari/9781401954543", "https://feedingyoulies.com/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2019-01-22T14:09:16+00:00"}