{"result_id": "116019", "URL": "https://foodbabe.com/should-i-get-the-flu-shot/", "timestamp": "2023-04-25 15:06:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/should-i-get-the-flu-shot/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Should I get the Flu Shot?", "cleaned_text": "***Disclaimer – This post is strictly based upon my opinion and consultation of my own health provider, I recommend you make the best choice for you and your family based upon your own due diligence and research on this topic. ***\n\n\n\n One of the goals I made in starting this blog back in April, was to uncover and unveil information that isn’t readily available for public consumption on true health, nutrition and wellbeing. I want this blog to help you break free from the “conventional” wisdom that the food industry, government agencies, pharmaceutical and medical community try to push because of greed or corruption that is ultimately harmful to you and your family. I want you to walk away questioning what you put in your body – food or medicine. I want you to learn from my mistakes and adopt the positive discoveries I’ve made. I want you to feel as good as I do. But most importantly I want to give you the information you need to make real informed decisions about your health.\n\nThis is why it is extremely important to understand the Flu Shot – I want you to think about what you are directly injecting into your bloodstream. Before you consider jumping off the ledge with other lemmings and taking this years Flu Shot – Here are the questions I think you should ask yourself…\n\nWhat’s exactly in the Flu Shot? To sum it up – A bunch of toxic chemicals and additives that lead to several types of Cancers and Alzheimer disease over time.\n\nHere’s a list of what could be lurking in that vial of vaccine:\n\nI won’t eat any of these ingredients or even put them on my body – however, the mainstream medical community, government agencies and pharmaceutical companies suggest that I directly inject these ingredients into my bloodstream? And I need do it every year until I die? Are you freaking kidding me? Long term effects of the combination of these toxic additives are very alarming – a very famous immunologist & geneticist has completed studies and research that shows in that every five flu shots a person receives over a ten year period they increase their risk of Alzheimer Disease by ten times! This is because of the ingredients above – Aluminum and Mercury – they slowly destroy your brain cells one by one.\n\nDoes the Flu Shot really protect me against the Flu? No, the CDC even admits it doesn’t protect you because the virus mutates every year and they can’t predict which strains will hit. Even when they do get the strain right, they can’t prove it actually works. Just do a google search for the effectiveness of the flu shot and just see how many studies prove it is ultimately unreliable and ineffective. In a couple of studies I read, The flu shot was compared to a placebo – The same number of people caught the flu regardless if they took the shot or not!\n\nWhy do I have to get a Flu Shot every year? Aren’t vaccines suppose to immunize you for life? They have to continuously give you a flu shot, because it is not a real vaccine. Let’s say for instance, you get a vaccine for another virus like Hepatitis A or B – you are immunized for life. Why isn’t this the case with the flu vaccine? Because the scientists have not developed a real vaccine for the flu and are continuously guessing on how to come up with a new chemical formula that could be effective.\n\nResearch has shown that it takes close to a full year to develop an effective vaccine against a virus – however, in developing the flu shot – scientists spend less than 4 months producing it so they can get it out for production before flu season starts. They don’t have time to thoroughly test it or judge it’s reactions in the human body. They take a chance on the symptoms it causes and that it might work – are you willing to take this chance too?\n\nWhat kind of strain are they going to use this year for the Flu Shot? It’s the same one as last year. Really? But then why do I need to get another shot if I got one last year? This is the way the pharmaceutical companies continue to make money off of you – The CDC says it “wears off.” And this brings me back to my previous point – if the flu vaccine were truly a vaccine – it wouldn’t wear off. Think about it – Once you get chicken pox as a child, your body develops antibodies to strengthen your immune system from ever getting chicken pox again. This is how vaccines are suppose to work. But the flu shot doesn’t work this way…There is something wrong with this picture…\n\nWhy is there so much pressure to get the Flu Shot year after year? Why does every drug store have a sign up promoting the shot? Why are shots available at work? And at school? Why is their so much propaganda each year around this time? There is only one answer – Money. The making, distributing, and administering of the flu shot is a 7 Billion Dollar Industry. Each year the pharmaceutical industry eyes glow with $ signs when it’s time to make more as the American public become the guinea pigs again to try it out.\n\nWhy are Flu Shots recommended for children, women who are pregnant and the elderly? Because that group of individuals typically have weaker immune systems and if they catch the flu and don’t treat it in time it can lead to other complications like pneumonia. However, why would you give a group with already weakened immune systems something that weakens their immune system systemically further?\n\nThe flu shot causes all sorts of side effects and symptoms like Muscle pain, respiratory tract infections, eye problems, abnormal blood pressure, asthma, hives, and gastrointestinal problems that could also lead to other complications. This is why the vaccine isn’t effective in the first place, because administering a drug that weakens the immune systems makes people even more susceptible to the flu! This is another reason I believe why some studies I read proved that the flu shot was not effective in treating the elderly.\n\nWhy have some countries banned the Flu Shots in the past? Because it caused all sorts of terrible and sometimes deadly reactions in their children and other citizens. Australia banned the flu shot for all children under 5 last year when 250 children were hospitalized and one died after receiving the vaccine. Finland and Sweden also banned the shots and opened up an investigation last year. Don’t you wonder why this didn’t make major news here in the United States?\n\nCan I immunize myself naturally from the Flu? Yes! You can build lifetime antibodies against the infection. Just Skip the vaccine, boost your vitamin D intake, and encounter the flu naturally. If you encounter the flu – rest, take care of yourself, understand that your body needs a break and focus on getting better – This type of immunizing yourself works amazingly better than relying on an artificial injection that has been proven ineffective. You’ll have these new antibodies for life that will ultimately protect you from similar strains of the virus better than any yearly shot could ever provide.\n\nWhat ongoing things should I be doing and getting from my diet to keep my Immune System healthy and to prevent getting the Flu? Exercise daily, Take Probiotics, Get Vitamin A from beta carotene, Vitamin C, B6, B12, Garlic, Zinc and plenty of Vitamin D. Building up your immune system can help your body fight off the flu virus before you experience symptoms and lessen the time you take to recover from the flu.\n\nIs Food Babe planning to take the Flu Shot? Given all the answers I have learned above – No, I’m not taking the Flu Shot. Ever.\n\nWishing you the best health life can offer and all the sunshine in my heart….\n\nP.S. If you know someone who would like to hear about this perspective, please share this post with them.\n\nP.S.S. I am not “anti-vaccination”, I choose not to take the flu shot for the ingredients they contain as stated above.", "opengraph": {"locale": "en_US", "type": "article", "title": "Should I get the Flu Shot?", "description": "***Disclaimer – This post is strictly based upon my opinion and consultation of my own health provider, I recommend you make the best choice for you and your family based upon your own due diligence and research on this topic. *** One of the goals I made in starting this blog back in April, was … Read More", "url": "https://foodbabe.com/should-i-get-the-flu-shot/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2011-10-05T03:33:55+00:00", "article:modified_time": "2015-04-16T20:32:52+00:00", "image": "https://foodbabe.com/app/uploads/2011/10/featured_flushot.jpg", "image:width": "200", "image:height": "150", "image:type": "image/jpeg"}, "tags": ["vaccinations", "mercury", "vaccine", "influenza", "flu shot"], "tweets": [], "movies": [], "links": ["https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2011-10-05T03:33:55+00:00"}