{"result_id": "116042", "URL": "https://foodbabe.com/lunch-with-dr-mercola/", "timestamp": "2023-04-25 15:06:56 CEST+0200", "meta": {"description": "Lunch With Dr. Mercola", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/lunch-with-dr-mercola/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Lunch With Dr. Mercola", "cleaned_text": "When I got an invite from Dr. Joseph Mercola’s team asking if I’d like to come visit their headquarters, meet Dr. Mercola and have lunch with him… I pretty much squealed in excitement like a little girl.\n\nMercola.com was one of the first natural health websites I visited when I started my journey into organic living years ago. Dr. Mercola has been a brave pioneer in educating the public (and me) about the many flawed practices of western medicine and harmful chemicals in our life. He’s not afraid to tell you the truth about what’s really going on in the food industry and that’s why I love him.\n\nDr. Mercola has a full service medical clinic right outside of the Chicago area and has been treating patients there for several years. This is where I met him for an hour long interview. His interview of me will air in a couple of weeks on his site, but until then I wanted to give you a sneak peek into my visit…\n\nDr. Mercola is extremely nice, genuine and down to earth – so cool, considering he has the largest natural health website in the world. His dedication to helping people heal naturally was completely apparent in his demeanor and character that I witnessed first hand. The interview was a breeze and I felt like I was talking to someone I had known for years. (Well I guess I have, in a weird kind of stalker way – ha!)\n\nAfter the interview, I met several people that make Mercola.com happen. It was cool to be around so many like-minded people at once! During a tour, I got to check out the full service gym employees have access to during the work day. They even have a personal trainer and yoga instructor on site (uh… amazing, right?). My favorite part of the tour was seeing the sprouts that Dr. Mercola’s team grows right in their office. Every kind of sprout imaginable was being grown in a room with a large window in trays stacked up on shelves…\n\nThere were some interesting experiments going on in the room. Some sprouts were being grown with vortex water and some with regular filtered water. You might be wondering what the heck vortex water is, well this was my first time learning about it too.\n\nMakers of vortex water machines claim that the structure of water is important to get the most health benefits from drinking it. For example, they use the analogy of carbon in coal vs. a diamond to illustrate how something with the same chemical makeup can look and feel totally different. Now I haven’t been drinking vortex water regularly to tell you about whether or not there are benefits but Dr. Mercola’s team is actually conducting research and testing the sprouts for the vitamin, mineral and enzyme content and I’m sure will be reporting back to us on the results. If you’d like to learn more about vortex water – check this post out here which gives a more thorough explanation. \n\n\n\nAt lunch we talked about a lot and his team gave me some really great advice on something I’m working on now (details coming soon!). Learning about Dr. Mercola’s eating philosophy was fascinating. I was pleasantly surprised he and I are aligned in the way we think about food… Mostly plants, lots of green juicing, a little meat, not too many grains and really good fats – like raw grass-fed butter, coconut oil and avocados. I also learned that Dr. Mercola has a sweet tooth and loves his raw cacao and makes a special dessert with coconut oil to enjoy almost daily.\n\nMeals are provided to the employees at Dr. Mercola’s office everyday and there is an onsite juicer! Wouldn’t it be great if all corporations did this for their employees? Could you imagine the increase productivity and the elimination of the 3pm slump if everyone ate this way?\n\nFor lunch we had a HUGE amount of sprouts, kale salad, green juice, vortex water, fermented vegetables (they also make in the office – watch this video to see how) and a couple of ounces of meat.\n\nAfter lunch, I felt completely energized… it was by far the best office lunch I’ve had in my life. I’ve always loved sprouts and try to eat them weekly but after noticing the huge burst in energy after eating this many of them at one meal, I’ve been incorporating them into my daily routine. We are even starting our own sprout garden at home too so we can have access to them all the time. Sprouts have an enormous amount of live enzymes compared to uncooked fruits and vegetables, the vitamin content is through the roof and they increase the alkalinity of your body (remember, an alkaline body avoids diseases like cancer). And the best part – they are SUPER cheap to grow and make living organically more accessible to everyone.\n\nI hope you enjoyed my recap… Thank you Dr. Mercola and your wonderful team for the incredibly warm hospitality and an overall excellent day. I simply can’t wait until my next visit…\n\nP.S. If you know someone who loves Dr. Mercola or wants a glimpse into how he and I eat, share this post with them… I hope this will inspire more people to eat more plant based foods.\n\n7/7 UPDATE: Here’s the link to the full video interview – it’s an amazing piece, I’m totally blown away!", "opengraph": {"locale": "en_US", "type": "article", "title": "Lunch With Dr. Mercola", "description": "Lunch With Dr. Mercola", "url": "https://foodbabe.com/lunch-with-dr-mercola/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2013-06-24T16:52:43+00:00", "article:modified_time": "2013-08-06T02:22:09+00:00", "image": "https://foodbabe.com/app/uploads/2013/06/Food-Babe-and-Mercola.jpg"}, "tags": ["Vortex Water", "Dr. Joseph Mercola", "sprouts", "Kale", "Mercola Health"], "tweets": [], "movies": [], "links": ["http://mercola.com", "https://foodbabe.com/app/uploads/2013/06/IMG_8411.jpg", "http://articles.mercola.com/sites/articles/archive/2011/01/29/dr-pollack-on-structured-water.aspx", "https://foodbabe.com/app/uploads/2013/06/IMG_8428.jpg", "https://foodbabe.com/kickin-kale-juice/", "http://www.youtube.com/watch?v=05lVOmj1Pqg", "http://articles.mercola.com/sites/articles/archive/2013/07/07/van-hari-food-babe.aspx", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2013-06-24T16:52:43+00:00"}