{"result_id": "116022", "URL": "https://foodbabe.com/read-ingredient-lists/comment-page-1/", "timestamp": "2023-04-25 15:06:34 CEST+0200", "meta": {"description": "The #1 Reason You Must Read Ingredient Lists: The FDA Admits They Can’t Do Their Job - the shocking report about the lack of regulation on food additives.", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/read-ingredient-lists/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "The #1 Reason You Must Read Ingredient Lists: The FDA Admits They Can’t Do Their Job", "cleaned_text": "How many times have you heard the argument that the ingredients in our food are safe to eat, simply because they are “Approved” by the FDA. I’ve heard this statement many times in the media recently, and I’m sure you have, too. I wasn’t going to let the opportunity slide to tell you what I really think when someone says that an ingredient has been rubber stamped by the FDA and is automatically safe to eat.\n\nThere’s an implication out there that everything allowed in processed food – preservatives, artificial sweeteners, thickeners, stabilizers, emulsifiers – have gone through some sort of rigorous testing by the FDA proving they’re okay to eat – but in most cases they haven’t!\n\nGiven the FDA’s mission to “protect the public health by assuring the safety, efficacy and security of…our nation’s food supply”, it would only make sense that they would be front and center in approving new food ingredients before they hit the market – however – this is not necessarily the case. In fact, the FDA is sometimes not even aware that a new ingredient has been introduced into our food.\n\nNew food ingredients are often approved by the manufacturer themselves, and not by the FDA.\n\nWhile there are some food additives that the FDA has approved before they hit the shelves, this has proven to be a burdensome process. The FDA claims that so as not to waste government resources, they will just let the manufacturer decide whether an ingredient is safe to eat or not.\n\nThat’s right – all an ingredient manufacturer has to do is hire their own experts to claim under “reasonable certainty in the minds of competent scientists that the substance is not harmful under the intended conditions of use” and the manufacturer may deem it as “GRAS”, which stands for “Generally Recognized as Safe”. This is the green light to start adding it to food products.\n\nA manufacturer can then voluntarily send their GRAS determination to the FDA, but this is not mandatory. Even worse, if the FDA raises questions about an ingredient received in a voluntary GRAS notice, the manufacturer can just withdraw their notice and still use the ingredient in food products! This practice is nothing short of alarming, and is allowing companies to skirt around the FDA and essentially put whatever they want into our food.\n\nThis issue has become a monster that’s impossible to control. Back when Congress gave the FDA authority over food additives (in 1958), there were about 800 additives. Today, the number of known ingredients has swelled to about 10,000 and continues to grow. The National Resources Defense Council estimates that roughly 1,000 food chemicals have been secretly added without notification to the FDA, and say that GRAS should really stand for “Generally Recognized As Secret”. Even the FDA’s Deputy Commissioner, Michael Taylor, recently confessed:\n\nYou can’t put your confidence in the FDA, when it comes to food additives.\n\nWhile some additives may be safe in small quantities, the FDA cannot regulate cummulative consumption when particular additives are being added to an insurmountable number of foods without any post-market oversight. For instance, even if you think you’re eating healthy you could easily be eating the ingredient carrageenan (that is linked to intestinal issues) at every meal: in your morning coffee and yogurt at breakfast, soup and deli-meat sandwich for lunch, and Lean Cuisine frozen dinner. What is the cumulative amount of carrageenan in this diet? No one is evaluating that. The FDA readily admits:\n\nThe FDA is asleep at the wheel and the Food Industry is in charge.\n\nThe big food industry has proudly taken it upon themselves to approve food ingredients… and why wouldn’t they? It’s the perfect opportunity for them to create chemicals that help them to make products cheaper and quicker, without 3rd party oversight into their safety. In August, the Grocery Manufacturers Association (an industry group comprised of over 300 big food brands such as Pepsico, General Mills, Kellogg’s and Kraft) announced they are unleashing an initiative to “improve the process and increase transparency for making Generally Recognized As Safe (GRAS) determinations” and will “take the lead in defining a standard that will provide clear guidance on how to conduct transparent state of the art ingredient safety assessments…”.\n\nWho wants the Grocery Manufacturers Association to take the lead here? I know I don’t.\n\nThis was clearly a move to give the public a warm and fuzzy feeling about the safety of our food, without making any real progress and putting more power into hands of Big Food. According to the chief regulatory affairs attorney for the Center for Science In The Public Interest, Laura MacCleery, “That this is seen as a step forward neatly illustrates the dysfunction built into the current system. It is outrageous that FDA doesn’t already have the identity, much less the safety data, of all substances added to the nation’s food supply”. There is undeniable evidence of institutional corruption at the FDA, as they’ve allowed pharmaceutical companies to lobby for regulations that “serve their interests” and have minimized the role of the FDA. So, allowing the food corporations to take the lead in determining what ingredients are safe to eat is inexcusable.\n\nThe U.S. Government Accountability Office (GAO) has called out the FDA for its lax practices and asked them to strengthen their oversight of food ingredients. According to the GAO’s audit of the FDA in 2010 they found some huge problems with the way the FDA is running things. Although I think their entire report is required reading, I’ve summarized some highlights here for you.\n\nThe FDA is not aware of many GRAS determinations:\n\nCompanies can hire their own experts to determine their product is GRAS and there are no conflict of interest guidelines in place:\n\nCompanies are not held accountable or required to keep records of their GRAS determinations:\n\nFDA has failed to conduct ongoing reviews of GRAS substances, including those that raised concerns over 30 years ago:\n\nThe GAO concluded that there are GRAS ingredients currently on the market that may not be safe:\n\nFor these reasons, I believe that we need to take responsibility for our own health and not rely on the FDA to protect us.\n\nThis may not be news to you, but so many people are relying on these antiquated regulations – so we need to spread the word! Please share this post with your friends and family, and with anyone who tries to tell you that an ingredient is safe just because it’s “approved” by the FDA!\n\nNext time they say such a thing…you’ll be armed with the truth!\n\nWe must read the ingredient lists on the food we eat – if you don’t recognize the ingredient, put it down and run as fast as you can!\n\nP.S. Are you jumping from diet to diet and nothing seems to work? Are you sick of seeing contradictory health advice from experts? In my new book, Feeding You Lies, I blow the lid off the lies we’ve been fed about the food we eat – lies about its nutrient value, effects on our health, label information, and even the very science we base our food choices on. I guide you through a 48-hour Toxin Takedown to rid your pantry, and your body, of harmful chemicals – a quick and easy plan that anyone can do.", "opengraph": {"locale": "en_US", "type": "article", "title": "The #1 Reason You Must Read Ingredient Lists: The FDA Admits They Can’t Do Their Job", "description": "The #1 Reason You Must Read Ingredient Lists: The FDA Admits They Can’t Do Their Job - the shocking report about the lack of regulation on food additives.", "url": "https://foodbabe.com/read-ingredient-lists/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-01-06T16:41:10+00:00", "article:modified_time": "2019-01-13T23:50:26+00:00", "image": "https://foodbabe.com/app/uploads/2015/01/fdabuilding.jpg", "image:width": "640", "image:height": "360", "image:type": "image/jpeg"}, "tags": ["GAO", "GRAS", "fda", "Food Additives", "ingredients"], "tweets": [], "movies": [], "links": ["http://www.rodalenews.com/sweetness-enhancer", "http://www.foodsafetynews.com/2014/01/the-gras-process-how-companies-legally-add-ingredients-to-food/#.U81A7_ldWSo", "http://articles.chicagotribune.com/2012-08-25/health/ct-met-food-ingredients-20120825_1_food-supply-pew-health-group-u-s-food", "http://www.fda.gov/food/IngredientspackagingLabeling/GRAS/", "https://www.cspinet.org/foodsafety/gras.html", "http://www.pewtrusts.org/en/archived-projects/food-additives-project", "http://www.nrdc.org/food/safety-loophole-for-chemicals-in-food.asp", "http://civileats.com/2014/04/10/gras-out-surprising-number-of-unregulated-chemicals-found-in-food/", "http://www.nrdc.org/food/files/safety-loophole-for-chemicals-in-food-report.pdf", "http://www.washingtonpost.com/national/food-additives-on-the-rise-as-fda-scrutiny-wanes/2014/08/17/828e9bf8-1cb2-11e4-ab7b-696c295ddfd1_story.html?hpid=z2", "http://www.washingtonpost.com/rw/2010-2019/WashingtonPost/2014/08/17/National-Politics/Graphics/w-additives.jpg", "https://foodbabe.com/watch-out-for-this-carcinogen-in-your-organic-food/", "http://www.washingtonpost.com/national/food-additives-on-the-rise-as-fda-scrutiny-wanes/2014/08/17/828e9bf8-1cb2-11e4-ab7b-696c295ddfd1_story.html", "http://www.washingtonpost.com/national/food-additives-on-the-rise-as-fda-scrutiny-wanes/2014/08/17/828e9bf8-1cb2-11e4-ab7b-696c295ddfd1_story.html", "http://www.gmaonline.org/news-events/newsroom/grocery-manufacturer-association-announces-industry-initiative-on-ingredien/", "http://www.sourcewatch.org/index.php/Grocery_Manufacturers_Association", "https://web.archive.org/web/20131226021050/http://www.gmaonline.org/forms/MemberDirectory/viewMemberDirectoryAll", "http://www.politico.com/story/2014/08/big-food-to-divulge-chemical-info-110395.html", "http://papers.ssrn.com/sol3/papers.cfm?abstract_id=2282014", "http://www.gao.gov/products/GAO-10-246", "http://www.gao.gov/new.items/d10246.pdf", "https://feedingyoulies.com/", "https://feedingyoulies.com", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-01-06T16:41:10+00:00"}