{"result_id": "116023", "URL": "https://foodbabe.com/subway-stop-routine-use-antibiotics-production-meat/", "timestamp": "2023-04-25 15:06:35 CEST+0200", "meta": {"description": "Subway: We Want Subs Not Drugs! Stop The Routine Use Of Antibiotics In Your Meat! - Sign the petition and join thousands to save human health", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/subway-stop-routine-use-antibiotics-production-meat/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Subway: We Want Subs Not Drugs! Stop The Routine Use Of Antibiotics.", "cleaned_text": "Today, I’m launching a major petition and I need your help.\n\nThis issue is deeply personal. A couple of years ago my Dad was infected with antibiotic-resistant bacteria and was hospitalized as a result.\n\nNeedless to say, it was one of the most stressful and scary times of my life. Thankfully with good medical care, my Dad survived but the antibiotics he was supposed to be given to treat the infection were deemed useless.\n\nAs you may know, I’m known for getting the yoga mat chemical – azodicarbonamide – out of Subway’s famous bread last year. Over 100 thousand of us signed this petition (1), and without you Subway would have never made this change.\n\nI thank you so much for making that happen.\n\nBut today I’m not talking about yoga mats and shoe rubber.\n\nThere’s an even bigger issue that we need to address at Subway.\n\nI have been working with several experts and consumer advocacy groups (2) for the past year on this very important issue, and we now need your voice.\n\nSubway is one of the largest fast food chains in the world and is serving us meat that is raised with antibiotics. This is irresponsible because:\n• Antibiotics are being routinely fed to farm animals – not to treat diseases – but to fatten them up and make them grow bigger on less food (4).\n• Almost all of the antibiotics used in the U.S. are fed to farm animals and the amount continues to rise (5).\n• This misuse of antibiotics is creating superbugs that could threaten the entire human population (6). When animals are constantly fed low levels of antibiotics, they become a breeding ground for antibiotic-resistant bacteria, and it’s spreading to humans (7).\n• We now have bacterial infections that only a few years ago could be cured and are now not responsive to any known antibiotics. Thousands of people are dying every year and experts believe it’s going to get worse (8).\n\nWe sent two letters earlier this year (9) to the CEO of Subway asking him to engage with us to discuss opportunities for them to step up as leaders and commit to eliminating these antibiotics from their chicken suppliers, and eventually to eliminate these antibiotics across all supply chains.\n\nSubway has failed to take a stand and hasn’t made a formal commitment.\n\nOther major food companies have publicly committed to stop this practice (10), and it’s time to demand that Subway do the same!\n\nThat’s why I’m petitioning Subway to formally prohibit the routine use of antibiotics for growth promotion and disease prevention in the production of meat across all supply chains, including their turkey, chicken, beef, and pork.\n\nJoin me and sign this petition here.\n\nLet’s create a safer food system together. Do this for you, your children and the human races.\n\nI’m doing it for my Dad.", "opengraph": {"locale": "en_US", "type": "article", "title": "Subway: We Want Subs Not Drugs! Stop The Routine Use Of Antibiotics.", "description": "Subway: We Want Subs Not Drugs! Stop The Routine Use Of Antibiotics In Your Meat! - Sign the petition and join thousands to save human health", "url": "https://foodbabe.com/subway-stop-routine-use-antibiotics-production-meat/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-08-24T17:13:53+00:00", "article:modified_time": "2018-01-21T03:50:12+00:00", "image": "https://foodbabe.com/app/uploads/2015/08/FB_SubwayEatDrugsPreview_FacebookPreview.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": ["GMOs", "Meat", "Vani Hari", "Food Babe Army", "Antibiotics", "organic", "subway", "CDC"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe allowfullscreen=\"true\" class=\"embed-responsive-item\" frameborder=\"0\" src=\"https://www.youtube.com/embed/whxO933FVaQ?l=0&amp;modestbranding=1&amp;autohide=1&amp;showinfo=0&amp;controls=0&amp;rel=0\"><br/></iframe>", "src": "https://www.youtube.com/embed/whxO933FVaQ?l=0&modestbranding=1&autohide=1&showinfo=0&controls=0&rel=0"}], "links": ["https://foodbabe.com/subwaymeat", "https://foodbabe.com/subwaymeat", "https://foodbabe.com/subwaymeat", "https://foodbabe.com/subwaymeat", "https://foodbabe.com/subwaymeat", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-08-24T17:13:53+00:00"}