{"result_id": "116015", "URL": "https://foodbabe.com/breaking-roundup-found-in-beer-wine-samples-see-the-brands/", "timestamp": "2023-04-25 15:06:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/breaking-roundup-found-in-beer-wine-samples-see-the-brands/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "BREAKING: Roundup found in beer & wine samples (See the brands)", "cleaned_text": "We all know that alcoholic drinks are not a health food – and alcohol itself is linked to cancer. But, these new findings are just further evidence that this hazardous weed killer is ending up in almost everything that we eat and drink. How much weed killer are we each eating every day?\n\nBreaking new tests conducted by the consumer interest group U.S. PIRG finds that many popular beer and wine brands are contaminated with – glyphosate (the main ingredient in Roundup).\n\nRoundup is the most widely used weed killer in the world. In 2015, the World Health Organization’s cancer arm declared glyphosate a probable human carcinogen. Last year Monsanto lost a HUGE lawsuit filed by a California man with Non-Hodgkin Lymphoma – the jury decided that Roundup caused his cancer and awarded him millions. This was the first of thousands of lawsuits filed.\n\nU.S. PIRG tested 5 wines and 15 beers (some organic) and found glyphosate in 19 out of 20 of them.\n\nThe wine brands that tested positive for glyphosate are Beringer, Barefoot, Sutter Home, Inkarri Estates (organic), and Frey (organic). Sutter Home wine rang in with the most glyphosate at 51 ppb (parts per billion).\n\nThe wines that came out with the least amount of Roundup were both organic – Inkarri Estates Malbec Organic (5.3 ppb) and Frey Organic Natural White Blend (4.8 ppb).\n\nThe beer brands that tested positive for glyphosate are Budweiser, Coors Light, Miller Lite, Sam Adams, Samuel Smith (organic), New Belgium, Corona, Heineken, Guinness, Stella Artois (beer and cider), Ace Perry, Sierra Nevada, and Tsingtao. The beer with the most glyphosate was Tsingtao at 49.7 ppb, followed by Coors Light, Miller Lite, Budweiser and Corona.\n\nHow did this weed killer end up in organic wine and beer?\n\nI was a bit surprised seeing Samuel Smith’s organic beer coming up with some glyphosate in it. It’s worth noting that the organic beer and organic wine had the LOWEST amount on the list. This is because glyphosate is prohibited to be used on organic crops – and glyphosate in them is the result of contamination through water, rainwater, or drift from nearby crops. It wasn’t directly applied to their crops if they are certified organic.\n\nOrganic winery Frey Vineyards told USA Today that they do not use herbicides and “glyphosate in trace amounts is now found in rainwater because of its application to conventionally farmed agricultural land. Glyphosate in trace amounts can be found in many food products across the United States. We urge consumers to speak up to ban all use of glyphosate.“\n\nThe one brand tested by U.S. PIRG that had no detectible glyphosate was Peak Organic brand beer.\n\nI discuss how to protect yourself in the chapter – “Weed Killer For Dinner” – in my new book Feeding You Lies…\n\nThe majority of food and drinks are contaminated with Roundup.\n\nEven though Roundup is strongly linked to cancer, Roundup has NOT been banned. It continues to be used on food crops, parks, playgrounds, and by homeowners everywhere. Glyphosate is sprayed on 80% of crops in this country and is now so rampant in our environment that it’s found in honey, cereals, meat, drinking water, breast milk, infant formula, chips, cookies, air samples… the list goes on.\n\nCritics say the amount of weed killer in our food and drinks is TOO LOW to cause damage – but is this a LIE?\n\nJust remember this… Monsanto/Bayer has tried to hide the dangers of Roundup from the public and regulators for years. Monsanto has colluded with regulators at the EPA – and the “safe levels” for glyphosate in our food were raised by the EPA at the request of Monsanto. Are we supposed to trust Monsanto that these levels are safe? If there is Roundup in everything that you eat and drink today, are you still consuming a “safe” level?\n\nI’ve been dragged through the mud by people calling me a “fearmonger” for writing about the dangers of Roundup.\n\nCritics say that scientists disagree with my work and that we should trust them because they are the real experts. They branded me “pseudoscience” because I avoid GMOs and conventional foods grown with glyphosate.\n\nThe truth is: Science is always evolving. It’s not always “settled” and it is riddled with industry corruption.\n\nJust look at what Big Tobacco has done during the last 80 years, as they tried to hide the grave dangers of cigarette smoking from the public. Monsanto’s playbook is the same and they use many of the same tactics. Roundup is the new tobacco.\n\nInternal emails published in Feeding You Lies show how many of these critics received money from Monsanto and Bayer. These companies enlist experts to spin the story on glyphosate and lie to the public about its dangers. They also enlist experts to discredit activists like myself who are telling the truth about their products. It’s disgusting.\n\nIf you want to know the TRUTH about how to avoid Roundup in your food and who is LYING about its dangers – you need to read Feeding You Lies!\n\nPick up your copy today at these bookstores.\n\nAvailable in stores everywhere\n\nHere’s what some people are saying about Feeding You Lies…\n\n“I received the book yesterday and I can not put it down!!!” ~ Beatrice\n\n“Started reading it and couldn’t stop – had to force myself to close it up until I got my chores done” ~ Mindy\n\n“This book is already changing my life” ~ Faith\n\n“I am beyond sucked into to the new book #feedingyoulies I ALWAYS knew there was something wrong with our food industry and @thefoodbabe knocks it out of the park with educating and spreading light on the truth behind these companies and what they aren’t telling you!” ~ Erika\n\nI’m loving the excitement surrounding this book. We are changing the world! One person at a time.\n\nWant to avoid weed killer in your beer and wine? Here’s what to do:\n• Choose certified organic beer and wine whenever possible. This has been shown to have the least glyphosate residue, if any.\n• Ask the brewery or winery if they test for glyphosate. If not, encourage them to do so.\n• Stop using Roundup and synthetic weed killers at home. This is contaminating our environment, making it’s way into our air, water, and food.\n\nIf you know anyone who drinks wine or beer (I’m sure ya do!) please share this post with them. Everyone needs to know if they’re drinking weed killer.\n\nP.S. After you’ve read Feeding You Lies, I have one small favor to ask. Please leave an honest review of the book online here. It’s time the truth comes out.", "opengraph": {"locale": "en_US", "type": "article", "title": "BREAKING: Roundup found in beer & wine samples (See the brands)", "description": "We all know that alcoholic drinks are not a health food – and alcohol itself is linked to cancer. But, these new findings are just further evidence that this hazardous weed killer is ending up in almost everything that we eat and drink. How much weed killer are we each eating every day? Breaking new … Read More", "url": "https://foodbabe.com/breaking-roundup-found-in-beer-wine-samples-see-the-brands/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2019-02-26T01:25:20+00:00", "article:modified_time": "2019-02-26T03:02:04+00:00", "image": "https://foodbabe.com/app/uploads/2019/02/image1.jpeg", "image:width": "640", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["Guinness", "Frey", "Budweiser", "heineken", "Sutter Home", "herbicides", "wine", "Beer", "Sierra Nevada", "New Belgium", "weedkiller", "Samuel Smith", "Barefoot", "Stella Artois", "pesticide", "Tsingtao", "Bayer", "Monsanto", "Pesticides", "Coors Light", "peak organic", "Beringer", "weed killer", "Inkarri Estates", "peak", "herbicide", "weed", "Feeding You Lies", "Sam Adams", "book", "glyphosate", "Corona", "Critics", "Miller Lite", "Ace Perry"], "tweets": [], "movies": [], "links": ["https://calpirg.org/feature/cap/glyphosate-pesticide-beer-and-wine", "https://www.nytimes.com/2015/03/21/business/who-report-links-ingredient-in-roundup-to-cancer.html", "https://foodbabe.com/scientists-said-monsanto-chemical-was-safe-they-were-wrong-it-causes-cancer/", "https://calpirg.org/feature/cap/glyphosate-pesticide-beer-and-wine", "https://calpirg.org/feature/cap/glyphosate-pesticide-beer-and-wine", "https://feedingyoulies.com/", "https://feedingyoulies.com", "http://detoxproject.org/glyphosate/glyphosate-is-everywhere/", "http://www.huffingtonpost.com/carey-gillam/fda-finds-monsantos-weed_b_12008680.html", "https://foodbabe.com/monsanto/", "https://detoxproject.org/glyphosate-in-food-water/", "https://detoxproject.org/glyphosate-in-food-water/", "http://www.momsacrossamerica.com/glyphosate_testing_results", "https://detoxproject.org/glyphosate-in-food-water/", "https://foodbabe.com/monsanto/", "https://foodbabe.com/monsanto/", "https://www.reuters.com/article/us-glyphosate-pollution/u-s-researchers-find-roundup-chemical-in-water-air-idUSTRE77U61720110831", "https://foodbabe.com/emails-epa-monsanto-now-revealed-contents-sickening/", "https://www.ehn.org/when-safe-may-not-really-be-safe-2621578745.html?rebelltitem=4#rebelltitem4", "https://feedingyoulies.com/", "https://feedingyoulies.com/", "https://www.amazon.com/gp/product/1401954545/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954545&linkId=9a5cef928bf361ee6087541b7085cf23", "https://www.barnesandnoble.com/w/feeding-you-lies-vani-hari/1128022434?ean=9781401954543", "https://www.indiebound.org/book/9781401954543", "https://www.amazon.com/gp/product/B07TSF5BRV/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=B07TSF5BRV&linkId=793e1bf36818658164c1f58ef71f9b4d", "https://www.amazon.com/gp/product/1401954561/ref=as_li_qf_asin_il_tl?ie=UTF8&tag=foobab-20&creative=9325&linkCode=as2&creativeASIN=1401954561&linkId=5783a1c6c7bb63b79b0a4be75c2a552b", "https://www.parkroadbooks.com/book/9781401954543", "https://www.booksamillion.com/p/Feeding-Lies/Vani-Hari/9781401954543", "https://feedingyoulies.com", "https://amzn.to/2GRdRG5", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2019-02-26T01:25:20+00:00"}