{"result_id": "116039", "URL": "https://foodbabe.com/healthy-food-destroying-gut/", "timestamp": "2023-04-25 15:06:53 CEST+0200", "meta": {"description": "Is This Healthy Food Destroying Your Gut?", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/healthy-food-destroying-gut/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Is This Healthy Food Destroying Your Gut?", "cleaned_text": "I love spreading the word about healthy living on national TV but it’s so hard to get in everything I want to say in just a few minutes! Alas, that’s why I love blogging and long investigative posts. Hope you enjoy the clips below from Access Hollywood and The Better Show. I discuss what healthy food could be destroying your gut and how to incorporate my favorite superfoods into your diet.\n\nAccess Hollywood: Our Food Is Processed To Death!\n• Our food has been “processed to death” and the majority of nutritional value has been taken out. It’s up to us to take back control of our food, by finding out what’s in it.\n• When the FDA took on authority to regulate the additives in our food there were only about 800, and now there’s about 10,000! The FDA has even admitted that they don’t have the capability to monitor all the of the chemicals that the American public are being exposed to.\n• I used to live a rat race lifestyle, working in the corporate world. I was about 30 pounds heavier than I am now, had tons of skin issues, asthma, and on several prescription medications. I was able to heal myself naturally with an organic non-GMO diet. This is what inspired me to write\n\nA couple tips to help you eat “The Food Babe Way“:\n\nFor instance, most cereals in this country contain the preservative BHT. This chemical isn’t used in the same cereals overseas because it’s linked to cancer and is believed to be an endocrine disruptor. The Environmental Working Group (EWG) rates BHT as one of their Dirty Dozen Food Additives out of the 10,000 chemicals in our food supply because some studies on BHT have concerning data. You’ll find this ingredient listed in kid’s cereals, and in “healthy” cereal too!\n\nMany almond milks on the shelf contain emulsifiers like carrageenan, xantham gum, and cellulose. These may cause intestinal inflammation, and a study recently came out that shows some of these ingredients mess with gut bacteria that can affect your metabolism.\n\nWhen you drink a lot of water with your meals, you dilute your digestive enzymes. You want the chewing action of your food to create saliva that will help digest the food that you are eating. Sip on some warm water instead of a large glass of cold water, and you’ll notice that you digest foods faster and you’ll feel less bloated. This is the habit in Day 3 of The Food Babe Way.\n\nThe Better Show: How To Add Superfoods To Your Diet The Food Babe Way!\n• Goji Berries are chewy and sweet, and I use them in my trail mix, granola, and oatmeal. Goji berries are great for eyesight, fertility, and have a ton of antioxidants.\n• Raw Cacao can boost your mood, your serotonin and your endorphins.\n• Tempeh (fermented soybean) is a healthier way to enjoy soybeans because it removes the estrogen mimicking properties. You can cut tempeh really thin and make a tempeh rueben sandwich with some sprouted grain bread, or saute it like tofu.\n• Kimchi comes from Korea and is one of my favorite fermented foods. It’s salty and can be spicy too. According to ancient Chinese medicine disease starts in the gut. Adding fermented foods like kimchi can add beneficial bacteria to your gut to help crowd out the bad bacteria and keep you healthy.\n• Chia is an amazing superfood with an abundance of fiber and omega-3 fatty acids. The Aztecs survived solely on chia seeds in times of famine. They expand and gel up in water, and they expand in your stomach to make you feel fuller without adding any synthetic fibers to your diet.\n• Hemp Seeds have an amazing ratio of omega-3 to omega-6 fatty acids. Americans consume way too much corn and soy oils which make our omega-3 to omega-6 ratio totally out of wack. That’s why there are products at the store that are fortified with omega-3’s. A better way is to eat foods like hemp seeds that naturally have the perfect balance. Hemp seeds are also high in protein that is easy for your body to digest. I add organic hemp protein to my after-workout smoothies.\n• Quinoa has a nice amount of protein, and is a great option for those that eat gluten-free. It’s a great substitute for rice, or you can even make a salad out of it with some raw vegetables. It’s very versatile. Check out my tabboulehi salad here.\n• Maca is a root that comes from Peru, and it’s a great supplement to add to your diet. It helps with your hormones, menopause and stress. A lot of people don’t realize that when they are stressed that they produce cortisol that can promote fat storage in the body. So, maca can help counter that if you are stressed out.\n• Sprouts are so amazing, and many people don’t realize that mini sprouted versions of their favorite vegetables are sometimes more nutritious that the actual full grown plant. This is one of the cheapest ways to add organic foods to your diet. You can start a little sprout garden in a kitchen window and start growing your own.\n\nIf you know someone who could use these superfoods and health tips, please share this post with them!\n\nP.S. In my #1 best selling book The Food Babe Way – I teach you even more ways you can break free from the hidden toxins in your food, lose weight, look years younger and get healthy in just 21 days. In my 2nd book, Feeding You Lies, I blow the lid off of the lies we’ve been fed about the food we eat – lies about its nutrient value, effects on our health, label information, and even the very science we base our food choices on. And, my first cookbook, Food Babe Kitchen, contains over 100 mouthwatering recipes to show you how delicious and simple it is to eat healthy, easy, real food. Available anywhere books are sold.", "opengraph": {"locale": "en_US", "type": "article", "title": "Is This Healthy Food Destroying Your Gut?", "description": "Is This Healthy Food Destroying Your Gut?", "url": "https://foodbabe.com/healthy-food-destroying-gut/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-03-24T17:27:01+00:00", "article:modified_time": "2020-06-09T20:45:29+00:00", "image": "https://foodbabe.com/app/uploads/2015/03/TV-Clips.jpg"}, "tags": ["hemp", "video", "tv", "Hemp Seeds", "videos", "superfoods", "Media", "goji berries", "raw cacao", "Kimchi", "fda", "quinoa", "The Food Babe Way", "chia", "tempeh", "Access Hollywood", "The Better Show", "sprouts", "maca", "tv appearance"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe class=\"embed-responsive-item\" src=\"https://www.youtube.com/embed/an2DLZpkInM?l=0&amp;modestbranding=1&amp;autohide=1&amp;showinfo=0&amp;controls=0&amp;rel=0\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><br/></iframe>", "src": "https://www.youtube.com/embed/an2DLZpkInM?l=0&modestbranding=1&autohide=1&showinfo=0&controls=0&rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe class=\"embed-responsive-item\" src=\"https://www.youtube.com/embed/DjjLKXFz-Fs?l=0&amp;modestbranding=1&amp;autohide=1&amp;showinfo=0&amp;controls=0&amp;rel=0\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><br/></iframe>", "src": "https://www.youtube.com/embed/DjjLKXFz-Fs?l=0&modestbranding=1&autohide=1&showinfo=0&controls=0&rel=0"}], "links": ["http://www.accesshollywood.com/eat-clean-the-food-babe-way_video_2666537", "http://better.tv/view/food--amp--recipes2-food--amp--recipes-what---s-the-food-babe-way&url=video-player-btr-cc-rec&utm_source=s_t_tp&utm_medium=cc_rec_btr_slf_sb_v1&utm_campaign=all", "https://amzn.to/3dPOvpj", "https://amzn.to/2WUJIfs", "https://amzn.to/3c4kJvX", "http://www.amazon.com/gp/product/0316376469/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0316376469&linkCode=as2&tag=foobab-20&linkId=XZDWYIMJEQSW4CG7", "http://www.amazon.com/gp/product/0316376469/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0316376469&linkCode=as2&tag=foobab-20&linkId=XZDWYIMJEQSW4CG7", "http://amzn.to/1GQdlyN", "http://amzn.to/1GQdoL4", "http://amzn.to/1FAH1mo", "http://amzn.to/1LTgbcY", "http://amzn.to/1LTggxd", "http://amzn.to/1LTglkk", "https://foodbabe.com/quinoa-tabbouleh-salad/", "http://amzn.to/1HzTAPy", "https://amzn.to/3dPOvpj", "https://amzn.to/2WUJIfs", "https://amzn.to/3c4kJvX", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-03-24T17:27:01+00:00"}