{"result_id": "116029", "URL": "https://foodbabe.com/marketing-artificial-color-children-illegal-amazing-story/", "timestamp": "2023-04-25 15:06:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/marketing-artificial-color-children-illegal-amazing-story/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Marketing Artificial Color To Children Should Be Illegal (Amazing Story)", "cleaned_text": "I’ve got some real idiotic news about Trix Cereal… but first let me explain why I’m so angry about it. If you’re part of the Food Babe Army, I doubt you’re filling your carts up with Trix and Lucky Charms at the grocery store. That’s because you are some of the smartest consumers out there when it comes to your food. You know what to look for on an ingredient list, what additives to avoid, and how to keep the GMOs out of your diet.\n\nPeople sometimes criticize me for writing about processed junk foods like Trix because they think it’s obvious how unhealthy it is… but there are still a lot of people out there who do not know this information. They do not know what additives like Yellow #5 and TBHQ could be doing to their health or the health of their kids. They do not know that there could be Roundup weedkiller in their Cheerios, silly putty in their french fries, or wood in their cheese. We still need to reach these people! That’s why it’s important to keep raising awareness of these issues.\n\nI also want to keep y’all informed as to what’s happening in the processed food world so that you can spread the word to your own friends and family who need to know this information. Our movement is growing, but there are still SO MANY people we need to reach… and this sad news about Trix really helps make my point…\n\nGeneral Mills just announced they’re putting the artificial dyes – Yellow #6, Blue #1, Red #40 – back into Trix Cereal because they were “besieged” by customer complaints since they removed these dyes two years ago.\n\nYou may recall, General Mills announced with big fanfare a couple years ago that they’d remove chemical dyes from all their cereals and replace them with natural colors like turmeric extract, vegetable and fruit juices. They later claimed sales of the dye-free Trix “exceeded expectations” along with great feedback from customers, which makes it even more perplexing as to why they suddenly pulled a 180. They’re going to start selling their original version of Trix with “neon bright” fake colors as soon as next month (both versions will be available).\n\nWho is asking General Mills to put artificial dyes in their children’s food? Are you or anyone you know actually calling up General Mills and complaining about the color? Do the fake colors really make Trix taste better? I really want to know the reasons why anyone would want their children to eat Blue #1 and Yellow #6.\n\nI truly believe if consumers knew that these colors are derived from petroleum, what they do to their bodies and how they have been shown to affect children, they would not want to eat them. We clearly still have so much work to do and need to keep spreading the truth.\n\nThe Feingold Association recently thanked us in their newsletter for our successful petition which got the artificial dyes out of Kraft Mac n’ Cheese, along with a story about how one little boy’s life was changed forever when artificial dyes were removed from his diet (following our petition). They graciously granted me permission to publish the entire story here to reach more people and impact as many lives as possible. When I launched the Kraft petition, I received countless letters like this one, and I know that thousands of you are having the same experiences. I hope you read and share this story below with your loved ones and keep sharing the truth about artificial food dyes.\n\nCameron — a little boy with no speech and endless tears\n\nFrom birth, Cameron was “different.” He was very moody, angry, hated being touched and would not sit still —EVER. He hated car rides, being in a stroller, being carried, sung to; you name it. Other than video games, he hated everything. He never slept for more than a few hours at a time and averaged about five hours. He woke up at night for no obvious reason 5-15 times a night until the age of 5. He spit up every time he ate until he was 3 years old, and he would break out in hives all over his body. At 1 1/2 we took him to an allergist, who said it was food sensitivities and he would outgrow it. He didn’t.\n\nCameron’s behavior was horrible. In stores, he would run away and hide. In the car, he would scream until he vomited and he gave me two black eyes before he was three years old. He couldn’t speak; he would make sounds but no distinguishable words. We took him for a hearing test, which was fine, and they recommended occupational therapy. He was very uncooperative, but we continued with it two times a week for a year.\n\nWhen Cameron was four he started speech therapy, but he hated it. He would scream until he began vomiting. He wouldn’t participate with his speech therapist but would kick, hit and spit at her. She suggested medication to help subdue his outbursts. He didn’t know the alphabet or colors but was very good at math. We started thinking he was mildly autistic. He still was not sleeping and was getting hives daily. He craved food with dyes like a junkie craves heroin.\n\nCameron started 4-year-old kindergarten, and it was horrible. He hated it as much as his teacher hated him. He was the worst-behaved kid in a classroom of thirty-five 4-year-olds. His teacher also suggested looking into medicine, as she didn’t think he would be able to function in mainstream school. But I was firmly against medicating him and started considering homeschooling.\n\nHere is a sequence of pictures I took as Cameron ate a blue lollipop (before I learned about additives). I can now see how he became progressively more miserable. In the last two pictures, there are tears rolling down his cheeks. That final picture gets me every time I look at it!\n\nThe following day, I took him for his first allergy appointment. The allergist said he had sensitivities. “Nothing to worry about. It won’t kill him. He should outgrow it by age 4.”\n\nMy “Ah-ha moment”\n\n In the spring of 2013, I saw an online petition calling for Kraft to remove dyes from its mac & cheese because the additives could cause ADHD, mood swings and hives. This was my “ah-ha” moment!\n\n\n\nThe previous night, Cameron had eaten Kraft Mac & Cheese and he didn’t sleep and was covered in hives. I decided to try taking out food dye for a week to see if his hives went away. They did! We were amazed that after only a few days, he didn’t severely itch. After a few weeks, when he had had very limited exposure to food dyes, I noticed his behavior was different. I thought maybe he was getting sick.\n\nThen, Cameron gave me a hug all on his own! This had never happened before. What’s more, he was waking up only a few times a night instead of ten. He wasn’t so angry, and he wasn’t as itchy. And, after thirty days of being dye-free, he could SPEAK! Nearly perfect, clear words that everyone could understand. For the first time ever, he said, “I love you.”\n\nI spent most of that month in tears because of the life-changing miracles that came from removing dyes. He literally learned his colors overnight. I spoke with him about these changes, and he said his body didn’t hurt as much as it used to and his head didn’t buzz as much. I then realized my son spent the first five years of his life in constant pain and didn’t know he was supposed to feel any different. We were dye-free for three months and doing great; then, we went to a 4th of July parade. He was perfectly behaved until I let him have some cotton candy, and all hell broke out! He was yelling, crying, screaming, curled up in the fetal position having a complete breakdown. This reaction to dye took five days to wear off.\n\nHow the additives affect him\n\n If Cameron ate the petroleum-based dyes, artificial flavors or preservatives eliminated on the Feingold Diet he would experience these reactions: anger, body & joint pains, hives, impaired learning, ringing/buzzing in his ears, stomach pain, anxiety, rapid & loud speech, bipolar tendencies, and the inability to follow simple directions.\n\nI decided it was all or nothing. No food coloring, ever!\n\n Things were much better that winter, and I also noticed a major change in Cameron’s dad. He cut back on his dye consumption. (He was completely addicted to Jolly Ranchers, Sour Patch Kids and Mountain Dew.) But now, he wasn’t as angry at the world like he had always been and was just nicer in general. Who knew that dyes could affect adults? (They also affect pets. My dog will rip up toys if he eats anything with dye in it.)\n\nHe had felt miserable so it’s no wonder he acted miserable as well.\n\n By March of 2014, we were about one-year dye-free, and Cameron was complaining about body pain again, and he had what doctors kept referring to as eczema. That’s when I stumbled across the Feingold Diet and thought, “This sounds like the symptoms Cameron is having now right down to the ADHD and behavioral issues.” I ordered the membership materials and have never looked back. The Feingold Association provides a long list of brand-name foods that are free of dyes, artificial flavors and the three worst preservatives. They also show how to test for salicylate sensitivity. We removed all preservatives from Cameron’s diet, and things slowly began to improve. (Preservatives are hard to identify because of loopholes in labeling laws. Chemicals like BHA, BHT and TBHQ can be hidden in the ingredients in a product or sprayed on the insides of the packaging and do not need to be listed.) I kept a daily food & behavior journal for Cameron; if it went in his mouth, it was written down. This was a huge help in identifying a possible culprit. \n\n\n\nAfter being dye-free for just thirty days, Cameron experienced the following:\n\n1. Hives subsided\n\n 2. Anger diminished\n\n 3. Started speaking\n\n 4. Learned his colors\n\n 5. Slept better at night\n\n 6. Body pain lessened\n\n 7. Developed compassion & empathy\n\n 8. Began to socialize (He couldn’t handle being in public places with any number of people prior to this.)\n\nCameron started kindergarten, free of artificial colors and flavoring at the same school where two previous teachers “suggested” medication. Three months into the school year, he was awarded “Student of the Month.” He no longer needed speech therapy or an IEP. The therapist had no explanation as to why he suddenly could talk, but I am 100% certain it is from removing the additives. His occupational therapist contacted me three years after her last meeting with him, saying she couldn’t believe the progress he had made. She said she assumed he would always have major issues.\n\nFood sensitivity avoidance has become our way of life. We follow the Feingold Foodlist almost 100%. Cameron still has “eczema” flare-ups occasionally, but they are not as severe. There are zero behavior issues that we deal with now. Cameron sleeps an average of eight hours a night, seven days a week. He has never been sent to the principal’s office, and he actively & willingly participates in school. We still need to tweak his diet on a regular basis and watch for things, but it is much easier now. We also found Cameron can have reactions to dyes in soap, shampoo, temporary tattoos, toothpaste etc., so, all of that must be dye-free also.\n\nThe last accidental food coloring exposure was in May 2014. Within twenty minutes of ingesting a microscopic amount of red dye 40, he was curled into the fetal position, lying on the floor, under the table in a restaurant, experiencing severe body pain & itching. An hour after ingestion, his speech became loud and rapid, and he was unable to hear us when we tried to speak to him. For two hours after exposure to the dye, he repeatedly used the word “what.” His behavior became manic, but while this subsided quickly, the body pain lasted several days. We have found that soaking in a bath with baking soda can lessen some of the symptoms as it helps draw out toxins. We went dye-free in 2013, to try and clear up the hives issue. I never in a million years would have thought additives in food could be linked to Cameron’s behavior, but after seeing the cravings for and withdrawal from food coloring, I can honestly say it should be illegal. It is addictive and mind-altering, just like any other drug.\n\nSuccess at last!\n\n After consulting many allergists, dermatologists, pediatricians & pediatric rheumatologists for more than five years, and not getting help, we finally figured out my son’s issues. It began with an online petition and continued with the help and guidance of the Feingold Association. Happily, Kraft removed the synthetic food coloring from its Mac & Cheese in 2016.\n\n ~ Feingold Association Pure Facts Newsletter, September 2017\n\nI am so moved by this story and would love to see these dyes banished from our food forever. I hope this information helps every family out there who is affected by the dyes in our food. Please share this post and Cameron’s story with your loved ones. You never know who it may help!", "opengraph": {"locale": "en_US", "type": "article", "title": "Marketing Artificial Color To Children Should Be Illegal (Amazing Story)", "description": "I’ve got some real idiotic news about Trix Cereal… but first let me explain why I’m so angry about it. If you’re part of the Food Babe Army, I doubt you’re filling your carts up with Trix and Lucky Charms at the grocery store. That’s because you are some of the smartest consumers out there … Read More", "url": "https://foodbabe.com/marketing-artificial-color-children-illegal-amazing-story/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2017-09-28T17:09:04+00:00", "article:modified_time": "2017-09-28T17:14:29+00:00", "image": "https://foodbabe.com/app/uploads/2017/09/Cameron.jpg", "image:width": "640", "image:height": "640", "image:type": "image/jpeg"}, "tags": ["Kraft", "feingold", "Artificial Dyes", "Yellow #5", "General Mills", "Artificial Colors", "artificial dye", "Trix", "ADHD", "mac n' cheese", "colors", "Mac & Cheese", "lucky charms", "Artificial Color", "cereal", "red 40", "artificial coloring", "Kraft Mac & Cheese", "Yellow #6", "blue #1", "feingold association", "dyes"], "tweets": [], "movies": [], "links": ["https://foodbabe.com/kraft-dumps-artificial-food-dyes-after-massive-petition/", "https://foodbabe.com/photo-go-viral-food-additive-now-linked-major-allergies/", "https://foodbabe.com/monsanto/", "https://foodbabe.com/sillyputty/", "https://foodbabe.com/are-you-eating-this-substance-that-lines-food-industry-pockets/", "https://blog.generalmills.com/2015/06/a-big-commitment-for-big-g-cereal/", "http://www.foodbusinessnews.net/articles/news_home/Business_News/2016/07/Trixs_switch_in_colors_exceeds.aspx?ID=%7B1D8DC607-7747-40DD-9871-7897C257A324%7D", "http://www.feingold.org", "https://foodbabe.com/kraft-yellow-petition/", "https://foodbabe.com/kraft-dumps-artificial-food-dyes-after-massive-petition/", "https://foodbabe.com/kraft-yellow-petition/", "https://foodbabe.com/kraft-dumps-artificial-food-dyes-after-massive-petition/", "http://www.feingold.org/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2017-09-28T17:09:04+00:00"}