{"result_id": "116024", "URL": "https://foodbabe.com/5-ingredients-that-should-have-never-been-approved-by-the-fda-are-you-eating-them/", "timestamp": "2023-04-25 15:06:36 CEST+0200", "meta": {"description": "5 Ingredients That Should Have Never Been Approved By The FDA - Are You Eating Them?", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/5-ingredients-that-should-have-never-been-approved-by-the-fda-are-you-eating-them/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "5 Ingredients That Should Have Never Been Approved By The FDA - Are You Eating Them?", "cleaned_text": "The more I learn about the food system, the more passion grows inside me to change it. What I am about to share with you will have you gasping for air – it’s so downright appalling. There’s a sorry state of affairs regarding the approval of new food ingredients in this country, and there is a BIG misconception that the FDA diligently reviews and approves them all.\n\nThe media has reported some serious mistakes made by the FDA in the recent past, like approving a tea that contained cocaine to be sold in the U.S. and approving a new pain killer that their own advisory committee voted against. While these actions are very telling, I’m focusing here on what the media hasn’t been talking about. A glimpse into the last few decades of FDA oversight shows how little the FDA has done to improve the food system in this country, how they have allowed us to eat harmful food additives and fail to act (sometimes for years) after an ingredient has been found to be unsafe.\n\nThere are several products that have been deemed “FDA Approved” or “Generally Recognized As Safe” which were yanked from market years after they were shown to be downright dangerous. What’s really scary about this is that history shows that something very serious needs to happen – like deaths – before the FDA takes action. Does someone really need to die before an ingredient is banned? In the eyes of the FDA, that may be the case. I thought I’d put together a few examples for you of ingredients that have been allowed into our food supply, despite ample research showing that they’re harmful. The fact that these are (or have been) allowed in our food is outrageous, as there are safer ingredients and practices that could be used by the industry.\n\nThe FDA approved sulfite preservatives on fresh produce in 1982, despite evidence that sulfites could trigger asthma attacks. Soon after, many people got sick and some even died after eating salads laced with sulfites in restaurants. The Center for Science in the Public Interest (CSPI) claimed to have documented over a dozen deaths, and petitioned the FDA to ban its use – yet the FDA failed to act for 4 long years. The FDA finally banned sulfites on fresh produce in 1986 and subsequently limited it in other foods.\n\nREGULATORY STATUS: Banned from Cosmetics in 1990 / Still Approved in Food\n\nAfter finding out that Red #3 causes cancer in animal studies the FDA banned it from cosmetics in 1990. Yet, the FDA still permits Red #3 in our food and you’ll find it in chewing gum, Nesquik Strawberry Milk, popsicles, yogurts, fruit cocktail, Duff’s cake mix, Betty Crocker icing and candy – but you won’t find it legally in lipstick. In 1989, the Washington Post reported that the fruit industry was “enraged” by the FDA’s proposal to ban Red #3 from food, because “Americans like their cherries red” in a can. So they lobbied the House Appropriations Committee to add language to “its report on the FDA’s funding for next year that instructed the FDA not to ban the dye-formally titled FD&C red No. 3-without further study.” This is in violation of the “Delaney Clause” that requires the FDA to ban carcinogenic food ingredients. When they banned it in cosmetics, the FDA said it would “take steps” to ban in it food too. Well, it’s been over 20 years, and we are still waiting for the FDA to take action on Red #3. There are six more artificial food colors that were approved for food and later banned by the FDA: Green 1, Green 2, Red 1, Red 2, Red 4, and Violet 1.\n\nPartially hydrogenated oils are everywhere at the grocery store, especially in the bakery aisle (pies, crackers, cakes, cookies) and in fried foods at restaurants. When partially-hydrogenated oils are manufactured they create artificial trans fats. In the 1990s, research came out that showed trans fat raises the “bad” LDL cholesterol, and lowers the “good” HDL cholesterol, increasing the risk of heart disease. According to the CDC, up to 7,000 deaths and 20,000 heart attacks per year can be attributed to artificial trans fat in the diet – and it’s been shown to be the most harmful fat in our food – yet, the FDA still allows it. After decades of mounting research, the FDA finally made a tentative determination that partially hydrogenated oils are no longer considered GRAS in November 2013 – but that doesn’t mean it’s been taken out of our food. The FDA has still not made a final determination to ban it, despite pleas from the American Heart Association and the American College of Cardiology. Food manufacturers see the writing on the wall and many of them are voluntarily removing partially hydrogenated oils from their products. Beware that even if a product is labeled “0 grams of Trans Fat” it’s permitted to contain up to .5 grams of trans fat per serving, and this is why it’s still very important to check the ingredient list for partially hydrogenated oils to make sure it’s clean of artificial trans fat.\n\nREGULATORY STATUS: Approved in Food / Currently Under Review & “Assessing Consumer Exposure”\n\nCaramel coloring has been deemed “Generally Recognized As Safe” (GRAS) by the FDA and is the most widely used food coloring in the world. Although it sounds harmless, Level IV caramel color contains the cancer-causing byproduct 4-methylimidazole (4-Mel). In 2007, research was published that showed 4-Mel was carcinogenic. Consumer’s Reports tested the levels of 4-Mel in drinks and found it in excessive levels in several soft drinks that contain caramel color. They petitioned the FDA to limit and label its use, however the FDA has not taken this action. The FDA simply released a statement that they would review its safety and “determine what, if any, regulatory action needs to be taken”. Following their presentation at the American Chemical Society Annual Meeting in August 2014, the FDA said they have no reason to believe that current caramel coloring levels are a concern, so it looks like the FDA has no plans to limit, label or ban it. There are 4 levels (types) of caramel coloring and they are only listed on ingredient list as “caramel color” – the type (like Level IV) is not generally disclosed. Given that this coloring is in so many processed foods (sometimes in levels exceeding “safe” standards), it’s difficult to avoid. No one is assessing the cumulative consumption of caramel color from all of these sources. We are still waiting for Starbucks to remove caramel coloring from their drinks in the U.S., especially since they don’t use it in other countries (proving that it’s unnecessary!)\n\nREGULATORY STATUS: Approved in Animal Feed / Voluntary Guidance to Industry Issued in 2013\n\n\n\nThe meat industry uses significantly more antibiotics than the healthcare industry and it’s been reported that animals receive 80% of the antibiotics produced in this country (estimated at 29 million pounds per year). The real reason that industrial farms are systematically feeding their animals antibiotics is to produce bigger animals that grow faster on less food – thereby increasing their profits – and also to help the animals survive the poor conditions they are being raised in. Do you see anything wrong with this picture? The CDC does, and warns that this use is contributing to antibiotic-resistant infections in humans and harming public health. Recent reports indicate that antibiotic resistance can be blamed for at least 2 million illnesses and 23,000 deaths in the U.S. and Dr. Thomas R. Frieden, Director of the CDC is warning, “If we don’t act now, our medicine cabinet will be empty and we won’t have the antibiotics we need to save lives” – a scary prospect. In 2013, the FDA issued guidance for the industry (that goes into effect in December 2016), which recommends halting the use of antibiotics to fatten up animals, along with veterinary oversight of antibiotic use. The FDA’s guidance is voluntary and not legally enforceable:\n\nAccording to Pew Charitable Trusts, there’s a huge loophole that will still permit antibiotics for “disease prevention” in “the absence of any threat from a specific bacterial disease”, which may allow veterinarians to rationalize a prescription for routine antibiotics. Reuters reported,\n\nThe European Union took a stronger stand and banned antibiotics in animal feed for growth promotion in 2006 (nearly 10 years ago!) and “animal food production in these countries continues to thrive, with appropriate adjustments in practices to ensure continued animal health and safety”. Meanwhile in the U.S., the FDA is setting weak voluntary standards that don’t hold much weight.\n\nWhat To Do With This Information:\n\nEven if the FDA does nothing to rid our food supply of these dangerous ingredients, there is an easy way to protect yourself. Organic standards prohibit these ingredients mentioned here, so one of the best ways to avoid harmful ingredients is to choose 100% certified organic food and to prepare your own meals at home with minimally processed ingredients. Beware that organic standards still allow some ingredients with known health risks, like carrageenan. So, you still need to read those ingredient lists and make informed decisions about your food! I realize that this can be a challenge. That’s why I created an Eating Guide that makes meal planning, food shopping, and cooking as effortless as possible.\n\nMy my #1 best selling book, The Food Babe Way, will give you a 21-day plan to put you on the right path to navigating this screwed up food system! My 2nd book, Feeding You Lies, blows the lid off of the lies we’ve been fed about the food we eat – lies about its nutrient value, effects on our health, label information, and even the very science we base our food choices on. And, my first cookbook, Food Babe Kitchen, contains over 100 mouthwatering recipes to show you how delicious and simple it is to eat healthy, easy, real food.\n\nPlease spread the word, the more people that know the truth, the faster this food system will change!", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Ingredients That Should Have Never Been Approved By The FDA - Are You Eating Them?", "description": "5 Ingredients That Should Have Never Been Approved By The FDA - Are You Eating Them?", "url": "https://foodbabe.com/5-ingredients-that-should-have-never-been-approved-by-the-fda-are-you-eating-them/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-01-09T02:11:11+00:00", "article:modified_time": "2020-06-09T18:35:40+00:00", "image": "https://foodbabe.com/app/uploads/2015/01/5Ingredients.jpg", "image:width": "640", "image:height": "351", "image:type": "image/jpeg"}, "tags": ["Ingredients Banned", "fda", "non-gmo", "Food Additives", "ingredients", "organic"], "tweets": [], "movies": [], "links": ["https://foodbabe.com/read-ingredient-lists/", "http://www.nbcwashington.com/news/local/Maryland_Professor_Finds_Cocaine_In_Organic_Herbal_Tea-110420319.html", "http://www.cnn.com/2014/02/26/health/zohydro-approval/", "http://www.huffingtonpost.com/michael-f-jacobson/food-additives-_b_1654034.html", "http://www.huffingtonpost.com/michael-f-jacobson/food-additives-_b_1654034.html", "http://www.nytimes.com/1986/07/09/us/us-issues-ban-on-sulfites-use-in-certain-foods.html", "http://farrp.unl.edu/sulfites-usa", "http://www.gpo.gov/fdsys/pkg/CFR-2012-title21-vol1/pdf/CFR-2012-title21-vol1-sec81-10.pdf", "http://www.ewg.org/foodscores/ingredients/7626-Erythrosine/search?page=1&per_page=48&type=products", "http://articles.chicagotribune.com/1990-04-22/features/9002030888_1_fruit-cocktail-cherries-dye", "http://www.highbeam.com/doc/1P2-1201817.html", "http://www2.ca.uky.edu/agripedia/glossary/delaney.htm", "http://cspinet.org/new/pdf/food-dyes-rainbow-of-risks.pdf", "http://www.fda.gov/ForIndustry/ColorAdditives/ColorAdditiveInventories/ucm106626.htm", "https://web.archive.org/web/20071014012906/http://www.time.com/time/magazine/article/0,9171,945520,00.html", "https://foodbabe.com/app/uploads/2015/01/RedNo31.jpg", "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/trans-fat/art-20046114", "http://www.cdc.gov/nutrition/everyone/basics/fat/transfat.html", "https://www.federalregister.gov/articles/2013/11/08/2013-26854/tentative-determination-regarding-partially-hydrogenated-oils-request-for-comments-and-for", "http://www.heart.org/idc/groups/ahaecc-public/@wcm/@adv/documents/downloadable/ucm_464117.pdf", "http://www.nbcnews.com/id/20349315/ns/health-diet_and_nutrition/t/zero-trans-fat-doesnt-always-mean-none/", "https://foodbabe.com/starbucks-pumpkin-spice-latte/", "http://ntp.niehs.nih.gov/results/pubs/longterm/reports/longterm/tr500580/listedreports/tr535/index.html", "http://www.consumerreports.org/cro/news/2014/01/caramel-color-the-health-risk-that-may-be-in-your-soda/index.htm", "http://notinmyfood.org/press_release/consumer-reports-tests-show-consumers-unnecessarily-exposed-to-potential-cancer-risk-in-many-soft-drinks", "http://www.foodsafetynews.com/2014/01/fda-to-reexamine-caramel-coloring-in-sodas-due-to-impurity/#.U87svvldWSo", "http://abstracts.acs.org/chem/248nm/program/view.php?obj_id=257746&terms%20", "http://www.foodnavigator-usa.com/Regulation/FDA-provides-update-on-exposure-to-4-mei-from-caramel-colors", "https://foodbabe.com/read-ingredient-lists/", "https://foodbabe.com/drink-starbucks-wake-up-and-smell-the-chemicals/", "https://foodbabe.com/mcdonalds-serves-what-in-london-the-outrageous-double-standard-in-fast-food/", "http://www.wired.com/2010/12/news-break-fda-estimate-us-livestock-get-29-million-pounds-of-antibiotics-per-year/", "http://www.cdc.gov/drugresistance/threat-report-2013/pdf/ar-threats-2013-508.pdf", "http://www.cdc.gov/drugresistance/threat-report-2013/pdf/ar-threats-2013-508.pdf#page=14", "http://blogs.wsj.com/pharmalot/2014/12/10/fda-plan-for-antibiotics-in-food-producing-livestock-has-a-loophole/", "http://www.cdc.gov/media/releases/2013/p0916-untreatable.html", "http://www.fda.gov/downloads/AnimalVeterinary/GuidanceComplianceEnforcement/GuidanceforIndustry/UCM299624.pdf", "http://www.pewtrusts.org/en/research-and-analysis/issue-briefs/2014/11/gaps-in-fdas-antibiotics-policy", "http://www.reuters.com/investigates/special-report/farmaceuticals-the-drugs-fed-to-farm-animals-and-the-risks-posed-to-humans/", "http://www.tufts.edu/med/apua/news/press_room_34_846139138.pdf", "https://foodbabe.com/full-list-of-non-organic-ingredients-allowed-in-organic-food/", "https://foodbabe.com/watch-out-for-this-carcinogen-in-your-organic-food/", "https://foodbabe.com/read-ingredient-lists/", "https://foodbabe.com/eat", "https://amzn.to/3dPOvpj", "https://amzn.to/2WUJIfs", "https://amzn.to/3c4kJvX", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-01-09T02:11:11+00:00"}