{"result_id": "116012", "URL": "https://foodbabe.com/healthy-cereal/", "timestamp": "2023-04-25 15:06:23 CEST+0200", "meta": {"description": "Beware Of This Head Fake: Healthy Cereal That Isn't - How the cereal industry fools you into buying cheap ingredients disguised as health food.", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/healthy-cereal/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Beware Of This Head Fake: Healthy Cereal That Isn't.", "cleaned_text": "I’ve always loved cereal and as a child I downed bowls of Golden Grahams for breakfast and sometimes dinner too. When I grew up, I ate Fiber One on top of my yogurt while sitting in my cubicle at work. I thought it was very healthy for my body (because of all that fiber and would help me lose weight), and just didn’t understand why I didn’t look and feel my best after eating it. Thankfully I found much healthier cereal later in life but before I tell you about my favorite kinds, we must discuss what is really going on in the “healthy cereal” industry.\n\nIt’s estimated 94% of us have cereal in the cabinet – but a century ago hardly anyone did. Cereal was the first processed food, making life easier for Americans (and now for people all over the world). Cereal requires no cooking, no skills, and it’s just about as easy as you can get. We want everything to be quick and easy, and this has become an epidemic in this country. This is why cereal has been called the biggest success story of the modern food industry, and as put by author Michael Pollan, “Breakfast cereals in many ways are the archetypal processed food product of modern capitalist food economics”.\n\nMillions of dollars are spent on advertising cereal every year, and while most of it aggressively targets children, they heavily advertise to adults as well – from Trix “Silly Rabbit” commercials, free prizes, online games (advergames), celebrity endorsements, product placements, and the marketing messages on the box – we are inundated with their marketing messages every day. It’s all done to make us believe that we don’t have time prepare real food for our families and that their vitamin-fortified creations will give us (and our kids) the energy we need to get through a hard day.\n\nBut, when you take a hard look at cereal, what is it really?\n\nIn reality, the cereal industry is making billions selling us cheap commodities like corn and sugar, mixed with cheap additives like artificial colors, dumped into a colorful box with cartoon characters. Mainstream cereals are so heavily processed that they do not have natural nutrients, that’s why most of them are sprayed with vitamins, minerals, and sometimes fortified with protein. It’s the ultimate fake food.\n\nThe marketing messages on the cereal boxes sure sound healthy: “High Fiber”, “Protein”, “Gluten-Free”, “Low Fat”, “All Natural”, “Essential Vitamins” and “Good Source Of (insert vitamin here)”. But, is cereal really good for us or is it just processed junk food? Several “healthy” cereals contain questionable additives that should never be in a healthy breakfast.\n\nSome of the WORST ingredients you’ll find even in “Healthy” cereal:\n• – This preservative has not been proven safe, controversial research links it to cancer, and it’s believed to be an endocrine disruptor that interferes with your hormones. The Environmental Working Group includes BHT on their Dirty Dozen List of Food Additives – making it one of the most controversial ingredients in our food. You’ll find BHT in many cereals including Special K (most varieties), Rice Chex, Oatmeal Squares, Rice Krispees, Life, Fiber One Honey Clusters, Wheaties, and Smart Start. This ingredient isn’t permitted in cereals in Europe, so these brands reformulate their cereals to sell them legally overseas. Hopefully this ingredient will be history soon. Sign my petition here asking Kellogg’s and General Mills to remove BHT from all cereals and ask them to provide us with a date!\n• – Derived from petroleum and linked to several health issues, including allergies and hyperactivity in children. This is why Europe requires any food containing these dyes to carry the warning label: “May Have an Adverse Effect on Activity and Attention in Children.” You’ll find artificial colors in a lot of cereals targeting kids like Captain Crunch, Apple Jacks, and Fruity Cheerios, but even in cereals you’d never expect like Life Cereal, Kellogg’s Smart Start, and Special K Fruit & Yogurt.\n• – I do everything in my power to avoid GMOs. That’s because these ingredients are not required to undergo any FDA premarket safety assessments, increase pesticide and herbicide use, and may be threatening food availability while increasing food costs. Perhaps most importantly, as put by the respected scientists at Consumer Reports, “There is global scientific agreement that genetic engineering has the potential to introduce allergens and toxins in food crops, to change the nutritional value, and to create other unintended changes that may affect human health”. The growing of these crops needs to stop and they definitely shouldn’t be in our food! These major cereal brands admit to “likely” using GMO ingredients:\n\nQuaker: “We do not require or exclude the use of these ingredients, so we don’t require our suppliers to provide this information. As a result, we cannot give you a definitive yes or no answer. That said, we’re glad for the chance to provide some clarification about genetically modified ingredients. When it comes to safety, the FDA has determined that foods developed through this process are no different than foods developed by traditional plant breeding. And in fact they conclude that these Genetically Modified foods don’t differ from other foods in any meaningful way. Finally, all of our products (worldwide) comply with all applicable food laws and labeling requirements. Quaker relies on and supports the regulatory agencies charged with safeguarding our food supply when sourcing ingredients for our products.” – via email, February 2015. NOTE: Quaker’s parent company, Pepsico, has spent over $8.8 million to fight GMO labeling initiatives in the U.S.\n\nYou’ll likely find these GMO ingredients in mainstream cereals:\n• – Such as beet sugar, fructose, brown sugar, molasses, corn syrup, dextrose. At least one of these sugars is in most cereals including Wheaties, Cinnamon Toast Crunch, and Mueslix.\n• – Most of the corn grown in the U.S. is genetically modified to resist pesticides, and is itself registered as a pesticide with the EPA. Testing by Consumer Reports last year found GMOs in several cereals made from corn: Corn Chex, Kix, Trix, Froot Loops, Cocoa Puffs, and Life cereal.\n• – As found in Bear Naked Granola (owned by Kellogg’s), Apple Cinnamon Chex, Smart Start, Apple Jacks and Berry Berry Kix.\n• – All those wonderful vitamins that you’re ingesting in your cereal probably aren’t natural, and just lab-created vitamins made from a variety of sources like coal tar, petroleum or GMOs. This is why some vitamins disappeared from Cheerios and Grape Nuts when they received non-GMO project verification. These vitamins aren’t believed to be absorbed by your body as well as natural vitamins that you get from food. Recent testing by the EWG found too many vitamins and minerals in some vitamin-fortified cereals, in seriously dangerous levels – especially for kids. You’ll find synthetic vitamins in fortified cereals, but especially in Total, Wheaties Fuel, and Product 19.\n• – They are low calorie, but they may slow down your metabolism and “train” you to crave sweets. Look for aspartame, sucralose, and acesulfame potassium on the label. These lower the total amount of “calories” and “sugars” listed on the nutrition fact label so they’re sometimes found in cereals marketed as healthy like Special K Protein and Fiber One.\n\nYou’ll also want to watch out for “non-GMO” cereals like those made by Kashi that contain several ingredients that were likely extracted with the neurotoxin hexane (and may contain residues), such as soy protein isolate and defatted soy grits. Kashi also uses canola oil which is processed to death and not the most nutritious form of fat.\n\nOne cereal that really gets me fired up is Froot Loops.\n\nDid you know Froot Loops is now considered one of Kellogg’s Top 5 cereals? Millions of Americans feed this to their kids. The problem with Froot Loops is they are the perfect example of the alarming double-standard in the quality of food that we get here in the U.S. versus other countries. The ingredients in the U.S. include partially hydrogenated vegetable oil, BHT and several artificial colors: Blue no. 1, Red no. 40, Blue no. 2, Yellow no. 6. In Europe, Kellogg’s doesn’t want to slap a warning label on Froot Loops, so they reformulated it with natural colors derived from spinach, carrots, blackcurrent, and paprika to sell in the European market. They also removed partially hydrogenated oils (linked to up to 7,000 deaths per year) and BHT for our friends overseas. If that’s not reason enough to never buy Froot Loops again, GMO Free USA recently tested it and found 100% of the corn in Froot Loops is GMO and contained “significant levels” of the toxic pesticide glyphosate.\n\nIf you love cereal, here’s how to pick the most nutritious ones:\n\nKeep in mind that just because a cereal is labeled non-GMO or organic, it may not be made with nutritious ingredients – you still want to read those ingredient lists! Look for those that don’t contain any of those unhealthy ingredients mentioned in this post, and choose cereals that are minimally processed and made with real food: seeds, nuts, and dried fruit. Also don’t fall for the “Natural” label as those can still contain GMOs, loads of additives and synthetic pesticide residues.\n\n2 Moms In The Raw Cereal – This grain-free cereal is full of healthy fruit and nuts like almonds, walnuts, bananas, coconut, and dates.\n\nEzekiel 4:9 Sprouted Grain Cereal – The grains in this cereal are whole and sprouted, so they are easier for your body to digest and won’t spike your blood sugar like flour-based cereal grains do. My favorite is their cinnamon raisin flavor.\n\nOne Degree Sprouted Brown Rice Crisps or Erewhon Crispy Brown Rice Cereal: Either of these make an excellent replacement for Kellogg’s Rice Krispies, and are BHT-free.\n\nQi’a Superfood Cereals – I love these blends of whole ingredients like buckwheat groats, chia seeds, hemp seeds, dried cranberries, and almonds. This cereal is delicious mixed with organic yogurt and fruit.\n\nPurely Elizabeth Ancient Grain Granola – Comes in 4 different flavors: original, cranberry pecan, pumpkin fig, and blueberry hemp, made with healthy ingredients like quinoa, amaranth, chia seeds, and raw virgin coconut oil.\n\nChiarezza Cereal, Almighty Mango Goji Cereal – Made from organic chia, hemp seeds, mango, buckwheat, banana flakes, and goji berries. As there are chia seeds in this one, you can also make a yummy pudding by pouring nut milk over it and letting it sit in the fridge for about 25 minutes.\n\nHomemade Granola – It’s easy to stay far away from store-bought granola filled with refined sugar, inflammatory oils, and flavors, because granola is so easy to make at home. My recipe is made with oats, raw pistachios, goji berries and coconut, but it’s very flexible and you can easily substitute your favorite ingredients.\n\nParfait Porridge – I regularly make this recipe and like to make several at once to keep in the fridge for a few days. My porridge is made with raw oat groats (which contain more vitamins, minerals and nutrients than processed steel cut, rolled or instant oats), fresh or frozen fruit, chia seeds and nut milk. It’s incredibly refreshing and healthy – it’s cereal on the go!\n\nIf you know someone in your household still eating unhealthy cereal everyday, please share this post with them! Once they know this information, they can’t go back.\n\nP.S. In my #1 best selling book The Food Babe Way – I teach you even more ways you can break free from the hidden toxins in your food, lose weight, look years younger and get healthy in just 21 days. In my 2nd book, Feeding You Lies, I blow the lid off of the lies we’ve been fed about the food we eat – lies about its nutrient value, effects on our health, label information, and even the very science we base our food choices on. And, my first cookbook, Food Babe Kitchen, contains over 100 mouthwatering recipes to show you how delicious and simple it is to eat healthy, easy, real food. Available anywhere books are sold.", "opengraph": {"locale": "en_US", "type": "article", "title": "Beware Of This Head Fake: Healthy Cereal That Isn't.", "description": "Beware Of This Head Fake: Healthy Cereal That Isn't - How the cereal industry fools you into buying cheap ingredients disguised as health food.", "url": "https://foodbabe.com/healthy-cereal/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-02-24T18:20:23+00:00", "article:modified_time": "2020-06-09T18:34:03+00:00", "image": "https://foodbabe.com/app/uploads/2015/02/Slide19.jpg", "image:width": "640", "image:height": "480", "image:type": "image/jpeg"}, "tags": ["2 moms in the raw", "bht", "breakfast", "Kix", "wheaties", "General Mills", "frosted flakes", "Kashi Go Lean", "ezekiel cereal", "rice krispies", "Cocoa Puffs", "hexane", "Cheerios", "Granola", "Kashi GOLEAN crisp", "Kashi GOLEAN crunch", "Life cereal", "Trix", "Smart Start", "Captain Crunch", "Kashi", "Chiarezza", "Kashi GOLEAN", "kellogg's", "Erewhon", "special K", "Rice Chex", "Fiber One", "froot loops", "Purely Elizabeth", "Quaker", "cereal", "One Degree", "Oatmeal Squares", "Bear Naked Granola", "Qi'a", "Chex", "Apple Jacks"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=p6rZ8vLmoM4", "http://www.huffingtonpost.com/joanna-dolgoff-md/how-advertisers-manipulat_b_718227.html", "http://blogs.wsj.com/cmo/2014/07/17/cheerios-is-king-of-commercial-spending-among-cereal-brands/", "http://www.precisionnutrition.com/all-about-breakfast-cereals", "http://www.humansarenotbroken.com/the-sleazy-story-of-cereals-success/", "http://articles.orlandosentinel.com/1995-07-13/lifestyle/9507100416_1_vitamins-and-minerals-flakes-vitamin-pills", "http://onlinelibrary.wiley.com/doi/10.1111/1541-4337.12121/full", "http://endocrinedisruption.org/popup-chemical-details?chemid=907", "http://www.ewg.org/research/ewg-s-dirty-dozen-guide-food-additives/generally-recognized-as-safe-but-is-it#butylated-hydroxytoluene", "https://foodbabe.com/cereal", "https://foodbabe.com/kelloggs-general-mills-time-provide-date-dropping-bht/", "http://www.forbes.com/sites/rachelhennessey/2012/08/27/living-in-color-the-potential-dangers-of-artificial-dyes/", "http://www.enveurope.com/content/24/1/24/abstract", "http://www.greenerchoices.org/pdf/CR_FSASC_GMO_Final_Report_10062014.pdf", "http://www.epa.gov/pesticides/biopesticides/pips/pip_list.htm", "https://foodbabe.com/confirmed-lab-tests-show-over-30-popular-food-products-contain-gmos-are-you-eating-them/", "http://www.foodmatters.tv/articles-1/how-to-tell-if-a-vitamin-is-natural-or-synthetic", "http://www.gmo-compass.org/eng/database/ingredients/204.vitamins.html", "http://www.chron.com/business/fool/article/GMO-Free-Cereal-Has-a-Vitamin-Deficiency-Which-5284775.php", "http://www.precisionnutrition.com/all-about-vitamin-supplements", "http://www.ewg.org/research/how-much-is-too-much", "http://www.cornucopia.org/2010/11/dirty-little-secret-in-the-natural-foods-industry-toxic-chemical-use/", "http://pac.iupac.org/publications/pac/pdf/1987/pdf/5911x1561.pdf", "http://www.ncbi.nlm.nih.gov/pubmed/7884536", "https://foodbabe.com/cooking-oils/", "https://foodbabe.com/cooking-oils/", "https://foodbabe.com/mcdonalds-serves-what-in-london-the-outrageous-double-standard-in-fast-food/", "http://cspinet.org/new/201007201.html", "http://www.cdc.gov/nutrition/everyone/basics/fat/transfat.html", "http://livingmaxwell.com/gmos-weedkiller-found-in-kelloggs-froot-loops", "http://www.beyondpesticides.org/infoservices/pesticidefactsheets/toxic/glyphosate.php", "http://www.nytimes.com/roomfordebate/2014/11/10/should-the-fda-regulate-the-use-of-natural-on-food-products-15/the-word-natural-like-our-food-has-become-polluted", "http://amzn.to/1AGSXhF", "http://amzn.to/17TqESO", "http://amzn.to/1ENgzlB", "http://amzn.to/1w89s20", "https://foodbabe.com/cereal/", "http://www.amazon.com/gp/search/ref=as_li_qf_sp_sr_tl?ie=UTF8&camp=1789&creative=9325&index=aps&keywords=qi%27a%20superfood&linkCode=ur2&tag=foobab-20&linkId=7I664NR7XZGQQYIP", "http://amzn.to/1B9dVHX", "http://amzn.to/1B9e3Hf", "https://foodbabe.com/healthygranola/", "https://foodbabe.com/healthygranola/", "https://foodbabe.com/the-perfect-parfait-porridge/", "https://foodbabe.com/the-perfect-parfait-porridge/", "https://amzn.to/3dPOvpj", "https://amzn.to/2WUJIfs", "https://amzn.to/3c4kJvX", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-02-24T18:20:23+00:00"}