{"result_id": "116041", "URL": "https://foodbabe.com/drinking-alcohol-every-night-to-get-through-this-why-its-the-worst-idea-ever/", "timestamp": "2023-04-25 15:06:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/drinking-alcohol-every-night-to-get-through-this-why-its-the-worst-idea-ever/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Drinking alcohol every night to get through this? Why it's the worst idea ever.", "cleaned_text": "We are going through a crazy time. Undoubtedly the craziest time in my lifetime.\n\nI’ve been having long, personal conversations with my friends about everything going on, doing what we can to build each other up. And many of them expressed frustration about one thing…\n\nEver since the quarantines started they’ve been drinking more alcohol…way more than they normally do. What used to be maybe a weekly (or monthly) occurrence, is seriously becoming an every night of the week habit that is getting out of control.\n\nThey aren’t working, they’re bored and completely stressed out – and turning to booze to make them feel better.\n\nI hate to be a buzzkill, but honestly, I have to say it….\n\nDrinking all the time, especially during this crisis, is one of the worst things you can do right now. You are relying on something that (ironically) is horrible for your health because you are feeling stressed out. There are better ways to handle this situation.\n\nI know you probably don’t want to hear this, but hear me out.\n\nThose nightly “Quarantinis” are detrimental to your immune system.\n\nYou’ve heard alcohol is bad for your liver – but that’s not the only organ it’s affecting.\n\nDrinking too much alcohol disrupts the healthy balance of bacteria your gut. You see, we all have a garden of bacteria living in our intestines (1), which is vitally important to the health of our immune system as a whole (2). The “good” bacteria in your gut helps to keep you healthy (3, 4, 5). When you drink – you create an imbalance in your gut bacteria (6) – which in turn compromises your body’s ability to fight infections (7).\n\nFurther down the line, this can lead to leaky gut syndrome (8) – which creates tiny little holes in our digestive system organs that leak out the good bacteria we need to stay healthy and keep our immune system strong.\n\nWhen you drink, certain white blood cells that are your “front-line” of defense against infections essentially get shut down and are only about ¼ as effective as fighting viruses as they usually are (9). It is a major blow to your natural immune defenses.\n\nHeavy drinking can lead to vitamin and mineral deficiencies as well, because it impairs your body’s ability to absorb nutrients (10). Without necessary nutrients, you’re more susceptible to infections and won’t be able to heal as quickly.\n\nAnd if all this isn’t enough, drinking too much alcohol is known to specifically increase the risk of respiratory infections (11), such as pneumonia and ARDS. Knowing what we know so far about COVID-19 and how it affects the respiratory system… do you think those nightly drinks are worth the risk?\n\nIt’s not just the alcohol that’s shutting off your immune system. Most alcoholic drinks are filled with unhealthy ingredients that are sabotaging you.\n\nWhat’s in your booze (besides booze)?\n\nEver wonder what makes Bailey’s Irish Cream so deliciously brown, or Blue Curacao so tropically blue? What makes Malibu Rum so sweet, or what gives Captain Morgan its golden hue?\n\nYou may never know because ingredient labeling on beer, wine, or liquor is not required by the FDA.\n\nThe alcohol industry has lobbied for years against ingredient labels because they don’t want you to know what you’re drinking. As a result, we know more about what’s in a bottle of Windex than we do about the world’s most popular drinks. After we petitioned beer companies (12) to tell us what’s in their beer, the two largest beer manufacturers began listing their ingredients online (13) – but there is still a lot we do not know.\n\nMy research for The Food Babe Way uncovered a slew of unlabeled additives (14) and crazy ingredients you’d never guess you were drinking. To give you a recap, this might be lurking in your favorite drink:\n• None Roundup Weedkiller / Pesticides ( contaminants found in some beer and wine\n\nSee what’s in these popular drinks…\n\nNOTE ABOUT WHITE CLAW: White Claw says their full ingredient list is “proprietary” – which means it is a secret. “The alcohol in White Claw Hard Seltzer comes from fermented sugars derived from malted gluten-free grains” – which could mean corn syrup, but who knows? They haven’t responded to an inquiry from my team to clarify this yet.\n\nLiquors don’t list ingredients, but what are you mixing them with?\n\nThe decision to drink alcohol is a personal one.\n\nI enjoy wine, champagne, and tequila every now and then. When I do, I make the best choices I can. Having alcohol is not a judgment call that any of us should make for others, unless excessive drinking is ruining someone’s health, family, and personal life. The important thing is to be educated about alcohol, what’s in it, how much should be consumed, and whether you feel it’s something you want to have in your lifestyle.\n\nIf you are finding yourself drowning your quarantine-sorrows in booze, there are healthier and more effective ways to handle your stress.\n\nSo, set down that cocktail and let me show you some strategies that work for me to keep my sanity, which I’m sure could help you as well.\n• Stop going down the news rathole. The news is overwhelming right now and this can cause a lot of stress. And you know what? Stress is a huge immunity killer! So do yourself a favor and use this time to spend with your loved ones. Play games, watch movies at home, cook together, and take time to relax and de-stress. If you live alone, set up online video chats with your friends and family to stay connected. Limit yourself to checking in with the news once or twice a day to stay informed – and then put it away!\n• Write it all down and practice gratitude: Start jotting down your feelings about all that is happening in the world and how you are personally handling it. Tell your own personal story as if you are writing it for someone else. Expressing yourself in writing is very therapeutic. Research has shown that journaling helps people heal during times of stress and trauma (15). Also write out what you are grateful for each day. There is always much to be thankful for and when you start paying attention to it, magic starts to happen.\n• Exercise more, and regularly. Stress hormones like cortisol are reduced when you exercise regularly (16) – plus you release endorphins, which are “feel good” brain chemicals that make you feel happy. Even if the gym is closed, you can still do workout videos at home without any special equipment (besides perhaps a wifi connection or a DVD). You can also go for bike rides, jogs, an long walks outdoors.\n• Start meditating. This a is a majorly effective tool to decrease your stress levels (17), and also reduces your chances of getting sick because chronic stress leads to bodily inflammation, which makes you more susceptible to illness. When you meditate, you calm your mind – and your brain is intimately connected to your organs and the immune system. You don’t need any equipment and there are several free guided meditations available online if meditation is new to you. The practice of yoga is related to this as well and is another great option.\n• Get some sun. When you expose your skin to the sun, you help your body produce more Vitamin D – the “sunshine vitamin”, which supports a happy mood. The simple act of going outdoors has been shown to lower stress and increase well being (18).\n• Make sleep a priority. This is a never-ending cycle. If you are stressed out, it might keep you up at night. And when you don’t get enough sleep you get cranky and more anxious – leading to MORE stress. Do whatever you can to get more sleep to break this cycle. If anxiety is keeping you up at night, try taking some magnesium or melatonin. Get some sun exposure in the morning to set your internal body clock and increase natural melatonin production at night.\n• Take stress-supporting supplements. Adaptogens such as ashwagandha and maca help to support a happy mood and sleep quality. These may make it easier for you to deal with all the stressors in your life.\n• Call up a friend or loved one. It’s really important to stay socially connected. It’s been shown that when you have a social support system around you, you are less likely to feel depressed or anxious (19). Sharing good laugh will keep all your spirits up and relieves your stress like none other! I you can, use Skype, FaceTime, Zoom, or some other video sharing app, so you can see each other too!\n\nWhat are you doing to relieve stress during this crazy time? Tell me in the comments. Let’s share our ideas and support each other. It’s more important right now than ever!\n\nP.S. If you know anyone who is drowning their quarantine sorrows in alcohol, please share this post with them. I hope it inspires everyone to try healthier ways to get our stress under control!", "opengraph": {"locale": "en_US", "type": "article", "title": "Drinking alcohol every night to get through this? Why it's the worst idea ever.", "description": "We are going through a crazy time. Undoubtedly the craziest time in my lifetime. I’ve been having long, personal conversations with my friends about everything going on, doing what we can to build each other up. And many of them expressed frustration about one thing…  Ever since the quarantines started they’ve been drinking more alcohol…way … Read More", "url": "https://foodbabe.com/drinking-alcohol-every-night-to-get-through-this-why-its-the-worst-idea-ever/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2020-05-28T18:27:13+00:00", "article:modified_time": "2020-07-11T02:20:45+00:00", "image": "https://foodbabe.com/app/uploads/2020/04/seltzers.jpg", "image:width": "1200", "image:height": "862", "image:type": "image/jpeg"}, "tags": ["Blue Moon", "quarantine", "liquor", "hard cider", "anxiety", "white claw", "Alcohol Ingredients", "covid19", "steel reserve", "wine", "covid-19", "Beer", "Ritas", "drinking", "booze", "alcohol", "covid", "Redd's hard apple", "Stress", "Coors Light", "Lime-a-Rita", "cornoavirus", "natural light", "drinks", "master of mixes", "clamato", "rose's sweetened lime juice", "Miller Lite", "shock top", "hard seltzer"], "tweets": [], "movies": [], "links": ["#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "#footnotes", "https://thefoodbabeway.com", "#footnotes", "https://foodbabe.com/breaking-roundup-found-in-beer-wine-samples-see-the-brands/", "#footnotes", "#footnotes", "#footnotes", "https://foodbabe.com/6-proven-health-benefits-of-vitamin-d/", "#footnotes", "https://foodbabe.com/tired-anxious-and-irritable-the-one-thing-missing-from-your-health-routine/", "https://foodbabe.com/could-this-be-the-cause-of-a-sudden-weight-gain/", "#footnotes", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2020-05-28T18:27:13+00:00"}