{"result_id": "116038", "URL": "https://foodbabe.com/siri-how-do-i-boost-my-immune-system/", "timestamp": "2023-04-25 15:06:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/siri-how-do-i-boost-my-immune-system/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "How to Boost Your Immunity Naturally", "cleaned_text": "My recent article on the Flu Vaccine has created a great debate here on Food Babe and on my Facebook Wall. I absolutely love this!\n\nDid I tell you I was Policy Debate State Champion three years in a row in high school? I spent all my high school summer months up in places like Dartmouth College researching all the facts and collecting evidence for the topic each year. One year the topic was health care – so I learned a lot about the industry that year.\n\nI’d like to share some everyday habits & eats that build immunity.\n\nThis was my day today. Notice I didn’t eat any fast food like Chick-fil-A. That stuff will will give more than just the flu.\n\nMorning – Started my day out as usual – A big glass of hot water with lemon and cayenne.\n\nLemons are anti-bacterial, have been proven to prevent viruses like cholera and provide a load of vitamin C boosting the immune system. Cayenne helps clean the blood and stimulates your entire body, thus allowing your hormones to work naturally to boost your immune system.\n\nI then took a scoop of Vitamineral Green Powder + 1 of my 15 Billion Adult Formula Probiotics.\n\nProbiotics are crucial for a strong immune system. When your body is filled with billions of strains of bifidobacteria and lactobacillus cultures it prevents pathogens from entering your digestive system because essentially there is no room for the bad bacteria to survive. Pretty cool, eh? I need to dedicate a post just to probiotics. EVERYONE should be taking them. And EVERYDAY. Probiotics are a HUGE immune booster.\n\nAnother immunity building ingredient in the powder is Wheatgrass and a whole load of other flu preventing ingredients – I could go on and on forever.\n\nAnd then I either have some Larry’s Beans Fair Trade Organic Coffee or some green tea – One cup a day is all you need to get the antioxidant boost that helps prevent sickness and disease. More than one cup of coffee is questionable, because it make the body acidic. This same basic principle works for alcohol too.\n\nTo continue with my morning ritual – I headed to the gym for some exercise.\n\nModerate exercise has been shown to reduce the time a person experiences the cold and flu and helps you to naturally prevent contracting viruses in the first place. Exercise stimulates the production of macrophagus, the cells that fight bacteria. Additionally many of your organs are made up of muscles, exercise helps them to function properly preventing disease. This is a great reason to exercise everyday.\n\nThere are always caveats – for you marathon runners and exercise-o-holics – there is a blog post in the NY times that talks about a study conducted last year comparing mice who ran moderately vs. mice who ran for a longer distances or for a longer period of time. The mice who exerted more energy on a regular basis died when infected by the flu vaccine and the mice who moderately exercise survived at a higher rate. You can read about it here and judge it yourself. After working out – I spun up some fresh kale, celery, cilantro, ginger, lemon and garlic Juice. The ingredient I want to highlight here is garlic. Garlic has sulfur-containing compounds, allicin and sulfides that produce antibodies naturally in your bloodstream preventing viruses. My breath wasn’t excited but I could tell my body thoroughly enjoyed it.\n\nAt work I finished my breakfast up with some Chia Seeds and Garden of Life Raw Protein. Chia Seeds are a superfood and a fantastic source of omega 3 fatty acids – They produce phagocytes, the white blood cells that eat up bad bacteria. They also create a strong respiratory system which is key to preventing complications like pneumonia from colds or the flu.\n\nAfternoon – At my desk I devoured a huge salad with arugula, my beet sweetened hummus, avocado, red onion, and blueberries. Lots of immunity fighters here. The beets and the carrots in the hummus provide a ton of carotenoids. Beta carotene increases the number of infection-fighting cells, natural fighter cells, and helper T-cells, as well as being a powerful antioxidant preventing disease from forming in your body. Beta carotene is also converted into Vitamin A – a natural immune boosting vitamin. Beets also cleanse the blood and are great for the liver – your main detoxing organ!\n\nAfter my salad – I wanted to have something delicious with a cup of tea. I had some of this 90% Raw Cacao Bar with Goji Berries. Raw cacao is the number one source of antioxidants in the world. Cacao is jam packed with potent immune system boosting substances called epicatechins. The gogis just top off the benefits with a ton of Vitamin C and polysaccharides – the compounds that help your body resist disease. I never thought a snack like this could be so powerful in your diet… They aren’t called superfoods for nothing. Later in the day, I had Parfait Porridge topped with blueberries and pineapple and mixed raw vegetables for my pre-Yoga snack (with at least 2 hours to digest).\n\nOat Groats, the main ingredient for Parfait Porridge has a modifier called beta glucan that helps your cells find disease more quickly and eliminate them from your body. Pretty freakin’ cool – if you ask me. After work, I rushed over to Yoga One to enjoy a nice hot sweaty session with one my favorite teachers – Johnna Smith.\n\nThe overall benefits of Yoga are so amazing for your immunity that I could yell them from every roof top. But one particular pose – Wheel pose stimulates a acupressure point in the spine that is directly related to your immunity. The “Sea of Vitality” point is said to govern the immune system – especially helping with colds and flus. Being cold and flu season, I stayed in this pose the maximum time today 🙂\n\nObviously I didn’t fly to Tokyo and do this wheel pose and come back today – I tried to sneak some Yoga One pictures in but they didn’t turn out that good. So here’s one from high above Tokyo….\n\nAt Night – I had my Mom’s delicious black chickpeas, indian split lentil soup and lots of steamed broccoli. The beans were cooked with lots of ginger, garlic and cumin – which prevents cough formation when your body comes in contact with respiratory infections… The broccoli has a special compound called sulforaphane which activates certain antioxidant genes and enzymes in specific immune cells that can battle colds and the flu.\n\nDessert – Ginger tea and a few prunes and Wild Incan Golden Berries – All of these ingredients boost the immune system – especially the ginger. I ran out of fresh ginger (because I used it in my juice earlier), but luckily I had this Yogi Tea on hand. Ginger has a serious laundry list when it comes to protecting and building your immunity – It’s antimicrobial, antibacterial, it has two natural anti-biotics, prevents disease from entering your body, inhibits pain receptors, stimulates circulation, eliminates congestion and sore throats, and more and more and more. Lesson here – Get some ginger – I had it three different times today!\n\n\n\nBe happy, healthy and free of the flu!", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Boost Your Immunity Naturally", "description": "My recent article on the Flu Vaccine has created a great debate here on Food Babe and on my Facebook Wall. I absolutely love this! Did I tell you I was Policy Debate State Champion three years in a row in high school? I spent all my high school summer months up in places like Dartmouth … Read More", "url": "https://foodbabe.com/siri-how-do-i-boost-my-immune-system/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2011-10-07T03:16:19+00:00", "article:modified_time": "2012-10-17T15:07:00+00:00", "image": "https://foodbabe.com/app/uploads/2011/10/Lemon-And-Cayenne.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://foodbabe.com/should-i-get-the-flu-shot/", "http://www.facebook.com/thefoodbabe", "https://foodbabe.com/chick-fil-a-or-chemical-fil-a/", "https://foodbabe.com/chick-fil-a-or-chemical-fil-a/", "http://amzn.to/N2rfVk", "https://foodbabe.com/what-a-miracle-food-wheatgrass-bali/", "http://www.amazon.com/gp/product/B00199CE4G/ref=as_li_ss_tl?ie=UTF8&tag=foobab-20&linkCode=as2&camp=217145&creative=399373&creativeASIN=B00199CE4G", "http://well.blogs.nytimes.com/2009/10/14/phys-ed-does-exercise-boost-immunity/", "http://www.amazon.com/gp/product/B002HX0TUO/ref=as_li_ss_tl?ie=UTF8&tag=foobab-20&linkCode=as2&camp=217145&creative=399373&creativeASIN=B002HX0TUO", "http://amzn.to/RTfBf1", "https://foodbabe.com/homemade-hummus/", "http://www.amazon.com/gp/product/B00455VENS/ref=as_li_ss_tl?ie=UTF8&tag=foobab-20&linkCode=as2&camp=217145&creative=399373&creativeASIN=B00455VENS", "https://foodbabe.com/the-perfect-parfait-porridge/", "https://foodbabe.com/the-perfect-parfait-porridge/", "http://www.y1now.com/", "http://www.johnnasmith.com/johnnasmith.com/Johnnas_Teaching_Schedule.html", "http://www.y1now.com/", "http://www.amazon.com/gp/product/B0014ZCCCY/ref=as_li_ss_tl?ie=UTF8&tag=foobab-20&linkCode=as2&camp=217145&creative=399373&creativeASIN=B0014ZCCCY", "https://foodbabe.com/should-i-get-the-flu-shot/", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2011-10-07T03:16:19+00:00"}