{"result_id": "116001", "URL": "https://foodbabe.com/create-safest-organic-natural-nursery-child/", "timestamp": "2023-04-25 15:06:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/create-safest-organic-natural-nursery-child/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "How To Create The Safest, Organic and Natural Nursery For Your Child", "cleaned_text": "When I first became pregnant, I knew right away I wanted to create a safe environment and nursery for my baby. There was so much to research and it all was very overwhelming. Cribs, mattresses, clothes, diapers, toys, strollers, car seats – the list goes on and on and on! I remember walking into Buy Buy Baby for the first time and walking right back out because it was too much to handle! But all my frustration quickly went away after I met the founder of Sprout San Francisco, a natural and organic children’s store in CA. Suzanne Price is a mother of two who has devoted her life researching toxic chemicals in children’s products and their effects on their bodies. When we met while I was on a business trip last year, we instantly hit it off. Her passion was contagious! Suzanne created Sprout to be a one-stop-shop for new parents who want to outfit their nursery with the safest and healthiest products. Sprout has done all the research for us and only stocks their store with products that get their seal of approval. I loved how I could walk in to their store and feel comfortable as a new mom who wants to do the very best for my baby, knowing that everything on the shelves is non-toxic and safe for my newborn.\n\nShopping at Sprout was SO FUN! I didn’t have to stress out researching every little thing myself! The staff made it so simple to outfit my entire nursery and set up a baby registry for my friends and family. I was so impressed with everything they did for me and Harley, that I asked Suzanne to share her top tips and recommendations for a safe, natural and organic nursery in this special guest post.\n\nAlso, to help all the other moms and dads out there, I partnered with Sprout to offer a 15% discount on your purchase when you use the code “FOODBABE” at checkout here.\n\nThese pictures were taken by Little Nest Portraits (highly recommend them!) during Harley’s one week old photo shoot. Still working on commissioning some low VOC art and picture frames for the walls, but Harley’s nursery is almost done!\n\nAt Sprout, we try to provide everything a family needs for a new baby in the healthiest and most natural way possible. We offer a gift registry so people can let their friends know what to buy them, an app to register on their iPhone, and a registry checklist so that parents can make sure they have not forgotten anything they might need. We even provide Healthy Baby Guides on our website that help parents to learn everything they should be looking out for in every category. However, I sometimes forget how overwhelming this can be to parents who are learning about all of it at once for the first time. I decided to break down the main things you need to make sure you have in order to bring your baby home, and what Sprout looks for in each category to make sure it is as healthy for your baby as possible.\n\nCrib and Dresser / Changing Table: Try to find solid wood with low VOC paint. Most cheap cribs are made with particle board that’s stuck together using glue that emits formaldehyde, a known carcinogen. Vani’s Skylar Crib is made in the USA using solid hardwoods (pictured above). You’ll also want a bookshelf to store all the adorable books and picture frames you’ll receive as gifts, as well as a comfortable place to change the baby, such as the top of a dresser with a secured organic changing pad.\n\nCrib Mattress: This is the most important thing to buy organic. Traditional mattresses are made of foam that release particulars into the air (VOCs) that are not good for your baby’s lungs. They are also sprayed with flame retardant chemicals, horrible for a baby to breath and known to cause lots of different health issues. Putting an organic mattress pad cover on a regular mattress does NOT solve the problem. But you should also have an organic mattress pad cover. Sprout sells a variety of organic mattresses. Vani chose Naturepedic (pictured above) and a fully organic co-sleeper here.\n\nCrib Bedding: Since your baby will spend so much time lying on these sheets, it is important to have organic crib sheets. Consider trying a solid white sheet with a patterned crib skirt to add some decoration to the crib if you do not fall in love with any of the organic patterned sheets.\n\nClothing: You are going to get tons of clothing as gifts, and from everywhere, but you should definitely register for things you like. At the very newborn stage, it’s nice to have organic cotton touching your baby’s skin since it has been shown that pesticides can rub off of a finished garment. (Cotton is the most heavily pesticided crop in the country.) I would suggest registering for some layette sets like kimono tops (so they don’t have to be pulled over the head) and pants in organic cotton and let people buy you all the other cute fun outfits for the older sizes. The first few weeks the baby will basically be in a shirt or bodysuit and a swaddle all the time anyway.\n\nBaby Carrier: Our favorite carriers are the adjustable, backpack-style Beco or the wrap-style Solly. Whichever you choose, prioritize organic, since it’s shocking how much the babies suck on the fabric and straps.\n\nBaby Bath: Make absolutely sure that it is free of BPA, PVC, and phthalates. These are 3 terrible chemicals in plastics that will leach into warm water.\n\nCar Seat: Many car seats are sprayed with toxic flame retardant chemicals. Find one that is GREENGUARD or OEKO-TEX® certified, or that promises it does not use any of the worst flame retardants, like Tris. The only infant seat we carry is one we have had tested and know to be free of Tris, the Nuna Pipa.\n\nToys: I always opt for wood or organic cotton over plastic. Phthalates in plastics were outlawed in toys for kids under 3 in 2009, yet nobody really knows this (so don’t take hand-me-downs) and from what I have heard, it is not really enforced, especially for products made overseas.\n\nGlider / Rocker: A glider or rocker isn’t an absolute must-have, but many find it extremely helpful in those early days of nursing your baby in the middle of the night. Make sure to look for one that does not have foam sprayed with flame retardant chemicals. Our exclusive gliders do not have flame retardants or polyurethane foam. Vani has our Como Pure in her nursery (pictured above).\n\nRug: Many rugs are backed with formaldehyde emitting glue. Find a rug for your nursery made of natural fibers with no glue backing, so that your baby will be safe laying on it during tummy time.\n\nArt: To finish off your nursery, add some cute artwork to walls to give the room a personal touch. Just make sure that anything with paint is low VOC. Vani used Natura by Benjamin Moore.\n\nI think this is a good place to start and not get overwhelmed. Of course you can always call or come into one of our stores to ask as many questions you like of our knowledgeable sales team.\n\nIf you want to pick up any of these baby essentials or other amazing safe baby products, feel free to use the discount code “FOODBABE” when you visit Sprout here for 15% off.\n\nI know when you are expecting you have so many things to think about, so I hope this helps you out as much as it did me! And if you know someone who needs safe baby products, please share this post with them.", "opengraph": {"locale": "en_US", "type": "article", "title": "How To Create The Safest, Organic and Natural Nursery For Your Child", "description": "When I first became pregnant, I knew right away I wanted to create a safe environment and nursery for my baby. There was so much to research and it all was very overwhelming. Cribs, mattresses, clothes, diapers, toys, strollers, car seats – the list goes on and on and on!  I remember walking into Buy … Read More", "url": "https://foodbabe.com/create-safest-organic-natural-nursery-child/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2017-02-16T16:05:32+00:00", "article:modified_time": "2017-02-19T18:08:29+00:00", "image": "https://foodbabe.com/app/uploads/2017/02/Nursery-Collage.jpg", "image:width": "640", "image:height": "492", "image:type": "image/jpeg"}, "tags": ["baby registry", "coupon", "discount", "infant", "rocker", "organic", "daughter", "Solly", "sprout", "sprout san francisco", "promo", "Nuna Pipa", "Skylar Crib", "glider", "baby toy", "Beco", "car seat", "baby", "nursery", "crib", "toys", "non-toxic", "promotion", "Como Pure", "baby carrier", "son", "changing table", "registry", "coupon code", "safe", "layette sets", "code", "bedding", "baby bath", "toy"], "tweets": [], "movies": [], "links": ["http://www.sproutsanfrancisco.com/?utm_source=food-babe&utm_medium=blog", "http://www.littlenestphoto.com/charlotte", "http://www.sproutsanfrancisco.com/shop/giftregistry/search/?utm_source=food-babe&utm_medium=blog", "https://itunes.apple.com/us/app/sprout-san-francisco-baby/id594840770?mt=8&utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/pdfs/registrychecklist2016.pdf?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/get-educated/category/healthy-baby-guides?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/cribs-bassinets?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/changers-dressers-nightstands?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/skylar-crib?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/waterproof-changing-pad?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/mattresses-mattress-pads?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/mattresses-mattress-pads?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/snuggle-me-pure", "http://www.sproutsanfrancisco.com/shop/nursery/sheets-sets?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/childrens-clothing/infant-0-24-months?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/childrens-clothing/layette?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/gear/baby-carriers?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/organic-beco-gemini-baby-carrier-black?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/solly-baby-wrap-sky?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/bath-healthy-home/bath-tubs-toys?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/gear/car-seats?utm_source=food-babe&utm_medium=blog", "http://greenguard.org/en/index.aspx", "https://www.oeko-tex.com/en/business/business_home/business_home.xhtml", "http://www.sproutsanfrancisco.com/shop/gear/car-seats/nuna-pipa-infant-car-seat?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/toys?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/gliders-rockers?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/gliders-rockers/como-pure-latex-glider-1?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/rugs-playmats?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/shop/nursery/all-decor?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/events?utm_source=food-babe&utm_medium=blog", "http://www.sproutsanfrancisco.com/?utm_source=food-babe&utm_medium=blog", "http://instagram.com/foodbabemama", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2017-02-16T16:05:32+00:00"}