{"result_id": "116034", "URL": "https://foodbabe.com/shocking-why-are-doctors-recommending-this-toxic-drink/", "timestamp": "2023-04-25 15:06:46 CEST+0200", "meta": {"description": "Shocking: Why Are Doctors Recommending This Toxic Drink?", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/shocking-why-are-doctors-recommending-this-toxic-drink/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Shocking: Why Are Doctors Recommending This Toxic Drink?", "cleaned_text": "I have been receiving emails from the #FoodBabeArmy about an alarming practice that happens at doctor’s offices around the country that needs to stop today.\n\nFirst, however, I was thrilled by the news last week that Coke and Pepsi both announced that they’re (finally) removing Brominated Vegetable Oil (BVO) from their products – which includes Mountain Dew and Powerade. Of course these products are still no good for your body, as they are loaded with sugar or artificial sweeteners, preservatives, phosphates, and artificial colors. Once consumers find out about these questionable ingredients, food companies have nowhere left to hide, but some remain in denial, I’ll get to that in a minute.\n\nThis is a great win for my friend Sarah Kavanagh, an amazing teen food activist (seen below) who started the initial Change.org petition, and also for the #FoodBabeArmy because BVO is one of the most harmful ingredients that is still being used in the U.S., even though it’s banned in Europe and Japan. It’s patented for use as a flame retardant!\n\nAccording to food chemist, Walter Vetter, PhD, “BVO can build up in the body and cause toxic effects”. Most shockingly, there is a published report of a man who had to undergo dialysis after regularly consuming large amounts of Ruby Red Squirt containing BVO. There is another report here indicating that soda with BVO caused the same condition, deteriorating a man to the point that he couldn’t even walk. Of course, these people were drinking an insane amount of soda (up to 8 liters a day), and the cumulative effects on your body when you consume fewer BVO-containing drinks is largely unknown because the research is scarce. Charles Vorhees, a toxicologist at Cincinnati Children’s Hospital Medical Center agrees by saying, “Compounds like these that are in widespread use probably should be reexamined periodically with newer technologies to ensure that there aren’t effects that would have been missed by prior methods…I think BVO is the kind of compound that probably warrants some reexamination.” Out of the research that has been done, it has been shown that BVO accumulates in your body and is linked to heart lesions. As reported in Scientific American, “After a few extreme soda binges—not too far from what many gamers regularly consume—a few patients have needed medical attention for skin lesions, memory loss and nerve disorders, all symptoms of overexposure to bromine”.\n\nGiven this evidence pointing to the dangers of BVO consumption, can you believe that it has taken SO LONG for Coke and Pepsi to finally remove it from their products?\n\nThere really is no excuse. Way back in the 1970s, the FDA began to question the safety of BVO and put the ingredient on “interim status”, which meant that food companies could use it in products until toxicology research was done. Well – guess what? Those studies have not been done in the last 40 years, so it has remained in our food – and the FDA has done nothing about it.\n\nWith the FDA asleep at the wheel, you will still find BVO legally in these drinks by the Dr. Pepper Snapple Group:\n\nI found it incredibly disturbing that some of these sodas “comply with school beverage guidelines” and are being served nationwide in our schools. A member of my team contacted Dr. Pepper Snapple Group and was told they have no plans to remove BVO from any of these drinks because it’s “FDA approved” and has been diligently researched. At least we know the truth and will avoid these drinks at all costs.\n\nAlso, many store brand citrus sodas still contain brominated oil, so watch out for those too.\n\nAnd we aren’t done yet.\n\nThere is one place where BVO is lurking that is reprehensible – and I knew that I needed to bring light to it. A drink containing BVO is being prescribed by doctors to pregnant women everywhere when they get tested for gestational diabetes – a routine test given to nearly all pregnant women in the U.S.\n\nCheck out the ingredients for the “Oral Glucose Tolerance Beverage” by AeroMed:\n\nThese drinks (also known as “Glucola”) are essentially sugar water with hazardous artificial colors and preservatives with a VERY LONG shelf life. They are no better than most sodas on the market – and truly not something you’d want to consume while pregnant. Yet, doctors routinely prescribe this non-carbonated soda to their pregnant patients, without taking into consideration the dangerous ingredients they contain. While it’s certainly important to monitor your blood glucose during pregnancy, there are alternatives to drinking this toxic sugar water.\n\nRealize you have a choice – Simply ask your doctor what other options you have and if they don’t know, educate them!\n\nThe purpose of the drink is to ingest 50 to 100 grams of glucose, after which your doctor can test how your body handles influx of sugar. This woman was given the alternative of eating real food, such as bananas. This study showed that eating 28 jelly beans had the same effect on blood sugar in a 50 gram glucose test. Of course, you’d want to choose a non-gmo variety, free of artificial colors and other nasties!\n\nAn even better option that you can discuss with your doctor would be to avoid the test altogether and monitor your blood sugar with a glucometer throughout your pregnancy, as recommended here, here and here. This is the best alternative because you won’t create an extreme blood sugar spike, and can stick to your regular healthy diet. You will also avoid feeling like you are going to vomit and the dreaded “crash and burn” that women report after drinking glucola – including several Food Babe readers who have reached out to me personally.\n\nAs you can see, there is absolutely no reason that you need to consume these toxic glucola drinks. Now that you are informed, you can make a better choice for yourself and your baby.\n\nRemember, I am not a doctor (take my advice at your own risk), however, in my opinion there is no way in hell any doctor could convince me to drink something with flame retardant, artificial dyes made from petroleum, controversial preservatives and GMOs, pregnant or not!\n\nIf you know someone who is pregnant or is still drinking BVO, please share this critical information with them and let them know they have a choice!\n\nUpdate 12/6/2017: There is now a natural alternative, The Fresh Test, which is an exact equivalent to glucola – but without all the preservatives, dyes, and BVO.", "opengraph": {"locale": "en_US", "type": "article", "title": "Shocking: Why Are Doctors Recommending This Toxic Drink?", "description": "Shocking: Why Are Doctors Recommending This Toxic Drink?", "url": "https://foodbabe.com/shocking-why-are-doctors-recommending-this-toxic-drink/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2014-05-13T16:17:24+00:00", "article:modified_time": "2017-12-06T18:53:37+00:00", "image": "https://foodbabe.com/app/uploads/2014/05/Screen-Shot-2014-05-12-at-11.28.41-PM1.jpg", "image:width": "200", "image:height": "89", "image:type": "image/jpeg"}, "tags": ["Brominated Oil", "Coca Cola", "Crush", "Gestational Diabetes", "Sunkist", "Pregnancy", "BVO", "Pepsi", "Sarah Kavanagh", "Snapple", "Pregnant Women", "Brominated Vegetable Oil", "Dr Pepper", "Glucose Drink"], "tweets": [], "movies": [], "links": ["http://www.change.org/petitions/powerade-if-gatorade-can-take-crazy-chemical-bvo-out-of-sports-drinks-so-can-you", "http://www.change.org/petitions/gatorade-don-t-put-flame-retardant-chemicals-in-sports-drinks", "http://www.mayoclinic.org/bvo/expert-answers/faq-20058236", "https://register.epo.org/application?number=EP08845889&tab=main", "http://www.webmd.com/food-recipes/news/20130129/brominated-vegetable-oil-qa", "http://www.nejm.org/doi/full/10.1056/NEJM200305083481921", "http://www.ncbi.nlm.nih.gov/pubmed/9140329", "http://www.scientificamerican.com/article/soda-chemical-cloudy-health-history/", "http://journals.cambridge.org/action/displayAbstract?fromPage=online&aid=832064", "http://www.sciencedirect.com/science/article/pii/0041008X72902505%20", "http://www.scientificamerican.com/article/soda-chemical-cloudy-health-history/", "http://www.ecfr.gov/cgi-bin/text-idx?c=ecfr&sid=2fd89a433f5a41b73e5436c22e7bf081&rgn=div5&view=text&node=21:3.0.1.1.11&idno=21", "http://www.foodnavigator-usa.com/Regulation/FDA-Brominated-vegetable-oil-BVO-is-safe-so-removing-its-interim-status-is-not-a-priority", "http://www.dpsgproductfacts.com/school", "http://www.aero-med.com/images/AM%20EasyDex%20Literature%201.07%20rev.pdf", "http://boston.todaysmama.com/2011/08/third-trimester-glucose-test-alternatives/", "http://www.ajog.org/article/S0002-9378(99)70099-2/abstract", "http://www.surfsweets.com/our-candy/jelly-beans/", "http://wellnessmama.com/6214/pregnancy-prenatal-care-healthy-option/", "http://chriskresser.com/how-to-prevent-diabetes-and-heart-disease-for-16", "http://pregnantatkids.blogspot.com/2013/09/alternatives-to-glucose-tolerance-test.html", "http://www.thefreshtest.com", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2014-05-13T16:17:24+00:00"}