{"result_id": "116026", "URL": "https://foodbabe.com/cooking-oils/", "timestamp": "2023-04-25 15:06:37 CEST+0200", "meta": {"description": "Processed To Death - Get These Cooking Oils Out of Your Pantry STAT!", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/cooking-oils/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Processed To Death - Get These Cooking Oils Out of Your Pantry STAT!", "cleaned_text": "Whenever I see the chefs on Food Network using canola oil I want to scream at the TV… and I have to admit, I sometimes do.\n\nThat’s because for years I was misled into thinking that canola oil was healthy and would buy quarts of it. I recently received an email newsletter from “CanolaInfo.org” with their “Top 10 Pantry Essentials” for a healthy 2015, and of course canola oil was at the top of their list. The canola industry is doing an amazing job marketing canola oil as “heart healthy” and “natural”, but it’s a total sham. I feel the same way about corn oil and recent commercials proclaiming that it’s healthier than olive oil. We’re being persuaded to believe these oils are healthy, thanks in part to the work of the Canola Council, the Corn Refiners Association, and their own (industry funded) research. In reality, these popular oils have been mass marketed as “healthy” largely based on biased research, and after you hear the truth you will avoid them like the plague. Here’s why:\n\nThey Are Processed to Death…\n\nMost cooking oils go through an insane amount of processing with chemical solvents, steamers, neutralizers, de-waxers, bleach and deodorizers before they end up in the bottle. If you watch this video on the modern canola oil making process, and you’ll see exactly what I mean.\n\nWhat they don’t tell you in this video is that the “solvent” that is most often used to extract the oil is the neurotoxin hexane – and as you can see it’s literally bathed in it. Hexane is a cheap byproduct from gasoline production, that’s a serious occupational hazard and toxic air pollutant. It’s been shown that some hexane residue can remain in the oil, and the FDA doesn’t require food manufacturers to test for residues. Residue tests done by the Cornucopia Institute in 2009 found hexane residues in soybean oil. So, we very well could be eating this chemical everytime we cook with hexane-extracted oils. Almost all toxicology research focuses on the industrial use and inhalation of hexane, so no one knows exactly how dangerous eating it is – but it surely isn’t healthy.\n\nThis means that the oil was mechanically extracted with a screw press. This traditional way of making oil is much healthier than using hexane – but the big oil manufacturers don’t like this method because it’s less effective (less oil is made) and it’s more expensive. So, it’s used less often. The expeller pressing process can cause a lot of heat that can make the oil go rancid, so some companies take it step farther and cold press their oils at temps of no more than 80°F to 120°F, which is labor intensive but produces the best oils. Beware that although the term “cold pressed” is regulated in Europe, it’s not very well regulated in the U.S. and cold pressed oils could technically be made at high temperatures – so I don’t take this term on a label at face value.\n• – To better understand this oil, it helps to know where it comes from. Canola oil is extracted from rapeseed plants, that have been bred to have lower levels of toxic erucic acid. Before it was bred this way, it was called Rapeseed Oil and used for industrial purposes because the erucic acid in it caused heart damage in animal studies. It got the fancy new name “canola”, but it still contains trace amounts of erucic acid (up to 2%, which they consider “safe”). In 1995 they also began genetically engineering (GMO) rapeseed to be resistant to herbicides, and now almost all canola crops in North America are GMO. Canola oil consumption has been linked to vitamin E deficiency and a shortened life span in animal studies. Research has also found some trans fats in canola oil, which were created during the heavy processing that it goes through. These trans fats are not labeled. This is ironic because trans fats are the opposite of heart healthy! According to the Weston A. Price Foundation:\n\nMazola and Crisco brands both admit to using GMOs and hexane extraction in their processing. Wesson oil never responded to our inquiries about hexane, however they confirmed that GMO canola is used. Note: Spectrum Organics brand does not use hexane to process their canola oil, and as with any organic oil, it’s non-GMO. However, I don’t consider canola a healthy oil and would choose another type of oil instead.\n• – I consider this the worst oil of all. It’s a byproduct of the cotton crop that’s inundated with pesticides and chemicals because it’s regulated as a textile crop – not food! Cotton farming also may be killing India’s farmers, as harsh pesticides sicken them and thousands more have committed suicide – many after the costly GMO seeds they used failed (sources 1, 2, 3). Being of my Indian descent, I am saddened and infuriated by this unspeakable tragedy on a scale that is hard to express. There is nothing more insidious and despicable than an industry that preys upon the health, safety, and lives of innocent victims. Cottonseed oil does not belong in our food supply and should be strictly avoided. Thankfully, most cooking oils in the grocery store no longer contain cottonseed oil, and this ingredient is mostly relegated to the processed food aisle. Cottonseed is widely being replaced in cooking oils with another oil that I avoid: soybean oil.\n• – Most products that just say “Vegetable Oil” are made from soybeans. It’s so common in processed foods that up to 20% of calories in the typical American diet is thought to come from soybean oil. Soybean oil is high in omega-6 fatty acids, and our bodies need this type of fatty acid, but today people are getting too much of it through processed foods – up to 20 times more than required, according to some estimates. The overabundance of omega-6 fatty acids increases the risk of inflammation, cardiovascular disease, cancer, and autoimmune diseases. Soybean oil is also typically made from GMOs, as 94% of U.S. soybean crops are genetically modified. A recent survey showed that most Americans use “Wesson Vegetable Oil”, which is now made from soybeans (previously cottonseed). When we contacted Wesson, they confirmed they use GMOs in their oils (soybean, corn, canola). Wesson brand is owned by Conagra Foods, which has donated over $2.6 million dollars to fight GMO labeling laws in the U.S., so everytime you buy their products you help fund these anti-labeling campaigns. Smart Balance cooking oil is a soybean oil blended with canola and olive oils. Smart Balance told us, “we plan to transition our full product line to non-GMO including our Smart Balance Oil. At this time our oil is not expeller pressed and does contain GMOs.” and “We do not know if hexane specifically is used, but do know it is a chemical process”. When we pushed Smart Balance to confirm whether they use hexane, their only response was that it “is processed using conventional methods”. Other cooking oils that are often extracted with hexane and are high in omega-6 fatty acids include sunflower and safflower.\n• – Have you seen Mazola’s latest marketing campaign touting that corn oil lowers cholesterol better than olive oil? Would it affect your opinion if I told you that Mazola’s parent company (ACH Food Companies) partially funded a study that they base this claim on? It definitely affects my opinion. The truth that they don’t mention in their commercials is that corn oil is highly refined, hexane-extracted from GMO corn, and loaded with omega-6 polyunsaturated fatty acids that are unstable when exposed to heat. This instability causes oxidation, a process that generates free radicals. Free radicals are renegade molecules in the body that damage cells, triggering a host of diseases from liver damage to cancer. We contacted Mazola and they confirmed that their cooking oils are made from GMOs (corn, soybean, canola) and that they use hexane extraction for all oils, except for their olive oils.\n\nThe Only Cooking Oils In My Kitchen:\n\nI cook with a variety of oils, depending on what I’m cooking. Only some oils are stable when exposed to heat, so I choose those oils for sautéing and stir frying, and the others work great for cold items like salad dressing. I generally look for unrefined, expeller pressed organic oils, and verify cold-pressed claims by contacting the company directly, only buying from those I trust. GMOs and hexane extraction are prohibited in organic oil production, so you can avoid those simply by choosing organic oils.\n\nCoconut Oil – Coconut oil is almost completely saturated fat, but don’t let that scare you. That’s because the tropical saturated fat in coconut oil is made up of medium-chain triglycerides (MCT), which have been shown to actually reduce cholesterol and obesity (sources: 1, 2, 3, 4). Nutiva’s virgin oil is organic, expeller cold-pressed, unrefined and never deodorized or bleached. It tolerates temperatures up to about 350 degrees, so it’s great for most baking and medium-high heat sauteing. Nutiva also has a steam refined version (no chemicals) that you can use for cooking up to 400 degrees, so this is my go-to oil for high heat stir fry’s. Other oils that are good for high heat cooking include avocado oil and almond oil.\n\nExtra Virgin Olive Oil – Beware that there’s olive oil fraud going on, and some brands are mixed with unlabeled GMO oils (like soybean oil), so it’s important to find a brand you trust. Check out Papa Vince’s oil which is simply cold pressed from fresh green olives, and has amazing health benefits. I like to use olive oil to make my own salad dressings.\n\nExtra-Virgin Sesame Oil – It naturally contains vitamin E (an antioxidant), vitamin B-6, zinc, magnesium, calcium, copper and iron. Unrefined sesame oil is best used for low-heat sauteing and works great when used sparingly as a condiment because it has a strong flavor. A naturally refined version is better for high-heat stir frys.\n\nNutiva Hemp Oil – This is one of my favorite oils, but it’s only good for cold applications like salad dressings, dips and smoothies. Hemp oil contains more essential fatty acids than any other nut or seed oil, with the omega-3 and omega-6 fatty acids in the optimal ratio. Hemp is also the world’s most sustainable crop, so I love these products. This oil is delicate and should be kept in the fridge and used within 3 months. Other good oils for salad dressings include walnut oil and flaxseed oil.\n\nNutiva Red Palm Oil – This oil has a light buttery flavor, and I love it on popcorn. It’s higher in vitamins A and E than other cooking oils. It’s also been shown to reduce cholesterol and cardiovascular disease. It has about at 300 degree smoke point, so it tolerates medium-heat cooking. Also, Nutiva’s vegan shortening is made with their palm and coconut oils, and works great for baking. Note: This is not to be confused with palm kernel oil (conflict palm oil), as Nutiva’s red palm oil is sustainably grown in Ecuador and doesn’t contribute to deforestation or habitat destruction.\n\nI also sometimes use grass-fed butter and organic ghee for cooking, which is clarified butter. If you are wondering more about what butter I use, make sure you check out this post.\n\nIf you know someone who is still using canola oil, corn or soy oils in their cooking, please share this post with them! Let’s spread the word to everyone about the healthier choices out there.\n\nP.S. If you want more life changing information about your food and what to buy, you’ve got to check out my books. In my #1 best selling book The Food Babe Way – I teach you even more ways you can break free from the hidden toxins in your food, lose weight, look years younger and get healthy in just 21 days. In my 2nd book, Feeding You Lies, I blow the lid off of the lies we’ve been fed about the food we eat – lies about its nutrient value, effects on our health, label information, and even the very science we base our food choices on. And, my first cookbook, Food Babe Kitchen, contains over 100 mouthwatering recipes to show you how delicious and simple it is to eat healthy, easy, real food. Available anywhere books are sold.", "opengraph": {"locale": "en_US", "type": "article", "title": "Processed To Death - Get These Cooking Oils Out of Your Pantry STAT!", "description": "Processed To Death - Get These Cooking Oils Out of Your Pantry STAT!", "url": "https://foodbabe.com/cooking-oils/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2015-02-04T18:21:05+00:00", "article:modified_time": "2020-06-09T18:46:25+00:00", "image": "https://foodbabe.com/app/uploads/2015/02/Cooking-oils-2.jpg", "image:width": "640", "image:height": "480", "image:type": "image/jpeg"}, "tags": ["fatty acids", "crisco", "corn oil", "Olive Oil", "soybean", "Coconut Oil", "oil", "expeller pressed", "cold pressed", "vegetable oil", "corn refiners association", "hexane", "sunflower", "cooking oil", "ghee", "Hemp Oil", "rapeseed", "Red Palm Oil", "safflower", "Papa Vince", "cottonseed oil", "oils", "canola", "Canola Oil", "omega 6", "sesame oil", "erucic acid", "Trans Fat", "Nutiva", "spectrum organics", "omega 3", "smart balance", "Soybean Oil", "mazola"], "tweets": [], "movies": [], "links": ["http://www.canolacouncil.org/what-we-do/canola-council-of-canada/core-funders/", "http://www.corn.org/cra-members/member-companies/", "http://www.canolacouncil.org/research/strategy-partnerships/", "http://www.plosmedicine.org/article/info%3Adoi%2F10.1371%2Fjournal.pmed.0040005", "http://www.corn.org/wp-content/uploads/2009/12/CornOil.pdf", "http://youtu.be/omjWmLG0EAs?t=47s", "http://www.atsdr.cdc.gov/toxprofiles/tp113.pdf", "http://www.epa.gov/airtoxics/allabout.html", "http://pac.iupac.org/publications/pac/pdf/1987/pdf/5911x1561.pdf", "http://www.cornucopia.org/2009/05/soy-report-and-scorecard/", "http://www.epa.gov/iris/subst/0486.htm#oralrfd", "http://blog.fooducate.com/2010/12/08/what-is-expeller-pressed-oil-and-why-does-it-matter/", "https://foodbabe.com/birke-reports-dont-let-organic-cooking-oils-fool-you/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1277456/", "http://www.scientificamerican.com/article/genetically-modified-crop/", "http://www.researchgate.net/publication/247204466_Additional_vitamin_E_required_in_milk_replacer_diets_that_contain_canola_oil", "http://www.ncbi.nlm.nih.gov/pubmed/10801914", "http://onlinelibrary.wiley.com/doi/10.1111/j.1745-4522.1994.tb00244.x/abstract", "http://jn.nutrition.org/content/135/3/562.short", "http://www.spectrumorganics.com/faqs/cooking-oils/", "http://rodaleinstitute.org/chemical-cotton/", "http://ejfoundation.org/sites/default/files/public/the_deadly_chemicals_in_cotton.pdf", "http://www.hindustantimes.com/business-news/ministry-blames-bt-cotton-for-farmer-suicides/article1-830798.aspx", "http://www.sciencedaily.com/releases/2014/04/140417090734.htm#.U1EtClVUI8c.facebook", "http://www.aljazeera.com/indepth/opinion/2013/03/201332813553729250.html", "http://www.drweil.com/drw/u/QAA400149/balancing-omega-3-and-omega-6.html", "http://www.ncbi.nlm.nih.gov/pubmed/12442909", "http://www.ers.usda.gov/data-products/adoption-of-genetically-engineered-crops-in-the-us/recent-trends-in-ge-adoption.aspx", "http://www.statista.com/statistics/278584/us-households-most-used-brands-of-salad-or-cooking-oil-within-90-days/", "http://youtu.be/IUZr8VRJ7XA", "http://www.mazola.com/img/pdf/ACH-Feeding-Study-Release.pdf", "http://www.ers.usda.gov/data-products/adoption-of-genetically-engineered-crops-in-the-us/recent-trends-in-ge-adoption.aspx", "http://www.uth.tmc.edu/courses/nutrition-module/section1/macro.html", "http://bmb.oxfordjournals.org/content/49/3/604.abstract", "http://www.cancer.gov/cancertopics/factsheet/prevention/antioxidants", "https://amzn.to/2NnI1UP", "http://jn.nutrition.org/content/131/11/2853.long", "http://www.ncbi.nlm.nih.gov/pubmed/18296368", "http://www.ncbi.nlm.nih.gov/pubmed/11880549", "http://www.ncbi.nlm.nih.gov/pubmed/9570335", "http://papavince.com/shop/", "http://www.nytimes.com/interactive/2014/01/24/opinion/food-chains-extra-virgin-suicide.html?_r=1&gwh=992F8D872448E3388B7705A1EF16DAE8&gwt=pay&assetType=opinion", "http://amzn.to/1DFSVqF", "https://amzn.to/2wOvBf9", "https://amzn.to/2wIW90G", "http://www.ncbi.nlm.nih.gov/pubmed/20095133", "https://amzn.to/2wQyuMR", "http://www.ran.org/dr-andrew-weil-conflict-palm-oil-bad-people-and-planet", "http://amzn.to/SnD1dI", "https://foodbabe.com/is-butter-secretly-ruining-your-health/", "https://amzn.to/3dPOvpj", "https://amzn.to/2WUJIfs", "https://amzn.to/3c4kJvX", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2015-02-04T18:21:05+00:00"}