{"result_id": "116003", "URL": "https://foodbabe.com/scientists-said-monsanto-chemical-was-safe-they-were-wrong-it-causes-cancer/", "timestamp": "2023-04-25 15:06:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/icons/180/apple-touch-icon.png", "canonical": "https://foodbabe.com/scientists-said-monsanto-chemical-was-safe-they-were-wrong-it-causes-cancer/", "encoding": "utf-8"}, "image": null, "domain": "foodbabe.com", "title": "Scientists Said Monsanto Chemical Was Safe, They Were Wrong. It Causes Cancer.", "cleaned_text": "This is Shocking news. Monsanto was ordered to pay $289 million in damages after a jury found them liable for failing to warn that their weedkiller Roundup causes cancer.\n\nThis lawsuit was filed by a California man, Dewayne Johnson, who is suffering from Non-Hodgkin Lymphoma at the young age of 46. He was a school groundskeeper who regularly used Roundup, and the jury decided that Roundup caused his cancer.\n\nThe jury also decided that Monsanto KNEW how dangerous Roundup was and failed to warn people about the risk. As Carey Gillam reported, the jurors found “there was “clear and convincing evidence” that Monsanto’s officials acted with “malice or oppression” in failing to adequately warn of the risks.”\n\nThe judge echoed that Monsanto “acted with malice, oppression or fraud and should be punished for its conduct”.\n\nThis is very, very alarming – and everyone MUST take notice.\n\nMonsanto has tried to hide the dangers of Roundup from the public and regulators for years. In 2015, the World Health Organization’s cancer arm (International Agency for Research on Cancer – IARC) declared the active in ingredient in Roundup, glyphosate, a probable human carcinogen.\n\nWhen this happened, Monsanto’s PR machine went into full effect. They immediately tried to discredit IARC’s decision and spin the story in their favor.\n\nThe media played right into Monsanto’s hands, painting a picture that “experts” around the world believe Roundup is “safe” and that the scientists at IARC were wrong in linking Roundup to cancer.\n\nPerhaps you read this in the news…\n\n“Glyphosate has been widely considered among the safest pesticides” – NPR, March 2015 “You can drink a whole quart” of glyphosate “and it won’t hurt you” – Dr. Patrick Moore in the Huffington Post, March 2015 “I can tell you glyphosate is safe. The data that they look at, they cherry pick it and then they interpret the studies completely different than research who actually did it” – Monsanto scientist Donna Farmer to CBS News, June 2016 “U.S. EPA says glyphosate not likely to be carcinogenic to people” – Reuters, December 2017 “Agencies across the world say glyphosate is safe and the IARC report is a flawed analysis” – Gordon Stoner from the National Association of Wheat Growers to Reuters, December 2017 “The chemical is not carcinogenic” and it’s “less toxic than common chemicals like aspirin” – Slate, January 2018\n\nLess toxic than aspirin? REALLY?\n\nHow did so many news publications miss the truth?\n\nWhen the World Health Organization revealed how dangerous Glyphosate (and Roundup) could be to humans, the media quickly took ahold of Monsanto’s talking points.\n\nThey listened to the lies fed to them by “experts.” Experts that may have been “paid for” by Monsanto.\n\nI’ve written about Monsanto’s Roundup and its link to cancer numerous times in the past – warning consumers that this chemical has been found in Cheerios and Ritz Crackers, and how Monsanto has been working behind the scenes to cover up its dangers… in cahoots with the EPA… ghostwriting news stories… setting up front groups… hiring trolls on social media… and enlisting “independent” scientists to further their agenda.\n\nAll of these moving pieces have been working together with one goal in mind – to fool the public and our regulators so that Monsanto can keep making BILLIONS off of Roundup sales.\n\nRaising my voice has made me a target.\n\nThis is a personal issue for me, because I’ve been dragged through the mud by people calling me an ignorant fearmonger for writing about the dangers of Roundup and conventional agriculture (which uses Roundup extensively).\n\nCritics of mine have been saying that scientists disagree with my work and that we should trust them because they are the real experts. They branded me “Pseudoscience” because I avoid GMOs grown with Glyphosate and trust information from The World Health Organization.\n\nThe truth is: Science is always evolving.\n\nHow many times has something been deemed “safe” only to later find that it is making people sick?\n\nScientists are not always right. Science is sometimes riddled with industry corruption. Scientists sometimes make big, horrible, mistakes.\n\nJust look at what Big Tobacco has done during the last 80 years, as they tried to hide the grave dangers of cigarette smoking from the public. One unethical tactic was advertising with doctors, dentists and nurses recommending packs of Camels and Lucky Strikes. The tobacco industry did this because they knew the public trusted these medical experts and would fall for the tobacco-industry talking points in these ads (the “doctors” weren’t even real doctors!)\n\nMonsanto’s playbook is the same, they use many of the same tactics – and the media has been falling for it… hook, line, and sinker.\n\nRoundup is the new tobacco. Only this time we are all smoking and don’t have a choice. Roundup is the most widely used weed killer in the history of our world – and because of this, we are being exposed to Roundup daily.\n\nIf you don’t have a bottle of Roundup in your garage, your neighbor probably does.\n\nIt’s in our food. It’s in our water. It’s in the air. It is contaminating our environment on a grand scale. It has now been decided in court that it can indeed cause cancer and that Monsanto has known about this risk for DECADES.\n\nSure, this $289 million dollar judgment is a drop in the bucket for a multi-billion dollar company like Monsanto… but the tipping point is HERE and I truly believe the END of this company is on the horizon.\n\nWhat does this jury verdict mean for the world?\n\nThe roughly 4,000 pending Roundup lawsuits now have this amazing precedent to back their claims. These cancer victims have a better shot at winning their cases – and could cost Monsanto millions more.\n\nIt starts a valid discussion around banning Roundup use in our schools, parks, communities, stores, and even nationally.\n\nMore people will now be aware that Roundup is indeed dangerous and will stop buying it. That is the biggest win of all.\n\nJust because a product or package of food is on the shelf does not mean that it is safe. Unfortunately that is far from the case!\n\nAfter years of being an activist, I realized that big companies will NEVER change. They will continue to line their pockets at the expense of human beings.\n\nAnd that’s why I started my new company Truvani.\n\nOver the last few years, the Food Babe Army has made tremendous progress against big corporations. But I was tired of sitting back and waiting for them to change.\n\nThe world needed a company that cared about the ingredients in their products, and whether or not these ingredients are safe. And my company Truvani will join the ranks of companies leading the charge. Every Truvani product will be certified organic (where applicable), because Roundup is not permitted to be sprayed on organic crops.\n\nAs I know organic crops can still be contaminated with Roundup (it’s so prevalent in our environment), I’m taking it a step further in testing Truvani products for glyphosate to make sure they do not contain excessive levels.\n\nI want to do everything in my power to ensure my products are as clean as possible. This is the standard I believe EVERY company should have… Don’t you? And that’s why it’s so important to find good companies… doing the right thing… and vote with our dollars. Companies that do the right thing need our support, and maybe, one day, these big conglomerates will finally start caring about humans.\n\nI encourage you to SHARE this post with your friends, family, and neighbors – we need to spread the word that Roundup is not safe.\n\nI also urge you to buy certified organic food as much as possible. This is currently the most viable way to protect yourself from glyphosate – and other harmful chemicals that are used in conventional food products. It may be more expensive, but I believe it may save you thousands in medical costs down the road. Health is wealth, right?\n\nP.S. I just finished the manuscript for my new book, Feeding You Lies: How to Unravel the Food Industry’s Playbook and Reclaim Your Health. In this book, I expose the shameless lies we are being fed about our food by the very people we should be able to trust for health information… lies about its nutrient value, effects on our health, label information, and even the very science on which we make our food choices. It’s investigative, hard-hitting, and scandalous. The book will be published in February 2019! Pre-order your copy here.\n\nP.P.S. If you have a bottle of Roundup at your house, I hope you stop using it immediately. And, don’t forget to share this post!", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Said Monsanto Chemical Was Safe, They Were Wrong. It Causes Cancer.", "description": "This is Shocking news. Monsanto was ordered to pay $289 million in damages after a jury found them liable for failing to warn that their weedkiller Roundup causes cancer. This lawsuit was filed by a California man, Dewayne Johnson, who is suffering from Non-Hodgkin Lymphoma at the young age of 46. He was a school … Read More", "url": "https://foodbabe.com/scientists-said-monsanto-chemical-was-safe-they-were-wrong-it-causes-cancer/", "site_name": "Food Babe", "article:publisher": "https://facebook.com/thefoodbabe", "article:published_time": "2018-08-14T15:51:26+00:00", "article:modified_time": "2018-08-14T16:05:42+00:00", "image": "https://foodbabe.com/app/uploads/2018/08/Screen-Shot-2018-08-14-at-11.16.42-AM.png", "image:width": "640", "image:height": "264", "image:type": "image/png"}, "tags": ["GMOs", "lawsuit", "roundup-ready", "round-up", "organic", "herbicides", "roundup", "weedkiller", "Media", "pesticide", "gmo", "Bayer", "Monsanto", "Pesticides", "weed killer", "non-hodgkin lymphoma", "genetically modified", "herbicide", "Feeding You Lies", "cancer", "glyphosate", "court", "case"], "tweets": [], "movies": [], "links": ["https://www.usatoday.com/story/news/2018/08/10/jury-orders-monsanto-pay-289-million-cancer-patient-roundup-lawsuit/962297002/", "https://www.theguardian.com/business/2018/aug/11/one-mans-suffering-exposed-monsantos-secrets-to-the-world", "https://www.nytimes.com/2015/03/21/business/who-report-links-ingredient-in-roundup-to-cancer.html", "https://www.npr.org/sections/thesalt/2015/03/24/394912399/a-top-weedkiiller-probably-causes-cancer-should-we-be-scared", "https://www.huffingtonpost.com/2015/03/27/monsanto-roundup-patrick-moore_n_6956034.html", "https://www.theguardian.com/environment/2015/jul/15/weedkiller-suspected-of-causing-cancer-deemed-safe", "https://www.cbsnews.com/news/roundup-weed-killer-lawsuit-monsanto-glyphosate-cancer-claims/", "https://www.reuters.com/article/us-usa-pesticides-glyphosate/u-s-epa-says-glyphosate-not-likely-to-be-carcinogenic-to-people-idUSKBN1EE2XH", "https://www.reuters.com/article/us-usa-pesticides-glyphosate/u-s-epa-says-glyphosate-not-likely-to-be-carcinogenic-to-people-idUSKBN1EE2XH", "https://slate.com/technology/2018/01/years-of-testing-shows-glyphosate-isnt-carcinogenic.html", "https://www.nbcnews.com/health/health-news/big-tobacco-finally-tells-truth-court-ordered-ad-campaign-n823136", "http://tobacco.stanford.edu/tobacco_main/subtheme.php?token=fm_mt001.php", "http://tobacco.stanford.edu/tobacco_main/images.php?token2=fm_st001.php&token1=fm_img0002.php&theme_file=fm_mt001.php&theme_name=Doctors%20Smoking&subtheme_name=More%20Doctors%20Smoke%20Camels", "https://www.sciencedaily.com/releases/2016/02/160202090536.htm", "https://truvani.com/?utm_medium=food-babe-blog&utm_source=food%20babe%20blog&utm_campaign=mention&utm_content=monsanto-trial&utm_term=post", "https://amzn.to/2Mufrhw", "https://amzn.to/2Mufrhw", "https://amzn.to/2Mufrhw", "https://foodbabekitchen.com"], "authors": ["Food Babe"], "publish_date": "2018-08-14T15:51:26+00:00"}