{"result_id": "117023", "URL": "https://www.foodmatters.com/article/election-donald-trump-us-healthcare-and-food-supply", "timestamp": "2023-04-25 15:07:27 CEST+0200", "meta": {"description": "It's official! Donald Trump has become President-Elect! Find out what this means for the health and wellbeing of Americans, including GMOs, vaccines, and Obamacare.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/election-donald-trump-us-healthcare-and-food-supply", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "How President-Elect Donald Trump Will Affect US Healthcare & The Food Supply", "cleaned_text": "Yesterday, the entire world watched with bated breath to see who would become the next President. Anxiety was high across the nation as the numbers climbed for both parties, but Donald Trump triumphed against Hillary Clinton, and will become the 45th President of the United States.\n\nWhile we are certainly not here to push any political agenda or opinions about either of the candidates, today we’re looking at what Donald Trump has in store for the U.S. healthcare system and the food supply, and how, at the end of the day, your health is still in your own hands…\n\nDonald Trump plans to axe the Affordable Care Act and bring in free market reforms to the industry. Medicaid will be turned into a block grant program, drug providers will find it easier to enter the free market so more drugs can be imported from overseas, and he aims to increase transparency from healthcare providers regarding their prices - making it easier for people to shop around.\n\nPlus, he wants to offer people the option to use tax-free Health Savings Accounts to pass onto their heirs and allow individuals to fully deduct health insurance premium payments from their tax returns.\n\nMental health doesn’t appear to be too high on Donald Trump’s to-do list, but he would like to “increase the number of mental health care providers at the U.S. Department of Veteran Affairs, while at the same time, encourage [people] to seek mental health care outside of the VA”, though, it was not clear how this would be paid for. Trump also said that mental health care reforms must be part of larger, more general healthcare reforms.\n\nAccording to Self, Donald Trump has made it clear that he's anti-abortion, except in cases of rape, incest, and mother endangerment; stating that the doctors performing abortions should be punished.\n\nAs outlined in Modern Farmer, Donald Trump does not support labeling foods made with GMOs. And judging from his agribusiness-friendly agriculture advisory council, it’s unlikely that he would be restricting their developments.\n\nJohn Robbins from the Food Revolution Network reports that Trump's position on GMO’s is \"completely consistent with his selection of Senator Pat Roberts from Kansas to his agriculture advisory committee. Roberts is the foremost opponent of GMO labeling in the U.S. Senate, and the primary sponsor of what has been called the DARK Act, the Deny Americans the Right to Know Act, which makes it impossible for states to enact legislation requiring labeling of GMO foods.\"\n\nThere was no real mention of food, agriculture, or rural community support during the campaigns. However, his agricultural advisors include industrial agriculture advocates, including senators, governors, state agricultural commissioners, and agribusiness executives; highlighting that it’s unlikely any changes will occur in this area and Big Agriculture will remain, including feedlots and factory farms.\n\nDonald reportedly wanted to cut federal assistance programs, including SNAP benefits (Supplemental Nutritional Assistance Program, previously known as food stamps). However, this was clarified later on by a senior advisor for the Trump campaign that Donald would not remove the benefits. Yet, there was also no discussion of improving them.\n\nS. Johnson from NaturalNews reports that \"Donald Trump is no stranger to controversy, including the vaccine debate. In a series of tweets and interviews over the past few years, the presidential candidate has stated that he strongly believes that there is a link between \"monstrous\" vaccines and autism. He has suggested that delivering vaccines in smaller doses over time could reduce autism rates among U.S. children. Despite being cast to the lunatic fringe by the mainstream media for his remarks, CDC scientist Dr. William Thompson has confirmed Trump's suspicions…\"\n\nThe Power Is Still In Your Hands!\n\nRegardless of who is the new President, the reality is that your health is still in your own hands! You have the power of choice in your day-to-day decisions, and despite who is in charge of the country, you have the ability to influence your own health, every single day.\n\nRemember the foundational acts of self-love and wellbeing:\n• Eat local and shop organic where possible,\n• Reduce your exposure to toxicity in your daily environment,\n• Get out in nature,\n• And practice mindfulness and stress management techniques such as yoga and meditation.\n\nIf you’re struggling with any area of this in your life, we have over 900 inspirational, educational and empowering videos inside FMTV to help you on your journey to health. Discover FMTV here.\n\nAnd don't forget, the food supply is such a powerful form of control that by choosing to eat differently, purchase healthier foods, and demand organics, we can increase the need for manufacturers to improve their products, increase the demand for organic and local food supplies, and, in turn, create a ripple effect from the grassroots level up!\n\nOur choices and how we spend our money can influence decision makers. So don’t be disheartened, as regardless of who is in the White House, it’s up to us to use our power to create the change we want to see in the world, and when we band together, anything is possible!", "opengraph": {"url": "http://www.foodmatters.com/article/election-donald-trump-us-healthcare-and-food-supply", "type": "article", "title": "How President-Elect Donald Trump Will Affect US Healthcare & The Food Supply", "description": "It's official! Donald Trump has become President-Elect! Find out what this means for the health and wellbeing of Americans, including GMOs, vaccines, and Obamacare.", "image": "https://www.foodmatters.com/media/uploads/images/articles/donald-trump.jpg", "article:author": "https://www.facebook.com/LaurentineTenBosch/"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "http://www.self.com/story/donald-trump-hillary-clinton-health-care", "http://www.self.com/story/hillary-clinton-donald-trump-abortion", "https://www.washingtonpost.com/news/wonk/wp/2015/10/15/i-asked-psychologists-to-analyze-trump-supporters-this-is-what-i-learned/", "http://modernfarmer.com/2016/09/2016-election-candidates-food-farming/", "http://2016election.procon.org/view.answers.election.php?questionID=002069", "https://foodrevolution.org/election-clinton-trump-food-policy/", "https://foodrevolution.org/election-clinton-trump-food-policy/", "https://ballotpedia.org/Donald_Trump_presidential_campaign,_2016/Federal_assistance_programs", "http://www.naturalnews.com/051837_Donald_Trump_autism_MMR_vaccine.html#ixzz4PeLDikcJ", "http://www.fmtv.com", "http://www.shutterstock.com/gallery-1803410p1.html?cr=00&pl=edit-00", "http://www.shutterstock.com/editorial?cr=00&pl=edit-00"], "authors": [], "publish_date": null}