{"result_id": "117013", "URL": "https://www.foodmatters.com/article/10-simple-steps-to-survive-the-winter-and-stay-healthy", "timestamp": "2023-04-25 15:07:13 CEST+0200", "meta": {"description": "Pharmacies all over are promoting walk-in flu shots for the \"flu season\"...but for those that don't want a chemical cocktail injected into their bodies what measures can we take to ensure we are not sidelined with nagging colds or a debilitating flu episode.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/10-simple-steps-to-survive-the-winter-and-stay-healthy", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "10 Immune Boosting Flu Shot Alternatives", "cleaned_text": "(NaturalNews) Pharmacies have already begun promoting walk-in flu shots for the \"flu season\". The late and early months of each year seem to be when more of us catch colds and come down with the flu. So what measures can you take to ensure you are not sidelined with nagging colds or a debilitating flu episode?\n\n \n\n This article will give you nine easy tips, with probably the most important last. There you'll also be able to access a Health Ranger video with Mike Adams, which convincingly debunks the concept of \"flu season\".\n\nBoosting your immunity is important for coping with the cold and flu season. Of course, getting a flu shot with dubious efficacy is not one of them. All vaccines depress the immune system and can cause lifelong neurological damage and autoimmune diseases.\n• Elderberry for Cures: Elderberry (picture above) extracts or syrups have been clinically proven to help get over colds and flu. It's not a drug. So it's cheaper and without the side effects that have been reported for Tamiflu. If you hurry, you can make your own tincture and save money. (Source #1)\n• Protective Supplements: Elderberry is curative. Echinacea herbs are protective. They're usually sold in tinctures or extracts. Vitamin C is protective and, in large quantities, curative. Zinc is a helpful mineral for protecting against colds. Increase them with the right foods or supplements.\n• Minimize Sugar: Ease up on sodas, pastries and such. You've probably had enough ice cream during the summer. A few grams of sugar can destroy your white blood cells' ability to resist infections for several hours.\n• Eat for the season – Root vegetables, soups and slow-cooked stews and casseroles are all favourites for the winter, as are beans and lentils. Don’t worry about calories (although avoid using too much fat and sugar in your cooking). Focus instead on the nutritional content. It’s normal to gain up to 4kg in the winter. This makes up part of your yin for the yang months.\n• Eat more Garlic and Onion: Besides being rich in antioxidants and selenium, garlic is antibacterial and antiviral. Both garlic and onions are part of the Allium family, which is rich in sulfur-containing compounds responsible for many of their health-promoting effects.\n• Exercise: Moderate exercise, even walking a mile or two at least three times a week, helps your lymph system cleanse impurities to boost your immune system. Avoid long gruelling workouts. A brisk walk every day is all you need in the winter. Mindful practices such as winter chi ball, qi gong, tai chi, yoga, Pilates and Feldenkrais are also excellent for building and balancing yin and yang.\n• Stress Less: This should be an all year practice. Many consider stress or anxiety as the leading cause for decreased immunity. Lighten up. Try meditation or yoga. Laugh more. Be less critical. Worry less.\n• Sleep: Not necessarily more, but better. Make sure where you sleep is totally dark so your melatonin production will be sufficient. There are melatonin supplements if you feel the need. The different phases of sleep contain two cycles that are deep enough to refurbish your immune system. You need to sleep through them. (Source #2)\n• Probiotics: Your body contains ten times more bacteria than cells. Most of them have to be friendly. Friendly bacteria not only attack pathogenic bacteria and fungi, but also they trigger appropriate white cell reactions to invaders and they influence your mental/emotional state. It's estimated that eighty percent of your 100 trillion bacteria are located in the gut (Source #3). Friendly bacteria are usually depleted, especially by GMOs. We all need probiotic foods and supplements. Commercial yogurt is insufficient. Raw milk and raw cheese, fermented foods, and water kefir or milk kefir should be staples (Source #4). There are probiotic supplements as well. If you're forced into taking antibiotics, double up with probiotic supplements.\n• Vitamin D3: If you live in a year round warm sunny area, you'll need to make sure you get plenty of sun to skin exposure. If your regional climate restricts sun exposure, take your Vitamin D3 supplements. You can check your Vitamin D3 blood levels, but many experts recommend five to ten thousand units daily.", "opengraph": {"url": "http://foodmatters.tv/articles-1/10-simple-steps-to-survive-the-winter-and-stay-healthy", "type": "article", "title": "10 Immune Boosting Flu Shot Alternatives", "description": "Pharmacies all over are promoting walk-in flu shots for the \"flu season\"...but for those that don't want a chemical cocktail injected into their bodies what measures can we take to ensure we are not sidelined with nagging colds or a debilitating flu episode.", "image": "https://www.foodmatters.com/media/images/assets/elderberry.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "http://www.naturalnews.com/026354_flu_Tamiflu_elderberry.html", "https://store.foodmatters.com/collections/supplements", "http://www.naturalnews.com/026637_sleep_health_immune_system.html", "http://probiotics.mercola.com/probiotics.html", "http://www.naturalnews.com/kefir.html", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green"], "authors": [], "publish_date": null}