{"result_id": "117026", "URL": "https://www.foodmatters.com/article/beat-and-treat-add-and-adhd-without-drugs", "timestamp": "2023-04-25 15:07:30 CEST+0200", "meta": {"description": "ADD and ADHD are commonplace in today's society but did you know that such conditions may be prevented or improved with diet and supplementation instead of risky mainstream drugs?", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/beat-and-treat-add-and-adhd-without-drugs", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Beat and Treat ADD and ADHD without Drugs", "cleaned_text": "ADD (Attention Deficit Disorder) and ADHD (Attention Hyperactivity Deficit Disorder) are similar conditions. ADD is now often known as ADD/WO, meaning \"attention deficit without hyperactivity\"). Fortunately, such conditions may be prevented or improved with diet and supplementation instead of risky mainstream drugs.\n\n \n\n Though ADD and ADHD may in part be syndromes created to describe age-old problems and publicized in order to sell drugs, it is also likely that modern living conditions are resulting in an increase in childhood and adult behavior and attention problems.\n\n \n\n The suspected culprits for increased behavior and attention problems are multiple: excessive sugar and high fructose corn syrup, lack of vital nutrients, increased environmental toxins, increased vaccinations, food additives such as MSG, GMO crops, and exposure to microwaves and other electro magnetic radiation. In addition, lack of proper nurturing and parenting likely plays a big role as well.\n\n \n\n One must remember that the brain is a vital organ just like the heart, lungs, liver, etc., and it needs optimum nutrition to function properly. Sadly, today's SAD diet of fast foods, snacks & junk foods, microwavable meals and processed foods on the grocers' shelves has left most of our kids, and us, woefully deficient in a great many nutrients the body was designed to utilize. Sometimes the consequences manifest themselves early on, and other times it is down the road a ways. But you can bet that there will be consequences if not addressed and corrected.\n\n \n\n The first thing to do is to cut one's consumption of sugar to a minimum. Excessive refined sugar has been linked heavily to ADD, ADHD, bipolar, depression and other mental disorders. Also avoid alcohol, caffeine, and refined foods.\n\n \n\n Eat good sources of lean protein, such as cold water fish, including salmon, herring, and mackerel and free range organic chicken and turkey. Include plentiful Omega 3s.\n\n \n\n Though low-carb and no-carb foods and diets have been popular in recent years, carbohydrates are an essential energy source for the body and mind. The key is to insure that you are receiving the right kinds of carbohydrates. Unhealthy carbohydrates result in too much sugar which causes the problems we are trying to prevent. Healthy carbohydrates can be found in fruits, vegetables and whole grains. Examples are: apples, oranges, peaches, grapefruit, carrots, Brussels sprouts, beans, and whole wheat bread.\n\n \n\n Supplement with magnesium (a 1-2 ratio with calcium) if you are unsure that you are getting enough of this vital mineral. Various studies have indicated that anywhere from 80 to 95% of us are deficient in magnesium and symptoms include mental disorders, light or restless sleep, daytime sleepiness, and inability to concentrate.\n\n \n\n Some other suggested supplements:\n• None Pycnogenol and/or Grapeseed Extract - powerful antioxidants offering cellular protection for the body and brain\n• None SAMe (S-Adenosylmethionine) - aids in relieving stress and pain (Note: do not use in the event of manic-depressive disorder or if on prescription antidepressants)\n• None Gingko - enhances blood supply to the brain and improves nerve cell function\n• None Valerian root extract - has been used for ADD with dramatic results and no side effects\n\nLastly, consider a good all around whole food vitamin, mineral and other essential nutrient product. Some of the many benefits of getting regular optimum amounts of essential vitamins, minerals and other nutrients include:", "opengraph": {"url": "http://foodmatters.tv/articles-1/beat-and-treat-add-and-adhd-without-drugs", "type": "article", "title": "Beat and Treat ADD and ADHD without Drugs", "description": "ADD and ADHD are commonplace in today's society but did you know that such conditions may be prevented or improved with diet and supplementation instead of risky mainstream drugs?", "image": "https://www.foodmatters.com/media/images/assets/Beat-Treat-ADD.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=16&utm_campaign=food-matters-certification-program-waitlist-lady", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=16&utm_campaign=food-matters-certification-program-waitlist-lady"], "authors": [], "publish_date": null}