{"result_id": "117018", "URL": "https://www.foodmatters.com/article/warning-swine-flu-h1n1-vaccine-is-not-safe", "timestamp": "2023-04-25 15:07:18 CEST+0200", "meta": {"description": "This year it is more important that you protect your children and loved ones from the flu vaccines than influenza itself. Read this article before you take any vaccine whether its free or not.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/warning-swine-flu-h1n1-vaccine-is-not-safe", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Warning: Swine Flu H1N1 Vaccine Is Not Safe!", "cleaned_text": "This is a CBS \" 60 MINUTES\" documentary on the swine flu epidemics of 1976 in the U.S. \n\n It went on air only once and was never shown again. I thought we’d be smarter in 2009...\n\n\n\n This year it is more important that you protect your children and loved ones from the flu vaccines than influenza itself. In his article published on LewRockwell.com, Bill Sardi details 18 reasons why you should not vaccinate your children against the flu this season. Here are nine of them:\n• The swine flu is simply another flu. It is not unusually deadly.\n• This is the first time both seasonal and pandemic flu vaccines will be administered. Both seasonal flu and swine flu vaccines will require two inoculations. This is because single inoculations have failed to produce sufficient antibodies. This is an admission that prior flu vaccines were virtually useless. Can you trust them this time?\n• Adjuvants are added to vaccines to boost production of antibodies but may trigger autoimmune reactions. Some adjuvants are mercury (thimerosal), aluminum and squalene. Why would you sign a consent form for your children to be injected with mercury, which is even more brain-toxic than lead?\n• This is the first year mock vaccines have been used to gain FDA approval. The vaccines that have been tested are not the same vaccines your children will be given.\n• Over-vaccination is a common practice now in America. American children are subjected to 29 vaccines by the age of two. Meanwhile, veterinarians have backed off of repeat vaccination in dogs because of observed side effects.\n• Modern medicine has no explanation for autism, despite its continued rise in prevalence. Yet autism is not reported among Amish children who go unvaccinated.\n• Researchers are warning that over-use of the flu vaccine and anti-flu drugs like Tamiflu and Relenza can apply genetic pressure on flu viruses and then they are more likely to mutate into a more deadly strain.\n• Most seasonal influenza A (H1N1) virus strains tested from the United States and other countries are now resistant to Tamiflu (oseltamivir). Tamiflu has become a nearly worthless drug against seasonal flu.\n• Public health officials are irresponsible in their omission of any ways to strengthen immunity against the flu. No options outside of problematic vaccines and anti-flu drugs are offered, despite the fact there is strong evidence that vitamins C and D activate the immune system and the trace mineral selenium prevents the worst form of the disease.\n\nHow to Protect Yourself without Drugs and Vaccinations\n\nThere will always be threats of flu pandemics, real or created, and potentially toxic vaccines will continue to be peddled as the solution until enough people realize there’s a better, safer, saner way.\n\n \n\n You can break free of the drug-solution trap right now by following these natural health principles. I have not caught a flu in over two decades, and you can avoid it too, without getting vaccinated, by following these simple guidelines, which will keep your immune system in optimal working order so that you're far less likely to acquire the infection to begin with.\n\n \n\n Optimize your vitamin D levels \n\n As I've previously reported, optimizing your vitamin D levels is one of the absolute best strategies for avoiding infections of ALL kinds, and vitamin D deficiency is likely the TRUE culprit behind the seasonality of the flu -- not the flu virus itself.\n\n \n\n This is probably the single most important and least expensive action you can take.\n\n \n\n If you are coming down with flu like symptoms and have not been on vitamin D you can take doses of 50,000 units a day for three days to treat the acute infection. Some researchers like Dr. Cannell, believe the dose could even be as high as 1,000 units per pound of body weight for three days.\n\n \n\n Avoid sugar and processed foods\n\n Sugar decreases the function of your immune system almost immediately, and as you likely know, a strong immune system is key to fighting off viruses and other illness. Be aware that sugar is present in foods you may not suspect, like ketchup and fruit juice.\n\n \n\n Get enough rest\n\n Just like it becomes harder for you to get your daily tasks done if you're tired, if your body is overly fatigued it will be harder for it to fight the flu.\n\n \n\n Have effective tools to address your stress\n\n We all face some stress every day, but if stress becomes overwhelming then your body will be less able to fight off the flu and other illness. If you feel that stress is taking a toll on your health, consider using an energy psychology tool such as Meridian Tapping Techniques, which is remarkably effective in relieving stress associated with all kinds of events, from work to family to trauma.\n\n \n\n Exercise\n\n When you exercise, you increase your circulation and your blood flow throughout your body. The components of your immune system are also better circulated, which means your immune system has a better chance of finding an illness before it spreads. You can review my exercise guidelines for some great tips on how to get started.\n\n \n\n Take a good source of omega-3 fats like krill oil\n\n Increase your intake of healthy and essential fats like the omega-3 found in krill oil, which is crucial for maintaining health. It is also vitally important to avoid damaged omega-6 oils like trans fats found in most processed foods, as it will seriously damage your immune response.\n\n \n\n Wash your hands\n\n Washing your hands will decrease your likelihood of spreading a virus to your nose, mouth or other people. Be sure you don't use antibacterial soap for this -- antibacterial soaps are completely unnecessary, and they cause far more harm than good. Instead, identify a simple chemical-free soap that you can switch your family to.\n\n \n\n Eat garlic regularly\n\n Garlic works like a broad-spectrum antibiotic against bacteria, virus, and protozoa in the body. And unlike with antibiotics, no resistance can be built up so it is an absolutely safe product to use. However, if you are allergic or don't enjoy garlic it would be best to avoid as it will likely cause more harm than good.\n\n \n\n Avoid hospitals and vaccines\n\n In this particular case, I'd also recommend you stay away from hospitals unless you're having an emergency, as hospitals are prime breeding grounds for infections of all kinds, and could be one of the likeliest places you could be exposed to flu bugs of all kinds.\n\n \n\n As a side note, please beware that 21 different pediatric Tylenol products have been recently recalled due to the possibility of bacterial contamination. So, if your child comes down with cold or flu symptoms, make sure you do not give him or her a potentially contaminated product.\n\n \n\n Better yet, help your child recover using more traditional cold and flu remedies, such as, hydrogen peroxide solution in the ear, zinc lozenges, high quality raw honey, or a homemade cough syrup.", "opengraph": {"url": "http://foodmatters.tv/articles-1/warning-swine-flu-h1n1-vaccine-is-not-safe", "type": "article", "title": "Warning: Swine Flu H1N1 Vaccine Is Not Safe!", "description": "This year it is more important that you protect your children and loved ones from the flu vaccines than influenza itself. Read this article before you take any vaccine whether its free or not.", "image": "https://www.foodmatters.com/media/images/articles/swine-flu.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "320", "height": "240", "embed_code": "<iframe src=\"https://www.youtube.com/embed/fA2aX-QhXJA?rel=0\" frameborder=\"0\" width=\"320\" height=\"240\"/>", "src": "https://www.youtube.com/embed/fA2aX-QhXJA?rel=0"}], "links": ["#", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=16&utm_campaign=food-matters-certification-program-waitlist-lady", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=16&utm_campaign=food-matters-certification-program-waitlist-lady"], "authors": [], "publish_date": null}