{"result_id": "117031", "URL": "https://www.foodmatters.com/article/5-things-you-can-do-to-protect-yourself-from-alzheimers", "timestamp": "2023-04-25 15:07:38 CEST+0200", "meta": {"description": "People are often told that there is very little that can be done to prevent Alzheimer's disease and other types of dementia. A recent study has results to show that those with greater life purpose and some specific nutrition approaches can result in the maintenance of better cognitive ability.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/5-things-you-can-do-to-protect-yourself-from-alzheimers", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "5 Things You Can Do To Protect Yourself From Alzheimer's", "cleaned_text": "People are often told that there is very little that can be done to prevent Alzheimer’s disease and other types of dementia. A recent study has results to show that those with greater life purpose and some specific nutrition approaches can result in the maintenance of better cognitive ability.\n\n \n\n(NaturalNews) A study led by Dr. Patricia Boyle of Rush University Center in Chicago has concluded that people with greater life purpose maintained cognitive ability better than those who weren't leading a purposeful life.\n\n \n\nDr. Boyle and her team wanted to establish a strategy for avoiding Alzheimer's consequences rather than attempting to find a way of keeping brain plaques and tangles from accumulating.\n\n \n\nAfter following 246 senior citizens -- with up to ten years of annual cognitive exams and neurological testing -- and quizzing them about life missions and then doing brain autopsies after their deaths, they reached a conclusion.\n\nAs people age, they're prone to getting brain plaques and tangles. But if they have a life purpose zestfully pursued, they avoid dementia despite those physical impairments.\n\n \n\nThere are many real life examples of people managing well as they keenly continue to pursue their life adventures, especially adventures that require mental focus and activity.\n\n \n\nMany experts also agree that engaging in mental activities which are new or challenging as one ages also helps retain mental acuity. Walking briskly in nature a mile or so four days a week also helps maintain one's cognitive abilities.\n\n \n\nFour specific nutritional approaches\n\nAfter failing to get her dementia addled husband into an Alzheimer drug trial because they were no longer accepting volunteers, Dr. Mary Newport discovered the active ingredient in the formula tested was a synthetic medium chain triglyceride(MCT).\n\n \n\nGetting patent rights for big bucks requires the creation of synthetic drugs. Synthetic drugs always produce side effects and their PR exceeds their efficacy.\n\n \n\nDr. Newport discovered that coconut oil contained natural MCT. Her husband had entered the darker side of dementia with his late stage Alzheimer's. Yet after around a month and a half he was almost completely recovered after taking a tablespoon of coconut oil twice daily. Metabolizing MCTs produces ketones, which dissolve brain plaques and tangles.\n\n \n\nAn Australian shared his escape from early stage Alzheimer's on YouTube using both coconut oil and niacin (B3), a supplement pioneered in orthomolecular psychiatry for many mental issues.\n\nThe synergy of combining curcumin with vitamin D3 to prevent or reverse Alzheimer's is a recent development. Each substance alone has shown efficacy on dementia, so why wouldn't combining the two create a powerful synergy?\n\n \n\nThis has been recently proven to be effective without side effects.\n\nAvoid aluminum cooking utensils and underarm deodorants containing aluminum. Vaccines contain aluminum that goes right into your bloodstream. Aluminum bypasses the blood brain barrier and accumulates in soft tissue cells that regenerate less often than other tissues, creating plaque.\n\n \n\nThe brain is an organ that is made of cells that recycle more slowly than most other organ tissue cells. Silica is ideal for removing aluminum from soft tissue and eliminating through the urine. The herb horsetail contains a lot of silica and can be made into a tincture to provide constant silica dosing.\n\n \n\nThere are also supplements and mineral waters sold commercially that are high in silica.\n\nAlpha lipoic acid has demonstrated stopping the progression of dementia from early stage into late stage Alzheimer's with a daily 600 mg dose.\n\n \n\nALA's oxidative ability is coupled, reducing brain inflammation along with the some metal chelating activity for heavy metals, including lead and mercury.\n\n \n\nDietary advice includes reducing fructose of all types and eliminating processed simple carbs. Brain cells are cholesterol based. Reducing fats for any reason is not a good idea.", "opengraph": {"url": "http://foodmatters.tv/articles-1/5-things-you-can-do-to-protect-yourself-from-alzheimers", "type": "article", "title": "5 Things You Can Do To Protect Yourself From Alzheimer's", "description": "People are often told that there is very little that can be done to prevent Alzheimer's disease and other types of dementia. A recent study has results to show that those with greater life purpose and some specific nutrition approaches can result in the maintenance of better cognitive ability.", "image": "https://www.foodmatters.com/media/uploads/images/articles/alzheimers-and-dementia.jpg", "article:author": "https://www.facebook.com/James.Food.Matters"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green"], "authors": [], "publish_date": null}