{"result_id": "117009", "URL": "https://www.foodmatters.com/article/depression-detox-outweighs-drugs", "timestamp": "2023-04-25 15:07:06 CEST+0200", "meta": {"description": "With 10% of the US population on drugs for depression you've got to wonder what's making people so miserable? This article looks into the common chemicals we are exposed to in our daily lives and how we would feel if we made a concerted effort to remove those poisons from our bodies.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/depression-detox-outweighs-drugs", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Depression: Detox Outweighs Drugs", "cleaned_text": "Columbia researchers have announced that ten percent of the U.S. population are on drugs for depression. Doctors quoted by a HealthDay reporter thought this was an improvement because more people are seeking help when they are feeling chronically blue. But there's a foundational question that wasn't addressed: \"Are drugs for depression the right kind of help?\"\n\n \n\n Given that most people have 10 plus pounds of old, rotting fecal matter in their colon and that even newborns these days have more than a hundred known toxic chemicals already inside their bodies, do you think all of the toxicity inside the average person might be at least part of the reason one in ten people are feeling so crummy?\n\n \n\n Before you answer, consider what Sherry Rogers, M.D. outlines in her book 'Detoxify or Die': \n\n \n\n\n\n\"There are 12 common chemicals often trapped inside the average person's body - all that have been found to cause depression or damage the nervous system, in addition to causing many other problems.\"\n• None plastics (which are commonly absorbed into foods wrapped in them),\n• None pesticides (in each non-organic bite you take),\n• None hexane from jet fuel (reported in 2004 to be found in milk),\n• None aluminum (found in antiperspirants, antacids, aluminum cans, aluminum foil and a great deal of cookware),\n• None toluene (from cigarettes, inks, nail polishes, cleaners, glues and many more sources),\n• None gasses from faulty furnaces and even from diesel exhaust.\n\nCombine the above with the fact that most of the population has a problem with candida overgrowth, which is a fungal condition that has become extraordinarily common due to antibiotic use and birth control use - and as part of candida's existence, it releases about 80 known toxins in our bodies each day. \n\n \n\n All of this begs the question: Do you think that this ten percent of the population would feel any differently if they made concerted efforts to remove those poisons from their bodies and conscientiously stopped putting more in, instead of simply taking drugs for depression? \n\n \n\n Even if you discount the toxicity factor affecting people today and causing more problems than most comprehend, do you know how depression drugs or SSRIs \"work?\" \n\n \n\n Essentially, the theory is this. Many people with depression don't have enough serotonin in their brains, so depression drugs alter the way serotonin is sent between cells. This is done to make the serotonin more accessible to a cell that is meant to be simulated by it, but isn't simulated, because not enough was sent in the first place. By altering our delicate brain chemistry, these drugs make it appear to the cells that there is more serotonin than there really is. \n\n \n\n But the thing is, with the right ingredients, the human body can manufacture more serotonin. Which do you think a body would prefer: man-made chemicals that alter its natural function - or having the right natural ingredients to simply make more of a natural brain chemical it's low on? \n\n \n\n If you answered the latter, you should know that tryptophan is a naturally occurring amino acid and the precursor to serotonin. Essentially, this means if your body has enough tryptophan it can simply manufacture more serotonin. By approaching the problem in this manner it, of course, means there is no need for depression drugs to alter our brain's function or trick the body into thinking that a limited supply of serotonin is plentiful. \n\n \n\n Tryptophan can be found as a supplement and in foods, particularly in nuts and seeds. Nuts and seeds are chock full of tryptophan, so simply by eating them regularly you can help your brain produce more serotonin. For best results, however, nuts and seeds should be both raw and unprocessed. \n\n \n\n It's interesting to know that in 1989 the naturally occurring amino acid tryptophan was taken off the market as a supplement. This was due to a problem with a bad batch that is believed to have been caused by genetically modified materials that were used in its production. However, the timing was odd: it coincided perfectly with when Prozac was patented and released to the public, with a profit margin over the active ingredients of almost 225,000 percent. Fortunately, tryptophan as a supplement is now back on the market.", "opengraph": {"url": "http://foodmatters.tv/articles-1/depression-detox-outweighs-drugs", "type": "article", "title": "Depression: Detox Outweighs Drugs", "description": "With 10% of the US population on drugs for depression you've got to wonder what's making people so miserable? This article looks into the common chemicals we are exposed to in our daily lives and how we would feel if we made a concerted effort to remove those poisons from our bodies.", "image": "https://www.foodmatters.com/media/images/articles/detox-depression.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.fmtv.com/watch/the-marketing-of-madness?utm_source=fmsitecontent&utm_medium=fmsite-links-banners&utm_content=fmsitecontent", "/detox-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=11&utm_campaign=detox-masterclass-evergreen", "https://www.foodmatters.com/detox-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=11&utm_campaign=detox-masterclass-evergreen"], "authors": [], "publish_date": null}