{"result_id": "117007", "URL": "https://www.foodmatters.com/article/vitamin-c-natures-most-powerful-vitamin-for-healing", "timestamp": "2023-04-25 15:07:04 CEST+0200", "meta": {"description": "Over 75 years of medical research and clinical practice reveals that vitamin C has the power to ignite the 'self-healing response’,  yet doctors still deny its effectiveness.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/vitamin-c-natures-most-powerful-vitamin-for-healing", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "If “Vitamin C Is the World's Best Natural Antibiotic, Antiviral, Antitoxin,” Why Is It Being Ignored", "cleaned_text": "Over 75 years of medical research and clinical practice reveals, overwhelmingly, that vitamin C has the power to ignite the 'self-healing response'. I know what you're thinking - if vitamin C is so good for us - why haven't you been told about this curative nutrient? Well, the answer will soon become painfully obvious.\n\n \n\n Medical students receive little nutritional training - only 2 hours in 4 years! Vitamin C therapy for a host of chronic diseases has been systematically ignored by conventional medicine for decades.\n\nDr. Fredrick R. Klenner Discovers The Real Power Of Vitamin C And How To Cure Disease\n\nBelieve it or not, in the 1940's, Dr. Klenner used vitamin C to cure 60 out of 60 cases of polio and that was back in the days when the polio vaccine didn't even exist. Dr. Klenner even presented his findings - at a large medical conference about his success with high dose vitamin C therapy and it was largely ignored.\n\n \n\n Instead, big pharma has a stranglehold 'death grip' over the I.Q. of most doctors - brainwashing them into believing that toxic antibiotics that destroy intestinal flora (and the immune system) is a 'wiser' choice.\n\n \n\nDr. Klenner was one of the first physicians to cure disease with vitamin C. In fact, he consistently eliminated chicken pox, measles, mumps, tetanus and polio with huge doses of IV vitamin C. And, keep in mind, Dr. Klenner did this when vaccines didn't even exist.\n\n \n\nThese are the medical facts. Dr. Klenner cured pneumonia, encephalitis, herpes zoster (shingles), herpes simplex, mononucleosis, pancreatitis, hepatitis, rocky mountain spotted fever, bladder infections, alcoholism, arthritis, some cancers, leukemia, atherosclerosis, ruptured intervertebral disc, high cholesterol, corneal ulcers, diabetes, glaucoma, radiation burns - the list goes on and on.\n\n \n\nHe published dozens of papers - just 'google' Dr. Klenner and you'll be amazed at what you find.\n\nWhat Do Experts Have To Say About The Healing Power Of Vitamin C?\n\n\n\n \"Some physicians would stand by and see their patient die rather than use ascorbic acid (Vitamin C) because in their finite minds it exists only as a vitamin.\"\n\n - Dr. Fredrick Klenner\n\n \n\n \"Vitamin C is the world's best natural antibiotic, antiviral, antitoxin and antihistamine. Let the greats be given their due. The importance of vitamin C cannot be overemphasized.\"\n\n - Andrew Saul, Ph.D.\n\n \n\n \"Man's body was designed to function best with high blood and cellular levels of vitamin C - synthesized as needed by the liver.\"\n\n - Thomas E. Levy, MD, JD, board-certified cardiologist\n\n \n\n \"I always look upon high dose vitamin C as nature's way of dealing with crisis in terms of your health. This notion however does not exist in the conventional thinking of the medical mind.\" \n\n - Ronald Hunninghake, M.D. - personally supervised over 60,000 intravenous (IV) vitamin C sessions\n\n \n\n \"More and more physicians are getting convinced about the value of large doses of Vitamin C.\"\n\n - Linus Pauling, 2-time Nobel Prize winner\n\n \n\nIf you're still not convinced at the safety and effectiveness of vitamin C therapy - I encourage you to look up the work of the Riordan Clinic plus many other experts in vitamin C like, Drs. Irwin Stone, Abram Hoffer, Robert Cathcart plus many others - listed above.", "opengraph": {"url": "http://foodmatters.tv/articles-1/vitamin-c-natures-most-powerful-vitamin-for-healing", "type": "article", "title": "If “Vitamin C Is the World's Best Natural Antibiotic, Antiviral, Antitoxin,” Why Is It Being Ignored", "description": "Over 75 years of medical research and clinical practice reveals that vitamin C has the power to ignite the 'self-healing response’,  yet doctors still deny its effectiveness.", "image": "https://www.foodmatters.com/media/uploads/images/articles/vitamin-c-is-the-worlds-best-natural-antibiotic.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen", "https://www.foodmatters.com/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen"], "authors": [], "publish_date": null}