{"result_id": "117003", "URL": "https://www.foodmatters.com/article/parabens-and-breast-cancer", "timestamp": "2023-04-25 15:07:00 CEST+0200", "meta": {"description": "Recent research has made us realise just how important it is to read all labels - and not just on the foods we are buying. A new study has now shown how parabens (found in numerous drugs, foods, personal care products and cosmetics) are detected in different parts of our bodies and which areas are the most sensitive to these parabens.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/parabens-and-breast-cancer", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Parabens and Breast Cancer", "cleaned_text": "It has become apparent that it is even more important to read personal care product labels. A new study in The Journal of Applied Toxicology has made us more aware of the dangers of parabens, a class of estrogen-mimicking chemicals which are found in numerous drugs, foods, personal care products and cosmetics. In the study, “Parabens detection in different zones of the human breast consideration of source and implications of findings,” researchers discussed the possible role of parabens in causing breast cancer and childhood disease.\n\n \n\n Once you start reading labels, you will find that parabens are found in thousands of personal care products on the market. Sayer Ji, founder and chair of GreenMedInfo.com, has an excellent article which focuses on the findings of The Genesis Breast Cancer Prevention Centre at the University Hospital of South Manchester NHS Foundation Trust: Human Hormones Are Being Eclipsed by Synthetic Chemicals. Here we find that scientists from the Breast Cancer Prevention Centre have discovered five paraben esters in human breast tissue samples, collected from 40 mastectomies from women with primary breast cancer.\n\n \n\n The report discussed by Sayer Ji reveals three main points:\n• The ester form of parabens found within the breast tissue samples indicated a dermal route of exposure, as would occur through skin care products and underarm deodorants.\n• The paraben residues were found at concentrations up to 1 million times higher than the estrogen (estradiol) levels naturally found in human breast tissue.\n• Propylparaben was found in the highest concentration in the underarm area (axilla), where underarm deodorants are most used and breast cancer prevalence is at its highest.\n\nMeanwhile, our watchdog organization WHO (The World Health Organization) considers the estrogenic properties of parabens to be a low toxicological risk due to it being 10,000 to 100,000 times less potent than estradiol (E2). However, the one millionfold higher levels found within the sampled breast tissue clearly indicate that the magnitude of exposure more than compensates for the reduction in potency.\n\n \n\n Sayer Ji points out that the new study raises a highly disturbing possibility:\n\n \n\n “For exposures in children, concern has already been raised that ‘the estrogenic burden of parabens and their metabolites in blood may exceed the action of endogenous estradiol in childhood and the safety margin for propylparaben is very low when comparing worst-case exposure.” (Boberg et al., 2010)\n\n \n\n I know from personal experience with The Wiley Protocol and bio-identical/biomimetic hormone creams that it is very important to cover the areas of our body where the BHRT creams are applied for at least two hours, in order to prevent children, our partners and our pets from exposure to them. We also learn to keep these prescription creams in secure locations, so that children and pets cannot get into them. However, parabens can be found in almost everything. The build-up in our systems must be heavy, to say the least, since we bathe, shower, use shampoo, and slather lotions and products on our bodies for sun protection and moisturization. Certainly much of it lands on or near delicate breast tissue.\n\n \n\n For those of us using BHRT in measured doses, we would not want the added burden of something that would interfere with, or worse, become an even bigger burden when combined with our BHRT protocol. Sayer Ji adds the cautionary note that synthetic hormones from chemicals like parabens may actually be eclipsing the activity of endogenously produced (natural) hormones in our children. Given that 99.1% of the U.S. population’s urine samples (ages 6 or older) contain methylparaben, this issue has broad-ranging implications.\n\n \n\n It seems that the EU is more watchful than the USA; according to Ji, the European regulations presently allow for the use of parabens in cosmetics at no more than 0.4% by volume. The limits in the US are much less restrictive. According to the FDA website, “The Cosmetic Ingredient Review (CIR) reviewed the safety of methylparaben, propylparaben, and butylparaben in 1984 and concluded they were safe for use in cosmetic products at levels up to 25%. Typically parabens are used at levels ranging from 0.01 to 0.3%.” Parabens are also FDA-approved for use as food preservatives. The question is, just how much of this paraben load do we each get daily?\n\n \n\n The problem that I have with these chemicals being added to so many daily-use personal care products is that, while it may not be problematic to use one product daily, what happens when they are all combined in our bodies? Just like how it may be OK to take one drug when you need it or are prescribed it, but if you start combining that drug with other prescription and over-the-counter medications, what on earth do our bodies do with the combinations of these chemicals?\n\n \n\n One might also wonder what happens when breastfeeding infants are exposed both internally and externally to these personal care products, when the products are directly applied to the breasts of their mothers. There are so many questions raised here, yet we are just supposed to assume that the FDA knows the total paraben load each individual is getting at any given time.\n\n \n\n It seems reasonable to assume that when you combine drugs internally and topically, you make more drugs within your own body. These combinations would be tricky to keep track of even by the most sophisticated computers. But the possibility remains that there might be a build-up and combination effect, which could overload our immune system—the very immune system that worked pretty darn well before we started becoming human guinea pigs for Big Pharma!\n\n \n\n Sayor Ji sums up my concern when he states:\n\n \n\n “Given the fact that modern-day toxicological risk assessments do not account for the adverse effects of chronic, low-dose exposures, nor the reality of synergistic toxicities, i.e. the reality that a chemical’s adverse effects may be amplified when present alongside other chemicals, this new research points to a disturbing possibility: commonly used preservatives may be contributing greatly to the burden of disease in exposed populations — especially infants and children, whose body burden is higher (lower body weight vs. chemical dose), susceptibility to chemically-induced genotoxicity higher (because their cells replicate more rapidly), and detoxification systems are less developed than adults.”\n\n \n\n I would suggest that our companion animals are becoming overburdened as well, through the chemicals in commercial pet food, vaccines, flea prevention protocols, tick and heartworm prevention products, and numerous other chemicals they are exposed to.\n\n \n\n I totally agree with Saylor Ji, who expresses that it is imperative to find a way to protect ourselves, our children, and our pets from what are avoidable chemical exposures. It is time for the USA to implement a precautionary approach to its toxicological risk assessments: if there is an indication that a chemical could do harm (based on cell and animal studies), it should be treated as if it does do harm, and be regulated accordingly.\n\n \n\n Until that day comes, we need to take precautions ourselves. I therefore recommend that when you contemplate buying any product, you should read the label carefully. If you do not recognize the ingredients, you simply don’t buy it until you have researched what they are. Remember that each dollar we spend is a vote for whom we wish to help stay in business and make a profit.\n\n \n\n You can research natural, paraben-free products online, and or learn to make some yourself in your own home with your own natural ingredients. Many people have ended up starting their own businesses this way, in an effort to offer something safe to consumers who don’t have the time or inclination to make products themselves.\n\n \n\n I also highly recommend just the use of organic virgin coconut oil. You can use it to remove your makeup and eye products, moisturize your skin, and even cook with it.\n\n \n\n I will continue to search for and create new recipes with natural ingredients for us to whip up at home. In the meantime, please read the labels carefully of the products you have on hand now and do a web search for what some suspicious ingredients actually are.", "opengraph": {"url": "http://foodmatters.tv/articles-1/parabens-and-breast-cancer", "type": "article", "title": "Parabens and Breast Cancer", "description": "Recent research has made us realise just how important it is to read all labels - and not just on the foods we are buying. A new study has now shown how parabens (found in numerous drugs, foods, personal care products and cosmetics) are detected in different parts of our bodies and which areas are the most sensitive to these parabens.", "image": "https://www.foodmatters.com/media/images/assets/cosmetics.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=17&utm_campaign=food-matters-certification-program-waitlist-lady-green", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=17&utm_campaign=food-matters-certification-program-waitlist-lady-green"], "authors": [], "publish_date": null}