{"result_id": "117022", "URL": "https://www.foodmatters.com/article/what-is-really-in-a-vaccine", "timestamp": "2023-04-25 15:07:26 CEST+0200", "meta": {"description": "Did you know that the current highest cause of preventable death in the United States was once considered to be completely harmless?", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/what-is-really-in-a-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "What Is Really In A Vaccine?", "cleaned_text": "Did you know that the current highest cause of preventable death in the United States was once considered to be completely harmless?\n\nThat’s right, cigarettes - which now kill approximately 11 people every minute - were once declared safe for human consumption by scientists and doctors alike. Our attitude towards smoking may have come a long way since its introduction to Western society, however for many people, the knowledge was too little, too late, and the effect of smoking on their health was devastating.\n\nIt’s comfortable to assume that our modern scientific community would never again misjudge the harmful effects of such a widely used consumer product, however, that assumption may be poorly founded according to a groundbreaking new documentary titled \"Man Made Epidemic\". The film has drawn some astonishing links between the illusions of safety that surrounded tobacco products in the early 1900's and the current widespread social acceptance of vaccines produced by multinational pharmaceutical companies.\n\nIn 1975, only 1 in 5000 American children was diagnosed with autism; a figure which has now grown to 1 in 25. The team behind \"Man Made Epidemic\" claims that environmental factors such as vaccinations have been one of the main contributing factors to this epidemic. Exploring personal accounts of families with children who developed Autism shortly after receiving vaccinations, the film highlights the fact that there has never been a comprehensive study conducted on the combined effects of the multiple vaccinations received by most American kids.\n\nIt goes on to claim that during the early stages of cigarette production, many scientists and doctors were paid by tobacco companies to publically endorse smoking as a harmless behavior, and that pharmaceutical companies today may be allocating their significant financial resources to achieving a similar outcome for modern vaccines; without any regard for the potentially serious impact on our children’s health.\n\nThe \"vax debate\" has been a polarizing topic for many years now, with most people adopting a religiously firm viewpoint on one side or the other. As a parent, it's so difficult to know whether or not you are making the right choice for your child. Seeking out reliable information on such a controversial topic can be difficult, so here are a few quick answers to some of the most important questions.\n\nQ. How many vaccinations does the average child receive?\n\nA. If you follow the CDC’s (U.S. Department of Health & Human Services' Center For Disease Control and Prevention) recommended vaccination schedule, your child will receive 49 doses of 14 different vaccines by the time they reach 6 years old. By the age of 18, the CDC recommends that children should have received a total of 69 doses of 16 different vaccines.\n\nQ. What harmful ingredients are commonly found in vaccines?\n\nA. According to the CDC's vaccine additives page, some of the following ingredients may be routinely used in common vaccines:\n• Aluminum: A neurotoxin that has been linked to many neurological diseases including dementia, autism, and Parkinson's disease.\n• Formaldehyde: A carcinogen that U.S. Department of Health & Human Services' National Toxicology Program openly admits is linked to cancer.\n• Thimerosal (Mercury): A recognized neurotoxin that is particularly damaging to young, developing brains and is considered unsafe to breathe or ingest. Found in standard flu vaccines.\n\nQ. Is there such thing as a completely \"safe\" vaccine?\n\nA. According to the National Vaccine Information Center, the short answer is - \"NO\". On their website, the NVIC state, \"Like every prescription medication, every vaccine carries a risk of injury or death that can be greater for some than others. Every vaccine recommended for use by government and doctors has been associated with hospitalizations, injuries, and deaths. Whether or not you or your child suffers a vaccine reaction will depend upon the vaccine(s) given and the various genetic, biological and other high-risk co-factors that may be known and unknown at the time of vaccination.\"\n\nUnder the National Childhood Vaccine Injury Act of 1986, nearly $3 billion has been awarded to people who have suffered side effects from vaccinations. The NVIC has put together a list of 8 questions that everyone should ask before vaccinating themselves or their children. These questions are designed to educate people on the importance of making fully informed vaccine decisions.\n\n1. Am I or my child sick right now?\n\n2. Have I or my child had a bad reaction to a vaccination before?\n\n3. Do I or my child have a personal or family history of vaccine reactions, neurological disorders, severe allergies or immune system problems?\n\n4. Do I know the disease and vaccine risks for myself or my child?\n\n5. Do I have full information about the vaccine’s side effects?\n\n6. Do I know how to identify and report a vaccine reaction?\n\n7. Do I know I need to keep a written record, including the vaccine manufacturer’s name and lot number, for all vaccinations?\n\n8. Do I know I have the right to make an informed choice?\n\nThe NVIC has also developed a Vaccination Ingredients Calculator which can help you to understand the types of substances that are commonly found in vaccines that are recommended by the CDC and the potential effects they could have on you or your loved ones.\n\nYou can also watch Man Made Epidemic on FMTV - where filmmaker Natalie Beer sets off on a journey around the world speaking to leading doctors, scientists and families to find out the truth about the autism epidemic and whether or not vaccines have a role to play.", "opengraph": {"url": "http://www.foodmatters.com/article/what-is-really-in-a-vaccine", "type": "article", "title": "What Is Really In A Vaccine?", "description": "Did you know that the current highest cause of preventable death in the United States was once considered to be completely harmless? ", "image": "https://www.foodmatters.com/media/uploads/images/articles/what-is-really-in-vaccines.jpg", "article:author": "https://www.facebook.com/James.Food.Matters"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.fmtv.com/watch/man-made-epidemic", "https://www.fmtv.com/watch/man-made-epidemic", "https://www.cdc.gov/vaccines/schedules/index.html", "http://articles.mercola.com/sites/articles/archive/2010/03/06/vaccine-failure--over-1000-get-mumps-in-ny-in-last-six-months.aspx", "https://ntp.niehs.nih.gov/ntp/roc/content/profiles/formaldehyde.pdf", "http://articles.mercola.com/sites/articles/archive/2011/10/31/flu-vaccination-epa-safety-limit-for-mercury.aspx", "http://www.nvic.org/faqs/vaccine-safety-immunity.aspx", "http://www.nvic.org/nvic-vaccine-news/november-2015/vic-governments-broken-contract-with-parents.aspx", "http://www.nvic.org/Ask-Eight-Questions.aspx", "http://www.vaccine-tlc.org/", "https://www.fmtv.com/watch/man-made-epidemic", "https://www.fmtv.com/watch/man-made-epidemic", "/films?utm_source=contents_cta_item&utm_medium=banner&utm_content=12&utm_campaign=watch-the-entire-food-matters-film-llibrary", "https://www.foodmatters.com/films?utm_source=contents_cta_item&utm_medium=banner&utm_content=12&utm_campaign=watch-the-entire-food-matters-film-llibrary"], "authors": [], "publish_date": null}