{"result_id": "117020", "URL": "https://www.foodmatters.com/article/the-truth-about-vitamin-d", "timestamp": "2023-04-25 15:07:24 CEST+0200", "meta": {"description": "Help protect your body against disease and boost your immune system with a cheap and readily available natural product. Research has shown that Vitamin D is effective in the treatment of cancer, heart disease, and osteoporosis yet there remains an alarming rate of people that are deficient in this vital mineral.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/the-truth-about-vitamin-d", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "The Truth About Vitamin D", "cleaned_text": "There is an epidemic of vitamin D deficiency sweeping across our modern world, and it's an epidemic of such depth and seriousness that it makes the H1N1 swine flu epidemic look like a case of the sniffles by comparison. Vitamin D deficiency is not only alarmingly widespread, it's also a root cause of many other serious diseases such as cancer, diabetes, osteoporosis and heart disease.\n\n \n\n A new study published in the March, 2010 issue of the Journal of Clinical Endocrinology and Metabolism found that a jaw-dropping 59 percent of the population is vitamin D deficient. In addition, nearly 25 percent of the study subjects were found to have extremely low levels of vitamin D.\n\n \n\n Lead author of the study, Dr. Richard Kremer at the McGill University Health Center, said \"Abnormal levels of vitamin D are associated with a whole spectrum of diseases, including cancer, osteoporosis, and diabetes, as well as cardiovascular and autoimmune disorders.\"\n\n \n\n This new study also documents a clear link between vitamin D deficiency and stored body fat. This supports a theory I've espoused here on NaturalNews for many years: That sunshine actually promote body fat loss. Vitamin D may be the hormonal mechanism by which this fat loss phenomenon operates.\n\n \n\n The research findings on vitamin D, by the way, get even better...\n\nRecent research carried out at the University of Copenhagen has revealed that vitamin D activates the immune system by \"arming\" T cells to fight off infections.\n\n \n\n This new research, led by Professor Carsten Geisler from the Department of International Health, Immunology and Microbiology at the University of Copenhagen, found that without vitamin D, the immune system's T cells remain dormant, offering little or no protection against invading microorganisms and viruses. But with vitamin D in the bloodstream, T cells become \"armed\" and begin seeking out invaders that are then destroyed and carried out of the body.\n\n \n\n Vitamin D, in other words, acts a bit like the ignition key to your car: The car won't run unless you turn the key and ignite the engine. Likewise, your immune system won't function unless it is biochemically activated with vitamin D. If you're facing the winter flu season in a state of vitamin D deficiency, your immune system is essentially defenseless against seasonal flu. That's why all the people who get sick are the ones who live indoors, work indoors and exist in a chronic state of vitamin D deficiency.\n\n \n\n That's also why virtually all the people who died from H1N1 were chronically deficient in vitamin D. They had virtually no immune system protection at all and were thus easy targets for the swine flu.\n\n \n\n These findings about vitamin D \"arming\" the immune system were published in Nature Immunology. Commenting on the findings, the researchers said, \"Scientists have known for a long time that vitamin D is important for calcium absorption and the vitamin has also been implicated in diseases such as cancer and multiple sclerosis, but what we didn't realize is how crucial vitamin D is for actually activating the immune system -- which we know now.\" (UK Telegraph). \n\n \n\n It seems the CDC and WHO remain utterly ignorant about this research or they would have been recommending vitamin D to fight the recent H1N1 pandemic rather than vaccine shots. Vitamin D would have been a far more effective (and less costly) defense against the pandemic than vaccine shots, especially given that even vaccines don't work unless there is an immune response, and that immune response requires the presence of vitamin D!\n\n \n\n And while vaccine shots have undesirable side effects such as causing severe neurological damage in a small number of vaccine recipients, vitamin D's only significant \"side effect\" is that it prevents 77% of all cancers, too. (http://www.naturalnews.com/021892.html)\n\nWhat's becoming increasingly clear from all the new research is that vitamin D deficiency may be the common denominator behind our most devastating modern degenerative diseases. Kidney failure patients are almost universally deficient in vitamin D and diabetes patients are usually in the same category. People suffering from cancer almost always demonstrate severe vitamin D deficiency, as do people with osteoporosis and multiple sclerosis.\n\n \n\n In fact, vitamin D deficiency may be the root cause behind so many degenerative diseases that correcting this deficiency across the population could very well devastate the for-profit \"sick care industry\" that dominates western medicine today.\n\n \n\n Teach the population about vitamin D, in other words, and the cancer industry would suffer devastating losses in profits (vitamin D prevents 4 out of 5 of all cancers).\n\n \n\n This is perhaps why so many of the businesses and non-profits that depend on cancer (and other diseases) for their authority and power are actively fighting against vitamin D awareness. The National Cancer Institute, for example, which is one of the wealthiest non-profits in the world, actively runs full-page ads that attempt to scare people away from sunlight, thereby causing them to remain in a state of vitamin D deficiency.\n\n \n\n This state of deficiency coincidentally serves the power interests of the NCI by making sure that people remain riddled with cancer even though a free cure (sunshine) is readily available.\n\n \n\n The FDA, similarly, doesn't want people to learn the truth about vitamin D because informed consumers would inevitably take more vitamin D supplements and thereby prevent all sorts of diseases that the pharmaceutical industry is counting on for its monopoly profits. Every patient that takes vitamin D is one less patient paying money for cancer drugs, diabetes drugs or heart disease drugs.\n\n \n\n Other cancer industry non-profits, likewise, don't want people to learn the truth about vitamin D. They'd rather just keep selling ridiculous pink-ribbon consumer products that claim to raise money for some highly fictitious \"search for the cure\" -- a search that was obsolete even before it began because sunshine has been curing and preventing cancer for as long as human beings have walked the planet. Our ancestors didn't have to \"run for the cure\" or \"walk for the cure\" through some silly fundraising fiction; they merely walked in the sun and they were cured of cancer by the mere act of being exposed to sunlight. Walking outside is, all by itself, the \"cure\" for cancer that the industry claims to need billions more dollars to try to find through additional research.\n\nThey want you to remain ignorant\n\nThe inescapable truth of the matter is that modern medicine wants people to remain ignorant about the healing effects of vitamin D. The financial survival of the medical industry absolutely depends on it, so the most influential medical organizations systematically downplay the importance of this vitamin while outright refusing to recommend it to patients.\n\n \n\n The NCI doesn't recommend vitamin D, nor does Komen for the Cure. The AHA, AMA, ADA and FDA all refuse to recommend vitamin D, all while strongly promoting synthetic, patented high-profit medications that cure nothing.\n\n \n\n There is, in essence, a conspiracy of silence about vitamin D among the sick-care industries that depend on disease to bring them business. And there always will be, of course, because companies are in business to make money, and if you're in business to make money from disease, you generally don't go telling people how to heal themselves for free. From a purely profit-minded perspective, teaching people about vitamin D makes absolutely no business sense to the sick care industry. It's profits over people (as usual).\n\nYou can't keep Vitamin D down\n\nBut you can't keep hiding the truth about vitamin D forever: The science is absolutely compelling. It's irrefutable, actually. These nine things about vitamin D are inarguably true:\n• The vast majority of the western population is deficient in vitamin D.\n• Vitamin D deficiencies promote cancer, diabetes, osteoporosis, kidney disease, depression, obesity and heart disease, among other health problems.\n• Vitamin D deficiencies can be corrected with vitamin D supplementation or through sensible sunlight exposure.\n• Sunscreen products block the production of vitamin D in the skin, causing further vitamin D deficiencies across the population of consumers who use such products.\n• Correcting widespread vitamin D deficiencies would greatly reduce degenerative disease across the population, thereby saving nations literally trillions of dollars in collective sick-care costs over the next decade.\n• Vitamin D supplements are extremely affordable. Preventing disease through vitamin D supplementation is a low-cost investment in health that pays off a hundred fold (or more) through health care cost savings.\n• Vitamin D is extremely safe. There are virtually no negative side effects from deficient people taking vitamin D supplements, even at seemingly high doses such as 4000 - 8000 IU per day (more than ten times the current U.S. RDA).\n• Vitamin D deficiency is caused, in large part, by modern society's indoor lifestyle . People live, work and play indoors under artificial light. This causes severe deficiencies in exposure to natural light (sunlight) through which vitamin D is usually generated.\n• Vitamin D dramatically reduces susceptibility to infectious disease such as seasonal flu and H1N1. It \"activates\" the immune system and allows it to function more aggressively in defending against viral invasions.\n\nBetter than a vaccine, safer than a drug...\n\nIn effect, Vitamin D is a better vaccine than vaccines. It's a better cancer drug than cancer drugs. It's a better osteoporosis drug than osteoporosis drugs. Vitamin D is a better treatment for diabetes than diabetes drugs.\n\n \n\n Again and again, vitamin D turns out to be safer, more effective and far more affordable than expensive monopoly-priced medications. Plus, it's obviously innately compatible with the human body since the human body actually manufactures vitamin D when given the opportunity (and exposure to sunlight).\n\n \n\n Furthermore, unlike pharmaceuticals, vitamin D is safe for the environment. Flushing excess vitamin D down the drain doesn't contaminate the fish like pharmaceuticals do.\n\n \n\n With all these things being true about vitamin D, it all makes you wonder: Why isn't health care reform even talking about this nutrient? If you really want to reform the health of a nation, you have to start by correcting the epidemic of vitamin D deficiency across the population.\n\n \n\n When it comes to keeping people healthy, all the drugs in the world can't accomplish what vitamin D can accomplish... simply, affordably and safely.\n\n \n\n You can get it for free. No prescription required. No visit to the doctor. You don't even need to buy supplements to get this. Just walk outside, under the sun, and initiate your own healing.\n\n \n\n That very idea -- that patients can cure their own cancers by taking a walk in nature -- is the most fearful thing in the world to the cancer and vaccine industries. Big Pharma is horrified at the idea of people becoming nutritionally literate and realizing that vitamin D, all by itself, eliminates the need for potentially hundreds of different medications and vaccines. It activates healing, it defends the body against disease, and it's the single greatest threat to the profitability of the sick-care industry that dominates medicine today.\n\n \n\n If modern medicine could ban Vitamin D, they would do so in an instant. They may yet pull that off, in fact, through Sen. McCain's attempts to destroy nutritional supplements.", "opengraph": {"url": "http://foodmatters.tv/articles-1/the-truth-about-vitamin-d", "type": "article", "title": "The Truth About Vitamin D", "description": "Help protect your body against disease and boost your immune system with a cheap and readily available natural product. Research has shown that Vitamin D is effective in the treatment of cancer, heart disease, and osteoporosis yet there remains an alarming rate of people that are deficient in this vital mineral.", "image": "https://www.foodmatters.com/media/images/assets/sunlight-vitamin-d.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=17&utm_campaign=food-matters-certification-program-waitlist-lady-green", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=17&utm_campaign=food-matters-certification-program-waitlist-lady-green"], "authors": [], "publish_date": null}