{"result_id": "117015", "URL": "https://www.foodmatters.com/article/france-opting-out-of-vaccines", "timestamp": "2023-04-25 15:07:15 CEST+0200", "meta": {"description": "The French people are no fools. As a culture, France seems to see through clever marketing ploys concocted by abusive corporations intent on perverting the laws of honest capitalism for their own profit. So why are they opting out of vaccines?", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/france-opting-out-of-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Why France Is Thumbing Its Nose At Vaccines (In A BIG Way)", "cleaned_text": "\"The French people are no fools. As a culture, France seems to see through clever marketing ploys concocted by abusive corporations intent on perverting the laws of honest capitalism for their own profit. And, the French people seem to catch on long before most other countries raise a collective eyebrow.\n\n \n\n In 1992, for example, more than two decades before Americans finally started to turn their backs on fast food, French citizens were protesting in the streets against McDonalds. The activism spilled into violent confrontation as protesters lit a bonfire outside a McDonald's and again in 1999 when José Bové dismantled a McDonald's under construction in South France with the help of a group of fellow farmers.\n\n \n\n France doesn't trust Monsanto either as the country has banned the sale of herbicides containing deadly glyphosate (Roundup) at French nurseries and mandated the labeling of GMOs along with restrictions on their cultivation.\n\n \n\n This collective distrust of corporate ulterior motives extends to the vaccine industry as well. Since 2005, the doubts of the French public along with a large percentage of its medical doctors over the safety and effectiveness of vaccines has continued to skyrocket.\"\n\n \n\n Read the rest of this article at The Healthy Home Economist.\n\nVive la France! Let's hope the rest of the world follows suit sooner rather than later!", "opengraph": {"url": "http://foodmatters.tv/content/france-opting-out-of-vaccines", "type": "article", "title": "Why France Is Thumbing Its Nose At Vaccines (In A BIG Way)", "description": "The French people are no fools. As a culture, France seems to see through clever marketing ploys concocted by abusive corporations intent on perverting the laws of honest capitalism for their own profit. So why are they opting out of vaccines?", "image": "https://www.foodmatters.com/media/articles-1/france-no-vaccines.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "http://www.thehealthyhomeeconomist.com/france-opting-out-of-vaccines/", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green", "https://www.foodmattersinstitute.com/program/nutrition-certification?utm_source=contents_cta_item&utm_medium=banner&utm_content=19&utm_campaign=food-matters-certification-program-waitlist-experts-green"], "authors": [], "publish_date": null}