{"result_id": "117017", "URL": "https://www.foodmatters.com/article/the-miracle-superfood-packs-more-protein-than-red-meat", "timestamp": "2023-04-25 15:07:17 CEST+0200", "meta": {"description": "What if adding just one food to your diet could provide you with a multitude of nutrients and an endless list of health protective benefits? Discover Spirulina - one of the most nutritious and concentrated food sources on the planet.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/the-miracle-superfood-packs-more-protein-than-red-meat", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "The Miracle Superfood: Packs More Protein Than Red Meat", "cleaned_text": "Imagine a plant that can nourish your body by providing most of the protein you need to live, help prevent the annoying sniffling and sneezing of allergies, reinforce your immune system, help you control high blood pressure and cholesterol and help protect you from cancer. Does such a “super food” exist?\n\n \n\n Yes. It’s called spirulina.\n\n \n\n Unlike plants you may grow in your garden, this “miracle” plant is a form of blue-green algae that springs from warm, fresh water bodies.\n\nChlorella is another form of algae that is sometimes confused with spirulina. The fundamental difference between spirulina and chlorella is that spirulina is many thousands of years older and does not possess the hard cell wall that makes chlorella closer to being a plant than algae. \n\n \n\n Chlorella is an excellent way to detoxify your body from mercury, which most of you are contaminated with if you’ve ever had dental fillings, received a vaccine, used certain types of cookware or eaten fish. Spirulina simply is unable to remove heavy metals like chlorella as it lacks a cell membrane.\n\nSpirulina History - Could This Super Food Help End World Hunger?\n\nSpirulina is a simple, one-celled organism that got its name from the Latin word for ‘helix’ or ‘spiral’ because of its spring-like physical characteristic. Its scientific name is Arthrospira platensis, and it belongs to the cyanobacteria family.\n\n \n\n The use of spirulina as a food source dates all the way back to 9th century Chad and it is believed spirulina was used by the Aztecs in 16th century Mexico. Historical records report the harvesting and selling of cakes made from spirulina harvested from Lake Texcoco. It was rediscovered in the 1950’s in the same place where it has said to have its origins by a European scientific mission. The spirulina was being harvested and sold in dried flat cakes called, “dihé” at the local markets where natives would use it as a staple for many of their meals.\n\n \n\n Spirulina didn’t come into commercial production until the 1970’s when a French company began the first large-scale spirulina production plant. Within a few years, America and Japan began producing their own spirulina.\n\n \n\n Today, these nutrient-rich algae are being used around the world to help treat illness and are being seriously discussed as a sustainable source of food with the potential to end world hunger. Unlike most plants, which need to be cultivated and nurtured, spirulina is a survivor, able to withstand extreme temperature variations and neglect and still thrive. According to studies, spirulina is being successfully used to treat a wide variety of ailments, including those who’ve been poisoned by arsenic-contaminated water.\n\nIf you have an autoimmune disease such as Crohn’s disease, chronic fatigue syndrome, Lupus or fibromyalgia, chronic candida yeast can both cause and worsen your symptoms. Spirulina has been shown to encourage and support the growth of healthy bacterial flora in your gut, which can help keep candida overgrowth under control. \n\n \n\n\n\nDrugs such as AZT used to treat HIV and AIDS patients can actually cause the symptoms they are supposed to cure. However, spirulina has been shown to help inactivate the human immunodeficiency virus associated with HIV and AIDS.\n\nIf you suffer from seasonal or perennial allergies, you’re not alone. Millions of people are allergic to pollen, ragweed, dust, mold, pet dander and a myriad other environmental contaminants, ensuring the makers of Kleenex will always stay in business.\n\n \n\n Unfortunately, many people who have allergic rhinitis treat it with prescription and over-the-counter (OTC) drugs that often do more harm than good. Antihistamines are designed to suppress your immune system, which leads to decreased resistance to disease and dependence on the drug. Certain asthma drugs have been linked to serious side effects as well.\n\n \n\n This is where natural methods such as the use of spirulina come in. According to one study, patients treated with spirulina reported relief of symptoms commonly associated with allergic rhinitis, such as nasal discharge and congestion, sneezing and itching when given spirulina.\n\nHigh blood pressure (hypertension) is a serious health concern that affects millions of Americans today. If you have high blood pressure, you are at increased risk of dying from a heart attack or stroke.\n\n \n\n The good news is, following a healthy nutritional plan, getting adequate exercise and applying stress modification techniques such as the Emotional Freedom Technique (EFT) can help normalize blood pressure and get you back on track to optimal health. According to a study done by the Department of Biochemistry in Mexico, 4.5 grams of spirulina given each day, was shown to regulate blood pressure among both women and men between the ages of 18-65 years with no other dietary changes made during the 6 weeks the experiment was run.\n\nAre you on a cholesterol medication? Tens of millions of people take cholesterol-lowering medications (known as statins) every day and, according to “experts”, millions more should be taking them, including children! \n\n \n\n Statin drugs are responsible for a host of unwanted and dangerous side effects including:\n• Cholesterol-lowering medications have also been linked to severe muscle problems such as polyneuropathy (nerve damage in the hands and feet) and rhabdomyolysis (a serious degenerative muscle tissue condition). There is even evidence to suggest that taking statins can increase your risk of developing Lou Gehrig’s disease.\n\n\n\n Thankfully, there are natural ways to lower your cholesterol. Avoiding fructose and grains, and getting appropriate exercise top the list (for more information, please see this previous article), but spirulina may also help. According to a study done on elderly male and female patients ages 60-87, those given 8 grams of spirulina per day for 16 consecutive weeks showed lower cholesterol levels than those who were given a placebo.\n\nThose with sickle-cell anemia or congenital heart defects are at greater risk for a condition called brain ischemia or cerebral ischemia. Brain ischemia refers to a lack of blood flow to your brain, which causes oxygen deprivation and can lead to a stroke. Just ten seconds of interrupted blood flow to your brain can cause unconsciousness and lead to serious health consequences.\n\n \n\n In a study done at the Institute of Pharmaceutical Technology in India, it was found that a dosage of 180mg/kg of spirulina had a protective effect on the brain and nervous system of rats exposed to high amounts of free radicals, compared to rats not given the spirulina before the experiment. This lab test shows the promising effect of spirulina on stroke prevention.\n\nCancer is the leading killer of adult Americans under 70 and in the case of this frightening disease, prevention is worth much more than a pound of cure. \n\n \n\n My first recommendation in cutting your cancer risk is to eliminate sugar/fructose, grains, and processed foods from your diet. Additives such as fructose feed cancer cells and help them to thrive. I also recommend healthy sun exposure, which will boost your levels of natural vitamin D and help cut your cancer risk by half!\n\n \n\n But spirulina may have potential benefits here as well. According to a study done in China, selenium-infused spirulina inhibited the growth of MCF-7 breast cancer cells.\n\nWhen you think of protein, you probably imagine sitting down to a meal of organic eggs or grass-fed beef or maybe even drinking a whey protein shake.\n\n \n\n If you’re a vegetarian, you may turn to plant-protein sources such as nuts, beans, lentils and soy products. Unfortunately, soy is not the health food it claims to be. None of the above-mentioned sources of protein compare to the protein punch delivered by spirulina. Spirulina is 65-71 percent complete protein compared to beef, which is only 22 percent, and lentils, which is only 26 percent. In addition to being protein-rich, spirulina is an excellent source of vital amino acids and minerals easily assimilated by your body. You would need to consume only two tablespoons of spirulina as a protein substitute for a meal. Optimal Spirulina - Types and Dosing There are many types of spirulina out there so it is important to do your homework before making a purchase. Since spirulina grown in an uncontrolled environment has the potential to become contaminated with heavy metals and other toxins, it is important to choose organic spirulina from a reputable source.\n\n \n\n Spirulina comes in capsules, tablets, powders and flakes. The recommended daily dose is typically between 3 to 5 grams. You can spread the dose out to twice or three times a day if you like. It is safe to take higher doses, but this is a good place to start. Remember to increase your intake of spring or filtered water when taking spirulina to help it absorb into your system.\n\n \n\n An Important Note on Dosing\n\n In addition to being your powerhouse of essential vitamins and minerals, spirulina is a potent detoxifier. For that reason, it is best to start with a small dose and work your way up. Once you see how your body responds, you can then gradually increase your intake.\n\nSpirulina is a safe source of protein, nutrients, vitamins and minerals that has been used for centuries. Though there are no known side effects associated with spirulina, your body may react to it based on your current state of health. \n\n The most prominent reactions you may experience are:\n• None Slight Fever: The high protein content in spirulina increases metabolism, which may elevate body temperature.)\n• None Dark Green Waste Matter: Spirulina can remove accumulated waste product in your colon, which may cause darker stool. Also, spirulina is high in chlorophyll. This will also turn waste matter green.\n• None Excessive Passing of Gas: This may indicate that your digestive system is not functioning properly or you have an extreme build-up of gas.\n• None Feelings of Excitement: Your body is converting protein into heat energy, which may cause temporary feelings of restlessness.\n• None Breakouts and Itchy Skin: This is caused by colon cleansing process and is only temporary.\n• None Sleepiness: This is caused by the detoxification process and may indicate your body is exhausted and needs better rest.\n\nRemember, your body may go through an adjustment period with spirulina and your best bet to reduce reaction is to dose gradually to see how your body will react. Increase your water intake, reduce your stress levels, eat according to your nutritional type and get plenty of rest.\n\n \n\n Important Contraindications for Spirulina\n\n Even though spirulina is entirely natural and generally considered a healthful food, there are some contraindications you need to be aware of. You should not take spirulina if you have a severe seafood or iodine allergy. And, if you are pregnant or nursing or have hyperthyroidism, consult your healthcare provider before taking spirulina.\n\n As you can see, spirulina can serve as a potent ‘super food.’ Just remember to do your research and arm yourself with knowledge. It is the best way to take control of your health!\n\nDo you add spirulina to your diet? Whats your favourite way of including this superfood?", "opengraph": {"url": "http://foodmatters.tv/articles-1/the-miracle-superfood-packs-more-protein-than-red-meat", "type": "article", "title": "The Miracle Superfood: Packs More Protein Than Red Meat", "description": "What if adding just one food to your diet could provide you with a multitude of nutrients and an endless list of health protective benefits? Discover Spirulina - one of the most nutritious and concentrated food sources on the planet.", "image": "https://www.foodmatters.com/media/images/articles/spirulina-more-protein-than-meat.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen", "https://www.foodmatters.com/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen"], "authors": [], "publish_date": null}