{"result_id": "117005", "URL": "https://www.foodmatters.com/article/did-you-know-that-vitamin-c-can-treat-over-30-major-diseases", "timestamp": "2023-04-25 15:07:01 CEST+0200", "meta": {"description": "Vitamin C can do more than simply help you overcome a cold. Here’s how one doctor used vitamin C to treat multiple conditions for years!", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/did-you-know-that-vitamin-c-can-treat-over-30-major-diseases", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Did You Know That Vitamin C Can Treat Over 30 Major Diseases?", "cleaned_text": "Intravenous Vitamin C for Cancer Cure on ABC News\n\nMarch 15, 2008:\n\n \n\n Vitamin C has been known to cure over 30 major disease for over 50 years. But why haven't you heard more about it? Why haven't more doctors used Vitamin C as medicine? \n\n \n\n Progress takes time, unfortunately. Fresh fruit was known to cure scurvy by 1753, yet governments ignored the fact for nearly 100 years. Countless thousands died in the meantime. The 19th century doctor who first advocated washing one's hands between patients died ignored and in disgrace with the medical profession. Toxic mercury was used as medicine into the twentieth century. And so it has been. \n\n \n\n The first physician to aggressively use vitamin C to cure diseases was Frederick R. Klenner, M.D. beginning back in the early 1940's. Dr. Klenner consistently cured chicken pox, measles, mumps, tetanus and polio with huge doses of the vitamin. While vaccines are now available for these illnesses, please remember this was not the case in the 1940's.\n\nThe following is a list of the conditions that Dr. Klenner successfully treated with aggressive vitamin C therapy:\n\nThis seems like an impossible list of vitamin C cures. At this point, you can either dismiss the subject or investigate further. Dr. Klenner chose to investigate. The result? He used massive doses of vitamin C for over forty years of family practice. He wrote dozens of medical papers on the subject. A complete list of them is in the Clinical Guide to the Use of Vitamin C, edited by Lendon H. Smith, M.D., Life Sciences Press, Tacoma, WA (1988). \n\n \n\n It is difficult to ignore his success, but it has been done. Dr. Klenner wrote: \"Some physicians would stand by and see their patient die rather than use ascorbic acid (Vitamin C) because in their finite minds it exists only as a vitamin.\" \n\n \n\n Vitamin C is remarkably safe even in enormously high doses. Compared to commonly used prescription drugs, side effects are virtually nonexistent. It does not cause kidney stones. In fact, vitamin C increases urine flow and favorably lowers the pH to help keep stones from forming. William J. McCormick, M.D. used vitamin C since the late 1940's to prevent and treat kidney stones. Vitamin C does not significantly raise oxalate levels, and uric acid stones have never resulted from its use, either. Said Dr. Klenner: \"The ascorbic acid/kidney stone story is a myth.\" \n\n \n\n How much vitamin C is an effective therapeutic dose? Dr. Klenner gave up to 30,000 milligrams (mg) per day. Generally, he gave 350 to 700 mg per kilogram body weight per day. That is a lot of Vitamin C. \n\n \n\n But then again, look at that list of successes. \n\n \n\n Dr. Klenner emphasized that small amounts do not work. He said, \"If you want results, use adequate ascorbic acid (Vitamin C).\" \n\n \n\n If you want to learn more about the therapeutic uses of vitamin C, the following books are recommended:\n• How To Live Longer and Feel Better, by Linus Pauling, Ph.D., (Freeman, 1986)\n• The Healing Factor: Vitamin C Against Disease, by Irwin Stone (Putnam, 1972)\n• The Vitamin C Connection, by Emanuel Cheraskin, M.D. et al (Harper and Row, 1983)\n• Clinical Guide to the Use of Vitamin C, by Lendon H. Smith, M.D. (cited above)", "opengraph": {"url": "http://foodmatters.tv/articles-1/did-you-know-that-vitamin-c-can-treat-over-30-major-diseases", "type": "article", "title": "Did You Know That Vitamin C Can Treat Over 30 Major Diseases?", "description": "Vitamin C can do more than simply help you overcome a cold. Here’s how one doctor used vitamin C to treat multiple conditions for years!", "image": "https://www.foodmatters.com/media/images/vitaminC_pills.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen", "https://www.foodmatters.com/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen"], "authors": [], "publish_date": null}