{"result_id": "117032", "URL": "https://www.foodmatters.com/article/15-most-dangerous-drugs-big-pharma-dont-want-you-to-know-about", "timestamp": "2023-04-25 15:07:39 CEST+0200", "meta": {"description": "In the pharmaceutical industry's rush to get drugs to market, safety usually comes last. And the public suffers. Here is a list of the 15 most dangerous drugs, from birth control to anti-depressant make sure you watch out for these ones in particular.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/15-most-dangerous-drugs-big-pharma-dont-want-you-to-know-about", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "15 Most Dangerous Drugs Big Pharma Don't Want You to Know About", "cleaned_text": "In the pharmaceutical industry’s rush to get drugs to market, safety usually comes last. Long studies to truly assess a drug's risks just delay profits after all -- and if problems do emerge after medication hits the market, settlements are usually less than profits. Remember, Vioxx still made money.\n\n \n\n The following drugs are so plagued with safety problems, it is a wonder they’re on the market at all. It's a testament to Big Pharma's greed and our poor regulatory processes that they are.\n\nWhy is Lipitor the bestselling drug in the world? Because every adult with high LDL or fear of high LDL is on it. (And also 2.8 million children, says Consumer Reports.) No one is going to say statins don't prevent heart attack in high-risk patients (though diet and exercise have worked in high-risk groups too). But doctors will say statins are so over-prescribed that more patients get their side effects -- weakness, dizziness, pain and arthritis -- than heart attack prevention. Worse, they think it's old age!\n\n \n\n \"My older patients literally do without food so that they can buy these medicines that make them sicker, feel bad, and do nothing to improve life,\" says an ophthalmologist web poster from Tennessee. \"There is no scientific basis for treating older folks with $300+/month meds that have serious side-effects and largely unknown multiple drug interactions.\" What kinds of side effects? All statins can cause muscle breakdown (called rhabdomyolysis) but combining them with antibiotics, protease inhibitors drugs and anti-fungals increases your risks. In fact, Crestor is so highly linked to rhabdomyolysis it is doubly criticised: Public Citizen calls it a Do Not Use and the FDA's David Graham named it one of the five most dangerous drugs before Congress.\n\nIt sounded too good to be true and it was. Birth control pills that also cleared up acne, treated severe PMS (Premenstrual Dysphoric Disorder or PMDD) and avoided the water retention of traditional birth control pills.\n\n \n\n But soon after Bayer launched Yaz in 2006 as going \"beyond birth control,\" 18-year-olds were coming down with blood clots, gall bladder disease, heart attacks and even strokes. Fifteen-year-old Katie Ketner had her gallbladder removed. Susan Gallenos had a stroke and part of her skull removed. College student Michelle Pfleger, 18, collapsed and died of a pulmonary thromboemboli from taking Yaz, says her mother Joan Cummins.\n\n \n\n While TV ads for Yaz in 2008 were so misleading that FDA ordered Bayer to run correction ads, Yaz sales are still brisk. In fact, financial analysts attribute the third quarter slump in the Yaz \"franchise\" of 28.1 percent to the appearance of a Yaz generic, not to the thousands of women who have been harmed.\n\n \n\n Why is Yaz sometimes deadly? It includes a drug that was never before marketed in the U.S. -- drospirenone -- and apparently causes elevated potassium, heart problems, and a change in acid balance of the blood. Who knew? But not only is Bayer still marketing it, women do not receive \"test subject\" compensation for using it either.\n\nWhy would you take an epilepsy seizure drug for pain? The same reason you'll take an antipsychotic for the blues and an antidepressant for knee pain: good consumer marketing. In August FDA ordered a warning for aseptic meningitis, or brain inflammation, on Lamictal -- but it is still the darling of military and civilian doctors for unapproved pain and migraine. Lamictal also has the distinction of looting $51 million from Medicaid last year despite a generic existing.\n\n \n\n All seizure drugs increase the risk of suicidal thoughts and behaviors according to their mandated labels. An April article in JAMA found seizure drugs linked to 26 suicides, 801 attempted suicides, and 41 violent deaths in just five years. \n\n \n\n All three drugs can make you lose your memory and your hair, say posters on the drug rating site askapatient.com. Topamax is referred to as \"Stupamax\" in the military -- though evidently not enough to ask, \"Why am I taking this drug again?\"\n\nIf you think pharma is producing a lot of expensive, dangerous injectables lately, you're right. Yesterday's blockbuster pills have been supplanted with vaccines and biologics that are more lucrative and safer...from generic competition, that is. The problem is, not only are biologics like Humira and Prolia creepy and dangerous -- they're made from genetically engineered hamster cells and suppress the actual immune system -- the diseases they treat are \"sold\" to healthy people.\n\n \n\n Recently, thousands of college students in Chicago found inserts in their campus newspapers hawking Humira for Crohn's disease, rheumatoid arthritis and psoriatic arthritis. (\"Hate psoriasis? Love clearer skin,\" says an ad on the Humira Web site featuring a pretty woman.) And earlier this year Prolia was approved by the FDA for postmenopausal osteoporosis with a high risk of fracture. Do healthy people really want to suppress their body's tumor necrosis factor (TNF) and invite tuberculosis, serious, possibly lethal infections, melanoma, lymphoma and \"unusual cancers in children and teenagers\" as the Humira label warns? Nor is it clear these drugs work. The Humira label warns against developing \"new or worsening\" psoriasis -- a condition it is supposed to treat.\n\nHow unsafe is the anti-smoking drug Chantix? After 397 FDA cases of possible psychosis, 227 domestic reports of suicidal acts, thoughts or behaviors and 28 suicides, the government banned pilots and air traffic controllers and interstate truck and bus drivers from taking Chantix in 2008. Four months later, some military pharmacies banned the drug, which reduces both cravings and smoking pleasure. In addition to Chantix' neuropsychiatric effects (immortalized by New Bohemians musician Carter Albrecht, who was shot to death in 2007 in Texas by a neighbor after acting aggressively), Chantix is linked to angioedema, serious skin reactions, visual impairment, accidental injury, dizziness, muscle spasms, seizures and loss of consciousness. \n\n \n\n In defending an increasingly indefensible drug, Janet Woodcock, director of the FDA Center for Drug Evaluation said last year, \"Smoking is the leading cause of preventable disease, disability, and death in the United States and we know these products are effective aids in helping people quit.\" True enough -- but if you smoke cigarettes you can still drive an interstate truck.\n\nSleeping pills like Ambien, Lunesta, Sonata and Rozerem only decrease get-to-sleep time by 18 minutes according to the National Institutes of Health (NIH).\n\n \n\n But Ambien has additional cachet compared to its soporific brethren: it is the drug Tiger Woods reportedly used when cavorting with his consorts; and former U.S. Rep. Patrick Kennedy was taking it when he crashed his Ford Mustang while driving to Capitol Hill in the middle of the night to \"vote\" in 2006.\n\n \n\n In fact Ambien's legendary somnambulism side effects -- people walk, drive, make phone calls and even have sex while sleeping -- has increased traffic accidents say law enforcement officials, with some drivers not even recognizing arresting police. Thanks to bad Ambien press, Sanofi-Aventis has had to run ads telling the public to get in bed and stay there if you are going to take Ambien. (Or you'll break out in handcuffs, as the joke goes.) Ambien has also increased the national weight problem as dieters wake up amid mountains of pizza, Krispy Kreme and Häagen-Dazs cartons consumed by their evil twins.\n\nIs it a coincidence that Tamoxifen maker AstraZenaca founded Breast Cancer Awareness Month and makes carcinogenic agrochemicals that cause breast cancer? Both the original safety studies of Tamoxifen, which causes cancer, birth defects and is a chemical cousin of organochlorine pesticides, and its original marketing were riddled with scientific error. In fact, FDA objected to AstraZeneca's marketing claim of breast cancer prevention and the casting of endometrial cancer as an \"uncommon\" event 10 years ago.\n\n \n\n Yet today pharma-linked doctors still tell women to take Tamoxifen to prevent breast cancer even though an American Journal of Medicine study found the average life expectancy increase is nine days (and Public Citizen says for every case of breast cancer Tamoxifen prevents there is a life-threatening case of blood clots, stroke or endometrial cancer). A Gynecologic and Obstetric Investigation study shows an example of Tamoxifen's downside: 57.2 percent of women on continuous Tamoxifen developed atrophy of the lining of the uterus, 35.7 coexisting hyperphasia and 8.1 percent uterine polyps. We won't even talk about eye and memory problems -- or the Tamoxifen cousin, Evista, that pharma is also pushing which has a \"death from stroke\" warning on its label.\n\nWhy is the bisphosphonate bone drug Boniva available in a convenient, once-monthly formulation? Could patients balk at the fact that after you take it you have to avoid lying down for at least 60 minutes to \"help decrease the risk of problems in the esophagus and stomach,\" wait at least 60 minutes before eating or drinking anything except water, never take it with mineral water, sparkling water, coffee, tea, milk, juice or other oral medicine, including calcium, antacids, or vitamins, and of course, \"do not chew or suck\"? Nor should you take Boniva, say the warnings, \"if you have difficult or painful swallowing, chest pain or continuing or severe heartburn, have low blood calcium or severe kidney disease or if severe bone, joint and/or muscle pain.\"\n\n \n\n Bone drugs like Boniva, Fosamax and Actonel are a good example of FDA approving once-unapprovable drugs by transferring risk onto the public's shoulders with \"we warned you\" labels. The warnings are supposed to make people make their own safety decisions. Except that people just think FDA wouldn't have approved it if it weren't safe.\n\nYou'd think Pfizer's hormone drugs Prempro and the related Premarin and Provera would be history in light of their perks: 26 percent increase in breast cancer, 41 percent increase in strokes, 29 percent increase in heart attacks, 22 percent increase in cardiovascular disease, double the rates of blood clots and links to deafness, urinary incontinence, cataracts, gout, joint degeneration, asthma, lupus, scleroderma, dementia, Alzheimer's disease and lung, ovarian, breast, endometrial, gall bladder and melanoma cancers -- pant pant. But you'd be wrong. Even as we speak, Pfizer-linked researchers are testing the cognitive and cardiovascular \"benefits\" of hormone therapy, in some cases with our tax dollars, at major universities. Even though the cancer rate in the U.S. and Canada fell when women quit hormone therapy in 2002 (as did the U.S. heart attack rate in women), pharma is rolling out HT \"Light\" for women who suffer from the \"ism\" of incredibly short memory.", "opengraph": {"url": "http://foodmatters.tv/articles-1/15-most-dangerous-drugs-big-pharma-dont-want-you-to-know-about", "type": "article", "title": "15 Most Dangerous Drugs Big Pharma Don't Want You to Know About", "description": "In the pharmaceutical industry's rush to get drugs to market, safety usually comes last. And the public suffers. Here is a list of the 15 most dangerous drugs, from birth control to anti-depressant make sure you watch out for these ones in particular.", "image": "https://www.foodmatters.com/media/images/assets/pills-and-money.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "http://jama.ama-assn.org/content/303/14/1401.full?home", "http://content.karger.com/ProdukteDB/produkte.asp?Aktion=ShowPDF&ArtikelNr=291821&Ausgabe=250423&ProduktNr=223845&filename=291821.pdf", "/detox-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=11&utm_campaign=detox-masterclass-evergreen", "https://www.foodmatters.com/detox-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=11&utm_campaign=detox-masterclass-evergreen"], "authors": [], "publish_date": null}