{"result_id": "117004", "URL": "https://www.foodmatters.com/article/food-allergies-is-there-a-natural-cure", "timestamp": "2023-04-25 15:07:01 CEST+0200", "meta": {"description": "Phillip Day, as featured in Food Matters, explains how allergies are a result of the histamine inflammatory system and discusses the various natural treatments available to you.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/food-allergies-is-there-a-natural-cure", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Food allergies - is there a natural cure?", "cleaned_text": "Allergies occur when the immune system produces antibodies against substances in the environment (allergens) that are usually harmless. These substances can include pollens, dust, foods, cosmetics, etc. The body produces antibodies to neutralize the foreign substance, which triggers the release of histamine, which produces what we see as allergies or asthma. As allergies are a result of the histamine inflammatory system we need to first address the body's hydration levels and intake of adequate whole salts. In his insightful book \"Water and Salt\" Dr. F. Batmanghelidj proclaims the following:\n\n“You can naturally prevent allergies and asthma by drinking more water. When you understand the physiology of the human body and the role of histamine in its water regulation and drought management, you realize that chronic dehydration in a vast majority of people is the primary cause of allergies and asthma. Increased water intake—on a forced, regular basis—should be adopted as a preventive measure as well as the treatment of choice.\n\nIn those who have had attacks of asthma or allergic reactions to different pollens foods, more strict attention to daily water intake should become a pre-emptive measure. These people will also have other indicators of dehydration they need to recognize and treat accordingly before a crisis attack of asthma endangers their lives and exposes them to possible, premature death. Don’t forget, the chemical pathways dealing with dehydration have no ‘brain’; they rush forward like a cascade. They are actually called ‘chemical cascades’. These dehydration-induced chemical cascades kill many thousands of asthmatics a year. They are easily ‘turned off’ by water and salt, two strong, natural antihistamines.”\n\nCommon food intolerances, such as those for wheat (gluten), milk (casein), chocolate, eggs, oranges and other salicylates may disrupt hormone levels, resulting in mental symptoms that can range from depression to schizophrenia and the classic ‘straitjacket’ problems.\n\nHow allergies can lead to mental illness, if untreated\n\nMany of these disorders occurring later in life, described as mental illnesses, may begin early in childhood and show up as eczema, infantile colic, rashes, fits and temper tantrums, excessive mucus formations, frequent rapid colds, hyperactivity, speech difficulties, anxiety, seasonal allergies and coeliac disease (malabsorption of food). All these initially should be regarded as dehydration issues. In the book \"Health Wars\", I examine the problems brought on by infants force-fed cow’s milk during their first two years’ of life. This is a vulnerable period for a small child, whose immune system usually has not fully developed until the third year. Assaulting the child with multiple vaccinations, foreign and often hostile proteins, such as those found in wheat and cow’s milk, can lead to all sorts of problems such as autism and type 1 diabetes, especially when the child has not been adequately breast-fed to ensure the full spectrum of immune factors are taken to begin with.\n\nOnce the immune system is formed, there may be imperfections in how the system performs when assaulted with particles the body identifies as toxins. Damage and scarring to the intestinal wall by gluten/gliaden in wheat, barley, rye and oats, for instance, destroys the finger-like villi which absorb nutrients, leading to coeliac disease, where the food can pass unprocessed through the small intestine. Leaky gut syndrome, where undigested food particles permeate the damaged intestinal wall and enter the bloodstream, is typified by systemic poisoning and a chronic-fatigue reaction of lethargy, listlessness and depression.\n\nExperimental double-blind studies and control trials conclusively demonstrate that wheat, milk, cane sugar, eggs (often the whites), tobacco and food additives are the chief culprits. In one control study, 96 patients diagnosed as suffering from alcohol dependence, major depressive disorders and schizophrenia were compared with 62 control subjects selected from adult hospital staff members for possible food/chemical intolerances. Those suffering as ‘depressives’ were found to be the highest suffering from allergies: 80% were found to be allergic to barley and 100% were allergic to egg white. Over 50% of the alcoholics were found to be allergic to egg white, milk, rye and barley. Of the schizophrenic group, 80% were found to be allergic to both milk and eggs. Only 9% of the control group were found to suffer from any allergies. Dr Batmanghelidj states that the body’s predisposition to react in these ways may be due to the specific ways it behaves during drought-management.\n\nSchizophrenics, routinely treated with drugs, were randomly assigned milk- and gluten-free diets while on the locked ward. They were discharged nearly twice as rapidly as control patients assigned a high-cereal diet. Wheat gluten secretly added to the cereal-free diet undid this effect, showing that wheat gluten was a player in the behavior of these schizophrenic patients.\n\nRemoving problem foods and then reintroducing them one by one under controlled conditions to see if the problems reoccur is known as elimination/challenge testing. This should always be done under clinical supervision, especially when side-effects may be quite severe, such as fits, asthma, anaphylactic shock, severe depression and violent, psychotic episodes.\n\nIn the book \"The Mind Game\", I examine the effects of histadelia, or excess histamine, in the body, and its association to mental illness. It is interesting to note that many psychiatric medications are very similar in their chemical profiles to antihistamines, and indeed are designed to suppress brain histamine receptors. Tricyclic and antidepressant drugs, such as imipramine (Tofranil) and amitriptyline, are in this group. Other drugs, such as chlorpromazine and promazine, are designed to inhibit histamine production and promazine is used to treat allergies. This seems to confirm the role of histamine excess in related emotional disorders and therefore Batmanghelidj, Pfeiffer, Holford and Hoffer encourage physicians to adapt their patients’ diets before resorting to potentially debilitating medication. Carl Pfeiffer has also devoted much of his professional research time to examining B6 (pyridoxine), zinc and manganese deficiencies, and their role in restoring his patients to health, quoting:\n\n“Several vitamins are noted for their effectiveness in reducing allergic symptoms. Vitamins C and B6 are probably the most effective. Dr William Philpott has used both of these vitamins intravenously to turn off allergic symptoms provoked by testing for allergies. The patients on adequate vitamin C will have fewer allergic symptoms. B6 should be given to the point of nightly dream recall and the minerals calcium and potassium should be plentiful in the diet. Zinc and manganese are also needed by the allergic patient. Elimination of the offending foods may be needed for several months. For multiple food allergies, in which this approach would severely limit the diet, a four-day rotation diet in which each food is eaten only once every four days should be tried. If this approach is unsuccessful, intradermal allergy testing to determine the degree of allergy and the neutralising dose of each allergen is recommended.”\n\nMost patients suffering from food allergies also have pyroluria, where excessive pyrrole chemicals are found in the urine, binding vitamin B6 and zinc (see Pyroluria). Since coeliac damage to the intestinal wall may result in malabsorption of nutrients into the body, while often allowing undigested food proteins into the blood creating allergy, healing of the intestinal system is vital to a restoration of the patient to full nutritional homeostasis.\n\nWhat you can do today\n\nAs a guide your intake should be half of your bodyweight in ounces. i.e. a 140 lb woman should drink 70 oz of water a day (8-10 glasses). Salt used should be organic, unrefined Himalayan, Celtic or sea salt; half a teaspoon per 10 glasses of water per day. Those having trouble sleeping may put a small pinch of salt on their tongue and allow to melt after turning in. This is also a good idea after drinking two glasses of water upon rising. Sensors on the tongue detect salt intake and help suspend the body’s production of histamine.", "opengraph": {"url": "http://foodmatters.tv/articles-1/food-allergies-is-there-a-natural-cure", "type": "article", "title": "Food allergies - is there a natural cure?", "description": "Phillip Day, as featured in Food Matters, explains how allergies are a result of the histamine inflammatory system and discusses the various natural treatments available to you.", "image": "https://www.foodmatters.com/media/img/assets/allergy-food.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.credence.org"], "authors": [], "publish_date": null}