{"result_id": "117006", "URL": "https://www.foodmatters.com/article/10-months-on-babies-belly-buttons-breast-milk", "timestamp": "2023-04-25 15:07:03 CEST+0200", "meta": {"description": "It’s been 10 months since our beautiful baby Hugo entered this world and boy has it been a roller coaster ride filled with tears, joy and excitement! Every parent’s journey through parenthood is individual and unique, and we wanted to share our own personal discoveries of parenthood for the last 10 months. It’s the stuff they don’t talk about in text books and prenatal classes, but should!", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/10-months-on-babies-belly-buttons-breast-milk", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "10 Months On! (Babies, Belly Buttons & Breast Milk)", "cleaned_text": "I can’t look at belly buttons the same way anymore! If I’m at the beach or pool, or when I see a fashion model in a magazine with a crop top, there it is, a constant reminder of our connection to our mother (and mother earth for that matter).\n\n \n\n It truly is a miracle how a baby is sustained through an umbilical cord connected to an embryonic sac which filters and delivers nutrients from mother to baby. The umbilical cord is a profound piece of equipment that we should all treat with the utmost honor respect and yet in most hospitals the umbilical cord is the first thing that is severed when the baby comes out. If only we waited at least 90 seconds, if not longer, as per the recommendations of Dr Green, who shows that health and immunity can be greatly improved by allowing the 600 ml or so of oxygen-rich blood still in the placenta at birth to flow to the baby. Hence less ear infections, sickness & hospital time for baby.\n\n \n\n This one simple procedure alone could save us millions in health care and nursery illness! But enough about belly buttons; let’s move on.\n\nEvery baby (and birth) is different, but I have yet to meet a parent whose initial 3 months with their firstborn child, didn’t come as a shock! When you combine the following unique factors together it’s little wonder so many women suffer from postpartum depression: sleep deprivation, nutrient loss and breastfeeding. Here's how we handled all three.\n\nSleep deprivation, it’s enough to drive any grown adult to depression and aggravation. So what was our solution? To sleep when baby sleeps (as much as possible) and use white noise & meditation music (often mixed together) to help baby sleep longer and deeper. The music had such a profound effect on him (as do hair dryers, clothes dryers and other ‘white’ noises) that we still use it to this day and feel it is a critical part of the process. In fact, we tried to recreate a womb-like environment, following the idea that the 4th trimester is a process of adjusting to life in a body by comforting them with as much familiarity from their last 9 months as possible. \n\n \n\n Part of this includes swaddling, which many parents swear by however Hugo disliked tremendously. We put it down to the fact that, for both Laurentine and I, our biggest values are freedom and that he was somehow born with the same! Given this didn’t work, we looked to what traditional cultures do and many of them use swings and hammocks. \n\n \n\n Looking into this further, we discovered an awesome company out of New Zealand who made a baby hammock called ‘Nature’s Sway’. This was Hugo’s solution to a comfortable womb-like sleep and meant that we could hang him above the bed for easy access during night time feeds (and later by the bed on the stand like this photo shows). He has now grown out of this bed and sleeps on a montessori-inspired open cot on the floor so he can come and go as he pleases. He likes this quite a lot and we love when he crawls over to our bed for a morning “snuggle buggle” as my parents used to call it.\n\nThe fastest way to lose your temper and get depressed with yourself and your baby (and any family member in the near vicinity) is to combine a lack of sleep with nutrient depletion. There are so many factors that contribute to this such as blood loss at birth, breastfeeding (which donates essential fats and nutrients from your own body to baby) and a general breakdown in your previous healthy eating pattern. Here's what we did:\n\nOne of the ways we ensured Laurentine was properly nourished (and hence baby) was to introduce nutrient-rich superfoods and ancient traditional foods. These pillars of traditional foods were something that Laurentine felt worked best for her and her Dutch/Eastern European heritage. These are:\n• 1. Warming foodslike soups, broths and stews including veggie soups, whole fish broths and meat & bone broths (there are some great traditional ideas about once a baby is born coolness comes to that area and you need to heat it back up!)\n• 2. Sprouts and raw living foods (you can never go past mother nature's specials!)\n• 3. Fermented foods. Sauerkraut, kim-chi, yoghurt and one of my new favorite experiments coconut-watermelon kefir!!!\n• 4. Supplementation. We stuck with a good raw whole food multivitamin and in addition to that cod liver oil, flax seed oils and or krill oil for healthy fats.\n\nMammals breastfeed; it’s part of a nutrient exchange but further to that it cements a neurological connection between mother and child. \n\n For us, this didn’t come easily or quickly and actually took quite a bit of persistence and trial and error. We worked with a lactation consultant from the Birth Sanctuary and also Jennifer (filmmaker behind a new release called \"The Milky Way\" which we're working to bring to FMTV) to ensure we did all we could to make it work for Laurentine & Hugo. Once we had his latch correct, it has been a wonderful experience since. He was exclusively breastfed until 4 months when he started showing an insatiable appetite for introducing solid foods!\n\nA close friend of ours, Kipp Stroden of Essential Living Foods wrote us a card at our baby shower about 3 months before Hugo’s birth, which proclaimed “Let your child choose his own food.” It was simple but profound. What he meant was that once the baby masters the skill of using his pincers lay out a selection of foods (all healthy, natural and whole) for him to choose from. This acknowledges the innate intelligence of the child and also helps them to establish a healthy, free and abundant attitude around food. A typical spread might include a fruit (blueberries) a starch (sweet potato or pumpkin) and a protein (sardines or beans). We have also supplemented his meals once a day with fermented cod-liver oil which he somehow loves the taste of!\n\nThe 1950’s saw the popularization of infant formula as we became addicted to convenience and instant gratification. It was a dark time for breastfeeding and although a very small percentage of women have serious problems breastfeeding, many do it successfully with the help of a good lactation consultant or grandmother! We have made a decision (around 6-8 months) to start introducing 1 or 2 bottles of formula into Hugo’s diet. Mainly to help with night time sleep stretches (so I can give Laurentine a break). We use an organic goats milk formula (available in Australia & Europe only) called Holle. He still receives 6-8 breastfeeds a day. For the most part, commercial, non-organic soy and dairy-based formulas are filled with a frightful array of chemicals, additives and toxins that I would never let near my son. If I didn't have a choice and had to use formula exclusively, I would choose an organic brand like Holle or other similar goat-based formula (closest to human milk) or make my own under the instructions inside the Nourishing Traditions cookbook for kids.\n\nTrying to discuss vaccinations with someone usually brings up the same physical guttural reactions when discussing politics and religion. We all know it’s a touchy subject so where do we stand? We’re believers in less vaccines, less often and waiting longer after birth. That said at this stage, Hugo has received 0 vaccinations since birth under our discretion and the advice of our pediatrician, who has written, presented and authored extensively on the topic, his name is Dr. Jay Gordon. Hugo, we believe, is being vaccinated daily by Laurentine’s breast milk (which is penetrating all the vascular systems of his body – ears, nose, throat, etc.) and eating lots of dirt! We hope this article won't spark up a heated debate around vaccinations as it's as much about belief as it is fact.\n\nWell, that might be an overstatement, but it’s certainly brought more sanity to our day-to-day life as parents. Personally, we don't believe in the “cry it out” method or controlled crying. We believe that children need to be supported with unconditional love to build the mother-child bond. Plus, if you look at traditional cultures, there is much more touching and connection and love compared to abandonment. Babies need to feel safe so we cuddle, rock and sing him to sleep. Here's what our day looks like now:\n\n \n\n 7am – Up & breastfeed\n\n 8am – Morning walk\n\n 9am – Breakfast\n\n 10am – Nap\n\n 12noon – Breastfeed, lunch & play\n\n 2pm – Nap\n\n 3pm – Breastfeed, snack, play\n\n 5pm – short nap in sling\n\n 6pm – Breastfeed, dinner & song time! (we play music together)\n\n 7pm – Bath-time, book, bottle and bed. \n\n One night feed between midnight and 2am\n\n \n\n Our biggest lesson as new parents was learning how to get in-tune with our baby's rhythm and this includes feeling into your baby's needs. I'm convinced that mothers have this innate sense of intuition built in and it's important to listen to that rather than frantically read through books for guidance.\n\n \n\n If all else fails just ask yourself \"what would I want if I was a helpless little baby?\" and that will usually bring forth the most loving solution.\n\n \n\n We'll keep you updated as things progress! We would love to hear from you below.\n\n \n\n James, Laurentine & Hugo\n\n \n\n \n\n (This is a personal opinion piece and not intended as medical advice)", "opengraph": {"url": "http://foodmatters.tv/articles-1/10-months-on-babies-belly-buttons-breast-milk", "type": "article", "title": "10 Months On! (Babies, Belly Buttons & Breast Milk)", "description": "It’s been 10 months since our beautiful baby Hugo entered this world and boy has it been a roller coaster ride filled with tears, joy and excitement! Every parent’s journey through parenthood is individual and unique, and we wanted to share our own personal discoveries of parenthood for the last 10 months. It’s the stuff they don’t talk about in text books and prenatal classes, but should!", "image": "https://www.foodmatters.com/media/images/articles/james-laurentine-hugo-520-wide.jpg", "article:author": "https://www.facebook.com/LaurentineTenBosch/"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://xm133.infusionsoft.com/go/HHC/FM/", "http://drjaygordon.com/", "/nutrition-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=1&utm_campaign=nutrition-masterclass-evergreen", "https://www.foodmatters.com/nutrition-masterclass?utm_source=contents_cta_item&utm_medium=banner&utm_content=1&utm_campaign=nutrition-masterclass-evergreen"], "authors": [], "publish_date": null}