{"result_id": "117001", "URL": "https://www.foodmatters.com/article/whats-really-in-chicken-mcnuggets-scary", "timestamp": "2023-04-25 15:06:57 CEST+0200", "meta": {"description": "Ever wonder what's really found in Chicken McNuggets? Some of the ingredients, it turns out, seem to belong more to an industrial factory than in your body.", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/article/whats-really-in-chicken-mcnuggets-scary", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "What's Really In Chicken McNuggets? (Scary)", "cleaned_text": "Ever wonder what's really found in Chicken McNuggets? Some of the ingredients, it turns out, seem to belong more to an industrial factory of some kind, not a food retailer.\n\nAccording To The McDonald's Corporation, Its Famous Chicken McNuggets Are Made With Ingredients Including:\n• Autolyzed yeast extract (which contain free glutamate, similar to MSG),\n\nBut that's not the freaky part. According to McDonald's own website, Chicken McNuggets are also made with: \n\n\n\nAt least two of these ingredients are artificially synthesized industrial chemicals. TBHQ, a petroleum derivative, is used as a stabilizer in perfumes, resins, varnishes and oil field chemicals. Laboratory studies have linked it to stomach tumors. \"At higher doses, it has negative health effects on lab animals, such as producing precursors to stomach tumors and damage to DNA. A number of studies have shown that prolonged exposure to high doses of TBHQ may be carcinogenic, especially for stomach tumors.\"\n\n \n\n Dimethylpolysiloxane, a type of silicone, is used in caulks and sealants, as a filler for breast implants, and as key ingredient in Silly Putty. Says Wikipedia:\n\n \n\n \"PDMS is also used as a component in silicone grease and other silicone based lubricants, as well as in defoaming agents, mold release agents, damping fluids, heat transfer fluids, polishes, cosmetics, hair conditioners and other applications. PDMS has also been used as a filler fluid in breast implants, although this practice has decreased somewhat, due to safety concerns. PDMS is used variously in the cosmetic and consumer product industry as well. For example, PDMS can be used in the treatment of head lice...\" \n\n \n\n Not that the other ingredients are any better. Because cotton is not regulated as a food crop, cottonseed oil may contain chemical pesticides that are banned in food production. It is also almost always genetically modified. Hydrogenated oils, of course, typically contain trans fats, the artificially produced fats that are unusable by the body and that studies have linked to a number of detrimental health problems. And autolyzed yeast extract is a chemical taste-enhancing ingredient containing free glutamate that manufacturers use as a friendlier-looking replacement for MSG.\n\n \n\n And what about the chicken in Chicken McNuggets? It's factory-farmed chicken, not free-range chicken. So it's the kind of chicken that's typically treated with vaccines and hormones while being fed conventional feed products that are medicated with pharmaceuticals and grown with pesticides.\n\n \n\n Yum!! Don't forget to ask for extra dipping sauce. We haven't even talked about what you'll find in there...", "opengraph": {"url": "http://foodmatters.tv/articles-1/whats-really-in-chicken-mcnuggets-scary", "type": "article", "title": "What's Really In Chicken McNuggets? (Scary)", "description": "Ever wonder what's really found in Chicken McNuggets? Some of the ingredients, it turns out, seem to belong more to an industrial factory than in your body.", "image": "https://www.foodmatters.com/media/images/assets/nugget.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["#", "https://en.wikipedia.org/wiki/Tert-Butylhydroquinone", "https://en.wikipedia.org/wiki/Tert-Butylhydroquinone", "https://en.wikipedia.org/wiki/Tert-Butylhydroquinone", "/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen", "https://www.foodmatters.com/program/clean-eating?utm_source=contents_cta_item&utm_medium=banner&utm_content=2&utm_campaign=clean-eating-evergreen"], "authors": [], "publish_date": null}