{"result_id": "117029", "URL": "https://www.foodmatters.com/practitioner-directory", "timestamp": "2023-04-25 15:07:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/static/favicon.ico", "canonical": "https://www.foodmatters.com/practitioner-directory", "encoding": "utf-8"}, "image": null, "domain": "www.foodmatters.com", "title": "Practitioner Directory | FOOD MATTERS®", "cleaned_text": "Finding a good natural health care practitioner can often be like looking for a needle in a haystack. This Practitioner Directory helps you find a holistic healthcare practitioner, integrative doctor, chiropractor, holistic dentist or colon-hydrotherapist in your local area. Or if you are looking for doctors that take a holistic approach to treating mental health conditions this is where you will find them. Understandably we do not endorse any particular medical practitioners listed below however hope that this information can act as a good starting point for patients and family members.\n\nWhere are you?\n\nLocated in the Greater Phoenix Metropolitan area of Arizona, Azure Acupuncture, LLC is a Full-Service Acupuncture and Chinese Herbal Clinic. Our Clinic specializes in Facial/Cosmetic Acupuncture, Infertility Issues, Well Woman Care and Pediatric Health. Our licensed Acupuncturist is Certified in Oriental Medicine and Cosmetic Acupuncture. Our Acupuncturist has extensive experience … Visit website Hormone therapy replenishes the hormones our body needs to function properly using bioidentical hormones. BodyLogicMD's affiliated physicians are highly trained in natural bioidentical hormone therapy integrated with nutrition and fitness for those suffering from hormone imbalance. Visit website The Canadian Association of Naturopathic Doctors offer an online search engine for naturopathic physicians in Canada. Visit website Offers patient-centered bio-individual whole wellness care to help people get healthy and stay healthy. An Intuitive Healer and Wellness Consultant, she practices one-on-one coaching using holistic wellness therapies. This gives clients practical guidance on how to design a healthy lifestyle that they love. Carolynn’s treatment strategies take an integrative approach … Visit website A naturopathic medical doctor, Dr. Roz focuses on diagnosing and treating root health issues instead of simply masking their symptoms. Going beyond just “normal levels,” she works to understand your lifestyle and health goals as a complete picture. Because she uses a robust combination of natural modalities, conventional medicine and … Visit website This online directory can be used to locate naturopathic practitioners in the United States of America or Canada. Visit website This is an international online directory of orthomolecular medicine practitioners. Visit website At Healthier Notions, I work with women to promote healthy cycles and healthy digestion. I work with my clients individually to help them heal their imbalances by using holistic methods such as personally tailored food and exercise plans, lifestyle adjustments, and supplements. I am a firm believer that the right … Visit website Osteopathy, acupuncture and homeopathy, healing touch, massage therapy, psychology, internal medicine and more. This means is that patient, loved ones and provider work together to develop an integrated diagnostic and therapeutic plan that will best address the whole person in their healthCARE and wellness pursuits. Visit website For the initial phase of my medical training, my approach was conventional. I have substantial training in orthodox medicine, having taken residencies and fellowships for 9 years after graduating medical school in 1981. This provided me with a great base from which to develop my own clinical instincts. Indeed, my … Visit website This organisation supplies an online listing of dentists who are trained in mercury filling removal and detoxification. Visit website The International Association of Colonic Hydrotherapists provides an online search tool to help you find a colonic hydrotherapist in your local area. Visit website Is the world's oldest international chiropractic professional organization, dedicated to the growth and development of the chiropractic profession based on its fundamental principles and philosophy. Visit website Primary care that combines the most recent advances in modern medicine with safe and effective traditional therapies. Lake Oswego Health Center offers individualized medicine that prioritizes your unique health goals and medical needs. Visit website Traditional Chinese Medicine is a holistic approach to healing that may seem new to Western culture but has been practiced for thousands of years. Originating in Eastern Asia, it trickled to neighboring countries and cultures. As the medicine made its way through new regions, these areas contributed new plants, resources, … Visit website This international online index can be used to find holistic and biological dentists who practice mercury-free techniques and specialise in amalgam removal. Visit website Clifton, NJ (within Immedicenter) & Manhattan, NY (within The Juhi Center) I am a holistic homeopathic practitioner with several years of both clinical training and experience in working with a wide range of chronic and acute mental, emotional and physical ailments and imbalance using Kentian classical homeopathy. I am currently practicing in the Tri-State Area, in particular at Immedicenter, a medical … Visit website Integrative Nutrition Health Coach that combines nutrition/lifestyle protocols with the Aura PTL II laser to ameliorate food sensitivities and support the gut's ability to achieve and maintain a healthy balance. Visit website The largest professional association in the world representing doctors of chiropractic. Visit website Science tells us this is how long it takes to produce healthy new eggs and sperm. By taking action and following our proven steps, you will see and feel a dramatic shift in your health, preparing you and your partner for a healthy, full term pregnancy. Visit website Comprehensive and personalized program designed for understanding the fundamentals of good nutrition and its partners for optimum health-emotional-physical activity. It provides leverage advice on how to get the most out of what you eat and how to develop healthier everyday habits in fast pace life, that will keep you young … Visit website", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.azureacupuncture.com", "https://www.bodylogicmd.com/bioidentical-hormone-doctors?utm_source=blog&utm_medium=link&utm_campaign=food_matters_directory", "http://www.cand.ca/", "https://elixirwellness.ca/earthing-retreats/", "http://www.drroznmd.com", "http://www.findanaturopath.com/", "http://www.orthomolecular.org/", "https://www.healthiernotions.com", "http://imcsrq.com/services/", "http://westchesterstemcell.com", "https://iaomt.org/", "http://www.i-act.org/", "http://www.chiropractic.org/", "https://lakeoswegohealth.com", "https://www.MasudaAcupuncture.com", "https://www.mercuryfreedentists.com/", "http://mindbodysoulcoach.weebly.com/", "http://www.refuahhomeopathy.com", "http://www.toledowellness.com", "http://www.symptomfreelife.com", "http://www.naturopathic.org/", "http://www.acatoday.org/", "https://thebabybuilders.com", "http://www.ultravitality.net"], "authors": [], "publish_date": null}