{"result_id": "118024", "URL": "https://www.food.news/2017-02-09-chemical-ridden-gmo-foods-are-being-pushed-on-africans.html", "timestamp": "2023-04-25 15:07:55 CEST+0200", "meta": {"description": "In response to a propaganda piece recently published in a local newspaper that pushes the human papillomavirus (HPV) vaccine as a viable remedy to address exploding cancer rates throughout developing Africa, a concerned citizen of Rwanda wrote a letter to the editor countering this narrative, pointing out that toxic food, and not a lack of […]", "lang": "en", "keywords": "Africa,chemicals,GMO", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2017-02-09-chemical-ridden-gmo-foods-are-being-pushed-on-africans.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Chemical-ridden GMO foods are now being pushed on Africans, destroying their natural food culture", "cleaned_text": "Chemical-ridden GMO foods are now being pushed on Africans, destroying their natural food culture\n\nIn response to a propaganda piece recently published in a local newspaper that pushes the human papillomavirus (HPV) vaccine as a viable remedy to address exploding cancer rates throughout developing Africa, a concerned citizen of Rwanda wrote a letter to the editor countering this narrative, pointing out that toxic food, and not a lack of vaccines, is why many Africans are now suffering.\n\nThe original article, written by a board member of Gavi, the Vaccine Alliance (a public-private partnership of the World Health Organization (WHO) and various countries throughout the world that together aggressively push vaccines as the solution to just about everything) contends that a major contributor to escalating rates of cancer throughout the world is a lack of HPV vaccines. In other words, it is an obvious endorsement and marketing puff piece to sell more vaccines rather than address the root causes of the problem.\n\nOne of these root causes, says Mwene Kalinda, who wrote a letter to the editor in response to this shameless HPV vaccine push piece, is toxic “foods” grown with biotechnology and harsh chemical pesticides. Much of the natural food that Africans have relied on for millennia, Kalinda correctly points out, are being actively replaced by imitator fake “foods” that are most certainly contributing to not only cancer, but a host of other chronic health conditions including diabetes and high blood pressure.\n\n“We are what we eat, and we are moving away from our traditional foods to what we think — wrongly — are more desirable western ones but whose true negative consequences we will only realize when it is already too late,” Kalinda writes in outrage.\n\nRemember Obama’s ‘Evergreen Revolution?’ This is what’s driving higher rates of cancer in Africa\n\nIn the original article by Dr. Ngozi Okonjo-Iweala, who is listed as a former Finance Minister of Nigeria, the claim is made that because people are living longer in Africa and many other places throughout the developing world, that cancer is simply the inevitable result of this. No mention is made of any potential contributing factors such as toxic agriculture, which is widely known to be a growing issue throughout Africa. (RELATED: Learn how to grow your own non-GMO food at home with the Urban Garden Tower)\n\nDuring President Obama’s first term, there was a major push to transform African agriculture away from traditional organic methods. Much like what happened in India during the mid-20th century, promises of higher yields and more income — the dangling carrots of enticement for anyone in the developing world — were tied to the adoption of genetically-modified organisms (GMOs) and chemical crop technologies.\n\nRecognizing that this was taking place more than seven years ago, it becomes clear that all of the “progress” that has since taken place towards this end has led to some drastic changes in the way African food is grown — and consequently, the health of Africans has been on a noticeably steady decline ever since.\n\nWhile there are other contributing factors to cancer besides crop chemicals and fake GMO food, these are major things that directly correlate with the escalating rates of cancer for which Dr. Okonjo-Iweala writes. But sadly, he makes no mention whatsoever of them, instead claiming that Africans simply need more vaccines, which represent yet another source of cancer-causing toxins.\n\n“It is really critical we apply the precautionary principle fully while considering wider public adoption of insufficiently tested products,” urges Kalinda in his response letter. “Public health is more important than rapid introduction of technologies whose long-term effects have not been reliably determined by non-industry influenced research.”", "opengraph": {"title": "Chemical-ridden GMO foods are now being pushed on Africans, destroying their natural food culture", "type": "article", "url": "https://www.food.news/2017-02-09-chemical-ridden-gmo-foods-are-being-pushed-on-africans.html", "site_name": "Food News", "description": "In response to a propaganda piece recently published in a local newspaper that pushes the human papillomavirus (HPV) vaccine as a viable remedy to address exploding cancer rates throughout developing Africa, a concerned citizen of Rwanda wrote a letter to the editor countering this narrative, pointing out that toxic food, and not a lack of […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2018/06/dying_animals_a_mystery.jpg", "article:published_time": "02/09/2017 22:17:08", "article:post_id": "3536"}, "tags": ["chemicals", "Africa", "GMO"], "tweets": [], "movies": [], "links": ["http://www.newtimes.co.rw/section/article/2017-02-05/207713/", "http://www.newtimes.co.rw/section/article/2017-02-06/207746/", "http://toxins.news", "http://vaccines.news", "https://www.brighteon.tv", "http://www.biotech.news/", "http://pesticides.news", "http://gardentower.naturalnews.com/GardenTower.html", "http://www.naturalnews.com/030695_GMOs_Obama.html", "http://www.chemicals.news/", "http://www.newtimes.co.rw/section/article/2017-02-06/207746/", "http://www.newtimes.co.rw/section/article/2017-02-05/207713/", "http://www.naturalnews.com/030695_GMOs_Obama.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2017-02-09-chemical-ridden-gmo-foods-are-being-pushed-on-africans.html&linkname=Chemical-ridden%20GMO%20foods%20are%20now%20being%20pushed%20on%20Africans%2C%20destroying%20their%20natural%20food%20culture", "https://www.addtoany.com/share"], "authors": [], "publish_date": "02/09/2017 22:17:08"}