{"result_id": "118012", "URL": "https://www.food.news/2019-11-13-mercola-google-wikipedia-censor-natural-health-websites.html", "timestamp": "2023-04-25 15:07:48 CEST+0200", "meta": {"description": "Back in June, Mercola.com, the most visited natural health website in the world, was deleted from Google’s search results for supposedly spreading “misinformation” about health, nutrition, and vaccines. However, the real reason that Google went on this censorship purge is because Dr. Joseph Mercola represents a serious threat to the viability of mainstream medicine, of […]", "lang": "en", "keywords": "bias,Big Pharma,Big Tech,Brighteon,Censorship,Dr. Mercola,Google,health freedom,information control,malicious bias,processed junk food,supressed,thought control,Wikipedia", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2019-11-13-mercola-google-wikipedia-censor-natural-health-websites.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Dr. Mercola reveals how Google and Wikipedia tag team to censor natural health websites while promoting Big Pharma and processed junk food", "cleaned_text": "Dr. Mercola reveals how Google and Wikipedia tag team to censor natural health websites while promoting Big Pharma and processed junk food\n\nBack in June, Mercola.com, the most visited natural health website in the world, was deleted from Google’s search results for supposedly spreading “misinformation” about health, nutrition, and vaccines. However, the real reason that Google went on this censorship purge is because Dr. Joseph Mercola represents a serious threat to the viability of mainstream medicine, of which Google is now a major stakeholder.\n\nIn a new video posted to his Brighteon.com account, Dr. Mercola, a board-certified physician who runs a successful practice that’s helped millions of people around the world, reveals how Google has essentially morphed into its own drug company. No longer just a simple search engine, Google has effectively rigged its system to favor only articles and other related content that support pharmaceutical drugs, vaccines, and junk food – all things that Dr. Mercola’s medical perspectives call into question.\n\nBecause Dr. Mercola’s understanding of medicine is, in many ways, contradictory to what the establishment claims is undeniable medical fact, including the popular misnomer that all vaccines are safe and effective, he’s become a target for elimination by Big Tech. And the same thing is happening to many others just like him who prefer to tell the truth rather than parrot establishment propaganda.\n\n“My site has been a top destination for health topics for over 17 years, but Google has now decided to remove these pages that have legitimately earned the trust of the public and replace them with health information from advertising companies that promote junk food and drugs through Google ad services,” Dr. Mercola explains, using the example of an in-depth article he wrote about rheumatoid arthritis, entitled, “Rheumatoid Arthritis: Painful Debilitating Disease More Devastating Than Previously Recognized,” that Google has simply blocked from showing up when Google users search for information about this topic.\n\n“This is a clear example of malicious bias that is affecting Google and the information you see.”\n\nFor more related news about Big Tech fascism and Google censorship, be sure to check out EvilGoogle.news and Censorship.news.\n\nGoogle wants users to stop taking care of themselves naturally, and instead choose drugs and vaccines for their health\n\nIt used to be the case that when a Google user typed “rheumatoid arthritis” into the Google search bar, this particular article by Dr. Mercola came up as one of the top results. That’s because this article is very popular and has helped many people all around the world, boasting well over one million page views.\n\nBut that was way back when Google’s algorithms were fairer and less biased, and pulled up relevant information based on actual popularity with real people, as opposed to just propaganda that’s been selectively curated by Google’s artificial intelligence (AI) “machine learning” robots.\n\nNowadays, pretty much anything you search for on Google related to health will pull up drug industry propaganda from one of three sites: WebMD, Healthline, and Medical News Today. You’ll also likely see a few “fact-checking” sites thrown in there as well that “debunk” natural and alternative options for whatever health issue you searched.\n\nGoogle also embeds advertising for drugs and vaccines within these links to WebMD, Healthline, and Medical News Today, the goal of which is to herd readers back into the conventional pen, and away from the “alternative” modalities suggested by Dr. Mercola and many others who are similarly being censored across the Google platform.\n\n“Google is a drug dealer, and you just need to say no to help you and your family take control of your health,” warns Dr. Mercola.\n\nBe sure to check out the Dr. Mercola Brighteon.com page to learn more, and to support this fellow truth advocate as he endures, like we all are, this barrage of Big Tech censorship.", "opengraph": {"title": "Dr. Mercola reveals how Google and Wikipedia tag team to censor natural health websites while promoting Big Pharma and processed junk food", "type": "article", "url": "https://www.food.news/2019-11-13-mercola-google-wikipedia-censor-natural-health-websites.html", "site_name": "Food News", "description": "Back in June, Mercola.com, the most visited natural health website in the world, was deleted from Google’s search results for supposedly spreading “misinformation” about health, nutrition, and vaccines. However, the real reason that Google went on this censorship purge is because Dr. Joseph Mercola represents a serious threat to the viability of mainstream medicine, of […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/11/Censored-Internet-User-Big-Tech.jpg", "article:published_time": "11/13/2019 06:27:35", "article:post_id": "15770"}, "tags": ["Google", "malicious bias", "information control", "processed junk food", "Big Pharma", "Brighteon", "Dr. Mercola", "Wikipedia", "Censorship", "thought control", "bias", "health freedom", "Big Tech", "supressed"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2019-06-26-google-buries-mercola-search-results-in-escalating-attack-on-all-independent-health-nutrition-vaccine-information.html", "https://www.brighteon.tv", "https://www.brighteon.com/d5f1c412-7bc9-4904-919c-5061eff324a9", "https://www.naturalnews.com/2019-07-02-google-to-block-all-anti-cancer-anti-vax-and-anti-gmo-websites-at-the-browser-level.html", "https://articles.mercola.com/sites/articles/archive/2010/08/16/rheumatoid-arthritis-protocol.aspx", "http://evilgoogle.news", "http://censorship.news", "https://www.wakingtimes.com/2019/11/08/shocking-proof-how-google-censors-health-news/", "https://www.brighteon.com/channel/mercola", "https://www.naturalnews.com/2019-06-26-google-buries-mercola-search-results-in-escalating-attack-on-all-independent-health-nutrition-vaccine-information.html", "https://www.brighteon.com/d5f1c412-7bc9-4904-919c-5061eff324a9", "https://www.naturalnews.com/2019-07-02-google-to-block-all-anti-cancer-anti-vax-and-anti-gmo-websites-at-the-browser-level.html", "https://articles.mercola.com/sites/articles/archive/2010/08/16/rheumatoid-arthritis-protocol.aspx", "https://www.wakingtimes.com/2019/11/08/shocking-proof-how-google-censors-health-news/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-11-13-mercola-google-wikipedia-censor-natural-health-websites.html&linkname=Dr.%20Mercola%20reveals%20how%20Google%20and%20Wikipedia%20tag%20team%20to%20censor%20natural%20health%20websites%20while%20promoting%20Big%20Pharma%20and%20processed%20junk%20food", "https://www.addtoany.com/share"], "authors": [], "publish_date": "11/13/2019 06:27:35"}