{"result_id": "118001", "URL": "https://food.news/2018-12-17-bombshell-study-shows-aspartame-depletes-neurotransmitters-in-the-brain-5g-pesticides.html", "timestamp": "2023-04-25 15:07:40 CEST+0200", "meta": {"description": "A bombshell scientific study reveals that aspartame may be one of the most damaging vectors for the widespread “dumbing down” of humanity. Published in AJTCAM (African Journal of Traditional, Complementary and Alternative Medicines), the study is entitled, “IMPACT OF ASPARTAME CONSUMPTION ON NEUROTRANSMITTERS IN RAT BRAIN.” (Source) The study fed rats aspartame for durations of […]", "lang": "en", "keywords": "aspartame,badfood,badhealth,badmedicine,brain function,brain health,chemicals,detox,ingredients,Neurotransmitters,sweeteners,toxins", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://food.news/2018-12-17-bombshell-study-shows-aspartame-depletes-neurotransmitters-in-the-brain-5g-pesticides.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "Bombshell study shows aspartame depletes neurotransmitters in the brain, makes brains vulnerable to chemical damage from food and vaccines", "cleaned_text": "Bombshell study shows aspartame depletes neurotransmitters in the brain, makes brains vulnerable to chemical damage from food and vaccines\n\nA bombshell scientific study reveals that aspartame may be one of the most damaging vectors for the widespread “dumbing down” of humanity. Published in AJTCAM (African Journal of Traditional, Complementary and Alternative Medicines), the study is entitled, “IMPACT OF ASPARTAME CONSUMPTION ON NEUROTRANSMITTERS IN RAT BRAIN.” (Source)\n\nThe study fed rats aspartame for durations of 10 – 40 days, then decapitated the rats and analyzed their brains. From the abstract, “Blood and brain tissue were collected for biochemical analysis. Biochemical analysis of brain tissue includes neurotransmitters (Acetylcholine, epinephrine, norepinephrine, ?-aminobutyric acid and serotonin). Serum for determination of lipid peroxidation (MDA), reduced glutathione and superoxide dismutase (SOD).”\n\nThe results of the study found a dose-dependent relationship between aspartame consumption and the destruction of neurotransmitters — brain chemicals necessary for the function of neurons.\n\n“Brain neurotransmitters levels (serotonin, GABA and dopamine) were reduced significantly compared with control,” the study says. Furthermore, levels of brain antioxidants that protect brain tissue from oxidation damage — often caused by chemical exposure — were sharply depleted. “…[D]ata obtained showed that antioxidant activities (SOD and GSH) were reduced significantly,” the study reports.\n\nThe conclusion of the study found that, “Consumption of [aspartame] for a long time increased oxidative stress in brain tissue and disruption in neurotransmitters that affect physiological functions.”\n\nHuge reduction in serotonin and sharp increase in epinephrine may explain the chemical alteration of the masses\n\nThe study found that serotonin levels were reduced by nearly 74% (with some margin of error) in rats that consumed 125mg of aspartame vs. rats fed no aspartame. At the same time, levels of epinephrine were substantially increased by almost 500%. Epinephrine is the “fight or flight” chemicals that’s normally associated with fear, uncertainty and danger.\n\nWhat these results show is absolutely stunning: Aspartame sharply reduces core neurotransmitters in the brain while aggressively increasing chemicals associated with fear and danger.\n\nIn addition, aspartame makes the brain more vulnerable to oxidative damage, meaning brain cells are more prone to damage from vaccine ingredients (Thimerosal), toxic food chemicals, pesticides or even potentially 5G wireless networks that cause the electromagnetic alteration of brain cells.\n\nThe American public, which consumes enormous quantities of aspartame, is increasingly identified as “dumbed-down” and full of fear, hatred and violence. Their brains are being altered by chemicals that turn humans into more animalistic organisms that lack higher cognitive function.\n\nAs this study shows, aspartame may be contributing to the downfall of human civilization by altering the brains of human beings, turning them into cognitively impaired, chemically-altered organisms incapable of rational behavior. It also reminds us that when it comes to food ingredients, humans are the lab rats who are routinely exposed to dangerous, toxic chemicals that have unknown long-term effects.\n\nBut they’re all “approved” by the FDA, often based on fraudulent science studies provided by the chemical manufacturers themselves.\n\nLearn more about healthy vs. toxic sweeteners at Sweeteners.news.", "opengraph": {"title": "Bombshell study shows aspartame depletes neurotransmitters in the brain, makes brains vulnerable to chemical damage from food and vaccines", "type": "article", "url": "https://www.food.news/2018-12-17-bombshell-study-shows-aspartame-depletes-neurotransmitters-in-the-brain-5g-pesticides.html", "site_name": "Food News", "description": "A bombshell scientific study reveals that aspartame may be one of the most damaging vectors for the widespread “dumbing down” of humanity. Published in AJTCAM (African Journal of Traditional, Complementary and Alternative Medicines), the study is entitled, “IMPACT OF ASPARTAME CONSUMPTION ON NEUROTRANSMITTERS IN RAT BRAIN.” (Source) The study fed rats aspartame for durations of […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2018/12/Neuron-Nerve-3D-Alzheimer-Brain-Neural-Electric.jpg", "article:published_time": "12/17/2018 23:00:36", "article:post_id": "9017"}, "tags": ["badfood", "detox", "sweeteners", "brain function", "badhealth", "Neurotransmitters", "badmedicine", "brain health", "ingredients", "toxins", "chemicals", "aspartame"], "tweets": [], "movies": [], "links": ["http://aspartame.news", "http://journals.sfu.ca/africanem/index.php/ajtcam/article/view/4861", "https://www.brighteon.tv", "http://pesticides.news", "http://Sweeteners.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2018-12-17-bombshell-study-shows-aspartame-depletes-neurotransmitters-in-the-brain-5g-pesticides.html&linkname=Bombshell%20study%20shows%20aspartame%20depletes%20neurotransmitters%20in%20the%20brain%2C%20makes%20brains%20vulnerable%20to%20chemical%20damage%20from%20food%20and%20vaccines", "https://www.addtoany.com/share"], "authors": [], "publish_date": "12/17/2018 23:00:36"}