{"result_id": "118021", "URL": "https://www.food.news/2023-01-18-government-big-pharma-to-taint-food-supply.html", "timestamp": "2023-04-25 15:07:54 CEST+0200", "meta": {"description": "The government and Big Pharma companies are planning to taint the nation’s food supply, specifically by injecting animals with mRNA vaccines. Dr. Robert Malone, the inventor of mRNA vaccination technology, noted that information on this new development is sparse because mRNA vaccine use for “animal health” or for other aspects in the veterinary markets is difficult to track […]", "lang": "en", "keywords": "agriculture,badfood,badhealth,badmedicine,badscience,big government,conspiracy,Dangerous Medicine,food supply,genetic lunacy,insanity,livestock,mRNA,Robert Malone,science deception,science fraud,toxic ingredients,vaccine wars,vaccines", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2023-01-18-government-big-pharma-to-taint-food-supply.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Government and Big Pharma plan to taint food supply by injecting animals with mRNA vaccines", "cleaned_text": "Government and Big Pharma plan to taint food supply by injecting animals with mRNA vaccines\n\nThe government and Big Pharma companies are planning to taint the nation’s food supply, specifically by injecting animals with mRNA vaccines.\n\nDr. Robert Malone, the inventor of mRNA vaccination technology, noted that information on this new development is sparse because mRNA vaccine use for “animal health” or for other aspects in the veterinary markets is difficult to track until either the company developing this or agencies like the U.S. Department of Agriculture (USDA) release information on the product’s development.\n\nFurthermore, neither the USDA nor the National Institutes of Health have a mechanism for tracking the potential release of new vaccinations, drugs or other biologics for the animal market. (Related: The US meat supply may soon be widely contaminated with mRNA proteins from biotech “vaccines.”)\n\nSome of the earliest evidence of Big Pharma developing mRNA vaccines for animals came from press releases.\n\nIn 2016, Bayer partnered with Wuhan coronavirus (COVID-19) vaccine developer BioNTech to create “first-in-class mRNA vaccines and therapeutics for animal health indications.” Bayer and BioNTech followed this up with another statement claiming that they are collaborating on cutting-edge technology to develop new solutions to protect the health of companion and farm animals.\n\n“They are injecting animals with these [mRNA vaccines] and are planning on doing a lot more than that,” warned Attorney Thomas Renz. “Do we want gene therapy injections into animals? More importantly, if they do put that in there, what is the likelihood of transmissibility to humans?”\n\nSince 2016, more and more news has been coming out of Big Pharma companies developing veterinary mRNA vaccines and animals being subjected to mRNA trials. One such trial from Australia featured a 17.5 percent death rate for cattle.\n\nThe incident occurred in the Australian state of New South Wales, where a cattle farmer was forced by the authorities to vaccinate 200 heads of cattle with mRNA vaccines. Thirty-five of those cattle died instantly.\n\nDylan Eleven, writing for Principia Scientific, noted that the surviving members of this herd of cows have already had their DNA altered by the mRNA vaccines.\n\nFurthermore, Eleven warned that the food supply of Australia may already have been infected. Details are scant, but it is strongly suggested that the animal trial involved dairy cows. This means their milk has already been altered, along with other dairy products produced by the surviving herd, including butter, yogurt, cheese and meat.\n\n“Please take the time to urgently warn others,” wrote Eleven. “Literally consuming dairy would be like a vaccine, and that goes for cheese and other food products that have dairy including cheese, pizzas and sandwiches.”\n\nEleven further warned people to be cautious of consuming cow meat products, especially if people are not certain where they come from.\n\n“My hope is that we find a way to deal with this,” said Renz. “But the key here is that we’ve got to keep pushing the truth out because unfortunately, we can’t count on our federal government to do anything legal or ethical.”\n\nLearn more about the dangers of mRNA vaccines at Vaccines.news.\n\nWatch this episode of “Another Renz Rant” as Attorney Thomas Renz talks about mRNA vaccines infecting the food supply.\n\nThis video is from the Thomas Renz channel on Brighteon.com.\n\nmRNA vaccines for animals and livestock have arrived – get ready for a transgenic meat supply laced with spike protein.\n\nIf mRNA is now being found in breast milk, then COVID “vaccine” safety claims are lies.\n\nStudy finds 84% increase in incidence of cardiac-related DEATH among men under 40 following mRNA vaccination.\n\nScientists look to create chimeric mRNA vaccines that can be deployed through food.", "opengraph": {"title": "Government and Big Pharma plan to taint food supply by injecting animals with mRNA vaccines", "type": "article", "url": "https://www.food.news/2023-01-18-government-big-pharma-to-taint-food-supply.html", "site_name": "Food News", "description": "The government and Big Pharma companies are planning to taint the nation’s food supply, specifically by injecting animals with mRNA vaccines. Dr. Robert Malone, the inventor of mRNA vaccination technology, noted that information on this new development is sparse because mRNA vaccine use for “animal health” or for other aspects in the veterinary markets is difficult to track […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2023/01/Cows-Cattle-Grazing-Food-Dairy.jpg", "article:published_time": "01/18/2023 21:43:54", "article:post_id": "22733"}, "tags": ["badfood", "conspiracy", "big government", "badhealth", "science deception", "genetic lunacy", "Robert Malone", "vaccine wars", "toxic ingredients", "insanity", "agriculture", "livestock", "science fraud", "Dangerous Medicine", "badmedicine", "vaccines", "food supply", "badscience", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/7a1a63fe-85de-41ff-9769-f5fcba8f0730", "https://rwmalonemd.substack.com/p/mrna-vaccines-in-livestock-and-companion", "https://www.brighteon.tv", "https://www.naturalnews.com/2023-01-16-us-meat-supply-infected-with-mrna-proteins.html", "http://biotech.news", "https://principia-scientific.com/instant-death-of-cows-who-received-mrna-vaccine/", "https://vaccines.news/", "https://www.brighteon.com/7a1a63fe-85de-41ff-9769-f5fcba8f0730", "https://www.brighteon.com/channels/tomrenz", "https://www.brighteon.com/channels/tomrenz", "https://www.naturalnews.com/2023-01-17-mrna-vaccines-for-animals-livestock-have-arrived.html", "https://vaccines.news/2022-11-29-mrna-breast-milk-covid-vaccine-safety-lies.html", "https://vaccinedeaths.com/2022-10-21-lethal-injections-cattle-die-mrna-vaccination.html", "https://naturalnews.com/2022-10-13-men-cardiac-related-death-after-mrna-vaccination.html", "https://vaccines.news/2022-03-25-scientists-to-create-chimeric-mrna-vaccines-food.html", "https://www.brighteon.com/7a1a63fe-85de-41ff-9769-f5fcba8f0730", "https://rwmalonemd.substack.com/p/mrna-vaccines-in-livestock-and-companion", "https://principia-scientific.com/instant-death-of-cows-who-received-mrna-vaccine/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2023-01-18-government-big-pharma-to-taint-food-supply.html&linkname=Government%20and%20Big%20Pharma%20plan%20to%20taint%20food%20supply%20by%20injecting%20animals%20with%20mRNA%20vaccines", "https://www.addtoany.com/share"], "authors": [], "publish_date": "01/18/2023 21:43:54"}