{"result_id": "118027", "URL": "https://www.food.news/2017-05-13-top-6-ingredients-the-mass-media-says-are-bad-in-food-and-products-but-good-in-vaccines.html", "timestamp": "2023-04-25 15:07:57 CEST+0200", "meta": {"description": "The human body is an amazing machine from day one. In three major ways, it naturally protects itself from many different kinds of dangerous situations regarding foreign agents that attempt to enter the body. Digestion is the process of breaking down food using heat, enzymatic and mechanical action so that essential components of that food […]", "lang": "en", "keywords": "bad medicine,immunization toxins,inoculation toxins,mercury flu shots,pharma kills,vaccine toxins", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2017-05-13-top-6-ingredients-the-mass-media-says-are-bad-in-food-and-products-but-good-in-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Top 6 ingredients the mass media says are BAD in food and products, but GOOD in vaccines", "cleaned_text": "Top 6 ingredients the mass media says are BAD in food and products, but GOOD in vaccines\n\nThe human body is an amazing machine from day one. In three major ways, it naturally protects itself from many different kinds of dangerous situations regarding foreign agents that attempt to enter the body.\n\nDigestion is the process of breaking down food using heat, enzymatic and mechanical action so that essential components of that food can be used by the body. Digestion also serves as a key initial filter that is a natural way the body can protect itself against disease. In other words, our digestive system is our gut protection system that can prevent a whole slew of problems associated with poor digestive health.\n\nThe respiratory system is a series of organs responsible for filtering everything we breathe in. The trachea and bronchial tubes filter the air we breathe, and the tiny hairs called cilia carry mucus and protect us against pollutants like dust, germs and other harmful matter that might otherwise enter the lungs.\n\nLastly, our skin is an elastic covering that protects our blood, nerves and organs from immediate exposure to several dangerous and harmful substances in the environment, such as bacteria, viruses and infection.\n\nThe theory of vaccines makes total sense and could work if administered properly, but over the decades, Western Medicine has not only polluted the process with known neurotoxins, carcinogens, and mixed live viruses, but the vaccine schedule for children includes up to 70 toxic jabs before age 7, throwing caution, common sense and the whole fundamental “theory” out the window. Vaccines are supposed to offer a minuscule amount of a pathogen or antigen to the immune system, along with a minute amount of bacterial carbohydrate and viral protein – just enough for the immune system to recognize, respond to, and be prepared to react immediately to the “real thing” later, minimizing the damage before it really kicks in. That sounds good, but fails miserably. Why?\n\nVaccines bypass all of the natural body defenses immediately, including your skin, your respiratory tract and your digestive system. All of those natural defenses are useless against pathogens injected directly into your muscle tissue. Then, besides a miniscule, weakened or “deadened” amount of the disease you don’t want to catch, vaccine manufacturers are adding the unthinkable.\n\nSeveral known toxins that the mainstream media repeatedly warn us about not eating, drinking or putting on our skins are purposely mixed into vaccines, never tested for safety, and then injected into pregnant women, newborn babies, children, adults and even the elderly. Known neurotoxins and deadly carcinogens that cause cancer, autism and dementia are labeled discretely (and insidiously) by the vaccine industry as preservatives, emulsifiers, carriers, excipients, adjuvants, stabilizers, cell cultures and “inactive” ingredients.\n\nThese toxins are excused by the vaccine industry because they are only included in vaccines as “miniscule amounts,” so they say it’s not the same as eating them, drinking them, breathing them in or putting them on your skin. That’s true, because it’s much, much worse!\n\nExperimental concoctions that contain infected African Green Monkey kidney cells and blood (albumin) and cells from human abortions, dogs, chickens, birds, cows, pigs and even worms are found in today’s immunizations. Embalming fluid for the dead (formaldehyde) is found in most inoculations. Forms of aluminum that are known to cause dementia are found in most toxic jabs. Monosodium glutamate, known to cause brain damage in infants, is included in several vaccinations. Mercury, the most toxic non-radioactive element on earth, is still used in influenza vaccines, even though the CDC lied to every single American, saying mercury was pulled out of all childhood vaccines. So, why is the flu shot recommended by the CDC for children and pregnant women? Go figure. Even a deadly pig virus called circovirus is included in the rotavirus vaccine — but why? It’s time to start asking doctors and nurses vital questions, and up front.\n\nHere are the most common ingredients in vaccines that the mass media warns you repeatedly not to eat, drink or put on your skin\n• Drinking human blood is very bad – but amazingly, injecting human blood is good\n• Formaldehyde in floors is dangerous – but formaldehyde in vaccines is good\n• Aluminum in deodorant is bad – but somehow aluminum in vaccines is good\n• MSG in food is carcinogenic – while MSG in vaccines is good\n• Glyphosate on food is toxic – yet glyphosate in vaccines is good\n• Mercury in fish is highly dangerous – but miraculously, mercury in vaccines is good\n\nSo, the next time you’re considering getting injected with known carcinogens and neurotoxins, ask your doctor or nurse to explain why it’s okay to inject things you would never purposely eat or put on your skin. When that medical practitioner says it’s because they’re only included in “minuscule amounts,” you’ll know exactly why that’s not even close to being an acceptable excuse.", "opengraph": {"title": "Top 6 ingredients the mass media says are BAD in food and products, but GOOD in vaccines", "type": "article", "url": "https://www.food.news/2017-05-13-top-6-ingredients-the-mass-media-says-are-bad-in-food-and-products-but-good-in-vaccines.html", "site_name": "Food News", "description": "The human body is an amazing machine from day one. In three major ways, it naturally protects itself from many different kinds of dangerous situations regarding foreign agents that attempt to enter the body. Digestion is the process of breaking down food using heat, enzymatic and mechanical action so that essential components of that food […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2018/07/poison-e1494332353572.jpg", "article:published_time": "05/13/2017 10:57:15", "article:post_id": "4377"}, "tags": ["pharma kills", "inoculation toxins", "mercury flu shots", "vaccine toxins", "bad medicine", "immunization toxins"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "http://www.naturalnews.com/2017-03-28-fact-check-yes-the-cdc-and-fda-both-confirm-african-green-monkey-kidney-cells-are-used-in-vaccines-in-america.html", "http://www.foodmatters.com/article/the-dangers-of-msg", "http://cdc.news/", "http://www.virology.ws/2010/03/22/porcine-circovirus-dna-in-rotavirus-vaccine/", "http://www.cnn.com/2016/03/22/health/health-effect-laminate-wood-flooring/", "http://vaccines.news/2017-04-17-brain-damaging-vaccines-pesticides-and-medicines-generate-nearly-800-billion-a-year-in-medical-revenues.html", "http://www.truthwiki.org/mercury-in-vaccines/", "http://www.foodmatters.com/article/the-dangers-of-msg", "http://www.cnn.com/2016/03/22/health/health-effect-laminate-wood-flooring/", "http://vaccines.news/2017-04-17-brain-damaging-vaccines-pesticides-and-medicines-generate-nearly-800-billion-a-year-in-medical-revenues.html", "http://www.naturalnews.com/2017-03-28-fact-check-yes-the-cdc-and-fda-both-confirm-african-green-monkey-kidney-cells-are-used-in-vaccines-in-america.html", "http://www.truthwiki.org/mercury-in-vaccines/", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "http://www.virology.ws/2010/03/22/porcine-circovirus-dna-in-rotavirus-vaccine/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2017-05-13-top-6-ingredients-the-mass-media-says-are-bad-in-food-and-products-but-good-in-vaccines.html&linkname=Top%206%20ingredients%20the%20mass%20media%20says%20are%20BAD%20in%20food%20and%20products%2C%20but%20GOOD%20in%20vaccines", "https://www.addtoany.com/share"], "authors": [], "publish_date": "05/13/2017 10:57:15"}