{"result_id": "118008", "URL": "http://www.food.news/2018-01-04-stage-3-myeloma-cancer-eliminated-turmeric-supplement-british-medical-journal.html", "timestamp": "2023-04-25 15:07:45 CEST+0200", "meta": {"description": "For decades, the medical establishment has colluded with the for-profit cancer industry to smear anyone who talked about herbs, spices or superfoods fighting cancer. Food doesn’t contain “medicine,” we were told by the dishonest establishment. Only FDA-approved toxic medications can “treat” cancer, the propagandists insisted. Yet millions of people across the globe continued to successfully […]", "lang": "en", "keywords": "anti-cancer,British Medical Journal,cancer,cancer cures,curcumin,dietary supplements,goodfood,goodhealth,goodmedicine,goodscience,healing foods,Herbs,myeloma,natural cures,natural remedies,prevention,superfoods,turmeric", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "http://www.food.news/2018-01-04-stage-3-myeloma-cancer-eliminated-turmeric-supplement-british-medical-journal.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Stage-3 myeloma cancer completely ELIMINATED with a turmeric supplement – British Medical Journal", "cleaned_text": "Every last sign of cancer was eliminated using nothing but curcumin from turmeric\n\nFor decades, the medical establishment has colluded with the for-profit cancer industry to smear anyone who talked about herbs, spices or superfoods fighting cancer. Food doesn't contain \"medicine,\" we were told by the dishonest establishment. Only FDA-approved toxic medications can \"treat\" cancer, the propagandists insisted. Yet millions of people across the globe continued to successfully prevent and even reverse late-stage cancers using nothing but foods, herbs and natural medicine. Despite its best efforts to ignore the reality of natural cancer cures , the medical establishment has just been forced to document a stunning case of, a superfood spice commonly used in curry.This remarkable elimination of cancer was documented by the British Medical Journal in its \"case reports\" archive. Entitled, \" Long-term stabilisation of myeloma with curcumin ,\" the analysis dare not mention the word \"cure,\" as that terminology is banned across the entire medical and scientific establishment which insists there's \"no such thing as a cure for cancer.\" That false belief, of course, just happens to coincide with. According to the BMJ documentary, authored by Dr. Abbas Zaidi: ...[W]e describe a myeloma patient who started a daily dietary supplement of curcumin when approaching her third relapse. In the absence of further antimyeloma treatment, the patient plateaued and has remained stable for the last 5 years with good quality of life. In other words,by taking nothing more than a curcumin supplement made from turmeric root. (Curcumin is the most potent phytochemical found in turmeric.) Even more, the woman who took the curcumin supplement, very likely from Natural News or a related website that documents the strong science behind anti-cancer foods and supplements such as turmeric. (Natural News has empowered tens of millions of people around the world to take control of their health and prevent serious disease by using simple, affordable foods and natural medicine.)\n\n\"A woman who battled blood cancer for years without success finally halted the disease with turmeric,\" reported the UK Daily Mail. \"Dieneke Ferguson is now leading a normal life after giving up on gruelling treatments that failed to stop it.\"\n\nFerguson, you see, tried chemotherapy but quickly realized how toxic chemo is to the human body. So she stopped the chemo and started taking curcumin supplements instead. Five years later, she's cancer free and has outlived the full life expectancy of someone diagnosed with the type of cancer she once had. The UK Daily Mail adds:\n\nDoctors say her case is the first recorded instance in which a patient has recovered by using the spice after stopping conventional medical treatments. With her myeloma spreading rapidly after three rounds of chemotherapy and four stem cell transplants, the 67-year-old began taking 8g of curcumin a day – one of the main compounds in turmeric. Mrs Ferguson, who was first diagnosed in 2007, continues to take curcumin without further treatment and her cancer cell count is negligible.\n\nThis related video also shows that prostate cancer can be reversed with three simple nutrients, including turmeric root:\n\nDoctors admit \"no other explanation\" ... TURMERIC reversed this woman's cancer\n\n\"Ferguson began taking eight grams of curcumin in tablet form daily. This is equivalent to about two teaspoonfuls of pure powdered curcumin,\" reports Turmeric.news, which also adds:\n\nWithin only 15 months, Ferguson noticed a considerable difference in her overall health. It wasn’t just a feeling either; oncologists saw that her plasma blood levels were almost normal. These blood counts have remained within the normal range for the last five years.\n\nThe cancer industry will go insane trying to make sure you never learn about this simple, affordable, natural cancer cure\n\nThe cancer industry is a medical conspiracy against humanity\n\nIf you buy turmeric, make sure it's laboratory tested for lead and other heavy metals\n\nTurmeric is also powerful medicine for arthritis and other diseases of inflammation\n\nHow to stay informed about powerful natural cures like turmeric\n\nJamie Cavenagh, professor of blood diseases at London’s Barts Hospital, who reviewed Ferguson’s case, was bemused. “When you review her chart, there’s no alternative explanation [for her recovery] other than we’re seeing a response to curcumin,” he said. Ferguson said she will continue to take her supplements. She reports herself as happy, healthy, and enjoying a “high-quality life.” Note that if she had been on chemotherapy, radiation therapy or other conventional cancer \"treatments,\" her quality of life would have been miserable. She's been experiencing intense pain, hair less, muscle loss, chronic fatigue, \"chemo brain\" and all the other side effects of toxic chemotherapy. Instead, she's enjoying a high-quality life, free from pain, inflammation and cancer. And she did it using nothing more than a simple root spice that you can buy in almost any grocery store. https://vimeo.com/247554724As you might expect, the for-profit cancer industry -- which depends on keeping cancer patients completely in the dark about natural cures -- routinely attacks any hint of a natural \"cure\" for cancer. Every person who eats turmeric or takes curcumin supplements denies the cancer industry millions of dollars in long-term profits that are siphoned off the suffering of diseased cancer patients. Importantlysuch as vitamin D , curcumin or medicinal mushrooms. This information is withheld from patients precisely because providing that information would harm the financial interests of cancer clinics, chemotherapy treatment centers and unethical oncology doctors who are increasingly being outed as medical criminals. Dr. Farid Fata , for example -- now serving decades in federal prison -- falsely diagnosed nearly every patient he saw with cancer so that he could profit from administering them toxic chemotherapy drugs. Other similarly nefarious cancer industry doctors such as Dr. David Gorski , a one-time colleague of the criminal Dr. Fata, profits from exploiting black women for cancer surgeries while viciously attacking natural cures and those who promote them. Dr. David Gorski , much like Dr. Fata, has also been named in conspiracy allegations and reported to the FBI but remains in practice, raking in cash from the surgical maiming of countless women who might otherwise have been able to reverse their cancer if they only had knowledge of natural cures such as curcumin. https://vimeo.com/227093240The cancer industry goes to great lengths to deny patients access to any information that they might use to prevent, treat or cure cancer without requiring expensive (and highly toxic) medical interventions. That's what makes the BMJ documentation of this curcumin cancer cure so astonishing: In years past, the BMJ never would have even tolerated the publishing of such a scientific assessment. So what changed? In truth, the evidence of natural cures for cancer is now so overwhelming that even the BMJ cannot remain in a state of denial without appearing to be hopelessly out of touch with scientific reality. The public no longer believes the lies of the cancer industry, in other words. With increasing frequency, cancer patients areand deciding to beat cancer on their own, just like Chris Wark did (\" Chris beat cancer \") as he explains in this Natural News interview that was recently published: https://vimeo.com/233510182Turmeric root is routinely contaminated with lead. Most of it is grown in either India or China, and both countries have horrific environmental enforcement when it comes to food production. That's why just last year, the FDA forced a nationwide recall spanning multiple brands of turmeric spice due to high lead content. As one of the world's leading heavy metals scientists in the realm of food and supplements, I have personally tested thousands of products for lead and other heavy metals, and I routinely find alarming levels of lead in turmeric and other root spices. (My No. 1 selling science book, Food Forensics , lists the heavy metals testing results for over 800 foods, spices, pet foods and more.) That's why I now alert everyone to the lead problem with turmeric root and turmeric products.. In my lab, we use ICP-MS and other mass spec instruments to test products, giving us accurate heavy metals results down to single digit parts per billion concentrations. My lab, CWC Labs , is also, which is a globally-recognized \"gold standard\" for laboratory analytical excellence, putting us far above most university laboratories in terms of scientific credibility, as university labs are almost never accredited. (Most private labs are not accredited either, as it takes two years of hard work to achieve accreditation.) Bottom line? Yes, turmeric is a potent anti-cancer spice. It's extremely powerful, and now the British Medical Journal has even documented a case of the complete elimination of myeloma cancer using nothing but curcumin from turmeric. But if you choose to consume turmeric on a daily basis (like I do), make sure it's clean or you'll be eating lead. I add a heaping teaspoon of lab-verified turmeric powder to my morning smoothie each day. It tastes awesome. https://vimeo.com/218508997Don't think turmeric is limited to cancer, by the way. This powerful medicinal spice treats a multitude of serious health conditions in the body. As explained at Turmeric.news : Some of the other illnesses that can benefit from curcumin include infections, dementia, depression and heart disease. A 2016 review in the Journal of Medicinal Food highlighted its potential for arthritis treatment, and doctors have also applauded its anti-inflammatory effects. A recent study found that it can help destroy neuroblastoma tumor cells , showing promise as a way to treat the most common type of cancer in infants. Another study is expected to be published soon showing its positive effects on bowel cancer. That's why I consume turmeric daily. It might be decades before science catches up to all the healing properties of this medicinal spice (and superfood). But why wait? You can experience all those benefits -- even if science hasn't named them yet -- by consuming turmeric right now.Have you visited the Naturalpedia.com website yet? It contains listings for over 1,000 spices, foods, superfoods, herbs and nutrients that fight disease. Visit the TURMERIC page on NaturalPedia here . You can also read Turmeric.news for frequent news updates all about turmeric and curcumin. Finally, check out FoodScience.news for daily reported on food science breakthroughs for healing and disease prevention.", "opengraph": {"title": "Stage-3 myeloma cancer completely ELIMINATED with a turmeric supplement – British Medical Journal", "type": "article", "url": "https://www.food.news/2018-01-04-stage-3-myeloma-cancer-eliminated-turmeric-supplement-british-medical-journal.html", "site_name": "Food News", "description": "For decades, the medical establishment has colluded with the for-profit cancer industry to smear anyone who talked about herbs, spices or superfoods fighting cancer. Food doesn’t contain “medicine,” we were told by the dishonest establishment. Only FDA-approved toxic medications can “treat” cancer, the propagandists insisted. Yet millions of people across the globe continued to successfully […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2018/10/Turmeric-Powder-Health-Root.jpg"}, "tags": ["goodhealth", "superfoods", "cancer", "cancer cures", "natural remedies", "dietary supplements", "prevention", "goodmedicine", "turmeric", "British Medical Journal", "curcumin", "goodscience", "Herbs", "myeloma", "anti-cancer", "natural cures", "healing foods", "goodfood"], "tweets": [], "movies": [], "links": ["http://cancersolutions.news", "http://casereports.bmj.com/content/2017/bcr-2016-218148.full", "http://naturalnews.com", "http://anticancer.news", "http://www.dailymail.co.uk/news/cancer/index.html", "http://www.dailymail.co.uk/health/article-5230201/Pensioner-used-turmeric-fight-blood-cancer.html", "https://prevent-and-reverse-heart-disease.naturalnews.com", "https://prevent-and-reverse-heart-disease.naturalnews.com", "https://prevent-and-reverse-heart-disease.naturalnews.com", "http://chemo.news", "https://turmeric.news/2017-07-31-science-journal-confirms-eating-turmeric-cured-myeloma-cancer-in-57-year-old-woman.html", "http://vitaminD.news", "http://oncology.news", "http://www.truthwiki.org/dr-farid-fata/", "http://davidgorski.news", "http://www.truthwiki.org/orac-david-h-gorski/", "https://www.naturalnews.com/053751_David_Gorski_conspiracy_allegations_FBI_complaint.html", "http://naturalcures.news", "https://www.chrisbeatcancer.com", "https://www.naturalnews.com/054964_turmeric_spices_lead_contamination_FDA_recall.html", "http://foodforensics.com", "http://cwclabs.com", "http://bmj.com", "https://turmeric.news/2017-08-04-new-science-confirms-eating-turmeric-every-day-reverses-cancer.html", "https://mic.com/articles/182965/an-everyday-cooking-spice-may-help-fight-the-most-common-type-of-cancer-found-in-infants#.uR6wu4PLT", "http://Naturalpedia.com", "https://naturalpedia.com/turmeric-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "http://Turmeric.news", "http://FoodScience.news"], "authors": [], "publish_date": null}