{"result_id": "118014", "URL": "https://food.news/2019-03-04-silicon-rich-foods-and-enhanced-water-help-eliminate-aluminum.html", "timestamp": "2023-04-25 15:07:49 CEST+0200", "meta": {"description": "Aluminum is the most abundant metal found in the earth’s crust, though it is always found in combination with other elements such as oxygen or silicon. As a metal, it is used in a variety of common goods such as cans and cookware. But aluminum compounds often find themselves in a variety of other applications, […]", "lang": "en", "keywords": "Aluminum,Alzheimer's disease,dementia,detox,goodfood,goodhealth,Silicon,silicon water,toxic ingredients,toxins,vaccines", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://food.news/2019-03-04-silicon-rich-foods-and-enhanced-water-help-eliminate-aluminum.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "You’re being poisoned with ALUMINUM… but silicon-rich foods and enhanced water can help your body eliminate it quickly", "cleaned_text": "You’re being poisoned with ALUMINUM… but silicon-rich foods and enhanced water can help your body eliminate it quickly\n\nAluminum is the most abundant metal found in the earth’s crust, though it is always found in combination with other elements such as oxygen or silicon. As a metal, it is used in a variety of common goods such as cans and cookware. But aluminum compounds often find themselves in a variety of other applications, such as water treatment, antacids, antiperspirants, cosmetics, buffered aspirin and a number of food additives. Aluminum salts are also used in a number of vaccines as adjuvants, which supposedly serve to help provoke the immune system.\n\nEvery day, we are all exposed to aluminum through the food we eat, the air we breathe, the water we drink and even from the ground beneath our feet. According to the CDC’s Agency for Toxic Substances and Disease Registry (ATSDR), the average adult in the United States eats about 7 to 9 milligrams of aluminum every day in their food alone. The ATSDR also notes that both adults and children can be exposed to aluminum via vaccination. Aluminum is omnipresent in our world, but that doesn’t mean it’s safe.\n\nSeveral studies have demonstrated a connection between aluminum and Alzheimer’s disease in humans, and animal studies have shown that the nervous system is a prime target for aluminum toxicity.\n\nProfessor Chris Exley of Keele University is known as something of an expert in the field of aluminum toxicity — especially the metal’s relationship to Alzheimer’s disease. In late December, Exley and his colleagues published research that confirmed this toxic relationship, discovering that high amounts of aluminum were present in the brains of people diagnosed with familial Alzheimer’s disease.\n\nAnd now, new research led by Exley and his team has shown that there may be a way to inhibit the ill effects caused by the ubiquitous metal. Over the last ten years, Exley and his colleagues have been investigating the effectiveness that silicon-infused water might have against the toxic effects of aluminum.\n\nWhat they have uncovered is that drinking silicon-enhanced water can dramatically reduce the burden aluminum places on your body by increasing the rate at which it is expelled. In one case, the silicon-infused water helped to reduce aluminum levels by 70 percent over the course of the 12 week study period. The soluble form of silicon, called silicic acid, that was in the enhanced water used for the study actually binds to aluminum and creates hydroxy aluminosilicate. This compound can then be easily filtered from the blood and excreted out of the body through the kidneys via urine.\n\nWhat’s even more interesting, however, was their finding that drinking the silicon-enhanced water actually boosted cognitive function in people with Alzheimer’s disease.\n\nPast research has also demonstrated that consuming silicon-rich foods or beverages can help reduce the amount of aluminum present in bodily tissues. A 1998 study led by researchers from the University of Barcelona found that rats that consumed silicon-infused drinking water had lower levels of aluminum in their brains, livers, bones, spleens and kidneys. Three groups of rats were given 450 mg of aluminum nitrate nonahydrate five days a week for five weeks. The positive control group received only the aluminum. Two groups also received differing amounts of silicon in their drinking water, either 59 or 118 milligrams per liter. A fourth group was utilized as a negative control group, which received neither the aluminum nor the silicon. The researchers found at the end of the study, the two groups receiving silicon had less aluminum accumulation in all tissues than the positive control group.\n\nIn their summary, the researchers concluded, “The current results corroborate that silicon effectively prevents gastrointestinal aluminum absorption, which may be of concern in protecting against the neurotoxic effects of aluminum.”\n\nIf you want to protect yourself against the toxic effects of aluminum, it certainly seems that silicon-rich water may be your best bet.", "opengraph": {"title": "You’re being poisoned with ALUMINUM… but silicon-rich foods and enhanced water can help your body eliminate it quickly", "type": "article", "url": "https://www.food.news/2019-03-04-silicon-rich-foods-and-enhanced-water-help-eliminate-aluminum.html", "site_name": "Food News", "description": "Aluminum is the most abundant metal found in the earth’s crust, though it is always found in combination with other elements such as oxygen or silicon. As a metal, it is used in a variety of common goods such as cans and cookware. But aluminum compounds often find themselves in a variety of other applications, […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/03/water.jpg", "article:published_time": "03/04/2019 18:43:44", "article:post_id": "11697"}, "tags": ["Aluminum", "detox", "Silicon", "goodhealth", "dementia", "silicon water", "Alzheimer's disease", "toxic ingredients", "vaccines", "toxins", "goodfood"], "tweets": [], "movies": [], "links": ["http://www.naturalnews.com/055429_aluminum_vaccines_brain_damage.html", "https://www.brighteon.tv", "https://www.atsdr.cdc.gov/toxfaqs/tf.asp?id=190&tid=34", "http://www.naturalnews.com/048544_aluminum_Alzheimers_disease_antacids.html", "https://www.dailymail.co.uk/health/article-4047426/Aluminium-DOES-cause-Alzheimer-s-Expert-says-new-findings-confirm-metal-devastating-brain-disease.html", "https://www.keele.ac.uk/", "http://www.toxins.news", "https://www.dailymail.co.uk/health/article-4320406/Silicon-rich-mineral-water-new-healthy-have.html", "https://vaccinepapers.org/wp-content/uploads/Silicon-reduces-aluminum-accumulation-in-rats-Relevance-to-the-aluminum-hypothesis-of-Alzheimer-disease.pdf", "https://vaccinepapers.org/wp-content/uploads/Silicon-reduces-aluminum-accumulation-in-rats-Relevance-to-the-aluminum-hypothesis-of-Alzheimer-disease.pdf", "https://www.ub.edu/web/ub/en/", "https://www.atsdr.cdc.gov/toxfaqs/tf.asp?id=190&tid=34", "http://www.dailymail.co.uk/health/article-4320406/Silicon-rich-mineral-water-new-healthy-have.html", "http://www.dailymail.co.uk/health/article-4047426/Aluminium-DOES-cause-Alzheimer-s-Expert-says-new-findings-confirm-metal-devastating-brain-disease.html", "https://vaccinepapers.org/wp-content/uploads/Silicon-reduces-aluminum-accumulation-in-rats-Relevance-to-the-aluminum-hypothesis-of-Alzheimer-disease.pdf", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-03-04-silicon-rich-foods-and-enhanced-water-help-eliminate-aluminum.html&linkname=You%E2%80%99re%20being%20poisoned%20with%20ALUMINUM%E2%80%A6%20but%20silicon-rich%20foods%20and%20enhanced%20water%20can%20help%20your%20body%20eliminate%20it%20quickly", "https://www.addtoany.com/share"], "authors": [], "publish_date": "03/04/2019 18:43:44"}