{"result_id": "118017", "URL": "https://food.news/2019-10-05-desensitize-children-peanuts-can-make-allergies-worse.html", "timestamp": "2023-04-25 15:07:51 CEST+0200", "meta": {"description": "Trying to desensitize children to peanuts can make allergies worse, warn researchers from McMaster University in Canada. Oral immunotherapy is clinically effective for some people, but it can increase the risk of anaphylaxis for many others over time. Children who have a peanut allergy have a distinct dysfunction with their immune system. Instead of properly […]", "lang": "en", "keywords": "allergies,anaphalaxis,badfood,badhealth,child illness,desensitization,food allergies,food allergy,immune system altering,immunotherapy,peanut allergies,peanut oil,sensitization,toxic ingredients,vaccine damage", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://food.news/2019-10-05-desensitize-children-peanuts-can-make-allergies-worse.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "Trying to desensitize children to peanuts can make allergies WORSE, warn researchers", "cleaned_text": "Trying to desensitize children to peanuts can make allergies WORSE, warn researchers\n\nTrying to desensitize children to peanuts can make allergies worse, warn researchers from McMaster University in Canada. Oral immunotherapy is clinically effective for some people, but it can increase the risk of anaphylaxis for many others over time.\n\nChildren who have a peanut allergy have a distinct dysfunction with their immune system. Instead of properly digesting peanut protein, their immune responsive cells attack the peanut protein as if it is a threat to their body. Even the slightest exposure to peanut protein (Ara h1, Ara h2 and Ara h3) can incite an allergic reaction, including vomiting, mouth itching, abdominal pain, hives, wheezing, and anaphylaxis. Those who suffer from anaphylaxis shock often carry an EpiPen just in case they come into contact with peanuts. The epinephrine boosts the sufferer’s adrenaline level to help dilate their airways, restore their blood pressure, and prevent their organs from shutting down.\n\nSlowly feeding peanuts to an immuno-compromised child rarely desensitizes their immune system long term and the practice can easily backfire. The Canadian researchers compared the effectiveness of avoidance therapy and oral immunotherapy. The study involved 12 clinical trials including one thousand young patients at the average age of nine years old. The real world results suggest that their compromised immune systems never fully adjusts to peanuts even after they are clinically desensitized to the peanuts. The researchers found that oral immunotherapy makes the children more sensitive to peanuts, tripling rates of anaphylaxis, from 7.1 percent to 22.2 percent.\n\nLead researcher Dr Derek Chu, said, “Numerous studies of varying quality have been published on oral immunotherapy, but its effectiveness and reliability remains unclear.”\n\nThe study took into consideration every randomized clinical trial on peanut oral immunotherapy and avoidance therapy to date. Even though the immune system can be desensitized through exposure to peanut proteins, over time the desensitization did not stop allergic reactions altogether. Over time, oral immunotherapy actually tripled anaphylaxis rates when compared to avoidance or placebo.\n\nPeanut allergies rising because children’s immune systems are being systematically dumbed down\n\nA study by the Jaffe Food Allergy Institute at New York’s Mount Sinai hospital found that peanut allergies have tripled in the U.S. since 1997. Food allergies affect more than six million people in Europe and North America.\n\nWhile avoiding the identified allergen is the way one must react when suffering from a food allergy, it is not the food itself or the person’s natural immune system that is the root cause of this immune system dysfunction. Children’s immune systems are being systematically dumbed down and altered in a terrible way, indicated by the rise in food allergies, environmental allergies, sinusitis, and asthmatic reactions in today’s youth. This altering of the immune system occurs through vaccination, antibiotics, and over sanitized environments (hand sanitizers, Lysol).\n\nA child’s developing immune system is being systematically exposed to numerous chemicals via multiple vaccine injections. These so-called immunizations are introducing human DNA, animal DNA, embalming fluid, neuro-toxic adjuvants, antigens, retroviruses, and a consortium of chemicals directly into their blood. Through the route of injection, these ingredients bypass the child’s gastrointestinal system, their unique microbiome, their mucous membranes, villi, and other glandular protections offered by the body’s innate immune system.\n\nToday’s fully vaccinated children are at risk of having autoimmune issues and food allergies because their immune systems are being overly stimulated and overly sensitized to select ingredients. Peanut oil is one ingredient in vaccines that has overly sensitized children’s immune systems, causing allergic reactions to peanuts later in life.\n\nReacting to the allergies and autoimmune issues is one thing, but taking on the root cause of these immune system dysfunctions is a decision that parents must make before their child’s immune system is altered and damaged to the point of no return.\n\nRead Allergies.news for more news about allergies and their cures.", "opengraph": {"title": "Trying to desensitize children to peanuts can make allergies WORSE, warn researchers", "type": "article", "url": "https://www.food.news/2019-10-05-desensitize-children-peanuts-can-make-allergies-worse.html", "site_name": "Food News", "description": "Trying to desensitize children to peanuts can make allergies worse, warn researchers from McMaster University in Canada. Oral immunotherapy is clinically effective for some people, but it can increase the risk of anaphylaxis for many others over time. Children who have a peanut allergy have a distinct dysfunction with their immune system. Instead of properly […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/10/Peanuts-Nuts-Food.jpg", "article:published_time": "10/05/2019 08:46:56", "article:post_id": "15249"}, "tags": ["badfood", "child illness", "food allergy", "anaphalaxis", "badhealth", "allergies", "food allergies", "immunotherapy", "sensitization", "toxic ingredients", "desensitization", "peanut oil", "peanut allergies", "immune system altering", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-6959421/Do-NOT-peanuts-children-cure-allergy-study-warns.html", "https://www.brighteon.tv", "https://www.itv.com/news/2019-04-25/peanut-allergy-can-be-made-worse-by-desensitising-approach-study-suggests/", "https://childrenshealthdefense.org/store/excerpt/the-peanut-allergy-epidemic-whats-causing-it-and-how-to-stop-it-excerpt/", "http://vaccines.news", "http://Allergies.news", "https://www.dailymail.co.uk/health/article-6959421/Do-NOT-peanuts-children-cure-allergy-study-warns.html", "https://www.itv.com/news/2019-04-25/peanut-allergy-can-be-made-worse-by-desensitising-approach-study-suggests/", "https://childrenshealthdefense.org/store/excerpt/the-peanut-allergy-epidemic-whats-causing-it-and-how-to-stop-it-excerpt/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-10-05-desensitize-children-peanuts-can-make-allergies-worse.html&linkname=Trying%20to%20desensitize%20children%20to%20peanuts%20can%20make%20allergies%20WORSE%2C%20warn%20researchers", "https://www.addtoany.com/share"], "authors": [], "publish_date": "10/05/2019 08:46:56"}