{"result_id": "118033", "URL": "https://food.news/2019-03-10-milk-depleting-calcium-from-your-bones.html", "timestamp": "2023-04-25 15:08:01 CEST+0200", "meta": {"description": "Nothing is worse than the mass media brainwashing consumers with product slogans that deliver the exact opposite of the truth. Here in the independent media, we’ve already debunked some of the worst health myths ever propagated and perpetuated by Big Food and Big Pharma, including the “heart healthy canola” fraud and the “vaccines are safe […]", "lang": "en", "keywords": "bad milk,badfood,badhealth,body pH,bone fractures,CAFO,cafo milk,calcium,dairy industry,dairy lies,dairy myth,disease causes,hip fractures,milk bad bones,milk myth,misinformation,osteoporosis", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://food.news/2019-03-10-milk-depleting-calcium-from-your-bones.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "Is processed milk DEPLETING the calcium from your bones?", "cleaned_text": "Is processed milk DEPLETING the calcium from your bones?\n\nNothing is worse than the mass media brainwashing consumers with product slogans that deliver the exact opposite of the truth. Here in the independent media, we’ve already debunked some of the worst health myths ever propagated and perpetuated by Big Food and Big Pharma, including the “heart healthy canola” fraud and the “vaccines are safe and effective” poor health Ponzi scheme. Now it’s time to deconstruct the “Milk – it builds strong bones” myth and outright propaganda.\n\nNo animal on planet Earth, besides humans who have been conned into it, drink milk past infancy or from another species of animal. It’s just an American cultural faux pas. Drinking milk is a blunder on society. Sucking down cow’s milk is a blight on your health. It causes excess mucus. It also causes inflammation – the fuse that ignites nearly every disease and disorder known to mankind.\n\nIt gets much worse, though, folks. Get ready for this. The average American kid sucks down over 100 quarts of cow’s milk every year and it DEPLETES calcium from their bones. The purported benefits were all imaginary, all these years.\n\nAre you confused? Don’t be embarrassed. You’ve been hoodwinked by one of the most lucrative and insidious industries on the planet – the DIC – the Dairy Industrial Complex. Sure, one cup of milk does actually contain about 300 mg of calcium, but the human body barely absorbs the kind that comes from cow’s milk, and especially when it’s pasteurized. What’s worse? Cow’s milk increases calcium loss from your bones. Oh the irony. It’s not very complicated either. Keep reading.\n\nTo be healthy, humans need their body pH to remain alkalized, but cow’s milk acidifies pH, so there’s the rub\n\nAll animal protein acidifies the body’s pH. The same calcium that our bodies need to neutralize the acidifying effect of milk gets pulled from our bones, does it’s job to try to balance our pH, then gets urinated out. Net result? A calcium deficit. Across this world, the countries that consume the least amounts of dairy have the lowest bone fracture statistics, and it’s not a coincidence.\n\nIn America, if you are diagnosed with osteoporosis, your medical doctor will tell you to drink MORE milk. But cow’s milk is for calves. It fattens them up by Nature’s design. It’s not meant for humans. Calves gain eight times their birth weight by the time they’re weaned off mama’s milk, and then they never take even a sip again. Neither does any other animal on Earth. They must just know better, huh? It’s instinctual. Their mother’s milk is designed for them, not other animals. Got a weight problem? Get off the milk. Get it?\n\nPlus, cow’s milk contains way too much protein for humans, nearly three times as much, which leads to metabolic imbalances. This eventually affects our bone health, increasing risk of fractures. This scientific fact obliterates the milk myth the dairy industry has used to brainwash Americans for decades. Studies of this nature outnumber the contradictory studies run by the dairy industry to perpetuate their myth and false legend. Still, the dairy industry will say milk is good for kids, but it’s not. The calcium theory they wield is systemically flawed.\n\nMountains of research prove milk is BAD for your bones\n\nConsumption of dairy products is directly associated with increased risk of hip fracture in the later years of life, according to a case-control study published in the American Journal of Epidemiology. Harvard nurses also ran a 12-year-long study on over 77,000 women ages 34 to 59 and found that dairy consumers broke more bones than those who rarely drank milk.\n\nToday’s dairy products are highly processed. Pasteurization and homogenization alter the product’s chemistry, deplete the nutrients, and cause many digestive issues, all while increasing the acidifying effects. Add in the horrors that most conventional cows are shot up with hormones (think rBGH and IGF-1 here) and antibiotics (think infections from living in their own feces here), and they’re forced to produce too much milk, thus suffer from udder infections, like in the short excerpt video below. Got pus? Milk, it does a body bad.\n\nTry hemp milk, cashew milk, or almond milk instead. The dairy industry wants to outlaw all of these products from using the word “milk” on the labels because so many Americans are brainwashed to look for that word to satisfy their flawed shopping experience. Don’t fall for it. Are you lactose intolerant? Your body is trying to tell you something. Listen to it. Tune into FoodSupply.news for more info about flawed milk and making better choices for your family and yourself.", "opengraph": {"title": "Is processed milk DEPLETING the calcium from your bones?", "type": "article", "url": "https://www.food.news/2019-03-10-milk-depleting-calcium-from-your-bones.html", "site_name": "Food News", "description": "Nothing is worse than the mass media brainwashing consumers with product slogans that deliver the exact opposite of the truth. Here in the independent media, we’ve already debunked some of the worst health myths ever propagated and perpetuated by Big Food and Big Pharma, including the “heart healthy canola” fraud and the “vaccines are safe […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/03/bone-loss-2.jpg", "article:published_time": "03/10/2019 22:44:48", "article:post_id": "11840"}, "tags": ["badfood", "milk bad bones", "CAFO", "osteoporosis", "calcium", "bone fractures", "badhealth", "cafo milk", "dairy lies", "hip fractures", "disease causes", "milk myth", "dairy industry", "body pH", "dairy myth", "bad milk", "misinformation"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/bGw08sW7SYc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/bGw08sW7SYc?feature=oembed"}], "links": ["https://www.brighteon.tv", "https://saveourbones.com/osteoporosis-milk-myth/", "https://www.naturalnews.com/2017-05-29-desperate-dairy-study-claims-drinking-more-milk-will-reduce-diabetes-hypertension.html", "https://iphysio.io/osteoporosis/", "https://www.naturalnews.com/2017-10-04-lactose-intolerant-top-7-root-causes-youve-probably-never-considered-about-why-you-have-dairy-allergies.html", "http://www.foodsupply.news/2019-02-25-the-dirty-truth-about-your-organic-milk-carton.html", "https://saveourbones.com/osteoporosis-milk-myth/", "https://iphysio.io/osteoporosis/", "http://www.foodsupply.news/2019-02-25-the-dirty-truth-about-your-organic-milk-carton.html", "https://www.naturalnews.com/2017-10-04-lactose-intolerant-top-7-root-causes-youve-probably-never-considered-about-why-you-have-dairy-allergies.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-03-10-milk-depleting-calcium-from-your-bones.html&linkname=Is%20processed%20milk%20DEPLETING%20the%20calcium%20from%20your%20bones%3F", "https://www.addtoany.com/share"], "authors": [], "publish_date": "03/10/2019 22:44:48"}