{"result_id": "118029", "URL": "https://www.food.news/2023-01-11-8-inventions-save-planet-earth-detrimental-health.html", "timestamp": "2023-04-25 15:07:59 CEST+0200", "meta": {"description": "For the biggest money laundering schemes on the planet to work, the rogue government and its agencies must convince the populace to support them; otherwise, the maximum amount of profits will not be realized. That means insidiously devising schemes that seem to save people from certain death, like preserving the normal temperatures on planet earth, […]", "lang": "en", "keywords": "badclimate,badhealth,badmedicine,badscience,Big Pharma,Climate,climate change,climate science,conspiracy,deception,environment,genocide,global warming,GMO animals,gmo meat,GMOs,green tyranny,Hoaxes,insanity,pandemic vaccines,pharma fraud,ponzi schemes,research,science deception,vaccine death,vaccines", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2023-01-11-8-inventions-save-planet-earth-detrimental-health.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Top 8 inventions and interventions to “save” planet Earth and the population that are most likely DETRIMENTAL to the environment and human health in the long run", "cleaned_text": "Top 8 inventions and interventions to “save” planet Earth and the population that are most likely DETRIMENTAL to the environment and human health in the long run\n\nFor the biggest money laundering schemes on the planet to work, the rogue government and its agencies must convince the populace to support them; otherwise, the maximum amount of profits will not be realized. That means insidiously devising schemes that seem to save people from certain death, like preserving the normal temperatures on planet earth, or preventing a virus from wiping out all of humanity, or saving everyone from starving to death when the ‘big drought’ and apocalyptic famine come. The irony comes as these life and planet “saving” schemes are more likely to accomplish the exact opposite, and wipe out life as we know it on this third rock from the sun.\n\nIn the mad, mad rush to “save” planet earth and all of its inhabitants, the rogue governments of the world are destroying the environment and the health of humans\n\nWhether they are insidious schemes to rob people of their hard-earned money, or to depopulate the planet for more big government control, most of the big plans for ‘sustainability’ are really just money-laundering plots and Ponzi schemes that wreck agriculture, the economy, health, wealth, and the atmosphere we need to survive.\n\nThe majority of Americans eat processed and genetically modified food daily, and some for every meal and snack. Now, many are eating genetically modified meat and fake meat, and soon, genetically modified farm animals, thanks to Bill Gates. Gates pretends he is trying to save the planet from starvation, but he’s really (funding) mutating food in ways with unforeseeable health and environmental consequences.\n\nOne of the latest “climate change” or “global warming” scams and schemes is to literally block the sun’s rays from reaching earth, by spraying contaminants, heavy metals, and other toxins into the atmosphere in order to cool us down some, so all the humans won’t burst into flames in the next decade. Sure. This is just more population control in effect and another dangerous scheme by rich globalists who love power, money, and murdering humans in that fake, philanthropic way.\n\nHere are the top 8 inventions and interventions to “save” planet earth and the population that are most likely destroying everything and everyone\n\n#1. Electric cars (the fueling stations use fossil fuels, and the costs are outrageous, like $20,000 for a new battery)\n\n#6. Chemtrails to block the sun and “cool” the earth\n\nThe most insidious “medication” and undercover genocidal, biological weapon of mass destruction is the Covid “vaccine” deployment by Pfizer and Moderna, among others. In the same way IG Farben was used by Hitler to create chemical weapons for extinguishing Jews, Blacks, and the disabled during WWII, now the kingpins of the pharma cartels are using the scamdemic to scare the majority of humans into being injected with billions of spike proteins that cause sudden death syndrome, heart attacks, vascular clots, organ failure, infertility, and spontaneous abortion. Who can’t see this happening right before their eyes?\n\nNext, Bill Gates and the Chinese Communist Party, responsible for creating and funding the entire Covid pandemic, is funding genetically modified mosquitoes that will deliver vaccines to entire regions of people. Will these be mRNA jab-bites that change our human cells to create prions that cause us all to die suddenly from “unexplainable causes” or some new “gain of function” virus? Only time will tell.\n\nTune your internet dial to NaturalMedicine.news for more tips on how to use natural remedies for preventative medicine and for healing, instead of succumbing to Big Pharma for toxic injections and experimental prescription medications that exacerbate disease and disorder.", "opengraph": {"title": "Top 8 inventions and interventions to “save” planet Earth and the population that are most likely DETRIMENTAL to the environment and human health in the long run", "type": "article", "url": "https://www.food.news/2023-01-11-8-inventions-save-planet-earth-detrimental-health.html", "site_name": "Food News", "description": "For the biggest money laundering schemes on the planet to work, the rogue government and its agencies must convince the populace to support them; otherwise, the maximum amount of profits will not be realized. That means insidiously devising schemes that seem to save people from certain death, like preserving the normal temperatures on planet earth, […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2023/01/climate.png", "article:published_time": "01/11/2023 06:42:09", "article:post_id": "22680"}, "tags": ["conspiracy", "GMOs", "climate change", "Big Pharma", "pharma fraud", "ponzi schemes", "badhealth", "deception", "climate science", "Climate", "science deception", "pandemic vaccines", "environment", "global warming", "Hoaxes", "GMO animals", "badclimate", "insanity", "gmo meat", "research", "vaccine death", "genocide", "badmedicine", "vaccines", "green tyranny", "badscience"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://www.brighteon.tv", "https://naturalnews.com/2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html", "https://naturalnews.com/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "https://naturalnews.com/2016-09-27-climate-change-activist-movement-nothing-more-than-rebranded-1970s-myth.html", "https://www.naturalmedicine.news/2022-08-16-how-to-use-jimsonweed-for-natural-healing.html", "https://www.naturalnews.com/2022-09-30-which-kills-more-humans-opioids-guns-vaccines.html", "https://www.naturalmedicine.news/2022-08-16-how-to-use-jimsonweed-for-natural-healing.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2023-01-11-8-inventions-save-planet-earth-detrimental-health.html&linkname=Top%208%20inventions%20and%20interventions%20to%20%E2%80%9Csave%E2%80%9D%20planet%20Earth%20and%20the%20population%20that%20are%20most%20likely%20DETRIMENTAL%20to%20the%20environment%20and%20human%20health%20in%20the%20long%20run", "https://www.addtoany.com/share"], "authors": [], "publish_date": "01/11/2023 06:42:09"}