{"result_id": "118020", "URL": "http://www.food.news/2019-03-12-research-shows-that-berries-offer-the-best-ways-of-preventing-cancer.html", "timestamp": "2023-04-25 15:07:53 CEST+0200", "meta": {"description": "Berries are a delicious and nutritious addition to any meal or beverage. Several studies suggest that these antioxidant-rich fruits also possess potent cancer-fighting properties. The science-backed benefits of berries According to scientific research, berries are rich in powerful antioxidants that protect cells from the damage that may cause cancer. Berries have positive effects on genes linked with inflammation in the […]", "lang": "en", "keywords": "anti-cancer,antioxidants,berries,black raspberries,blackberries,Blueberries,cancer prevention,cancer risk,cancer risk factors,cancer risk reduction,colon cancer,Cranberries,diet,goodcancer,goodfood,goodhealth,goodmedicine,healing foods,Health and Wellness,inflammation,men's health,nutrition,red raspberries,Strawberries,superfoods,women's health", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "http://www.food.news/2019-03-12-research-shows-that-berries-offer-the-best-ways-of-preventing-cancer.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Research shows that berries are one of the best ways to prevent cancer", "cleaned_text": "Research shows that berries are one of the best ways to prevent cancer\n\nBerries are a delicious and nutritious addition to any meal or beverage. Several studies suggest that these antioxidant-rich fruits also possess potent cancer-fighting properties.\n\nAccording to scientific research, berries are rich in powerful antioxidants that protect cells from the damage that may cause cancer. Berries have positive effects on genes linked with inflammation in the body. In fact, berries can help reduce inflammation and prevent the growth and spread of cancer.\n\nFor over two decades, Dr. Gary Stoner from the Medical College of Wisconsin studied the various ways that berries help prevent cancer. Over the course of his studies, Dr. Stoner found that a diet of freeze-dried strawberries or black raspberries helped inhibit esophageal cancer by at least 70 percent.\n\nDr. Stoner also noted that berries inhibited colon cancer in the subjects by about 80 percent. Meanwhile, human patients diagnosed at higher risk for colon cancer experienced a 36 percent regression of rectal polyps after consuming black raspberry powder for nine months. (Related: Prevent cancer with proper diet: Compounds in turmeric, red grapes, berries, and apple peels found to shrink prostate tumors.)\n\nThe study findings also showed that black raspberries and blueberries helped reduce breast tumor volume in rats by at least 70 percent after being consumed for six months.\n\nIn a separate study, which was published in the Journal of Agricultural and Food Chemistry, researchers verified that the following berries had anti-cancer benefits:\n\nThe researchers noted that these berries helped inhibit cancer growth and stimulate cancer cell apoptosis in vitro.\n\nApoptosis is defined as a form of cell death where a programmed sequence of events results in the elimination of cells without releasing harmful substances into the surrounding area. Apoptosis has an important role in developing and maintaining the health of the body because it helps eliminate old cells, unnecessary cells, and unhealthy cells.\n\nThe researchers added that “the stronger the berry extract, the more potent it seemed to be in preventing cancer.”\n\nExperts believe that berries help prevent cancer because they contain potent phytochemicals called polyphenols. The two most active types of polyphenols are ellagitannins, a source of ellagic acid, and anthocyanins, the flavonoids that give berries their bright color.\n\nExperts believe that the ellagic acid in berries such as blackberries, cranberries, and strawberries can inhibit estrogen production, and cut off the “fuel supply” of the tumor. Additionally, ellagic acid can help prevent bladder, breast, esophagus, lung, and skin cancer.\n\nBerries are also rich in fiber, manganese, and vitamin C. Various berries are also full of beneficial phenols like ferulic acid and quercetin.\n\nTips for adding berries to your regular diet\n\nWhen buying berries, select organic fruits to ensure that they are free from pesticides and toxins. Organic fresh or frozen unsweetened berries also have more potent cancer-fighting abilities because they possess a higher concentration of key nutrients.\n\nBerries are a healthier alternative to a sugary dessert that has many artificial ingredients and preservatives. You can eat one or several types of berries as a simple snack or dessert, especially if you’re craving something sweet.\n\nMake a nutritious breakfast by adding berries and chopped nuts to a serving of cottage cheese, Greek yogurt, or ricotta cheese. Another option is to add berries to salads and other sweet or savory dishes.\n\nResearchers suggest consuming at least four to five servings of different types of berries every week to lower your risk of developing cancer. Studies have determined that consuming only two ounces of berries every day can naturally expel toxins and slow cancer cell growth.", "opengraph": {"title": "Research shows that berries are one of the best ways to prevent cancer", "type": "article", "url": "https://www.food.news/2019-03-12-research-shows-that-berries-offer-the-best-ways-of-preventing-cancer.html", "site_name": "Food News", "description": "Berries are a delicious and nutritious addition to any meal or beverage. Several studies suggest that these antioxidant-rich fruits also possess potent cancer-fighting properties. The science-backed benefits of berries According to scientific research, berries are rich in powerful antioxidants that protect cells from the damage that may cause cancer. Berries have positive effects on genes linked with inflammation in the […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/03/Fruits-Berries-Strawberries-Blueberries-Raspberries.jpg", "article:published_time": "03/12/2019 04:04:30", "article:post_id": "11880"}, "tags": ["black raspberries", "antioxidants", "healing foods", "cancer risk reduction", "diet", "nutrition", "superfoods", "women's health", "berries", "Strawberries", "goodhealth", "cancer risk", "goodmedicine", "Cranberries", "cancer risk factors", "anti-cancer", "blackberries", "men's health", "goodfood", "cancer prevention", "colon cancer", "goodcancer", "Blueberries", "inflammation", "Health and Wellness", "red raspberries"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/berries-prevent-cancer-1777.html", "https://www.brighteon.tv", "https://www.mcw.edu/", "https://www.naturalnews.com/2019-02-18-turmeric-red-grapes-berries-apple-peels-shrink-prostate-tumors.html", "https://www.naturalpedia.com/breast-cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalpedia.com/blackberries-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.naturalpedia.com/blueberries-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.medicinenet.com/script/main/art.asp?articlekey=11287", "https://www.naturalpedia.com/cranberries-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://www.healthline.com/health/ellagic-acid#food-sources", "https://www.healthline.com/nutrition/11-reasons-to-eat-berries#section11", "https://www.naturalpedia.com/yogurt-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "http://Cancer.news", "https://www.naturalhealth365.com/berries-prevent-cancer-1777.html", "https://www.medicinenet.com/script/main/art.asp?articlekey=11287", "https://www.healthline.com/health/ellagic-acid#food-sources", "https://www.healthline.com/nutrition/11-reasons-to-eat-berries#section11", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-03-12-research-shows-that-berries-offer-the-best-ways-of-preventing-cancer.html&linkname=Research%20shows%20that%20berries%20are%20one%20of%20the%20best%20ways%20to%20prevent%20cancer", "https://www.addtoany.com/share"], "authors": [], "publish_date": "03/12/2019 04:04:30"}