{"result_id": "118010", "URL": "http://food.news/2019-03-14-go-nuts-with-the-cancer-protective-properties-of-walnuts.html", "timestamp": "2023-04-25 15:07:47 CEST+0200", "meta": {"description": "Walnuts are one of the most popular nuts consumed because of their health benefits. These are packed with bioactive compounds such as polyunsaturated fatty acids (PUFAs), polyphenols, and dietary fiber. In addition, they can help cut your risk of developing colon cancer – making it a great addition to your diet. While walnuts are usually […]", "lang": "en", "keywords": "anti-cancer,anticancer,cancer cures,cancer prevention,cancer solutions,cancer treatment,colon cancer,food cures,food is medicine,food science,functional food,goodcancer,goodfood,goodhealth,goodscience,prevention,research,roasted walnuts,roasting,superfoods,Walnuts", "favicon": "wp-content/themes/ScienceTheme/images/Food-fav.png", "canonical": "http://food.news/2019-03-14-go-nuts-with-the-cancer-protective-properties-of-walnuts.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "Go nuts with the cancer-protective properties of walnuts", "cleaned_text": "Go nuts with the cancer-protective properties of walnuts\n\nWalnuts are one of the most popular nuts consumed because of their health benefits. These are packed with bioactive compounds such as polyunsaturated fatty acids (PUFAs), polyphenols, and dietary fiber. In addition, they can help cut your risk of developing colon cancer – making it a great addition to your diet. While walnuts are usually eaten raw or roasted, heat treatments may change the chemical composition of the food. However, a study reveals that roasted walnuts — a popular treat for a lot of people — still have their powerful anticancer properties.\n\nCan roasting affect the health benefits of walnuts?\n\nFor the study, a team of researchers at Friedrich Schiller University Jena in Germany conducted a lab trial to determine whether the roasting process would affect the anticancer effects of walnuts. The research team subjected raw and roasted walnuts to in vitro digestion and fermentation.\n\nAfter treating colon adenoma cells with walnuts, they examined the expression of catalase, superoxide dismutase 2, glutathione peroxidase 1, glutathione S-transferase P1 (GPx1), glutathione S-transferase T2 (GSTT2) genes. They also examined cell growth and apoptosis, or programmed cell death.\n\nThe results revealed that walnuts increased mRNA levels of catalase and GSTT2 — which are involved in detoxification — and significantly decreased GPx1 levels. These also inhibited the growth of colon adenoma cells in a time- and dose-dependent manner. In addition, higher concentrations of walnut treatment greatly increased the number of early apoptotic cells and induced caspase-3 activity.\n\nThe power of the elements: Discover Colloidal Silver Mouthwash with quality, natural ingredients like Sangre de Drago sap, black walnut hulls, menthol crystals and more. Zero artificial sweeteners, colors or alcohol. Learn more at the Health Ranger Store and help support this news site.\n\nThese results, which were published in the journal Nutrition Research, indicated that walnuts reduce the risk of colon cancer by inducing expression of genes involved in detoxification and by causing growth inhibition and apoptosis in colon adenoma cells. From these findings, the research team concluded that the roasting process did not have a direct effect on the chemical composition and anticancer properties of walnuts as the treatment with walnuts still exhibited anticancer effects against colon cancer development. (Related: Walnuts inhibit cancer development, slow its growth, and kill cancer cells.)\n\nMore reasons to include walnuts to your diet\n\nThese wrinkly, round nuts that grow from the walnut tree are more than just cancer-fighting foods. Here are the other health benefits walnuts offer.\n• They boost your mood. Walnuts contain omega-3 fatty acids which contribute to the development and function of the central nervous system. Many studies have shown that these healthy fats could also help in certain mood disorders.\n• They are good for the heart. A study published in the Journal of Nutrition has shown that eating walnuts may cut the risk of cardiovascular disease. In addition, walnut oil provides more favorable benefits to endothelial function – the lining of the inside of the blood and lymphatic vessels. Eating nuts, including walnuts, more than four times a week cuts the risk of coronary heart disease by up to 37 percent, according to a study published in the British Journal of Nutrition. Other studies have also reported that whole walnuts can improve cholesterol levels and markers for inflammation – all of which play a role in the prevention of heart disease.\n• They aid in weight loss. Walnuts are a great snack alternative for people who are trying to manage their weight because they do not cause weight gain even though they are rich in energy.\n• They improve digestion. Evidence has also shown that walnut consumption can improve gut microbiome and increase the population of beneficial bacterial strains in the gut. Having a healthy gut may also help protect you against diseases.\n• They strengthen the bones. Walnuts are also a good source of copper, manganese, and magnesium — all of which contribute to bone health. Getting adequate amounts of these minerals helps prevent osteoporosis. On the other hand, a deficiency of these minerals may be linked to a lower bone mineral density and a greater osteoporosis risk.\n\nRead more news stories and studies on preventing cancer with foods by going to PreventCancer.news.", "opengraph": {"title": "Go nuts with the cancer-protective properties of walnuts", "type": "article", "url": "https://www.food.news/2019-03-14-go-nuts-with-the-cancer-protective-properties-of-walnuts.html", "site_name": "Food News", "description": "Walnuts are one of the most popular nuts consumed because of their health benefits. These are packed with bioactive compounds such as polyunsaturated fatty acids (PUFAs), polyphenols, and dietary fiber. In addition, they can help cut your risk of developing colon cancer – making it a great addition to your diet. While walnuts are usually […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/03/Walnuts-Nuts-Health-Snack-Food-Raw.jpg"}, "tags": ["food is medicine", "colon cancer", "food science", "cancer cures", "prevention", "research", "cancer treatment", "food cures", "functional food", "anticancer", "roasted walnuts", "roasting", "Walnuts"], "tweets": [], "movies": [], "links": ["https://science.news/2019-03-12-roasted-walnuts-reduce-the-risk-of-colon-cancer.html", "https://www.uni-jena.de/", "https://naturalpedia.com/walnuts-sources-health-benefits-nutrients-uses-and-constituents-at-naturalpedia-com.html", "https://colloidalsilvermouthwash.healthrangerstore.com/colloidal-silver-mouthwash.html", "https://naturalpedia.com/colon-cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.naturalnews.com/052925_walnuts_cancer_cells_prevention.html", "https://www.bbcgoodfood.com/howto/guide/health-benefits-walnuts", "https://naturalpedia.com/cardiovascular-disease-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.medicalnewstoday.com/articles/309834.php", "http://preventcancer.news/", "https://science.news/2019-03-12-roasted-walnuts-reduce-the-risk-of-colon-cancer.html", "https://www.bbcgoodfood.com/howto/guide/health-benefits-walnuts", "https://www.medicalnewstoday.com/articles/309834.php", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-03-14-go-nuts-with-the-cancer-protective-properties-of-walnuts.html&linkname=Go%20nuts%20with%20the%20cancer-protective%20properties%20of%20walnuts", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}