{"result_id": "118013", "URL": "https://www.food.news/2023-04-11-china-vaccinates-mice-covid-mrna-cow-milk.html", "timestamp": "2023-04-25 15:07:49 CEST+0200", "meta": {"description": "The genocidal maniacs at the top of the food chain have developed a new way to mass-“vaccinate” the public for the Wuhan coronavirus (Covid-19) without people even knowing about it. It involves lacing milk with mRNA, which upon ingestion gets digested and assimilated into the bloodstream and lymphatic tissue. Our friends over in communist China […]", "lang": "en", "keywords": "badfood,badhealth,badmedicine,badscience,biotech,China,communist China,conspiracy,COVID,food supply,health freedom,Medical Tyranny,medical violence,mice,mRNA,research,toxic ingredients,vaccination,vaccine,vaccine wars", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2023-04-11-china-vaccinates-mice-covid-mrna-cow-milk.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "China successfully “vaccinates” mice for covid by feeding them mRNA-tainted cow’s milk", "cleaned_text": "China successfully “vaccinates” mice for covid by feeding them mRNA-tainted cow’s milk\n\nThe genocidal maniacs at the top of the food chain have developed a new way to mass-“vaccinate” the public for the Wuhan coronavirus (Covid-19) without people even knowing about it.\n\nIt involves lacing milk with mRNA, which upon ingestion gets digested and assimilated into the bloodstream and lymphatic tissue.\n\nOur friends over in communist China came up with the scheme, which involves “inoculating” bovines in such a way that mRNA chemicals get churned into their milk. They tested it out on mice already, and it appears to have been a success.\n\n“Zhang and colleagues have demonstrated that a shortened mRNA code of 675 base pairs could be loaded into phospholipid packets called exosomes derived from milk and then using that same milk, be fed to mice,” explains Dr. Peter McCullough, MD, MPH, in one of his latest Substack newsletters.\n\n“The mice gastrointestinal tract absorbed the exosomes and the mRNA must have made it into the blood stream and lymphatic tissue because antibodies were produced in fed mice against SARS-CoV-2 Spike protein (receptor binding domain).”\n\nUnless you want to consume covid “vaccines,” you’d better start only buying organic, pastured-raised meat and dairy products\n\nThe researchers who undertook this endeavor declared it a “success” in that it worked successfully to “vaccinate” the rodents. But is this actually a good thing?\n\nSeeing as how millions of people have been injured or killed by direct injection of mRNA poisons, the prospect of billions more consuming mRNA-tainted milk from conventional cows stands to add even more carnage to the statistics.\n\nThe official figures suggest that one in four Americans remains unvaccinated for covid. Adding mRNA to the food supply via conventional cow’s milk is one way the powers that be aim to reduce the percentage of unvaccinated people both in the United States and around the world.\n\n“This group would have strong objections to mRNA in the food supply, particularly if it was done surreptitiously or with minimal labelling / warnings,” McCullough writes about the un-jabbed. “Children could be targeted with easily administered oral vaccine dosing or potentially get mRNA through milk at school lunches and other unsupervised meals.”\n\n“For those who have taken one of the COVID-19 vaccines, having milk vaccines as an EUA offering would allow even more loading of the body with synthetic mRNA which has been proven resistant to ribonucleases and may reside permanently in the human body.”\n\nThe fact that such technology now exists and works as intended, it is safe to assume that mRNA poisons are already in the conventional food supply. As usual, communist China is at the forefront of this new forced vaccination campaign, which just like with GMOs (genetically modified organisms) will be hidden and unknown to the average person.\n\n“All the more reason to support your local farmer,” one commenter wrote about these horrific developments. “Know where your food comes from and what’s in it.”\n\n“I hear they have to comply with the FDA in order to have their meat slaughtered,” worried someone else.\n\n“Geez. This is the stuff of horror films but it’s actually true,” lamented another about how it is just one nightmare after another with all this nonstop covid madness.\n\n“This is incredibly insidious,” said another. “Food as a bioweapon. There’s no end to it. I’m already vax-injured and I’m going to change my screen name to Scared S***less. But maybe I should be glad I’m 72 already.”\n\nThe latest news about the mRNA contamination of the food supply can be found at FrankenFood.news.", "opengraph": {"title": "China successfully “vaccinates” mice for covid by feeding them mRNA-tainted cow’s milk", "type": "article", "url": "https://www.food.news/2023-04-11-china-vaccinates-mice-covid-mrna-cow-milk.html", "site_name": "Food News", "description": "The genocidal maniacs at the top of the food chain have developed a new way to mass-“vaccinate” the public for the Wuhan coronavirus (Covid-19) without people even knowing about it. It involves lacing milk with mRNA, which upon ingestion gets digested and assimilated into the bloodstream and lymphatic tissue. Our friends over in communist China […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2023/04/milk.png", "article:published_time": "04/11/2023 08:58:15", "article:post_id": "23324"}, "tags": ["badfood", "conspiracy", "badhealth", "COVID", "medical violence", "China", "vaccination", "communist China", "vaccine", "biotech", "mice", "vaccine wars", "toxic ingredients", "Medical Tyranny", "research", "badmedicine", "food supply", "health freedom", "badscience", "mRNA"], "tweets": [], "movies": [], "links": ["https://petermcculloughmd.substack.com/p/chinese-load-cows-milk-with-mrna", "https://www.biorxiv.org/content/10.1101/2022.12.19.517879v1.full", "https://www.brighteon.tv", "https://www.naturalnews.com/2023-04-09-mit-rna-vaccines-absorbed-stomach-intestines-meat-animals.html", "http://vaccineinjurynews.com", "http://FrankenFood.news", "https://petermcculloughmd.substack.com/p/chinese-load-cows-milk-with-mrna", "https://www.biorxiv.org/content/10.1101/2022.12.19.517879v1.full", "https://www.naturalnews.com/2023-04-09-mit-rna-vaccines-absorbed-stomach-intestines-meat-animals.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2023-04-11-china-vaccinates-mice-covid-mrna-cow-milk.html&linkname=China%20successfully%20%E2%80%9Cvaccinates%E2%80%9D%20mice%20for%20covid%20by%20feeding%20them%20mRNA-tainted%20cow%E2%80%99s%20milk", "https://www.addtoany.com/share"], "authors": [], "publish_date": "04/11/2023 08:58:15"}