{"result_id": "118031", "URL": "http://food.news/2019-01-02-curcumin-protects-heart-from-damage-by-diabetes-and-smoking.html", "timestamp": "2023-04-25 15:08:00 CEST+0200", "meta": {"description": "Both diabetes and cigarette smoking can increase the risk of cardiovascular disease because they increase oxidative stress in the body. To protect your heart from damage caused by diabetes and smoking, take curcumin supplements. A study published in the African Journal of Traditional, Complementary and Alternative Medicines found that curcumin protects the heart from the […]", "lang": "en", "keywords": "alternative medicine,antioxidants,cardiovascular disease,curcumin,diabetes,goodhealth,goodmedicine,heart disease,heart health,herbal medicine,Herbs,natural cures,natural medicine,nicotine,remedies,smoking,stop smoking,turmeric", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "http://food.news/2019-01-02-curcumin-protects-heart-from-damage-by-diabetes-and-smoking.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "A powerful antioxidant: Curcumin protects your heart from damage caused by diabetes and smoking", "cleaned_text": "A powerful antioxidant: Curcumin protects your heart from damage caused by diabetes and smoking\n\nBoth diabetes and cigarette smoking can increase the risk of cardiovascular disease because they increase oxidative stress in the body. To protect your heart from damage caused by diabetes and smoking, take curcumin supplements. A study published in the African Journal of Traditional, Complementary and Alternative Medicines found that curcumin protects the heart from the combined oxidative stress induced by diabetes and nicotine.\n\nIn the study, researchers from King Saud University in Saudi Arabia assessed the ability of curcumin to ameliorate the combined oxidative stress induced by diabetes and smoking which can cause diabetic cardiomyopathy. Diabetes and cigarette smoking, which both cause oxidative stress, are primary factors that cause cardiovascular diseases. Curcumin is known to have protective effects against hyperglycemia-induced oxidative stress.\n\nFor the study, the researchers administered nicotine to diabetic rats to determine the effect of the combined oxidative stress of diabetes and nicotine. They also administered curcumin to assess its protective effect on possible oxidative stress induced by diabetes and nicotine.\n\nThe results of the study revealed that the administration of nicotine to diabetic rats increased the oxidative stress on the heart muscles by increasing reactive oxygen species production, nitric oxide production, and upregulation of heart tissue inducible nitric oxide synthase (iNOS) and endothelin-1 mRNA expressions. It also increased triglycerides and low-density lipoprotein (LDL) cholesterol and reduced high-density lipoprotein (HDL) cholesterol.\n\nMoreover, the oxidative stress induced by diabetes and nicotine reduced the protective mechanism of the cardiac muscle. These combined oxidative stresses were seen by the increase of the main cardiac biomarkers troponin I and creatine kinase (CK-MB).\n\nHowever, when curcumin was administered, it inhibited the diabetic and nicotine-induced oxidative stress, which was seen by the normalization of the plasma cardiac marker troponin I and CK-MB. (Related: Another study finds turmeric and curcumin to be a safe, effective treatment for lowering cholesterol and protecting the heart.)\n\nBased on these findings, the researchers concluded that curcumin has a protective effect on heart tissues against the combined oxidative stress induced by diabetes and nicotine.\n\nOther ways curcumin keeps the heart healthy\n\nCurcumin can also keep the heart healthy and protect it from diseases by improving the function of the endothelium or blood vessel lining. According to Healthline, this improvement in the blood vessel lining can significantly reduce the risk of endothelial dysfunction, which is a primary risk factor of heart disease. It prevents the endothelium from regulating blood pressure and blood clotting properly. Many other studies have confirmed this beneficial effect of curcumin. One study even suggested that curcumin is as effective as exercise in this respect.\n\nAnother study suggested daily supplementation of curcumin can improve heart health by improving cholesterol levels and reducing inflammation. This, in turn, may prevent the onset of atherosclerosis, which is a disease in which plaque builds up inside the arteries.\n\nEffects of oxidative stress on the body\n\nOxidative stress is an imbalance between free radicals and antioxidants in your body. Free radicals react easily with other molecules and can cause oxidation in the body, which can either be beneficial or harmful. Antioxidants, on the other hand, causes free radicals to stabilize and become less reactive.\n\nWhen there is an imbalance between free radical activity and antioxidant activity, oxidative stress occurs. When there are more free radicals present than antioxidants, it can cause damage to fatty tissue, DNA, and proteins in the body. Eventually, this damage can lead to various diseases, including atherosclerosis, cancer, diabetes, inflammatory diseases, heart disease, and hypertension. Oxidative stress also contributes to aging.\n\nYou can fight oxidative stress by making healthy lifestyle choices, such as eating more antioxidant-rich foods, exercising regularly, stopping smoking, and getting enough sleep.\n\nRead more news stories and studies on powerful antioxidants like curcumin by going to Antioxidants.news.", "opengraph": {"title": "A powerful antioxidant: Curcumin protects your heart from damage caused by diabetes and smoking", "type": "article", "url": "https://www.food.news/2019-01-02-curcumin-protects-heart-from-damage-by-diabetes-and-smoking.html", "site_name": "Food News", "description": "Both diabetes and cigarette smoking can increase the risk of cardiovascular disease because they increase oxidative stress in the body. To protect your heart from damage caused by diabetes and smoking, take curcumin supplements. A study published in the African Journal of Traditional, Complementary and Alternative Medicines found that curcumin protects the heart from the […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/01/Tumeric-Turmeric-Curcumin-Background-Dry-Ginger-Golden.jpg", "article:published_time": "01/02/2019 06:31:26", "article:post_id": "9334"}, "tags": ["goodhealth", "smoking", "diabetes", "heart health", "nicotine", "alternative medicine", "stop smoking", "antioxidants", "goodmedicine", "turmeric", "natural medicine", "curcumin", "Herbs", "cardiovascular disease", "remedies", "heart disease", "natural cures", "herbal medicine"], "tweets": [], "movies": [], "links": ["https://science.news/2018-12-20-curcumin-protects-cardiac-tissue-from-combined-oxidative-stress-induced-by-diabetes-and-nicotine.html", "https://ksu.edu.sa/en/", "http://heart.news/", "https://www.brighteon.tv", "http://www.natural.news/2018-11-12-turmeric-and-curcumin-safe-effective-treatment-for-lowering-cholesterol.html", "https://www.healthline.com/nutrition/top-10-evidence-based-health-benefits-of-turmeric#section5", "https://www.nutraingredients-usa.com/Article/2014/09/26/Curcumin-shows-heart-health-benefits-by-multiple-mechanisms", "https://www.nutraingredients-usa.com/Article/2014/09/26/Curcumin-shows-heart-health-benefits-by-multiple-mechanisms", "http://antioxidants.news/", "https://science.news/2018-12-20-curcumin-protects-cardiac-tissue-from-combined-oxidative-stress-induced-by-diabetes-and-nicotine.html", "https://www.healthline.com/nutrition/top-10-evidence-based-health-benefits-of-turmeric#section5", "https://www.healthline.com/health/oxidative-stress", "https://www.nutraingredients-usa.com/Article/2014/09/26/Curcumin-shows-heart-health-benefits-by-multiple-mechanisms", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-01-02-curcumin-protects-heart-from-damage-by-diabetes-and-smoking.html&linkname=A%20powerful%20antioxidant%3A%20Curcumin%20protects%20your%20heart%20from%20damage%20caused%20by%20diabetes%20and%20smoking", "https://www.addtoany.com/share"], "authors": [], "publish_date": "01/02/2019 06:31:26"}