{"result_id": "118019", "URL": "https://www.food.news/2019-03-14-prebiotics-fight-rotovirus.html", "timestamp": "2023-04-25 15:07:52 CEST+0200", "meta": {"description": "Isn’t it strange that some pathogens are popularized and sensationalized while countless other pathogens that exhibit similar symptoms are left unadvertised? Many of the pathogens that we are told to fear (like rotavirus, measles, chickenpox and polio) really only manifest as benign infections in a healthy body. Infections can be prevented altogether or effectively overcome with […]", "lang": "en", "keywords": "breast milk,goodfood,goodhealth,goodmedicine,goodscience,immune system,microbiome,nutrition,oligosaccharides,prebiotics,rotavirus", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2019-03-14-prebiotics-fight-rotovirus.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Skip the risky vaccines: New study shows prebiotics fight rotovirus", "cleaned_text": "Isn’t it strange that some pathogens are popularized and sensationalized while countless other pathogens that exhibit similar symptoms are left unadvertised? Many of the pathogens that we are told to fear (like rotavirus, measles, chickenpox and polio) really only manifest as benign infections in a healthy body. Infections can be prevented altogether or effectively overcome with proper hydration, strong cellular energy, antioxidants, phyto-nutrients, and a healthy microbiome powered by prebiotics.\n\nThe diseases promoted in the media are the ones the pharmaceutical companies and the Centers for Disease Control (CDC) have selected and isolated to capitalize on and sell vaccines for. Isn’t it strange that “lifesaving vaccine science” is applied to only some over-hyped pathogens, while countless other pathogens that exhibit similar symptoms are left un-popularized?\n\nOut of the many pathogens that exist in our world, isn’t it strange that the U.S. Centers for Disease Control has singled out potentially benign rotavirus infections as an immediate cause for concern and now they recommend a three-dose vaccine regime for infants on their ever-growing vaccine schedule? Perhaps the co-inventor of the Rotavirus vaccine, Paul Offit, who also advises CDC policy, has found a way to make it look like he is saving lives (even as tens of thousands of testimonies of vaccine damage are submitted annually to the government by parents, caregivers, and doctors.)\n\nLike other similar infections that cause gastroenteritis, rotavirus is readily eliminated through the bowels and often elicits diarrhea. If the body must expel further, then necessary vomiting will occur. A necessary fever may also result as the body works to eliminate the pathogen. The symptoms may resemble an infection from a food-borne pathogen. If the infected host is not replenished with an adequate amount of water, dehydration can occur. Most remarkably, the prebiotic properties of oligosaccharides from human breast milk, honey and plant-based foods effectively fight rotavirus.\n\nRotavirus infections have become a big business opportunity for vaccine inventors like Paul Offit, who invented RotaTeq, a live-virus vaccine formula that promises protection but actually causes viral shedding and mutated rotavirus strains. In viral shedding, the virus replicates and spreads to others, through human saliva, waste or other excretions. Once the replicated virus is released in the environment and gets in the water supply, it is free to mutate and will pose worse health threats to people long-term, especially to immune-compromised persons. Paul Offit’s needless RotaTeq vaccine is recommended to infants in three doses, at two, four, and six months of age, long before the infant’s immune system has even formed to handle the pathogen, the adjuvant, and chemical cocktail that makes up the vaccines.\n\nWhile this vaccine invention bolsters Offit’s accolades and helps him steer vaccine policy at the CDC, he is misleading families on what’s most important for rotavirus prevention. Prebiotic foods, specifically oligosaccharides, provide real protection from all pathogens. Oligosaccharides feed the good bacteria in the intestines, bolstering the microbiome’s ability to rapidly respond to all infections. Oligosaccharides also have a direct “effect” on virus material, weakening it.\n\nScientists at the Baylor College of Medicine in Houston tested oligosaccharides from breast milk on two major strains of human rotavirus. “All oligosaccharides substantially reduced the infectivity of both human rotavirus strains in vitro,” wrote lead researcher Professor Sasirekha Ramani. The researcher explained that breastfed infants are automatically protected from rotavirus and believe that these oligosaccharides can be added to infant formula for infants who aren’t fed breast milk.\n\nThe oligosaccharides were applied in concentrations of 2.5 mg/ml and 5 mg/ml. The higher concentration was more effective. Even after infection, the specific oligosaccharide 2’FL was 62 percent effective in eliminating infectivity. A combination of two oligosaccharides were more effective (73 prcent) than by themselves for eliminating infectivity of a prominent rotavirus strain.\n\nParents who don’t want to burden their children’s bodies with toxic aluminum and formaldehyde-based vaccines or turn their child into a virus shedder, should understand that healthy breast milk and prebiotic-rich foods are most important for rotavirus prevention.", "opengraph": {"title": "Skip the risky vaccines: New study shows prebiotics fight rotovirus", "type": "article", "url": "https://www.food.news/2019-03-14-prebiotics-fight-rotovirus.html", "site_name": "Food News", "description": "Isn’t it strange that some pathogens are popularized and sensationalized while countless other pathogens that exhibit similar symptoms are left unadvertised? Many of the pathogens that we are told to fear (like rotavirus, measles, chickenpox and polio) really only manifest as benign infections in a healthy body. Infections can be prevented altogether or effectively overcome with […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2019/03/Virus-Attack-Human-Body-Sickness.jpg", "article:published_time": "03/14/2019 00:02:01", "article:post_id": "11977"}, "tags": ["rotavirus", "goodhealth", "microbiome", "nutrition", "goodmedicine", "goodscience", "prebiotics", "immune system", "breast milk", "oligosaccharides", "goodfood"], "tweets": [], "movies": [], "links": ["https://www.nutraingredients.com/Article/2017/09/20/Prebiotics-may-help-fight-rotavirus-Study?utm_source=copyright&utm_medium=OnSite&utm_campaign=copyright", "https://www.brighteon.tv", "http://paul-offit.com/about/", "https://www.naturalnews.com/2017-05-16-vaccines-are-harming-more-babies-each-day-than-gunshots.html", "https://medlineplus.gov/rotavirusinfections.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5047869/", "https://www.naturalnews.com/048925_virus_shedding_live_vaccines_measles.html", "https://www.nutraingredients.com/Article/2017/09/20/Prebiotics-may-help-fight-rotavirus-Study", "https://www.bcm.edu/", "http://vaccines.news", "https://www.nutraingredients.com/Article/2017/09/20/Prebiotics-may-help-fight-rotavirus-Study", "https://medlineplus.gov/rotavirusinfections.html", "https://www.naturalnews.com/2017-05-16-vaccines-are-harming-more-babies-each-day-than-gunshots.html", "https://www.naturalnews.com/048925_virus_shedding_live_vaccines_measles.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5047869/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2019-03-14-prebiotics-fight-rotovirus.html&linkname=Skip%20the%20risky%20vaccines%3A%20New%20study%20shows%20prebiotics%20fight%20rotovirus", "https://www.addtoany.com/share"], "authors": [], "publish_date": "03/14/2019 00:02:01"}