{"result_id": "118006", "URL": "https://food.news/2022-07-06-vitamin-c-essential-nutrient-for-good-overall-health.html", "timestamp": "2023-04-25 15:07:44 CEST+0200", "meta": {"description": "Vitamin C, medically known as ascorbic acid, is an essential water-soluble nutrient synthesized in plants. It was discovered by a Hungarian biochemist, Albert Szent-Gyorgyi, who was investigating a life-threatening disease called scurvy that was prevalent in sailors in the early 1930s. It was later found that vitamin C enables the body to efficiently use carbohydrates, […]", "lang": "en", "keywords": "aging secrets,anti-aging,antioxidant,ascorbic acid,brain health,digestive health,food science,goodfood,goodhealth,health science,heart health,immune system,mental health,natural health,nutrients,oral health,respiratory health,skin health,supplements,vitamin C", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://food.news/2022-07-06-vitamin-c-essential-nutrient-for-good-overall-health.html", "encoding": "UTF-8"}, "image": null, "domain": "food.news", "title": "Vitamin C: An essential nutrient for good overall health", "cleaned_text": "Vitamin C: An essential nutrient for good overall health\n\nVitamin C, medically known as ascorbic acid, is an essential water-soluble nutrient synthesized in plants. It was discovered by a Hungarian biochemist, Albert Szent-Gyorgyi, who was investigating a life-threatening disease called scurvy that was prevalent in sailors in the early 1930s.\n\nIt was later found that vitamin C enables the body to efficiently use carbohydrates, healthy fats and proteins by improving absorption.\n\nVitamin C supports the growth and health of bones, teeth, gums, ligaments and blood vessels because it acts as an antioxidant that chemically binds and neutralizes harmful free radicals. Vitamin C also plays a key role in the formation of collagen – the body’s major protein-builder – and is therefore essential to the proper functioning of all internal organs like your brain, heart, lungs, liver, bladder, kidneys, stomach and intestines.\n\nHere are some of vitamin C’s health benefits and the science behind them.\n\nAccording to a study published in the journal Nutrients, vitamin C contributes to immune defense by supporting various cellular functions of both the innate and adaptive immune systems. This essential micronutrient also supports the barrier function of epithelial cells that line the surfaces of your body against pathogens or infectious agents and promotes the oxidant scavenging activity of the skin.\n\nA study that appeared in the journal Frontiers in Aging Neuroscience showed that vitamin C is crucial to cognitive performance. It plays a role in the differentiation and maturation of nerve cells that are fundamental units of the brain and nervous system and in the formation of the insulating layer that forms around nerves, including those in the brain and spinal cord (myelin sheath), that protects neurons and speeds up impulse transmission.\n\nIn conclusion, there is a significant association between vitamin C concentrations and performance on tasks involving attention, focus, working memory, decision speed, delayed and total recall and recognition.\n\nA study that appeared in the journal International Journal of Molecular Sciences concluded that vitamin C plays a pivotal role in preventing the pathogenesis of cardiac and vascular disorders, including coronary heart disease, heart failure, hypertension and cerebrovascular diseases. Vitamin C’s importance lies in its antioxidant activity, which is crucial for protecting against oxidative stress and chronic inflammation. (Related: Vitamin C could reduce risk of stroke.)\n\nIn a study published in the American Journal of Respiratory and Critical Care Medicine, researchers from the University of Nottingham reported that vitamin C can help protect the lungs by reducing the risk of chronic obstructive pulmonary disease (COPD), an inflammatory lung disease.\n\nGetting insufficient amounts of vitamin C from your diet reduces your stomach’s production of hydrochloric acid, which is needed to digest and break down food. This may leave you with digestive issues like burping, farting and heartburn. You can improve your digestion by simply getting enough vitamin C.\n\nA study published in the journal Redox Biology associates poor vitamin C status with metabolic syndrome (MetS), a cluster of conditions that raises your cardiometabolic risk factors and endotoxemia, or the presence of endotoxins in the blood. If derived from gram-negative rod-shaped bacteria, these endotoxins may cause hemorrhages, necrosis of the kidneys and shock. Endotoxins are released when bacteria die, and dissociated endotoxins are able to cross the gastrointestinal barrier and enter your bloodstream.\n\nA study published in the journal Nutrients showed that vitamin C supports important functions, including stimulating collagen synthesis and assisting in antioxidant protection against UV-induced photodamage and other harmful stuff from the environment, including air pollution. Over time, the buildup of free radicals is greatly responsible for signs of premature aging, among others. (Related: A simple and natural facemask with vitamin C)\n\nA study that appeared in the Journal of the Canadian Dental Association showed that vitamin C’s role in maintaining the health of teeth and gums remains unchallenged. Current clinical evidence indicates that vitamin C helps improve host defense mechanisms and is important for preserving periodontal health.\n\nA study that appeared in the journal Antioxidants (Basel) associated high vitamin C status with elevated mood in a sample of 139 young adult male tertiary students aged 18 to 25 years.\n\nOne of the best-established functions of vitamin C is in the regulation of neurotransmitter biosynthesis, including that of catecholamines (hormones that the brain, nerve tissues and adrenal glands produce), which are responsible for your body’s “fight-or-flight” response.\n\nIf you’re looking to get vitamin C, eat organic and whole fruits with their accompanying fiber and pulp. They provide many key nutrients and antioxidants, including vitamin C. Vegetables such as broccoli, Brussel sprouts, cauliflower, spinach and other leafy greens are also rich sources of vitamin C.\n\nWatch the video below that talks about the benefits of vitamin C.\n\nThis video is from the Holistic Herbalist channel at Brighteon.com.\n\nVitamin C and the big “C.”", "opengraph": {"title": "Vitamin C: An essential nutrient for good overall health", "type": "article", "url": "https://www.food.news/2022-07-06-vitamin-c-essential-nutrient-for-good-overall-health.html", "site_name": "Food News", "description": "Vitamin C, medically known as ascorbic acid, is an essential water-soluble nutrient synthesized in plants. It was discovered by a Hungarian biochemist, Albert Szent-Gyorgyi, who was investigating a life-threatening disease called scurvy that was prevalent in sailors in the early 1930s. It was later found that vitamin C enables the body to efficiently use carbohydrates, […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2022/07/C-Vitamin-Food-Bowl-Cartoon-Cranberry-Diet.jpg", "article:published_time": "07/06/2022 06:37:56", "article:post_id": "21171"}, "tags": ["ascorbic acid", "supplements", "anti-aging", "mental health", "respiratory health", "oral health", "natural health", "brain health", "immune system", "goodhealth", "heart health", "nutrients", "skin health", "health science", "vitamin C", "antioxidant", "digestive health", "goodfood", "food science", "aging secrets"], "tweets": [], "movies": [], "links": ["https://www.acs.org/content/acs/en/education/whatischemistry/landmarks/szentgyorgyi.html#:~:text=Scurvy%20was%20among%20many%20diseases,the%20foundations%20of%20modern%20nutrition.", "http://nutrients.news", "https://www.brighteon.tv", "https://pubmed.ncbi.nlm.nih.gov/29099763/", "https://www.frontiersin.org/articles/10.3389/fnagi.2019.00072/full", "https://pubmed.ncbi.nlm.nih.gov/27529239/", "https://naturalnews.com/044118_vitamin_C_stroke_risk_healthy_immune_system.html", "https://www.nottingham.ac.uk/", "https://www.apollo247.com/blog/article/vitamin-c-essential-nutrient-good-lung-and-respiratory-health", "http://digestion.news", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6327911/#", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5579659/", "https://naturalnews.com/025342_vitamin_C_skin_natural.html", "https://pubmed.ncbi.nlm.nih.gov/2676112/", "https://www.mdpi.com/2076-3921/7/7/91", "http://brain.news", "https://www.healthline.com/nutrition/vitamin-c-foods", "https://www.brighteon.com/c0c18a5a-a899-489a-9d9e-cdb6da92979e", "https://www.brighteon.com/channels/holisticherbalist", "https://naturalnews.com/036068_vitamin_C_cancer_tumors.html", "https://naturalnews.com/047212_vitamin_C_oranges_homemade_supplements.html", "https://naturalnews.com/049146_vitamin_C_vaccines_natural_health.html", "https://www.acs.org/content/acs/en/education/whatischemistry/landmarks/szentgyorgyi.html#:~:text=Scurvy%20was%20among%20many%20diseases,the%20foundations%20of%20modern%20nutrition.", "https://pubmed.ncbi.nlm.nih.gov/29099763/", "https://www.frontiersin.org/articles/10.3389/fnagi.2019.00072/full", "https://pubmed.ncbi.nlm.nih.gov/27529239/", "https://www.apollo247.com/blog/article/vitamin-c-essential-nutrient-good-lung-and-respiratory-health", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6327911/#", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5579659/", "https://pubmed.ncbi.nlm.nih.gov/2676112/", "https://www.mdpi.com/2076-3921/7/7/91", "https://www.healthline.com/nutrition/vitamin-c-foods", "https://www.brighteon.com/c0c18a5a-a899-489a-9d9e-cdb6da92979e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2022-07-06-vitamin-c-essential-nutrient-for-good-overall-health.html&linkname=Vitamin%20C%3A%20An%20essential%20nutrient%20for%20good%20overall%20health", "https://www.addtoany.com/share"], "authors": [], "publish_date": "07/06/2022 06:37:56"}