{"result_id": "118002", "URL": "https://www.food.news/2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html", "timestamp": "2023-04-25 15:07:41 CEST+0200", "meta": {"description": "Bill Gates is now working with the World Economic Forum (WEF) in an initiative that impacts the food supply. Gates has an affinity for genetically modified organisms (GMOs) and Frankenfoods due to the money that can be made there. But it will be at the consumers’ expense. The Gates-funded Lab Meat and Lab Dairy lobby […]", "lang": "en", "keywords": "badfood,badhealth,badscience,bill gates,biotech,conspiracy,dangerous,fake meat,food science,food supply,genetic lunacy,globalists,GMO foods,grocery,processed food,products,world economic forum", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "Bill Gates, WEF promoting dangerous GMO foods and fake foods", "cleaned_text": "Bill Gates is now working with the World Economic Forum (WEF) in an initiative that impacts the food supply. Gates has an affinity for genetically modified organisms (GMOs) and Frankenfoods due to the money that can be made there. But it will be at the consumers’ expense.\n\nThe Gates-funded Lab Meat and Lab Dairy lobby are now gaining traction as more and more tycoons from Silicon Valley step up to back up this effort, resulting in real whole foods fading away, along with family farms and ranches that used to produce much of the food in the United States.\n\nThere is a big chance that Americans have been consuming unregulated and unlabeled GMOs for years and do not know it. Things like cream cheese, ice cream and snack bars often contain GMO additives and have no regulations regarding their GMO status because they fall outside the reach of agencies that should be regulating food production.\n\nEven GMO ingredients that have been included on the label are often printed using vague or misleading terms, which people don’t generally understand, such as “synthetic biology” or “fermentation technology.” (Related: Are you eating GMO foods without knowing it?)\n\nAs GMOs gain popularity, indigenous herders, rural villagers, ranchers, farmers and traditional communities suffer. With lab meats and dairy being bioengineered and marketed to the public, animal pasturing, holistic grazing and organic farming are becoming villainized.\n\nCompanies are pushing fake food as a superior replacement, saying it is completely plant-based, ethical, nutritious and safe. Some companies even say that their lab-created foods are not genetically engineered.\n\nBut synthetic bioengineered foods are not what these companies claim to be. They are not sustainable or plant-based. What’s even worse is that they are not tested for safety or labeled appropriately – meaning they are minimally regulated at best. (Related: Storable food FRAUD taking place nationwide as promoters falsely claim “non-GMO” status for GMO-derived foods.)\n\nThese foods also threaten the livelihood of producers of real food, such as ranchers and farmers. And there is increasing evidence that these foods have little to no nutritional value and are generally unsafe.\n\nThese are the foods that Bill Gates and his friends at the WEF want to cram down people’s throats while denying them whole foods that are safe and nutritious. Moreover, world governments are letting them get away with it by promoting their own narratives.\n\nThe Food and Drug Administration, for instance, claimed that GMOs were developed to help farmers prevent crop loss because GMO crops are resistant to insect damage, are tolerant to herbicides and are resistant to plant viruses.\n\nDangers of GMOs that Gates and his friends don’t want people to know about\n\nOf course, the FDA did not mention the dangers these GMOs pose to human health, such as allergic reactions that could be triggered in the presence of allergens and the possibility of GMO foods contributing to the development of cancer.\n\nThere are also concerns that GMOs could lead to antibacterial resistance due to specific genes of plants possibly entering humans or animals when eaten.\n\nRaised fears of GMOs altering the genes of humans are also valid, as fragments of DNA from food can and do enter the bloodstream and body organs.\n\nGMOs could also be dangerous to the environment. Environmental concerns associated with GMOs include the risk of outcrossing, where genes from GMO foods pass into wild plants and other crops.\n\nIt can also have a negative impact on insects and other species, and can reduce other plant types. The latter leads to a loss in biodiversity, which is important in maintaining the balance of the ecosystem.\n\nVisit FrankenFood.news for more on dangerous foods you should avoid.\n\nWatch the video below for more information about how Americans’ shortsighted thinking could dangerously bypass nature.\n\nThis video is from the channel The New American on Brighteon.com.\n\nOrganic, non-GMO agriculture and food prices can easily be made affordable… and it’s already being demonstrated in Peru.\n\nNYT “Learning to love GMOs” article is pure propaganda masquerading as journalism.\n\nUsual GMO suspects seize upon engineered Ukraine food crisis to demand more genetically engineered crops.", "opengraph": {"title": "Bill Gates, WEF promoting dangerous GMO foods and fake foods", "type": "article", "url": "https://www.food.news/2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html", "site_name": "Food News", "description": "Bill Gates is now working with the World Economic Forum (WEF) in an initiative that impacts the food supply. Gates has an affinity for genetically modified organisms (GMOs) and Frankenfoods due to the money that can be made there. But it will be at the consumers’ expense. The Gates-funded Lab Meat and Lab Dairy lobby […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2022/09/Gmo-No-Banner-Food-Genetically-Modified-Protest.jpg", "article:published_time": "09/22/2022 06:33:20", "article:post_id": "21953"}, "tags": ["fake meat", "badfood", "conspiracy", "food science", "world economic forum", "dangerous", "processed food", "globalists", "badhealth", "grocery", "products", "bill gates", "biotech", "food supply", "genetic lunacy", "badscience", "GMO foods"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/no-escape-bill-gates-wef-push-gmo-foods-end-food-as-we-know-it.html", "https://www.brighteon.tv", "https://naturalnews.com/2022-08-31-are-you-eating-gmo-foods-without-knowing.html", "http://gmo.news", "https://naturalnews.com/2020-08-18-storable-food-fraud-non-gmo-deception.html", "https://www.fda.gov/food/agricultural-biotechnology/how-gmo-crops-impact-our-world", "https://www.medicalnewstoday.com/articles/324576#how-do-you-make-a-gmo-food", "http://FrankenFood.news", "https://www.brighteon.com/36f942cd-104b-4f03-8966-40ce12a941d6", "https://www.brighteon.com/channels/thenewamerican", "https://naturalnews.com/054015_Peru_organic_food_affordable.html", "https://biotech.news/2021-08-02-nyt-love-gmos-propaganda.html", "https://food.news/2022-05-25-engineered-ukraine-food-crisis-gmo-crops.html", "https://www.naturalhealth365.com/no-escape-bill-gates-wef-push-gmo-foods-end-food-as-we-know-it.html", "https://www.fda.gov/food/agricultural-biotechnology/how-gmo-crops-impact-our-world", "https://www.medicalnewstoday.com/articles/324576#how-do-you-make-a-gmo-food", "https://www.brighteon.com/36f942cd-104b-4f03-8966-40ce12a941d6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html&linkname=Bill%20Gates%2C%20WEF%20promoting%20dangerous%20GMO%20foods%20and%20fake%20foods", "https://www.addtoany.com/share"], "authors": [], "publish_date": "09/22/2022 06:33:20"}