{"result_id": "118018", "URL": "https://www.food.news/2023-04-10-patriot-green-products-compost-tea-sprouting-demo.html", "timestamp": "2023-04-25 15:07:52 CEST+0200", "meta": {"description": "Have you ever thought about sprouting your own microgreens and herbs at home? The process may seem daunting, but it does not have to be. In the following episode of the Health Ranger Report, Mike Adams talks with Kevin Fretz of Patriot Green Products about the use of compost tea, which makes a great medium […]", "lang": "en", "keywords": "compost tea,crops,foodscience,goodfood,home gardening,Patriot Green Products,preparedness,sprouting,survival", "favicon": "wp-content/themes/FoodFresh/images/favicon.ico", "canonical": "https://www.food.news/2023-04-10-patriot-green-products-compost-tea-sprouting-demo.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "GROW FOOD OR STARVE: Watch as Kevin Fretz from Patriot Green Products conducts in-studio compost tea and sprouting demonstration with Mike Adams", "cleaned_text": "GROW FOOD OR STARVE: Watch as Kevin Fretz from Patriot Green Products conducts in-studio compost tea and sprouting demonstration with Mike Adams\n\nHave you ever thought about sprouting your own microgreens and herbs at home? The process may seem daunting, but it does not have to be.\n\nIn the following episode of the Health Ranger Report, Mike Adams talks with Kevin Fretz of Patriot Green Products about the use of compost tea, which makes a great medium for sprouting and growing healthy greens at home.\n\nWatch below as Fretz explains what the compost tea contains and how the process works. You will also get to see an in-studio demonstration with visual displays to show how easy it is to sprout and grow at home with this powerful medium.\n\nCompost is “black gold” for growing things – but only if it’s clean\n\nBased out of central Texas, Patriot Green Products makes its compost tea out of the charred remains of the Lost Pines fire that blew through the Bastrop area near Austin back in 2011.\n\nAs explained by Fretz, the materials gathered from those remains make for an excellent growing medium – be sure to watch the video above to hear more about why Fretz decided to create Patriot Green Products.\n\nRecognizing that compost is “black gold,” to quote the Health Ranger, Fretz, who used to work in the waste management industry, came up with the idea after coming to the realization that traditional waste products are highly contaminated and largely unsuitable for clean growing.\n\nUpon setting out to find an alternative, Fretz learned that the charred remains from wildfires like the one that blew through Texas back in 2011 are an ideal growing solution that is both clean and green.\n\n“I would call it wildcrafted compost,” Adams says during the segment about the high quality of the Patriot Green Products compost tea. “It’s not made from people’s backyard grass clippings that are sprayed with pesticides.”\n\nFretz further expanded on this by revealing what makes his Texas-based compost so special.\n\n“Particularly, the compost we have here in Texas is very special because it’s from the Lost Pines fire, which were pine trees that were removed many, many years ago, brought to Leander where they were processed into compost, and they also have biochar.”\n\nThough the company started out and is still a wholesale business that caters primarily to commercial companies and the government, Patriot Green Products has since expanded its product line to the consumer market.\n\nAs you have probably noticed, the world is on shaky ground. Supply chains are still wrecked from the Wuhan coronavirus (Covid-19), inflation is sky high, and many people are now wanting to grow their own food at home because they can see that the system we were all told to rely on is no longer reliable.\n\nAs such, many people want to grow food at home, and what better way to do that than with Patriot Green Products compost and biochar, which is loaded with the nutrients that plants crave.\n\n“We know that people want to grow food, and we want them to grow it clean,” Fretz said during the segment.\n\n“We have it available in super sacks, so they would come on a pallet – a one cubic yard super sack. This material has biochar blended in with it, and it also has beneficial microbes inoculated into it.”\n\nIf you are the type who does not mind getting your hands dirty and is interested in becoming more self-sufficient, this episode of the Health Ranger Report is one you will not want to miss.\n\nMore related news can be found at Survival.news.", "opengraph": {"title": "GROW FOOD OR STARVE: Watch as Kevin Fretz from Patriot Green Products conducts in-studio compost tea and sprouting demonstration with Mike Adams", "type": "article", "url": "https://www.food.news/2023-04-10-patriot-green-products-compost-tea-sprouting-demo.html", "site_name": "Food News", "description": "Have you ever thought about sprouting your own microgreens and herbs at home? The process may seem daunting, but it does not have to be. In the following episode of the Health Ranger Report, Mike Adams talks with Kevin Fretz of Patriot Green Products about the use of compost tea, which makes a great medium […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2023/04/kevin-fretz-mike-adams.jpg", "article:published_time": "04/10/2023 11:33:27", "article:post_id": "23311"}, "tags": ["foodscience", "survival", "crops", "compost tea", "home gardening", "preparedness", "Patriot Green Products", "sprouting", "goodfood"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2020-03-24-10-healthy-reasons-to-start-sprouting.html", "https://www.brighteon.tv", "https://naturalnews.com/2020-03-24-10-healthy-reasons-to-start-sprouting.html", "http://survival.news", "https://www.brighteon.com/b84a72cf-986e-43ae-ad76-96d9b3eaf7a1", "https://naturalnews.com/2020-03-24-10-healthy-reasons-to-start-sprouting.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2023-04-10-patriot-green-products-compost-tea-sprouting-demo.html&linkname=GROW%20FOOD%20OR%20STARVE%3A%20Watch%20as%20Kevin%20Fretz%20from%20Patriot%20Green%20Products%20conducts%20in-studio%20compost%20tea%20and%20sprouting%20demonstration%20with%20Mike%20Adams", "https://www.addtoany.com/share"], "authors": [], "publish_date": "04/10/2023 11:33:27"}