{"result_id": "118007", "URL": "https://www.food.news/2018-01-02-the-most-popular-toxic-food-ingredient-in-the-united-states-canola-oil.html", "timestamp": "2023-04-25 15:07:45 CEST+0200", "meta": {"description": "You’ve heard the saying “The devil’s in the details,” well… the devil is actually in the ingredients list. It’s called Canola oil and it’s quite easy to find in almost all of the prepped and processed food products at two of the top “healthy” food grocers in the country. No, Canola oil didn’t just “get […]", "lang": "en", "keywords": "badfood,badhealth,canola,canola oil,canola oil coagulates,canola oil dementia,canola products,canola toxic,expeller pressed,Food Dangers!,food truth,gmo canola,groceries,ingredients,organic canola,rapeseed,toxic canola,toxic ingredients,toxins,Trader Joe's,Whole Foods", "favicon": "wp-content/themes/ScienceTheme/images/Food-fav.png", "canonical": "https://www.food.news/2018-01-02-the-most-popular-toxic-food-ingredient-in-the-united-states-canola-oil.html", "encoding": "UTF-8"}, "image": null, "domain": "www.food.news", "title": "The most popular TOXIC food ingredient in the United States – CANOLA OIL", "cleaned_text": "The most popular TOXIC food ingredient in the United States – CANOLA OIL\n\nYou’ve heard the saying “The devil’s in the details,” well… the devil is actually in the ingredients list. It’s called Canola oil and it’s quite easy to find in almost all of the prepped and processed food products at two of the top “healthy” food grocers in the country. No, Canola oil didn’t just “get a bad wrap” (pardon the pun), because it’s been bad all along. Let the truth be told: Canola oil is bad for your health. Did you think otherwise? Were you conned because you believed some hoax of a slogan, “Heart Healthy” – with a cutesy logo from the insidious American Heart Association? Remember that the AHA is comprised of clowns who want us to trade out butter to eat more toxic oils, like genetically modified Canola, soy and corn.\n\nNow, we know what you’re thinking – maybe if Canola oil is organic and expeller pressed, then we’re safe to eat that kind. Wrong. Scientists are now warning against long-term consumption of Canola Oil as it could worsen symptoms of dementia and cause weight gain. It causes plaques in the brain that lead to degenerative diseases in animals.\n\nThe “Heart Healthy” LIE has been perpetuated for decades by another Big Food myth. Most Canola oil is exported from Canada to the United States because Canada has a National Health Plan (Canadian Healthcare) that’s free and the government does NOT want to have to pay the billions of dollars in sick care costs from giving their own people clogged arteries and dementia.\n\nPrimary health concerns for regular Canola oil consumption include cardiovascular disease, cancer, diabetes and obesity. United States consumers are sucking down over 2 million tonnes of Canola oil a year, and add to that over 3.5 million tonnes of Canola meal. Oops. It’s the second most popular edible (if you can call it that) oil in the country. It’s almost everywhere now, invading nearly all types of food, including many “healthy” options and organic, like salad dressings, cereals and protein bars.\n\nThe power of the elements: Discover Colloidal Silver Mouthwash with quality, natural ingredients like Sangre de Drago sap, black walnut hulls, menthol crystals and more. Zero artificial sweeteners, colors or alcohol. Learn more at the Health Ranger Store and help support this news site.\n\nIt’s surprising Big Pharma isn’t using it in vaccines yet. It’s surely in lots of baby food products and the “protein” drinks served up for the sick and weak at hospitals. And remember, organic or not, it coagulates, causing weight gain and dementia. Therefore, choosing “expeller pressed” or “Certified Organic” won’t matter when you experience what the medical doctors will call a genetically inherited memory loss (Old timer’s disease) and can’t remember or even recognize your immediate family.\n\nTop foods at Whole Foods that contain coagulating, memory-damaging Canola Oil\n\nThis is just the tip of the iceberg of over a hundred products at Whole Foods that contain Canola oil: 8 Whole Grains Multigrain English Muffins, Cornbread, Light White Sandwich Bread, Prairie Bread, Sandwich Bread, Stuffing Cubes, 10 Minute Stuffing, Blueberry Muffins, Lemon Poppyseed Muffins, Molasses Ginger Cookies, Chocolate Confetti Cake, Vanilla Confetti Cake, Salted Caramel Cake, 365 Organic Mayonnaise, Applegate Chicken Nuggets, 365 Organic Homestyle Waffles, 365 Organic MultiGrain Waffles, Dr. Praeger’s California Veggie Burgers and Spinach Cakes, 365 Organic Vegan Lasagna, and the list just goes on.\n\nTop foods at Trader Joe’s that contain coagulating, memory-damaging Canola Oil\n\nThis is just the tip of the iceberg of over a hundred products at Trader Joe’s that contain Canola oil: Butternut Squash Soup, Mediterranean Hummus, Vegan Spread & Dressing (Mayonnaise with the first ingredient as Canola Oil – meaning it’s mainly that), Almond Butter Granola, Peanut Butter Protein Granola, Cornbread Stuffing Mix, Turkey Stock (broth), Spud Crunchies Potato Snacks, Beet and Roasted Garlic Dip, Chocolate Covered Pretzel Assortment, Cinnamon Streusel Coffee Cake, Chocolate Mint Flavored Cupcakes, Vegetable Pastry Puffs, Ranch Seasoned Crispy Chickpeas, and of course you’ll find coagulating Canola oil in the Trader Joe’s Brand Chunky Blue Cheese Dressing & Dip.\n\nStill not sure whether or not you plan to continue consuming Canola oil? Watch this home video of how badly Canola oil coagulates when left in a bowl for a few weeks. Imagine what this does when it gets trapped in your digestive tract, your cleansing organs, your blood and your brain! Alzheimer’s disease barely existed in America 75 years ago. Still thinks it’s hereditary?\n\nCheck out the real deal about nutrition, food, supplements and even toxic chemicals like Canola Oil at NaturalPedia.com. It’s the online encyclopedia you’ve always wanted, and it’s right here at your fingertips. Let the truth be told!", "opengraph": {"title": "The most popular TOXIC food ingredient in the United States – CANOLA OIL", "type": "article", "url": "https://www.food.news/2018-01-02-the-most-popular-toxic-food-ingredient-in-the-united-states-canola-oil.html", "site_name": "Food News", "description": "You’ve heard the saying “The devil’s in the details,” well… the devil is actually in the ingredients list. It’s called Canola oil and it’s quite easy to find in almost all of the prepped and processed food products at two of the top “healthy” food grocers in the country. No, Canola oil didn’t just “get […]", "image": "https://www.food.news/wp-content/uploads/sites/377/2018/10/Girl-Brain.jpg"}, "tags": ["canola toxic", "food truth", "toxins", "organic canola", "expeller pressed", "Food Dangers!", "canola oil", "canola oil coagulates", "Whole Foods", "groceries", "toxic canola", "rapeseed", "canola oil dementia", "canola", "toxic ingredients", "ingredients", "gmo canola", "canola products", "Trader Joe's"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/H6YP5RViaAE?feature=oembed\" frameborder=\"0\" gesture=\"media\" allow=\"encrypted-media\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/H6YP5RViaAE?feature=oembed"}], "links": ["https://www.naturalnews.com/2017-06-26-american-heart-association-wants-you-to-stop-using-butter-and-start-using-hydrogenated-vegetable-oils-again.html", "https://colloidalsilvermouthwash.healthrangerstore.com/colloidal-silver-mouthwash.html", "https://www.naturalnews.com/2017-12-22-scientists-finally-issue-warning-against-canola-oil-study-reveals-it-is-detrimental-to-brain-health-contributes-to-dementia-causes-weight-gain.html", "http://www.dailymail.co.uk/health/article-5155567/Canola-oil-worsens-memory-loss-causes-weight-gain.html", "https://www.traderjoes.com/FearlessFlyer/Article/3723", "https://www.traderjoes.com/digin/Post/Post/vegan-spread-dressing", "https://naturalpedia.com/", "https://www.naturalnews.com/2017-12-22-scientists-finally-issue-warning-against-canola-oil-study-reveals-it-is-detrimental-to-brain-health-contributes-to-dementia-causes-weight-gain.html", "http://www.dailymail.co.uk/health/article-5155567/Canola-oil-worsens-memory-loss-causes-weight-gain.html", "https://www.naturalnews.com/2017-06-26-american-heart-association-wants-you-to-stop-using-butter-and-start-using-hydrogenated-vegetable-oils-again.html", "https://www.traderjoes.com/digin/Post/Post/vegan-spread-dressing", "https://www.wholefoodsmarket.com/gluten-free/ingredients-nutrition", "https://naturalpedia.com/", "https://www.canolacouncil.org/markets-stats/markets/united-states/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffoodnews%2F2018-01-02-the-most-popular-toxic-food-ingredient-in-the-united-states-canola-oil.html&linkname=The%20most%20popular%20TOXIC%20food%20ingredient%20in%20the%20United%20States%20%E2%80%93%20CANOLA%20OIL", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}