{"result_id": "119002", "URL": "https://foreverconscious.com/the-indigo-crystal-and-rainbow-children", "timestamp": "2023-04-25 15:08:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://foreverconscious.com/wp-content/uploads/2019/05/cropped-FC-logo-2014-no-background-32x32.png", "canonical": "https://foreverconscious.com/the-indigo-crystal-and-rainbow-children", "encoding": "UTF-8"}, "image": null, "domain": "foreverconscious.com", "title": "The Indigo, Crystal and Rainbow Children", "cleaned_text": "Yesterday a spiritual astrologer told me I was an Indigo child.\n\nI have heard of Indigo, Crystal and Rainbow children before but I never really took the interest to explore what it all really meant.\n\nTo be honest I was skeptical and felt that these terminologies were a ‘hippie-way’ to describe a child who was simply a little more creative and alternative than the rest of the world.\n\nWhen I started reading about Indigo, Crystal and Rainbow children however, I realized there was no denying it.\n\nDespite the ‘hippie’ sounding names, these children were sent here to change the earth and you can see it. You can feel it.\n\nNot even 20 years ago, the idea of organic foods, the law of attraction and herbal medicine would have been absolutely foreign concepts however, now they are all part of the mainstream. This is thanks to the Indigo children who were born under a new wave of consciousness.\n\nLet me first be clear, all those that existed before the Indigo children are just as important as they created the imbalance that is now needed to be healed. Without this healing we would never be aware, or appreciate the true beauty that surrounds us everyday. Every concept exists in duality- we cannot experience true light unless we see it shining in the dark.\n\nThese children were named according to the color of their auras.\n\nIndigo children are found to have bright purple, blues and greens in their auras, Crystal children have a lot of white and pastel colors and Rainbow children have a balance of all colors of the rainbow.\n\nIndigo children came into existence around the 1970-1990, however not everyone born in this time period would be an Indigo child. They are believed to have been born with the specific purpose of changing the world. These children are spirit warriors and they have been sent to us to break down conventional systems and to bring awareness about the planet, consciousness and the flaws of capitalism.\n\nTheir indigo auras indicate that they have heightened psychic abilities, can easily detect dishonesty, are intuitive, intelligent, natural leaders and can be sensitive. They are wise old souls that were sent to help free the world from past limitations, challenge old beliefs and clear the way for the Crystal children.\n\nCrystal children entered into the world around the year 2000 in order to take the world into the next level of evolution. They are gentle, kind and loving and have come to show us where humanity is heading. They are even-tempered, easy going and spread love, peace and wisdom.\n\nThese children have psychic abilities, live in harmony with all people, animals and nature and are very sensitive and empathetic. These children constantly need love and protection and are often diagnosed with having autism.\n\nFollowing the Crystal children are Rainbow children who are fearless and are ready to implement all the changes laid down by both the Indigo and Crystal children. Rainbow children are at their spiritual peak and often have Crystal or Indigo parents. These rainbow children were sent here to give and are all about practicing unconditional love.\n\nUnlike Indigo and some Crystal children, Rainbow children have not walked the earth before. They are new souls and because of this they are fearless and not afraid to love. They too are often diagnosed with autism because they have difficulty relating to human emotions.\n\nAs sensitive as these children are they have a much higher vibration than both the Indigo and Crystal children however they are more vulnerable to the negative things in life and need spiritual protection.\n\nAs our souls evolve we move from one level of consciousness to the next, this is how we grow individually and as a human race. Whether you believe in the concepts behind these Indigo, Crystal and Rainbow spirits, there is no denying that each new generation that is coming forward is helping to guide planet earth to a place of love, light and consciousness.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Indigo, Crystal and Rainbow Children", "description": "Yesterday a spiritual astrologer told me I was an Indigo child.  I have heard of Indigo, Crystal and Rainbow children before but I never really took the interest to explore what it all really meant. To be honest I was skeptical and felt that these terminologies were a ‘hippie-way’ to describe a child who was […]", "url": "https://foreverconscious.com/the-indigo-crystal-and-rainbow-children", "site_name": "Forever Conscious", "article:publisher": "http://facebook.com/foreverconscious", "article:author": "https://www.facebook.com/ForeverConscious/", "article:published_time": "2014-03-02T20:16:45+00:00", "article:modified_time": "2015-09-08T21:31:40+00:00"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Tanaaz"], "publish_date": "2014-03-02T20:16:45+00:00"}