{"result_id": "123003", "URL": "https://freedom.news/2023-02-24-mask-mandates-accomplished-nothing-good-politicians-error.html", "timestamp": "2023-04-25 15:08:31 CEST+0200", "meta": {"description": "Late last month, the most rigorous and comprehensive analysis of scientific studies looking into the efficacy (or lack thereof) of Wuhan coronavirus (Covid-19) face masks was published by an Oxford epidemiologist who flat-out admitted that the plastic-laden mouth and nose veils are certifiably useless. “There is just no evidence that they make any difference,” admitted […]", "lang": "en", "keywords": "badpollution,big government,CDC,COVID,face mask,fake science,fascism,health freedom,left cult,Liberty,Libtards,mandates,mask,Medical Tyranny,political statement,science deception,science fraud,scientific analysis,study,virtue signaling", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-02-24-mask-mandates-accomplished-nothing-good-politicians-error.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Mask mandates now revealed to be a complete waste of time and a junk science fraud, but have politicians learned from the error of their ways?", "cleaned_text": "Mask mandates now revealed to be a complete waste of time and a junk science fraud, but have politicians learned from the error of their ways?\n\nLate last month, the most rigorous and comprehensive analysis of scientific studies looking into the efficacy (or lack thereof) of Wuhan coronavirus (Covid-19) face masks was published by an Oxford epidemiologist who flat-out admitted that the plastic-laden mouth and nose veils are certifiably useless.\n\n“There is just no evidence that they make any difference,” admitted Tom Jefferson, the review’s lead author, to journalist Maryanne Demasi.\n\nEven N-95 masks, which we were told by the experts are “superior” to the cheap Chinese blue cloth masks that were handed out like candy – and that are now floating used and contaminated in the world’s oceans – are a worthless joke.\n\n“Makes no difference – none of it,” Jefferson said.\n\nAs for the “studies” the government trotted out as “evidence” that masks work, Jefferson told Demasi that they are all corrupt and never should have been accepted as “sound science.”\n\n“They were convinced by non-randomized studies, flawed observational studies,” he explained.\n\nWhat about using masks in conjunction with other proposed guidelines like excessive hand washing, “social distancing,” and air filtration systems? These, too, are useless, according to the science.\n\n“There’s no evidence that many of these things make any difference,” Jefferson revealed.\n\nWearing a mask to avoid covid is just dumb\n\nJefferson and 11 of his colleagues put together the work for Cochrane, an esteemed British non-profit that is widely considered to be the gold standard for reviews of health care data.\n\nFor their research, Jefferson et al. looked at 78 randomized controlled trials, six of which were published during the covid scamdemic. A total of 610,872 participants from multiple countries were included in the trials.\n\nIn a nutshell, the review determined that states with mask mandates fared no better than states without them in terms of covid cases, hospitalizations, and deaths. Masks are just a political symbol, in other words, not a viable medical intervention.\n\nNo matter what type of mask a person uses, the effects are the same: they do nothing except making breathing more difficult, not to mention whatever toxins are present in their material.\n\n“People may have good personal reasons to wear masks, and they may have the discipline to wear them consistently,” DNYUZ reports. “Their choices are their own.”\n\n“But when it comes to the population-level benefits of masking, the verdict is in: Mask mandates were a bust. Those skeptics who were furiously mocked as cranks and occasionally censored as ‘misinformers’ for opposing mandates were right. The mainstream experts and pundits who supported mandates were wrong. In a better world, it would behoove the latter group to acknowledge their error, along with its considerable physical, psychological, pedagogical and political costs.”\n\nUnfortunately for modern society, it is no longer considered honorable for public officials who fail in their jobs to resign. Were that still the case, there would be a lot of public office vacancies across the land at this point, including and especially at the Centers for Disease Control and Prevention (CDC).\n\nCDC head Rochelle Walensky is one such disgraced public official who lied again and again about covid protocols like masking and “vaccinating,” claiming that “science” supports these things. Nothing could be further from the truth.\n\n“The last justification for masks is that, even if they proved to be ineffective, they seemed like a relatively low-cost, intuitively effective way of doing something against the virus in the early days of the pandemic,” DNYUZ says.\n\n“But ‘do something’ is not science, and it shouldn’t have been public policy. And the people who had the courage to say as much deserved to be listened to, not treated with contempt. They may not ever get the apology they deserve, but vindication ought to be enough.”\n\nMore related news about masks “vaccines” can be found at FakeScience.news.", "opengraph": {"title": "Mask mandates now revealed to be a complete waste of time and a junk science fraud, but have politicians learned from the error of their ways?", "type": "article", "url": "https://www.freedom.news/2023-02-24-mask-mandates-accomplished-nothing-good-politicians-error.html", "site_name": "Freedom News", "description": "Late last month, the most rigorous and comprehensive analysis of scientific studies looking into the efficacy (or lack thereof) of Wuhan coronavirus (Covid-19) face masks was published by an Oxford epidemiologist who flat-out admitted that the plastic-laden mouth and nose veils are certifiably useless. “There is just no evidence that they make any difference,” admitted […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/02/Facemask-face-shield-boy.jpg"}, "tags": ["big government", "Liberty", "Libtards", "fascism", "political statement", "mandates", "left cult", "science deception", "COVID", "study", "science fraud", "virtue signaling", "mask", "Medical Tyranny", "face mask", "scientific analysis", "health freedom", "CDC"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2021-03-10-cdc-report-mask-wearing-no-protection-covid.html", "http://fakescience.news", "https://12ft.io/proxy?q=https%3A%2F%2Fdnyuz.com%2F2023%2F02%2F21%2Fthe-mask-mandates-did-nothing-will-any-lessons-be-learned%2F", "https://naturalnews.com/2021-03-10-cdc-report-mask-wearing-no-protection-covid.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-02-24-mask-mandates-accomplished-nothing-good-politicians-error&linkname=Mask%20mandates%20now%20revealed%20to%20be%20a%20complete%20waste%20of%20time%20and%20a%20junk%20science%20fraud%2C%20but%20have%20politicians%20learned%20from%20the%20error%20of%20their%20ways%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}