{"result_id": "123027", "URL": "https://freedom.news/2023-03-27-big-list-woke-companies-boycott.html", "timestamp": "2023-04-25 15:08:46 CEST+0200", "meta": {"description": "In case you have not noticed, the United States and much of the West has been taken over by corporations, many of them multinational, that have embraced “woke” ideologies that are inherently anti-American. And someone put together a giant list of boycott targets based on questionable corporate actions that were taken in recent years. Many […]", "lang": "en", "keywords": "absurd,boycott,Collapse,corporations,Crybullies,deception,demonic times,fascism,freedom,groupthink,indoctrination,insanity,left cult,Liberty,Libtards,political correctness,traitors,Twisted,Tyranny,woke,woke mob", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-03-27-big-list-woke-companies-boycott.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Check out this BIG list of “woke” companies to boycott", "cleaned_text": "Check out this BIG list of “woke” companies to boycott\n\nIn case you have not noticed, the United States and much of the West has been taken over by corporations, many of them multinational, that have embraced “woke” ideologies that are inherently anti-American. And someone put together a giant list of boycott targets based on questionable corporate actions that were taken in recent years.\n\nMany of the companies on the list promote things like LGBT child grooming and pedophilia, transgender mutilation, anti-white groups like Black Lives Matter (BLM), and other “woke” causes. Others are listed simply for opposing Donald Trump and his family’s businesses.\n\nRead through the list and descriptions and decide for yourself which corporate actions you think warrant a boycott. Here are some of the top contenders from this writer’s perspective:\n\nAmazon\n\n It goes pretty much without saying that Amazon is one of the worst, most evil companies in existence. This unfortunately also includes Whole Foods Market, which was bought out by Amazon several years back.\n\nAmazon is a hugely anti-free speech corporation that is also anti-competitive. It funds all sorts of left-wing causes and is heavy into censorship and trying to stamp out the First Amendment.\n\nGoogle and YouTube\n\n These two tech giants control so much of what happens on the internet these days, which is dangerous in that both platforms censor content that goes against the globalist agenda.\n\nApple\n\n The same goes for Apple, which pulled Gab, Parler, and numerous other social media apps from its App Store during the heated years of the Trump presidency. Apple also censors Telegram, supports election fraud, and donates to the racist Southern Poverty Law Center (SPLC).\n\nWhenever possible, support small, independent businesses while shopping online\n\nSpeaking of Amazon and the tech giants that deserve a boycott, do not forget to also consider boycotting associated e-commerce merchants like Etsy, which has committed so many offenses in recent years that avoiding the platform is simply a no-brainer.\n\nIn addition to boycotting Georgia’s voting security bill, Etsy banned users from selling any merchandise referencing “Stop the Steal,” referring to the 2020 election which was stolen by Joe Biden and the Democrats. Etsy also donated $1 million to BLM while promoting “black-owned” businesses over others on its platform.\n\nPayPal is another e-commerce platform that, unless you want to potentially lose all your money, should be boycotted like the plague. PayPal banned the Gays Against Groomers account and attempted to implement an Orwellian policy in which accounts caught promoting “misinformation” were penalized with a $2,500 reduction in funds.\n\nVenmo is not much better, having banned both Laura Loomer and Gab, among others. It turns out that Venmo is now owned by PayPal, so it only makes sense that the two payment platforms align ideologically.\n\nShopify is another tech platform that banned Gab while donating half a million dollars to the NAACP Legal Defense and Educational Fund, as well as $250,000 to Campaign Zero, which aims to stop police officers from using any type of force while performing arrests.\n\nIf you are ever needing to host a fundraiser, you might want to avoid GoFundMe, which has stolen millions over the years from the Canadian truckers and their Freedom Convoy, as well as from Kyle Rittenhouse and others. GoFundMe is another tech platform that just loves BLM as well – consider using GiveSendGo instead.\n\nFinally, for the purposes of this article, it is recommended that liberty-minded folks avoid using Zillow when dealing with real estate activities. Zillow, which now owns Trulia, opposes Florida’s Parental Rights Bill and is rabidly anti-white and pro-LGBT.\n\nThe latest news about the “woke” corporate assault on freedom and liberty can be found at Fascism.news.", "opengraph": {"title": "Check out this BIG list of “woke” companies to boycott", "type": "article", "url": "https://www.freedom.news/2023-03-27-big-list-woke-companies-boycott.html", "site_name": "Freedom News", "description": "In case you have not noticed, the United States and much of the West has been taken over by corporations, many of them multinational, that have embraced “woke” ideologies that are inherently anti-American. And someone put together a giant list of boycott targets based on questionable corporate actions that were taken in recent years. Many […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/04/woke-broke-stock-photo.jpg"}, "tags": ["corporations", "groupthink", "Liberty", "boycott", "left cult", "deception", "absurd", "indoctrination", "Crybullies", "woke mob", "insanity", "woke", "Tyranny", "political correctness", "Libtards", "fascism", "Collapse", "Twisted", "demonic times", "traitors", "freedom"], "tweets": [], "movies": [], "links": ["https://www.cancelthiscompany.com/", "http://fascism.news", "https://www.cancelthiscompany.com/", "https://naturalnews.com/2022-04-08-child-grooming-disney-linked-to-ghislaine-maxwell-and-jeffrey-epsteins-pedo-island-boycott.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-03-27-big-list-woke-companies-boycott&linkname=Check%20out%20this%20BIG%20list%20of%20%E2%80%9Cwoke%E2%80%9D%20companies%20to%20boycott", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}