{"result_id": "123026", "URL": "https://freedom.news/2023-03-22-mathew-crawford-chaos-agents-infiltrated-freedom-movements.html", "timestamp": "2023-04-25 15:08:45 CEST+0200", "meta": {"description": "Finance specialist Mathew Crawford disclosed during his appearance on the “Health Ranger Report” that so-called “chaos agents” infiltrated the freedom movement in America and tarnished the real advocacy of these groups. “Within any important movement, there’s a long history of agents infiltrating it,” Crawford told Health Ranger Mike Adams. “It’s done so that somebody can have […]", "lang": "en", "keywords": "big government,Carolina Bonita,chaos agents,civil unrest,conspiracy,deception,false-flag,freedom,freedom movements,Health Ranger,Health Ranger Report,infiltrators,Leigh Dundas,Liberty,Mathew Crawford,Mike Adams,People's Convoy,provocateurs", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-03-22-mathew-crawford-chaos-agents-infiltrated-freedom-movements.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Health Ranger Report: Mathew Crawford warns about CHAOS AGENTS who infiltrated the freedom movement", "cleaned_text": "Health Ranger Report: Mathew Crawford warns about CHAOS AGENTS who infiltrated the freedom movement\n\nFinance specialist Mathew Crawford disclosed during his appearance on the “Health Ranger Report” that so-called “chaos agents” infiltrated the freedom movement in America and tarnished the real advocacy of these groups.\n\n“Within any important movement, there’s a long history of agents infiltrating it,” Crawford told Health Ranger Mike Adams. “It’s done so that somebody can have intelligence from within, inside the group, and stir the movements.”\n\nThe man behind the “Rounding the Earth” newsletter cited Western banking empires that had agents of the Chinese Communist Party in them, as well as the Federal Bureau of Investigation‘s long history of putting agents in civil rights movements.\n\nAdams agreed, also mentioning that these chaos agents have been targeting “advocacy networks” such as the health freedom, liberty and vaccine skepticism movements. Even the group that supports former President Donald Trump was not spared.\n\nCrawford expounded on the People’s Convoy movement, modeled after the Canadian Freedom Convoy, that challenged Wuhan coronavirus (COVID-19) vaccine mandates for truckers. According to him, the group had been run by a non-trucker who never showed its balance sheet – leading to suspicions of embezzlement. (Related: Wheels of freedom: American truckers set to launch People’s Convoy against Biden’s tyrannical COVID mandates.)\n\nHe further cited one example of a chaos agent, a woman who went by the pseudonym Carolina Bonita, who had joined the convoy volunteering to help. The financial expert recounted: “Everyone I talked to said she was constantly screwing things up – from which towns they were going to stop into where they were going to sleep at night. So they eventually kicked her out.”\n\nAccording to an “anonymous” report, Bonita had an uncanny way of tracking down every last trucker or activist. She also had a habit of bragging about her accomplishments and connections, even touting her supposed access to millions of dollars and MyPillow CEO Mike Lindell. People’s Convoy organizer Brian Brase said of her: “All the miscommunications, breakdowns, problems and disasters … always led back to Carolina.”\n\nAnother chaos agent in the People’s Convoy mentioned by Crawford was attorney Leigh Dundas, who joined “Lawfare” host Tom Renz during a COVID-19 vaccine roundtable organized by Sen. Ron Johnson (R-WI). Dundas was also present during the Jan. 6, 2021 riot at the Capitol. Crawford recounted that she was kicked out in some events for fomenting violence.\n\n“She was at the Capitol giving fiery speeches,” Crawford said, recalling that her remarks were the “most violent of all the speeches that I heard.”\n\n“We would be within our rights to grab the lawmakers, drag them out back, hang and shoot them,” Dundas allegedly said.\n\nThe anonymous report also mentioned that Bonita’s Operation Take Back America and Dundas’ Freedom Fighter Nation were closely collaborating with each other as evidenced on social media. The two have since parted ways, however.\n\nThe financial expert also mentioned that Bonita was tailing the convoy in a vehicle that wound up getting pulled over. “There was a pile of guns in the car,” he told the Natural News and Brighteon.com founder. According to Crawford, authorities seized the guns out of Bonita’s vehicle – but “there was no evidence that the event ever took place.”\n\nNevertheless, the Health Ranger commented that freedom movements are being “framed up” for violent crimes during their rallies and events. The best way to avoid such a situation, he advised, is by leaving weapons at home.\n\n“This is why I’ve always said: If you protest 100 percent peacefully exercise freedom of speech, leave your weapons at home,” Adams stressed.\n\n“Don’t bring your guns, don’t bring your knives because you don’t want to be trapped in a scenario where provocateurs rush and shoot up some innocent people. You will get charged for being part of a mob and having a weapon.”\n\nCrawford agreed with the “Health Ranger Report” host, adding that people attending such events should probably know other participants well.\n\nVisit Traitors.news for more stories about chaos agents.\n\nListen to the full episode of “Health Ranger Report” with Mike Adams and Mathew Crawford below.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\n“Anti-vaxxer” hunter who terrorized Freedom Convoy truckers COLLAPSES on camera: Was it the covid jab?\n\nOntario government shuts down 39 trucking companies for participating in Freedom Convoy.\n\nCanadian authorities find they are unable to seize Bitcoin donations made to Freedom Convoy protesters.", "opengraph": {"title": "Health Ranger Report: Mathew Crawford warns about CHAOS AGENTS who infiltrated the freedom movement", "type": "article", "url": "https://www.freedom.news/2023-03-22-mathew-crawford-chaos-agents-infiltrated-freedom-movements.html", "site_name": "Freedom News", "description": "Finance specialist Mathew Crawford disclosed during his appearance on the “Health Ranger Report” that so-called “chaos agents” infiltrated the freedom movement in America and tarnished the real advocacy of these groups. “Within any important movement, there’s a long history of agents infiltrating it,” Crawford told Health Ranger Mike Adams. “It’s done so that somebody can have […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/03/Police-Riot-Protest-Woman-Yelling.jpg"}, "tags": ["civil unrest", "conspiracy", "big government", "Carolina Bonita", "false-flag", "freedom movements", "Health Ranger Report", "Liberty", "chaos agents", "Mike Adams", "provocateurs", "deception", "Mathew Crawford", "Health Ranger", "Leigh Dundas", "freedom", "People's Convoy", "infiltrators"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/f7bf5e63-5bfc-4eb4-8a48-bde462a15048", "http://healthfreedom.news", "https://naturalnews.com/2022-02-20-american-truckers-to-start-peoples-convoy-against-mandates.html", "https://img1.wsimg.com/blobby/go/dc56e0ef-12f2-48c3-a87d-467422ae77db/The%20Bonita%20Report.pdf", "https://talkingpointsmemo.com/muckraker/leigh-dundas-truckers-january-6", "https://brighteon.com", "http://falseflag.news", "http://Traitors.news", "https://www.brighteon.com/f7bf5e63-5bfc-4eb4-8a48-bde462a15048", "https://www.brighteon.com/channels/hrreport", "https://naturalnews.com/2022-06-07-totalitarian-takeovers-have-similar-telltale-signs.html", "https://vaccines.news/2022-11-11-antivaxxer-hunter-freedom-convoy-collapse-covid-jab.html", "https://uprising.news/2022-03-04-freedom-convoy-protests-struggle-freedom-great-reset.html", "https://tyranny.news/2022-03-02-ontario-closes-trucking-companies-over-freedom-convoy.html", "https://cryptocult.news/2022-03-25-canada-authorities-seize-bitcoin-donations-freedom-convoy.html", "https://www.brighteon.com/f7bf5e63-5bfc-4eb4-8a48-bde462a15048", "https://img1.wsimg.com/blobby/go/dc56e0ef-12f2-48c3-a87d-467422ae77db/The%20Bonita%20Report.pdf", "https://talkingpointsmemo.com/muckraker/leigh-dundas-truckers-january-6", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-03-22-mathew-crawford-chaos-agents-infiltrated-freedom-movements&linkname=Health%20Ranger%20Report%3A%20Mathew%20Crawford%20warns%20about%20CHAOS%20AGENTS%20who%20infiltrated%20the%20freedom%20movement", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}