{"result_id": "123037", "URL": "https://www.freedom.news/2021-06-30-the-foundations-of-america-are-crumbling.html", "timestamp": "2023-04-25 15:08:51 CEST+0200", "meta": {"description": "What is it that keeps civilization functioning? To remain viable, a civilization must be rooted in principles of reason, shared value for human life, respect for individual liberties and a vigorous defense of the rule of law. People must be willing to coexist and engage in free will interactions with each other such as acts […]", "lang": "en", "keywords": "chaos,civil war,civilization,Collapse,grid down,national defense,national security,society,sustainable,uprising,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.freedom.news/2021-06-30-the-foundations-of-america-are-crumbling.html", "encoding": "UTF-8"}, "image": null, "domain": "www.freedom.news", "title": "The foundations of America are crumbling, and without them, the nation will soon fall", "cleaned_text": "The foundations of America are crumbling, and without them, the nation will soon fall\n\nWhat is it that keeps civilization functioning? To remain viable, a civilization must be rooted in principles of reason, shared value for human life, respect for individual liberties and a vigorous defense of the rule of law. People must be willing to coexist and engage in free will interactions with each other such as acts of commerce or private contracts, and they must agree to resolve their differences through judicial processes rather than spontaneous violence.\n\nYet today in America, every one of these pillars of sustainable civilization is being ripped to shreds. Logic and reason have been utterly abandoned by the extreme Left, which also exhibits no tolerance for diversity of thought or the value of human life (especially unborn human babies). An increasingly tyrannical government seems to offer no respect for individual liberties, and the rule of law has already collapsed to such extremes that left-wing rioters are set free while right-wing protesters are indefinitely held in GITMO-like conditions.\n\nViolence is exploding across America’s cities, where Leftists have defunded police, causing an exodus of law enforcement personnel and a subsequent sharp rise in violent crime, which the White House is now desperately trying to somehow pin on the GOP.\n\nThe right to engage in private rental contracts has been obliterated by the CDC’s eviction moratorium, and no reasonable person can expect a fair trial on any matter — civil or criminal — due to the deep corruption of the judicial system. Meanwhile, the Federal Reserve is running an insane money printing experiment that will likely see the U.S. government exceeding $40 trillion in national debt over just the next 2-3 years, with stimulus money now reanimating a zombie economy under the illusion of prosperity.\n\nThe pillars of the American civilization are, indeed, crumbling. It’s all by design, of course, since the U.S. Constitution is the single largest obstacle to the evil aims of anti-human globalists who wish to achieve large-scale depopulation. They also seek to enslave the remaining human survivors under One World Government, but in order to achieve that, they must obliterate the United States of America as a sovereign nation, thereby rendering the U.S. Constitution obsolete.\n\nSo the attacks on America are escalated from within — via race wars, false media narratives, engineered monetary inflation, etc. — in order to weaken the republic and make the nation vulnerable to outside attacks. Much like a concrete building with a failing foundation, the United States of America is now cracking and lurching, showing signs of an imminent catastrophic collapse (which is being engineered, of course).\n\nThe covid lockdowns and vaccine bioweapons are all part of this same agenda, because the war on America coincides with a war against the human race, carried out on a global scale.\n\nSadly, we are never returning to the America we once knew. Powerful, destructive forces are making sure of that. There is no scenario under which America reverts back to 2019, before the covid bioweapons attack and the rigged 2020 election. We are on a horrifying new course now, sailing through uncharted, shark-infested waters, with winds and waves tossing us all around like corks in a waterfall. The journey from here forward will be arduous and dangerous, and it’s not clear whether the United States of America as we know it will continue to exist much longer. Because once the collapse stage begins, it accelerates rapidly and spreads through every sector of society.\n\nWe encourage everyone to be prepared for the sudden, spontaneous collapse of financial transactions, which includes food stamps, ATMs and banking infrastructure. Within just a day or two, grocery store shelves will likely be stripped bare. We don’t condone anyone initiating violence, but we do encourage every American to be prepared for lawful self-defense against lawless violence, should it come to you. Every person has the right to self-defense.\n\nToday’s Situation Update provides more details on the rapid, imminent collapse of our society, and why it now seems inevitable due to the malicious actions of so many anti-American actors who are deliberately trying to bring this nation to its knees.\n\nDiscover a new podcast each weekday at:", "opengraph": {"title": "The foundations of America are crumbling, and without them, the nation will soon fall", "type": "article", "url": "https://www.freedom.news/2021-06-30-the-foundations-of-america-are-crumbling.html", "site_name": "Freedom News", "description": "What is it that keeps civilization functioning? To remain viable, a civilization must be rooted in principles of reason, shared value for human life, respect for individual liberties and a vigorous defense of the rule of law. People must be willing to coexist and engage in free will interactions with each other such as acts […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2021/06/HRR-2021-06-30-Situation-Update_189469520.jpg"}, "tags": ["chaos", "sustainable", "society", "civilization", "national security", "Collapse", "national defense", "World War III", "uprising", "grid down", "civil war"], "tweets": [], "movies": [], "links": ["http://Brighteon.com/e47b05f3-2f25-4ab3-87e0-d03ddc672bae", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}