{"result_id": "123015", "URL": "https://freedom.news/2021-04-18-wisconsin-supreme-court-strikes-down-mask-mandate.html", "timestamp": "2023-04-25 15:08:39 CEST+0200", "meta": {"description": "The Wisconsin Supreme Court struck down a mask mandate put in place by Gov. Tony Evers. In a 4-3 ruling, the high court ruled on March 31 that Evers overreached his authority with that mandate. According to the magistrates’ decision, the governor needed approval from state lawmakers – who are opposed to statewide mask mandates […]", "lang": "en", "keywords": "badmedicine,badscience,covid-19 pandemic,face masks,goodhealth,goodmedicine,goodscience,government overreach,health freedom,mask mandates,masks,medical fascism,Medical Tyranny,Tony Evers,Wisconsin,Wisconsin State Senate,Wisconsin Supreme Court,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2021-04-18-wisconsin-supreme-court-strikes-down-mask-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Wisconsin high court STRIKES DOWN governor’s mask mandate", "cleaned_text": "The Wisconsin Supreme Court struck down a mask mandate put in place by Gov. Tony Evers. In a 4-3 ruling, the high court ruled on March 31 that Evers overreached his authority with that mandate. According to the magistrates’ decision, the governor needed approval from state lawmakers – who are opposed to statewide mask mandates – before any emergency orders can be implemented.\n\nChief Justice Patience Roggensack and Justices Brian Hagedorn, Annete Ziegler and Rebecca Bradley ruled against overturning the emergency mask order. Meanwhile, Justices Ann Walsh Bradley, Rebecca Dallet and Jill Karofsky dissented. The majority decision penned by Hagedorn stated: “After receiving briefing on these requests, we conclude that the state of emergency proclaimed [by Evers] … exceeded the governor’s powers and is therefore unlawful.”\n\nHagedorn and the other justices argued that their decision had nothing to do with mask mandates being a prudent medical decision or not. “The question in this case is not whether the governor acted wisely; it is whether he acted lawfully. We conclude he did not,” they explained. “We declare that executive orders [ordering Wisconsin residents to wear masks] … were unlawful.”\n\nHowever, the ruling of the state’s highest court will not affect mask mandates issued at the local levels. The decision to require masks will now be left in the hands of city and county health departments, alongside individual businesses.\n\nWaukesha County has expressed that it will not require people to wear masks. Meanwhile, responses in Milwaukee County have been mixed. The cities of Brown Deer, Glendale, Milwaukee, Shorewood, Wauwatosa and Whitefish Bay have their own mask mandates. Other cities such as West Allis do not require face coverings.\n\nBack in May 2020, the Wisconsin Supreme Court struck down Evers’ stay-at-home order. The Milwaukee Journal Sentinel reported that the highest court of the state overturned the shutdown mandate, also in a 4-3 vote. Evers slammed the high court’s earlier decision, telling reporters that Republican state lawmakers “convinced four members of the [state] Supreme Court to throw the state into chaos.” (Related: Wisconsin reopens for business after court strikes down stay-at-home order.)\n\nWisconsin State Senate also delivered a knockout blow to the mask mandate\n\nIn a March 31 statement posted on Twitter, Evers insisted that “science and public health experts” guided his decisions about the Wuhan coronavirus pandemic. “Our fight against COVID-19 isn’t over. [While] we work to get folks vaccinated as quickly as we can, we know wearing a mask saves lives,” the governor wrote. Evers also exhorted residents of the Badger State to “mask up so we can beat this virus and bounce back” from the pandemic.\n\nThree months prior, the Wisconsin State Senate overturned Evers’ statewide mask order. On Jan. 26, state lawmakers voted 18-13 to repeal the order first implemented in August 2020. GOP State Sen. Steve Nass, who penned the resolution overturning the mandate, said the vote was about “the rule of law.” He wrote: “This is not about whether face masks are good or bad. This is about repeatedly issuing emergency orders contrary to what the law allows.” The state senate’s vote nullified the mask-wearing order Evans issued ahead of its original expiry date in March 2021.\n\nTwo GOP lawmakers joined all the state Democrats in a futile challenge to repeal. A number of health groups in Wisconsin, including the Wisconsin Medical Society, lobbied against it. They expressed support toward mask-wearing up until the majority of Americans get vaccinated against COVID-19. (Related: Wisconsin Senate overturns statewide mask mandate as Fauci doubles down on masks.)\n\nEvers has justified his emergency orders as being necessary amid the ongoing pandemic. His fellow Democrats agreed, saying the orders are necessary for public safety. But GOP members have fought against the governor’s mandates for months under the argument that the orders were an overreach of executive power.\n\nWisconsin Department of Health Services (DHSWI) Deputy Secretary Julie Willems Van Dijk stood by the governor’s mask mandate. She said on Jan. 26: “This is no time to remove a mask mandate in our state.” She warned that with the advent of more contagious Wuhan coronavirus variants, vaccines alone may be insufficient to stop the spread of COVID-19.\n\n“Whether that mandate stands or not, everybody in the state [should] continue to wear a mask [and] to physically distance,” the deputy heath secretary remarked.\n\nMedicalTyranny.com has more news about statewide mask mandates amid the ongoing Wuhan coronavirus pandemic.", "opengraph": {"title": "Wisconsin high court STRIKES DOWN governor’s mask mandate", "type": "article", "url": "https://www.freedom.news/2021-04-18-wisconsin-supreme-court-strikes-down-mask-mandate.html", "site_name": "Freedom News", "description": "The Wisconsin Supreme Court struck down a mask mandate put in place by Gov. Tony Evers. In a 4-3 ruling, the high court ruled on March 31 that Evers overreached his authority with that mandate. According to the magistrates’ decision, the governor needed approval from state lawmakers – who are opposed to statewide mask mandates […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2021/04/Coronavirus-World-Pandemic-Outbreak-Mask.jpg"}, "tags": ["masks", "medical fascism", "mask mandates", "covid-19 pandemic", "Tony Evers", "Medical Tyranny", "Wisconsin State Senate", "Wisconsin Supreme Court", "Wisconsin", "face masks", "health freedom", "Wuhan coronavirus", "government overreach"], "tweets": [], "movies": [], "links": ["https://www.tmj4.com/news/coronavirus/wisconsin-supreme-court-strikes-down-statewide-mask-mandate-in-4-3-ruling", "https://www.jsonline.com/story/news/politics/2020/05/13/wisconsin-supreme-court-strikes-down-tony-evers-coronavirus-orders/5179205002/", "https://www.naturalnews.com/2020-05-18-wisconsin-reopens-court-reverses-stay-at-home-order.html", "https://twitter.com/GovEvers/status/1377277667419033616", "https://www.foxnews.com/politics/wisconsin-senate-statewide-mask-mandate", "https://www.naturalnews.com/2021-01-31-wisconsin-state-senate-overturns-statewide-mask-mandate.html", "https://www.usnews.com/news/best-states/wisconsin/articles/2021-01-27/wisconsin-to-join-minority-of-states-with-no-mask-mandate", "https://medicaltyranny.com/", "https://pandemic.news/", "https://www.tmj4.com/news/coronavirus/wisconsin-supreme-court-strikes-down-statewide-mask-mandate-in-4-3-ruling", "https://www.jsonline.com/story/news/politics/2020/05/13/wisconsin-supreme-court-strikes-down-tony-evers-coronavirus-orders/5179205002/", "https://twitter.com/GovEvers/status/1377277667419033616", "https://www.foxnews.com/politics/wisconsin-senate-statewide-mask-mandate", "https://www.usnews.com/news/best-states/wisconsin/articles/2021-01-27/wisconsin-to-join-minority-of-states-with-no-mask-mandate"], "authors": [], "publish_date": null}