{"result_id": "123030", "URL": "https://freedom.news/2022-05-04-people-standing-up-against-covid-vaccine-mandates.html", "timestamp": "2023-04-25 15:08:48 CEST+0200", "meta": {"description": "Investigative journalist Jefferey Jaxen and host Del Bigtree lauded the states that are leading the pushback against Wuhan coronavirus (COVID-19) mandates during a recent episode of “The HighWire.” Jaxen cited an April 22 press release by Mississippi Gov. Tate Reeves announcing a ban on COVID-19 vaccine mandates and passports. Reeves signed House Bill (HB) 1509 into law on that day, […]", "lang": "en", "keywords": "awakening,badhealth,badmedicine,big government,covid-19,Del Bigtree,health freedom,Jefferey Jaxen,medical fascism,Medical Tyranny,Mississippi,pandemic,Resist,revolt,Rhode Island,the highwire,uprising,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2022-05-04-people-standing-up-against-covid-vaccine-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "The HighWire: People are now STANDING UP against proposed COVID vaccine mandates", "cleaned_text": "The HighWire: People are now STANDING UP against proposed COVID vaccine mandates\n\nInvestigative journalist Jefferey Jaxen and host Del Bigtree lauded the states that are leading the pushback against Wuhan coronavirus (COVID-19) mandates during a recent episode of “The HighWire.”\n\nJaxen cited an April 22 press release by Mississippi Gov. Tate Reeves announcing a ban on COVID-19 vaccine mandates and passports. Reeves signed House Bill (HB) 1509 into law on that day, which “bans public institutions and agencies from discriminating against individuals based on their COVID-19 vaccination status.”\n\nBigtree said of Reeves’ announcement: “I love that it’s not just banning it, but [also] making it illegal to even attempt to mandate it for one of your establishments. That’s really just taking down the road; Mississippi is a place I’ve traveled to so often, always fighting for the vaccine rights. I think this is a huge step in the right direction.”\n\n“Now there’s nine other U.S. states where COVID vaccination requirements have been banned by legislation. Across the entire U.S., we now have a large subset of states that are really pushing back against this,” said Jaxen, adding that HB 1059 was “really good news for a lot of people.”\n\nUnder HB 1059, “state agencies, public officials, state institutions of higher learning, public community or junior colleges, county, municipality, and other political subdivisions” are prohibited from banning unvaccinated individuals from applying for a job or discriminating against them when it comes to compensation and other benefits. (Related: Mississippi officially bans COVID-19 vaccine mandates and passports.)\n\nIt also bans children from getting the COVID-19 vaccine “as a condition of attending a school, kindergarten or similar type of facility intended for the instruction of children, whether public or private.” This ensures that students “will not be forced to make a decision between receiving the COVID-19 vaccine and not being able to attend Mississippi colleges and universities,” added the statement.\n\nRI bill seeking to penalize the unvaccinated fails to gain ground\n\nJaxen and Bigtree also discussed a proposal over at the state of Rhode Island that sought to penalize the unvaccinated for refusing the COVID-19 vaccine. The S2552 bill introduced in the Rhode Island Senate in March said individuals refusing the vaccine could face a monthly fine of $50 and pay double the state income tax. For unvaccinated Rhode Islanders 16 years old and below, the fines would be imposed on their parents and guardians.\n\n“This is insanity, this goes against everything. Whether you want to call [refusing the COVID-19 vaccine] a religious decision … or a critical thinking decision, you’re going to isolate them and tax them more? We wouldn’t accept this on any other group of people,” Bigtree said.\n\n“It’s incredible that we live in a time that a politician even thinks that this should happen in a free country. It shows you how bad this disease is in our political system that it exists at all. We definitely need some [chemotherapy] in there to burn this out.”\n\nAccording to Jaxen, S2552 received so much criticism from Rhode Islanders that some of the state senators who introduced the bill eventually distanced themselves from it. State Sens. Sam Bell, Cynthia Mendes, Jonathon Acosta and Tiara Mack were responsible for the bill. A WJAR 10 report said both Acosta and Mack refused to comment on the bill during a phone interview. Bell, meanwhile, said he did not have time for an interview when the news outlet reached out to him.\n\nThe investigative journalist remarked: “These people are so confident to put their names in this bill, [but] they can’t take one minute for a comment to a newspaper article talking about how ‘great’ this bill is. Surely, they have some talking points to sell this bill, don’t they?”\n\n“It’s only a matter of time before we start seeing these rights being rolled back. You have to know that the powers that be are going to try with all of their will to stop that, but boy, we have a tailwind behind us right now,” Bigtree concluded.\n\nResist.news has more stories about the pushback against mandatory COVID-19 vaccination bills.\n\nWatch Jaxen and Bigtree discuss the pushback against COVID-19 vaccine legislation below.\n\nThis video is from The HighWire with Del Bigtree channel on Brighteon.com.\n\nInsane! Rhode Island Dems introduce bill to double income taxes for parents of unvaccinated children.\n\nVAX TAX ATTACK: Rhode Island wants to DOUBLE state income tax for parents of unvaccinated children.", "opengraph": {"title": "The HighWire: People are now STANDING UP against proposed COVID vaccine mandates", "type": "article", "url": "https://www.freedom.news/2022-05-04-people-standing-up-against-covid-vaccine-mandates.html", "site_name": "Freedom News", "description": "Investigative journalist Jefferey Jaxen and host Del Bigtree lauded the states that are leading the pushback against Wuhan coronavirus (COVID-19) mandates during a recent episode of “The HighWire.” Jaxen cited an April 22 press release by Mississippi Gov. Tate Reeves announcing a ban on COVID-19 vaccine mandates and passports. Reeves signed House Bill (HB) 1509 into law on that day, […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/05/Coronavirus-Covid-19-No-Vaccine-Concept-Protest-Hands.jpg"}, "tags": ["pandemic", "big government", "covid-19", "medical fascism", "vaccine wars", "Resist", "revolt", "Mississippi", "Rhode Island", "vaccine mandate", "Medical Tyranny", "vaccines", "Jefferey Jaxen", "awakening", "the highwire", "Del Bigtree", "uprising", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/9f5b8fca-6f58-40e1-8cf2-590432db22ab", "https://mailchi.mp/b800c8189178/governor-tate-reeves-workforce-development-accelerate-mississippi-1053024?e=1c51692119", "https://www.naturalnews.com/2022-05-02-mississippi-bans-covid-vaccine-mandates-passports.html", "http://medicalfascism.news", "https://turnto10.com/politics/rhode-island-covid-19-coronavirus-vaccination-requirement-mandate-jonathon-acosta-tiara-mack-sam-bell", "https://resist.news/", "https://www.brighteon.com/9f5b8fca-6f58-40e1-8cf2-590432db22ab", "https://www.brighteon.com/channels/highwire", "https://naturalnews.com/2022-04-22-dems-double-income-taxes-parents-unvaccinated-children.html", "https://vaccines.news/2022-04-21-rhode-island-double-state-income-tax-unvaccinated.html", "https://naturalnews.com/2022-04-20-senator-pauses-mandatory-covid-vaccination-bill-schoolchildren.html", "https://www.brighteon.com/9f5b8fca-6f58-40e1-8cf2-590432db22ab", "https://mailchi.mp/b800c8189178/governor-tate-reeves-workforce-development-accelerate-mississippi-1053024?e=1c51692119", "https://turnto10.com/politics/rhode-island-covid-19-coronavirus-vaccination-requirement-mandate-jonathon-acosta-tiara-mack-sam-bell", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2022-05-04-people-standing-up-against-covid-vaccine-mandates&linkname=The%20HighWire%3A%20People%20are%20now%20STANDING%20UP%20against%20proposed%20COVID%20vaccine%20mandates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}