{"result_id": "123007", "URL": "https://freedom.news/2022-01-29-denmark-abolishing-all-covid-restrictions.html", "timestamp": "2023-04-25 15:08:33 CEST+0200", "meta": {"description": "Denmark has announced that it will end all of its Wuhan coronavirus (COVID-19) restrictions by next week. Mette Frederiksen, prime minister of one of the world’s most vaccinated countries, said Denmark will not extend any of its pandemic measures beyond Jan. 31. “The pandemic is still here but with what we know, we now dare […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,coronavirus,coronavirus lockdown,coronavirus restrictions,COVID,covid-19,denmark,Europe,freedom,government,infections,Liberty,lockdown,medical fascism,Medical Tyranny,outbreak,pandemic,Restrictions,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2022-01-29-denmark-abolishing-all-covid-restrictions.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Welcome to the life we knew before: Denmark is abolishing ALL COVID-19 restrictions", "cleaned_text": "Welcome to the life we knew before: Denmark is abolishing ALL COVID-19 restrictions\n\nDenmark has announced that it will end all of its Wuhan coronavirus (COVID-19) restrictions by next week.\n\nMette Frederiksen, prime minister of one of the world’s most vaccinated countries, said Denmark will not extend any of its pandemic measures beyond Jan. 31.\n\n“The pandemic is still here but with what we know, we now dare to believe that we are through the critical phase,” said Frederiksen, who called this development in her country “a milestone.”\n\n“We say goodbye to the restrictions and welcome the life we knew before,” she continued. “As of Feb. 1, Denmark will be open.”\n\nAccording to Danish Minister of Health Magnus Heunicke, the country is recording more than 46,000 new COVID-19 cases a day, but very few people are hospitalized, and even fewer are in intensive care units.\n\n“We continue with a strong epidemic surveillance,” said Heunicke. “Then we … can react quickly if necessary.”\n\n“It may seem strange that we want to remove restrictions given the high infection rates,” said Frederiksen. “But fewer people become seriously ill.”\n\n“The situation in Denmark is that we have this decoupling between infections and intensive care patients,” said Heunicke. “That is the reason why it is safe [to roll back restrictions] and the right thing to do now.”\n\nLife will fully return to normal by February\n\nDenmark started the process of loosening restrictions in mid-January after a month-long lockdown.\n\nWhen the lockdown ended, concert venues and cinemas were allowed to reopen and some other restrictions were loosened, but they remained. Limited hours for restaurants, mandatory masking and proof of COVID-19 vaccination were still required in most public spaces.\n\nStarting Feb. 1, nightclubs will be allowed to operate again and restaurants will be allowed to remain open past 10 p.m. Customers of either venue will no longer be required to present proof of vaccination upon entry.\n\nCommuters taking buses will no longer need to wear masks, and capacity limits placed on shops will be lifted.\n\nThe only restrictions that will remain are COVID-19 testing and isolation requirements for people entering the country. This requirement will remain in place until March.\n\nIn making this momentous move, Denmark follows in the footsteps of Ireland, the Netherlands and the United Kingdom. (Related: Lifting of Britain’s COVID-19 restrictions could be part of giant PSYOP to gain back people’s trust.)\n\nBut the three other aforementioned countries are keeping some COVID-19 measures in place. Denmark, on the other hand, is scrapping all of its domestic restrictions entirely.\n\nEngland was the first country to announce a loosening of restrictions, with Prime Minister Boris Johnson announcing an end to the mask mandate as part of the nation’s return to “Plan A” measures.\n\nIreland followed, with Prime Minister Micheal Martin announcing an end to the nation’s system of vaccine passports.\n\nEngland and Ireland were followed by Northern Ireland, Scotland and the Netherlands.\n\nMost of Europe is also putting in place plans to roll back most COVID-19 restrictions. Norway is planning to gradually get rid of restrictions since the country’s public health authorities have accepted that only “extreme” measures can deal with the omicron variant.\n\nEven France and Austria, which have been putting extreme pressure on the unvaccinated to take the vaccines, have begun relaxing some of its regulations.\n\nIsrael now #1 in covid cases per capita, proving all the draconian vaccinations, lockdowns and restrictions are utterly worthless and stupid.\n\nTruth will set you free: Danish newspaper apologizes for failing to report the truth about COVID pandemic.\n\nVaccine DAMAGE now ubiquitous in Denmark as “Omicron” hospitalizations occur primarily in “fully vaccinated.”\n\nWatch this clip of Prime Minister Mette Frederiksen announcing Denmark’s transition to a completely restriction-free society on Feb. 1.\n\nThis video can be found in the channel The Willow on Brighteon.com.\n\nLearn more about the state of COVID-19 pandemic restrictions around the world by reading the latest articles at Pandemic.news.", "opengraph": {"title": "Welcome to the life we knew before: Denmark is abolishing ALL COVID-19 restrictions", "type": "article", "url": "https://www.freedom.news/2022-01-29-denmark-abolishing-all-covid-restrictions.html", "site_name": "Freedom News", "description": "Denmark has announced that it will end all of its Wuhan coronavirus (COVID-19) restrictions by next week. Mette Frederiksen, prime minister of one of the world’s most vaccinated countries, said Denmark will not extend any of its pandemic measures beyond Jan. 31. “The pandemic is still here but with what we know, we now dare […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/01/covid-world-lockdown-lock.jpg"}, "tags": ["pandemic", "coronavirus restrictions", "government", "covid-19", "denmark", "Liberty", "medical fascism", "coronavirus lockdown", "outbreak", "COVID", "infections", "Medical Tyranny", "vaccines", "coronavirus", "Europe", "lockdown", "freedom", "Restrictions"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/europe/2022/01/28/denmark-abolishes-all-domestic-covid-restrictions-as-pm-says-the-country-can-smile-again/", "https://www.bloomberg.com/news/articles/2022-01-26/denmark-to-end-covid-curbs-as-premier-deems-critical-phase-over?sref=jB82HHlm", "https://www.newsweek.com/denmark-end-most-covid-restrictions-welcome-life-we-knew-before-1673373", "https://www.euronews.com/2022/01/27/us-health-coronavirus-denmark", "https://naturalnews.com/2022-01-25-lifting-of-british-covid-restrictions-giant-psyop.html", "https://pandemic.news/2022-01-26-israel-now-1-in-covid-cases-per-capita-proof-draconian-measures-worthless.html", "https://newstarget.com/2022-01-18-danish-paper-apologizes-for-not-reporting-truth.html", "https://health.news/2022-01-05-vaccine-damage-ubiquitous-in-denmark-omicron-hospitalizations-fully-vaccinated.html", "https://www.brighteon.com/5e9f80db-f384-4ab4-b8e5-0321768a45e7", "https://www.brighteon.com/5e9f80db-f384-4ab4-b8e5-0321768a45e7", "https://www.brighteon.com/channels/thewillow", "https://www.brighteon.com/channels/thewillow", "https://www.brighteon.com/channels/thewillow", "https://pandemic.news/", "https://www.breitbart.com/europe/2022/01/28/denmark-abolishes-all-domestic-covid-restrictions-as-pm-says-the-country-can-smile-again/", "https://www.bloomberg.com/news/articles/2022-01-26/denmark-to-end-covid-curbs-as-premier-deems-critical-phase-over?sref=jB82HHlm", "https://www.newsweek.com/denmark-end-most-covid-restrictions-welcome-life-we-knew-before-1673373", "https://www.euronews.com/2022/01/27/us-health-coronavirus-denmark", "https://www.brighteon.com/5e9f80db-f384-4ab4-b8e5-0321768a45e7", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}