{"result_id": "123031", "URL": "https://freedom.news/2023-03-09-biden-to-empower-who-via-pandemic-treaty.html", "timestamp": "2023-04-25 15:08:48 CEST+0200", "meta": {"description": "ReAwaken America Tour founder Clay Clark called viewers’ attention to President Joe Biden’s plan to commit the U.S. to a “legally binding” treaty with the globalist World Health Organization (WHO). During the March 1 episode of his Brighteon.TV program “Thrive Time Show,” Clark explained that if the U.S. commits to this treaty, the global health body would […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Brighteon.tv,Clay Clark,conspiracy,covid-19,deception,enslaved,freedom,globalists,IHR,insanity,Joe Biden,medical fascism,Medical Tyranny,pandemic,pandemic treaty,public health mandates,Reawaken America,Thrive Time Show,traitors,treason,UN,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-03-09-biden-to-empower-who-via-pandemic-treaty.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Clay Clark: Biden set to empower WHO via “legally binding” pandemic treaty – Brighteon.TV", "cleaned_text": "Clay Clark: Biden set to empower WHO via “legally binding” pandemic treaty – Brighteon.TV\n\nReAwaken America Tour founder Clay Clark called viewers’ attention to President Joe Biden’s plan to commit the U.S. to a “legally binding” treaty with the globalist World Health Organization (WHO).\n\nDuring the March 1 episode of his Brighteon.TV program “Thrive Time Show,” Clark explained that if the U.S. commits to this treaty, the global health body would supersede American sovereignty when it comes to public health policy in the event of a pandemic.\n\n“This document was supposed to be ratified on Feb. 27,” said Clark. “Most legal experts that I’ve met told me that they don’t see a way this would be stopped, but God can do anything.”\n\nIgnoring the massive negative feedback they got from WHO’s Wuhan coronavirus (COVID-19) response, U.S. Health Secretary Xavier Becerra and WHO Director-General Tedros Adhanom Ghebreyesus announced the “U.S.-WHO Strategic Dialogue” in September 2022, where they developed a “platform to protect and promote the health of all people around the globe, including the American people.”\n\nThis has given birth to the “zero draft” of a pandemic treaty, published on Feb. 1, which now seeks ratification by all 194 WHO member states. This means that once a health emergency is declared, all signatories would submit to the authority of the WHO regarding treatments, government regulations such as lockdowns and vaccine mandates, global supply chains and monitoring and surveillance of populations. This new international health accord avoids the necessary approval from the U.S. Senate. (Related: Dr. Francis Boyle tells Mike Adams: WHO Pandemic Treaty is a totalitarian, medical and scientific dictatorship.)\n\nClark outlines changes indicated in the pandemic treaty\n\nClark encouraged all his listeners to pray against it and proceeded to present how this treaty would affect people’s lives. “Change No. 1: The overall nature of WHO would move from an advisory organization providing merely recommendations to a governing body as per Article 1 of that document,” he said.\n\nThe second change greatly expands the scope of international health regulations to include scenarios that merely have a potential impact – which means draconian health rules can be imposed if they think something can potentially cause a global health issue. Meanwhile, the third change removes respect for dignity, human rights and fundamental freedoms of people.\n\n“The fourth change, which is written in Article 13-A, gives the WHO director-general – in the person of Tedros – control over the means of production,” Clark stated, adding that this will require state parties to supply pandemic response products, like face masks, as directed.\n\nThe fifth change would grant WHO the authority to require medical examinations, proof of prophylaxis and proof of vaccine and to implement contact tracing and treatments.\n\nMeanwhile, change No. 6 puts in place a system of global health certificates in the form of paper format and digital, including test certificates, vaccine certificates, prophylaxis certificates, recovery certificates, passenger locator forms and travelers’ health declarations.\n\nChange No. 7 is to redirect unspecified numbers of billions of dollars to the pharmaceutical hospital emergency industrial complex with zero accountability.\n\nCheck out MedicalTyranny.com for more stories related to the WHO pandemic accord.\n\nWatch the full March 1 episode of “Thrive Time Show” below. Catch new episodes of the program every weekday at 1-2 p.m. on Brighteon.TV.\n\nRED ALERT: New WHO pandemic treaty in final stages, would overrule the US Constitution and unleash medical dictatorship, warns Dr. Francis Boyle.\n\nWHO converging on Dec. 5-7 to discuss new “Pandemic Treaty” that would unleash a global medical dictatorship.\n\nWHO Pandemic Treaty will take away government oversight in the event of another pandemic, German MEP says.\n\nWHO Pandemic Treaty: A power-grabbing act to control health responses of UN member countries.", "opengraph": {"title": "Clay Clark: Biden set to empower WHO via “legally binding” pandemic treaty – Brighteon.TV", "type": "article", "url": "https://www.freedom.news/2023-03-09-biden-to-empower-who-via-pandemic-treaty.html", "site_name": "Freedom News", "description": "ReAwaken America Tour founder Clay Clark called viewers’ attention to President Joe Biden’s plan to commit the U.S. to a “legally binding” treaty with the globalist World Health Organization (WHO). During the March 1 episode of his Brighteon.TV program “Thrive Time Show,” Clark explained that if the U.S. commits to this treaty, the global health body would […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/03/WHO-snake-symbol.png"}, "tags": ["pandemic", "conspiracy", "big government", "IHR", "deception", "covid-19", "globalists", "Thrive Time Show", "Brighteon.tv", "public health mandates", "Reawaken America", "Joe Biden", "pandemic treaty", "UN", "enslaved", "treason", "Medical Tyranny", "insanity", "WHO", "medical fascism", "traitors", "freedom", "Clay Clark"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/52e31a73-25d9-41d3-9d55-ad66580e04bd", "https://brighteon.tv", "https://www.theepochtimes.com/biden-admin-negotiates-deal-to-give-who-authority-over-us-pandemic-policies_5066631.html?ea_src=ai&ea_med=search", "https://naturalnews.com/2022-11-28-who-pandemic-treaty-totalitarian-medical-scientific-dictatorship.html", "http://MedicalTyranny.com", "https://www.brighteon.com/52e31a73-25d9-41d3-9d55-ad66580e04bd", "https://brighteon.tv/home", "https://naturalnews.com/2022-11-22-who-pandemic-treaty-in-final-stages-overrule-us-constitution-medical-dictatorship.html", "https://healthfreedom.news/2022-12-06-who-converging-dec-5-discuss-pandemic-treaty.html", "https://conspiracy.news/2022-05-12-who-pandemic-treaty-takes-away-government-involvement.html", "https://deception.news/2022-04-01-who-pandemic-treaty-power-grabbing-act.html", "https://pandemic.news/2022-05-20-who-pandemic-treaty-spells-doom-for-democracy.html", "https://www.brighteon.com/52e31a73-25d9-41d3-9d55-ad66580e04bd", "https://www.theepochtimes.com/biden-admin-negotiates-deal-to-give-who-authority-over-us-pandemic-policies_5066631.html?ea_src=ai&ea_med=search", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-03-09-biden-to-empower-who-via-pandemic-treaty&linkname=Clay%20Clark%3A%20Biden%20set%20to%20empower%20WHO%20via%20%E2%80%9Clegally%20binding%E2%80%9D%20pandemic%20treaty%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}