{"result_id": "123009", "URL": "https://freedom.news/2021-05-06-florida-desantis-local-coronavirus-restrictions-vaccine-passport.html", "timestamp": "2023-04-25 15:08:35 CEST+0200", "meta": {"description": "Florida Gov. Ron DeSantis has suspended all local Wuhan coronavirus (COVID-19) pandemic emergency orders via executive order. The governor did this while also signing a bill banning the use of vaccine passports in the state. “The fact is, we are no longer in a state of emergency,” said DeSantis during a news conference. He said Florida […]", "lang": "en", "keywords": "coronavirus,coronavirus lockdown,covid-19,DeSantis,Florida,goodhealth,goodmedicine,goodscience,government,lockdowns,mask mandates,vaccine passport", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2021-05-06-florida-desantis-local-coronavirus-restrictions-vaccine-passport.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Florida Gov. DeSantis ENDS all local coronavirus restrictions and mandates, bans vaccine passports", "cleaned_text": "Florida Gov. Ron DeSantis has suspended all local Wuhan coronavirus (COVID-19) pandemic emergency orders via executive order. The governor did this while also signing a bill banning the use of vaccine passports in the state.\n\n“The fact is, we are no longer in a state of emergency,” said DeSantis during a news conference. He said Florida was not yet done fighting off the coronavirus, but that the steep decline in COVID-19 cases and deaths meant the country was no longer in dire straits.\n\nIn addition to his executive order, DeSantis also signed Senate Bill 2006 (SB 2006), which was passed by the Florida Legislature last month. This bill codifies DeSantis’ executive order into law.\n\nSB 2006, which comes into effect on July 1, will force emergency orders passed by local government entities to expire after seven days of the emergency being declared. The emergency declaration can only be extended for up to 42 days. The bill also allows the governor to invalidate local emergency orders.\n\nDeSantis said his executive order will “bridge the gap” until SB 2006 comes into effect by invalidating local emergency orders almost immediately.\n\n“I think that’s the evidence-based thing to do,” the governor added. “I think folks that are saying they need to be policing people at this point, if you’re saying that, then you’re really saying … you don’t believe in the data, you don’t believe in the science … We’ve embraced the science on it.”\n\nDeSantis pointed out that both his executive order and SB 2006 will only affect local governments, not businesses. Private entities will still be allowed to mandate that their patrons wear masks and practice social distancing.\n\n“In terms of what a supermarket or some of them choose to do … this does not deal with that one way or another,” he explained. “It’s simply emergency orders and emergency penalties on individual businesses.”\n\nSB 2006 also bans the use of vaccine passports in the state. The governor has been a very vocal opponent of vaccine passports, arguing it would create two classes of individuals: the vaccinated and the unvaccinated.\n\n“You have a right to participate in society, go to a restaurant, movie, a ball game, all these things without having to divulge [health and vaccination] information,” said DeSantis. (Related: How Florida beat coronavirus without masks or lockdowns, making California and New York look stupid by comparison.)\n\nDeSantis announced his executive order and the signing of SB 2006 in the city of St. Petersburg, in the West Peninsula region of the state. The city’s mayor, Rick Kriseman, a Democrat, voiced his opposition to the governor’s latest moves.\n\n“Forgive me if I want to follow the experts and the opinions of experts like the CDC,” said the Democrat during his appearance on a podcast the day after the announcement. “Not even quite 44 percent yet of the population of my county has been [at least partially] vaccinated. I was really hoping … to get at least above 50 percent vaccinations before we start looking at scaling back. But we’ve scaled back.”\n\nKriseman is a supporter of the 70 percent vaccinated population threshold that so-called public health experts say needs to be reached for an area to achieve herd immunity. He doubts that Florida will ever reach that quota.\n\n“Truthfully … 70 percent, we’re never going to see that, I mean, I’d love to say we would … [but] I don’t think we’ll hit it,” said the mayor, blaming it on the supposed politicization of the coronavirus pandemic.\n\nKriseman argued that DeSantis should be thanking him and other local officials who put lockdowns in place for keeping cases in the state down. When asked if the governor or the state legislature should have the power to invalidate a city or other local government’s COVID-19 restrictions, Kriseman said he does not think such power is “appropriate.”\n\n“I know what my community needs,” the mayor argued. “The governor doesn’t always know what each individual community needs because they’re not here. They don’t live here.”\n\nBefore the signing of the executive order, St. Petersburg had a mask mandate and a requirement for people in indoor business establishments to socially distance.\n\nOther Florida Democrats have raised their opposition to reopening the economy and removing the lockdowns. Miami-Dade County Mayor Daniella Levine Cava said she was “deeply concerned,” and argued that the state was still in a “public health emergency.” Former governor and current member of Congress Rep. Charlie Crist said DeSantis has shown a failure to lead the state, which forced local officials to become the main bulwark against the supposed rise of cases.\n\nLearn more about the states like Florida that are getting rid of their coronavirus restrictions, and the other states that are either keeping them up or making them worse at Pandemic.news.", "opengraph": {"title": "Florida Gov. DeSantis ENDS all local coronavirus restrictions and mandates, bans vaccine passports", "type": "article", "url": "https://www.freedom.news/2021-05-06-florida-desantis-local-coronavirus-restrictions-vaccine-passport.html", "site_name": "Freedom News", "description": "Florida Gov. Ron DeSantis has suspended all local Wuhan coronavirus (COVID-19) pandemic emergency orders via executive order. The governor did this while also signing a bill banning the use of vaccine passports in the state. “The fact is, we are no longer in a state of emergency,” said DeSantis during a news conference. He said Florida […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2021/05/Woman-Sad-Closed-Sign-Business-Lockdown.jpg"}, "tags": ["government", "covid-19", "coronavirus lockdown", "mask mandates", "Florida", "DeSantis", "coronavirus", "vaccine passport", "lockdowns"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/florida-gov-desantis-signs-bill-banning-vaccine-passports-suspends-local-covid-19-emergency-orders_3800683.html", "https://www.cnbc.com/2021/05/03/florida-governor-desantis-suspends-all-remaining-covid-restrictions.html", "https://abcnews.go.com/US/florida-officials-denounce-gov-ron-desantis-lift-covid/story?id=77483466", "https://vaccines.news/", "https://www.naturalnews.com/2021-03-10-how-florida-beat-coronavirus-without-masks-lockdowns.html", "https://pandemic.news/", "https://www.theepochtimes.com/florida-gov-desantis-signs-bill-banning-vaccine-passports-suspends-local-covid-19-emergency-orders_3800683.html", "https://www.cnbc.com/2021/05/03/florida-governor-desantis-suspends-all-remaining-covid-restrictions.html", "https://abcnews.go.com/US/florida-officials-denounce-gov-ron-desantis-lift-covid/story?id=77483466"], "authors": [], "publish_date": null}