{"result_id": "123001", "URL": "https://freedom.news/2021-04-16-naomi-wolf-bill-gates-destroying-western-freedom.html", "timestamp": "2023-04-25 15:08:29 CEST+0200", "meta": {"description": "Liberal author Naomi Wolf spoke the other day with conservative radio show host Eric Metaxas about billionaire eugenicist Bill Gates, whom she says is steering the entire world into medical police state tyranny. Gates, the World Economic Forum (WEF), and communist China are all part of a “hellish amalgamation,” Wolf says, that is issuing a […]", "lang": "en", "keywords": "bill gates,bio-security state,climate change,colonize,coronavirus,covid-19,depopulation,environment,evil,freedom,global warming,Liberty,Naomi Wolf,vaccination,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2021-04-16-naomi-wolf-bill-gates-destroying-western-freedom.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Naomi Wolf says Bill Gates is destroying Western freedom and ushering in a “bio-security state”", "cleaned_text": "Naomi Wolf says Bill Gates is destroying Western freedom and ushering in a “bio-security state”\n\nLiberal author Naomi Wolf spoke the other day with conservative radio show host Eric Metaxas about billionaire eugenicist Bill Gates, whom she says is steering the entire world into medical police state tyranny.\n\nGates, the World Economic Forum (WEF), and communist China are all part of a “hellish amalgamation,” Wolf says, that is issuing a “directive” to governments all around the world to keep everyone on lockdown for as long as possible.\n\nGates in particular is pushing what she describes as a “bio-security state in which the freedoms and liberties of the West will be suspended.” Meanwhile, the mainstream media and many government leaders still claim that Gates is just a “benevolent donor” and “world influencer.”\n\nContrary to how he presents himself, Gates is about as trustworthy as garden gnome Anthony Fauci. Both trolls have global depopulation on their minds, and Gates especially, thanks to his billions in ill-gotten gains, is actively advancing his eugenics agenda via the Wuhan coronavirus (Covid-19) plandemic.\n\n“When there’s a real pandemic, it doesn’t need PR,” Wolf notes about the sham. “There are false narratives at different inflection points in the whole house of cards.”\n\nWolf says the alleged deaths associated with the Chinese Virus are grossly overinflated all across the country. Meanwhile, deaths caused by Wuhan flu shots are being systematically ignored or covered up.\n\nMuch of this deception can be directly attributed to Gates, Wolf says.\n\n“Unfortunately the Bill and Melinda Gates Foundation funds our major media,” she is quoted as saying.\n\n“The New York Times got millions in funding; the Guardian got millions in funding; the CDC foundation gets $12-17 million a year from the Bill & Melinda Gates Foundation; the Telegraph gets millions, NPR gets millions.”\n\nWolf has spent a lot of time gathering this information from available sources. Her own personal investigation into the Gates Foundation’s financial records reveals a sordid tale of money flow from Gates to mostly the media, but also to K-12 education.\n\nGates is also heavily invested in Wuhan coronavirus (Covid-19) injections, “passports,” and other plandemic paraphernalia that he has been pushing aggressively ever since this whole thing began back in early 2020.\n\n“It’s a completely closed circle,” Wolf says about the Gates finance and influence empire.\n\n“So, the CDC does what Bill Gates wants, The New York Times does what Bill Gates wants, The Guardian does what Bill Gates wants.”\n\nThis system of “all-encompassing reach and influence,” Wolf warns, allows Gates and the many groups he funds to “attack” people like herself and other “independent influencers trying to simply tell the truth about what’s going on, or even have a discussion about it.”\n\nKeep in mind that Wolf is not a conservative. She used to provide political consultation for the presidential campaigns of both Bill Clinton and Al Gore. Wolf is, however, an acutely aware person who sees everything that is going on and is not okay with it.\n\nIt is a mistake, she says, to look at Gates and other globalist world leaders like normal people with hearts and souls because “they don’t think like us.”\n\n“They want to colonize the environment, they want to colonize the human body as business models, and so the pandemic and this whole buying up of influencers allows them to be the source for the updates and the boosters that this vaccine will require, according to Moderna’s own site,” Wolf warns.\n\n“It’s not science fiction; it’s just capitalism. But when you ask who is behind it, it’s not someone who’s thinking, ‘maybe I won’t suppress the free will and human creativity of human beings and mask their children forever because that’s a cruel thing to do.’ It’s just a kind of Asperger’s kind of psychopathic guy with too much power.”\n\nMore related news about Bill and Melinda Gates can be found at Evil.news.", "opengraph": {"title": "Naomi Wolf says Bill Gates is destroying Western freedom and ushering in a “bio-security state”", "type": "article", "url": "https://www.freedom.news/2021-04-16-naomi-wolf-bill-gates-destroying-western-freedom.html", "site_name": "Freedom News", "description": "Liberal author Naomi Wolf spoke the other day with conservative radio show host Eric Metaxas about billionaire eugenicist Bill Gates, whom she says is steering the entire world into medical police state tyranny. Gates, the World Economic Forum (WEF), and communist China are all part of a “hellish amalgamation,” Wolf says, that is issuing a […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2021/04/Editorial-Use-Bill-Gates-Awkward.jpg"}, "tags": ["global warming", "covid-19", "Liberty", "climate change", "evil", "Naomi Wolf", "colonize", "bio-security state", "bill gates", "depopulation", "environment", "vaccines", "coronavirus", "freedom", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/naomi-wolf-accuses-bill-gates-of-ushering-in-bio-security-state-attacking-freedoms-and-liberties-of-the-west", "http://evil.news", "https://www.lifesitenews.com/news/naomi-wolf-accuses-bill-gates-of-ushering-in-bio-security-state-attacking-freedoms-and-liberties-of-the-west", "https://www.naturalnews.com/2021-03-09-naomi-wolf-weve-reached-step-ten-of-the-10-steps-to-fascism.html"], "authors": [], "publish_date": null}