{"result_id": "123025", "URL": "https://freedom.news/2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database.html", "timestamp": "2023-04-25 15:08:45 CEST+0200", "meta": {"description": "Both houses of the New York State Legislature have passed bills that could pave the way for future legislation that will make it mandatory for adults to report all vaccinations and vaccination refusals to a state database. The two bills in question, A4132 in the State Assembly and S837 in the State Senate, are by themselves […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,conspiracy,covid-19,database,democrats,freedom,health freedom,insanity,medical fascism,Medical Tyranny,New York,privacy watch,state laws,state legislature,surveillance,vaccine database,vaccine tracking,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Recently passed New York state bills could pave way for future legislation mandating adult enrollment in state vaccination database", "cleaned_text": "Recently passed New York state bills could pave way for future legislation mandating adult enrollment in state vaccination database\n\nBoth houses of the New York State Legislature have passed bills that could pave the way for future legislation that will make it mandatory for adults to report all vaccinations and vaccination refusals to a state database.\n\nThe two bills in question, A4132 in the State Assembly and S837 in the State Senate, are by themselves not especially dangerous. These bills primarily protect the confidentiality of vaccine information held by state databases, as well as force institutions requiring immunization passports to accept valid Wuhan coronavirus (COVID-19) vaccination record cards.(Related: WATCHED: CDC purchased location data of 55M phone users to track them during COVID-19 lockdowns.)\n\nBut these bills could pave the way for the passage of S1531, a bill that would require healthcare providers that administer vaccinations to people at least 19 years old or older to report the vaccinations to relevant regional health organizations.\n\nIts primary sponsor is Democratic State Sen. Brad Hoylman-Sigal and it already has at least four other co-sponsors, all of whom are Democrats.\n\nS1531 has a long way to go before becoming state law. It needs to head to the floor several times, it must pass both the Senate and the House and then it must be signed by the governor. But with New York having a Democratic government trifecta, including supermajorities in both the Senate and the House, it is unlikely there will be any pushback to its passage from the legislature.\n\n“We believe that S1531 has the best chance of passing this session out of all the many very bad vaccine-related bills,” wrote the Autism Action Network. “The state wants this database for two simple reasons: To know who is and who is not complying with vaccine directives, and, therefore, to identify targets for enforcement measures. As we all know, this is exactly what school vaccine databases are used for.”\n\nAt least one other state, New Jersey, is also planning to introduce an electronic vaccination tracking system.\n\nThe proposed bill known as S3240 is currently in the New Jersey State Senate. Sponsored by Democrat Sen. Joseph Vitale, it seems to be modeled after New York’s own vaccination tracking bill. S3240 has already been passed by the State Senate Health Committee.\n\nIf it passes, the bill would require the automatic registration of any vaccine administered in the state with the New Jersey Immunization Information System (NJIIS), the state’s existing database of immunization records.\n\nThe NJIIS “consolidates immunization information from all providers into one record to provide an accurate immunization assessment and … assists state and federal agencies with population assessments in the event of a preventable disease outbreak and helps communities assess their immunization coverage and identify pockets of need.”\n\nThere is strong concern among health freedom advocates that the state government could use this registry to track COVID-19 vaccination compliance, with organizations like the Informed Consent Action Network warning that such a scenario is already occurring in neighboring New York.\n\nFortunately, both S1531 in New York and S3240 in New Jersey have opt-out options. The former provides a way for people who get vaccinated to not have their immunization data filed by their healthcare providers with the state database, simply by stating their objection “to the person who administers the vaccine, prior to the making of the report.”\n\nNew Jersey’s system provides an opt-out for people even if they are already in the system by simply providing a written request to the NJIIS to withdraw their information. Unfortunately, once S3240 passes, a person will automatically be enrolled in the NJIIS every time that person receives a vaccine. This forces people to submit written requests to withdraw every time.\n\nLearn more about government involvement in vaccination policy at Vaccines.news.\n\nWatch this video from InfoWars as host Owen Shroyer and guest Chris Sky discuss how data prove the excess deaths from the COVID-19 vaccine are worse than the deaths from COVID-19 itself.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nNetanyahu admits Israeli government partnered with Pfizer to compile genetic database of population.\n\nSenate committee passes bill creating national digital ID system, but they will never require it for voting.\n\nMass genetic surveillance: Police now seeking access to newborn blood samples to build DNA database for future criminal investigations.\n\nNO PRIVACY: Biden creating database of unvaccinated Americans with medical exemptions.", "opengraph": {"title": "Recently passed New York state bills could pave way for future legislation mandating adult enrollment in state vaccination database", "type": "article", "url": "https://www.freedom.news/2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database.html", "site_name": "Freedom News", "description": "Both houses of the New York State Legislature have passed bills that could pave the way for future legislation that will make it mandatory for adults to report all vaccinations and vaccination refusals to a state database. The two bills in question, A4132 in the State Assembly and S837 in the State Senate, are by themselves […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/03/Immunity-Vaccine-Passport-Phone-App-1.jpeg"}, "tags": ["conspiracy", "big government", "state laws", "privacy watch", "state legislature", "vaccine tracking", "covid-19", "New York", "vaccine wars", "database", "Medical Tyranny", "surveillance", "insanity", "vaccine database", "medical fascism", "vaccines", "democrats", "freedom", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/ny-red-alert-recently-passed-bill-clears-way-mandatory-adult-vaccine-database/5812580", "https://www.nysenate.gov/legislation/bills/2023/A4132", "https://www.naturalnews.com/2023-03-21-cdc-purchased-location-data-55m-cellphone-users.html", "https://www.nysenate.gov/legislation/bills/2023/S1531", "http://medicaltyranny.com", "https://nj1015.com/possible-electronic-vaccine-tracking-system-coming-to-nj-opinion/", "https://icandecide.org/press-release/attention-new-jersey-residents-automation-of-existing-vaccine-database-in-the-works/", "https://vaccines.news/", "https://www.brighteon.com/e1bacf4d-0009-4e44-a1f8-cd6b23f827d7", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.brighteon.com/channels/infowarsnetwork", "https://vaccines.news/2023-01-22-netanyahu-admits-israel-partnered-pfizer-genetic-database.html", "https://naturalnews.com/2022-11-28-thousands-law-enforcement-agencies-unlawfully-surveilling-americans.html", "https://surveillance.news/2022-11-01-senate-committee-bill-national-digital-id-system.html", "https://policestate.news/2022-08-04-police-seeking-access-newborn-blood-samples-investigations.html", "https://www.naturalnews.com/2022-01-29-biden-database-unvaccinated-americans-medical-exemptions.html", "https://www.globalresearch.ca/ny-red-alert-recently-passed-bill-clears-way-mandatory-adult-vaccine-database/5812580", "https://www.nysenate.gov/legislation/bills/2023/A4132", "https://www.nysenate.gov/legislation/bills/2023/S1531", "https://nj1015.com/possible-electronic-vaccine-tracking-system-coming-to-nj-opinion/", "https://icandecide.org/press-release/attention-new-jersey-residents-automation-of-existing-vaccine-database-in-the-works/", "https://www.brighteon.com/e1bacf4d-0009-4e44-a1f8-cd6b23f827d7", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database&linkname=Recently%20passed%20New%20York%20state%20bills%20could%20pave%20way%20for%20future%20legislation%20mandating%20adult%20enrollment%20in%20state%20vaccination%20database", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}