{"result_id": "123032", "URL": "https://freedom.news/2023-03-28-craigslist-helped-fund-censorship-industrial-complex.html", "timestamp": "2023-04-25 15:08:49 CEST+0200", "meta": {"description": "To help Democrats win more elections, Craig Newmark, the billionaire founder of Craigslist, has been funneling cash straight into what has come to be known as the Censorship-Industrial Complex, a public-private partnership between Big Tech and Big Government to stamp out the First Amendment online. It turns out that Newmark is the nation’s leading financier […]", "lang": "en", "keywords": "big government,Big Tech,Censorship,censorship-industrial complex,Collusion,conspiracy,Craig Newmark,Craigslist,disinfo,Elon Musk,First Amendment,Glitch,misinformation,outrage,speech police,technocrats,thought police", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-03-28-craigslist-helped-fund-censorship-industrial-complex.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Craig Newmark of Craigslist helped fund Censorship-Industrial Complex", "cleaned_text": "To help Democrats win more elections, Craig Newmark, the billionaire founder of Craigslist, has been funneling cash straight into what has come to be known as the Censorship-Industrial Complex, a public-private partnership between Big Tech and Big Government to stamp out the First Amendment online.\n\nIt turns out that Newmark is the nation’s leading financier of the “mis”- and “disinformation” industries, as well as the largest private stakeholder in the legacy journalism schools of the United States.\n\nWe learned all of this in the most recent Twitter Files drop from journalist Matt Taibbi, who has been unpacking the inner workings of the CIC and sharing his discoveries on Twitter and elsewhere.\n\n“They show Newmark is at the very heart of an incestuous web of government agencies, nonprofit organizations, and corporate media institutions operating in concert to censor political opponents on social media,” writes Eoin Lenihan, writing for The Federalist, about who Newmark really is.\n\n“Newmark is financing the largest coordinated assault on American free speech in living memory.”\n\nPre-Musk, Twitter functioned as the go-between for special interests to censor their online targets\n\nPrior to being taken over by billionaire electric vehicle (EV) guru Elon Musk, Twitter functioned as “a partner to government,” the Twitter Files show.\n\nWorking in concert with the Department of Homeland Security (DHS), the Federal Bureau of Investigation (FBI), the Department of Health and Human Services (HHS), the National Security Agency (NSA), local police, and even the United States Treasury, pre-Musk Twitter established an elaborate and wide-reaching censorship system, the tentacles of which resulted in thousands of accounts being deleted on demand.\n\nCalling this system for reporting and deleting accounts “shaky,” Taibbi revealed that numerous “legitimate” journalists and even leftist news outlets like TruthOut got caught in the censorship web, appearing on internal “disinformation” lists secretly held by Twitter executives and employees.\n\nBelieve it or not, the vast majority of requests for censorship did not actually come from Twitter itself. The social media platform was merely the go-between, functioning as a snitch-and-delete service for other powerful entities to use in their efforts to silence online free speech.\n\nA coalition of machine learning (i.e., artificial intelligence), internal human review, and outside “partnerships” allowed for the detection of “misinformation” on the site, which Twitter promptly deleted whenever it was notified about an “offensive” account or tweet.\n\nTaibbi is the one who came up with the term Censorship-Industrial Complex, to describe this censorship monster, which also included a working group comprised of the following “disinformation” non-governmental organizations (NGOs):\n\nFirst Draft\n\n Center for European Policy Analysis (CEPA)\n\n Alliance for Security Democracy (ASD)\n\n International Republican Institute (IRI)\n\n Atlantic Council / DRFLab\n\n Stanford Internet Observatory (SIO)\n\n Brookings\n\n National Endowment for Democracy (NED)\n\n National Democratic Institute (NDI)\n\nAs you might expect, a lot of money exchanged hands within this massive censorship system. Both the public and the private sector were involved, and figuring out which was which is difficult in that the relationships among them were incestuous and indicative of a revolving door between the government and private industry.\n\nConcerning Newmark, his largest donation to the Censorship-Industrial Complex went specifically to the Stanford Internet Observatory, to which he sent $5 million in funding back in 2019.\n\n“As it turns out, Newmark is not only quietly shaping the future of American journalism and politics, but he is spearheading government-NGO censorship and the misinformation industry with a win-at-all-costs mentality,” Lenihan says.\n\n“The Censorship-Industrial Complex represents the greatest threat to free speech online in living memory, and Craig Newmark is bankrolling it.”\n\nMore related news coverage about the scourge of censorship can be found at Censorship.news.", "opengraph": {"title": "Craig Newmark of Craigslist helped fund Censorship-Industrial Complex", "type": "article", "url": "https://www.freedom.news/2023-03-28-craigslist-helped-fund-censorship-industrial-complex.html", "site_name": "Freedom News", "description": "To help Democrats win more elections, Craig Newmark, the billionaire founder of Craigslist, has been funneling cash straight into what has come to be known as the Censorship-Industrial Complex, a public-private partnership between Big Tech and Big Government to stamp out the First Amendment online. It turns out that Newmark is the nation’s leading financier […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/03/Censorship-Censored-Type-Wall.jpg"}, "tags": ["conspiracy", "big government", "speech police", "Elon Musk", "technocrats", "Censorship", "Collusion", "Craig Newmark", "First Amendment", "thought police", "outrage", "disinfo", "misinformation", "Glitch", "Craigslist", "Big Tech", "censorship-industrial complex"], "tweets": [], "movies": [], "links": ["https://thefederalist.com/2023/03/21/craigslist-craig-funded-the-censorship-industrial-complex-to-silence-dissent-online/", "https://naturalnews.com/051115_Kevin_Folta_Monsanto_shill_Craigslist_ad.html", "http://censorship.news", "https://thefederalist.com/2023/03/21/craigslist-craig-funded-the-censorship-industrial-complex-to-silence-dissent-online/", "https://naturalnews.com/051115_Kevin_Folta_Monsanto_shill_Craigslist_ad.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-03-28-craigslist-helped-fund-censorship-industrial-complex&linkname=Craig%20Newmark%20of%20Craigslist%20helped%20fund%20Censorship-Industrial%20Complex", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}