{"result_id": "123039", "URL": "https://www.freedom.news/2021-09-20-sen-rand-not-planning-to-get-vaccinated-natural-immunity.html", "timestamp": "2023-04-25 15:08:53 CEST+0200", "meta": {"description": "Kentucky Sen. Rand Paul on Sunday, May 23, publicly announced that he does not plan to take the coronavirus (COVID-19) vaccine. Paul said he has natural immunity having already contracted and recovered from the disease. He was the first sitting member of the U.S. Senate to contract COVID-19, testing positive in March last year. “All […]", "lang": "en", "keywords": "adverse reactions,bad medicine,Big Pharma,coronavirus,COVID antibodies,covid-19,COVID-19 vaccine,Joe Biden,mRNA vaccine,natural immunity,nursing home,pandemic,Rand Paul,SARS-CoV-2", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.freedom.news/2021-09-20-sen-rand-not-planning-to-get-vaccinated-natural-immunity.html", "encoding": "UTF-8"}, "image": null, "domain": "www.freedom.news", "title": "Sen. Rand Paul does not plan to get COVID-19 vaccine, explains he has natural immunity which is vastly superior compared to artificial vaccine “immunity”", "cleaned_text": "Sen. Rand Paul does not plan to get COVID-19 vaccine, explains he has natural immunity which is vastly superior compared to artificial vaccine “immunity”\n\nKentucky Sen. Rand Paul on Sunday, May 23, publicly announced that he does not plan to take the coronavirus (COVID-19) vaccine.\n\nPaul said he has natural immunity having already contracted and recovered from the disease. He was the first sitting member of the U.S. Senate to contract COVID-19, testing positive in March last year.\n\n“All the studies show that I have just as good of immunity as the people who have been vaccinated,” Paul told billionaire businessman and radio talk show host John Catsimatidus on WABC.\n\nThe Republican senator said that he needs to see evidence that the available vaccines protect against harm from SARS-CoV-2 to a greater degree than prior infection.\n\n“Until they show me evidence that people who have already had the infection are dying in large numbers, or being hospitalized or getting very sick, I just made my own personal decision that I’m not getting vaccinated because I’ve already had the disease and I have natural immunity,” said Paul.\n\nA medical doctor himself, Paul challenged the idea that the government has to “force people to get vaccinated who already had COVID-19 and survived.” He noted that, as things stand, “all the studies show that [as someone who has recovered from COVID] I have just as good immunity as the people who’ve been vaccinated.”\n\n“First they have to prove the vaccine is better than being infected,” Paul said. “In a free country, you would think people would honor the idea that each individual would get to make the medical decision, that it wouldn’t be big brother coming to tell me what I have to do.”\n\nThe Centers for Disease Control and Prevention (CDC) guidance states that those who previously contracted the virus should still get vaccinated as “experts do not yet know how long you are protected from getting sick again after recovering from COVID-19.”\n\nPaul touched on a number of hot-button topics related to the COVID-19 crisis throughout the interview.\n\nHe mocked Dr. Anthony Fauci’s recent change in stance on mask-wearing. Fauci, currently the chief medical advisor to President Joe Biden, has aligned himself with the CDC regarding the use of masks after having received a full regimen of COVID-19 vaccines.\n\nPaul and Fauci had a little back and forth in recent months. During a congressional hearing in March, Paul derided Fauci’s recommendation that people wear a mask even if they’ve caught or gotten vaccinated against the coronavirus. (Related: Dr. Rand Paul doubles down, takes on Dr. Fauci and the coronavirus gain-of-function coverup.)\n\nThe senator suggested it’s just theater to mask up if you have already been immunized either through infection or vaccination and accused Fauci of making policy based on conjecture. “You’ve been vaccinated and you parade around in two masks for show,” Paul told Fauci during the hearing. “You want to get rid of vaccine hesitancy? Tell them they can quit wearing their masks after they get the vaccine.”\n\nFauci pushed back. “Well, let me just state for the record that masks are not theater. Masks are protective,” he said.\n\nThe director of the National Institute of Allergy and Infectious Diseases (NIAID) explained that COVID-19 variants circulating in the U.S. pose a threat even to people who previously got infected or vaccinated. Fauci said protection from a variant can be diminished “by anywhere from two-to-eightfold.” He also indicated the COVID-19 variants are a good reason for people who’ve gotten some level of immunity to still wear a mask.\n\nTheir spat continued in April when Paul called Fauci a petty tyrant after the country’s leading infectious disease ‘expert’ said those who have gotten the COVID-19 vaccine still cannot eat or drink indoors.\n\nFauci altered his position following a new CDC guideline that states “fully vaccinated” individuals do not need to continue wearing masks in all settings. Paul noted that Fauci effectively admitted that he didn’t want to be seen without a mask not because “the mask was doing any good for him,” but because “he was wearing it for theater.”\n\n“I don’t think our scientists that give us the ideas for how we should live our lives should be doing things based on theater. It ought to be based on facts,” Paul said.\n\nHe also criticized the ever-increasing assault by governments on basic civil liberties. “I think we should have a choice whether we take a vaccine or not,” he said. “Almost none of the things government told us to do changed the trajectory of this at all. The only thing that finally changed the trajectory and limited the virus spread was the vaccine and natural immunity.”\n\nKentucky Rep. Thomas Massie took to Twitter to show his support for Paul’s decision and announce his own intention not to take a COVID-19 vaccine since he also has recovered from infection.\n\n“Good for @RandPaul. I too am declining to take the vaccine, because I previously recovered from SARS-CoV-2 and it’s unlikely I would benefit from the vaccine at this point,” wrote Massie, a Republican like Paul. (Related: Wall Street Journal censored by Big Tech for daring to mention naturally-acquired covid-19 immunity.)\n\nPaul’s is not the first Republican lawmaker to openly scrutinize the vaccination of the previously infected. In a May 6 interview with conservative radio talk-show host Vicki McKenna, Wisconsin Sen. Ron Johnson questioned the effect of COVID vaccines on those who have previously been infected with COVID-19.\n\nMany medical professionals and immunologists across the globe share similar concerns.\n\nDr. Mark Hobart, an Australian physician, recently concluded that previously infected patients may be at a greater risk of dangerous developments in their health if they are given the vaccine. “Patients should not receive the vaccine if they are antibody positive,” he said.\n\nHobart said a previous infection with COVID-19 disposes patients to more severe side effects after taking vaccines against SARS-CoV-2. He referenced a peer-reviewed study outlining the phenomenon.\n\n“This trial found that if you vaccinate people who have previously had COVID-19 illness there is up to 112 percent increase of requiring hospitalization due to severe adverse reactions,” Hobart said, adding that AstraZeneca’s COVID-19 vaccine seemed to cause more problems than the Pfizer mRNA vaccine.\n\nOn account of the discovery, Hobart requested Australia’s chief medical officer to intervene and implement an order that nursing home patients must be tested for COVID antibodies before being offered a vaccine.\n\nFollow Immunization.news for more news and information related to coronavirus vaccines.", "opengraph": {"title": "Sen. Rand Paul does not plan to get COVID-19 vaccine, explains he has natural immunity which is vastly superior compared to artificial vaccine “immunity”", "type": "article", "url": "https://www.freedom.news/2021-09-20-sen-rand-not-planning-to-get-vaccinated-natural-immunity.html", "site_name": "Freedom News", "description": "Kentucky Sen. Rand Paul on Sunday, May 23, publicly announced that he does not plan to take the coronavirus (COVID-19) vaccine. Paul said he has natural immunity having already contracted and recovered from the disease. He was the first sitting member of the U.S. Senate to contract COVID-19, testing positive in March last year. “All […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2021/09/Editorial-Use-Rand-Paul-Fist.jpg"}, "tags": ["pandemic", "Joe Biden", "covid-19", "Big Pharma", "COVID-19 vaccine", "adverse reactions", "natural immunity", "Rand Paul", "nursing home", "COVID antibodies", "SARS-CoV-2", "coronavirus", "bad medicine", "mRNA vaccine"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/rand-paul-declares-he-wont-take-covid-vaccine-i-have-natural-immunity", "https://www.courier-journal.com/story/news/local/2021/05/23/paul-says-he-not-taking-covid-vaccine-because-natural-immunity/5233511001/", "https://www.courier-journal.com/story/news/politics/2021/03/18/rand-paul-vs-fauci-u-s-sen-doctor-clash-over-covid-vaccine-masks/4752513001/", "https://www.naturalnews.com/2021-05-18-dr-rand-paul-takes-on-dr-fauci-coronavirus-gain-of-function-coverup.html", "https://news.yahoo.com/fauci-vaccinated-people-shouldnt-dine-224809687.html", "https://www.naturalnews.com/2021-03-10-big-tech-censors-wsj-mentioning-natural-immunity.html", "http://immunization.news/", "https://www.lifesitenews.com/news/rand-paul-declares-he-wont-take-covid-vaccine-i-have-natural-immunity", "https://www.courier-journal.com/story/news/local/2021/05/23/paul-says-he-not-taking-covid-vaccine-because-natural-immunity/5233511001/", "https://www.courier-journal.com/story/news/politics/2021/03/18/rand-paul-vs-fauci-u-s-sen-doctor-clash-over-covid-vaccine-masks/4752513001/", "https://news.yahoo.com/fauci-vaccinated-people-shouldnt-dine-224809687.html"], "authors": [], "publish_date": null}