{"result_id": "123002", "URL": "https://freedom.news/2022-01-18-canada-expands-vaccine-mandate-violates-human-rights.html", "timestamp": "2023-04-25 15:08:30 CEST+0200", "meta": {"description": "In a bid to pressure the country’s unvaccinated population to take the experimental and dangerous Wuhan coronavirus (COVID-19) vaccines, Canada is expanding its vaccine mandate and enacting policies that are in violation of basic human rights. According to constitutional scholars, imposing vaccine mandates on the population violates multiple sections of the the Canadian Charter of Rights and Freedoms, […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Canada,coronavirus,covid-19,health freedom,human rights,insanity,intolerance,Justin Trudeau,Liberty,medical fascism,Medical Tyranny,pandemic,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2022-01-18-canada-expands-vaccine-mandate-violates-human-rights.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Canada expands COVID-19 vaccine mandate, violates basic human rights", "cleaned_text": "In a bid to pressure the country’s unvaccinated population to take the experimental and dangerous Wuhan coronavirus (COVID-19) vaccines, Canada is expanding its vaccine mandate and enacting policies that are in violation of basic human rights.\n\nAccording to constitutional scholars, imposing vaccine mandates on the population violates multiple sections of the the Canadian Charter of Rights and Freedoms, the country’s version of the Bill of Rights. These sections specifically guarantee the right of Canadians to life, liberty, security and protection under the law without discrimination. Vaccine mandates are inherently discriminatory and would violate this statute.\n\nKnowing that he needs more than a bill to convince holdouts to take the vaccine, Prime Minister Justin Trudeau has made multiple speeches blaming the unvaccinated for the rise in cases in the country. He called them “a small, fringe element in this country that is angry, that doesn’t believe in science, that is lashing out with racist, misogynistic attacks, and who are taking up space.”\n\n“Do we tolerate these people?” he continued. “And I know we’ll not allow those voices, those special interest groups, those protesters – I don’t even want to call them protesters, those anti-vaxxer mobs – to dictate how this country gets through this pandemic and how we recover our economy free from lockdown.”\n\nThe federal government announced its plan to make vaccinations mandatory late last year. According to Minister of Labor Seamus O’Regan Jr., federally regulated workplaces will have to make vaccinations mandatory for all their employees soon.\n\nThis vaccine mandate is an expansion of the one already in place for employees of the public sector, including those working in federally regulated air, rail and marine transportation sectors and the travelers on these modes of transportation.\n\n“Making vaccination mandatory across all federally regulated workplaces will protect workers, their families and their communities,” claimed O’Regan. “It will help us finish the fight against COVID-19 and help us sustain a strong and stable economic recovery.”\n\nAccording to Employment and Social Development Canada (ESDC), the department responsible for implementing labor policies, the federal government is still in the process of consulting with key stakeholders in the economy, including representatives from various small and medium-sized businesses, to talk about how they can implement the mandate.\n\nThe ESDC’s consultations are expected to finish soon and will cover what resources the federal government needs to help federally regulated workplaces implement the vaccine mandate. (Related: Canadian province gives businesses the “option” to ban unvaccinated from getting groceries.)\n\nIf this vaccine mandate pushes through, it would cover around 18,500 workplaces that altogether employ over 950,000 people.\n\nCanadian provinces could expand the vaccine mandate at their discretion\n\nMinister of Health Jean-Yves Duclos said that Canada’s provinces and territories are likely to introduce their vaccine mandates in response to the surge in COVID-19 cases in their respective territories.\n\n“What we see now is that our healthcare system in Canada is fragile, our people are tired and the only way that we know to get through COVID-19, this variant and any future variant, is through vaccination,” claimed Duclos.\n\nHe failed to point out that the majority of new cases in Canada are coming from the fully vaccinated. Duclos even claimed that in the province of Quebec, as many as 50 percent of hospitalizations due to COVID-19 are due to people not being vaccinated.\n\n“That’s a burden on healthcare workers, a burden on society which is very difficult to bear and for many people difficult to understand,” said Duclos. “That’s why I’m signaling that this is a conversation which I believe provinces and territories, in support with the federal government, will want to have over the next weeks and months.”\n\nThe rhetoric coming out of the federal government is united in trying to blame Canada’s unvaccinated population for the surge in cases. The more people believe this, the more likely there will be no resistance when the vaccine mandate is extended to all Canadians.\n\nWatch this video and learn about how businesses in Canada are beginning to implement “no vax, no service” policies.\n\nThis video can be found on the OnlyTruth4Me channel on Brighteon.com.\n\nLearn more about vaccine mandates in Canada and other parts of the world at Vaccines.news.", "opengraph": {"title": "Canada expands COVID-19 vaccine mandate, violates basic human rights", "type": "article", "url": "https://www.freedom.news/2022-01-18-canada-expands-vaccine-mandate-violates-human-rights.html", "site_name": "Freedom News", "description": "In a bid to pressure the country’s unvaccinated population to take the experimental and dangerous Wuhan coronavirus (COVID-19) vaccines, Canada is expanding its vaccine mandate and enacting policies that are in violation of basic human rights. According to constitutional scholars, imposing vaccine mandates on the population violates multiple sections of the the Canadian Charter of Rights and Freedoms, […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/01/Editorial-Use-Justin-Trudeau-Canada.jpg"}, "tags": ["pandemic", "covid-19", "big government", "human rights", "Liberty", "medical fascism", "vaccine wars", "Justin Trudeau", "intolerance", "Canada", "vaccine mandate", "Medical Tyranny", "vaccines", "coronavirus", "insanity", "health freedom"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/opinion/thanks-to-trudeau-and-a-complacent-majority-it-will-be-tough-to-make-canada-canada-again/", "https://www.canadianlawyermag.com/practice-areas/labour-and-employment/canada-to-enforce-mandatory-covid-19-vaccination-in-federally-regulated-workplaces/362630", "http://medicalfascism.news", "https://naturalnews.com/2021-12-17-canadian-province-businesses-option-to-ban-unvaccinated.html", "https://www.cbc.ca/news/politics/duclos-mandatory-vaccination-policies-on-way-1.6307398", "https://www.brighteon.com/4c68abbb-73c4-4884-8484-41d9e67c9ee4", "https://www.brighteon.com/channels/lilgem1", "https://www.brighteon.com/channels/lilgem1", "https://vaccines.news/", "https://www.lifesitenews.com/opinion/thanks-to-trudeau-and-a-complacent-majority-it-will-be-tough-to-make-canada-canada-again/", "https://www.canadianlawyermag.com/practice-areas/labour-and-employment/canada-to-enforce-mandatory-covid-19-vaccination-in-federally-regulated-workplaces/362630", "https://www.cbc.ca/news/politics/duclos-mandatory-vaccination-policies-on-way-1.6307398", "https://www.brighteon.com/4c68abbb-73c4-4884-8484-41d9e67c9ee4"], "authors": [], "publish_date": null}