{"result_id": "123028", "URL": "https://www.freedom.news/2022-05-20-who-pandemic-treaty-spells-doom-for-democracy.html", "timestamp": "2023-04-25 15:08:46 CEST+0200", "meta": {"description": "The World Health Organization (WHO) and the World Economic Forum (WEF) continue their assault on democracy as they begin a weeklong meeting Sunday, May 22, in Geneva, Switzerland. They seek to establish a pandemic treaty, which was recommended at a special session on December 1 last year by the World Health Assembly (WHA) – the decision-making body […]", "lang": "en", "keywords": "big government,Big Pharma,conspiracy,corruption,deception,fascism,freedom,global tyranny,globalists,health freedom,infections,insanity,Liberty,national security,outbreak,pandemic treaty,Plandemic,wef,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.freedom.news/2022-05-20-who-pandemic-treaty-spells-doom-for-democracy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.freedom.news", "title": "World Health Organization’s pandemic treaty spells DOOM for democracy", "cleaned_text": "The World Health Organization (WHO) and the World Economic Forum (WEF) continue their assault on democracy as they begin a weeklong meeting Sunday, May 22, in Geneva, Switzerland.\n\nThey seek to establish a pandemic treaty, which was recommended at a special session on December 1 last year by the World Health Assembly (WHA) – the decision-making body of the WHO.\n\nIf all goes according to plan, the WHO would have unprecedented, undemocratic jurisdiction over its 194 member nations. Under the treaty, the WHO could order mandatory vaccines, digital health IDs, lockdowns or anything else it wants as policy, regardless of what the public wants.\n\nThis means if a country signs up, its government would lose any sovereign power to decide its fate during another pandemic or other health crises. The WHO would have total control over the health regulations of all nations during pandemics or other health emergencies.\n\nThe World Council for Health has branded the proposed pandemic treat an “undemocratic farce.”\n\nWhile alternative and independent media have covered this significant and world-changing potential power-grab by the WHO, the corporate media mostly remains silent over the issue.\n\nHowever, after increasing pressure from concerned voters in the U.K., a few Members of Parliament (MPs) are now aware of plans by members of the WHO to discuss it in August 2022, make it law in 2023 and put it into practice by 2024. But in reality, countries like the U.K. are about to “cede authority and oversight” to the WHO with little to no communications, no debate and no referendum.\n\nAt the same time, both Prime Minister Boris Johnson and President Joe Biden have announced their support for the proposed treaty, making it harder for MPs and legislators to voice their disagreement.\n\nPandemic treaty could be abused in the guise of protecting the public\n\nAny vote in the WHA would be carried by a majority, but this means all member countries would be subject to the decision even if they disagreed due to a national democratic process. Additionally, any country not complying with WHO edicts may suffer economic sanctions.\n\nThe treaty would cover pandemic prevention, preparedness and response, but this could be abused in the guise of protecting the public. Under the treaty, interventions rejected in many countries like vaccine passports could become mandatory. (Related: Report: Wuhan scientists were ALLOWED TO REVISE Congressional briefing on COVID pandemic.)\n\nGovernments would be subject to decisions made by the WHO in relation to a pandemic as defined by the organization. Under the treaty, the WHO can determine what “the science” is.\n\nLike what happened during the Wuhan coronavirus (COVID-19) pandemic, experienced and qualified health practitioners with alternative views could be ignored.\n\nMeasures like lockdowns, testing and vaccinations can then be determined by the WHO. As a result, anyone who disagrees with WHO policies or was injured by them would have no choice as the organization will be considered “an unelected body with immunity from challenge in any national court.”\n\nDuring the WHO and the WEF meeting, changes may be made to existing authorities that can extend the power of the WHO before the introduction of the actual pandemic treaty. This is crucial because this may reduce individual rights.\n\nFinal voting on the treaty will be held next year and it is slated to be implemented by 2024. According to the WHO, it will only be open to further consultative input until June 16 and 17.\n\nAccording to the WHO website, many donors come from countries or their established agencies. However, the second largest contributor to the WHO finances from 2020 to 2021 was the Bill and Melinda Gates Foundation, which contributed $751,000,000.\n\nThe sponsorship of the WHO by pharmaceutical companies is allegedly at 70 percent because within the countries listed as donors to the WHO, most of the donations are made by interested bodies like Big Pharma instead of governments themselves.\n\nWatch the video below for proof that the COVID-19 pandemic was a planned crisis.\n\nThis video is from the Corruption Exposure channel on Brighteon.com.\n\nWHO now says three times more people died from “covid” than previously reported, but clearly it was the jabs.\n\nUN whistleblower says World Health Organization is “tip of the spear” for global tyranny.\n\nJAB ‘EM YOUNG: FDA approves Pfizer’s booster vaccine for children aged 5 to 11 without consulting vaccine advisory panel.\n\nEXCLUSIVE: Cobalt-60 dirty bombs combined with mRNA vaccine suppression of chromosomal repair mechanism could unleash CANCER DEATH WAVE across America and vaccine-compliant nations.\n\n6 Elderly residents at Palo Alto nursing home DEAD within a week after getting injected with COVID vaccines.", "opengraph": {"title": "World Health Organization’s pandemic treaty spells DOOM for democracy", "type": "article", "url": "https://www.freedom.news/2022-05-20-who-pandemic-treaty-spells-doom-for-democracy.html", "site_name": "Freedom News", "description": "The World Health Organization (WHO) and the World Economic Forum (WEF) continue their assault on democracy as they begin a weeklong meeting Sunday, May 22, in Geneva, Switzerland. They seek to establish a pandemic treaty, which was recommended at a special session on December 1 last year by the World Health Assembly (WHA) – the decision-making body […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/05/WHO-symbol.jpg"}, "tags": ["conspiracy", "big government", "Liberty", "Big Pharma", "national security", "outbreak", "deception", "corruption", "globalists", "wef", "pandemic treaty", "infections", "global tyranny", "insanity", "WHO", "fascism", "freedom", "health freedom", "Plandemic"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/05/18/pandemic-treaty-a-clear-and-present-threat-to-democracy/", "https://uncut.substack.com/p/world-health-organisation-treaty?s=r", "https://www.who.int/news/item/01-12-2021-world-health-assembly-agrees-to-launch-process-to-develop-historic-global-accord-on-pandemic-prevention-preparedness-and-response", "https://naturalnews.com/2022-04-07-wuhan-scientists-revised-congressional-covid-briefing.html", "http://nationalsecurity.news", "http://bigpharmanews.com", "https://www.brighteon.com/4c6b5b9f-8d8d-4c14-bd43-f659961ab6a1", "https://www.brighteon.com/channels/corruptionexposure", "https://naturalnews.com/2022-05-06-who-three-times-died-covid-clearly-jabs.html", "https://naturalnews.com/2022-05-04-un-whistleblower-who-tip-spear-global-tyranny.html", "https://www.naturalnews.com/2022-05-18-fda-approves-pfizer-booster-vaccine-for-children.html", "https://www.naturalnews.com/2022-05-18-cobalt-dirty-bombs-mrna-vaccine-suppression-chromosomes-cancer-death-wave.html", "https://www.naturalnews.com/2022-05-18-6-nursing-home-residents-dead-after-vaccination.html", "https://expose-news.com/2022/05/18/pandemic-treaty-a-clear-and-present-threat-to-democracy/", "https://uncut.substack.com/p/world-health-organisation-treaty?s=r", "https://www.who.int/news/item/01-12-2021-world-health-assembly-agrees-to-launch-process-to-develop-historic-global-accord-on-pandemic-prevention-preparedness-and-response", "https://www.brighteon.com/4c6b5b9f-8d8d-4c14-bd43-f659961ab6a1", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2022-05-20-who-pandemic-treaty-spells-doom-for-democracy&linkname=World%20Health%20Organization%E2%80%99s%20pandemic%20treaty%20spells%20DOOM%20for%20democracy", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}