{"result_id": "123034", "URL": "https://freedom.news/2023-02-17-christopher-key-vaccine-police-jail-face-diaper.html", "timestamp": "2023-04-25 15:08:50 CEST+0200", "meta": {"description": "On Valentine’s Day, Christopher Key of “Vaccine Police” uploaded a video plea to Telegram asking for help in a legal case he is facing that threatens a month-long jail sentence for his refusal to wear a Wuhan coronavirus (Covid-19) face mask. Key uploaded another video the day after Valentine’s Day indicating that he did not […]", "lang": "en", "keywords": "badhealth,badmedicine,Christopher Key,court,COVID,freedom,health freedom,jail,Kandice Pickett,Liberty,mask,medical martial law,Medical Tyranny,religious freedom,Resist,Tyranny,vaccine police", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-02-17-christopher-key-vaccine-police-jail-face-diaper.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Christopher Key of “Vaccine Police” faced 30-day jail sentence for refusing to wear covid face diaper in court – but was spared jail time (for now)", "cleaned_text": "Christopher Key of “Vaccine Police” faced 30-day jail sentence for refusing to wear covid face diaper in court – but was spared jail time (for now)\n\nOn Valentine’s Day, Christopher Key of “Vaccine Police” uploaded a video plea to Telegram asking for help in a legal case he is facing that threatens a month-long jail sentence for his refusal to wear a Wuhan coronavirus (Covid-19) face mask.\n\nKey uploaded another video the day after Valentine’s Day indicating that he did not go to jail the day prior as expected, but he could still be sentenced at a later date and needs your help.\n\nKey asked supporters to call Justice Kandice Pickett, who is presiding over the case, to “tell her to drop this ridiculous case with prejudice.” It appears this call for help was successful the day of his hearing, but there is more work to be done.\n\n“God is fabulous,” Key said in his update. “I didn’t go to jail today.”\n\n“The Judge did not care about my 3 notices to offer remedy. Billy filed a motion to dismiss, and she refused. Billy asked her to write an order of why she didn’t dismiss, and we will be appealing it Alabama state Supreme Court.”\n\nIf you think that people should be free to not cover their faces and not go to jail, you can help Key by calling Jefferson County (Alabama) District Attorney Danny Carr at [email protected]\n\nIf you support medical freedom, help Christopher Key by making your voice heard\n\nIn his first video, a forlorn Key explained some of the detail of his case and what he faces at the hands of the State of Alabama.\n\n“You can see behind me the swastika where I am about to go into the lion’s den. I have a case today before Judge Pickett where I have been sentenced to jail in 30 days from Judge Ross. Why? Because I failed to cover my face and have my temperature taken by a 20-year-old kid and have seven medical questions answered.”\n\n“I believe this is unlawful, this is illegal, this is unconstitutional, and I am standing up for my constitutional rights – but more importantly, I’m standing up for you because if they can do this to me, then they can do this to any of us. And I still believe that this is the land of the free and home of the brave.”\n\nKey says he is fighting this good fight because he believes he is called to do so by “my Lord and Savior Jesus Christ.”\n\n“And I believe if we don’t stand up to this tyranny,” he added, “this once-great country will have fallen. I believe this is as important as Rosa Parks not giving up her seat on the bus.”\n\nKey says he will never, ever cover his face because to do so would be to spit in the image of God.”\n\n“I can’t go and speak God’s word if my face is covered,” he said, adding that he will also never get “vaccinated” for covid no matter what.\n\n“I will never put that poison in my temple – that is my belief, and that is what I’m fighting for. I don’t need the government telling me how to take care of my temple.”\n\nCheck out Key’s Telegrams and help support him if you, too, oppose government tyranny, which is still going on a full three years after the “virus” first appeared.\n\nMore of the latest news about covid can be found at Tyranny.news.", "opengraph": {"title": "Christopher Key of “Vaccine Police” faced 30-day jail sentence for refusing to wear covid face diaper in court – but was spared jail time (for now)", "type": "article", "url": "https://www.freedom.news/2023-02-17-christopher-key-vaccine-police-jail-face-diaper.html", "site_name": "Freedom News", "description": "On Valentine’s Day, Christopher Key of “Vaccine Police” uploaded a video plea to Telegram asking for help in a legal case he is facing that threatens a month-long jail sentence for his refusal to wear a Wuhan coronavirus (Covid-19) face mask. Key uploaded another video the day after Valentine’s Day indicating that he did not […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/02/Mask-Close-Up-Pandemic-Covid-19.jpg"}, "tags": ["Liberty", "Kandice Pickett", "Christopher Key", "religious freedom", "vaccine police", "Resist", "COVID", "mask", "Medical Tyranny", "court", "jail", "freedom", "health freedom", "medical martial law", "Tyranny"], "tweets": [], "movies": [], "links": ["https://t.me/vaccinepolice/6157", "https://t.me/vaccinepolice/6159", "/cdn-cgi/l/email-protection", "https://naturalnews.com/2022-03-03-covid-face-masks-dangerous-levels-titanium-dioxide.html", "http://tyranny.news", "https://t.me/vaccinepolice/6157", "https://t.me/vaccinepolice/6159", "https://naturalnews.com/2022-03-03-covid-face-masks-dangerous-levels-titanium-dioxide.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-02-17-christopher-key-vaccine-police-jail-face-diaper&linkname=Christopher%20Key%20of%20%E2%80%9CVaccine%20Police%E2%80%9D%20faced%2030-day%20jail%20sentence%20for%20refusing%20to%20wear%20covid%20face%20diaper%20in%20court%20%E2%80%93%20but%20was%20spared%20jail%20time%20%28for%20now%29", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}