{"result_id": "123033", "URL": "https://freedom.news/2022-01-13-vaccination-mandate-sparks-rallies-in-prague.html", "timestamp": "2023-04-25 15:08:49 CEST+0200", "meta": {"description": "Protesters at Wenceslas Square in Central Prague questioned the effectiveness of the current vaccines and went on to reject the vaccination of children as the government ordered compulsory COVID-19 vaccination for individuals in different groups and professions. The nation of 10.7 million already fully vaccinated 6.7 million, while over 2.8 million received their booster shots. The […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,coronavirus,covid-19,Czech Republic,health freedom,medical fascism,Medical Tyranny,pandemic,Prague,Resist,revolt,uprising,vaccine mandates,vaccine passports,vaccine wars,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2022-01-13-vaccination-mandate-sparks-rallies-in-prague.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Vaccination mandate sparks rallies in Prague and other cities", "cleaned_text": "Vaccination mandate sparks rallies in Prague and other cities\n\nProtesters at Wenceslas Square in Central Prague questioned the effectiveness of the current vaccines and went on to reject the vaccination of children as the government ordered compulsory COVID-19 vaccination for individuals in different groups and professions. The nation of 10.7 million already fully vaccinated 6.7 million, while over 2.8 million received their booster shots.\n\nThe protest followed smaller demonstrations in smaller cities in the Czech Republic on Saturday, as the previous government released an order in early December that made vaccination mandatory for those in the 60 and over age group as well as for medical personnel, police officers, firefighters and medical students. Protests took place in Ústí nad Labem, Olomouc, Karlovy Vary and others, although the highest turnout was in Brno, with a reported 2,000-strong turnout.\n\nBecause the order will not be in effect until March, it can still get overturned as Prime Minister Andrej Babis’ administration was replaced later in December by a new one formed by five parties that won October’s parliamentary election and is now led by Prime Minister Petr Fiala.\n\nWhile the new administration opposed the mandates for the older population, it did not rule out the possibility that it may remain compulsory for some, depending on the development of the Wuhan coronavirus (COVID-19) pandemic in the country. The government is expected to announce the final decision about the mandate by the middle of February.\n\nMeanwhile, health authorities expect the omicron variant to become the dominant strain in the country beginning next week, while countries around the globe are now dealing with a winter surge of the infections driven mostly by the omicron variant, which, though less severe than previous strains, remain more infectious.\n\nNo major incidents were reported following the rallies, though the Brno crowd was said to have ignored police requests to observe social distancing and other safety measures.\n\nThe Otev?eme ?esko (We Will Open Czechia) group of protesters originally formed to protest the closure of restaurants and other venues during the height of the restrictions in the country, but they are now focusing on measures related to vaccination, as mandatory vaccination for select groups is being considered.\n\nOn Friday, January 7, the Czech Republic reported 6,666 new COVID-19 cases, which is about 1,700 more than just a week ago, according to their Health Ministry. The number of patients hospitalized, however, has decreased, with around 2,500 patients reported, compared to 3,120 the previous Friday. Their incidence rate is now at 404 cases per 100,000 people in the last seven days.\n\nAccording to employees of the Prague water supply company, they were able to detect the presence of the omicron variant using a new device at the city’s Central Wastewater Treatment Plant on Císa?ský Ostrov. The new method of testing will be carried out at other treatment plants as well, according to PVK spokesperson Tomáš Mrázek. (Related: Defeat the Mandates: Rally for personal liberty and health freedom launches Jan 23.)\n\nWastewater samples have been tested for COVID in a number of places, including schools and the Prague airport, however, the government only tested for earlier variants.\n\nThe testing method uses a special device in the sewer of any given facility, which gathers the samples that PVK employees take to the laboratory at regular intervals.\n\nCOVID-positive employees in some institutions may be allowed to work\n\nHealth Minister Vlastimil Válek told the media that the government is now considering allowing employees of selected institutions to work despite testing positive for COVID-19. He said that the Interior Ministry has been tasked to choose critical bodies of infrastructure that are indispensable for state operations and whose employees would be able to work despite being quarantined with COVID-19. The same will be true for social and health care workers and school staff as well, according to Válek following negotiations with representatives of the employers and the Czech Chamber of Commerce.\n\nWatch the video below for more information on how the Czech Republic is handling the pandemic.\n\nThis video is from the “Truth or Consequences” channel on Brighteon.com.\n\nGo to Pandemic.news for more updates on COVID-19 around the world.", "opengraph": {"title": "Vaccination mandate sparks rallies in Prague and other cities", "type": "article", "url": "https://www.freedom.news/2022-01-13-vaccination-mandate-sparks-rallies-in-prague.html", "site_name": "Freedom News", "description": "Protesters at Wenceslas Square in Central Prague questioned the effectiveness of the current vaccines and went on to reject the vaccination of children as the government ordered compulsory COVID-19 vaccination for individuals in different groups and professions. The nation of 10.7 million already fully vaccinated 6.7 million, while over 2.8 million received their booster shots. The […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/01/Crowd-Protest-People-Street-Riot-Large-Democracy.jpg"}, "tags": ["pandemic", "vaccine passports", "big government", "covid-19", "medical fascism", "vaccine wars", "Czech Republic", "Resist", "revolt", "vaccine mandates", "Medical Tyranny", "coronavirus", "health freedom", "Wuhan coronavirus", "uprising", "Prague"], "tweets": [], "movies": [], "links": ["https://headlineusa.com/protest-prague-against-vax-mandate/", "https://www.expats.cz/czech-news/article/czech-republic-weekly-coronavirus-news-for-january-3-9", "https://thehill.com/policy/healthcare/public-global-health/588935-prague-protest-draws-thousands-against-vaccine-mandate", "https://naturalnews.com/2022-01-06-defeat-the-mandates-rally-about-personal-liberty.html", "https://www.brighteon.com/c52a7492-02d0-4925-af43-883b022a8e75", "https://www.brighteon.com/channels/triplee495", "http://Pandemic.news", "https://headlineusa.com/protest-prague-against-vax-mandate/", "https://www.expats.cz/czech-news/article/czech-republic-weekly-coronavirus-news-for-january-3-9", "https://thehill.com/policy/healthcare/public-global-health/588935-prague-protest-draws-thousands-against-vaccine-mandate?rl=1"], "authors": [], "publish_date": null}