{"result_id": "123020", "URL": "https://freedom.news/2023-02-14-who-new-chief-globalist-pushing-transhumanist-agenda.html", "timestamp": "2023-04-25 15:08:42 CEST+0200", "meta": {"description": "The new chief scientist for global health at the globalist-run World Health Organization (WHO) is a pusher of transhumanism who is working behind the scenes with other globalists to usher in a Fourth Industrial Revolution controlled by transhuman artificial intelligence (AI) robots. The founder of Wellcome Leap, Jeremy Farrar, formerly of the Wellcome Trust, was […]", "lang": "en", "keywords": "AI,badhealth,badmedicine,computing,conspiracy,deception,enslaved,eugenics,Fourth Industrial Revolution,future tech,Globalism,great reset,health freedom,information technology,insanity,Jeremy Farrar,lunatics,medical fascism,Medical Tyranny,pandemic treaty,psycho,transhumanism,Tyranny,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-02-14-who-new-chief-globalist-pushing-transhumanist-agenda.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "WHO’s new global health chief is a globalist pushing a transhumanist agenda", "cleaned_text": "The new chief scientist for global health at the globalist-run World Health Organization (WHO) is a pusher of transhumanism who is working behind the scenes with other globalists to usher in a Fourth Industrial Revolution controlled by transhuman artificial intelligence (AI) robots.\n\nThe founder of Wellcome Leap, Jeremy Farrar, formerly of the Wellcome Trust, was complicit in the covid coverup. He is also at the forefront of the modern eugenics movement, holding quiet ties to a technocratic globalist network that is aiming for total world control by 2030.\n\n“Farrar has been on the forefront pushing the envelope on vaccine development, such that experimental gene therapy is now used as a preventive for viral infection,” explains Dr. Joseph Mercola. “When COVID broke out, Farrar founded Wellcome Leap, which is basically the DARPA of global public health. Its focus is wholly on transhumanist research to usher in the Fourth Industrial Revolution.”\n\n“Farrar and WHO director-general Tedros Adhanom Ghebreyesus are part of a small and tight-knit but global network that is working behind the scenes to influence global health, finance, and governance.”\n\nWhat new experimental drugs does Farrar have planned for the next scamdemic?\n\nFarrar’s official duties at the WHO include “to develop and deliver high quality health services.” What this means in the post-covid era is ominous in light of the coming Pandemic Treaty, which is scheduled to be signed this spring.\n\nOnce the Pandemic Treaty becomes solidified, Farrar will attain “unprecedented power and influence” over the world, Mercola warns, “as member nations will have no choice but to adhere to his medical recommendations.”\n\n“What’s so concerning about that is his willingness to embrace reckless science and transhumanist pie-in-the-sky ideals,” Mercola adds.\n\nFarrar was a heavy promoter of covid “vaccines,” as well as other experimental drugs and “gene therapies” for viral infections. We can only guess what new experimental drugs he plans to push once the next scamdemic arrives.\n\nInvestigative journalist Whitney Webb says that Farrar’s addition to the WHO is “a recipe for disaster when it comes to imposing experimental medical technologies on the population during public health crises.”\n\n“This is a guy who was very much invested in this stuff,” she adds.\n\n“In terms of the kinds of pandemic response policies he supports, it’s lockdowns, masks – essentially all of that stuff. And he was the architect of a lot of that, specifically for the WHO during COVID-19. He has consistently supported policies that really, ultimately, have little to do with public health.”\n\nWith Webb at the helm, the WHO will finish the planned merger between the medical industry and both Big Tech and the military-intelligence complex. Once that is complete, a global system of bio-surveillance run by transhuman AI will ensue.\n\nYuval Noah Harari, the World Economic Forum’s (WEF) transhumanist “guru,” recently announced the soon unveiling of wearable and / or implantable surveillance technologies that the globalists, including Farrar at the WHO, plan to use “to wipe out dissent, because even if you outwardly act like you agree with leadership and are supportive of certain agendas and policies, but you’re internally not, the government will know.”\n\nThis is no doubt the agenda behind Farrar’s appointment to the WHO, which is at the forefront of the global AI rollout. If you thought things were bad now, a much worse hell is soon to be rolled out by the WHO, with Farrar as captain.\n\nThe latest news about the globalist quest to turn the entire world transhuman can be found at Transhumanism.news.", "opengraph": {"title": "WHO’s new global health chief is a globalist pushing a transhumanist agenda", "type": "article", "url": "https://www.freedom.news/2023-02-14-who-new-chief-globalist-pushing-transhumanist-agenda.html", "site_name": "Freedom News", "description": "The new chief scientist for global health at the globalist-run World Health Organization (WHO) is a pusher of transhumanism who is working behind the scenes with other globalists to usher in a Fourth Industrial Revolution controlled by transhuman artificial intelligence (AI) robots. The founder of Wellcome Leap, Jeremy Farrar, formerly of the Wellcome Trust, was […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/02/WHO-snake-symbol.png"}, "tags": ["conspiracy", "AI", "great reset", "lunatics", "deception", "psycho", "future tech", "Fourth Industrial Revolution", "pandemic treaty", "enslaved", "Jeremy Farrar", "information technology", "computing", "Medical Tyranny", "insanity", "WHO", "Tyranny", "medical fascism", "eugenics", "transhumanism", "health freedom", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/opinion/whos-new-global-health-chief-has-close-ties-to-globalist-cabal-transhumanist-agenda/", "https://naturalnews.com/2021-06-16-jeremy-farrar-conspired-with-fauci-daszak-stifle-lab-leak-theory.html", "http://transhumanism.news", "https://www.lifesitenews.com/opinion/whos-new-global-health-chief-has-close-ties-to-globalist-cabal-transhumanist-agenda/", "https://naturalnews.com/2021-06-16-jeremy-farrar-conspired-with-fauci-daszak-stifle-lab-leak-theory.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-02-14-who-new-chief-globalist-pushing-transhumanist-agenda&linkname=WHO%E2%80%99s%20new%20global%20health%20chief%20is%20a%20globalist%20pushing%20a%20transhumanist%20agenda", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}