{"result_id": "123024", "URL": "https://freedom.news/2023-04-02-nhl-players-refused-to-wear-rainbow-jerseys.html", "timestamp": "2023-04-25 15:08:44 CEST+0200", "meta": {"description": "The National Hockey League (NHL) is currently assessing whether to continue holding so-called “Pride Nights” after players refused to wear LGBT rainbow jerseys. During the “non-hockey” program, all teams in the league wear jerseys celebrating the LGBT community either during warmup sessions, games or both. However, some teams now do so without putting on the […]", "lang": "en", "keywords": "Christian beliefs,culture wars,fascism,gay mafia,hockey players,identity politics,insanity,left cult,LGBT,National Hockey League,NHL,Pride jerseys,Pride Nights,protest,rainbow jerseys,Resist,revolt,Russia,sports,trans cult,transgender,uprising", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2023-04-02-nhl-players-refused-to-wear-rainbow-jerseys.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Silent protest: NHL may cancel Pride Nights after players REFUSED to wear rainbow jerseys that try to TAG them as trans advocates", "cleaned_text": "Silent protest: NHL may cancel Pride Nights after players REFUSED to wear rainbow jerseys that try to TAG them as trans advocates\n\nThe National Hockey League (NHL) is currently assessing whether to continue holding so-called “Pride Nights” after players refused to wear LGBT rainbow jerseys.\n\nDuring the “non-hockey” program, all teams in the league wear jerseys celebrating the LGBT community either during warmup sessions, games or both. However, some teams now do so without putting on the rainbow uniforms.\n\nSpeaking to CTV News, NHL Commissioner Gary Bettman said this was the first time the league experienced such silent protests. He told the outlet: “I think it’s something that we’re going to have to evaluate in the off-season.”\n\n“This is one issue where players, for a variety of reasons, may not feel comfortable wearing the uniform as a form of endorsement. But I think that’s become more of a distraction now – because the substance of what our teams and we have been doing and stand for is really being pushed to the side for what is a handful of players basically [making] personal decisions. You have to respect that as well.”\n\nWhile a total of 14 NHL teams still have Pride Nights planned for the remainder of the 2022 to 2023 season, a HockeyFeed article remarked that the league ought to do away with Pride Night and all other pre-game celebrations.\n\n“So that means no more Pride Night, no more Military Appreciation Night, no more Serve and Protect Night and no more national anthems before the game,” the piece stated. “It’s hockey, let’s leave identity politics and world issues for their time and place.”\n\nSiblings Eric and Marc Staal, who both play for the Florida Panthers, refused to wear the Pride jerseys – citing their Christian beliefs. They said in a statement: “We carry no judgment on how people choose to live their lives and believe that all people should be welcome in all aspects of the game of hockey. Having said that, we feel that by us wearing a Pride jersey, it goes against our Christian beliefs.”\n\nJames Reimer of the San Jose Sharks and Ivan Provorov of the Philadelphia Flyers also refused to put on the rainbow jerseys. Meanwhile, Ilya Lyubushkin of the Buffalo Sabres said he would not participate in a warmup when the team is scheduled to wear Pride jerseys.\n\nPride Nights have serious repercussions for Russian players\n\nIt is worth noting that most of the NHL players refusing to wear the Pride jerseys hail from Russia, which has stringent laws against promoting LGBT. The Flyers’ Provorov, for example, was among the players who opted out of participating in Pride Night warmups back in January – citing his religious beliefs as a member of the Russian Orthodox Church.\n\nA March 10 report by the Athletic expounded on this issue, this time involving the Minnesota Wild hockey team. The Wild originally planned to wear the Pride jerseys on March 7, and even set up an auction site where fans could bid on a Pride jersey that was worn by a player. However, the site was later taken down.\n\nThe Athletic cited the fact that winger Kirill Kaprizov hails from Russia as the reason for the site’s removal. It also mentioned that the New York Rangers also canceled its planned Pride Night owing to the team’s three Russian players – Igor Shesterkin, Artemi Panarin and Vladimir Tarasenko.\n\nA law that criminalizes the act of spreading “propaganda about nontraditional sexual relations” that Moscow passed in 2022 was ultimately to blame. Five percent of the NHL’s players are Russian as per reports, and the Russian hockey stars could not risk prison time for bowing to the gay mafia.\n\nBen Noble, associate professor of Russian politics at University College London, described the Russian players’ concerns as “legitimate fears.”\n\n‘If you put on a Pride jersey, then there is uncertainty regarding how this would be interpreted by law enforcement in Russia – and that’s a risk. The authorities have the power to enforce this and other legislation selectively. It’s up to them to decide whom they go after.” (Related: Gender war: Putin calls gender fluidity propaganda a CRIME AGAINST HUMANITY.)\n\nVisit GayMafia.news for more stories about LGBT intrusion in hockey and other sports.\n\nWatch White House Coordinator for Strategic Communications John Kirby disclose that LGBT rights are now a core part of U.S. foreign policy.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nSurvey: 43% of Americans think acceptance of transgenderism has gone too far.\n\nWorld Athletics bans transgender athletes from competing in female category at international events.\n\nNHL joins nearly all other professional sports organizations in conservative purge.\n\nTransgenders who identify as male now allowed in the National Women’s Hockey League.", "opengraph": {"title": "Silent protest: NHL may cancel Pride Nights after players REFUSED to wear rainbow jerseys that try to TAG them as trans advocates", "type": "article", "url": "https://www.freedom.news/2023-04-02-nhl-players-refused-to-wear-rainbow-jerseys.html", "site_name": "Freedom News", "description": "The National Hockey League (NHL) is currently assessing whether to continue holding so-called “Pride Nights” after players refused to wear LGBT rainbow jerseys. During the “non-hockey” program, all teams in the league wear jerseys celebrating the LGBT community either during warmup sessions, games or both. However, some teams now do so without putting on the […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2023/04/Flag-Rainbow-Pride-Gay-Background-Anthem-Backdrop.jpg"}, "tags": ["trans cult", "left cult", "NHL", "Resist", "uprising", "identity politics", "Pride Nights", "Pride jerseys", "culture wars", "protest", "transgender", "rainbow jerseys", "Christian beliefs", "National Hockey League", "Russia", "LGBT", "insanity", "hockey players", "sports", "fascism", "gay mafia", "revolt"], "tweets": [], "movies": [], "links": ["https://thepostmillennial.com/nhl-evaluating-cancelation-of-pride-nights-report#google_vignette", "https://ottawa.ctvnews.ca/bettman-nhl-to-evaluate-pride-nights-in-offseason-after-some-players-refuse-to-wear-jerseys-1.6331097", "https://ottawa.ctvnews.ca/bettman-nhl-to-evaluate-pride-nights-in-offseason-after-some-players-refuse-to-wear-jerseys-1.6331097", "https://www.hockeyfeed.com/nhl-news/report-nhl-looking-at-cancelling-pride-night-celebrations", "https://theathletic.com/4294478/2023/03/27/nhl-pride-jerseys-russia-lgbtq-explainer/", "https://www.ucl.ac.uk/", "https://naturalnews.com/2022-11-03-putin-calls-gender-fluidity-crime-against-humanity.html", "https://gaymafia.news/", "https://www.brighteon.com/737ecacd-f1f7-4b4c-9f50-1296cf066205", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.naturalnews.com/2023-03-30-acceptance-of-transgenderism-has-gone-too-far.html", "https://www.gender.news/2023-03-30-world-athletics-bans-trans-athletes-female-events.html", "https://leftcult.com/2021-01-13-nhl-joins-other-professional-sports-organizations-conservative-purge.html", "https://naturalnews.com/2017-01-11-transgenders-who-identify-as-women-allowed-in-national-womens-hockey-league.html", "https://thepostmillennial.com/nhl-evaluating-cancelation-of-pride-nights-report#google_vignette", "https://ottawa.ctvnews.ca/bettman-nhl-to-evaluate-pride-nights-in-offseason-after-some-players-refuse-to-wear-jerseys-1.6331097", "https://www.hockeyfeed.com/nhl-news/report-nhl-looking-at-cancelling-pride-night-celebrations", "https://theathletic.com/4294478/2023/03/27/nhl-pride-jerseys-russia-lgbtq-explainer/", "https://www.brighteon.com/737ecacd-f1f7-4b4c-9f50-1296cf066205", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2023-04-02-nhl-players-refused-to-wear-rainbow-jerseys&linkname=Silent%20protest%3A%20NHL%20may%20cancel%20Pride%20Nights%20after%20players%20REFUSED%20to%20wear%20rainbow%20jerseys%20that%20try%20to%20TAG%20them%20as%20trans%20advocates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}