{"result_id": "123011", "URL": "https://freedom.news/2022-02-08-fascist-police-attack-truckers-freedom-convoy-canada.html", "timestamp": "2023-04-25 15:08:36 CEST+0200", "meta": {"description": "Late Sunday night, Ottawa Mayor Jim Watson declared a fake “local state of emergency” to try to stop the Freedom Convoy truckers and their supporters from protesting Canada’s mandatory Wuhan coronavirus (Covid-19) “vaccination” policy. Watson, a fascist, decided that food, gasoline, and other supplies are no longer allowed to be transported in to the protesters, […]", "lang": "en", "keywords": "big government,Canada,civil war,COVID,cry bullies,drones,fascism,freedom,Freedom Convoy,intolerance,Liberty,obey,Plandemic,Police,police state,surveillance,truckers,Tyranny,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://freedom.news/2022-02-08-fascist-police-attack-truckers-freedom-convoy-canada.html", "encoding": "UTF-8"}, "image": null, "domain": "freedom.news", "title": "Fascist Canadian police state attacks trucker Freedom Convoy, supporters say government is “ripping everything apart”", "cleaned_text": "Fascist Canadian police state attacks trucker Freedom Convoy, supporters say government is “ripping everything apart”\n\nLate Sunday night, Ottawa Mayor Jim Watson declared a fake “local state of emergency” to try to stop the Freedom Convoy truckers and their supporters from protesting Canada’s mandatory Wuhan coronavirus (Covid-19) “vaccination” policy.\n\nWatson, a fascist, decided that food, gasoline, and other supplies are no longer allowed to be transported in to the protesters, even though this decree is illegal and violates Canada’s civil rights Charter.\n\nAfter Watson sent out this signal, local police, who are also fascists, swept in to start “dismantling” the Convoy in any way they could. According to reports, they began “ripping everything apart” in an attempt to shut the whole thing down as quickly as possible.\n\n“They created their false justification and now they are acting on it,” reported News Thud. “Like all fascist dictatorships, they will claim they are doing this for the people, for safety and security. But we know what this is.”\n\n“The most important act of defiance against tyranny in the Western World was this convoy. Our hemisphere’s Honk Kong protests. And the powerful just can’t have that, can they? Nor can the Marxists, the totalitarians – the various parts of the Leftist coalition. This is THEIR crackdown.”\n\nNot only are the Ottawa City Council and Ottawa Police forces blocking supplies from entering the protest area, but they are also reportedly stealing the supplies that are already there.\n\nSomeone tweeted reports about how truckers are “having fuel taken” from them by police, while others are being “arrested.” This person added that he has not personally seen any arrests, but is keeping an eye out for them.\n\n“There is a long row of tow trucks at the ready to remove transport trucks,” added CBC News reporter and investigator Judy Trinh. “I see 30 police officers dismantling the logistics camp.”\n\nTrinh added that she personally witnessed “[l]ots of officers” surrounding the logistics camp. Protesters throughout the area “say they want to remove fuel,” she further said.\n\n“Witnesses say before the raid they saw a drone fly overhead surveilling them,” Trinh wrote in another tweet. “Then dozens of officers came over the snow banks and surrounded them. Protesters prayed for police.”\n\nSome of the protesters were genuinely shocked to see this and other egregious displays of force by local police, some of whom were armed with carbine rifles.\n\n“I will say I did not see police lay hands on anyone,” Trinh made sure to add. “No arrests here – just fuel seizure.”\n\nTrinh later followed up by stating that she did, in fact, hear about two people getting arrested for “mischief” at the Coventry protest camp. Multiple vehicles and fuel were also seized, though she did not personally witness the arrests.\n\nRight before Watson’s midnight “state of emergency” was declared, protesters were seen bringing in fuel to get ahead of the tyranny. How long that fuel will last is unknown.\n\nCriminal lawyer David Anber from the Ottawa area tweeted that he is already receiving calls from people in custody, so the arrests appear to have begun.\n\n“If he says he’s getting calls from people in custody, it’s clear the massive sweep against Trudeau’s opposition has begun,” tweeted Rebel News journalist Ezra Levant.\n\nJack Posobiec, the host of Human Events Daily, added in his own tweet that the truckers had just brought in bounce houses for the children right before the government ordered the confiscation of fuel supplies “in the dead of winter.”\n\n“Time for the pitchforks and rope?” asked one person at News Thud.\n\nWuhan coronavirus (Covid-19) fascism continues to spread like a virus. To keep up with the latest, visit Fascism.news.", "opengraph": {"title": "Fascist Canadian police state attacks trucker Freedom Convoy, supporters say government is “ripping everything apart”", "type": "article", "url": "https://www.freedom.news/2022-02-08-fascist-police-attack-truckers-freedom-convoy-canada.html", "site_name": "Freedom News", "description": "Late Sunday night, Ottawa Mayor Jim Watson declared a fake “local state of emergency” to try to stop the Freedom Convoy truckers and their supporters from protesting Canada’s mandatory Wuhan coronavirus (Covid-19) “vaccination” policy. Watson, a fascist, decided that food, gasoline, and other supplies are no longer allowed to be transported in to the protesters, […]", "image": "https://www.freedom.news/wp-content/uploads/sites/44/2022/02/canada-truck-convoy.jpg"}, "tags": ["big government", "Liberty", "COVID", "civil war", "intolerance", "obey", "truckers", "vaccine wars", "Freedom Convoy", "Police", "Canada", "surveillance", "police state", "Tyranny", "drones", "fascism", "cry bullies", "vaccines", "freedom", "Plandemic"], "tweets": [], "movies": [], "links": ["https://newsthud.com/crackdown-fascists-raid-freedom-convoy-supplies-ripping-everything-apart/", "https://naturalnews.com/2022-01-26-50000-truckers-storm-ottawa-end-covid-mandates.html", "http://fascism.news", "https://newsthud.com/crackdown-fascists-raid-freedom-convoy-supplies-ripping-everything-apart/", "https://naturalnews.com/2022-01-26-50000-truckers-storm-ottawa-end-covid-mandates.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Ffreedomnews%2F2022-02-08-fascist-police-attack-truckers-freedom-convoy-canada&linkname=Fascist%20Canadian%20police%20state%20attacks%20trucker%20Freedom%20Convoy%2C%20supporters%20say%20government%20is%20%E2%80%9Cripping%20everything%20apart%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}