{"result_id": "125007", "URL": "https://friendsofscience.org/index.php?id=2431", "timestamp": "2023-04-25 15:09:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://joannenova.com.au/wp-content/themes/atahualpa/images/favicon/favicon.ico", "canonical": "https://joannenova.com.au/2015/01/is-the-sun-driving-ozone-and-changing-the-climate/", "encoding": "UTF-8"}, "image": null, "domain": "friendsofscience.org", "title": "Is the Sun driving ozone and changing the climate? « JoNova", "cleaned_text": "Is the Sun driving ozone and changing the climate?\n\nIn 2015 the hunt for clues continues…\n\nThe central mystery in climate science is the Sun. The direct energy from the 1.4 million-kilometer-wide flaming ball stays remarkably constant. The radiation pours down on us but the relentless sameness of the watts can’t be causing of the swings in temperature on Earth. Something else is going on with the Sun. For one thing, the total light energy coming off the Sun stays almost the same but the type of light changes — the spectrum shifts — with more shorter wavelengths at one point in the cycle and longer wavelengths at the opposite part of the cycle. These have different effects. Shorter wavelengths (UV) generate ozone in the stratosphere and penetrate the ocean. Longer wavelengths don’t. But the Sun is also sending out charged particles and driving a massive fluctuating magnetic field, both of which affect Earth’s atmosphere.\n\nBut the tiny changes in total sunlight (TSI) may still be leaving us clues about other things going on with the Sun. David Evans’ notch-delay theory is that TSI is a leading indicator, and after solar TSI peaks, the temperatures on Earth follows with a peak roughly 11 years or so later (or one solar cycle). But what’s the mechanism? Stephen Wilde has a theory. Plug in your brain, and follow this chain of potential influence:\n\nStephen Wilde put forward the first version of this hypothesis in 2010. It is long past time to get into those details.\n\nIn essence: The Sun affects the ozone layer through changes in UV or charged particles. When the Sun is more active there is more ozone above the equator and less over the poles, and vice versa. An increase in ozone warms the stratosphere or mesosphere, which pushes the tropopause lower. There is thus a solar induced see-saw effect on the height of the tropopause, which causes the climate zones to shift towards then away from the equator, moving the jet streams and changing them from “zonal” jet streams to “meridonal” ones. When meridonal, the jet streams wander in loops further north and south, resulting in longer lines of air mass mixing at climate zone boundaries, which creates more clouds. Clouds reflect sunlight back out to space, determining how much the climate system is heated by the near-constant incoming solar radiation. Thus the Sun’s UV and charged particles modulate the solar heating of the Earth.\n\nAn active Sun increases ozone in the stratosphere:\n\n“Changes in solar ultraviolet spectral irradiance directly modify the production rate of ozone in the upper stratosphere (e.g. Brasseur, 1993), and hence it is reasonable to expect a solar cycle variation in ozone amount. The global satellite ozone records since 1979 show evidence for a decadal oscillation of total ozone with maximum amplitude (~2%) at low latitudes (Hood and McCormack, 1992; Chandra and McPeters, 1994; Hood, 1997).\n\nIn October 2014 a paper by Andersson et al suggests another layer of action, again on ozone. Described as the missing driver in the Sun-Earth connection, energetic electron precipitation (EEP) dramatically affects ozone — but above the poles, not the equator. The EEP in the mesosphere is directed preferentially towards the poles along the magnetic field lines because the electrons are charged particles, which explains why the effect is strongest at the poles.When the Sun is active the energetic electron rain decreases ozone preferentially above the poles and in the mesosphere.\n\nAt the poles, the rules get strained through a singularity\n\nAt the north and south poles the magnetic field lines converge, the Earth drags the atmosphere around a single point, the tropopause is lower, and temperature inversions are common. Polar vortices occur when an area of low pressure sits at the rotation pole of a planet. This causes air to spiral down from higher in the atmosphere, like water going down a drain. (Polar vortices should not be confused with the circumpolar jet around the poles, which is often given the same name in the media.)\n\nAll this remarkable action means that above the poles even the high mesosphere affects the height of the tropopause. In the polar vortices the descending flow draws air down from the mesosphere, right through the stratosphere to the tropopause.\n\nThe presence of a layer of ozone in the stratosphere is the cause of the temperature inversion that forms at the tropopause. That layer of ozone is warmed directly by incoming solar radiation. It is warmer than the rising air coming up from the surface below, so it effectively puts a lid on convection.\n\nOzone variations affect the temperature of the stratosphere, which in turn affects the height of the tropopause. From page 14 of Zangl and Hoinka:\n\n“Suppose, for example, that the surface temperature and the tropospheric temperature gradient are given and that the temperature of the stratosphere varies. Then, a cold stratosphere will be associated with a high tropopause (low tropopause pressure), and a warm stratosphere will correspond to a low tropopause (high tropopause pressure).”\n\nIf the tropopause rises or falls, it causes a change in the gradient of tropopause height between equator and poles. This in turn causes the jet streams to shift north or south, because it pushes around the climate zones beneath the tropopause. A lower tropopause restricts the available space for free movement of air horizontally beneath it. So a lowering of the tropopause above the poles when the Sun is less active (as implied in the Andersson et al paper) squeezes the air in the tropospheric climate zones towards the equator. We have seen that happen in the form of increased jet stream meridionality since about 2000, as the level of solar activity declined in the transition from active solar cycle 23 to much less active solar cycle 24. That is the reason for the observation of more frequent and intense incursions of polar air across middle latitudes in recent years.\n\nThe world is divided up into permanent climate zones, which align along the lines of latitude due to the Earth’s rotation. These zones can move poleward or equatorward, in response to changes in the Earth’s energy budget. Poleward shifting was observed during the late 20th century warming, and it is well know that the zones shifted equatorward during the Little Ice Age.\n\nThe jet streams are high-level rivers of fast moving air threading between the climate zones, and are driven by temperature, humidity and density differentials between the different types of air mass:\n• An equatorward shift of the climate zones gives the jets more room to loop north and south, and that gives more meridonal jets (the north-south components of the jets).\n• A poleward shift of the zones pushes the jets poleward, forcing them to more closely following the lines of latitude, that is, more zonal jets (the east-west components).\n• Such shifts are also associated with the Arctic Oscillation, wherein a positive phase results in the climate zones being pulled poleward and the jets adopting a more zonal (straighter) pattern. A negative phase results in the opposite. A more frequent positive phase is associated with a more active Sun due to cooling of the polar stratosphere (less mesospheric ozone descending through the polar vortex) and consequent lifting of the polar tropopause. A more frequent or more pronounced negative phase (as observed to a record extent during the very low solar minimum between cycles 23 and 24) is associated with a less active Sun due to warming of the polar stratosphere (more mesospheric ozone descending through the polar vortex).\n\nMore meridonal jet stream tracks flowing around the world between the climate zones result in longer lines of air mass mixing at climate zone boundaries. Mixing of air from different locations within different climate zones causes convective instability due to differing temperatures and densities, which increases cloud formation.\n\nFinally, clouds reflect solar radiation (that is, modulate the albedo), thus affecting the amount of heat flowing into the climate system. Significantly, the proportion of solar energy entering the oceans is affected and ultimately it is the oceans that determine atmospheric temperatures (see here).\n\nThus there is a back and forth in global cloudiness as the Sun’s activity level changes over the decades and centuries — such as during the period covering the Medieval Warm Period, the Little Ice Age, and the current warm period — through latitudinal shifting of the jet stream tracks and permanent climate zones.\n\nIt is also proposed that, over time, the changes at the higher mesospheric level dominate because the higher level effect gradually filters down to lower levels through the descending column of air within the polar vortices as described above. This links observed changes in the size of the ozone holes at the poles to solar causation rather than to human emissions of CFCs. The ozone holes grew when the Sun was active and are now shrinking with the less active Sun.\n\nFurther thoughts on the Andersson “energetic electron” paper\n\nThe new paper by Andersson et al builds on the hypothesis that ozone is influential and a potential mechanism to amplify solar factors. It adds energetic electron precipitation (EEP) to spectral changes in UV, which is a significant step forward.\n\nAndersson et al describe it as having a short term regional effect, with no implications for global or long term climate change. But if the effect is significant between the peak and trough of a single solar cycle, then surely it is also going to be significant over the millennial cycle of solar variation — such as that observed from the Medieval Warm Period through the Little Ice Age and up to date.\n\nObservations of climate changes across the last thousand years suggest that it must be so. In the Medieval Warm Period, Greenland had agriculture and the Western Isles of Scotland were prosperous with a much larger population than today—which implies more poleward climate zones and zonal jets at that time. In contrast, ships logs from the Little Ice Age show much greater Atlantic storminess and more equatorward mid latitude depression tracks at that time (depressions generally follow the tracks of the jet streams).\n\nStephen Wilde’s hypothesis is a possible mechanism for the notch-delay theory, in which the TSI drives surface temperatures after a delay of one sunspot cycle (~11 years) and which potentially explains most of the temperature variations over the last few hundred years. This would occur if the extreme ultraviolet that drives ozone creation and destruction, and the effects of the energetic electron precipitation found by Andersson et al, both lag the trends in bulk TSI (visible light and normal UV) by one sunspot cycle — that is, by half a full solar cycle (~22 years).\n\nM.E. Andersson et al “Missing driver in the Sun–Earth connection from energetic electron precipitation impacts mesospheric ozone” Discussed here.\n\nZangl and Hoinka (2001) The Tropopause in the Polar Regions, American Meteorological Society, vol 14, page 3117", "opengraph": {}, "tags": ["Jet Streams", "Wilde (Stephen)", "Ozone"], "tweets": [], "movies": [], "links": ["http://sciencespeak.com/climate-nd-solar.html", "http://www.newclimatemodel.com/how-the-sun-could-control-earths-temperature/", "/s3/jo.nova.s3.amazonaws.com/guest/uk/wilde/inactive-sun-stephen-wilde-lrg.jpg", "http://www.atmosp.physics.utoronto.ca/SPARC/SPARCReport1/3.04_O3variations/3.04_O3variations.html", "/s3/jo.nova.s3.amazonaws.com/guest/uk/wilde/active-sun-stephen-wilde-lrg.jpg", "http://wattsupwiththat.com/2014/01/18/introducing-the-new-wuwt-northern-polar-vortex-page-with-explanation-and-observations/", "http://journals.ametsoc.org/doi/pdf/10.1175/1520-0442%282001%29014%3C3117%3ATTITPR%3E2.0.CO%3B2", "http://geography.learnontheinternet.co.uk/topics/climatezones.html", "http://www.nbcnews.com/id/24228037/#.VD-I78ZOWUk", "/s3/jo.nova.s3.amazonaws.com/guest/uk/wilde/jetstream-polar.gif", "http://frontierscientists.com/2013/06/under-pressure-arctic-extreme-weather/", "http://www.metoffice.gov.uk/learning/wind/what-is-the-jet-stream", "http://www.decodedscience.com/zonal-meridional-flow-transfer-energy-atmosphere/41385", "/s3/jo.nova.s3.amazonaws.com/guest/uk/wilde/fig3-jetstream-meridonal.gif", "http://rgsweather.com/tag/convection/", "http://www.newclimatemodel.com/the-hot-water-bottle-effect/", "http://sciencespeak.com/climate-nd-solar.html", "http://lpce.cnrs-orleans.fr/~ddwit/publications/EUV_strategy.pdf", "https://joannenova.com.au/2014/06/big-news-viii-new-solar-model-predicts-imminent-global-cooling/", "http://www.nature.com/ncomms/2014/141014/ncomms6197/full/ncomms6197.html", "http://hockeyschtick.blogspot.co.uk/2014/10/new-paper-finds-significant-missing.html", "http://sciencespeak.com/climate-nd-solar.html"], "authors": [], "publish_date": null}