{"result_id": "125013", "URL": "https://friendsofscience.org/fos-extracts-2017.html", "timestamp": "2023-04-25 15:09:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/assets/images/svg/flavicon.ico", "canonical": "https://friendsofscience.org/fos-extracts-2017.html", "encoding": null}, "image": null, "domain": "friendsofscience.org", "title": "FoS Extracts - 2017 | Friends of Science", "cleaned_text": "Canada Still On Pace to Fall Short of Paris Target\n\nOn December 29 Canada submitted its year-end filing to the UN Framework Convention on Climate Change, stating that it expects total GHG emissions to fall to 583 Mt by 2030. This is 66 Mt short of the 517 Mt target for that year. (The current projection for 2017 is 722 Mt.) The report offered no specifics around how Canada will eliminate the remaining 66 Mt, saying only that it could come from future investments in cleaner public transit and clean technologies. It also suggests carbon storage methods used in forests, soils and wetlands will also contribute to reductions which, for a country such as Canada, could also play an important role in achieving the 2030 target. \u009d\n\nVideo footage taken last August by the environmental group SeaLegacy of an emaciated Somerset Island polar bear were quickly picked up by publications like The Guardian as a devastating look at the impact climate change is having on polar bears in the region. \u009d Canada 's environment minister Catherine McKenna tweeted: THIS is what climate change looks like. \u009d\n\nBut asking the people who actually spend time around polar bears, such as longtime polar bear biologist Andrew Derocher who said: The video shows what appears to be an old male in declining health, but clear clinical signs of starvation aren 't obvious (e.g. convulsions). \u009d Moreover, the bear lived in an area where populations are doing well, and if sea ice loss due to man-made global warming had been the culprit, this bear would not have been the only one starving.\n\nWhat They Don 't Tell You About Climate Change\n\nThe Economist reveals a secret about the world 's pledges in the Paris Agreement to keep global warming well below \u009d 2 °C above pre-industrial times. Because, in any realistic scenario, emissions cannot be cut fast enough to keep the total stock of greenhouse gases sufficiently small to limit the rise in temperature successfully (according to the IPCC 's models), the agreement assumes that the world will somehow find a way to suck CO out of the air. The total amount of CO to be removed by 2100 could be a staggering 810 billion tonnes, as much as the world 's economy produces in 20 years at today 's rate.\n\nOther than planting more forests or changing agricultural practices, all the technologies (e.g., carbon capture and storage, removing CO from the air, grinding and sowing minerals to accelerate the natural weathering process that binds them to CO to form carbonate rocks) are very expensive and/or require lots of land, and none has been proven at scale. Since markets will not provide an incentive for such schemes, The Economist recommends the old standbys: government regulation and subsidies.\n\nAt the One Planet Summit in Paris,: French President Emmanuel Macron delivered a bleak assessment on the fight against climate change, telling an audience of world leaders, celebrities and company executives that the world is losing the battle. \u009d He went on to say that those present at his address need to realize that many of the Heads of State and Governments in attendance in 50, 60 or 100 years, won 't have countries to govern because climate change will have wiped them off the map. \u009d\n\nThe Paris Agreement stipulates that the increase in the global average temperature is to be kept well below 2 °C above pre-industrial levels \u009d and that efforts are pursued to limit the temperature increase to 1.5 °C above pre-industrial levels. \u009d However, the term pre-industrial levels \u009d is nowhere defined in the agreement. Based on paleoclimate studies, pre-industrial temperatures of the past 10,000 years have varied quite significantly. On December 12, Sebastian L ¼ning and Fritz Vahrenholt published a paper Paleoclimatological Context and Reference Level of the 2 °C and 1.5 °C Paris Agreement Long-Term Temperature Limits that aims to establish (a) which baseline definitions have been put forward in previous works on global climate targets, (b) discuss these baselines in the context of pre-industrial paleoclimate variability, and (c) evaluate the suitability of different baseline definitions.\n\nThe authors conclude that temperatures of the 1940-1970 interval may serve as a better reference level as they roughly correspond to the average pre-industrial temperature of the past two millennia. Placing the climate limit in an enlarged paleoclimatic context will help to demonstrate that the chosen climate targets are valid and represent dangerous extremes of the known natural range of Holocene temperature variability.\n\nYale Environment 360 is particularly upset with a loophole in the carbon-accounting rules that is spurring a boom in burning wood pellets in European power plants. For example, the Drax Power Station in Britain replaced coal for its boilers with wood pellets shipped from the US South and produces 23 million tonnes of CO annually. Drax ' owners claim that, because new trees will be planted in the cut forests, the power station is carbon-neutral. Except it 's not. Forests of North Carolina, Louisiana, and Mississippi as well as those in Europe are being destroyed to sustain a European fantasy about renewable energy. Wood burning is booming from Britain to Romania. Much of the timber is sourced locally, which is raising serious concerns among European environmentalists about whether every tree cut down for burning is truly replaced by a new one.\n\nIn September, some 200 scientists wrote to the EU insisting that bioenergy [from forest biomass] is not carbon-neutral \u009d and calling for tighter rules to protect forests and their carbon. Yet just a month later, EU ministers rubber-stamped the existing carbon accounting rules, reaffirming that the burning of wood pellets is renewable energy. Roughly half the cut wood in the EU is now being burned to generate electricity or for heating.\n\nThe US could be the next country to take advantage. A federal spending bill that passed the House of Representatives earlier this year directed the Environmental Protection Agency to establish policies that reflect the carbon neutrality of biomass \u009d and to encourage private investment throughout the forest biomass supply chain, \u009d paving the way for a boom in American pellet burning.\n\nBetween January 2014 and September 2017 international banks channelled $630 billion to the top 120 companies planning to build 1600 new coal plants around the world, according to research by campaign groups including the Rainforest Action Network, Of that amount, $275 billion was provided after the signing of the Paris Agreement in December 2015. The Bank Track story lists banks and companies that lent money for, or underwritten, coal plants. While Asian institutions dominate the list, it includes banks based in Europe and the US. The campaign groups end with a demand to end financing for: new coal plants worldwide, coal-plant developers, and coal power companies deriving more than 30% of power from coal or more than 10 GW of installed coal power capacity.\n\nSeven years after abandoning the manufacture of solar generation equipment as the wrong part of the value chain, \u009d BP is now coming back to solar, but in a new and very different way. \u009d This way involves purchasing a 43% share in solar developer and operator Lightsource, which henceforth will to be known as Lightsource BP. Instead of making solar panels, BP will be obtaining contractual entitlements, land use permits, grid connections, feed-in tariffs, production tax credits, and other state-backed contracts giving supportï¼\u008dthat is, rent-seeking.\n\nJoe Oliver, who was Canada 's minister of finance and minister of natural resources in the Harper government, says we need to tone down the rhetoric and have an honest discussion based on verifiable science and the financial implications of green policies. Noting the Trudeau government 's passionate proclaiming of its commitment to fighting climate change, Mr. Oliver states that stridency and fervour haven 't moved the dial on public ambivalence over the need for action. Even if the extravagant climate claims were true, we should still evaluate the specific policies designed to deal with the crisis, because the costs to the economy would be so high.\n\nDespite policies to reduce greenhouse gas emissions, Irish levels have risen by 7% since 2015. The country is likely to face multimillion-euro fines for failing to meet EU 2020 targets or it will have to spend similar amounts buying credits from member states that overachieve their targets. The EU 's Environmental Protection Agency found increases across three main Irish sectors: agriculture, which contributed 2.7% more emissions; transport, which emitted 3.7% more; and the energy industry, which was responsible for a 6.1% rise.\n\nThe UN 's Food and Agriculture Organization forecasts that this year 's global cereal production is set to surpass last year 's record levels. World cereal markets are likely to be comfortably balanced in 2017/18, with total supplies exceeding projected demand and inventories on the rise.\n\nTesla Removed from List of EVs Eligible for Subsidies in Germany\n\nA German government agency has removed Tesla from the list of electric cars eligible for subsidies, sparking a row with the US company over whether its Model S is too expensive to qualify for the scheme. Tesla customers cannot order the Model S base version without extra features that pushed the car above the ‚ 60,000 price limit, a spokesman for the German Federal Office for Economic Affairs and Export Controls (BAFA) said on December 1. Under the subsidy scheme, buyers get ‚ 4,000 off their all-electric vehicle purchase and ‚ 3,000 off plug-in hybrids.\n\nGerman Public Media Finally Acknowledge Country 's Power Grid Now More Unstable than Ever\n\nThe woes besetting the German Energiewende (transition to green energies) and the country 's power grids are finally beginning to hit home in the mainstream German media. For example German HR public radio writes increasingly large problems have besieged power grid operator Tennet \u009d and that the company often has to act at lightning speed to prevent blackouts . HR public radio 's Jens Wellh ¶ner describes a grid control center in northern Germany, where workers at the complex control center work tensely to keep the grid from crashing as highly unstable wind and solar energy surge and drop off precipitously with every whim of the weather.\n\nCarbon taxes are promoted at the best way to mitigate human contribution to climate change. However, adopting them in the West will actually raise global carbon emissions by offshoring economic activity from relatively environmentally-friendly places, like North America and Germany, to places with lax environmental laws, like China. That is because wealth is like water: it flows to the lowest possible point, and continues to do so until the level is equal. Data from the World Bank reveals that China, and other developing countries, produce far more carbon per dollar of economic output (at purchasing power parity) than do Western nations. On top of this, China shows no signs of decreasing its emissions any time soon.\n\nIn a 12-minute video Dr. Peiser speaks during a debate before the university 's student union against a motion that societies and governments should abandon the traditional goal of economic growth while prioritizing policies to decarbonize. He points out that no government proposes such a policy, nor is anyone outside of Europe 's radical greens. Without economic growth poor nations would be unable to raise living standards for their impoverished populations.\n\nThe EU 's green policies have proven to be an economic and social disaster for millions of people forced to choose between heat or eat, leading to a massive wealth transfer from the poor to the rich. Dr. Peiser compares Africa and China, with similar populations, but with quite different production of, and access to, electricity. After developing advanced economies using fossil fuels, Europeans are now trying to insist that Africans develop theirs using wind and solar instead.\n\nClimate Bullies Attack Susan Crockford for Telling the Truth about Polar Bears\n\nConsensus climate scientists have long been personal and damning in their criticism of those who don 't agree with them. Their latest target is Susan Crockford, a zoologist for 35 years with a PhD from the University of Victoria and 30 scientific publications. A paper published November 29 in the American Institute of Biological Sciences journal Bioscience bears the title Internet Blogs, Polar Bears and Climate-Change Denial by Proxy and calls Dr. Crockford a denier. The evidence is that other unidentified blogs that the paper 's authors call denier \u009d blogs (without citing them and without showing what it is about those blogs that render them anathema) link to Dr. Crockford 's weblog. The paper flat-out lies about Dr. Crockford, claiming that she hasn 't conducted original research or published peer-reviewed papers on polar bears.\n\nIn a series of blog posts Dr. Crockford pushed back against the Bioscience paper, including a retraction request. The last link is an interview of Dr. Crockford by Anthony Watts.\n\nAfter Syria and Nicaragua ratified the Paris Agreement, Environment and Climate Change Minister Catherine McKenna tweeted: Canada salutes Nicaragua and Syria for joining on to the Paris Agreement! Global #ClimateAction, #COP23 \u009d. After seeing reaction to her praise for the brutal Assad regime, the minister tweeted: Clearly a mistake was made from my Dept twitter. We've been clear that the murderous Assad regime must end attacks against its people. \u009d Later, she took responsibility and assured everyone that she will not meet with Syria at the COP23 climate summit in Bonn.\n\nFirst Poland, the Germany, Now Spain: Europe Rejects Coal Phase-out\n\nWith winter setting in, Warsaw is taking up Donald Trump 's offer of energy by receiving its first shipment of US coal, and industry sources expect state or private buyers to take at least three more cargoes over the next seven months, even though Europe as a whole is shifting away from the fuel. Poland does share at least one EU energy aim in seeking to avoid dependency on Russia, which has in the past curbed gas supplies piped via Ukraine to countries including Poland.\n\nThe Spanish government is challenging a decision by its main electricity provider, Iberdrola, to shut down two coal-fired power plants. The country 's energy minister fears that closing power plants will create power cuts. Iberdola 's CEO had pledged to close the company 's coal power plants, including the two Spanish power stations.\n\nGermany In Crisis As Coalition Talks Collapse Over Climate Hysteria And Migration\n\nFollowing a month of gruelling three-way negotiations among the Christian Democrats/Christian Social Union, the Greens and the Free Democrats, the latter walked out of the talks late on the night of November 19 saying there was no \"basis of trust\" to forge a government. The two main issues causing the breakdown were refugee policies and the Greens ' wanting to phase out coal and combustion-engine cars. The Green Party demanded an immediate shut-down of 10-20 of Germany 's 180 coal power plants, while the Free Democrats stood by its manifesto promise of a radical reform of the Energiewende, advocating the end to subsidies for renewable energy.\n\nExperts at the Federal Ministry of Economics had warned participants at the exploratory coalition talks that Germany will miss its legally binding 2020 climate targets by a mile and that trying to achieve its 2030 goals would risk the economic prosperity of the country. The Ministry also warned that any attempt to force a radical reduction of CO2 emissions by 2020 would only be possible by partial de-industrialisation of Germany. \u009d\n\nBj ¸rn Lomborg: The Big Slide in Renewables Tells the Real Story\n\nIn 1966 the world got 15.6% of its energy from renewables; 50 years later it had fallen to 13.8%. Most of these renewables are not solar PV and wind, but rather wood (10%) and hydropower (1.6%). According to the International Energy Agency 's New Policies Scenarioï¼\u008dwith all nations living up to their Paris Agreement commitmentsï¼\u008drenewables will grow from 13.8% to 19.4% by 2040. Again 10 percentage points will come from wood, 3 from hydropower, and all other renewables provide 6 percentage points, of which solar PV and wind will (very optimistically) provide 3.7 percentage points. That 3.7 percentage points from solar and wind will, according to the IEA cost a total of $3.6 trillion in subsidies from 2017-2040.\n\nMr. Lomborg 's article includes an interesting plot of the world 's renewable energy share from 1800 (95%) to the present.\n\nData from the sale of a 50% share of the Walney Offshore Wind Farm extension project, located 20-30 km off the Cumbrian coast in the UK, confirms that offshore wind capital costs are not falling. They appear to be rising due to the costs of construction in deeper water (20-40 m in this case). The price of £2 billion for the stake implies a capital cost of £6 million/MW. A plot of cost per MW vs year of completion and water depth shows the increasing trend from 2000 to 2020.\n\nOne-time Jesuit seminarian Jerry Brown, in an address to a Vatican audience, raised the idea of brainwashing \u009d to root out the greed and consumerism that have helped drive climate change. At the highest circles, people still don 't get it, \u009d he said. It 's not just a light rinse \u009d that 's required. We need a total, I might say brain washing. ' We need to wash our brains out and see a very different kind of world. \u009d\n\nContinuing on to COP23 in Bonn and responding to a reporter 's question, Gov. Brown admitted that immediately banning all fossil fuel production in his state could lead to economic crisis and possible armed revolution.\n\nProf. Dyson has little faith in scientific predictions; hence the need for heretics to challenge prevailing orthodoxies. His first heresy is that all the fuss about global warming is grossly exaggerated. It takes away money and attention from more urgent problems, such as poverty, disease, education and health. If atmospheric CO is a problem, better agricultural practises (e.g., no till farming, genetic engineering to store more biomass in plant roots) will draw more CO from the atmosphere. While the amount of biomass that living plants and trees can accumulate is limited, there is no limit to what can be stared in topsoil.\n\nThe WUWT link contains the first part of, and a one-hour video link to, Prof. Dyson 's lecture: Heretical Thoughts About Science and Society. The Edge link contains the full text of the lecture.\n\nWhy the e ' in EV Stands for Evil\n\nElectric vehicles aren 't environmental exemplars, as their touters claim, and they aren 't economic. They excel in one area above all: in exploiting rural regions and their inhabitants, mostly for the benefit of affluent urbanites. EVs benefit urban environments by limiting harmful emissions such as NOx, SOx and ground-level ozone. But this benefit comes at a cost to rural environment, mainly due to wind farms and transmission corridors to carry the power to urban markets. Other forms of renewable electricity such as biofuels and solar photovoltaic arrays, which claim forests and fields are again based in rural areas, and again require rural pain for urban gain.\n\nEVs are for city folk as charging stations are few and far between in low-density areas. Rural residents ' role is to give: through inflated taxes for subsidies to lower the purchase price of EVs (e.g., $14,000 in Ontario), and through a degraded rural environment.\n\nUS EPA Administrator Scott Pruitt announced on October 9 that the Trump administration is moving to scrap the Clean Power Plan, the Obama administration 's signature regulatory program to curb emissions from coal-fired power plants. That rule really was about picking winners and losers, \u009d Mr. Pruitt said. The past administration was unapologetic, they were using every bit of power, authority to use the EPA to pick winners and losers on how we pick electricity in this country. That is wrong. \u009d The Clean Power Plan aimed to reduce CO emissions from coal-burning power plants by having states meet certain targets.\n\nIn its filing, the EPA said it would take comments on whether to write a new climate regulation that it says fits within the law. The agency said it will solicit information on systems of emission reduction that are in accord with the legal interpretation proposed in this notice, \u009d though that process is likely to be a lengthy one.\n\nEPA Administrator Scott Pruitt issued an Agency-wide directive on October 16 designed to end sue and settle \u009d practices within the agency. The days of regulation through litigation are over, \u009d said Mr. Pruitt. We will no longer go behind closed doors and use consent decrees and settlement agreements to resolve lawsuits filed against the Agency by special interest groups where doing so would circumvent the regulatory process set forth by Congress. Additionally, gone are the days of routinely paying tens of thousands of dollars in attorney 's fees to these groups with which we swiftly settle. \u009d\n\nMichael Greenstone, a professor of economics at the University of Chicago who worked on climate policy during the Obama years, fears the EPA 's repeal of the Clean Power Plan because: My read is that the political decision to repeal the Clean Power Plan was made and then they did whatever was necessary to make the numbers work. \u009d What Prof. Greenstone complains about is exactly what he and a colleague did in 2009, in order to regulate CO emissions by executive fiat without having to get Congressional approval. This included using a low discount rate, running their economic models out to the year 2300 and estimating the global costs and benefits, rather than just the US, to get a social cost of CO of $21/t (since raised to $40/t).\n\nThe duck curve \u009d is a graph of power production resembling the side view of a duck, that reveals a gap between peak demand times (typically in the evenings) and when solar electricity is being produced (i.e., around midday). Governor Jerry Brown signed into law a bill requiring the state Public Utilities Commission and all other locally-owned utilities to start planning to meet their net-load peak energy and reliability needs with alternatives to fossil-fuel generating plants, while also providing the electricity at the lowest cost to consumers. By mandating non-gas generating options, the bill forces utilities to seek other peak-time remedies like battery storage.\n\nMr. Abbot, Prime Minister of Australia (September 2013 to September 2015), gave a lecture to the Global Warming Policy Foundation on October 9. In it he discussed the evolution of climate policy in Australia, where politicians are now having to face the long-avoided reality that they can 't reduce emissions without hurting the economy.\n\nThe Australian Government will not adopt a Clean Energy Target recommended by the country 's chief scientist. Instead it will propose a new affordable, reliable \u009d plan to bring down electricity prices. The CET would have mandated a certain percentage of power be generated from gas and renewable energy, but some backbenchers did not like the idea. Former prime minister Tony Abbott argued a CET was effectively a \"tax on coal \u009d.\n\nA new report, The Anti-Development Bank: The World Bank 's Regressive Energy Policies by the London-based Global Warming Policy Foundation finds that the World Bank has abdicated its primary mission of tackling poverty in the developing world. The report states that the bank 's energy policies are hurting development and making poor countries poorer. By embracing high-cost, low-reliability renewables and restricting clean coal financing, the World Bank is guilty of an inhumane and senseless attempt to try and save the planet on the backs of the world 's poor, \u009d according to the report 's author.\n\nTesla Is Immune to Bad Financial Data\n\nTesla 's goal was to produce 1500 Model 3 EVs in the third quarter. On October 2 it announced that it had managed only 260, blaming unspecified bottlenecks \u009d for the shortfall. However, this had no effect on the company 's stock price, because Tesla 's stock doesn 't trade on data; it trades on the current of faith and doubt among the Tesla faithful. In fact the analysts would have been surprised if Tesla had come close to meeting its goal.\n\nA jury in North Dakota 's Pembina County on October 6 convicted environmental activist Michael Foster after a weeklong trial of criminal mischief, criminal trespass and conspiracy. Mr. Foster took part in effort on Oct. 11, 2016, to draw attention to climate change by turning off valves on five pipelines that bring Canadian oil south. He had hoped to use a legal tactic known as the climate necessity defense justifying a crime by arguing that it prevented a greater harm from happening. Prosecutors objected, saying they didn 't want a trial on global warming and the judge agreed, saying in part that a reasonable person could not conclude that (climate change) harms, however serious they might be, were imminent and certain to occur. \u009d\n\nThis is the title of a newly published article in the journal Scientometrics by Jank ³ et al. The authors compared the reference lists for the IPCC 's AR4 and AR5 reports with those of the corresponding Climate Change Reconsidered reports (CCRI and CCRII), that were published by the Nongovernmental International Panel on Climate Change. More specifically, the comparison involved (1) entering all references from the four reports into a database, (2) sorting them by author and by journal, (3) comparing the overlap and differences in citations between the two publishing entities and (4) examining the evolution (i.e., similarities and differences) of citations by each entity between their two reports.\n\nIn terms of differences, the IPCC tended to favour citations from journals that are focused more on the modelling enterprise, whereas the NIPCC tended to favour publications in the paleo-sciences. In-text analysis of the IPCC 's AR5 report revealed that 19 out of the 20 most frequently cited authors in that report were directly involved in the compilation of it.\n\nIn summing up their analysis the authors of the new paper write that the competitive situation created by the publications of the NIPCC reports is beneficial for climate science in general; it fosters knowledge creation, i.e. the reviewing process, mobilizing a growing number of references into review. \u009d\n\nIn a succinct, well-argued open letter to Prime Minister Trudeau and Climate Change Minister McKenna, Allan Chatenay tells us why their view of climate change is killing us. He begins with the current understanding of climate change \u009d to mean blaming humans for changing the climate by using oil and gas and coal. \u009d Ancient societies used to offer blood sacrifices in a vain attempt to control the weather and crop yields. Today 's government believes that Canada can stop global climate from changing by taxation, regulation and subsidy. Mr. Chatenay notes the benefits of hydrocarbon energy and atmospheric CO . Finally, he tackles the 97% consensus. \u009d\n\nIn the 1990s and into the 2000s Ontario was a low electricity-cost jurisdiction, but lost that competitive advantage thanks to its Green Energy Act and soaring electricity prices. From 2008 to 2015 the province 's manufacturing jobs fell from 805,170 to 688,735, with about 75,000 of the losses resulting from high electricity prices. A Fraser Institute study by Ross McKitrick and Elimira Aliakbari, Rising Electricity Prices and Declining Employment in Ontario 's Manufacturing Sector, explains how the province lost at least 1.8 permanent manufacturing jobs for every new job created under the green energy initiatives since 2008. In 2016, large industrial consumers (with a power demand of 5 MW and monthly consumption of 3,060 MWh) in Toronto and Ottawa paid almost three times as much as consumers in Montreal and Calgary and almost twice as much as consumers in Vancouver.\n\nThe dramatic job losses in Ontario 's manufacturing sector, and the overall stagnant employment and economic growth rates in the province, should concern policymakers across Canada. The authors urge the Ontario government to pursue meaningful reforms aimed at significantly lowering electricity costs in the province.\n\nIn the fall of 2014, the $1.5-billion Boundary Dam power station near Estevan, Saskatchewan became the first power station in the world to install carbon capture and storage technology on a commercial scale. SaskPower argued that using carbon capture and storage allowed it to reduce emissions while still using coal as a fuel source. Now, SaskPower 's president says it is \"highly unlikely\" that his company will recommend the government pursue further carbon capture and storage projects in the foreseeable future because they are too expensive.\n\nElectricity generated from gas now costs about $60 - $70/MWh, versus twice that much $140MWh to produce electricity with CCS technology.\n\nAt lest SaskPower got something for its efforts. The EU bureaucrats wasted £520 million of taxpayers ' cash on a decade-long project to reduce carbon emissions that produced absolutely zero results whatsoever. The CCS project, called NER300 was set up in 2007 to help companies reduce their emissions and so save money on Brussels ' green taxes. Under the scheme businesses could buy pollution permits, or allowances, from eurocrats the proceeds of which would then be spent by the EU on capturing and storing carbon emissions. However, the scheme assumed that Europe 's carbon price would rise from ‚ 30/t to ‚ 100/t. Instead the price crashedï¼\u008dit is now around ‚ 7/t, and the money collected ended up funding projects already in the renewable category.\n\nUntil now the US EPA had 22 advisory committees charged with providing independent, unbiased scientific advice for the agency. However, many of the committee members have been conducting the research that they determined was needed, collecting hundreds of millions in grants for doing so. In future the Trump administration will ban any sitting member of an EPA advisory board from contracting to do any EPA work and will seek a diversity of scientific views, drawing on experts from across the country.\n\nAccording to a paper, titled Energy Policy in Minnesota: the High Cost of Failure, the state 's experiment with wind energy cost $15 billion and didn 't even make a dent in CO emissions. Historically, Minnesota 's electricity prices were 18% below the US average, an advantage that disappeared in 2017 as the state 's price rose above the average.\n\nUN: Nobody Is Doing Enough to Limit CO Emissions\n\nOn October 31, six days before the start of COP23 in Bonn, the UN released its Environmental Emissions Gas 2017 stating that the gap between the nationally determined contributions contained in the Paris Agreement and the UN 's 2 °C goal is alarmingly high \u009d (executive summary.) The report calls for more ambitious NDCs by 2020, which it assumes could be largely achieved with costs below $100/t of CO e through solar and wind energy, efficient appliances and passenger cars afforestation and stopping deforestation. However, in early 2017 there were 700 GW of coal-fired power plants being built or planned in China, India, Turkey, Indonesia, Vietnam, Japan, Egypt, Bangladesh, Pakistan and the Republic of Korea alone. The only good news in the report is that emissions have remained stable since 2014.\n\nIn Chapter 3.4 the report compares each of the G20 countries ' NDCs to their emissions trends. Canada, with a projected 610-820 MtCO e/year in 2030, will miss its NDC target of 510-580 MtCO e/year. The report notes the intended withdrawal of the US from the Paris Agreement (taking effect in 2020) and that under the new administration projected emissions in 2025 will be 5.7-6.8 GtCO e/year, compared to 5.0-6.6 GtCO e/year under the previous one.\n\nAutumn storm Herwart \u009d not only uprooted trees, brought down roofs and paralyzed train service, it also caused extreme turbulence to the electricity market. That is because Herwart \u009d caused a lot of wind which in turn generated so much wind energy that the price of electricity almost collapsed, at one point reaching - ‚ 83.06/MWh. A normal price is + ‚ 37/MWh. The reason for the negative pricing is that grid operators have to take all the renewable energy produced, regardless of demand, and sell the excess on the energy exchange. Private customers don 't benefit from the negative electricity prices, but have to pay even more.\n\nJ ¸rgen Randers, professor of climate strategy at BI Norwegian Business School and a co-author of the 1972 book Limits to Growth, saysï¼\u008dcorrectlyï¼\u008dthat democracies are unwilling and unable to pay the exorbitant amounts that he and many other environmentalists are asking countries to pay. Prof. Randers instead takes this unwillingness to spend fortunes on little benefits as an argument for ending democracy: if people don 't want my preferred solution, then people are stupid, shouldn 't be allowed to decide their fate, and we should install a climate dictatorship instead. \u009d The argument literally seems to be: If I can 't have my way in a democracy, I want my way with a dictatorship.\n\nMark Z. Jacobson, a professor of civil and environmental engineering at Stanford University, has filed suit in D.C. Superior Court against the author and publisher of a peer reviewed study criticizing his work. Prof. Jacobson is the lead author of a widely publicized 2015 study in the Proceedings of the National Academy of Sciences that mapped out a course to powering the US entirely by renewable energy sources by the year 2050. In 2017 a study, also in PNAS, authored by Christopher Clack, of Vibrant Energy, a grid modelling company, along with 20 coauthors found serious flaws in Prof. Jacobson 's methodology. So the latter filed a suit on September 29 seeking $10 million in damages for libel and slander. \u009d\n\nWhy the e ' in EV Stands for Evil\n\nElectric vehicles aren 't environmental exemplars, as their touters claim, and they aren 't economic. They excel in one area above all: in exploiting rural regions and their inhabitants, mostly for the benefit of affluent urbanites. EVs benefit urban environments by limiting harmful emissions such as NOx, SOx and ground-level ozone. But this benefit comes at a cost to rural environment, mainly due to wind farms and transmission corridors to carry the power to urban markets. Other forms of renewable electricity such as biofuels and solar photovoltaic arrays, which claim forests and fields are again based in rural areas, and again require rural pain for urban gain.\n\nEVs are for city folk as charging stations are few and far between in low-density areas. Rural residents ' role is to give: through inflated taxes for subsidies to lower the purchase price of EVs (e.g., $14,000 in Ontario), and through a degraded rural environment.\n\nUS EPA Administrator Scott Pruitt announced on October 9 that the Trump administration is moving to scrap the Clean Power Plan, the Obama administration 's signature regulatory program to curb emissions from coal-fired power plants. That rule really was about picking winners and losers, \u009d Mr. Pruitt said. The past administration was unapologetic, they were using every bit of power, authority to use the EPA to pick winners and losers on how we pick electricity in this country. That is wrong. \u009d The Clean Power Plan aimed to reduce CO emissions from coal-burning power plants by having states meet certain targets.\n\nIn its filing, the EPA said it would take comments on whether to write a new climate regulation that it says fits within the law. The agency said it will solicit information on systems of emission reduction that are in accord with the legal interpretation proposed in this notice, \u009d though that process is likely to be a lengthy one.\n\nEPA Administrator Scott Pruitt issued an Agency-wide directive on October 16 designed to end sue and settle \u009d practices within the agency. The days of regulation through litigation are over, \u009d said Mr. Pruitt. We will no longer go behind closed doors and use consent decrees and settlement agreements to resolve lawsuits filed against the Agency by special interest groups where doing so would circumvent the regulatory process set forth by Congress. Additionally, gone are the days of routinely paying tens of thousands of dollars in attorney 's fees to these groups with which we swiftly settle. \u009d\n\nMichael Greenstone, a professor of economics at the University of Chicago who worked on climate policy during the Obama years, fears the EPA 's repeal of the Clean Power Plan because: My read is that the political decision to repeal the Clean Power Plan was made and then they did whatever was necessary to make the numbers work. \u009d What Prof. Greenstone complains about is exactly what he and a colleague did in 2009, in order to regulate CO emissions by executive fiat without having to get Congressional approval. This included using a low discount rate, running their economic models out to the year 2300 and estimating the global costs and benefits, rather than just the US, to get a social cost of CO of $21/t (since raised to $40/t).\n\nThe duck curve \u009d is a graph of power production resembling the side view of a duck, that reveals a gap between peak demand times (typically in the evenings) and when solar electricity is being produced (i.e., around midday). Governor Jerry Brown signed into law a bill requiring the state Public Utilities Commission and all other locally-owned utilities to start planning to meet their net-load peak energy and reliability needs with alternatives to fossil-fuel generating plants, while also providing the electricity at the lowest cost to consumers. By mandating non-gas generating options, the bill forces utilities to seek other peak-time remedies like battery storage.\n\nMr. Abbot, Prime Minister of Australia (September 2013 to September 2015), gave a lecture to the Global Warming Policy Foundation on October 9. In it he discussed the evolution of climate policy in Australia, where politicians are now having to face the long-avoided reality that they can 't reduce emissions without hurting the economy.\n\nThe Australian Government will not adopt a Clean Energy Target recommended by the country 's chief scientist. Instead it will propose a new affordable, reliable \u009d plan to bring down electricity prices. The CET would have mandated a certain percentage of power be generated from gas and renewable energy, but some backbenchers did not like the idea. Former prime minister Tony Abbott argued a CET was effectively a \"tax on coal \u009d.\n\nA new report, The Anti-Development Bank: The World Bank 's Regressive Energy Policies by the London-based Global Warming Policy Foundation finds that the World Bank has abdicated its primary mission of tackling poverty in the developing world. The report states that the bank 's energy policies are hurting development and making poor countries poorer. By embracing high-cost, low-reliability renewables and restricting clean coal financing, the World Bank is guilty of an inhumane and senseless attempt to try and save the planet on the backs of the world 's poor, \u009d according to the report 's author.\n\nTesla Is Immune to Bad Financial Data\n\nTesla 's goal was to produce 1500 Model 3 EVs in the third quarter. On October 2 it announced that it had managed only 260, blaming unspecified bottlenecks \u009d for the shortfall. However, this had no effect on the company 's stock price, because Tesla 's stock doesn 't trade on data; it trades on the current of faith and doubt among the Tesla faithful. In fact the analysts would have been surprised if Tesla had come close to meeting its goal.\n\nA jury in North Dakota 's Pembina County on October 6 convicted environmental activist Michael Foster after a weeklong trial of criminal mischief, criminal trespass and conspiracy. Mr. Foster took part in effort on Oct. 11, 2016, to draw attention to climate change by turning off valves on five pipelines that bring Canadian oil south. He had hoped to use a legal tactic known as the climate necessity defense justifying a crime by arguing that it prevented a greater harm from happening. Prosecutors objected, saying they didn 't want a trial on global warming and the judge agreed, saying in part that a reasonable person could not conclude that (climate change) harms, however serious they might be, were imminent and certain to occur. \u009d\n\nThis is the title of a newly published article in the journal Scientometrics by Jank ³ et al. The authors compared the reference lists for the IPCC 's AR4 and AR5 reports with those of the corresponding Climate Change Reconsidered reports (CCRI and CCRII), that were published by the Nongovernmental International Panel on Climate Change. More specifically, the comparison involved (1) entering all references from the four reports into a database, (2) sorting them by author and by journal, (3) comparing the overlap and differences in citations between the two publishing entities and (4) examining the evolution (i.e., similarities and differences) of citations by each entity between their two reports.\n\nIn terms of differences, the IPCC tended to favour citations from journals that are focused more on the modelling enterprise, whereas the NIPCC tended to favour publications in the paleo-sciences. In-text analysis of the IPCC 's AR5 report revealed that 19 out of the 20 most frequently cited authors in that report were directly involved in the compilation of it.\n\nIn summing up their analysis the authors of the new paper write that the competitive situation created by the publications of the NIPCC reports is beneficial for climate science in general; it fosters knowledge creation, i.e. the reviewing process, mobilizing a growing number of references into review. \u009d\n\nMcKenna at the Mercy of Her Bureaucracy\n\nThe new provincial government in British Columbia announced during a mini-budget presentation that the province 's carbon tax will increase to $50/t in 2021 and will no longer be revenue neutral. \u009d In fact it hasn 't been revenue neutral since 2013-14, when it was hitting British Columbians with a cumulative tax increase of $865 million, or $728 for a family of four.\n\nLawrence Solomon: Paris is Dead; The Global Warming Policy Deniers Have Won\n\nAfter US President Donald Trump announced pullout from the Paris Climate Agreement, new revelations have come out that vindicate his decision. Stats from the Global Coal Plant Tracker portal confirmed that coal is on a tear, with 1600 plants planned or under construction in 62 countries. China is building 700 of these, many in foreign countries. Meanwhile, renewables investment fell by 18% last year over the peak year of 2015. As the subsidies come off, new investment will approach zero.\n\nNew data on renewables indicate that solar panels are laden with lead, chromium, cadmium and other heavy metals damned by environmentalists and employ hazardous materials such as sulphuric acid and phosphine gas in their manufacture and emit nitrogen trifluoride, a greenhouse gas 17,200 as potent as CO .\n\no date Canada 's federal climate policy is defined by: ratification of the Paris climate accord; imposition of a nation carbon pricing standard of $50/t by 2022; approval and support of certain hydrocarbon infrastructure; no major interventions on how Canadians are permitted to consume, produce or export hydrocarbons; and potential implementation of major regulatory changes to the approval process for hydrocarbon projects. However the government has failed to clarify how these elements relate to each other or how they will impact hydrocarbon production and consumption in Canada.\n\nIf the Trudeau government's preferred policy is no growth in Canadian hydrocarbon production, then it should say so. No carbon policy is not an option.\n\nAccording to a document seen by Reuters the US EPA will propose repealing the Clean Power Plan - the Obama administration 's centerpiece regulation to fight climate change - and plans to solicit input on a rule to replace it. The CPP was challenged in court by 27 states after the Obama administration launched it in 2015. It is currently suspended by the D.C. Circuit Court of Appeals, which set a deadline of October 6 for a status report from the EPA on how it plans to proceed.\n\nUS Federal Judge Deals Major Blow to the #ExxonKnew Crusaders\n\nThe Conservation Law Foundation sued ExxonMobil for allegedly failing to sufficiently prepare a facility in Everett, Mass., for the effects of climate change, including sea level rise and more frequent and severe storms. During the trial US District Court Judge Mark Wolf allowed ExxonMobil 's motion to dismiss to proceed, in part. The judge repeatedly suggested that CLF was unnecessarily injecting climate change into its complaint, to the detriment of the group 's own argument. He ordered CLF to refile its complaint with the references to climate change removed.\n\nCLF is an active participant in the #ExxonKnew campaign. Last year CLF received $250,000 from the Rockefeller Family Fund, one of the groups bankrolling the #ExxonKnew effort. CLF president Bradley Campbell attended a secret meeting with other #ExxonKnew activists at the offices of the Rockefeller Family Fund in January 2016 to hash out a plan to, among other things, establish in public 's mind that Exxon is a corrupt institution that has pushed humanity (and all creation) toward climate chaos and grave harm. \u009d\n\nIn Kelsey Cascadia Rose Juliana et al. v. The United States of America et al., 21 people aged 10 to 21 sued the Obama administration, arguing that the federal government has violated their constitutional rights by encouraging the use of fossil fuels, which produce greenhouse gases that the plaintiffs say are damaging the climate system. The Obama administration tried to have the cased dismissed in November 2015, but a federal judge denied its request, resulting in President Donald Trump inheriting the case.\n\nThe Ninth Circuit court issued its stay on July 25, giving it time to consider a petition filed by the Justice Department in June for a writ of mandamus allowing higher courts to review and overturn lower court decisions before they have even held a trial. The Trump administration is asking the court to intervene, review, and overturn a decision made by a federal judge last year to allow the climate lawsuit to go to trial.\n\nLast July the UK government said it would ban the sale of new gasoline and diesel cars and van from 2040. If so, the country must plough billions of pounds into new power plants, grid networks and electric vehicle charging points if it is to avoid local power shortages when the ban comes into effect. Although some conventional cars will remain on the road, numbers of electric vehicles (EVs) could balloon to 20 million by 2040 from around 90,000 today, experts estimate. Charging them all will require additional electricity.\n\nAccording to think-tank Agora Energiewende, Germany is jeopardizing its reputation as a global leader on climate action by missing its own 2020 greenhouse gas emissions-reduction target. Germany has committed to reducing its greenhouse gas emissions by 405 by 2020 compared to 1990 levels. But Agora calculates that without drastic new measures, the country will be looking at a reduction of just 30 and 31%.\n\nAgora 's president said US President Donald Trump, who found himself isolated at the G20 summit in June over his resistance to climate protection measures, would \"be glad to rub our noses in\" Germany's failure. To get back on track, Agora is calling for Germany to adopt an emergency \"Climate Protection 2020\" program as quickly as possible after the federal election this month.\n\nIn December 2015 Ecojustice filed a complaint with Canada 's Competition Bureau against Friends of Science and others calling for a thorough, rigorous inquiry of the denier groups and their climate science misrepresentations. \u009d Ecojustice pressed the bureau to to refer the application to the Attorney-General of Canada for criminal charges against the groups. Over a year and a half later the bureau informed FoS that it had discontinued its inquiry, a decision that Ecojustice took with ill grace.\n\nOn August 23 Canada 's National Energy Board sent a letter to TransCanada PipeLines, promoter of the Energy East oil pipeline project stating that it has decided to add Indirect Greenhouse Gas Emissions to its consideration of the project (Appendix 3, Issue 12). Specifically, Issue 12 states: Quantification of incremental indirect greenhouse gas emissions that could result if the Project is constructed, including from incremental upstream oil production and upgrading, incremental downstream refining and end-use, and incremental third-party electricity generation. \u009d\n\nAs Deborah Yedlin in the Calgary Herald notes, this is the first time in the NEB 's history that it has included a review of upstream GHG emissions associated with a project. The NEB 's letter agrees that these emissions are outside the control of TransCanada, but nevertheless it has decided to consider them anyway. According to Ms. Yedlin the NEB 's decision all but kills the project.\n\nOn August 22 the US Court of Appeals for the District of Columbia Circuit found that the Federal Energy Regulatory Commission did not properly analyze the climate impact from burning natural gas that a gas pipeline project would deliver to power plants. The ruling is significant because it adds to environmentalists ' arguments that analyses under the National Environmental Policy Act the law governing all environmental reviews of federal decisions must consider climate change and greenhouse gas emissions. The court 's decision overturns the project 's federal approval and returns the issue to FERC to complete the necessary greenhouse gas analysis.\n\nGreenpeace Sued by Another of Its Targets\n\nThe company that built the disputed Dakota Access oil pipeline filed a lawsuit against Greenpeace and other groups on August 22, alleging that they disseminated false and misleading information about the project and interfered with its construction. In its lawsuit Texas-based Energy Transfer Partners requests damages that could approach $1 billion. The company alleges that the groups ' actions interfered with its business, facilitated crimes and acts of terrorism, incited violence, targeted financial institutions that backed the project and violated racketeering and defamation laws.\n\nMontreal-based Resolute Forest Products is also suing Greenpeace in federal court in the State of Georgia under American racketeering laws [FoS Extracts - 2017-03-29.]\n\nThe Guardian was quick to publish a piece by Michael Mann blaming human-caused warming of the ocean for making Hurricane Harvey more intense that it would have been in the absence of such warming. While he is careful not to say that climate change caused \u009d Harvey, he alleges that it exacerbated its impact. An article in The Week predicts that Hurricane Harvey is America 's future.\n\nRoy Spencer blames Harvey 's impact on Houston 's expansion that covered up soil (which could have absorbed much of the rain) with roads, parking lots and buildings, with the drainage in the direction of downtown Houston. In a second article he explains why major hurricane intensity in Texas is not related to water temperatures in the Gulf of Mexico. The Independent Journal Review shows five charts that provide context for the trend of hurricanes leading up to Harvey. One shows the ten deadliest Atlantic hurricanes between 1780 and 1998, all with 4,000 - 19,000 fatalities.\n\nThe Trump administration has decided to disband the federal advisory panel for the National Climate Assessment, a group aimed at helping policymakers and private-sector officials incorporate the government 's climate analysis into long-term planning. The charter for the 15-person Advisory Committee for the Sustained National Climate Assessment which includes academics as well as local officials and corporate representatives expired on Sunday, August 27. The previous Friday the National Oceanic and Atmospheric Administration 's acting administrator, Ben Friedman, informed the committee 's chair that the agency would not renew the panel.\n\nThe advisory committee 's chair, Richard Moss, called its disbanding short-sighted. \u009d Not a lot of people know that points out that Dr. Moss was formerly managing director for climate change at the WWF and a member of the IPCC since 1993.\n\nOn climate change policy, specifically through the Western Climate Initiative, Ontario is about to tie itself to California. Peter Shawn Taylor, writing in the National Post, likens this to one of those old jailhouse films about escaping prisoners shackled together. California 's economy is the six-biggest in the world, and its emissions account for …” of those within the WCI (Quebec is the third member.) Thus, California will be setting the carbon price for the all three jurisdictions. At the current price of $18/t this doesn 't seem to be a concern, but as California 's permit surplus dissipates the price will rise.\n\nMoreover, Ontario and Quebec could find themselves hostage to US politics as the Golden State sets an aggressive goal of reducing greenhouse gas emissions 40% below 1990 levels by 2030. Under a recent deal to reduce the the state 's permit surplus, California 's farmers and businesses will see benefits not available in the Canadian provinces, and permit prices could rise above $70/t by 2025ï¼\u008dsignificantly higher than the maximum price of $50/t demanded by Ottawa through its national carbon tax.\n\nUS Environmental Protection Agency chief Scott Pruitt said his staff will gauge the accuracy \u009d of a major federal science report that blames human activity for climate change just days after researchers voiced their fears to The New York Times that the Trump administration would alter or suppress its findings.\n\nLawrence Solomon describes fake business as enterprises that thrive despite having few customers willing to buy their products, except a fire-sale prices. And, they all have the same angel investorsï¼\u008dgovernments. Today 's fake-industry leader is Tesla, the electric car maker developed by Elon Musk, who also heads SolarCity and SpaceX, other government darlings. By 2015 US governments had given his companies $5 billion through direct grants, tax break, cut-rate loans, cashable environmental credits, tax credits, and rebates to buyers of his products. In addition, governments in Canada, Europe and Asia subsidize the sale of Tesla cars.\n\nThe Union of Concerned Scientists is very distressed that the US is abandoning its historic leadership role in funding the IPCC. There is zero funding for the IPCC in both FY2017 and FY2018. In FY2016 the US contributed $2 million.\n\nThe second link below lists various documents prepared for the 46th IPCC meeting September 6-10 in Montreal. Doc. 2 contains the IPCC 's budget, which is in Swiss francs (CHF 1.0 ‰ˆ USD 1.03). The 2017 budget (Doc. 2, p. 8) is CHF 8.3 million, so the US non-contribution works out to about 23%. Item 3 of the provisional agenda for Montreal (Doc. 1) is devoted to budget matters, as was Item 3 of the 45th meeting (Doc. 5) indicating that much of the IPCC 's efforts are devoted to funding.\n\nA Nature story finds that wishful thinking and bravado are eclipsing reality \u009d as all major industrialized countries are failing the meet their Paris Agreement pledges to cut greenhouse gas emissions. EU countries are struggling to increase energy efficiency and renewable power, and Japan is finding that meeting its goals will cost more than the country is willing to pay. Nature calls on governments that want the Paris Agreement to work to revisit their pledges now (not in 2020) and open up their pledges for voluntary peer review by other nations and by scientists.\n\nJudith Curry summarizes two cases regarding attribution of global warming that are now before US courts. The first, Juliana vs US, concerns a group of youths, coached by James Hansen, who blame the US government for declining to sign on to the Kyoto Protocol, pass a CO2 tax and trade bill, and a Senate that declined to vote favourably on the Paris Agreement. This case goes to trial in early 2018. In the second case, Marin County, California is suing 37 major oil companies, alleging that they should have stopped producing fossil fuels, knowing that their products would cause sea-level rise and coastal flooding.\n\nThe media went gaga over France 's and the UK 's proposals to eliminate the use of internal combustion engines in automobiles by replacing them with battery-powered electric vehicles. To replace all light vehicles in the UK with EVs, while also meeting the requirements of the country 's Climate Change Act, would require building 39,000 2-MW wind turbines, which is nearly six times the number built over the last 15 years. The cost would be approximately $165 billion, not including building EV charging stations, costs for changes to transmission and distribution systems, and backup storage for the windmills.\n\nSusan Crockford wonders what is causing the death of the polar bear as a global warming icon. It could be because there are lots of fat bears around, and their numbers haven 't declined as predicted. Dr. Crockford notes that global warming enthusiasts won 't acknowledge the simple truth that the model-predicted catastrophe for the bears due to diminished summer ice turned out to be wrong. Polar bears are no longer a useful global warming icon because they are thriving despite diminished sea ice.\n\nA group called Minnesotans for Global Warming has produced this hilarious 4-minute video of a Michael Mann impersonator singing a parody of Al Gore and his Inconvenient Truth and Inconvenient Sequel films.\n\nInconvenient Sequel continues to bomb at the box office, showing at over 500 theatres while hitting a new low of $117 sales per theatre.\n\nThis is the title of a paper by Swedish scientist Nils-Axel M ¶rner, who provides evidence that the US agency NOAA has been correcting \u009d the satellite-measured altimetry to show a sea-level rise of about 3.0 mm/year. Tide gauge data show that the actual value varies between ±1.7 mm/year and +0.25 mm/year, depending on the choice of stations. Dr. M ¶rner concludes: Therefore, we should free the world from the horror issue that low-lying coasts and islands will become seriously flooded in this century. \u009d\n\nOn July 18 Siemens Canada announced the closing of its Tillsonburg, Ontario plant that makes blades for wind turbines, with the loss of 340 green \u009d jobs. The factory is one of four green-energy plants set up under a controversial multi-billion dollar deal with Samsung. According to energy analyst Tom Adams: Samsung had no history in renewable energy before they came to Ontario. They came only for the subsidies, and when the subsidies dry up, they 'll disappear as quick as they landed. \u009d\n\nOntario Wind Resistance recalls the Ontario government 's promises starting in 2010 when it boasted that the deal with Samsung would create 15,000 jobs as part of a renewable energy scheme of 50,000 jobs. The promised 15,000 Samsung jobs fell in stages to 900 in 2014. Another Samsung partner, CS Wind, promised to open factories and hire 500 local workers to build towers used in wind turbines. Instead they ended up hiring 30 workers from Vietnam.\n\nUS Submits Formal Notice of Withdrawal from Paris Agreement\n\nOn August 4 the US State Department officially informed the UN that it will withdraw from the Paris Agreement, but left the door open to re-engaging if the terms were improved for the US. A press release stated that the US will continue to participate in international climate negotiations and meetings, including COP 23 next November. The earliest date for the US to fully withdraw from the agreement is November 4, 2020, around the time of the next US presidential election.\n\nThe sequel to Al Gore 's 2006 documentary An Inconvenient Truth is called An Inconvenient Sequel: Truth to Power and was released last January. Even the reviewer at the warmist Vox left the theatre discouraged, more cynical and more certain that nothing can be done. He found the sequel a little light on the facts at times. The National Review article calls the new film An Incoherent Sequel and digs into Mr. Gore 's misleading predictions, and his personal and family involvement with SolarCity, a firm that ate up billions in taxpayer-funder dollars before its share price tanked and it got folded into Tesla.\n\nThe Global Warming Policy Foundation points out that fear is the business model that has made Al Gore rich. Joanne Nova notes that his swimming pool uses as much electricity as six US homes.\n\nNatural catastrophes worldwide were less devastating in the first half of 2017 than the average over the past 10 years, reinsurer Munich Re said on July 18, while highlighting the role of climate change in severe US storms. Some 3,200 people lost their lives to disasters between January and June, the German group found well short of the 10-year average of 47,000 for the period or the 5,100 deaths in the first half of 2016.\n\nDespite Chancellor Angela Merkel's ambitions for Europe's biggest economy to be a role model in tackling climate change, burning coal for power looks set to remain the backbone of Germany 's energy supply.for decades. The chancellor is avoiding the sensitive subject of phasing out coal, which could hit tens of thousands of jobs, in the campaign for the Sept. 24 election. Although well over ‚ 20 billion are spent each year to boost Germany's green energy sector, coal still accounts for 40% of energy generation, down just 10 points from 2000\n\nEU Blasts Trump for Rejecting Paris Accord, then Increases Coal Imports from the US\n\nUS coal exports have jumped more than 60% this year due to soaring demand from Europe and Asia, according to government data, allowing President Trump's administration to claim that efforts to revive the battered industry are working. The increased shipments came as the European Union and other US allies heaped criticism on the Trump administration for its rejection of the Paris Climate Accord, a deal agreed by nearly 200 countries to cut carbon emissions from the burning of fossil fuels like coal. The previously unpublished figures provided by the US Energy Information Administration showed exports of the fuel from January through May totalled 36.79 million tons, up 60.3% from 22.94 million tons in the same period in 2016.\n\nAccording to a Spiegel report five German car brands (Daimler, BMW, Volkswagen, Audi and Porsche) met in the 1990s to coordinate activities related to their vehicle technology, costs, suppliers and strategy as well as emissions controls in diesel engines. Recently, Daimler recalled 3 million diesel cars to lower their emissions, and Audi is embarking on a voluntary recall of 850,000 vehicles.\n\nExxon, Shell, et al Sued for Sea-level Rises in California\n\nThree California coastal communities have launched legal action against some of the world 's biggest oil, gas and coal companies, seeking compensation for the current and future costs of adapting to sea level rises linked to climate change. They claim greenhouse gas emissions from the fossil fuel companies ' activities over the last 50 years have locked in substantial sea level rises, which will cause billions of dollars ' worth of damage to properties and businesses, as well as endangering lives.\n\nWe 're told that every electric vehicle sale will help prevent assumed and asserted manmade climate and whether disasters. Yet, total sales in the US represented less than 1% of car and light truck deliveries in 2016, and plug-in EVs represent 0.15% of 1.4 billion vehicles on the road worldwide.\n\nIn recent months, Tesla sales plunged to nearly zero in Hong Kong and Denmark, as huge government subsidies were eliminated. Now Tesla 's US subsidies face extinction. Once its cumulative sales since 2009 reach 200,000 vehicles in the next few months, federal tax rebates will plunge from $7,500 per car to zero over an 18-month period. The same thing will happen to other EV companies that reach 200,000.\n\nIntent on advancing its renewable energy and climate change agenda, the California legislature recently enacted a new cap-and-trade law that will generate revenues for Tesla, by increasing hidden taxes on motor fuels, electricity and consumer products with the state 's poor, minority and working class families again being hit hardest. State legislators are also close to passing a $3-billion EV subsidy program, primarily to replace the $7,500 federal rebate that Tesla could soon lose. Electric vehicle buyers could soon receive up to $40,000 for buying Tesla 's most expensive models.\n\nLithium batteries and their component metals pose unique fire and explosion risks. Their life expectancy, compared to gasoline-powered cars is less, and there will be the problem of disposing millions or billions of them and their toxic components. The Daily Mail reports on the human costs for child labourers in a Congo cobalt mine in the rush to bring millions of EVs to our roads.\n\nSince January 2016, when the US first deployed ocean wind turbines, over 40 whales have washed ashore from North Carolina to Maine. Living too close to wind turbines can cause heart disease, tinnitus, vertigo, increase in heart disease, migraine, panic attacks and other health problems. Between January and February this year of 2016, 29 sperm whales got stranded and died on English, German and Dutch beaches. Environmentalists and the news media offered multiple explanations except the most obvious and likely one: offshore wind farms.\n\nCanadian Poll: Carbon Tax More Popular in Theory than Reality\n\nA new poll by the Angus Reid Institute found that more than half of Canadians (55%) want the federal government to halt plans for a national carbon tax if it means placing the country in a competitive disadvantage with the US. In April 2015, 56% were in favour of a carbon tax, but that support has dropped as the concept morphed from hypothetical to reality with the federal announcement of a national floor price of $10/t on CO emissions in 2018, rising to $50/t in 2\n\nTo Stop Global Warming: No Kids, No Cars, No Meat, No Flying!\n\nIf Prime Minister Justin Trudeau really wants to save the planet from man-made global warming, he should tell Canadians to stop having kids, don 't drive, don 't fly and don 't eat meat. Those are the four most efficient ways of reducing industrial greenhouse gas emissions in the developed world. By co ntrast, the solutions \u009d pushed by Canadian governments and educators, such as recycling and switching to energy efficient lightbulbs, while they may be fe\n\nA study by University of British Columbia PhD student Seth Wynes and Prof. Kimberly Nicholas of Sweden 's Lund University, in their paper, The climate mitigation gap: education and government recommendations miss the most effective individual actions \u009d was published in the journal Environmental Research Letters. The biggest saving comes from having no children, or fewer of them, with each unborn child saving 58.6 t/a of CO , (0.213 t/a by recycling). Going carless saves 2.4 t/a (0.1 t/a by replacing incandescent lightbulbs); avoiding one transatlantic flight per year saves 1.6 t of emissions (0.247 t by washing clothes in cold water); switching to a plant-based diet saves 0.8 t/a of emissions (0.21 t/a by hanging out clothes to dry).\n\nLeaders of 19 nations at the G20 summit in Germany renewed their pledge to implement the Paris deal on climate change, despite the US pulling out. Deadlock over the issue had held up the last day of talks in Hamburg but a final agreement was eventually reached. It acknowledges President Donald Trump's withdrawal from the Paris climate agreement without undermining the commitment of other countries.\n\nTrump to Steer UN Global Warming Funds to Coal and Gas Projects\n\nThe Trump administration will use its position as a donor to the UN Green Climate Fund to steer money towards coal-fired power plants and natural gas infrastructure, according to a White House official. The US already has donated $1 billion to the GCF, and it can now use its seat on the GCF 's board to advance American-energy interests globally. Activists from the Friends of the Earth and the Sierra Club were outraged at the news.\n\nWhen China halted plans for more than 100 new coal-fired power plants this year, even as President Trump vowed to bring back coal \u009d in America, the contrast seemed to confirm Beijing 's new role as a leader in the fight against climate change. But new data on the world 's biggest developers of coal-fired power plants paints a very different picture: China 's energy companies will make up nearly half of the new coal generation expected to go online in the next decade. This amounts to 700 new coal plants at home and around the world, some in countries that now burn little or no coal.\n\nScott Pruitt, Administrator of the US Environmental Protection Agency, is leading a formal initiative to challenge mainstream climate science using a \"back-and-forth critique\" by government-recruited experts, according to a senior administration official. he program will use \"red team, blue team\" exercises to conduct an \"at-length evaluation of U.S. climate science,\" the official said, referring to a concept developed by the military to identify vulnerabilities in field operations.\n\nClimate scientists expressed concern that the \"red team, blue team\" concept could politicize scientific research and disproportionately elevate the views of a relatively small number of experts who disagree with mainstream scientists. One of them, Michael Mann said that the red-team concept is un-American \u009d and a ruse to run a pro-fossil fuel industry disinformation campaign aimed at confusing the public and policymakers over what is potentially the greatest threat we face as a civilization. \u009d\n\nWindpower 's Future in the US Threatened by Local Opposition\n\nThe lustre is coming off wind power as an economically viable, environmentally-friendly, community-friendly source of America 's energy future and for some very good reasons. To start, rural residents across America are increasingly rejecting the encroachment of wind-energy projects in their communities whenever they get a chance to voice their opinions in local ballots.\n\nRural communities from Maine to California are are rejecting Big Wind, something that doesn 't fit with the popular media 's narrative that wind energy is green. \u009d For many of these communities, concerns about land use, noise, aesthetics, lower property values, and bat and bird mortality all played an important role in their overwhelming votes against wind power.\n\nCalifornia governor Jerry Brown has called for 1.5 million electric vehicles on the state 's roadways by 2025, but there are only 300,000 of them in the state at this moment. Last year, zero-emissions cars accounted for only 2% of the 2 million new vehicles sold in the state. California Assemblyman Phil Ting of San Francisco has introduced legislation that would add $3 billion to the state 's zero-emissions incentive program over the next 12 years. We 've been able to dispel the notion that you can 't clean the environment and grow the economy, \u009d Mr. Ting says. The next wave is electric vehicles. \u009d\n\nMr. Ting 's bill would create the California Electric Car Initiative. In essence, the program is designed to achieve price parity between zero-emissions cars and conventional cars. For instance, claims the San Jose Mercury News, if a given electric car costs $40,000 but a similar conventional car costs $25,000, the state rebate could be up to $7,500. Add that to the federal tax credit of $7,500 and the cost to the consumer is the same. The thinking is that if a person can buy a zero-emission vehicle for the same price as a car with an internal combustion engine, more people will opt for the ZEV over a conventional car.\n\nWith 35% of new cars in the country being electric and a 2025 goal of 100%, Norway is the world leader in EVs. The EV success is a result of a sales tax subsidy on their initial purchase, waiving of steep highway tolls and providing free parking. However, the EV industry is worried about what 's happening in Denmark, where the subsidies are coming off and EV sales dropping [FoS Extracts - 2017-06-13]. Moreover, the cost of the subsidies is becoming an issue in the campaign for the September 11, 2017 election for the Norwegian Parliament.\n\nLike Norway China subsidizes EVs to boost customer acceptance, with the subsidies making up about half the cost of each vehicle. The other half of the cost is the battery, which is basically what the customer is paying for. A problem is that EV batteries wear out rapidly, so the EV depreciates much faster than a gasoline car. Also, Chinese buyers are finding EV vehicles perform poorly during harsh Beijing winters and lack the power to climb long ramps.\n\nWhy Renewable Energy is (Mostly) a Scam\n\nRenewable energy advocates have claimed for decades that solar and wind power are the future and the future is right around the corner. Some, supported by the mainstream media, boldly state that the world could be powered by renewable energy sources as early as 2030, given the exponential growth of solar and wind electrical capacity. However, three key facts about renewable energy mean that wind and solar will remain insignificant for the foreseeable future: (1) despite 30 years of government subsidies, wind turbines produce just 0.46% of global energy, require huge land areas and are intermittent; (2) burning dung and wood produces more energy than wind and solar combined; (3) we 'd need 7.2 Earth 's worth of rare minerals to switch to solar energy.\n\nTired of Being Wrong, Climate Alarmists Move Doomsday to Next Century\n\nsaid in 2009 that there was a 75% chance that the entire arctic polar ice cap would melt by 2014, but it 's still there. The year before the North Pole was supposed to be gone, noted climate scientist Hans von Storch went against cult orthodoxy in an interview with Spiegel Online in 2013. He noted that climate change seems to be taking a break and suggested two explanations, neither is very pleasant for us \u009d: CO has less of an effect than assumed, and the simulations have underestimated how much climate fluctuates owing to natural causes.\n\nClimate alarmist James Hansen's prediction of Manhattan being underwater by 2018 seems to not be happening, so he's moving his own goal posts and saying 50 to 150 years \u009d now.\n\nIn late May, 40 scientists from five Canadian universities set off from Quebec City on the icebreaker and Arctic research vessel CCGS Amundsen. The expedit ion was the first leg of a four-year, $17 million research project designed to delve into the effects of climate change on Hudson Bay. However, it q uickly got caught in 25-feet thick ice off the northern coast of Newfoundland and had to turn back. The scientists, with no evidence, are blaming their botched expedition on global warming, or climate change as they call it.\n\nElectric Car Subsidies Take Greenwashing to a New Level\n\nThe Globe and Mail 's Konrad Yakabuski, like the majority of his mainstream media colleagues, believes in policies to curb carbon \u009d emissions. This doesn 't stop him from castigating greener-than-thou politicians, who, rather than facing voter wrath over economy-wide $50-$100/t CO taxes needed to meet Canada 's 2020 emission targets, prefer to subsidize electric vehicles as a substitute for real action. A report from Canada 's Ecofiscal Commission estimates that Quebec 's $8,000 rebate per EV works out to $395/t of CO removed from the atmosphere. In Ontario wealthy Tesla buyers can claim $14,000.\n\nThe Canadian federal government 's recently-negotiated implementation of various provincial schemes into a national carbon tax seems doomed to failure in the long run, due to design flaws and poor political packaging. The taxes won 't be revenue-neutral across the country; raising the cost of domestic production, but not taxing imports based on their carbon intensity will penalize domestic producers selling into the home market. carbon taxes raise income inequality as lower-income people spend more on basics such as home heating and gasoline; the proposed $50/t tax is too low to expect real changes in peoples ' behaviour. Finally, carbon taxes are unpopular, making them an easy target for their opponents trying to get elected.\n\nNew Study: Large CO Emissions from EV Batteries\n\nEnormous hope rests on electric cars as the solution by the motor industry to climate change. However the batteries of electric cars are not environmentally friendly when manufactured. Several tonnes of carbon dioxide are being released, even before electric batteries leave the factory, according to IVL, the Swedish environmental institute. For example, manufacturing each kWh of storage capacity releases 150-200 kg of CO equivalent. This means that for each new Nissan Leaf (30 kWh) and Tesla S (100 kWh) 5.3 t and 17.5 t, respectively of CO have been released by their batteries before delivery to their customers. By way of comparison, a trip for a person returning from Stockholm to New York by air causes emissions of more than 600 kg of CO\n\nNew Report: CCS Would Make Nuclear and Renewables Look Cheap\n\nProfessor Gordon Hughes, Professor of Economics at the University of Edinburgh and a former adviser to the World Bank has issued a new report, The Bottomless Pit: The Economics of Carbon Capture and Storage, that says that claims that costs will fall quickly are unlikely to be borne out in practice and even if they are, the total investment required makes CCS little more than a utopian dream.\n\nMost R&D on CCS has focused on baseload coal plants that operate at 85-95% of capacity throughout the year. This allows the high costs involved to be spread out ~7,500 hours/year over 30+ years. Large, vertically-integrated electric utilities are able to pass these costs on to their customers, but such utilities have largely disappeared in rich countries. Moreover, the money spent on renewables, which are intermittent and have low marginal costs, displace coal and gas generation when available. Coal plants with CCS cannot economically meet the demand when renewables aren 't available.\n\nEven under the best cost scenario by 2040, the cost of reducing emissions by fitting CCS to gas or coal plants will be at least $120/t of CO for baseload plants, and $160-200/t for plants operating at 50-60% load factor.\n\nPeriodic National Assessments of the effects of climate change on the US are mandated by the 1990 Global Change Research Act. The next Assessment Report (NCA4) is scheduled to be published in late 2018. This will be produced by mainly unifireable civil servants reporting to Obama-era bosses, many of whom handle large amounts of climate research money and whose interest is to portray global warming as alarming.\n\nThe draft NCA4 chapters are about to go out for review, and Patrick Michaels of the Cato Institute proposes that the Trump Administration either not produce the report, or make it compatible with the best and newest data. The pervasive climate of exaggeration must change in order for federal climatology to maintain at least a shred of credibility.\n\nA power struggle is underway at the US Environmental Protection Agency. The agency has an 58-member Board of Scientific Counsellors, experts hired for three-year terms from outside the civil service. By August, the terms of 47 of the counsellors will have expired. In a move worthy of the British sitcom Yes Minister the permanent bureaucracy at the EPA hoped to hand the agency 's new political leadership with a fait accompli by (1) assuring the BOSC members whose terms were expiring that they would be staying on for another term, and (2) giving the leadership a list of Obama administration holdovers and saying sign here. \u009d\n\nThe team appointed by President Trump refused to do so, and the scorned bureaucrats leaked the decision to the media, shaping the narrative as a Trumpian anti-science firing \u009d of brave truth tellers. However, as the second article points out, cleaning out the BOSC is only scratching the surface: the EPA also has other entitled outside scientists collecting EPA grants while advising the agency.\n\nThe AMS Scolds Rick Perry for Believing that the Oceans Are Stronger than You SUV\n\nThe American Meteorological Society (AMS) sent a letter to DOE Secretary Rick Perry, scolding him for an opinion he uttered in a CNBC interview on June 19. Asked in an interview on CNBCs Squawk Box \u009d whether he believed that carbon dioxide was the primary control knob for the temperature of the Earth and for climate \u009d, Mr. Perry said that No, most likely the primary control knob is the ocean waters and this environment that we live in. \u009d Mr. Perry added that the fact is this shouldn 't be a debate about, Is the climate changing, is man having an effect on it? ' Yeah, we are. The question should be just how much, and what are the policy changes that we need to make to effect that? \u009d\n\nThe Executive Director of the AMS responded to Mr. Perry 's heresy by stating that CO and other greenhouse gases are the primary cause of the changing climate, based on: multiple independent lines of evidence that have been affirmed by thousands of independent scientists and numerous scientific institutions around the world. \u009d He called the findings indisputable. \u009d Roy Spencer then picks apart the indisputable findings \u009d assertion.\n\nThe Renewable Energy Policy Network for the 21st Century (REN21) s a membership organization counting industry associations, NGOs and other international organizations, and even national governments, including those of the US and UK. It has just issued its 2017 global status report, that bemoans the fact that, while a global energy transition is underway, \u009d the pace of transition to renewables is not on track to meet the goals of the Paris Agreement.\n\nIn spite of decades of sustained government support, wind and solar, the modern renewables on which the future of current climate policy depend, are still only 1% of world 's final energy consumption. Thus, there is no renewables explosion. \u009d The reaction is still endothermic, and dependent on continuing external input. When the subsidies stop, the sector will cool and die.\n\nTwo papers, one in Nature Geoscience and the other in Proceedings of the National Academy of Sciences, make inconvenient news for the climate warming advocates. The first, with lead author Ben Santer, one of the leading climatistas, ponders the problem why observed tropospheric temperatures don 't match climate model predictions. While the authors have done all the necessary contortions to say our models are just a little off \u009d, it can hardly be reassuring to them and their supporters, to concede the problem.\n\nThe second paper refutes the contention of one of the heroes of the climate fantasists, Stanford 's Mark Jacobson, who has been arguing for some time now that the US can get to 100% renewable electricity (wind, solar, and hydro) by the year 2050. In particular, it points out that Prof. Jacobson 's work relied on invalid modelling tools, contained modelling errors and inadequately supported assumptions.\n\nNo, Cities Are Not Actually Leading on Climate\n\nA former director for the DC government 's energy division examines the cities are leading on climate \u009d myth. The cities like to claim for themselves reductions in emissions (e.g., buildings, transportation) that result from actions by higher levels of government. Solar panels may dot farmlands and deserts, but the Sun is not yet powering urban areas (e.g., only 0.3% in New York City.) Cities meet their nebulous climate goals by purchasing renewable energy certificates that constitute a shell game. No city reports its electricity consumption more frequently than annually, and lots don 't report it at all. New schools, while supposedly more efficient, are loaded with computers, electronic equipment and air conditioning, all of which use more electricity than the ones they replaced. Cities have substituted press released for action.\n\nBloomberg New Energy Finance has issued a new report projecting a total expenditure of $12.7 trillion needed to keep global warming below 2 °C, a goal of the Paris Accord. Of this, $7.4 trillion will have to be spent on new green energy capacity by 2040.\n\nWind Power Fails in Canadaï¼\u008dA 23-year Life Span Not Likely to be Replaced\n\nThe oldest commercial wind power facility in Canada has been shut down and faces demolition after 23 years of transforming brisk southern Alberta breezes into electricity. Its owner, TransAlta Corp., announced that that a replacement is dependent on help from the provincial government. A company spokesman said: We 're anxiously waiting to see what incentives might come from our new government. . . . Alberta is an open market and the wholesale price when it 's windy is quite low, so there 's just not the return on investment in today 's situation. So, if there is an incentive, we 'd jump all over that. \u009d\n\nCanadians Should be Grateful to Donald Trump for Killing the Paris Deal\n\nLawrence Solomon, director of Energy Probe, argues that Donald Trump 's decision to withdraw from the Paris climate agreement will be profound and positiveï¼\u008dfor the global environment and economy, and especially for Canada. The Paris agreement, even though its targets were voluntary, gulled a large segment of the public into thinking that countries had made a grand bargain to which they must adhere, thereby giving politicians justification for taxing their citizens through carbon policies. With the collapse of the Paris accord the grand bargain no longer exists, and politicians are no longer able to exhort their citizens to pay carbon-related levies in solidarity with the rest of the world. For Canadians, there is now hope for an end to the ruinous policies, such as those that led to unaffordable power prices, that have led manufacturing industries to move to America 's low-cost regions.\n\nProcter and Gamble is the latest company to leave, fleeing coal-free Ontario for the low-cost coal country of West Virginia. The Conservative Party 's new leader, Andrew Scheer, has promised to abolish Prime Minister Trudeau 's cash grab \u009d carbon tax, saying it raises the cost of everything and puts jobs at risk while doing little for the environment. \u009d\n\nFollowing the G-7 summit in Sicily, German Chancellor Angela Merkel counted Canada 's Justin Trudeau among her reliable partners on the climate file, as he stood by her when she confronted US President Donald Trump on the issue. For the G-20 summit in Hamburg next month the German government is preparing a 13-page Action Plan on Climate, Energy and Growth \u009d that asks signatories to commit themselves to he restructuring of energy systems consistent with Paris\" and to their \"nationally determined contributions\" for cutting greenhouse gas emissions. Ms. Merkel hoped to get 19 of the G-20 participants to sign the action plan in Hamburg, thereby isolating Mr. Trump in light of his recently-announced withdrawal from the Paris Agreement.\n\nHowever, Ms. Markel got a shock when she called Mr. Trudeau on June 6 to discuss the action plan and Mr. Trudeau expressed doubts about her strategy. Also, Britain and Japan are now reluctant to gang up against the US. In other words, climate policy is great, but when it comes to national interests, it is secondary.\n\nWhy Big Business CEOs Lean Left on the Paris Climate Deal\n\nThe CEOs of General Electric and Goldman Sachs went ballistic when Donald Trump announced that he would withdraw the US from the Paris Agreement. It is no surprise that big business leans left: it is in favour of sweeping regulation by governments of the world, because that 's how much of it stays rich. Indeed some companies make their fortunes exclusively through government subsidies and mandates. For example the US renewable energy industry expects to receive $7.8 trillion in investment between now and 2040, as a result of successful lobbying by companies like General Electric and Goldman Sachs. For the most part, big business and big government are two sides of the same coin, each dependent on the other for its funding, each scratching the other 's back.\n\nThe EU 's total greenhouse gas emissions increased in 2015, for the first time since 2010. According to new data published by the European Environment Agency (EEA), the 0.5% increase happened largely due to increasing demand for transport better fuel efficiency in the sector was not enough to offset this. The report suggests a slightly colder winter across Europe also contributed to increased emissions, due to higher demand for heating.\n\nDenmark Is Killing Tesla and Other Electric Cars\n\nIn the country that pioneered renewable energy, sales of electric vehicles, including plunged 60.5% in the first quarter of 2017. The reason: the Danish government announced the progressive phasing out of tax breaks on electric cars, citing budget constraints and the need to level the playing field. In Denmark EVs are spared the 180% tax applied to traditional vehicles. The new tax regime \"completely killed the market,\" Laerke Flader, head of the Danish Electric Car Alliance, complained in a recent interview. \"Price really matters.\"\n\nEPA 's Pruitt: Establish Red Team, Blue Team ' of scientists to examine climate risk of CO2\n\nAccording to the US Environmental Protection Agency 's Administrator Scott Pruitt: What the American people deserve, I think, is a true legitimate, peer reviewed, objective, transparent discussion about CO . \u009d To this end Mr. Pruitt proposes red and blue teams of scientists to ask what we do and don 't know, what risks it poses to human health in the US and the world.\n\nIn a Daily Signal story, while scientist John Christy favours the idea, his consensus \u009d colleagues disagree, fearing that it could manipulate public understanding of the science and give a false impression of uncertainty, thereby delaying action on global warming.\n\nJohn Cook, a cognitive scientist at the Center for Climate Change Communication at George Mason University in Virginia tested a psychological theory that people are more resistant to misinformation if they are warned about it beforehand. In this case he used the Oregon Petition, which urged the US to withdraw from the Kyoto Protocol. When participants were told that there is no disagreement among climate scientists that humans are causing climate change, they tended to become protected \u009d against the message of the petition.\n\nAccording to Dr. Cook: There is a consensus of evidence that human activity is causing all of recent global warming. Not some of it. Not even most of it. All of it. \u009d\n\nFrench President Offers US Climate Scientists ‚ 1.5 Million Each to Move to France\n\nFrench President Emmanuel Macron this week launched a website which aims to encourage US scientists and researchers frustrated with President Donald Trump 's position on climate change to move to France. The website Make Our Planet Great Again \u009d was a clear dig at Mr. Trump and his June 1 announcement that he would withdraw the United States from the Paris climate agreement. The website said senior university faculty members, but also junior researchers and PhD candidates, were eligible to move to France to work on climate change, earth system science or energy transition projects, promising generous financing and help with moving to the country.\n\nThe last FoS Extracts [2017-05-30] featured a Dilbert cartoon poking fun at climate scientists and their confidence in models. In response, a communications group at Yale University made a video of a serious group of scientists using charts and data in an effort to downplay the role of models. This Cato Institute article picks apart the arguments of the scientists and exposes their groupthink. As the author concludes, the Yale video sought to rebut Adams ' cartoon and ended up being a documentary version of it. \u009d\n\nOn the same subject Scott Adams ' blog has a post Betting on Climate Change, in which he notes the positive stock market reaction to Donald Trump 's decision to pull the US out of the Paris Climate Accord. Mr. Adams proposes that alarmists should bet on climate change predictions (e.g., sea level and temperature changes against agreed upon standards) in order to hedge against the economic catastrophe they see coming.\n\nLord Stern, author of the Stern Review (2006), a government report which was used as the basis of UK climate policy, now says we need a four trillion dollar per annum carbon tax to save the world from CO . This would be achieved by a $50-100/tonne tax on CO applied across the world. The report by Lord Stern and 12 other economists was sponsored by the World Bank.\n\nadministration has submitted a document Major Savings and Reforms, Budget of the US Government, Fiscal Year 2018 that describes m ajor savings and reform proposals. It highlights 2018 savings of $57.3 billion in discretionary expenditures. On page 6 it eliminates $1.6 billion for Green Climate Fund and Global Climate Change Initiative \u009d that were included in FY 2017. Details and justification for the elimination are provided on page 75.\n\nUnder the Paris climate accord, Europe promised to shave 40% off its emissions by 2030, mostly by revising existing climate laws on renewables, energy efficiency and its flagship Emissions Trading System. However the Visegr ¡d group of countries (Poland, Czech Republic, Slovakia and Hungary) are trying to gut, block or water down all of these efforts. Poland has also launched a manoeuvre that may block the EU 's winter package in its entirety particularly a planned limit on power plant emissions if it is signed up to by a third of EU parliaments, or 10-13 states.\n\nGerman Solar Energy: From the Technology of the Future \u009d to Extinction in 10 Years\n\nGermany 's solar energy industry was to be the technology of the future and a promise of economic revival in the former East Germany. However, after six years of red ink the country 's last major solar manufacturer, Solarworld, led by CEO and Green Party co-founder Frank Asbeck, will file for insolvency. Mr. Asbeck blames his company 's woes on cheap imports from China and legal battles in the US. Solarworld 's demise is the last in a spectacular series of solar manufacturer bankruptcies that swept across Germany over the past years, with names like Solon, Solar Millenium and Q-Cells going under.\n\nThe report, by British-based research group InfluenceMap shows that investors in China and India increasingly dominate ownership of coal reserves amid campaign for divestment in many rich nations. It said that ownership of thermal coal, used in power plants, was dominated by \"strategic investors in China and India (governments, individuals, power companies, special purpose companies). \u009d Both countries say they will need coal for decades to bolster economic growth.\n\nEU Nations Set to Wipe Out Forests and Not Account for Emissions\n\nEuropean nations publicly keen to boost their climate credentials by switching to green \u009d biomass are accused of working behind the scenes to expunge their carbon emissions from burning wood in power stations from national emissions statistics. Under international climate treaties such as the Paris Agreement, burning biomass like wood is defined as carbon-neutral, even though it emits as least as much CO as fossil fuels. The assumption is that new trees will be grown to take up the carbon emitted from the burning. France, Austria, Sweden and Finland are trying to weaken the EU 's rules by increasing their timber harvests, resulting in a 30% reduction of the EU 's total forest management sink.\n\nAfrica Has Become Greener in the Past 20 Years\n\nA new study in Nature Ecology & Evolution, with authors from Denmark and Spain, reveals that increased atmospheric CO , and a wetter, warmer planet are making Africa greener, while in densely populated areas people and removing trees and brushes. Overall, 36% of the continent has become greener and 11% is becoming less green.\n\nWhy Big Corporations Want Trump to Break His Promise on Paris Agreement\n\nAccording to Daily Signal writer Fred Lucas it 's simple: big corporations want to game the system using carbon dioxide as a currency to make money. These companies include ExxonMobil, Royal Dutch Shell and BP . They can absorb and adapt to the costs of complying with burdensome regulation, whereas smaller companies have a harder time complying.\n\nCOP 24 to Be Held in Poland\n\nThe 24th Conference of Parties climate summit will take place in Poland, in November 2018, presided over by the country 's environment minister. (COP 23 will be held in Bonn under the presidency of Fiji.)\n\nScott Adams, who has written in his blog about this doubts about the certainty of climate science predictions, pokes fun at the certainty in a Dilbert comic strip featuring a Michael Mann lookalike.\n\nThe attack on Mr. Trudeau was picked up by the Financial Post and the National Post, which attacked Mr. McKibben with some humour. In the Globe and Mail, Andrew Leach (former chair of Alberta 's Climate Leadership Panel) thinks that Canada should be proud of the actions it 's taking.\n\nCanada 'a Emissions Down, but Not on Track to Meet 2030 Commitment\n\nOn April 13 Environment Canada quietly released a report showing a small decline in greenhouse gas emissions, but projects that Canada won 't meet its 2030 goal with new measures. This report was to be submitted to the UN Framework Convention on Climate Change by April 15. To meet Canada 's climate target in 2030, reductions would have to come from additional measures, such as investments into public transit, green infrastructure, clean technology and innovation, stored carbon, international mechanisms, \u009d according to the report. By international mechanisms \u009d the bureaucrats mean buying emissions credits.\n\nAndrew Weaver was Canada Research Chair in climate modelling and analysis at the University of Victoria in 2009 and 2010 when National Post writers wrote four articles about the state of climate science and the political response to it. (He is currently leader of British Columbia 's Green Party.) Dr. Weaver sued, claiming defamation, and won a 2015 court decision, which ordered the National Post to pay $50,000 damages. Now the British Columbia Court of Appeal has overturned the decision because the trial judge erred in grouping all four articles together, then assigning joint liability to all the authors. The appeals court ordered a retrial.\n\nThe Energy Transitions Commission is made up of energy executives, activist leaders and investment bankers, including former US Vice President Al Gore. ETC has published a report calling for countries to spend $600 billion/year over the next two decades to boost green energy deployment and energy efficiency. Royal Dutch Shell, a funder of ETC, is a major producer of natural gas, which the company bills as a way to fight global warming.\n\nETC calls for an explicit, predictably rising, forward price curve for carbon, resulting from policy, reaching approximately $50/t in the 2020s and rising to $100/t in the 2030s is essential to drive decarbonization beyond power, to reinforce regulatory-driven improvements in energy productivity and to prevent falling fossil fuel prices from undermining the pace of the energy transition. \u009d\n\nNow after claiming to have toppled coal from its perch at America 's biggest source of power, environmentalists are ready to move on down the fossil fuel list and tackle what they perceive as another enemy of the planet: natural gas. In fact, it was the flood of cheap shale gas that did in coal.\n\nGreen groups that once celebrated gas as a bridge fuel, \u009d helping the world transition from dirty coal to zero-emission energy such as wind, solar, and other renewable sources, are now fighting it. For example, Lena Moffitt, a program director at the Sierra Club, says there 's a growing recognition that it 's a fuel we 'll have to leave behind. \u009d Her organization is increasingly focused on stopping gas-fired power plants and pipelines from being built.\n\nFormer Obama Energy Official: A Red Team \u009d Exercise Would Strengthen Climate Science\n\nSteven Koonin, formerly an undersecretary of energy for President Obama, says the public is largely unaware of the intense debates within climate science and is for evidence-based policy, but against climate science 's politicization. He points out that the Summary for Policymakers in the IPCC 's reports consists of consensus statements conceal judgement calls and internal debates. To improve matters, Mr. Koonin advocates convening a Red Team/Blue Team \u009d process. This would identify risks and reduce, or at least understand, uncertainties.\n\nwould have nothing to lose if the consensus \u009d is as strong as they claim. If, instead, they are just consensus enforcers for the sake of policy advocacy, then they would probably feel threatened.\n\nOn March 29 the US House of Representatives ' Committee on Science, Space and Technology held a hearing: Climate Science: Assumptions, Policy Implications and the Scientific Method. The four witnesses were Judith Curry, John Christy, Michael Mann and Roger Pielke Jr. The Global Warming Policy Foundation has published their prepared testimonies. Watts Up With That? has a 2- ½ hour video of the hearing (which begins with statements from the committee and subcommittee 's Republican chairs and ranking members (Democratic) about 15 minutes from the start of the video.) At 33:00 the committee chair introduces the witnesses.\n\nDr. Mann was the odd man out in the witness panel. The National Review and DeSmogBlog have their respective takes on his testimony. In a Watts Up With That? article Tim Ball argues that Dr. Mann dominated the proceedings by having the advantage of not caring about the truth with a performance designed for most of the public who have no idea what is true.\n\nTrump to Decide in Late May Whether to Stay In Paris Climate Pact\n\nThe Trump Administration is expected to announce a final decision by May 26 (the start of the G7 conference) whether to stay in the Paris Agreement. The president has been under pressure from conservatives to abandon the agreement and from others (Secretary of State Tillerson, daughter Ivanka and her husband) to stay in.\n\nThe Washington Post reports EPA chief Scott Pruitt calling for an exit \u009d from the agreement. In an interview he said that America had front-loaded all its costs under the agreement, while India and China had no obligations until 2030.\n\nMeeting in Rome on April 10 the G7 energy ministers failed to agree on a statement on climate change. The reason: the US reserved its position \u009d on the test regarding commitments made by the G7 countries under the Paris agreement. The ministers' agenda had called for discussion of energy security, policies to move away from coal, natural gas routes and supply, sustainable development of electricity sources, alternative fuel scenarios and energy access and investments in Africa. However, due to lack of unanimity, the Italian chair of the G7 meeting decided against proposing a joint statement.\n\nDeveloped countries have been relabelling other foreign aid a contributions to the UN 's Climate Fund. For developing countries that is a cheat they expect $100 billion/year in new money. China has become the new hero of the climate movement by working to widen the north-south rift by piously calling on selfish northern countries to make good on the $100 billion.\n\nThis rift came to light at a meeting in Beijing of climate change ministers from the BASIC group of countries.\n\nOn March 28 President Trump went to the offices of the Environmental Protection Agency to sign an Executive Order Promoting Energy Independence and Economic Growth. \u009d This order directs the EPA to suspend, revise, or rescind four actions related to the Clean Power Plan that would stifle the American energy industry. It also directs all agencies to conduct a review of existing actions that harm domestic energy production and suspend, revise, or rescind actions that are not mandated by law and it disbands the Interagency Working Group on the Social Cost of Greenhouse Gases.\n\nUnder the Obama Administration federal agencies were required to plan for and mitigate the future effects of climate change, treat it as a national security issue, and attempt to reduce their own greenhouse gas emissions by 40%. This executive order revokes four separate executive orders and presidential memoranda President Obama signed over the last four years.\n\nA Forbes commentary on the order notes that, unlike the recent immigration orders, this one bears the stamp of experienced government lawyers and and leaves the administration with a rich variety of tactical choices on how to eliminate Obama-era regulations on fossil fuels. \u009d The author expects environmentalists and states to sue and try and force the administration to stick to the Obama-era goals, but the EPA can say that the federal statutes don 't give it the power to order the electric grid to reduce emissions by 30%, arguing that the cuts have to come from Congress.\n\nOn March 26 Scott Pruitt, Administrator of the US Environmental Protection Agency called the December 2015 Paris climate agreement a bad deal. \u009d During an interview on ABC he said: \"You know, what was wrong with Paris was not just that it was, you know, failed to be treated as a treaty, but China and India, the largest producers of CO internationally, got away scot-free, They didn 't have to take steps until 2030. So we 've penalized ourselves through lost jobs while China and India didn 't take steps to address the issue internationally. So Paris was just a bad deal, in my estimation. \u009d\n\nThe Paris Treaty is Already Failing\n\nOnly three European countriesï¼\u008dFrance, Germany and Swedenï¼\u008dare following through on their commitments made in Paris 15 months ago. Others are trying to gain wiggle room in the talks by pushing for measures such as a later (and higher) baseline for measuring their CO cuts, or greater use of forestry credits to meet the EU 's climate goal. Another loophole includes a handout of 100 million surplus ETS allowances, worth ‚ 2 billion to help countries meet their emission obligations on paper.\n\nEven Germany is continuing to see its emissions rise, while the real global leader is the US, which saw its emissions drop 3% last year, thanks to shale gas.\n\nJournalist John Robson often uses elites \u009d in the pejorative sense as he resents those in authority using leadership as a privilege, rather than a responsibility. The elites have served us badly, from fiscal policy, to social policy and climate policy. Referring to the Friends of Science website, he asserts that the claimed 97% scientific consensus on human-cause global warming is designed to intimidate, not illuminate.\n\nOn his website Mr. Robson promotes his documentary project The Environment; A True Story, that looks at Earth 's environment back thousands and millions of years to expose the hype of bad science and alarmism by laying out what we really know.\n\nDespite a presidential election with candidates espousing opposite views on the subject, another hottest year on record \u009d and the Paris Agreement, the main TV networks (ABC, CBS, NBC and Fox) decreased their total coverage of climate change by 66% compared to 2015. This amounted to 50 minutes in all. The MediaMatters story is largely devoted to what the networks did not report, and what it considers was the disproportionate coverage given to deniers \u009d last year.\n\nMontreal-based Resolute Forest Products is suing Greenpeace and other environmental organizations in federal court in the State of Georgia under American racketeering laws. Greenpeace had accused Resolute of destroying endangered forests \u009d, operating and sourcing wood in violation of law \u009d, and causing the destruction of endangered species. \u009d In response to Resolute 's suit, Greenpeace 's legal filing says that its criticism of Resolute's logging practices in Canada's boreal forests should be viewed through the prism of free speech rather than taken literally. In Resolute 's opinion the court filing is an admission of lying.\n\nBy overstating their logging targets and then undercutting these targets European countries were able to pocket carbon credits worth ‚ 600 million, the equivalent of 114 million cars. In 2013-14, the most recent years available, member states picked up a windfall 120 million tonnes of credits, which are worth ‚ 5/tonne at today 's price. The credits can be used to offset emissions under the UN 's Kyoto Protocol.\n\nReport: Germany 's Energiewende Threatens to Become an Economic Disaster\n\nA report by McKinsey finds that, as the cost of Germany 's energy transition continues to rise, the number of green energy jobs is falling. From 2015 to 2025 the annual Energiewende cost will rise from ‚ 63 billion to ‚ 77 billion. The report states that the seven energy targets set by the Federal Government are achievable, but only by way of direct subsidies. However, CO emissions remain high (the power plant target for 2016 was 812 Mt, but the actual was 916 Mt.) For the fourth year in a row the number of employees in the renewable energy sector declined.\n\nCiting scarce public resources, \u009d finance ministers from the US, China, Germany and other G20 economies said they would encourage multilateral development banks to raise private funds to accomplish goals set under the 2015 Paris Agreement. This is a significant departure from the ministers ' communiqu of last July when they urged governments to quickly implement the Paris Agreement, including a call for wealthy nations to make good on commitments to mobilize $100 billion annually to cut greenhouse gases around the globe.\n\nAt a March 17 meeting, opposition from the US, Saudi Arabia and others forced Germany to drop from the draft G20 communique a reference to financing programs to combat climate change.\n\nRoyal Dutch Shell Plc, Statoil ASA and Eni SpA are moving into multi-billion-dollar offshore wind farms in the North Sea and beyond. They 're starting to score victories against leading power suppliers including Dong Energy A/S and Vattenfall AB in competitive auctions for power purchase contracts, which have developed a specialty in anchoring massive turbines on the seabed.\n\nThe oil companies have many reasons to move into the industry. They 've spent decades building oil projects offshore, and that business is winding down in some areas where older fields have drained. Returns from wind farms are predictable and underpinned by government-regulated electricity prices. And fossil fuel executives want to get a piece of the clean-energy business as forecasts emerge that renewables will eat into their market.\n\nDr. Helen Schwiesow Parker, a licensed clinical psychologist, describes how the wind industry denies and dismisses the serious health impacts of low frequency and infra-sound from industrial wind turbines. She points out that, rather than saving the world, \u009d reliance on wind actually increases emissions and overall fossil fuel use.\n\nThe Climate Institute is a largely government-funded NGO established in 2005 with an intended five-year life. In fact the TCI will have survived 12 years when it ceases to operate on June 30, 2017. The reason: a lapse in funding from a foundation and the Australian government.\n\nFlorida: The Sun State with Hardly Any Household Solar\n\nThe Guardian has published a revealing piece about why Florida has low household solar penetration compared to some Northern states. The reason is that Florida doesn 't have generous taxpayer-funded power buyback schemes, such as in New York State. Without subsidies solar panels can 't compete with reliable 24x7 fossil fuel or nuclear generated power. Worse, the subsidies for solar panels tend to disproportionately hit poor people. The recipients of these market distorting subsidies are the rich and middle class. Whether they pay through state taxes, or the cost is passed on via electricity bills, poor people who don 't own a home with a nice big South facing roof get slammed they end up helping to pay everyone else 's electricity bill in addition to their own.\n\nIn a poll of 1,000 Canadians conducted for The Globe and Mail in late February, Nanos Research found 48% \u009dsupport\" and 17% \"somewhat support\" the government of Canada's plan to institute new climate regulations even if it is out of step with President Trump's approach. One-third of respondents said they are opposed (22%) or somewhat opposed (11%).\n\nSome Canadian business leaders and conservative politicians have urged the governments to slow or stop the implementation of the federal-provincial climate plan reached in December, arguing additional costs from environmental regulations will erode Canada's ability to compete with US companies that benefit from the Republican administration's approach. However, Environment and Climate Change Minister Catherine McKenna met this week with the European climate commissioner Miguel Arias Canete, and the two ministers said they remain committed to meeting the targets of the Paris climate agreement, even as Mr. Trump lays plans to reverse greenhouse-gas-reduction regulations passed by his predecessor Barack Obama.\n\nClimate Skeptics Ask Trump to Withdraw from UN Climate Agency\n\nA group of 300 scientists and others skeptical of global warming are asking President Trump to withdraw the UN 's Framework Convention on Climate Change. Since 2009, the US and other governments have undertaken actions with respect to global climate that are not scientifically justified and that already have, and will continue to cause serious social and economic harm with no environmental benefits, \u009d the group 's letter reads\n\nGerman chancellor Angela Merkel is preparing to spring an ambush on President Trump at this year 's G-20 summit next July. In 2005 at the G8 summit President Bush was cornered by the host Tony Blair and was put on the hook to enact economically-damaging policies, paving the way for Barack Obama 's climate strategy. This year Ms. Merkel is facing a tougher-than-expected reelection and needs a climate win against Mr. Trump. However, he could shine a light on Germany 's disastrous energy policies instead.\n\nGermany 's Silent Catastrophe \u009d: 300,000 Households See Power Cut Off in One Year\n\nGermany 's skyrocketing electricity prices primarily due to the legally mandatory feeding-in of wind and solar power have regular household customers paying ‚ 0.30/kWh, almost three times the rate in the US. As a result many households are no longer able to afford electricity and are seeing themselves catapulted back to the 19th century. Over the past year, 300,000 of them have had their power cut off. Not only have the poor been broadsided by the high electricity prices, but so have energy intensive industries.\n\nGerman High Court: Federal Agency Has the Right to Denounce Critical Science Journalists\n\nA German High Court has decided that the Federal Environmental Agency has the right to publicly denounce science journalists who report critically about climate issues. In 2013, the German Federal Environmental Agency (UBA) published a brochure entitled And Yet It Is Warming \u009d stating that there were unfortunately scientists and journalists who spread untruths about climate change. Among those named was journalist Michael Miersch who was at the time science editor of the German weekly magazine Focus. Specifically, his articles were accused of not agreeing with the state of knowledge of climate science. \u009d\n\nMr. Miersch sued the UBA in an administrative court, which ruled that climate change sceptics are impure and paid by the oil industry, so he appealed to the Magdeburg High Court. On February 2 the latter rejected the appeal, asserting that the UBA had the right to impute that he had reported contrary to the state of scientific knowledge and the government has the right to counteract post-factual discourse \u009d (i.e., Mr. Miersch 's articles). Also, the Federal Environmental Agency is allowed to classify him as a climate change skeptic, which in Germany means anyone who questions whether climate change is taking place, and therefore a crank.\n\nA Trifecta of Green Lunacy: The Law of Unintended Consequences Kicks In\n\nLunacy No. 1 is the UK spending £450 million in subsidies in 2015 for chopping US trees, turning them into wood pellets, transporting them across the Atlantic and burning them to produce power to meet EU renewable energy targets. This produces more greenhouse gases than simply burning cheaper coal.\n\nNo. 2 is that household storage for solar power doesn 't reduces costs or CO emissions. As charging and discharging a home battery itself consumes energy, feeding surplus solar power into the storage device instead of into the grid results in higher overall electricity consumption for the household, as well as higher emissions because the increased consumption needs to be covered by fossil fuel-based energy. This increase is quite substantial up to 591 kWh annually.\n\nNo. 3 is the felling of protected forests in Europe, again to meet EU renewable energy targets. Up to 65% of Europe 's renewable output currently comes from bioenergy, involving fuels such as wood pellets and chips, rather than wind and solar power.\n\nAn overhaul of the EU 's flagship trading scheme for cutting CO emissions by European industries has been approved by the member states. The agreement to reform the emissions trading system comes after almost two years of discussions but just two weeks after the European parliament voted in favour of a new directive. Under the proposed directive now due for deliberation by the European parliament the number of allowances can be gradually reduced, to push up their cost and provide an incentive for industries to adopt cleaner technologies. The cap on emissions will fall by 2.2% a year the so-called linear reduction factor until at least 2024.\n\nThe highest performing 10% of factories and other installations will receive all their allowances for free, and a fund of up to ‚ 12 billion will be established to help industry innovate and invest in technology. Environmental campaigners claim that the reformed ETS does still not do enough. A proposal to remove the rights of big emitters, such as the cement industry, from receiving free carbon credits, was not passed by the European parliament in February, frustrating many.\n\nThe Economist hopes that it is no longer far-fetched to imagine the world entering into an era of clean, unlimited and cheap [renewable] power. \u009d However, there are problems: it 's going to take $20 trillion in new investment in green \u009d energy, and the more it is deployed, the more it lowers the price of power from any source. The $800 billion of public subsidy since 2008 has distorted the market just as electricity use in the rich world was stagnating. The resulting glut in power-generating capacity has slashed the revenues that utilities earn from wholesale power markets and thus deterred investment.\n\nGreen power is both intermittent and has almost zero marginal cost when it is available. As a result the conventional plants required to keep power flowing 24/7 are idle for long periods and find it hard to attract private investors. The higher the penetration of renewables, the worse the problems get, as bitter experience in Europe has shown. The Economist 's proposed solution to this dilemma: smart meters and batteries, together with government restructuring of the power market to adjust prices frequently according to demand. (It 's been tried in Ontario.)\n\nA Climate Story that Must Be Told\n\nTim Ball relates the experiences of two women, Judith Curry and Sallie Baliunas, who decided to abandon their academic work in climate science because of the animosity and nastiness directed against them for not going along with the consensus. Dr. Ball relates some of his own experiences and quotes Sayre 's law: Academic politics is the most vicious and bitter form of politics, because the stakes are so low. \u009d\n\nThriving polar bear populations have exposed the hubris behind global warming 's most beloved icon. In 2005 international polar bear specialists decided that future sea ice loss due to human-caused global warming had replaced wanton over-hunting as the primary threat to polar bear survival. In 2007 American government biologists insisted that by 2050, when summer sea ice would cover 42% less of the Arctic than it did in 1979, polar bears in ten populations most at risk would be wiped out. Polar bears became a global warming icon, the preferred symbol of the consequences of burning fossil fuels.\n\nThis frenzy of dire news went on unchecked until 2007, when the first reports on polar bear studies undertaken since 2004 were made public. Not until about 2013, however, as more studies were completed, did it become clear that polar bears really were thriving.\n\nA rough tally of the ballooning financial plight of the electricity sectors in British Columbia, Manitoba, Ontario and Newfoundland quickly runs to more than $50 billion in new debt and imbedded costs for investments that threaten to be money-losing drags on growth and consumers and the federal government for years to come.\n\nAn $8.8-billion dam known as the Site C Clean Energy Project in northeastern BC has been described as a white elephant \u009d by a former hydro executive. Approval of Site C came in the context of the BC Green Energy Act, which mandates that 93% of the province 's electricity must come from clean and renewable resources. \u009d There is, alas, no requirement for economic viability.\n\nManitoba Hydro is also building clean and renewable projects worth billions. A report last year from The Boston Consulting Group (BCG) warned that Manitoba Hydro 's debt could double to $23 billion by 2023, propelling the provincial debt/GDP ratio to 65%.\n\nUnder Ontario 's Green Energy Act, the Liberal government of Kathleen Wynne has saddled the province with escalating wind and solar electricity costs that will drain billions from industry and consumers. Power costs have already doubled to nearly 12 ¢/kWh to pay for the green energy needed to replace coal plants.\n\nThe cost of Muskrat Falls, a giant Labrador hydro project designed to ship clean \u009d and cheap \u009d hydro power overland and underwater to Newfoundland, is now said to be approaching $12 billion. Former premier Roger Grimes (whose predecessor, Danny Williams, pushed Muskrat) said recently the project will haunt all of us, unfortunately, for the rest of my life, my daughter 's life, my granddaughter 's life even. \u009d\n\nJack Mintz, a fellow at the University of Calgary 's School of Public Policy, notes that, despite what certain Canadian politicians say, governments in Europe, the US and even Ontario, are starting to back away from anti-carbon policies. He predicts that Canada 's commitment \u009d to reduce greenhouse gas emissions by 30% below 2015 levels by 2030 is certain to fail. The reason that governments are backing away from carbon policies: voters don 't like them. This becomes apparent the moment the public understands that increasing carbon prices comes at a cost.\n\nChildren 's Climate Suit to Donald Trump: See you in court\n\nDonald Trump can add one more lawsuit to his growing list as president: Juliana v. United States, a federal lawsuit brought against the US government by a group of kids and young adults concerned about climate change. The lawsuit, which began in August of 2015, argues that the federal government, in its actions, has endangered future generations ' rights to what is known as the public trust. The public trust is an old legal doctrine that holds that it is the government 's responsibility to preserve certain natural resources for public use.\n\nOn February 9 the plaintiffs filed notice with the court that they were replacing former President Obama with President Trump. However the timeline for the trial remains murky, with the administration 's lawyers pushing for a 2019 trial date. A federal judge has scheduled a status conference for March 8, 2017.\n\nMr. Pruitt 's nomination as administrator of the US Environmental Protection Agency was confirmed 52-46 by the Senate on February 17. He gave an interview with the New York Times on February 16 in which he said he plans to refocus the agency on its statutorily defined mission: working cooperatively with the states to improve water and air quality. Mr. Pruitt says he expects to quickly withdraw both the Clean Power Plan (President Obama 's premier climate regulation) and the 2015 Waters of the United States rule (which asserts EPA power over every creek, pond or prairie pothole with a significant nexus \u009d to a navigable waterway \u009d).\n\nWill the EPA regulate carbon dioxide? Mr. Pruitt says he won 't prejudge the question. There will be a rule-making process to withdraw those rules, and that will kick off a process, \u009d he says. And part of that process is a very careful review of a fundamental question: Does EPA even possess the tools, under the Clean Air Act, to address this? It 's a fair question to ask if we do, or whether there in fact needs to be a congressional response to the climate issue. \u009d\n\nWilliam Happer is forerunner for the job of science advisor to President Trump, and says if offered the job he will take it. Dr. Happer is highly regarded in the academic community, but many would view his appointment as a further blow to the prospects of concerted international action on climate change. In an interview to The Guardian he said, There 's a whole area of climate so-called science that is really more like a cult It 's like Hare Krishna or something like that. They 're glassy-eyed and they chant. It will potentially harm the image of all science. \u009d\n\nDr. Happer also supports a controversial crackdown on the freedom of federal agency scientists to speak out about their findings, arguing that mixed messages on issues such as whether butter or margarine is healthier, have led to people disregarding all public health information.\n\nCold Winter: How Lignite, Coal and Gas Saved Germany from Disaster\n\nOn January 17, nuclear and gas-fired power plants, as well as those using black and brown coal were in constant use nationwide. Conventional energy sources peaked at 67,000 MW that day and supplied 90% of Germany 's energy, according to think tank Agora Energiewende. Renewables did not even reach 15,000 MW. Wind turbines operated at 12% of their capacities, solar plants at 14% even at midday.\n\nGermany 's transition to renewable energy seemed to pause on January 17. In the central and southern regions heavy clouds covered the sky, paired with fog on the ground. The sun barely reached the solar roofs. There was also very little wind that day.\n\nAfter the Kyoto Protocol in 1997, Europe 's auto industry was encouraged to switch more than 50% of passenger cars to diesel. For this Europe got significantly dirtier air. Paris, on some days, suffers worse smog than Beijing. Though his methodology may be questionable, a UK government scientist estimates that thousands of citizens die each year because of increased nitrogen oxide and soot emissions. Now diesel technology appears to be a commercial and regulatory dead-end. When honestly tested, one study shows the latest Euro 6 Standard \u009d vehicles miss their pollution targets by a whopping 400%.\n\nOn February 6 the Australian Energy Market Operator said it was confident that adjustments made to wind farm software meant there was no risk of last October 's South Australia blackout [FoS Extracts 2016-10-11] being repeated in the future. Two days later, as temperatures soared above 40 °C, winds died, the windmills put out just 2% of their rated power, and 40,000 properties went without electricity. The reason: South Australia needed more imported power than the interconnectors could handle, so AEMO ordered load shedding.\n\nThe Herald Sun article lists five issues regarding South Australia 's power supply, of which Nos. 4 and 5 are the most significant as these apply to other jurisdictions, like Canada. The Global Warming Policy Foundation, quotes an article from The Australian about the politicians ' blame game, and Joanne Nova has two articles on the SA event.\n\nThe flaw is how the politicalization of climate science created and driven by the UN IPCC process has robbed scientists of the opportunity to explore the legitimate, extremely important and yet unaddressed issues of how natural climate change drivers impact the earth 's climate. A 28-minute interview with Dr. Curry begins by referring to the Mail on Sunday story about the US National Oceanic and Atmospheric Administration 's rushed paper that exaggerated global warming and eliminated the recent hiatus [FoS Extracts - 2017-02-07]. She is concerned about a governmental organization playing politics with climate data. Then the interview goes into the uncertainties and unknown unknowns \u009d in climate science, which the IPCC deals with by using expert judgement \u009d.\n\nJudith Curry prepared this 20-page paper explaining the inherent flaws of computer models for predicting future climate change. In five chapters she describes what a global climate model (GCM) is, GCMs ' reliability, their failings, whether they are a reliable tool for predicting climate change in the 21st century, and a summary. Dr. Curry concludes that GCMs have not been subject to normal rigorous validation and verification, and they are not fit for identifying the cause (human vs. natural) of 20th century warming nor for predicting climate in the 21st century.\n\nIn clean, green Ontario the new year brings in hikes in the cost of gasoline, natural gas and electricityï¼\u008dall to help the government save the planet through its cap-and-trade scheme. The money collected will be redistributed to emitters in California and subsidy seekers at home. The timing is terrible for small and medium businesses whose owners can 't figure out how to make a living any more. Margaret Wente 's article describes companies facing electricity bills of $30,000 - $40,000/month because of the Ontario government 's investments in green energy that the province doesn 't need and can 't use.\n\nWith cap-and-trade large companies will be required to buy pollution allowances, but smaller ones just get whacked with extra costs. These are estimated to start at $136,000/year, increasing to $720,000/year by 2020. As a result Ontario firms are being courted to move to US jurisdictions where electricity costs are about one-half those they pay now.\n\nJust back from his greenhouse gas-spewing winter holiday with the Aga Khan, Justin Trudeau attended one of his meet the people \u009d damage-control sessions in Peterborough, Ontario to hear a grandmother tell him that skyrocketing electricity and fuel bills have driven her into energy poverty. Mr. Trudeau hugged her, then reminded her of the importance of fighting climate change, and that while she needs to be protected from the costs of carbon pricing, electricity costs are a provincial responsibility, not his.\n\nThree days before leaving office President Obama transferred $500 million to the UN 's Green Climate Fund, to match the first $500 million given last March. In 2014 Mr. Obama pledged $3 billion to the fund.\n\nThe Immediate Threat to California 's Climate Change Fight isn 't Trump\n\nWith President Trump in office, California officials are bracing for the possibility that the new administration will undermine the state 's policies on climate change. However, a more immediate threat is a four year-old legal challenge against the state 's cap-and-trade program. For Gov. Jerry Brown and the environmental community, the lawsuit has been a ticking time bomb that could eliminate a key source of revenue and undermine a program touted as an international model for fighting global warming. Currently Quebec has joined the program and Ontario plans to do so within a year.\n\nOpponents of the program claim that it is a tax, allowing the state to collect revenue without the the required two-thirds majority in both houses of the legislature. The state argues that the program falls within the government 's authority to regulate industry. On January 24 an appeals court heard arguments, and a decision will be released in about four months.\n\nDuring his confirmation hearing, Mr. Trump 's pick to head the Environmental Protection Agency cast doubt on whether California should continue to have the power to impose its own emission rules on cars and trucks, a cornerstone of the state 's efforts to fight global warming.\n\nThe Trump Shift at the Environmental Protection Agency\n\nOn January 24 President Trump prohibited EPA staff from creating press releases, blogs, messages, or any social media postings concerning their taxpayer funded work. He also ordered the agency to freeze all grants and contracts and to cut the climate page from its website. \"If the website goes dark, years of work we have done on climate change will disappear,\" one of the EPA staffers told Reuters, adding that some employees were scrambling to save some of the information housed on the website, or convince the Trump administration to preserve parts of it.\n\nAt the World Economic Forum in Davos, 15 of the sessions were devoted to climate change and nine more to clean energy, the most ever on these issues. For the business leaders attending in Davos climate change is about more than just burnishing their green credentials; it 's about the trillions in potential profits and losses. The International Energy Agency estimates that meeting the goals of the Paris Agreement will require $13.5 trillion in spending by 2030.\n\nDespite Donald Trump 's pledge to withdraw from the Paris Agreement, more than 600 US companies have urged him to stay in. At Davos China was hailed as the new climate change leader despite its continuing expansion of coal-fired power.\n\nOn January 23 a Chinese company began work on a $715 million expansion of a Serbian coal mine and a new power plant, part of a wave of investment in new coal-fired plants in the Balkans that is at odds with EU policy on reducing coal use. Western Balkan countries, including Bosnia, Kosovo, Montenegro and Serbia, plan to invest billions of euros in building a total of 2,600 MW in new coal-fired plants to meet rising demand for electricity as old plants are being phased out.\n\nLignite - the most polluting type of coal - is widely available in the Balkans, making it appealing to governments seeking ways to ensure security of supply and keeping energy prices low while also placating influential mining lobbies. But as the EU, World Bank and other organizations cut back on coal financing, Western Balkan countries are encountering difficulties in securing finance for their projects, and are increasingly turning to Chinese institutions and contractors.\n\nThe Global Warming Policy Foundation has published a briefing note by Fritz Varenholt, one of the founders of the environmental movement in Germany and author of the book The Neglected Sun that has sparked public discussion in Germany about dogmatism in climate science. Under current decarbonization plans the German government aims to increase the share of renewables to 80-95% of the country 's total energy supply.\n\nUntil now the Energiewende policy has avoided disaster, due to lack of political opposition, oversupply, an over-engineered grid and help from Germany 's nine neighbours. But there are five looming problems: the intermittency of wind, grid stability, market distortion, electricity storage and sector coupling \u009d, and the Energiewende 's disaster to biodiversity Dr. Varenholt notes the growing citizens ' initiatives agains further wind development in Germany and suggests two policy scenarios for the years up to 2020: muddling through or policy correction.\n\nProf. Happer, best known to the public as a vocal critic of the IPCC consensus \u009d on global warming, gave a very literate interview (in text form with links and illustrations) for TheBestSchools ' Focused Civil Dialog on Global Warming. He begins the interview with his personal history, including how he became outraged by distortions about CO and climate, which led him to speak up about the issue. Prof. Happer then responds to the IPCC 's four official positions (the world is warming; humans are causing it; it is a major problem; concerted global government action is required to combat it.)\n\nNext he discusses climate models, conflicting records of global temperatures since 1880, attempts by NOAA to eliminate the recent pause \u009d in global temperatures, implications of global warming for human welfare, the hockey stick and global warming, the focus on the rapid increase in atmospheric CO in the last century, whether there is currently an inexorable warming trend, benefits of CO to humans, the consensus \u009d that is said to exist among the world 'd scientists on the global warming issue, and societal issues relevant to the public discussion on global warming, whether scientists should intervene in politics, and the five strongest arguments against the consensus view.\n\nThe Offset Question: Will Canada Buy Its Way to the Climate Finish Line?\n\nDeSmog is worried that the December 9 accord between the Canadian federal government, eight provinces and three territories (absent Saskatchewan and Manitoba) [FoS Extracts - 2016-12-14] assumes that Canada will partially rely on emissions trading to meets its 2030 target of 524 Mt of CO (30% below the 2005 level). The bureaucrats ' term for emissions trading is internationally transferred mitigation outcomes. \u009d DeSmog notes that emissions trading has developed a shoddy reputation over the years, which may account for the government 's decision to downplay the possibility of deploying. it. DeSmog goes on to describe how emissions trading works, whether it helps climate change (it doesn 't) and how it 's been used before.\n\nTime to Expose the Lie that Expensive Green Energy Won 't Hurt Canada 's Prosperity\n\nA hackneyed catchphrase in debates over climate policy is that our society does not have to choose between clean energy and economic growth. However, the exploitation of energy is fundamental to economic growth. As energy costs fell our standard of living soared. Jurisdictions in Canada (e.g., Ontario) have raised electricity prices to promote renewable energy, suffered economically, and soon everyone will feel the effects of a carbon tax. It is unlikely that a country with a geography like Canada could ever transition to a post-carbon economy.\n\nAt least the average person and populist leaders like Donald Trump know there 's a trade-off between the economy and the cost of energy, even if the liberal elites claim otherwise.\n\nThe Day Ontario 's Wind-Power Tyranny Ends There Will Be Dancing in the Streets\n\nReacting to the Ontario government 's September 27 announcement suspending the acquisition of 1,000 MW of renewable electricity, the editor of the magazine North American Windpower penned an article titled Eulogizing Ontario 's Wind Industry. The article opens with the statement: Ladies and gentlemen, we are gathered here today to pay our respects to Ontario 's utility-scale wind industry, which has passed away from unnatural causes (a lack of government support). \u009d\n\nBut, as Parker Gallant 's story in the Financial Post points out, the eulogy is premature. If the wind industry had truly passed away thousands of Ontario ratepayers would be celebrating. Instead, the wind industry will continue to enjoy government support \u009d for at least the next 20 years.\n\nThree Post-truths about Global Energy and Climate Change\n\nFormer Encana CEO Gwyn Morgan contrasts three so-called post-truths \u009d with real-world facts. The post-truths are (1) We have the technology to replace fossil fuels with wind and solar energy; (2) Canada's oil and gas industry increases global carbon emissions; (3) Canada's carbon tax will be part of a global emissions reduction effort.\n\nHow Obama 's Climate Rules Might Fade Away\n\nA year after President Obama took office a team of economists, scientists and lawyers from the federal government came up with their estimate of $21/t for the social cost of CO emissions (SCC), to be used to justify climate-related rules imposed by the White House. The SCC has since been raised to $40/t. As there is established case law requiring the government to account for SCC, an attempt by the Trump administration to repeal it would engender lawsuits from environmentalists.\n\nRather than repealing and fighting in court, the new administration could undercut the SCC by tweaking some of the assumptions and calculations baked into its model, even skewing it to the point that CO emissions come out as a net benefit instead of a cost. One of the simplest ways is to increase the discount rate. For example, using a 2.5% rate gives a 2020 SCC of $65/t; with a 5% rate it 's only $12/t; at 7% (a rate that has been used by the Environmental Protection Agency for other analyses) the SCC turns negative.\n\nAnother way is to limit estimates of the costs and benefits of CO emissions only to the US, rather than globally. This would reduce the SCC by 70%. One of the members of the Trump EPA transition team revealed that the models used to calculate the SCC look out to the year 2300.\n\nThe Impending Collapse of the Global Warming Scare\n\nThis essay in the Manhattan Contrarian notes Donald Trump 's appointments for secretaries and state and energy and the head of the EPA. All three agencies were at the heart of Barack Obama 's domestic and foreign climate policies, and the author predicts a high likelihood of substantial collapse of the global warming movement, both domestically and internationally, over the next two years. First, the global warming alarmists and their settled science \u009d allies at the EPA will have to put up or shut up. Internationally, as soon as the US stops parroting the global warming line, other countries will start backing away from it as well. Lastly, there is funding, with $14 billion of the Department of Energy 's budget going to the global warming cause and the tens of billions of energy subsidies and research, none of which has produced cheaper energy that works.\n\nThe environmental movement has climbed itself way out onto the global warming limb. Now the Trump administration is about to start sawing off the limb behind them.\n\nSkeptical Climate Scientists Coming in from the Cold\n\nResearchers who see global warming as something less than a planet-ending calamity believe the incoming Trump administrationï¼\u008das evidenced by key cabinet and agency appointmentsï¼\u008dmay allow their views to be developed and heard. This didn 't happen under the Obama administration, which denied that a debate even existed. New organizations like the CO2 Coalition, founded in 2015, suggest the debate is more evenly matched intellectually than is commonly portrayed.\n\nJudith Curry and William Happer have pointed to evidence that global warming is less pronounced than predicted. When asked if he would voice dissent on climate change if he were a younger, less established physicist, Dr. Happer said Oh, no, definitely not. I held my tongue for a long time because friends told me I would not be elected to the National Academy of Sciences if I didn 't toe the alarmists ' company line. \u009d\n\nAfter a year of negotiations EU member states are unable to agree on a carbon market reform seen as necessary to meet the ambitions of the Paris Agreement. Permits under the EU 's Emissions Trading System have been grossly over allocated since the scheme 's implementation in 2005, driving down the price to ‚ 8/t. While the EU 's climate commissioner wants to push up the price, he 's getting resistance from Poland, which insists that the Paris Agreement allows each country to go its own way on dealing with climate change. Germany, France, the Netherlands and Sweden want a 2.4%/year reduction in the number of permits issued, with 57% being auctioned (the rest would be given to industrial sectors that qualify for free permits.) Other states, particularly in Eastern Europe, want a slower reduction rate and a lower number of allowances to be auctioned.\n\nEffective January 1, after publishing 186 journal articles and two books, Dr. Curry resigned her tenured position and requested emeritus status. She has no intention of seeking another academic or administrative position in a university or government agency. In her blog Dr. Curry discusses her growing disenchantment with universities, the academic field of climate science and scientists. In future she will be starting a new blog on the website of a company she formed, Climate Forecast Applications Network (CFAN). In addition to Dr. Curry and co-founder Peter Webster, the company employs seven PhD scientists, plus software engineers.\n\nAccording the the company website, CFAN adds considerable value to the weather and climate model outputs by increasing their information content through statistical adjustments, interpretation of the forecasts, and characterizing uncertainty of the forecasts. \u009d\n\nMark Carney: Firms Must Come Clean on Exposure to Climate-Change Risks\n\nThe Bank of England governor warns that the fight against climate change \u009d will be jeopardized unless companies with big CO footprints come clean about their exposure to global warming risks. He wants a new set of guidelines implemented so that investors can allocate capital to those companies with the best ideas to hit the target of keeping the rise in global temperature to less than 2 °C.\n\nWhile government agencies like to claim that wind is free, Donna Laframboise counters with: If wind is free, so are coal and oilï¼\u008dthey 're just sitting in the ground waiting for us to find them. Any energy source that requires industrial-scale development before it can be used by ordinary people is not free. \u009d She cites three serious wind turbine malfunctions that occurred in the dying days of 2016 and suggests how to search YouTube for examples of other wind turbine failures.", "opengraph": {"type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["fos-extracts-2017-table-of-contents.html", "http://business.financialpost.com/commodities/energy/canada-still-on-pace-to-fall-short-of-paris-target-despite-ambitious-climate-policies-un-filings", "https://www.canada.ca/en/environment-climate-change/services/climate-change/greenhouse-gas-emissions/seventh-national-communication-third-biennial-report.html", "https://www.theguardian.com/environment/2017/dec/08/starving-polar-bear-arctic-climate-change-video", "https://twitter.com/cathmckenna/status/939601028567191553", "https://www.thegwpf.com/after-millions-were-fooled-what-nearly-everybody-got-wrong-about-that-starving-polar-bear/", "https://wattsupwiththat.com/2017/12/11/starving-polar-bears-are-the-fake-news-face-of-climate-change/", "https://www.thegwpf.com/polar-bear-tragedy-porn-video-backfires/", "https://www.economist.com/news/leaders/21731397-stopping-flow-carbon-dioxide-atmosphere-not-enough-it-has-be-sucked-out", "https://www.economist.com/news/briefing/21731386-cutting-emissions-will-not-be-enough-keep-global-warming-check-greenhouse-gases-must-be", "http://www.euronews.com/2017/12/12/losing-the-battle-emmanuel-macron-delivers-bleak-assessment-of-fight-against", "http://www.abc.net.au/news/2017-12-13/we-are-losing-the-battle-french-president-tells-climate-summit/9254862", "https://www.thegwpf.com/new-paper-questions-paris-agreements-dubious-temperature-limits/", "https://www.frontiersin.org/articles/10.3389/feart.2017.00104/full", "http://e360.yale.edu/features/carbon-loophole-why-is-wood-burning-counted-as-green-energy?utm_source=CCNet+Newsletter&utm_campaign=3e1bb88511-EMAIL_CAMPAIGN_2017_12_20&utm_medium=email&utm_term=0_fe4b2f45ef-3e1bb88511-36424765", "https://www.thegwpf.com/forget-paris-banks-are-pouring-630-billion-into-1600-new-coal-power-plants/", "https://www.banktrack.org/coaldevelopers/", "https://www.thegwpf.com/bps-new-solar-venture/", "https://www.lightsource-re.com/uk/", "https://www.thegwpf.com/joe-oliver-ranting-about-climate-isnt-good-policy-and-isnt-convincing-anyone/", "https://www.thegwpf.com/green-madness-ireland-faces-e600-million-fine-for-missing-eu-climate-targets/", "https://www.thegwpf.com/global-warming-benefits-2017-sets-new-record-for-global-food-production/", "http://www.fao.org/worldfoodsituation/csdb/en/", "http://www.businessinsider.com/tesla-removed-from-list-of-electric-cars-eligible-for-subsidies-in-germany-2017-12?IR=T&utm_source=CCNet+Newsletter&utm_campaign=816e41aa86-EMAIL_CAMPAIGN_2017_12_04&utm_medium=email&utm_term=0_fe4b2f45ef-816e41aa86-36424765", "http://notrickszone.com/2017/11/29/german-public-media-finally-acknowledge-german-power-grid-now-more-unstable-than-ever/#sthash.F6F3kS71.Muh5IXTV.dpbs", "https://www.thegwpf.com/carbon-taxes-increase-global-co2-emissions-period/", "https://www.thegwpf.org/gwpftv/?tubepress_item=cPF-0rrTefs&utm_source=CCNet+Newsletter&utm_campaign=816e41aa86-EMAIL_CAMPAIGN_2017_12_04&utm_medium=email&utm_term=0_fe4b2f45ef-816e41aa86-36424765", "https://www.thegwpf.com/14-climate-bullies-attack-susan-crockford-for-telling-the-truth-about-polar-bears/", "https://www.thegwpf.org/gwpf-briefing-twenty-good-reasons-to-celebrate-polar-bear-resilience/", "https://polarbearscience.com/2017/11/29/polar-bears-refused-to-die-as-predicted-and-this-is-how-the-propheseers-respond/", "https://polarbearscience.com/2017/11/27/published-essay-the-conservation-fiasco-that-is-the-esa-listing-of-polar-bears/", "https://polarbearscience.com/2017/12/05/retraction-request-to-bioscience-foia-emails-document-another-harsh-criticism-of-amstrups-2007-polar-bear-model/#more-113761", "https://wattsupwiththat.com/2017/12/07/an-interview-with-dr-susan-crockford-on-the-harvey-et-al-attack-paper/", "https://www.spencerfernando.com/2017/11/08/climate-blunder-catherine-mckenna-tweet-praises-brutal-syrian-regime-joining-paris-accord/", "http://www.cbc.ca/news/politics/catherine-mckenna-syria-paris-1.4392374", "http://www.news.com.au/finance/business/breaking-news/poland-turns-to-fossil-fuel-soulmate-trump/news-story/164cdcbf388aed8b2541edacaf6d2b31?utm_source=CCNet+Newsletter&utm_campaign=8c6fc7f55b-EMAIL_CAMPAIGN_2017_11_27&utm_medium=email&utm_term=0_fe4b2f45ef-8c6fc7f55b-36424765", "http://www.climatechangenews.com/2017/10/11/germany-miss-climate-targets-disastrously-leaked-government-paper/", "http://www.euractiv.com/section/energy/news/spain-resists-coal-phase-out/?utm_source=CCNet+Newsletter&utm_campaign=8c6fc7f55b-EMAIL_CAMPAIGN_2017_11_27&utm_medium=email&utm_term=0_fe4b2f45ef-8c6fc7f55b-36424765", "https://www.news24.com/World/News/germany-in-crisis-as-coalition-talks-collapse-20171120", "https://www.thegwpf.com/mugged-by-reality-germanys-climate-consensus-is-collapsing/?utm_source=CCNet+Newsletter&utm_campaign=d7cee2791c-EMAIL_CAMPAIGN_2017_11_20&utm_medium=email&utm_term=0_fe4b2f45ef-d7cee2791c-20168513", "https://global.handelsblatt.com/opinion/the-beginning-of-the-end-of-angela-merkel-as-chancellor-854532?utm_source=CCNet%20Newsletter&utm_campaign=d7cee2791c-EMAIL_CAMPAIGN_2017_11_20&utm_medium=email&utm_term=0_fe4b2f45ef-d7cee2791c-20168513", "https://www.thegwpf.com/germanys-green-energy-meltdown/?utm_source=CCNet+Newsletter&utm_campaign=d7cee2791c-EMAIL_CAMPAIGN_2017_11_20&utm_medium=email&utm_term=0_fe4b2f45ef-d7cee2791c-20168513", "https://www.thegwpf.com/germany-has-plunged-into-unprecedented-political-chaos/", "https://wattsupwiththat.com/2017/11/26/the-big-slide-in-renewable-energy-tells-the-real-story/", "https://www.thegwpf.com/the-capital-cost-of-offshore-wind-a-further-comment/", "http://www.ncregister.com/blog/joan-desmond/california-gov.-to-vatican-brain-washing-needed-to-tackle-climate-change", "http://www.cfact.org/2017/11/13/california-gov-accepts-the-obvious-the-economy-would-collapse-if-oil-stops-pumping/", "https://wattsupwiththat.com/2017/11/10/freeman-dyson-on-heretical-thoughts-about-global-warmimg/", "https://www.edge.org/documents/archive/edge219.html#dysonf", "http://business.financialpost.com/opinion/lawrence-solomon-why-the-e-in-e-car-actually-stands-for-evil", "https://www.thegwpf.com/epa-chief-scott-pruitt-to-scrap-obamas-clean-power-plan/", "https://www.thegwpf.com/pruitts-clean-power-break-will-end-obamas-climate-rules/", "http://thehill.com/policy/energy-environment/354264-draft-proposal-would-repeal-obama-climate-rule", "https://www.eenews.net/stories/1060063101", "https://wattsupwiththat.com/2017/10/16/epa-harnessed-pruitt-issues-directive-to-end-epa-sue-settle-practice/", "http://www.washingtontimes.com/news/2017/oct/16/epa-end-obama-era-sue-and-settle-practice/", "https://rclutz.wordpress.com/2017/10/11/blatant-hypocrisy-re-social-cost-of-carbon/", "https://pv-magazine-usa.com/2017/10/12/california-gets-quacking-on-ending-duck-curve-problem/", "https://en.wikipedia.org/wiki/Duck_curve", "https://www.thegwpf.org/tony-abbott-daring-to-doubt/", "https://www.thegwpf.com/tony-abbott-draws-a-line-in-the-energy-sand/", "https://www.thegwpf.com/tony-abbott-green-hysteria-and-ridleys-paradox/", "https://www.thegwpf.com/new-study-tony-abbotts-climate-views-are-shared-by-business-leaders-down-under/", "https://www.thegwpf.com/tony-abbotts-big-victory-as-australian-govt-dumps-green-energy-target/", "http://www.abc.net.au/news/2017-10-16/cabinet-dumps-clean-energy-target-for-new-plan/9056174", "https://www.thegwpf.com/new-report-world-bank-abandons-the-poor/", "https://www.thegwpf.org/content/uploads/2017/10/Darwall-WB.pdf", "https://www.bloomberg.com/news/articles/2017-10-02/tesla-sales-climb-as-model-3-stokes-demand-in-pricier-offerings", "https://abovethelaw.com/2017/10/tesla-is-immune-to-bad-financial-data-because-logic-is-officially-dead-in-silicon-valley/?utm_source=CCNet+Newsletter&utm_campaign=93b9b3e7f9-EMAIL_CAMPAIGN_2017_10_04&utm_medium=email&utm_term=0_fe4b2f45ef-93b9b3e7f9-20168513", "https://www.thegwpf.com/green-activists-face-up-to-21-years-in-prison-as-judge-rejects-climate-change-excuse/", "https://wattsupwiththat.com/2017/10/04/is-climate-change-controversy-good-for-science/?utm_source=CCNet+Newsletter&utm_campaign=e6e068267a-EMAIL_CAMPAIGN_2017_10_05&utm_medium=email&utm_term=0_fe4b2f45ef-e6e068267a-20168513", "https://www.thegwpf.com/new-study-climate-controversy-is-good-for-science-in-general/?utm_source=CCNet+Newsletter&utm_campaign=e6e068267a-EMAIL_CAMPAIGN_2017_10_05&utm_medium=email&utm_term=0_fe4b2f45ef-e6e068267a-20168513", "https://wattsupwiththat.com/2017/10/07/the-incestuous-nature-of-the-ipcc-reports/", "https://www.linkedin.com/pulse/climate-change-killing-us-my-open-letter-prime-trudeau-allan-chatenay/?trackingId=j3TuEgJPMD9xzvfrCTgilA%3D%3D", "http://torontosun.com/news/provincial/high-hydro-rates-killed-ontario-jobs-study", "https://www.fraserinstitute.org/article/rising-electricity-costs-kill-75000-manufacturing-jobs-in-ontario", "https://www.fraserinstitute.org/sites/default/files/rising-electricity-costs-and-declining-employment-in-ontarios-manufacturing-sector.pdf", "http://www.cbc.ca/news/canada/saskatchewan/carbon-capture-critics-1.4388026?utm_source=CCNet+Newsletter&utm_campaign=ab161cea64-EMAIL_CAMPAIGN_2017_11_06&utm_medium=email&utm_term=0_fe4b2f45ef-ab161cea64-20168513?", "http://www.cbc.ca/news/canada/saskatchewan/saskpower-carbon-capture-unlikely-future-1.4386411", "http://www.express.co.uk/news/politics/875213/European-Union-EU-wasted-green-project-carbon-capture-zero-results?utm_source=CCNet+Newsletter&utm_campaign=ab161cea64-EMAIL_CAMPAIGN_2017_11_06&utm_medium=email&utm_term=0_fe4b2f45ef-ab161cea64-20168513", "https://ec.europa.eu/clima/policies/lowcarbon/ner300_en", "http://business.financialpost.com/opinion/lawrence-solomon-the-corruption-of-environmental-regulation-goes-down-the-swamp-drain", "http://www.powerlineblog.com/archives/2017/10/green-energy-fails-every-test.php", "https://2lffqo2moysixpyb349z0bj6-wpengine.netdna-ssl.com/wp-content/uploads/2017/10/10.17-MN-Energy-Policy.pdf", "https://wattsupwiththat.com/2017/11/01/un-nobody-is-doing-enough-to-limit-co2-emissions/", "http://www.unenvironment.org/resources/emissions-gap-report", "https://wedocs.unep.org/bitstream/handle/20.500.11822/22070/EGR_2017.pdf?sequence=1&isAllowed=y", "https://www.investors.com/politics/editorials/the-un-admits-that-the-paris-climate-deal-was-a-fraud/", "https://www.thegwpf.com/stormy-wind-price-collapse-reveals-madness-of-germanys-green-energy-transition/", "http://joannenova.com.au/2017/11/germans-get-paid-to-use-junk-electricity-wind-power-generates-when-people-dont-want-it/", "https://www.facebook.com/bjornlomborg/posts/10156188900228968:0?utm_source=CCNet+Newsletter&utm_campaign=ab161cea64-EMAIL_CAMPAIGN_2017_11_06&utm_medium=email&utm_term=0_fe4b2f45ef-ab161cea64-20168513", "https://www.thegwpf.com/green-energy-professor-sues-sceptical-scientists-for-10-million/", "http://mashable.com/2017/11/01/prominent-stanford-climate-scientist-sues-nas-over-critical-study/#FolMkLK5XPqE", "http://business.financialpost.com/opinion/lawrence-solomon-why-the-e-in-e-car-actually-stands-for-evil", "https://www.thegwpf.com/epa-chief-scott-pruitt-to-scrap-obamas-clean-power-plan/", "https://www.thegwpf.com/pruitts-clean-power-break-will-end-obamas-climate-rules/", "http://thehill.com/policy/energy-environment/354264-draft-proposal-would-repeal-obama-climate-rule", "https://www.eenews.net/stories/1060063101", "https://wattsupwiththat.com/2017/10/16/epa-harnessed-pruitt-issues-directive-to-end-epa-sue-settle-practice/", "http://www.washingtontimes.com/news/2017/oct/16/epa-end-obama-era-sue-and-settle-practice/", "https://rclutz.wordpress.com/2017/10/11/blatant-hypocrisy-re-social-cost-of-carbon/", "https://pv-magazine-usa.com/2017/10/12/california-gets-quacking-on-ending-duck-curve-problem/", "https://en.wikipedia.org/wiki/Duck_curve", "https://www.thegwpf.org/tony-abbott-daring-to-doubt/", "https://www.thegwpf.com/tony-abbott-draws-a-line-in-the-energy-sand/", "https://www.thegwpf.com/tony-abbott-green-hysteria-and-ridleys-paradox/", "https://www.thegwpf.com/new-study-tony-abbotts-climate-views-are-shared-by-business-leaders-down-under/", "https://www.thegwpf.com/tony-abbotts-big-victory-as-australian-govt-dumps-green-energy-target/", "http://www.abc.net.au/news/2017-10-16/cabinet-dumps-clean-energy-target-for-new-plan/9056174", "https://www.thegwpf.com/new-report-world-bank-abandons-the-poor/", "https://www.thegwpf.org/content/uploads/2017/10/Darwall-WB.pdf", "https://www.bloomberg.com/news/articles/2017-10-02/tesla-sales-climb-as-model-3-stokes-demand-in-pricier-offerings", "https://abovethelaw.com/2017/10/tesla-is-immune-to-bad-financial-data-because-logic-is-officially-dead-in-silicon-valley/?utm_source=CCNet+Newsletter&utm_campaign=93b9b3e7f9-EMAIL_CAMPAIGN_2017_10_04&utm_medium=email&utm_term=0_fe4b2f45ef-93b9b3e7f9-20168513", "https://www.thegwpf.com/green-activists-face-up-to-21-years-in-prison-as-judge-rejects-climate-change-excuse/", "https://wattsupwiththat.com/2017/10/04/is-climate-change-controversy-good-for-science/?utm_source=CCNet+Newsletter&utm_campaign=e6e068267a-EMAIL_CAMPAIGN_2017_10_05&utm_medium=email&utm_term=0_fe4b2f45ef-e6e068267a-20168513", "https://www.thegwpf.com/new-study-climate-controversy-is-good-for-science-in-general/?utm_source=CCNet+Newsletter&utm_campaign=e6e068267a-EMAIL_CAMPAIGN_2017_10_05&utm_medium=email&utm_term=0_fe4b2f45ef-e6e068267a-20168513", "https://wattsupwiththat.com/2017/10/07/the-incestuous-nature-of-the-ipcc-reports/", "https://climatekids.ca/", "http://www.netnewsledger.com/2017/09/20/opinion-mckenna-mercy-bureaucracy/", "http://www.nationalobserver.com/2017/09/01/analysis/canadas-climate-minister-launches-website-kids-classroom", "https://www.pressreader.com/canada/national-post-latest-edition/20171003/282024737465551", "https://friendsofscience.org/index.php?id=2273", "http://business.financialpost.com/opinion/lawrence-solomon-paris-is-dead-the-global-warming-deniers-have-won", "http://nationalpost.com/opinion/rex-murphy-all-global-warming-predictions-are-infallible-until-theyre-not", "https://beta.theglobeandmail.com/report-on-business/rob-commentary/canada-must-clarify-its-national-carbon-policy/article36376716/?ref=https://www.theglobeandmail.com&service=mobile", "https://www.reuters.com/article/us-usa-epa-carbon-exclusive/trump-epa-to-propose-repealing-obamas-climate-regulation-document-idUSKCN1C90BY", "https://wattsupwiththat.com/2017/09/13/thwack-federal-judge-deals-major-blow-to-gore-and-exxonknew-crusaders/", "https://www.heartland.org/news-opinion/news/appeals-court-places-hold-on-activist-backed-youth-climate-lawsuit", "http://uk.reuters.com/article/us-britain-power-autos-analysis/britain-faces-huge-costs-to-avoid-power-shortages-with-electric-car-plan-idUKKCN1BC3VU", "http://www.dw.com/en/germany-risks-reputation-with-climate-goals-failure/a-40413092", "https://www.bloomberg.com/news/articles/2017-09-21/how-merkel-s-green-energy-policy-has-fueled-demand-for-coal", "http://manhattancontrarian.com/blog/2017/9/22/reasons-for-optimism-about-climate-hysteria", "https://wattsupwiththat.com/2017/08/25/ecojustice-competition-bureau-inquiry-the-competition-bureau-has-discontinued-the-inquiry-into-friends-of-science-society-that-ecojustice-publicly-called-for-on-dec-3-2015/", "https://www.ecojustice.ca/competition-bureau-drops-climate-denier-investigation/", "https://apps.neb-one.gc.ca/REGDOCS/Item/View/3322976", "http://calgaryherald.com/business/energy/yedlin-energy-east-review-goes-too-far", "http://thehill.com/policy/energy-environment/347469-court-rejects-pipeline-project-on-climate-concerns", "http://www.calgaryherald.com/company+behind+dakota+access+pipeline+sues+greenpeace/14308893/story.html", "https://www.thegwpf.com/dakota-access-pipeline-owner-sues-greenpeace-for-300-million-in-damages/", "http://business.financialpost.com/opinion/mixed-results-for-the-eco-mob", "https://www.theguardian.com/commentisfree/2017/aug/28/climate-change-hurricane-harvey-more-deadly", "http://theweek.com/articles/720740/hurricane-harvey-americas-climate-future", "http://www.drroyspencer.com/2017/08/why-houston-flooding-isnt-a-sign-of-climate-change/", "http://www.drroyspencer.com/2017/08/texas-major-hurricane-intensity-not-related-to-gulf-water-temperatures/", "http://ijr.com/the-declaration/2017/09/963287-5-hurricane-charts-climate-alarmists-dont-want-see-rush-politicize-harvey/", "https://www.washingtonpost.com/news/energy-environment/wp/2017/08/20/the-trump-administration-just-disbanded-a-federal-advisory-committee-on-climate-change/?utm_term=.f71c009394da", "https://notalotofpeopleknowthat.wordpress.com/2017/08/22/pre-determined-science-the-chair-of-the-federal-climate-board-disbanded-by-trump-was-a-world-wildlife-fund-activist/", "https://www.pressreader.com/canada/national-post-latest-edition/20170809/282183651146577", "http://www.politico.com/story/2017/08/11/pruitt-climate-report-epa-241546", "https://www.nytimes.com/2017/08/07/climate/climate-change-drastic-warming-trump.html?_r=0", "http://business.financialpost.com/opinion/lawrence-solomon-how-teslas-elon-musk-became-the-master-of-fake-business/wcm/12e8fd62-b49d-40d1-90e4-03105e49a514", "http://blog.ucsusa.org/brenda-ekwurzel/us-abandons-global-science-leadership-zeroes-out-ipcc-funding", "http://www.ipcc.ch/scripts/_session_template.php?page=_46ipcc.htm", "http://www.nature.com/news/prove-paris-was-more-than-paper-promises-1.22378?utm_content=buffer0fb8e&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "https://judithcurry.com/2017/08/14/the-blame-game/", "https://www.masterresource.org/electric-vehicles-and-generation-capacity/uk-bev-math/", "https://polarbearscience.com/2017/08/23/fat-polar-bears-and-lots-of-them-drive-public-confidence-in-future-of-the-species/", "http://joannenova.com.au/2017/08/global-warming-hallelujah-an-inconvenient-music-video/", "http://missliberty.com/theaters-self-sacrifice-boost-gores-inconvenient-sequel/", "http://www.climatedepot.com/2017/08/23/new-study-tide-gages-find-no-global-acceleration-in-sea-level-but-satellite-manipulated-to-show-acceleration/", "http://www.ijesi.org/papers/Vol%286%298/Version-1/G0608014851.pdf", "http://www.torontosun.com/2017/07/18/ontario-wind-turbine-factory-closing-hundreds-losing-jobs", "https://wattsupwiththat.com/2017/07/20/kelly-mcparland-another-wheel-flies-off-ontarios-green-energy-bus-and-lands-on-340-workers/", "https://beta.theglobeandmail.com/report-on-business/siemens-to-close-ontario-wind-turbine-blade-plant-340-jobs-to-be-lost/article35716643/?ref=https://www.theglobeandmail.com&service=mobile", "http://ontario-wind-resistance.org/2017/07/18/the-green-job-joke-in-ontario/", "https://www.reuters.com/article/us-un-climate-usa-paris-idUSKBN1AK2FM", "https://www.state.gov/r/pa/prs/ps/2017/08/273050.htm", "https://www.vox.com/culture/2017/7/28/16035852/an-inconvenient-sequel-review-post-truth", "https://acculturated.com/al-gores-environmental-messiah-complex/", "http://www.nationalreview.com/article/449910/al-gore-inconvenient-sequel-self-serving", "https://www.thegwpf.com/fear-is-the-business-model-that-has-al-gore-rich/", "http://joannenova.com.au/2017/08/al-gores-swimming-pool-uses-the-same-electricity-as-six-us-homes/", "http://www.hollywoodintoto.com/media-gore-electricity-bill/", "http://www.washingtontimes.com/news/2017/aug/2/al-gores-nashville-estate-expends-21-times-more-en/", "https://www.thegwpf.com/climate-change-causes-less-natural-disasters-than-10-years-ago-munich-re/", "https://www.reuters.com/article/us-germany-coal-election-idUSKBN1AI1HF", "http://www.express.co.uk/news/world/834275/Donald-Trump-climate-change-policy-Paris-agreement-EU-coal-exports-US", "https://www.thegwpf.com/the-great-green-diesel-swindle-german-carmakers-colluded-for-decades-report/", "https://www.cleanenergywire.org/news/cartel-german-carmakers-might-face-wave-lawsuits/cartel", "https://www.cleanenergywire.org/news/end-car-industry-we-know-it-eu-criticises-us-sanction-plans", "https://www.theguardian.com/sustainable-business/2017/jul/26/california-communities-lawsuit-exxon-shell-climate-change-carbon-majors-sea-level-rises", "https://wattsupwiththat.com/2017/07/23/tesla-battery-subsidy-and-sustainability-fantasies/", "http://www.dailymail.co.uk/news/article-4764208/Child-miners-aged-four-living-hell-Earth.html", "https://patch.com/massachusetts/falmouth/wind-turbines-killing-whales-save-polar-bears", "http://www.huffingtonpost.ca/2017/07/05/slim-majority-of-canadians-fret-about-carbon-tax-in-trump-era-p_a_23016983/", "http://angusreid.org/federal-carbon-pricing/", "http://www.torontosun.com/2017/07/15/no-kids-no-cars-no-meat-no-flying", "https://www.thegwpf.com/green-dreams-no-kids-no-cars-no-meat-no-flying/", "http://www.bbc.com/news/world-europe-40540359", "https://www.nytimes.com/2017/07/08/world/europe/group-of-20-climate-change-agreement.html", "https://wattsupwiththat.com/2017/07/11/president-trump-boldly-proclaims-a-winning-u-s-climate-energy-policy-at-g20-summit/", "http://dailycaller.com/2017/07/14/trump-to-steer-un-global-warming-funds-to-coal-gas-projects/", "https://www.bloomberg.com/news/articles/2017-07-13/trump-wants-to-steer-un-climate-cash-toward-building-coal-plants", "https://www.nytimes.com/2017/07/01/climate/china-energy-companies-coal-plants-climate-change.html?smid=tw-share", "https://www.eenews.net/stories/1060056858", "http://thehill.com/policy/energy-environment/340223-epa-head-to-launch-initiative-to-challenge-climate-science", "https://judithcurry.com/2017/07/03/what-is-red-teaming/", "http://www.cbc.ca/news/technology/trump-challenge-climate-science-1.4190809", "http://thefederalist.com/2017/07/06/leading-climate-scientist-science-debate-un-american/", "http://www.realclearenergy.org/articles/2017/06/25/wind_powers_future_in_us_could_be_thwarted_by_grassroots_opposition_110238.html", "https://cleantechnica.com/2017/07/03/san-fran-man-proposes-huge-new-california-ev-incentives/", "https://www.thegwpf.com/green-cronyism-gone-wild-it-looks-like-the-state-of-california-is-bailing-out-tesla/", "https://www.masterresource.org/electric-vehicles/norway-ev-costs/", "https://www.masterresource.org/electric-vehicles/ev-driver-acceptance/", "https://www.nationaleconomicseditorial.com/2017/06/28/72-8-worlds-renewable-energy-made-burning-wood-dung-20x-wind-solar-energy/", "http://ijr.com/the-declaration/2017/07/922200-tired-wrong-climate-alarmists-move-doomsday-next-century/", "http://dailycaller.com/2017/06/14/scientists-blame-climate-change-for-thick-sea-ice-that-halted-arctic-expedition/", "https://www.theguardian.com/world/2017/jun/14/canada-hudson-bay-climate-change-study-warm-temperatures?CMP=share_btn_tw", "http://www.breitbart.com/big-government/2017/06/13/delingpole-ship-of-fools-iii-global-warming-study-cancelled-because-of-unprecedented-ice/", "https://www.theglobeandmail.com/opinion/too-keen-on-green/article35350134/", "https://ecofiscal.ca/reports/supporting-carbon-pricing-complementary-policies/", "http://business.financialpost.com/opinion/junk-science-week-carbon-tax-is-doomed-to-failure-so-dont-celebrate-just-yet/wcm/59f4d805-e9d5-4efb-8593-894c475fa3ea", "https://www.thegwpf.com/new-study-large-co2-emissions-from-batteries-of-electric-cars/", "https://wattsupwiththat.com/2017/06/20/tesla-car-battery-production-releases-as-much-co2-as-8-years-of-gasoline-driving/", "https://www.thegwpf.com/new-report-ccs-would-make-renewables-and-nuclear-energy-look-cheap/", "https://www.thegwpf.org/content/uploads/2017/06/CCS-Report.pdf", "https://judithcurry.com/2017/06/21/national-climate-assessment-and-the-trump-administration/#more-23133", "http://reason.com/blog/2017/05/09/epa-bureaucracy-strikes-back-the-case-o1", "https://rclutz.wordpress.com/2017/06/21/updated-epa-swamp-life-climategaters/", "http://www.sciencemag.org/news/2017/06/epa-sheds-38-more-science-advisors", "http://www.drroyspencer.com/2017/06/the-ams-scolds-rick-perry-for-believing-the-oceans-are-stronger-than-your-suv/", "https://www.ametsoc.org/ams/index.cfm/about-ams/ams-position-letters/letter-to-doe-secretary-perry-on-climate-change/", "https://www.thegwpf.com/the-global-status-of-renewable-energy-taking-stock/", "http://www.ren21.net/status-of-renewables/global-status-report/", "http://www.powerlineblog.com/archives/2017/06/black-monday-for-the-climatistas.php", "http://dailycaller.com/2017/06/19/take-a-look-at-the-new-consensus-on-global-warming/", "https://wattsupwiththat.com/2017/06/20/the-new-consensus-on-global-warming-a-shocking-admission-by-team-climate/", "https://www.greentechmedia.com/articles/read/hard-truths-about-city-failures-with-clean-energy", "http://dailycaller.com/2017/06/15/report-only-12-7-trillion-needed-to-meet-paris-climate-accords-goal/", "https://wattsupwiththat.com/2017/06/13/wind-power-fails-in-canada-a-23-year-life-span-not-likely-to-be-replaced/", "http://business.financialpost.com/fp-comment/lawrence-solomon-canadians-should-be-grateful-to-trump-for-killing-the-paris-climate-deal", "http://www.spiegel.de/international/germany/angela-merkel-s-anti-trump-alliance-crumbling-ahead-of-g-20-a-1151439.html", "http://notrickszone.com/2017/06/10/global-climate-policy-meets-its-d-day-spiegel-climate-alliance-is-crumbling/#sthash.tYh9WGox.alRUhRNB.dpbs", "http://business.financialpost.com/fp-comment/lawrence-solomon-why-big-business-ceos-lean-left-on-the-paris-climate-deal-and-on-most-everything-else", "http://www.energylivenews.com/2017/06/05/eus-emissions-in-2015-rose-after-five-years/", "https://www.bloomberg.com/news/articles/2017-06-02/denmark-is-killing-tesla-and-other-electric-cars", "https://wattsupwiththat.com/2017/06/06/epas-pruitt-establish-red-team-blue-team-of-scientists-to-examine-climate-risk-of-co2/", "http://dailysignal.com/2017/06/08/trumps-epa-chief-backs-approach-to-science-that-could-upend-the-global-warming-consensus/", "https://www.vox.com/science-and-health/2017/5/31/15713838/inoculation-climate-change-denial", "https://en.wikipedia.org/wiki/Oregon_Petition", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/", "https://wattsupwiththat.com/2017/06/10/french-president-offers-us-climate-scientists-e1-5-million-each-to-move-to-france/", "https://www.cato.org/blog/dilbert-1-scientists-0", "http://blog.dilbert.com/post/161354048186/betting-on-climate-change", "https://wattsupwiththat.com/2017/05/30/claim-four-trillion-dollar-per-annum-carbon-tax-required-to-save-the-world/", "http://www.independent.co.uk/environment/climate-change-carbon-tax-4-trillion-save-humanity-global-warming-economists-nicholas-stern-joseph-a7763376.html", "http://dailycaller.com/2017/05/23/trumps-budget-eliminates-funding-for-un-global-warming-programs/", "https://www.whitehouse.gov/sites/whitehouse.gov/files/omb/budget/fy2018/msar.pdf", "http://www.climatechangenews.com/2017/05/29/eu-climate-targets-undermined-polish-czech-revolt-documents-reveal/", "http://notrickszone.com/2017/05/12/german-solar-energy-from-technology-of-the-future-to-extinction-in-just-10-years/#sthash.VVN7eDPF.90QrxPOB.dpbs", "http://economictimes.indiatimes.com/industry/indl-goods/svs/metals-mining/china-india-dominate-coal-ownership-as-some-shun-climate-risks-report/articleshow/58695000.cms", "https://www.chinadialogue.net/article/show/single/en/9785-China-s-Belt-and-Road-Initiative-still-pushing-coal", "http://economictimes.indiatimes.com/industry/energy/power/coal-to-be-indias-energy-mainstay-for-next-30-years-policy-paper/articleshow/58686733.cms", "https://www.newscientist.com/article/2132031-eu-nations-set-to-wipe-out-forests-and-not-account-for-emissions/", "https://notalotofpeopleknowthat.wordpress.com/2017/05/29/africa-has-become-greener-in-the-last-20-years/", "https://www.nature.com/articles/s41559-017-0081", "https://www.thegwpf.com/why-are-big-corporations-so-eager-for-trump-to-break-his-promise-on-paris-climate-deal/", "https://www.c2es.org/ws/", "http://money.cnn.com/2017/05/29/news/trump-paris-climate-change-business/", "http://www.thenews.pl/1/9/Artykul/307658,Polish-environment-minister-to-preside-over-COP24-conference", "http://newsroom.unfccc.int/cop-23-bonn/", "https://wattsupwiththat.com/2017/05/14/the-dilbert-sunday-comic-strip-hilariously-disses-climate-science-certainty/", "http://dilbert.com/strip/2017-05-14", "https://www.eventbrite.ca/e/climate-dogma-exposed-carbon-taxes-cant-stop-nature-can-kill-the-economy-tickets-32517180763", "https://friendsofscience.org/index.php?id=2282", "http://350.org/", "https://www.theguardian.com/commentisfree/2017/apr/17/stop-swooning-justin-trudeau-man-disaster-planet", "http://business.financialpost.com/fp-comment/kevin-libin-justin-trudeau-is-suddenly-the-new-enemy-of-the-militant-climate-crusade", "http://news.nationalpost.com/full-comment/rex-murphy-if-the-eco-fanatics-hate-justin-trudeau-this-much-imagine-what-they-think-of-you", "http://www.theglobeandmail.com/report-on-business/rob-commentary/is-justin-trudeau-a-hypocrite-on-climate-change/article34797080/", "http://www.nationalpost.com/m/wp/news/canada/canadian-politics/blog.html?b=news.nationalpost.com/news/canada/canadian-politics/emissions-down-slightly-but-canada-not-yet-on-track-to-meet-2030-climate-targets-report", "http://www.nationalpost.com/m/wp/news/canada/blog.html?b=news.nationalpost.com/news/canada/ruling-against-national-post-writers-in-defamation-suit-by-prominent-climate-scientist-overturned", "http://dailycaller.com/2017/04/25/al-gores-new-group-demands-15-trillion-to-fight-global-warming/", "http://energy-transitions.org/sites/default/files/BetterEnergy_Executive%20Summary_DIGITAL.PDF", "https://www.the-american-interest.com/2017/04/22/greens-make-natural-gas-their-next-target/", "https://www.bloomberg.com/news/articles/2017-04-20/natural-gas-moves-to-the-naughty-list", "http://www.thegwpf.com/steven-koonin-a-red-team-exercise-would-strengthen-climate-science/", "https://judithcurry.com/2017/04/21/a-red-team-exercise-would-strengthen-climate-science/", "https://www.eventbrite.ca/e/climate-dogma-exposed-carbon-taxes-cant-stop-nature-can-kill-the-economy-tickets-32517180763", "https://friendsofscience.org/index.php?id=2282", "http://www.thegwpf.org/content/uploads/2017/03/Climate-Science-March20171.pdf", "https://wattsupwiththat.com/2017/03/29/hump-day-hilarity-mann-o-war-at-the-house-science-hearing/", "http://www.nationalreview.com/article/446295/michael-mann-house-testimony-climate-change-embarrassing-rude", "https://www.desmogblog.com/2017/03/29/house-science-committee-hearing-lamar-smith-michael-mann-climate-consensus-deniers", "https://wattsupwiththat.com/2017/04/03/we-won-climate-battles-but-are-not-winning-the-climate-war-heres-why/", "http://thehill.com/policy/energy-environment/326561-trump-to-decide-whether-to-stay-paris-climate-pact-by-late-may", "https://www.washingtonpost.com/news/energy-environment/wp/2017/04/14/trumps-epa-chief-scott-pruitt-calls-for-an-exit-to-the-paris-climate-agreement/?utm_term=.92768a1bfa53", "http://www.dailymail.co.uk/news/article-4398020/G7-officials-fail-agree-statement-climate-change.html", "http://www.reuters.com/article/us-g7-energy-u-s-idUSKBN17C1F3", "http://www.climatechangenews.com/2017/04/10/g7-fails-agree-paris-climate-statement-us-turns-spoiler/", "http://www.politico.com/story/2017/04/trump-fossil-fuels-g7-tension-237129", "https://www.the-american-interest.com/2017/04/12/the-magic-disappearing-100-billion-climate-fund/", "http://uk.businessinsider.com/china-india-brazil-south-africa-trump-climate-change-2017-4", "https://www.eventbrite.ca/e/climate-dogma-exposed-carbon-taxes-cant-stop-nature-can-kill-the-economy-tickets-32517180763", "https://friendsofscience.org/index.php?id=2282", "http://www.usatoday.com/story/news/politics/2017/03/28/energy-independence-not-climate-change-becomes-priority-under-trump-order/99725640/", "https://www.whitehouse.gov/the-press-office/2017/03/28/president-trumps-energy-independence-policy", "http://www.pbs.org/newshour/rundown/read-full-text-trumps-executive-order-energy-climate-change/", "https://www.forbes.com/sites/danielfisher/2017/03/28/trumps-executive-order-on-energy-this-time-he-listened-to-the-lawyers/#dbf53504f5f7", "http://thehill.com/policy/energy-environment/325826-pruitt-says-paris-accord-a-bad-deal", "http://www.the-american-interest.com/2017/03/29/the-paris-climate-treaty-is-already-failing/", "https://www.theguardian.com/environment/2017/mar/28/only-sweden-germany-france-pursuing-paris-climate-goals-study", "http://news.nationalpost.com/full-comment/john-robson-if-the-elites-are-wrong-about-global-warming-the-damage-will-be-enormous", "http://www.johnrobson.ca/", "https://mediamatters.org/research/2017/03/23/how-broadcast-networks-covered-climate-change-2016/215718", "http://www.resolutevgreenpeace.com/", "http://www.resolutevgreenpeace.com/blog/", "http://www.cbc.ca/news/canada/sudbury/greenpeace-resolute-court-1.4012553", "http://www.euractiv.com/section/climate-environment/news/leaked-paper-exposes-eu-countries-abuse-of-climate-loophole/", "http://www.thegwpf.com/new-study-germanys-energiewende-threatens-to-become-economic-disaster/", "https://www.bloombergquint.com/politics/2017/03/09/g-20-document-shows-governments-retreating-from-climate-funding", "http://www.reuters.com/article/us-g20-germany-climatechange-idUSKBN16O1S1", "https://www.bloomberg.com/news/articles/2017-03-23/oil-majors-take-a-plunge-in-industry-that-may-hurt-fossil-fuel", "https://www.desmog.uk/2017/03/23/oil-companies-awarded-new-north-sea-licenses-just-weeks-after-declaring-climate-leadership", "https://wattsupwiththat.com/2017/03/08/science-deniers-in-the-wind-industry/", "https://wattsupwiththat.com/2017/03/08/the-climate-institute-to-close/", "http://www.theage.com.au/environment/climate-institute-fights-for-survival-as-philanthropic-donation-runs-out-20151218-glrgeq.html", "http://joannenova.com.au/2017/03/climate-institute-runs-out-of-money-2/", "https://wattsupwiththat.com/2017/03/28/florida-the-sun-state-with-hardly-any-household-solar/", "https://beta.theglobeandmail.com/news/politics/two-thirds-of-canadians-approve-of-ottawas-climate-regulations-poll/article34205335/?ref=http://www.theglobeandmail.com&service=mobile", "http://thehill.com/policy/energy-environment/320793-climate-skeptics-ask-trump-to-withdraw-from-un-agency", "https://wattsupwiththat.com/2017/02/25/richard-lindzen-petition-to-president-trump-withdraw-from-the-un-convention-on-climate-change/", "http://business.financialpost.com/fp-comment/lawrence-solomon-scientists-urging-trump-to-embrace-carbon-among-the-biggest-climate-experts-around", "http://www.thegwpf.com/merkel-sets-a-climate-ambush-for-trump/", "http://notrickszone.com/2017/03/03/germanys-silent-catastrophe-330000-households-see-power-turned-off-in-one-year/#sthash.gVLc2STP.wZrKl6H7.dpbs", "http://www.thegwpf.com/german-high-court-rules-federal-agency-may-denounce-critical-science-journalists/", "https://wattsupwiththat.com/2017/02/23/a-trifecta-of-green-lunacy-the-law-of-unintended-consequences-kicks-in/", "https://www.chathamhouse.org/publication/impacts-demand-woody-biomass-power-and-heat-climate-and-forests", "https://www.theguardian.com/environment/2017/feb/28/reform-of-eu-carbon-trading-scheme-agreed", "http://www.economist.com/news/leaders/21717371-thats-no-reason-governments-stop-supporting-them-wind-and-solar-power-are-disrupting?fsrc=scn/tw/te/bl/ed/windandsolarpoweraredisruptingelectricitysystems", "https://wattsupwiththat.com/2017/03/04/a-climate-story-that-must-be-told/", "http://www.thegwpf.com/polar-bear-scare-unmasked-the-saga-of-a-toppled-global-warming-icon/", "http://www.thegwpf.com/as-polar-bear-numbers-continue-to-increase-gwpf-calls-for-re-assessment-of-endangered-species-status/", "https://polarbearscience.com/2017/02/28/science-behind-the-video-polar-bear-scare-unmasked-updated-paper-now-available/", "http://business.financialpost.com/fp-comment/terence-corcoran-now-up-to-50-billion-canadas-green-electricity-bailouts-make-the-bombardier-giveaway-look-like-peanuts", "http://business.financialpost.com/fp-comment/jack-mintz-the-public-backlash-is-rising-as-the-credibility-of-high-cost-low-carbon-policies-collapses", "https://thinkprogress.org/childrens-climate-lawsuit-trump-4953d46cb66c#.q8p1wvy3c", "http://www.thegwpf.com/scott-pruitts-back-to-basics-agenda-for-the-epa/", "https://www.washingtonpost.com/news/energy-environment/wp/2017/02/17/scott-pruitt-long-time-adversary-of-epa-confirmed-to-lead-the-agency/?utm_term=.c379fe21507c", "https://www.theguardian.com/us-news/2017/feb/15/trump-science-adviser-william-happer-climate-change-cult", "http://manhattancontrarian.com/blog/2017/2/16/are-climate-alarmists-glassy-eyed-cultists", "https://global.handelsblatt.com/companies-markets/winter-sees-the-return-of-coal-and-gas-701667", "http://www.thegwpf.com/europes-green-madness-dieselgate-was-a-political-disaster/", "http://reneweconomy.com.au/aemo-says-wind-farm-changes-mean-sa-blackout-wont-repeated-43631/", "http://www.heraldsun.com.au/blogs/andrew-bolt/sa-loses-power-in-another-wind-farm-fail/news-story/8e5db34f658a3153f7f0a8d91a077b82", "http://www.thegwpf.com/as-the-lights-go-out-blame-game-deepens-over-green-energy-worship/", "http://joannenova.com.au/2017/02/rolling-blackouts-in-sa-in-40c-heat/", "http://joannenova.com.au/2017/02/south-australian-electricity-is-coming-your-way/", "https://wattsupwiththat.com/2017/02/09/dr-judith-curry-speaks-out-on-climate-sciences-fatal-flaw-the-failure-to-explore-and-understand-uncertainty/", "http://www.thegwpf.org/content/uploads/2017/02/Curry-2017.pdf", "http://business.financialpost.com/fp-comment/albertas-ndp-politicians-are-determined-to-fix-an-air-quality-problem-but-theres-no-evidence-it-exists", "http://www.sciencedirect.com/science/article/pii/S0269749116324745", "http://business.financialpost.com/fp-comment/ross-mckitrick-turns-out-ontarios-painful-coal-phase-out-didnt-help-pollution-and-queens-park-even-knew-it-wouldnt", "http://business.financialpost.com/fp-comment/kevin-libin-why-is-albertas-carbon-based-industry-the-only-one-the-trudeau-liberals-are-plotting-to-phase-out", "https://wattsupwiththat.com/2017/01/31/trump-epa-transition-advisor-trump-will-honor-his-campaign-pledge-to-pull-the-us-out-of-the-paris-climate-agreement/", "https://www.youtube.com/watch?v=JvWMfAk47_Q", "http://www.breitbart.com/london/2017/01/31/delingpole-trumps-climate-plans-made-medias-heads-explode/", "https://wattsupwiththat.com/2017/01/31/washington-state-judge-denies-climate-necessity-defence-in-ecoterrorism-case/", "https://www.theguardian.com/environment/2017/jan/31/environmental-activist-trial-judge-questions-climate-change-ken-ward", "http://www.abc.net.au/news/2017-01-31/japan-coal-power-plants/8224302", "http://dailycaller.com/2017/02/01/japan-infuriating-enviros-by-building-45-new-coal-power-plants/", "http://www.dailymail.co.uk/sciencetech/article-4192182/World-leaders-duped-manipulated-global-warming-data.html", "https://judithcurry.com/2017/02/04/climate-scientists-versus-climate-data/", "https://judithcurry.com/2017/02/06/response-to-critiques-climate-scientists-versus-climate-data/", "http://dailycaller.com/2017/02/06/house-committee-to-push-ahead-with-investigation-into-alleged-climate-data-manipulation-at-noaa/", "https://science.house.gov/news/press-releases/former-noaa-scientist-confirms-colleagues-manipulated-climate-records", "https://wattsupwiththat.com/2017/01/28/four-key-charts-for-a-climate-change-skeptic/", "http://www.theglobeandmail.com/opinion/ontarios-plan-destroy-jobs-save-the-planet/article33478285/", "https://friendsofscience.org/assets/files/Ontario%E2%80%99s%20plan-%20destroy%20jobs,%20save%20the%20planet%20-%20The%20Globe%20and%20Mail.pdf", "https://wattsupwiththat.com/2017/01/14/toronto-sun-accuses-trudeau-of-gross-green-hypocricy/", "http://www.torontosun.com/2017/01/14/trudeaus-cheap-talk-on-climate-change", "https://wattsupwiththat.com/2017/01/18/president-obama-just-transferred-another-500-million-to-the-un-green-fund/", "http://www.motherjones.com/environment/2017/01/obama-500m-green-climate-fund", "http://www.latimes.com/politics/la-pol-ca-california-climate-lawsuit-20170122-story.html", "http://www.latimes.com/nation/la-na-pol-epa-confirmation-20170118-story.html", "https://judithcurry.com/2017/01/25/the-trump-shift/", "http://www.reuters.com/article/us-usa-trump-epa-climatechange-idUSKBN15906G", "https://wattsupwiththat.com/2017/01/15/davos-globalist-elite-bet-on-trump-climate-failure/", "https://www.bloomberg.com/news/articles/2017-01-15/ignoring-trump-s-skepticism-davos-elite-bets-on-climate-change", "http://uk.reuters.com/article/uk-serbia-energy-coal-idUKKBN1572I4", "http://www.thegwpf.org/germanys-energiewende-a-disaster-in-the-making/", "http://www.thegwpf.org/content/uploads/2017/01/Vahrenholt-Energiewende.pdf", "http://www.powerengineeringint.com/articles/2017/01/vahrenholt-rails-against-the-climate-priests.html", "http://www.thebestschools.org/special/karoly-happer-dialogue-global-warming/william-happer-interview/", "https://wattsupwiththat.com/2017/01/10/the-william-happer-interview/", "https://www.desmog.ca/2016/12/13/carbon-offset-question-will-canada-buy-its-way-climate-finish-line", "http://business.financialpost.com/fp-comment/philip-cross-its-time-to-expose-the-lie-that-expensive-green-energy-wont-hurt-canadas-prosperity", "http://issues.nawindpower.com/article/eulogizing-ontarios-wind-industry#.WEHBlE8wztk.twitter", "http://www.financialpost.com/m/wp/fp-comment/blog.html?b=business.financialpost.com/fp-comment/the-day-ontarios-wind-power-tyranny-ends-there-will-be-dancing-in-the-streets", "https://beta.theglobeandmail.com/report-on-business/economy/economic-insight/three-post-truths-about-global-energy-and-climate-change/article33465520/?ref=http://www.theglobeandmail.com&service=mobile", "https://www.bloomberg.com/news/articles/2016-12-15/how-climate-rules-might-fade-away", "http://www.thegwpf.com/the-social-cost-of-carbon/", "http://www.hoover.org/research/obsolete-climate-science?utm_content=bufferefd7e&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "http://manhattancontrarian.com/blog/2016/12/13/some-predictions-for-the-future-in-the-climate-game", "http://joannenova.com.au/2016/12/the-us-is-the-child-saying-the-emperor-has-no-clothes/", "http://www.realclearinvestigations.com/articles/2016/12/31/skeptical_climate_scientists_coming_in_from_the_cold.html", "http://co2coalition.org/", "https://www.euractiv.com/section/climate-environment/news/eu-countries-stall-over-carbon-market-reform/", "https://judithcurry.com/2017/01/03/jc-in-transition/", "http://www.cfanclimate.net/", "https://wattsupwiththat.com/2017/01/04/dr-judith-curry-chooses-integrity-over-the-state-of-climate-science/", "https://www.theguardian.com/business/2016/dec/14/mark-carney-firms-must-come-clean-on-exposure-to-climate-change-risks", "https://nofrakkingconsensus.com/2017/01/03/wind-turbines-lots-of-problems-no-free-energy/", "https://friendsofscience.org/pages/privacy.html", "https://friendsofscience.org/pages/cookies-policy.html"], "authors": [], "publish_date": null}