{"result_id": "125020", "URL": "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/", "timestamp": "2023-04-25 15:10:00 CEST+0200", "meta": {"description": "Climate of Conspiracy: Are climate sceptics targets of counter-intelligence programs? A review of the Oxford Encyclopedia of Climate Communication.", "lang": "en", "keywords": "", "favicon": "https://friendsofscience.org/assets/images/svg/flavicon.ico", "canonical": "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/", "encoding": null}, "image": null, "domain": "blog.friendsofscience.org", "title": "climate sceptics vs intel-ops | Friends of Science Calgary", "cleaned_text": "There was no “climate change conspiracy.” After the 1973 oil price shock many Western governments committed to reducing their countries’ dependence on petroleum. These commitments included initiatives promoting alternative energy. Programs were announced in broad daylight, without reference to climate change.\n\nOver the next decade as the petroleum phase-back gained momentum it fused with a parallel, and more aggressive, coal phase-out. During this period, certain scientists pitched the Catastrophic Anthropogenic Global Warming (CAGW) hypothesis to energy officials as a potential pretext for the transition away from oil and coal. CAGW had been kicking around scientific literature for decades.\n\nBy the early-1990s CAGW had become the propaganda screen for the oil and coal phase-outs which by then had spawned a Climate Industrial Complex encompassing numerous businesses engaged in: wind and solar power, electric vehicles, biofuels, and gas-fired electrical generation. By 2015 annual Climate Industrial Complex revenues exceeded $1 trillion.\n\nClimate Industrial Complex companies fund scientific research and donate to universities. Environmentalist philanthropies and NGOs also employ scientists and academics. More important in this endeavour, however, are the Western governments that launched the juggernaut back in 1973. Through their research institutes and funding agencies these governments command legions of scientists.\n\nTo the extent there ever was a “conspiracy” it transpired between 1979 and 1987 during conferences whereat “warmers” convinced politicians to pick CAGW as the rationale for the oil and coal phase-outs; but this happened in well-lit meeting halls. “Political conspiracy” means a secret agreement to unlawfully alter government institutions. The Climate Change campaign began, and proceeded, publically and lawfully.\n\nAlong the way many mini-conspiracies played out wherein activist scientists cherry-picked data and ostracised sceptics. The mainstream media evinced craven pro-CAGW bias; providing venues where-from enviro-scientists broadcast doomsday exaggerations.\n\nClimate Change is the spiel accompanying an epochal marketing and lobbying project. The oil and coal phase-outs themselves are motivated by aspirations for regional energy independence that have nothing to do with climate.\n\nClimate Change Communicators identify the main predictors of CAGW rejection as: political ideology and party affiliation. Free-marketers associate environmentalism with an authoritarian big government agenda, hence tend toward climate scepticism. CAGW is most accepted Germany and Sweden and least accepted in America and Britain. US Republican, and UK Conservative, partisans are far more likely to be sceptics than are any other major cohorts in the Western world.\n\nCommunicator-in-Chief Professor Stephan Lewandowsky emits conflicting signals regarding the role conspiracist theorising plays in CAGW rejection. On one hand he states:\n\n“…the effect of conspiracy thinking on climate change attitudes pales in comparison to that of partisanship...”\n\nOn the other, he has conspiratorial thinking driving resistance to climate policies. He cites polls showing 40% of Americans think: “global warming is a myth concocted by scientists.”\n\n“…most alarming and visible are those who oppose solutions to climate change because they believe, or at least claim to believe, that anthropogenic climate change is not really happening and that climate scientists are lying and that the data is fake.”\n\n“…those who continue to deny climate science – in part by invoking conspiracy theories – have been instrumental in blocking policies intended to mitigate the effects of climate change.”\n\nCombatting global warming is Lewandowsky’s mission. He bemoans how:\n\n“…climate change conspiracy theories have driven governments to stall or even drop previous commitments to battle climate change. The democratic links between mass opinion and policy allow a conspiracy-believing public to steer policy away from addressing climate change.”\n\nDemocracy works if voters are reasonable. If voters hold irrational beliefs, like climate denial, Earth suffers.\n\nLewandowsky knows “conspiracy theorist” is an insult:\n\n“Conspiracy theory and its variants are often used as a term of derision and exclusion. Just the label conspiracy theorist and conspiracy theory neutralise and delegitimise a person or idea by signalling they are out of the bounds of rationality.”\n\nLewandowsky associates the conspiracist predisposition with persons who have experienced traumatic episodes. In fact: “conspiracy thinking could be determined by schizotypy and delusional ideation.”\n\nBecause the conspiracist worldview undergirds CAGW rejection it follows that “climate denialism” is “largely immune to evidence and reason.”\n\nLewandowsky lumps climate scepticism in with believing: a) Osama Bin Laden is alive; b) NASA faked the moon landing; c) vaccinations are a Big Pharma ruse; and d) fluoridation is a communist plot. Climate denialism is one of the most researched conspiracy genres and it is “particularly abhorred by those in academia.”\n\nLewandowsky prefers the label “denier” over “skeptic.” A sceptic questions the truthfulness of a proposition. Deniers refuse to admit the truth. Denialism is a psychological disorder that blocks out personal problems. Lewandowsky also deploys “climate contrarian” to imply sceptics are habitually disagreeable types, reflexively adopting opposing points of view.\n\nMichelle Stirling’s chronicles how inappropriate terms like “denial” and “contrarian” infiltrated climate science discourse. From the antipodes, Lewandowsky’s bemoans how sceptical concepts like “hiatus” seeped into mainstream climate literature. Lewandowsky brooks no dialogue with deniers. It pains him to see circumspect climate scientists softening their language. To discuss the sun’s relationship to global warming is to appease deniers.\n\nRolling to the frontlines of this war on denial is “inoculation theory.” This draws on the latest in educational psychology to pre-emptively “pre-bunk” denialism. Inoculation stratagems place students “on cognitive guard” by walking them through a history of “climate misinformation” prior to exposing them to sceptical arguments.\n\nThe weapon of choice for neutralising “denialism” remains the “consensus.” Climate Change Communication’s in-house consensus jock, Professor John Cook, assays to convey “the scientific concept of scientific consensus.” To Cook consensus is the “gateway belief.” Convince someone there’s scientific consensus on CAGW and belief in CAGW itself is a baby-step away.\n\nCook’s is candid about “consensus messaging” not being a scientific argument. Consensus messaging doesn’t prove CAGW; rather, it is a mental short-cut to CAGW acceptance. Consensus messaging, being an argument from authority, presses upon the imposing credibility of science for persuasive leverage. Arguments from authority “come at the expense of educational opportunities that might increase scientific literacy.” Consensus messaging restricts discussion instead of celebrating inclusive dialogue. Consensus messaging:\n\n“…is a reflection of the psychological reality that the lay public do not necessarily process evidence in the same manner or to the same depth as scientists.”\n\nClimate Change Communicators toyed with phrases like “9 out of 10 scientists” before settling on the magical 97% consensus. Boasting 100% scientific unanimity arouses suspicion. Conceding 10% disagreement invites prying. The goldilocks quantum is 97%.\n\nFriends of Science’s dissects three illustrious studies, each miraculously stumbling upon a 97% consensus.\n\nCook’s crew reviewed 12,000 scientific paper abstracts. Deploying a dated and overly-broad definition of Anthropogenic Global Warming (AGW) they concluded 97% of these papers supported the hypothesis. Papers implying CO2 was a greenhouse gas were deemed AGW supportive. Only 64 abstracts explicitly endorsed significant AGW. Moreover, AGW is not CAGW.\n\nProfessors Doran and Zimmerman sent questionnaires to 10,257 scientists. 3,146 responded. These were narrowed to 79 [self-selected] who had recently published climate papers. Of these, 76 endorsed AGW (not CAGW). Seventy-six is 97% of 79. It’s 2.4% of 3,146.\n\nFrom a list of 1,372 climate scientists Professor Anderegg’s team extracted those: “most actively publishing in the field.” CAGW endorsement was inferred from communique signings and IPCC participation etc. This legerdemain engineered a 97% consensus. Anderegg’s paper was submitted by CAGW pioneer, and founding editor of Climate Change, Stephen Schneider, who chose the paper’s reviewers and assured its top-shelf publication.\n\nWhile the 97% consensus is a trinket there’s no doubting the vast majority of actively publishing climate scientists endorse CAGW. This reflects the fact that nearly all climate funding comes from agencies committed to the Cause. As well, climate science is notorious for not using double blind peer-review procedures that ensure anonymity and fairness.\n\nIn the wake of the 2001 “hockey stick” temperature graph scandal Congress commissioned statisticians to investigate America’s paleoclimatology community. They unearthed a peer-review process run by a cozy clique of 43 professors who co-authored and reviewed each other’s publications. All had built their careers on CAGW promotion.\n\nConsensus messaging is central to the war on scepticism. A standard contention in sceptical news-pieces is: “there is no consensus.” When Communicators establish CAGW consensus, sceptics default to conspiracist theorising; discrediting themselves in the process.\n\nClimate Change Communication’s social media beat is covered by Professor Ashley Anderson. Unabashedly committed to the Cause, Anderson lauds social media as an effective organising tool for climate activists. At the same time she worries:\n\n“Social media, however, does provide space for framing climate change skeptically and activating those with a sceptical perspective of climate change.”\n\n“…care should be given to considering the extent to which social media provides a sceptical perspective on climate change and the effect this may have on people who have not yet made up their minds about the issue.”\n\nAdrian Vermeule hails from the New Jersey Vermeules; a line of scholarly officials prominent since at least the mid-1800s. Adrian is a Harvard grad who teaches at Harvard Law whilst rowing out a steady cadence of books and papers. Baptised Episcopalian, Adrian converted to Catholicism amidst tortuous soul-searching.\n\nCass Sunstein is from suburban Boston. After acquiring his Harvard law degree he clerked at the Massachusetts, and US, Supreme Courts before settling at the University of Chicago where he taught law and political science for 27 years; specialising in constitutional, administrative and environmental, law. The author of 40 books, Sunstein is arguably America’s most influential, certainly most prolific, intellectual.\n\nA Democratic stalwart, Sunstein leapt onto Obama’s bandwagon. While campaigning on Obama’s Democratic leadership bid Sunstein met then married co-campaigner, Samantha Powers (Obama’s UN Ambassador). Despite Sunstein’s Jewishness the two wed at Mary Immaculate Church, County Kerry, Ireland.\n• Believes the internet weakens society though a “cyber-balkanization” process whereby citizens self-isolate into sealed likeminded clusters;\n• Contends free speech is not an end unto itself, but a means to citizen improvement;\n• Wants government-funded “choice architects” to “nudge” citizens toward better choices;\n• Advocates for a national holiday so citizens might rejoice in the benefits of taxation; and,\n• Recommends concentrating federal government powers into the president’s hands, especially regarding regulatory affairs.\n\nPresident Obama chose Sunstein as his “Regulation Czar” (Administrator of the Office of Regulatory Affairs in the Office of Management and Budget). The nomination generated such controversy closure had to be invoked. Sunstein served as Regulation Czar from 2009 to 2012.\n\nIn Sunstein recalls how his hand-crafted Inter-Agency Working Group, used “social cost of carbon” and “endangerment” findings to ram through climate-friendly fuel economy and power plant regulations. Sunstein takes pride in how his system bypassed a disapproving Congress.\n\nPrior to his anointment as Regulation Czar, Sunstein (and Vermeule) issued an intriguing pronunciamento to peers in the Ivy League Deep State camarilla. Their paper focusses on beliefs surrounding the 9/11 terrorist attacks but lists other nefarious “conspiracy theories” including the beliefs that: a) the CIA killed JFK; b) doctors manufactured AIDS; c) the Trilateral Commission controls the international economy; and d) “that the theory of global warming is a deliberate fraud.”\n\nTo prove the existence of the latter the paper quotes Senator James Inhofe, to wit:\n\n“With all the hysteria, all the fear, all the phony science, could it be that manmade global warming is the greatest hoax ever perpetrated on the American people? I believe that it is.”\n\nIn two other locations the paper identifies CAGW rejection as false and harmful.\n\nThe authors connect conspiracy theorising to paranoia, narcissism and delusion-inducing mental illnesses. Conspiracy entrepreneurs use the internet to trigger misinformation cascades inside polarised groups who come to distrust all knowledge-producing authorities. Conspiracy theorists suffer from “crippled epistemology.” Conspiracy theories are “social errors” with troubling group-sealing qualities. The authors quote an anonymous State Department anti-disinformation official:\n\n“…a great deal of harm can result when people believe these lies then act on them.”\n\nWhile Sunstein and Vermeule argue conspiracy theories must be kept from spreading to the broader population, they stop short of advocating censorship. They recommend “counterspeech” – i.e. governments marshalling arguments to discredit conspiracy theories then hiring private parties to engage in “countermisinformation” through formal and informal communications networks; indeed:\n\n“…government might do well to maintain a more vigorous countermisinformation establishment.”\n\nGovernments should also crackdown on the “supply side” of conspiracy theorising:\n\n“Here we suggest two concrete ideas for government officials attempting to fashion a response to conspiracy theories. First, responding to more rather than fewer conspiracy theories has a kind of synergy benefit: it reduces the legitimating effect of responding to any one of them because it dilutes the contrast with rebutted theories. Second, we support a distinctive tactic for breaking up the hard core of extremists who supply conspiracy theories : cognitive of extremist groups whereby government agents or their allies (acting either virtually or in real space and either openly or anonymously) will undermine the crippled epistemology of those who subscribe to such theories. They do so by planting doubts about the theories and stylized facts that circulate within such groups, thereby introducing beneficial cognitive diversity.” (Emphasis added.)\n\nThey repeat their first recommendation: i.e. “rebutting many conspiracy theories.” As an array of conspiracy theories must be attacked; “climate denial” would surely be a target; most likely a prime target.\n\nTheir second recommendation is stressed:\n\n“Our main policy idea is that government should engage in cognitive infiltration of the groups that produce conspiracy theories.”\n\n“Rather than taking the continued existence of the hard core as a constraint, and addressing itself solely to the third party mass audience, government might undertake (legal) tactics for breaking up the tight cognitive clusters of extremist theorists, arguments and rhetoric that are produced by the hard core and reinforce it in return. One promising tactic is cognitive infiltration of extremist groups… government experts might succeed in weakening or even breaking up the ideological and epistemological complexes that constitute these networks and groups.”\n\n“ Government agents (and their allies) might enter chat rooms, online social networks, or even real-space groups and attempt to undermine percolating conspiracy theories by raising doubts about factual premises, causal logic or implications for political action .” (Emphasis added.)\n\nAgents should recruit teams from academia and the NGO community to “disable” and “debias” conspiracy theorists. Teams should begin by “introducing diversity” into the targeted “informationally isolated social networks.”\n\nCanadian enviro-supremo David Suzuki told an audience that non-believing politicians ought to be incarcerated. Later he doubled-down by suggesting Canada’s former prime minister be “thrown in jail for willful blindness” of the climate crisis.\n\nPillar of US environmentalism, Robert Kennedy Jr referred to sceptics as “treasonous” adding:\n\n“I wish there was a law we could punish them with.”\n\n“Any leaders of countries who believes that there is no climate change ought to be taken to mental confinement.”\n\n“In this article I am going to suggest that the death penalty is an appropriate punishment for influential global warming deniers.”\n\nWhile Parncutt might not be renowned within the movement; Al Gore, James Hansen, Google CEO Eric Schmidt, and filmmaker James Cameron certainly are. Each has called for the criminalisation and/or punishment of climate sceptics.\n\nSunstein wrote in 2008, then revised it in 2010. In 2009 he began chairing an Inter-Agency Working Group comprised of senior representatives from a dozen climate-involved federal agencies. Such people control immense resources and mingle furtively with executives of Big Green. Sunstein lectured this audience about programs aimed at infiltrating and neutralising the climate sceptic community.\n\nSee footnotes and references below:\n\nThe Green Swastika: Environmentalism in the Third Reich\n\nFrom Malthus to Mifepristone: A Primer on the Population Control Movement\n\nAnderson, Ashley. Effects of Social Media Use on Climate Change Opinion, Knowledge and Behaviour; March 2017.\n\nFerraras, Jesse. David Suzuki says Harper should be jailed over his climate policy; Huffington Post Canada, February 2, 2016.\n\nFriends of Science Society, 97% Consensus? No! Global Warming Math Myths and Social Proofs; February 17, 2014, Calgary, Canada.\n\nLewandowsky, Oreskes et al. Seepage: Climate change denial and its effect on the scientific community; Elsevier 2015.\n\nLyons, Kate. World Leaders who deny climate change should go to mental hospital; The Guardian, August 31, 2018.\n\nStirling, Michelle. Infiltration: The effect of condoning psychologically intimidating language in a climate science peer reviewed journal: A Case Study; Friends of Science, Calgary, Canada, 2015.\n\nSunstein, Cass. Vermeule, Adrian. Conspiracy Theories: Causes and Cures; Harvard Public Law Working Paper No. 08-03, January 17, 2008 (last revised January 18, 2010).", "opengraph": {"locale": "en_US", "site_name": "Friends of Science Calgary | The Sun is the main driver of climate change. Not you. Not carbon dioxide.", "type": "article", "title": "climate sceptics vs intel-ops | Friends of Science Calgary", "description": "Climate of Conspiracy: Are climate sceptics targets of counter-intelligence programs? A review of the Oxford Encyclopedia of Climate Communication.", "url": "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/", "article:published_time": "2018-12-09T18:26:45+00:00", "article:modified_time": "2018-12-09T18:26:45+00:00", "article:publisher": "https://facebook.com/FoSClimateEd"}, "tags": ["oil and gas", "decarbonisation", "Oxford Encyclopedia of Climate Communication", "sceptics", "counter-intelligence", "Richard Parncutt", "William Kay", "geopolitics", "Stephan Lewandowsky", "climate crimes", "deniers", "ecofascism", "CAGW", "skeptics", "David Suzuki", "psychology"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/7DimL5e19iw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/7DimL5e19iw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/nEZnGUpTO1U?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/nEZnGUpTO1U?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["http://oxfordre.com/climatescience/page/climate-change-communication/", "https://friendsofscience.org/assets/documents/Infiltration2015.pdf", "http://ecofascism.com/", "https://www.amazon.ca/Green-Swastika-Environmentalism-Third-Reich-ebook/dp/B07K6Y5Y9B/ref=sr_1_fkmr0_1?s=books&ie=UTF8&qid=1541518195&sr=1-1-fkmr0&keywords=the+green+swastika+william+key", "https://www.amazon.ca/Malthus-Mifepristone-Population-Control-Movement-ebook/dp/B07DNWS456", "https://www.washingtontimes.com/news/2014/sep/23/robert-kennedy-jr-we-need-laws-punish-global-warmi/", "https://www.huffingtonpost.ca/2016/02/02/david-suzuki-stephen-harper-jailed-climate_n_9143278.html", "https://friendsofscience.org/assets/documents/97_Consensus_Myth.pdf", "https://www.theguardian.com/environment/2018/aug/31/world-leaders-who-deny-climate-change-should-go-to-mental-hospital-samoan-pm", "http://www.nationalpost.com/Jail+politicians+ignore+climate+science+Suzuki/290513/story.html", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1084585", "https://tallbloke.wordpress.com/2012/12/24/prof-richard-parncutt-death-penalty-for-global-warming-deniers/", "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/?share=twitter", "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/?share=facebook", "https://blog.friendsofscience.org/2018/12/09/climate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Climate%20of%20Conspiracy%3A%20%20Are%20climate%20sceptics%20targets%20of%20counter-intelligence%20programs%3F&body=https%3A%2F%2Fblog.friendsofscience.org%2F2018%2F12%2F09%2Fclimate-of-conspiracy-are-climate-sceptics-targets-of-counter-intelligence-programs%2F&share=email"], "authors": [], "publish_date": "2018-12-09T18:26:45+00:00"}