{"result_id": "125014", "URL": "https://friendsofscience.org/fos-extracts-2020.html", "timestamp": "2023-04-25 15:09:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/assets/images/svg/flavicon.ico", "canonical": "https://friendsofscience.org/fos-extracts-2020.html", "encoding": null}, "image": null, "domain": "friendsofscience.org", "title": "FoS Extracts - 2020 | Friends of Science", "cleaned_text": "The second part of the Friends of Science Society 's 17th annual climate science event will take place online on Tuesday, January 19, 2021 at 7 pm Mountain Standard Time (UTC - 7 hours). The event will feature a recorded presentation, The Most Important Reasons Why There is No Climate Emergency \u009d, by Dr. Roy W. Spencer, Principal Research Scientist at the University of Alabama in Huntsville. After the presentation Dr. Spencer will be available for a live online Q&A. For details on how to access this event, please see this link.\n\nSpeaking at the virtual Climate Ambition Summit on December 12 to mark the 5th anniversary of the Paris Agreement, UN Secretary-General Antonio Guterres implored: \"Today, I call on all leaders worldwide to declare a State of Climate Emergency in their countries until carbon neutrality is reached.\" Specifically, he called for cuts in global emissions by 2030 to 45% below 2010 levels, with these cuts reflected in the Nationally Determined Contributions that Agreement signatories are obliged to submit before COP26 in Glasgow (November 2021). Mr. Guterres claimed that renewable energy is getting less expensive each day, but data from California, Germany and the UK show that excessive dependance on wind and solar has caused increased electricity prices.\n\nA \"green\" recovery from Covid-19, advocated by Mr. Guterres, the World Economic Forum and Justin Trudeau, is unlikely to find favor in developing countries like India. That country's economic survey of 2018-2019 states that coal will continue to remain an important source of energy. Prime Minister Modi has refused to set a deadline for India's proposed 30-35% reduction in emissions.\n\nMore importantly, Mr. Guterres' call is based on predictions of future temperatures by computer models hypersensitive to CO emissions. These models overstate atmospheric warming by 4-5 times compared to observations.\n\nWe're Saved! New Zealand Just Declared a Climate Emergency\n\nOn December 2 New Zealand's Prime Minister Jacinda Ardern called climate change \"one of the greatest challenges of our time,\" declared a climate emergency and pledged a carbon neutral government by 2025. New Zealand does not manufacture much, thanks to decades of radical environmentalism, so despite the pledge, they will be importing lots of carbon-tainted manufactured goods in 2025.\n\nGreta Thunberg was unimpressed, slamming New Zealand's \"so-called\" climate emergency declaration. In a tweet the 17-year-old argued that the country's government has committed to reducing less than 1% of the nation's emissions by 2025. In response Mr. Ardern defended her country's climate policies, adding that the emergency declaration covered only a portion of New Zealand's climate goals.\n\nA new report from the Global Warming Policy Foundation, The Red and the Green - China's Useful Idiots, finds that Beijing has co-opted western environmental groups through a combination of sticks and carrots. The author, Patricia Adams, is an economist, the executive director of Probe International and an authority on China's environmental policy.\n\nAs with other foreign organizations permitted to operate in the country, green groups must be formally sponsored by a designated state agency or government department and agree to close supervision by the Ministry of Public Security. Failure to comply with the NGO law can result in seizure of assets, detention of staff, and a ban on future efforts to work in the country for five years, all without any recourse to appeal.\n\nThe green NGOs are lavishly funded by charitable foundations such as San Francisco-based Energy Foundation China, Energy Foundation China, the William and Flora Hewlett Foundation, the David and Lucile Packard Foundation, the John D. and Catherine T. MacArthur Foundation. In return the environmentalists publish glowing reports of China's leadership and divert attention from the regime's unsavory actions and its reliance on fossil fuels for 86% of the country's primary energy consumption.\n\nNoting the success of the Trump administration's Operation Warp Speed to develop Covid-19 vaccines, cleantech entrepreneur Wal van Lierop wants to do the same for the climate by locking in the lifestyle changes brought about by the pandemic. Specifically, he proposes that office workers continue working from home while getting people safely back onto public transport. Next, Mr. van Lierop says governments should finance cleantech disrupters developing technologies for nuclear fusion (not fission), green hydrogen and carbon capture, utilization and storage. In case lifestyle changes and technology aren't enough, he proposes studying geoengineering options as an insurance policy.\n\nUS President-elect Joe Biden wants the electric grid of the United States to be powered solely by energy sources that do not emit CO by 2035. Overhauling the entire electric grid is both dangerous and unbelievably expensive, but many people believe that supplying the grid with wind and solar power will actually reduce costs. One often overlooked aspect is the necessary backup by existing or new power stations or storage facilities that can rapidly change output to compensate for the fluctuating supplies from wind and solar. The cost of this extra capacity and storage kills the economics of these renewables.\n\nAnother problem is the need for inertia (flywheel effect from the mass of rotating iron and copper in conventional generators) to stabilize the system frequency and provide voltage support. Wind and solar generators cannot provide this inertia.\n\nThe reality is that the Biden ambitions for large-scale, low-cost wind and/or solar power cannot be met by 2035, or even 2050, due to huge numbers of wind turbines, solar farms and transmission capacity needed. The power disaster unfolding in California gives a good preview of what's in store for the US if the Biden plan succeeds.\n\nNew York Can't Buy Its Way out of Blackouts\n\nNew York City is buying the world's biggest utility-scale battery system, with an energy capacity of 400 MWh, easily beating the current 129 MWh leader in Australia. The city's director of sustainability gushed: \"Expanding battery storage is a critical part of how we advance momentum to confront the climate emergency while meeting the energy needs of all New Yorkers. Today 's announcement demonstrates how we can deliver this need at significant scale.\" The president of the city's electric utility, Con Edison, affirmed: \"Utility scale battery storage will play a vital role in New York 's clean energy future, especially in New York City where it will help to maximize the benefit of the wind power being developed offshore.\"\n\nNYC's current peak power demand of 32,000 MW typically occurs during summer heat waves, usually lasting for a week, throughout which the winds are stagnant. In that situation the amount of energy storage required would be 32,000 MW x 168 hours = 5,376,000 MWh, or 13,440 times the capacity of the proposed 400 MWh battery. In fact, the 400 MWh battery could supply NYC for 400 / 32,000 x 3600 = 45 seconds.\n\nThe International Monetary Fund, used to be a reliable source of sound economic advice. But, under its former (Christine Lagarde) and current (Kristalina Georgieva) managing directors the IMF has traded economic integrity for green wokery, giving governments license to push radical green policies in the false belief that there are few or no downsides. Last July Ms. Georgieva told an interviewer that the pandemic presents a once-in-a-lifetime opportunity to be part of a transformation necessary for human survival from \"the climate disaster.\" In its recent World Economic Outlook, the IMF implied that potentially catastrophic climate change can be avoided with a green fiscal stimulus amounting to 1 percent of GDP and carbon taxes of between $10 to $40 a tonne in 2030.\n\nRenewable energy is more labor intensive than energy from fossil fuels, which the IMF acknowledges. Yet it implies that renewables are less capital intensive, when the opposite is true, because of the need for backup power generation. In effect the IMF ignores the fact that economic progress and rising living standards have come from capitalism's ability to do more with less.\n\nOn December 11 the EU's 27 member states set aside their differences over renewable vs \"low-carbon\" hydrogen in order to \"rapidly upscale the market for hydrogen at EU level.\" Renewable (\"green\") hydrogen is produced by electrolysis of water using wind or solar generated electricity. The low-carbon (\"blue\") kind is made from natural gas (with carbon capture and storage) or nuclear power. The European Council issued its conclusions Towards a hydrogen market for Europe which emphasizes green hydrogen as the EU moves to climate neutrality, but acknowledging a role for ramping up production of the blue kind. Besides increasing supply, the document foresees repurposing existing interconnected European natural gas networks and storage infrastructure, to potentially provide the basis for a trans-European hydrogen infrastructure.\n\nThe Friends of Science Society 's 17th annual climate science event will take place online on Tuesday, December 8, 2020 at 7 pm Mountain Standard Time (UTC - 7 hours). The event will feature a recorded presentation, Climate Activism: Undermining Free Speech, Free Thought & Free Choice, by Donna Laframboise, former Vice President of the Canadian Civil Liberties Association. After the presentation Ms. Laframboise will be available for a live online Q&A. For details on how to access this event, please see this link.\n\nRoss McKitrick: Ottawa 's Clean Fuel Standard Is Overkill in Your Tank\n\nThe objective of the Clean Fuel Standard is \"to achieve up to 30 million tonnes of annual reductions in greenhouse gas emissions by 2030,\" It is complementary to other policies and expenditures under the Pan-Canadian Framework on Clean Growth and Climate Change, such as the CO tax. The government is currently developing regulations for liquid fuels first, to be followed by gaseous and solid fuels. The proposed liquid fuel regulations are to be published in the fall of 2020, finalized in late 2021 and come into force in 2022.\n\nIn a Financial Post article Ross McKitrick describes a cost-benefit analysis of the CFS by LFX Associates. The CFS would require blending of all fossil fuels with biofuels and other low-carbon sources to slightly reduce the amount of CO produced per unit of fuel consumed. The LFX study found that even using the maximum estimated social cost of carbon, Canadian businesses will pay $6 in CFS compliance costs for every $1 of environmental benefits achieved, will lead to a job loss of approximately 30,000 and put $22 billion of capital at risk of leaving the country. Any emission reduction effects would be completely offset by an increase in the size of the population.\n\nAs Dr. McKitrick argues: \"The CFS is driven by unthinking adherence to a net-zero mantra that says all emissions must be eliminated regardless of cost.\"\n\nCanada Sets Out to Enshrine 2050 Net Zero Emissions in Law\n\nPrime Minister Justin Trudeau has introduced a bill called the Canadian Net-Zero Emissions Accountability Act, that establishes a legally-binding process to set five-year emission reduction targets from 2030 onward and develop a credible plan to meet each commitment with the ultimate goal of achieving net-zero emissions by 2050. Under the Act, if Canada fails to meet a target, the government will have to table a report in Parliament about what went wrong and what is being done to get back on track ï¼\u008d the \"legally-binding\" part of the legislation. There are no penalties to any future government for failure. As Mr. Trudeau said in a press conference: \"There is a tremendous amount of transparency and accountability required, but ultimately the accountability of government actions or inactions is from Canadians themselves.\"\n\nEnvironmental groups and two opposition parties don't want to wait until 2030 and are pushing for a 2025 target as well. However, the PM dodged questions on why the bill doesn't include a target for 2025. (Likely reason: it would mean having to announce expensive and unpopular measures to voters before the next election.)\n\nIn George Orwell 's Nineteen Eighty-Four, Newspeak, the official language of the English Socialist Party, is the deliberate corruption of English, a multi-generational project intended to render independent thought impossible by about 2050. \u009d Appropriately, that year is a key date for the UN 's Global Governance \u009d agenda, with Climate Governance \u009d becoming the fourth pillar of the UN 's mandate (after Peace & Security, Development and Human Rights.) And thus, the UN 's call for a doubling down of ambitions \u009d under the Paris Agreement in order to make the world carbon neutral, or net zero, by 2050.\n\nIn this context, one of the new weasel words is the benign sounding sustainable \u009d, which now means bureaucratically controlled and NGO-enforced within a UN-based socialist agenda. \u009d Sustainable development is development retarded by top-down control, compromised by a long list of social policy objectives, from gender equity to responsible consumption. \u009d Sustainable finance, championed by Mark Carney, is another new UN term and means stopping the financing of fossil fuels by browbeating banks and investors, and rigging the regulatory process. In the wake of the Covid pandemic there are calls for the recovery to be resilient \u009d, which means forcing on our economies more expensive, less reliable and less flexible energy sources like wind and solar. In fact, this promotes the first energy transition \u009d in history that involves moving backwards ï¼\u008d a key part of the progressive \u009d agenda.\n\nAs in Nineteen Eighty-Four, the UN 's Agenda 21 demands that children be indoctrinated. An entire generation of children has been told what to believe on environmental issues and forced to watch Al Gore 's An Inconvenient Truth. One of the most thoroughly indoctrinated of them, a Swedish teenager, was elevated to the podium to tell the world: People are suffering. People are dying. Entire ecosystems are collapsing. We are in the beginning of a mass extinction, and all you can talk about is money and fairy tales of eternal economic growth. How dare you! \u009d\n\nWill Trump Send the Paris Agreement to the US Senate?\n\nIn November 4, 2017 President Trump formally announced withdrawal of the US from the Paris Agreement, which took effect three years later on November 4, 2020. President-elect Joe Biden has promised to reverse that withdrawal and rejoin the Agreement that same way that Mr. Trump withdrew ï¼\u008d by a simple letter to the UN.\n\nThe Wall Street Journal has published a call for President Trump to submit the Agreement to the US Senate for ratification as a treaty, where it would almost certainly fail to get the required two-thirds majority. This would mean that the Agreement would have no legal effect in the US, thus preventing any green group from trying to get a federal court to enforce it.\n\nFormer Secretary of State John Kerry is to be appointed into a new role as climate envoy for the incoming Biden administration. After the announcement he gave a short speech in which he pointed out that the US is responsible for only 13% of global emissions and that the Paris Agreement is not enough to solve the \"climate crisis.\" Mr. Kerry called on all nations to \"raise their ambition\" to avoid failing at the Glasgow climate summit a year from now, stating with \"failure is not an option.\"\n\nMr. Kerry's message was apparently aimed at China, which has enhanced its negotiating stance by pledging to achieve carbon neutrality by 2060. However, a article in the Wall Street Journal warned that China will be happy to make future promises on climate in return for American acquiescence on China's security priorities regarding Taiwan and the South China Sea. A Forbes article points out that American diplomacy will be bifurcated by having two de facto secretaries of state: one focused on climate and the other on non-climate policies.\n\nNaming Mr. Kerry as a climate czar was not enough for activists, who want incoming President Joe Biden to declare an environmental national emergency. This would give him the authority to circumvent Congress, fund clean energy projects, shut down crude oil exports, suspend offshore drilling and curtail movement of fossil fuels on pipelines, trains and ships. The Biden transition team avoided directly addressing the question of a climate emergency, though their policy platform mentions fighting the climate crisis while creating millions of jobs.\n\nThe European Commission is proposing a 55% emissions cut by 2030 as part of the European Green Deal, but Poland, supported by other Eastern European countries, is digging in its heels by demanding further analysis, including \"a fair distribution of costs and benefits\" during the transition. As a result, EU leaders put off a decision on the emissions goal to December.\n\nBusiness groups are also questioning the 2030 target, in particular the \"value and credibility\" of the economic analysis. BusinessEurope submitted its concerns in a document pushing back against the Commission's assertion that tougher climate policies are the bloc 's new growth strategy\" and critiquing the non-inclusion of Covid-19 considerations, impacts on industry and lack of transparency in the economic models.\n\nIn Germany plans for wind and solar expansion over the next decade revealed divisions within the ruling coalition. The environment minister is upset over a bill before its Parliament that would cut Germany's 2030 emissions by 65% (not just 55%) as part of the EU's burden-sharing rules linked to the size of member states' economies. The economy and energy minister frets over the costs of the green power targets.\n\nThe German economy and energy minister is threatening the country's wind energy potential by introducing a minimum distance of 1,000 m between wind turbines and buildings ï¼\u008d to avoid citizen protests against new wind projects. Currently 0.9% of Germany's land is approved for placement of wind turbines, theoretically allowing installation of 81 GW of wind energy. The 1,000 m rule would cut the potential to 43-63 GW. In addition, it would restrict the replacement of old turbines. Other European states also face raging debates over the minimum distance between turbines and housing areas.\n\nHistoric ' Court Ruling Will Force France To Justify Its Climate Target\n\nIn late November the supreme administrative court in France issued what climate campaigners called a \"historic decision. In this judgement the Conseil d' ‰tat found that, while France had committed itself under the Paris Agreement to reduce emissions by 40% below 1990 levels, it has regularly exceeded its \"carbon budgets,\" and last April the government postponed most of its emissions-reduction efforts. Before making its final ruling on the case the Conseil d' ‰tat gave the government three months to justify how its refusal to take additional measures is compatible with meeting the 2030 target.\n\nPrager U produced this 5:35 video narrated by Mark Mills of the Manhattan Institute, who punctures environmentalists' claims that all our energy needs can be supplied by building enough wind and solar farms, together with batteries to back them up when the wind doesn't blow and the sun doesn't shine. Alter 20 years and billions in subsidies wind and solar still supply only 3% of the world's energy. It would take 500 years production from Tesla's Nevada battery factory, the world's largest, to make enough batteries to store one day's worth of US electricity needs.\n\nLike all machines, wind turbines, solar panels and batteries are built from non-renewable materials requiring vast amounts of mining and processing.\n\nIn addition, the world will need 200% to 2,200% more mining of rare earth minerals. A \"gold rush\" for these minerals will take miners into remote wilderness areas that have so far maintained their biodiversity because they haven't yet been disturbed. The mining, industrial processing, refining of the materials and building the final products require massive amounts of conventional energy. Then there's the problem of waste, as turbines, solar panels and batteries have relatively short lives of about 20 years (gas turbines last twice as long.)\n\nBefore launching history's biggest increase in mining, we might want to consider our almost inexhaustible supply of hydrocarbons. For example, it costs as much to drill one oil well as one wind turbine, but the oil well produces 10 barrels/hour, while the wind turbine can produce the equivalent of 1 barrel/hour. It cost $0.50 to store a barrel of oil, but $200 of batteries for the turbine.\n\nElectric Cars: Good for Wealthy Virtue Signallers, but a Dreadful Way to Save the Planet\n\nBj ¸rn Lomborg comments recent announcements banning the sale of gasoline/diesel powered cars in the UK from 2030 and in Quebec from 2035. The leaders of these two jurisdictions are just following other political leaders in promising lavish carrots to energize the market, along with sticks to outlaw conventionally fuelled cars. While electric cars are fun, almost everywhere they have a higher lifetime cost, thus requiring large subsidies. In the US, despite a $10,000 subsidy per vehicle, only 0.5% of its cars are electric, and almost all of the government support goes to the rich. Also, 90% of electric car owners already use a gasoline vehicle for long trips and save the EV for short trips and virtue signalling.\n\nMaking an EV battery can produce as much as a quarter of the greenhouse gases emitted by a gasoline-powered car over its lifetime. Then the battery is usually recharged from electricity that is significantly fossil fuel based (Quebec being an exception.) Together, over its first 60,000 km an electric car produces more CO than a gasoline powered one. The International Energy Agency estimates that an EV will save six tonnes of CO over its lifetime.\n\nMr. Lomborg 's conclusions: (1) Politicians stop writing big cheques in the mistaken belief that EVs are a major climate solution; (2) Hybrid cars save about the same amount of CO as EVs over their lifetime, don't require subsidies, induce no range anxiety and refuel quickly; (3) To reduce CO emissions it's better to focus on the big emitters.\n\n\n\nOn October 27 Federal Court Justice Michael Manson dismissed a lawsuit brought by 15 young Canadians who claimed that the federal government was violating their charter rights by failing to act on climate change. Judge Manson ruled that the network of government actions that contribute to climate change is too broad for the court to grapple with, and the court has no role in reviewing the country's overall approach to climate change. However, the judge's ruling found that children and youth are disproportionately affected by the effects of climate change. This case was supported by the David Suzuki Foundation, US-based non-profit group Our Children 's Trust and the Pacific Centre for Environmental Law and Litigation in Victoria. The plaintiffs plan to appeal.\n\nThis youth climate lawsuit, La Rose v. Her Majesty the Queen, is the Canadian version of the landmark American case Juliana v. United States. In both cases young people are challenging their national governments' responses to climate change and actions supporting fossil fuels, claiming that the youths' constitutional rights are being violated by climate change. Last January a federal appeals court threw out the Juliana suit, with a ruling that stated while the plaintiffs \"have made a compelling case that action is needed\", climate change is not an issue for the courts. Currently the Juliana plaintiffs are awaiting a ruling on their petition for an en banc rehearing by the Ninth Circuit Court of Appeals.\n\nHow Dare You! Is the title of a new book by Peter Foster, an editor and commentator for the Financial Post, who has assembled two decades of politically-incorrect columns dealing with the climate issue. The book skewers Al Gore, David Suzuki, Tim Flannery, Maurice Strong, Mark Carney, Justin Trudeau, Klaus Schwab, Barack Obama, Bill Gates, Naomi Klein, Bill McKibben, the Pope and Greta Thunberg. How Dare You! Is published by the Global Warming Policy Forum which has embellished it with a collection of cutting illustrations by British cartoonist Josh.\n\nEuropean Science Academies: Economic Growth Is Bad for the Climate\n\nGreta Thunberg's message to the UN last year about \"the fairy tale of eternal economic growth\" has found support in Europe's main scientific body, the European Academies Science Advisory Council (which comprises of the National Academies of Science of all EU Member States, Norway, Switzerland and UK), The SAC put out a press release stating: Generation Greta gets it. Our focus should be on well-being and welfare, but our economic system puts all focus on growth and GDP which adds fuel to the climate and biodiversity crises. \u009d The SAC's recommendations:\n• Overcome the vested interests of the \"brown economy.\"\n• Steer our economic system to think long term.\n• Engage industry and finance sectors to drive the changes and engage the public through new approaches.\n• Grasp the opportunities now of the post-covid and Green Deal stimuli to start to fix the system.\n\nThe Green New Deal Can 't Break The Laws Of Physics\n\nThe Green New Deal has at its core an impossibility in physics: the idea of free \u009d and renewable \u009d energy. The physics of all energy sources, whether wind and sun or oil and gas, share the same core features. Though all exist in nature for free, one has to pay landowners to access locations to the sources. One has to purchase machines built from materials extracted from the earth to convert the natural energy sources into a form delivered to people. Since machines wear out, there's nothing \"renewable\" about them.\n\nThe Green New Deal's elephant in the room is the staggering quantity of stuff that needs to be mined in order to build all the green machines. A recent report for the Manhattan Institute took a look at the physical realities of electric vehicles. Fabricating a single EV battery, weighing 1,000 lb., requires digging up 500,000 lb. of materials roughly ten times the amount of materials (liquids) used by a standard car over its operating life. The global push for EVs will drive a 200% to 8,000% increase in demand for \"critical\" minerals, and barely 10% of the world's petroleum will be eliminated.\n\nThe materials for EVs will be dwarfed by the push for grid-scale batteries to make wind and solar usefully reliable. The solar panels and wind turbines require ten times the amount of primary materials to produce the same energy output as hydrocarbon machines. All of this means a 20 to 100-fold increase in land use to use green machines to replace hydrocarbons, and all of this to be funded by trillions of dollars in subsidies through increased costs and taxes for consumers.\n\nIn a proposed amendment to its 2021 budget the French government plans to renege on about 800 solar power contracts that it signed between 2006 and 2010, saying that they cost the state ‚ 400 millionï¼\u008d ‚ 600 million per year. The amendment mentions \"excessive profitability\" which officials say means margins of more than 20%. Tariffs will be cut so that the return on fixed capital . . . does not exceed a reasonable level given the inherent risks of the investment \u009d.\n\nThe CEO of the French solar technical advisory KilowattSol said: \"If approved by the members of parliament, this measure would mean the immediate termination of contracts for the majority of the 800 impacted PV plants, This decision would force them to file for bankruptcy, as these plants were built with non-recourse financing.\" A group of 300 companies from the renewable energy sector said: \"The implementation of this measure would mean months of major economic uncertainty for small and medium-sized enterprises and bigger companies that are engaged in the fight against the Covid-19 crisis and working on the development of new renewable energy projects. The energy transition will not happen without a stable framework conducive to investment.\"\n\nDeutsche Bank has released a report What we must do to rebuild that presents the bank's ideas (some of which it admits may seem radical) for how economies, businesses and societies should rebuild from the pandemic. Some of the key recommendations:\n• To save capitalism we must help the young by redistributing from the old to the young \"in ways we have not yet considered.\" These include a tax on primary residences, additional taxes on financial assets and capital gains, a \"super tax\" on stocks to \"help fund massive investment in climate change.\" Failure to do so would mean that, when the young people have the votes to take power, they will forcibly redistribute in blunt ways.\n• Rebuild better economies and businesses by directing firms to produce less, avoid waste and build products that \"last forever.\" This includes companies ticking all the boxes in their ESG reports.\n• People working from home have benefitted from the pandemic and should pay a 5% tax to fund subsidies to lower-paid workers who can't work from home. Using the US example on p. 33 and an average annual salary of $55,000, the daily WFH tax would be $10.58, which would raise $48.7 billion annually, to be distributed as a wage top-up to 29.2 million low-income workers.\n• China must further develop its green finance system and infrastructure to support a transition to a green economy in the aftermath of the covid crisis. The country currently lacks an emissions trading market.\n• Companies and governments should work together to create a hydrogen economy, starting with \"green\" hydrogen from natural gas (while capturing and storing the CO emissions) and eventually transitioning with much subsidy to the more expensive \"blue\" kind (electrolysis of water using wind and/or solar electricity.)\n• Have an honest discussion on a \"climate-neutral\" EU by 2050, because the bloc's ambitious Green Deal cannot achieve that goal with existing technologies, and various new technologies are politically unacceptable in the current environment Some of the inconvenient truths: global energy demand will continue to grow; fossil fuels will remain the most important fuel source for now; wind and solar are far from being the main pillar of global energy supply; nuclear energy faces difficult political acceptance; carbon capture and storage is unpopular in the EU. To achieve climate neutrality, a certain degree of \"eco-dictatorship\" will be necessary.\n\nAge of Unreason: How fear and ignorance drives the green doomsday cult\n\nPrager University has made a new documentary called the Religion of Green that looks at how the environmental movement uses fear, doctrine, superstition, apocalypse and priesthood. The 18-minute video begins with how people needing something to believe in have shifted from a belief in God to a belief in Nature. The movement requires submission to the Agenda of catastrophic climate change, using the powerful motivator of fear. After Communism became discredited, environmentalism took over that role, with its practitioners taking on the messianic role of saving the planet. The religion requires submission to one government, fewer humans on the planet (\"human beings are a cancer on the \"earth\"). Doomsday cultists have predicted the end of the world through recorded history, and have always been wrong, just as wrong as the environmental alarmists are today.\n\nUsing an electric car to commute to work and then slow charging it during the off-peak hours overnight makes economic sense for the owner. It also means that the existing power lines and transformers can handle the charging load without upgrades. However, people travelling are not going to wait 8 hours for a charge every 250 miles (providing they don't turn on the heater) and will want something faster. A 500-kW charger will charge a car in 10 minutes, but it will shorten battery life compared to trickle charging. A more modest 50 kW level 2 charger will charge in 90 minutes, if there's nobody waiting in front of you.\n\nA charging station with eight 500-kW chargers means a total load of 4 MW. This requires a substation at a cost of $1 million, not counting the cost of upgrading the transmission lines leading to the substation. If a power plant is required, it can't be intermittent wind or solar. To supply transport trucks requires a 10 MW charging station. While these 18 wheelers can go 500 miles on a charge, their battery packs weight 5 tons, which along with their normal loads, will test the highway legal \"heavy haul\" limits.\n\nEvery year the International Energy Agency publishes its World Energy Outlook that tries to spin a bright outlook for wind and solar using upbeat language, dodgy statistics and fantasy scenarios. The 2020 WEO was complicated by the covid lockdowns, which curtailed energy demand (overall global energy demand down by 5% in 2020, energy-related CO emissions down by 7%, oil demand by 8% and coal by 7%.) There was a slight rise in the contribution of renewables in 2020. However, as Peter Foster points out, fossil fuels are down because of market conditions, whereas wind and solar use is dictated by government mandates and taxpayer subsidies\n\nWatch Out for the Carbon Tariff\n\nUS presidential candidate Joe Biden's platform includes the following statement: \"As the US takes steps to make domestic polluters bear the full cost of their carbon pollution, the Biden administration will impose carbon adjustment fees or quotas on carbon-intensive goods from countries that are failing to meet their climate and environmental obligations.\" There is a logic to this argument: Domestic businesses facing higher costs as a result of US carbon policies are susceptible to import competition from countries with less stringent policies, and therefore require protection.\n\nBut, as Jack Mintz points out, although there is a theoretical case for carbon tariffs (or \"adjustments\") there is a danger they will be used as green protectionism as governments seek to help politically important domestic industries. The net result will be a shrinking of global trade.\n\nThere's good news about this year's wheat crop coming from around the world. Grain Central reports that improved late-season yield prospects in Europe and Australia have increased the estimate for global wheat production by 5.9 million tonnes, despite a 1 Mt decline in Canada and Argentina. In five years, Sudan has increased its wheat harvest from 472,000 to 1,115,000 tonnes, setting the nation on a path to becoming Africa's next wheat-sourcing breadbasket. Australia is preparing for a bumper harvest as rain boosts winter crops in New South Wales by 300%.\n\nNot everyone wants to believe that food production is getting better. Climate Realism refers to a Google-promoted article titled Climate change will continue to widen gaps in food security, new study finds. But this study, which is based on modelling and not observation, is contradicted by hard data from the UN Food and Agricultural Organization's report of August 10. The FAO report includes a plot showing ten years of growing cereal production and stocks. According to Climate Realism: \"Global warming lengthens growing seasons, reduces frost events, and makes more land suitable for crop production. Also, carbon dioxide is an aerial fertilizer for plant life. These factors have resulted in the largest decline in hunger, malnutrition, and starvation in human history Climate change is helping reduce world hunger, not increasing food insecurity.\"\n\nMembers of the European Parliament voted nearly ‚ 400 billion for the EU's Common Agricultural Policy, which will shape farming in the bloc for the next seven years. However, a deal by the largest groups in the Parliament involved lowering environmental conditions attached to the policy. In particular, MEPs voted against a 30% emissions reduction for agriculture, as well as against cutting subsidies for factory farming. A ban on converting grasslands in biodiversity-rich nature-protected areas was lifted, so more could be turned into grain fields.\n\nGreenpeace's EU agricultural policy director said: MEPs have signed a death sentence for nature, climate and small farms, which will keep disappearing at an alarming rate. For over 60 years, European farm policy has been blind to farming 's impact on nature, rewarding farmers for producing more or expanding their farms. The EU Parliament is willfully continuing that destruction while scientists warn that farming must change to tackle the climate crisis and protect nature.\"\n\nEU Leaders Divided Over New Climate Goals For 2030\n\nA meeting of European leaders on October 15 agreed to raise the bloc's climate ambition above the existing target, but stopped short of committing to reduce emissions by at least 55% below 1990 levels by 2030. The leaders will try to find consensus during another meeting scheduled for December, ahead of the adoption of the first-ever European climate law.\n\nAt the Conservative Party's virtual conference on October 6 Prime Minister Boris Johnson pledged that offshore wind farms will generate enough electricity to power every home in the UK by 2030. He also announced £160 million to upgrade ports and factories for building turbines and stated: \"Your kettle, your washing machine, your cooker, your heating, your plug-in electric vehicle ï¼\u008d the whole lot of them will get their juice cleanly and without guilt from the breezes that blow around these islands.\"\n\nUniversity of Edinburgh Professor Gordon Hughes, who has completed one of the largest ever studies on the economics of wind power, immediately cast cold water on Mr. Johnson's promise, which would quadruple offshore wind capacity to 40 GW in a decade. Said Prof. Hughes: \"Any ambitious target is going to be expensive, because the system cannot deliver very large increases in capacity in a short period of time. It is like building the Olympics or High-Speed rail the costs just go out of control. Nobody knows exactly how much it will add to bills, because we are yet to see the detail of how it will be paid for, but I find it very unlikely that it would mean less than a doubling in household bills.\"\n\nProf Hughes estimated that Mr Johnson 's pledge will come with a construction price tag of around £150 billion, including improving the network capacity of the grid, which will have to be paid for over the roughly 15-year lifespan of the project.\n\nThe UK has more offshore wind capacity than any other country, and wind power sometimes supplies 60% of the power going into the grid. However, on October 14 the country's National Grid warned of a forecasted \"unusually low wind output\" and a series of power plant outages that squeeze the network. This is the second warning from the grid operator in a month.\n\nThe Global Warming Policy Foundation has published a report, The Brink of Darkness ï¼\u008d Britain's Fragile Power Grid that examines the history of rising renewables costs since 2002, together with a focus on 2020 experience. It recommends that the government suspend renewables support and adopt a cost-minimization policy focused on nuclear and natural gas.\n\nIn 2015 the Dutch Supreme Court ruled that that the Netherlands had until the end of 2020 to reduce CO emissions by 25%, and an appeal of this decision was upheld in 2019. This Urgenda decision concluded that climate change poses an immediate threat to the right to life, which the Netherlands has a legal obligation to redress under the European Convention on Human Rights. Canadian law professor Karinne Lantz argues that Urgenda could prove influential in Canada, where there are now at least four pending climate cases.\n\nIt will be interesting to see what happens if the Netherlands fails to meet its court-ordered emissions reduction by the end of this year. In 2019 thousands of Dutch farmers reacted to a government demand to cull their herds to help the country nitrogen emission targets by shutting down highways with thousands of tractors.\n\nClimate Science and the US Supreme Court\n\nDuring the confirmation hearing on her nomination to the Supreme Court, Justice Amy Coney Barrett fielded questions regarding her views on climate change. Some of her statements: \"I will not express a view on a matter of public policy, especially one that is politically controversial I don 't think my views on climate change or global warming are relevant to the job I would do as a judge. Nor do I feel like I have views that are informed enough I 'm certainly not a scientist. I mean, I 've read things about climate change. I would not say I have firm views on it I don 't think I 'm competent to opine on what causes global warming or not.\"\n\nThese politically-incorrect statements were enough to set off a Twitter storm and for Esquire to conclude that Ms. Coney Barrett's lack of firm views on climate change disqualifies her. Next year the Supreme Court will hear a case wherein the City of Baltimore is suing several oil companies, seeking to hold them financially responsible for their emissions.\n\nUS to be Subject to UN \"Climate Conciliation Commission\" if It Rejoins Paris Agreement\n\nIf Joe Biden wins the election and the US rejoins the Paris Agreement next year, there will be no Senate ratification requiring a 2/3 vote, just a \"pen and phone\" approach used by former President Obama in 2016 to claim \"ratification.\" However, after some FOI litigation the State Department released a document indicating that rejoining Paris would subject US climate policy to a UN \"climate conciliation commission.\" This commission would give antagonistic nations a forum to bring their complaints about US policy and claims of non-compliance with the \"net-zero\" emissions agenda.\n\nThis may be the reason that the Obama administration wanted to avoid a Senate vote by claiming even before there was a Paris text, that it would not be a treaty. \u009d Nevertheless, the UK Court of Appeal cited the Paris Agreement as a reason for denying the UK government's proposal for a third runway at Heathrow Airport. Rejoining Paris would mandate the US to revisit and tighten its \"Green New Deal\" policies every five years, which is why the climate agreement is a treaty.\n\nDescribing it as \"the most impactful step our state can take to fight climate change,\" on September 23 California Governor Gavin Newsom saying issued an executive order requiring that by 2035 all new cars and passenger trucks sold in the state be zero-emission vehicles. On October 7 he followed up with another executive order launching \"innovative strategies to use California land fight climate change, conserve biodiversity and boost climate resilience.\"\n\nHowever, data published by the National Oceanic and Atmospheric Administration confirms that heatwaves are declining in California.\n\nOn September 14, in the wake of the recent California wildfires, Governor Gavin Newscom told President Trump: \" the science is in, and observed evidence is self-evident that climate change is real, and that is exacerbating this.\" Earlier the president told reporters that poor forest management is contributing to the fires. In a pair of Forbes articles environmentalist Michael Schellenberger says that good forest management trumps climate change and that the 2 million acres burned this year in California is half the lowest estimate for acres burned within the state's borders before Europeans settled in America. Fire suppression over the past 100 years has resulted in a five-fold accumulation of wood debris in the forests.\n\nA story in American Greatness describes how environmentalists litigated and lobbied to stop efforts to clear the forests through timber harvesting, underbrush removal, and controlled burns. Meanwhile natural fires were suppressed. Jim Steele, Director emeritus of San Francisco State 's Sierra Nevada Field Campus, examines the scientific evidence and concludes that there has been no climate effect regarding California's wildfires. He notes that 70% of the state's burned areas have been in grasslands and dead grasses are totally insensitive to climate change. A Daily Signal article lists six commonly-asked questions and answers regarding the west coast fires: (1) What caused them; (2) Are the fires the worst ever? (3) Why have they been so severe? (4) Why are controlled burns and forest thinning so hard to do? (5) What is the role of climate change? (6) What about housing policies?\n\nThe UK Met Office claims that in North America global warming is causing record wildfires in North America, Natural Resources Canada reports that this year's fires are 64% of normal (3,621 vs 5,639) by number and only 8% of normal by area (235,000 ha vs 2,864,000 ha), where the normal values are 10-year averages. Plots in the Global Warming Policy Forum article show that the number of fires is the lowest since 1990 and there is no long-term trend in either number or area burned over the last 20 years.\n\nThough India is a signatory to the Paris Agreement, it has resisted UN attempts to suppress the country's access to conventional energy sources. In 2017 coal made up 56% of India's energy mix, followed by oil (29%), gas (6%), hydro (4%), renewables (3%) and nuclear (1%). This doesn't sit well with UN Secretary General Ant ³nio Guterres, who said: \"Coal spells stranded assets and makes no commercial sense the coal business is going up in smoke. India can become a true global superpower in the fight against climate change if it speeds up its shift from fossil fuels to renewable energy.\"\n\nIn India Mr. Guterres' claim about the coal business going up in smoke is seen as delusional. The country has a strong determination to make its energy sector secure and, while scaling up renewables, has simultaneously ramped up its fossil-fuel investments. Thermal power plants account for 68% of installed capacity, and raw coal use went up 7.7% between 2018 and 2019. Even in 2050 India's reliance on fossil fuels will continue, contributing to an expected 65% of its energy needs.\n\nA University of Warwick paper titled Do Europeans Care about Climate Change? An Illustration of the Importance of Data on Human Feelings, reports on two surveys of 70,000 European men and women (40,000 in the European Social Survey of 2016 and 30,000 in the Eurobarometer Survey of 2019). According to the paper's abstract, only 5% of the people say they are extremely worried about climate change. Moreover, climate change is only No. 5 on people's list of worries (after health & social security, inflation, unemployment and the economic situation). The abstract ends: \"This paper 's conclusions seem to have exceptionally serious implications for our unborn great grandchildren -- and imply that economic policy should now focus on how to alter feelings rather than upon the design of complicated theoretical interventions. An analogy with successful anti-tobacco policy is discussed.\"\n\nIn the paper the authors discuss the problem of \"social desirability bias\" the tendency of people to give socially-responsible answers to questions and suggesting that there is \"a potentially larger and hidden problem of climate-change complacency within the European population.\" On p. 17 the authors conclude: \"In a democracy, policy proposals have to build upon a platform of generalized assent in society. There is little point in designing sophisticated economic policies for combatting climate change until voters feel that climate change is a deeply disturbing problem. Currently, those voters do not. \"\n\nIn the university's press release for the paper the authors suggest that governments should consider doing more to educate and alter people's perceived level of worry about climate change.\n\nLast month Bill Gates published an article bemoaning about how little the world's CO emissions will go down this year because of Covid-19 (8%), and at great cost $3,200 to $5,400/tonne in the US. He goes on to predict that in 40 years global warming will be killing people at the same rate (deaths per 100,000 population) and will have a similar economic impact (depending on which economic model you use) as the coronavirus. Mr. Gates therefore wants the world to act on getting to zero emissions with the same sense of urgency as fighting the pandemic.\n\nCLINTEL has sent a letter to Mr. Gates pointing out that his claim that climate change could be worse than the pandemic is one of a multitude of \"copy-cat\" climate catastrophe claims. The \"climate crisis\" exists only in the computer models. The letter invites Mr. Gates to answer six questions:\n• How much or how little global warming does mankind really cause on top of the natural contribution?\n• Why does projected global warming exceed observationally derived warming by more than 200%?\n• Have the large benefits of more CO in the atmosphere been properly accounted for?\n• Does the cost of attempting to abate global warming exceed the benefit in the avoided cost of adaptation?\n• What of the tens of millions who die every year because they cannot afford expensive renewable \u009d electricity and are denied affordable, reliable alternatives?\n• Has history not shown us repeatedly that adaptation to change presents a powerful survival and evolutionary strategy?\n\nA Highly Orchestrated Climate Lawfare Campaign Comes to Delaware\n\nOn September 10 with a statement \"We're going after the big dogs\", Delaware Attorney General Kathy Jennings announced a public nuisance lawsuit in state's Superior Court against 31 of the world's largest fossil fuel companies, together with the American Petroleum Institute. The AG said the defendants were dishonest about how fossil fuels contribute to climate change, with the deception contributing to a rising sea level that is impacting Delaware.\n\nAs an Energy in Depth article explains this lawsuit is part of a highly orchestrated climate litigation campaign, with most of the cases sharing the same legal arguments and outside counsel. Three cities San Francisco, Oakland and New York City have had their suits dismissed by federal judges, and the New York attorney general lost in state court where the judge called his allegations \"hyperbolic\" and \"without merit.\" In 2019 Delaware's Department of Justice put out a request for special environmental legal counsel to help the AG bring possible court proceedings \"involving violations of laws pertaining to environmental matters, including but not limited to those concerning emissions, discharges, releases of contaminants into the air, ground, and/or water of the State, as well as the marketing and sale of products harmful to the environment of the State.\" The law firm Sher Edling, a familiar face in the climate litigation campaign, became Delaware's counsel in this latest lawsuit.\n\nSix Portuguese young people have filed a legal action on September 3 with the European Court of Human Rights, accusing 33 countries of violating their right to life by not doing their fair share to tackle the \"climate crisis.\" This is the first climate change suit to be filed at the ECHR. In 2017 wildfires, which researchers have linked to global warming, killed more than 120 people in Portugal.\n\nA press release from Global Legal Action Network states that if the suit is successful the 33 countries \"would be legally bound, not only to ramp up emissions cuts, but also to tackle overseas contributions to climate change, including those of their multinational companies.\" The 33 countries (including the EU) being sued are listed in the Climate Action Tracker. The CAT ranks these countries' Paris Agreement commitments in five categories ranging from \"<1.5 °C world\" to \"4 °C+ world\" and provides detailed ratings of each country's emissions reduction policies.\n\nNew Electric Cars Perform Wonders In Towns, Rural Roads, But Run Out Of Puff On Highways\n\nSales of high-end electric vehicles, such as Teslas and Audis, are accelerating in Europe. But when \"cheaper\" (~$40,000) EVs hit the market consumers are in for a shock because these are really city cars and hopeless on the highway. For example, a long journey that would take about five hours in an internal combustion engine vehicle would require twice as long in a cheaper EV. The latter can run only 80-100 miles at high speed before its battery is exhausted. The ICE car would need about 10 minutes for a fuel stop, but an EV needs up to an hour to charge to 80% of capacity.\n\nThis 15-member (including Gerry Butts) task force came together in May of 2020 to provide \"independent and urgent advice\" on how government can build a \"green\" recover from the Covid-19 pandemic through actions and investments over the next five years. This month the task force released its report, Bridge to the Future, which recommends \"Five overarching bold moves, supported by 22 recommendations, and calling for $55.4 billion in government investment over the next five years.\" The bold moves are:\n• Invest in the nature that protects and sustains us ($4.65 billion)\n• Grow clean competitiveness an jobs across the Canadian economy $5.0 billion)\n\nThe Guardian's George Monbiot takes little comfort from a report in The Lancet that forecasts that continuing declines in fertility (due to trends in female education) will slow global population growth below the replacement rate. Mr. Monbiot worries that a smaller, but more affluent, population will still have a worse environmental impact, according to his equation: Impact = Population x Affluence x Technology (I = PAT). Current population growth is concentrated among the world's poorest people, who currently have little A or T.\n\nMr. Monbiot savages the affluent for (a) their environmental impact and (b) blaming that impact on the population of the poor. He omits to mention that most \"solutions\" to climate change tend to impact the poorest populations most.\n\nWhy Deaths From Hurricanes And Other Natural Disasters Are Lower Than Ever\n\nDespite climate change being blamed by activists and the mainstream media whenever a hurricane strikes, Michael Shellenberger, author of Apocalypse Never: Why Environmental Alarmism Hurts Us All, provides evidence that: (1) hurricanes aren't increasing in frequency and (2) natural disaster deaths are at their lowest point in a century. The American Meteorological Society published a report in 2018 on landfalling hurricanes in the continental US between 1900 and 2017. The report found that there has been a slight downward trend in annual numbers of hurricanes. Though there has been an inflation-adjusted increase hurricane damage, this is due to increased exposure (more structures built in the hurricanes' paths), as opposed to increasing frequency or intensity of storms.\n\nMr. Schellenberger 's article includes a chart of global deaths per decade (1900-09 to 2010-19) from natural disasters, showing a 92% decline in decadal death toll since the peak in the 1920s.\n\nIn 2021 the 20-year feed-in contracts for 18,000 solar operators in Germany will expire. These operators, private households and small businesses, could be disconnected from the grid unless the Renewable Energy Subsidy (EEG) is renewed. In addition, they will no longer have the right to feed excess power to the grid. As of January, anyone who gives electricity to the grid for free will be liable to prosecution, so the operators would have to market their power through intermediaries. The photovoltaic industry is hoping that the federal government will approve new EEG subsidies in the autumn.\n\nAccording to the BBC, new research suggests that power companies are dragging their feet in moving to green energy sources such as wind and solar. The research was published by Nature Energy as A global analysis of the progress and failure of electric utilities to adapt their portfolios of power-generation assets to the energy transition. The study looked at 3,000 utilities worldwide, quantifying their transition from fossil fuels to renewables over the past two decades. Using a machine-learning-based clustering algorithm with a historical global asset-level dataset the researcher distilled macro-behaviors and sub-patterns within them.\n\nIt turns out that 3/4 of the utilities did not expand their portfolios and a handful of the rest grew coal ahead of other assets, while half favored gas and the rest renewables. According to the author: \"If you look at all utilities, and what's the dominant behaviour, it is that they're not doing much in fossil fuels and renewables.\" The overall conclusion from the analysis, though, is that utility companies are \"hindering\" the global transition to renewables.\n\nAre Forests The New Coal? Global Alarm Raised over Biomass Burning\n\nThe forest biomass industry is sprawling and spreading globally ï¼\u008d even as forest ecologists and climatologists warn that the industry is putting the planet 's temperate and tropical forests at risk, and they are aggressively lobbying governments against using wood pellets as a renewable energy \u009d alternative to burning coal. According to the environmental director of the Science Advisory Council of the European Academies: \"We have repeatedly pointed out that the large-scale substitution of coal by forest biomass [to produce electricity] will accelerate climate warming and will increase the risks of overshooting Paris [Climate Agreement] targets. The reason is simple: when the forest is harvested and used for bioenergy, all the carbon in the biomass enters the atmosphere very quickly, but it will not be reabsorbed by new trees for decades. This is not compatible with the need to tackle the climate crisis urgently.\"\n\nForest experts have argued that the carbon released by burning wood pellets would be offset by the replanting of new trees. However, such carbon neutrality takes 50 to 100 years. The biomass industry, in statements and scientific reports, argues that it is a green climate-friendly alternative to burning coal.\n\nGerman mainstream media are finally waking up to what a Swiss meteorologist calls \"the dumbest energy and environmental policy ever.\" Germany's flagship ARD public broadcaster reported how satellite images show deforestation has risen 49% since 2016 in Sweden, Finland and the Baltic countries. The reason: to meet CO targets by the harvesting of trees to make wood pellets.\n\nUNFCCC Pushes Alarmist Lies About Its Own Science\n\nOn August 24 the UN released the Framework Convention on Climate Change's 2019 Annual Report, celebrating \"25 years of global climate effort.\" In the forward UN Secretary-General Antonio Guterres claims that the UNFCCC's activities were overwhelmed by \" the continued intensification of the pattern of destruction and losses associated with climate change \" and that \" going beyond a 1.5 °C increase in average surface temperature will lead us to catastrophic disaster and extreme weather events.\" Yet the IPCC, itself a creature of the UNFCCC, states in Chapter 3 of its 2018 SREX Report that there is \"low confidence\" in:\n• Observed trends in small-scale phenomena such as tornadoes and hail because of data inhomogeneities and inadequacies in monitoring systems.\n• At the global scale regarding even the sign of these changes [floods].\n• For the attribution of any detectable changes in tropical cyclone activity to anthropogenic influences.\n• Projections of changes in extreme winds.\n• Projections of small-scale phenomena such as tornadoes because competing physical processes may affect future trends and because climate models do not simulate such phenomena.\n• Projections of changes in monsoons (rainfall, circulation), because there is little consensus in climate models regarding the sign of future change in the monsoons.\n• Projections of changes n El Nin o- Southern Oscillation variability and the frequency of El Nin o episodes as a consequence of increased greenhouse gas concentrations.\n• Projections of changes in fluvial floods.\n\nCalifornia leads the way to \"green\" electricity blackouts, followed closely by South Australia. They created the problem by eschewing reliable coal, nuclear, gas or hydro generators while subsidizing and promoting unreliable electricity from wind and solar. The latter two will always be prone to blackouts for three reasons:\n• They are intermittent, producing zero power when winds drops or sunlight fails.\n• Because they are dilute they require huge collection areas of land, connected by a fragile network of roads and transmission lines. Conventional power plants are centrally-located, requiring less transmission lines and are more resistant to weather damage.\n• When wind and solar power fails, the alternatives are:\n• Big batteries, themselves big consumers of energy in mining, materials, construction and charging/discharging.\n\nIn Britain Extinction Rebellion is pushing for a Climate and Ecological Emergency bill to be put before Parliament. The CEE Act would create a Citizens' Assembly with the power to force the government to implement any policy, except disbursement of public funds and taxation. Such an assembly could, for example, impose an immediate ban on the sale and use of gasoline and diesel fuels, or make flying illegal. The bill is quiet about who would sit on the Citizens' Assembly, except that its members would not be elected. Likely it would be dominated by the most extreme of the climate activists.\n\nFollowing an Extinction Rebellion blockade of newspaper printing plants in London the UK government is threatening to change the law to make XR a criminal gang, including new protections for MPs, judges and the press. The UK Home Secretary said: the activists should sface the full force of the law ' for pursuing guerrilla tactics... that seek to undermine and cause damage to our society. \u009d\n\nLast fall California's power grid operator warned of coming electricity shortages as the state continues to shift from gas to wind and solar. In mid-August that warning proved true as the first rolling blackouts since 2001 cut power to hundreds of thousands in the state. California is awash with natural gas but charges more than twice the national median for electricity.\n\nThough the cost of solar panels declined dramatically between 2011 and 2019, that didn't help when demand for power held steady after sunset. There has been very little electricity from wind during the summer heatwave. To manage the increasingly unreliable grid, California will either need to keep its nuclear plant operating, build more natural gas plants, or pay ever more money annually to reserve emergency electricity supplies from its neighbors.\n\nAccording the US Energy Information Agency, California has adequate power generation capacity of 76 GW, but 27 GW of that is solar and 6 GW is wind. In August solar output declines after 4 PM and ends completely at 7 PM. The state is mandating a shift to all-electric medium and heavy-duty trucks in 2024 with the goal of reaching 100% of all new sales, wherever feasible, by 2045.\n\nAt a press conference on August 17 the state's governor, Gavin Newscom, admitted that the shift from fossil fuel products to solar and other forms of green energy had led to \"gaps\" in the grid's reliability, but refused to back down and insisted that that the transition from fossil fuels is a moral and ethical imperative.\" The Institute for Energy Research, in an analysis of the situation, concluded: \"California 's blackouts are a product of its politically-determined reliance on intermittent, unreliable renewable energy, not a product of heatwave.\"\n\nAs writer Matthew Lau argues in a Financial Post article, the issue of global warming has been a fabulous bonanza for Canadian politicians interested in spending other people's money and telling them how to live. Both environment ministers in the current government have said that said that spending and regulations are the expensive way to deal with climate change, and that a tax would be more efficient. However, climate-change spending at the federal environment ministry has increased from $106 million in 2015-16 to a planned $845 million in 2020-21.\n\nWhile it would be more sensible to leave control over how and how much to reduce emissions to individuals and businesses, there's no glory in it for the politicians. Better to make repeated announcements of ambitious new programs and handouts to progressive, forward-thinking and environmentally conscious organizations who will respond gratefully to the government largess. Unfortunately for the taxpayers this vanity makes for wasteful government spending.\n\nBj ¸rn Lomborg notes that the world will be spending trillions of dollars to recover from the ravages of the pandemic, with demands from campaigners and influential policy-makers to tie this spending to climate goals. These people tell us that a green recovery can create jobs and economic growth, and will also deal with the bigger problem of climate change. While Mr. Lomborg accepts that climate change is a problem for humanity, climate-change policies have massive costs which outweigh the benefits. In the case of the 2050 European Green Deal the cost is ‚ 1-2 trillion/year, which exceeds what EU governments spend today on health, education and environment.\n\nRegarding jobs, in the US it takes 39 solar workers to produce the same amount of electricity as one worker in natural gas. The subsidized green jobs will have to be financed by higher taxes. An OECD study shows that climate policies drag down growth, while smart non-climate investments in infrastructure and education, with a more flexible labour market, increase growth.\n\nThe climate change debate might be one of the worst cases of academic suppression in history, so CLINTEL has issued a Magna Carta Universitatum 2020. This document begins with a preamble that describes what universities are supposed to be and do, but are now becoming suppressors of alternate views opposed by their funders, supported by ideological and political groups. It then lists five statements of general applicability, with a climate example for each.\n\nPeter Ridd is a marine geophysicist and Great Barrier Reef expert whose 30-year academic career ended when he started disputing the conventional wisdom that climate change was killing \u009d the reef. He took his employer, James Cook University, to court, wining $1.2 million in compensation. JCU appealed, and the Federal Court overturned the decision in a 2-1 ruling, with the majority noting: There is little to be gained in resorting to historical concepts of academic freedom.\" This case shows how much public institutions have been corroded by cancel culture.\n\nHowever, Dr. Ridd has vowed to fight on by appealing to the High Court of Australia.\n\nOn July 31 the Supreme Court of Ireland upheld a legal challenge brought by Friends of the Irish Environment contending that the government's 2017 climate cation plan breached legislation requiring the state to specify its proposals. The chief justice wrote in the judgement that there was \" a clear present statutory obligation on the government, in formulating a plan, to at least give some realistic level of detail.\" During proceedings the government argued that the legal challenge amounted to a challenge of its policy decisions which are not within the scope of questions which can properly be the subject of litigation.\"\n\nWhile the court can order the government to produce a plan, can it force members of the Irish Parliament to pass legislation needed to implement it?\n\nHaving lost the un-loseable election in May last year, an angry rump of Australian Labour backbenchers is keen to ditch the party 's suicidal renewable energy policies. With Australian businesses suffering among the world 's highest power prices, thanks to its obsession with intermittent wind and solar, South Australian households and businesses suffer the highest prices in the world, the rebirth of manufacturing and industry sounds like so much wishful thinking.\n\nLabour MP Joel Fitzgibbon has accused the party's influential internal environment lobby of putting blue-collar jobs and lower energy prices at risk and warned them against exaggerating the number of jobs in the renewable energy sector as the party 's split over climate and energy policy grows. Mt. Fitzgibbon said the Labor Environment Action Network 's fundamentalist \u009d policies were out of step with ALP values and making the party unelectable.\n\nLast December in a Harris poll American adults said climate change was the number one issue facing society. In a survey conducted on July 24 it came second last on a list of 12 options, ahead of only overpopulation. Covid-19 and the resulting recession have reordered priorities around the world.\n\nThe widespread view that fossil fuels are dirty \u009d and renewables such as wind and solar energy and electric vehicles are clean \u009d has become a fixture of mainstream media and policy assumptions across the political spectrum in developed countries. However, most important component in the EV is the lithium-ion rechargeable battery which relies on critical mineral commodities such as cobalt, graphite, lithium, and manganese. Tracing the source of these minerals, in what is called full-cycle economics \u009d, it becomes apparent that EVs create a trail of dirt from the mining and processing of minerals upstream.\n\nA recent United Nations report warns that the raw materials used in electric car batteries are highly concentrated in a small number of countries where environmental and labour regulations are weak or non-existent. Thus, battery production for EVs is driving a boom in small-scale or artisanal \u009d cobalt production in the Democratic Republic of Congo which supplies two thirds of global output of the mineral. These artisanal mines, which account for up to a quarter of the country 's production, have been found to be dangerous and employ child labour.\n\nAccording to Professor Kelly of Cambridge University, if we replace all of the UK vehicle fleet with EVs, assuming they use the most resource-frugal next-generation batteries, we would need the following materials: about twice the annual global production of cobalt; three quarters of the world 's production lithium carbonate; nearly the entire world production of neodymium; and more than half the world 's production of copper in 2018.\n\n50% Of The EU 's Climate Budget ' Will be Given To Farmers, Critics Warn\n\nThe EU has committed to spending 30% of the bloc's budget on climate change 10 percentage points higher than the 2014-20 budget. This works out to ‚ 600 billion. It turns out, however, that half that amount won't be spent on reducing CO emissions, but on the EU's Common Agriculture Policy. A spokesperson for the European Environmental Bureau, a network of various environmental groups, calls this \"massive greenwashing.\" A huge portion of the money will be paid directly to farmers to support their income.\n\nIPCC to Delay Release of Next Climate Science Report\n\nBefore the Covid-19 pandemic the IPCC planned to release its sixth climate assessment (AR6) according to the following timetable:\n\nThis timetable was intended to have all three parts ready before the start of COP26 (climate summit in Glasgow) in November 2021 but had a footnote that the dates were likely to shift as a result of the pandemic. Climate Change News confirms the shift, reporting that only the WG I report will be released before COP26.\n\nClimate-change Hysteria Costs Lives But Activists Want to Keep the Panic Alive\n\nMichael Shellenberger, author of Apocalypse Never, expected his book to be controversial, but was taken aback when CNN 's top climate reporter compared it to a cigarette advertisement and an environmental journalist accused Mr. Shellenberger of promoting \"white supremacy.\" Last year he decided to speak out when it became clear that climate alarmism was harming mental health. (A survey of 30,000 people around the world found that nearly half believed that climate change would make humanity extinct.)\n\nDespite evidence to the contrary, some alarmists claim that climate change is making disasters worse. The reason: so they can use the world 's most visual and dramatic events, from Hurricane Sandy to California 's forest fires, to make the issue more salient with voters. It's also about power. Elites have used climate alarmism to justify efforts to control food and energy policies in their home nations and around the world for more than three decades. And it gives them purpose: to save the world from climate change.\n\nThe London School of Economics ' Grantham Research Institute on Climate Change and the Environment published Global trends in climate change litigation: 2020 snapshot on July 3. According to Table 1.1 (p. 6) of the report, English-speaking countries tend to attract the most climate lawsuits. For the period 1986 to May 2020 there were 1,587 of these cases, of which the US has had 1,213, followed by Australia (98), the UK (62), the EU (57), Canada (22), New Zealand (18), Spain (13), France (11) and the IPCC (10). Thirty-six other jurisdictions and international agencies shared the remaining 83 cases. Figures 1.1 (a) to (c) show big jumps in the number of cases since 2000.\n\nOver 80% of the cases outside the US have been brought against governments by corporations or individuals. Human rights arguments are being used to support an increasing number of cases, and various strategies are being used against fossil-fuel companies, The biggest win for litigants has been the Urgenda case in the Netherlands (Box 2.1) where on December 20, 2019 the Dutch Supreme Court ruled that the state, despite emitting only 0.4% of global emissions, has to \"reduce greenhouse gas emissions from its territory in proportion to its share of the responsibility.\"\n\nAnother big case to watch is Juliana v. United States, where 21 children assert that their government is violating their constitutional rights by allowing dangerous CO concentrations. After a panel of the Ninth Circuit of the US Court of Appeal ruled in January that, despite agreeing with the plaintiffs on causation, the issue is a matter for legislation, not litigation. The plaintiffs have filed an appeal to have the case heard by a full panel of 11 circuit court judges.\n\nThe Grantham Research Institute publishes a database of climate litigation, which can be searched by country, date started, date of last change and/or status. For each case there is a summary, followed by links to the case documents.\n\nThe Federal Court of Australian overturned an earlier ruling of the Federal Circuit Court, which held that Dr. Peter Ridd had been unlawfully dismissed from his post at James Cook University over his views challenging orthodox climate change science and the Great Barrier Reef. Dr. Ridd may appeal the latest decision to the High Court of Australia. Jennifer Marohasy, writing in The Spectator Australia, relates the history of Dr. Ridd's fight with JCU since 2018, concluding: \"Today 's decision means that James Cook University, and other Australian universities, will continue to crush dissent and sack academics who campaign for the truth.\"\n\nAt the end of 2019, to much fanfare, the European Investment Bank announced its plan to become the \"EU Climate Bank,\" eschewing investments in fossil-fuel projects and aligning itself with the objectives of the Paris Agreement by the end of 2020. Alas, Counter Balance, a coalition of nine NGOs has published a damning report on the EIB called The EU Climate Bank Greenwashing or a banking revolution? The report begins: \"As of today [June 2020], the EIB still supports numerous environmentally and socially detrimental projects, especially in the energy and transport sectors.\"\n\nFrom 2016 to 2019 the EIB provided ‚ 28.7 billion to \"dirty\" projects maritime, motorways, airports, coal utilities and fossil fuels. When it announced its new lending policy in November 2019 the EIB gave itself three important exceptions that could allow it to invest in what the report calls \"fossil gas\" projects. In mid-June the bank approved loans for a gas terminal in Cyprus and a pipeline between Bulgaria and Serbia. It is still considering major investments in airports and motorways. Justifications for such projects typically use terms like \"green or low carbon gas\" and \"green aviation\" (i.e., more efficient aircraft, biofuels and emissions offsets.)\n\nThe European Union has pledged to reduce CO2 emissions to 40% below 1990 levels by 2030, a target that some scientists say is too low prevent catastrophic global warming. Thus, the European Commission will propose a 50-55% cut in September, but it needs approval by the member states and the European Parliament. A two-day virtual meeting of environmental ministers ended on July 14 and failed to find common ground on whether to even raise the target. Poland, Slovakia, Bulgaria, Romania, Czech Republic and Hungary said they would not support a new target without seeing an impact assessment. In a letter to the Commission they wrote: \"We would like to avoid a situation where we are left wondering what the real social, environmental and economic costs for us are all.\"\n\nSpain, Denmark, Sweden, Finland, the Netherlands, Austria and Luxembourg support an emissions cut of at least 55% by 2030.\n\nAfter four days of wrangling EU heads of government agreed on a ‚ 750 billion package aimed at funding post-pandemic efforts to revive Europe 's economies. However, the package slashed the size of the EU's Just Transition Fund from ‚ 37.5 billion to ‚ 17.5 billon. The JTF is a pot of money intended to wean countries off fossil fuels. To access the money, countries must commit to become climate neutral \u009d by 2050 a condition aimed squarely at Poland. Nevertheless, Poland will receive ‚ 125 billion in EU grants over the next seven years without changing its climate stance.\n\nFollowing lobbying by the airline industry's International Air Transport Association, the UN's International Civil Aviation Organization, has agreed to ease airlines' obligation to offset their emissions growth. The agreed baseline for measuring emissions was to have been the two-year average of 2019 and 2020. However, with the collapse of air travel in 2020 the IATA requested, and the ICAO agreed, to change the baseline to 2019 for the first three years of CORSIA (Carbon Offsetting and Reduction Scheme for International Aviation). As a result, if the industry's emissions don't rise above 2019 levels during these three years (2021-23) airlines won't have to pay anything.\n\nIn 2022 the ICAO will decide whether continue the baseline change beyond 2023 or revert back to the earlier 2019-20 average.\n\nOn July 16 Greta Thunberg issued a string of demands for world leaders to take emergency action on climate change, lamenting that some had given up \u009d on the possibility of preparing a decent future for coming generations. In an open letter to EU and global leaders, Ms. Thunberg and fellow activists are demanding:\n• Making ecocide an international crime at the International Criminal Court.\n• Establishing, starting today, annual binding carbon budgets based on the IPCC's budget that fives a 66% chance of limiting global warming to 1.5 °C.\n• Designing climate policies that protect the most vulnerable and reduce all forms of inequality, economic, racial and gender.\n• Treating the climate and ecological emergency like an emergency.\n\nIn a Reuters interview Ms. Thunberg said \"We need to see it as, above all, an existential crisis. And as long as it 's not being treated as a crisis, we can have as many of these climate change negotiations and talks, conferences as possible. It won 't change a thing.\"\n\nOn July 20 Nature Climate Change published a paper titled Fasting season sets temporal limits for global polar bear persistence, that used an ensemble of climate models to estimate the increasing number of days/year that polar bear subpopulations will have to fast due to global warming. The authors conclude that, with high greenhouse gas emissions, the survival of all but a few high-Arctic subpopulations by 2100 will be in jeopardy. Mainstream media, including the BBC, the CBC and the NY Times, all issued uncritical accounts of the paper's conclusions the same day. The ENGO Polar Bears International produced a 4-minute video stating that we have to rapidly decrease our reliance on fossil fuels and make a swift transition to renewable energy to save the bears.\n\nHowever, zoologist Susan Crockford was just as quick as the media and the ENGO to publish in her blog a report critiquing the model used by the Nature Climate Change authors. They relied on the worst-case RCP8.5 scenario [FoS Extracts - 2010-07-02] which is totally implausible, as even the BBC has admitted. Also, the paper uses polar bear data collected up to 2009 only from Western Hudson's Bay to predict the response of bears worldwide. In fact, polar bear populations worldwide continue to thrive, despite declines in sea ice.\n\n\n\nMichael Shellenberger has been an environmental activist since age 16. In his 30s he advocated for renewables, helping to persuade the Obama administration to invest $90 billion in them, and earned a \"Hero of the Environment\" accolade from Time Magazine. For years he referred to climate change as an \"existential\" threat to human civilization and called it a \"crisis.\" That is now all in the past as Mr. Shellenberger has decided to speak out in his new book: Apocalypse Never: Why Environmentalism Hurts Us All. In this article that he wrote for Climate Change Dispatch, he says that, while climate change is happening, it's not the end of the world or even our most serious environmental problem.\n\nMr. Shallenberger lists 12 facts about climate change that few people know; he admits standing by and remaining quiet about the climate disinformation campaign for fear of losing friends and funding. In the past year the disinformation from prominent activists and the mainstream media became so strident and fear-inducing that he decided to lay out all the evidence in Apocalypse Never, which he calls \"my formal apology for our fear-mongering.\"\n\nIn a Sky News Australia video Mr. Shellenberger relates how the conservation movements that existed until about 1970 were taken over by a Malthusian, left-wing, anti-human tradition. Climate change has morphed from an environmental concern into a new morality about not eating meat, not using plastic, not driving and not flying. Climate alarmism has been hurting adolescents in particular, especially girls like Greta Thunberg. The greens have been so successful that they convinced the World Bank to stop funding development, in effect making poverty sustainable rather than making it history.\n\nForbes, apparently slow to recognize Mr. Shellenberger's apostasy, initially published an article by him on the book and then took it down. Last year Forbes did the same thing when it removed an interview with Professor Nir Shaviv, who describes what happened.\n\nA group of prominent environmentalists and Democratic activists (including one Canadian, Gerald Butts, former principal secretary to Justin Trudeau) has sent a letter with the title Facebook must stop the spread of climate misinformation to the Facebook Oversight Board, which is headed by former Danish Prime Minister Helle Thorning-Schmidt. The group accuses Facebook of \"allowing the spread of climate misinformation to flourish, unchecked, across the globe\" and siding with fossil-fuel lobbyists, instead of heeding the advice of independent scientists and approved fact-checkers. It castigates Facebook CEO Mark Zuckerberg for refusing to \"recognize that he must get the facts right on climate.\"\n\nThe activist group specifically targets Facebook's distribution of content from CO2 Coalition without any warning, labels or restrictions\n\nCOVID vs. Climate Models: Cloudy with a Chance of Politics\n\nAn article in Climate Change Dispatch compares the recent use of statistical models used to predict the spread of the coronavirus contagion with climate models. The statistical models proved to be spectacularly wrong, leading to emergency rooms and hospital beds that were prepared for the pandemic and then being left empty. The New York Times ran a story about a report based on computer modelling by the Imperial College in London that warned of 510,000 Covid deaths in Britain and 2.2 million in the US.\n\nScientific American, alarmed that \"climate science deniers\" were exploiting the failure of the coronavirus models, rushed to the models' defense. SciAm reasons that the dire projections of Covid-related deaths scared people into taking action, like social distancing, thus saving lives.\n\nThe Flaw in Relying on Worst-Case-Scenario Climate Modelling\n\nMedia stories about looming climate disaster if we continue \"business as usual\" almost always refer to computer simulations using an emissions scenario known as RCP8.5. This stands for a \"representative concentration pathway\" with 8.5 W/m2 of radiative forcing resulting from an atmospheric CO concentration reaching over 1200 ppm by 2100. (It is currently about 410 ppm.) RCP8.5 is just one of four scenarios used by the IPCC in its last assessment report, AR5, the others being RCPs 2.6, 4.5 and 6.0.\n\nAs Ross McKitrick explains, RCP 2.6 is a benign, low-end emissions scenario, while RCPs 4.5 and 6.0 are in the middle. The International Energy Agency expects global coal use, which rose to 23 GJ per capita earlier this decade, to fall to 15-20 GJ per capita by 2040. RCP8.5 requires per capita coal consumption to be 30 GJ by 2040, 45 GJ by 2060 and 70 GJ by 2100. A recent study from the University of Colorado found a contradiction in the RCP8.5 scenario: It assumes that in 2100 today's poor countries will be richer than the wealthiest ones are now; but that's impossible if they've become uninhabitable wastelands by then.\n\nThus, RCP8.5 is an implausible worst-case scenario, not business as usual. Modellers prefer it because it gets more media attention than any more realistic alternative.\n\nEU Made No Progress ' In Climate Action Over Past Five Years\n\nA report by the EU's statistics office, Eurostat, indicates that progress on the bloc's climate and energy targets have stalled over the past five years. The EU has 17 Sustainable Development Goals. While there has been progress on almost all of them, Nos. 7 (affordable and clean energy) and 13 (climate action) have been lagging. For No. 7, energy consumption and dependency were the lagging indicators, while for No. 13 they were greenhouse gas emissions, CO emissions from new cars, ocean acidity, surface temperatures and climate-related economic losses.\n\nMeanwhile, there is an East vs. West split in the EU over a higher Green Deal target, specifically whether 2030 emissions should be increased from 40% to 50% or 55% below 1990 levels. Eight countries (Finland, Austria, Luxembourg, Latvia, Denmark, Estonia, the Netherlands and Sweden) are urging the higher targets. Bulgaria, Slovakia and Poland are opposed.\n\nThe Organization for Economic Cooperation and Development and the International Energy Agency have recently hailed the low oil prices caused by the pandemic as a \"golden opportunity\" for governments to phase out support for fossil fuels in favour of renewables. However, NJ Ayuk, Executive Chairman of the African Energy Chamber, has a different view. According to Mr. Ayuk: \" the OECD and IEA don 't necessarily know what 's best for the people who live on this planet. Pressuring governments to stop supporting fossil fuels certainly would not be good for the African oil and gas companies or entrepreneurs striving to build a better future. And it could be downright harmful to communities looking at gas-to-power initiatives to bring them reliable electricity.\"\n\n\"Too often, the discussion about climate change and the call to leave fossil fuels in the ground is largely a western narrative. It does not factor in the needs of low-income Africans who could reap the many benefits of a strategic approach to oil and gas operations in Africa: reduced energy poverty, job creation, and entrepreneurship opportunities, to name a few.\"\n\nMr. Ayuk points out that 840 million Africans have no access to electricity and the deaths from indoor air pollution caused by burning biomass for cooking and heating. Only 28% of Africa's health-care facilities have reliable power. While he is all for renewable energy solutions, Mr. Ayuk says Africans should not be forced to make either-or decisions, particularly when there are vast African natural gas reserves for power generation.\n\nRenewable energy advocates are facing uncomfortable questions about the source and disposition of raw materials needed for the green revolution. Making all the solar panels, wind turbines and electric vehicles requires copper, lithium and cobalt, which like fossil fuels, are extracted from the ground. But, unlike fossil fuels, these raw materials come disproportionally from developing countries. Cobalt mining in the Democratic Republic of the Congo has come under attack due to human rights abuses (through use of child labour) and environmental degradation.\n\nRenewable technologies have ethical issues at both ends of their life cycle. Ghana is a global cemetery for reprocessing electronics such as solar panels. These panels often contain lead, cadmium and other toxic materials. By 2050, the rough expiry date of solar panels manufactured today, they will have become 78 million tonnes of waste, or 80% more than the total annual waste from all combined technologies today.\n\nThe Heartland of America Is Clearly Benefiting from Climate Change\n\nJames Taylor of The Heartland Institute responds to a Chicago speaker who was giving a talk titled: Climate Change Is Disrupting America 's Heartland: What We Can Do About It and What We (maybe) Can 't. This talk warned of climate change-related impacts to agriculture due to flooding, drought, insects. Mr. Taylor examines each of these, citing objective data, evidence and facts. Regarding floods, even the IPCC expressed \"low confidence\" in any climate change impact, and the Hydrological Sciences Journal found no such effect, either. As documented by Climate at a Glance, the US is benefitting from fewer and less extreme drought events.\n\nClimate alarmists like to claim global warming causes more insects that are harmful to crops, and more recently a decline in insect populations that also damages crops. However, recent global and US crop yields have been setting new records, and the longer growing seasons and more atmospheric CO are creating ideal crop conditions.\n\nA study in Germany found that electric cars are \"far from being climate-friendly. \u009d The reason is that most of the electricity in that country is generated from fossil fuels, mainly coal. This situation will continue as long as fossil fuels in the electricity mix remain above 20%. The EU Commission estimates that the fossil fuel share will still be about 40% in 2050.\n\nLast year high-profile climate scientist Dr. Katherine Hayhoe delivered a doomsday forecast, titled Alberta's Climate Future, Friends of Science has just produced a 77-page rebuttal, Facts vs Fortune Telling, shredding Dr. Hayhoe 's study in detail. David Wojick, an independent analyst working at the intersection of science, technology and policy, writing for CFACT, praises the FoS rebuttal. He notes that the Hayhoe report used truncated trends, ignores the fact that different climate models give wildly different regional projections, and relied on \"downscaling\" of hot climate models. Dr. Wojick concludes: \"The Friends of Science takedown is a model for critical analysis of alarmist pseudoscientific hype. The deeply flawed Hayhoe report is not unusual. On the contrary it is typical of climate alarmism computer based, on selected data, presenting speculative scary conclusions as facts.\"\n\nGreta Thunberg Looks to UN Security Council Election for Leverage on Climate\n\nOn June 17 Canada, Ireland and Norway will be competing in a vote for two non-permanent seats on the UN Security Council. Though Canada and Norway have promised to address climate change as a threat to peace and stability, group of four youth activists led by Greta Thunberg thinks that both countries' support for oil and gas production is incompatible with international climate goals. Accordingly, the activists, together with 22 climate scientists, have signed a letter addressed to small island states raising grave concerns \u009d about the Arctic nations ' policies to expand and subsidize fossil fuel extraction. If Norway and Canada are serious about our climate security, they should commit to no new fossil fuel exploration or extraction and begin phasing down their domestic production at a pace that is consistent with limiting warming to 1.5 °C. \u009d (Apparently the activists have no issue with Ireland.)\n\nMichael Mann added his support saying: \"Pleased to join @GretaThunberg and other climate advocates in raising grave concerns \u009d about Arctic\n\nProfits Count More Than Ever, Not Corporate Virtue-Signaling\n\nAn article in Fortune magazine predicts that the public will expect corporations operating with government money as the economy recovers from the coronavirus pandemic to use the money \"for the benefit of society at large.\" An Ernst & Young report notes there will be increased public pressure on companies to proactively address societal challenges, from income inequality to climate change. \u009d And the Trudeau government is using its Large Employer Emergency Financing Facility \u009d program to browbeat businesses into declaring their support for environmental sustainability and national climate goals. \u009d\n\nAs Matthew Lau argues in an article from the Financial Post, the problem with tasking corporations to address climate change, or any other in a long list of public issues, is that corporations are still owned by shareholders and should maximize profits for their owners. The recovery from the pandemic must be led by the private-sector hiring and capital investment. The idea that corporations should focus on \"social\" goals assumes that profit-maximizing implies that they are operating to the detriment of workers and consumers. Holding them responsible for climate change wastes resources at a time when we are trying to recover from the worst downturn in generations.\n\nAustralian Companies Will Be Paid to Use Less Electricity\n\nWhen the grid is under strain, rather than paying electricity generators to increase supply, the Australian Energy Market Commission wants to pay large users for cutting consumption under a scheme called \"wholesale demand response.\" These users will bid for reductions in demand. The AMEC argues that the scheme will allow prices and improve reliability by allowing demand response to compete with \"peaking\" generators who typically receive high prices for their power.\n\nJoanne Nova writes that the demand response scheme is another renewables tax hidden in complexity. The grid is now incapable of providing regular, reliable electricity whenever it's most useful to companies, and so the government is adding a new layer of complexity to try and squeeze out the price spikes.\n\nIn an 8:36 video teenager Naomi Seibt (dubbed the \"anti-Greta\") tells Sky News Australia tells how she got a letter from the German state media authorities telling her to take down three of her videos because they were not \"climate friendly\" and for breaking product placement law (she posted one of the videos on behalf of the Heartland Institute.) The state tactics remind her of the old German DDR. Ms. Seibt relates how climate change in Germany has been pushed aside by the coronavirus crisis, but now climate alarmists came back and are trying to abuse the crisis for their agenda. She feels that, with coronavirus and climate change, all over the world we are heading towards a more totalitarian society.\n\nThe issue is not those topics specifically, but how governments are abusing them to push tyranny and silence those of different opinion, like Ms. Seibt who try to explain climate science. Whenever she asks a climate activist about the science the answer is that 97% of scientists agree. Ms. Seibt was given three options to take down her videos, two of which were jail or a fine. She is refusing and is prepared to go to court. Ms. Seibt has more support abroad than in her native Germany.\n\nChristopher Monckton offers Ms. Seibt a big thank you from the front line in the name of free speech. His piece in Watts Up With That describes in more detail Ms. Seibt's videos and her dealings with the State Media Authority in North Rhine Westphalia.\n\nPlanet Of The Humans ' EP Michael Moore & Director Jeff Gibbs Blast Blatant Censorship \u009d After Controversial Documentary Yanked From YouTube\n\nAfter racking up more than 8.3 million views, Michael Moore and Jeff Gibbs' documentary Planet of the Humans was taken down from YouTube. [Apparently it is now available here.] The reason for the takedown: a copyright claim was lodged against the documentary over four seconds of footage it contains. The four-second clip subject to the copyright right claim comes 37 minutes into the documentary, in a sequence titled How Solar Panels & Wind Turbines Are Made. \u009d The footage shows a mining operation for rare earth metals, which are used in wind turbine manufacture. Mr. Gibbs said that he incorporated the footage under \"fair use,\" an exception to copyright law that allows news reporters and documentary filmmakers limited access to copyrighted material.\n\nIn a statement Mr. Gibbs said: \"This attempt to take down our film and prevent the public from seeing it is a blatant act of censorship by political critics of Planet of the Humans. It is a misuse of copyright law to shutdown a film that has opened a serious conversation about how parts of the environmental movement have gotten into bed with Wall Street and so-called green capitalists. \u009d There is absolutely no copyright violation in my film. This is just another attempt by the film 's opponents to subvert the right to free speech.\"\n\nIn a letter to UN member states the UK proposes that the COP26 talks, which were originally to take place in Glasgow in November 2020 and then postponed because of the Covid-19 pandemic, could be moved to November 1-12, 2021. On May 28 the UN Climate Change bureau approved the proposal. This gives the conference hosts 18 months to press leaders into making stronger commitments, while planning to safeguard up to 30,000 attendees from the coronavirus.\n\nIn the wake of the global coronavirus pandemic, the International Air Transport Association (IATA), an airline industry organization, called on the UN body responsible for aviation (the International Civil Aviation Organizationï¼\u008dICAO) to ease airlines ' obligations to offset their emissions growth under a scheme known as Carbon Offsetting and Reduction Scheme, or CORSIA. The object of CORSIA is to achieve \"carbon-neutral\" growth in CO emissions from 2021 onwards, using 2019 and 2020 figures as a baseline. The IATA proposes using only 2019 as the baseline, which could save airlines as much as $15 billion.\n\nOn June 9 EU member states backed the baseline change, which could see airlines paying no CORSIA fees for five years. Climate activists condemned the EU action. According to Gilles Dufrasne, senior policy officer at Carbon Market Watch: \"This could be the final blow for CORSIA. It was always a ridiculously weak system, but now it is becoming essentially meaningless. Airlines are just let off the hook one more time.\" Jo Dardenne, aviation manager at NGO Transport & Environment, said the change in baseline meant \"we 're going from a cheap offsetting scheme to no scheme at all.\" She added: \"The aviation sector is clearly using the Covid-19 crisis to dilute the environmental effectiveness of a scheme that was already expected to bring little to zero environmental benefits,\"\n\nAs protesters unfurled their banner along the canal beneath Germany's Datteln 4 coal-fired power plant opened last month. It 's a climate crime, what 's happening here, \u009d says Lisa G ¶ldner, a Greenpeace activist, who added: \"I see it as part of our job to send messages of hope. But I 'm really frustrated when it comes to this. This feels like a lost battle.\" But in the wake of the coronavirus pandemic, and with recession looming, the fight against the country 's coal lobby has been overshadowed.\n\nCivil War on the Left: Michael Moore vs. the Greens\n\nLess than a week after release of Michael Moore's Planet of the Humans, activist Josh Fox (best known for the anti-fracking flic Gasland), climate scientist Michael Mann and others signed a petition asking the producer to take down the film. Films for Action initially complied with the request, but half a day later decided to put it back up \" because we believe media literacy, critique and debate is the best solution to the misinformation in the film.\" Films for Action commented: \"While the film makes many important points, we are disheartened and dismayed to report that the film is also full of misinformation.\"\n\nBill McKibben of 350.org, whom Planet of the Humans personally attacks for promoting forest-destroying biomass energy and engaging in green capitalism, calls it a \"bomb in the center of the climate movement.\" In a long Rolling Stone article he defends his actions, describing Mr. Moore as one of a collection of showmen \" who enjoy attracting attention to themselves by endlessly picking fights,\" compared to \" people [like Mr. McKibben] who actually try to organize, to build power, to bring people together.\"\n\nA Forbes article calls Planet of the Humans an anti-human film that ignores our need for affordable and reliable energy to survive, but also calls it important as it \" represents a rupture in left-leaning orthodoxy about energy and climate change.\" The outrage coming from the environmental left sounds like Greta Thunberg's \"How dare you!\" More sinister is the all-renewable-energy tribe's attempts to shut down debate and demonize the opposition through lawsuits.\n\nAccording to Terence Corcoran, a new report by the Canadian Department of Fisheries and Oceans \"is a welcome, cool-headed antidote to the sensational portrayal of the Arctic as a melting disaster that's killing polar bears.\" The report, Canada's Oceans Now: Arctic Ecosystems 2019, was released on Earth Day, but received little attention apart from a news story that seized upon the statement: that Arctic Ocean waters are \"33 per cent less salty than in 2003 and about 30 per cent more acidic enough to dissolve the shells of some small mollusks.\" But it turns out that the 33% less salty body of water is part of the Beaufort Gyre where water circulates in a giant spin cycle causing salt levels to fluctuate. A lead author of the report said that the low-salt reference \"does not apply to the entire Canadian Arctic.\"\n\nRather than portray the Canadian Arctic as a collapsing ecosystem facing climate disaster and species extinction, the report serves as a basis for serious science and social research into a dynamic non-static ever-changing environment.\n\nThe European Commission, which approves state support schemes, updated its temporary rules on May 8 for firms receiving government aid during the pandemic. The new rules ban dividends, share buybacks and bonuses for bailed-out companies, for so long as the state holds a stake in them. However, the commissioners did not attach climate-related conditions to EU approvals of state aid despite calls from lawmakers and green groups to do so - and instead leave it to national governments to choose to add green strings \u009d to bailouts. The Commission has already signed off on ‚ 1.9 billion on state support schemes for companies during the pandemic.\n\nWithout Subsidies Germany 's Solar Industry Could Implode This Summer\n\nGermany's solar industry is collecting signatures and writing incendiary letters to politicians to finally abolish the solar cap and thus save thousands of jobs. According to the latest survey results of the German Solar Industry Association (BSW), the industry 's business expectation index has halved in just three months, and that 's not even due to the coronavirus. At present, Germany has solar plants with a capacity of 50.09 GW. However, once the 52 GW threshold is reached probably as early as this summer the cap will close. This means that smaller plants of up to 750 kW, which make up the majority of newly built plants, will then no longer be entitled to subsidies from the Renewable Energy Sources Act.\n\nThough there is broad public and political support for abolishing the cap, it has been stymied by a debate on the controversial distance rules between wind turbines and buildings, which the economy minister wanted to set at 1,000 m, to reduce countless civil lawsuits against the turbines. The distance debate has become a power game between the two parties forming Germany's coalition government. BSW boss Carsten K ¶rnig is urging politicians to abolish the solar cap before the end of May, as he is threatening that otherwise there would be a super climate policy disaster. \u009d\n\nMexico's National Energy Control Center, or Cenace, announced that it would suspend grid connections of new solar and wind farms until further notice. The motivation behind the decision was the intermittency of solar and wind power generation, which, according to the state-owned power market operator, could compromise Mexico 's energy security in difficult times. The intermittent generation from wind and PV plants affects the reliability of the national electricity system, [impacting] the sufficiency, quality, and continuity of power supply, \u009d Cenace wrote in a document setting out the rules of the country 's electricity market during the COVID-19 lockdown.\n\nThe stage is now set for yet another legal dispute between Mexico 's government and the renewables sector. The Mexican business council, the CCE, hit out at the changes, describing them as lacking a solid technical rationale and a fully justified legal foundation \u009d. By acting to block pre-operation tests for solar and wind, Cenace has neglected its duty to system efficiency, the CCE said. Labelling Cenace 's move as part of a broader roadmap of regulatory capture \u009d by Mexico 's government, the CCE added: Like before, the private sector will take the necessary legal measures to preserve the level field and Mexicans' right to a healthy environment. \u009d\n\nAmbitious EU Climate Efforts Could Increase CO Emissions In The Rest Of The World, New Study Warns\n\nA policy brief prepared by economists at the University of Copenhagen shows that the more the EU economy succeeds in dialing down emissions the more the rest of the world will turn them up. Using the EUCalc model the economists calculate a carbon leakage rate of 61.5% for the most ambitious EU decarbonization pathway. That is, for each tonne of CO emissions avoided by the EU, the rest of the world will increase its emissions by 0.615 t, resulting in a net reduction in emissions of 0.385 t, significantly delaying achieving the Paris Agreement targets.\n\nIn the most ambitious 2050 scenario a green transformation of CO -intensive industries like concrete, steel and chemicals will increase the costs and prices of their products, making them uncompetitive with those from the US and China. In this case Europe would have to import the products, rather than manufacturing them. The economists conclude that the EU must formulate green strategies for each manufacturing sector and member state while encouraging other countries to pursue similar decarbonization strategies.\n\nBowing to Activists, Google Won 't Build AI Tools for Oil And Gas Drillers\n\nOn May 19 Google announced that it will no longer build custom artificial intelligence tools for speeding up oil and gas extraction, separating itself from cloud computing rivals Microsoft and Amazon. This follows a Greenpeace report that documents how the three tech giants are using AI and computing power to help oil companies find and access oil and gas deposits in the U.S. and around the world. Greenpeace says Amazon, Microsoft, and Google have been undermining their own climate change pledges by partnering with major oil companies including Shell, BP, Chevron, and ExxonMobil that have looked for new technology to get more oil and gas out of the ground. However, Greenpeace applauded Google's May 19 announcement.\n\nNot Even the Global Covid-19 Disaster Will Make A Big Difference To Atmospheric CO Levels\n\nRoy Spencer explains why even the current reduction in economic activity and emissions won't noticeably affect atmospheric CO levels. Global land and ocean areas emit about 30 times as much CO into the atmosphere as from human burning of fossil fuels. Moreover, the lands and oceans absorb about as much as they emit, as part of the global carbon cycle. Events such as El Ni ±o (+), La Ni ±a (-), wildfires and volcanic eruptions can perturb the carbon cycle balance. However, the most dramatic variations are the seasonal ones due to the Northern Hemisphere's cycle of vegetation growth in summer and decay in winter.\n\nThe US Energy Information Administration estimates that the current economic slowdown will cause an 11% reduction in global CO emissions this year. As Dr. Spencer shows graphically, there was no resulting atmospheric evidence of the emissions reduction in April. He estimates that the reduction would have to be 50% and prolonged for a year or more.\n\nMichael Moore has produced a new, anti-human documentary, Planet of the Humans, which was released free on YouTube on the 50th anniversary of Earth Day. It asks hard questions about what it sees as the failure of well-meaning \"green\" efforts to halt climate change. Mr. Moore told Reuters that he once thought electric cars were a good idea, \"but I didn 't really think about where is the electricity coming from? I assumed solar panels would last forever. I didn 't know what went into the making of them.\"\n\nIn the film, director Jeff Gibbs narrates: \"What we have been calling green, renewable energy and industrial civilization are one and the same thing ï¼\u008d desperate measures not to save the planet but to save our way of life.\" A better approach, Mr. Gibbs suggests, would be people having fewer children. Infinite growth on a finite planet is suicide, \u009d he says.\n\nThe film shows both abandoned industrial wind and solar farms and new ones being built ï¼\u008dbut after cutting down forests. It suddenly dawned on me what we were looking at was a solar dead zone, \u009d says Mr. Gibbs, staring at a former solar farm in California. I learned that the solar panels don 't last. \u009d\n\nThe stated purpose of issuing and trading carbon credits was to reduce CO emissions. Now that, thanks to the coronavirus pandemic, emissions have plunged, so have the carbon credit markets. According to Bloomberg, the price on the EU's market has plunged 40% so far this year, erasing two years of gains in a market that was worth more the ‚ 200 billion. The EU's market stability reserve could bring the market back in balance in 2021 by removing excess credits from the market. As this CFACT article points out, the real purpose of \"carbon markets\" isn't to reduce CO emissions at all, but to make money.\n\nChristiana Figueres was the Executive Secretary of the UN Framework Convention on Climate Change, and thus the top UN climate official overseeing the drafting of the 2015 Paris climate agreement. In an April 1 article for the New Scientist, Ms. Figueres continues to advocate for permanent restrictions on human behavior and economic activity, similar to what governments have imposed in response to Covid-19. In her article she failed to mention any of the tens of thousands of people who have died from the epidemic, writing: \"The coronavirus pandemic is a tragedy and its consequences will be felt for a long time. Yet though global health conditions will eventually return to a form of normal, our environment will never do so,\" and \"Moments of crisis are always moments of opportunity.\"\n\nThe financial arm of the Paris Agreement the Green Climate Fund has labelled the Covid-19 as an opportunity \u009d to raise funds for climate change action and relaunch economies on low-emission, climate-resilient trajectories \u009d. While Covid-19 is causing untold suffering, the international response to this unprecedented health crisis in modern times offers an opportunity to direct finances towards bolstering climate action. GCF will continue to make critical investments in climate-resilient water resource management, health care facilities, agriculture and livelihoods all of which are essential to subduing and overcoming the pandemic, \u009d the organization wrote in press release: \"The Green Climate Fund is confident that only a united approach bringing together determined efforts and innovation will provide lasting solutions to both the COVID-19 pandemic and climate change.\"\n\nWHO Official Peddles False Pandemic Link To Climate Change\n\nWorld Health Organization researcher Arthur Wyns authored an article in Scientific American claiming that climate change may \"make the effects of a current or future pandemic worse.\" The article, Climate Change and Infectious Diseases, begins by acknowledging there is no evidence that weather and climate have had any effect on the emergence or transmission of the Covid-19 disease. He then goes on to claim that climate change could indirectly make the effects of a future pandemic worse by undermining environmental conditions needed for good health, including health systems.\n\nAs a Climate Change Dispatch article states, a warmer climate reduces that likelihood and severity of epidemics and pandemics. In fact, cold temperatures kill more people globally than warm or hot temperatures. While Mr. Wyn's article says: \"climate change is causing widespread drought and desertification in much of the world, threatening the availability of water for consumption, food production, personal hygiene, and medical care, including for infectious disease. \u009d However, the IPCC finds no such link.\n\nMacron 's Climate Panel Wants To Ban Cars, 5G, Big Box Stores, More\n\nThe gilets jaunes protests of 2018 over fuel prices prompted French President Emmanuel Macron to delegate the fight against climate change to a convention composed of 150 members of the public chosen at random. More than 250,000 people were contacted using a random telephone number search and asked if they wanted to join the convention. Most refused, but 150 agreed after being told that they would be paid ‚ 86.24 a day plus expenses. The convention (Convention Citoyenne pour le Climat) first met last October where Mr. Macron asked its members to put forward proposals enabling France to cut its emissions by 40% below 1990 levels by 2030. He promised that their proposals would be implemented immediately, put before parliament for legislation, or submitted to the people in a referendum.\n\nThe convention has now come up with a plan modify the way the French shop, travel and produce food. Among its proposals:\n• Abandoning the 5G mobile network because it uses 30% more electricity than previous generations.\n• Prohibiting the sale of cars emitting more than 110 g of CO per km by 2025, in effect outlawing existing vehicles.\n• Banning television, radio, internet and press advertisements for products generating high levels of CO\n\nNow with the French economy forecast to shrink by at least 6% due to the coronavirus lockdown, Mr. Macron will be under pressure to renege on his promise to the convention. If he implements them, he will be criticized by business leaders for adding to their burdens at the worst possible time.\n\nThe UK adopted the French model with its own citizens' assembly, called Climate Assembly UK, which is committed to determining how to reach net zero greenhouse gas emissions by 2050. This assembly met for the first time last January.\n\nFlanders ' Environment Minister scolded the EU over its recently unveiled Climate Law, claiming it unilaterally \u009d revised the Dutch-speaking region 's climate objectives upwards. Flanders ' Environment Minister scolded the EU over its recently unveiled Climate Law, claiming it unilaterally \u009d revised the Dutch-speaking region 's climate objectives upwards, saying: \"If Frans Timmermans [EU climate commissioner] wants to change the Flemish climate objectives for 2030, he should stand for election in Flanders.\" In a climate plan submitted to the EU last year, Flanders said it would aim for a realistic \u009d 32.6% cut in carbon emissions, below Brussels ' and Wallonia 's reduction goal of 40% and 55%, respectively.\n\nAfter losing at the district court and appeals court stages, Greenpeace, together with Nature & Youth and the Norwegian branch of Friend of the Earth are taking their fight against Arctic oil drilling to Norway's Supreme Court. All 19 justices at the court will hear the case. The campaigners argue there is no room for any expansion of the oil industry under the global warming limits set by the Paris Agreement. Greenpeace and Nature & Youth have raised money for the legal battle through crowdfunding and received a 250,000 kroner ($23,000) donation from the Greta Thunberg Foundation.\n\nMercedes-Benz Ends Hydrogen Car Development Because It 's Too Costly\n\nAfter working on fuel-cell vehicles for more than 30 years, Daimler 's Mercedes-Benz has concluded that the dream of a car with a long driving range, three-minute fill-ups and emitting only water vapor was uneconomic. The company built only a few hundred of the GLC F-Cell cars, which proved to be at least twice as costly to manufacture as equivalent battery-powered cars.\n\nAnother reminder of the Friends of Science event on April 6 in Calgary at the Red and White Club, 1833 Crowchild Trail NW. The title of the event is Freedom of Speech!.NO Climate Emergency, featuring investigative journalist Donna Laframboise and research scientist Roy Spencer. Doors open at 5:45 pm. The event opens with a buffet dinner (included) during the mix 'n mingle from 6:00-7:00 pm.\n\nTickets can be ordered here by March 27, 2020. Early bird tickets are on sale until February 29.\n\nPatrick Moore: Why I Was Banned from Speaking in Regina\n\nOn February 7 past president of Greenpeace Canada, Patrick Moore, was deplatformed for the first time in 45 years of giving keynote speeches at conferences around the world. The City of Regina had signed a contract with him to kick off their Reimagine Regina Conference next May but caved to local activists and told Mr. Moore to stay away. In its announcement of the banning, the city said it did not want to spark a debate on climate change. \u009d It said the stated goal of the conference is to make the city 's facilities and operations 100 per cent renewable by 2050. \u009d Regina is one of at least 54 cities and towns in Canada that are virtue signaling by declaring a state of climate emergency. \u009d\n\nAfter the cancellation, Mr. Moore found a new platform to speak in Regina on May 19, the night before the conference begins. The new venue was booked for him by Rebel Media founder Ezra Levant, who emailed: \"Media bullies, environmental extremists and political scolds thought they could deplatform Dr. Moore. We 're re-platforming him and it looks like he 'll have a far larger audience than before.\"\n\nLarry Bell, an endowed professor of space architecture at the University of Houston, imagines that all of the current hydrocarbon energy were replaced by wind, water and sunlight. As proposed by the Green New Dealers, 80-85% of the existing energy sectors would be electrified by 2030 and 100% by 2050. This includes all demands for transportation, heating/cooling, industrial, and agriculture/forestry/fishing. Referring to data compiled for Friends of Science by electrical engineering professor Michael Kelly and energy economist Robert Lyman, Prof. Bell lists some sobering examples:\n• Accommodating the 46,480 solar photovoltaic (PV) plants envisioned in wind, water and sunlight (WWS) plan for just the US would take up 650,720 square miles, almost 20% of the lower 48 states.\n• In Western Europe at the end of 2014 renewable generation capacity amounted to 22%, but the actual output was only 3%.\n• To replace the 440 MW of US generation expected to be retired over the next 25 years would take 29.3 billion solar PV panels and 4.4 million battery modules, covering an area equal to that of New Jersey It would require 929 years to build this many panels at the rate of one per second.\n• A central component of WWS calls for the electrification of all transportation uses, which is now technologically impossible as no battery storage exists for heavy-duty trucks, marine vehicles and aircraft.\n• The costs of electrifying passenger rail systems are so high that no private railway would ever take them on.\n• In rough terms, it requires the energy equivalent of about 100 barrels of oil to fabricate a quantity of batteries that can store a single barrel of oil-equivalent energy.\n\nNevertheless, the WWS plan includes a call to shut down all coal, oil and natural gas production\n\nEven though the number of battery-electric car models doubled from 2018 to 2019, Americans are showing their lack of enthusiasm by avoiding the dealerships. Only 325,000 electric and plug-in hybrid vehicles were sold in the U.S. in 2019, down from 349,000 in 2018. Those dismal numbers represent an embarrassing 2% of the 17 million vehicles of all types sold in the United States in 2019. California remains the primary buyer of EVs while the rest of America has shown little interest in the incentives and the increasing choices of models.\n\nSeveral factors may be contributing to this lack of enthusiasm:\n• While there are no or low fuel costs and no fuel tax for EVs, once they predominate EV owners are going to be picking up the costs for highway infrastructure through some form of vehicle mileage tax.\n• EVs have no tailpipes themselves, but the power plants supplying the electricity to charge and car batteries and the refineries producing all the petroleum-derived parts for the EVs do.\n• Range and charging anxieties remain constant in EV drivers' minds. To fully charge an EV, even at fast-charging stations, it takes anywhere from 30 minutes to 8 hours.\n• Extracting the exotic metals used in EV batteries exposes local ecosystems to destruction when the wastewater and other unusable ores are let loose onto the environments. The workers have no choice but to live in horrific conditions because their wages are so infinitesimally small,\n• Replacing an electric vehicle 's battery will be an expensive proposition along with the environmental challenges to dispose of them safely.\n\nWhy The Green New Deal Would Destroy The Environment\n\nWriting in The Federalist, Paul Diessen argues that environmentalists have paid too little attention to the serious harm Green New Deal policies would inflict on the environment including scenic lands, wildlife habitats, and threatened and endangered species. Solar farms generate only 1.5% of US electricity. To replace the 8 billion kWh now generated by fossil fuels and nuclear, would require blanketing 57,000 square miles of land (equivalent to the land area of New York and Vermont) with 19 billion photovoltaic solar panels assuming that they all were installed in sunny Nevada.\n\nOnshore wind turbines are no better. Replacing all the nation's fossil fuels and nuclear would require more than 500,000 square miles of farm, wildlife habitat, and scenic lands. That 's equivalent to the combined acreage of Arizona, California, Nevada, Oregon, and one-quarter of Washington state. The 56,000 wind turbines already installed slaughter millions of bats and birds every year. The millions of turbines required by the Green New Deal could even threaten the existence of some species. Renewable energy proponents tout offshore wind turbines as superior to those on land because ocean winds blow more steadily. Yet because of opposition from environmental groups, only one relatively small offshore facility is operating today off Rhode Island 's coastline.\n\nSolar panels require many toxic materials, and wind turbines require enormous amounts of steel, concrete, copper, and rare earth elements. Storing a week 's worth of power for periods when the sun is not shining or the wind isn 't blowing would require about 2 billion half-ton Tesla car battery packs. Meeting these needs would require a massive expansion of mining for lithium, cobalt, and other substances in the US or in Asia, Africa, and South America. Moreover, operations in the latter parts of the world involve extensive child labor and create environmental disasters.\n\nDisposing of obsolescent solar panels, wind turbines and batteries is already causing problems in the US and countries like Germany. Thus, the Green New Deal is anything but \"clean\" or \"green.\"\n\nBrussels negotiators are seeking to lock the UK into EU rules on climate change as tensions rise over a future trade deal. The bloc wants Britain to sets up an independent watchdog to ensure it sticks to green commitments and it called on the UK to remain as part of its carbon trading market. Specifically, the EU wants Britain to consider becoming an associate member of its Emissions Trading System. The ETS, the world 's largest carbon market, works by setting a cap on emissions and requiring industry to hold a permit for each tonne of CO emitted. However, PM Boris Johnson insists that Britain will not accept EU rules as the price of a trade deal.\n\nSources in Brussels are drafting plans to give the European Commission power to levy a tax on imports of goods with a heavy CO footprint. It is aimed primarily at non-EU countries such as the US, China and Russia, but could be imposed on the UK if it diverges too far from the EU's green policies.\n\nDuring the first round of auctions for offshore wind power in 2017 developers were happy to forgo any subsidies, confident that the technology was robust enough to turn a profit unaided. Now potential bidders for the next round of auctions for 2022 are concerned that the German government's muddled climate policy will make investments in the technology riskier. As a result investors are seeking UK-style contracts-for-difference to ensure that they get paid enough for their power, no matter what wholesale prices are doing.\n\nA record 3.6 GW of new offshore wind capacity was added across Europe in 2019, bringing the total installed capacity to 22 GW, according to the industry's trade association WindEurope. (Nearly half that added capacity, 1.7 GW, came from the UK, which is no longer a member of the EU.) However, the association claims 3.6 GW is not enough to reach the EU's ambitious target of 230-450 GW of installed offshore wind power by 2050. This would require adding 7 GW/year to 2030 and ramping up to 18 GW/year by 2050.\n\nDeployment of wind energy in Europe faces obstacles, mainly related to slow permitting procedures, installing grids and resistance from local populations. The European Commission said it will address them in a new offshore wind strategy \u009d due to be presented before the end of the year.\n\nBest Response Ever to a Fossil-Fuel Divestment Demand\n\nTwo students at Oxford University's St. John's College wanted the college to immediately sell more than $10 million of its endowment invested in Shell and BP. The college's bursar, Andrew Parker made them a counteroffer: \"I am not able to arrange any divestment at short notice. But I can arrange for the gas central heating in college to be switched off with immediate effect. Please let me know if you support this proposal.\" Apparently, this idea did not go over well.\n\nA climate advocacy group called Skeptical Science hosts a list of academics and others whom it labels \"climate misinformers.\" One of the 17 academics on the list is Judith Curry, formerly the chair of the School of Earth and Atmospheric Sciences at Georgia Tech,. One of the principals of Skeptical Science, Dana Nuccitelli wrote of her: \"if you look at the statements we cataloged and debunked on her page, it should make her unhirable in academia.\"\n\nRoger Pielke Jr. spoke to Prof. Curry about the Skeptical Science list and was told that in 2012 she was informed by the Dean at Georgia Tech that she had to step down because of \"extreme displeasure by several activist climate scientists who had a very direct pipeline to the Dean.\" Prof. Curry's subsequent attempts to secure another academic position failed because \"I was an outstanding candidate, looked excellent on paper, articulated a strong vision, and interviewed very well in person. The showstopper was my public profile in the climate debate, as evidenced by a simple Google search.\"\n\nAs Dr. Pielke puts it, \"what has happened to Curry is just the tip of the iceberg.\"\n\nWe are pleased to announce an enlightening climate policy and science evening featuring two excellent speakers.\n\nIn the name of saving the planet, activists are shutting down free speech. They're getting people fired. They're poking their nose into every corner of your life. Freedom is going extinct, one climate measure at a time.\n\n\"10 Reasons Why there is No Climate Emergency\"\n\nThe current claims of a \"climate emergency\" are shown to be gross exaggerations. Recent warming of the climate system has been modest and benign, and at the low end of the warming predicted by the computerized climate model projections used to guide changes in national energy policy. Climate model projections of human-caused climate change are based upon the assumption that climate does not change naturally, and so represent an example of circular reasoning. From sea level rise to wildfires to severe weather, there has been little to no change observed which is outside the realm of natural variation. Thus, the \"climate emergency\" claims are not based upon science.\n\nThese presentations are designed for the general public. No special climate policy or science knowledge required.\n\nDoors open at 5:45 pm. The event opens with a buffet dinner (included) during the mix 'n mingle from 6:00-7:00 pm followed by opening messages and our speakers.\n\nDeadline to order tickets here is March 27, 2020. Early bird tickets are on sale until February 29, 2020. As climate dogma increases, your freedoms are lost, your kids are scared. Debunk it! Join us April 6th.\n\nJanuary 21 saw the launch of the Canadian Institute for Climate Choices with the help of $20 million over five years from the federal government. The institute, which will maintain independent control over its own research and reporting, is the result of a partnership between 15 climate-focused organizations that answered a federal call for proposals in 2018. Three expert panels focused on adaptation, mitigation and clean growth will inform the institute's work. Also on January 21 the institute issued its first report, Charting Our Course - Bringing clarity to Canada's climate policy choices on the journey to 2050. Using an analogy of Canada as a ship facing a climate change storm heading towards it (threatening floods, heatwaves, wildfires, and sea-level rise), the document sets out key aspirations:\n• Making communities and infrastructure more resilient to the inevitable impacts of a changing climate;\n• Growing the prosperity of Canadians across all regions, all communities, and all socio-economic circumstances.\n\nWhile the aspirations are clear, how to achieve them is not, because \"for many Canadians, climate change remains complex, confusing, and potentially paralyzing.\" So, the report \"is a starting point for a deeper, broader, and more constructive conversation about how we can chart a course as a country through the profound changes ahead to a resilient and prosperous future with cleaner and more inclusive growth.\" The report concludes with four recommendations:\n• Canadian governments should broaden objectives for climate policy (e.g., going beyond achieving emission-reduction targets);\n• Canadian governments should embrace Canada 's role in global outcomes (i.e., influence global change rather than reacting to it);\n• Canadian governments should expand the scope, scale, and pace of climate policies (i.e., increasing \"ambition\");\n• Those analyzing and developing policy options should seek out integrated solutions that drive multiple benefits (i.e., break down traditional policy silos and get \"all hands on deck\" for the hard work required.)\n\nCLINTEL (\"climate intelligence\") is a rapidly growing international group, led by prominent scientists, who oppose the ill-founded attempts to scare people into hasty climate policy actions. It recently issued a World Climate Declaration denouncing scaremongering, and this new manifesto provides detailed scientific backup for the WCD for a wide public. The manifesto was authored by Professor Guus Berkhout, President of CLINTEL, who explains it in an 11-minute video. The focus of the manifesto is on climate-related modeling, which it says is unfit for purpose. \u009d The purpose in this case is predicting future climate change. Modeling dominates climate science. It also provides the scary scenarios that drive hugely expensive and disruptive climate emergency action policies.\n\nThe manifesto lists four reasons why today's models are no good:\n• They exclude many natural factors and assume that all climate change is due to human influence;\n• They lack consideration of historical data regarding climate sensitivity to CO ;\n• The models cannot explain past warming and cooling.\n\nPaul Homewood, who runs the blog Not a Lot of People Know That, posted an article titled Green ideology, not climate change makes wildfires worse that was sourced from an commentary of last March by the Volunteer Firefighters Association of New South Wales. Mr. Homewood's post was shared on Facebook by Friends of Science. However, Facebook decided to flag the FoS post as \"Misleading\" based on a report by the self-proclaimed fact-checking site Climate Feedback. Following the Misleading stamp Climate Feedback provided several paragraphs of text supporting the orthodox view on climate change being behind the severity of the Aussie bushfires.\n\nMr. Homewood finds the decision by Facebook to flag the post extremely troubling in a number of ways:\n• Who decides who should be the arbiter of facts, and how is this decision made?\n• The claim that Climate Feedback says is misleading was never made in Mr. Homewood's piece, but was taken from a Breitbart article;\n• Climate Feedback failed to find anything incorrect in the FoS post. Mr. Homewood then examines some highly questionable statements in the Factcheck post.\n\nMr. Homewood isn't the only one concerned about censoring of climate-related posts on social media, but in this case it's about not enough censorship. Here, DeSmog accuses Google's affiliate YouTube of \"promoting climate science denial\" while earning ad money by doing so. Since February 2019 DeSmog has been aware that YouTube's search algorithm was leading unsuspecting viewers \"into an alternate universe where facts, physics, and real-world experiences are replaced by conspiracies, cherry-picking, and fossil fuel backed propaganda.\" Back then DeSmog took comfort in a Google white paper wherein it detailed its work \"to tackle the intentional spread of misinformation across Google Search, Google News, YouTube and our advertising systems.\"\n\nAlas, the promise of Google's white paper counted for little when DeSmog became aware of a report of January 15 by Avaaz titled Why is YouTube Broadcasting Climate Misinformation to Millions? In this document Avaaz describes how it \"set out to analyze how effectively YouTube is protecting its users from climate misinformation,\" relating in detail the role of the algorithm, examples of \"climate misinformation\" videos, brands advertised, and then listing recommendations. Avaaz' key findings:\n• For the search term global warming, \u009d 16% of the top 100 related videos included under the up-next feature and suggestions bar had misinformation about climate change;\n• The climate misinformation videos that Avaaz reviewed had 21.1 million views collectively;\n• Avaaz was able to identify 108 brands running ads on these climate misinformation videos;\n• Even worse, one in five of these ads found were from green or ethical brands including Greenpeace, WWF and Save the Children.\n\nAvaaz recommends that YouTube: detox its algorithm; demonetize disinformation and correct the record.\n\nUS House Democrats Want Google to Censor ALL Climate Dissent\n\nRep. Kathy Castor (D-FL), chair of the House Select Committee on the Climate Crisis, has written a letter to Google and Alphabet Inc. CEO Sundar Pichai urging him to suppress dangerous climate misinformation on YouTube. \u009d The letter makes a number of demands for censorship from YouTube, calling on the video-sharing platform to:\n• Stop promoting climate denial and climate disinformation videos by removing them immediately from the platform 's recommendation algorithm;\n• Add climate misinformation \u009d to the platform 's list of borderline content;\n• Stop monetizing videos that promote harmful misinformation and falsehoods and about the causes and effects of the climate crisis;\n• Take steps to correct the record for millions of users who have been exposed to climate misinformation on YouTube.\n\nUnlike European countries, progressives in the US are theoretically prevented by the First Amendment from passing laws against lawful content on tech platforms. However, this does not stop politicians like Rep. Castor from making censorship demands of tech companies. Two days after her letter Rep. Castor was accused of censorship by climate skeptics.\n\nThis year the speakers at the World Economic Forum in Davos included Swedish climate worrier Greta Thunberg and US President Donald Trump. First up on January 21 was Ms. Thunberg, who expressed disappointment that the world is neither listening nor reacting to her repeated warnings of impending climate catastrophe, saying basically nothing \u009d has changed since she dropped out of school and began full-time climate protesting. In an interview she asserted that there are less than eight years to prevent a global temperature rise of 1.5 °C.\n\nMr. Trump wasn't having any apocalyptic nonsense, stating \"this is not a time for pessimists. It is a time for optimism.\" He then listed some of the doomsday predictions which failed to come true: (1) They predicted an overpopulation crisis in the 1960s, mass starvation in the 70s, the end of oil in the 1990s. \u009d (2) These alarmists always demand the same thing: absolute power to dominate, transform and control every aspect of our lives. We will never let radical socialists destroy our economy, wreck our country, eradicate our liberty. \u009d His speech noted that, while many European countries struggle with crippling energy costs, the American energy revolution is saving American families $2,500 every year by lowering electric bills.\n\nOn January 14 the EU Commission revealed its long-awaited Just Transition Mechanism as a \"pledge of solidarity and fairness\" to make sure that no one is left behind in the bloc's Green Deal ambition to become carbon neutral by 2050. Under the new proposal carbon-intensive regions and industries will be able to apply for money from a Just Transition Fund (JTF), opening the door for producers of steel and plastics, and not just coal miners, peat farmers and oil-shale workers. The aim for the JTF is to mobilize capital worth ‚ 100 billion through grants, private investment and support from the European Investment Bank. The EU itself will contribute just ‚ 7.5 billion.\n\nHowever, the fund 's promised ‚ 7.5 billion figure has already been criticized for being too low to match the size of the challenge ahead. One German member of the European Parliament likened the overall ‚ 100 billion figure to a slight of hand \u009d and compared the Commission to street magicians \u009d, while Friends of the Earth Europe said it is too little to match the scale of transformation needed to confront the planetary emergency.\" The trade union group ETUC Confederal said in a statement the funding proposed for 10 years is what would be needed every year to achieve climate neutrality by 2050 in a fair way.\"\n\nEU climate chief Frans Timmermans acknowledged that the ‚ 100 billion is just a start \u009d but insisted that the fairness of the proposal will inspire the rest of the Green Deal.\n\nUN: World Needs to Prepare for Millions of Climate Refugees\n\nOn January 20 the UN Human Rights Committee made a landmark ruling in relation to a man from the Pacific nation of Kiribati who brought a case against New Zealand after authorities there denied his claim of asylum because of climate change. The Committee determined that countries cannot deport people who have sought asylum due to climate-related threats. The next day in Davos the UN's high commissioner for refugees referred to that ruling and said that the world needs to prepare for millions of people being driven from their homes by the impact of climate change. We must be prepared for a large surge of people moving against their will,\" he said. \"I wouldn't venture to talk about specific numbers, it's too speculative, but certainly we're talking about millions here.\"\n\nFive years ago 21 young people, represented by Our Children's Trust sued the US government alleging that it was violating their constitutional rights by contributing to climate change despite knowing its dangerous consequences. Both the Obama and the Trump administrations tried multiple times to get the case, known as Juliana v. United States, thrown out. However, an Oregon district court judge ruled that the case had legal standing.\n\nIn a 2-1 decision on January 17 the Ninth US Circuit Court of Appeals \" reluctantly concluded that the plaintiffs' case must be made to the political branches or to the electorate.\" One of the two judges behind the decision wrote that \"although the plaintiffs \"made a compelling case that action is needed,\" it was beyond the court's power to \"order, design, supervise, or implement the plaintiffs' requested remedial plan.\" The dissenting judge wrote that the youth plaintiffs have standing to challenge the government 's conduct, have articulated claims under the Constitution, and have presented sufficient evidence to press those claims at trial. Counsel for the youth plaintiffs vowed to ask the full Ninth Circuit to review the determination that federal courts can do nothing to address an admitted constitutional violation.\n\nIn Canada there is a similar youth lawsuit, La Rose et. al. v. Her Majesty the Queen, modelled on Juliana, that was filed last October and is still pending.\n\nTime to Silence the Voices of Denial\n\nThis is the title of an editorial in the Winnipeg Free Press that bemoans the fact that, despite the \"grim studies\" and \"pleas from scientists, who have reached a near-universal consensus on human-made climate change,\" climate skeptics do not take the issue seriously. In the opinion of the FP's editors \"climate change deniers \u009d have been controlling the conversation and should no longer be part of it. The editorial caught the attention of Donna Laframboise who noticed when one of the duplicate versions disappeared from the FP's website. In her view newspapers are supposed to promote debate about society's most pressing problems, not silence intellectual minorities such as climate skeptics.\n\nAnti-energy researcher Naomi Oreskes calls for regulations on free speech. She accuses the fossil-fuel industry of exploiting the journalistic ideals of fairness, objectivity and balance by manipulating journalists into presenting propaganda for the other side. Since all previous electronic media radio, telephone and television have been regulated, so should its newest form. Also, Ms. Oreskes wants the US Congress to investigate the fossil fuel industry and its allies, \u009d as a precursor to possible criminal charges.\n\nIn Germany climate activists are using local declarations of climate emergency to call for laws to punish those who trivialize the climate catastrophe and thereby sabotage the emergency measures to deal with it. The last time there were emergency laws in Germany was 80 years ago.\n\nAccording to the Financial Times, giving ordinary people a say over public policy impedes climate action, because we don 't care enough about other people 's problems. Edward Luce the US national editor of the FT writes that harrowing images of the Australian bushfires and the California wildfires should be blowing a hole in such complacency. Instead, they show how hard it is for democracies to mobilize public action.\n\nOne obstacle is that it's difficult for governments, because of the electoral cycle, to take unpopular actions to reduce CO emissions. A second is the uncertainty of establishing that any single disaster is entirely man-made (i.e., due to human CO emissions.) The third is human nature: people don't like to be lectured on climate change by 17-year old girls.\n\nThe bushfires blazing throughout Australia have gotten a lot of press. Predictably, mainstream papers like the NY Times blamed Australia for committing climate suicide, calling the country \"ground zero for the climate catastrophe.\" Prime Minister Scott Morrison's attempt to play both sides of the climate game spectacularly backfired. There are direct human causes for the fires than climate change however bad forestry practices and arson. Thirty years of misguided green ideology, vested interests, political failure and forestry mismanagement have created a massive bushfire threat. Police across Queensland, New South Wales, Victoria, South Australia and Tasmania have arrested 183 people for lighting bushfires. Patrick Michaels and Myron Ebel compare the similarities between Californian and Australian practices in politics, forest management practices and responses to the inevitable fires that ensue.\n\nOthers have been looking at the historical and scientific context for the fires. Considering the past 119 years of Australian rainfall, while the most recent two years have been dry, over the last half century the country has been a lot wetter than the previous half century. Jennifer Marohasy points out that it has been hotter and fires have burned larger areas. In particular there was one fire catastrophe in 1939 that burned 2 million ha.\n\nOntario Government Cancels Approval for Nearly Completed Wind Farm to Save Endangered Bat Species\n\nShortly after taking office in 2018 the new Ontario government cancelled 758 wind projects for economic reasons. In December 2019 the government pulled the plug on the almost complete Nations Rise project near Ottawa. The project had been granted approval for up 33 turbines (later scaled back to 29) at a cost of $200 million. It was intended to generate up to 100 megawatts of electricity under a 20-year, $400-million contract awarded by the province's Independent Electric System Operator.The reason for the cancellation was to prevent the inevitable annihilation of Hoary, Big and Little Brown bats; the Little Brown bat is identified as one of Ontario 's \"Species at Risk.\"\n\nThe wind farm had caused deep divisions in the community as the township had twice voted against being a willing host \u009d for the project. While some 70 property owners were happy about leasing land to the project's owner EDP Renewables, many others were concerned about noise, the visual disruption and the possible impacts on health and the water table in the area. EDP is now assessing \"possible legal actions.\"\n\nDespite its cool Green parties and ambitious wind and solar agendas, Europe remains by far the world's largest importer of oil and natural gas. As oil output from the North Sea and the coast of Norway declines, the European Union is quietly looking for fossil fuel energy anywhere it can find it. Despite Europe's having more reserves of shale gas than the US, most European countries shun horizontal drilling and fracking, leaving the continent dependent on Russia, the Middle East and Africa for its energy. What ensures that Europeans have enough daily gasoline and home heating fuel are not batteries, wind farms and solar panels much less loud green proselytizing. They count instead on a mercurial Russia, an array of unstable Middle Eastern governments and an underappreciated US military.\n\nIt is hard to be both the world largest importer of gas and oil and the loudest critic of fossil fuels, but Europe has managed to do it.\n\nGermany Rejects EU Call for More Money to Fight Climate Change\n\nThe German government is resisting a plea by Brussels to provide more funding to get the EU's flagship climate change policy off the ground in a blow the continent's decarbonisation hopes. Promoted by Commission President Ursula von der Leyen, the bloc's ambitious ‚ 1 trillion Green Deal includes a new \"Just Transition Mechanism\" to compensate and regenerate areas that currently depend on carbon-intensive industries like coal mining. But Germany 's finance ministry has already started the year by rejecting calls for more funding, stating that the current EU budget is sufficient to meet the continent's climate goal of going carbon neutral by 2050. The ministry also dismissed the idea of increasing the capital limit on the European Investment Bank, which Ms. von der Leyen had suggested could also help close the funding gap.\n\nGreta To Lecture World Leaders at Davos About Ending Fossil Fuels\n\nTeen climate change activist Greta Thunberg plans to join other youth at the World Economic Forum on January 21 in Davos, Switzerland, where they will admonish world leaders for providing subsidies to the oil and gas industry, which is responsible, in part, for advancing civilization by providing abundant and affordable energy. Among the calls of the youth group: \"We demand that at this year 's Forum, participants from all companies, banks, institutions and governments immediately halt all investments in fossil fuel exploration and extraction, immediately end all fossil fuel subsidies and immediately and completely divest from fossil fuels. We don 't want these things done by 2050, 2030 or even 2021, we want this done now as in right now.\"\n\nAccording to the Science Daily website removing fossil-fuel subsidies will not reduce CO emissions and renewable energy use as much as hoped. The largest emissions savings would be in oil and gas exporting countries, where fewer poor people would be affected, and subsidy removal can be aided by currently low oil prices.\n\nAfter finishing his term as governor of the Bank of England this year, Mark Carney will become the UN 's special envoy on climate action and finance. He is using his final days as governor to intimate institutional financial managers by suggesting that investments in conventional, fossil-fuel energy are high-risk ventures requiring special justification. When asked point-blank in a recent interview whether he supported divestment \u009d from fossil fuels he tactfully evaded the question but nevertheless asserted that coal, oil and gas were insecure assets. John Constable, energy editor of the Global Warming Policy Forum, cites data from the International Energy Agency showing that nearly all the growth in global energy consumption since 1990 has been accounted for by fossil fuels.\n\nTerence Corcoran of the Financial Post notes that Mr. Carney is just part of an international movement to turn the world 's energy investors into pawns of state climate activists and agitators for market-distorting policies. The movement wants a new model of financial markets, one that is sustainable \u009d and green \u009d and social \u009d and environmental \u009d and equitable.\" Mr. Corcoran argues that the real risks in energy markets is not the likelihood of stranded coal and oil reserves, but renewables which have failed to make advances despite three decades of incentives, mandates, subsidies and other unsustainable policies, as shown by Germany's dismal experience.\n\nDecades of Public Opinion: Climate Change Is Not on the Radar\n\nEach month, Gallup polling asks 1,000 random members of the US public to identify the most important problem facing this country today. \u009d Donna Laframboise has analyzed Gallup's results for the past two decades, finding that two or three answers typically dominate (economy, government, domestic issues), followed by a long list of concerns mentioned by small numbers of people. However, over the past two decades climate change has never been part of the table of top four issues, meaning it's a less than marginal concern.\n\nThe Crescent Dunes thermal solar plant in central Nevada looks like something out of a sci-fi movie. Ten thousand mirrors form a spiral almost 2 miles wide that winds around a skyscraper rising above the desert between Las Vegas and Reno. The operation soaks up enough heat from the sun 's rays to spin steam turbines and store energy in the form of molten salt. This feature overcomes the greatest weakness in solar electricity: supplying power outside the hours of peak sunshine. In 2011 the $1 billion project was to be the biggest solar project of its kind, supported by $737 million in federal government loan guarantees.\n\nThe steam generators at Crescent Dunes require custom parts and a staff of dozens to keep things humming and to conduct regular maintenance. When the plant opened in 2015 the cost of solar PV electricity (which requires little ongoing maintenance) fell to less than the $135/MWh that Crescent Dunes was charging its customer NV Energy. Today PV-produced electricity costs less than $30/MWh. Last April Crescent Dunes shut down and the US Energy Department took control in August.\n\nOn December 10 ExxonMobil emerged victorious in a securities fraud trial that examined its internal accounting for the financial risks of climate change, in a striking rejection of claims by the New York attorney general that the company misled investors for years. New York State Supreme Court Judge Barry Ostrage cleared ExxonMobil of fraud claims saying that New York 's attorney general failed to establish that the oil company had deceived investors about how it accounted for the cost of future climate change regulation. However, the judge did not let ExxonMobil entirely off the hook, saying: \"Nothing in this opinion is intended to absolve ExxonMobil from responsibility for contributing to climate change through the emission of greenhouse gases in the production of its fossil fuel products.\"\n\nDuring the trial, the office of New York Attorney General Letitia James accused the company of using two different accounting methods one public, and one internal to project its business costs in countries that were expected to implement policies to combat climate change.\n\nThe Rockefeller Family Fund's executive director, who was the instigator of the New York AG's investigation against ExxonMobil, seemed disappointed to learn the limits of his attempts to use public officials to prosecute his enemies. RealClear Energy published a legal analysis of this case and similar ones involving state attorneys general. The problem for the states is that they have no jurisdiction over climate change, which is why the New York AG charged ExxonMobil with securities fraud, which proved too much of a stretch to secure conviction. It was a case of misguided idealism that became impatient with the basic principle of the rule of law, thwarted by an \"old fashioned\" trial judge who looked at whether the evidence supported the charges filed.\n\nA judgment in the Dutch Supreme Court has left the Netherlands government with a legal requirement to perform the politically suicidal task of cutting emissions 25% by the end of 2020, The case was brought six years ago by the Urgenda (\"urgent agenda\") environmental group in a bid to force ministers to go well beyond EU targets. However, the chances of reaching the 20% target look slim, as emissions in 2018 were down only 15% on 1990 levels.\n\nThe court based its ruling on the UN climate convention and the state's legal obligation to protect the lives and well-being of Dutch citizens. There is a great deal of consensus in the scientific and international community over the urgent need for a reduction in greenhouse gases by at least 25% by developed countries, \u009d the court said. As an editorial by the Compeititive Enterprise Institute puts it: \"This is judicial tyranny in overdrive.\"\n\nAfter winning the June 2018 election the new government of Doug Ford cancelled the rebate of up to $14,000 for electric vehicles, saying that the money was going to people who could already afford expensive cars. In the first six months of 2019 sales in Ontario were down 59% compared to the same period in 2018 (2,933 vs 7,110). Rebates are key because the up-front cost of an electric vehicle can be anywhere from $10,000 to $30,000 more than a similar gas-powered car. Nationally, the federal government introduced a $5,000 rebate last spring, but EVs are still only a 3.5%, a far cry from the government's target of 10% by 2025.\n\nPrior to Congress taking its December recess automakers were hoping that it would extend the electric vehicle tax credits. The extension got through the House, but not the Senate, which wasn't interested. While the current $7,500 EV tax credit remains in place, Tesla and General Motors have both reached their 200,000-vehicle quota. They and other automakers lobbied for an expansion, one which would have seen a $7,000 credit kept in place until a manufacturer sold 600,000 electric automobiles.\n\nOn December 11 the European Commission unveiled its European Green Deal with the objective of reaching net zero CO emissions by 2050, a goal which would be enshrined in a \"Climate Law\", to be presented in March 2020. The Commission expects to update the bloc's climate ambition by revising its 2030 objective of a 40% cut in emissions to 50-55%. Beside CO emission targets, the deal includes a \"circular economy\", building renovation, zero pollution, ecosystems and diversity, farm-to-fork strategy, transport and money (with a \"leave no one behind\" Just Transition Mechanism), R&D and innovation, and external relations (including a proposal for a carbon border tax.)\n\nThe Green Deal failed its first test at the December 12 meeting of the European Council (made up of the heads of government), where Poland refused to give the required unanimous endorsement. According to the Council's official conclusions: \"One Member State, at this stage, cannot commit to implement this objective as far as it is concerned, and the European Council will come back to this in June 2020 \" A previous effort to get the EU to commit to net-zero emissions by the mid-century was blocked by Poland, Hungary, and the Czech Republic in June 2019.\n\nFormer vice president and presidential candidate Joe Biden told a crowd in Peterborough, New Hampshire that if fossil fuel executives don 't take accountability for helping to doom the environment, we should throw them in jail. In order to curb the rate of pollution, Mr. Biden explained, we need to hold fossil fuel executives liable for what they have done, particularly in those cases where there are underserved neighborhoods. When they don 't deliver, he said, put them in jail. \u009d\n\nClimate Activist and Bank of England Governor Mark Carney is taking on a new role as UN 's new Special Envoy for Climate Action. Describing the Canadian as a remarkable pioneer in pushing the financial sector to act on climate \u009d, the UN Secretary General said the new envoy would be focusing on ambitious implementation of action, especially shifting markets and mobilizing private finance, towards limiting global warming to the key 1.5 °C mark. Mr. Carney replaces former New York mayor and billionaire philanthropist, Michael Bloomberg, who has embarked on a US presidential run.\n\nAfrica has the world's lowest electrification rateï¼\u008d613 kWh/year per capita, compared to 6,500 kWh/year in Europe and 13,000 kWh/year in the US. Over 600 million people in sub-Saharan Africa have no electricity and 700 million rely on wood, grass and dung for cooking and heating. The African Development Bank (AfDB) launched a $12 billion New Deal for Energy in 2017, with the goal of 100% access to electricity in urban areas and 95% access in rural areas by 2025.\n\nTthen the AfDB caved to carbon-colonialist pressure, joining the World Bank, Goldman Sachs and other multi-lateral banks in caring more about climate alarmism and avoiding criticism than about safeguarding the lives, livelihoods, health and living standards of electricity-deprived Africans. The AfDB now says almost nothing about coal or even natural gas. Its new themes include responding to global concerns about climate change, gradually adopting a low-carbon and sustainable growth path, \u009d significantly reducing reliance on fossil fuels, and transitioning to green growth \u009d and clean renewable energy.\"\n\n\"I don't want to die!\"ï¼\u008dClimate Exploitation of Children\n\nLast October a group of seven and eight year olds gathered in their school library in Toronto to watch a video of Greta Thunberg's speech to the UN on September 23. During the presentation at least one child yelled \"I don 't want to die!. A mother said the carbon clock displayed after the speech showing an eight-year count down had her daughter crying: \"Mommy, they said that we 're going to die in eight years.\"\n\nThis 7:49 video by Friends of Science describes how environmental charities like Ecojustice and foundations like \"We Don't Have Time\" are using children as pawns in a climate lawsuit against the Ontario government. Similar climate fear-mongers are behind the visits to schools like the one in Toronto.\n\nWhy Green \u009d Energy Is Such a Terrible Idea\n\nUsing wind power to replace the 3.9 billion MWh that Americans consumed in 2018, coal and gas-fired backup power plants, natural gas for home heating, coal and gas for factories, and gasoline for vehicles while generating enough extra electricity every windy day to charge batteries for just seven straight windless days would require some 14 million 1.8-MW wind turbines. These turbines, sprawling across ¾ of the lower 48 states, would require 15 billion tons of steel, concrete and other materials and would wipe out eagles, hawks, bats and other species. Each wind turbine requires 900 tons of steel, 2,500 tons of concrete, and 45 tons of non-recyclable plastic (to be disposed of in landfills after the 20-year life of the turbine.)\n\nBattery back up the turbines for seven consecutive windless days would require one billion half-ton Tesla batteries costing $6.6 trillion. That means still more raw materials, hazardous chemicals and toxic metals. Then there would be thousands of miles of new transmission lines to connect the turbines to the grid.\n\nGreen \u009d energy is basically a hoax. The world runs on fossil fuels and will continue to do so until nuclear energy is adopted on a mass scale, or another reliable, high-intensity energy source is discovered. As Matt Ridley argues, in 2014, the last year for which there are reliable figures, wind power supplied zero percent (rounded to a whole number) of the world's energy consumption.\n\nBj ¸rn Lomborg writes that climate campaigners and the media urge people to change their everyday behaviour - like switching to energy-efficient light bulbs, washing clothes in cold water, eating less meat and buying an electric car. Such gestures have only a limited effect on emissions. For example, unplugging a phone charger when not in use would save less than 1/2,000 of the average person's CO emissions. Moreover, charging accounts for less than 1% of a phone's energy needs; the other 99% comes from handset manufacture and operating of the data centres and cell towers.\n\nGoing vegetarian reduces individual CO emissions by 540 kg, or just 4.3% of the emissions of an average developed-country individual. An electric car with a range of 400 km has a huge carbon deficit when it hits the road, and will start saving emissions only after being driven 60,000 km. Yet, most EV owners use them as a second care.\n\nWe spend $129 billion/year subsidizing solar and wind energy, but these sources supply just 1.1% of our global energy needs. The IEA estimates that by 2040 after we have spent a whopping $3.5 trillion on additional subsidies solar and wind will still meet less than 5% of our needs.", "opengraph": {"type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["fos-extracts-2020-table-of-contents.html", "http://fossevents.ca/", "https://www.thegwpf.com/uns-call-for-climate-emergency-is-an-invitation-to-misery-in-developing-countries/", "https://judithcurry.com/2020/08/25/new-confirmation-that-climate-models-overstate-atmospheric-warming/?utm_source=CCNet+Newsletter&utm_campaign=52f7f8f729-EMAIL_CAMPAIGN_2020_08_28_12_38_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-52f7f8f729-36444685&mc_cid=52f7f8f729&mc_eid=e7afeae225", "https://wattsupwiththat.com/2020/12/02/were-saved-new-zealand-just-declared-a-climate-emergency/", "https://wattsupwiththat.com/2020/12/16/greta-thunberg-slams-new-zealands-unambitious-climate-emergency/", "https://www.abc.net.au/news/2020-12-15/ardern-defends-nz-climate-change-goals-after-thunberg-tweet/12987266", "https://www.thegwpf.com/green-groups-are-chinas-useful-idiots/", "https://www.thegwpf.org/content/uploads/2020/12/Green-reds.pdf", "https://www.cbc.ca/news/health/operation-warp-speed-trump-pfizer-moderna-vaccine-1.5806820", "https://chrysalix.com/team_members/dr-wal-van-lierop/", "https://wattsupwiththat.com/2020/12/20/forbes-climate-crisis-lock-in-lifestyle-changes-brought-about-by-covid-19/", "https://www.forbes.com/sites/walvanlierop/2020/12/19/we-need-an-operation-warp-speed-to-battle-climate-change/?sh=4f55f5e478bf", "https://wattsupwiththat.com/2020/12/20/bidens-energy-plans-are-expensive-and-dangerous/", "https://wattsupwiththat.com/2020/12/24/new-york-cant-buy-its-way-out-of-blackouts/", "https://www.thegwpf.com/rupert-darwall-the-imfs-net-zero-fairy-tale/", "https://www.imf.org/en/Publications/WEO/Issues/2020/09/30/world-economic-outlook-october-2020", "https://www.euractiv.com/section/energy-environment/news/eu-countries-agree-to-rapidly-upscale-hydrogen-market/", "https://www.consilium.europa.eu/media/47373/st13976-en20.pdf", "https://blog.friendsofscience.org/2020/11/27/climate-activism-donna-laframboise-live-online-dec-8-2020-7pm-mst/", "https://www.canada.ca/en/environment-climate-change/services/managing-pollution/energy-production/fuel-regulations/clean-fuel-standard.html", "https://financialpost.com/opinion/ross-mckitrick-ottawas-clean-fuel-standard-is-overkill-in-your-tank", "https://www.lfxassociates.ca/uploads/4/8/0/8/4808045/20200925_assessment_of_cfs.pdf", "https://www.climatechangenews.com/2020/11/20/canada-sets-enshrine-2050-net-zero-emissions-goal-law/", "https://parl.ca/DocumentViewer/en/43-2/bill/C-12/first-reading", "https://www.thestar.com/politics/federal/2020/11/19/liberals-table-climate-accountability-legislation-to-set-emissions-targets-in-law.html?rf", "https://lawliberty.org/sustainable-newspeak-by-2050/", "https://www.thegwpf.com/will-trump-send-the-paris-agreement-to-the-us-senate/?utm_source=CCNet+Newsletter&utm_campaign=bdcbe3941e-EMAIL_CAMPAIGN_2020_11_30_01_04_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-bdcbe3941e-20168513&mc_cid=bdcbe3941e&mc_eid=84563077b7", "https://www.thegwpf.com/us-climate-envoy-john-kerry-warns-china-paris-agreement-is-not-enough-to-stop-global-warming/", "https://twitter.com/JohnKerry/status/1331344090047328258", "https://www.thegwpf.com/beware-green-appeasement-john-kerry-chinas-price-for-climate-promises/", "https://www.forbes.com/sites/prakashdolsak/2020/11/24/john-kerry-as-presidential-climate-envoy-virtue-signaling-or-the-path-to-climate-policy-progress/?sh=7340884a44d2", "https://www.thegwpf.com/lockdown-forever-radical-activists-ask-biden-to-declare-climate-emergency/", "https://www.euractiv.com/section/energy-environment/news/warsaw-says-further-analysis-needed-before-eu-2030-climate-target-can-be-agreed/", "https://www.euractiv.com/section/energy-environment/news/business-groups-clash-over-eus-2030-climate-goal/", "https://www.euractiv.com/wp-content/uploads/sites/2/2020/11/2030-impact-assessment-points-2020-11-BusinessEurope-Comments-2030-Impact-assessment-1.pdf", "https://leaderpost.com/pmn/business-pmn/german-green-power-targets-wobble-in-merkel-policy-revamp/", "https://www.euractiv.com/section/energy/news/planned-turbine-free-zones-could-halve-germanys-wind-energy-potential/", "https://www.desmogblog.com/2020/11/20/court-ruling-france-climate-targets", "https://www.conseil-etat.fr/en/press-releases/greenhouse-gas-emissions-the-government-must-justify-within-3-months-that-the-reduction-path-to-2030-can-be-achieved", "https://www.youtube.com/watch?v=RqppRC37OgI&feature=youtu.be", "https://notalotofpeopleknowthat.wordpress.com/2020/11/18/electric-cars-are-good-fun-for-wealthy-virtue-signallers-but-a-dreadful-way-to-save-the-planet/", "https://www.brantfordexpositor.ca/opinion/bjorn-lomborg-the-electric-car-wont-get-us-very-far/wcm/10767750-74a5-4190-93eb-681d6bc3314d", "https://www.nber.org/papers/w21437", "https://www.cbc.ca/news/canada/british-columbia/climate-change-lawsuit-fails-dismissed-1.5778952", "https://www.nationalnewswatch.com/2020/10/27/judge-rejects-youths-lawsuit-asking-canada-to-develop-climate-recovery-plan/#.X6GUCi9h1QJ", "http://climatecasechart.com/non-us-case/la-rose-v-her-majesty-the-queen/", "https://www.ourchildrenstrust.org/juliana-v-us", "https://www.nytimes.com/2020/01/17/climate/juliana-climate-case.html?action=click&module=Well&pgtype=Homepage&section=Climate%20and%20Environment", "https://static1.squarespace.com/static/571d109b04426270152febe0/t/5e5e6bf0df133120a5b53f9c/1583246321420/Juliana+Press+Release+3-3-20.pdf", "https://www.thegwpf.com/terence-corcoran-tricks-and-treats-from-peter-foster/", "http://cartoonsbyjosh.co.uk", "https://www.thegwpf.com/socialist-science-economic-growth-is-bad-for-the-climate-europes-science-academies-claim/", "https://easac.eu/media-room/press-releases/details/resistance-and-challenges-to-green-deals-should-not-be-underestimated/", "https://dailycaller.com/2020/10/27/green-new-deal-laws-of-physics/", "https://www.manhattan-institute.org/mines-minerals-and-green-energy-reality-check", "https://www.energy.gov/sites/prod/files/2017/03/f34/quadrennial-technology-review-2015_1.pdf", "https://www.thegwpf.com/green-lobby-up-in-arms-as-france-tears-up-solar-subsidy-contracts/", "https://www.pv-magazine.com/2020/11/09/france-at-risk-of-losing-2-gw-of-solar-capacity-due-to-retroactive-fit-cuts/", "https://www.dbresearch.com/PROD/RPS_EN-PROD/PROD0000000000513730/Konzept_%23_19%3A_What_we_must_do_to_rebuild.PDF?&&undefined&realload=8To5vH~SRt~~zLyD9TdttybTRG4YmEZn05btnOEBPz2oiR8CYbRzPBcI6GpmUJoLvSbZs52EXxdLZ/yUaXxZbg==", "https://stopthesethings.com/2020/10/31/age-of-un-reason-how-fear-ignorance-drives-wind-solar-worship-cult/", "https://www.youtube.com/watch?v=UTgNtvTuYRU&feature=youtu.be", "https://wattsupwiththat.com/2020/10/30/reality-check-on-the-electric-car/", "https://www.thegwpf.com/peter-foster-the-ieas-solar-spin-cycle/", "https://www.iea.org/reports/world-energy-outlook-2020", "https://financialpost.com/opinion/jack-m-mintz-watch-out-for-the-carbon-tariff-the-last-thing-this-world-needs-is-another-trade-weapon", "https://www.graincentral.com/markets/world-wheat-crop-tips-record-amis/", "https://www.afdb.org/en/news-and-events/sudans-record-wheat-harvest-proof-bank-agricultural-transformation-program-will-boost-breadbasket-goal-38388", "https://www.theguardian.com/business/2020/sep/22/australia-prepares-for-bumper-harvest-as-rain-boosts-nsw-winter-crops-300?utm_source=CCNet+Newsletter&utm_campaign=eafc20e145-EMAIL_CAMPAIGN_2020_10_22_12_28_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-eafc20e145-36424765&mc_cid=eafc20e145&mc_eid=74a64f7872", "https://climaterealism.com/2020/10/google-sounds-climate-alarm-in-nations-enjoying-crop-production-records/", "https://www.greenbiz.com/article/climate-change-will-continue-widen-gaps-food-security-new-study-finds", "http://www.fao.org/worldfoodsituation/csdb/en/", "https://www.independent.co.uk/environment/eu-agricultural-policy-cap-mep-vote-reform-farming-climate-change-extinction-b1226540.html", "https://www.thegwpf.com/eu-leaders-divided-over-new-climate-goals-for-2030/", "https://www.consilium.europa.eu/en/press/press-releases/2020/10/16/european-council-conclusions-on-covid-19-and-climate-change-15-october-2020/", "https://www.bbc.com/news/uk-politics-54421489", "https://www.ed.ac.uk/profile/prof-gordon-hughes", "https://www.thegwpf.com/boris-johnsons-pledge-of-wind-power-for-every-home-could-cost-consumers-27-billion-a-year/", "https://www.thegwpf.com/lack-of-wind-sparks-national-grid-energy-alert/", "https://www.thegwpf.com/national-grid-warns-lack-of-wind-could-plunge-britain-into-darkness/", "https://www.thegwpf.org/content/uploads/2020/06/Constable-Brink-of-Darkness.pdf", "https://wattsupwiththat.com/2019/12/20/dutch-court-upholds-government-order-to-cut-emissions-25-by-eoy-2020/", "https://uitspraken.rechtspraak.nl/inziendocument?id=ECLI%3ANL%3AHR%3A2019%3A2007&fbclid=IwAR1DQ7g-JAD38BAwQH29tEwfdpN1VxYBoMrWuE81vCvZx6EQuj4uJJVpcOw", "https://wattsupwiththat.com/2020/10/04/the-conversation-canadian-climate-lawsuit-boosted-by-a-dutch-climate-activist-victory/", "https://wattsupwiththat.com/2019/10/17/furious-farmers-defy-army-roadblocks-in-dutch-anti-green-protest/", "https://judithcurry.com/2020/10/16/climate-science-and-the-supreme-court/", "https://twitter.com/search?q=Amy%20Coney%20Barrett%20climate%20change&src=typed_query", "https://www.esquire.com/news-politics/a34370392/amy-coney-barrett-climate-change-im-not-a-scientist/", "https://govoversight.org/u-s-to-be-subject-to-un-climate-conciliation-commission-if-re-joins-paris-climate-pact/", "https://www.washingtontimes.com/news/2016/aug/29/obama-will-bypass-senate-ratify-paris-climate-acco/", "https://www.theguardian.com/environment/2020/feb/27/heathrow-third-runway-ruled-illegal-over-climate-change", "https://www.gov.ca.gov/2020/09/23/governor-newsom-announces-california-will-phase-out-gasoline-powered-cars-drastically-reduce-demand-for-fossil-fuel-in-californias-fight-against-climate-change/", "https://www.gov.ca.gov/2020/10/07/governor-newsom-launches-innovative-strategies-to-use-california-land-to-fight-climate-change-conserve-biodiversity-and-boost-climate-resilience/", "https://wattsupwiththat.com/2020/10/09/noaa-confirm-heatwaves-are-declining-in-california/", "https://climatechangedispatch.com/gov-newsom-pushes-wildfire-climate-change-link-with-trump/", "https://www.forbes.com/sites/michaelshellenberger/2020/09/13/forests-that-survive-megafires-prove-good-management-trumps-climate-change/#8a3773d1305a", "https://www.forbes.com/sites/michaelshellenberger/2020/09/10/why-environmental-alarmism-makes-forest-fires-worse/#3a495dc13712", "https://amgreatness.com/2020/09/09/environmentalists-destroyed-californias-forests/", "https://wattsupwiththat.com/2020/09/14/gavin-newsoms-exceedingly-ignorant-climate-claim/", "https://www.dailysignal.com/2020/09/18/qa-why-the-wildfires-are-so-bad-and-what-we-should-do/?utm_source=TDS_Email", "https://blog.metoffice.gov.uk/2020/09/21/climate-change-the-perfect-fuel-for-wildfires/", "https://www.thegwpf.com/reality-check-canada-wildfires-at-lowest-level-for-decades/", "https://www.thegwpf.com/antonio-guterress-anti-coal-push-for-india-unrealistic-and-unwelcome%E2%80%A8/", "http://www.andrewoswald.com/docs/IZApaperNowakowsk-Oswald-dp13660.pdf", "https://warwick.ac.uk/newsandevents/pressreleases/research_reveals_climate-change", "https://www.gatesnotes.com/Energy/Climate-and-COVID-19", "https://clintel.org/clintel-open-letter-to-bill-gates/", "https://whyy.org/articles/big-oil-should-pay-for-climate-change-damage-delaware-lawsuit-says/", "https://attorneygeneral.delaware.gov/wp-content/uploads/sites/50/2020/09/2020-09-09-Final-Complaint.pdf", "https://eidclimate.org/the-nationally-coordinated-climate-litigation-campaign-comes-to-delaware/", "http://bidcondocs.delaware.gov/LGL/LGL_191122SpEnvCnsl_rfq.pdf", "https://eidclimate.org/latest-sher-edling-climate-lawsuit-further-exposes-anti-energy-activist-network/", "https://www.climatechangenews.com/2020/09/03/six-portuguese-youth-file-unprecedented-climate-lawsuit-33-countries/", "https://www.nature.com/articles/s41598-019-50281-2#:~:text=Abstract,than%20120%20human%20lives%20lost.&text=Here%20we%20show%20that%20they,conditions%20during%20the%20fire%20season.", "https://youth4climatejustice.org/assets/images/GLAN_CLIMATE_CASE_PRESS_RELEASE_web.pdf", "https://climateactiontracker.org/countries/", "https://www.forbes.com/sites/neilwinton/2020/09/06/new-electric-cars-perform-wonders-in-towns-rural-roads-but-run-out-of-puff-on-highways/#8dcd16d69ea4", "https://www.recoverytaskforce.ca/wp-content/uploads/2020/09/TFRR-Final-Report_EN.pdf", "https://www.theguardian.com/commentisfree/2020/aug/26/panic-overpopulation-climate-crisis-consumption-environment", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30677-2/fulltext", "https://www.forbes.com/sites/michaelshellenberger/2020/08/27/why-deaths-from-hurricanes-and-other-natural-disasters-are-lower-than-ever/#16c27be41396", "https://journals.ametsoc.org/bams/article/99/7/1359/70330", "https://www.thegwpf.com/solar-energy-projects-face-extinction-as-subsidies-run-out/", "https://www.bbc.com/news/science-environment-53951754", "https://www.nature.com/articles/s41560-020-00686-5", "https://www.eco-business.com/news/are-forests-the-new-coal-global-alarm-sounds-with-biomass-burning/?utm_source=CCNet+Newsletter&utm_campaign=7d945312d1-EMAIL_CAMPAIGN_2020_09_01_01_23_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-7d945312d1-36424765&mc_cid=7d945312d1&mc_eid=74a64f7872", "https://notrickszone.com/2020/09/06/environmental-disaster-northern-europe-deforestation-up-49-due-to-effort-to-meet-co2-targets/", "https://unfccc.int/sites/default/files/resource/unfccc_annual_report_2019.pdf", "https://www.ipcc.ch/site/assets/uploads/2018/03/SREX-Chap3_FINAL-1.pdf", "https://saltbushclub.com/wp-content/uploads/2020/08/green-blackouts.pdf", "https://www.thegwpf.com/extinction-rebellions-plan-for-eco-soviets/", "https://www.dailymail.co.uk/news/article-8703879/Priti-Patel-threatens-change-law-Extinction-Rebellion-zealots-face-five-years-jail.html", "https://www.eastbaytimes.com/2020/08/17/california-blackouts-expose-problems-in-states-transition-to-clean-energy/", "https://californiaglobe.com/section-2/recall-deja-vu-ca-rolling-blackouts-are-back/", "https://www.forbes.com/sites/michaelshellenberger/2020/08/15/why-californias-climate-policies-are-causing-electricity-black-outs/#d2ec6b01591a", "https://www.manhattancontrarian.com/blog/2020-8-16-h7249j4l4p0o64aod9n6qltzirnm6i/", "https://www.realclearenergy.org/articles/2020/07/29/green_policies_wont_keep_california_truckin_500462.html?utm_source=CCNet+Newsletter&utm_campaign=0bf8722d78-EMAIL_CAMPAIGN_2020_08_17_01_15_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-0bf8722d78-20168513&mc_cid=0bf8722d78&mc_eid=84563077b7", "https://wattsupwiththat.com/2020/08/18/gaps-in-renewable-energy-led-to-blackouts-for-millions-of-californians-gov-newsom-says/", "https://www.instituteforenergyresearch.org/the-grid/renewable-mandates-are-leading-to-electricity-shortages-and-price-spikes-in-california/", "https://financialpost.com/opinion/matthew-lau-vanity-is-driving-government-spending-in-this-country/wcm/22a9953e-d8e0-4886-b7ca-dca6d0b486c7/", "https://www.pressreader.com/canada/national-post-latest-edition/20200709/282153588571870", "https://www.cfact.org/2020/08/17/clintel-issues-great-charter-of-universities-for-research-freedom/", "https://clintel.org/magna-carta-universitatum-2020/", "https://www.thegwpf.com/peter-ridd-challenge-goes-to-the-heart-of-a-free-society/", "https://wattsupwiththat.com/2020/07/29/academic-freedom-vs-jcu-reef-scientist-peter-ridd-vows-to-fight-on/", "https://www.thegwpf.com/irish-supreme-court-quashes-govts-climate-plan/", "https://nation.com.pk/01-Aug-2020/irish-supreme-court-quashes-govt-climate-plan", "https://stopthesethings.com/2020/08/03/power-brawl-labor-backbenchers-revolt-over-ludicrous-wind-solar-energy-targets/", "https://stopthesethings.com/2017/07/02/south-australias-wind-power-obsession-leads-to-highest-power-prices-in-the-world/", "https://www.thegwpf.com/exclusive-poll-amid-covid-19-americans-dont-care-about-climate-change-anymore/", "https://www.forbes.com/sites/tilakdoshi/2020/08/02/the-dirty-secrets-of-clean-electric-vehicles/#41c769da650b", "https://unctad.org/en/PublicationsLibrary/ditccom2019d5_en.pdf", "https://europe.autonews.com/article/20180220/COPY/302209953/cobalt-mines-linked-to-child-labor-thrive-in-rush-for-ev-batteries", "https://www.thegwpf.com/e300-billion-of-the-eus-climate-budget-will-go-to-farming-subsidies-critics-warn/", "https://www.ipcc.ch/site/assets/uploads/2020/05/2020-AC6_en.pdf", "https://www.climatechangenews.com/2020/08/13/un-climate-science-report-likely-delayed-beyond-2021-glasgow-summit/", "https://nypost.com/2020/07/21/climate-change-hysteria-costs-lives-but-activists-want-to-keep-panic-alive/", "http://www.lse.ac.uk/granthaminstitute/wp-content/uploads/2020/07/Global-trends-in-climate-change-litigation_2020-snapshot.pdf", "https://climate-laws.org/cclow/litigation_cases", "https://ipa.org.au/publications-ipa/media-releases/ridd-case-federal-court-delivers-devastating-blow-to-free-speech-in-australia", "https://www.thegwpf.com/climate-hysteria-has-killed-academic-freedom/", "https://www.climatechangenews.com/2020/07/07/eib-go-become-eu-climate-bank/", "http://www.counter-balance.org/wp-content/uploads/2020/07/EU-Climate-Bank-Report.pdf", "https://news.trust.org/item/20200714154351-3761n/", "https://www.thegwpf.com/eu-leaders-cut-climate-funding-to-save-coronavirus-recovery-plan/", "https://uk.reuters.com/article/uk-eu-summit-climate-change/eu-eyes-cuts-to-green-transition-fund-in-late-bid-to-strike-recovery-deal-idUKKCN24L2IN", "https://www.climatechangenews.com/2020/07/21/poland-bails-coal-yet-wins-access-eu-climate-funds/", "https://www.climatechangenews.com/2020/07/01/airlines-climate-obligations-postponed-un-body-endorses-industry-proposal/", "https://climatechangedispatch.com/greta-thunberg-demands-response-climate-crisis-now/", "https://climateemergencyeu.org/#letter", "https://www.reuters.com/article/us-climate-change-greta-idUSKCN24H1KQ?taid=5f103eedfc7dcb0001f75bbb&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter", "https://www.nature.com/articles/s41558-020-0818-9/", "https://www.bbc.com/news/science-environment-53474445", "https://www.cbc.ca/news/canada/north/climate-change-polar-bears-1.5656219", "https://www.nytimes.com/2020/07/20/climate/polar-bear-extinction.html/", "https://www.youtube.com/watch?v=gmrAiq_3uZM&utm_source=CCNet+Newsletter&utm_campaign=a910ea723a-EMAIL_CAMPAIGN_2020_07_21_07_15_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-a910ea723a-36424765&mc_cid=a910ea723a&mc_eid=74a64f7872", "https://polarbearscience.com/2020/07/20/new-model-of-predicted-polar-bear-extinction-is-not-scientifically-plausible/?utm_source=CCNet+Newsletter&utm_campaign=a910ea723a-EMAIL_CAMPAIGN_2020_07_21_07_15_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-a910ea723a-36424765&mc_cid=a910ea723a&mc_eid=74a64f7872", "https://www.bbc.com/news/science-environment-51281986", "https://climatechangedispatch.com/renowned-green-activist-apologizes-for-the-climate-scare/", "https://www.skynews.com.au/details/_6168491756001/", "https://www.thegwpf.com/michael-shellenberger-on-behalf-of-environmentalists-i-apologize-for-the-climate-scare/", "https://www.forbes.com/sites/michaelshellenberger/2020/06/28/on-behalf-of-environmentalists-i-apologize-for-the-climate-scare/#11d53e301fa8", "https://www.thegwpf.com/prof-nir-shaviv-forbes-censored-an-interview-with-me/", "https://www.climatepower2020.org/facebook-letter/", "https://climatechangedispatch.com/facebook-oversight-board-asked-to-censor-climate-skeptic-posts/", "https://co2coalition.org", "https://climatechangedispatch.com/covid-vs-climate-models-cloudy-with-a-chance-of-politics/", "https://www.nytimes.com/2020/03/17/world/europe/coronavirus-imperial-college-johnson.html", "https://www.scientificamerican.com/article/climate-science-deniers-turn-to-attacking-coronavirus-models/", "https://en.wikipedia.org/wiki/Representative_Concentration_Pathway", "https://www.thegwpf.com/ross-mckitrick-the-flaw-in-relying-on-worst-case-scenario-climate-model/", "https://osf.io/preprints/socarxiv/ahsxw/", "https://www.energylivenews.com/2020/06/23/progress-towards-the-eus-climate-and-energy-targets-has-stalled/", "https://ec.europa.eu/eurostat/documents/4031688/11010788/KS-01-20-192-EN-N.pdf/ae63aff0-a6f3-1d47-da83-c6886b9daaab", "https://euobserver.com/green-deal/148738/", "https://www.africaoilandpower.com/2020/06/22/african-lives-matter-too-energy-policy-decisions-should-consider-their-needs/", "https://foreignpolicy.com/2020/06/18/green-energy-dirty-side-effects-renewable-transition-climate-change-cobalt-mining-human-rights-inequality/", "http://climaterealism.com/2020/06/the-heartland-of-america-is-clearly-benefiting-from-climate-change/", "https://climateataglance.com/climate-at-a-glance-drought/", "https://climateataglance.com/crop-production/", "https://climatechangedispatch.com/new-german-study-e-cars-actually-exacerbate-global-warming/", "https://open.alberta.ca/dataset/89a69583-a11b-4e31-a857-b311ab6563cc/resource/17ce2d24-ba7b-466c-acd9-33a2cf6beb69/download/aep-alberta-climate-report-arc.pdf", "assets/documents/Alberta%20Climate%20Future%20rebuttal.pdf", "https://www.cfact.org/2020/06/01/alarmist-queen-hayhoe-takedown-by-friends-of-science/", "https://www.climatechangenews.com/2020/06/10/greta-thunberg-seeks-influence-un-security-council-election/", "https://wattsupwiththat.com/2020/06/10/greta-thunberg-demands-canada-and-norway-abandon-fossil-fuel-extraction/", "https://twitter.com/GretaThunberg", "https://fortune.com/2020/05/01/business-reopen-economy-coronavirus-new-normal/", "https://www.ey.com/en_gl/covid-19/will-you-define-the-new-normal-or-watch-it-unfold", "https://climatechangedispatch.com/profits-count-more-than-ever-not-corporate-virtue-signaling/", "https://www.abc.net.au/news/2020-06-11/customers-paid-for-reducing-electricity-demand-radical-change/12343790", "http://joannenova.com.au/2020/06/desperate-signs-australian-companies-will-be-paid-to-use-less-electricity/", "https://www.youtube.com/watch?v=ScfI2RxUhUo&feature=youtu.be&utm_source=CCNet+Newsletter&utm_campaign=4c68cd75dc-EMAIL_CAMPAIGN_2020_06_01_01_29_COPY_01&utm_medium=email&utm_term=0_fe4b2f45ef-4c68cd75dc-36424765&mc_cid=4c68cd75dc&mc_eid=74a64f7872", "https://wattsupwiththat.com/2020/05/26/a-big-thank-you-from-the-front-line-in-the-war-for-free-speech/", "https://deadline.com/2020/05/planet-of-the-humans-pulled-youtube-michael-moore-jeff-gibbs-censorship-1202942938/?mc_cid=86ebd23789&mc_eid=84563077b7", "https://www.youtube.com/watch?v=Zk11vI-7czE", "https://www.climatechangenews.com/2020/05/27/uk-proposes-hold-cop26-climate-summit-november-2021/", "https://news.stv.tv/west-central/uk-proposes-new-date-for-delayed-climate-change-summit?top", "https://www.climatechangenews.com/2020/05/29/covid-hit-uk-begins-18-month-preparations-un-climate-summit/", "https://www.climatechangenews.com/2020/06/09/final-blow-aviation-climate-plan-eu-agrees-weaken-rules/", "https://www.icao.int/environmental-protection/Pages/A39_CORSIA_FAQ2.aspx", "https://www.spglobal.com/platts/en/market-insights/latest-news/coal/051920-airlines-could-save-15-billion-from-new-emissions-baseline-iata", "https://www.climatechangenews.com/2020/05/26/airlines-get-free-pass-climate-five-years-industry-proposal/", "https://www.thegwpf.com/greens-on-back-foot-as-germanys-newest-coal-plant-opens/", "https://wattsupwiththat.com/2020/04/26/climate-activists-want-michael-moores-doc-panning-green-energy-banned-say-its-chock-full-of-misinformation/", "https://www.cfact.org/2020/04/25/why-is-the-left-censoring-michael-moores-green-energy-movie/", "https://www.rollingstone.com/politics/political-commentary/bill-mckibben-climate-movement-michael-moore-993073/", "https://www.forbes.com/sites/robertbryce/2020/04/30/stanford-professor-cant-muzzle-planet-of-the-humans-must-pay-defendants-legal-fees-in-slapp-suit/#5f55e0aae0ac", "https://www.thegwpf.com/canadas-cool-headed-antidote-to-hot-arctic-alarmism/", "https://www.canada.ca/en/fisheries-oceans/news/2020/04/government-of-canada-releases-first-report-on-the-state-of-the-marine-ecosystems-in-the-canadian-arctic.html", "https://nationalpost.com/pmn/news-pmn/canada-news-pmn/frozen-north-gone-forever-study-of-arctic-ocean-shows-top-of-the-world-changing", "https://uk.reuters.com/article/uk-health-coronavirus-eu-climate-idUKKBN22N2T4", "https://www.euractiv.com/section/energy/news/germanys-solar-industry-could-implode-this-summer/", "https://www.euractiv.com/section/energy/news/planned-turbine-free-zones-could-halve-germanys-wind-energy-potential/", "https://climatechangedispatch.com/mexicos-president-puts-kibosh-on-renewables/", "https://www.pv-tech.org/news/industry-promises-legal-action-as-mexico-blocks-renewables-on-stability-gro", "http://european-calculator.eu/wp-content/uploads/2020/04/EUCalc_PB_no7_Trade.pdf", "https://www.thegwpf.com/ambitious-eu-climate-efforts-could-increase-co2-emissions-in-the-rest-of-the-world-new-study-warns/", "https://climatechangedispatch.com/bowing-activists-google-wont-build-ai-tools-oil-gas-drillers/", "https://apnews.com/17f056941a078fccede72b12236f6d6f", "http://www.drroyspencer.com/2020/05/why-the-current-economic-slowdown-wont-show-up-in-the-atmospheric-co2-record/", "https://www.eia.gov/outlooks/steo/", "https://www.youtube.com/watch?v=Zk11vI-7czE&feature=youtu.be", "https://www.reuters.com/article/us-earth-day-documentary/michael-moores-planet-of-the-humans-asks-what-if-green-energy-cannot-save-the-planet-idUSKCN2231U8", "https://www.forbes.com/sites/michaelshellenberger/2020/04/21/new-michael-moore-backed-documentary-on-youtube-reveals-massive-ecological-impacts-of-renewables/#53b9bb756c96", "https://news.bloombergenvironment.com/environment-and-energy/plunge-in-pollution-cost-is-hindering-a-key-green-ambition", "https://www.rechargenews.com/transition/eu-carbon-market-collapses-as-covid-19-causes-perfect-storm-ihs/2-1-789360", "https://www.cfact.org/2020/04/02/carbon-credit-scam-exposed-carbon-markets-fail-as-co ‚‚-declines/", "http://climaterealism.com/2020/04/uns-paris-climate-architect-dismisses-coronavirus-deaths-and-misery/", "https://www.newscientist.com/article/mg24532763-500-our-approach-to-covid-19-can-also-help-tackle-climate-change/", "https://www.skynews.com.au/details/_6150659462001?utm_source=CCNet+Newsletter&utm_campaign=db4e9505ce-EMAIL_CAMPAIGN_2020_04_21_02_28", "https://www.greenclimate.fund/news/responding-impacts-covid-19-global-pandemic-interlinkages-between-people-planet-and-prosperity", "https://www.journalismfestival.com/speaker/arthur-wyns", "https://blogs.scientificamerican.com/observations/climate-change-and-infectious-diseases/", "https://climatechangedispatch.com/who-official-peddles-false-pandemic-link-to-climate-change/", "https://climatechangedispatch.com/macron-climate-panel-ban-cars-5g-big-boxes-more/", "https://www.conventioncitoyennepourleclimat.fr", "https://www.theguardian.com/environment/2020/jan/22/uk-citizens-climate-assembly-meet-first-time", "https://www.climateassembly.uk", "https://www.brusselstimes.com/belgium/98726/flanders-very-concerned-by-eu-climate-law-says-environment-minister-zuhal-demir-greta-thunberg-eu-green-deal-pascal-canfin-eu-parliament/", "https://www.climatechangenews.com/2020/04/21/greenpeace-takes-arctic-oil-lawsuit-norways-supreme-court/", "https://electrek.co/2020/04/22/daimler-ends-hydrogen-car-development-because-its-too-costly/", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Funfccc.int%2Fnews%2Fcop26-postponed", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fmajor-climate-summit-postponed-covid-19%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.climatechangenews.com%2F2020%2F04%2F02%2Fgovernments-still-due-submit-tougher-climate-plans-2020-despite-cop26-delay%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2020-04-02%2Fdelay-for-un-climate-talks-reduces-pressure-for-stricter-goals", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fextinction-rebellion-climate-activism-online%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Ftwitter.com%2FThisIsZeroHour%2Fstatus%2F1238498094502813696", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Ftwitter.com%2FGretaThunberg%2Fstatus%2F1238377012235927554", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fdocs.google.com%2Fdocument%2Fd%2F1C6c0Rz8b4c-NW2gIP23xtL-JiSWUKtnqJt7jj9zhXOg%2Fedit", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.buzzfeednews.com%2Farticle%2Flesterfeder%2Furgenda-climate-crisis-netherlands-supreme-court", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.dutchnews.nl%2Fnews%2F2020%2F03%2Fcabinet-delays-climate-change-plans-corona-measures-cut-air-pollution%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F03%2F29%2Fdutch-cabinet-postpones-new-climate-measures-because-of-virus%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.macleans.ca%2Fopinion%2Fwhy-covid-19-gets-more-government-attention-than-the-climate-catastrophe%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.climatechangenews.com%2F2020%2F03%2F17%2Fgovernments-historic-opportunity-accelerate-clean-energy-transition-iea-says%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fedition.cnn.com%2F2020%2F03%2F16%2Fasia%2Fchina-pollution-coronavirus-hnk-intl%2Findex.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fgood-news-climate-activists-crisis%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F03%2F07%2Ftimes-coronavirus-will-kill-all-the-old-climate-skeptics%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2020-03-27%2Fgreen-fuel-plants-are-shutting-down-and-some-may-never-come-back", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fri-climate-lawsuit-funding-stream%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fcdn01.dailycaller.com%2Fwp-content%2Fuploads%2F2020%2F03%2Ffilestamped.pdf", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.bbc.com%2Fnews%2Fscience-environment-52023881%3Futm", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=144214&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F03%2F16%2Fhow-exactly-do-they-plan-to-replace-fossil-fuels%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.eventbrite.ca%2Fe%2Ffreedom-of-speech-no-climate-emergency-tickets-89697933935", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=http%3A%2F%2Fco2coalition.org%2F2020%2F02%2F13%2Fpatrick-moore-i-was-banned-from-speaking-in-regina-over-this-alternative-co2-point-of-view%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=http%3A%2F%2Fco2coalition.org%2F2020%2F02%2F13%2Fpatrick-moore-finds-new-platform-in-regina-after-city-cancels-him-from-conference%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.newsmax.com%2Flarrybell%2Fenergy-density-natural-gas-hydrocarbons%2F2020%2F01%2F27%2Fid%2F951403%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.cfact.org%2F2020%2F02%2F10%2Famericans-reluctant-to-join-the-ev-train%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fthefederalist.com%2F2020%2F02%2F12%2Fwhy-the-green-new-deal-would-destroy-the-environment%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=http%3A%2F%2Fsavetheeaglesinternational.org%2Fnew%2Fus-windfarms-kill-10-20-times-more-than-previously-thought.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fthefederalist.com%2F2020%2F02%2F12%2Fwhy-the-green-new-deal-would-destroy-the-environment%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-4764208%2FChild-miners-aged-four-living-hell-Earth.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fdailycaller.com%2F2018%2F05%2F24%2Fmichael-shellenberger-solar-panel-toxic-waste", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.staradvertiser.com%2F2019%2F11%2F16%2Fbreaking-news%2Fiowa-wind-farm-sending-many-giant-blades-to-landfills%2F%3Ffbclid%3DIwAR3YBik-KeUoObyBydQyWcVa6zzLkbxFP4pbornrvvz1t0YvqmjE", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Fbrussels-tells-uk-report-to-us-on-climate-change-or-forget-brexit-trade-deal%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Feu-threatens-carbon-tariffs-in-climate-trade-war-warning-shot-to-brexit-britain%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fgermany-wind-giants-subsidies%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2020-02-10%2Fwind-giants-in-germany-are-not-so-keen-on-market-rates-after-all", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwindeurope.org%2Fnewsroom%2Fpress-releases%2Feurope-installs-a-record-3-6-gw-of-offshore-wind-in-2019%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.euractiv.com%2Fsection%2Fenergy%2Fnews%2Foffshore-wind-boom-not-enough-to-reach-eu-climate-goals%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thetimes.co.uk%2Farticle%2Fprofessor-at-st-johns-college-oxford-turns-oil-row-into-a-heated-debate-0zr2wpmb5", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F02%2F03%2Foxford-university-best-response-ever-to-a-fossil-fuel-divestment-demand%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fskepticalscience.com%2Fmisinformers.php", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=129230&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Fbeware-the-climate-stalinist-witch-hunters-we-should-make-her-unhirable-in-academia%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.eventbrite.ca%2Fe%2Ffreedom-of-speech-no-climate-emergency-tickets-89697933935", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechoices.ca%2Freports%2Fcharting-our-course%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclintel.org", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclintel.org%2Fpresentation-guus-berkhout-about-the-world-climate-declaration%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.cfact.org%2F2020%2F01%2F29%2Fclintel-manifesto-blasts-climate-scaremongering%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fnotalotofpeopleknowthat.wordpress.com", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fnotalotofpeopleknowthat.wordpress.com%2F2019%2F12%2F24%2Fgreen-ideology-not-climate-change-makes-bushfires-worse%2F%3Ffbclid%3DIwAR2lg_Sp4xVwse_SrRjdS2UcAE0vD-XwSfj77HGC4MnFFo8Mf2h5KW-2QsQ", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.facebook.com%2FFoSClimateEd%2Fposts%2F2627494517329381", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fnotalotofpeopleknowthat.wordpress.com%2F2020%2F01%2F11%2Fwho-checks-the-factcheckers%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fnotalotofpeopleknowthat.files.wordpress.com%2F2020%2F01%2Fimage-35.png", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatefeedback.org%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.desmogblog.com%2F2020%2F01%2F16%2Fyoutube-monetizing-climate-science-denial-videos-avaaz", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.desmogblog.com%2F2019%2F02%2F24%2Fyoutube-video-serious-climate-science-denial-problem", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.blog.google%2Faround-the-globe%2Fgoogle-europe%2Ffighting-disinformation-across-our-products%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fdrive.google.com%2Ffile%2Fd%2F1Kw0pq7pfeNmVEBt8IbR0zgZmHKBoSGvA%2Fview", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatecrisis.house.gov%2Fsites%2Fclimatecrisis.house.gov%2Ffiles%2FSCCCLetterYouTube.pdf", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fdems-google-censor-climate-dissent%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.washingtontimes.com%2Fnews%2F2020%2Fjan%2F29%2Fkathy-castor-house-climate-chair-slammed-urging-go%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.breitbart.com%2Fenvironment%2F2020%2F01%2F21%2Fgreta-thunberg-tells-world-to-start-listening-to-her-warnings-of-climate-catastrophe%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fgreta-scolds-adults-davos%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Ftrump-vs-greta-prophets-doom%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Fdonald-trump-rejects-environmental-prophets-of-doom-in-davos-address%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.euractiv.com%2Fsection%2Fenergy-environment%2Fnews%2Fquestion-marks-raised-over-scale-of-eus-new-climate-fund%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fec.europa.eu%2Fcommission%2Fpresscorner%2Fdetail%2Fen%2Ffs_20_39", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fec.europa.eu%2Fregional_policy%2Fen%2Fnewsroom%2Fnews%2F2020%2F01%2F14-01-2020-financing-the-green-transition-the-european-green-deal-investment-plan-and-just-transition-mechanism", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fnews.un.org%2Fen%2Fstory%2F2020%2F01%2F1055671", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=121418&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.cbc.ca%2Fnews%2Ftechnology%2Fclimate-refugees-un-1.5435843", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.ourchildrenstrust.org", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.businessinsider.com%2Fjuliana-vs-united-states-kids-climate-change-case-dismissed-2020-1", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.documentcloud.org%2Fdocuments%2F6660049-Climate-Ruling.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fstatic1.squarespace.com%2Fstatic%2F571d109b04426270152febe0%2Ft%2F5e22508873d1bc4c30fad90d%2F1579307146820%2FJuliana%2BPress%2BRelease%2B1-17-20.pdf", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.climateliabilitynews.org%2F2019%2F10%2F25%2Fcanada-government-youth-lawsuit%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=http%3A%2F%2Fclimatecasechart.com%2Fnon-us-case%2Fla-rose-v-her-majesty-the-queen%2F%3Fcn-reloaded%3D1", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.winnipegfreepress.com%2Fopinion%2Feditorials%2Ftime-to-silence-voices-of-denial-566742172.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fnofrakkingconsensus.com%2F2020%2F01%2F08%2Fjournalists-we-want-censorship%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Feidclimate.org%2Fanti-energy-researcher-naomi-oreskes-calls-for-regulations-on-free-speech%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fnotrickszone.com%2F2020%2F01%2F05%2Fgerman-solar-industry-politicians-call-for-punishment-of-dissenters-sabotaging-climate-emergency-measures%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F01%2F06%2Fft-democracies-are-ill-suited-to-deal-with-climate-change%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.nytimes.com%2F2020%2F01%2F03%2Fopinion%2Faustralia-fires-climate-change.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F01%2F04%2Fgreens-pushing-hard-to-blame-aussie-climate-policies-for-bushfires%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Faustralia-fires-forestry-arson-climate%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Faussie-police-investigate-arson-bushfires%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.washingtonexaminer.com%2Fopinion%2Faustralian-wildfires-were-caused-by-humans-not-climate-change", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F01%2F04%2Faustralia-fires-and-misses%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fjennifermarohasy.com%2F2020%2F01%2Fit-has-been-hotter-fires-have-burnt-larger-areas%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.spectator.com.au%2F2020%2F01%2Ftragic-but-unprecedented-not-yet%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fstopthesethings.com%2F2020%2F01%2F12%2Fbat-tered-government-cancels-approval-for-completed-wind-farm-to-save-endangered-bat-species%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Ftownhall.com%2Fcolumnists%2Fvictordavishanson%2F2020%2F01%2F16%2Fenergy-paradoxes-put-europe-in-a-precarious-position-n2559550%3Futm_source%3Dthdaily%26utm_medium%3Demail%26utm_campaign%3Dnl%26newsletterad%3D01%2F17%2F2020%26bcid%3D62058b0f14fd65e0f7f8d699bcf4ba5d%26recip%3D25947478", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Feurope%2Fgermany-climate-change-emergency-money-eu-latest-a9284876.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fgreta-lecture-fossil-fuels-davos%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.weforum.org%2Fevents%2Fworld-economic-forum-annual-meeting-2020", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.sciencedaily.com%2Freleases%2F2018%2F02%2F180207140349.htm", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Fthe-burden-of-proof-rests-on-mark-carney-he-hasnt-made-his-case-against-fossil-fuels%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thegwpf.com%2Fterence-corcoran-mark-carney-how-to-create-a-sub-prime-energy-crisis%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fweb.archive.org%2Fweb%2F20191228205314%2Fhttps%3A%2Fnews.gallup.com%2Fpoll%2F273110%2Fgovernment-ranks-top-problem-third-year.aspx", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fnofrakkingconsensus.com%2F2020%2F01%2F06%2Fdecades-of-public-opinion-climate-change-not-on-the-radar%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2020-01-06%2Fa-1-billion-solar-plant-was-obsolete-before-it-ever-went-online", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=117091&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.americanthinker.com%2Farticles%2F2020%2F01%2Fanother_expensive_solar_scheme_bites_the_dust.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fseekingalpha.com%2Fnews%2F3525168-exxon-prevails-in-new-york-climate-lawsuit%3Futm_medium%3Demail%26utm_source%3Dseeking_alpha", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.newsmax.com%2Flarrybell%2Fsap-se-cap-and-trade-bp%2F2019%2F12%2F16%2Fid%2F946077%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Feidclimate.org%2Frockefeller-director-disappointed-that-the-rockefeller-funded-exxon-investigation-failed%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.realclearenergy.org%2Farticles%2F2019%2F12%2F20%2Fexxon_and_evidence_101_110502.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2019%2F12%2F20%2Fdutch-court-upholds-government-order-to-cut-emissions-25-by-eoy-2020%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fcei.org%2Fblog%2Fdutch-supreme-court-upholds-climate-lawsuit-against-government", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fglobalnews.ca%2Fnews%2F6298949%2Felectric-vehicle-sales-down-ontario%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.cbc.ca%2Fnews%2Fcanada%2Ftoronto%2Fyear-ont-electric-vehicles-1.5397190", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.thetruthaboutcars.com%2F2019%2F12%2Fcongress-says-nay-to-expanding-ev-tax-credits%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.euractiv.com%2Fsection%2Fenergy-environment%2Fnews%2Feu-commission-unveils-european-green-deal-the-key-points%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Feu-green-deal-fails-first-test%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.consilium.europa.eu%2Fmedia%2F41768%2F12-euco-final-conclusions-en.pdf", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.theguardian.com%2Fenvironment%2F2019%2Fjun%2F20%2Feu-leaders-to-spar-over-zero-carbon-pledge-for-2050", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fclimatechangedispatch.com%2Fbiden-crowd-oil-execs-jailed%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2019%2F12%2F01%2Fbank-of-england-mark-carney-to-head-a-un-climate-action-effort%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2019%2F12%2F29%2Fclimate-alarmist-banks-go-carbon-colonialist%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.afdb.org%2Ffileadmin%2Fuploads%2Fafdb%2FDocuments%2FGeneric-Documents%2FBank_s_strategy_for_New_Energy_on_Energy_for_Africa_EN.pdf", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fnationalpost.com%2Fnews%2Fcanada%2Fwere-going-to-die-toronto-mother-says-young-daughter-terrified-by-school-presentation-on-climate-change", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.mcc-berlin.net%2Fen%2Fresearch%2Fco2-budget.html", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwattsupwiththat.com%2F2019%2F12%2F23%2Fi-dont-want-to-die-climate-exploitation-of-children%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.powerlineblog.com%2Farchives%2F2019%2F11%2Fwhy-green-energy-is-a-terrible-idea.php", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.spectator.co.uk%2F2017%2F05%2Fwind-turbines-are-neither-clean-nor-green-and-they-provide-zero-global-energy%2F", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=113085&act=F53B&c=1777404&destination=https%3A%2F%2Fwww.project-syndicate.org%2Fcommentary%2Fclimate-change-activists-empty-gestures-by-bjorn-lomborg-2019-12", "https://www.friendsofscience.org/index.php?id=519", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=76259&act=F53B&c=1777404&destination=http%3A%2F%2Fwww.friendsofscience.org%2Findex.php%3Fid%3D605", "https://click.icptrack.com/icp/relay.php?r=25136341&msgid=76259&act=F53B&c=1777404&destination=http%3A%2F%2Fwww.climatechange101.ca%2F", "https://friendsofscience.org/pages/privacy.html", "https://friendsofscience.org/pages/cookies-policy.html"], "authors": [], "publish_date": null}