{"result_id": "125008", "URL": "https://friendsofscience.org/index.php/index.php?id=608", "timestamp": "2023-04-25 15:09:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://joannenova.com.au/wp-content/themes/atahualpa/images/favicon/favicon.ico", "canonical": "https://joannenova.com.au/2012/11/bbc-secret-exposed-greenpeace-activists-bp-decide-what-sciencebrits-see-hello-twentyeightgate/", "encoding": "UTF-8"}, "image": null, "domain": "friendsofscience.org", "title": "BBC secret exposed: Greenpeace, activists, BP decide what “science” brits see — Hello TwentyEightGate « JoNova", "cleaned_text": "BBC secret exposed: Greenpeace, activists, BP decide what “science” brits see — Hello TwentyEightGate\n\nOh the irony. The BBC, supposedly the public owned broadcaster, had a meeting with 28 climate experts in Jan 2006 where it decided on its policies on climate coverage. It led to the extraordinary move of the BBC abandoning any semblance of impartiality (a principle that’s so important it’s written into its charter). In the meantime, the BBC did everything it could to hide those influential experts names. It’s been nearly seven years since the seminar, but now we know why their names were top secret. No one is even pretending this was about “the science”. The BBC has become a PR wing of Greenpeace.\n\nIn mid 2007 Tony Newbery of Harmless Sky started asking who was at the seminar, but the BBC wouldn’t give up the names. In fact the BBC thought the names were so significant that when Newbery sent them an FOI, they not only refused to hand over the list, but they used six lawyers against him (see The Secret 28 Who Made BBC ‘Green’ Will Not Be Named). The BBC, improbably, argued they weren’t “public” and even more improbably, they won the case. Who knew? The BBC could be considered a “private organisation”. Where are the shareholders?\n\nHaving spent many thousands defending their secret meeting with such elaborate wordsmithing and lawyering, presumably, the irony is sweet that when Maurizio Morabito (omnologos) hunted online, he found the sacred list published in full. (Thanks to the wayback machine.)\n\nThe BBC is a tax funded organization with a charter to be impartial. So which climate experts were allowed to help decide what the British public should see and pay for?\n\nThese ones: Blake Lee-Harwood, and Li Moxuan, Greenpeace; Andy Atkins, Advocacy Director, and Tadesse Dadi, Tearfund (Charity); Trevor Evans, US Embassy; Iain Wright, BP International; Joe Smith, The Open University; Saleemul Huq, IIED (Int. Inst. for Environment Development); Mark Galloway, Director, IBT (International Broadcasting Trust); Tessa Tennant, Chair, AsRia; Andrew Dlugolecki, Insurance industry consultant; Anita Neville, E3G; and more… (see below)\n\n\n\nHow many unskeptical climate scientists were there? Three. How many skeptical scientists? Zero.\n\nMost of the list of “climate experts” advising the BBC were activists, advocacy directors, charities, or were involved in sustainable (green) investments. Big Oil even had a seat at that table. Do they care for polar bears or was it because they were involved in the giant CO2 Capture Research Project? (As it happens, they gave up on those plans in May 2007.) h/t davidmhoffer (WUWT)\n\nUPDATE: Maurabitzio writes “why the list matters” and includes these points:\n• The BBC sent four low level representatives: Peter Rippon, Steve Mitchell, Helen Boaden, George Enwistle. All have since risen to power.\n• Amazingly, those are also the exact four who have thus far resigned this week over the false paedophilia accusations against Lord McAlpine. (h/t Bruce Hoult in a Bishop Hill comment)\n\nHere’s how important the seminar of Jan 2006 was:\n\nThese were the aims of the seminar according to the BBC:\n\nSo basically, the BBC made out this was its own mini IPCC conference, where they got experts from both sides, thrashed out the science, decided on the most honest way to convey all the risks, costs and benefits to their paying public — in the impartial manner mandated by their charter. A “clear summary” of the state of knowledge?\n\nWhich private organization is allowed to forcible charge the public fees? Answer: If there is one, it makes a mockery of British corporate law.\n\nI say “Yes” to a private BBC. Let’s make BBC payments voluntary. (After all, the hallmark of the marketplace are voluntary transactions, while coercion is the hallmark of government.) And if anyone anywhere doesn’t like being fed rehashed activist spiel disguised as “investigative” journalism, they don’t need to complain, they can just stop paying. (These clever wordsmithing journalists like “free markets”, remember?) How about a tick-box on the annual UK tax-return? Check this square to fund the BBC, or leave it unchecked to send the equivalent amount to the GWPF instead.\n\nWhat happened at That seminar?\n\nThe Seminar was entitled ‘Climate Change – the Challenge to Broadcasting’ , January 2006. Andrew Montford has written a guide to the FOI battle: you can buy the ebook format here for ~75 cents.\n\nThe full background is summed up in “Conspiracy In Green” which Montford and Newbery worked together on over several years.\n\nRichard D North was there that day and said to James Delingpole:\n\n‘Though they purported to be aware that this was an immensely important topic, it seemed to me that none of them had shown even a modicum of professional curiosity on the subject … I spent the day discussing the subject and I don’t recall anyone showing any sign of having read anything serious at all. I argued at the seminar that I thought most broadcasting coverage on climate change was awful. But I also said there was no need for them to become self-conscious about it. This was because, although the issues were scientifically, politically and economically difficult, the BBC’s reporting of the thing would improve as soon as their audience was asked to vote or pay for climate change policy.’\n\nWatts Up of course covered it all, sending his heartiest congratulations to Maurizo, and commenters are having a great time. \n\n\n\nBarry Woods tells me Andrew Orlowski at The Register, has reported all this VERY accurately, he was reporting the FOI tribunal last week:\n\nSpecialists:\n\n Robert May, Oxford University and Imperial College London\n\n Mike Hulme, Director, Tyndall Centre, UEA\n\n Blake Lee-Harwood, Head of Campaigns, Greenpeace\n\n Dorthe Dahl-Jensen, Niels Bohr Institute, Copenhagen\n\n Michael Bravo, Scott Polar Research Institute, University of Cambridge\n\n Andrew Dlugolecki, Insurance industry consultant\n\n Trevor Evans, US Embassy\n\n Colin Challen MP, Chair, All Party Group on Climate Change\n\n Anuradha Vittachi, Director, Oneworld.net\n\n Andrew Simms, Policy Director, New Economics Foundation\n\n Claire Foster, Church of England\n\n Saleemul Huq, IIED\n\n Poshendra Satyal Pravat, Open University\n\n Li Moxuan, Climate campaigner, Greenpeace China\n\n Tadesse Dadi, Tearfund Ethiopia\n\n Iain Wright, CO2 Project Manager, BP International\n\n Ashok Sinha, Stop Climate Chaos\n\n Andy Atkins, Advocacy Director, Tearfund\n\n Matthew Farrow, CBI\n\n Rafael Hidalgo, TV/multimedia producer\n\n Cheryl Campbell, Executive Director, Television for the Environment\n\n Kevin McCullough, Director, Npower Renewables\n\n Richard D North, Institute of Economic Affairs\n\n Steve Widdicombe, Plymouth Marine Labs\n\n Joe Smith, The Open University\n\n Mark Galloway, Director, IBT\n\n Anita Neville, E3G\n\n Eleni Andreadis, Harvard University\n\n Jos Wheatley, Global Environment Assets Team, DFID\n\n Tessa Tennant, Chair, AsRia\n\nAnthony Watts has a great discussion going, with all the details as does Bishop Hill who has been following this all along.\n\nI’ve collected and edited (for brevity) a few of the more useful thoughts from WUWT below: (thanks Anthony!)\n\nThe adopted policy on ‘balance’ supposedly adopted by expert discussion at the meeting cannot be justified in the light of those invited to attend the meeting. Hence, the adoption of that policy can be demonstrated to be a deliberate breach of the BBC Charter. Therefore, the list is potentially even more serious for the BBC than any of the problems now confronting the BBC.Richard davidmhoffer says:\n\n A member of the US embassy was asked to advise on the official broadcast policy of an instrument of the British government? The BBC is independent from govt (hoho) It’s charter forbids it from being influenced by foreign political policy. More than 3,000 people a week are being prosecuted for not having a TV licence… The number of prosecutions has risen in part because many more are struggling to pay. In 2010, licence fee fines totalled just under £25million a year. Email address for comments to the BBC: [email protected] Contact is Mr Vine. (pov = “points of view”). Pitch in, folks. The UK’s policy lines on World Bank and IMF issues are formally decided by the Department for International Development (DFID) and the Treasury, respectively. Within DFID, the International Financial Institutions department (IFID) leads in devising the organisation’s position on these institutions (see below). In the Treasury, the International Finance department is responsible for preparing advice on the policy issues and specific country programmes brought before the Board of Directors in Washington. The top UK representatives at the IMF and World Bank are the Chancellor of the Exchequer, Rt Hon George Osbourne MP, and Secretary of State for international development, Rt Hon Justine Greening MP. They are known as UK governors to the Fund and Bank, sitting on the ministerial committees which meet in Washington twice a year to decide on overall strategic direction for the institutions. The UK is the fourth-largest shareholder in both the World Bank and the IMF, holding 4.3 percent and 4.8 percent of votes, respectively. For comparison the US is by far the largest shareholder with 16.4 percent and 16.85 percent vote shares, respectively. My research and teaching interests centre on the politics of environmental change. This is explored through three discrete strands of work: the politics of consumption, pursued through a study of biographies of food in Poland and the Czech Republic media representations of environmental change, centred on a programme of action research in collaboration with the BBC experimental reframings of environmental change, pursued mainly through the Interdependence Day project Through the course of my CRASSH fellowship I will be drawing on more than a decade of working with media and other organisations to offer an account of the cultural work demanded by our unfolding understanding of human-induced climate change. I will also take the opportunity to reflect on the distinctive roles and responsibilities of social science and humanities researchers in helping societies to make sense of and act on climate change. I count three climate scientists with a technical education: May, Hulme, and Dahl-Jensen of the NIels Bohr Institute. Others with an academic affiliation (Bravo, Widdicombe, Smith) have liberal arts (history, geography, philosophy of science) backgrounds. Of the three “technicals”, two are activists. However, Dr. Dahl-Jensen seems to be an actual boots-on-the-ground scientist (latest grant is for drilling through the Greenland ice aiming at bedrock to investigate possible lakes at the bottom of the glaciers). I expect whoever was responsible for vetting her prior to the conference has since paid the price. the big CAGW prize has always been trading CO2: Tessa Tennant, AsRia, is among the Specialists, in what speciality? Tessa Tennant, Co-founder of ASrIA, Appointed to the UK Green Investment Bank Board\n\n http://www.asria.org/news/press/1349400121 Its not on the BBC news at all.", "opengraph": {}, "tags": ["Media bias", "BBC"], "tweets": [], "movies": [], "links": ["/s3/jonova.s3.amazonaws.com/artwork/logo-fun/bbc-greenpeace-med.gif", "http://ccgi.newbery1.plus.com/%7Enewbery1/blog/", "http://wattsupwiththat.com/2012/11/10/the-secret-28-who-made-bbc-green-will-not-be-named/", "http://www.thegwpf.org/secret-28-bbc-green-named/", "http://omnologos.com/author/omnologos/", "http://www.tearfund.org/", "http://www.iied.org/about-us", "http://www.ibt.org.uk/members.php", "http://www.ibt.org.uk/members.php", "http://www.asria.org/", "http://www.3eggroup.com/", "http://www.co2captureproject.org/", "http://www.rsc.org/chemistryworld/News/2007/May/24050703.asp", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145455", "http://tallbloke.wordpress.com/2012/11/13/the-bbc-has-held-a-high-level-seminar-with-some-of-the-best-scientific-experts-and-has-come-to-the-view-that-the-weight-of-evidence-no-longer-justifies-equal-space-being-given-to-the-opponents-of-the/", "http://omnologos.com/why-the-list-of-participants-to-the-bbc-cmep-jan-2006-seminar-is-important/", "https://twitter.com/BruceHoult", "http://www.bishop-hill.net/blog/2012/11/12/bbc-climate-28-revealed.html?currentPage=2#comments", "http://www.bbc.co.uk/bbctrust/assets/files/pdf/review_report_research/impartiality_21century/report.pdf", "http://news.bbc.co.uk/1/hi/programmes/newsnight/6322259.stm", "http://ccgi.newbery1.plus.com/blog/?p=109&doing_wp_cron", "http://ccgi.newbery1.plus.com/blog/?p=109&doing_wp_cron", "http://www.thegwpf.org/", "http://t.co/uD0HdyB", "http://www.bishop-hill.net/conspiracy-in-green/", "http://blogs.telegraph.co.uk/news/jamesdelingpole/100187595/the-bbc-and-jimmy-savile-peas-in-a-pod/", "http://tallbloke.wordpress.com/2012/11/13/the-bbc-has-held-a-high-level-seminar-with-some-of-the-best-scientific-experts-and-has-come-to-the-view-that-the-weight-of-evidence-no-longer-justifies-equal-space-being-given-to-the-opponents-of-the/", "http://www.theregister.co.uk/2012/10/29/boaden_tribunal_information_refusal/", "http://www.theregister.co.uk/2012/11/07/bbc_is_private_go_away/", "http://www.theregister.co.uk/2012/11/09/bbc_beats_blogger_/", "http://www.theregister.co.uk/2012/11/13/climate28_named_wtf/", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public", "http://bishophill.squarespace.com/blog/2012/11/12/bbc-climate-28-revealed.html", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145329", "http://tallbloke.wordpress.com", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145336", "https://www.facebook.com/charles.g.nelson", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145341", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145355", "/cdn-cgi/l/email-protection#374758417755555419545819425c", "http://tallbloke.wordpress.com", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145366", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145378", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145615", "http://www.asria.org/news/press/1349400121", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145617", "http://wattsupwiththat.com/2012/11/12/breaking-the-secret-list-of-the-bbc-28-is-now-public/#comment-1145541"], "authors": [], "publish_date": null}