{"result_id": "125018", "URL": "https://friendsofscience.org/index.php?id=2350", "timestamp": "2023-04-25 15:09:58 CEST+0200", "meta": {"description": "At first glance, it appeared as if this month's energy and environment conferences in Houston and Bonn were being held in two vastly different universes.", "lang": "en", "keywords": "", "favicon": "//twt-assets.washtimes.com/images/favicon.30333d68dff6.ico", "canonical": "https://www.washingtontimes.com/news/2017/nov/27/how-the-us-can-dominate-the-world-energy-market/", "encoding": "UTF-8"}, "image": null, "domain": "friendsofscience.org", "title": "How the U.S. can dominate the world energy market", "cleaned_text": "At first glance, it appeared as if this month’s energy and environment conferences in Houston and Bonn were being held in two vastly different universes.\n\nAt Houston’s America First Energy Conference on Nov. 9, leading experts explained that fossil fuels such as coal, oil and natural gas has given us a world vastly more healthy, wealthy and clean than that of our ancestors. The event, organized by the Heartland Institute, a free-market think tank, called for a rapid expansion of America’s hydrocarbon fuel usage to yield even greater benefits for people and the environment. Mainstream media showed little interest and what coverage the event generated was mostly negative.\n\nThe exact opposite message was broadcast during the United Nations Climate Change Conference that wrapped up recently in Bonn. Conference attendee Marc Morano, publisher of the influential Climatedepot.com, said, “The U.N. climate summit was a bizarro world of condemnation for the use of fossil fuels while living in a dream world by calling for the world to immediately switch to alternative energy sources to avert an alleged climate crisis.”\n\nThe U.N. event was covered uncritically by most of the press, leaving the public with the impression that the science of climate change, and the case against fossil fuels, is a fait accompli. Nothing could be further from the truth.\n\nUnlike Heartland’s 12 international conferences on climate change, their Houston conference focused primarily on energy, not climate science. However, one session put the lie to the idea that science is settled in favor of the position the U.N. holds dear. University of Delaware climatology professor David Legates showed that the climate models on which the climate scare is based consistently predict far greater temperature rises than are observed in the real world.\n\nShowing a plot of the output of 101 climate models, Mr. Legates said, “One hundred of those models overpredict current conditions by about a factor of two.”\n\nConcerning how climate models are “tuned” to give results desired for political purposes, Mr. Legates charged, “This is not science.”\n\nRather than “carbon pollution,” as Washington State Gov. Jay Inslee labeled carbon dioxide (CO2) in a statement issued by the U.S. Climate Alliance just before traveling to Bonn, our carbon-dioxide emissions are aerial fertilization for plant life. Craig Idso of the Center for the Study of Carbon Dioxide and Global Change told the Houston audience, “The whole of the terrestrial biosphere is reaping incredible benefits from the approximate 40 percent increase in atmospheric CO2 since the beginning of the Industrial Revolution.”\n\nEfforts to reduce carbon-dioxide emissions will result in “reduced agricultural yields, higher food prices and growing food insecurity that will disproportionately burden the poor,” concluded Mr. Idso. This would cause “undernourishment and potential starvation of hundreds of millions of persons just a few short decades from now,” he said.\n\nOn June 29, President Trump announced that he is not only focusing on “energy independence,” but also “energy dominance.” America First Energy Conference keynote speaker Joe Leimkuhler, vice president of drilling for Louisiana-based LLOG Exploration, explained that energy dominance requires meeting all U.S. domestic needs and exporting at a level where America can influence the world market.\n\nMr. Leimkuhler showed that, given the right circumstances, Mr. Trump’s goal is indeed achievable. If, that is, current development trends continue and the president’s America First Energy Plan is allowed to unfold without being sabotaged by the climate scare.\n\nAlthough the U.S. currently imports more oil that it produces, Mr. Leimkuhler told the audience in Houston that it need not stay that way. America could become a net exporter of oil within five years and could dominate oil internationally if recent estimates of the 135 billion barrels more oil reserves in the Permian Basin that spans West Texas and southeastern New Mexico turn out to be correct.\n\nMr. Leimkuhler explained that the U.S. is the largest natural gas producer and consumer in the world, has the lowest cost, and meets all domestic demand. However, despite recent growth in production due to fracking, the U.S. still only has 4 percent of the world’s reserves. To dominate natural gas, American liquified natural gas exports would have to increase 20-fold from 2016 levels. Sustaining such a level of exports would require a considerable increase in reserves, a development that, while possible, is highly uncertain.\n\nCoal is another story entirely. America has the world’s largest coal reserves — a 381-year supply at current national usage rates. Not surprisingly, 100 percent of U.S. coal demand is met by domestic supply. Asia is a huge market for coal, and America could easily dominate the international power plant coal supply if sufficient export facilities were available. But thanks largely to the climate scare contributing to the blocking of construction of new American coal export facilities, the U.S. exports no more coal than Poland.\n\nDue to limited supply of uranium, dominating the world conventional nuclear power market is not realistic for America, Mr. Leimkuhler said. Similarly, dominating in hydroelectric power exports is a non-starter due to the lack of acceptable new dam sites.\n\nMr. Leimkuhler wrapped up his talk by showing the Houston audience that trying to dominate world wind and solar energy markets is a fool’s errand. These sources are “costly, inefficient,” and pose serious reliability and integration issues “that results in the actual power supplied equal to only a fraction of the “name plate capacity,” he said.\n\nHeartland Institute President Tim Huelskamp summed up the opportunity facing the U.S.: “For too long, America’s future has been controlled by radicals who don’t want to see us grow and prosper. But things are different now. We can take the lead in powering the world and growing our economy. We can continue guiding the protection of Earth’s air, land and water.”\n• Tom Harris is executive director of the Ottawa, Canada-based International Climate Science Coalition.", "opengraph": {"article:section": "Commentary", "title": "How the U.S. can dominate the world energy market", "type": "article", "url": "https://www.washingtontimes.com/news/2017/nov/27/how-the-us-can-dominate-the-world-energy-market/", "image": "https://twt-thumbs.washtimes.com/media/image/2017/11/27/11272017_b1-harr-earth-energ8201_c0-282-855-780_s1200x700.jpg?3f88c36a0103939b851e4575c97fc93ab8a95e68", "image:width": "1200", "image:height": "700", "article:opinion": "true", "article:content_tier": "metered", "site_name": "The Washington Times", "description": "At first glance, it appeared as if this month’s energy and environment conferences in Houston and Bonn were being held in two vastly different universes."}, "tags": [], "tweets": [], "movies": [], "links": ["https://goo.gl/forms/xGjXcUKYsKxMeCUl1"], "authors": ["Tom Harris", "The Washington Times https://www.washingtontimes.com"], "publish_date": "2017-11-27T20:35:08"}