{"result_id": "125001", "URL": "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/", "timestamp": "2023-04-25 15:09:14 CEST+0200", "meta": {"description": "An open letter to Prime Minister Trudeau, rebutting the demands of 265 academics and advising that we fight the COVID19 virus, not carbon and climate.", "lang": "en", "keywords": "", "favicon": "https://friendsofscience.org/assets/images/svg/flavicon.ico", "canonical": "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/", "encoding": null}, "image": null, "domain": "blog.friendsofscience.org", "title": "Rebuttal to 265 Academics | Friends of Science Calgary", "cleaned_text": "The Right Honourable Justin Trudeau, P.C., M.P. Papineau, Quebec\n\n Prime Minister of Canada\n\n Langevin Block\n\n Ottawa, Ontario\n\n K1A 0A2\n\nOn Friday, March 27, 2020, the Dutch cabinet abandoned any further plans to pursue climate goals, despite the Urgenda court ruling, citing the overwhelming need to address the COVID19 crisis. Sir, it is time to focus on Canadians, not the planet; on the COVID19 crisis, not the climate.\n\nSome 265 academics demand that you abandon support for Canada’s oil and gas sector and not provide financial relief. We ask you, how is modern medicine possible without the energy and product stream, like sterile, single-use medical supplies, without petrochemicals?\n\nIn 2018, Canadians were surveyed by Abacus Data for Ecofiscal Commission Canada. The number one priority of Canadians was improved health care. Instead, governments of the day chose to pursue climate change and carbon taxes. Climate change was the least priority of Canadians.\n\nImagine, had we followed the advice of the 2006 pandemic report, which identified the historic recurrence of pandemics and the likely origin of the next one, had we invested in improved health care instead of climate change projects, we would not have been caught off guard by COVID19 and would have been much better prepared.\n\nIn the intervening 2 years since the Abacus poll, some ~$100 billion in investment has been driven out of Canada, as explained by former public servant and diplomat, Robert Lyman, in “Prosperity Foregone”. These losses were driven by the foreign-funded and strategically managed, Tar Sands Campaign ideological supporters and poor government climate policy. Unrelenting ‘Blockadia’ of pipelines, along with foreign-funded agitation of indigenous people by climate activist groups, and international smear campaigns like “Rethink Alberta” have devastated the energy sector. Sir, this is a Green Trade War against Canada. We must fight back.\n\nDue to recent agitation by environmental law ‘charities’ (which are tax-subsidized by working Canadians) and with the help of foreign funding to them, federal approval processes that had worked well for Canada for 60 years were overturned. The uncertainty of new regulations like Bill C-69, Bill C-48, as well as the changes to the former National Energy Board process, which was once regarded as the most technically rigorous and fair process in the world have made investors lose confidence in Canada. As of 2018, Canada has been deemed by PPHB Energy Investment Bank to be a country ‘hostile’ to investment.\n\nThe 265 academics claim to be climate researchers, but few hold credentials in the physical sciences and none appear to have credentials in engineering.\n\nIn terms of climate change, they appear to be unaware that climate prophecies have failed; certainly wind and solar will not stop climate change. These are wasteful uses of precious fossil fuels for little energy return on energy invested.\n\nRather like the popularized notion of the LEAP manifesto, that an east-west power grid in Canada could simplistically electrify and decarbonize the country, expert evaluation shows this is not technically feasible, would cost hundreds of billions of dollars (plus require vast quantities of fossil fuels for such construction), and would put Canada at risk of national black-outs. The “Shocking Reality” of NetZero2050 and decarbonization for Canada is that we do not have enough power generation, and to build it would require many decades and trillions of dollars. There appears to have been little due diligence done; we advise the government to “Look Before You Leap” any further into climate emergency claims.\n\nThe academics claim that oil has been subsidized in Canada – in fact Chris Ragan of Ecofiscal Commission stated on TVO, in an interview with Steve Paikin, that he did not find evidence of such subsidies. January 15, 2019: “…in 2009 and 10, I somehow got assigned to be and labelled as Canada’s expert on the fossil fuel subsidy issue for the G20 discussions because the G20 countries had made a commitment to reduce fossil fuel subsidies. And one of the things that I learned at Finance Canada is that in fact we as a country do not have explicit fossil fuel subsidies.” (bold emphasis added)\n\nThe 265 academics refer to Oil Change International as their source on information about alleged fossil fuel subsidies in Canada. Oil Change International is a group funded by foreign Tar Sands Campaign funders.\n\nAccording to the Oak Foundation grant database, in 2016, Oil Change International was granted $500,000 USD by the Swiss-based Oak Foundation:\n\nTo enhance the ability of civil society to advocate for the reduction of public and private financial support for fossil fuel exploration. Oil Change International is a research, communications and advocacy organisation that investigates financial and power relationships among governments, markets and the fossil fuel industry to facilitate the transition to a clean energy economy.\n\nIn 2016, Oil Change International was granted a further $1,000,000 USD by Oak:\n\nTo advance international commitments for the phase-out of subsidies and public finance to fossil fuels. This will be done by focusing on the G20, the Organisation for Economic Co-operation and Development and other forums of public finance for fossil fuels. Together, the Global Subsidies Initiative, the Natural Resources Defense Council, Oil Change International and the Overseas Development Institute are coordinating an international campaign to bring global taxpayer-funded fossil fuel subsidies to an end.\n\nTo “Keep Canada in the Black” we must abandon this foreign-funded, anti-oil, Tar Sands Campaign rhetoric and ideology and become “Grounded in Reality”.\n\nThe 265 academics call for ‘investing in the future’ – but as Robert Lyman has pointed out in his report “Transition to Reality” – the world runs on fossil fuels; there is no simplistic overnight transition to a new energy system as proposed by these academics. This view is confirmed by numerous books and presentations by Canadian energy expert, Professor Emeritus, Vaclav Smil.\n\nLikewise, as pointed out by Robert Lyman, advocating for renewables jobs is really advocating for jobs in other countries, like China.\n\nThe 265 academics claim that supporting Canada’s oil/gas/oil sands industry will not protect us from global oil price shifts is true – but not having our own energy independence and having all export routes blocked by foreign-funded protesters, will mean Canada will be at the mercy of supply and price of imported oil from despot nations. Though the cost of supporting the industry at this time appears to be large (said to be about $15 billion), Canadians should recognize that over the past 2 decades, taxpayers have subsidized foreign-funded and foreign-directed environmental federally registered ‘charities’ to the tune of $11 billion dollars, as outlined in “Money Matters”. These groups have drawn “Dark Green Money” from overseas. They have reveled in hundreds of millions, perhaps billions, in grants of “Big Green Money” from federal, provincial and municipal governments, mostly for make-work projects on ‘climate change’ for which there is no evidence of net public benefit, and much evidence of significant public and economic harm. Indeed, Canadian taxpayers now face a “Green Titanic” – our economic ship is sinking.\n\nConsequently, a $15 billion support package for the beleaguered oil/gas/oilsands industry can be seen as a fair and reasonable quid pro quo in response to two decades of unrelenting tax-subsidized Tar Sands Campaign. That campaign was also personal – an attack against the thousands of highly qualified Canadian scientists, Professional Geoscientists, Professional Engineers and skilled trades. Many of these Canadians have been driven out of the country to seek work or driven into despair as activists and social ‘scientists’ have drummed their careers out of existence and smeared their excellent academic qualifications.\n\nThe Tar Sands Campaign must end now.\n\nFor all the reasons above, we ask that you reject the letter from the 265 academics and support Canada’s energy sector for the good of our nation, for the benefit of our health care system and workers, and for the enrichment of our economy. In short, to save Canada, we must exit the Paris Agreement, build pipelines to Canadian ports, and return to our senses. We could not fight COVID19 and save lives without modern medicine, which would not exist without the power and products of oil, natural gas and coal.\n\nAbout:\n\nFriends of Science Society is a small, mostly volunteer-run, non-profit society made up of earth, atmospheric, solar scientists, Professional Engineers, Professional Geoscientists and economists. We are supporters of CLINTEL, the international climate intelligence group, based in Holland, which has over 800 signatory scientists, scholar and professionals who state there is no climate emergency and we do have time and the means to adapt to the one constant facing humanity – climate change.", "opengraph": {"locale": "en_US", "site_name": "Friends of Science Calgary | The Sun is the main driver of climate change. Not you. Not carbon dioxide.", "type": "article", "title": "Rebuttal to 265 Academics | Friends of Science Calgary", "description": "An open letter to Prime Minister Trudeau, rebutting the demands of 265 academics and advising that we fight the COVID19 virus, not carbon and climate.", "url": "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/", "article:published_time": "2020-03-30T20:10:19+00:00", "article:modified_time": "2020-03-30T20:10:27+00:00", "article:publisher": "https://facebook.com/FoSClimateEd"}, "tags": ["Tar Sands Campaign", "Ecofiscal Commission", "fossil fuel subsidies", "Laurie Adkin", "CLINTEL", "ENGOs", "Debra Davidson"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/5guXaWwQpe4?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/5guXaWwQpe4?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://blog.friendsofscience.org/wp-content/uploads/2020/03/Open-Letter-to-Prime-Minister-Justin-Trudeau-Mar-30-2020.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2020/03/Open-Letter-to-Prime-Minister-Justin-Trudeau-Mar-30-2020.pdf", "https://nos.nl/artikel/2328548-kabinet-stelt-nieuwe-klimaatplannen-uit.html", "https://www.nationalobserver.com/2020/03/25/opinion/265-academics-trudeau-no-bail-out-oil-and-gas-response-covid-19", "https://blog.friendsofscience.org/2018/04/11/the-abacus-data-ecofiscal-push-poll-a-critique-of-methodology/", "https://www.longwoods.com/articles/images/Canada_Pandemic_Influenza.pdf", "https://blog.friendsofscience.org/2020/03/20/prosperity-foregone-a-summary/", "https://friendsofscience.org/assets/documents/Fear&Loathing.pdf", "http://internationalfunders.org/wp-content/uploads/2014/10/IFIPConferenceReport2010.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2019/02/Manufacturing-A-Climate-Crisis-2A-FINAL.pdf", "http://www.pphb.com/pdfs/musings/Musings041718.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2020/02/When-Climate-Prophecy-Fails-FINAL.pdf", "https://spectrum.ieee.org/energy/renewables/to-get-wind-power-you-need-oil", "https://www.cambridge.org/core/journals/mrs-energy-and-sustainability/article/lessons-from-technology-development-for-energy-and-sustainability/2D40F35844FEFEC37FDC62499DDBD4DC/core-reader", "https://blog.friendsofscience.org/2015/09/29/power-generation-information-on-difficulties-of-instituting-the-proposed-wind-hydro-national-grid-network-in-acting-on-climate-change/", "https://blog.friendsofscience.org/wp-content/uploads/2019/06/Shocking-Reality-FINAL.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2019/05/Look-Before-you-Leap-into-Emergency-Mode.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2016/03/a-business-review-of-green-budget-2016-final-mar-11-2016.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2017/05/grounded-in-reality-may-03-2017-final.pdf", "https://www.thegwpf.org/energy-policy-needs-to-transition-to-reality/", "https://blog.friendsofscience.org/2019/06/10/renewable-energy-jobs-for-other-countries/?highlight=Canadian%20Solar", "https://blog.friendsofscience.org/wp-content/uploads/2019/05/Money-Matters-report-format-FINAL.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2019/05/Dark-Green-Money-Foundation-Funding-Jan-11-2019-1.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2019/02/Big-Green-Money-NO-vs-PRO-FINAL-RevB-FEB-12-2019-2.pdf", "https://blog.friendsofscience.org/wp-content/uploads/2019/04/Green-Titanic-FINAL-RevA-April-29-2019.pdf", "https://blog.friendsofscience.org/2017/06/09/the-cop21-agreement-just-the-facts-please/", "https://clintel.org/", "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/?share=twitter", "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/?share=facebook", "https://blog.friendsofscience.org/2020/03/30/open-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon/?share=linkedin", "mailto:?subject=%5BShared%20Post%5D%20Open%20Letter%20to%20Prime%20Minister%20Justin%20Trudeau%20-%20%20RE%3A%20Letter%20from%20265%20Academics%20%E2%80%93%20COVID19%20Recovery%20%E2%80%93%20Fight%20Virus%20Not%20Carbon&body=https%3A%2F%2Fblog.friendsofscience.org%2F2020%2F03%2F30%2Fopen-letter-to-prime-minister-justin-trudeau-re-letter-from-265-academics-covid19-recovery-fight-virus-not-carbon%2F&share=email"], "authors": [], "publish_date": "2020-03-30T20:10:19+00:00"}