{"result_id": "126011", "URL": "https://covid19criticalcare.com/vaccines-arent-enough/", "timestamp": "2023-04-25 15:10:19 CEST+0200", "meta": {"description": "The White House is eager to distract attention away from the fact that double vaccinated, double-boosted President Biden contracted COVID-19.", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/vaccines-arent-enough/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Vaccines Aren't Enough", "cleaned_text": "The White House is eager to distract attention away from the fact that double vaccinated, double-boosted President Biden has contracted COVID-19. Just a few days after the news broke, STAT News reported a new initiative to develop the next generation of vaccines, together with Pfizer and Moderna. Nothing, it seems, will deter the Biden Administration from funneling money we don’t have to these companies.\n\nBut will the President’s illness break the spell in the court of public opinion?\n\nWriting in Fox News, Dr. Pierre Kory points out Biden’s hypocrisy and urges people to accept the titanic failure of a “vaccine only” approach to ending the pandemic:\n\nWhile Americans across the ideological spectrum wish the President a speedy recovery, we must take this moment to acknowledge that a strategy blindly focused on vaccinations is not getting the job done. Don’t take my word for it. Use Biden’s own standard for success. Exactly one year before testing positive, the President declared, “You’re not going to get COVI-19 if you have these vaccinations.” Back then, the seven-day average of cases in the United States was around 50,000. Today, that number is estimated to be between 500,000-700,000 when considering ubiquitous and uncounted home testing, despite two-thirds of the population considered “fully vaccinated” by the CDC. Yet the push for vaccines from the Administration has continued unabated. Following Biden’s diagnosis, the White House tried take a political victory lap. In their first press briefing following news of the diagnosis, White House Press Secretary Karine Jean-Pierre stressed the President’s vaccination status as, “what’s most important here.”\n\nInstead, Dr. Kory argues, public agencies should embrace generic medicines that have been dismissed by the medical community and mainstream media:\n\nAs a lifelong Democrat and medical doctor who has helped more than 700 patients recover from COVID-19 and its complications, I have seen the effectiveness of other treatment options with my own eyes. Take for instance, fluvoxamine, an inexpensive generic medicine typically associated with depression treatment. It costs four dollars per pill, is readily available at pharmacies, and has demonstrated an effectiveness combatting COVID in large, randomized, controlled trials published in the Journal of the American Medical Association and the Lancet… Progress is a wonderful thing, but it’s only possible with an attitude of open-mindedness that challenges the status quo. Doctors and innovators should be incentivized to pursue and explore to new and different approaches. Instead, we are being forced to adopt a group think or risk suffering the wrath of the establishment, or worse, loss of livelihood.\n\nIn addition to threatening doctors who won’t endorse the failing vaccine-centric strategy, the Biden Administration is subverting the medical profession with a new policy that allows pharmacists to distribute Pfizer’s COVID-19 drug without a doctor’s prescription. Writing in the Federalist, Dr. Kory explains why this is a terrible turn for patients:\n\nThe problems with Paxlovid are no secret. FDA granted Pfizer emergency use authorization for the drug after a single trial with questionable results. The medicine has many contraindications, meaning it can’t be taken by someone who simultaneously would be taking certain anti-depressants, anti-seizure, anti-psychotic, cholesterol, or blood pressure medications. Furthermore, many Americans cannot take Paxlovid, given that nearly half of adults have cardiovascular disease. The risks are plain to see in FDA’s guidance, which recommends referring the patient to a doctor if “sufficient information is not available to assess renal and hepatic function” or “potential drug interactions.” Numerous contraindications are listed, and caution is advised throughout. The burden is on the patient to furnish medical records to prove that he or she doesn’t have any significant kidney or liver disease, drug sensitivities, or other medications that could cause serious adverse events… The pharmaceutical industry, led by Pfizer and in league with the Biden administration, is waging war against independent doctors who refuse to cede control over patient well-being — and they are winning. If there is any hope for change, it will come in November.\n\nWith inflation and gas prices at all-time highs, and Biden’s poll numbers at all-time lows, it’s becoming clear that we’re witnessing the death throes of this Administration.\n\nThere is an epic battle about to be fought in the new year to wrest power from the pharmaceutical industry and its allies in Washington and put it back in the hands of honest doctors and patients, where it belongs. Who is up to the task?", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines Aren't Enough", "description": "The White House is eager to distract attention away from the fact that double vaccinated, double-boosted President Biden has contracted COVID-19. Just a few days after the news broke, STAT News reported a new initiative to develop the next generation of vaccines, together with Pfizer and Moderna. Nothing, it seems, will deter the Biden Administration", "url": "https://covid19criticalcare.com/vaccines-arent-enough/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:published_time": "2022-07-28T15:57:45+00:00", "article:modified_time": "2023-03-13T17:30:29+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2022/07/Vaccines-Arent-Enough.jpeg", "image:width": "1024", "image:height": "683", "image:type": "image/jpeg"}, "tags": ["Fox News", "answering audience questions", "Vaccine Policy", "substack", "Dr. Pierre Kory"], "tweets": [], "movies": [], "links": ["https://www.statnews.com/2022/07/25/white-house-to-launch-effort-to-develop-next-generation-of-covid-vaccines/", "https://www.foxnews.com/opinion/biden-covid-diagnosis-proof-vaccines-enough-fight-virus", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-people-additional-dose-totalpop", "https://www.statnews.com/2022/05/16/fda-rejects-antidepressant-seen-as-possible-covid-19-treatment/", "https://jamanetwork.com/journals/jama/fullarticle/2773108", "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(21)00448-4/fulltext", "https://thefederalist.com/2022/07/22/biden-is-extending-the-covid-emergency-and-prolonging-the-war-on-doctors/"], "authors": ["FLCCC"], "publish_date": "2022-07-28T15:57:45+00:00"}