{"result_id": "126024", "URL": "https://covid19criticalcare.com/dr-jeffrey-endsley-a-hero-among-us/", "timestamp": "2023-04-25 15:10:34 CEST+0200", "meta": {"description": "Dr. Jeffrey Endsley is a dermatologist in Oklahoma. When the pandemic struck, Dr. Endsley knew something was off from the start. “I had to do something. I couldn’t let people suffer when there were obvious treatments that were working. FLCCC has been a lifeline over the past three years — Dr. Kory and Dr. Marik are an inspiration, and your protocols have helped so many (my patients included!) Every day I send people to the FLCCC website for your treatment suggestions.”", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/dr-jeffrey-endsley-a-hero-among-us/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Dr. Jeffrey Endsley: A Hero Among Us", "cleaned_text": "Dr. Jeffrey Endsley is a dermatologist in Oklahoma. When the pandemic struck, Dr. Endsley knew something was off from the start. “My first clue was when Dr. Zelenko’s treatment protocol using hydroxychloroquine was politicized and derided by regulators and public health authorities. Then ivermectin arrived on the scene and the mainstream media joined in, criticizing and demeaning those who used or recommended these life-saving early treatments.”\n\nDr. Endsley then realized a vaccine could not legally receive emergency use authorization if effective treatments were already available. He became convinced the war on ivermectin and hydroxychloroquine meant public health, government regulators, and mainstream media had been captured and corrupted in order to initiate the COVID vaccine experiment. “Now we know that countless lives were lost from lack of early treatment and the COVID shots,” he says.\n\nWhile Dr. Endsley questioned those in authority, sadly most physicians did not. Still, he continued to search for therapies, solutions, and the truth. Following Dr. Peter McCullough, the FLCCC doctors, Dr. Ryan Cole and many others, he started successfully treating dozens of COVID patients. He told his patients about COVID prevention and warned them about potential vaccine dangers. If they wanted to know more about the basis for his recommendations, he would give them websites, show them graphs, and recommend books and videos.\n\nIn his own words: “I had to do something. I couldn’t let people suffer when there were obvious treatments that were working. FLCCC has been a lifeline over the past three years — Dr. Kory and Dr. Marik are an inspiration, and your protocols have helped so many (my patients included!) Every day I send people to the FLCCC website for your treatment suggestions.”\n\nDr. Endsley was also one of the many healthcare providers at our inaugural Education Conference in Orlando, Florida. Our goal with events like that is to widen the pool of providers who can bring treatments to people like you.\n\n“Thank you to all who make these educational events possible,” he says. “They are critical, both for the information provided and the connections made. They are a path forward out of this terrible time.”\n\nWe thank you, Dr. Endsley, for everything you’ve done to make things better for the people around you.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Jeffrey Endsley: A Hero Among Us", "description": "Dr. Jeffrey Endsley is a dermatologist in Oklahoma. When the pandemic struck, Dr. Endsley knew something was off from the start. “My first clue was when Dr. Zelenko’s treatment protocol using hydroxychloroquine was politicized and derided by regulators and public health authorities. Then ivermectin arrived on the scene and the mainstream media joined in, criticizing", "url": "https://covid19criticalcare.com/dr-jeffrey-endsley-a-hero-among-us/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:published_time": "2023-03-30T05:30:49+00:00", "article:modified_time": "2023-03-30T15:05:29+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2023/03/3-Endsley-feature-image-1.png", "image:width": "2000", "image:height": "1125", "image:type": "image/png"}, "tags": ["Dr. Jeffrey Endsley", "Heroes Among Us Campaign 2023", "answering audience questions"], "tweets": [], "movies": [], "links": [], "authors": ["FLCCC"], "publish_date": "2023-03-30T05:30:49+00:00"}