{"result_id": "126027", "URL": "https://covid19criticalcare.com/live-flccc-educational-conference/", "timestamp": "2023-04-25 15:10:41 CEST+0200", "meta": {"description": "Dr. Paul Marik launched the first-ever FLCCC Educational Conference with a simple and powerful observation:  \"They can not hide this anymore.\"", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/live-flccc-educational-conference/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "\"They Can Not Hide This Anymore\" FLCCC Educational Conference - Live!", "cleaned_text": "Please visit the following link for Day 2 updates\n\n“Treat the Patient not the Symptoms”\n\nFLCCC Member, Dr. Flavio Cadegiani, wrapped up the first day of presentations of the Educational Conference speaking directly on patient-centered medicine. Examining spike protein found in COVID and mRNA, Dr. Cadegiani reviewed research indicating a decrease in testosterone levels and a large decline in the fertility rates across the globe.\n\nExosomes and the Neurological Impact of Spike-Induced Disease\n\nDr. Suzanne Gazda, founder of the Neurology Institute of San Antonio, joined the FLCCC Educational Conference via video presentation and touched on many topics related to spread of COVID SARS and the various neurological complications related to spike protein.\n\nDr. Gazda presented research regarding the transmission of the COVID virus via exosomes.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nDr. Keith Berkowitz, FLCCC advisor and Founder of Center for Balanced Health, discussed the importance of purging (or preferably avoiding) spike protein found in SARs and mRNA. Answering audience questions Dr. Berkowitz said, “My sickest patients are those who had COVID then were vaccinated.”\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nAfter a quick lunch break, social media star, online medical educator and host of the weekly webinar, Long (COVID) Story Short, Dr. Mobeen Syed (Dr. Been), took the stage to discuss all things autophagy. In regard to the spike protein found in COVID-19 and mRNA vaccines, “we need autophagy to clear spike protein,” he said using a note card to represent an immune cell.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\n“System Doctors Are Not Being Taught About This Disease”\n\nDr. Pierre Kory, FLCCC Chief Medical Officer, reviews the first-line therapies he prescribes to treat patients diagnosed with vaccine injury and/or Long COVID complications.\n\n“There’s a heck of a lot of lying (from the system) so always maintain an open mind,” Dr. Kory told a crowd of mostly medical professionals.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nBalancing his trademark wit and humor with the serious topics of prevention and treatment, Dr. Paul Marik and FLCCC Weekly Webinar Host, Betsy Ashton, take questions on FLCCC protocols from conference attendees.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nSteve Kirsch, Founder, Vaccine Safety Research Foundation, shared his organization’s research on the various COVID vaccines. Kirsch ended the Q&A telling the audience, if medical professionals insist that “correlation is not causation,” explain the statistical significance of the data contrary to the CDC’s Safe and Effective COVID vaccine claims.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nDr. Ryan Cole, CEO and Medical Director of Cole Diagnostics, was the first guest speaker this morning following Dr. Marik’s welcome remarks.\n\nDr. Cole captivated the audience with his research and slides on spike protein, and issued a (polite) challenge to anyone who disagreed with the science — present the data and let’s discuss.\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\n“They Can Not Hide This Anymore”\n\nThe first-ever FLCCC Educational Conference, Understanding & Treating Spike Protein Induced Diseases, kicked off this morning in Orlando, Florida.\n\nFLCCC Chairman and Chief Scientific Officer, Dr. Paul Marik, launched the conference with a simple and powerful observation: “They can not hide this anymore.”\n\nCheck back for more updates throughout Saturday and Sunday, October 14-16.\n\nPlease visit the following link for Day 2 updates", "opengraph": {"locale": "en_US", "type": "article", "title": "\"They Can Not Hide This Anymore\" FLCCC Educational Conference - Live!", "description": "Please visit the following link for Day 2 updates\r\n\r\nhttps://covid19criticalcare.com/we-basically-dont-know-whats-in-these-vaccines-flccc-educational-conference-live-day-2/\r\n\r\nUPDATED 4:15 PM (EST)\r\n\"Treat the Patient not the Symptoms\"\r\n\r\n\r\nFLCCC Member, Dr. Flavio Cadegiani, wrapped up the first day of presentations of the Educational Conference speaking directly on patient-centered medicine.  Examining spike protein found in COVID and mRNA, Dr. Cadegiani", "url": "https://covid19criticalcare.com/live-flccc-educational-conference/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:published_time": "2022-10-15T14:27:53+00:00", "article:modified_time": "2023-03-13T17:16:56+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2022/10/IMG_2432-scaled-e1665844417289.jpg", "image:width": "1707", "image:height": "1554", "image:type": "image/jpeg"}, "tags": ["FLCCC Protocols", "VSRF", "Dr. Paul Marik", "FLCCC Education Conference", "Dr. Keith Berkowitz", "Exosomes", "Steve Kirsch", "answering audience questions", "Vaccine Safety Research Foundation", "Dr. Mobeen Syed", "Low-Dose Naltrexone", "Dr. Ryan Cole", "LDN", "System Doctors", "Autophagy", "mRNA", "Dr. Been", "Betsy Ashton"], "tweets": [], "movies": [], "links": ["https://covid19criticalcare.com/we-basically-dont-know-whats-in-these-vaccines-flccc-educational-conference-live-day-2/", "https://covid19criticalcare.com/we-basically-dont-know-whats-in-these-vaccines-flccc-educational-conference-live-day-2/"], "authors": ["FLCCC"], "publish_date": "2022-10-15T14:27:53+00:00"}