{"result_id": "126013", "URL": "https://covid19criticalcare.com/studies/", "timestamp": "2023-04-25 15:10:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/studies/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Studies", "cleaned_text": "Corticosteroid therapy is one of the most effective interventions in COVID-19 and MATH+. From early March 2020, when the FLCCC team of physicians first came together to study and create treatment protocols for fighting the novel disease, the team, guided by Dr. G. Umberto Meduri’s expertise in corticosteroid use, placed methylprednisolone at the head — as the “M” — in its MATH+ hospital treatment formula. As a result, the two hospitals using the MATH+ formula had mortality rates of no higher than 6%, when most hospitals lost as many as 80% of their seriously ill COVID patients. This was months before the landmark RECOVERY trial convinced world authorities to allow and advocate for the use of steroids in treating the inflammatory stage of the disease. Publications listed below range from large scale observational studies demonstrating large impacts on mortality in the prior pandemics of SARS and H1N1, through the landmark RECOVERY trial done in the United Kingdom against COVID-19, to numerous and increasing COVID-19 retrospective cohort studies published from Italy, China, Spain, and the United States. In addition, a scientific review of the evidence supporting methylprednisolone in COVID-19 authored by FLCCC Alliance member Dr. G. Umberto Meduri can be found here.\n\nJun 1, 2021\n\n Is Methylprednisolone Better than Dexamethasone for Severe COVID-19?\n\n Daniel D. Dressler, MD, MSc, MHM, FACP\n\nOct 7, 2020\n\n The ten reasons why corticosteroid therapy reduces mortality in severe COVID-19\n\n Yaseen M. Arabi, George P. Chrousos & G. Umberto Meduri\n\nSep 22, 2020\n\n SARS-CoV-2 organising pneumonia: ‘Has there been a widespread failure to identify and treat this prevalent condition in COVID-19?’\n\n Pierre Kory (FLCCC Alliance) and Jeffrey P. Kanne\n\nSep 12, 2020\n\n Prolonged Low-Dose Methylprednisolone in Patients With Severe COVID-19 Pneumonia\n\n Francesco Salton, Paola Confalonieri, G. Umberto Meduri et al.\n\nSep 2, 2020\n\n Timing is crucial and hydrocortisone should be started within the first 12 hours after shock onset\n\n Cohort study: “Evaluation of the Initiation Timing of Hydrocortisone in Adult Patients With Septic Shock”\n\nSep 2, 2020\n\n Effect of Hydrocortisone on Mortality and Organ Support in Patients With Severe COVID-19\n\n The REMAP-CAP COVID-19 Corticosteroid Domain Randomized Clinical Trial\n\nSep 2, 2020\n\n Effect of hydrocortisone on 21-day mortality or respiratory support among critically ill patients with COVID-19\n\n A Randomized Clinical Trial\n\nSep 2, 2020\n\n Effect of dexamethasone on days alive and ventilator-free in patients with moderate or severe acute respiratory distress syndrome and COVID-19\n\n The CoDEX Randomized Clinical Trial\n\nJun 25, 2020\n\n Treatment with Methylprednisolone leads to significant mortality reduction in COVID-19\n\n “Prolonged low-dose methylprednisolone in patients with severe COVID-19 pneumonia” (Clinical Trial)\n\nJune 18, 2020 | Spain\n\n Methylprednisolone decreases risk of ICU, NIV, or death in Covid-19\n\n “GLUCOCOVID: A controlled trial of methylprednisolone in adults hospitalized with COVID-19 pneumonia” (Clinical Trial)\n\nMay 19, 2020\n\n Early CST (corticosteroid treatment) reduces mortality, need for ICU beds, ventilators in COVID-19\n\n “Early short course corticosteroids in hospitalized patients with COVID-19” (Multi-center quasi-experimental study)\n\nMay 15, 2020\n\n Methylprednisolone counteracts SARS-CoV-2 gene activation pattern\n\n “COVID-19: disease pathways and gene expression changes predict methylprednisolone can improve outcome in severe cases” (Clinical Study)\n\nMay 13, 2020\n\n CST reduces the risk of intubation in COVID-19 patients\n\n “Beneficial effect of corticosteroids in severe COVID-19 pneumonia: A propensity score matching analysis” (Case-control Study)\n\nApr 20, 2020\n\n CST reduced mortality during SARS and H1N1 pandemics\n\n “Rationale for Prolonged Corticosteroid Treatment in the Acute Respiratory Distress Syndrome Caused by Coronavirus Disease 2019”\n\nApr 28, 2020\n\n Early CST reduces need for mechanical ventilation, ICU and hospital LOS, and oxygen support\n\n “A retrospective cohort study of methylprednisolone therapy in severe patients with COVID-19 pneumonia”\n\nApr 22, 2020\n\n The role of Glucocorticoid receptors in critical illness\n\n “General Adaptation in Critical Illness: Glucocorticoid Receptor-alpha Master Regulator of Homeostatic Corrections”\n\nApr 20, 2020\n\n Timed & titrated use of steroid in COVID-19?\n\n Josh Farkas of PulmCrit reviews need for steroids in COVID-19\n\nApr 2020\n\n Rationale for Prolonged Corticosteroid Treatment in the Acute Respiratory Distress Syndrome Caused by Coronavirus Disease 2019\n\n Jesús Villar, Marco Confalonieri, Stephen M. Pastores, G. Umberto Meduri\n\nMar 13, 2020\n\n CST in COVID ARDS associated with lower mortality\n\n “Risk Factors Associated With Acute Respiratory Distress Syndrome and Death in Patients With Coronavirus Disease 2019 Pneumonia in Wuhan, China” (Cohort Study)", "opengraph": {"locale": "en_US", "type": "article", "title": "Studies", "url": "https://covid19criticalcare.com/studies/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:modified_time": "2023-03-13T17:43:41+00:00", "description": "The work of the FLCCC is based on a substantial body of evidence that supports our recommendations. The doctors of the FLCCC have themselves conducted and published peer-reviewed studies, as well as systematic reviews and meta-analyses. They have also reviewed and referenced tens of thousands of other studies in support of these positions. Most"}, "tags": ["answering audience questions"], "tweets": [], "movies": [], "links": ["https://www.jwatch.org/na53560/2021/06/01/methylprednisolone-better-dexamethasone-severe-covid-19", "https://link.springer.com/article/10.1007/s00134-020-06223-y", "https://bmjopenrespres.bmj.com/content/7/1/e000724.full", "https://doi.org/10.1093/ofid/ofaa421", "http://doi.org/10.1097/SHK.0000000000001651", "https://jamanetwork.com/journals/jama/fullarticle/2770278?utm_campaign=articlePDF", "https://jamanetwork.com/journals/jama/fullarticle/2770276tm_medium=articlePDFlink&utm_source=articlePDF&utm_content=jama.2020.16761", "https://jamanetwork.com/journals/jama/fullarticle/2770276tm_medium=articlePDFlink&utm_source=articlePDF&utm_content=jama.2020.16761", "https://doi.org/10.1101/2020.06.17.20134031", "https://doi.org/10.1101/2020.06.17.20133579", "https://doi.org/10.1093/cid/ciaa601", "https://dx.doi.org/10.21203/rs.3.rs-29392/v1", "https://doi.org/10.1101/2020.05.08.20094755", "https://doi.org/10.1097/cce.0000000000000111", "https://doi.org/10.1038/s41392-020-0158-2", "https://doi.org/10.3389/fendo.2020.00161", "https://emcrit.org/pulmcrit/steroid-covid/", "http://doi.org/10.1097/CCE.0000000000000111", "https://doi.org/10.1001/jamainternmed.2020.0994"], "authors": [], "publish_date": null}