{"result_id": "126041", "URL": "https://covid19criticalcare.com/faq-items/does-flccc-support-covid-vaccines-for-children/", "timestamp": "2023-04-25 15:11:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/faq-items/does-flccc-support-covid-vaccines-for-children/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Does FLCCC support COVID vaccines for children?", "cleaned_text": "No. The risks far outweigh any benefits in terms of efficacy, given that children have a 99.995% recovery rate, and a body of medical literature indicates that almost zero healthy children under five years old have died from COVID. In this context, the risks are unacceptable.\n• Safety studies on COVID vaccines for kids were grossly under-powered and looked at too few subjects for insufficient periods of time.\n• Additionally, according to the government’s Vaccine Adverse Event Reporting System (VAERS), at least 58 children under 3 years old experienced life-threatening side effects from receiving the mRNA vaccines. (It is not yet known if any of these children died.)\n• In the Pfizer trial, 34 children became ill with COVID after being vaccinated—yet only 13 in the placebo group contracted the disease.\n• As of early June 2022, the CDC and FDA report (via VAERS) that nearly 50,000 American children (up to age 17) have suffered harm following a COVID shot. More than 7,500 kids have required hospitalization, or an emergency room visit due to their vaccine-correlated injury.\n• Since vaccines were approved for kids 6 and older, nearly two dozen children have reportedly died from receiving the vaccines. Some developed myocarditis, which has a mortality rate of 25-56% over a course of up to 10 years as heart failure progresses.\n• It is not yet known how these experimental vaccines will affect the development of children. Also, no human reproductive toxicity data has yet been published.\n• Over one million adverse events related to the COVID vaccines have been reported across the country since the shots became available in late 2020. However, we believe that the number of those who have been vaccine-injured—or those who died—is much, much higher.", "opengraph": {"locale": "en_US", "type": "article", "title": "Does FLCCC support COVID vaccines for children?", "url": "https://covid19criticalcare.com/faq-items/does-flccc-support-covid-vaccines-for-children/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:modified_time": "2022-08-25T18:07:02+00:00", "description": "No. The risks far outweigh any benefits in terms of efficacy, given that children have a 99.995% recovery rate, and a body of medical literature indicates that almost zero healthy children under five years old have died from COVID. In this context, the risks are unacceptable.\r\n\r\n \tSafety studies on COVID vaccines"}, "tags": ["answering audience questions"], "tweets": [], "movies": [], "links": ["https://collections.wip.nlm.nih.gov/catalog/nlm:nlmuid-101774952-pdf", "https://www.nature.com/articles/s41591-021-01578-1", "https://www.foxnews.com/opinion/cdc-recommends-covid-19-vaccines-babies-kids-under-5-6-things-parents-need-know", "https://vaers.hhs.gov/", "https://dailyclout.io/breaking-58-babies-who-received-mrna-covid-19-vaccines-suffered-life-threatening-adverse-events/", "https://www.naturalhealth365.com/terrifying-latest-vaers-numbers-reveal-50000-children-injured-by-covid-jab-125-dead.html"], "authors": [], "publish_date": null}