{"result_id": "126016", "URL": "https://covid19criticalcare.com/faq/", "timestamp": "2023-04-25 15:10:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/faq/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "FAQ", "cleaned_text": "What about the recent large, randomized controlled trials that seem to show ivermectin is not effective for COVID-19? What about the recent large, randomized controlled trials that seem to show ivermectin is not effective for COVID-19? Many of the trials have extreme conflicts of interest and appear to have been designed to fail and predetermined to show ivermectin as ineffective. Many use a monotherapy (e.g., treatment with only one therapeutic) when our frontline physicians have found ivermectin is most effective as part of a treatment protocol that includes other FDA-approved medications and supplements backed by clinical and observational evidence. The trials often under-dosed and started treatment far too late, even though in the medical community it is common knowledge that COVID-19 becomes far more difficult to treat the longer a patient has had symptoms. Treating early is imperative. The TOGETHER trial, for example, studied patients who started treatment up to eight days after the onset of symptoms. ACTIV-6 severely limited the use of ivermectin, administering a dose below what is known to be effective on the variants at the time and received too late (6 days on average) after the onset of symptoms. Despite these obvious shortfalls, in ACTIV-6 there was a statistically significant, albeit modest, impact on time to clinical recovery for patients using ivermectin to treat COVID-19. This effect was prominently seen in the more severe patients in the trial, whose symptoms were reduced by an average of three days with ivermectin. FLCCC physicians have understood for nearly 18 months that ivermectin works best against COVID-19 when administered early, in combination with other therapies and given with a fatty meal for at least 5 days or until symptoms resolve. Trials of generic medicines that are funded and influenced by profit-driven pharmaceutical companies will always fail. We need an independent system dedicated to conducting well-designed trials and transparent research studies of repurposed generic treatments – not just for COVID-19, but for all diseases that may have safe and affordable remedies. The use of independent research is our only hope of understanding how these medicines can best be used to help patients.\n\nWhat does “off-label” mean? What does “off-label” mean? Once the FDA approves a prescription medication, federal laws allow any U.S. physician to prescribe the duly approved drug for any reason. In fact, around 30 percent of all prescriptions are for off-label uses, written by American doctors exercising their medical judgment. FDA-approved drugs like ivermectin may be prescribed for an unapproved use (“off-label”) when the physician believes it to be medically appropriate for their patients. The FDA affords clinicians the freedom to prescribe and treat using medications that they deem to be in the best interest of the patient. The NIH COVID-19 Treatment Panel states that, “Providers can access and prescribe investigational drugs or agents that are approved or licensed for other indications through various mechanisms, including Emergency Use Authorizations (EUAs), Emergency Investigational New Drug (EIND) applications, compassionate use or expanded access programs with drug manufacturers, and/or off-label use.” The panel also recommends that promising, unapproved, or unlicensed treatments for COVID-19 be studied in well-designed, controlled clinical trials. This includes drugs that have been approved or licensed for other indications. It is important to note that there have been multiple published, peer-reviewed controlled clinical trials throughout the world that point to the efficacy of ivermectin in the prevention and treatment of COVID-19. The panel also stipulates that the treatment recommendations in their guidelines are not mandates, but rather that “the choice of what to do or not to do for an individual patient is ultimately decided by the patient and their provider.” Good medical practice and the best interests of the patient require that physicians use legally available drugs, biologics, and devices according to their best knowledge and judgement. Doctors may prescribe what they wish as long as they believe themselves to be well-informed and basing their decision on sound medical evidence. It should be noted, however, that individual institutions may set their own standards for off-label prescriptions if they so choose. To read more about off-label prescriptions, visit the list on www.fda.gov.\n\nCan a pharmacist refuse to fill a valid prescription for a medicine like ivermectin written by a licensed healthcare provider? Can a pharmacist refuse to fill a valid prescription for a medicine like ivermectin written by a licensed healthcare provider? No. Although it is true that in some states in the U.S., pharmacists have the right to refuse to fill a prescription, they can only do so if they are concerned about potential harm to the patient, a concern that is valid in few circumstances, such as the following:\n• A known allergy – i.e. the pharmacist would need to cite a documented history of an allergic reaction during prior treatment with ivermectin that the provider has not indicated they were aware of;\n• A known adverse interaction with another medication the patient is taking. In this case, the pharmacist would need to cite an absolute contraindication to concurrent use with another medication;\n• The prescribed dose is above the recommended dosage – given that studies using ivermectin doses up to 10 times the FDA approved dose of 0.2mg/kg have not been associated with any increased adverse effects, this reason would be invalid. Further, doctors can and do prescribe medicines above normal doses for patients and this practice is perfectly legal. Finally, of the many treatment studies of ivermectin in COVID-19, multi-day dose regimens of up to 0.3mg/kg have been used with no reported increase in adverse effects. Note that if a pharmacist refuses to fill the ivermectin prescription by claiming that “it is not recommended or approved for COVID-19” they should be made aware of the following: NIH treatment guidelines are not mandates and thus do not and cannot restrict any provider’s decision to prescribe a medication that the NIH Guidelines panel does not recommend. As stated in the NIH COVID-19 Treatment Guidelines: “it is important to stress that the rated treatment recommendations in these Guidelines should not be considered mandates. The choice of what to do or not to do for an individual patient is ultimately decided by the patient and their provider.” “Off-label” prescribing of a medicine that has received FDA-approval for another indication is both legal and common. Thus, if a pharmacist refuses to fill a prescription without an accepted indication for refusal as above, this can be considered “practicing medicine.” Given that pharmacists have no legal right to practice medicine, in such a case, a complaint to the state medical licensing board may be appropriate. Further, the permit holder/store owner, the pharmacist in charge, the pharmacist who refuses to fill a prescription, and the wholesaler are all licensed by their state’s Board of Pharmacy. A complaint for unprofessional conduct can be filed against each with the appropriate Board of Pharmacy. We offer step-by-step guidance to Overcoming Pharmacy Barriers here.", "opengraph": {"locale": "en_US", "type": "article", "title": "FAQ", "url": "https://covid19criticalcare.com/faq/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:modified_time": "2023-03-13T17:41:40+00:00"}, "tags": ["click here to see all our Q and A posts.", "answering audience questions"], "tweets": [], "movies": [], "links": ["#collapse-1-5769", "https://ivmstatus.com/", "#collapse-1-5771", "https://www.nobelprize.org/prizes/medicine/2015/press-release/", "https://c19ivermectin.com/", "#collapse-1-6465", "https://ivmmeta.com/#fig_fpd", "https://ivmmeta.com/#fig_fpm", "https://ivmmeta.com/#fig_fpi", "https://ivmmeta.com/#fig_fph", "https://ivmmeta.com/#fig_fpry", "https://ivmmeta.com/#fig_fpc", "https://ivmmeta.com/#fig_fpv", "https://ivmmeta.com/#fig_fp", "#collapse-1-6466", "https://ivmmeta.com/#ttconflicts", "https://covid19criticalcare.com/wp-content/uploads/2022/03/Statement-on-Together-Trial-WSJ-Article-Mar-18-1.pdf", "https://covid19criticalcare.com/wp-content/uploads/2022/06/FLCCC-ACTIV-6-Statement-June-14-22.-zsdocx-1.pdf", "#collapse-1-6467", "https://covid19criticalcare.com/treatment-protocols/", "https://covid19criticalcare.com/providers/", "#collapse-1-6468", "#collapse-1-6469", "https://pubmed.ncbi.nlm.nih.gov/26954318/", "https://covid19criticalcare.com/wp-content/uploads/2022/04/FLCCC-Information-Evidence-for-Safety-of-Ivermectin.docx.pdf", "https://reference.medscape.com/drug/stromectol-ivermectin-342657#3", "#collapse-1-6470", "https://www.drugs.com/ivermectin.htm", "#collapse-1-6471", "https://covid19criticalcare.com/treatment-protocols/", "https://covid19criticalcare.com/providers/", "#collapse-1-6472", "https://covid19criticalcare.com/wp-content/uploads/2022/04/FLCCC-Information-Evidence-for-Safety-of-Ivermectin.docx.pdf", "#collapse-1-6473", "https://www.drugs.com/ivermectin.html", "#collapse-1-6474", "#collapse-1-6475", "https://www.thelancet.com/journals/langlo/article/PIIS2214-109X(19)30453-X/fulltext", "#collapse-1-6476", "https://www.covid19treatmentguidelines.nih.gov/introduction/", "https://c19ivermectin.com/", "https://www.fda.gov/patients/learn-about-expanded-access-and-other-treatment-options/understanding-unapproved-use-approved-drugs-label", "#collapse-1-6477", "https://covid19criticalcare.com/treatment-protocols/totality-of-evidence/", "https://covid19criticalcare.com/providers/", "#collapse-1-6478", "https://www.covid19treatmentguidelines.nih.gov/introduction/", "https://nabp.pharmacy/about/contact/", "https://www.fsmb.org/contact-a-state-medical-board/", "https://covid19criticalcare.com/wp-content/uploads/2022/01/Overcoming-Pharmacy-Barriers.pdf", "#collapse-1-6479", "#collapse-1-6480", "#collapse-1-6481", "#collapse-1-6482", "#collapse-1-6483", "#collapse-1-6484", "https://covid19criticalcare.com/treatment-protocols/i-recover/", "#collapse-1-6489", "#collapse-1-6485", "https://collections.wip.nlm.nih.gov/catalog/nlm:nlmuid-101774952-pdf", "https://www.nature.com/articles/s41591-021-01578-1", "https://www.foxnews.com/opinion/cdc-recommends-covid-19-vaccines-babies-kids-under-5-6-things-parents-need-know", "https://vaers.hhs.gov/", "https://dailyclout.io/breaking-58-babies-who-received-mrna-covid-19-vaccines-suffered-life-threatening-adverse-events/", "https://www.naturalhealth365.com/terrifying-latest-vaers-numbers-reveal-50000-children-injured-by-covid-jab-125-dead.html", "#collapse-1-6486", "#collapse-1-6487", "https://vireslaw.group/covid-resource-network", "https://hospital-help.com/legal-options", "#collapse-1-6488", "https://covid19criticalcare.com/contact/", "https://covid19criticalcare.com/contact/", "#collapse-1-23847", "https://covid19criticalcare.com/tag/qanda/"], "authors": [], "publish_date": null}