{"result_id": "126007", "URL": "https://covid19criticalcare.com/tommy-blake-a-hero-among-us/", "timestamp": "2023-04-25 15:10:13 CEST+0200", "meta": {"description": "While Tommy thanks the FLCCC for helping him get better and inspiring him and his wife to help others, we think he’s the real hero — for being strong, seeking the truth, and going out of his way to save the lives of the people around him.", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/tommy-blake-a-hero-among-us/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Tommy Blake: A Hero Among Us", "cleaned_text": "“It was like a community team effort in progress…” Tommy Blake: A Hero Among Us\n\nBack in January 2020, Tommy Blake was working on a client’s home, rebuilding their ductwork during a cold winter. The work needed to be done, but with COVID just kicking off he was concerned about keeping the homeowners, his workers, and himself healthy and safe.\n\n“I was in a jam,” he says. “Proper information was scarce here in the United States. I did find a study in Peru where 800 out of 1200 doctors and nurses took ivermectin. None of the 800 got sick. That got my attention.”\n\nLater in 2020, Tommy heard Dr. Pierre Kory’s testimony in front of the U.S. Senate and in 2021 he discovered the FLCCC and doctors who were standing their ground for medical truth.\n\nMeanwhile, local doctors and pharmacists told him that, at age 67, he should get the vaccine and not use ivermectin.\n\nIn the end, he decided not to get the vaccine and was prescribed ivermectin and fluvoxamine as a ‘just-in-case’ kit instead.\n\nWhen he did eventually get COVID, he took the medications he had been prescribed and started turning a corner within hours. A few days later he was back to normal.\n\n“From that point on, my wife and 2 of my 3 children followed FLCCC protocols, working with Dr. Syed Haider,” he says.\n\nAfter seeing his remarkable recovery, neighbors and fellow church members in his small town began asking Tommy for help. He and his wife would connect them with Dr. Haider, help them get their prescriptions, and run errands to the store to get what they needed.\n\n“It was amazing,” he says. “It was like a community team effort in progress.”\n\nHe recalls the story of one friend who had been sick with COVID for three weeks. Her own doctor had told her to “go home and get ready to die.” Tommy immediately told her about the FLCCC protocols, and with the help of IV Vitamin C and ivermectin, she turned around. Six weeks later, she went on vacation.\n\nWhile Tommy thanks the FLCCC for helping him get better and inspiring him and his wife to help others, we think he’s the real hero — for being strong, seeking the truth, and going out of his way to save the lives of the people around him.\n\n“I know God, proper medicine, Dr. Haider, and the good doctors at FLCCC saved so many of us,” says Tommy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tommy Blake: A Hero Among Us", "description": "“It was like a community team effort in progress…” Tommy Blake: A Hero Among Us\r\n\r\nBack in January 2020, Tommy Blake was working on a client’s home, rebuilding their ductwork during a cold winter. The work needed to be done, but with COVID just kicking off he was concerned about keeping the homeowners, his workers, and himself", "url": "https://covid19criticalcare.com/tommy-blake-a-hero-among-us/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:published_time": "2023-03-19T18:15:21+00:00", "article:modified_time": "2023-03-20T18:27:15+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2023/03/1-Blake-feature-image.png", "image:width": "2000", "image:height": "1125", "image:type": "image/png"}, "tags": ["Heroes Among Us Campaign 2023", "Tommy Blake", "answering audience questions"], "tweets": [], "movies": [], "links": [], "authors": ["FLCCC"], "publish_date": "2023-03-19T18:15:21+00:00"}