{"result_id": "126018", "URL": "https://covid19criticalcare.com/treatment-protocols/i-recover-long-covid-treatment/", "timestamp": "2023-04-25 15:10:26 CEST+0200", "meta": {"description": "Months after acute infection of COVID-19, up to 80% of patients experience prolonged illness, and likely did not receive adequate treatment.", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/treatment-protocols/i-recover-long-covid-treatment/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "I-RECOVER: Long COVID Treatment", "cleaned_text": "Due to the marked overlap between long COVID and post-vaccine syndrome, please refer to the I-RECOVER Post-Vaccine Treatment protocol for detailed treatment strategies. This page highlights the differences between these two syndromes, namely ongoing organizing pneumonia.\n\nLong COVID, also known as Long Haul COVID Syndrome (LHCS) and more recently by the terminology “Post-acute sequelae of COVID-19 (PASC), is a diverse syndrome characterized by prolonged malaise, headaches, generalized fatigue, sleep difficulties, hair loss, smell disorder, decreased appetite, painful joints, dyspnea, chest pain, and cognitive dysfunction.\n\nUp to 80% of patients experience prolonged illness after COVID-19. Furthermore, many of the symptoms of are common to COVID-19 vaccine-injured patients; indeed, both disorders are considered manifestations of “spike protein-related disease,” with a significant overlap in symptoms, pathogenesis, and treatment.\n\nTo complicate this issue further, many long COVID patients are vaccinated, and the symptomatology of vaccine-injured patients is often exacerbated by an acute COVID-19 infection.\n\nLong COVID may persist for months after the acute infection and almost half of patients report reduced quality of life. Patients may suffer prolonged neuropsychological symptoms, including multiple domains of cognition. A puzzling feature of long COVID is that it is not predicted by initial disease severity; long COVID frequently occurs in people who had mild-to-moderate cases and in younger adults who did not require respiratory support or intensive care.\n\nThe symptom set of long COVID is, in the majority of cases, very similar to chronic inflammatory response syndrome (CIRS)/myalgic encephalomyelitis/chronic fatigue syndrome. An important differentiating factor from CIRS is the observation that long COVID continues to improve on its own, albeit slowly in the majority of cases. Another important observation is that long COVID includes more young people compared to severe COVID, which affects older people or persons with comorbidities. Furthermore, the similarity between mast cell activation syndrome (MCAS) and long COVID has been observed, and many consider long COVID to be a variant of MCAS.\n\nThe clinical signs and symptoms of long COVID can be grouped into the following clusters. The reason for this grouping is to allow organ-specific targeted therapy or individualized therapy:\n• Neurological/psychiatric: brain fog, malaise, tiredness, headaches, migraines, depression, inability to focus or concentrate, altered cognition, insomnia, vertigo, panic attacks, tinnitus, anosmia, phantom smells, etc.\n\nLong COVID likely results from a variety of pathogenetic mechanisms. Delayed treatment in the early symptomatic phase likely results in a high viral load (high spike protein load), which increases the risk and severity of long COVID. Other theories include:\n• Monocyte and microglia activation. Persistence of spike protein in monocytes, macrophages, pericytes, and microglia results in an ongoing inflammatory response in an attempt by the immune system to clear the offending protein(s) and viral RNA fragments.\n• Neurological symptoms may be related to micro- and/or macrovascular thrombotic disease, which appears to be common in severe COVID-19 disease. The brain microvasculature expresses ACE-2 receptors and SARS-CoV-2 “pseudovirions” may bind to the microvascular endothelium, causing cerebral microvascular inflammation and clotting. Brain MRIs 3 months post-infection demonstrated microstructural changes in 55% of patients.\n• Due to molecular mimicry, the spike protein results in a vast spectrum of autoantibodies, many of which are associated with neurological complications. In particular, features of encephalopathy may be related to encephalitis and auto-reactive brain antibodies. Small fiber neuropathy and autonomic neuropathy (POTS) are directly associated with the presence of autoantibodies. Antibodies against the ACE2 receptor and G-coupled membrane receptors are commonly found in long COVID patients.\n• An unmasking or triggering of MCAS. Mast cells are present in the brain, especially in the median eminence of the hypothalamus, where they are located perivascularly close to nerve endings positive for corticotropin-releasing hormone. Following stimulation, mast cells release proinflammatory mediators such as histamine, tryptase, chemokines, and cytokines, which may result in neurovascular inflammation. The “brain fog,” cognitive impairment and general fatigue reported in long COVID may be due to mast cell-related neurovascular inflammation.\n• Immune suppression with reactivation of dormant viruses and/or reactivation of chronic bacterial infections (i.e., Lyme disease, etc.).\n\nPlease refer to I-RECOVER: Post-Vaccine Treatment for specific treatment guidance.\n\nPatients with long COVID should be managed by clinicians who have experience treating this troublesome disorder. The treatment approach should be individualized to clinical signs and symptoms. However, in general, it is likely that patients who did not receive adequate antiviral treatment (e.g., ivermectin, etc.) and anti-inflammatory/macrophage repolarization treatment during the acute symptomatic phase of COVID-19 are more likely to develop long COVID.\n\nThe major difference between long COVID and post-vaccine syndrome is unresolved organizing pneumonia with persistent respiratory symptoms. Therefore, chest imaging is suggested in patients with ongoing respiratory symptoms (preferably a chest CT scan).\n\nThose with unresolved pulmonary inflammation (organizing pneumonia with ground glass opacification) should be treated with a course of corticosteroids. Low-dose prednisolone or methylprednisolone (10 mg/day) for six weeks is suggested. However, the patients’ symptoms and CRP should be followed closely, as a dose escalation may be required in those who respond poorly.\n\nSome patients who have recovered from COVID-19 organizing pneumonia will develop pulmonary fibrosis with associated limitation of activity. These patients should be referred to a pulmonologist with expertise in pulmonary fibrosis. Anti-fibrotic therapy may have a role in these patients, however additional data is required before this can be more generally recommended.\n\nMany patients undergo a vast array of tests, including cytokines and chemokines, autoantibodies, and toxicological studies, which are expensive, have very little clinical relevance, and only complicate their management. The following basic tests are recommended:\n• HbA1C—long COVID patients are at an increased risk of developing diabetes\n• In patients with allergic features or those who experienced an acute reaction to the vaccine, the following tests may be helpful: eosinophil count; IgE levels, RAST testing and/or skin testing. Serum tryptase, serum histamine and/or 24-h urine N-methylhistamine should be considered in MCAS. [24]", "opengraph": {"locale": "en_US", "type": "article", "title": "I-RECOVER: Long COVID Treatment", "description": "I-RECOVER  \r\nLong COVID Treatment    \r\nDownload I-RECOVER Long COVID Summary\r\n   \r\nDownload I-RECOVER Long COVID Protocol     \r\nAn Approach to Treating Long COVID Due to the marked overlap between long COVID and post-vaccine syndrome, please refer to the", "url": "https://covid19criticalcare.com/treatment-protocols/i-recover-long-covid-treatment/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:modified_time": "2023-03-13T17:44:25+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2022/05/FLCCC-Protocol-2022-I-RECOVER-LC.png", "image:width": "915", "image:height": "178", "image:type": "image/png"}, "tags": ["answering audience questions"], "tweets": [], "movies": [], "links": ["https://covid19criticalcare.com/treatment-protocols/i-recover/"], "authors": [], "publish_date": null}