{"result_id": "126031", "URL": "https://covid19criticalcare.com/experts/paul-e-marik/", "timestamp": "2023-04-25 15:10:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://covid19criticalcare.com/wp-content/uploads/2022/09/cropped-new_favicon_2022-32x32.png", "canonical": "https://covid19criticalcare.com/experts/paul-e-marik/", "encoding": "utf-8"}, "image": null, "domain": "covid19criticalcare.com", "title": "Paul E. Marik MD, FCCM, FCCP", "cleaned_text": "Prior to co-founding the FLCCC, Dr. Marik was best known for his revolutionary work in developing a lifesaving protocol for sepsis, a condition that causes more than 250,000 deaths yearly in the U.S. alone.\n\nDr. Marik is an accomplished physician with special knowledge in a diverse set of medical fields, with specific training in Internal Medicine, Critical Care, Neurocritical Care, Pharmacology, Anesthesia, Nutrition, and Tropical Medicine and Hygiene. He is a former tenured Professor of Medicine and Chief of the Division of Pulmonary and Critical Care Medicine at Eastern Virginia Medical School (EVMS) in Norfolk, Virginia. As part of his commitment to research and education, Dr. Marik has written over 500 peer-reviewed journal articles, 80 book chapters and authored four critical care books. His efforts have provided him the distinction of the second most published critical care physician in the world. He has been cited over 43,000 times in peer-reviewed publications and has an H-index of 77. He has delivered over 350 lectures at international conferences and visiting professorships. As a result of his contributions, he has been the recipient of numerous teaching awards, including the National Teacher of the Year award by the American College of Physicians in 2017.\n\nIn January 2022 Dr. Marik retired from EVMS to focus on continuing his leadership of the FLCCC and has already co-authored over 10 papers on therapeutic aspects of treating COVID-19. In March 2022 Dr. Marik received a commendation by unanimous vote by the Virginia House of Delegates for “his courageous treatment of critically ill COVID-19 patients and his philanthropic efforts to share his effective treatment protocols with physicians around the world.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Paul E. Marik  MD, FCCM, FCCP", "description": "Expert Bio  \r\n\r\n\r\n\r\nPrior to co-founding the FLCCC, Dr. Marik was best known for his revolutionary work in developing a lifesaving protocol for sepsis, a condition that causes more than 250,000 deaths yearly in the U.S. alone.\r\n\r\nDr. Marik is an accomplished physician with special knowledge in a diverse set of medical", "url": "https://covid19criticalcare.com/experts/paul-e-marik/", "site_name": "FLCCC | Front Line COVID-19 Critical Care Alliance", "article:publisher": "https://www.facebook.com/FrontlineCovid19CriticalCare/", "article:modified_time": "2022-12-14T17:46:30+00:00", "image": "https://covid19criticalcare.com/wp-content/uploads/2022/09/Paul-Marik-200x200-1.jpg", "image:width": "200", "image:height": "200", "image:type": "image/jpeg"}, "tags": ["answering audience questions"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}