{"result_id": "127030", "URL": "https://www.gaia.com/", "timestamp": "2023-04-25 15:12:57 CEST+0200", "meta": {"description": "Explore conscious living with over 8,000 documentaries, original shows, classes, and films on Gaia.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/gaia-marketing-layer/assets/images/favicon.ico", "canonical": "https://www.gaia.com", "encoding": "UTF-8"}, "image": null, "domain": "www.gaia.com", "title": "Conscious Media, Streaming Yoga Videos & More", "cleaned_text": "Gaia is a mission-driven community that empowers the global evolution of consciousness. Our ad-free streaming videos help people explore the limits of our human potential, connect to ourselves, each other, and the universe in new ways, and challenge assumptions that keep us from growing.\n\nPlans start as low as $11.99 (USD) a month plus applicable taxes. Monthly and Annual plans also include a 7-day trial for new users before being charged. Cancel at any time.\n\nWhat does a conscious company do with your payment? With your payment, we are able to produce, edit and share thought-provoking original series and films with a wide range of scholars, scientists, shamans and mystics. We are able to pay our bills without selling your information or including ads in our experience.\n\nYou can watch Gaia’s content any time from Gaia.com or any internet-connected device that offers the Gaia app, including smartphones, tablets, and smart TVs. You can also download your favorite videos for offline viewing with our iOS and Android apps.\n\nYou can cancel your membership anytime through your My Account section. Once your membership is canceled, we will no longer process any charges and you will continue to have access to Gaia’s content until the end of your paid membership (or free trial, if applicable).\n\nWhat is included in my Gaia membership? Stream more than 8,000 videos, including many inspiring films, illuminating documentaries, and original series exclusive to Gaia. Learn, build or establish a practice of your own with our powerful yoga classes and guided meditations. Use mobile apps to download videos for when you're on the go. Create up to 3 user profiles so everyone can have their own playlists and personalized recommendations, with no limit on how many profiles can watch at the same time. Finally, for that special video a friend just HAS to see, members can share a link granting temporary access to many of our full-length videos for free!", "opengraph": {"type": "website", "url": "https://www.gaia.com/", "title": "Gaia - Conscious Media, Streaming Yoga Videos & More | Gaia", "description": "Explore conscious living with over 8,000 documentaries, original shows, classes, and films on Gaia.", "image": "https://www.gaia.com/wp-content/uploads/gaia-logo-gradient-social.png", "image:secure_url": "https://www.gaia.com/wp-content/uploads/gaia-logo-gradient-social.png", "image:width": "1024", "image:height": "576", "site_name": "Gaia"}, "tags": ["Watch On Demand"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}