{"result_id": "127035", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://www.gaia.com/video/revelations&prev=search&pto=aue", "timestamp": "2023-04-25 15:13:06 CEST+0200", "meta": {"description": "Sylvie Simon nous apporte ici un éclairage pertinent sur notre systè", "lang": "fr", "keywords": "", "favicon": "/wp-content/themes/gaia-marketing-layer/assets/images/favicon.ico", "canonical": "https://www.gaia.com/fr/video/revelations", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Révélations", "cleaned_text": "Sylvie Simon nous apporte ici un éclairage pertinent sur notre système de santé, son fonctionnement et ses enjeux économiques. En ce 21ème siècle, à l’aube d’une nouvelle humanité, elle nous encourage à une plus grande conscience dans nos actes de santé et à changer ainsi la valeur repère de l’argent en la valeur repère de l’amour. Sylvie Simon aborde des thèmes qui lui tiennent à cœur : les doutes qu’elle porte sur le principe de vaccination, l’espérance de vie dans nos sociétés occidentales modernes. Elle nous informe également sur l’activité controversée de plusieurs médecins marginaux et en profite pour dénoncer les méfaits de la médecine de consommation, basée sur le profit des puissants laboratoires pharmaceutiques capables de commercialiser des médicaments susceptibles parfois de tuer celui qui cherche seulement à se guérir. Sylvie Simon, auteur de 34 ouvrages est également journaliste. Depuis vingt ans, elle a écrit des centaines d’articles sur des sujets de santé qui font scandale et dépeignent les incohérences de notre société basée sur le profit : sang contaminé, vache folle, amiante, hormones de croissance, vaccination… Elle pointe du doigt la désinformation latente qui accompagne les choix politiques dans le domaine de la santé publique.", "opengraph": {"type": "website", "url": "https://www.gaia.com/fr/video/revelations", "title": "Révélations", "description": "Sylvie Simon nous apporte ici un éclairage pertinent sur notre systè", "image": "https://brooklyn.gaia.com/v1/image-render/c3efa394-d175-4ca0-9439-50922aa8027f/203523_AQ_XX_Re%CC%81ve%CC%81lations_fr_FR_Keyart_16x9.jpg", "image:secure_url": "https://brooklyn.gaia.com/v1/image-render/c3efa394-d175-4ca0-9439-50922aa8027f/203523_AQ_XX_Re%CC%81ve%CC%81lations_fr_FR_Keyart_16x9.jpg", "image:width": "1024", "image:height": "576", "site_name": "Gaia"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}