{"result_id": "128027", "URL": "https://gender.news/2023-01-31-6-ways-democrats-communist-globalists-foment-hate.html", "timestamp": "2023-04-25 15:14:01 CEST+0200", "meta": {"description": "Most of the hate breeding in this country has been blown out of proportion, fueled, propagandized, and exacerbated by the Leftist-controlled mass media and the communists in Washington DC. Sure, there will always be racists, bigots, misogynists, and old-fashioned conservatives who oppose certain lifestyles, but as far as the whole country being divided and hating […]", "lang": "en", "keywords": "climate alarmism,climate change,communism,conspiracy,deception,deep state,demons,gay mafia,gender fluidity,global warming,globalism,God,green tyranny,hate crimes,health freedom,hoax,identity politics,intolerance,left cult,Liberty,lies,media fact watch,propaganda,race relations,race-baiting,religion,Social media,socialism,trruth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2023-01-31-6-ways-democrats-communist-globalists-foment-hate.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "DIVIDED WE FALL: Top 6 Ways the Democrats and Communist Globalists aim to foment HATE between US citizens until the Republic is destroyed", "cleaned_text": "DIVIDED WE FALL: Top 6 Ways the Democrats and Communist Globalists aim to foment HATE between US citizens until the Republic is destroyed\n\nMost of the hate breeding in this country has been blown out of proportion, fueled, propagandized, and exacerbated by the Leftist-controlled mass media and the communists in Washington DC. Sure, there will always be racists, bigots, misogynists, and old-fashioned conservatives who oppose certain lifestyles, but as far as the whole country being divided and hating each other to death, well, that’s sadly been an elaborate hoax that’s been gas-lighted to the fullest extent to achieve one main goal – to weaken America for a Communist takeover.\n\nDemocrats and Globalists push the narrative that all Republicans and Conservatives are anti-science, gun-toting, white supremacists that hate gays\n\nWatch fake news MSM for even just a few minutes, and you will witness several different narratives that simply are not true on a grand scale (or even a small scale many times). “Lame-stream” media is highly skilled at making one small example of a hate crime, or a single bigotry example, seem like it’s happening everywhere, all the time in America, but that’s simply not true.\n\nMost Americans are not racist, bigoted, hate mongers who spew venom at their neighbors and coworkers all day. Most Americans do not want to start fights and riots with people of opposing political views or ideals. Most Americans do not hate other Americans because they have different religious beliefs, or sexual partner gender preferences, or medical choices, but fake news would have us all believe differently.\n\nIf one white cop beats up one black man on video, suddenly we’re all supposed to believe this happens in every city and town, every day, all day, to every black person that’s charged with or arrested for a crime. It’s race-baiting and the fake news propaganda intends to foment hate across the land to help with the communist agenda of wrecking the Republic by dividing us all.\n\nJust because twenty percent of Americans refuse to get the Covid clot shots (so-called “vaccines”) doesn’t mean we are “anti-vax” or “anti-science.” In fact, many of these educated, natural health advocates have received many vaccines growing up, and support certain ones, but absolutely KNOW that the Fauci Flu jabs are quite dangerous, with all these recent reports of healthy athletes, pilots, military members, adolescents, and children dropping dead or having heart attacks shortly after getting these spike protein prion injections.\n\nUnited we stand, divided we fall: Top 6 ways the Democrats and Communist Globalists foment hate among US citizens\n\nMost people who support real science and who have common sense realize that the oceans are not swallowing the coastlines, the temperature is not rising at alarming rates (or even at all) in a way that will burn up all the food, animals, and humans in the next decade, century, or even millennium. Still, the fake news and the globalists want us all to believe that driving gas-powered cars and eating meat is causing the whole earth to have extreme weather that will kill us all tomorrow! – if we don’t give all of our hard-earned money to the filthy rich, lying elite.\n\nMillions of Americans believe in God, but it seems that the demon-worshipping elite and the Hollywood Satanists are pushing hard for everyone to give up on faith and drop all morals and ethics in life. This is another communist manifesto and undercurrent in this country pushed and advocated by the demonic Leftist freaks in Washington DC, Hollywood, Disney, and other demonic propaganda pushers on social media.\n\nGender “fluidity” and the trans-everything movements are unfortunately not a private, personal choice anymore, but more of a falsified and morally-twisted dichotomy where the gender-confused people accuse everyone else of hating them and their choices, while pushing perversions on teens, adolescents, children, and even toddlers. There’s also race-baiting and race-hating woven into this.\n\nWe see this in curriculum in colleges, including CRT (critical race theory), at all school levels (think “furries” and gender-baiting), and Drag Queen Story Hour, prominent now in liberal school systems and daycare centers in metropolitan cities, libraries, and elementary schools.\n\nObviously, the globalists and Democrats are trying to make us all hate each other, get highly distracted, eliminate the middle class, and turn the whole Republic into a socialist/communist hell-hole. Don’t let this happen. Bookmark Censored.news to your favorite websites for truth news about keeping the Republic in tact, that’s being censored from the rest of media as you read this.", "opengraph": {"title": "DIVIDED WE FALL: Top 6 Ways the Democrats and Communist Globalists aim to foment HATE between US citizens until the Republic is destroyed", "type": "article", "url": "https://www.gender.news/2023-01-31-6-ways-democrats-communist-globalists-foment-hate.html", "site_name": "Gender News", "description": "Most of the hate breeding in this country has been blown out of proportion, fueled, propagandized, and exacerbated by the Leftist-controlled mass media and the communists in Washington DC. Sure, there will always be racists, bigots, misogynists, and old-fashioned conservatives who oppose certain lifestyles, but as far as the whole country being divided and hating […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2023/02/Men-Yelling.jpg"}, "tags": ["conspiracy", "Liberty", "climate change", "globalism", "deep state", "hoax", "left cult", "deception", "lies", "identity politics", "communism", "religion", "intolerance", "gender fluidity", "God", "global warming", "media fact watch", "health freedom", "propaganda", "race-baiting", "trruth", "race relations", "hate crimes", "Social media", "gay mafia", "socialism", "green tyranny", "demons"], "tweets": [], "movies": [], "links": ["http://propaganda.news", "https://naturalnews.com/2022-02-21-washington-post-calls-canadian-truckers-racists.html", "https://naturalnews.com/2021-12-15-pro-vaccine-fanaticism-is-an-infectious-disease-itself.html", "https://naturalnews.com/2018-02-22-noaa-caught-again-altering-temperature-data-to-exaggerate-global-warming-hoax.html", "https://naturalnews.com/2022-06-14-is-demon-pelost-first-communist-house-speaker.html", "https://www.thegatewaypundit.com/2023/01/sick-bearded-drag-queen-toasts-lck-us-pee-front-young-children-texas-drag-show-video/", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://naturalnews.com/2021-12-15-pro-vaccine-fanaticism-is-an-infectious-disease-itself.html", "https://www.thegatewaypundit.com/2023/01/sick-bearded-drag-queen-toasts-lck-us-pee-front-young-children-texas-drag-show-video/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2023-01-31-6-ways-democrats-communist-globalists-foment-hate.html&linkname=DIVIDED%20WE%20FALL%3A%20Top%206%20Ways%20the%20Democrats%20and%20Communist%20Globalists%20aim%20to%20foment%20HATE%20between%20US%20citizens%20until%20the%20Republic%20is%20destroyed", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}