{"result_id": "128005", "URL": "https://gender.news/2022-05-04-in-fight-for-abortion-the-radical-left-suddenly-rediscovers-the-gender-of-women.html", "timestamp": "2023-04-25 15:13:47 CEST+0200", "meta": {"description": "It’s almost too hilarious to cover in a serious tone. The same radical left-wing nutjobs who have been screaming for the last two years about how there’s “no such thing as a woman” while demanding biological men should have access to women’s sports, women’s locker rooms and women’s public restrooms, are all suddenly now claiming […]", "lang": "en", "keywords": "abortion,female,gender,insanty,left cult,Leftists,lunatics,psycho,stupid,transgenderism,women,Women's rights", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-05-04-in-fight-for-abortion-the-radical-left-suddenly-rediscovers-the-gender-of-women.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "In fight for ABORTION, the radical Left suddenly rediscovers the gender of WOMEN… but wants to exploit women to justify VIOLENCE against infants", "cleaned_text": "In fight for ABORTION, the radical Left suddenly rediscovers the gender of WOMEN… but wants to exploit women to justify VIOLENCE against infants\n\nIt’s almost too hilarious to cover in a serious tone. The same radical left-wing nutjobs who have been screaming for the last two years about how there’s “no such thing as a woman” while demanding biological men should have access to women’s sports, women’s locker rooms and women’s public restrooms, are all suddenly now claiming “women’s rights” must be respected by all.\n\nWhen the Left wants to mass murder babies, suddenly “women” count again. You know why? Because it would sound totally stupid to claim to be fighting for “abortion rights for men.”\n\nEven though that’s exactly what the Left believes… that MEN might need abortions, too. So they use “women” as a kind of human shield to justify the carrying out of medical violence against infants and unborn children.\n\nThe Left’s utterly incoherent ramblings on biology completely discredit any argument they have about “women” or abortion\n\nThe shrieking, howling and sheer stupidity of the Left has become utterly incoherent. No one can make sense of any of it, including themselves. What was once a movement of people who protested against war, Big Pharma, Monsanto and censorship has now become the party of shrieking lunatics who demand the silencing of their political opposition, the mandatory shoving of Big Pharma’s vaccines into everyone’s bodies, and the unfettered “right” to mass murder their own babies at will… even after they’re born alive! (Post-birth abortions, now legal in several US states.)\n\nIt all begs the obvious question: If biology isn’t real, then why can’t pregnant Democrats simply “self-identify” as people who are no longer pregnant? Why do they need access to actual abortion services at all? I mean, these are the same people who have infested medical schools with “woke” delusions like teaching young doctors to provide a cervix examination to biological men who are pretending to be women. (“Sir, we’d be happy to examine your cervix if you would just move that scrotum out of the way…)\n\nTo the “woke” morons, you see, everything is imaginary except murdering babies. That’s real, and that’s demanded. They can’t just pretend to have killed their baby, they actually want to carry out the act and celebrate it. That’s because many of them are Satanists and demon-infested, anti-human monsters who are all-in on grooming the children they haven’t killed first. They revel in the repeated killing of their own unborn children, and their access to abortion has become their dark, demonic religion.\n\nAs Tucker Carlson explains, the Left is terrified that millions of black babies might finally live (instead of being slaughtered in abortion factories):\n\nWatch the baby murdering libtards demand that everyone, “Burn it all to the ground!” if Roe vs. Wade gets overturned. (Profanity warning)\n\nAnd here’s a video from last night, showing how pro-abortion protesters (who demand legalized violence against unborn babies) are carrying out their “peaceful” protests by smashing police cars and threatening even more violence. Well of course they resort to violence, since their demand for abortion “rights” is a demand for legal protection for murderous violence against children:\n\nLet there be no mistake: People who will commit medical violence against their own unborn children will also commit violence against everyone else. They are admitted would-be child murderers, which means they’ve already crossed the line into much larger-scale violence aimed at anyone they don’t like.\n\nInsanity beyond description: Midwives being taught that a “birthing person” might deliver a baby through their penis\n\nMeanwhile, as Newspunch has reported, midwives in Scotland are being taught that men can get pregnant and give birth to children, and that when such magical things occur, they might have to deliver their baby through their penis.\n\nYes, this is the actual state of medical education in our woketard world, heavily populated by mentally ill, low-IQ sh#ttards.\n\nFor those of you reading this who are men, if you will examine your penis for just a moment, you will quickly realize there’s no way a baby is going through that thing.\n\nNot unless you’ve had some sort of horrific accident while trying to dry hump a landmine or something, and even then you might be in desperate need for penile reconstructive surgery. Good luck with that.\n\nIt goes without saying, but I’ll say it anyway: Anyone who thinks a man can give birth is mentally ill and probably in dire need of urgent psychiatric care.\n\nRemember, too, that these same lunatics have just set up a Ministry of Truth “Disinformation Governing Board” and claim to have a monopoly on truth and facts. Indeed, they believe it is a “fact” that a man can get pregnant and give birth through his penis. And if you disagree with that lunacy, you just might be a national security threat.\n\nEven the fact checkers have confirmed the “fact” that men can give birth. Yes, it’s completely insane. But that’s the point.\n\nRemember that when you hear these shrieking, howling lunatics claim they have some sort of “right” to mass murder their own babies because of “women” or something. Ask all the real women on the women’s swimming teams across America if Leftists dignify women. The truth is, the Left hates the very concept of women and has been fighting like mad to destroy womanhood, motherhood and anything related to the female gender. They even hate the concepts of Mother’s Day and mother’s milk!\n\nNever surrender to the shrieking, delusional, murderous woketards who despise women and children\n\nNow, these shrieking libtards think their answer to the SCOTUS draft decision to protect all lives is to escalate their screaming, violence, arson and other acts of destruction and insanity — acts that characterize what the Left has become in America today, which is a howling mob of mindless morons who almost all took vaccine suicide shots, then changed their social media logos to the Ukraine flag, and now have decided that SCOTUS is the newest target of their contrived hate.\n\nHatred is the weapon of choice of the intolerant Left, even as they insidiously pretend they are “inclusive” and “diverse.” The only real diversity demonstrated by these woketard mobsters is the equal opportunity to murder babies of all colors, but especially black babies who have traditionally been the targets of the abortion murder factories since day one. The very founder of Planned Parenthood, as you may know, once referred to Blacks in America as “human weeds” and sought to use abortion to achieve depopulation of Black Americans.\n\nHave no illusions about what these people really want when they demand the “right” to commit medical violence and end the lives of the future children of our world. They want everyone to die. They are members of a demonic death cult, after all.\n\nGet full details in today’s Situation Update podcast at Brighteon.com:\n\nDiscover more information-packaged podcasts each day, along with special reports, interviews and emergency updates, at:\n\nAlso follow me on:\n\nJoin the free NaturalNews.com email newsletter to stay alerted about new, upcoming audiobooks that you can download for free.\n\nDownload my current audiobooks — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nRegister to download the new, upcoming audiobook, “Resilient Prepping” at ResilientPrepping.com", "opengraph": {"title": "In fight for ABORTION, the radical Left suddenly rediscovers the gender of WOMEN… but wants to exploit women to justify VIOLENCE against infants", "type": "article", "url": "https://www.gender.news/2022-05-04-in-fight-for-abortion-the-radical-left-suddenly-rediscovers-the-gender-of-women.html", "site_name": "Gender News", "description": "It’s almost too hilarious to cover in a serious tone. The same radical left-wing nutjobs who have been screaming for the last two years about how there’s “no such thing as a woman” while demanding biological men should have access to women’s sports, women’s locker rooms and women’s public restrooms, are all suddenly now claiming […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/05/HRR-2022-05-04-Situation-Update.jpg"}, "tags": ["insanty", "psycho", "stupid", "women", "Women's rights", "left cult", "Leftists", "lunatics", "gender", "female", "abortion", "transgenderism"], "tweets": [], "movies": [], "links": ["https://newspunch.com/midwives-being-taught-how-to-deliver-babies-through-male-genitalia/", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-05-04-in-fight-for-abortion-the-radical-left-suddenly-rediscovers-the-gender-of-women.html&linkname=In%20fight%20for%20ABORTION%2C%20the%20radical%20Left%20suddenly%20rediscovers%20the%20gender%20of%20WOMEN%E2%80%A6%20but%20wants%20to%20exploit%20women%20to%20justify%20VIOLENCE%20against%20infants", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}