{"result_id": "128013", "URL": "https://www.gender.news/2023-03-27-future-of-fake-medicine-woke-doctors-working-on-woke-patients-make-believe-anatomy.html", "timestamp": "2023-04-25 15:13:53 CEST+0200", "meta": {"description": "You can’t make this stuff up. The “woke” movement is taking over the medical industrial complex, and is now beginning to screen trans-women (men pretending to be women) for cervix cancer, and even create medicine through artificial intelligence for biological men who can… wait for it… get pregnant. The new “science” means all doctors and […]", "lang": "en", "keywords": "AI,badhealth,bottom surgery,Dangerous Medicine,debt bomb,deception,depopulation,fake medicine,fake science,fake surgery,fakebook,faked,future tec,gay mafia,gender,gender confused,gender issues,hoax,left cult,Libtards,money supply,woke medicine,woke surgery,woke terms,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.gender.news/2023-03-27-future-of-fake-medicine-woke-doctors-working-on-woke-patients-make-believe-anatomy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.gender.news", "title": "Future of Fake Medicine? Get ready for WOKE medicine and WOKE doctors who don’t know anatomy, working on WOKE patients with make-believe anatomy", "cleaned_text": "Future of Fake Medicine? Get ready for WOKE medicine and WOKE doctors who don’t know anatomy, working on WOKE patients with make-believe anatomy\n\nYou can’t make this stuff up. The “woke” movement is taking over the medical industrial complex, and is now beginning to screen trans-women (men pretending to be women) for cervix cancer, and even create medicine through artificial intelligence for biological men who can… wait for it… get pregnant. The new “science” means all doctors and scientists must conform to believe in fake gender switching or be deemed prejudiced bigots, and face possible termination of their job, loss of licensing, and loss of all funding. That also means medical colleges must use medical books that teach that men can have babies, breastfeed, and get cervical cancer. This is the future of (fake) medicine, thanks to the “woke” movement.\n\nWoke medical movement wants TRANS women (biological men) to be screened for cervical cancer\n\nThe Canadian Cancer Society is now recommending trans-women consider screenings for “neo-cervix” cancer, meaning doctors and scientists are already trained to do this, believe in this, support this, and make a fortune performing it. How much more vital time, money, and “science” can possibly be wasted on the “woke” movement? Men who have had “bottom surgery,” meaning they’ve had their penis removed, and maybe also their testicles, and then had a fake vagina (neo-vagina) with labia crafted from flesh from other parts of their body, are now supposed to get screened for cervical cancer, even though the doctors know good and well these MEN do not have cervixes.\n\nSo now “woke” medicine involves everyone lying and pretending men really are women, so nobody will get their feelings hurt, and wasting thousands of dollars examining them for female issues that scientifically do NOT apply to men. Talk to your healthcare provider to see if fake science is right for you. You may need fake surgery to ensure your fake gender is safe and secure (a.k.a. “trans-phobia”), while other folks wait in long lines behind you, to have real surgery that may save their lives. And remember, there’s no such thing as “breast cancer” anymore, only “chest cancer.”\n\nYour next deadly medication will be created by a WOKE AI system that believes men can get pregnant\n\nWait, there’s more. The parent company of Fakebook and Instagram, META, now has an AI-based computer program (ESM-Fold) that can create pharmaceutical medications for the woke world of fake science, fake genders, and fake drugs for fake diseases, like “chemical imbalances” in the brain. While cataloging over 600 million proteins, now Big “Woke” Pharma will be “treating” ailments and diseases (cancer and heart disease) that already have cures (called natural remedies and clean eating).\n\nTalk of shared proteins is running high in the woke AI medical community, so people who want to pretend to switch genders, and perverted people who convince children they should get woke surgery, will believe that it works and is legitimate. Today, “follow the science” means absolutely do NOT follow the science, because what is revealed is doctors and scientists who think men can have babies and breastfeed infants. This goes right along with other fake “science” narratives like global warming and Covid “vaccines.”\n\nYes, this is the future of medicine, and it’s almost all fake. It won’t work, just like the fake Covid jabs. Get ready for WOKE medicine and WOKE doctors who don’t know anatomy, working on WOKE patients with make-believe anatomy. Should you choose to criticize this fake science on social media you will be banned for life as a medical terrorist, or white supremacist, or something like that.\n\nTune your internet frequency to Gender.news for updates on more FAKE and WOKE science (mutilation surgery and fake AI-created medicine) that has no reality-based clinical data, and wastes more time, money, and the safety of patients than anything ever created before.", "opengraph": {"title": "Future of Fake Medicine? Get ready for WOKE medicine and WOKE doctors who don’t know anatomy, working on WOKE patients with make-believe anatomy", "type": "article", "url": "https://www.gender.news/2023-03-27-future-of-fake-medicine-woke-doctors-working-on-woke-patients-make-believe-anatomy.html", "site_name": "Gender News", "description": "You can’t make this stuff up. The “woke” movement is taking over the medical industrial complex, and is now beginning to screen trans-women (men pretending to be women) for cervix cancer, and even create medicine through artificial intelligence for biological men who can… wait for it… get pregnant. The new “science” means all doctors and […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2023/04/Coronavirus-Tired-Doctor-Overworked-Exhausted.jpg"}, "tags": ["AI", "faked", "hoax", "left cult", "deception", "gender issues", "gender confused", "money supply", "fakebook", "bottom surgery", "fake surgery", "gender", "wokies", "debt bomb", "depopulation", "woke terms", "Libtards", "gay mafia", "woke surgery", "woke medicine", "fake medicine", "future tec"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/politics/2023/03/16/canadian-cancer-society-trans-woman-screening-neo-cervix-cancer/", "https://thepostmillennial.com/meta-claims-new-ai-will-help-pharmaceutical-companies-make-new-drugs", "https://gender.news/2023-03-17-tim-walz-mutilate-children-protect-lgbtq-people.html", "https://thepostmillennial.com/meta-claims-new-ai-will-help-pharmaceutical-companies-make-new-drugs", "https://www.breitbart.com/politics/2023/03/16/canadian-cancer-society-trans-woman-screening-neo-cervix-cancer/", "https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2023-03-27-future-of-fake-medicine-woke-doctors-working-on-woke-patients-make-believe-anatomy.html&linkname=Future%20of%20Fake%20Medicine%3F%20Get%20ready%20for%20WOKE%20medicine%20and%20WOKE%20doctors%20who%20don%E2%80%99t%20know%20anatomy%2C%20working%20on%20WOKE%20patients%20with%20make-believe%20anatomy", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}