{"result_id": "128014", "URL": "https://gender.news/2022-09-23-california-legalize-trafficking-children-mutilation-castration-transgender.html", "timestamp": "2023-04-25 15:13:53 CEST+0200", "meta": {"description": "Is California on the verge of becoming a sanctuary state for child transgender trafficking? The state’s legislature is definitely trying to make it happen. Senate Bill 107, introduced by Scott Wiener, a prominent Democratic state senator, was recently passed and now awaits a signature from Gov. Gavin Newsom. If signed, SB 107 would allow the […]", "lang": "en", "keywords": "brainwashed,California,castration,children,demonic,depopulation,evil,gay mafia,gender wars,groomers,identity politics,indoctrination,left cult,LGBT,lunatics,mutilation,newsom,perversion,Scott Wiener,trafficking,Trans,transgender,Twisted,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-09-23-california-legalize-trafficking-children-mutilation-castration-transgender.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "California to legalize state-sponsored trafficking of children combined with child mutilation and castration surgeries in the name of transgenderism", "cleaned_text": "California to legalize state-sponsored trafficking of children combined with child mutilation and castration surgeries in the name of transgenderism\n\nIs California on the verge of becoming a sanctuary state for child transgender trafficking? The state’s legislature is definitely trying to make it happen.\n\nSenate Bill 107, introduced by Scott Wiener, a prominent Democratic state senator, was recently passed and now awaits a signature from Gov. Gavin Newsom. If signed, SB 107 would allow the Golden State to take custody of out-of-state minors who want to become “trans,” but who are prohibited from doing so in their home state.\n\nEven if parents object, minors would still be allowed to travel to California and receive “gender affirming care” in the form of surgical castration, a hysterectomy, and whatever Big Pharma gender-bending pharmaceuticals are needed to become their “true selves.”\n\nThe bill received “overwhelming Democratic support,” passing both the House and Senate in California on August 31. (Related: California legislators have also tried to force Christian pastors to promote LGBT perversion from the pulpit.)\n\nNewsom reportedly has until September 30 to either sign or veto the bill. He has not yet taken any action, but is expected to sign the measure into law before the deadline.\n\nScott Wiener wants to turn California into a pedophilia and perversion paradise\n\nWiener, a well-known Democrat pervert, is also responsible for introducing other legislation that would allow children 12 years of age or older to get vaccinated without parental consent. He also supports mandating “Drag Queen Story Hour” events in grade school, as well as relaxing the punishments for child sex offenders.\n\nWiener claims that his latest child-targeting legislation is necessary because underage kids in more conservative states face increasing barriers to getting their developing breasts surgically removed in the case of females, or having their outward genitalia turned inwards in the case of males.\n\nEfforts to protect children against this type of irreversible genital mutilation represent “brutal attacks on transgender children,” according to Wiener, who seems to be shamelessly obsessed with child sexuality and bizarre pedophilic perversion.\n\nSB 107 comes with no restrictions or qualifications once signed. If Newsom picks up and uses that pen, underage children from anywhere will have the ability to come to California to become trans, even without their parents’ permission.\n\nCalifornia’s courts would have the ability to assume full custody of such children, becoming their new “parent.” And these children’s parents would not have any say in the matter.\n\n“All the court would need to prove is that the minor has been ‘mistreated or abused’ which is defined as being ‘unable to obtain gender-affirming health care,'” reports The Gateway Pundit (TGP).\n\n“As of now, it is unclear if the child has to enter California before the law takes effect, or if the state can interfere and assist the child in traveling and accommodations.”\n\nThe bill would seem to suggest that physical presence in California is “not necessary” for a child to become the property of the state. As long as “abuse” is confirmed according to its tenets, California would be allowed to pursue custody.\n\n“Either way, this law goes far beyond any established form of government intervention in personal family matters,” TGP explains.\n\nThe California Family Council issued its own scathing statement against the bill, warning that radical activists will surely “weaponize” it to prey on vulnerable out-of-state children.\n\n“It’s not hard to see how activists could quickly weaponize SB 107,” the group warns about its implications.\n\n“Since the bill instructs state agencies to ignore the circumstances of how a child came to the state for gender transitioning, SB 107 invites children to run away from their families or even be trafficked across state lines.”\n\nMore related news can be found at Transhumanism.news.", "opengraph": {"title": "California to legalize state-sponsored trafficking of children combined with child mutilation and castration surgeries in the name of transgenderism", "type": "article", "url": "https://www.gender.news/2022-09-23-california-legalize-trafficking-children-mutilation-castration-transgender.html", "site_name": "Gender News", "description": "Is California on the verge of becoming a sanctuary state for child transgender trafficking? The state’s legislature is definitely trying to make it happen. Senate Bill 107, introduced by Scott Wiener, a prominent Democratic state senator, was recently passed and now awaits a signature from Gov. Gavin Newsom. If signed, SB 107 would allow the […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/09/Toddler-Baby-Tantrum-Angry-Kid-Adhd-Child.jpg"}, "tags": ["left cult", "lunatics", "gender wars", "identity politics", "demonic", "groomers", "transgender", "brainwashed", "indoctrination", "Scott Wiener", "mutilation", "depopulation", "LGBT", "woke", "evil", "children", "trafficking", "perversion", "newsom", "gay mafia", "castration", "Twisted", "California", "Trans"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/09/sickradical-california-legislature-passes-bill-allowing-state-subvert-parental-rights-take-custody-state-minors-seeking-trans-surgeries-awaits-gov-newsoms-signature/", "https://naturalnews.com/2020-01-02-california-orders-pastors-push-lgbt-activism-transgender-tyranny.html", "http://transhumanism.news", "https://www.thegatewaypundit.com/2022/09/sickradical-california-legislature-passes-bill-allowing-state-subvert-parental-rights-take-custody-state-minors-seeking-trans-surgeries-awaits-gov-newsoms-signature/", "https://naturalnews.com/2020-01-02-california-orders-pastors-push-lgbt-activism-transgender-tyranny.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-09-23-california-legalize-trafficking-children-mutilation-castration-transgender.html&linkname=California%20to%20legalize%20state-sponsored%20trafficking%20of%20children%20combined%20with%20child%20mutilation%20and%20castration%20surgeries%20in%20the%20name%20of%20transgenderism", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}