{"result_id": "128008", "URL": "https://www.gender.news/2019-11-26-mattel-releases-gender-neutral-barbie-dolls.html", "timestamp": "2023-04-25 15:13:49 CEST+0200", "meta": {"description": "Children’s toy manufacturer Mattel has introduced a new “gender-neutral” Barbie that aims to further indoctrinate today’s youth into the cult of LGBTQ. As you’ll see in the below photos, Mattel has paired this new line of Barbies with children whose biological sexes are unclear, which signals to potential customers that it’s now completely normal for […]", "lang": "en", "keywords": "Barbie,brainwashing,children,corporation,depopulation,evil,gender confused,gender fluid,gender neutral,indoctrination,insanity,left cult,lgbtq,Mattel,mental health,Psychological Warfare,transgender,Twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.gender.news/2019-11-26-mattel-releases-gender-neutral-barbie-dolls.html", "encoding": "UTF-8"}, "image": null, "domain": "www.gender.news", "title": "Another evil corporation targets children for psychological warfare and “gender fluid” indoctrination: Mattel releases gender-neutral Barbie dolls", "cleaned_text": "Another evil corporation targets children for psychological warfare and “gender fluid” indoctrination: Mattel releases gender-neutral Barbie dolls\n\nChildren’s toy manufacturer Mattel has introduced a new “gender-neutral” Barbie that aims to further indoctrinate today’s youth into the cult of LGBTQ.\n\nAs you’ll see in the below photos, Mattel has paired this new line of Barbies with children whose biological sexes are unclear, which signals to potential customers that it’s now completely normal for children to exist as neither male nor female.\n\nAccording to reports, the “Creatable World” toy line, as Mattel is calling it, will feature dolls with different skin colors, hairstyles, and clothing – intentionally designed to make their genders unclear – with a goal to “celebrate the positive impact of inclusivity.”\n\n“To achieve ‘gender-neutrality,’ Mattel toned down feminine and masculine features, such as Barbie’s breasts and Ken’s broad shoulders,” reports Vigilant Citizen.\n\n“The line is said to be geared towards kids who identify as gender-fluid, meaning they don’t identify as having a fixed gender like male or female.”\n\nFor more related news about Mattel’s pandering to the LGBTQ mafia and its agenda to confuse the next generation into total gender dysphoria, be sure to check out Gender.news.\n\nMattel suggests that children are choosing to become transgenders all on their own, with no help from LGBTQ activists\n\nMattel claims that these gender-neutral dolls, which you can see are creepy beyond belief (as are the a-gender children featured holding them!), are simply a reflection of a changing culture in which children voluntarily no longer identify as either male or female.\n\nIt has nothing to do with trying to indoctrinate or propagandize children into this lifestyle, the company insists. Instead, it’s all about promoting “inclusivity” for a trend that’s supposedly completely “natural” and occurring all on its own, without the help of LGBTQ activists.\n\n“Toys are a reflection of culture and as the world continues to celebrate the positive impact of inclusivity, we felt it was time to create a doll line free of labels,” stated Kim Culmone, senior vice president of Mattel Fashion Doll Design, in a recent statement.\n\n“Through research, we heard that kids don’t want their toys dictated by gender norms,” she added.\n\nMattel is facilitating the creation of a new world order comprised of genderless LGBTQ robots\n\nIn an official Mattel add for the new “gender-neutral” Barbies, the company openly states that “kids right now, especially Gen-Alpha kids … which are kids under the age of ten … they see gender very differently, they experience gender very differently.”\n\nThe video goes on to suggest that Mattel is simply doing its part in response to this by “challeng[ing] people’s point of view on how children should play.”\n\nIn other words, Mattel wants the public to believe that because children are somehow already identifying as transgenders all on their own – again, supposedly with no prodding or influence from anyone else – corporations have a duty to feed into this by pushing it even more via children’s toys.\n\n“This is the wave of the future,” stated Mattel’s head of research in a shockingly Orwellian statement defending this controversial decision.\n\n“This is where society is heading. The parents want to be onboard on it, they just don’t have the tools or the knowledge to kind of guide their child.”\n\nOn YouTube, many users responded to these claims with a heavy dose of rationality, including the fact that “no kid actually asked for this,” adding that “an adult just assumed it.” Others offered similar commentary, explaining that “[o]nly the immoral parents who don’t care about their children will buy this garbage [for] their kids.”\n\nFor more related news about how the LGBTQ agenda is destroying childhood innocence and creating an entire generation of gender dysphoric individuals who are confused and lost, be sure to check out Evil.news.", "opengraph": {"title": "Another evil corporation targets children for psychological warfare and “gender fluid” indoctrination: Mattel releases gender-neutral Barbie dolls", "type": "article", "url": "https://www.gender.news/2019-11-26-mattel-releases-gender-neutral-barbie-dolls.html", "site_name": "Gender News", "description": "Children’s toy manufacturer Mattel has introduced a new “gender-neutral” Barbie that aims to further indoctrinate today’s youth into the cult of LGBTQ. As you’ll see in the below photos, Mattel has paired this new line of Barbies with children whose biological sexes are unclear, which signals to potential customers that it’s now completely normal for […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2019/11/hello-talking-barbie.jpg"}, "tags": ["mental health", "gender neutral", "indoctrination", "evil", "gender confused", "children", "Barbie", "left cult", "gender fluid", "depopulation", "transgender", "Twisted", "Psychological Warfare", "brainwashing", "insanity", "Mattel", "corporation", "lgbtq"], "tweets": [], "movies": [], "links": ["https://vigilantcitizen.com/latestnews/mattel-releases-a-gender-neutral-barbie-and-the-video-promoting-it-is-preposterous/", "http://gender.news", "https://www.naturalnews.com/2019-09-27-mattel-releases-a-gender-neutral-barbie.html", "http://evil.news", "https://vigilantcitizen.com/latestnews/mattel-releases-a-gender-neutral-barbie-and-the-video-promoting-it-is-preposterous/", "https://www.naturalnews.com/2019-09-27-mattel-releases-a-gender-neutral-barbie.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2019-11-26-mattel-releases-gender-neutral-barbie-dolls.html&linkname=Another%20evil%20corporation%20targets%20children%20for%20psychological%20warfare%20and%20%E2%80%9Cgender%20fluid%E2%80%9D%20indoctrination%3A%20Mattel%20releases%20gender-neutral%20Barbie%20dolls", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}