{"result_id": "128009", "URL": "https://gender.news/2022-12-16-leah-brooks-parents-rescue-kids-woke-indoctrination.html", "timestamp": "2023-04-25 15:13:50 CEST+0200", "meta": {"description": "Homeschooling advocate Leah Brooks has urged parents to rescue their children from schools, both private and public, that instill the “woke” agenda. She also blasted these schools for stripping parents of their authority and influence in their own children’s lives. A retired gymnastics coach and homeschooling veteran, Books advocates for honoring parental authority and the […]", "lang": "en", "keywords": "brainwashed,campus insanity,conspiracy,culture wars,deception,elementary schools,gender,gender confused,gender wars,groomers,grooming,homeschooling,identity politics,indoctrination,Leah Brooks,LGBT,microschool,Parental rights,public education,public schools,social justice,Teachers,Tina Griffin,woke,wokeism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-12-16-leah-brooks-parents-rescue-kids-woke-indoctrination.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Leah Brooks urges parents to RESCUE their kids from “woke” indoctrination in schools", "cleaned_text": "Leah Brooks urges parents to RESCUE their kids from “woke” indoctrination in schools\n\nHomeschooling advocate Leah Brooks has urged parents to rescue their children from schools, both private and public, that instill the “woke” agenda. She also blasted these schools for stripping parents of their authority and influence in their own children’s lives.\n\nA retired gymnastics coach and homeschooling veteran, Books advocates for honoring parental authority and the U.S. Constitution. She told Tina Griffin, the Counter Culture Mom, that her mission began when her son went to kindergarten 15 years ago and she received the reading list from her son’s school.\n\n“One of the books was ‘Jane Has Two Mommies,’ and I just can’t put this in front of him at five years old. Is this about reading, writing and arithmetic? This is not education. So I decided to keep my son home,” she told Griffin.\n\nBrooks added that currently in local public schools, there is a list of books that contain sensitive information like gay porn with cartoons and things with suicide. She even cited a middle school teacher denouncing parents who point out unsuitable themes in books as bigots during a school board meeting.\n\nMoreover, she revealed that even in elementary schools, there are books in the library such as “Flamer.” The book is a semi-autobiographical graphic novel that tells the story of Aiden, who is bullied for his appearance, including acting in a manner considered stereotypical of gay men. (Related: Elementary teachers discuss how to keep LGBT clubs in schools a SECRET from parents.)\n\n“We keep putting our kids on the front line of this war. We, as parents, are the light of the world and we train and equip them to be the next lights of the world,” she pointed out.\n\nBrooks also mentioned that she was hired part-time to teach preschool at the local Christian school back in 2021. Her sons were able to get scholarships, which allowed them to attend the school. However, she was mandated to take the Wuhan coronavirus (COVID-19) vaccine, which she refused.\n\n“If you were not vaccinated, then you had to test every day, but I know what my rights are. I know what the law is in Illinois. So, I turned in my religious exemption, and it was denied,” she lamented. Brooks had been put on unpaid leave.\n\nMicroschools put back the reins to parents in shaping their children\n\nElsewhere in the podcast, Brooks also discussed how she pioneered a whole new approach to homeschooling via microschools.\n\n“First, I want to homeschool. I know how to teach kids. I’ve been working in gymnastics. I’ve done all of this with counseling and children. The Lord has a plan and everyone calls with the exact same thing, I feel like I have to do something,” she said.\n\nShe proceeded to launch a microschool in Carpentersville, Illinois, and is currently helping countless others begin their microschool journey.\n\nMicroschools are when two or more families use the same curriculum and meet together in person on a regular basis to foster learning. It allows parents to take the educational reins while facilitating social time and group growth.\n\n“Microschools evolved out of homeschooling, and are in between private schools and homeschools,” said Tasha Ring, director of Meridian Learning, a Cincinnati organization that advocates for and organizes grassroots microschools.\n\nGriffin lauded Brooks’ efforts and her journey. “The worst day of homeschooling will always be better than the best day of sending your kids to a public school,” she said.\n\nVisit PublicEducation.news for more news about woke ideologies instilled in public school children.\n\nWatch the full conversation between Leah Brooks and Tina Griffin below.\n\nThis video is from the Counter Culture Mom channel on Brighteon.com.\n\nSexual predators use same grooming tactics on victims as those now being “taught” to children at public schools.\n\nPublic schools aren’t just grooming your children to become transgenders: They’re also drugging them with mind-altering pharmaceuticals.\n\nGROOMING MEANS PERVERTING: Dangerous trans indoctrination of children in schools is turning America into a nationwide Nazi youth training camp.", "opengraph": {"title": "Leah Brooks urges parents to RESCUE their kids from “woke” indoctrination in schools", "type": "article", "url": "https://www.gender.news/2022-12-16-leah-brooks-parents-rescue-kids-woke-indoctrination.html", "site_name": "Gender News", "description": "Homeschooling advocate Leah Brooks has urged parents to rescue their children from schools, both private and public, that instill the “woke” agenda. She also blasted these schools for stripping parents of their authority and influence in their own children’s lives. A retired gymnastics coach and homeschooling veteran, Books advocates for honoring parental authority and the […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/12/School-Children-Happy-Laughing-Class.jpg"}, "tags": ["conspiracy", "deception", "homeschooling", "gender wars", "Tina Griffin", "campus insanity", "gender confused", "identity politics", "Teachers", "culture wars", "groomers", "public schools", "gender", "brainwashed", "Parental rights", "social justice", "indoctrination", "microschool", "Leah Brooks", "LGBT", "elementary schools", "woke", "grooming", "wokeism", "public education"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/e503012a-6e8f-45a6-be4d-03d195a1c052", "https://dailycaller.com/2021/12/24/texas-teacher-parents-dr-seuss-poem/", "https://naturalnews.com/2022-05-13-teachers-discuss-keeping-lgbt-clubs-secret-parents.html", "https://www.usnews.com/education/k12/articles/what-is-a-microschool", "https://publiceducation.news/", "https://www.brighteon.com/e503012a-6e8f-45a6-be4d-03d195a1c052", "https://www.brighteon.com/channels/counterculturemom", "https://naturalnews.com/2022-08-09-predators-same-grooming-tactics-children-public-schools.html", "https://groomers.news/2022-07-13-public-schools-drugging-children-mind-altering-pharmaceuticals.html", "https://gender.news/2022-04-19-dangerous-trans-indoctrination-of-children-in-schools.html", "https://indoctrination.news/2022-09-23-va-educ-dept-requires-adherence-students-biological.html", "https://www.brighteon.com/e503012a-6e8f-45a6-be4d-03d195a1c052", "https://dailycaller.com/2021/12/24/texas-teacher-parents-dr-seuss-poem/", "https://www.usnews.com/education/k12/articles/what-is-a-microschool", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-12-16-leah-brooks-parents-rescue-kids-woke-indoctrination.html&linkname=Leah%20Brooks%20urges%20parents%20to%20RESCUE%20their%20kids%20from%20%E2%80%9Cwoke%E2%80%9D%20indoctrination%20in%20schools", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}