{"result_id": "128017", "URL": "https://www.gender.news/2019-06-03-scientific-american-has-abandoned-science-by-embracing-pseudoscience-of-transgenderism.html", "timestamp": "2023-04-25 15:13:55 CEST+0200", "meta": {"description": "As part of their relentless crusade to eradicate natural biology and replace humanity with a whole new race of androgynous, mind-controlled, asexual drone beings, the mainstream media and its controllers are working overtime to normalize transgenderism – this being one of their cultural catalysts to bring about a new world order. In a recent issue […]", "lang": "en", "keywords": "androgynous,asexual,badscience,biology,English,female,First Amendment,free speech,grammar,humanity,indoctrination,junk science,left cult,LGBTPQ,Libtards,mainstream media,Male,mind control,pedophiles,Pedophilia,Pronouns,pseudoscience,public schools,science,science clowns,scientific american,Social media,transgender,transgenderism,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.gender.news/2019-06-03-scientific-american-has-abandoned-science-by-embracing-pseudoscience-of-transgenderism.html", "encoding": "UTF-8"}, "image": null, "domain": "www.gender.news", "title": "Even Scientific American has abandoned science by embracing the pseudoscience of transgenderism", "cleaned_text": "Even Scientific American has abandoned science by embracing the pseudoscience of transgenderism\n\nAs part of their relentless crusade to eradicate natural biology and replace humanity with a whole new race of androgynous, mind-controlled, asexual drone beings, the mainstream media and its controllers are working overtime to normalize transgenderism – this being one of their cultural catalysts to bring about a new world order.\n\nIn a recent issue of Scientific American, these powers that be made sure to include an article pushing their vision of a “gender-free” future. In it, the author suggests that it’s no longer acceptable to use words like “him” or “her” to describe men and women, instead urging widespread use of the generic term “them” to describe everyone.\n\nIt no longer matters, in other words, what a person’s chromosomes say about his or her unique biological sex – because that’s so old-fashioned, in case you didn’t know. No, it’s now about calling everyone the exact same thing so that we’re all exactly the same, and all “equal” – meaning no more men or women, but rather one universally identical existence as “people-kind,” or something.\n\nWhile certainly ridiculous, this bizarro concept shouldn’t just be written off as more looney libtardism. Since it’s now gone mainstream, this transgender philosophy is, in fact, being normalized much more quickly than you might think, and is astoundingly now being pushed by once-esteemed journals like Scientific American that have clearly sold out to the evil LGBTPQ (P stands for pedophiles) agenda.\n\nFor related news, be sure to check out Gender.news and Evil.news.\n\nScientific American is also promoting the absolute butchering of the English language\n\nAs these social engineers push to annihilate God’s creation by corrupting it with “genderless” DNA, they’re also inadvertently corrupting the English language by trying to replace singular pronoun descriptors like “him” and “her” with plural varieties like “them.”\n\nIt’s quite silly to refer to a biological female pretending to be a “man” as “them,” seeing as how she’s one person and not multiple people. But using plural pronouns to describe individuals is part of the LGBTPQ package – and if you refused to abide by it, then you could be accused of committing a “hate crime.”\n\nTo normal-thinking people, all of this might seem a little “out there.” But it’s what’s being taught to the next generation of students in America’s public schools, many of which have been completely infiltrated by LGBTPQ operatives whose goal it is to corrupt as many young minds as they can get away with, all in the name of “tolerance” and “love.”\n\nKeep in mind that it’s already considered to be a politically-incorrect “violation” of Leftist speech code to suggest that there are only two sexes, male and female, on social media. Twitter, in case you didn’t know, has actually codified a policy against this type of thought, declaring that users who espouse such views are in violation of the company’s “hateful conduct policy” governing the “misgendering or deadnaming of transgender individuals.”\n\nAgain, to adults who grew up before the days of the internet and smartphones, such policies, besides clearly violating people’s free speech rights and the First Amendment, are obvious Leftist manipulation tactics. But to young children who never knew a life outside of being “online,” such insanity is now the norm – which means parents who actually care about their children’s futures are going to really have to work overtime to instill proper morals and values in their offspring.\n\n“I was talking with my (only) brother yesterday and they said them had a great birthday. My (only sister) was in attendance and them gave them a gift certificate to Scheels. Yeah, no, that doesn’t work …” joked one commenter at The Daily Wire about how transgender pronoun preferences make absolutely no sense grammatically or structurally.", "opengraph": {"title": "Even Scientific American has abandoned science by embracing the pseudoscience of transgenderism", "type": "article", "url": "https://www.gender.news/2019-06-03-scientific-american-has-abandoned-science-by-embracing-pseudoscience-of-transgenderism.html", "site_name": "Gender News", "description": "As part of their relentless crusade to eradicate natural biology and replace humanity with a whole new race of androgynous, mind-controlled, asexual drone beings, the mainstream media and its controllers are working overtime to normalize transgenderism – this being one of their cultural catalysts to bring about a new world order. In a recent issue […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2019/06/CNN-trans-fats-march.jpg"}, "tags": ["biology", "left cult", "androgynous", "Pronouns", "LGBTPQ", "humanity", "Twitter", "Male", "asexual", "First Amendment", "Pedophilia", "public schools", "transgender", "grammar", "indoctrination", "scientific american", "science", "mainstream media", "Social media", "mind control", "pseudoscience", "transgenderism", "Libtards", "pedophiles", "female", "English", "free speech", "science clowns"], "tweets": [], "movies": [], "links": ["https://www.dailywire.com/news/46044/scientific-american-lets-use-genderless-pronouns-paul-bois", "http://gender.news", "http://evil.news", "https://www.naturalnews.com/2018-08-09-why-its-time-to-repeal-sec-230-of-the-cda.html", "https://www.dailywire.com/news/46044/scientific-american-lets-use-genderless-pronouns-paul-bois", "https://www.naturalnews.com/2018-08-09-why-its-time-to-repeal-sec-230-of-the-cda.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2019-06-03-scientific-american-has-abandoned-science-by-embracing-pseudoscience-of-transgenderism.html&linkname=Even%20Scientific%20American%20has%20abandoned%20science%20by%20embracing%20the%20pseudoscience%20of%20transgenderism", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}