{"result_id": "128029", "URL": "https://gender.news/2022-08-02-san-francisco-monkeypox-superspreader-up-alley-festival.html", "timestamp": "2023-04-25 15:14:02 CEST+0200", "meta": {"description": "Despite an urgent plea from the World Health Organization (WHO) for homosexual and bisexual men to stop their sexual escapades to limit the spread of monkeypox (aka pridepox), the city of San Francisco is moving forward anyway with an LGBT superspreader event called “Up Your Alley.” The sex festival, also known as “Dore Alley,” is […]", "lang": "en", "keywords": "badhealth,big government,culture wars,demonic,evil,gay mafia,gender confused,hypocrisy,infections,insanity,left cult,LGBT,monkeypox,national security,outbreak,pandemic,perversion,PridePox,San Francisco,superspreader,Up Your Alley", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-08-02-san-francisco-monkeypox-superspreader-up-alley-festival.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "San Francisco proudly announces monkeypox superspreader event: the “Up Your Alley” festival that encourages filth and multiple partners", "cleaned_text": "San Francisco proudly announces monkeypox superspreader event: the “Up Your Alley” festival that encourages filth and multiple partners\n\nDespite an urgent plea from the World Health Organization (WHO) for homosexual and bisexual men to stop their sexual escapades to limit the spread of monkeypox (aka pridepox), the city of San Francisco is moving forward anyway with an LGBT superspreader event called “Up Your Alley.”\n\nThe sex festival, also known as “Dore Alley,” is a filthy leather fetish carnival that promotes same-sex casual encounters and public demonstrations of “kink.” It is a petri dish, in other words, for the spread of not only pridepox but a host of other sexually transmitted diseases (STDs) that we now know are provoked by Wuhan coronavirus (Covid-19) “vaccines.”\n\nIt would seem as though pridepox is an exclusively “gay disease” that is activated, perhaps, by Fauci Flu shots, and spread through homosexual perversions – which makes Up Your Alley the worst thing that could happen in the face of efforts to eliminate pridepox before it has the chance to become a real public health threat (assuming it even exists and is not just a covid jab “side effect” under a different name).\n\nAIDS Foundation comes out in support of Up Your Alley, urges gays to “be aware, but not overly afraid” while participating in orgies\n\nIt is said that of California’s 786 “confirmed” cases of pridepox, 257 of them exist in San Francisco, a longtime LGBT bastion. Overall, 91.7 percent of California’s pridepox cases are “gay, lesbian or same gender loving,” while another 5.6 percent are “bisexual.”\n\nSo far, nobody in the United States power structure has spoken out against perverse LGBT activity as the primary superspreader vector for pridepox. In fact, the powers that be are going out of their way to deny that LGBTs are responsible for the disease – which is a far cry from how they treated normal people during the Wuhan coronavirus (Covid-19) plandemic.\n\n“We’ve heard from people who are worried about attending events out of fear of contracting monkeypox. We hope you partake while also taking steps to reduce your risk,” announced the AIDS Foundation, adding the politically correct caveat that gays should “be aware” of pridepox “but not overly afraid” of it.\n\nThe group says that gays should only “go to sex parties with people you know” – this after the entire country, including children, were told to “mask up” and get jabbed to stop the spread of so-called “covid.”\n\nShould a gay encounter someone at the festival with bumps and rashes, it is best to cover those rashes before engaging in a night of debauchery, the AIDS Foundation added.\n\nRemember when the establishment pulled a similar double standard back in 2020 by declaring church events and schools to be superspreader events but not Black Lives Matter (BLM) riots?\n\nDonald Trump’s rallies were also declared to be superspreader events while protests against “police brutality” were simultaneously decreed to be safe expressions of “freedom,” despite the restrictions that were applied to everybody else.\n\n“Monkeypox must not be as big of a problem as they claim if they are okay with allowing this trash festival to proceed,” wrote a commenter in response to the news.\n\n“Watch and see: as soon as this is over, they will be back to screaming about how monkeypox is a ‘pandemic.’ It’s all lies.”\n\nOver at Natural News, a reader said he absolutely will not shed any tears for these perverts who are insistent upon wiping themselves out. However, who is going to speak up for the rest of society, which could be plunged right back into medical tyranny the moment this summer of pride has ended?\n\nThe latest news about pridepox can be found at Infections.news.", "opengraph": {"title": "San Francisco proudly announces monkeypox superspreader event: the “Up Your Alley” festival that encourages filth and multiple partners", "type": "article", "url": "https://www.gender.news/2022-08-02-san-francisco-monkeypox-superspreader-up-alley-festival.html", "site_name": "Gender News", "description": "Despite an urgent plea from the World Health Organization (WHO) for homosexual and bisexual men to stop their sexual escapades to limit the spread of monkeypox (aka pridepox), the city of San Francisco is moving forward anyway with an LGBT superspreader event called “Up Your Alley.” The sex festival, also known as “Dore Alley,” is […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/08/LGBTQ-Rainbow-Flag-Monkeypox.jpg"}, "tags": ["pandemic", "big government", "national security", "left cult", "outbreak", "gender confused", "demonic", "culture wars", "PridePox", "San Francisco", "monkeypox", "hypocrisy", "infections", "LGBT", "insanity", "evil", "perversion", "gay mafia", "superspreader", "Up Your Alley"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2022-07-29-who-tells-lgbt-males-stop-spreading-monkeypox.html", "https://americasfrontlinenews.com/post/san-francisco-plans-monkeypox-superspreader-event-after-declaring-emergency", "https://naturalnews.com/2022-07-28-monkeypox-cover-covid-vaccine-shingles-blisters-herpes.html", "http://infections.news", "https://naturalnews.com/2022-07-29-who-tells-lgbt-males-stop-spreading-monkeypox.html", "https://americasfrontlinenews.com/post/san-francisco-plans-monkeypox-superspreader-event-after-declaring-emergency", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-08-02-san-francisco-monkeypox-superspreader-up-alley-festival.html&linkname=San%20Francisco%20proudly%20announces%20monkeypox%20superspreader%20event%3A%20the%20%E2%80%9CUp%20Your%20Alley%E2%80%9D%20festival%20that%20encourages%20filth%20and%20multiple%20partners", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}