{"result_id": "128002", "URL": "https://gender.news/2023-01-31-denmark-calls-for-mandatory-military-draft-women.html", "timestamp": "2023-04-25 15:13:46 CEST+0200", "meta": {"description": "The Scandinavian nation of Denmark has announced plans to implement compulsory military conscription for women, in a bid to significantly increase the size of its armed forces. During an interview with government-owned broadcaster TV2, Danish Deputy Prime Minister (PM) Jakob Ellemann-Jensen said it would be “beneficial” for the country’s military if it had more women […]", "lang": "en", "keywords": "big government,conscription,Danish Defense,denmark,Equality,female conscription,gender,mandatory service,military,Military draft,military members,military service,national security,patriot,preparedness,progress,self-defense,social justice,switzerland", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2023-01-31-denmark-calls-for-mandatory-military-draft-women.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Denmark calls for mandatory military conscription for women", "cleaned_text": "The Scandinavian nation of Denmark has announced plans to implement compulsory military conscription for women, in a bid to significantly increase the size of its armed forces.\n\nDuring an interview with government-owned broadcaster TV2, Danish Deputy Prime Minister (PM) Jakob Ellemann-Jensen said it would be “beneficial” for the country’s military if it had more women among the ranks. Ellemann-Jensen concurrently serves as the minister of defense.\n\nUnder current rules, Danish women can join the military on a voluntary basis. Meanwhile, Danish men are generally required to serve if they are called on under a lottery system. Several women’s groups in the Nordic nation expressed support toward the draft for women.\n\nEllemann-Jensen announced the plan as the Danish Ministry of Defense (FMN) published the conclusions of a biannual report by the North Atlantic Treaty Organization (NATO). The group chastised Copenhagen for failing to invest enough in its military, in particular the Royal Danish Army and the Royal Danish Navy.\n\nPrior to the report, Denmark announced its intention to increase defense spending by 4.5 billion kroner ($657 million) to reach two percent of its gross domestic product in 2030 – three years earlier than previously planned.\n\nDenmark’s neighbors have been drafting women on a compulsory basis for some time now, according to a Bloomberg report.\n\nNorway became the first NATO member to introduce a mandatory military draft for women. This commenced in 2015 and contributed to the 20 percent of women in the Norwegian Armed Forces as of 2021. Sweden, meanwhile, reactivated conscription – this time including women – from 2017 onward. (Related: Feminists demanded equality; now all women may be required to register for the military draft and serve in future wars.)\n\nBack in September of last year, ZeroHedge reported that the landlocked nation of Switzerland was considering gender-neutral conscription. The move sought to address the country’s shortage of military personnel.\n\nA report by a Swiss parliamentary commission submitted to the Council of States – the Swiss Federal Assembly’s upper chamber – expounded on the problem. It pointed out that only 80 percent, or about 80,000 service members out of the 100,000-strong Swiss Armed Forces (SAF), can be called to active duty.\n\nThe report proposed two alternatives to address the issue and increase the size of the SAF. First, it suggested a merger between the SAF and Federal Office for Civil Protection. Second, it suggested the inclusion of able-bodied Swiss women aged 19 years and older.\n\nAccording to an article by SwissInfo, the SAF could see its numbers plunge to as low as 30,000 by the year 2030 if nothing is done to address the situation.\n\n“It is time that both genders have the same rights and duties in the military, said Stefan Holenstein, the president of the military officers’ association SOG. “We are convinced that the [Swiss Army] can no longer do without more than 50 percent of society’s potential.”\n\nSwiss Defense Minister Viola Amherd, the first female in the position, said she wants to increase the percentage of women in the armed forces from one percent to 10 percent by 2030. In line with this, the Swiss military launched an ad campaign with the tagline “Security is also female” to attract women into the service.\n\nHead over to NationalSecurity.news for more stories about mandatory conscription in various countries.\n\nWatch this video about a federal judge ruling in 2019 that male-only conscription was unconstitutional.\n\nThis video is from the End Times Prophecy News channel on Brighteon.com.\n\nPENTAGON: Males identifying as females are still required to sign up for the military draft, because suddenly biology is REAL when it comes to WAR.\n\nNavy bureaucrats set to put women in Marine combat roles despite evidence that they aren’t a good fit.", "opengraph": {"title": "Denmark calls for mandatory military conscription for women", "type": "article", "url": "https://www.gender.news/2023-01-31-denmark-calls-for-mandatory-military-draft-women.html", "site_name": "Gender News", "description": "The Scandinavian nation of Denmark has announced plans to implement compulsory military conscription for women, in a bid to significantly increase the size of its armed forces. During an interview with government-owned broadcaster TV2, Danish Deputy Prime Minister (PM) Jakob Ellemann-Jensen said it would be “beneficial” for the country’s military if it had more women […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2023/01/womeninmilitary.jpg"}, "tags": ["big government", "national security", "military members", "military", "patriot", "switzerland", "conscription", "preparedness", "Military draft", "gender", "social justice", "self-defense", "female conscription", "mandatory service", "denmark", "progress", "Equality", "Danish Defense", "military service"], "tweets": [], "movies": [], "links": ["https://www.straitstimes.com/world/europe/denmark-calls-for-mandatory-military-service-for-women", "https://www.bloomberg.com/news/articles/2023-01-26/danish-defense-minister-calls-for-mandatory-enlistment-for-women", "https://www.naturalnews.com/2019-02-26-feminists-demanded-equality-women-military-draft.html", "https://www.zerohedge.com/geopolitical/switzerland-mulls-gender-neutral-compulsory-military-service-women", "https://www.swissinfo.ch/eng/a-call-for-swiss-women-to-do-compulsory-military-service/46796806", "https://nationalsecurity.news", "https://www.brighteon.com/00000000-0000-0000-0006-006654871001", "https://www.brighteon.com/channels/endtimesprophecynews", "https://newstarget.com/2022-10-13-males-identifying-females-can-still-get-drafted.html", "https://naturalnews.com/051255_women_in_combat_Marine_Corps_military_politics.html", "https://newstarget.com/2022-09-29-swiss-government-considering-gender-neutral-conscription.html", "https://www.straitstimes.com/world/europe/denmark-calls-for-mandatory-military-service-for-women", "https://www.bloomberg.com/news/articles/2023-01-26/danish-defense-minister-calls-for-mandatory-enlistment-for-women", "https://www.zerohedge.com/geopolitical/switzerland-mulls-gender-neutral-compulsory-military-service-women", "https://www.swissinfo.ch/eng/a-call-for-swiss-women-to-do-compulsory-military-service/46796806", "https://www.brighteon.com/00000000-0000-0000-0006-006654871001", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2023-01-31-denmark-calls-for-mandatory-military-draft-women.html&linkname=Denmark%20calls%20for%20mandatory%20military%20conscription%20for%20women", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}