{"result_id": "128026", "URL": "https://gender.news/2022-05-25-is-it-monkeypox-or-crystalpox.html", "timestamp": "2023-04-25 15:14:01 CEST+0200", "meta": {"description": "Are you a gay man? (Article by Alex Berenson republished from AlexBerenson.Substack.com) Specifically, are you a gay man who likes sex with lots of other gay men? Maybe in a bathhouse? Maybe names optional? Maybe with a meth bump on the side? No? Are you sure? It’s cool if you are, no judgments. They’re called glory holes […]", "lang": "en", "keywords": "badhealth,biased,bisexual men,Crystalpox,epidemic,gay men,gender confused,infections,insanity,left cult,monkeypox,outbreak,pandemic,raves,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-05-25-is-it-monkeypox-or-crystalpox.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Is it monkeypox, or crystalmethpox?", "cleaned_text": "Is it monkeypox, or crystalmethpox?\n\nSpecifically, are you a gay man who likes sex with lots of other gay men? Maybe in a bathhouse? Maybe names optional? Maybe with a meth bump on the side?\n\nNo? Are you sure?\n\nIt’s cool if you are, no judgments. They’re called glory holes for a reason, people!\n\nOkay. Don’t worry about the monkeypox thing then.\n\nYou can almost feel the public health authorities squirming right now.\n\nOn the one hand, they’ve almost got another epidemic on the go – the perfect way to distract the shiny-haired robots in the media from the complete failure of the mRNA vaccines.\n\nOn the other, the monkeypox epidemic – stop me if you’ve heard this before – very much appears to be centered around the sexual practices of gay men. (And bisexual men, also known as gay men who want to pretend they’re straight.)\n\nIn this, monkeypox joins not just HIV, but syphilis, gonorrhea, and a bunch of other nasties. The state of California – that hyper-conservative hotspot – reports that gay men are hundreds of times more likely to get syphilis than straight men or women.\n\nSo, yeah, I know it’s early days on monkeypox.\n\nAnd if you want, you can go full Ding and start screaming that the virus has mutated in some completely unexpected way and is going to KILL US ALL! (Orthopox viruses mutate very slowly by viral standards, by the way, which is why the smallpox vaccine works so well.)\n\nOr you can go full Alex Jones and start screaming about how the DNA/AAV Covid vaccines are giving us monkeypox! (Do you know what happens to my blood pressure when woke morons on Twitter compare me to Alex #@$%TG$ Jones? If I stroke out, you’ll know why.)\n\nOr you can accept the reality that this epidemic probably came out of a couple of gay raves.\n\nThe good news is that the public health authorities are now likely to pivot fast away from trying to scare people about monkeypox, for fear of stigmatizing gay men (by letting them know too much about what happens at these raves). As always, the Onion captured the reality better than any “real” news organization ever could:\n\nAdded bonus: the same epidemiologists who wanted to lock you and your kids up for the last two years for Covid, a disease that poses approximately no risk to them, are now sure to let you know that MANDATES AND GOVERNMENT EFFORTS TO CHANGE BEHAVIOR NEVER WORK!\n\nYep, without Chinese labs and gay bathhouses, epidemiologists these days wouldn’t have much to do.\n\nLet’s just hope that ne’er the twain shall meet.", "opengraph": {"title": "Is it monkeypox, or crystalmethpox?", "type": "article", "url": "https://www.gender.news/2022-05-25-is-it-monkeypox-or-crystalpox.html", "site_name": "Gender News", "description": "Are you a gay man? (Article by Alex Berenson republished from AlexBerenson.Substack.com) Specifically, are you a gay man who likes sex with lots of other gay men? Maybe in a bathhouse? Maybe names optional? Maybe with a meth bump on the side? No? Are you sure? It’s cool if you are, no judgments. They’re called glory holes […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/05/Lgbt-Gay-Support-Bisexual-Bisexuality-Carnival-Celebrate.jpg"}, "tags": ["monkeypox", "gay men", "pandemic", "raves", "left cult", "outbreak", "Crystalpox", "wokies", "epidemic", "infections", "bisexual men", "insanity", "biased", "gender confused"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/is-it-monkeypox-or-crystalpox?s=r", "https://www.cdph.ca.gov/Programs/CID/DCDC/CDPH%20Document%20Library/Gay-Bisexual-Men-STDs-Infographic.pdf", "https://alexberenson.substack.com/p/is-it-monkeypox-or-crystalpox?s=r", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-05-25-is-it-monkeypox-or-crystalpox.html&linkname=Is%20it%20monkeypox%2C%20or%20crystalmethpox%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}