{"result_id": "128019", "URL": "https://gender.news/2022-05-27-nhs-removes-woman-from-female-cancer-pages.html", "timestamp": "2023-04-25 15:13:56 CEST+0200", "meta": {"description": "The United Kingdom’s National Health Service (NHS) removed all mentions of the word “woman” from its web pages about ovarian and uterine cancer. The Daily Mail reported that the word “woman” is now missing from the landing pages of three web pages explaining the three cancers that only occur in biological women. Despite the fact […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,biology,CDC,culture wars,gender neutral,gender politics,identity politics,insanity,left cult,NHS,pandering,political correctness,propaganda,Rochelle Walensky,social justice,trans activism,Twisted,UK,wokeism,Woman,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-05-27-nhs-removes-woman-from-female-cancer-pages.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "CLOWN WORLD: UK NHS removes the word WOMAN from web pages about cancers affecting biological females", "cleaned_text": "CLOWN WORLD: UK NHS removes the word WOMAN from web pages about cancers affecting biological females\n\nThe United Kingdom’s National Health Service (NHS) removed all mentions of the word “woman” from its web pages about ovarian and uterine cancer.\n\nThe Daily Mail reported that the word “woman” is now missing from the landing pages of three web pages explaining the three cancers that only occur in biological women. Despite the fact that only women suffer from cancers of the ovary, womb and cervix, the NHS management removed any mention of them in an attempt at politically correct language.\n\nThe original version of NHS’ web page for ovarian cancer contained this passage: “Ovarian cancer, or cancer of the ovaries, is one of the most common types of cancer in women. Ovarian cancer mainly affects women who have been through menopause, usually over the age of 50, but it can sometimes affect younger women.”\n\nHowever, a stealthily-done update in January 2022 dropped the two-sentence passage. It was instead replaced with this line: “Anyone with ovaries can get ovarian cancer, but it mostly affects those over 50.”\n\nThe page for womb cancer was also subjected to the same changes. Its original version opened with: “Cancer of the womb – uterine or endometrial cancer – is a common cancer that affects the female reproductive system. It’s more common in women who have been through menopause.” The opening statement was excised from the site in October 2021, with no mention of women.\n\n“Cervical cancer develops in a woman’s cervix – the entrance to the womb from the vagina. It mainly affects sexually active women aged between 30 and 45,” stated the NHS web page for the condition. However, a subsequent revision removed the aforementioned passage entirely. Interestingly, the latest version of the NHS page for cervical cancer features a diagram of the female reproductive system even though no mention of “women” is made.\n\nThe NHS defended its decision to remove the words “woman” and “women” in the web pages about the three cancers, saying that it seeks to make the resources “as helpful as possible to everyone who needs them.”\n\nWriting for LifeSiteNews, pro-life activist Jonathon Von Maren criticized the NHS’ move. “These changes are just the latest example of the ongoing colonization of the NHS by the transgender movement,” he said.\n\n“It is impossible for a man to give birth or contract cervical cancer. But none of that matters: Only the feelings of trans activists matter now.”\n\nVon Maren was not alone in his criticism of the British health system’s removal of the word “women” in its resources. Coventry University professor Jenny Gamble, an expert in midwifery, warned that the change in language risked women missing out on important health information.\n\n“The trend to avoid using the terms ‘woman’ and ‘women’ is unhelpful. It is a well-established principle of communication that the sex of individuals should be made visible when relevant and should not be made visible when not. This ensures that sex-related needs and issues are not overlooked,” she told the Mail.\n\nIt appears the trend to erase any mention of women for fear of offending the transgender sector is not only found across the pond. Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention (CDC), drew flak for using the purportedly inclusive term “pregnant people” instead of “pregnant women.” (Related: CDC director draws flak for calling on “pregnant people” to get vaccinated, refusing to admit only WOMEN can be pregnant.)\n\nThe director of the public health agency used the phrase in a tweet that called for people to get the Wuhan coronavirus (COVID-19) vaccine. “The rise in cases, vaccine hesitancy and the increased risk of severe illness for pregnant people make vaccination against COVID-19 more urgent than ever,” her tweet said. Walensky used the supposedly gender-neutral term in a subsequent tweet.\n\nMany Twitter users, including two U.S. lawmakers, did not take too kindly to Walensky’s use of the term.\n\nRep. Mary Miller (R-IL) said the CDC’s use of “left-wing” language makes the American public to lose “faith and trust in [its] objectivity.” Meanwhile, Sen. Marsha Blackburn (R-TN) said the term “pregnant people” was “erasing women,” adding that “the recent movement to erase women is disturbing and has made its way into our bureaucracy.”\n\nWatch this video about CDC Director Dr. Rochelle Walensky’s call for “pregnant people” to get the COVID-19 vaccine.\n\nThis video is from the high impact Flix and more!!! channel on Brighteon.com.\n\nUK hospitals go “full woketard” by now asking MEN if they are pregnant.\n\nUK equality commission: Transgenders CAN BE DENIED access to single-sex spaces.\n\nSAY WHAT? Western perversion: British midwives now being taught how to deliver babies through “male genitalia.”\n\n“Woke” insanity: Hospitals tells women to stop using the term BREASTfeeding because it’s offensive to transgenders.", "opengraph": {"title": "CLOWN WORLD: UK NHS removes the word WOMAN from web pages about cancers affecting biological females", "type": "article", "url": "https://www.gender.news/2022-05-27-nhs-removes-woman-from-female-cancer-pages.html", "site_name": "Gender News", "description": "The United Kingdom’s National Health Service (NHS) removed all mentions of the word “woman” from its web pages about ovarian and uterine cancer. The Daily Mail reported that the word “woman” is now missing from the landing pages of three web pages explaining the three cancers that only occur in biological women. Despite the fact […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/05/Chalkboard-Sign-Illustrative-Style-Female-Male.jpg"}, "tags": ["biology", "left cult", "gender politics", "pandering", "Woman", "Rochelle Walensky", "identity politics", "CDC", "gender neutral", "trans activism", "women's health", "culture wars", "UK", "propaganda", "social justice", "NHS", "insanity", "political correctness", "wokeism", "Twisted"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/blogs/uk-healthcare-system-removes-the-word-woman-from-webpages-about-womb-and-ovarian-cancer/", "https://www.dailymail.co.uk/health/article-10833585/NHS-removes-word-women-ovarian-womb-cancer-advice-pages.html", "http://wokies.news", "https://www.coventry.ac.uk/", "http://identitypolitics.news", "https://www.dailymail.co.uk/news/article-9889223/CDC-Director-Rochelle-Walensky-blasted-tweet-urging-pregnant-people-COVID-vaccine.html", "https://naturalnews.com/2021-08-16-cdc-director-slammed-using-pregnant-people-term.html", "https://politicalcorrectness.news", "https://www.brighteon.com/a51edf98-537d-43d4-a5ba-f39a0b124929", "https://www.brighteon.com/channels/kittensrus", "https://libtards.news/2022-04-05-uk-hospitals-woke-ask-men-if-pregnant.html", "https://politicalcorrectness.news/2022-04-07-uk-transgenders-denied-access-to-certain-spaces.html", "https://leftcult.com/2022-05-03-british-midwives-deliver-babies-through-male-genitalia.html", "https://wokies.news/2021-02-18-hospitals-tell-women-stop-breastfeeding-offensive-transgenders.html", "https://www.lifesitenews.com/blogs/uk-healthcare-system-removes-the-word-woman-from-webpages-about-womb-and-ovarian-cancer/", "https://www.dailymail.co.uk/health/article-10833585/NHS-removes-word-women-ovarian-womb-cancer-advice-pages.html", "https://www.dailymail.co.uk/news/article-9889223/CDC-Director-Rochelle-Walensky-blasted-tweet-urging-pregnant-people-COVID-vaccine.html", "https://www.brighteon.com/a51edf98-537d-43d4-a5ba-f39a0b124929", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-05-27-nhs-removes-woman-from-female-cancer-pages.html&linkname=CLOWN%20WORLD%3A%20UK%20NHS%20removes%20the%20word%20WOMAN%20from%20web%20pages%20about%20cancers%20affecting%20biological%20females", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}