{"result_id": "128012", "URL": "https://gender.news/2021-10-16-netflix-suspends-reinstates-workers-upset-dave-chappelles-transphobia.html", "timestamp": "2023-04-25 15:13:52 CEST+0200", "meta": {"description": "Even the ‘wokest’ of corporations aren’t woke enough for the hyper-left, most of who are budding authoritarians who would, if they could, literally take away the speech and expression rights of any American who disagrees with their views. Like comedian Dave Chappelle. In recent days, Netflix, which has worked with Chappelle for years and has […]", "lang": "en", "keywords": "comedy special,culture wars,Dave Chappelle,left cult,Liberal Mob,Libtards,Netflix,reinstatement,suspension,Trans,transgender,wokeism,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2021-10-16-netflix-suspends-reinstates-workers-upset-dave-chappelles-transphobia.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Netflix suspends, reinstates three workers who busted into a financial meeting because they’re upset at Dave Chappelle’s ‘transphobia’; walkout now planned", "cleaned_text": "Netflix suspends, reinstates three workers who busted into a financial meeting because they’re upset at Dave Chappelle’s ‘transphobia’; walkout now planned\n\nEven the ‘wokest’ of corporations aren’t woke enough for the hyper-left, most of who are budding authoritarians who would, if they could, literally take away the speech and expression rights of any American who disagrees with their views.\n\nIn recent days, Netflix, which has worked with Chappelle for years and has produced several of his comedy specials, began taking heat from some of its own transgender employees over jokes the comedian told for a newly released special called “The Closer.”\n\nIn response, three of the streaming service’s employees, including one who is trans, busted into a financial meeting uninvited attended by higher-ranking company executives which led to immediate consequences, as The Post Millenial noted:\n\nThe exclusive meeting featured Netflix co-CEO Ted Sarandos and the company’s top 500 employees.During the two-day business review, Sarandos briefed the company on how they should be equipped to handle backlash from Chappelle’s controversial special The Closer.“Chapelle is one of the most popular stand-up comedians today, and we have a long-standing deal with him,” Sarandos noted in a memo that was leaked to Variety. “His last special ‘Sticks & Stones,’ also controversial, is our most watched, stickiest and most award winning stand-up special to date.”\n\n“As with our other talent, we work hard to support their creative freedom — even though this means there will always be content on Netflix some people believe is harmful,” Sarandos continued.\n\n“Several of you have also asked where we draw the line on hate. We don’t allow titles on Netflix that are designed to incite hate or violence, and we don’t believe The Closer crosses that line,” Sarandos noted further. “I recognize, however, that distinguishing between commentary and harm is hard, especially with stand-up comedy which exists to push boundaries. Some people find the art of stand-up to be mean spirited but our members enjoy it, and it’s an important part of our content offering.”\n\nFollowing the release of The Closer, Terra Field, a trans Netflix senior software engineer who was one of the three initially suspended, posted a viral response last week in which she was critical of her employer.\n\n“Promoting TERF ideology (which is what we did by giving it a platform yesterday) directly harms trans people, it is not some neutral act. This is not an argument with two sides. It is an argument with trans people who want to be alive and people who don’t want us to be,” Field said in a Twitter thread. “This all gets brushed off as offense though – because if we’re just “too sensitive” then it is easy to ignore us.”\n\nHer account is private, but here is a screenshot:\n\nDuring his special, Chappelle said he’s “Team TERF,” which stands for trans-exclusionary radical feminism. In the past, he has also questioned mandatory vaccines in his stand-up.Netflix has since reinstated all three employees, but nevertheless, now trans-staffers at the streaming giant are planning a walk-out because again, they are budding authoritarians who don’t believe comedians like Chappelle have a right to poke fun at them or make jokes at their expense (which is what comedians literally do for a living — they poke fun at people).“Trans Lives Matter. Trans Rights Matter. And as an organization, Netflix has continually failed to show deep care in our mission to Entertain the World by repeatedly releasing content that harms the Trans community and continually failing to create content that represents and uplifts Trans content. We can and must do better!” wrote a leader for the trans employee resource group at the streaming network in an internal organizing message, according to The Verge. A trans-walkout is scheduled for Oct. 20. “Netflix has reinstated me after finding that there was no ill-intent in my attending the QBR meeting. I’ve included the statement I requested below. I’m going to take a few days off to decompress and try to figure out where I’m at. At the very least, I feel vindicated,” Field tweeted late Tuesday. When woke corporations — remember, Netflix hired the Obamas — aren’t woke enough for the extreme left, then you know there is no hope for the future of our culture.", "opengraph": {"title": "Netflix suspends, reinstates three workers who busted into a financial meeting because they’re upset at Dave Chappelle’s ‘transphobia’; walkout now planned", "type": "article", "url": "https://www.gender.news/2021-10-16-netflix-suspends-reinstates-workers-upset-dave-chappelles-transphobia.html", "site_name": "Gender News", "description": "Even the ‘wokest’ of corporations aren’t woke enough for the hyper-left, most of who are budding authoritarians who would, if they could, literally take away the speech and expression rights of any American who disagrees with their views. Like comedian Dave Chappelle. In recent days, Netflix, which has worked with Chappelle for years and has […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2021/10/dave-chappelle.png"}, "tags": ["Liberal Mob", "suspension", "Libtards", "wokeism", "Netflix", "culture wars", "left cult", "transgender", "comedy special", "Dave Chappelle", "wokies", "reinstatement", "Trans"], "tweets": [], "movies": [], "links": ["https://thepostmillennial.com/netflix-fires-three-employees", "https://variety.com/2021/film/news/dave-chappelle-netflix-suspends-trans-employee-1235086394/", "https://www.naturalnews.com/2017-03-23-dave-chappelle-questions-mandatory-vaccines-in-new-netflix-special.html", "https://www.theverge.com/2021/10/12/22723592/netflix-trans-employees-walkout-statements-ceo", "http://www.collapse.news", "https://www.theverge.com/2021/10/12/22723592/netflix-trans-employees-walkout-statements-ceo", "https://variety.com/2021/film/news/dave-chappelle-netflix-suspends-trans-employee-1235086394/", "https://thepostmillennial.com/netflix-fires-three-employees", "https://www.naturalnews.com/2017-03-23-dave-chappelle-questions-mandatory-vaccines-in-new-netflix-special.html"], "authors": [], "publish_date": null}