{"result_id": "128025", "URL": "https://gender.news/2022-11-17-students-push-back-anti-catholic-events-jesuit-university.html", "timestamp": "2023-04-25 15:14:00 CEST+0200", "meta": {"description": "Two students spoke out against anti-Catholic events – including an LGBT drag show – that occurred at a university run by the Jesuits in Missouri. The students from Saint Louis University (SLU) told LifeSiteNews that they plan to present the issue to the Archdiocese of St. Louis through a letter. They added that the correspondence seeks to […]", "lang": "en", "keywords": "anti catholic,campus insanity,culture wars,demonic,drag show,education system,evil,Jesuit university,left cult,LGBT,propaganda,public education,resist,revolt,Saint Louis University,Satanic,Thomas Patterson,woke mob,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-11-17-students-push-back-anti-catholic-events-jesuit-university.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Students push back against anti-Catholic rhetoric, events at Jesuit-run university in Missouri", "cleaned_text": "Students push back against anti-Catholic rhetoric, events at Jesuit-run university in Missouri\n\nTwo students spoke out against anti-Catholic events – including an LGBT drag show – that occurred at a university run by the Jesuits in Missouri.\n\nThe students from Saint Louis University (SLU) told LifeSiteNews that they plan to present the issue to the Archdiocese of St. Louis through a letter. They added that the correspondence seeks to take a stand against heresy and clarify that not all SLU students and faculty members support these incidents that contradict the Catholic faith.\n\n“SLU has had a lot of very sketchy [and] anti-Catholic behavior in the last couple of years that I’ve been a student. So at this point, I am dismayed but unsurprised,” said the first student who wishes to remain anonymous. “In the context of the greater student population, I’m a bit of a minority, but within the population of actual Catholic students, I am far from alone.”\n\nThe second student named Michael requested his last name be kept anonymous. “It seems that despite being a Catholic school full of brilliant individuals, we keep on settling for the status quo, especially when it comes to LGBTQ. I’m not the only one that thinks hosting a drag [performance] isn’t the way forward. We shouldn’t just accept the fact that there are so many events on campus that affirm this ideology,” he said.\n\nAccording to Michael, he and the more than 34 signatories plan to send their letter to the St. Louis Review – the diocesan newspaper – “with the hope that they can shed some more light on the situation.”\n\n“We’re not looking to attack anyone. In a lot of ways, we as students don’t know what to do, so we are hoping that we can get the word out and make people rethink the status quo and realize this isn’t what students want.”\n\nEstablished in 1818, SLU prides itself as the second-oldest university established by the Jesuits – formally the Society of Jesus. However, the more than 200-year-old institution appears to be straying far from the faith whose principles it was founded on.\n\nIn October, SLU came under fire for hosting a drag show that Michael pertained to. The Oct. 11 drag performance held at the Wool Ballrooms of the SLU’s Busch Student Center was approved by Leadership and Activities Program Coordinator Thomas Patterson. He also performed in the aforementioned event as drag queen Misty Terrain.\n\nAside from Patterson’s drag performance, the Jesuit university has also enabled the undermining of several key tenets of the Catholic faith. (Related: Pope Francis’ American cardinals are pro-LGBT revolutionaries with a radical agenda for the Church.)\n\nLifeSiteNews recounted the testimony of an SLU student, who shared that a theology professor once “tried to refute the teachings of St. John Paul II on [his book] ‘Love and Responsibility.'” First written by Fr. Karol Wojtyla in his native Polish before his ascent to the papacy and canonization, the book served as a defense for the traditional Catholic ideas of marriage, love and sex.\n\nThe same student also mentioned that one of the theology professor’s readings “accused Our Lady of Guadalupe as being … something like an imperialist tool used to subjugate the indigenous women of color.”\n\nEven worse, a group of students “attacked the cemetery of the innocents” set up by the SLU Students for Life Club. The memorial was set up in honor of babies who were killed in abortions.\n\n“Our theology program has a lot of dissenting views on sexual morality and on dogmatic theology,” the SLU student commented. “SLU’s campus ministry has made it very clear that they are not trying to uphold the Catholic faith as the one true faith.”\n\nWatch this video of a student from Loyola Marymount University in California – also a Jesuit university – pushing back against the school’s support of Planned Parenthood.\n\nThis video is from the Excellent PODCASTS & Real NEWS channel on Brighteon.com.\n\nStudent found dead after viral video of him leading protest against ‘drag queen’ event for kids.\n\nBardsFM with Scott Kesterson: Globalists waging war on children, God’s creations via WOKE ideology – Brighteon.TV.", "opengraph": {"title": "Students push back against anti-Catholic rhetoric, events at Jesuit-run university in Missouri", "type": "article", "url": "https://www.gender.news/2022-11-17-students-push-back-anti-catholic-events-jesuit-university.html", "site_name": "Gender News", "description": "Two students spoke out against anti-Catholic events – including an LGBT drag show – that occurred at a university run by the Jesuits in Missouri. The students from Saint Louis University (SLU) told LifeSiteNews that they plan to present the issue to the Archdiocese of St. Louis through a letter. They added that the correspondence seeks to […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/11/Transgender-Gender-Dysphoria-Confusion-Transition-Mask.jpg"}, "tags": ["left cult", "campus insanity", "demonic", "culture wars", "anti catholic", "wokies", "propaganda", "woke mob", "Saint Louis University", "LGBT", "Jesuit university", "drag show", "resist", "evil", "public education", "revolt", "Thomas Patterson", "Satanic", "education system"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/students-push-back-against-pro-lgbt-anti-catholic-incidents-at-jesuit-run-university/", "https://www.slu.edu/", "http://resist.news", "https://www.yaf.org/news/saint-louis-university-to-host-drag-show-approved-by-drag-baby-administrator/", "https://naturalnews.com/2022-10-25-pope-francis-american-cardinals-pro-lgbt-revolutionaries.html", "http://evil.news", "https://www.lmu.edu/", "https://www.brighteon.com/f136f133-95a1-4b31-8a33-4c81bf84b044", "https://www.brighteon.com/channels/the1jeremy", "https://leftcult.com/2020-08-20-iowa-professor-forbids-criticizing-blm-gay-abortion.html", "https://leftcult.com/2020-01-14-student-found-dead-after-viral-video-drag-queen-event.html", "https://wokies.news/2022-10-21-globalists-waging-war-children-via-woke-ideology.html", "https://www.lifesitenews.com/news/students-push-back-against-pro-lgbt-anti-catholic-incidents-at-jesuit-run-university/", "https://www.yaf.org/news/saint-louis-university-to-host-drag-show-approved-by-drag-baby-administrator/", "https://www.brighteon.com/f136f133-95a1-4b31-8a33-4c81bf84b044", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-11-17-students-push-back-anti-catholic-events-jesuit-university.html&linkname=Students%20push%20back%20against%20anti-Catholic%20rhetoric%2C%20events%20at%20Jesuit-run%20university%20in%20Missouri", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}