{"result_id": "128003", "URL": "https://gender.news/2020-01-10-radical-left-so-insane-even-boy-george-has-had-enough-pronouns.html", "timestamp": "2023-04-25 15:13:46 CEST+0200", "meta": {"description": "Karma Chameleon singer Boy George is stirring the pot on Twitter by declaring transgender pronoun culture to be “as ridiculous as it gets!” The English pop star had initially tweeted, “Leave your pronoun’s (sic) at the door!” to his roughly 468,000 followers, with no further explanation as to the context. When one of his fans […]", "lang": "en", "keywords": "Boy George,celebrity,delusional,gender,insanity,left cult,Liberal Mob,Libtards,lunatics,preferred gender pronouns,preferred pronouns,Pronouns,ROFL,Social media,stupid,Twisted,Twitter mob,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2020-01-10-radical-left-so-insane-even-boy-george-has-had-enough-pronouns.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "The radical Left is so insane that even BOY GEORGE has had enough of the stupid pronouns", "cleaned_text": "The radical Left is so insane that even BOY GEORGE has had enough of the stupid pronouns\n\nKarma Chameleon singer Boy George is stirring the pot on Twitter by declaring transgender pronoun culture to be “as ridiculous as it gets!”\n\nThe English pop star had initially tweeted, “Leave your pronoun’s (sic) at the door!” to his roughly 468,000 followers, with no further explanation as to the context. When one of his fans tweeted back, “As much as I love you, that does sound quite ridiculous,” George responded, “You must refer to me as ‘Napoleon’ and that’s as ridiculous as it gets!” referring to the trend among trans people demanding that people call them by their “preferred gender pronouns.”\n\n“I used the ladies (sic) toilet throughout the 80s!” George further tweeted, again referring to the ongoing controversy over bathroom labeling and which one trans people should use.\n\nAnother angry Twitter user responded to George by asking him what it would take “to show others respect by using their preferred pronouns?” adding, “I wouldn’t not use your name so why would I not use your preferred pronouns? People are too quick to criticise others’ lifestyles & identities. If people want attention there’s usually a reason. Ask them,” to which George retorted back, “Thanks for that but I have eyes and can mostly describe what I see!”\n\nAfter being repeatedly accused of transphobia, George, a homosexual, emphasized that, “There’s nothing ‘phobic’ about Miss Boy George! Nish! Nada!” George had previously defended singer Marc Almond against similar attacks that accused him of “transphobia” as well.\n\n“I don’t believe for a nano second that [Marc Almond] is transphobic!” George added in another tweet. “He ain’t tainted love!”\n\nAlmond personally responded to the accusations levied against him by claiming that he has “always had Trans friends and been and championed in life and song since the early 80’s (sic).” “I’ve enjoyed playing with Gender long before it was fashionable. Twitter hysteria and drama. I’m sure you know that.”\n\nThe tweet that first got Almond in trouble with the Twitter mob stated, “WOMEN now have to use a toilet where a MAN has pissed all over the seat,” referring to the trans bathroom issue. “Heard so many complaining at venues. But people are scared to complain because of the righteous ‘I’m offended’ fascists.”\n\nEven leftist LGBTQs from previous generations have had it with today’s transgender insanity\n\nThat Almond would correctly use the word fascists to describe LGBTQ Twitter mob outrage further proves that modern-day LGBTQs have gone certifiably crazy with their demands. When LGBTQ icons like Boy George and Marc Almond are calling out new-wave LGBTQs as fascists, you know the trans mafia has gone completely out of control.\n\n“I’m a bloke, male, who sometimes [likes] to explore a feminine side depending on how I feel, or what kind of show I’m doing, always have, as many did from my Gen – didn’t need a label, don’t need one now,” Almond further added, blasting today’s fragile and always-offended LGBTQs who are always angry about something – which is one reason among many why nobody should pander to them.\n\nKeep in mind that both George and Almond are liberals, at least when it comes to LGBTQ acceptance and promotion throughout society. And yet, even they can’t stand what’s going on in the world today with so-called “cancel culture” and ratcheting-up political correctness.\n\n“Yes, all this PC stuff is giving me a headache too,” George tweeted to Almond back in September. “Bring back Julie Burchill. She knew how to dismantle a career!”\n\nTo keep up with the latest LGBTQ news, be sure to check out Gender.news.\n\nYou can also read more stories about the transgender indoctrination of modern society, including in the classroom, at Evil.news.", "opengraph": {"title": "The radical Left is so insane that even BOY GEORGE has had enough of the stupid pronouns", "type": "article", "url": "https://www.gender.news/2020-01-10-radical-left-so-insane-even-boy-george-has-had-enough-pronouns.html", "site_name": "Gender News", "description": "Karma Chameleon singer Boy George is stirring the pot on Twitter by declaring transgender pronoun culture to be “as ridiculous as it gets!” The English pop star had initially tweeted, “Leave your pronoun’s (sic) at the door!” to his roughly 468,000 followers, with no further explanation as to the context. When one of his fans […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2020/01/T-2017-HRR-Excuse-me-what-are-your-gender-pronounse.jpg"}, "tags": ["Liberal Mob", "preferred gender pronouns", "Libtards", "ROFL", "stupid", "left cult", "lunatics", "preferred pronouns", "delusional", "Twitter mob", "Pronouns", "Twisted", "Social media", "Boy George", "gender", "celebrity", "insanity", "woke"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/entertainment/2020/01/08/boy-george-leave-your-pronouns-at-the-door/", "https://www.naturalnews.com/2019-08-15-stand-your-ground-against-the-lunatic-lgbt-outrage-mob.html", "https://gender.news", "http://evil.news", "https://www.breitbart.com/entertainment/2020/01/08/boy-george-leave-your-pronouns-at-the-door/", "https://www.naturalnews.com/2019-08-15-stand-your-ground-against-the-lunatic-lgbt-outrage-mob.html"], "authors": [], "publish_date": null}