{"result_id": "128020", "URL": "https://gender.news/2021-10-27-prather-point-culture-change-fifth-generation-warfare.html", "timestamp": "2023-04-25 15:13:57 CEST+0200", "meta": {"description": "For former intelligence officer Jeffrey Prather, culture change is a part of fifth-generation warfare. He elaborated on this during the Oct. 22 episode of “Prather Point” on Brighteon.TV. Prather cited a number of examples where large-scale actions by empires worldwide failed to eradicate small groups completely. While the actions initially impacted the small groups, they eventually took over in […]", "lang": "en", "keywords": "border security,Brighteon.tv,counter-insurgency measures,culture change,fifth generation warfare,Jeffrey Prather,Jesus Christ,national security,non-violent warfare,Prather Point,Rachel Levine,transgenderism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2021-10-27-prather-point-culture-change-fifth-generation-warfare.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Jeffrey Prather: Culture change is part of fifth-generation warfare – Brighteon.TV", "cleaned_text": "For former intelligence officer Jeffrey Prather, culture change is a part of fifth-generation warfare. He elaborated on this during the Oct. 22 episode of “Prather Point” on Brighteon.TV.\n\nPrather cited a number of examples where large-scale actions by empires worldwide failed to eradicate small groups completely. While the actions initially impacted the small groups, they eventually took over in the long run and dominated the larger entity.\n\n“Rome had streets with burning Christians by the hundreds. Now it is a Catholic capital. The Aztecs sliced out still-beating hearts by the thousands, but the free tribes are still here. The Nazis skinned Jews to make lampshades, but synagogues still stand. Tribal Africans were sold in slave ships, but now their descendants captain the American fleet,” Prather says.\n\n“We didn’t lose our republic in front of the scene, and we’re not going to gain it back in front of the scene. That is how we will defeat this deep state tyranny – because they can’t stop all of us. This is how the pioneers, the states and the tribes survived: They were decentralized. Everybody decentralizing their effort, but working together is very important to understand.”\n\nAccording to Prather, the U.S. only has much experience in fourth-generation warfare, i.e. guerrilla war or insurgency war. “We actually started out that way with Native Americans fighting against the British. The tribes survived that way. And now, we are beginning another war in the continental U.S. – but it’s primarily non-kinetic,” he said.\n\n“I know it’s difficult to understand that we have been involved in a fifth-generation war. Fifth-generation warfare is very hard to even identify as warfare. It doesn’t look like that.”\n\nPrather talks about the push and pull of cultural changes\n\nThe “Prather Point” host noted that fifth-generation warfare involves changing the enemy’s culture by means of infiltration and switching. He mentioned the Biden administration’s opening of the southern border to illegal immigrants and those engaged in drug and human trafficking as an example of this change. Prather also pointed out how terrorists posing as Afghan refugees are being flown in to different U.S. cities.\n\nHe also mentioned the promotion of Dr. Rachel Levine, the assistant secretary of the Department of Health and Human Services, to a four-star admiral under the U.S. Public Health Service. According to CBS News, the former Pennsylvania health secretary is the first openly transgender four-star officer in the country’s uniformed services.\n\nPrather said: “When you see Rachel Levine, a man who has transitioned to be a woman, now promoted, who’s castrated and probably taking hormone drugs, wearing a wig and trying to say that boys are girls [and] girls are boys – that’s trying to change the culture.” (Related: Biden picks transgender who encouraged Covid-safe orgies as assistant health secretary.)\n\nThe “Prather Point” host also mentioned different officials pushing back against this cultural change. According to Prather, this pushback constitutes a kind of insurgent warfare that does not involve active, offensive maneuvers against enemies.\n\nThe Brighteon.TV host quoted Texas Gov. Greg Abbott, who said that any Border Patrol agents terminated by the Biden administration will be taken in by the state. “If they are at risk of losing their job because of a president who is abandoning his duty to secure the border, they have a job in the state of Texas. I will hire you to help Texas secure our border,” Abbott said.\n\n“Those are federal government jobs, but they are taking them on. So that’s what insurgent warfare really is. But it’s a different kind of warfare,” Prather said. (Related: Whistleblower: Biden has given official notice demanding border patrol agents get vaccinated (or be fired).)\n\nHe also mentioned the efforts of conservative organizations Judicial Watch and Project Veritas against this cultural change. Prather comments however: “Judicial Watch is great, but they just do Freedom of Information [Act] requests and then it kinds of stops there. Project Veritas … [exposes] the corruption, hypocrisy, lies and betrayals of the left, but then it kind of stops there.”\n\nThe “Prather Point” host said: “Historically, there were non-violent insurgent movements. This is exactly how the Christians overtook Rome on about 313 A.D. – it took that long. It was still fourth-generation insurgent warfare, it was non-kinetic [and] non violent, but it could not be stopped. The Romans had no way to counteract that.”\n\nHe cited the crucifixion of Christ and the crucifixion of Spartacus, the gladiator who led slaves against Rome. “Spartacus used kinetic means against the Roman Empire. [But] they understood counter-insurgency … [and] they were able to crush Spartacus’ movement. Jesus Christ used insurgent tactics that they could not crush, and that is ‘love your neighbor’ and ‘pray for your enemies.'”\n\nWatch the full Oct. 22 episode of “Prather Point” below. “Prather Point” with Jeffrey Prather airs every Friday at 10–11 a.m. on Brighteon.TV.\n\nRevolt.news has more articles about how America can be reclaimed through non-violent means.", "opengraph": {"title": "Jeffrey Prather: Culture change is part of fifth-generation warfare – Brighteon.TV", "type": "article", "url": "https://www.gender.news/2021-10-27-prather-point-culture-change-fifth-generation-warfare.html", "site_name": "Gender News", "description": "For former intelligence officer Jeffrey Prather, culture change is a part of fifth-generation warfare. He elaborated on this during the Oct. 22 episode of “Prather Point” on Brighteon.TV. Prather cited a number of examples where large-scale actions by empires worldwide failed to eradicate small groups completely. While the actions initially impacted the small groups, they eventually took over in […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2021/10/Brighteon-TV-4.jpg"}, "tags": ["Jeffrey Prather", "national security", "border security", "Prather Point", "culture change", "Brighteon.tv", "Jesus Christ", "counter-insurgency measures", "Rachel Levine", "non-violent warfare", "fifth generation warfare", "transgenderism"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/b05b8f0b-34ce-4794-8c9d-83f71b83f12b", "https://brighteon.tv/", "https://www.cbsnews.com/news/rachel-levine-transgender-four-star-admiral/", "https://www.cbsnews.com/news/rachel-levine-transgender-four-star-admiral/", "https://www.naturalnews.com/2021-01-19-biden-picks-transgender-who-encouraged-covid-safe-orgies-as-assistant-health-secretary.html", "https://www.naturalnews.com/2021-01-19-biden-picks-transgender-who-encouraged-covid-safe-orgies-as-assistant-health-secretary.html", "https://brighteon.tv/", "https://townhall.com/tipsheet/landonmion/2021/09/26/abbott-vows-to-hire-border-patrol-agents-disciplined-by-biden-administration-n2596503", "https://www.naturalnews.com/2021-09-30-whistleblower-biden-border-patrol-agents-get-vaccinated.html", "http://deception.news", "https://www.brighteon.com/b05b8f0b-34ce-4794-8c9d-83f71b83f12b", "https://brighteon.tv/", "https://revolt.news/", "https://www.brighteon.com/b05b8f0b-34ce-4794-8c9d-83f71b83f12b", "https://www.cbsnews.com/news/rachel-levine-transgender-four-star-admiral/", "https://townhall.com/tipsheet/landonmion/2021/09/26/abbott-vows-to-hire-border-patrol-agents-disciplined-by-biden-administration-n2596503"], "authors": [], "publish_date": null}