{"result_id": "128004", "URL": "https://gender.news/2022-11-15-tranny-film-for-children-sponsored-by-bayer.html", "timestamp": "2023-04-25 15:13:47 CEST+0200", "meta": {"description": "Influencing children to “switch genders” by getting surgery and taking dangerous hormone-influencing drugs is now considered “lightness, humor, childlike openness, and play” by Hollywood and the insane Left. The director of the new film “Mama has a Mustache” wants this perverted propaganda embedded in school curriculum across the nation, so every child will be exposed to […]", "lang": "en", "keywords": "badhealth,badmedicine,Bayer,Big Pharma,brainwashed,culture wars,dangeorus medicine,drugs,evil,gender bender,gender fluid,gender surgery,gender wars,hormone drugs,indoctrination,left cult,propaganda,tranny,transgender,Twisted", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-11-15-tranny-film-for-children-sponsored-by-bayer.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Tranny film for children called “Mama has a Mustache” sponsored by Bayer, producer of drug prescribed for feminizing males", "cleaned_text": "Tranny film for children called “Mama has a Mustache” sponsored by Bayer, producer of drug prescribed for feminizing males\n\nInfluencing children to “switch genders” by getting surgery and taking dangerous hormone-influencing drugs is now considered “lightness, humor, childlike openness, and play” by Hollywood and the insane Left. The director of the new film “Mama has a Mustache” wants this perverted propaganda embedded in school curriculum across the nation, so every child will be exposed to queer and “non-binary” brainwashing. To make matters worse, this film is brought to you by Bayer, makers of pharmaceutical-grade hormone pills called cyproterone acetate that can cause bloody stool, dark urine, bloody urine, chest pain, confusion, chills, back pain, cough, decreased appetite, difficulty swallowing, hallucinations, and the inability to speak.\n\nOh, but parents, don’t you dare criticize any of this propaganda, in schools, on talk shows, or anywhere else, or you may be considered a criminal in certain US states that have already passed legislation to put you in jail for your opinion about tranny-everything, if it doesn’t fit the Hollywood narrative.\n\nDrug companies making films for schools and theatres to turn kids queer and normalize it\n\nNormalize it and they’ll advertise it. It’s a ‘no holds barred’ world of almost-porn brought right into schools, starting in daycare and working all the way up to teenage years, to try to turn everyone gay and put them all on dangerous cancer-causing pharmaceuticals. Thousands of psychiatrists are on board with all of this, and further influence the kids to get gender-bender surgery that can leave them depressed, with no libido, no ability to reproduce, and problems urinating for the rest of their lives.\n\nBayer creates a cyproterone acetate drug called Diane-35ED that feminizes males and influences their bodies to grow breasts. That means Bayer profits from the propaganda film they are sponsoring by pushing horrible, dangerous drugs (including puberty blockers) on the kids (and parents) who fall for it all. Supposedly, Americans are all hateful and biased if we don’t agree to push the kids to get sex-change surgery should they even think about being gay or just pondering their own sexuality.\n\nAll of the sudden everyone is “gender fluid” or else they’re engaging in hate speech, you choose. Post anything negative about this film and you will be “violating community standards” on all of social media and banned for life. Soon, Mama has a Mustache tranny-and-drug propaganda film may be playing in every American school classroom, plus a theatre near you. Check for local listings.\n\n“Freedom of Expression” does not justify influencing children to experiment with drugs and permanent genitalia-mutilation surgeries\n\nTalk about a money racket at the expense and risk of your children’s health, sanity, and reproductive future, it just doesn’t get any more demented and greedy than this. It’s not enough for Big Pharma to bankroll off of two-thirds of the adults in this country with quack medicine and useless drugs and surgeries for cancer, diabetes, heart disease and dementia, now they’re going after the kids. Some parents believe this is pedophilia and criminal, these films and Drag Queen tours we’re seeing at daycare centers, schools, and on talk shows.\n\nThe propagandists of this everything-gender-fluid movement want the rest of us to normalize it with them, and pretend it’s all just about having a healthy ‘conversation’ with the kids, and treat all this perverted thinking and acting with “lightness, humor, childlike openness, and play,” like it’s just some skit the kids thought up at summer camp.\n\nKids, adolescents, and teenagers are being given a green light to opt for drugs and surgeries without their parents consent. Anti-androgen drugs are feminizing boys and causing them to grow breasts. Hormone pills also cause cancer and deadly tumors, but nobody is addressing THAT on the talk shows.\n\nRemember also that university clinics and doctors at gender clinics at children’s hospitals are receiving major financial compensation for doling out these gender-bender drugs and performing sex-change operations that mutilate kid’s genitalia and breasts. Tune your internet dial to Gender.news, where you will find updates on US states that are already prepared to make criminals of anyone who criticizes transgenderism queer propaganda in school classrooms, on talk shows, or anywhere else.", "opengraph": {"title": "Tranny film for children called “Mama has a Mustache” sponsored by Bayer, producer of drug prescribed for feminizing males", "type": "article", "url": "https://www.gender.news/2022-11-15-tranny-film-for-children-sponsored-by-bayer.html", "site_name": "Gender News", "description": "Influencing children to “switch genders” by getting surgery and taking dangerous hormone-influencing drugs is now considered “lightness, humor, childlike openness, and play” by Hollywood and the insane Left. The director of the new film “Mama has a Mustache” wants this perverted propaganda embedded in school curriculum across the nation, so every child will be exposed to […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/11/girls-nn.jpg"}, "tags": ["tranny", "indoctrination", "hormone drugs", "dangeorus medicine", "Big Pharma", "evil", "culture wars", "left cult", "gender fluid", "transgender", "Twisted", "gender wars", "drugs", "gender surgery", "brainwashed", "Bayer", "propaganda", "gender bender"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/social-justice/2022/11/12/pro-transgender-propaganda-film-for-children-sponsored-by-pharmaceutical-company-that-creates-feminizing-drug/", "https://www.drugs.com/mtm/ethinyl-estradiol-and-levonorgestrel.html", "https://www.revolver.news/2022/11/freak-show-nevada-enshrines-transgender-ideology-into-law-through-popular-vote/", "https://www.naturalnews.com/2022-11-11-nevada-voted-law-crime-criticize-transgenderism-children.html", "http://medicalviolence.com", "http://groomers.news", "https://naturalnews.com/2018-01-31-new-guidelines-for-breast-cancer-survivors-cheap-hormone-pills-horrible-side-effects.html", "https://www.breitbart.com/health/2022/08/12/puberty-blocker-manufacturers-fund-pro-trans-doctors-medical-associations-activist-organization/", "https://gender.news/2022-11-11-nevada-voted-law-crime-criticize-transgenderism-children.html", "https://www.breitbart.com/social-justice/2022/11/12/pro-transgender-propaganda-film-for-children-sponsored-by-pharmaceutical-company-that-creates-feminizing-drug/", "https://www.drugs.com/mtm/ethinyl-estradiol-and-levonorgestrel.html", "https://www.naturalnews.com/2022-11-11-nevada-voted-law-crime-criticize-transgenderism-children.html", "https://www.revolver.news/2022/11/freak-show-nevada-enshrines-transgender-ideology-into-law-through-popular-vote/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-11-15-tranny-film-for-children-sponsored-by-bayer.html&linkname=Tranny%20film%20for%20children%20called%20%E2%80%9CMama%20has%20a%20Mustache%E2%80%9D%20sponsored%20by%20Bayer%2C%20producer%20of%20drug%20prescribed%20for%20feminizing%20males", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}