{"result_id": "128007", "URL": "https://gender.news/2022-11-16-matt-walsh-challenges-joe-rogan-marriage-surrogacy.html", "timestamp": "2023-04-25 15:13:48 CEST+0200", "meta": {"description": "In a recent podcast, Matt Walsh challenged host Joe Rogan’s support for same-sex “marriage,” correcting Rogan as he repeated incorrect definitions of marriage and fallacious, worn-out talking points about the nature of homosexuality. (Article by Doug Mainwaring republished from LifeSiteNews.com) During a lengthy discussion on The Joe Rogan Experience, the man who was the creative force behind the acclaimed […]", "lang": "en", "keywords": "culture wars,gay mafia,gender,gender confused,insanity,Joe Rogan,left cult,lgbtq,Libtards,marriage,Matt Walsh,political correctness,politics,propaganda,rational,religion,same-sex marriage,social justice,transgenderism,truth,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-11-16-matt-walsh-challenges-joe-rogan-marriage-surrogacy.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "Matt Walsh challenges Joe Rogan on same-sex ‘marriage’ and surrogacy: ‘Mom is not expendable’", "cleaned_text": "Matt Walsh challenges Joe Rogan on same-sex ‘marriage’ and surrogacy: ‘Mom is not expendable’\n\nIn a recent podcast, Matt Walsh challenged host Joe Rogan’s support for same-sex “marriage,” correcting Rogan as he repeated incorrect definitions of marriage and fallacious, worn-out talking points about the nature of homosexuality.\n\nDuring a lengthy discussion on The Joe Rogan Experience, the man who was the creative force behind the acclaimed documentary What Is A Woman? explained he was first drawn to address gender issues after witnessing conservatives being nonchalant about Bruce Jenner’s public “gender transition.”\n\n“I noticed it seemed like people on the right – conservatives – were just going along with it. They were willing to accept it and that’s what scared me,” recounted Walsh.\n\n“The left’s overall project is they wage this assault on life, marriage, and gender,” said Walsh, calling it a “three-pronged approach … redefining all three of these things which are fundamental pillars of human society. And so if you can redefine those and tear those down, then you’ve won, you’ve captured the culture.”\n\nWhile Rogan appeared to be in complete agreement with Walsh on the threat of transgenderism to society – especially to vulnerable young people – Rogan relentlessly pushed back when Walsh attempted to explain that redefining marriage to include homosexual couples is similarly dangerous.\n\nDuring the course of their conversation, Rogan showed himself to have been among those captured by the left when it comes to marriage and sexuality.\n\nRogan repeatedly asserted that people are born homosexual and that marriage “solidifies” unions based on “love,” but that the institution of marriage is “not necessarily for society.”\n\n“It’s for the individuals’ comfort” and a matter of “personal freedom,” declared Rogan.\n\nWalsh for his part patiently responded to Rogan’s repeated inaccuracies, driving home the point that marriage is “fundamentally a procreative male and female union … There’s really not much of a compromise position there”:\n\nThe issue is that from my perspective, and from the perspective of most human societies that have existed in history is that marriage is the context in which the procreative union occurs. Marriage is the foundation for the family. It is something that is reserved for that because male-female union has this capacity to create life. Whereas no other union has that capacity. And so it is a different kind of thing, and it makes sense to call it something different.\n\nWhen Rogan countered that it is common for homosexual couples to “get surrogate parents to carry their children,” as a way of suggesting that homosexual couples also participate in procreation, Walsh pushed back on the immorality of surrogacy, a thorny issue on which The Daily Wire has been inconsistent.\n\nAnd when it comes to adoption, Walsh said, “Every child deserves the best possible situation, the best chance that we can give them. And so I would say that [for] every child we should be looking for a man-woman couple.”\n\nWhen Rogan asked if “people who are gay should practice homosexuality … or … try to avoid it?” Walsh said:\n\nRogan grew frustrated with Walsh and injected a distaste for Biblical Christianity and morals: “If marriage shouldn’t involve gay people, then you’re saying that it’s because of Christian fundamentalist ideology.”\n\n“What bothers people is that religious ideology will be imposed on them” by people who “have an opposition to homosexuality based on religious beliefs,” said Rogan later in the discussion.\n\n“So what do you think [government] should do about gay marriage?” asked Rogan.\n\n“It’s not going to happen, but if it were up to me, I would go back to what [marriage] was six or seven years ago, where marriage is definitionally this, this one thing, and that’s it,” answered Walsh.\n\n“I don’t think that the question of the definition of marriage is a question of religious ideology,” said Walsh. “One of the ways I know that is that marriage has existed as an institution in societies all across the country and throughout history and regardless of what religion was predominant in those societies.”\n\nToward the end of their conversation, Rogan noted that immediately following the overturning of Roe v. Wade, people worried that homosexual “marriage” will also be overturned.\n\n“I don’t think that’s going to happen. There’s no political will for it,” said Walsh. “Then again I didn’t think Roe v. Wade was going to be overturned and it was.”\n\nWhile there was no clear “winner” by the end of their conversation, Rogan and Walsh congratulated themselves on having had a rare “civil” discussion on the topic of same-sex “marriage.”", "opengraph": {"title": "Matt Walsh challenges Joe Rogan on same-sex ‘marriage’ and surrogacy: ‘Mom is not expendable’", "type": "article", "url": "https://www.gender.news/2022-11-16-matt-walsh-challenges-joe-rogan-marriage-surrogacy.html", "site_name": "Gender News", "description": "In a recent podcast, Matt Walsh challenged host Joe Rogan’s support for same-sex “marriage,” correcting Rogan as he repeated incorrect definitions of marriage and fallacious, worn-out talking points about the nature of homosexuality. (Article by Doug Mainwaring republished from LifeSiteNews.com) During a lengthy discussion on The Joe Rogan Experience, the man who was the creative force behind the acclaimed […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/11/Joe-Rogan-Experience.jpg"}, "tags": ["left cult", "gender confused", "rational", "lgbtq", "religion", "culture wars", "truth", "gender", "wokies", "Matt Walsh", "propaganda", "social justice", "Joe Rogan", "politics", "same-sex marriage", "insanity", "political correctness", "Libtards", "gay mafia", "marriage", "transgenderism"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/matt-walsh-challenges-joe-rogan-on-same-sex-marriage-and-surrogacy-mom-is-not-expendable/", "https://open.spotify.com/episode/5c6SOd05MxXpPtFKqw4y1T?si=nWomZoOURfeOwFoBp5UxdA&nd=1", "https://get.dailywire.com/wiaw/subscribe?utm_campaign=wiaw&utm_medium=paid&utm_source=bing&utm_content=na_subscriptions&cid=wiaw&mid=b&xid=0&utm_term=matt%20walsh%20what%20is%20a%20woman&utm_campaign=&utm_source=bing&utm_medium=ppc&hsa_acc=6411461344&hsa_cam=429594023&hsa_grp=1326012504412860&hsa_ad=&hsa_src=o&hsa_tgt=kwd-82876595724471:aud-808681081:loc-190&hsa_kw=matt%20walsh%20what%20is%20a%20woman&hsa_mt=e&hsa_net=adwords&hsa_ver=3&msclkid=89e4c372a04317e20078a01bc14044c4", "https://www.lifesitenews.com/opinion/sociologist-new-study-explodes-narrative-that-people-are-born-gay/", "https://www.lifesitenews.com/news/matt-walsh-challenges-joe-rogan-on-same-sex-marriage-and-surrogacy-mom-is-not-expendable/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-11-16-matt-walsh-challenges-joe-rogan-marriage-surrogacy.html&linkname=Matt%20Walsh%20challenges%20Joe%20Rogan%20on%20same-sex%20%E2%80%98marriage%E2%80%99%20and%20surrogacy%3A%20%E2%80%98Mom%20is%20not%20expendable%E2%80%99", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}