{"result_id": "128006", "URL": "https://gender.news/2022-01-04-92-percent-lgbtq-covid-jabbed-aggressive-personality-changes.html", "timestamp": "2023-04-25 15:13:48 CEST+0200", "meta": {"description": "The pro-LGBTQ Human Rights Campaign (HRC) conducted a survey recently which found that upwards of 92 percent of all members of its community have received at least one injection of a Wuhan coronavirus (Covid-19) “vaccine.” A press release about the HRC Foundation Survey reveals that homosexuals, bisexuals, transgenders, queers and others of this nature are among the most likely demographic to […]", "lang": "en", "keywords": "92 percent,badhealth,brain damage,COVID,indoctrinated,LGBT,lgbtq,medical experiments,mind control,neurological damage,personality changes,vaccination,vaccine damage,vaccine wars,vaccines,zealots", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-01-04-92-percent-lgbtq-covid-jabbed-aggressive-personality-changes.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "92% of LGBTQ community has received at least one covid jab, and many now demonstrate aggressive personality changes consistent with brain damage", "cleaned_text": "92% of LGBTQ community has received at least one covid jab, and many now demonstrate aggressive personality changes consistent with brain damage\n\nThe pro-LGBTQ Human Rights Campaign (HRC) conducted a survey recently which found that upwards of 92 percent of all members of its community have received at least one injection of a Wuhan coronavirus (Covid-19) “vaccine.”\n\nA press release about the HRC Foundation Survey reveals that homosexuals, bisexuals, transgenders, queers and others of this nature are among the most likely demographic to willingly and eagerly roll up their sleeves to get jabbed by the government and Big Pharma.\n\n“Supported by The Rockefeller Foundation, this first-of-its-kind LGBTQ+-focused vaccination data is provided through the Community Marketing & Insights’ (CMI) 15th annual LGBTQ Community Survey of over 15,000 LGBTQ+ adult respondents,” the release explains.\n\n“We are encouraged to see evidence that suggests such a strong majority of the LGBTQ+ community who responded to the survey have received at least one dose of a COVID-19 vaccine.”\n\nLGBTQ Asians and Pacific Islanders are the most compliant at 96 percent, followed by 90 percent of LGBTQ Hispanics. Black LGBTQs clocked in at 85 percent compliance, as did Native American, Alaskan, Middle Eastern and North African LGBTQs.\n\nFor some reason, light-skinned LGBTQs (Caucasians) were not even mentioned in this survey category (because white people are bad, according to the Left).\n\nLGBTQs far more likely than everyone else to take mystery injections from Big Pharma\n\nElderly LGBTQs 55 years of age and older are slightly more likely than younger LGBTQs between the ages of 18-34 to get injected. The former group is 94 percent compliant while the latter group is 91 percent compliant.\n\nThe only time white LGBTQs are even mentioned at all in the survey is when the HRC makes the claim that non-whites are experiencing far more “covid deaths” among their friends and family members – the suggestion being that covid is “racist” against “people of color.”\n\n“LGBTQ+ people of color surveyed are more likely than white LGBTQ+ people to have experienced a negative financial impact during the pandemic,” the “woke” press release goes on to claim.\n\nThe HRC fully admits that members of the LGBTQ community have much higher rates of vaccine compliance compared to the general population. It chalks this up to more LGBTQs “being liberal, living in blue states, and living in urban areas.”\n\nEven among “less educated” LGBTQs with no more than a high school diploma (because according to the HRC, “educated” people are more likely to get injected), the compliance rate is still around 87 percent.\n\n“We also see that COVID isolation significantly impacted LGBTQ+ people, which may have motivated quick vaccination to reenter the community,” the group further claims.\n\nThe Covid Blog finds none of this surprising in light of the fact that LGBTQs tend to be among the most aggressive pro-jab zealots in society. Even outside of the covid injection lineup, LGBTQs tend to be heavy promoters of vaccines in general.\n\n“The current LGBTQ crowd as a whole are intolerant of any views contrary to theirs and will aggressively target anyone who expresses those views,” wrote one commenter at The Covid Blog. “Even other gay people.”\n\n“So when you virtue signal and embrace the woke narrative, accept the consequences. The phrase ‘get woke, go broke’ should also include for the vaxxers ‘and suffer from your choices,” which include possibly life-changing injury and death.”\n\n“This has often been said before but it bears repeating that the bitter irony in this whole debacle is, we were all clearly told as teenagers in the ’60s & ’70s to stay right away from strangers pushing intravenous drugs, as it would destroy our health and cause deadly addiction,” wrote another.\n\n“The strangers are now government officials and the boosters comprise the addiction.”\n\nThe latest news about the plandemic can be found at Pandemic.news.", "opengraph": {"title": "92% of LGBTQ community has received at least one covid jab, and many now demonstrate aggressive personality changes consistent with brain damage", "type": "article", "url": "https://www.gender.news/2022-01-04-92-percent-lgbtq-covid-jabbed-aggressive-personality-changes.html", "site_name": "Gender News", "description": "The pro-LGBTQ Human Rights Campaign (HRC) conducted a survey recently which found that upwards of 92 percent of all members of its community have received at least one injection of a Wuhan coronavirus (Covid-19) “vaccine.” A press release about the HRC Foundation Survey reveals that homosexuals, bisexuals, transgenders, queers and others of this nature are among the most likely demographic to […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/01/Trans-Parade-LGBTQ.jpg"}, "tags": ["vaccine wars", "vaccination", "zealots", "personality changes", "92 percent", "COVID", "medical experiments", "brain damage", "vaccines", "mind control", "vaccine damage", "neurological damage", "LGBT", "indoctrinated", "lgbtq"], "tweets": [], "movies": [], "links": ["https://thecovidblog.com/2021/12/25/ian-matos-32-year-old-olympic-diver-dead-19-weeks-after-covid-19-vaccine-likely-antibody-dependent-enhancement/", "https://archive.is/npGsX", "https://naturalnews.com/2020-10-22-pope-francis-endorses-lgbtq-marriage-in-new-documentary-film.html", "http://pandemic.news/", "https://thecovidblog.com/2021/12/25/ian-matos-32-year-old-olympic-diver-dead-19-weeks-after-covid-19-vaccine-likely-antibody-dependent-enhancement/", "https://archive.is/npGsX", "https://naturalnews.com/2020-10-22-pope-francis-endorses-lgbtq-marriage-in-new-documentary-film.html"], "authors": [], "publish_date": null}