{"result_id": "128032", "URL": "https://www.gender.news/2021-02-25-pediatricians-parents-leave-groom-children-transgenderism.html", "timestamp": "2023-04-25 15:14:04 CEST+0200", "meta": {"description": "Before bringing your young child to his or her next appointment with the pediatrician, you might want to first investigate what that medical professional believes about transgenderism. One mother learned the hard way that her son’s pediatrician is an LGBTQP – the P stands for pedophile – pervert who attempted to groom the boy to […]", "lang": "en", "keywords": "american medicine,badhealth,badmedicine,boys,children,corruption,lgbtq,LGBTQP,medical establishment,pediatrician,Pedophilia,perversion,sexual harassment,transgender", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.gender.news/2021-02-25-pediatricians-parents-leave-groom-children-transgenderism.html", "encoding": "UTF-8"}, "image": null, "domain": "www.gender.news", "title": "Pediatricians wants parents to leave the room while they groom children for transgenderism", "cleaned_text": "Pediatricians wants parents to leave the room while they groom children for transgenderism\n\nBefore bringing your young child to his or her next appointment with the pediatrician, you might want to first investigate what that medical professional believes about transgenderism.\n\nOne mother learned the hard way that her son’s pediatrician is an LGBTQP – the P stands for pedophile – pervert who attempted to groom the boy to “transition” into a “female.”\n\nAfter sending the boy’s mother out of the room for a private consultation with the underage boy, said pediatrician started probing the boy’s personal life. She told him, a ninth grader, to “use a condom” when he has sex, and also asked him if he is “comfortable with” his gender.\n\nTo be clear, the boy is a boy’s boy, meaning he loves sports, enjoys working on his body to make it stronger and more masculine, and as his mom says, is “obviously, and very apparently, comfortable with all aspects of boyhood.” Still, the boy’s pediatrician attempted to get him to question his “gender identity.”\n\n“Call me old-fashioned but giving a child hot tips on how to make the most of their sex life – and doing it in a room alone with the kid after kicking the parent out – sounds like grooming,” writes Peachy Keenan for The American Mind, a publication of The Claremont Institute.\n\nAccording to Keenan, she was told by the pediatrician that she had to leave the room so the pediatrician could ask her son about “drugs and alcohol.” Instead, the pediatrician took the opportunity to talk to the boy about sex and permanently altering his body to become a “girl.”\n\n“They already teach kids how to use sex toys and more in our American middle schools, so I shouldn’t have been shocked by this relatively benign doctor visit,” Keenan adds.\n\n“Some evil genius will soon launch a line of sex toys designed and marketed specifically for children. Size XXS anal plugs, with the letters of the alphabet on them for educational purposes. Maybe David Hogg can produce these after his pillow triumph!”\n\nA devout Catholic, Keenan says she taught her son well. He was actually more offended by the line of questioning surrounding wearing a condom than he was with being asked whether or not he is comfortable with his gender.\n\nAt the same time, not all young boys are as secure in their identities and as well-raised as Keenan’s son. Many of them become prey for the medical establishment, which is now being headed up federally by a mentally ill man who thinks that he is a “woman.”\n\nThis same mentally ill man, who was appointed by China Joe, warned last year that anyone in his home state of Pennsylvania who wanted to attend an orgy during the Wuhan coronavirus (Covid-19) lockdowns should be sure to wear a mask.\n\n“Fortunately there is a vaccine to the diseases inflicted on kids by a depraved culture and by their doctors,” Keenan concludes. “It’s painless, and there are no adverse side effects. Faith in God is the only thing that can stop them, I’m afraid. It’s corny, I know, but there is no other way, and it still might not be 100% effective. You can only fight great evil with something powerful enough to counter it.”\n\n“My son’s health was protected by this invisible and mighty force field. Parents, activate your force fields immediately, before it’s too late … And you might need a new doctor.”\n\nMore related news about the sexual abuse of children in America at the hands of the medical establishment can be found at Gender.news.", "opengraph": {"title": "Pediatricians wants parents to leave the room while they groom children for transgenderism", "type": "article", "url": "https://www.gender.news/2021-02-25-pediatricians-parents-leave-groom-children-transgenderism.html", "site_name": "Gender News", "description": "Before bringing your young child to his or her next appointment with the pediatrician, you might want to first investigate what that medical professional believes about transgenderism. One mother learned the hard way that her son’s pediatrician is an LGBTQP – the P stands for pedophile – pervert who attempted to groom the boy to […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/05/Female-Doctor-Woman.jpg"}, "tags": ["boys", "american medicine", "children", "perversion", "pediatrician", "LGBTQP", "medical establishment", "Pedophilia", "sexual harassment", "transgender", "corruption", "lgbtq"], "tweets": [], "movies": [], "links": ["https://americanmind.org/salvo/the-doctor-is-insane", "https://www.claremont.org/", "https://www.naturalnews.com/2019-11-07-austin-schools-teaching-anal-sex-children.html", "https://www.naturalnews.com/2018-12-13-mom-tried-to-force-transgenderism-onto-her-6-year-old-son-mental-disorder.html", "https://thenationalpulse.com/analysis/schweppe-bidens-hhs-pick-advocates-sex-changes-for-kids/", "https://www.naturalnews.com/2020-12-19-pennsylvania-warns-attending-orgy-without-mask-is-unsafe.html", "http://gender.news", "https://americanmind.org/salvo/the-doctor-is-insane", "https://www.naturalnews.com/2019-11-07-austin-schools-teaching-anal-sex-children.html", "https://www.naturalnews.com/2018-12-13-mom-tried-to-force-transgenderism-onto-her-6-year-old-son-mental-disorder.html", "https://thenationalpulse.com/analysis/schweppe-bidens-hhs-pick-advocates-sex-changes-for-kids/", "https://www.naturalnews.com/2020-12-19-pennsylvania-warns-attending-orgy-without-mask-is-unsafe.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2021-02-25-pediatricians-parents-leave-groom-children-transgenderism.html&linkname=Pediatricians%20wants%20parents%20to%20leave%20the%20room%20while%20they%20groom%20children%20for%20transgenderism", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}