{"result_id": "128001", "URL": "https://gender.news/2022-12-22-the-alarm-bells-go-off.html", "timestamp": "2023-04-25 15:13:44 CEST+0200", "meta": {"description": "Startling fact of the week: Twitter’s senior ranks of content moderators included over a dozen former FBI and CIA agents and analysts who let child porn run loose all over the app while surgically removing any utterance contradicting the government’s claim that mRNA “vaccines” are “safe and effective” — not to mention the effort this […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Tech,CIA,conspiracy,covid-19,culture wars,deception,Elon Musk,FBI,gay mafia,gender confused,Glitch,Government Slaves,left cult,lgbtq,pandemic,propaganda,tech giants,technocrats,Twitter,vaccine wars,vaccines,Yoel Roth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://gender.news/2022-12-22-the-alarm-bells-go-off.html", "encoding": "UTF-8"}, "image": null, "domain": "gender.news", "title": "The alarm bells go off", "cleaned_text": "The alarm bells go off\n\nStartling fact of the week: Twitter’s senior ranks of content moderators included over a dozen former FBI and CIA agents and analysts who let child porn run loose all over the app while surgically removing any utterance contradicting the government’s claim that mRNA “vaccines” are “safe and effective” — not to mention the effort this elite crew expended against anyone objecting to the Woke-Left’s race and gender hustles. Wouldn’t you like to know how much they were paid? Probably more than government work.\n\nHere’s another awful reality (better fasten your seatbelts): What also emerged in the tweet record of Yoel Roth, the company’s chief censor (former “Head of Trust and Safety”), begins to look like a gay mafia assault on the collective American psyche. Having gained official federal government sanction and protection, a statistically tiny homosexual demographic left in charge of the country’s main public forum has been out for revenge against their perceived enemy, political conservatives — Americans disinclined to join the cheerleading for drag queen story hours, “minor-attracted persons,” transsexuals in the military, and other LBGTQ cultural pranks.\n\nIn the process, that gay mafia running the public dialogue supported every lie that the government, its protector, put out, to keep the Deep State happy and well-fed. Shocking, I’m sure… but there it is. That means the gay mafia also helped promote the most-deadly psy-op in world history: the Covid-19 scare and the mass “vaccination” crusade that will end up killing many millions world-wide, after destroying the economies of the Western Civ nations. The whole package looks like an attempt to turn the world upside down and inside out. Is it any wonder that so many feel the USA has gone crazy?\n\nOf course, these revelations aroused the widespread suspicion that these now-exposed nefarious operators in social media were merely tools for some murky plutocrat elite led by the likes of the WEF, Bill Gates, and George Soros. Could that be the greatest “conspiracy theory” of all? More likely, I hesitate to suggest, all these characters in one way or another are merely tools of history itself, as the world enters the darkest days of a Fourth Turning secular winter. As T.S. Eliot observed: “Humankind cannot bear too much reality.”\n\nThus, so many sense we live in dangerous times. Everything appears to be veering out-of-control, including thought itself. Disorder incites more disorder. While all this madness is going on in-country, the US government, led by the phantom president “Joe Biden,” continues to prosecute its insane proxy war in Ukraine in order to antagonize Russia. Lately the US has sent drones hundreds of miles inside Russia to blow up military airfields. How is that not an escalation of hostilities, and exactly how far do the American people want their government to take this crazy project?\n\nNot a goshdarn inch further, the opinion polls indicate. We are apparently not quite so insane as to welcome nuclear annihilation, and we seem to recognize what might bring it on. And so, the dreadful realities of our time still stand before us, unmoved by all the mental illness they provoke, uninterested in our excuses for behaving so badly. Is there any way to face the hard facts? To incorporate them into a truth-based narrative that Western Civ can use to rescue itself from something that looks like suicide?\n\nElon Musk, alone, apart from, and in defiance of all the cowards running things in America —the corporate sell-outs, the craven college presidents, the bought-off politicians, the bad-faith media fabulists, the vindictive denizens of Hollywood — is moving to inject some therapeutic truth into the American lunatic asylum. He came out pretty hot over the weekend, branding Dr. Anthony Fauci as a criminal, calling for his prosecution, and promising the release of Twitter files that will demonstrate just how deceitfully the old Twitter acted in all the medical melodrama surrounding Covid-19 and the “vaccines.” On Sunday, Elon tweeted, “Now things get spicy.” Will the reveal of all that wickedness make any impression on half the people of this country still deranged by the many previous salvos of official propaganda? Maybe not all of them. Maybe only twenty percent. But that should be enough to tip the consensus of opinion in the right direction: a recognition of the harm that has been done… and the will to quit doing more of it.\n\nBeyond that, even, Elon has put the basic question to America: Are you in favor of free speech or not? Especially now that you know that “moderating” free speech is an invitation to live in lies. And lying all the time really does bend that old arc of history toward evil.", "opengraph": {"title": "The alarm bells go off", "type": "article", "url": "https://www.gender.news/2022-12-22-the-alarm-bells-go-off.html", "site_name": "Gender News", "description": "Startling fact of the week: Twitter’s senior ranks of content moderators included over a dozen former FBI and CIA agents and analysts who let child porn run loose all over the app while surgically removing any utterance contradicting the government’s claim that mRNA “vaccines” are “safe and effective” — not to mention the effort this […]", "image": "https://www.gender.news/wp-content/uploads/sites/165/2022/12/LGTB-Man-Beard-Rainbow-Flag-Paint-Cheek.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Elon Musk", "left cult", "deception", "gender confused", "Twitter", "lgbtq", "covid-19", "technocrats", "culture wars", "CIA", "propaganda", "Big Tech", "vaccine wars", "FBI", "tech giants", "Yoel Roth", "Glitch", "Government Slaves", "gay mafia", "vaccines"], "tweets": [], "movies": [], "links": ["https://kunstler.com/clusterfuck-nation/the-alarm-bells-go-off/", "https://kunstler.com/clusterfuck-nation/the-alarm-bells-go-off/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgendernews%2F2022-12-22-the-alarm-bells-go-off.html&linkname=The%20alarm%20bells%20go%20off", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}