{"result_id": "129011", "URL": "https://geoengineering.news/2022-09-30-wwf-scientist-vaccine-logic-flood-waters-covid.html", "timestamp": "2023-04-25 15:14:13 CEST+0200", "meta": {"description": "The solution to climate change is to adopt “vaccine thinking” for flood management, says Jeff Opperman, the global lead freshwater scientist at the World Wildlife Fund (WWF). In an op-ed he wrote for The Hill, Opperman argues that “deploying beneficial forms of flooding” to stop floods where we do not want them to occur is […]", "lang": "en", "keywords": "absurd,badclimate,badhealth,badmedicine,badscience,Climate,climate alarmism,climate change,climate nonsense,climate science,COVID,deception,environment,global warming,hurricane,Jeff Opperman,science deception,The Hill,Twisted,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-09-30-wwf-scientist-vaccine-logic-flood-waters-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "World Wildlife Fund scientist offers the worst hurricane advice ever, calling for “vaccine logic” to tame flood waters while ignoring mass vaccine DEATHS", "cleaned_text": "World Wildlife Fund scientist offers the worst hurricane advice ever, calling for “vaccine logic” to tame flood waters while ignoring mass vaccine DEATHS\n\nThe solution to climate change is to adopt “vaccine thinking” for flood management, says Jeff Opperman, the global lead freshwater scientist at the World Wildlife Fund (WWF).\n\nIn an op-ed he wrote for The Hill, Opperman argues that “deploying beneficial forms of flooding” to stop floods where we do not want them to occur is the same thing vaccines do by “tak[ing] something harmful (a virus) and use science to deploy a beneficial version of it to reduce risk and harm.”\n\nAll throughout the piece, Opperman compares the covid scamdemic and climate change to vaccine theory. At the start of his article, he even references a cartoon photo that was circulated back in early 2020 depicting the Fauci Flu “as a tsunami about to crash upon some country.”\n\n“The past two years have seen a string of record-breaking floods, including the recent inundation of one-third of Pakistan and other disasters bearing climate’s fingerprints,” Opperman writes.\n\nClimate’s fingerprints, eh? But it gets worse. Opperman also claims that concerning covid, there remains “one solid reason for hope” and that is the vaccines, which he says have thus far shown “durable performance in saving lives, even with variants.”\n\nWith an actual hurricane right now devastating Florida, Opperman’s piece about covid vaccines and climate change is a bit tone deaf, to say the least.\n\nIt is a diatribe of pseudoscientific nonsense and misused analogies that makes both Opperman and The Hill look crazy for even writing and publishing it in the first place.\n\nOpperman laments the fact that there “is no vaccine for climate change,” but success that there is a “powerful lesson” to be learned from vaccinology “as we try to minimize impacts triggered by an already changing climate.”\n\nHe believes that by “vaccinating” the climate through flood mitigation measures, we can stymie global warming in the same way that covid injections have put an end, in his view, to the plandemic.\n\nIn a way, Opperman is right. Trying to control the climate by “vaccinating” it using the methods he and others are proposing really is the same thing as trying to keep people healthy and alive with chemical injections – but not in the way he thinks.\n\nOne glaring omission in Opperman’s piece is his failure to address the prolific vaccine damage that is occurring all around the world. Millions upon millions of people are now permanently injured or dead because of the jabs, which do not work as claimed.\n\nSimilarly, trying to block out the sun or eliminate all carbon dioxide and nitrogen from the world threatens to destroy the planet, not save it.\n\nJust like vaccines, climate mitigation measures often cause more harm than good, even as their proponents control the narrative with an iron fist to try to keep the truth from escaping their grip.\n\nLeaving the planet alone instead of trying to reengineer it is the best course of action, just like leaving the immune system alone is better than continually trying to vaccinate it.\n\nIdeologies like those now being pushed by Opperman used to exist primarily within the realm of satire. Unfortunately in today’s world, they are becoming embedded in official government policy, to the detriment of our freedoms and liberties.\n\n“These things they’ve declared war on like carbon dioxide and sunlight are needed to sustain plant life, which in turn sustains us,” wrote a Natural News commenter about the climate insanity.\n\n“Any 5th grader knows that,” responded another. “Or used to.”\n\nThe latest news about rampant climate lunacy in the corporate-controlled media can be found at Climate.news.", "opengraph": {"title": "World Wildlife Fund scientist offers the worst hurricane advice ever, calling for “vaccine logic” to tame flood waters while ignoring mass vaccine DEATHS", "type": "article", "url": "https://www.geoengineering.news/2022-09-30-wwf-scientist-vaccine-logic-flood-waters-covid.html", "site_name": "GeoEngineering News", "description": "The solution to climate change is to adopt “vaccine thinking” for flood management, says Jeff Opperman, the global lead freshwater scientist at the World Wildlife Fund (WWF). In an op-ed he wrote for The Hill, Opperman argues that “deploying beneficial forms of flooding” to stop floods where we do not want them to occur is […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/Floating-Car-Flood-Water-Storm-Hurricane.jpg"}, "tags": ["Climate", "climate change", "hurricane", "science deception", "COVID", "vaccine", "absurd", "deception", "Twisted", "environment", "climate nonsense", "Jeff Opperman", "global warming", "climate science", "The Hill"], "tweets": [], "movies": [], "links": ["https://thehill.com/opinion/energy-environment/3663721-use-vaccine-logic-to-reduce-climates-flooding-harm/", "https://naturalnews.com/2022-08-02-wef-space-bubbles-blocking-sun-global-warming.html", "http://climate.news", "https://thehill.com/opinion/energy-environment/3663721-use-vaccine-logic-to-reduce-climates-flooding-harm/", "https://naturalnews.com/2022-08-02-wef-space-bubbles-blocking-sun-global-warming.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-09-30-wwf-scientist-vaccine-logic-flood-waters-covid.html&linkname=World%20Wildlife%20Fund%20scientist%20offers%20the%20worst%20hurricane%20advice%20ever%2C%20calling%20for%20%E2%80%9Cvaccine%20logic%E2%80%9D%20to%20tame%20flood%20waters%20while%20ignoring%20mass%20vaccine%20DEATHS", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}