{"result_id": "129032", "URL": "https://www.geoengineering.news/2022-10-12-us-government-manipulates-hurricanes-documentation-shows.html", "timestamp": "2023-04-25 15:14:25 CEST+0200", "meta": {"description": "Believe it or not, evidence exists to suggest that the United States government – or at least those who have co-opted and now control it – has the ability to create and steer weather, including hurricanes. Educator and activist Peggy Hall uploaded a video – watch below – discussing what she was able to uncover […]", "lang": "en", "keywords": "air force,big government,Climate,climate science,disaster,energy weapons,environ,General Electric,geoengineering,Hurricanes,manipulation,national security,Peggy Hall,Project Cirrus,weapons technology,weather,Weather Manipulation,weather terrorism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2022-10-12-us-government-manipulates-hurricanes-documentation-shows.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "US government has ability to manipulate hurricanes, 50-year-old documentation shows", "cleaned_text": "US government has ability to manipulate hurricanes, 50-year-old documentation shows\n\nBelieve it or not, evidence exists to suggest that the United States government – or at least those who have co-opted and now control it – has the ability to create and steer weather, including hurricanes.\n\nEducator and activist Peggy Hall uploaded a video – watch below – discussing what she was able to uncover from government archives. Documents dating back 50 years or more point to technologies with the capacity to manipulate large storms.\n\nThe Department of the Navy, the Department of the Air Force and General Electric all have a hand in this, Hall says. A paper published by General Electric entitled “History of Project Cirrus from 1947 to 1952” outlines how cloud particles and modifications are used to affect hurricanes.\n\nHall often talks about geoengineering and chemtrails on her channel, as well as about wildfires, some of which she claims are manipulated using directed energy weapons, or DEWs.\n\nIn this particular video, she explains that government weather manipulation is used to instill fear, uncertainty and hardship on people in order to put them under the control of the Federal Emergency Management Agency (FEMA).\n\nIn some cases, the government might even steer hurricanes towards certain areas as political retaliation. Could this be why Hurricane Ian struck Florida, a state that bucked the Wuhan coronavirus (Covid-19) scamdemic, including the so-called “vaccines?”\n\nSeveral additional links to more information about Project Cirrus and other government weather modification programs can be found at NeedToKnow.news.\n\nCloud seeding and the injection of aerosols into the sky is something that has increasingly taken center stage, even in official reporting from mainstream sources.\n\nJust recently, we reported about how the World Economic Forum (WEF) was caught bragging about cloud-seeding “chemtrail” operations in communist China.\n\nEarlier in the year, we reported about how domestic cloud seeding operations were being deployed in New Mexico to try to create more rain over dry land.\n\nIt is not out of the question to conclude that if the powers that be are capable of doing all this that they are also capable of strengthening or even weakening storms, or steering them to certain locations.\n\nPerhaps there are even weather weapons being used by one country against another for warfare purposes. Instead of launching missiles or ground attacks like in the days of old, maybe the modern weaponry of today is used to deprive a target nation of rain for its crops and reservoirs – or maybe to blast it with too much rain to create flooding.\n\n“I am thinking they can steer a hurricane by tactically seeding certain quadrants of the storm,” wrote a commenter in speculation. “They can make it veer left or right and stall it to some degree.”\n\n“Apparently the U.S. military was doing this to the Vietcong in monsoon season to dump ungodly amounts of rain on them over the trail. They could not create a monsoon but they could make it dump its rain where they wanted it.”\n\nAnother wrote that there is the capacity to both steer and create storms using silver oxide, and that this has been possible for at least the past 50 years – this is all just speculation, of course.\n\n“It’s an open secret: In 2005, Hurricane Katrina gained strength over cooler water,” suggested someone else.\n\n“Most climate scientists know the technology exists to manipulate the weather,” wrote another.\n\nNot everyone believes that all of this is true, however. One person expressed skepticism about the government’s seemingly “all-powerful” technologies, suggesting that it could just be a ruse to maintain control over the masses through the power of suggestion.\n\nMore related news about weather control can be found at Geoengineering.news.", "opengraph": {"title": "US government has ability to manipulate hurricanes, 50-year-old documentation shows", "type": "article", "url": "https://www.geoengineering.news/2022-10-12-us-government-manipulates-hurricanes-documentation-shows.html", "site_name": "GeoEngineering News", "description": "Believe it or not, evidence exists to suggest that the United States government – or at least those who have co-opted and now control it – has the ability to create and steer weather, including hurricanes. Educator and activist Peggy Hall uploaded a video – watch below – discussing what she was able to uncover […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/10/Hurricane-America-Florida.jpg"}, "tags": ["weather", "geoengineering", "manipulation", "big government", "Climate", "Hurricanes", "Weather Manipulation", "weather terrorism", "national security", "air force", "disaster", "weapons technology", "environ", "Peggy Hall", "General Electric", "energy weapons", "climate science", "Project Cirrus"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/pVaI51VnPlw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/pVaI51VnPlw"}], "links": ["https://newspunch.com/the-us-government-has-admitted-to-manipulating-hurricanes/", "https://needtoknow.news/2022/10/project-cirrus-evidence-of-weather-manipulation-including-hurricanes-by-the-govt/", "https://naturalnews.com/2022-08-11-wef-china-controlling-weather-cloud-seeding-chemtrails.html", "https://naturalnews.com/2022-05-25-government-approves-cloud-seeding-new-mexico-rainfall.html", "http://geoengineering.news", "https://newspunch.com/the-us-government-has-admitted-to-manipulating-hurricanes/", "https://www.youtube.com/watch?v=pVaI51VnPlw&t=133s", "https://needtoknow.news/2022/10/project-cirrus-evidence-of-weather-manipulation-including-hurricanes-by-the-govt/", "https://naturalnews.com/2022-08-11-wef-china-controlling-weather-cloud-seeding-chemtrails.html", "https://naturalnews.com/2022-05-25-government-approves-cloud-seeding-new-mexico-rainfall.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-10-12-us-government-manipulates-hurricanes-documentation-shows.html&linkname=US%20government%20has%20ability%20to%20manipulate%20hurricanes%2C%2050-year-old%20documentation%20shows", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}