{"result_id": "129016", "URL": "https://geoengineering.news/2022-12-05-solve-climate-crisis-biotechnology-fools-errand-academic.html", "timestamp": "2023-04-25 15:14:15 CEST+0200", "meta": {"description": "The only way to stop the climate from changing, say fanatics, is to ban oil, gas, meat, and freedom, as well as continue developing new forms of biotechnology to replace nature. Does this make any sense to you? Because it certainly does not to University of Canterbury (New Zealand) academics Tessa Hiscox and Prof. Jack […]", "lang": "en", "keywords": "academia,biotech,biotechnology,cancel culture,Climate,climate alarmism,climate change,Collapse,environment,extremism,future tech,global warming,green tyranny,hoax,left cult,pollution,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-12-05-solve-climate-crisis-biotechnology-fools-errand-academic.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Trying to solve “climate crisis” with more biotechnology is a fool’s errand, say academics", "cleaned_text": "Trying to solve “climate crisis” with more biotechnology is a fool’s errand, say academics\n\nThe only way to stop the climate from changing, say fanatics, is to ban oil, gas, meat, and freedom, as well as continue developing new forms of biotechnology to replace nature. Does this make any sense to you? Because it certainly does not to University of Canterbury (New Zealand) academics Tessa Hiscox and Prof. Jack Heinemann.\n\nIn an article they co-wrote that was published on November 29, Hiscox and Heinemann explained that the biotech approach to global warming “delays real progress.” This “technology push,” as they call it, will more than likely fail because the “pipeline for salvation technology is long and the benefit is hypothetical.”\n\n“Like the character Wimpy from Popeye, technology developers want their hamburger today but will pay back society with climate solutions on some future Tuesday,” the paper reads. (Related: Climate fanatics support censorship because they know their arguments collapse whenever challenged.)\n\nTo throw more biotech at the situation only addresses the symptoms of climate change, the paper further purports. It does nothing to address the root cause of “environmental degradation,” which ironically enough is caused, in part, by biotech “solutions” such as genetically modified (GMO) crops sprayed with noxious chemicals.\n\nMuch of the earth is already profusely saturated with all that biotech poison, and now the climate brigade wants more of it to be developed as a fix. It is nonsensical, and yet it is the best way forward, we are told.\n\nClimate fanaticism should not be paid for by taxpayers\n\nWhile there is something to be said for technological adaptation to unexpected or undesired changes to our world, it is almost always better to try to work with nature and adapt to its changes rather than to try to change nature to adapt to what some climate extremist wants.\n\nTruth be told, there is no such thing as man-made climate change and the world is not in a crisis – at least not a crisis that can be fixed by humans. Those claiming it can are in pursuit of grant money, or perhaps they simply belong to the Cult of Climate Change and want to force their religion upon the world for personal reasons.\n\nWhatever the case may be, Hiscox and Heinemann are right: biotech is not the answer. And those who think it is should not be receiving any money from taxpayers to explore their ridiculous pursuits.\n\n“University of Canterbury academics Tessa Hiscox and Professor Jack Heinemann to biotech: Get your own corporate sugar Daddy. Don’t be poaching off our ‘Big Government,'” joked one commenter, making a very good point about what the paper suggests.\n\n“Anything can solve a non-existent problem,” wrote another, referring to the hoax of man-made climate change.\n\nNumerous others made similar comments about how there is simply no evidence of a climate crisis, no matter how much fearmongering is injected into the conversation.\n\n“What climate crisis? Someone come forth and tell all of us here what it is we have so wrong. And if you are unable to do so, then stop with this climate crisis nonsense,” one of them wrote.\n\n“I agree there is no evidence we are experiencing a climate crisis,” responded another. “But climate claims are wrong on many levels, and sometimes it’s fun to point out the flaws in their argument on their own terms, rather than simply repeatedly pointing out the absurdity of claims that we are currently experiencing any kind of climate problem.”\n\nSomeone else interjected that the idea of “green” or “renewable” energy is also a farce as producing electric vehicle batteries, solar panels, and windmills requires plenty of “dirty” energy.\n\nThe latest news about the man-made climate change hoax can be found at Climate.news.", "opengraph": {"title": "Trying to solve “climate crisis” with more biotechnology is a fool’s errand, say academics", "type": "article", "url": "https://www.geoengineering.news/2022-12-05-solve-climate-crisis-biotechnology-fools-errand-academic.html", "site_name": "GeoEngineering News", "description": "The only way to stop the climate from changing, say fanatics, is to ban oil, gas, meat, and freedom, as well as continue developing new forms of biotechnology to replace nature. Does this make any sense to you? Because it certainly does not to University of Canterbury (New Zealand) academics Tessa Hiscox and Prof. Jack […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/12/Analysis-Analyze-Beaker-Biochemistry-Biology-Biotechnology-Bottle.jpg"}, "tags": ["cancel culture", "Climate", "biotechnology", "climate change", "extremism", "Collapse", "future tech", "hoax", "left cult", "woke", "environment", "biotech", "green tyranny", "global warming", "academia"], "tweets": [], "movies": [], "links": ["https://wattsupwiththat.com/2022/11/30/academics-slam-claims-biotech-could-help-with-climate-change/", "https://www.canterbury.ac.nz/", "https://naturalnews.com/2022-10-04-climate-scientists-call-for-ban-dissenting-views.html", "http://climate.news", "https://wattsupwiththat.com/2022/11/30/academics-slam-claims-biotech-could-help-with-climate-change/", "https://naturalnews.com/2022-10-04-climate-scientists-call-for-ban-dissenting-views.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-12-05-solve-climate-crisis-biotechnology-fools-errand-academic.html&linkname=Trying%20to%20solve%20%E2%80%9Cclimate%20crisis%E2%80%9D%20with%20more%20biotechnology%20is%20a%20fool%E2%80%99s%20errand%2C%20say%20academics", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}