{"result_id": "129026", "URL": "https://www.geoengineering.news/2018-02-07-geoengineering-was-labeled-a-conspiracy-theory-now-its-routinely-cited-in-science-papers-climate-change.html", "timestamp": "2023-04-25 15:14:21 CEST+0200", "meta": {"description": "When Natural News first started talking about geoengineering several years back, some people accused us of spreading baseless “conspiracy theories.” Fast-forward to 2018, however, and discussion of “chemtrails,” as many people call them, has become mainstream, as studies like this one not only openly admit that the spraying of our skies is, indeed, happening, but […]", "lang": "en", "keywords": "badclimate,Censored Science,chemtrails,climate change,conspiracy,conspiracy theory,deception,geoengineering,global warming,government,lies,science,weather control,Weather modification,weird science", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2018-02-07-geoengineering-was-labeled-a-conspiracy-theory-now-its-routinely-cited-in-science-papers-climate-change.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "Remember when geoengineering was labeled a “conspiracy theory?” … Now it’s routinely cited in science papers as a strategy for saving the climate", "cleaned_text": "Remember when geoengineering was labeled a “conspiracy theory?” … Now it’s routinely cited in science papers as a strategy for saving the climate\n\nWhen Natural News first started talking about geoengineering several years back, some people accused us of spreading baseless “conspiracy theories.” Fast-forward to 2018, however, and discussion of “chemtrails,” as many people call them, has become mainstream, as studies like this one not only openly admit that the spraying of our skies is, indeed, happening, but further claim that it’s being done to prevent “climate change.”\n\nIn this study, scientists from the Potsdam Institute for Climate Impact Research in Germany discuss – as if it’s no big deal – the concept of atmospheric energy technologies that have the capacity to pull carbon dioxide from the atmosphere and sequester it in the ground. Known as bioenergy combined with carbon capture and storage, or BECCS, the idea is to burn trees and other organic matter in order to capture carbon dioxide from the atmosphere, which supposedly leads to a net removal of “damaging” greenhouse gases.\n\nThough the paper doesn’t specifically discuss airplanes lacing the skies with a tapestry of aluminum, barium, and other particulates supposedly designed to block out the sun’s “damaging” rays, it does deal with the issue of intentionally altering climate conditions in order to counter or reverse what some perceive as the damaging effects of global warming – which is, in essence, the foundational concept and alleged purpose behind geoengineering.\n\nThis research, however, doesn’t require any reading between the lines. Researchers from Harvard University published a paper last spring discussing “small-scale atmospheric experiments” that they touted as a method of combating climate change.\n\nProfessors David Keith and Frank Keutsch reportedly plan at some point in 2018 to launch a high-altitude, gondola-tethered balloon equipped with propellers and sensors. Known as the “StratoCruiser,” this device will “spray a fine mist of materials such as sulfur dioxide, alumina, or calcium carbonate into the stratosphere” for the purpose of “measur[ing] the reflectivity of the particles, the degree to which they disperse or coalesce, and the way they interact with other compounds in the atmosphere.”\n\nPowerful groups have been talking about chemtrails for at least the past decade\n\nDuring an interview with MIT Technology Review, Keith explained that one of the goals of these experiments is to more intently study what’s known as “solar radiation management,” which is just a fancy way of describing the use of tiny metal particulates to reflect solar radiation back into space, and away from the earth – in order to keep it “cool,” of course. His colleague, Keutsch, actually wrote this in a separate paper, stating that such a process “may cool the planet while simultaneously repairing the ozone layer.”\n\nBut wait – isn’t that what Natural News and other independent media outlets have been saying all along? Back in 2016, for instance, we reported that NASA actually admitted to putting lithium chemicals in rocket exhaust in order to intentionally disperse it throughout the upper atmosphere. A paper published in 2003 also speaks of “aerosolized vaccines,” or chemtrail “medicines,” that can be blasted into the sky to quickly “immunize” large populations of people.\n\nIn 2008, the globalist group known as the Council on Foreign Relations (CFR) sponsored a symposium in San Diego where aerosol spraying from airplanes was openly discussed. It was specifically mentioned at this event how aluminum can be blasted into the stratosphere to help “shield” the earth from the sun, and thus prevent global warming.\n\nIndependent testing has further confirmed the presence of chemtrail toxins throughout the environment, including aluminum-coated fiberglass, radioactive thorium, nickel, mold spores, various fungal mycotoxins, ethylene dibromide, and even blood cells.\n\nThere’s so much evidence out there to suggest that chemtrails are not only real, but also happening on an almost daily basis all around the world. And yet, a quick internet search for chemtrail science or evidence still pulls up all sorts of mainstream propaganda claiming that chemtrails are a wild “conspiracy theory” that people with tinfoil hats are making up simply for attention, or something.\n\nOne has to wonder how these same media outlets explain a United States government patent from 1975 for “powdered contrails,” which obviously aren’t the innocuous ice crystals that chemtrail deniers insist are blanketing the skies and blocking out the sun these days. Believe it or not, the word “chemtrails” actually appears in government documents – even though they “don’t exist,” according to the experts.\n\nBelieve it or not, a U.S. Air Force Academy (USAF) training manual from 1990 actually contains the word “chemtrails” in its title, with further information inside about atmospheric spraying. More recently, an Environmental Protection Agency (EPA) whistleblower was even fired for trying to raise awareness about how aluminum in atmospheric geoengineering is harming the planet.\n\n“Our government continues to radically ramp up its all out assault on the environment and thus on civilian populations,” comments Dane Wigington, author of GeoengineeringWatch.org. “How much longer till the breaking point of total collapse?”", "opengraph": {"title": "Remember when geoengineering was labeled a “conspiracy theory?” … Now it’s routinely cited in science papers as a strategy for saving the climate", "type": "article", "url": "https://www.geoengineering.news/2018-02-07-geoengineering-was-labeled-a-conspiracy-theory-now-its-routinely-cited-in-science-papers-climate-change.html", "site_name": "GeoEngineering News", "description": "When Natural News first started talking about geoengineering several years back, some people accused us of spreading baseless “conspiracy theories.” Fast-forward to 2018, however, and discussion of “chemtrails,” as many people call them, has become mainstream, as studies like this one not only openly admit that the spraying of our skies is, indeed, happening, but […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2019/05/chemtrail.jpg"}, "tags": ["conspiracy", "conspiracy theory", "geoengineering", "chemtrails", "climate change", "government", "lies", "science", "weather control", "Weather modification", "weird science", "deception", "global warming", "Censored Science"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2018-01-30-climate-altering-technology-carbon-dioxide-could-cause-catastrophic-destruction.html", "https://www.pik-potsdam.de/pik-frontpage", "https://www.technologyreview.com/s/603974/harvard-scientists-moving-ahead-on-plans-for-atmospheric-geoengineering-experiments/", "http://harvard.edu", "https://www.naturalnews.com/055183_chemtrails_NASA_lithium.html", "https://www.ncbi.nlm.nih.gov/pubmed/12656420", "https://www.naturalnews.com/032572_chemtrails_health.html", "https://www.naturalnews.com/2016-11-04-chemtrails-study-found-aluminum-barium-and-titanium-metals-in-human-brains.html", "https://www.naturalnews.com/2018-01-21-are-chemtrails-real-a-look-at-the-facts.html", "http://www.geoengineeringwatch.org/category/breaking-news/", "http://GeoengineeringWatch.org", "https://www.naturalnews.com/2018-01-30-climate-altering-technology-carbon-dioxide-could-cause-catastrophic-destruction.html", "https://www.technologyreview.com/s/603974/harvard-scientists-moving-ahead-on-plans-for-atmospheric-geoengineering-experiments/", "https://www.naturalnews.com/055183_chemtrails_NASA_lithium.html", "https://www.ncbi.nlm.nih.gov/pubmed/12656420", "https://www.naturalnews.com/032572_chemtrails_health.html", "https://www.naturalnews.com/2018-01-21-are-chemtrails-real-a-look-at-the-facts.html", "http://www.geoengineeringwatch.org/category/breaking-news/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2018-02-07-geoengineering-was-labeled-a-conspiracy-theory-now-its-routinely-cited-in-science-papers-climate-change.html&linkname=Remember%20when%20geoengineering%20was%20labeled%20a%20%E2%80%9Cconspiracy%20theory%3F%E2%80%9D%20%E2%80%A6%20Now%20it%E2%80%99s%20routinely%20cited%20in%20science%20papers%20as%20a%20strategy%20for%20saving%20the%20climate", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}