{"result_id": "129001", "URL": "https://geoengineering.news/2022-10-05-adams-wigington-hurricane-may-have-been-weaponized.html", "timestamp": "2023-04-25 15:14:05 CEST+0200", "meta": {"description": "Geoengineering expert Dane Wigington and the Health Ranger Mike Adams talked about the weaponization of Hurricane Ian and the threat of geoengineering to humanity during a recent emergency episode of the “Health Ranger Report.” Adams said Hurricane Ian’s movement was “not natural looking” as it entered the southwestern part of Florida, stopped, turned east and headed […]", "lang": "en", "keywords": "big government,climate engineering,climate science,Dane Wigington,Florida,food collapse,food supply,geoengineering,Hurricane Harvey,Hurricane Ian,Hurricane Sandy,national security,United States,vapor pressure deficit,weapons technology,weather control,weather terrorism,weather warfare", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-10-05-adams-wigington-hurricane-may-have-been-weaponized.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Health Ranger Report: Mike Adams and geoengineering expert Dane Wigington discuss how Hurricane Ian may have been WEAPONIZED", "cleaned_text": "Health Ranger Report: Mike Adams and geoengineering expert Dane Wigington discuss how Hurricane Ian may have been WEAPONIZED\n\nGeoengineering expert Dane Wigington and the Health Ranger Mike Adams talked about the weaponization of Hurricane Ian and the threat of geoengineering to humanity during a recent emergency episode of the “Health Ranger Report.”\n\nAdams said Hurricane Ian’s movement was “not natural looking” as it entered the southwestern part of Florida, stopped, turned east and headed north. Hurricane Ian may have been weaponized.\n\nWigington said frequency transmissions can be used to repel the storm in different directions, and that is how it is steered or maneuvered. The founder and lead researcher of GeoEngineeringWatch.org added that the same thing happens with other storms such as Hurricane Sandy, which climate engineers knew a week in advance was going to make an unprecedented left-westerly turn.\n\nThe geoengineering expert and executive producer of climate engineering documentary film “The Dimming” noted that storms can be easily manipulated these days.\n\n“In the case of Hurricane Ian, it was just a drifting mass of unorganized convection and that makes the storm much easier for them to steer until it gets closer to the land-based transmitters. So, until it got south of Cuba, it basically was completely unorganized,” Wigington explained.\n\n“And then with ionosphere heaters, they can affect the convection that allows the storm to start forming and strengthening, which it did right before it hit Cuba as it migrated northward by the southern end of Florida. The transmitter in Key West is part of the Next Red Transmitter Network.\n\n“When they saturate the air mass full of electrically conductive particles, that’s part of climate engineering. Those particles can be moved and repelled by the transmissions if you’re repelling the particles that are saturating that air mass.\n\n“Repel the air mass, you’ll repel the storm. And they can maneuver those storms, steer them where they want to go. They deenergize the transmitters on the side that they want the storm to migrate to, so they are not being repelled.”\n\nAdams noted that with the measured transmission of the repelling force, climate engineers can freeze the movement of a storm, let it hover and stay over a certain area while dropping an enormous amount of rain. Wigington said that was what they did in the case of Hurricane Harvey, which dropped a massive amount of rain in Texas.\n\nAdams related that Hurricane Ian devastated Central Florida, affecting a company producing 50 percent of the pelletized phosphate fertilizer for North America and 12 percent of the phosphate fertilizers for the world.\n\nAccording to Wigington, vapor pressure deficit or VPD is a massive factor that is stunting the growth of trees and crops. He noted that climate change groups and narratives have failed to address climate intervention.\n\nWigington went on to say that geoengineering is the single most destructive human activity of all, and the greatest and most immediate threat humanity is collectively facing. (Related: The Dr. Ardis Show: Geoengineering expert Dane Wigington says climate engineering is the single most destructive human activity – Brighteon.TV.)\n\n“People are inhaling the elements coming down in precipitation such as nontoxic elements along with aluminum, barium, strontium, manganese, polymer fibers and graphene,” Wigington said. “Polymer fibers and graphene are capable of acting as biological carriers to disperse a pathogen from the cloud to the ground and these are some of the threats that are contained in what is happening in the skies.”\n\nAdams pointed out that the weaponization of the weather system has led to civilian infrastructure being targeted, causing mass starvation and famine in some parts of the world.\n\nFollow Geoengineering.news for more news about geoengineering and climate engineering.\n\nWatch the video below to know more about the weaponization of hurricanes and destruction of the biosphere.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nUS military possesses advanced technology that can cause typhoons, earthquakes, floods and droughts.\n\nWeather weapons are targeting human infrastructure, aiming for Extinction Level Event (ELE) via mass famine and collapse.\n\nClimate engineering: Weapon that can bring populations to their knees without them knowing they’re under attack.\n\nDane Wigington exposes the globalist geoengineering weather control agenda in fascinating interview with the Health Ranger.\n\nWeather modification programs have been run by the US government since 1953.", "opengraph": {"title": "Health Ranger Report: Mike Adams and geoengineering expert Dane Wigington discuss how Hurricane Ian may have been WEAPONIZED", "type": "article", "url": "https://www.geoengineering.news/2022-10-05-adams-wigington-hurricane-may-have-been-weaponized.html", "site_name": "GeoEngineering News", "description": "Geoengineering expert Dane Wigington and the Health Ranger Mike Adams talked about the weaponization of Hurricane Ian and the threat of geoengineering to humanity during a recent emergency episode of the “Health Ranger Report.” Adams said Hurricane Ian’s movement was “not natural looking” as it entered the southwestern part of Florida, stopped, turned east and headed […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/10/Hurricane-Storm-Cyclone-Weather.jpg"}, "tags": ["Dane Wigington", "climate engineering", "big government", "geoengineering", "vapor pressure deficit", "weather terrorism", "weather control", "national security", "Florida", "food collapse", "weather warfare", "weapons technology", "food supply", "Hurricane Ian", "climate science", "Hurricane Harvey", "United States", "Hurricane Sandy"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/4caaaab6-2b28-4cbc-ac64-929ee4b94d9e", "http://www.geoengineeringwatch.org/ads/dane-wigington/", "http://GeoEngineeringWatch.org", "http://weathercontrol.news", "https://www.weather.gov/hgx/hurricaneharvey", "https://naturalnews.com/2022-06-07-climate-engineering-single-most-destructive-human-activity.html", "https://geoengineering.news", "http://www.brighteon.com/4caaaab6-2b28-4cbc-ac64-929ee4b94d9e", "http://www.brighteon.com/channels/hrreport", "https://geoengineering.news/2022-09-07-us-military-technology-typhoons-earthquakes-floods-droughts.html", "https://naturalnews.com/2022-09-30-weather-weapons-are-targeting-human-infrastructure-extinction.html", "https://naturalnews.com/2022-02-04-climate-engineering-can-bring-populations-down.html", "https://naturalnews.com/2017-09-21-dane-wigington-exposes-the-globalist-geoengineering-weather-control-agenda-in-fascinating-interview-with-the-health-ranger.html", "https://naturalnews.com/2017-05-10-weather-modification-programs-have-been-run-by-the-us-government-since-1953.html", "https://www.brighteon.com/4caaaab6-2b28-4cbc-ac64-929ee4b94d9e", "http://www.geoengineeringwatch.org/ads/dane-wigington/", "https://www.weather.gov/hgx/hurricaneharvey", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-10-05-adams-wigington-hurricane-may-have-been-weaponized.html&linkname=Health%20Ranger%20Report%3A%20Mike%20Adams%20and%20geoengineering%20expert%20Dane%20Wigington%20discuss%20how%20Hurricane%20Ian%20may%20have%20been%20WEAPONIZED", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}