{"result_id": "129004", "URL": "https://www.geoengineering.news/2022-09-13-satellite-imagery-agriculture-wasteland-rice-capital-california.html", "timestamp": "2023-04-25 15:14:08 CEST+0200", "meta": {"description": "What was once a thriving agricultural oasis brimming with bounty – a food-growing trophy of abundance, you might say – has become an “agricultural wasteland.” We are talking about California’s Central Valley, and specifically the portion dubbed the rice capital of California. There, the latest satellite imagery shows a “mini dust bowl,” according to experts. […]", "lang": "en", "keywords": "agriculture,Alt-Left,big government,California,Collapse,collapsifornia,crops,drought,famine,food collapse,food inflation,food supply,harvest,inflation,mini dust bowl,rice,starvation,wasteland,Water Wars,weather terrorism,world agriculture", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2022-09-13-satellite-imagery-agriculture-wasteland-rice-capital-california.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "Satellite imagery shows “agriculture wasteland” across the rice capital of California", "cleaned_text": "Satellite imagery shows “agriculture wasteland” across the rice capital of California\n\nWhat was once a thriving agricultural oasis brimming with bounty – a food-growing trophy of abundance, you might say – has become an “agricultural wasteland.”\n\nWe are talking about California’s Central Valley, and specifically the portion dubbed the rice capital of California. There, the latest satellite imagery shows a “mini dust bowl,” according to experts.\n\nKurt Richter, a third-generation rice farmer from Colusa, the heart of California’s rice capital, told the San Francisco Chronicle that many formerly abundant fields are now a massive “wasteland” of dry ground and nothing, in part due to drought.\n\nThe other part, as we reported previously, is deliberate mismanagement of this precious natural resource by the corrupt political class in the Golden State.\n\nThe United States Department of Agriculture (USDA) estimates that of the 550,000 acres that encompass California’s rice capital, an astounding 300,000 – more than half – will go without a harvest this year.\n\n“This could potentially drive up sushi prices nationwide because most of the rice produced in the state is for just that,” one report explains.\n\nAccording to Richter, many fields that even just last year were producing rice have been “abandoned” by farmers. These farmers either could not receive the water they needed to grow this year or were paid by the federal government to stop growing.\n\nAaron Smith, an agricultural economist at UC Davis, warns that farmer losses in the region could top $500 million, about 40 percent of which will be covered by federal crop insurance.\n\nScorching heat, lack of rain and the continued waste of freshwater resources that are pumped into the ocean rather than into crop fields is quickly turning California’s premiere growing regions into a chapter out of The Grapes of Wrath – and few people out there seem to be aware of what is actually happening and what it means for the future of the food supply.\n\nOnly two of California’s six top-producing rice counties will be unharmed by “mega drought”\n\nOne bit of good news in all this is that nearby Butte County, another California growing region, planted more rice this year than last year, which could help make up for some of the deficit.\n\n“Butte County farmers planted slightly more acres of rice than last year,” the Chronicle reported, along with satellite imagery depicting lots of green right now in that area.\n\nGrowing rice, it turns out, is a particularly water-intensive operation. Those farms located closer to water have naturally fared better than those in areas where water is scarce or where state government officials have decided not to saturate.\n\nButte County, unfortunately, is an exception to the regional trend. While it and nearby Yuba County are expected to have slightly larger rice harvests this year, the four other counties that make up the rice-growing capital – Colusa, Glenn, Sutter, and Yolo – are all expected to see massive deficits.\n\nColusa is in the worst shape with an expected 73.4 percent reduction in outputs, followed by Glenn with a 66.9 percent reduction; Sutter with a 33.6 percent reduction; and Yolo with a 33.2 percent reduction.\n\nAll of these counties are located in the northern portion of California’s Central Valley, which is massive and stretches from the southeastern part of the state up through the northwestern part, almost smack-dab in the middle of the state’s borders.\n\n“Here’s a novel idea: how about people put aside their petty differences and force the government to stop its dangerous geoengineering activity,” wrote a commenter about another major factor that is affecting weather patterns: chemtrails.\n\n“With normal winters, there should be plenty of water for farming.”\n\nThe latest news about the engineered destruction of America’s food supply can be found at Geoengineering.news", "opengraph": {"title": "Satellite imagery shows “agriculture wasteland” across the rice capital of California", "type": "article", "url": "https://www.geoengineering.news/2022-09-13-satellite-imagery-agriculture-wasteland-rice-capital-california.html", "site_name": "GeoEngineering News", "description": "What was once a thriving agricultural oasis brimming with bounty – a food-growing trophy of abundance, you might say – has become an “agricultural wasteland.” We are talking about California’s Central Valley, and specifically the portion dubbed the rice capital of California. There, the latest satellite imagery shows a “mini dust bowl,” according to experts. […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/Desert-Dry-Lake-Land-Drought.jpg"}, "tags": ["big government", "wasteland", "crops", "starvation", "food collapse", "harvest", "rice", "famine", "world agriculture", "mini dust bowl", "Water Wars", "food inflation", "Alt-Left", "agriculture", "collapsifornia", "Collapse", "inflation", "drought", "food supply", "weather terrorism", "California"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/weather/satellite-image-reveals-agriculture-wasteland-across-californias-rice-capital", "https://naturalnews.com/2022-05-31-engineered-famine-california-deprives-farmers-of-water.html", "http://www.ucdavis.edu", "http://Geoengineering.news", "https://www.zerohedge.com/weather/satellite-image-reveals-agriculture-wasteland-across-californias-rice-capital", "https://naturalnews.com/2022-05-31-engineered-famine-california-deprives-farmers-of-water.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-09-13-satellite-imagery-agriculture-wasteland-rice-capital-california.html&linkname=Satellite%20imagery%20shows%20%E2%80%9Cagriculture%20wasteland%E2%80%9D%20across%20the%20rice%20capital%20of%20California", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}