{"result_id": "129029", "URL": "https://www.geoengineering.news/2019-09-20-chemtrails-conspiracy-theory-to-save-planet.html", "timestamp": "2023-04-25 15:14:23 CEST+0200", "meta": {"description": "The mainstream media has made a radical departure away from vehement chemtrail denialism into systematic chemtrail embrace, and the question remains as to why the climate “deep state” has suddenly decided to show its cards. Geoengineering, which was long dubbed a “conspiracy theory” by the narrative gatekeepers, has suddenly become not just a thing, but […]", "lang": "en", "keywords": "badclimate,badpollution,badscience,bill gates,Bill Nye,chemical warfare,chemtrails,Climate,climate change,climate hysteria,climate science,Collapse,Collusion,conspiracy,conspiracy theory,extinction,food supply,genocide,geoengineering,geogenocide,global warming,globalist agenda,mainstream media,Neil deGrasse Tyson,population control,Weather modification", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2019-09-20-chemtrails-conspiracy-theory-to-save-planet.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "Same media that once deemed chemtrails a conspiracy theory now openly promotes chemtrailing the entire planet to “end climate change”", "cleaned_text": "Same media that once deemed chemtrails a conspiracy theory now openly promotes chemtrailing the entire planet to “end climate change”\n\nThe mainstream media has made a radical departure away from vehement chemtrail denialism into systematic chemtrail embrace, and the question remains as to why the climate “deep state” has suddenly decided to show its cards.\n\nGeoengineering, which was long dubbed a “conspiracy theory” by the narrative gatekeepers, has suddenly become not just a thing, but the thing that will supposedly provide the solution to “climate change” and “global warming.” But is this really the true purpose of chemtrails?\n\nJust as Mike Adams, the Health Ranger, long warned, the geoengineering conspiracy would one day be exposed and make its way into the mainstream, but under false pretenses – and that’s exactly what appears to be happening.\n\nGeoengineering is real, they’re now admitting, and it’s for the good of the planet. But the truth is that the chemtrail agenda is a nefarious tool that the “elite” are using as a means of weather control, and thus population control.\n\nWhile it’s somewhat encouraging to see that what we and others have long warned about is, in fact, turning out to be everything we said it was, the revelation of this to the general public suggests that the globalists are much further along in fulfilling their agenda than many people probably think.\n\nFor more related news about the climate conspiracy, be sure to check out Climate.news.\n\nClimate scientists are absolutely mad, and their agenda will cause a planetary collapse\n\nEven as the media admits that geoengineering is real, the claim is that it’s being used to “cool” the planet. All of that barium and aluminum raining down from our skies is somehow a “good” thing, the media insists, even as rates of chronic illness skyrocket.\n\nWith the financial help of globalist billionaires and eugenicists like Bill Gates, chemtrails are now being sprayed in pretty much every country around the world, which climate alarmists now say is necessary to “block” the sun from warming the earth.\n\nIt’s a ridiculous notion, and one that makes no logical sense in the same way that carbon dioxide (CO2) can’t be a “pollutant,” as the climate lobby claims, at the same time that it functions as a life molecule for sustaining all plant life. But this is what people like Neil deGrasse and Bill Nye claim is true, as does most of the mainstream media.\n\nBill Gates, it turns out, is actually funding a project known as ScoPEx, run by scientists from Harvard University, that involves intentionally releasing pollution to block out the sun.\n\nAs Adams warns, the result of this will be the impairing of photosynthesis in plants and phytoplankton which, combined with the climate lobby’s efforts to eliminate CO2, will mean the total collapse of the world’s food crops, leading to global famine, starvation, and mass death.\n\n“That’s the real goal of the program, of course,” Adams writes.\n\n“It’s a ‘mass extinction’ weapon system that’s funded by globalists to annihilate humankind by taking out the food webs that support human life. This is nothing less than the weaponization of the atmosphere to commit genocide on a planetary scale.”\n\nThis is one of the globalist deep state’s hard kill agendas, from which nobody will be able to escape. While soft kill programs like forced vaccination are able to catch most people and enslave them, hard kill sun-blocking will affect everyone, collapsing food systems, plant life, and eventually human existence.\n\n“This planned pollution of the skies could devastate life on Earth,” Adams goes on to warn.\n\n“It might unleash, ‘… things like mass famine, mass flooding, drought, of kinds that would affect very large populations,’ warns Stephen Gardiner, author of A Perfect Moral Storm, in a CNBC video that now touts the benefits of chemtrails.\n\nTo learn more about how the climate change agenda is being used to accelerate globalist efforts to dramatically reduce the world’s population, be sure to check out OblivionAgenda.com.", "opengraph": {"title": "Same media that once deemed chemtrails a conspiracy theory now openly promotes chemtrailing the entire planet to “end climate change”", "type": "article", "url": "https://www.geoengineering.news/2019-09-20-chemtrails-conspiracy-theory-to-save-planet.html", "site_name": "GeoEngineering News", "description": "The mainstream media has made a radical departure away from vehement chemtrail denialism into systematic chemtrail embrace, and the question remains as to why the climate “deep state” has suddenly decided to show its cards. Geoengineering, which was long dubbed a “conspiracy theory” by the narrative gatekeepers, has suddenly become not just a thing, but […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2019/09/chemtrail.jpg"}, "tags": ["conspiracy", "conspiracy theory", "climate change", "climate hysteria", "climate science", "Bill Nye", "Neil deGrasse Tyson", "chemical warfare", "geoengineering", "Climate", "geogenocide", "global warming", "chemtrails", "mainstream media", "bill gates", "globalist agenda", "population control", "Collapse", "Weather modification", "Collusion", "genocide", "extinction", "food supply"], "tweets": [], "movies": [], "links": ["https://thefreethoughtproject.com/geoengineering-mainstream-media/", "https://www.naturalnews.com/2017-09-21-dane-wigington-exposes-the-globalist-geoengineering-weather-control-agenda-in-fascinating-interview-with-the-health-ranger.html", "http://climate.news", "https://www.naturalnews.com/2019-09-19-scopex-scheme-polluting-the-entire-planet-video.html", "http://www.harvard.edu", "http://oblivionagenda.com", "https://thefreethoughtproject.com/geoengineering-mainstream-media/", "https://www.naturalnews.com/2017-09-21-dane-wigington-exposes-the-globalist-geoengineering-weather-control-agenda-in-fascinating-interview-with-the-health-ranger.html", "https://www.naturalnews.com/2019-09-19-scopex-scheme-polluting-the-entire-planet-video.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2019-09-20-chemtrails-conspiracy-theory-to-save-planet.html&linkname=Same%20media%20that%20once%20deemed%20chemtrails%20a%20conspiracy%20theory%20now%20openly%20promotes%20chemtrailing%20the%20entire%20planet%20to%20%E2%80%9Cend%20climate%20change%E2%80%9D", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}