{"result_id": "129028", "URL": "https://geoengineering.news/2022-10-16-white-house-sun-blocking-geoengineering-conspiracy-theory.html", "timestamp": "2023-04-25 15:14:22 CEST+0200", "meta": {"description": "The White House Office of Science and Technology Policy has launched a five-year research plan that aims to develop methods of reflecting sunlight back into space in order to “cool” the planet and save it from “global warming.” Just a few years ago, the independent media was dubbed a pack of wild “conspiracy theorists” for […]", "lang": "en", "keywords": "atmosphere,badclimate,badpollution,badscience,Biden,chemtrails,Climate,climate alarmism,climate change,climate crisis,climate cult,conspiracy,conspiracy theory,environment,geoengineering,global warming,green tyranny,left cult,terraforming,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-10-16-white-house-sun-blocking-geoengineering-conspiracy-theory.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "White House now pursuing same sun-blocking geoengineering scheme that was called a “conspiracy theory” just two years ago", "cleaned_text": "White House now pursuing same sun-blocking geoengineering scheme that was called a “conspiracy theory” just two years ago\n\nThe White House Office of Science and Technology Policy has launched a five-year research plan that aims to develop methods of reflecting sunlight back into space in order to “cool” the planet and save it from “global warming.”\n\nJust a few years ago, the independent media was dubbed a pack of wild “conspiracy theorists” for warning that the climate cultists were shifting gears and taking direct aim at the sun for elimination. Now, the conspiracy theories we warned you about are becoming conspiracy facts.\n\nThe idea behind the new sun-blocking scheme is to regulate the level of ultraviolet (UV) exposure on earth. If enough of them can be blocked and reflected back into space, then perhaps temperatures will get a little chillier, which we are told will help the polar ice caps and prevent beachfront properties from flooding in the future.\n\nOne way the globalists plan to block the sun is through stratospheric aerosol injections, also known as “chemtrails.” You may recall that chemtrails were also dubbed a “conspiracy theory” before eventually being confirmed as another conspiracy fact.\n\nThere are also ideas swirling around about marine cloud “brightening” and cirrus cloud “thinning,” which the climate cult says may keep the sun from making the planet too warm during the daytime.\n\n“Stratospheric aerosol injection involves spraying an aerosol like sulfur dioxide into the stratosphere, and because it has the potential to affect the entire globe, often gets the most attention,” reported CNBC.\n\n“While arguments of moral hazard have handicapped research efforts, the idea is getting more urgent attention in the worsening climate crisis.”\n\nClimate tech investment funded praises Biden for paving the way for more global warming profits\n\nSigned by fake “president” Joe Biden earlier this year, the White House Office of Science and Technology Policy sun-blocking scheme will likely involve the spraying of sulfur dioxide into the atmosphere, which even CNBC admits has “harmful effects on the environment and human health.”\n\nIt is worth it, though, at least according to “scientists and climate leaders” who live in constant fear about things like too-warm weather and other alleged “changes” to the climate that worry them.\n\n“Sunlight reflection has the potential to safeguard the livelihoods of billions of people, and it’s a sign of the White House’s leadership that they’re advancing the research so that any future decisions can be rooted in science not geopolitical brinkmanship,” praised Chris Sacca, founder of the climate tech investment fund Lowercarbon Capital, which profits from this kind of climate lunacy.\n\nDespite the obvious conflict of interest between Sacca’s business and the agenda of the Biden White House, Sacca insists that he has “zero financial interests beyond philanthropy.”\n\nAccording to David Keith, a professor at Harvard University, the idea of blocking sunlight to stop global warming has been around since at least 1965. It is just that today it is taken much more seriously than it was back then, probably because society continues to be dumbed down into an absolute idiocracy controlled by deranged climate cultists.\n\nThat same year, a report given to then-President Lyndon B. Johnson called “Restoring the Quality of Our Environment” floated the idea of blasting particles over the ocean at a cost of $100 per square mile. In sum, using the value of dollars back then, it was estimated that reducing global temperatures in this manner would cost about $500 million per year.\n\nNot everyone is convinced that blocking sunlight is the way to go, including Janos Pasztor, executive director of the Carnegie Climate Governance Initiative. He says that “solar radiation modification will never be a solution to the climate crisis.”\n\nThe latest news about the climate cult’s efforts to eliminate sunlight can be found at Geoengineering.news.", "opengraph": {"title": "White House now pursuing same sun-blocking geoengineering scheme that was called a “conspiracy theory” just two years ago", "type": "article", "url": "https://www.geoengineering.news/2022-10-16-white-house-sun-blocking-geoengineering-conspiracy-theory.html", "site_name": "GeoEngineering News", "description": "The White House Office of Science and Technology Policy has launched a five-year research plan that aims to develop methods of reflecting sunlight back into space in order to “cool” the planet and save it from “global warming.” Just a few years ago, the independent media was dubbed a pack of wild “conspiracy theorists” for […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/10/Climate-Change.jpg"}, "tags": ["conspiracy", "conspiracy theory", "geoengineering", "Climate", "chemtrails", "climate change", "Biden", "climate crisis", "left cult", "White House", "atmosphere", "environment", "climate cult", "green tyranny", "global warming", "terraforming"], "tweets": [], "movies": [], "links": ["https://archive.ph/HRXol", "https://naturalnews.com/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "http://www.harvard.edu", "https://geoengineering.news", "https://archive.ph/HRXol", "https://naturalnews.com/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-10-16-white-house-sun-blocking-geoengineering-conspiracy-theory.html&linkname=White%20House%20now%20pursuing%20same%20sun-blocking%20geoengineering%20scheme%20that%20was%20called%20a%20%E2%80%9Cconspiracy%20theory%E2%80%9D%20just%20two%20years%20ago", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}