{"result_id": "129025", "URL": "https://geoengineering.news/2022-09-14-china-approves-aerosol-based-covid-vaccine-chemtrails.html", "timestamp": "2023-04-25 15:14:21 CEST+0200", "meta": {"description": "Communist Chinese pharmaceutical manufacturer CanSino Biologics has announced the unleashing of a new “vaccine” for Wuhan coronavirus (COVID-19) that instead of being injected like a typical vaccine is inhaled through the nose like cocaine. On September 4, CanSino announced that “Convidecia,” as it calls the drug, is fully developed and ready for approval. China’s National […]", "lang": "en", "keywords": "aerosol,badhealth,badmedicine,badpollution,Big Pharma,CanSino Biologics,China,Convidecia,COVID,Dangerous Medicine,environment,geoengineering,inhaled,Moderna,Pfizer,pharmaceutical fraud,Plandemic,spray,vaccine,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-09-14-china-approves-aerosol-based-covid-vaccine-chemtrails.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "China approves AEROSOL-based covid vaccine – will they start spraying it like chemtrails?", "cleaned_text": "China approves AEROSOL-based covid vaccine – will they start spraying it like chemtrails?\n\nCommunist Chinese pharmaceutical manufacturer CanSino Biologics has announced the unleashing of a new “vaccine” for Wuhan coronavirus (COVID-19) that instead of being injected like a typical vaccine is inhaled through the nose like cocaine.\n\nOn September 4, CanSino announced that “Convidecia,” as it calls the drug, is fully developed and ready for approval. China’s National Health Commission is said to be the entity that called for the development of an aerosol-based inhalable Chinese Virus inoculation. (Related: There have been other calls as well for an Operation Warp Speed 2.0 centered around aerosol rather than injectable vaccines.)\n\nAccording to reports, Convidecia is made with a recombinant (a.k.a. genetically engineered) adenovirus that is supposedly unable to replicate. The drug, like pretty much all other “blockbuster” pharmaceuticals, has already been declared to be “safe and effective” and ready to go.\n\nCanSino Biologics experienced a 98.69 percent drop in net profits right before unveiling Convidecia\n\nThe fact that Convidecia is a spray suggests that it will now be much easier to force-vaccinate people with it. If someone refuses to get the injectable shots, he or she could be assaulted with Convidecia in a manner similar to getting blasted with pepper spray.\n\nThere is also the possibility that the Chinese Communist Party (CCP) laces geoengineering “chemtrails” with Convidecia, perhaps spraying entire towns, villages and even cities with the contents.\n\nWhatever ends up happening with Convidecia, the drug is a boon for CanSino, which was down 98.69 percent in net profits for the first half of the year.\n\nReports indicate that reduced demand for injectable COVID injections along with lower vaccine prices worldwide really kicked CanSino hard in the profit department. Now it conveniently has this new drug to boost those flailing profits and keep the company afloat.\n\nIt was a similar situation for Moderna before the Trump administration activated that company as a key player in Operation Warp Speed. Moderna went from never having a single successful drug to becoming a world leader in Fauci Flu shots of the messenger RNA (mRNA) variety.\n\nCanSino is the Chinese equivalent of Moderna or Pfizer in that it is the leading manufacturer of COVID vaccines in communist China. It currently has a market value of around $5.74 billion.\n\n“On Aug. 28, CanSino Biologics, announced that its revenues for the first half of 2022 was $90 million, down 69.45 percent from the same period last year, and its net profit was $1.75 million, down 98.69 percent from the same period last year,” reported the Epoch Times.\n\nThe cover story for why this new aerosol COVID “shot” is necessary is that it fights the supposedly more prevalent “omicron” (anagram for moronic) flavor of Chinese Germs. Before that was delta, for which the injectables were marketed.\n\nCommunist China remains one of the most COVID-oppressive nations in the world. The country continues to force-“test” its citizens with swabs of all varieties; lockdowns are still a thing; and now these aerosol COVID drugs threaten to contaminate the country with another round of mystery chemicals.\n\n“‘Con-videcia’ with emphasis on the first three letters,” wrote a commenter at the Times about the ironic name given to this new drug.\n\n“These are poisons to humans and animals,” wrote another. “Vaccines have never been proven to cure or prevent any diseases but are the cause of diseases.”\n\nAnother emphasized that once Big Pharma runs out of vaccines and other drugs to peddle for a huge profit, “we will see COVID disappear.”\n\n“Next will be forced vaccine gas chambers,” added another person ominously about what the future may hold.\n\nThe latest news about Fauci Flu “vaccines” can be found at Vaccines.news.", "opengraph": {"title": "China approves AEROSOL-based covid vaccine – will they start spraying it like chemtrails?", "type": "article", "url": "https://www.geoengineering.news/2022-09-14-china-approves-aerosol-based-covid-vaccine-chemtrails.html", "site_name": "GeoEngineering News", "description": "Communist Chinese pharmaceutical manufacturer CanSino Biologics has announced the unleashing of a new “vaccine” for Wuhan coronavirus (COVID-19) that instead of being injected like a typical vaccine is inhaled through the nose like cocaine. On September 4, CanSino announced that “Convidecia,” as it calls the drug, is fully developed and ready for approval. China’s National […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/nasal-spray.jpg"}, "tags": ["geoengineering", "inhaled", "vaccine wars", "Big Pharma", "Moderna", "COVID", "vaccine", "aerosol", "China", "Convidecia", "environment", "Pfizer", "CanSino Biologics", "spray", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/inhaled-covid-19-vaccine-approved-in-china-as-profits-of-vaccine-giant-plummet_4719780.html", "https://naturalnews.com/2022-08-25-plandemic-mrna-nasal-spray-operation-warp-speed.html", "http://Vaccines.news", "https://www.theepochtimes.com/inhaled-covid-19-vaccine-approved-in-china-as-profits-of-vaccine-giant-plummet_4719780.html", "https://naturalnews.com/2022-08-25-plandemic-mrna-nasal-spray-operation-warp-speed.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-09-14-china-approves-aerosol-based-covid-vaccine-chemtrails.html&linkname=China%20approves%20AEROSOL-based%20covid%20vaccine%20%E2%80%93%20will%20they%20start%20spraying%20it%20like%20chemtrails%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}