{"result_id": "129030", "URL": "https://geoengineering.news/2022-09-30-weather-weapons-are-targeting-human-infrastructure-extinction.html", "timestamp": "2023-04-25 15:14:24 CEST+0200", "meta": {"description": "Today’s Situation Update podcast covers the weaponization of weather systems to target human infrastructure. It is over two hours in length and features interviews with Dane Wigington (see below) as well as a first responder on the ground in Central Florida. As these interviews reveal, exotic weapon systems are being used to achieve global biosphere […]", "lang": "en", "keywords": "chaos,Collapse,droughts,famine,fertilizer,floods,food collapse,food supply,geoengineering,Hurricane Ian,orchards,starvation,storms,weaponization,weather control,weather weapons", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-09-30-weather-weapons-are-targeting-human-infrastructure-extinction.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Weather weapons are targeting human infrastructure, aiming for Extinction Level Event (ELE) via mass famine and collapse", "cleaned_text": "Weather weapons are targeting human infrastructure, aiming for Extinction Level Event (ELE) via mass famine and collapse\n\nToday’s Situation Update podcast covers the weaponization of weather systems to target human infrastructure. It is over two hours in length and features interviews with Dane Wigington (see below) as well as a first responder on the ground in Central Florida.\n\nAs these interviews reveal, exotic weapon systems are being used to achieve global biosphere destruction which encompasses agricultural collapse, fertilizer disruptions and supply chain breakdowns that are designed to achieve mass global famine.\n\nIf these attacks on our world are not stopped, they could end in an Extinction Level Event (ELE), warns Wigington (see below).\n\nEach interview is posted here separately, followed by the full Situation Update podcast which includes other analysis.\n\n– Dane Wigington from GeoengineeringWatch.org describes the weaponization of Hurricane Ian\n\n – Modern tech can control the direction and intensity of storms and droughts\n\n – Florida’s phosphate fertilizer industry was in direct path of the hurricane\n\n – Global attacks against the biosphere target crops, fertilizer and food production\n\n – The destruction of the biosphere is aiming to be an Extinction Level Event (ELE)\n\n – Globalists are unleashing ecological destruction that will take CENTURIES to heal\n\n– Total devastation of some areas will take YEARS to recover\n\n – Fragile supply chain means parts and supplies won’t be easily sourced for rebuilding\n\n – First responder describes INJURIES and BODY BAGS being stockpiled\n\n – Cell towers are down, power grid is down, but SATELLITE comms are functioning\n\n – Tina from the Satellite Phone Store is handing out Bivy sticks and sat phones to responders\n\n – Satellite phone owners in Florida are able to allow neighbors to call their families\n\n – Police, firefighters, paramedics are using sat phones and Bivy sticks to coordinate rescue\n\n – Florida’s people are resilient, and Gov. DeSantis is offering outstanding leadership\n\nFull Situation Update podcast (which also includes the above two interviews):\n\n– Featuring Dane Wigington of Geoengineering Watch who says Hurricane Ian was weaponized\n\n – The storm took offline 50% of North America’s phosphate fertilizer production\n\n – Supply chain disruptions mean REBUILDING Florida will take years\n\n – Black mold is about to start growing in all the water-saturated buildings and homes\n\n – Second interview with hurricane first responder who says US Coast Guard has massive stockpile of BODY BAGS\n\n – Actress takes vaccine, sees half her face PARALYZED, and says she would take it again\n\n – San Francisco hands out free monkeypox vaccines to black people (no whites), trans and prostitutes\n\n – US Congress military aid to Ukraine hits $65 billion, but no money for US border wall\n\nSee more news coverage of global famine at Famine.news\n\nDiscover more interviews and podcasts each day at:\n\nBrighteon.social: Brighteon.social/@HealthRanger (my breaking news gets posted here first)\n\nTelegram: t.me/RealHealthRanger (breaking news is posted here second)\n\nJoin the free NaturalNews.com email newsletter to stay alerted about breaking news each day.\n\nDownload my current audio books — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audio book, “Resilient Prepping” at ResilientPrepping.com – it teaches you how to survive the total collapse of civilization and the loss of both the power grid and combustion engines.", "opengraph": {"title": "Weather weapons are targeting human infrastructure, aiming for Extinction Level Event (ELE) via mass famine and collapse", "type": "article", "url": "https://www.geoengineering.news/2022-09-30-weather-weapons-are-targeting-human-infrastructure-extinction.html", "site_name": "GeoEngineering News", "description": "Today’s Situation Update podcast covers the weaponization of weather systems to target human infrastructure. It is over two hours in length and features interviews with Dane Wigington (see below) as well as a first responder on the ground in Central Florida. As these interviews reveal, exotic weapon systems are being used to achieve global biosphere […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/Situation-Update-HRR-2022-9-30v.jpg"}, "tags": ["chaos", "geoengineering", "weaponization", "starvation", "fertilizer", "weather control", "Collapse", "floods", "food collapse", "famine", "weather weapons", "food supply", "orchards", "Hurricane Ian", "storms", "droughts"], "tweets": [], "movies": [], "links": ["http://GeoengineeringWatch.org", "http://Brighteon.com/4caaaab6-2b28-4cbc-ac64-929ee4b94d9e", "http://Brighteon.com/784071dd-9905-4d4d-bb5b-ee64a003d1c3", "http://Brighteon.com/a3254ef8-9b9e-4aa1-a760-d911f232918f", "http://bitchute.com/video/LMmPmQLGG2BN/", "https://rumble.com/v1m5l5a-situation-update-93022-weather-weapons-targeting-human-infrastructure.html", "http://Famine.news", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-09-30-weather-weapons-are-targeting-human-infrastructure-extinction.html&linkname=Weather%20weapons%20are%20targeting%20human%20infrastructure%2C%20aiming%20for%20Extinction%20Level%20Event%20%28ELE%29%20via%20mass%20famine%20and%20collapse", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}