{"result_id": "129018", "URL": "https://geoengineering.news/2022-10-05-we-own-science-un-world-economic-forum.html", "timestamp": "2023-04-25 15:14:17 CEST+0200", "meta": {"description": "Is science something that everyone contributes and has access to, or is it something that is decreed from the top down by authoritarian bureaucrats? According to Melissa Fleming, the United Nations’ Under-Secretary-General for Global Communications, “we own the science” – referring to the UN. At a recent World Economic Forum (WEF) event, Fleming declared during […]", "lang": "en", "keywords": "Big Tech,Censored Science,Censorship,Climate,conspiracy,deception,Globalism,great reset,lies,Melissa Fleming,misinformation,propaganda,science,science deception,science fraud,truth,UN,United Nations,we own the science,wef,world economic forum", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-10-05-we-own-science-un-world-economic-forum.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "“We own the science,” brags UN representative at World Economic Forum", "cleaned_text": "“We own the science,” brags UN representative at World Economic Forum\n\nIs science something that everyone contributes and has access to, or is it something that is decreed from the top down by authoritarian bureaucrats? According to Melissa Fleming, the United Nations’ Under-Secretary-General for Global Communications, “we own the science” – referring to the UN.\n\nAt a recent World Economic Forum (WEF) event, Fleming declared during her talk on “Tackling Disinformation at the Sustainable Development Impact Meetings 2022,” held from Sept. 19-23, 2022, that the so-called “elites” are in charge of science, not the little people.\n\nFleming admitted that the UN forced a deal with tech giant Google to suppress and censor all opposing viewpoints about “science,” including those of experts who disagree with the official story about “climate change.”\n\n“We partnered with Google,” Fleming told Adrian Monck, the managing director and head of public and social engagement at the WEF. “For example, if you Google climate change, at the top of your search, you will get all kinds of UN resources.”\n\n“We started this partnership when we were shocked to see that when we Googled climate change, we were getting incredibly distorted information right at the top, so we’re becoming much more proactive.”\n\n“We own the science and we think that the world should know it, and the platform themselves also do. But again, it’s a huge challenge that I think all sectors of society need to be very active.”\n\nWatch the video below to hear for yourself what Fleming, the UN and the WEF think about who controls science:\n\nTruth doesn’t need to silence other viewpoints to remain true\n\nBoth the UN and the WEF are heavily involved in various climate matters, including efforts to block out the sun with “space bubbles” in order to stop so-called “global warming.”\n\nThe WEF has also hinted at a future cyber “pandemic,” which some believe will be used to usher in Klaus Schwab’s infamous “great reset.”\n\nThe UN and the WEF used to at least try to veil their true intentions for the world, but Fleming’s latest statements at the WEF show that the globalists no longer care what the world hears or thinks.\n\nThey are coming right out into the open now to declare that they are the ones in charge. They are the ones who get to tell us what is true concerning science, and anyone who contradicts that is immediately silenced.\n\n“If you’re in the right, there’s no need to suppress other viewpoints because the truth will win out,” one commenter wrote about how the UN and the WEF are showing their cards.\n\n“Of course, if you’re in the wrong, you HAVE to suppress the truth in order to maintain your viewpoint.”\n\nJoe Biden is also part of the globalist cabal, added another, quoting something Biden recently said that echoes what Fleming said at the WEF:\n\n“What we have here is a perception problem. What we need to do is change this perspective, even if it’s not true.”\n\nThe way Biden and his cabal accomplish this is to demonize, marginalize and eventually criminalize their opponents, which we are now seeing take place on a global scale.\n\n“Their hubris should be their downfall but a lot of people are pretty dumb,” wrote another about how idiocracy is the reason why Fleming’s statements go unaddressed and unpunished.\n\n“Truth is never afraid of examination,” added someone else to the conversation. “Lies are always afraid of being exposed.”\n\n“If they were right,” said another, “then they would welcome other viewpoints and discussion – but they’re not right.”\n\nThe latest news about globalist efforts to silence the truth can be found at Censorship.news.", "opengraph": {"title": "“We own the science,” brags UN representative at World Economic Forum", "type": "article", "url": "https://www.geoengineering.news/2022-10-05-we-own-science-un-world-economic-forum.html", "site_name": "GeoEngineering News", "description": "Is science something that everyone contributes and has access to, or is it something that is decreed from the top down by authoritarian bureaucrats? According to Melissa Fleming, the United Nations’ Under-Secretary-General for Global Communications, “we own the science” – referring to the UN. At a recent World Economic Forum (WEF) event, Fleming declared during […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/10/1402991039_united-nations-general-assembly.jpg"}, "tags": ["conspiracy", "world economic forum", "great reset", "we own the science", "deception", "lies", "Censored Science", "Climate", "science deception", "truth", "wef", "United Nations", "propaganda", "Big Tech", "misinformation", "UN", "science", "science fraud", "Melissa Fleming", "Censorship", "Globalism"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/cKoAoPi8sc0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/cKoAoPi8sc0"}], "links": ["https://www.thegatewaypundit.com/2022/10/un-representative-declares-science-world-economic-forum-admits-working-big-tech-suppress-viewpoints-video/", "https://naturalnews.com/2022-08-02-wef-space-bubbles-blocking-sun-global-warming.html", "https://naturalnews.com/2021-04-14-world-economic-forum-global-cyber-pandemic-reset.html", "http://censorship.news", "https://www.thegatewaypundit.com/2022/10/un-representative-declares-science-world-economic-forum-admits-working-big-tech-suppress-viewpoints-video/", "https://naturalnews.com/2022-08-02-wef-space-bubbles-blocking-sun-global-warming.html", "https://naturalnews.com/2021-04-14-world-economic-forum-global-cyber-pandemic-reset.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-10-05-we-own-science-un-world-economic-forum.html&linkname=%E2%80%9CWe%20own%20the%20science%2C%E2%80%9D%20brags%20UN%20representative%20at%20World%20Economic%20Forum", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}