{"result_id": "129019", "URL": "https://geoengineering.news/2019-07-09-scientists-tout-benefits-of-geoengineering-chemtrails-in-renewed-push.html", "timestamp": "2023-04-25 15:14:17 CEST+0200", "meta": {"description": "It’s no longer debatable that scientists are advocating the mass pollution of Earth’s upper atmosphere in a foolish effort to halt so-called “climate change.” The agenda is openly admitted in science journals like Nature Climate Change, which recently published this study by Peter Irvine and colleagues: Halving warming with idealized solar geoengineering moderates key climate […]", "lang": "en", "keywords": "atmosphere,badclimate,badpollution,badscience,chemtrails,climate science,Ecology,environ,geoengineering,global warming,solar geoengineering,weird science", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2019-07-09-scientists-tout-benefits-of-geoengineering-chemtrails-in-renewed-push.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Climate change scientists tout “benefits” of geoengineering (chemtrails) in renewed push to pollute the atmosphere, dim the sun and freeze the planet", "cleaned_text": "Climate change scientists tout “benefits” of geoengineering (chemtrails) in renewed push to pollute the atmosphere, dim the sun and freeze the planet\n\nIt’s no longer debatable that scientists are advocating the mass pollution of Earth’s upper atmosphere in a foolish effort to halt so-called “climate change.” The agenda is openly admitted in science journals like Nature Climate Change, which recently published this study by Peter Irvine and colleagues:\n\nThe paper isn’t debating whether geoengineering (chemtrails) is a real concept; the entire paper is focused on the question of how much pollution of Earth’s atmosphere is the right amount?\n\nIn other words, it has already been accepted that polluting the atmosphere (geoengineering) is an accepted, mainstream science protocol which advocates claim will halt so-called “climate change.” (They are insane, of course. See more below…)\n\nNote carefully that every science quack in the media — actor Bill Nye, accused rapist Neil deGrasse Tyson and every “skeptic” troll on Wikipedia — has long insisted that geoengineering isn’t real. Chemtrails aren’t happening, they say, and nobody is trying to pollute the atmosphere. This is how they run their scam: Deny, deny, deny until one day that rewrite history and claim geoengineering was always considered “good science.” (Someone owes the independent media an apology, given that the very idea of geoengineering has been mocked for over a decade, yet now it’s suddenly advocated in mainstream science papers.)\n\nLest you think this is all a brand new concept, here’s a WIRED article from 2008 arguing for the mass pollution of the atmosphere via geoengineering. As the article explains, the scheme involves the release of sulfur dioxide into the atmosphere — a form of toxic pollution that even WIRED admits will cause acid rain. In fact, the article is titled, “Can a Million Tons of Sulfur Dioxide Combat Climate Change?”\n\nLet’s be clear: Geoengineering is POLLUTION of Earth’s atmosphere. (Read more news about geoengineering at Geoengineering.news)\n\nHave no illusions. Pollution is what’s being openly advocated in the name of “saving the planet.” And the pollution is, of course, extremely toxic to Earth’s ecosystems. Sulfur dioxide is widely considered the best candidate for geoengineering, and ejecting it into the atmosphere would, of course, result in acid rain falling on Earth’s forests, rivers, grasslands and oceans. Remember acid rain? That’s what we were warned was going to wipe out the world back in the 1980s. The term was quickly retired after it turned out the apocalyptic predictions about acid rain didn’t live up to the hype. Now, scientists are working to generate acid rain with sulfur dioxide pollution. And they claim to be “saving the planet.”\n\nSo in addition to dimming the sun, diminishing photosynthesis and freezing the planet, climate change scientists also want to drench Earth’s surface with acid rain, which they once promised would kill us all. It’s hard to keep track of all the climate emergencies, as the establishment keeps changing them every few years.\n\nTo avoid their true agenda being easily identified, modern scientists camouflage their efforts under a variety of names, all of which are essentially synonymous:\n• And the new winner, “Solar Geoengineering” – which is actually a misnomer, since they aren’t geoengineering the sun, but it seems that linguistic accuracy is of no concern to scientists who are fabricating all their fake papers about climate change anyway\n\nRegardless of the label, the scheme is always the same: Eject pollution into Earth’s atmosphere to dim the sun and reduce the intensity of solar radiation reaching the surface of the Earth. The goal is to achieve global cooling — which is exactly what the entire scientific establishment told us in the 1970s would kill us all with a terrifying new ice age creeping across the planet, freezing away life as we know it.\n\nHere’s the cover of TIME Magazine from 1977. The headline story? “How To Survive The Coming Ice Age.”\n\nOne of the chemists who works for me in my mass spec laboratory, in fact, repeatedly reminds me how all the science students were once taught about the “global cooling” apocalypse that was rapidly arriving, and if scientists didn’t figure out a way to rapidly warm the planet, Earth would be frozen into the ice planet Hoth, from The Empire Strikes Back. (But without all the droids.)\n\nA few years later, when the “global cooling” science fraud didn’t pan out because, you know… REALITY struck, the lunatics operating under the false banner of “science” flipped the switch and decided to run planet-wide scare stories about “global warming.” We were all going to burn in a planet-wide fiery blaze of heat and death, we were warned, unless we stopped using combustion engines that run farm tractors which produce most of the world’s food supply. (Seeking the most idiotic bad science label of all time, Alexandria Ocasio-Cortez announced that humanity had only 12 years remaining before “climate change” would destroy human civilization. Most liberals believed her, since they are universally scientifically illiterate and don’t understand cause and effect, much less atmospheric chemistry.)\n\nA few years after that, when the warming couldn’t be documented without fudging all the data and committing massive scientific fraud across government-funded institutions (NOAA, anyone?), they changed the term to “climate change” — a brilliant move, considering the fact that no one can rationally argue the climate isn’t always changing in one way or another. As an interesting tangent, I recently watched a NOVA episode about the asteroid that killed off the dinosaurs 66 million years ago. Upon colliding with our planet, the asteroid ejected enormous amounts of particulate matter into the atmosphere, blocking out the sun and collapsing the global food supply, causing a planet-wide mass extinction event. During the program, the narrator said the dinosaurs were actually killed by — guess what? — “climate change.” Seriously. (Maybe the dinosaurs should have been told to stop running gasoline-powered lawn mowers…)\n\nToday, the lunatic climate scientists who parasitically feed off government grants that demand the spontaneous materialization of climate-related “science” are trying to recreate, on a smaller scale, the mass extinction event that killed off the dinosaurs (and 75% of all plant and animal species on the planet, by the way). By polluting the atmosphere with particulate matter, they are hoping to achieve much the same thing that happened after Earth was struck with a global-killer space rock: Drastic reductions in solar radiation and diminished photosynthesis which would cause a cascading collapse of every food web on the planet.\n\nThere’s little doubt that if Al Gore could command a 7-mile-wide asteroid, he would crash it into the planet while screaming, “I’m SAVING the planet!” And he would kill nearly every living thing that currently inhabits the Earth. But “global warming” would be halted, and Earth’s surface would freeze, resulting in yet another mass extinction event which Democrats would declare to be a tremendous success. (If we could figure out a way to cause selective mass extinction merely among bureaucrats, Earth might actually have a chance to survive…)\n\nBut getting back to the science paper at hand…\n\nDo we have to rename the elements using gender-neutral language?\n\nThe author of the paper appears to be an obedient progressive, and he even writes about the “inequality of solar geoengineering impacts,” no doubt making sure chemtrails impact white people just the same as brown people or black people. After all, you can’t leave the “inequality” word out of a science paper these days, or the cultural police might think you’ve devolved into a real scientist who believes that chromosomes determine gender (a concept now denounced by the entire left-wing “science” community which has simultaneously abandoned genetics and biology). Soon, climate change scientists will also have to demand that the elemental symbol for Helium (He) be changed to “She” in order to avoid offending dumb-as-rocks liberal feminists who think everything in the cosmos is designed to demean them.\n\nThe sun, it will be said, runs on “She”… and the element will be given extra protons and neutrons to achieve “equality” with other elemental genders, thereby transmuting it into something incredibly radioactive and unstable. Just like feminists. But that’s how feminism works when it clashes with the sciences. I can’t wait to see all the chemistry textbooks burned and re-printed with the new “gender equal” element “She.” Don’t laugh. They’re already burning the textbooks that teach students about chromosomes, and Amazon is aggressively banning all books that offer counseling to homosexuals who don’t want to be gay. It won’t be long until chemistry and physics must also be “progressified” to meet the cultural demands of the authoritarian science nincompoops who insist that gender is determined by wishing.\n\nIn any case, the paper essentially concludes that going half-way on the geoengineering effort (instead of a full-blown program to counteract CO2 in the range of 800 ppm in terms of atmospheric concentration) wouldn’t cause crazy hurricanes, cyclones or radical weather events that would bring any serious harm to any particular region of the world. Essentially, the paper argues that geoengineering should only be pursued with a certain “dose” of pollution for the atmosphere, because going too far might have devastating weather consequences (which every obedient Leftist would swear was being caused by “climate change,” of course).\n\nBut the author has missed the forest for the trees. The dimming of sunlight would devastate food production globally, plunging many Third World nations into starvation, social unrest, political upheaval and unbounded humanitarian crisis. That’s because many regions of the world need every photon of sunlight currently available to produce enough food just to prevent mass starvation. Even a reduction of 1% in solar radiation would have devastating global consequences for food crops, rainforests, grasslands and marine ecosystems (which also depend on sunlight, in case you forgot the role of phytoplankton).\n\nA reduction in sunlight density would also shorten growing season durations for food crops, meaning food availability would be directly diminished. In a world where sunlight is the true source of light, warmth and life for every living thing that inhabits the world, it’s stunning that modern-day scientists are literally arguing about how much sunlight should be blocked to “save the planet.”\n\nClimate “science” has become a danger to humanity and is working to unleash a global mass extinction event\n\nThe sciences, it is now obvious, have plummeted into the realm of insanity. In the name of climate change, mad scientists are now trying to pollute the atmosphere and alter the climate in a way that mimics an apocalyptic volcanic eruption or catastrophic asteroid impact. Earth’s scientists, it might be stated, have become a kind of natural disaster that threatens all of humanity. And if they are given funding for their full scale geoengineering projects, they will quite literally destroy the world as we know it. They will dim the sun, freeze the planet, impair photosynthesis and destroy food crops. They will plunge Earth into mass starvation, disease and depopulation.\n\nBut of course that has been their real goal all along.\n\nThe “climate change” narrative has been a hoax from the beginning, and these scientists aren’t working to save planet Earth at all. They’re actually working to annihilate humanity, depopulate the planet and terraform our world.\n\nThat’s the real truth about what so-called “science” is pursuing today. And if humanity allows this insanity to continue, we will all be annihilated by the world’s first mass extinction event triggered by the sheer stupidity of the dominant indigenous species (that’s us).\n\nWhen the food crops shrivel and die, the winters lengthen and the continents are plunged into a new ice age, I wonder how many people will ask, “Why did we let the scientists pollute the skies and dim the sun?” Will the terraforming lunatic scientists ever be charged with crimes against humanity? Or will human civilization just sit back and do nothing while the monsters of modern-day science systematically destroy our climate in the name of saving it?\n\nWhen science has been turned against humanity, it is the duty of humanity to oppose that evil and stop the destruction. We live in a world where the media told us sunlight was bad and a warm, wet planet was dangerous. Al Gore insisted that rising ocean levels would wipe out human civilization and that freezing the planet and lowering the oceans would be the solution. All these people are beyond idiots; they are anti-humanists, and if they are not stopped, humanity will be annihilated just as planned.\n\nOut of all the intelligent civilizations in the Milky Way galaxy, I’m willing to bet the Drake Equation didn’t account for the sheer stupidity of humanity destroying its own planet by polluting its atmosphere and blocking its own sun. That level of stupidity earns human beings a place of cosmic mockery to the point where other intelligent civilizations are probably selling tickets to simply observe Earth — the only planet yet discovered where the biologicals are so stupid, they actually annihilate themselves in the name of “science.” And they also chop up their own babies and call it “women’s reproductive health,” by the way, while poisoning their own food supply with cancer-causing weed killer chemicals.\n\nYep, thanks to “progressive” science, Earth is the laughing stock of the universe. We’re probably only being allowed to continue living due to the entertainment value of our own stupidity.\n\nWhat will “science” come up with next? Mandatory injections of brain-damaging toxic elements into human children? Oh wait, they already do that. It’s called vaccination.", "opengraph": {"title": "Climate change scientists tout “benefits” of geoengineering (chemtrails) in renewed push to pollute the atmosphere, dim the sun and freeze the planet", "type": "article", "url": "https://www.geoengineering.news/2019-07-09-scientists-tout-benefits-of-geoengineering-chemtrails-in-renewed-push.html", "site_name": "GeoEngineering News", "description": "It’s no longer debatable that scientists are advocating the mass pollution of Earth’s upper atmosphere in a foolish effort to halt so-called “climate change.” The agenda is openly admitted in science journals like Nature Climate Change, which recently published this study by Peter Irvine and colleagues: Halving warming with idealized solar geoengineering moderates key climate […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2019/07/Chemtrails-Neighborhood-Night.jpg"}, "tags": ["geoengineering", "chemtrails", "solar geoengineering", "atmosphere", "weird science", "environ", "Ecology", "global warming", "climate science"], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s41558-019-0398-8", "http://www.truthwiki.org/bill-nye-science-guy/", "http://www.truthwiki.org/neil-degrasse-tyson/", "https://www.wired.com/2008/06/ff-geoengineering/", "https://Geoengineering.news", "https://www.naturalnews.com/2019-02-13-aoc-green-new-deal-food-collapse-mass-starvation.html", "http://climate.news/2018-02-22-noaa-caught-again-altering-temperature-data-to-exaggerate-global-warming-hoax.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2019-07-09-scientists-tout-benefits-of-geoengineering-chemtrails-in-renewed-push.html&linkname=Climate%20change%20scientists%20tout%20%E2%80%9Cbenefits%E2%80%9D%20of%20geoengineering%20%28chemtrails%29%20in%20renewed%20push%20to%20pollute%20the%20atmosphere%2C%20dim%20the%20sun%20and%20freeze%20the%20planet", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}