{"result_id": "129012", "URL": "https://geoengineering.news/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "timestamp": "2023-04-25 15:14:13 CEST+0200", "meta": {"description": "To help cool the allegedly warming planet, mad scientists are proposing the use of geoengineering “chemtrails” to be sprayed at the North and South Poles in order to “refreeze” them. Jet aircraft would be deployed high up in the sky to blast out massive plumes of microscopic aerosol particles designed to reflect sunlight back into […]", "lang": "en", "keywords": "badclimate,badscience,chemtrails,climate alarmism,climate change,climate science,environment,geoengineering,global warming,Globalism,globalist elites,globalists,ice age,sun,Weather Manipulation", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "The globalist plan: Block the sun and turn Earth into a frozen ice ball in the name of fighting “climate change”", "cleaned_text": "The globalist plan: Block the sun and turn Earth into a frozen ice ball in the name of fighting “climate change”\n\nTo help cool the allegedly warming planet, mad scientists are proposing the use of geoengineering “chemtrails” to be sprayed at the North and South Poles in order to “refreeze” them.\n\nJet aircraft would be deployed high up in the sky to blast out massive plumes of microscopic aerosol particles designed to reflect sunlight back into space, preventing it from reaching Earth. This, we are told, will cool down the icecaps.\n\nIn order to make this happen, ironically enough, some 175,000 jet flights per year would be necessary – which means a lot of polluting jet fuel will need to be burned.\n\nMillions of tons of these toxic chemicals will also float around before eventually setting onto the icecaps and into the water, causing untold harm to sea life – but at least the planet would be a little cooler, maybe.\n\n“Under the plan, a fleet of 125 military air-to-air refuelling tankers would release a cloud of microscopic sulphur dioxide particles at an altitude of 43,000ft (13km) and latitude of 60 degrees in both hemispheres, roughly equivalent to the Shetland Islands in the north, and the Falklands in the south,” reports explain.\n\n“The particles would slowly drift towards the poles on high-altitude winds, slightly shading the Earth’s surface beneath.”\n\nJet exhaust from chemtrail “cooling” planes disperse greenhouse gases into upper atmosphere where they’re said to be more damaging\n\nIf the planes can successfully deposit at least 13 million tons of particulate matter into the skies in spring, by summer the polar regions would reduce in temperature by about 2 degrees Celsius “with more moderate cooling at mid-latitudes.”\n\nThe number of flights it would take to accomplish this feat is the equivalent of the entirety of global air traffic combined over the course of more than two days – not to mention the greenhouse gases deposited into the upper atmosphere.\n\nIt is one thing for greenhouse gases to accumulate in the lower atmosphere, but it is a whole lot worse, we are told, for that to happen way up high where airplanes fly. So would this not defeat the entire point, based on official global warming dogma?\n\nThose in favor of the proposition say no because less than one percent of the entire global human population lives in the areas where sun-blocking aerosols would be sprayed. And the costs associated with the project, amounting to nearly $11.5 billion annually, are somehow less than carbon capture technologies.\n\n“If the risk-benefit equation were to pay off anywhere, it would be at the poles,” says Wake Smith, who led a study about the spraying plan. “Any intentional turning of the global thermostat would be of common interest to all of humanity.”\n\nSmith and other climate alarmists insist the planet has become too hot, especially at the poles. Eventually, they say, the world will reach a tipping point, resulting in rising sea levels that flood out places like Martha’s Vineyard where the Obamas live.\n\n“We are right there, right now,” claims Sir David King, a former government chief scientist and founder of the Centre for Climate Repair (CCR) at the University of Cambridge.\n\n“The idea is to buy time while we reduce greenhouse gas emissions deeply and rapidly. That’s essential. If we keep on emitting at the current rate, we are cooked.”\n\nShaun Fitzgerald, the director of CCR, agrees. He says all that burned jet fuel is worth it to stop warming at the poles because he and his colleagues are “worried about the impacts” of climate change “right now,” while the jet fuel impact would have a longer-term effect.\n\nMore related news can be found at ClimateAlarmism.news.", "opengraph": {"title": "The globalist plan: Block the sun and turn Earth into a frozen ice ball in the name of fighting “climate change”", "type": "article", "url": "https://www.geoengineering.news/2022-09-19-globalists-plan-block-sun-fight-climate-change.html", "site_name": "GeoEngineering News", "description": "To help cool the allegedly warming planet, mad scientists are proposing the use of geoengineering “chemtrails” to be sprayed at the North and South Poles in order to “refreeze” them. Jet aircraft would be deployed high up in the sky to blast out massive plumes of microscopic aerosol particles designed to reflect sunlight back into […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/Chemtrails1.jpg"}, "tags": ["Weather Manipulation", "geoengineering", "sun", "chemtrails", "climate change", "globalists", "ice age", "environment", "global warming", "climate science", "globalist elites", "Globalism"], "tweets": [], "movies": [], "links": ["https://newspunch.com/scientists-vow-to-refreeze-north-and-south-poles-by-spraying-chemtrails-into-earths-atmosphere/", "https://www.cam.ac.uk/", "http://climatealarmism.news", "https://newspunch.com/scientists-vow-to-refreeze-north-and-south-poles-by-spraying-chemtrails-into-earths-atmosphere/", "https://naturalnews.com/2022-08-02-wef-space-bubbles-blocking-sun-global-warming.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-09-19-globalists-plan-block-sun-fight-climate-change.html&linkname=The%20globalist%20plan%3A%20Block%20the%20sun%20and%20turn%20Earth%20into%20a%20frozen%20ice%20ball%20in%20the%20name%20of%20fighting%20%E2%80%9Cclimate%20change%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}