{"result_id": "129021", "URL": "https://geoengineering.news/2021-01-22-scientists-demand-end-bill-gates-genocidal-solar-dimming.html", "timestamp": "2023-04-25 15:14:18 CEST+0200", "meta": {"description": "One of humanity’s primary sources of life, the sun, is under attack by genocidal maniac Bill Gates, who wants to artificially “dim” it with aerosols in order to stop “global warming.” A growing cohort of scientists, however, is saying no way. The Calgary-based Friends of Science Society has issued a press release calling on Harvard […]", "lang": "en", "keywords": "bill gates,chemtrails,climate change,depopulation,evil,genocide,geoengineering,global warming,solar dimming", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2021-01-22-scientists-demand-end-bill-gates-genocidal-solar-dimming.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Hundreds of climate scientists demand immediate end to Bill Gates’ genocidal “solar dimming” project", "cleaned_text": "Hundreds of climate scientists demand immediate end to Bill Gates’ genocidal “solar dimming” project\n\nOne of humanity’s primary sources of life, the sun, is under attack by genocidal maniac Bill Gates, who wants to artificially “dim” it with aerosols in order to stop “global warming.” A growing cohort of scientists, however, is saying no way.\n\nThe Calgary-based Friends of Science Society has issued a press release calling on Harvard University to stop working with Gates to “chemtrail” the sky in an attempt to block out the sun. Doing this presents serious atmospheric risks, not to mention unintended consequences that could result in an extinction-level event (ELE).\n\nResearchers Roger Pielke Jr. and Justin Ritchie found that Gates’ projections are all wrong to begin with, and there is no actual climate emergency. Further, the originator of the project to blast chemicals into the sky, Prof. David Keith, has openly admitted that “many thousands will die” from the experiment.\n\nSeeing as how Gates is the same billionaire “philanthropist” who claims to care about the thousands of people who have supposedly died from the Wuhan coronavirus (COVID-19), hence his push for mass vaccination, it defies logic that he would now want to kill untold thousands more by blocking out the sun.\n\n“‘Solar dimming’ geoengineering would inject sulphur dioxide particulate matter into the atmosphere, thus creating a human-caused ‘cloud’ to dim the incoming warming effect of the sun, to counteract human-caused global warming, which Bill Gates claims is causing a ‘climate disaster’ in the title of his upcoming book,” the press release reads.\n\nMore related news about the mass murder impact of geoengineering can be found at Geoengineering.news.\n\nOnce “solar dimming” happens, it can never be reversed\n\nAn online Friends of Science Society event that took place on Jan. 19 featured NASA award-winning scientist Dr. Roy Spencer, who gave a talk about “The Most Important Reasons Why There is No Climate Emergency.”\n\nMore than 900 scientists and scholars who have signed on to the CLINTEL World Climate Declaration agree that there is no such thing as a “climate emergency,” and claims to the contrary are bunk.\n\nEven climate scientists who believe in global warming are speaking out against “solar dimming,” warning that it is “contrived” and will have a much more disastrous impact on the planet than “warming” ever could. This is in addition to the fact that such a project is fraught with ethical and moral dilemmas that can never be adequately resolved.\n\n“‘Solar dimming’ would replicate some of the effects of large volcanic explosions, often devastating to crop yields,” the press release further explains. “As pointed out in Garnett et al, ‘The most severe impact of extremely low temperatures affecting spring wheat (on the Canadian prairies) came in 1992 and 1993 after the 1991 Pinatubo volcanic eruption.”\n\n“Summer temperatures were 2°C below normal, resulting in a record low prairie protein content of 12% … 75% of the spring wheat crop fell into the bottom two grades of #3 Canadian Wester Spring wheat …”\n\nIn other words, if solar activity is naturally weakening, then adding to that with artificial “dimming” would have a certain catastrophic impact on the world’s food production capabilities.\n\nThe fact that Bill Gates is now the largest farmland owner in the United States only adds to credible speculation that this maniacal psychopath really does want to depopulate the planet, in part by depriving human beings of access to food.\n\nUnless stopped, Gates’ “solar dimming” project will not be able to be reversed. Once these chemicals are blasted into the skies, that is it: They will remain there indefinitely, and will not be able to be removed, resulting in an actual climate crisis of epic proportions.", "opengraph": {"title": "Hundreds of climate scientists demand immediate end to Bill Gates’ genocidal “solar dimming” project", "type": "article", "url": "https://www.geoengineering.news/2021-01-22-scientists-demand-end-bill-gates-genocidal-solar-dimming.html", "site_name": "GeoEngineering News", "description": "One of humanity’s primary sources of life, the sun, is under attack by genocidal maniac Bill Gates, who wants to artificially “dim” it with aerosols in order to stop “global warming.” A growing cohort of scientists, however, is saying no way. The Calgary-based Friends of Science Society has issued a press release calling on Harvard […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2021/01/Atlas-Earth-Planet-Real-Globe-Astronomy.jpg"}, "tags": ["geoengineering", "chemtrails", "evil", "climate change", "solar dimming", "genocide", "bill gates", "depopulation", "global warming"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2018-11-28-global-dimming-scheme-chemtrail-atmosphere-smog-saving-planet.html", "https://www.prweb.com/releases/bill_gates_funded_solar_dimming_project_risks_the_lives_of_millions_and_must_be_stopped/prweb17660628.htm", "http://www.harvard.edu", "https://geoengineering.news", "https://nypost.com/2021/01/15/bill-gates-is-the-largest-farmland-owner-in-america-report/", "https://www.naturalnews.com/2018-11-28-global-dimming-scheme-chemtrail-atmosphere-smog-saving-planet.html", "https://www.prweb.com/releases/bill_gates_funded_solar_dimming_project_risks_the_lives_of_millions_and_must_be_stopped/prweb17660628.htm", "https://nypost.com/2021/01/15/bill-gates-is-the-largest-farmland-owner-in-america-report/"], "authors": [], "publish_date": null}