{"result_id": "129015", "URL": "https://www.geoengineering.news/2021-04-02-situation-update-april-2nd-bill-gates-terraforming-scheme-blocked-by-reindeer-herders.html", "timestamp": "2023-04-25 15:14:15 CEST+0200", "meta": {"description": "Bill Gates is an anti-human depopulation zealot who wants to exterminate humankind by blocking the sun and collapsing the global food supply. His mad science experiment to launch this global death initiative is called the “SCoPEx” project, which I first reported back in 2019. At that time, the fake news media claimed all reports about […]", "lang": "en", "keywords": "badclimate,badscience,bill gates,depopulation,Earth,Ecology,environ,extinction,geoengineering,terraforming", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2021-04-02-situation-update-april-2nd-bill-gates-terraforming-scheme-blocked-by-reindeer-herders.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "Situation Update, April 2nd: Bill Gates’ mad science TERRAFORMING scheme blocked by reindeer herders", "cleaned_text": "Bill Gates is an anti-human depopulation zealot who wants to exterminate humankind by blocking the sun and collapsing the global food supply. His mad science experiment to launch this global death initiative is called the “SCoPEx” project, which I first reported back in 2019. At that time, the fake news media claimed all reports about the project were a “conspiracy theory.”\n\nThrough further research, I was able to establish that this geoengineering / terraforming experiment was also funded by the Nazi-linked Alfred P. Sloan Foundation, which is linked to eugenics and depopulation agendas. I since launched Terraforming.news to provide focused coverage of this critical topic.\n\nNow, Reuters admits the project is real, and they have just reported that Sweden’s space agency has cancelled the experiment due to pushback from, “Sweden’s indigenous Saami reindeer herders.”\n\nThe Reuters deception about the project continues, of course, as they dishonestly call the experiment “solar geoengineering.” That’s a deliberate misnomer. It’s actually terraforming of planet Earth as part of an effort to exterminate humankind and prepare Earth for a post-human era (which I’ve also been reporting since at least 2019).\n\nThe global extermination experiment is funded in part by Bill Gates and run by Harvard University researchers, all of whom pursue anti-human agendas that are deliberately designed to sharply decrease human populations across the planet. (This is their stated goal.)\n\nObviously, blocking the sun would shut down photosynthesis across the entire planet, resulting in a catastrophic collapse of every ecosystem on the planet (and in the oceans). Human civilization would cease to exist, and the global biosphere would plunge into a mass extinction that would, in effect, sterilize the planet of nearly all current life.\n\nThis is the goal of Bill Gates, who has also been spearheading infertility technologies and covid vaccines that are right now killing people all over the planet (with many millions more to die in the coming months from vaccine side effects).\n\nFor a full, detailed, scientific explanation of how this Bill Gates terraforming experiment would utterly destroy all live on Earth as we know it, watch my detailed “Oblivion Agenda” video here:\n\nEven Reuters admits, “potential risks are unclear,” but fails to mention the risk of a global biosphere collapse resulting from a loss of photosynthesis. Only incredibly insane or stupid “scientists” would even be involved in such a dangerous project, and they are engaging in crimes against Earth and crimes against humanity, placing all life on our planet at risk of a catastrophic collapse. Any scientist pushing terraforming of Earth should be arrested, prosecuted and jailed.\n\nFinally, a few environmentalists have decided that the total destruction of planet Earth might not be so “green” after all\n\nMany environmentalists are waking up to this reality and pushing back against the Bill Gates terraforming experiment. Even though most so-called “environmentalists” are mentally ill carbon haters who think carbon is evil and that carbon dioxide is a “pollutant,” some of these groups are coming around to the realization that photosynthesis might actually be important for life on Earth after all. (It’s amazing, perhaps they have a few brain cells still functioning…)\n\nToday’s Situation Update covers this topic in more detail, along with suggestions that the correct way to run this experiment would be to launch a mask-wearing Fauci into high orbit to see if he can block the sun. And maybe catapult all the vaccinated people into the stratosphere too, since they obviously have a death wish and don’t understand anything about real science.\n• Shocking new evidence that masks contain toxic chemicals that cause nose and throat irritation.\n• More people getting insanely painful post-vaccine rashes that cover their entire bodies.\n• Post-vaccine Brazilian variant of covid now appearing in Michigan, despite all the mask mandates and vaccine indoctrination.\n• J&J vaccine manufacturer screws up 15 million doses because they’re hiring workers in Baltimore, a collapsed libtard city.\n\nCatch all these stories and more in today’s Situation Update podcast:\n\nI’ll be posting a short podcast this weekend about the criminal histories of vaccine manufacturers. Each week day, you can catch a new, full podcast at:", "opengraph": {"title": "Situation Update, April 2nd: Bill Gates’ mad science TERRAFORMING scheme blocked by reindeer herders", "type": "article", "url": "https://www.geoengineering.news/2021-04-02-situation-update-april-2nd-bill-gates-terraforming-scheme-blocked-by-reindeer-herders.html", "site_name": "GeoEngineering News", "description": "Bill Gates is an anti-human depopulation zealot who wants to exterminate humankind by blocking the sun and collapsing the global food supply. His mad science experiment to launch this global death initiative is called the “SCoPEx” project, which I first reported back in 2019. At that time, the fake news media claimed all reports about […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/09/HRR-2021-04-02-Situation-Update.jpg"}, "tags": ["geoengineering", "Earth", "environ", "bill gates", "depopulation", "Ecology", "extinction", "terraforming"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2019-09-06-project-scopex-bill-gates-has-a-plan-to-carry-out-planetary-genocide.html", "https://www.naturalnews.com/2019-09-17-global-geoengineering-chemtrails-experiment-funded-by-nazi-linked-alfred-p-sloan-foundation.html", "http://Terraforming.news", "https://news.trust.org/item/20210331165317-oulyk/", "http://Brighteon.com/4f89484c-6f33-43f2-9ac0-7f82dc7824a0", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2021-04-02-situation-update-april-2nd-bill-gates-terraforming-scheme-blocked-by-reindeer-herders.html&linkname=Situation%20Update%2C%20April%202nd%3A%20Bill%20Gates%E2%80%99%20mad%20science%20TERRAFORMING%20scheme%20blocked%20by%20reindeer%20herders", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}