{"result_id": "129007", "URL": "https://www.geoengineering.news/2022-10-26-hurricane-ian-survivors-casualties-may-be-underreported.html", "timestamp": "2023-04-25 15:14:10 CEST+0200", "meta": {"description": "Fort Myers residents Kynse Leigh Agles and Brianne Casey told journalist Annalisa Pesek that Hurricane Ian casualties may have been underreported. “I have a lot of friends and family that are fishermen and have been running humans and supplies back and forth from the islands. And there are many stories of how many bodies have actually been […]", "lang": "en", "keywords": "badclimate,big government,climate engineering,climate science,coverup,death toll,deception,FEMA,Florida,food collapse,food supply,geoengineering,Hurricane Ian,Joe Biden,national security,underreported,weather control,weather terrorism,weather warfare", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.geoengineering.news/2022-10-26-hurricane-ian-survivors-casualties-may-be-underreported.html", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineering.news", "title": "Hurricane Ian survivors: Casualties in Fort Myers may have been underreported", "cleaned_text": "Hurricane Ian survivors: Casualties in Fort Myers may have been underreported\n\nFort Myers residents Kynse Leigh Agles and Brianne Casey told journalist Annalisa Pesek that Hurricane Ian casualties may have been underreported.\n\n“I have a lot of friends and family that are fishermen and have been running humans and supplies back and forth from the islands. And there are many stories of how many bodies have actually been recovered. There have been bodies recovered from the river,” said Agles. “This is a very touchy subject, but I think that the truth will eventually come out.”\n\nOfficial records show that 55 deaths have been reported in Lee County, which includes Fort Myers, Sanibel and Pine Island.\n\nHurricane Ian, one of the most devastating and destructive hurricanes in the history of the state of Florida, made landfall in the southwest coast community of Fort Myers on September 29, decimating homes and businesses and claiming dozens of lives.\n\nCasey and Agles were proud of the resilience shown by their community.\n\n“Our community is amazing, working with local government agencies to give us what we need. Even before the Salvation Army came in, before Red Cross was here, we had the Cajun Navy, who staged airboats, flats, boats and they were doing recovery efforts before the National Guard and the Coast Guard were here,” Agles said.\n\nThe Cajun Navy Ground Force backfills donated resources, when crisis support systems become overwhelmed. “During the crisis aftermath caused by natural disasters, we believe good citizens want to help their neighboring communities but just need an effortless way to engage,” its website states.\n\nAgles also commended local businesses that stepped up while Casey praised their neighbors who were quick to volunteer in clearing out their houses and driveways.\n\nBut both hurricane survivors were not impressed with the Federal Emergency Management Agency (FEMA), citing their disastrous experiences in getting the federal disaster aid while they deal with displacement issues.\n\n“Today I got back on the FEMA website and they’ve given me a housing allowance for two months. That doesn’t even cover the timeframe that take my flood insurance to even decide what the payout is going to be because the insurance can take up to months and months [before] it gives you the money,” Casey shared.\n\nAgles can relate to that as she still has open insurance claims on homes from Hurricane Irma, which hit the state five years ago.\n\nFederal government may have weaponized Hurricane Ian to support climate change narrative\n\nObservers are saying that the federal government has been doing weather manipulation for a while now and it must have perfected weaponizing the storm. (Related: Federal government may have “weaponized” Hurricane Ian to magnify climate change narrative.)\n\nHurricane Ian was said to be the deadliest tempest in Florida since the 1935 Labor Day hurricane. President Joe Biden, meanwhile, said that Hurricane Ian “ends discussion” on climate change.\n\nEducator and activist Peggy Hall has found documents from over 50 years ago, which showed that the government has been manipulating hurricanes and forest fires for its own benefit.\n\nThe documents indicated that the Department of the Navy and the Department of the Air Force, along with General Electric, worked together to manipulate hurricanes.\n\n“The bombshell information was unearthed by Hall in a paper published by General Electric titled History of Project Cirrus from 1947 to 1952, which was a study of how cloud particles and cloud modifications can affect hurricanes,” a NewsPunch article stated.\n\nAccording to Hall, the purpose of government hurricane and forest fire manipulation is “to instill fear, uncertainty and inflict hardship on certain population centers.” The files also sparked suspicions that the Biden administration is also using hurricanes and forest fires to build the case for climate change solutions, including carbon taxes and rolling climate lockdowns.\n\nVisit Disaster.news for more stories about the devastation brought by Hurricane Ian to Florida and neighboring areas.\n\nWatch the full segment of Pesek’s interview with hurricane survivors Agles and Casey below.\n\nThis video is from the New American channel on Brighteon.com.\n\nHealth Ranger Report: Mike Adams and geoengineering expert Dane Wigington discuss how Hurricane Ian may have been WEAPONIZED.\n\nHurricane Ian puts further stress on already strained supply chain that Biden regime has failed to address.\n\nHurricane Ian leaves over TWO MILLION Floridians without power.", "opengraph": {"title": "Hurricane Ian survivors: Casualties in Fort Myers may have been underreported", "type": "article", "url": "https://www.geoengineering.news/2022-10-26-hurricane-ian-survivors-casualties-may-be-underreported.html", "site_name": "GeoEngineering News", "description": "Fort Myers residents Kynse Leigh Agles and Brianne Casey told journalist Annalisa Pesek that Hurricane Ian casualties may have been underreported. “I have a lot of friends and family that are fishermen and have been running humans and supplies back and forth from the islands. And there are many stories of how many bodies have actually been […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/10/Hurricane-Irma-satellite.jpg"}, "tags": ["geoengineering", "climate engineering", "death toll", "big government", "Joe Biden", "underreported", "weather control", "national security", "Florida", "food collapse", "weather terrorism", "deception", "coverup", "weather warfare", "food supply", "Hurricane Ian", "climate science", "FEMA"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/f6b66191-c4d4-4c36-a2c2-9b13c0509144", "https://thenewamerican.com/hurricane-ian-traumatized-yet-courageous-floridians-share-their-stories-of-survival/", "https://www.gocajunnavy.org/about/", "https://naturalnews.com/2022-10-19-federal-government-weaponized-hurricane-ian-climate-change.html", "https://climate.news/", "https://newspunch.com/unearthed-us-govt-docs-reveal-feds-are-manipulating-hurricanes/", "https://disaster.news/", "https://www.brighteon.com/f6b66191-c4d4-4c36-a2c2-9b13c0509144", "https://www.brighteon.com/channels/thenewamerican", "https://naturalnews.com/2022-10-05-adams-wigington-hurricane-may-have-been-weaponized.html", "https://collapse.news/2022-10-04-hurricane-ian-puts-further-stress-on-supply-chain.html", "https://disaster.news/2022-10-04-hurricane-ian-two-million-floridians-without-power.html", "https://chaos.news/2022-10-03-hurricane-ian-devastates-florida-recovery-to-take-years.html", "https://www.brighteon.com/f6b66191-c4d4-4c36-a2c2-9b13c0509144", "https://thenewamerican.com/hurricane-ian-traumatized-yet-courageous-floridians-share-their-stories-of-survival/", "https://www.gocajunnavy.org/about/", "https://newspunch.com/unearthed-us-govt-docs-reveal-feds-are-manipulating-hurricanes/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-10-26-hurricane-ian-survivors-casualties-may-be-underreported.html&linkname=Hurricane%20Ian%20survivors%3A%20Casualties%20in%20Fort%20Myers%20may%20have%20been%20underreported", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}