{"result_id": "129023", "URL": "https://geoengineering.news/2022-02-04-climate-engineering-can-bring-populations-down.html", "timestamp": "2023-04-25 15:14:19 CEST+0200", "meta": {"description": "Geoengineering expert Dane Wigington branded climate engineering as “the crown jewel weapon of the military industrial complex.” It is a weapon that can bring populations to their knees without them ever knowing they’re under assault. “It can target crops and it can have cognitive effect. We have a decline in IQ in the U.S. alone […]", "lang": "en", "keywords": "badhealth,badpollution,brain function,brain health,Climate,climate engineering,conspiracy,Dane Wigington,enviroment,geoengineering,globalists,military-industrial complex,terraforming,The Dimming,tyranny,weather control,Weather modification,weather terrorism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://geoengineering.news/2022-02-04-climate-engineering-can-bring-populations-down.html", "encoding": "UTF-8"}, "image": null, "domain": "geoengineering.news", "title": "Climate engineering: Weapon that can bring populations to their knees without them knowing they’re under attack", "cleaned_text": "Climate engineering: Weapon that can bring populations to their knees without them knowing they’re under attack\n\nGeoengineering expert Dane Wigington branded climate engineering as “the crown jewel weapon of the military industrial complex.” It is a weapon that can bring populations to their knees without them ever knowing they’re under assault.\n\n“It can target crops and it can have cognitive effect. We have a decline in IQ in the U.S. alone of six to nine points. That’s staggering,” Wigington said during a recent episode of “The Alex Jones Show.”\n\n“This is all madness making us dumber by the day. That’s a scientific statistical fact based on science study on aluminum and its effect on our brain function. Bottom line is: This is an assault from every imaginable direction. If we don’t deal with this hole at the bottom of the boat, the boat’s going to go down.”\n\nWigington is the executive producer of the groundbreaking climate engineering documentary film “The Dimming.” He is also the lead researcher and administrator of the website GeoengineeringWatch.org.\n\nA former employee of Bechtel Power Corporation, Wigington has a background in solar energy and was a licensed contractor in California and Arizona. He has devoted the past 20 years of his life to constant research on the issues of covert global climate engineering operations, and to expose and halt them.\n\nWigington has appeared in numerous interviews about his efforts to educate the public on the extremely dire environmental and health dangers the people are facing, as well as the ongoing global climate intervention programs.\n\nAccording to Wigington, climate engineering operations were first deployed over the polar regions immediately after World War II and had big ramp-ups in the 1990s. “The more damage climate engineering does to the climate and the life support systems of the planet, the more they double down on these operations,” he said. (Related: Geoengineering and weather modification: The dangers of environmental modification techniques.)\n\nTo those in doubt that humans are capable of putting the human race at risk of possible extinction, Wigington said: “I would challenge people to consider the fact that those in power have detonated about 2,400 nuclear weapons on planet Earth, which is contaminated every single fiber of the web of life.”\n\nAll about power and control\n\nWigington noted that every aspect of these programs is about power and control. And at this point, it’s also about thinning the herd.\n\n“We know from psychoanalysis that those in power, those who are addicted to power, they have various forms of deficiencies. And here’s the common thread based on psychoanalysis. There’s a near-total lack of comprehension as to the consequences of their actions, even to themselves. That power is so addictive that they cannot stop and will not stop,” Wigington said.\n\nHe was, of course, referring to the globalists who are behind the weather control program.\n\n“As of 1977, we have 239 acknowledged open-air biological tests by the U.S. military over U.S. populations without their knowledge or consent. Why would we think that they’re not engaged in biological dispersion?”\n\nThe key takeaway in all these, Wigington said, is that there is no benevolence in the climate engineering operations.\n\n“There are many layers to these operations. The ionizing of the atmosphere is used to make it more electrically conductive for over the horizon communication – for EMP offense and defense,” Wigington said. “We have weather as a weapon, a weapon with which populations are completely unaware that this is occurring.”\n\nIn the documentary “The Dimming,” Wigington presented conclusive evidence to show that the planet is not being destroyed by global warming as defined by the globalists. But it is being destroyed by the globalists themselves through their weather modification efforts to dim the sun by spraying nanoparticles into the atmosphere and then using microwave transmissions such as 5G to weaponize the weather.\n\nAccording to the documentary, the forest fires on the west coast in late 2020 and the winter storm that hit Texas early last year are all related to the globalists’ militarized weather modification programs. The documentary also pointed out that these climate engineering programs are causing far more sickness and disease than any virus.\n\nPlaying God: US government funds geoengineering, a controversial and deadly “backup plan” to alter Earth’s atmosphere in the name of “climate science.”\n\nAre industrial farming practices and geoengineering destroying the Earth’s soil?\n\nENGINEERED ICE AGE: Congress funds NOAA scientist for geoengineering project to cool the Earth by artificially dimming the sun.\n\nWatch the video below to know more about the globalists’ weather control program.\n\nThis video is from the InfoWars channel on Brighteon.com.", "opengraph": {"title": "Climate engineering: Weapon that can bring populations to their knees without them knowing they’re under attack", "type": "article", "url": "https://www.geoengineering.news/2022-02-04-climate-engineering-can-bring-populations-down.html", "site_name": "GeoEngineering News", "description": "Geoengineering expert Dane Wigington branded climate engineering as “the crown jewel weapon of the military industrial complex.” It is a weapon that can bring populations to their knees without them ever knowing they’re under assault. “It can target crops and it can have cognitive effect. We have a decline in IQ in the U.S. alone […]", "image": "https://www.geoengineering.news/wp-content/uploads/sites/132/2022/02/florida-climate-engineering-lvap-1-28-2017.png"}, "tags": ["The Dimming", "conspiracy", "climate engineering", "Dane Wigington", "Climate", "geoengineering", "weather control", "brain function", "globalists", "Weather modification", "brain health", "tyranny", "weather terrorism", "enviroment", "military-industrial complex", "terraforming"], "tweets": [], "movies": [], "links": ["http://brainfunction.news", "https://naturalnews.com/2021-08-17-look-at-dangers-of-environmental-modification-techniques.html", "http://weatherterrorism.com", "https://healthimpactnews.com/2021/urgent-new-documentary-proves-climate-engineering-by-controlling-the-weather-not-global-warming-is-destroying-life-and-the-planet-immediate-danger-far-greater-than-covid-19/?utm_campaign=Hot%20News&utm_medium=email&_hsmi=116552814&_hsenc=p2ANqtz--_gZXok6s05zU_ASfIl2zzfxZNA-Kh92iAaxn4EDtmcNSKYgdsck_y7kPQcm2xIWWzflKvr30-puJuo5B2XVjtgTCwiw&utm_content=116552814&utm_source=hs_email", "https://weatherterrorism.com/2021-06-03-geoengineering-controversial-plan-to-cool-global-temperatures.html", "https://naturalnews.com/2019-02-28-industrial-farming-geoengineering-destroy-earths-soil.html", "https://chemtrailsnews.com/2021-06-21-another-ice-age-noaa-geoengineering.html", "https://www.brighteon.com/296c3067-75ca-4bc4-8ba3-df0fa8c56e4b", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.brighteon.com/296c3067-75ca-4bc4-8ba3-df0fa8c56e4b", "https://healthimpactnews.com/2021/urgent-new-documentary-proves-climate-engineering-by-controlling-the-weather-not-global-warming-is-destroying-life-and-the-planet-immediate-danger-far-greater-than-covid-19/?utm_campaign=Hot%20News&utm_medium=email&_hsmi=116552814&_hsenc=p2ANqtz--_gZXok6s05zU_ASfIl2zzfxZNA-Kh92iAaxn4EDtmcNSKYgdsck_y7kPQcm2xIWWzflKvr30-puJuo5B2XVjtgTCwiw&utm_content=116552814&utm_source=hs_email", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgeoengineeringnews%2F2022-02-04-climate-engineering-can-bring-populations-down.html&linkname=Climate%20engineering%3A%20Weapon%20that%20can%20bring%20populations%20to%20their%20knees%20without%20them%20knowing%20they%E2%80%99re%20under%20attack", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}