{"result_id": "130029", "URL": "https://www.geoengineeringwatch.org/next-duty-to-warn-column-two-of-the-culprits-that-are-behind-americas-iatrogenic-over-vaccination-monster/", "timestamp": "2023-04-25 15:15:35 CEST+0200", "meta": {"description": "Exposing the climate geoengineering cover-up", "lang": "en", "keywords": "geoengineering, geoengineering, chemtrails, chemtrail, jet trails, Dane Wigington, chemtrails, geoengineering weather modification, climate engineering, aerosol spraying, extreme weather, vegetation die off, plant die off, tree die off, species extinction, asthma, autism, alzheimer's, climate engineering, dementia, aluminum, vitamin d deficiency, fibromyalgia, memory problems, memory, difficulty concentrating, drought, deluge, heavy wet snow, ice nucleation, heavy metal toxicity, government denial, scientist lies, government disinformation, agenda 21, weather derivatives, NWO, EMF, HAARP,chemtrails, chemtrail, jet trails, Dane Wigington, chemtrails, weather modification, spraying, why chemtrails, aerosols, jets spraying, spraying jets, contrails, what in the world are they spraying, what in the world are they spraying dvd, what in the world are they spraying film, 2012 conspiracies,2012 conspiracy,2012 government conspiracy,9 11 conspiracy,911 conspiracy books,911 conspiracy debunked,911 conspiracy video,aerial geoengineering,aids conspiracy,airplane chemtrails, chemtrails, aluminum chemtrails,area 51 conspiracies,area 51 conspiracy,atmospheric geoengineering,barack obama conspiracy,barium chemtrails,barium in chemtrails,big brother conspiracy,big brother government control,bilderberg group conspiracy,black chemtrails,bohemian grove conspiracy,can government control weather,can the government control the weather,chem trail,chem trails,aluminim aerosols, sky trails, contrails, weather patterns, weather modification, weather, haarp, chemical trails,chemicals in chemtrails,chemtrail,chemtrail 2010,chemtrail central,chemtrail clouds,chemtrail conspiracy,chemtrail conspiracy theory,chemtrail documentary,chemtrail evidence,chemtrail hoax,chemtrail movie,chemtrail photos,chemtrail pics,chemtrail pictures,chemtrail plane,chemtrail planes,chemtrail proof,chemtrail spraying,chemtrail symptoms,chemtrail truth,chemtrail video,chemtrail vs contrail, chemtrailing, chemtrails, chemtrails 2008, chemtrails 2010,chemtrails 911,chemtrails alex jones,chemtrails aluminum,chemtrails arizona,chemtrails atlanta,chemtrails barium,chemtrails beck,chemtrails california,chemtrails chemical analysis,chemtrails chicago,chemtrails conspiracy,chemtrails contrails,bill gates, keith caldera, chemtrails dead birds, bird deaths, chemtrails debunked,chemtrails documentary,chemtrails exposed,chemtrails facts,chemtrails florida,chemtrails geoengineering,chemtrails global warming,chemtrails haarp,chemtrails hoax,chemtrails las vegas,chemtrails los angeles,chemtrails lyrics,chemtrails morgellons,chemtrails movie,chemtrails photos,chemtrails pictures,chemtrails planes,chemtrails proof,chemtrails purpose,chemtrails san diego,chemtrails san francisco,chemtrails today,chemtrails truth,chemtrails tucson,chemtrails video,chemtrails videos,chemtrails vs contrails,chemtrails weather modification,chemtrails youtube,cia conspiracies,cia conspiracy,climate change,climate change of global warming,climate engineering,climate geoengineering,climatic changes,conspiracies,conspiracy,fish deaths, bee die off, conspiracy 2012,conspiracy 911,conspiracy archive,conspiracy blog,conspiracy blogs,conspiracy books,conspiracy con,conspiracy define,conspiracy definition,conspiracy dvds,conspiracy forum,conspiracy forums,conspiracy jesse ventura,conspiracy meaning,conspiracy movie,conspiracy planet,conspiracy reality tv,conspiracy sites,conspiracy theories list,conspiracy theory books,conspiracy videos,conspiracy websites,conspiracy world,contrail vs chemtrail,contrails,contrails chemtrails,contrails conspiracy,controlling government,corporate control of government,corporations control government,david keith geoengineering,debunking chemtrails,define conspiracy,define geoengineering,definition conspiracy,definition of conspiracy,dia conspiracy,does the government control the media,does the government control the weather,famous conspiracies,federal reserve conspiracy,flu shot conspiracy,freedom from government control,geo engineering,geo engineering projects,geoengineer,geoengineering,geoengineering chemtrails,geoengineering climate change,geoengineering definition,geoengineering global warming,geoengineering projects,geoengineering the climate,geoengineering.org,geoengineers,geoengineers inc,geoengineers seattle,geotechnical,geotechnical engineer,geotechnical engineering,glenn beck conspiracy,global warming,global warming conspiracy,global warming global warming,government admits chemtrails,government conspiracies 2012,government conspiracy,government conspiracy 2012,government control,government control internet,government control media,government control of business,government control of economy,government control of education,government control of food,government control of internet,government control of internet 2010,government control of media,government control of the internet,government control of the media,government control over internet,government control over media,government control quotes,government control weather,government controlled,government controlled by corporations,government controlled economy,government controlled healthcare,government controlled internet,government controlled media,government controlling internet,government controlling media,government controlling the weather,government controlling weather,government controls,government controls everything,government controls media,government controls weather,government internet control,government media control,government mind control,government mind control conspiracy,government mind control experiments,government mind control programs,government pensions out of control,government pest control,government population control,government price control,government price controls,government weather control,h1n1 conspiracy,hurricane katrina conspiracy,illuminati chemtrails,illuminati conspiracies,illuminati conspiracy 2012,internal control and corporate governance,internet government control,it s a conspiracy,jay z conspiracy,jesse ventura conspiracy,jesuit conspiracy,jfk assassination conspiracies,jfk conspiracy,jfk jr conspiracy,less government control,list of conspiracies,lizard people conspiracy,los angeles chemtrails,marilyn monroe conspiracy,masonic conspiracy,meaning of conspiracy,media controlled by government,michael murphy chemtrails,military conspiracies,moon base conspiracy,morgellons and chemtrails,morgellons chemtrails,movie conspiracy,nasa chemtrails,new conspiracy theories,nwo conspiracy,obama conspiracies,obama conspiracy,oil leak conspiracy,one world order conspiracy,out of control government spending,pearl harbor conspiracy,planetary engineering,population control conspiracy,prince chemtrails,proof of chemtrails,proven conspiracies,purpose of chemtrails,quotes on government control,sept 11 conspiracy,september 11 conspiracy,september 11th conspiracy,solar warming,stop chemtrails,stop geoengineering,stratospheric aerosol geoengineering,stratospheric geoengineering,the absence of any government control,the climate change,the global warming,the government controls the weather,the obama conspiracy,timothy mcveigh conspiracy,too much government control,top conspiracies,top conspiracy theories,true conspiracy theories,tupac death conspiracy,twa 800 conspiracy,ufo conspiracies,un bans chemtrails,usa today chemtrails,usa today geoengineering,vatican conspiracy,ventura conspiracy,volokh conspiracy,what does the federal government control,what is conspiracy,wikileaks chemtrails,wikipedia chemtrails,william thomas chemtrails,world conspiracies,world conspiracy,youtube chemtrails", "favicon": "wp-content/uploads/2012/04/favicon.ico", "canonical": "https://www.geoengineeringwatch.org/next-duty-to-warn-column-two-of-the-culprits-that-are-behind-americas-iatrogenic-over-vaccination-monster/", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineeringwatch.org", "title": "Duty To Warn: Two Of The Culprits That Are Behind America’s Iatrogenic Over-Vaccination Monster", "cleaned_text": "The Culprits at the CDC and FDA That Helped Create America’s Iatrogenic Over-Vaccination Monster\n\nOver the past several years I have spent many hours catching up on the voluminous research about vaccine dangers that my medical school professors never mentioned and that my continuing medical education lecturers never taught me later when I was in rural family practice. There was never any mention about adverse effects from vaccinations in the medical journals that I read.\n\nEverything that I read misled me about the rapidly increasing vaccine injuries and deaths that paralleled the rapidly increasing incidence of autism spectrum disorders and the equally rapidly increasing incidence of childhood autoimmune disorders over the 40 years that I practiced medicine.\n\nI know that the information I have gleaned over these years will be useful to the millions of increasingly frustrated and angry parents and grandparents of America’s fully vaccinated, over-vaccinated and therefore vaccine-injured children. These angry parents have seen their children injured and then, to add insult to injury, they have been cruelly ignored, cruelly silenced and often cruelly reviled by the physicians, clinics and hospitals that have been in the business of falsely reassuring parents about the safety of cocktails of vaccines that contain neurotoxic ingredients and that are simultaneously injected into immunologically-immature infants.\n\nThe “healthcare-providing” entities that I was once affiliated with, have tragically failed to emphasize or even mention – I suppose in the name of corporate profits or sheer ignorance – that the tiny bodies, tiny muscles and immature brains that are being targeted by Big Pharma to receive sublethal doses of a toxic brew of chemicals and other substances (particularly mercury, aluminum and live viruses). America’s over-vaccination agendas is making a lot of money for any number of compassionless corporate entities who never had to take – or don’t feel compelled to honor – the Hippocratic Oath.\n\nAnd thus those innocent babies and children, who are physically, neurologically and immunologically immature are a perfect set-up for serious, brain-damaging and other lethal complications that manifest in any number of chronic vaccine-induced (and thus iatrogenic) disorders that the guilty vaccine industries will go to any lengths to cover-up.\n\nThe parents of vaccine-injured or killed children are justifiably angry for a lot of reasons. Their demands for justice for their injured children are understandable and unquenchable. Just listen to the hundreds of testimonies from parents on the VAXXED YouTube channel. (https://www.youtube.com/channel/UCwZDSEpPvE398OLazdituKQ)\n\nThese parents with horror stories about vaccine injuries are consistently stone-walled by those entities that recommended or administered the vaccines that caused their children’s wounded bodies and brains. Those responsible entities frequently went into denial or actually attacked the parent for being so bold as to even mention the possibility of an iatrogenic injury.\n\nIt was bad enough for parents to come to the logical conclusion that the potentially lethal vaccine ingredients had damaged their children, but they were often humiliated by their previously trusted physicians and clinics who refused to listen to their heart-felt testimony or to pay attention to the research they had done confirming their suspicions.\n\nAnd then, adding more fuel to the fire, these newly-discovered-to-be-untrustworthy physicians and clinics sometimes had the audacity to fire those traumatized families and ban them from receiving future care! Those physicians and clinics had, to their eternal shame, forgotten about the truism that said: “hell hath no fury like a woman scorned”.\n\nFor these traumatized parents, their hell began when they witnessed their previously developmentally well child become seriously ill with an illness that might continue for the remainder of their disabled lives. Most parents are dubious about allowing their children to be injected with 8 or 9 (untested for safety) intramuscularly-injected antigens at one setting, but no discussion about adverse effects is allowed. If there was an adverse effect many parents logically went searching for information about vaccine toxicity, which their physicians usually knew nothing about, refused to even check out the possibility and therefore were worse than useless in the search for an accurate diagnosis and thus an effective treatment.\n\nTragically, modern, over-busy, double-booked physicians can’t find the time or energy (or inclination) to read any medical journals other than the ubiquitous freebie journals and Big Pharma subsidized medical journals. Even previously prestigious journals like JAMA, NEJM, etc are shamefully allowing Big Pharma mercenaries to get their pseudoscience published. The money behind Big Pharma’s advertising gives for-profit corporate entities the influence to promote their toxic drugs and vaccines.\n\nSometimes vaccine injuries only became manifest in a delayed fashion months or years after the “mandatory” 2 month, 4 month, 6 month, 12 month, 15 month, and pre-school shots. Sometimes the injuries happen the same day or even in the doctor’s office immediately after the inoculations. When the adverse reaction happens quickly, parents resent the typical lame explanation of “that was just a coincidence” or “that is just normal reaction, nothing to worry about”.\n\nSometimes the adverse reactions from vaccine toxicity only manifests after the second or third Gardasil shot. Sometimes the adverse reactions happen within hours or days. There are many examples in the literature of Sudden Infant Death Syndrome (SIDS) that killed previously well babies within hours of the last batch of shots. There are also many examples of “near SIDS” episodes or new onset of a chronic seizure disorder soon after the last shot. Some SIDS episodes have been erroneously called “shaken baby syndrome” because the toxic vaccine ingredients cause chemical and inflammatory trauma to the brain that resembles cerebral contusions.\n\nWhat has often been frustrating for parents of vaccine-injured children is the fact that the mainstream media – also seriously under the influence of Big Pharma’s wealthy and influential advertisers – have never allowed Big Pharma’s skeptics or Big Pharma’s victims to be heard. The media is naturally concerned about the money that could be lost when a big advertiser expresses discontent about news programming that could be critical to their products. That reality has silenced many journalists that ordinarily would love to do some real investigative journalism.\n\n<<<Power Tends to Corrupt and Absolute Power Corrupts Absolutely>>>\n\nEconomically-powerful and politically-powerful entities like the multi-millionaires and corporations that are associated with Wall Street, Big Pharma, Big Oil, Big Business, Big Agribusiness, Big Chemical, Big Insurance, Big Weapons, etc usually get whatever they want. The corporations represented in those categories have unlimited amounts of money and well-cultivated, albeit unholy relationships with easily-bribed state and federal legislators. That has resulted in a multitude of pro-corporate laws getting on the books which makes it too easy to commit crimes against humanity and then cover-up those crimes, with no attention from the equally corporate-controlled and deeply co-opted mainstream media that therefore black-lists anti-Big Pharma scholars.\n\nThere are unlimited numbers of minor mercenary entities beholden to Big Pharma that create the propagandistic televised drug commercials and the advertisements in popular medical journals that seem to be widely trusted by their target audiences. And then there are the dozens of powerful physician trade and lobbying groups, which includes the AAP, the AAFP, the AMA, ACOG, the APA, etc, etc, that are all subsidized and therefore influenced by Big Pharma money.\n\n<<<The Over-Vaccination Agenda of the Big Pharma-Controlled CDC and FDA>>>\n\nMuch of the responsibility for the over-vaccination monster that the Big Pharma-controlled CDC and the Big Pharma-controlled FDA has created can be laid at the feet of two highly co-opted “advisory committees” composed largely of academic physicians who, by their nature, usually have some type of conflict of interest. It can be safely assumed that each member’s personal ethics is at potentially conflicted by their affiliations that could be either financial, academic, job security or professional. The two groups are\n\n1) the CDC’s Advisory Committee on Immunization Practices (ACIP) information is at https://www.cdc.gov/vaccines/acip/index.html and\n\n2) the FDA’s Vaccines and Related Biological Products Advisory Committee (VRBPAC) information is at https://www.fda.gov/AdvisoryCommittees/CommitteesMeetingMaterials/BloodVaccinesandOtherBiologics/VaccinesandRelatedBiologicalProductsAdvisoryCommittee/ucm129570.htm.\n\nThe membership list of the ACIP is printed in the appendix at the end of this column.\n\nEach of these committees is made up of well-paid, un-elected, academic professionals, bureaucrats and, in in the case of the (VRBPAC) two non-voting members that are employed by two Big Vaccine corporations (Sanofi and GSK). Why they were ever appointed to the committee in the first place is undisclosed, but they surely try to be influential as they can for their industry.\n\nThese committee members have been, just like most physicians in the US, heavily indoctrinated in the belief that all vaccines are safe and effective. The more powerful members of the group may even become hostile when their dogmas of vaccine safety and effectiveness are challenged. The members would be expected to be unapologetic when faced with the truth that vaccines are “inherently unsafe” and can even be deadly.\n\n<<<Reagan and the National Childhood Vaccine Injury Act of 1986>>>\n\nMany well-meaning physicians, nurse practitioners, nurses and assorted health clinic employees have been equally bamboozled, and they may even be unwitting defenders of an over-vaccination schedule that has been gradually made to be “the new normal” by sociopathic corporate powers ever since Ronald Reagan signed the National Childhood Vaccine Injury Act (NCVIA) on November 14, 1986.\n\nThat law was essentially written by Big Pharma lobbyists, but it was promoted and passed by ignorant, perhaps well-meaning but likely bribed legislators and then signed into law by an equally ignorant puppet president. Each of the promoters of that law made the mistake of trusting scheming, untrustworthy lobbyists and their sociopathic corporations who have made out like bandits developing and marketing unsafe vaccines ever since.\n\nScandalously, the NCVIA made it unlawful for parents of vaccine-injured or vaccine-killed children to sue the responsible vaccine corporations or other vaccine promoters when their unsafe vaccines harmed their children (which was epidemic prior to 1986). And ever since 1986, when the autism and childhood autoimmunity epidemics began, Big Pharma hasn’t had to spend much money on research or expensive vaccine safety measures because the use of their sometimes lethal products no longer elicit any medico-legal consequences.\n\nThe CDC’s ACIP and the FDA’s VRBPAC advisory committee folks have the connections to into an attack and destroy mode similar to what has happened throughout the history of medical establishment hegemony. One only has to recall what the medical establishment has repeatedly done to altruistic, whistleblowing physicians such as Andrew Wakefield and Ignaz Semmelweis and the uncounted number of similar whistle-blowing physicians throughout history. Semmelweis proved to the world that physician hand-washing prior to obstetrical deliveries prevented the fatal childbed fever, much to the outrage of the cognitive dissonance-afflicted medical establishment who thought he was crazy and thus refused to even look at the evidence that everybody else could clearly see was revolutionary and truthful.\n\nSemmelweis was thoroughly discredited by his physician colleagues and was later beaten to death in a hospital the end-result that was directly related for his discovery that challenged the establishment (that refused to believe that hygiene had anything to do with post-delivery infections).\n\nSimilarly, Andrew Wakefield was a victim of a cunningly well-planned smear campaign by the medical establishment that drummed him out of Britain when he proved that live viruses from GlaxoSmithKline’s MMR vaccine caused chronic viral bowel infections in a group of severely involved autistic children with chronic abdominal pain and diarrhea. Wakefield’s group discovery was bad news for the British vaccine giant Glaxo.\n\nThat well-done research – which has been replicated a handful of times elsewhere around the world – should have earned Wakefield and his group a Nobel prize for medicine. Instead, because his findings would surely have negatively impacted future profits for Glaxo and every vaccine corporation on the planet, Wakefield had to be falsely discredited and then made an example of, even though he had exposed an important, albeit unwelcome truth. Wealth is Power, and Power corrupts.\n\nParents of children who have not been vaccinated with intramuscularly-administered mercury, aluminum, live viruses and assorted vaccine contaminants have saved their kids from acquiring vaccine-induced autism spectrum disorders, vaccine-induced SIDS or vaccine-induced autoimmune disorders should be thankful, even if their children had a slightly increased risk of coming down with a case of measles, rubella, mumps, chicken pox, influenza or other childhood viral infection that any properly-nourished child will easily recover from. Another advantage of not being subjected to vaccination is that contracting usually benign viral infectious diseases of childhood means that the child will become immune for the rest of her life as opposed to the need to be given regular, potentially dangerous, potentially autoimmunity-inducing booster shots (that don’t always work anyway).\n\nBehind the ACIP and VRBPAC advisory committee members there are likely to be found well-hidden puppet-master and paymaster organizations may be even more guilty of being responsible for America’s on-going over-vaccination disaster. The wealth of these hidden corporate entities comes from the marketing, sales, promotion and over-use of unsafe and often quasi-experimental vaccines that are never proven to be safe or even effective. They are ill-gotten gains.\n\n<<<Forced Vaccinations in the Military, Forced Vaccinations in the Hospital and Forced Vaccinations in the Well Baby Clinic>>>\n\nMost physicians haven’t heard the real stories about the horrific autoimmunity, neurological, physical, chronic fatigue syndrome and brain-disabling disorders that have been among the worst of the many unintended consequences of the Pentagon’s ill-conceived mass vaccination campaign. Hundreds of thousands of Gulf War-era soldiers were given injections of the (un-approved-by-the-FDA) neurotoxic aluminum-laden series of six anthrax vaccine inoculations whether they were being deployed to the Middle East war zone or not. Our unfortunate but obedient US soldiers were mandated to submit to the shots or be court-martialed. Gulf War soldiers were forced against their wills – without the benefit of informed consent – to take those experimental shots. It is hard not to notice some of the ethical similarities between the Gulf War soldiers being forced to take their shots – or else – and the current Essentia Health situation for hospital employees in Duluth, Minnesota.\n\nHundreds of thousands of mature soldiers getting sickened and/or neurologically disabled because of being injected with multiple neurotoxic vaccines is sad enough, but what about the hundreds of millions of immunologically immature babies and children that are being routinely inoculated (intramuscularly) by ever-enlarging numbers and combinations of cocktails that are often administered simultaneously with no proof of short-term or long-term safety?\n\nWe physicians, nurses and clinics (and hospital staff) often have no idea what are the ingredients in vaccines. We tend to not take the time to read the wordy product information sheet. Shame on us. But what should frighten us caregivers is the fact that many of those vaccines contain ingredients that are known neurotoxins, mitochondrial toxins, cytotoxins, genotoxins, teratogens and mutagens. There are also contaminants that are occasionally found in vaccines when independent testing is done. That reality adds to what should be everybody’s concern about vaccine safety.\n\nWhat also frightens me is the fact that inoculation accidents can easily happen when the tip of the needle pierces and then inadvertently injects some of the vaccine directly into a small vein, where it is not supposed to go. The consequences of such accidents are not known but nothing good can happen when a toxic mix of chemicals – especially aluminum, mercury or live viruses – goes directly into the blood stream.\n\nSome victims of vaccine accidents may faint, some may vomit, some may have cardiac rhythm problems, some babies may have their first vaccine-induced seizure, some babies may die of SIDS within a day or two. Some of the vaccine toxins may go directly to the central nervous system through a leaky or dysfunctional blood-brain barrier (BBB) – a likelihood made more likely in the cases of children or young adults who place their electromagnetic radiation-emitting cell phones next to their brains or are otherwise over-exposed to other sources of wireless microwave technology, all of which are known to be toxic to the BBB.\n\nThe power of the FDA, the CDC and their various subsidiaries has been acquired thanks to their cozy relationship with for-profit corporate entities that make up what is called Big Pharma, Big Vaccine and Big Medicine, whose directly- and indirectly-related entities have been largely responsible for the many vaccine-induced disorders in America.\n\nUseful information about the Advisory Committee on Immunization Practices is available in the Reader’s archives.\n\nThe ACIP comprises medical and public health experts who develop recommendations on the use of vaccines in the civilian population of the United States. The recommendations stand as public health guidance for safe use of vaccines and related biological products.\n\nACIP was established under Section 222 of the Public Health Service Act (42 U.S.C. § 2l7a) and is governed by its charter.\n\nThe ACIP develops recommendations on how to use vaccines to control disease in the United States. The recommendations include the age(s) when the vaccines should be given, the number of doses needed, the amount of time between doses, and precautions and contraindications.\n\nProfessional organizations that work with the ACIP to develop the annual childhood and adult schedules include the American Academy of Pediatrics (AAP), the American Academy of Family Physicians (AAFP), the American College of Obstetricians and Gynecologists (ACOG), and the American College of Physicians (ACP).\n\nThe Committee's recommendations are forwarded to CDC’s Director for approval. Once the ACIP recommendations have been reviewed and approved by the CDC Director and the U.S. Department of Health and Human Services, they are published in CDC’s Morbidity and Mortality Weekly Report (MMWR). The MMWR publication represents the final and official CDC recommendations for immunization of the U.S. population.\n\nThe ACIP includes 15 voting members responsible for making vaccine recommendations. The Secretary of the U.S. Department of Health and Human Services (DHHS) selects these members following an application and nomination process. Fourteen of the members have expertise in vaccinology, immunology, pediatrics, internal medicine, nursing, family medicine, virology, public health, infectious diseases, and/or preventive medicine; one member is a consumer representative who provides perspectives on the social and community aspects of vaccination.\n\nIn addition to the 15 voting members, ACIP includes 8 ex officio members who represent other federal agencies with responsibility for immunization programs in the United States, and 30 non-voting representatives of liaison organizations that bring related immunization expertise.\n\nBelow is an abridged list of the 15 voting members, the 8 ex officio members and the 30 non-voting members. For the original unabridged list go to:\n\n https://www.cdc.gov/vaccines/acip/committee/membershtml\n\nChair\n\n BENNETT, Nancy, MD, MS, Professor of Medicine and Public Health Sciences, Director, Center for Community Health\n\n Co-director, Clinical and Translational Science Institute, University of Rochester School of Medicine and Dentistry\n\n Rochester, NY\n\n Term: 07/01/2015-06/30/2018\n\nExecutive Secretary\n\n COHN, Amanda, MD, Senior Advisor for Vaccines, National Center for Immunization and Respiratory Diseases, Centers for Disease Control and Prevention, Atlanta, GA\n\nATMAR, Robert L., MD\n\n John S. Dunn Clinical Research Professor in Infectious Diseases, Interim Chief, Section of Infectious Diseases\n\n Departments of Medicine and Molecular Virology & Microbiology, Baylor College of Medicine\n\n Chief, Infectious Diseases Service, Ben Taub General Hospital, Harris Health System, Houston, TX\n\n Term: 7/1/2016 – 6/30/2020\n\nEZEANOLUE, Echezona, MD, MPH\n\n Professor of Pediatrics and Public Health, Department of Epidemiology and Biostatistics\n\n Director, Global Health and Implementation Research Initiatives\n\n University of Nevada, Las Vegas, NV\n\n Term: 07/01/2015-06/30/2019\n\nHUNTER, Paul, MD\n\n Associate Professor of Family Medicine and Community Health, University of Wisconsin School of Medicine and Public Health, Associate Medical Director, City of Milwaukee Health Department, Milwaukee, WI\n\n Term: 7/1/2016 – 6/30/2020\n\nKEMPE, Allison, MD, MPH\n\n Professor of Pediatrics, Director of Primary Care Fellowship, University of Colorado School of Medicine, Director of Research, Division of General Academic Pediatrics, Director of Children’s Outcomes Research Program, The Children’s Hospital of Denver\n\n Denver, CO\n\n Term: 07/01/2013 – 12/31/2017\n\nMOORE, Kelly, MD, MPH\n\n Director, Tennessee Immunization Program, Tennessee Department of Health\n\n Assistant Clinical Professor, Department of Health Policy, Vanderbilt University School of Medicine\n\n Nashville, TN\n\n Term: 07/01/2015-06/30/2019\n\nREINGOLD, Arthur L., MD\n\n Professor of Epidemiology, Edward Penhoet Distinguished for Global Health and Infectious Disease\n\n Associate Dean for Research, School of Public Health, University of California\n\n Berkeley, CA\n\n Term: 07/01/2013-12/31/2017\n\nROMERO, José R., MD, FAAP\n\n Professor of Pediatrics, Horace C. Cabe Endowed Chair in Infectious Diseases\n\n Director, Pediatric Infectious Diseases Section, University of Arkansas for Medical Sciences and Arkansas Children’s Hospital\n\n Director, Clinical Trials Research, Arkansas Children’s Hospital Research Institute\n\n Little Rock, AR\n\n Term: 07/01/2014-06/30/2018\n\nSTEPHENS, David, MD\n\n Professor of Medicine, Division of Infectious Diseases, Chair, Department of Medicine, Emory University School of Medicine, Emory University\n\n Atlanta, GA\n\n Term: 07/01/2015-06/30/2019\n\nSZILAGYI, Peter MD, MPH\n\n Professor of Pediatrics, Executive Vice-Chair and Vice-Chair for Research, Department of Pediatrics, University of California, Los Angeles (UCLA)\n\n Los Angeles, California\n\n Term: 7/1/2016 – 6/30/2020\n\nACIP Ex Officio Members (#8)\n\n Centers for Medicare and Medicaid Services (CMS)\n\n HANCE, Mary Beth, Senior Policy Advisor, Division of Quality, Evaluations and Health Outcomes,\n\n Children and Adults Health Programs Group\n\n Center for Medicaid and CHIP Services, Centers for Medicare and Medicaid Services\n\n Baltimore, MD\n\nDepartment of Defense (DoD)\n\n DEUSSING, ERIC, MD, MPH, Commander, Medical Corps, United States Navy\n\n Department of Defense Liaison, Centers for Disease Control and Prevention\n\n Atlanta, GA\n\nDepartment of Veterans Affairs (DVA)\n\n KIM, Jane A., MD, MPH, Deputy Chief Consultant for Preventive Medicine, Office of Patient Care Services, National Center for Health Promotion and Disease Prevention\n\n Durham, North Carolina\n\nFood and Drug Administration (FDA)\n\n SUN, Wellington, MD, Director, Division of Vaccines and Related Product Applications, Office of Vaccines Research and Review, Food and Drug Administration\n\n Rockville, MD\n\nNational Vaccine Program Office (NVPO)\n\n SHEN, Angela K., ScD, MPH, CAPT, U.S Public Health Service, Senior Science Policy Advisor\n\n Co-Chair National Adult and Influenza Immunization Summit, National Vaccine Program Office, Office of the Assistant Secretary for Health\n\n Washington, DC\n\nNational Institutes of Health (NIH)\n\n LAMBERT, Linda C., Ph.D., Chief, Respiratory Diseases Branch, Division of Microbiology and Infectious Diseases, NIAID/National Institutes of Health\n\n Bethesda, MD\n\nAmerican Academy of Pediatrics (AAP)\n\n Red Book Editor KIMBERLIN, David, MD, Professor of Pediatrics, Division of Pediatric Infectious Diseases\n\nAmerican College of Obstetricians and Gynecologists (ACOG)\n\n AULT, Kevin A., MD, FACOG, Professor and Division Director\n\nAmerican College of Physicians (ACP) (alternate)\n\n POLAND, Gregory A., MD, Mary Lowell Professor of Medicine and Infectious Diseases\n\n Mayo Clinic, Rochester, MN\n\nAssociation for Prevention Teaching and Research (APTR)\n\n McKINNEY, W. Paul, MD, Professor and Associate Dean\n\nAssociation of State and Territorial Health Officials (ASTHO)\n\n ALEXANDER-SCOTT, Nicole, MD, MPH, Director of Health\n\nInfectious Diseases Society of America (IDSA) (alternate)\n\n BAKER, Carol J., MD, Professor of Pediatrics\n\n National Association of County and City Health Officials (NACCHO)\n\n ZAHN, Matthew, MD, Medical Director, Epidemiology\n\nNational Association of County and City Health Officials (NACCHO) (alternate)\n\n DUCHIN, Jeffrey, MD, Health Officer and Chief, Communicable Disease Epidemiology and Immunization Section, Public Health – Seattle and King County\n\nNational Immunization Council and Child Health Program, Mexico\n\n DURAN, Luis, MD, Director, Center for Children and Adolescent Health (CeNSIA)\n\nSociety for Adolescent Health and Medicine (SAHM)\n\n MIDDLEMAN, Amy B., MD, MSEd., MPH, Professor of Pediatrics\n\nSociety for Healthcare Epidemiology of America (SHEA)\n\n WEBER, David, MD, MPH, Professor of Medicine, Pediatrics, and Epidemiology", "opengraph": {"description": "Duty To WarnThe Culprits at the CDC and FDA That Helped Create America’s Iatrogenic Over-Vaccination MonsterBy Gary G. Kohls, MDDecember 4, 2017Over the past several years I", "title": "Duty To Warn: Two Of The Culprits That Are Behind America’s Iatrogenic Over-Vaccination Monster", "article_author": "Doug Diamond", "article_publisher": "https://www.facebook.com/geoengineeringwatch.org/", "image": "https://www.geoengineeringwatch.org/wp-content/uploads/2018/01/vaccine-dangers.jpg", "type": "article", "url": "https://www.geoengineeringwatch.org/next-duty-to-warn-column-two-of-the-culprits-that-are-behind-americas-iatrogenic-over-vaccination-monster/", "site_name": "Geoengineering Watch", "article:published_time": "2017-12-05T19:43:30+00:00", "article:modified_time": "2018-06-01T07:54:28+00:00", "updated_time": "2018-06-01T07:54:28+00:00", "image:width": "600", "image:height": "401"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fnext-duty-to-warn-column-two-of-the-culprits-that-are-behind-americas-iatrogenic-over-vaccination-monster%2F", "https://www.addtoany.com/share", "https://www.youtube.com/channel/UCwZDSEpPvE398OLazdituKQ", "https://www.fda.gov/AdvisoryCommittees/CommitteesMeetingMaterials/BloodVaccinesandOtherBiologics/VaccinesandRelatedBiologicalProductsAdvisoryCommittee/ucm129570.htm", "https://www.cdc.gov/vaccines/acip/index.html", "https://www.cdc.gov/vaccines/acip/index.html"], "authors": [], "publish_date": "2017-12-05T19:43:30+00:00"}