{"result_id": "130033", "URL": "https://www.geoengineeringwatch.org/category/health/", "timestamp": "2023-04-25 15:15:41 CEST+0200", "meta": {"description": "Exposing the climate geoengineering cover-up", "lang": "en", "keywords": "geoengineering, geoengineering, chemtrails, chemtrail, jet trails, Dane Wigington, chemtrails, geoengineering weather modification, climate engineering, aerosol spraying, extreme weather, vegetation die off, plant die off, tree die off, species extinction, asthma, autism, alzheimer's, climate engineering, dementia, aluminum, vitamin d deficiency, fibromyalgia, memory problems, memory, difficulty concentrating, drought, deluge, heavy wet snow, ice nucleation, heavy metal toxicity, government denial, scientist lies, government disinformation, agenda 21, weather derivatives, NWO, EMF, HAARP,chemtrails, chemtrail, jet trails, Dane Wigington, chemtrails, weather modification, spraying, why chemtrails, aerosols, jets spraying, spraying jets, contrails, what in the world are they spraying, what in the world are they spraying dvd, what in the world are they spraying film, 2012 conspiracies,2012 conspiracy,2012 government conspiracy,9 11 conspiracy,911 conspiracy books,911 conspiracy debunked,911 conspiracy video,aerial geoengineering,aids conspiracy,airplane chemtrails, chemtrails, aluminum chemtrails,area 51 conspiracies,area 51 conspiracy,atmospheric geoengineering,barack obama conspiracy,barium chemtrails,barium in chemtrails,big brother conspiracy,big brother government control,bilderberg group conspiracy,black chemtrails,bohemian grove conspiracy,can government control weather,can the government control the weather,chem trail,chem trails,aluminim aerosols, sky trails, contrails, weather patterns, weather modification, weather, haarp, chemical trails,chemicals in chemtrails,chemtrail,chemtrail 2010,chemtrail central,chemtrail clouds,chemtrail conspiracy,chemtrail conspiracy theory,chemtrail documentary,chemtrail evidence,chemtrail hoax,chemtrail movie,chemtrail photos,chemtrail pics,chemtrail pictures,chemtrail plane,chemtrail planes,chemtrail proof,chemtrail spraying,chemtrail symptoms,chemtrail truth,chemtrail video,chemtrail vs contrail, chemtrailing, chemtrails, chemtrails 2008, chemtrails 2010,chemtrails 911,chemtrails alex jones,chemtrails aluminum,chemtrails arizona,chemtrails atlanta,chemtrails barium,chemtrails beck,chemtrails california,chemtrails chemical analysis,chemtrails chicago,chemtrails conspiracy,chemtrails contrails,bill gates, keith caldera, chemtrails dead birds, bird deaths, chemtrails debunked,chemtrails documentary,chemtrails exposed,chemtrails facts,chemtrails florida,chemtrails geoengineering,chemtrails global warming,chemtrails haarp,chemtrails hoax,chemtrails las vegas,chemtrails los angeles,chemtrails lyrics,chemtrails morgellons,chemtrails movie,chemtrails photos,chemtrails pictures,chemtrails planes,chemtrails proof,chemtrails purpose,chemtrails san diego,chemtrails san francisco,chemtrails today,chemtrails truth,chemtrails tucson,chemtrails video,chemtrails videos,chemtrails vs contrails,chemtrails weather modification,chemtrails youtube,cia conspiracies,cia conspiracy,climate change,climate change of global warming,climate engineering,climate geoengineering,climatic changes,conspiracies,conspiracy,fish deaths, bee die off, conspiracy 2012,conspiracy 911,conspiracy archive,conspiracy blog,conspiracy blogs,conspiracy books,conspiracy con,conspiracy define,conspiracy definition,conspiracy dvds,conspiracy forum,conspiracy forums,conspiracy jesse ventura,conspiracy meaning,conspiracy movie,conspiracy planet,conspiracy reality tv,conspiracy sites,conspiracy theories list,conspiracy theory books,conspiracy videos,conspiracy websites,conspiracy world,contrail vs chemtrail,contrails,contrails chemtrails,contrails conspiracy,controlling government,corporate control of government,corporations control government,david keith geoengineering,debunking chemtrails,define conspiracy,define geoengineering,definition conspiracy,definition of conspiracy,dia conspiracy,does the government control the media,does the government control the weather,famous conspiracies,federal reserve conspiracy,flu shot conspiracy,freedom from government control,geo engineering,geo engineering projects,geoengineer,geoengineering,geoengineering chemtrails,geoengineering climate change,geoengineering definition,geoengineering global warming,geoengineering projects,geoengineering the climate,geoengineering.org,geoengineers,geoengineers inc,geoengineers seattle,geotechnical,geotechnical engineer,geotechnical engineering,glenn beck conspiracy,global warming,global warming conspiracy,global warming global warming,government admits chemtrails,government conspiracies 2012,government conspiracy,government conspiracy 2012,government control,government control internet,government control media,government control of business,government control of economy,government control of education,government control of food,government control of internet,government control of internet 2010,government control of media,government control of the internet,government control of the media,government control over internet,government control over media,government control quotes,government control weather,government controlled,government controlled by corporations,government controlled economy,government controlled healthcare,government controlled internet,government controlled media,government controlling internet,government controlling media,government controlling the weather,government controlling weather,government controls,government controls everything,government controls media,government controls weather,government internet control,government media control,government mind control,government mind control conspiracy,government mind control experiments,government mind control programs,government pensions out of control,government pest control,government population control,government price control,government price controls,government weather control,h1n1 conspiracy,hurricane katrina conspiracy,illuminati chemtrails,illuminati conspiracies,illuminati conspiracy 2012,internal control and corporate governance,internet government control,it s a conspiracy,jay z conspiracy,jesse ventura conspiracy,jesuit conspiracy,jfk assassination conspiracies,jfk conspiracy,jfk jr conspiracy,less government control,list of conspiracies,lizard people conspiracy,los angeles chemtrails,marilyn monroe conspiracy,masonic conspiracy,meaning of conspiracy,media controlled by government,michael murphy chemtrails,military conspiracies,moon base conspiracy,morgellons and chemtrails,morgellons chemtrails,movie conspiracy,nasa chemtrails,new conspiracy theories,nwo conspiracy,obama conspiracies,obama conspiracy,oil leak conspiracy,one world order conspiracy,out of control government spending,pearl harbor conspiracy,planetary engineering,population control conspiracy,prince chemtrails,proof of chemtrails,proven conspiracies,purpose of chemtrails,quotes on government control,sept 11 conspiracy,september 11 conspiracy,september 11th conspiracy,solar warming,stop chemtrails,stop geoengineering,stratospheric aerosol geoengineering,stratospheric geoengineering,the absence of any government control,the climate change,the global warming,the government controls the weather,the obama conspiracy,timothy mcveigh conspiracy,too much government control,top conspiracies,top conspiracy theories,true conspiracy theories,tupac death conspiracy,twa 800 conspiracy,ufo conspiracies,un bans chemtrails,usa today chemtrails,usa today geoengineering,vatican conspiracy,ventura conspiracy,volokh conspiracy,what does the federal government control,what is conspiracy,wikileaks chemtrails,wikipedia chemtrails,william thomas chemtrails,world conspiracies,world conspiracy,youtube chemtrails", "favicon": "wp-content/uploads/2012/04/favicon.ico", "canonical": "https://www.geoengineeringwatch.org/category/health/", "encoding": "UTF-8"}, "image": null, "domain": "www.geoengineeringwatch.org", "title": "Nanoparticle Contamination Cover-Up: Answers From A Scientist", "cleaned_text": "How does one retain some semblance of health while existing in a world that has become alarmingly toxic and incompatible to life as a whole? Though there are countless sources of contamination, the climate engineering fallout is the most pervasive of all. I am not a physician, but I have made an effort to understand and pursue fitness and health since I was about 14 years of age. To some degree I have avoided previously penning this post because it is not my primary area of study. This being said, I have had many requests to outline what my personal health protocol is, so I'll do exactly that. I am not giving medical advice, I am not suggesting or directing anyone to practice the health/fitness regime that I follow, I am simply sharing it. Acquiring this most essential element is no simple task in our now completely contaminated world. I have intentionally located in an extensive wilderness area for many reasons, one of them is the access to exceptional ground water. I, of course, realize that such a source of water is not available to many or most, so other options must be found. The quest for clean water is a complex question and not within the scope or this article, but the point is simply this, water is the most essential foundation of our health. For me, this is first and foremost. If an individual is physically able to engage in consistent cardiovascular and resistance weight training, there is no substitute for the benefits. \"Use it or lose it\", how many times have we all heard this simple mantra, yet, how few put it to practice? Physical exercise triggers countless beneficial processes in the body, including the cleansing effect of perspiration. Coupled with the constant consumption of clean and mineral balanced water, great benefits can be realized. It is the consistency that matters when it comes to exercise. With few exceptions, I try to train every day. Unless the outside air is relatively clear, I do not do workout outside. Many choose to ignore the obvious negative effect of heavy outdoor exercise (and thus heavy respiration) in polluted air, this is a big mistake. The harder one breaths in particulate laden air, the more deeply those contaminants penetrate into the lungs. I grew up in unimaginably smoggy conditions in Upland, California. Only when I retreated to the mountains (which I did constantly as I lived right at the base of them) could I escape the polluted air. Even as a boy I was instinctually careful not to exercise heavily while outdoors on a smoggy day. I feel I am still reaping the benefit even today from the caution I practiced so long ago. Consistently following a protocol of sleep hygiene is imperative. No regime of fitness and health can approach its full potential without the rejuvenation process of adequate rest. Many in today's reality do not take this fact into account and thus neglect this extremely important aspect of sound health. It is essential to consider that the time you choose to go to bed can have a big impact on the rejuvenation that is realized from your sleep. Rest in the earlier hours of the night are generally more beneficial for most. Because sleep is so important, and because there are so many factors in the current paradigm that interfere with our natural sleep cycles, I choose to utilize various supplements to assist with my sleep hygiene. The amino acid \"Gaba\" is one supplement that I regularly take. Gaba has natural calming effects and can also help the body to produce HGH during rest. Melatonin is also a regular supplement for me. There are multiple benefits from Melatonin as well, including antioxidant and anti-inflammatory properties. Chamomile and Valerian Root are two more options. I rotate supplements, this is important. Constantly taking the same supplement without any break can and does cause the body to build a tolerance and thus the effectiveness is diminished or lost. This is, of course, a very complex subject with countless points of view. Again, the point of this article is to share my own protocol and practices, not to push others to follow any particular practice. What we eat matters immensely. The pros and cons of particular practices and protocols regarding foods and food groups can vary greatly from individual to individual. Blood types are medically shown to be a very significant factor that should be considered (due to different genetic makeup). I had an extensive lab blood test done for food lectin intolerance to confirm the foods that were most compatible for my blood type and genetics. Investigating and understanding what foods are most beneficial to our individual systems is imperative. So many live out their entire lives without knowing or understanding that their systems are intolerant to specific foods. Over time, this intolerance has a grinding down effect on our overall health. I try to consistently consume organic, non-GMO foods that are most compatible with my system. When To Eat, And When Not To\n\n First, focus on foods that provide the most nutritional value for the given amount of calories they contain (avoid non-nutritional empty calories). Part of my family is from Lithuania, and there is a saying there, \"breakfast you keep for yourself, lunch you share with a friend, dinner you give to your enemy\". What I consider from this proverb is this, piling up on calories late at night before bed is very counterproductive in many ways and is especially detrimental to sound rest. If your body is struggling to digest while trying also to rejuvenate and cleanse (especially in regard to the brain), these are opposing forces. Avoiding heavy protein meals late in the day and evening is also essential to better sleep at night. Light meals or serotonin producing foods are best for late day and evening meals in order to assist with more restful sleep. This subject is also very complex and must be tailored to the individual. I will again share my own personal regime in this arena. I have a pantry that is overflowing with supplements, so many that it takes a bit of navigation to know where to find what you are looking for. This being said, I do not take handfuls of the same vitamins and supplements every day. I am selective, and I consistently rotate supplements. I also take short breaks from supplements altogether to allow my system to settle and clean out. It is important to remember that many herbal supplements and even various vitamins are diuretics. If you load up constantly, you will soon begin to purge your system of water (and thus essential nutrients) which greatly diminishes or completely negates the benefits you are trying to gain from the supplements to begin with. Again, as previously stated, I rotate what I take in order to avoid losing the benefit from various supplements by building up a tolerance to them (I do not apply this rule to some of the most basic and essential supplements like vitamin C). Something to consider, purchasing supplements online is far less expensive than shopping at a retail store. As already stated this is a complex subject which can and should vary greatly from individual to individual. The following is a list that covers many of the supplements that I take on a rotational basis. Ginkgo Biloba, Chamomile, Valerian root. Turmeric, Saw Palmetto, Broccoli extract, L-lysine, Amino complex, Vitamin D, Vitamin C (Ester C or comparable), Vitamin E, Vitamin B complex, Magnesium Malate, Boron, Chromium Picolinate, Kelp, Vitamin K-2, Calcium (high quality), Glucosamine/Chondroitin/ MSM (joint maintenance), Green tea extract, Chlorella, essential minerals, apple pectin and Bromelain. Though there are those who claim if one eats properly, supplements are not needed. I disagree. Our bodies daily face a virtual onslaught of attacks and contamination from countless unnatural sources, extra ammunition for remaining strong and healthy is essential. The Most Important Food Of All, Essential Fats\n\n The body cannot function without essential fat lipids, they are the single most important food we can consume. A deficiency in essential fat lipid intake can lead to an endless list of ailments and diseases. Essential fats are critical in regard to cellular communication and hormone production within the body which is in turn are critical to our overall health. Essential fat lipids are exactly that, essential. Two primary sources I consume are organic Flax and Hemp oils. Both can be found in the refrigerated section of any health food store. Foods containing beneficial bacteria are another basic building block of maintaining our health. There are many sources, I am not advocating any particular one, just a general statement of fact. I try to consistently keep my intestinal flora maintained. The importance of avoiding refined sugars and maintaining an alkaline balance cannot be overstated. The reasons are many, it is not within the scope of this post to cover this subject in depth. I frequently add apple cider vinegar to my drinking water to further decrease acidity, but always in moderation. Apple cider vinegar (like most other supplements) is a diuretic and should be utilized in moderation. The importance of practicing effective oral hygiene cannot be overstated. Keeping your teeth and gums in top shape is an essential aspect of staying healthy. Chronic respiratory infection is now epidemic all over the globe. Mathematically speaking the greatest single source of toxic atmospheric particulate contamination is the global climate engineering assault. This fact cannot be rationally denied if all available data is investigated and examined. These particulates are platforms for fungal proliferation and thus fungal infections. Not surprisingly, studies now show that as much as 90% of chronic upper and lower respiratory infections are fungal. To combat this source of infection, I consistently use a nasal spray/inhaler that is comprised of the several essential elements. I fill a 2 ounce nasal spray bottle with clean water and add 1/2 pack of \"Neti Pot\" salt mix (available in any drug store). I then add 2 drops of tea tree oil, 2 drops of eucalyptus oil, and 2 drops of grapefruit seed extract. Shake to mix thoroughly, and put it to use. Every night before bed I spray several herbal prevention shots up each nostril while inhaling and also inhale several sprays through the throat of the same mixture. If I feel I have had unusual exposure for any reason, I will use the spray in the morning as well. With this practice, I also rotate and occasionally switch to Olive Leaf Extract nasal spray (also available in any health food store). The importance of keeping any fungal infections (also bacterial and viral) from getting started cannot be overstated. Once deeply rooted, such infections are much more difficult to eradicate. Mainstream medical \"professionals\" nearly always only feed the problem by prescribing antibiotics which then kill of beneficial organisms in our system thus further fueling fungal infections. I also utilize the following internal supplements if I am battling an infection: Olive Leaf extract capsules, Grapefruit seed extract capsules, oil of organo, garlic, and Monolaurin. What We Believe, And Our Health\n\n Our mental state carries the most profound impact to our health. Our body is a manifestation of our state of mind. This fact in no way negates all the protocol and practices outlined above, but rather is an essential component to the whole approach of staying strong and healthy in a toxic world. The Bottom Line, We Must All Work Toward Completely Altering The Current Paradigm On Our Planet\n\n Staying healthy is, of course, important and essential for countless reasons, but the most critical of all is this, in doing so, we can be much more effective in the fight for the greater good. The posted information above is not complete, but rather a general overview of my personal practices and protocols. Staying healthy requires each individual to be pro-active, it cannot be accomplished in any other way. The human race has truly painted itself into a very dark corner, we now face countless daunting existential challenges. The list of contamination sources we face is endless. From GMO foods to Fukushima, to Monsanto chemicals, our exposure is constant. This being said, the single most important leap we could make in the right direction is to fully expose and halt the climate engineering assault on the biosphere and the web of life. No matter how much effort we make toward maintaining or improving our health, every breath we take is now laden with the toxic geoengineering fallout. Everything we eat is now exposed to the same contamination. Exposing and halting the ongoing climate engineering insanity must be our common cause, it should logically be our primary focus. This battle is about every single breath we take, make your voice heard in this all important fight.\n\n DW May be freely reprinted, so long as the text is unaltered, all hyperlinks are left intact, and credit for the article is prominently given to geoengineeringwatch.org and the article’s author with a hyperlink back to the original story.\n\nUS EPA Scientist Fired For Trying To Tell The Truth About Climate Engineering And Fluoridated Water The public has been trained and conditioned to believe that federal agencies like the EPA exist to watch over them and warn them of any potential dangers. This notion could not be further from the truth. Though there are honest and caring people within these agencies (like the scientist who has drafted the statement below), the institutions as a whole exist to hide threats from the population, not to disclose them. The majority of the public continues to convince themselves that if there was really anything they should be concerned about, someone, somewhere, in some federal public protection agency would tell them. The statement below should be a sobering wake-up call for us all. It is yet another confirmation of all that has been stated above. From global geoengineering, to Fukushima, to toxic fluoridated water and lethal vaccinations, the public health and the health of our biosphere is being decimated. Where are the official warnings from official agencies? The truth continues to be hidden by the government agencies that are tasked with hiding it. Michael Davis is now a former EPA scientist who is working with GeoengineeringWatch.org in an effort to get the truth out, his full resume is at the bottom of this article. Michael was recently terminated from the EPA for daring to tell the truth about two extremely dire public dangers, the highly toxic fallout from climate engineering, and the willful contamination of the public water supply with industrial waste. I had the pleasure and honor of working with Michael for over a year, he has participated in conference calls directly with the Geoengineering Watch legal team (Legal Alliance to Stop Geoengineering, LASG). Upon being terminated from the EPA, I asked Mr. Davis if he would draft a statement for GeoengineeringWatch.org, that statement is below. My name is Michael Davis, I was employed as an Environmental Engineer for nearly 16 years in the National Pollution Discharge Elimination Systems (NPDES) Programs Branch of the Water Division in Region 5, Chicago of the USEPA. I was terminated as a public servant performing a public service for raising the issues of anthropogenic deposition of aluminum due to atmospheric geoengineering. In addition, I brought up the industrial hazardous waste byproduct of fluoride known as HFSA (being sold primarily by the phosphate fertilizer and aluminum industries) to drinking water utilities for disposal into the nation's drinking water systems. This does not include pollutants that are discharged from wastewater reclamation facilities into receiving waters. The issue regarding anthropogenic deposition of aluminum due to atmospheric geoengineering came up in May 2013 when a colleague in the NPDES Programs Branch sent a general email to everyone regarding \"NPDES and Climate Change\". I sent a six (6) bullet point one – sentence response to my colleague. Nearly six (6) weeks later my supervisor (at the time) set up a conference call to inform me that I would be receiving a Letter of Reprimand for making false, malicious and unfounded statements against colleagues, supervisors, management and elected public servants. Furthermore, my then supervisor claimed that my statements damaged the integrity and reputation of the agency. In April, 2014, my last supervisor assigned me to the Beloit, Wisconsin wastewater reclamation facility DRAFT permit review. I asked the permit writer why fluoride (a poison) was be disposed of in Beloit's drinking water supply? She could not provide an explanation. Approximately two (2) weeks later my supervisor placed a \"gag order\" on me barring me from having any communication written or verbal with anyone unless he approved ahead of time and was present on all conference calls. It was claimed by my supervisor (and management) that the \"gag order\" would remain in place to prevent me from making statements that would further damage the integrity and reputation of the agency. Furthermore, my supervisor kept giving me assignments like Beloit, Wisconsin where fluoride, along with other pollutants knowing that I would describe the adverse human, animal health effects along with adverse environmental effects of them in my DRAFT Permit review reports. The adverse human, animal and environmental effects were completely ignored by my supervisor. This was even more profound when it came to the issue of fluoride as HFSA being deposited into the drinking water system. This is in violation of (1) EPA's Policy on Scientific Integrity, (2) The Precautionary Principle, (3) 5 U.S.C. §2302(b)(8) and (4) Informed Consent. My supervisor informed me that the EPA does not regulate fluoride in the drinking water systems under either the Clean Water Act (CWA) or the Safe Drinking Water Act (SDWA). However, FDA under Health and Human Services (HHS) regulated fluoride in the drinking water systems. I eventually crafted a general description of the adverse human and animal health effects in an email to my supervisor and upper level management. Initially was ignored by all of them. I had to send the original descriptive email several times over about a six (6) month period of time before I received a reply from the water division director who just parroted the corporate agenda pertaining to fluoride disposal into the nation's drinking water systems. The label in the photo above should be shocking to any that are even slightly awake. Highly toxic industrial waste that is officially labeled as a \"drinking water additive\". In doing my own research into the issue of anthropogenic deposition of aluminum from atmospheric geoengineering (as well as fluoride and other pollutants) in an attempt to determine why there was strong opposition from my supervisor and the EPA in general it this (factual reports on the issues). It is because the EPA wants to continue their cover-up, collusion, and criminality pertaining to pollution and contamination being perpetrated by their puppet masters, the multinational corporations. The EPA (like the FDA, CDC, etc) is a complete sham. Because the \"P\" in EPA stands for protection of corporate profits and not for protecting human, animal and environmental (or biosphere) health. The EPA like other governmental regulatory agencies are corrupt to the core, completely dysfunctional and have been completely hijacked by the multinational corporations. I will not allow any of my ex – supervisors, ex – branch chiefs, ex – divisions directors, ex – EPA acting regional administrator or ex – EPA administrator or other individuals either identified or unidentified to get away contaminating our one and only biosphere (soil, water and air), and causing untold adverse human and animal health effects. The threats we collectively face are immense and grave. These existential threats are being hidden from public view by government agencies which are completely controlled by a criminal power structure that operates in the shadows with impunity. Those who serve public protection agencies must find the courage to stand up and speak out as Michael Davis has. Others (in the same agencies), who have committed themselves to being shameless tyrannical order followers, must be exposed and held accountable, legally and morally. The battle before us to fully expose the truth requires our full commitment. Each of us is needed, all can make a difference. All can and must make their voices heard in the fight for the greater good, we are rapidly running out of time. My deepest respect and regard for the courage and concern for the greater good that Michael Davis has shown.\n\n DW To obtain a engineering position in the water/wastewater/alternative energy sector.\n• Solid training and education in chemical/mechanical engineering both supported by Bachelors and Masters degrees with concentration in thermal sciences relating to kinetics, fluid mechanics, heat transfer, and thermodynamics, as well as combustion, pollution and energy control types of engineering analysis.\n• Research and design experience that has been applied to laboratory testing for fluidized bed, char analysis, ash analysis, and air pollution analysis in the development of pulse combustors. 2000 NORTH DAKOTA STATE UNIVERSITY, Mechanical Engineering and Applied Mechanics, Fargo, North Dakota \n\n Laboratory Instructor for Mechanical Systems I (M.E. 455) & II (M.E. 456)\n• Performed an empirical heat conduction analysis on the inner and outer bands of the first stage vane doublets with and without Thermal Barrier Coatings (TBC).\n• Performed further empirical analysis on different film cooling hole patterns on the inner and outer bands, as well as, the design and manufacturing aspects on introducing these film cooling holes.\n• Continued an extended analysis on hot streak on the second stage vanes and how to suppress this hot streak by introduction of film cooling holes on the transition duct.\n• Having my analysis interpreted in performance of both turbine and engine found that it was in good agreement with only a slight increase in combustor temperature was needed in order to maintain the performance power of the 501 industrial engine.\n• Performed an empirical heat transfer analysis on the first stage compressor wheel, which was comprised of an exotic material.\n• UNIVERSITY OF NORTH DAKOTA, Grand Forks, North Dakota\n\n Masters in Mechanical Engineering (2000)\n\n Independent Study: “The Influence of Turbulence Level, Scale, Wake Effects, Surface Roughness, Body Shape and Leading Edge Effects on Stagnation Region Heat Transfer.”\n• CALIFORNIA STATE UNIVERSITY, LONG BEACH, Long Beach, California\n\n Master in Chemical Engineering (1995)\n\n Directed Research Project: “Study of the Use of Intermediate Reboilers and Condensers for Industrial Distillation Systems.”\n• CALIFORNIA STATE UNIVERSITY, LONG BEACH, Long Beach, California\n\n Bachelors in Chemical Engineering (1994)\n\n Senior Design Project: Plant design for methanol synthesis from methane gas for Fluor Daniel, Inc., Irvine, California (Project duration = 12 months).\n• Project: “Comparison of Plate Radiation Using 3-Node and 7-Node Method” (Fall 1994). May be freely reprinted, so long as the text is unaltered, all hyperlinks are left intact, and credit for the article is prominently given to GeoengineeringWatch.org and the article’s author with a hyperlink back to the original story.​\n\nThe ongoing battle to expose and halt the climate engineering insanity (by reaching a critical mass of awareness on the issue) is now rapidly gaining traction. By sharing credible data with others and networking credible data on every possible form of social media, very important members of society (including medical professionals) are waking up and joining the battle against the highly toxic atmospheric aerosol spraying. All of us are needed in the critical effort to keep the forward momentum going. We must wake the masses to what is going on in our skies. We must wake the masses to the all out weather/biological warfare that is being waged against populations and the entire web of life on planet Earth. My most sincere gratitude to Dr. Inez Maria Pandit for making here voice heard in this most critical fight for the greater good.\n\n Dane Wigington\n\n geoengineeringwatch.org Once again Germany had been attacked by particularly severe air strikes employing technology from the arsenal of weather weapons. For two weeks in a row there had been daily “thunderstorms” occurring all over Germany in variable patterns. Some regions suffered severe damage from extremely heavy rains causing flooding and mud slides. People were struck by lightning that – in some instances – came suddenly out of nowhere. Hamburg was hit by a 200 km/h tornado!!!! The German National Weather Service (Deutscher Wetterdienst) issued the same forecast day after day: severe weather warnings, heavy rains, thunderstorms, hail… Grotesque! Yes, more and more people are realizing that something is not quite right as far as the weather is concerned but attribute only to climate change. Very few are aware of the magnitude of climate engineering. I myself woke up in 2012 after having noticed strange weather phenomena and cloud formations in Germany ever since 2006, a year after my return from the US where I had lived since 1992. When I found out about weather manipulation and geoengineering I took this very seriously starting my own observations (in Germany, Australia, Belgium, Singapore, Dubai) and research into the matter. I joined an activist group (saubererhimmel.de and blauerhimmel.info) discussing various topics related to geoengineering and going out to enlighten others by distributing flyers, stickers and conducting road show like events. There had been mostly positive feedback from fellow citizens and the occasional stupid comment and verbal attack.. Even though more and more are waking up, it is remarkable how many remain oblivious to the truth. As a physician, it is my duty to divulge my complete knowledge of all factors affecting health. So how could I not speak of the toxic aerosols sprayed from aircraft and most harmful irradiation with electromagnetic and other frequencies intentionally used to manipulate human physiology and behavior to the point of mental disruption and even death. New illnesses and ailments are emerging in addition to increasing numbers of airway disease, skin and digestive problems, depression, fatigue, dementia, childhood behavior disorders, and nervous system symptoms. Indeed, there is a master plan designed by the global network of psychopathic entities. The Georgia Guidestones and their messages outline the intentions of the “elite” as well as UN Agenda 21 and the secret agreements of the Bilderberg meetings. The goal is genocide on a large scale, to establish the new world order and control the few slaves left on Earth. This is an evil insanity totally beyond comprehension for the mind of most fellow human beings. Fortunately this lack of suspicion shows that the majority of people on Earth are NOT insane and immoral but fast asleep. Over decades in medicine I have observed that most of my doctor colleagues are completely unaware, or worse, in denial of what is going on in medicine, not to mention politics and environment. I am convinced that is -in part -the result of “academic” training which is cleverly designed to abolish critical thinking, reason, common sense, and free will. What is my current assessment of the state of health of planet Earth? I think we nearly have reached the point of no return. I am trying to remain optimistic and hopeful, but I must admit that this becomes more and more difficult. If we achieve the necessary critical mass of conscious souls very soon it might be possible to avert a cataclysm of apocalyptic dimension. Yet, there are the many prophecies… Telling others about the truth is our moral obligation and it is of utmost importance to remember the reality of faith, light, and love. I agree with my colleague Dr. Rauni Kilde (Finland, who was killed last year), for speaking the truth about mental programming for decades: there is no death. And the most powerful energies we can send out into the (spiritual) world are Love and Light! My heartfelt gratitude and appreciation of his amazing work, courage and dedication to save planet Earth goes to Dane Wigington. I also greet all friends all over the world in our common quest for spreading the truth. Let's keep going! Thank you all!\n\nGeoengineering Is Destroying Our Health, A Doctor Sounds The Alarm The total contamination that has been inflicted on our planet by climate engineering is mathematically greater and more widespread than all other sources of environmental contamination combined. The ongoing toxic spraying of our skies continues to add to the already lethal burden of contamination from climate engineering laid down over 65 years. The environment and our bodies are reaching and surpassing the breaking point. The report below was penned by a health care professional that fully understands the gravity of the damage which has been done to us from the geoengineering fallout. The well researched conclusions of Dr. Amato should be carefully considered.\n\n Dane Wigington\n\n geoengineeringwatch.org Could Geoengineering Have Something To Do With My Failing Health?\n\n It is widely suggested by doctors and scientists that all one needs in order to stay healthy is to eat a ‘balanced diet’. This idea is drummed into the public’s consciousness to such an extent as to constitute absolute truth. Fact is nothing could be further from the truth. In today’s overly toxic world, eating a balanced diet is toxic in itself. Consider that our food is grown using inorganic fertilizers which have been shown to precipitate into the walls of your arteries and joints as arteriosclerosis and arthritis… or in your brain as Alzheimer’s; or that pesticide and herbicide residues become trapped in your liver – giving rise to fatty degeneration and subsequent hypertension; or that genetically modified foods have been demonstrated to degrade your cell wall structures. Dangerous radiation is routinely used on vegetables as a decontaminant. American’s swill down high fructose corn syrup, derived from GMO corn by the barrel-full on a yearly basis, and it’s hidden in many condiments as well. These are just a few of the technological advances science has brought mankind, fueling the healthcare crisis that plagues this country by eroding its gross domestic product. Three unmarked non-commercial, military type jets laid these down directly over my home In order to fully grasp the seriousness of this problem, one need be mindful of the fact chemicals are ubiquitous. There are over 100,000 according to EPA estimates. The newest, most dangerous form of poisoning is happening in our skies – solar radiation management or chemical contrails, harmlessly labeled under the guise of geo-engineering. There is no escaping the grasp of the new religion known as science. The sad fact is that pseudo science today drives policy through consensus, not good science. Just like everything else in the New World Order, science has been monetized to the highest bidder. The most frightening part is that you and I have unwittingly become the scientist’s guinea pigs. The laboratory is planet earth and “science by consensus” is recklessly out of control. It’s no secret within the broader scientific community that “standards” established by establishment-scientific-researchers – the Jason Society – are awarded to the highest bidder. In an outcomes based world, this model is not only flawed, it is ethically and morally corrupt. Whether you believe chemically generated contrails exist or not is irrelevant. They exist, and the people who design and deliver them don’t care what you think…. they’re going to continue spraying these deadly aerosols despite what you say or do; you can be sure, since your taxes are paying for them, and the war on terror will continue long after you have moved on. American’s have become powerless as agents of change. You are faced with a choice, suffer the consequences or become pro-active. For those who disagree, the mantra “proceed at your own risk” and buyer-beware could not be more appropriate. For everyone else, protecting yourself starts now! The two principle ingredients in these aerosols are barium (Ba) and aluminum (Al). Water-soluble barium salts are clearly toxic to human health. Water-soluble barium by far, carries the most risk. The main portals of entry for inhaled barium are the lungs and sinuses. This route allows direct access into the bloodstream, exposing red and white blood cells, platelets, hemoglobin and organic iron to the oxidative effects of this dangerous substance. A thorough review on the importance of the blood vascular system is an exhaustive topic. Suffice to say, blood represents the substrate from which body tissues derive their nutrients – like fertile soil that provides the perfect medium for healthy and vibrant plant-life. Noxious chemicals in general, and heavy metals in particular degrade the quality of blood – their drying properties degrading the blood’s moisture content, increasing viscosity and driving up stroke risk. It’s been reported barium can absorb up to 400 times its own weight in moisture. The particles involved are nano-sized, one-billionth of a meter, one ten-thousandth the diameter of a human strand of hair. This gives you an idea how easy it is for these particles to gain entry into your trillions of cell structures, where they rob your energy, making you feel chronically tired. Once inside, they disrupt mitochondria function – the energy generator inside each cell that provides the power to effect respiration, vitality and alertness. If you’re wondering what can be done to protect yourself, you’re moving in the right direction. This \"cloud\" formation is inconceivable based on historic recordings of real clouds both in artist renditions and photographs Aluminum, the second but no less serious toxic nano-particulate is important enough – its effect’s target central nerve system tissues like white brain matter. Al causes what are known as amyloid plaques to form in brain tissue, degrading nerve synapse end points, across which signals need to jump in order to maintain normal memory and problem solving capabilities – cognitive function. Advanced accumulation of amyloid plaques have been identified in Alzheimer’s, a condition of rapid neurodegenerative cognitive decline. Parkinson’s, ALS, Multiple Sclerosis and Myesthenia Gravis are similar conditions, together characterized by rapid and advanced decay of nerve tissue – progressive and irreversible. The global pharmaceutical cartels are not for want of recognizing the potential profits, they are busy conducting next generation anti-neurodegenerative drug trials, based on the effects of chronic heavy metal poisoning from the ongoing decades-long geo-engineering false flag campaign. A second, more troubling feature of barium involves its reaction with cardiac muscle. The heart relies on the trace mineral potassium to maintain healthy resting tone. Disturbances in heart potassium level (hypokalemia) can force high cardiac RPM’s (tachycardia), placing undue stress on both heart muscles and nerves. Barium competes against potassium – increasing CVA risk, especially in the overweight and obese. A condition known as arrested ventricular systole has been identified in studies designed to test barium effects on heart muscle. In layman’s terms this means ventricular hyper-tonicity or simply “heart spasm”. Chest pain, lightheadedness, fainting, respiratory distress, shortness of breath, asthma, vision problems, pain into one or both arms or hands – with occasional numbness, morning stiffness, fatigue and bowel problems – can be traced back to the heart. And inhalers can make matters worse. The young and middle aged are not immune. Juxtaposed against the background noise present in solar radiation management chemicals, significant risk metrics cannot be ruled out. Health care consumers ought to exercise extreme caution before accepting prescription medications that are designed to sedate or stimulate. The wrong medication could bring on a serious consequence – quickly. Talk to your doctor about any medications he intends on prescribing you. Be sure to ask if there are any cardiovascular side effects mentioned in the drugs insert, or whether anemia could be a possible medium-term side effect. Follow-up questions to your druggist/pharmacist should be addressed. Ask questions and demand reasonable answers. Your druggist will ask if you have any known allergies to medications, rash, shortness of breath, lightheadedness… or any other unusual reactions you may have had to medications in the past. Exposed individuals (everyone) should discuss with their provider the likelihood of possible inhaled heavy metal exposure from the contrails in the skies above your neighborhood and work site. Patients must pro-actively steer the dialogue to the need for blood tests geared to measure the metals aluminum, barium, lead and mercury, economized at the very least to barium and aluminum. Ask for a “blood heavy metals profile” naming the above items as particularly relevant. I learned that my blood barium levels were hovering in the triple digits (normally zero) following a heavy metals blood screening in March, this after particularly intense aerosol activity throughout that month. Ask your doctor to order a CRP (C-Reactive Protein), a test designed to measure endogenous heart inflammation. If your doctor asks why you want your blood tested, explain that recent heavy metal exposure typically shows up in blood first, and hair perhaps weeks or months later. Mainstream medicine is not completely sold on hair mineral analysis, but the presence of metals in blood where none should be there could be diagnostic for heavy metal poisoning. ON-OFF demonstration of an intended brief dispersion, compelling evidence Maintaining a sense of awareness that dietary supplements, vitamins, and neutraceutic food concentrates represent your only protection against the unpredictable consequences of untested, broad, rogue and hasty scientific environmental experiments affecting the general population. The toxic chemicals manufactured in the laboratory since 1988 and by default, previous to ’88, have been cleverly cloaked as harmless by way of passage of the De Minimus Interpretation of the Delaney Clause, authored by Michael R. Taylor, a former chairman of the Food and Drug Administration. As a one-time Monsanto CEO and revolving door participant in the regulation of the companies he once worked for, while employed at FDA, Mr. Taylor’s interests are at best defined in shades of grey. This legislative maneuver unleashed a pandora’s box of new chemicals onto the US food supply market, when it effectively and substantially diluted the protective measures written into the original version of the 1958 Delaney Clause. Legislation that once forbade cancerous substances into the US food supply lost its bite when scores of new chemicals came onto the market as a result of this new amendment. In summary all bets are off, now that labeling laws have been neutered or eliminated entirely. The only safe alternative remains grown at home food or farmers market produce, meats and poultry – Ukiah Natural Food Coop – notwithstanding. However – there are no guarantees unless you plant it and you harvest it. Your cells have been under a full-scale attack, morning-noon-and-night by chemicals since the mid 1980’s. While these chemicals are drying out your body, your joints and your nervous system, they are simultaneously degrading your body’s cell-signaling hormone pathways – resulting in metabolic oxidation, reactive oxygen species (ROS), disruption of chromatid material and damage to the DNA molecule. Chromatin damage and DNA disruption are key features identified in terminal cancers. That’s why Vitamin’s C and E are so important as a preventative measure against 21st century-engineered chronic degenerative disease. There are many more vitamins and supplements capable of reversing cell destruction by gobbling up ROS, enhancing enzyme streams, promoting cell wall integrity and increasing Co2 removal. Only you can make the right decision, by exercising your will to choose safety out of concern, prudence out of necessity and common sense out of urgency. Come to the geo-engineering workshop taking place at the Hampton Inn, Ukiah. Wednesday, June 24th – 6:00 to 8:00 PM. Steven Amato will conduct a Power Point presentation on his thirty years of research into the environmental effects of twentieth century scientific advances, with an emphasis on the latest moral hazard – chemical contrails, solar dimming and SRM. Bring a pen and pad. Admission is free. Call Hampton Inn (707) 462-6555 ask for Leslie I began practice as a chiropractor in 1980. During my tenure as a physician and healer, I practiced both straight chiropractic with physical therapy, and clinical nutrition using kinesiology and muscle testing. I graduated from Palmer College of Chiropractic in Iowa, and did residencies in South Carolina and Nebraska. I am also trained in cranial specific manipulation, having studied under Drs. Sutherland, DeJarnette, Bludworth, Pick, M.L. Rees and Upledger. Proficiency in all extremity adjusting. I maintained several practices in the northeast from 1980 to 2005. A change in priorities led to a move west in 2005. There I turned my energies to the land, reclaiming formerly logged tracts of old growth California Coastal Redwood forests, developing natural gravity fed springs. erecting fences and rehabilitating pastures for the raising of organic grass fed livestock. Rescuing this abandoned and mistreated stretch of timberland and pasture was a labor of love. It provided the bridge for what would follow: the first website using AI to generate a nutritional package targeted to your lifestyle patterns. This brand of lifestyle alternative medicine is based on almost forty years utilizing the most professional companies in the fields of nutrition and homeopathic medicine. anti-agingremedies.com Presentations to over six thousand people attending seminars, workshops, speeches, lectures Appeared on television and radio shows – expert in alternative medicine, chiropractic, nutrition Trained in SE5 Radionics and scalar applications 1997 to present Presently engaged in research into the human health effects of geo-engineering, solar radiation management, weather modification.", "opengraph": {"title": "Nanoparticle Contamination Cover-Up: Answers From A Scientist", "type": "article", "url": "https://www.geoengineeringwatch.org/nanoparticle-contamination-cover-up-answers-from-a-scientist/", "site_name": "Geoengineering Watch", "description": "Dane WigingtonGeoengineeringWatch.orgA must view report from a top scientist covering the climate engineering nanoparticle pollution of our air, water, soils and f", "image": "https://www.geoengineeringwatch.org/wp-content/uploads/2023/02/GeoengineeringWatch-Nanoparticle-Contamination-Cover-Up.png", "image:width": "790", "image:height": "790"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "450", "height": "253", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"253\" src=\"https://www.youtube.com/embed/xQReY4trXbs\" title=\"YouTube video player\" width=\"450\"></iframe>", "src": "https://www.youtube.com/embed/xQReY4trXbs"}, {"embed_type": "iframe", "provider": "youtube", "width": "390", "height": "219", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"219\" src=\"https://www.youtube.com/embed/rf78rEAJvhY\" width=\"390\"></iframe>", "src": "https://www.youtube.com/embed/rf78rEAJvhY"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/zpqag9YvvXw\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/zpqag9YvvXw"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/VWJUKDEi7LE\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/VWJUKDEi7LE"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/O4WhYKP83zo\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/O4WhYKP83zo"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/WnaGGDt_CQ8\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/WnaGGDt_CQ8"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/idvKGWk5guY\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/idvKGWk5guY"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/g_xl5-yN5Ts\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/g_xl5-yN5Ts"}, {"embed_type": "iframe", "provider": "youtube", "width": "420", "height": "236", "embed_code": "<iframe allowfullscreen=\"\" frameborder=\"0\" height=\"236\" src=\"https://www.youtube.com/embed/kZGTS4W4C-c\" width=\"420\"></iframe>", "src": "https://www.youtube.com/embed/kZGTS4W4C-c"}], "links": ["https://www.geoengineeringwatch.org/nanoparticle-contamination-cover-up-answers-from-a-scientist/", "https://www.geoengineeringwatch.org/nanoparticle-contamination-cover-up-answers-from-a-scientist/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fnanoparticle-contamination-cover-up-answers-from-a-scientist%2F", "https://www.addtoany.com/share", "https://www.youtube.com/c/DaneWigington", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/how-do-we-stop-climate-engineering-only-way-forward/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.geoengineeringwatch.org/climate-engineering-fact-and-photo-summary/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/the-dimming-full-length-climate-engineering-documentary/", "https://www.geoengineeringwatch.org/geoengineering-watch-t-shirts-cards-and-bumper-stickers/", "https://www.geoengineeringwatch.org/ads/", "https://www.geoengineeringwatch.org/climate-engineering-fact-and-photo-summary/", "https://www.geoengineeringwatch.org/nanoparticle-contamination-cover-up-answers-from-a-scientist/#more-43461", "https://www.geoengineeringwatch.org/climate-engineering-contamination-staying-healthy-in-a-world-that-isnt/", "https://www.geoengineeringwatch.org/climate-engineering-contamination-staying-healthy-in-a-world-that-isnt/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fclimate-engineering-contamination-staying-healthy-in-a-world-that-isnt%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/07/geoengineeringwatch.org-55.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/07/geoengineeringwatch.org-59.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/07/geoengineeringwatch.org-56.png", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/climate-engineering-contamination-staying-healthy-in-a-world-that-isnt/#more-30635", "https://www.geoengineeringwatch.org/us-epa-scientist-fired-for-trying-to-tell-the-truth-about-climate-engineering-and-fluoridated-water/", "https://www.geoengineeringwatch.org/us-epa-scientist-fired-for-trying-to-tell-the-truth-about-climate-engineering-and-fluoridated-water/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fus-epa-scientist-fired-for-trying-to-tell-the-truth-about-climate-engineering-and-fluoridated-water%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "http://www.stopgeoengineeringlegalalliance.com", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/wp-content/uploads/2017/02/GeoengineeringWatch.org-11009.png", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/us-epa-scientist-fired-for-trying-to-tell-the-truth-about-climate-engineering-and-fluoridated-water/#more-32814", "https://www.geoengineeringwatch.org/world-renowned-doctor-addresses-climate-engineering/", "https://www.geoengineeringwatch.org/world-renowned-doctor-addresses-climate-engineering/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fworld-renowned-doctor-addresses-climate-engineering%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/climate-engineering-contamination-staying-healthy-in-a-world-that-isnt/", "https://www.geoengineeringwatch.org/global-weather-modification-assault-causing-climate-chaos-and-environmental-catastrophe-2/", "https://www.geoengineeringwatch.org/wp-content/uploads/2019/06/GeoengineeringWatch.org-444352.png", "https://www.geoengineeringwatch.org/climate-engineering-fact-and-photo-summary/", "https://www.geoengineeringwatch.org/geoengineering-watch-our-most-comprehensive-climate-engineering-presentation/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/world-renowned-doctor-addresses-climate-engineering/#more-39264", "https://www.geoengineeringwatch.org/the-great-nutrient-collapse/", "https://www.geoengineeringwatch.org/the-great-nutrient-collapse/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fthe-great-nutrient-collapse%2F", "https://www.addtoany.com/share", "http://www.politico.com/agenda/story/2017/09/13/food-nutrients-carbon-dioxide-000511", "https://www.politico.com/agenda/story/2017/09/13/food-nutrients-carbon-dioxide-000511", "https://www.geoengineeringwatch.org/the-great-nutrient-collapse/#more-36617", "https://www.geoengineeringwatch.org/weather-warfare-assault-a-physician-speaks-out/", "https://www.geoengineeringwatch.org/weather-warfare-assault-a-physician-speaks-out/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fweather-warfare-assault-a-physician-speaks-out%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/06/45r1.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/06/98y.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/06/78r.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/06/98e.png", "https://www.geoengineeringwatch.org/weather-warfare-assault-a-physician-speaks-out/#more-30336", "https://www.geoengineeringwatch.org/covering-up-climate-engineering-contamination-epa-caught-buying-its-independent-science-advisors/", "https://www.geoengineeringwatch.org/covering-up-climate-engineering-contamination-epa-caught-buying-its-independent-science-advisors/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fcovering-up-climate-engineering-contamination-epa-caught-buying-its-independent-science-advisors%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "http://www.capoliticalreview.com/capoliticalnewsandviews/epa-caught-buying-its-independent-science-advisers/", "http://www.desmogblog.com/energy-environment-legal-institute", "http://www.desmogblog.com/steve-milloy", "https://www.geoengineeringwatch.org/global-weather-modification-assault-causing-climate-chaos-and-environmental-catastrophe-2/", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/05/88g.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/05/8h.png", "http://eelegal.org/wp-content/uploads/2016/05/CASAC-complaint-filed-0501316.pdf", "http://dailycaller.com/2014/04/02/report-epa-tested-deadly-pollutants-on-humans-to-push-obama-admins-agenda/", "https://www.geoengineeringwatch.org/credibility-is-crucial-in-the-fight-to-expose-climate-engineering/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/covering-up-climate-engineering-contamination-epa-caught-buying-its-independent-science-advisors/#more-30238", "https://www.geoengineeringwatch.org/new-science-study-comes-closer-to-disclosing-the-catastrophic-health-and-environmental-consequences-of-climate-engineering/", "https://www.geoengineeringwatch.org/new-science-study-comes-closer-to-disclosing-the-catastrophic-health-and-environmental-consequences-of-climate-engineering/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fnew-science-study-comes-closer-to-disclosing-the-catastrophic-health-and-environmental-consequences-of-climate-engineering%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4717532/", "https://www.geoengineeringwatch.org/climate-engineering-is-weather-warfare/", "https://www.geoengineeringwatch.org/geoengineering-is-biological-warfare/", "https://www.youtube.com/watch?v=c34U0Pwz4_c", "https://www.geoengineeringwatch.org/global-weather-modification-assault-causing-climate-chaos-and-environmental-catastrophe-2/", "https://www.geoengineeringwatch.org/geoengineering-is-causing-drought-and-fueling-fires/", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/01/GeoengineeringWatch.org_.png", "https://www.geoengineeringwatch.org/wp-content/uploads/2016/01/GeoengineeringWatch.org3_.jpg", "https://www.geoengineeringwatch.org/geoengineering-watch-legal-team-moves-forward-with-washington-d-c-public-relations-firm/", "https://www.geoengineeringwatch.org/massive-us-senate-document-on-national-and-global-weather-modification/", "https://www.geoengineeringwatch.org/documents-library/a-recomended-national-program-in-weather-modification-icas-report-10a/", "https://www.geoengineeringwatch.org/links-to-geoengineering-patents/", "https://www.youtube.com/watch?v=g_xl5-yN5Ts", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/new-science-study-comes-closer-to-disclosing-the-catastrophic-health-and-environmental-consequences-of-climate-engineering/#more-28937", "https://www.geoengineeringwatch.org/health-magazine-covers-climate-engineering-heavy-metal-contamination-and-mass-extinction-whats-the-connection/", "https://www.geoengineeringwatch.org/health-magazine-covers-climate-engineering-heavy-metal-contamination-and-mass-extinction-whats-the-connection/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fhealth-magazine-covers-climate-engineering-heavy-metal-contamination-and-mass-extinction-whats-the-connection%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/prestigious-health-magazine-covers-geoengineering/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/health-magazine-covers-climate-engineering-heavy-metal-contamination-and-mass-extinction-whats-the-connection/#more-28581", "https://www.geoengineeringwatch.org/caught-on-film-george-h-w-bush-and-monsanto-collaborate-on-gmo-assault/", "https://www.geoengineeringwatch.org/caught-on-film-george-h-w-bush-and-monsanto-collaborate-on-gmo-assault/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fcaught-on-film-george-h-w-bush-and-monsanto-collaborate-on-gmo-assault%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/the-dark-cloud-of-monsanto-continues-to-expand/", "https://experiencelife.com/article/frankenfood-genetically-modified-foods/", "https://www.geoengineeringwatch.org/monsantos-chemical-assault-against-the-web-of-life/", "https://www.geoengineeringwatch.org/introducing-geoengineering-climate-engineering-to-the-uninformed/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/caught-on-film-george-h-w-bush-and-monsanto-collaborate-on-gmo-assault/#more-27179", "https://www.geoengineeringwatch.org/geoengineering-is-fueling-deadly-epidemic-of-vitamin-d-deficiency/", "https://www.geoengineeringwatch.org/geoengineering-is-fueling-deadly-epidemic-of-vitamin-d-deficiency/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fgeoengineering-is-fueling-deadly-epidemic-of-vitamin-d-deficiency%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/07/36pic.jpg", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/geoengineering-is-fueling-deadly-epidemic-of-vitamin-d-deficiency/#more-26336", "https://www.geoengineeringwatch.org/physician-addresses-climate-engineering-dangers-at-community-workshop/", "https://www.geoengineeringwatch.org/physician-addresses-climate-engineering-dangers-at-community-workshop/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fphysician-addresses-climate-engineering-dangers-at-community-workshop%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/geoengineering-is-destroying-our-health-a-doctor-sounds-the-alarm/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/physician-addresses-climate-engineering-dangers-at-community-workshop/#more-25966", "https://www.geoengineeringwatch.org/veteran-health-department-official-speaks-out-on-climate-engineering-dangers-again/", "https://www.geoengineeringwatch.org/veteran-health-department-official-speaks-out-on-climate-engineering-dangers-again/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fveteran-health-department-official-speaks-out-on-climate-engineering-dangers-again%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/veteran-health-department-official-speaks-out-on-climate-engineering-dangers-again/#more-25806", "https://www.geoengineeringwatch.org/internationally-known-doctor-addresses-climate-engineering-issue/", "https://www.geoengineeringwatch.org/internationally-known-doctor-addresses-climate-engineering-issue/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Finternationally-known-doctor-addresses-climate-engineering-issue%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/07/Dr.-Ted-Broer.jpg", "https://healthmasters.com", "https://www.geoengineeringwatch.org/internationally-known-doctor-addresses-climate-engineering-issue/#more-25718", "https://www.geoengineeringwatch.org/monsantos-chemical-assault-against-the-web-of-life/", "https://www.geoengineeringwatch.org/monsantos-chemical-assault-against-the-web-of-life/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fmonsantos-chemical-assault-against-the-web-of-life%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/monsanto-has-purchased-climate-corporation-for-nearly-a-billion-dollars-why/", "https://www.geoengineeringwatch.org/the-cast-of-criminals-who-purchased-the-weather-channel-for-3-5-billion/", "https://www.geoengineeringwatch.org/climate-engineering-unites-weather-channel-and-monsanto/", "https://www.geoengineeringwatch.org/chemtrails-killing-organic-crops-monsantos-gmo-seeds-thrive/", "https://www.geoengineeringwatch.org/the-dark-cloud-of-monsanto-continues-to-expand/", "http://naturalsociety.com/revealed-documents-prove-epa-knew-glyphosate-was-carcinogenic-30-years/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/monsantos-chemical-assault-against-the-web-of-life/#more-25694", "https://www.geoengineeringwatch.org/shasta-county-update-on-heavy-metal-contamination-the-legal-ramifications/", "https://www.geoengineeringwatch.org/shasta-county-update-on-heavy-metal-contamination-the-legal-ramifications/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fshasta-county-update-on-heavy-metal-contamination-the-legal-ramifications%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/water-tests/", "http://www.redding.com/news/shasta-board-to-talk-about-jets-metal-dumping", "https://www.geoengineeringwatch.org/geoengineering-investigation-demanded-by-shasta-county-residents/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/shasta-county-update-on-heavy-metal-contamination-the-legal-ramifications/#more-25634", "https://www.geoengineeringwatch.org/aluminum-poisoning-of-humanity-from-geoengineering-the-first-science-publication-goes-live/", "https://www.geoengineeringwatch.org/aluminum-poisoning-of-humanity-from-geoengineering-the-first-science-publication-goes-live/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Faluminum-poisoning-of-humanity-from-geoengineering-the-first-science-publication-goes-live%2F", "https://www.addtoany.com/share", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/well-known-scientist-sounds-the-alarm-on-geoengineering/", "https://en.wikipedia.org/wiki/J._Marvin_Herndon", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/06/Wigington-and-Dr.-Herndon.png", "https://www.geoengineeringwatch.org/geoengineering-exposed-california-jam/", "https://www.geoengineeringwatch.org/aluminum-poisoning-of-humanity-from-geoengineering-the-first-science-publication-goes-live/#more-25364", "https://www.geoengineeringwatch.org/geoengineering-is-destroying-our-health-a-doctor-sounds-the-alarm/", "https://www.geoengineeringwatch.org/geoengineering-is-destroying-our-health-a-doctor-sounds-the-alarm/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fgeoengineering-is-destroying-our-health-a-doctor-sounds-the-alarm%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/06/302.jpg", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/06/301.jpg", "https://www.geoengineeringwatch.org/wp-content/uploads/2015/06/300.jpg", "http://anti-agingremedies.com/", "https://www.geoengineeringwatch.org/geoengineering-is-destroying-our-health-a-doctor-sounds-the-alarm/#more-25240", "https://www.geoengineeringwatch.org/climate-engineering-heavy-metal-contamination-and-cover-up/", "https://www.geoengineeringwatch.org/climate-engineering-heavy-metal-contamination-and-cover-up/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fclimate-engineering-heavy-metal-contamination-and-cover-up%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "http://en.wikipedia.org/wiki/Solar_radiation_management", "http://www.cbsnews.com/news/whales-threatened-by-toxic-metals-in-the-water/", "http://rt.com/news/265600-bees-alzheimer-aluminium-pollution/", "http://www.independent.co.uk/environment/vital-invertebrates-decline-by-45-per-cent-study-finds-9626745.html", "http://www.globalresearch.ca/chemtrails-the-consequences-of-toxic-metals-and-chemical-aerosols-on-human-health/19047", "http://www.fourwinds10.net/siterun_data/environment/pollution/news.php?q=1220410300", "https://www.geoengineeringwatch.org/global-weather-modification-assault-causing-climate-chaos-and-environmental-catastrophe-2/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/climate-engineering-heavy-metal-contamination-and-cover-up/#more-25034", "https://www.geoengineeringwatch.org/climate-engineering-contamination-and-aerotoxic-syndrome/", "https://www.geoengineeringwatch.org/climate-engineering-contamination-and-aerotoxic-syndrome/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fclimate-engineering-contamination-and-aerotoxic-syndrome%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/aerotoxic-syndrome-is-affecting-airline-passengers-and-crews/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/climate-engineering-contamination-and-aerotoxic-syndrome/#more-24965", "https://www.geoengineeringwatch.org/blind-to-the-skies-the-normalcy-bias-dilemma/", "https://www.geoengineeringwatch.org/blind-to-the-skies-the-normalcy-bias-dilemma/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fblind-to-the-skies-the-normalcy-bias-dilemma%2F", "https://www.addtoany.com/share", "http://www.theguardian.com/environment/2014/sep/29/earth-lost-50-wildlife-in-40-years-wwf", "http://www.huffingtonpost.com/2010/08/17/un-environment-programme-_n_684562.html", "http://www.nejm.org/doi/full/10.1056/NEJMra054308", "http://www.allergyclinic.co.nz/allergy_epidemic.aspx", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/blind-to-the-skies-the-normalcy-bias-dilemma/#more-24775", "https://www.geoengineeringwatch.org/geoengineering-is-biological-warfare/", "https://www.geoengineeringwatch.org/geoengineering-is-biological-warfare/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fgeoengineering-is-biological-warfare%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/geoengineering-is-destroying-the-ozone-layer/", "https://www.geoengineeringwatch.org/global-weather-modification-assault-causing-climate-chaos-and-environmental-catastrophe-2/", "https://www.geoengineeringwatch.org/record-media-coverage-of-climate-engineering/", "https://www.geoengineeringwatch.org/chemtrail-testing-on-civilians-and-youre-scared-of-foreign-terrorists/", "https://www.wsws.org/en/articles/2002/10/germ-o18.html", "https://www.geoengineeringwatch.org/video-proof-the-criminally-insane-experiments-of-the-us-military/", "http://www.dailymail.co.uk/news/article-2401378/Agent-Orange-Vietnamese-children-suffering-effects-herbicide-sprayed-US-Army-40-years-ago.html", "https://www.geoengineeringwatch.org/neurologist-warns-aluminum-in-chemtrails-could-cause-explosive-increase-in-neurodegenerative-diseases/", "https://www.geoengineeringwatch.org/water-tests/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/geoengineering-is-biological-warfare/#more-24520", "https://www.geoengineeringwatch.org/prestigious-health-magazine-covers-geoengineering/", "https://www.geoengineeringwatch.org/prestigious-health-magazine-covers-geoengineering/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fprestigious-health-magazine-covers-geoengineering%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/prestigious-health-magazine-covers-geoengineering/#more-23926", "https://www.geoengineeringwatch.org/the-dark-cloud-of-monsanto-continues-to-expand/", "https://www.geoengineeringwatch.org/the-dark-cloud-of-monsanto-continues-to-expand/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fthe-dark-cloud-of-monsanto-continues-to-expand%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/the-dark-cloud-of-monsanto-continues-to-expand/#more-23725", "https://www.geoengineeringwatch.org/geoengineering-and-monsanto-the-disaster-capitalists/", "https://www.geoengineeringwatch.org/geoengineering-and-monsanto-the-disaster-capitalists/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fgeoengineering-and-monsanto-the-disaster-capitalists%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/monsanto-has-purchased-climate-corporation-for-nearly-a-billion-dollars-why/", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/geoengineering-and-monsanto-the-disaster-capitalists/#more-22963", "https://www.geoengineeringwatch.org/aerotoxic-syndrome-is-affecting-airline-passengers-and-crews/", "https://www.geoengineeringwatch.org/aerotoxic-syndrome-is-affecting-airline-passengers-and-crews/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Faerotoxic-syndrome-is-affecting-airline-passengers-and-crews%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/aerotoxic-syndrome-is-affecting-airline-passengers-and-crews/#more-22581", "https://www.geoengineeringwatch.org/monsantos-roundup-and-aluminum-a-deadly-combination/", "https://www.geoengineeringwatch.org/monsantos-roundup-and-aluminum-a-deadly-combination/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fmonsantos-roundup-and-aluminum-a-deadly-combination%2F", "https://www.addtoany.com/share", "https://www.geoengineeringwatch.org/climate-engineering-aluminum-and-alzheimers/", "http://http://www.motherjones.com/politics/1997/01/no-way-around-roundup", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/monsantos-roundup-and-aluminum-a-deadly-combination/#more-22146", "https://www.geoengineeringwatch.org/love-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida/", "https://www.geoengineeringwatch.org/love-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Flove-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida%2F", "https://www.addtoany.com/share", "https://rebelsiren.wordpress.com/2015/01/28/love-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida-while-epa-turns-a-blind-eye/", "http://rebelsiren.wordpress.com/2015/01/28/love-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida-while-epa-turns-a-blind-eye/", "http://www.lenntech.com/environmental-disasters.htm#6._The_Love_Canal_chemical_waste_dump", "http://www.justice.gov/enrd/3635.htm", "http://engineeringfailures.org/files/Learning%20from%20the%20Piper%20Alpha%20Accident.pdf", "http://myamericanodyssey.com/dumped-on-the-messy-truth-about-love-canal-ny/", "https://www.geoengineeringwatch.org/love-canal-tragedy-remembered-decades-later-as-history-repeats-itself-in-riverview-florida/#more-21756", "https://www.geoengineeringwatch.org/climate-engineering-connection-to-alarming-increase-in-serious-illness-a-prominent-scientist-speaks-out/", "https://www.geoengineeringwatch.org/climate-engineering-connection-to-alarming-increase-in-serious-illness-a-prominent-scientist-speaks-out/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fclimate-engineering-connection-to-alarming-increase-in-serious-illness-a-prominent-scientist-speaks-out%2F", "https://www.addtoany.com/share", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://www.geoengineeringwatch.org", "https://www.geoengineeringwatch.org/climate-engineering-connection-to-alarming-increase-in-serious-illness-a-prominent-scientist-speaks-out/#more-21531", "https://www.geoengineeringwatch.org/well-known-scientist-sounds-the-alarm-on-geoengineering/", "https://www.geoengineeringwatch.org/well-known-scientist-sounds-the-alarm-on-geoengineering/", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fwww.geoengineeringwatch.org%2Fwell-known-scientist-sounds-the-alarm-on-geoengineering%2F", "https://www.addtoany.com/share", "http://en.wikipedia.org/wiki/J._Marvin_Herndon", "https://www.facebook.com/dane.wigington.geoengineeringwatch.org", "https://geoengineeringwatch.org/", "https://www.geoengineeringwatch.org/well-known-scientist-sounds-the-alarm-on-geoengineering/#more-21389", "https://www.geoengineeringwatch.org/category/health/page/2/"], "authors": [], "publish_date": null}