{"result_id": "131020", "URL": "https://www.getholistichealth.com/17248/flu-shot-or-not/", "timestamp": "2023-04-25 15:16:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/17248/flu-shot-or-not/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Flu Shot or Not?", "cleaned_text": "Flu season is well underway and even came a little early this year. One knows the signs of an oncoming sickness—the sneezing, sniffles, raspy throat, aches, and fatigue… otherwise known as the “common cold.” However, CDC director Dr. Thomas Frieden is saying that this year`s flu may not be so common but a rather bad season for flu sufferers.\n\nHealthcare professionals will always recommend the flu shot and according to the Centers for Disease Control, this year`s vaccine is a close match to the flu viruses that are circulating; however, only 37% of Americans eligible for the flu shot actually receive it. But why? One would assume that anything that will prevent a sickness would be a no brainer but in reality, some feel as though the flu shot doesn’t really work and actually makes them sick while others would rather endure the sickness than take a needle in the arm. Some refuse to go to the doctor or swear they never get sick while some would rather be ill than go to work.\n\nWhatever the reason is for not getting the flu shot doesn’t really matter; the fact is that most people do not get it, but does that mean they are doomed to suffer the flu this year? The answer is no. For those that simply “never get sick,” well they’re the lucky ones, but for others less fortunate, there are many ways to naturally defend against the dreaded flu.\n\nIt is sometimes forgotten is that the flu vaccine is not a magical serum, all it does is basically “wake up” the body`s natural immune system which people can strengthen on their own without the shot. There are many things people can do to ward off this year`s cold without making an appointment at the doctor’s.\n\nMany people swear by Emergen-C, a dietary supplement packed with 1,000 MG of Vitamin C, others take a regime of vitamins and some just eat foods such as oranges packed with immune system boosters. According to Prevention.com, there are nine specific power foods that strengthen the immune system: yogurt, oats and barley, garlic, fish, chicken soup, tea, beef, sweet potatoes, and mushrooms.\n\nAnother immune system booster is physical activity. According to Huffingtonpost.com, a new study performed by the University of Nebraska Medical Center and the Rocky Mountain Cancer Rehabilitation Institute suggests that physical exercise strengthens the immune system. Laura Bilek, a researcher at the University of Nebraska Medical Center said, “What we’re suggesting is that with exercise, you might be getting rid of T cells that aren’t helpful and making room for T cells that might be helpful.”\n\nIf one does not get their flu shot, it doesn`t mean they are destined to get sick. There are many ways to enhance the body`s natural response to viruses. By incorporating healthy, immune-boosting foods into a diet and getting regular physical activity, which can be an intense gym regime or light exercise such as taking the dog for a walk or casually hitting a ball against a tennis backboard, it seems as though the flu shot may not always be necessary. And if one does decide to get the vaccine, eating healthy and exercise definitely won`t hurt!", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/17248/flu-shot-or-not/", "title": "Flu Shot or Not?", "description": "Flu season is well underway and even came a little early this year. One knows the signs of an oncoming sickness—the sneezing, sniffles, raspy throat, aches, and fatigue… otherwise known as the “common cold.” However, CDC director Dr. Thomas Frieden is saying that this year`s flu may not be so common but a rather bad […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-01-14T17:13:27+00:00", "article:modified_time": "2020-09-23T08:38:04+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/9154/is-the-flu-vaccine-safe-for-pregnant-women/", "https://www.getholistichealth.com/24826/5-natural-remedies-that-really-work/", "https://www.getholistichealth.com/ask-doctor/", "https://www.getholistichealth.com/5784/why-are-so-many-people-so-afraid-of-spiders/", "https://www.getholistichealth.com/17631/how-to-raise-physically-active-kids/", "https://www.getholistichealth.com/56316/natural-ways-to-manage-dental-fear-and-anxiety/"], "authors": ["Ambrose Burgie"], "publish_date": "2013-01-14T17:13:27+00:00"}