{"result_id": "131001", "URL": "https://www.getholistichealth.com/120490/as-mrna-vaccine-production-expectations-increase-samsung-biologics-invests-in-end-to-end-expertise/", "timestamp": "2023-04-25 15:16:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/120490/as-mrna-vaccine-production-expectations-increase-samsung-biologics-invests-in-end-to-end-expertise/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "As mRNA Vaccine Production Expectations Increase, Samsung Biologics Invests in End-to-End Expertise", "cleaned_text": "The use of mRNA vaccines to prevent COVID-19 infections was a turning point for the research and development of mRNA technology.\n\nCOVID-19 vaccines produced by Moderna and Pfizer were the first mRNA vaccines approved for human use, and their demonstrated effectiveness has opened the floodgates for the future of mRNA vaccine production, with over 1,800 clinical trials involving mRNA listed in the U.S. National Library of Medicine database and roughly a quarter of those trials in phase II.\n\nSamsung Biologics, one of the world’s largest contract development and manufacturing organizations (CDMOs), has ramped up its focus on mRNA, first providing fill/finish services for Moderna’s COVID-19 vaccine in 2021, then developing an end-to-end mRNA vaccine production suite at its Songdo, South Korea, facilities in 2022.\n\nAccording to a recent whitepaper by Esther Yoo, Ph.D., development sales at Samsung Biologics, while expectations for new mRNA therapeutics and vaccines are high, few CDMOs have developed the mRNA vaccine production capabilities required to support mRNA platforms.\n\nHowever, Yoo explained that Samsung Biologics is setting its sights on becoming a premier development and manufacturing partner for mRNA projects as the technology continues to develop and new applications emerge in the near future.\n\n“The mRNA story has just begun. To cope with the rising demand for vaccines worldwide, the company proactively ventured to invest in expanding its mRNA vaccine production facility,” Yoo wrote. “For COVID-19 mRNA vaccines in the market, production of mRNA drug substance, encapsulated [lipid nanoparticle] final product, and fill/finish activities have often been conducted at different sites, increasing the risk of contamination, time, and cost. Samsung Biologics’ mRNA facility provides end-to-end solutions from pDNA linearization to fill/finish, all under one roof.”\n\nIn her whitepaper, Yoo explained the benefits of mRNA that have led researchers to focus on mRNA projects in recent years.\n\nFirst, mRNA is easily editable, meaning that it can be designed to target a wide variety of disease mechanisms, and it targets these mechanisms with a high degree of accuracy.\n\nAn mRNA vaccine is coded by DNA sequences designed to instruct the body to produce proteins that attack targets ranging from viruses to cancer cells. The mRNA vaccine production process is in vitro: It doesn’t require growing a virus in living cells, and scientists can quickly test and communicate different mRNA sequences to discover the most effective route.\n\nmRNA vaccines are capable of targeting problematic intracellular proteins, which exist outside of cells; these proteins are difficult to treat by other methods. And because mRNA instructs the body to create proteins, it can potentially be used to address diseases that involve missing proteins or a buildup of problematically altered proteins.\n\nWith these benefits in mind, researchers are working on developing mRNA vaccines for a variety of applications, and the technology could potentially revolutionize treatments and prevention of historically difficult-to-treat conditions.\n\n“In October 2021, a total of 49 mRNA prophylactic vaccine candidates were in clinical development. Many of these vaccines target infectious diseases that have to date eluded effective vaccine solutions, including malaria, influenza, and HIV/AIDS,” explained Yoo.\n\n“There are also significant efforts underway to develop a universal flu vaccine. Many cancer vaccines based on mRNA are also progressing through clinical phases, and there is a growing interest in the potential of mRNA-based cancer immunotherapies.”\n\nFor Samsung Biologics, the key to efficient mRNA vaccine production is the ability to conduct end-to-end services at a single facility. This approach involves producing the active drug substance for an mRNA vaccine, then aseptically transferring it into the vials that will be used as the final drug product.\n\nThe process begins with the linearization of circular plasmid DNA (pDNA) molecules using enzymes. Once the DNA is in a linear form, its genetic information is encoded into an mRNA molecule, which is then purified through chromatography and ultrafiltration and coated in lipid nanoparticles to ensure stability.\n\nThis drug substance is transferred into vaccine vials through the aseptic fill/finish process, which requires sterile cleanroom conditions. Precise cold chain storage temperatures are also essential for the mRNA vaccine production process, and Samsung Biologics’ cold storage facilities can reach temperatures as low as minus 70 degrees Celsius.\n\nThe CDMO successfully demonstrated its end-to-end capabilities with the completion of a commercial-scale production run of GreenLight Biosciences’ mRNA COVID-19 vaccine candidate. The first production run of the partnership, which produced 650 grams of mRNA, was completed just seven months after the initial technology transfer, exhibiting the potential for an end-to-end approach to accelerate development and manufacturing timelines for mRNA technology.\n\n“This demonstrates a major achievement in our continuing goal to offer one-stop end-to-end mRNA production from drug substance to aseptic fill/finish to commercial release, all from a single site, as we strive across our biomanufacturing network to fight the pandemic,” said John Rim, CEO and president at Samsung Biologics in a statement on the partnership.\n\nWhile its mRNA vaccine production projects thus far have focused on meeting the urgent need for COVID-19 vaccines, Samsung Biologics’ development of expanded capabilities should position it as a key player in the mRNA manufacturing space as more applications emerge.\n\nAlready one of the largest CDMOs in the world in terms of antibody manufacturing capacity, Samsung Biologics has launched a multidimensional growth plan that includes portfolio diversification, and its investment in mRNA is a central component of the company’s diversification effort.\n\nResearch suggests that innovation in mRNA vaccine production will be a driver of biopharmaceutical growth in years to come despite an expected decline in demand for COVID-19 vaccines as the pandemic eventually subsides.\n\nNow that mRNA vaccines have a demonstrable use case, and manufacturers such as Samsung Biologics have developed the capabilities to produce mRNA at large scales, the future looks bright for this innovative development in biotechnology.", "opengraph": {"type": "article", "image": "https://www.getholistichealth.com/wp-content/uploads/2023/01/vacc.jpg", "url": "https://www.getholistichealth.com/120490/as-mrna-vaccine-production-expectations-increase-samsung-biologics-invests-in-end-to-end-expertise/", "title": "As mRNA Vaccine Production Expectations Increase, Samsung Biologics Invests in End-to-End Expertise", "description": "The use of mRNA vaccines to prevent COVID-19 infections was a turning point for the research and development of mRNA technology. COVID-19 vaccines produced by Moderna and Pfizer were the first mRNA vaccines approved for human use, and their demonstrated effectiveness has opened the floodgates for the future of mRNA vaccine production, with over 1,800 […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2023-01-12T15:14:53+00:00", "article:modified_time": "2023-01-13T09:29:15+00:00", "image:width": "700", "image:height": "467", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://samsungbiologics.com/services/cmo/mRNA-vaccine-production", "https://samsungbiologics.com/media/science-technology/investing-in-the-future-of-mrna-manufacturing", "https://samsungbiologics.com/media/company-news-view?boardSeq=1809&schBoardCtgryCcd=&schString=&schBoardYear=&boardDtm=1659366000000&page=2", "https://samsungbiologics.com/"], "authors": ["Malcolm Greenwalt"], "publish_date": "2023-01-12T15:14:53+00:00"}