{"result_id": "131002", "URL": "https://www.getholistichealth.com/35322/study-suggest-eating-fish-during-pregnancy-posses-no-risk-to-health-of-baby/", "timestamp": "2023-04-25 15:16:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/35322/study-suggest-eating-fish-during-pregnancy-posses-no-risk-to-health-of-baby/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Study Suggest Eating Fish During Pregnancy Posses No Risk to Health of Baby", "cleaned_text": "In recent years, one of the biggest mysteries to have confronted health experts is the rise in Autism rates among children born in the U.S. According to the latest estimates by the Centers for Disease Control and Prevention, the number of children born with autism has risen from one out of every 150 in 2002 to one out of every 50 in 2012.\n\nWhile a better understanding of the disorder and improved testing methods have contributed in part to the rise in autism diagnoses, a number of theories have been thrown around attempting to explain the remaining numbers. Some theories –such as those that blame vaccinations as the cause of increased autism rates- have been derided as baseless and speculative, while others- such as those suggesting air pollution could contribute slightly to increased rates- have gained momentum due to the convincing data behind the arguments.\n\nExpectant mothers looking to take precautions against increasing their baby’s risk for developing autism suddenly have a lot to more worry about. Well, now a new study suggests that pregnant women have one less thing to worry about when it comes to their baby developing autism- eating fish during pregnancy.\n\nAccording to researchers at the University of Rochester Medical Center, children exposed to low levels of mercury while in the womb due to their mothers consuming large quantities of fish during pregnancy don’t appear to suffer an increased risk of developing autism.\n\nThe results of this study were published in the journal Epidemiology.\n\nConcern over what effects mercury could have on a child’s still-developing brain has long caused expectant mothers to eliminate fish from their diets, as some health experts have suggested that the element may cause behavioral disorders such as autism.\n\nHowever, these latest findings from over 30 years of research in the Republic of Seychelles, a collection of islands located in the western Indian Ocean, found nothing to suggest that such a link exists. Based on the data collected, no evidence existed that links low-level mercury exposure –such as from eating fish- to the development of behavioral disorders in children of mothers who consumed, on average, up to 12 servings of fish a week during pregnancy.\n\nResearchers pointed out that these findings only further contribute to the growing evidence that suggests mercury exposure plays no role in the development of autism.\n\nWhile no link exists between mercury consumption and autism, researchers were quick to point out that mothers should still avoid exposure to high levels of mercury from industrial sources.\n\nAs part of the study, researchers used data on almost 1,800 adolescents, teens, young adults, and their mothers. Researchers ascertained the initial levels of mercury mothers were exposed to prenatally through the use of hair samples. Researchers then used a series of questionnaires- one given to the kid’s teachers the other to the parents- to determine if a child exhibited signs of behavior that fit into the autism spectrum. The questionnaires include questions on repetitive behavior, communication skills, and language skills. While these types of questionnaires cannot definitively determine whether a child suffers from autism, they’re commonly used in the U.S. as part of early screening processes that indicate whether a child needs further testing.\n\nThe consumption of fish during pregnancy had been the cause of some debate and consternation for some expectant mothers and their physicians. Fish offer a large number of beneficial nutrients, some of which play a vital role in the development of the brain. However, since fish contain high levels of mercury, caution over what effects the element could have on still-developing brains was enough to offset the potential good eating fish had to offer.\n\nNow that this latest study has shown no adverse effects on children born to mothers whose systems contained mercury levels six to 10 times greater than pregnant women in the U.S, and Europe, fish could now once again become an acceptable dietary option for expectant mothers.\n\nDespite these latest findings, it’s unlikely that the dietary guidelines concerning fish will change anytime soon. It’s then up to mothers to talk with their doctors about whether the potential benefits of fish now fully outweigh the dangers once associated with mercury.", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/35322/study-suggest-eating-fish-during-pregnancy-posses-no-risk-to-health-of-baby/", "title": "Study Suggest Eating Fish During Pregnancy Posses No Risk to Health of Baby", "description": "In recent years, one of the biggest mysteries to have confronted health experts is the rise in Autism rates among children born in the U.S. According to the latest estimates by the Centers for Disease Control and Prevention, the number of children born with autism has risen from one out of every 150 in 2002 […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-08-16T12:24:31+00:00", "article:modified_time": "2020-09-21T15:07:11+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/4606/diagnosing-autism/", "https://www.getholistichealth.com/15413/tips-to-prevent-indoor-air-pollution/", "https://www.getholistichealth.com/15665/increased-risk-of-developing-eye-disease-by-drinking-too-much-coffee/", "https://www.getholistichealth.com/49263/5-ways-to-improve-your-health-says-the-latest-research/", "https://www.getholistichealth.com/19461/crucial-role-played-by-a-drug-rehabilitation-center-in-helping-an-addict-overcome-addiction/", "https://www.getholistichealth.com/7469/factors-that-affect-the-criminal-behavior-of-young-adults/", "https://www.getholistichealth.com/20087/a-guide-to-how-much-sleep-your-child-needs-a-night/", "https://www.getholistichealth.com/30678/smoking-cigarette-during-pregnancy-causes-adverse-affects-on-the-babies/", "https://www.getholistichealth.com/30662/smoking-test-for-pregnant-women-on-the-cards/", "https://www.getholistichealth.com/5753/sorbitol-and-kids-is-this-a-potentially-dangerous-mix/"], "authors": ["Colin Curz"], "publish_date": "2013-08-16T12:24:31+00:00"}