{"result_id": "131013", "URL": "https://www.getholistichealth.com/22949/should-you-get-a-flu-shot/", "timestamp": "2023-04-25 15:16:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/22949/should-you-get-a-flu-shot/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Should You Get A Flu Shot?", "cleaned_text": "If you are wondering if you should get a flu shot, here are some things to keep in mind:\n\nThere is both a risk, as well as a benefit, with every medical procedure, including a flu shot. And as Barbara Abruzzo, owner of Livingwell Care Navigation, says, integrative medicine has a holistic, personalized approach, and not a one-size-fits-all way of doing things.\n\nWhile The Centers for Disease Control and Prevention does recommend that high-risk groups get vaccinated, that does not mean that everyone has to get a flu shot. The CDC recommends that high-risk groups, such as children between the ages of six months and 18 years, health care staffers who work directly with patients, senior citizens, those who take care of children under age six months, and people with pre-existing medical conditions, get the flu shot.\n\nHowever, Abruzzo says that “If that doesn’t describe you, you should think twice about having the vaccine.”\n\nIn addition, mercury is used as a preservative for the multi-dose vaccines. Abruzzo says that pregnant or nursing women should “insist on the single-dose vial which does not contain mercury.” However, there is a limited number of that type of vaccine. Unfortunately, there are a limited number of mercury-free vaccines.\n\nIf you want to get a flu shot, you can still do so this season, as long as you can find a place that is offering the flu shot, even late in the season.\n\nHow can you protect yourself from getting the flu, with or without a flu shot?\n\nIf you must be around someone with flu symptoms, Abruzzo says that you should wear a mask, and ask them to wear a mask as well.\n\nAlso, make sure you wash your hands with soap and water frequently, or use Purell, to potentially keep yourself safe. Flush your sinuses regularly with a mild saline solution to keep the mucous membranes moist.\n\nIn addition, she recommends that you take supplements such as high doses of buffered Vitamin C, Vitamin D3, zinc, as well as other supplements, such as probiotics and fish oil.\n\nDon’t forget to get enough sleep – at least 7 to 8 hours a night. That can keep your immune system from being worn down. In addition, exercise regularly for at least 30 to 45 minutes at a time. But do not exercise too much if you are feeling weak – overtraining could negatively affect your health.", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/22949/should-you-get-a-flu-shot/", "title": "Should You Get A Flu Shot?", "description": "If you are wondering if you should get a flu shot, here are some things to keep in mind: There is both a risk, as well as a benefit, with every medical procedure, including a flu shot.  And as Barbara Abruzzo, owner of Livingwell Care Navigation, says, integrative medicine has a holistic, personalized approach, and […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-03-12T13:38:41+00:00", "article:modified_time": "2020-09-13T14:41:33+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/17248/flu-shot-or-not/", "https://www.getholistichealth.com/44820/3-intriguing-facts-you-should-know-about-holistic-medicine/", "https://www.getholistichealth.com/81101/7-tips-for-preventing-high-risk-infants-from-developing-allergies/", "https://www.getholistichealth.com/27383/the-advantages-of-working-in-the-health-care-industry/", "https://www.getholistichealth.com/4067/benefits-of-fish-oil/", "https://www.getholistichealth.com/24213/why-getting-enough-sleep-is-important-for-your-health/", "https://www.getholistichealth.com/32743/ways-to-keep-your-immune-system-healthy-this-summer/", "https://www.getholistichealth.com/16022/how-online-games-negatively-affect-health-and-lifestyle-for-kids/"], "authors": ["Garry Heilman"], "publish_date": "2013-03-12T13:38:41+00:00"}