{"result_id": "131010", "URL": "https://www.getholistichealth.com/22104/what-you-need-to-know-about-flu-shots/", "timestamp": "2023-04-25 15:16:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/22104/what-you-need-to-know-about-flu-shots/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "What You Need to Know About Flu Shots", "cleaned_text": "With the 2012-2013 flu season ranking as one of the worst in U.S. history, more people have begun to reexamine the necessity of receiving a flu shot before each winter season begins. For those still on the fence, an influenza vaccine still remains the best way to prevent catching the illness, a goal everyone should share.\n\nApproximately 20 percent of all Americans develop a case of the flu each year, according to studies conducted by the Centers for Disease Control and Prevention. Of those, over 200,000 require hospitalization due to their illnesses, and anywhere between 3,000 and 49,000 deaths a year are linked to cases of influenza. These alarmingly high numbers would certainly come down if more people took advantage of flu shots and vaccinations offered in their community.\n\nWhen to Get a Shot\n\nSince flu season can start as early as October and run through May, the most advantageous time to receive a flu shot is in late September or early October. It takes approximately two weeks for a flu shot to start to offer you any kind of protection against developing an illness. So while you can still get a shot later in flu season, the longer you delay getting a shot the longer you’ll remain susceptible to illness.\n\nWhat Type of Shots is Available?\n\nThere are four primary types of flu vaccinations:\n• A traditional flu shot. One that is injected into the muscle and contains particles of the flu-virus, which stimulates immunity to the virus, but does not cause the flu.\n• A high-dosage flu shot provided to seniors over the age of 65. The contents of this type of flu shot remain consistent with that of a traditional shot, just in higher concentration. Due to the weakening of the immune system as a person ages, the dose needs to be higher to provide more assistance.\n• An intradermal flu shot. Administered to individuals between the ages of 18 to 64, this type of shot uses a smaller needle that goes only skin deep. The shot does contain the same flu-virus particles as both the traditional and high dosage shots.\n• A flu vaccine nasal spray. Approved for individuals between the ages of 2 to 49, this type of shot contains a living, weakened flu strain. Despite the use of a live virus, clinical trials have shown the spray cannot cause the flu to develop.\n\nEach of the four vaccines listed above provides protection against three different types of flu strains: two types A (the most common types of flu strain) and one type B strain. Recently, however, a new type of shot has started to be administered that protects against four types of flu strains; two A and B types.\n\nHow Does the Shot Work?\n\nBy providing your body with flu particles or a weakened strain of the virus, a flu shot causes the body to produce antibodies that fight off any future infection from that strain of the flu.\n\nSince a number of flu strains circulate every season, getting a flu shot does not guarantee you won’t catch the virus. A flu shot does significantly reduce your odds, however, and usually, a vaccinated person will develop a less potent strain of the virus if they do become ill.\n\nEvery year, flu vaccinations contain several different strains of the virus depending on which strains researchers predict most likely to circulate during the upcoming season.", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/22104/what-you-need-to-know-about-flu-shots/", "title": "What You Need to Know About Flu Shots", "description": "With the 2012-2013 flu season ranking as one of the worst in U.S. history, more people have begun to reexamine the necessity of receiving a flu shot before each winter season begins. For those still on the fence, an influenza vaccine still remains the best way to prevent catching the illness, a goal everyone should […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-03-01T15:03:50+00:00", "article:modified_time": "2020-09-13T14:38:58+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/9154/is-the-flu-vaccine-safe-for-pregnant-women/", "https://www.getholistichealth.com/8353/6-tips-for-staying-healthy-during-flu-season/", "https://www.getholistichealth.com/18419/natural-ways-to-boost-your-immunity-during-flu-season/", "https://www.getholistichealth.com/7729/boost-your-immune-system-naturally/", "https://www.getholistichealth.com/4309/benefits-of-utilizing-clinical-trials/", "https://www.getholistichealth.com/37839/5-things-to-do-to-stay-healthy-this-cold-and-flu-season/"], "authors": ["Ambrose Burgie"], "publish_date": "2013-03-01T15:03:50+00:00"}