{"result_id": "131016", "URL": "https://www.getholistichealth.com/78706/how-to-slash-your-chances-of-succumbing-to-flu/", "timestamp": "2023-04-25 15:16:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/78706/how-to-slash-your-chances-of-succumbing-to-flu/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "How to slash your chances of succumbing to flu", "cleaned_text": "It happens sometime between October and May, and it’s something that brings unexpected results for everyone. No, this isn’t Christmas – today’s topic is the 2019 flu season.\n\nWith umpteen types of flu being possible to pick up, it won’t come as a surprise to hear that most people have been struck down with this condition at one point in their life.\n\nIn fact, if you were to believe some statistics that have been mulling around the internet, it is already thought that around 75,000 people have been confirmed as suffering from flu in January 2019 alone.\n\nWhile there are no hard and fast ways to guarantee that you never do get the flu, there are some ways to at least decrease the likelihood. Through today’s post, we will take a look at some of these.\n\nLet’s start with one of the more recent ways to tackle the flu. In short, the flu vaccination is able to protect you against the most common forms of flu in a season. It works by helping the body to release antibodies which will ultimately stop those strains in their tracks.\n\nOf course, there is still a chance you might get other strains of the virus, but it’s much less likely to be anywhere near as severe and nowadays, doctors thoroughly recommend these vaccinations.\n\nOne of the reasons why flu spreads so fast is because it travels through the air in droplets. In other words, as soon as somebody sneezes, coughs or even speaks in some cases, these droplets are immediately circulated.\n\nIt means that anyone standing within three feet of the infected person is immediately at risk of breathing in such droplets and ultimately becoming infected themselves.\n\nThe same rules apply to toothbrushes\n\nFollowing on from the previous point, it’s worth highlighting that the same rules apply to toothbrushes. They are also highly likely to be contaminated by these air droplets, meaning that the best course of action is to store them out of the way of anyone who is infected, preferably in a cupboard.\n\nOpening the window won’t help you\n\nA common trick that people try and implement whilst sitting next to someone suffering from flu is opening the window. Unfortunately, all this does is drop your own temperature – it’s very unlikely to reduce the chances of you becoming infected. In fact, it might even increase the probability.\n\nThis is because the particles that carry flu in the air tend to harden in cold weather, meaning that they can effectively “live” longer.\n\nHave your own pillow when sleeping with an infected person\n\nIn an ideal world, you wouldn’t even share a bed with someone who is infected by flu. Of course, few people abide by such advice, so the next best thing is to give your sleeping partners their own pillow and ensure that they stick to their side of the bed.\n\nIt will slightly reduce the chances of succumbing to the flu, and at least means you won’t be sharing the same flu-ridden pillow for the entire night.", "opengraph": {"type": "article", "image": "https://www.getholistichealth.com/wp-content/uploads/2019/01/virus-1812092_6401.jpg", "url": "https://www.getholistichealth.com/78706/how-to-slash-your-chances-of-succumbing-to-flu/", "title": "How to slash your chances of succumbing to flu", "description": "It happens sometime between October and May, and it’s something that brings unexpected results for everyone. No, this isn’t Christmas – today’s topic is the 2019 flu season. With umpteen types of flu being possible to pick up, it won’t come as a surprise to hear that most people have been struck down with this […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2019-01-14T14:54:34+00:00", "article:modified_time": "2020-09-13T16:18:28+00:00", "image:width": "640", "image:height": "320", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.webmd.com/cold-and-flu/advanced-reading-types-of-flu-viruses", "http://www.cnn.com/2018/01/19/health/flu-widespread-jan-19-cdc-numbers/index.html"], "authors": ["Debbie Fritzler"], "publish_date": "2019-01-14T14:54:34+00:00"}