{"result_id": "131021", "URL": "https://www.getholistichealth.com/29778/vaccination-in-tanzania-for-malaria-battling-against-multiple-fronts/", "timestamp": "2023-04-25 15:16:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/29778/vaccination-in-tanzania-for-malaria-battling-against-multiple-fronts/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Vaccination In Tanzania For Malaria - Battling Against Multiple Fronts", "cleaned_text": "As everyone knows, a female anopheles mosquito has the capacity to cause malaria in human beings. Malaria is caused when an infected female mosquito bites and transmits the microorganism known as Plasmodium; into a human being.\n\nIn most cases, with the early and correct diagnosis and treatment intervention, malaria can be combated with a series of medications and diet control. But, in the year 2010, there were 219 million cases of malaria globally and 660,000 people in the African region succumbed to this disease.\n\nTanzania lies in East Africa and has to battle with many diseases out of which malaria is one of the predominant ones. The country sees\n• 80% of these cases result in death because malaria affects children who are really young\n\nOne of the biggest initiatives comes because there is an acute need for vaccination in Tanzania for malaria. Lots of research, initiatives, and action have come by way of the government, private funding organizations, bodies such as the WHO, UNICEF, and CDC, and something known as the PATH Malaria Vaccine Initiative.\n\nTwo entities are involved in this initiative – PATH which is a global non-profit organization dedicated to health care, and Glaxo Smith Kline Biological, which is a big name in the pharmaceutical industry.\n\nThe initiative is bringing together researchers from various parts of Africa, including two from Tanzania to work on a malaria vaccine. For instance, in a place called Korogwe in Tanzania, there is a Joint Malaria Program that has entered Phase 3 of testing and everybody is hopeful that a malaria vaccine will be introduced pretty soon. The malaria vaccine here is going by the name of RTS, S.\n\n\n\nThe Swiss TPH is also working towards developing a malaria vaccine and a couple of years ago, it had announced that a breakthrough had been made. The vaccine produced by this institute was reported to have delivered 50% protection to young children in Tanzania. At the heart of this research work is the aim to develop a vaccine that is made from influenza based virosomes.\n\nOver the past few years, the government of the country has also brought about something known as Malaria Operational Plans every year. Under the ages of the President’s Malaria Initiative, these plans have also found approval by the US Global Malaria Coordinator and support from the CDC or Centers for Disease Control and Prevention.\n\nRecent figures have shown that malaria interventions have improved in the past five years. These plans also call for services and actions such as:\n\nThese initiatives have also brought in bodies such as the Ifakara Health Institute and the program has quickly become part of the global initiative to eradicate malaria.\n\nThe various programs as far as vaccination Tanzania for malaria are concerned to have resulted in quite a few landmark achievements such as a significant reduction in risk of clinical malaria and severe malaria in young children. The percentage of reduction was 56% and 47% respectively.", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/29778/vaccination-in-tanzania-for-malaria-battling-against-multiple-fronts/", "title": "Vaccination In Tanzania For Malaria - Battling Against Multiple Fronts", "description": "As everyone knows, a female anopheles mosquito has the capacity to cause malaria in human beings. Malaria is caused when an infected female mosquito bites and transmits the microorganism known as Plasmodium; into a human being. In most cases, with the early and correct diagnosis and treatment intervention, malaria can be combated with a series […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-05-06T10:17:35+00:00", "article:modified_time": "2020-09-16T07:46:12+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/27671/5-home-remedies-that-can-relieve-you-from-mosquito-bites-in-no-time/", "https://www.getholistichealth.com/4201/ten-ways-that-people-with-diabetes-can-prevent-gum-disease/", "https://www.getholistichealth.com/16495/how-whiplash-injuries-affect-children/", "https://www.getholistichealth.com/7975/how-health-services-differ-across-the-eu/", "https://www.getholistichealth.com/18608/accountable-health-care-organizations-a-medical-initiative-with-an-edge/", "https://www.getholistichealth.com/11920/working-towards-better-hospital-food-standards/", "https://www.getholistichealth.com/2993/how-to-prevent-diabetic-eye-disease/", "https://www.getholistichealth.com/6328/discover-four-simple-tips-to-help-pregnant-women-prevent-work-related-back-pain/"], "authors": ["Alejandro Rimbey"], "publish_date": "2013-05-06T10:17:35+00:00"}