{"result_id": "131012", "URL": "https://www.getholistichealth.com/77979/hpv-vaccine-developer-dangerous/", "timestamp": "2023-04-25 15:16:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/77979/hpv-vaccine-developer-dangerous/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "HPV Vaccine Developer Says 'It Is Dangerous and Doesn’t Work'", "cleaned_text": "In a surprising announcement at the 4th International Public Conference on Vaccination, which took place in Reston, Virginia on Oct. 2nd through 4th, 2009, Dr. Diane Harper, the lead researcher in the development of the human papillomavirus vaccines, Gardasil and Cervarix, said that the HPV vaccine is dangerous and doesn’t work.\n\nShe is the latest to come forward and question the safety and effectiveness of these vaccines\n\nShe was scheduled to deliver a speech promoting the Gardasil and Cervarix vaccines, but she instead turned on her corporate bosses, embarrassing them at the event. When questioned about the presentation, audience members remarked that they came away feeling that the vaccines should not be used.\n\nJoan Robinson, who was in attendance, explains, “I came away from the talk with the perception that the risk of adverse side effects is so much greater than the risk of cervical cancer, I couldn’t help but question why we need the vaccine at all.”\n\nDr. Harper explained in her presentation and in an NPR interview that the cervical cancer risk in the U.S. is already extremely low, and that vaccinations are unlikely to have any effect upon the rate of cervical cancer in the United States.\n\nDr. Diane Harper, a professor at the University of Missouri-Kansas City School of Medicine, says the vaccine is being way oversold.\n\nThat’s pretty striking, because Harper worked on studies that got the vaccines approved. And she has accepted grants from the manufacturers, although she says she doesn’t any longer.\n\nHarper changed her mind when the vaccine makers started lobbying state legislatures to require schoolkids to get vaccinated.\n\n“Ninety-five percent of women who are infected with HPV never, ever get cervical cancer,” she says. “It seemed very odd to be mandating something for which 95 percent of infections never amount to anything.”\n\nBy Harper’s calculations, the tried-and-true method of regular Pap smears is a more effective way to prevent cervical cancer than the vaccines. “Pap smear screening is far and away the biggest thing a woman can do to protect herself, to prevent cervical cancer,” she says.\n\nAll trials of the vaccines were done on children aged 15 and above, despite them currently being marketed for 9-year-olds. So far, 15,037 girls have reported adverse side effects from Gardasil alone to the Vaccine Adverse Event Reporting System (V.A.E.R.S.), and this number only reflects parents who underwent the hurdles required for reporting adverse reactions.\n\nTo compound the problem with the vaccine, it isn’t just more or less unnecessary, but dozens of girls have died from these vaccines. The reported side effects include Guillian Barré Syndrome (paralysis lasting for years, or permanently — sometimes eventually causing suffocation), lupus, seizures, blood clots, and brain inflammation. Parents are usually not made aware of these risks.\n\nDr. Harper, the vaccine developer, claimed that she was speaking out, so that she might finally be able to sleep at night. Harper explains that “about eight in every ten women who have been sexually active will have HPV at some stage of their life. Normally there are no symptoms, and in 98 per cent of cases it clears itself. But in those cases where it doesn’t, and isn’t treated, it can lead to pre-cancerous cells which may develop into cervical cancer.”\n\nOne must understand how the establishment’s word games are played to truly understand the meaning of the above quote, and one needs to understand its unique version of “science”.\n\nWhen they report that untreated cases “can” lead to something that “may” lead to cervical cancer, it really means that the relationship is merely a hypothetical conjecture that is profitable if people actually believe it. In other words, there is no demonstrated relationship between the condition being vaccinated for and the rare cancers that the vaccine might prevent, but it is marketed to do that nonetheless.\n\nIn fact, there is no actual evidence that the vaccine can prevent any cancer. From the manufacturers own admissions, the vaccine only works on 4 strains out of 40 for a specific venereal disease that dies on its own in a relatively short period, so the chance of it actually helping an individual is about about the same as the chance of being struck by a meteorite! Still, Big Pharma is promoting the vaccine as a life saver.", "opengraph": {"type": "article", "image": "https://www.getholistichealth.com/wp-content/uploads/2018/10/gard.jpg", "url": "https://www.getholistichealth.com/77979/hpv-vaccine-developer-dangerous/", "title": "HPV Vaccine Developer Says 'It Is Dangerous and Doesn’t Work'", "description": "In a surprising announcement at the 4th International Public Conference on Vaccination, which took place in Reston, Virginia on Oct. 2nd through 4th, 2009, Dr. Diane Harper, the lead researcher in the development of the human papillomavirus vaccines, Gardasil and Cervarix, said that the HPV vaccine is dangerous and doesn’t work. She is the latest […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2018-10-26T11:57:56+00:00", "article:modified_time": "2020-09-13T16:18:02+00:00", "image:width": "650", "image:height": "488", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.npr.org/2011/09/19/140543977/hpv-vaccine-the-science-behind-the-controversy"], "authors": ["Ambrose Burgie"], "publish_date": "2018-10-26T11:57:56+00:00"}