{"result_id": "131011", "URL": "https://www.getholistichealth.com/9825/tips-to-staying-healthy-during-this-flu-season/", "timestamp": "2023-04-25 15:16:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/9825/tips-to-staying-healthy-during-this-flu-season/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Tips To Staying Healthy During This Flu Season", "cleaned_text": "With Halloween just around the corner, Old Man Winter isn’t far behind. The return of cold weather brings with the threat of coming down with the flu. While the days of the flu killing millions of people (the Spanish Influenza killed more people than World War I did) are long over, it is not a disease to take lightly.\n\nSeniors, young children and people with weakened immunity systems are still very much at risk. Even healthy people who come down with the flu can miss days of work fighting off this annual viral visitor. However, you can minimize your chance of contracting the flu through proper diet, good hygiene habits, coordination with your primary-care-provider (PCP), and pharmacy services. Here’s how!\n\nFlu Shot\n\n The #1 recommended defense against the disease is the current flu immunization shot. Each year, the Center for Disease Control (CDC) looks at their data and creates a vaccine of what they feel is the most likely strain of flu. While no perfect, 2011’s vaccine was found to protect 7-out-of-10 who received the shot. Many people put off getting the shot due to some minor flu-like symptoms that can occur after vaccination. However, this discomfort shows the need for the shot since actually contracting the flu would be even a lot worst.\n\nProper Hygiene\n\n These days we are bombarded with ads for sanitizing products from soaps to wipes. However recent studies by the University of Michigan School of Public Health shows warm water and plain old soap is just as effective in fighting germs to include those that cause cold and flu. In fact, the CDC warns against hand sanitizing products that help produce antibiotic-resistant germs. Be aware that most germs enter through the mouth and eyes touched with a contaminated hand. So frequent hand washing is important. Weather permitting, it is often wise if commuting to wear gloves to prevent touching items touched by dozens of people per hour. Also, avoid people who are coughing to lessen the risk of breathing the virus.\n\nPCP and Pharmacy Services\n\n Many people wait too long to see their PCP when feeling down. By the time they do, they are officially sick. While getting in to see your PCP may be a pain, seeing a pharmacist is a lot easier. As most supermarkets have pharmacy services, you can easily go in and get counseling and learn more about other things which can help prevent the flu-like use of proper vitamins. They can especially help with which foods have the nutrients you need as a proper diet is a far more effective way to get the vitamins you need. Being more available, your local pharmacist can help you stay healthy through this year’s flu season.", "opengraph": {"type": "article", "image": "https://www.getholistichealth.com/wp-content/uploads/2016/01/flu.jpg", "url": "https://www.getholistichealth.com/9825/tips-to-staying-healthy-during-this-flu-season/", "title": "Tips To Staying Healthy During This Flu Season", "description": "With Halloween just around the corner, Old Man Winter isn’t far behind. The return of cold weather brings with the threat of coming down with the flu. While the days of the flu killing millions of people (the Spanish Influenza killed more people than World War I did) are long over, it is not a […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2012-11-06T13:17:50+00:00", "article:modified_time": "2020-09-29T17:40:52+00:00", "image:width": "600", "image:height": "250", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Spanish_Influenza", "https://www.getholistichealth.com/21641/is-drinking-bad-for-my-immune-system-and-health/", "https://www.getholistichealth.com/9888/stress-fighting-food-how-some-fruits-can-help-fight-work-anxieties/", "https://www.getholistichealth.com/17248/flu-shot-or-not/", "https://www.getholistichealth.com/22949/should-you-get-a-flu-shot/", "https://www.cdc.gov/", "https://www.cdc.gov/flu/about/qa/vaccineeffect.htm", "https://www.getholistichealth.com/5896/feelings-thoughts-and-what-to-do-when-you-see-someone-in-a-wheelchair/"], "authors": ["Colin Curz"], "publish_date": "2012-11-06T13:17:50+00:00"}