{"result_id": "131018", "URL": "https://www.getholistichealth.com/33441/immunotherapy-for-children-suffering-from-cancer/", "timestamp": "2023-04-25 15:16:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.getholistichealth.com/33441/immunotherapy-for-children-suffering-from-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "www.getholistichealth.com", "title": "Immunotherapy For Children Suffering From Cancer", "cleaned_text": "Immunotherapy, which is generally used for cancer treatment in adults, can be modified to accommodate child care as well. According to recent research, an estimated 11,630 cases of pediatric cancer will be reported in comparison to 15 million adults diagnosed; this clearly shows that the number of pediatric cancer cases is much less than that of adult cancer. This perhaps explains why there are very little research and development in the area of immunotherapy for children.\n\nNational Cancer Institute’s Pediatric Oncology Branch chief, Crystal L. Mackall, M.D is of the opinion that the actual success of modern medicine lies in the progress of children cancer medicine and therapies. Previously, pediatric cancer almost always resulted in the death of the patient; however, today nearly 70% of children diagnosed with cancer are cured successfully. Yet, cancer is the leading cause of death caused due to disease among children over 1 year of age. Outcomes of advanced-stage cancer pediatric patients are still poor.\n\nIn order to address the challenges of children’s cancer, new immunotherapies are being developed by researchers. These therapies may either be administered alone or in combination with other standard treatments such as chemotherapy, surgery, and radiation therapy. One approach that is being extensively researched and used is cancer vaccines. The first cancer vaccine approved by the FDA in 2010, named Provenge, was used for the treatment of prostate cancer. The vaccine merely slows down the growth rate of cancer, but does not cause its regression; therefore it is less applicable for aggressive and fast-growing childhood cancers. Many researchers are now looking to include tumor vaccines as adjuvant or pre-emptive as they may be beneficial for aggressive cancers. This is especially true for childhood cancer where remission is possible even in aggressive conditions.\n\nAnother kind of adjuvant therapy is the dendritic cell vaccination where patients provide lymphocytes to the National Institute of Health and then get chemotherapy or radiation therapy from their local clinic. After the end of their standard clinic, they return back to NIH for the dendritic vaccination along with therapy for immune system reconstitution. This therapy has shown a great impact on the immune system reconstitution, a higher number of CD4 counts, a type of lymphocyte which is important to combat infection. Results also suggest that this therapy has long term control of cancer.\n\nA different kind of aggressive immunotherapy that has the ability to combat established cancer is known as the adoptive cell transfer. It is a method under which the lymphocytes are taken from the patient and activated and modified independently in a culture. This boosts its cancer-fighting abilities, after which it is injected back into the patient. This method has proven to treat many patients suffering from melanoma. The technique is now being used for child cancer treatment suffering from acute lymphoblastic leukemia.\n\nApart from the above-mentioned techniques, many other immunotherapies are also being researched for curing cancer in children. Researchers are continually treading new shores with some very promising results in clinical trials. In the years to come, immunotherapy research will hopefully be able to find complete cancer cures.", "opengraph": {"type": "article", "url": "https://www.getholistichealth.com/33441/immunotherapy-for-children-suffering-from-cancer/", "title": "Immunotherapy For Children Suffering From Cancer", "description": "Immunotherapy, which is generally used for cancer treatment in adults, can be modified to accommodate child care as well. According to recent research, an estimated 11,630 cases of pediatric cancer will be reported in comparison to 15 million adults diagnosed; this clearly shows that the number of pediatric cancer cases is much less than that […]", "locale": "en_US", "site_name": "Get Holistic Health", "article:published_time": "2013-06-18T12:28:35+00:00", "article:modified_time": "2020-09-20T17:53:42+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.getholistichealth.com/81054/an-introduction-to-diagnostic-oncology-cro-inc/", "https://www.getholistichealth.com/4396/what-did-humans-use-for-pain-management-before-the-modern-medicine/", "https://www.getholistichealth.com/12844/the-trauma-of-waking-up-during-surgery/", "https://www.getholistichealth.com/9831/cord-blood-banking-to-facilitate-new-breakthroughs-in-cancer-research/", "https://www.getholistichealth.com/13850/understanding-holistic-cancer-treatment/", "https://www.getholistichealth.com/7729/boost-your-immune-system-naturally/", "https://www.getholistichealth.com/21041/the-most-affordable-ways-to-treat-this-years-nasty-flu/", "https://www.getholistichealth.com/16703/the-alternative-cancer-treatments-go-for-natural-instead-of-medicines/", "https://www.getholistichealth.com/4309/benefits-of-utilizing-clinical-trials/"], "authors": ["Laurene Abron"], "publish_date": "2013-06-18T12:28:35+00:00"}