{"result_id": "132015", "URL": "https://www.glitch.news/2022-08-15-germanys-vaccine-passport-system-gets-upgrade-restricts-freedoms.html", "timestamp": "2023-04-25 15:16:33 CEST+0200", "meta": {"description": "After forcing multiple medical experiments on the population and injuring and killing off a certain percentage of the people, German Health Minister, Karl Lauterbach, is announcing a new color-coded vaccine passport system that restricts individual freedoms based on a person’s “booster” status. Individuals who are not “freshly vaccinated” within the past three months are subject […]", "lang": "en", "keywords": "abuse,biological surveillance,control,deception,digital ID,enslaved,freedom,Germany,Glitch,isolation,mask mandate,mind control,obedience training,obey,pandemic,psychological terror,slavery,social credit score,spiritual oppression,totalitarian,vaccine passport,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-08-15-germanys-vaccine-passport-system-gets-upgrade-restricts-freedoms.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Germany’s vaccine passport system restricts freedoms based on color-coded tiers, vaccine booster status", "cleaned_text": "After forcing multiple medical experiments on the population and injuring and killing off a certain percentage of the people, German Health Minister, Karl Lauterbach, is announcing a new color-coded vaccine passport system that restricts individual freedoms based on a person’s “booster” status. Individuals who are not “freshly vaccinated” within the past three months are subject to restrictions throughout German society. Every time a person complies with a new booster jab, they are awarded their “freedoms” back. This new system is being rolled out under German’s “Infection Protection Act.”\n\nVaccine Passport tyranny intensifies in Germany as well conditioned citizens become full-on slaves\n\nThe new vaccine passport app is dubbed the Corona-Warn-App (CWA). It assigns a specific color to individuals who have complied with the latest round of booster jabs. Individuals who do not show this color on their app will be threatened with mask mandates, testing requirements, and isolation, among other restrictive discriminatory acts that the German government concocts at any given moment.\n\nThose who are not “freshly boosted” with COVID jabs are assigned a color based on their unworthy vaccination status. The CCP-style vaccine passport system assigns multiple tiers of “rights” based on a person’s compliance with the current medical dictatorship. Citizen slaves who have survived multiple rounds of COVID jabs must still wear masks, must still show proof of a negative COVID test, and take further orders from the government if they are not “freshly vaccinated” in the past three months. In some instances, the app accepts a negative COVID test in place of a recent booster shot, granting the color a person needs in order to forgo mask mandates and isolation orders. Berliner Zeitung said the new vaccine passport app would “give different rights in the future” depending on the latest ‘public health guidance.’\n\n(Related: Germany’s birth rate improbably falls by 11% in the first quarter of 2022).\n\nVaccine passports are the proving ground for denouncing one’s faith and declaring obedience to evil, false authorities\n\nGermany’s app update is similar to China’s color-coded vaccine passport system. A green light permits citizen-slaves to move about freely. The yellow code denies them access to society, ordering the slave citizen to stay home for seven days. The red code is issued to lock slave citizens down for two weeks at a time. Lauterbach said Germany will change the rules and close the mask exemption if too many freshly vaccinated people “take advantage” of the color assigned to them.\n\nThe COVID jabs were never immunizations, to begin with. Individuals without discernment are learning the hard way, about what is really taking place globally. COVID jabs destroy the immune system and cause inflammation to the body’s vital organ systems. They are being used as a tool of deception to destroy human health and enslave populations. It’s mind control. It’s about testing people’s integrity and faith. Vaccine passport apps are just the proving grounds for more psychological control and spiritual oppression.\n\nCountries are beginning to rollout digital IDs and surveillance devices such as wristbands and ankle bracelets. This totalitarian system is ultimately going to demand compliance with even more sinister and controlling beliefs, which will require further bodily obedience, biological surveillance, social credit scores, and perpetual kneeling to false, demonic authorities. In the end, this system is about denouncing one’s faith and devoting one’s life to a deceptive, abusive one-world government. It’s a Godless, mark-of-the-beast system of psychological terror and obedience to mass murder.", "opengraph": {"title": "Germany’s vaccine passport system restricts freedoms based on color-coded tiers, vaccine booster status", "type": "article", "url": "https://www.glitch.news/2022-08-15-germanys-vaccine-passport-system-gets-upgrade-restricts-freedoms.html", "site_name": "Glitch", "description": "After forcing multiple medical experiments on the population and injuring and killing off a certain percentage of the people, German Health Minister, Karl Lauterbach, is announcing a new color-coded vaccine passport system that restricts individual freedoms based on a person’s “booster” status. Individuals who are not “freshly vaccinated” within the past three months are subject […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/08/Health-Passport-Immune-Phone-App-Vaccine.jpg"}, "tags": ["pandemic", "obedience training", "psychological terror", "mask mandate", "digital ID", "deception", "vaccine passport", "slavery", "abuse", "isolation", "obey", "control", "Germany", "social credit score", "vaccine wars", "enslaved", "mind control", "Glitch", "spiritual oppression", "totalitarian", "freedom", "biological surveillance"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/germany-vaccine-passport-color-codes/", "https://naturalnews.com/2022-07-20-germanys-birth-rate-falls-11percent-first-quarter-2022.html", "http://mindcontrol.news", "https://reclaimthenet.org/taiwan-combines-vaccine-passport-with-digital-id-number/", "https://reclaimthenet.org/germany-vaccine-passport-color-codes/", "https://naturalnews.com/2022-07-20-germanys-birth-rate-falls-11percent-first-quarter-2022.html", "https://reclaimthenet.org/taiwan-combines-vaccine-passport-with-digital-id-number/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-08-15-germanys-vaccine-passport-system-gets-upgrade-restricts-freedoms.html&linkname=Germany%E2%80%99s%20vaccine%20passport%20system%20restricts%20freedoms%20based%20on%20color-coded%20tiers%2C%20vaccine%20booster%20status", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}