{"result_id": "132020", "URL": "https://www.glitch.news/2022-09-07-disinformation-dozen-collusion-biden-big-tech-undeniable.html", "timestamp": "2023-04-25 15:16:36 CEST+0200", "meta": {"description": "The latest document dump exposing the Biden regime for colluding with Big Tech to silence online free speech is an important next-step, say those who were branded as disinformation purveyors, in forcing the federal government to face the music for its crimes. In a statement, Dr. Christiane Northrup, an obstetrician-gynecologist who is among the “Disinformation […]", "lang": "en", "keywords": "Biden,big government,Big Tech,Censorship,Collusion,conspiracy,deception,deep state,Disinformation Dozen,disinfromation,fascists,First Amendment,free speech,health freedom,Joe Biden,pandemic narrative,pharmaceutical fraud,propaganda,Social media,technocrats,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-09-07-disinformation-dozen-collusion-biden-big-tech-undeniable.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "“Disinformation Dozen” say collusion between Biden regime and Big Tech is undeniable", "cleaned_text": "“Disinformation Dozen” say collusion between Biden regime and Big Tech is undeniable\n\nThe latest document dump exposing the Biden regime for colluding with Big Tech to silence online free speech is an important next-step, say those who were branded as disinformation purveyors, in forcing the federal government to face the music for its crimes.\n\nIn a statement, Dr. Christiane Northrup, an obstetrician-gynecologist who is among the “Disinformation Dozen,” said that she is “thrilled to see that both Eric Schmitt of Missouri and Jeffrey Landry of Louisiana have had the courage to take a stand against the massive and well-orchestrated censorship that has attempted to silence me, my colleagues and, quite frankly, hundreds of others.”\n\n“It is about time,” she added, relieved that the process is moving forward as promised. (Related: The Federal Communications Commission [FCC] says Biden’s “Disinformation Governance Board” is unconstitutional.)\n\nIn case you missed it, Schmitt and Landry, two Republican attorneys general, filed a lawsuit against the Biden regime for allegedly violating the First Amendment in cooperation with social media platforms like Facebook and Twitter, both of which actively censor their users.\n\nAccording to the suit, the Biden regime conspired with these Big Tech companies to stamp out “misinformation” about the Wuhan coronavirus (Covid-19), as well as criticisms and proof that Joe Biden stole the 2020 election from Donald Trump.\n\nBiden and his people have been using social media as their Ministry of Truth\n\nDiscovery made in the case has revealed that the Biden regime did, in fact, pressure social media giants to follow a script, of sorts, in steering the conversation about sensitive issues such as the plandemic, including the “vaccine” and mask mandates.\n\nThe Center for Countering Digital Hate (CCDH) was also involved, having dubbed Dr. Northrup and 11 others as the Disinformation Dozen – meaning she and these others were main targets in the fight against online free speech that threatens the government narrative.\n\nThe White House used a report released by CCDH back in 2021 to pressure Big Tech companies to go after the Disinformation Dozen, as well as any other prominent users with sizeable followings whose posts threaten the agenda.\n\nAlso in 2021, then-White House press secretary Jen Psaki admitted to reporters that Biden and his people were in regular contact with the likes of Facebook and Twitter, urging them to increase their enforcement against online free speech.\n\n“We have recommended – proposed that they create a robust enforcement strategy that bridges their properties and provides transparency about the rules,” Psaki said at the time.\n\n“There’s about 12 people who are producing 65 percent of anti-vaccine misinformation on social media platforms. All of them remain active on Facebook, despite some even being banned on other platforms, including Facebook – ones that Facebook owns.”\n\nLater-released documents show that Facebook cooperated with the Biden regime’s requests. One official at the company wrote in a July 23, 2021, email that “we talked about the speed at which we are all having to iterate as the pandemic progresses.”\n\n“I wanted to make sure you saw the steps we took just this past week to adjust policies on what we are removing with respect to misinformation, as well as steps taken to further address the ‘disinfo dozen:’ we removed 17 additional Pages, Groups and Instagram accounts tied to the disinfo dozen (so a total of 39 Profiles, Pages, Groups, and IG accounts deleted thus far, resulting in every member of the disinfo dozen having had at least one such entity removed),” this Facebook employee further wrote.\n\n“We are also continuing to make 4 other Pages and Profiles, which have not yet met their removal thresholds, more difficult to find on our platform. We also expanded the group of false claims that we remove, to keep up with recent trends of misinformation that we are seeing.”\n\nBig Tech censorship is still going strong. To keep up with the latest, visit Censorship.news.", "opengraph": {"title": "“Disinformation Dozen” say collusion between Biden regime and Big Tech is undeniable", "type": "article", "url": "https://www.glitch.news/2022-09-07-disinformation-dozen-collusion-biden-big-tech-undeniable.html", "site_name": "Glitch", "description": "The latest document dump exposing the Biden regime for colluding with Big Tech to silence online free speech is an important next-step, say those who were branded as disinformation purveyors, in forcing the federal government to face the music for its crimes. In a statement, Dr. Christiane Northrup, an obstetrician-gynecologist who is among the “Disinformation […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/09/smartphone-technology-social-internet-communication-gadget-1063277-pxhere.com_.jpg"}, "tags": ["conspiracy", "big government", "deep state", "deception", "fascists", "White House", "Disinformation Dozen", "Biden", "technocrats", "First Amendment", "propaganda", "Big Tech", "Joe Biden", "Social media", "pandemic narrative", "disinfromation", "Censorship", "Collusion", "free speech", "health freedom", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/disinformation-dozen-responds-after-documents-show-widespread-biden-administration-censorship-effort_4707020.html", "https://naturalnews.com/2022-05-12-biden-disinformation-governance-board-ruled-unconstitutional-fcc.html", "http://censorship.news", "https://www.theepochtimes.com/disinformation-dozen-responds-after-documents-show-widespread-biden-administration-censorship-effort_4707020.html", "https://naturalnews.com/2022-05-12-biden-disinformation-governance-board-ruled-unconstitutional-fcc.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-09-07-disinformation-dozen-collusion-biden-big-tech-undeniable.html&linkname=%E2%80%9CDisinformation%20Dozen%E2%80%9D%20say%20collusion%20between%20Biden%20regime%20and%20Big%20Tech%20is%20undeniable", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}