{"result_id": "132038", "URL": "https://www.glitch.news/2023-03-17-zuckerberg-announces-layoffs-affecting-10k-meta-employees.html", "timestamp": "2023-04-25 15:16:46 CEST+0200", "meta": {"description": "Meta CEO Mark Zuckerberg has touted 2023 as the company’s “year of efficiency.” That means more employees are on the chopping block. On Tuesday, March 14, Zuckerberg announced the company’s plan to cut 10,000 employees in the next two months – just short of the 11,000 it laid off in November, which equated to roughly […]", "lang": "en", "keywords": "Augmented Reality,Big Tech,Collapse,Facebook,Job cuts,mark zuckerberg,mass layoff,meta,metaverse,Oculus,operating loss,Reality Labs,tech giants,technology,Virtual reality", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-03-17-zuckerberg-announces-layoffs-affecting-10k-meta-employees.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Mark Zuckerberg announces plan to cut 10,000 Meta employees in the next 2 months", "cleaned_text": "Mark Zuckerberg announces plan to cut 10,000 Meta employees in the next 2 months\n\nMeta CEO Mark Zuckerberg has touted 2023 as the company’s “year of efficiency.” That means more employees are on the chopping block.\n\nOn Tuesday, March 14, Zuckerberg announced the company’s plan to cut 10,000 employees in the next two months – just short of the 11,000 it laid off in November, which equated to roughly 13 percent of Meta’s overall staff at the time. (Related: Meta’s Mark Zuckerberg fires more than 11K employees, takes blame for overestimating company’s growth prospects.)\n\nZuckerberg earlier said that Meta plans “on cutting projects that aren’t performing or may no longer be crucial.” The company also wants to remove layers of middle management to make decisions faster.\n\n“Here’s the timeline you should expect: Over the next couple of months, org leaders will announce restructuring plans focused on flattening our orgs, canceling lower priority projects and reducing our hiring rates,” Zuckerberg said in a message to employees.\n\nThe company is expected to incur restructuring costs ranging from $3 billion to $5 billion.\n\nMeta, Facebook’s parent company, also plans to close 5,000 additional open roles that it hasn’t yet filled. Zuckerberg noted that the company should prepare for “the possibility that this new economic reality will continue for many years.”\n\nIn a Securities and Exchange Commission (SEC) filing announcing the cuts, Meta said it is expecting lowered total expenses this year – ranging from $86 billion to $92 billion.\n\n“We are a technology company, and our ultimate output is what we build for people,” Zuckerberg said. As part of the restructuring, the company will increase the number of direct reports each manager has.\n\n“A leaner org will execute its highest priorities faster,” Zuckerberg noted in his message to employees.\n\nMeta laying off thousands of employees while losing billions in metaverse\n\nAmid these job cuts, Meta continues to spend billions of dollars developing the virtual reality (VR) and augmented reality (AR) technologies required to build the digital universe coined the metaverse.\n\nThe company’s Reality Labs division, which is tasked with creating the metaverse, reported a total of $23.7 billion in operating losses over the past two years against a combined $4.4 billion in revenue over the same period.\n\nBack in 2014, Meta bought Oculus for $2 billion. Oculus is the pioneering VR hardware company that formed the groundwork for these efforts.\n\nMeta’s investment in the area has only escalated since. The company picked up a number of major software companies along the way – including Within, developer of the virtual workout app Supernatural.\n\nMeta hasn’t disclosed its headcount numbers for Reality Labs, but the company reportedly had 17,000 employees in the division prior to the layoffs late last year. Staffing and hardware development account for the majority of cash spent in the area.\n\nIn a recent earnings call, Zuckerberg emphasized the fact that Reality Labs encompasses AR, VR and metaverse-related software (Horizon Worlds, etc.) at the company.\n\n“I think the software and social platform might be the most critical part of what we’re doing, but software is just a lot less capital intensive to build than the hardware,” Zuckerberg said.\n\nMeta appears ready to the stay the course on VR and AR.\n\n“None of the signals that I’ve seen so far suggests that we should shift the Reality Labs strategy long term,” Zuckerberg said.\n\n“We are constantly adjusting the specifics of how we execute this, so I think that we’ll certainly look at that as part of the ongoing efficiency work.”\n\nRead more news related to the Facebook founder at MarkZuckerberg.news\n\nWatch this video about Facebook’s plans to lay off thousands of employees months ago.\n\nThis video is from the Pool Pharmacy channel on Brighteon.com.\n\nMeta plans to sack thousands of employees amid severe drop in revenue.\n\nBardsFM host Scott Kesterson: Meta is the biggest trap ever laid for humanity – Brighteon.TV.\n\nMeta MADNESS: World Economic Forum to have leadership role in the metaverse.", "opengraph": {"title": "Mark Zuckerberg announces plan to cut 10,000 Meta employees in the next 2 months", "type": "article", "url": "https://www.glitch.news/2023-03-17-zuckerberg-announces-layoffs-affecting-10k-meta-employees.html", "site_name": "Glitch", "description": "Meta CEO Mark Zuckerberg has touted 2023 as the company’s “year of efficiency.” That means more employees are on the chopping block. On Tuesday, March 14, Zuckerberg announced the company’s plan to cut 10,000 employees in the next two months – just short of the 11,000 it laid off in November, which equated to roughly […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/03/Mark-Zuckerberg-Facebook-Conference.jpg"}, "tags": ["Oculus", "Virtual reality", "metaverse", "tech giants", "Collapse", "mark zuckerberg", "mass layoff", "operating loss", "Reality Labs", "Job cuts", "technology", "meta", "Facebook", "Augmented Reality", "Big Tech"], "tweets": [], "movies": [], "links": ["https://www.cnbc.com/2023/03/14/meta-layoffs-10000-more-workers-to-be-cut-in-restructuring.html", "https://naturalnews.com/2022-11-11-meta-ceo-zuckerberg-fires-11k-talented-employees.html", "https://www.businessinsider.in/tech/news/mark-zuckerbergs-metaverse-just-keeps-losing-money-as-metas-reality-labs-division-posts-a-loss-of-13-7-billion-for-the-year/articleshow/97537620.cms", "http://MarkZuckerberg.news", "https://www.brighteon.com/1ec38c1d-7acd-4af4-a297-5e464f810161", "https://www.brighteon.com/channels/poolpharmacy", "https://naturalnews.com/2022-11-10-meta-to-sack-thousands-amid-revenue-drop.html", "https://naturalnews.com/2022-02-02-meta-biggest-trap-laid-for-humanity.html", "https://naturalnews.com/2022-06-01-wef-to-have-leadership-role-in-metaverse.html", "https://www.cnbc.com/2023/03/14/meta-layoffs-10000-more-workers-to-be-cut-in-restructuring.html", "https://www.businessinsider.in/tech/news/mark-zuckerbergs-metaverse-just-keeps-losing-money-as-metas-reality-labs-division-posts-a-loss-of-13-7-billion-for-the-year/articleshow/97537620.cms", "https://www.brighteon.com/1ec38c1d-7acd-4af4-a297-5e464f810161", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-03-17-zuckerberg-announces-layoffs-affecting-10k-meta-employees.html&linkname=Mark%20Zuckerberg%20announces%20plan%20to%20cut%2010%2C000%20Meta%20employees%20in%20the%20next%202%20months", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}