{"result_id": "132032", "URL": "https://www.glitch.news/2023-03-28-technology-and-a-tyranny-worse-than-prison.html", "timestamp": "2023-04-25 15:16:43 CEST+0200", "meta": {"description": "In an outstanding piece of political-theoretical writing, titled ‘The Threat of Big Other’ (with its play on George Orwell’s ‘Big Brother’) Shoshana Zuboff, succinctly addresses the main issues of her book, The Age of Surveillance Capitalism – The Fight for a Human Future at the New Frontier of Power (New York: Public Affairs, Hachette, 2019), explicitly linking it to Orwell’s 1984. (Article by Bert […]", "lang": "en", "keywords": "big government,Bubble,CBDC,China,computing,conspiracy,currency crash,currency reset,cyber war,deception,deep state,enslaved,fascism,finance riot,Glitch,globalists,great reset,information technology,money supply,Orwellian,totalitarianism,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-03-28-technology-and-a-tyranny-worse-than-prison.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Technology and a tyranny worse than prison", "cleaned_text": "In an outstanding piece of political-theoretical writing, titled ‘The Threat of Big Other’ (with its play on George Orwell’s ‘Big Brother’) Shoshana Zuboff, succinctly addresses the main issues of her book, The Age of Surveillance Capitalism – The Fight for a Human Future at the New Frontier of Power (New York: Public Affairs, Hachette, 2019), explicitly linking it to Orwell’s 1984.\n\nSignificantly, at the time she reminded readers that Orwell’s goal with 1984 was to alert British and American societies that democracy is not immune to totalitarianism, and that “Totalitarianism, if not fought against, could triumph anywhere” (Orwell, quoted by Zuboff, p. 16). In other words, people are utterly wrong in their belief that totalitarian control of their actions through mass surveillance (as depicted in 1984, captured in the slogan, “Big Brother is watching you”) could only issue from the state, and she does not hesitate to name the source of this threat today (p. 16):\n\nFor 19 years, private companies practicing an unprecedented economic logic that I call surveillance capitalism have hijacked the Internet and its digital technologies. Invented at Google in 2000, this new economics covertly claims private human experience as free raw material for translation into behavioural data. Some data are used to improve services, but the rest are turned into computational products that predict your behaviour. These predictions are traded in a new futures market, where surveillance capitalists sell certainty to businesses determined to know what we will do next.\n\nBy now we know that such mass surveillance does not merely have the purpose – if it ever did – of tracking and predicting consumer behaviour with the aim of maximising profits; far from it. It is generally known among those who prefer to remain informed about global developments, and who do not only rely on the legacy media for this, that in China such mass surveillance has reached the point where citizens are tracked through a myriad of cameras in public places, as well as through smartphones, to the point where their behaviour is virtually completely monitored and controlled.\n\nSmall wonder that Klaus Schwab of the World Economic Forum (WEF) does not let an opportunity pass to praise China as the model to be emulated by other countries in this respect. It should therefore come as no surprise that investigative reporter, Whitney Webb, also alluding to Orwell’s prescience, draws attention to the striking similarities between mass surveillance that was developed in the United States (US) in 2020 and Orwell’s depiction of a dystopian society in 1984, first published in 1949.\n\nIn an article titled “Techno-tyranny: How the US national security state is using coronavirus to fulfil an Orwellian vision,” she wrote:\n\nWebb proceeds to discuss an American government body that focused on researching ways in which artificial intelligence (AI) could promote national security and defence needs, and which provided details concerning the “structural changes” which American society and economy would have to undertake to be able to maintain a technological advantage in relation to China. According to Webb the relevant governmental body recommended that the US follow China’s example in order to surpass the latter, specifically regarding some aspects of AI-driven technology as it pertains to mass surveillance.\n\nAs she also points out, this stance on the desired development of surveillance technology conflicts with (incongruous) public statements by prominent American politicians and government officials, that Chinese AI-technological surveillance systems instantiate a significant threat for Americans’ way of life), which did not, however, prevent the implementation of several stages of such a surveillance operation in the US in 2020. As one knows in retrospect, such implementation was undertaken and justified as part of the American response to Covid-19.\n\nNone of this is new, of course – by now it is well-known that Covid was the excuse to establish and implement Draconian measures of control, and that AI has been an integral part of it. The point I want to make, however, is that one should not be fooled into thinking that strategies of control will end there, nor that the Covid pseudo-vaccines were the last, or worst, of what the would-be rulers of the world can inflict upon us to exercise the total control they wish to achieve – a level of control that would be the envy of the fictional Big Brother society of Orwell’s 1984.\n\nFor example, several critically thinking people have alerted one to the alarming fact that the widely touted Central Bank Digital Currencies (CBDCs) are Trojan horses, with which the neo-fascists driving the current attempt at a ‘great reset’ of society and the world economy aim to gain complete control over people’s lives.\n\nAt first blush the proposed switch from a fractional reserve monetary system to a digital currency system may seem reasonable, particularly in so far as it promises the (dehumanising) ‘convenience’ of a cashless society. As Naomi Wolf has pointed out, however, far more than this is at stake. In the course of a discussion of the threat of ‘vaccine passports’ to democracy, she writes (The Bodies of Others, All Seasons Press, 2022, p. 194):\n\nThere is now also a global push toward government-managed digital currencies. With a digital currency, if you’re not a ‘good citizen,’ if you pay to see a movie you shouldn’t see, if you go to a play you shouldn’t go to, which the vaccine passport will know because you have to scan it everywhere you go, then your revenue stream can be shut off or your taxes can be boosted or your bank account won’t function. There is no coming back from this. I was asked by a reporter, ‘What if Americans don’t adopt this?’ And I said, ‘You’re already talking from a world that’s gone if this succeeds in being rolled out.’ Because if we don’t reject the vaccine passports, there won’t be any choice. There will be no such thing as refusing to adopt it. There won’t be capitalism. There won’t be free assembly. There won’t be privacy. There won’t be choice in anything that you want to do in your life. And there will be no escape. In short, this was something from which there was no returning. If indeed there was a ‘hill to die on,’ this was it.\n\nThis kind of digital currency is already in use in China, and it is being rapidly developed in countries like Britain and Australia, to mention only some.\n\nWolf is not the only one to warn against the decisive implications that accepting digital currencies would have for democracy.\n\nFinancial gurus such as Catherine Austin Fitts and Melissa Cuimmei have both signalled that it is imperative not to yield to the lies, exhortations, threats and whatever other rhetorical strategies the neo-fascists might employ to force one into this digital financial prison. In an interview where she deftly summarises the current situation of being “at war” with the globalists, Cuimmei has warned that the drive towards digital passports explains the attempt to get young children ‘vaccinated’ en masse: unless they can do so on a large scale, they could not draw children into the digital control system, and the latter would therefore not work. She has also stressed that the refusal to comply is the only way to stop this digital prison from becoming a reality. We have to learn to say “No!”\n\nWhy a digital prison, and one far more effective that Orwell’s dystopian society of Oceania? The excerpt from Wolf’s book, above, already indicates that the digital ‘currencies’ that would be shown in your Central World Bank account, would not be money, which you could spend as you saw fit; in effect, they would have the status of programmable vouchers that would dictate what you can and cannot do with them.\n\nThey constitute a prison worse than debt, paralysing as the latter may be; if you don’t play the game of spending them on what is permissible, you could literally be forced to live without food or shelter, that is, eventually to die. Simultaneously, the digital passports of which these currencies would be a part, represent a surveillance system that would record everything you do and wherever you go. Which means that a social credit system of the kind that functions in China, and has been explored in the dystopian television series, Black Mirror, would be built into it, which could make or break you.\n\nIn her The Solari Report, Austin Fitts, for her part, elaborates on what one can do to “stop CBDCs,” which includes the use of cash, as far as possible, limiting one’s dependence on digital transaction options in favour of analog, and using good local banks instead of the banking behemoths, in the process decentralising financial power, which is further strengthened by supporting small local businesses instead of large corporations.\n\nOne should be under no illusion that this will prove to be easy, however. As history has taught us, when dictatorial powers attempt to gain power over people’s lives, resistance on the part of the latter is usually met with force, or ways of neutralising resistance.\n\nAs Lena Petrova reports, this was recently demonstrated in Nigeria, which was one of the first countries in the world (Ukraine being another), to introduce CBDCs, and where there was initially a very tepid response from the population, where most people prefer using cash (partly because many cannot afford smartphones).\n\nNot to be outdone, the Nigerian government resorted to dubious shenanigans, such as printing less money and asking people to hand in their ‘old’ banknotes for ‘new’ ones, which have not materialised. The result? People are starving because they lack cash to buy food, and they do not have, or do not want, CBDCs, partly because they lack smartphones and partly because they resist these digital currencies.\n\nIt is difficult to tell whether Nigerians’ doubts about CBDCs is rooted in their awareness that, once embraced, the digital passport of which these currencies will comprise a part, would allow the government complete surveillance and control of the populace. Time will tell whether Nigerians will accept this Orwellian nightmare lying down.\n\nWhich brings me to the significant philosophical point underpinning any argument about resisting the drive for dictatorial power through mass surveillance. As every enlightened person should know, there are different kinds of power. One such variety of power is encapsulated in Immanuel Kant’s famous motto for enlightenment, formulated in his famous 18th-century essay, “What is Enlightenment?” The motto reads: “Sapere aude!” and translates as “Have the courage to think for yourself,” or “Dare to think!”\n\nThis motto may be said to correspond with what contributors to the activities of Brownstone Institute engage in. Hence, the emphasis on critical intellectual engagement is indispensable. But is it sufficient? I would argue that, while speech act theory has demonstrated, accurately – emphasising the pragmatic aspect of language – that speaking (and one could add writing) is already ‘doing something,’ there is another sense of ‘doing.’\n\nThis is its meaning of acting in the sense one encounters in discourse theory – which demonstrates the interwovenness of speaking (or writing) and acting through the imbrication of language with power relations. What this implies is that language use is intertwined with actions that find their correlate(s) in speaking and writing. This is compatible with Hannah Arendt’s conviction, that of labour, work and action (the components of the vita activa), action – the verbal engagement with others, broadly for political purposes, is the highest embodiment of human activity.\n\nPhilosophers Michael Hardt and Antonio Negri have shed important light on the question of the connection between Kant’s “Sapere aude!” and action. In the third volume of their magisterial trilogy, Commonwealth (Cambridge, Mass., Harvard University Press, 2009; the other two volumes being Empire and Multitude), they argue that although Kant’s “major voice” shows that he was indeed an Enlightenment philosopher of the transcendental method, who uncovered the conditions of possibility of certain knowledge of the law-governed phenomenal world, but by implication also of a practical life of dutiful social and political responsibility, there is also a seldom-noticed “minor voice” in Kant’s work.\n\nThis points, according to them, towards an alternative to the modern power complex that Kant’s “major voice” affirms, and it is encountered precisely in his motto, articulated in the short essay on enlightenment referred to above. They claim further that the German thinker developed his motto in an ambiguous manner – on the one hand “Dare to think” does not undermine his encouragement, that citizens carry out their various tasks obediently and pay their taxes to the sovereign. Needless to stress, such an approach amounts to the strengthening of the social and political status quo. But on the other hand, they argue that Kant himself creates the aperture for reading this enlightenment exhortation (p. 17):\n\nOne cannot fault Hardt and Negri here; notice, above, that they include ‘acting’ among those things for which one requires the courage to ‘dare.’ As I have previously pointed out in a discussion of critical theory and their interpretation of Kant on the issue of acting, towards the conclusion of his essay, Kant uncovers the radical implications of his argument: if the ruler does not submit himself (or herself) to the very same rational rules that govern the citizens’ actions, there is no obligation on the part of the latter to obey such a monarch any longer.\n\nIn other words, rebellion is justified when authorities themselves do not act reasonably (which includes the tenets of ethical rationality), but, by implication, unjustifiably, if not aggressively, towards citizens.\n\nThere is a lesson in this as far as the ineluctable need for action is concerned when rational argument with would-be oppressors gets one nowhere. This is especially the case when it becomes obvious that these oppressors are not remotely interested in a reasonable exchange of ideas, but summarily resort to the current unreasonable incarnation of technical rationality, namely AI-controlled mass surveillance, with the purpose of subjugating entire populations.\n\nSuch action might take the form of refusing ‘vaccinations’ and rejecting CBDCs, but it is becoming increasingly apparent that one will have to combine critical thinking with action in the face of merciless strategies of subjugation on the part of the unscrupulous globalists.", "opengraph": {"title": "Technology and a tyranny worse than prison", "type": "article", "url": "https://www.glitch.news/2023-03-28-technology-and-a-tyranny-worse-than-prison.html", "site_name": "Glitch", "description": "In an outstanding piece of political-theoretical writing, titled ‘The Threat of Big Other’ (with its play on George Orwell’s ‘Big Brother’) Shoshana Zuboff, succinctly addresses the main issues of her book, The Age of Surveillance Capitalism – The Fight for a Human Future at the New Frontier of Power (New York: Public Affairs, Hachette, 2019), explicitly linking it to Orwell’s 1984. (Article by Bert […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/03/video-surveillance-people.jpg"}, "tags": ["conspiracy", "big government", "great reset", "deep state", "CBDC", "deception", "China", "currency crash", "money supply", "currency reset", "globalists", "cyber war", "Bubble", "enslaved", "information technology", "computing", "finance riot", "Glitch", "Tyranny", "fascism", "Orwellian", "totalitarianism"], "tweets": [], "movies": [], "links": ["https://time.com/5602363/george-orwell-1984-anniversary-surveillance-capitalism/", "https://www.amazon.com/Age-Surveillance-Capitalism-Future-Frontier/dp/1610395697", "https://www.planetebook.com/free-ebooks/1984.pdf", "https://brownstone.org/articles/technology-tyranny-worse-than-prison/", "https://www.foxnews.com/world/world-economic-forum-chair-klaus-schwab-declares-chinese-state-tv-china-model-many-nations", "https://www.thelastamericanvagabond.com/techno-tyranny-how-us-national-security-state-using-coronavirus-fulfill-orwellian-vision/", "https://www.amazon.com/Bodies-Others-Authoritarians-COVID-19-Against/dp/1737478560/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1677876429&sr=8-1", "https://www.bitchute.com/video/A1i3YtzVzKXf/", "https://home.solari.com/i-want-to-stop-cbdcs-what-can-i-do/", "https://www.youtube.com/watch?v=zGXPSv3Hrcs", "http://www.columbia.edu/acis/ets/CCREAD/etscc/kant.html", "https://www.amazon.com/Commonwealth-Michael-Hardt/dp/0674060288/ref=sr_1_1?crid=3V1XJWJDJ4T0K&keywords=Commonwealth+hardt+negri&qid=1677876921&sprefix=commonwealth+hardt+negri%2Caps%2C131&sr=8-1", "https://archive.org/details/empire0000hard", "https://archive.org/details/multitudewardemo0000hard", "https://journals.ufs.ac.za/index.php/aa/article/view/3697", "https://brownstone.org/articles/technology-tyranny-worse-than-prison/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-03-28-technology-and-a-tyranny-worse-than-prison.html&linkname=Technology%20and%20a%20tyranny%20worse%20than%20prison", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}