{"result_id": "132003", "URL": "https://www.glitch.news/2023-04-03-biden-white-house-censor-whatsapp-vaccine-safety.html", "timestamp": "2023-04-25 15:16:26 CEST+0200", "meta": {"description": "From March 2021 and onwards, newly leaked emails show, a key asset in the Joe Biden regime tried to strongarm WhatsApp owner Meta to intervene in private conversations about Wuhan coronavirus (Covid-19) “vaccines” and censor all truthful conversations. Rob Flaherty, the Biden White House’s director of digital strategy, demanded that WhatsApp spy on the private […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Biden,big government,Big Tech,Censored,Censorship,Collusion,conspiracy,content moderation,corruption,First Amendment,freedom,Glitch,intolerance,privacy watch,rigged,Social media,speech police,technocrats,thought police,vaccine hestiancy,vaccine wars,vaccines,WhatsApp,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-04-03-biden-white-house-censor-whatsapp-vaccine-safety.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Biden White House sought to censor private WhatsApp messages questioning vaccine safety", "cleaned_text": "From March 2021 and onwards, newly leaked emails show, a key asset in the Joe Biden regime tried to strongarm WhatsApp owner Meta to intervene in private conversations about Wuhan coronavirus (Covid-19) “vaccines” and censor all truthful conversations.\n\nRob Flaherty, the Biden White House’s director of digital strategy, demanded that WhatsApp spy on the private conversations of its users in order to silence any and all messaging that cast doubt on the “safety” and “effectiveness” of Fauci Flu jabs.\n\n“If you can’t see the message, I’m genuinely curious – how do you know what kinds of messages you’ve cut down on?” Flaherty complained in one of the temper tantrum emails to the company.\n\nAndrew Slavitt, the Biden White House Senior Advisor on the Covid Response, also tried to bully WhatsApp and Meta into doing more to interfere with the private conversations of the app’s users. At one point, Slavitt urged a Meta executive to speak with him over the phone a “couple of times per week,” if necessary, to keep covid jab skepticism from occurring in private conversations on the app.\n\n“I care mostly about what actions and changes you’re making to ensure you’re not making our country’s vaccine hesitancy problem worse,” Flaherty further wrote in another threatening correspondence to WhatsApp and Meta.\n\n“I still don’t have a good, empirical answer on how effective you’ve been at reducing the spread of vaccine-skeptical content and misinformation to vaccine fence sitters.”\n\nBiden’s cronies wanted all private messages containing vaccine skepticism to be brought “under control”\n\nIn one particularly chilling exchange, the Biden White House demanded that Meta directly interfere with all private conversations on WhatsApp in order to bring them “under control.”\n\nWhatever Meta did do was apparently not enough to satisfy the Biden regime’s demands because the company refused to censor people’s private conversations with their friends and family members. To do so would have been a massive public relations disaster.\n\n“What, exactly, was he hoping to get Meta to do?” asked journalist and author David Zweig in an article about this chilling development concerning Flaherty’s efforts to bully Meta into obeying the regime’s orders.\n\n“It was obvious from the start that WhatsApp’s interface didn’t allow for the granular control Flaherty appeared to desire. And his smiley face response suggests he well understood this. Yet he kept badgering the Meta executives anyway.”\n\nAll of this came to light via the Twitter Files, revealing extensive corruption within the Biden White House aimed at stamping out the First Amendment not only on social media but in people’s private digital conversations.\n\nThese specific emails were uncovered through discovery in a free speech legal case known as Missouri v. Biden, which was filed by two attorneys general and New Civil Liberties Alliance, a non-profit public interest law firm working on behalf of private plaintiffs.\n\n“As early as January 26, 2021, almost immediately after Biden took office, communications between the White House and Meta were underway regarding content moderation,” Zweig explains. “Of specific concern was vaccine hesitancy and how Meta would combat this across its multiple platforms, including Facebook and Instagram.”\n\n“Like at Twitter, the moderation campaigns at Facebook and Instagram were conducted because of their technical feasibility and the inherent social nature of the platforms – posts are public and Meta could use various methods to monitor and suppress them. But WhatsApp is fundamentally different. It is not designed for people to build an audience or to share content widely. Rather, it is used for direct, personal communications – between family, friends, a doctor and a patient, and so on. According to Meta, 90% of WhatsApp messages are from one person to another. And groups typically have fewer than 10 people.”\n\nThe latest news about Biden’s unlawful occupation of the White House can be found at Treason.news.", "opengraph": {"title": "Biden White House sought to censor private WhatsApp messages questioning vaccine safety", "type": "article", "url": "https://www.glitch.news/2023-04-03-biden-white-house-censor-whatsapp-vaccine-safety.html", "site_name": "Glitch", "description": "From March 2021 and onwards, newly leaked emails show, a key asset in the Joe Biden regime tried to strongarm WhatsApp owner Meta to intervene in private conversations about Wuhan coronavirus (Covid-19) “vaccines” and censor all truthful conversations. Rob Flaherty, the Biden White House’s director of digital strategy, demanded that WhatsApp spy on the private […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/04/WhatsApp.jpg"}, "tags": ["conspiracy", "big government", "WhatsApp", "speech police", "privacy watch", "content moderation", "corruption", "White House", "technocrats", "Biden", "intolerance", "vaccine hestiancy", "First Amendment", "Big Tech", "vaccine wars", "Social media", "thought police", "Glitch", "Censored", "rigged", "Censorship", "Collusion", "vaccines", "freedom"], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/white-house-tried-to-censor-private-whatsapp-messages-about-vaccine-skepticism/", "https://www.naturalnews.com/2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html", "https://davidzweig.substack.com/p/biden-white-house-pressured-meta", "http://treason.news", "https://www.infowars.com/posts/white-house-tried-to-censor-private-whatsapp-messages-about-vaccine-skepticism/", "https://www.naturalnews.com/2023-03-28-hhs-tranny-rachel-levine-mutilating-drugging-children.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-04-03-biden-white-house-censor-whatsapp-vaccine-safety.html&linkname=Biden%20White%20House%20sought%20to%20censor%20private%20WhatsApp%20messages%20questioning%20vaccine%20safety", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}