{"result_id": "132026", "URL": "https://www.glitch.news/2022-01-18-big-pharma-injects-new-technology-into-people.html", "timestamp": "2023-04-25 15:16:39 CEST+0200", "meta": {"description": "Scott Kesterson accused Big Pharma companies of injecting new technology into people through the so-called Wuhan coronavirus (COVID-19) vaccines. “These aren’t vaccines. These are a new era of technologies based on injecting people with technologies, not vaccines as we know them. What we’re calling a vaccine is in fact a genetically modified gene-altering injection that […]", "lang": "en", "keywords": "badmedicine,Big Pharma,coronavirus,covid-19,crispr technology,Dangerous Medicine,Fourth Industrial Revolution,future tech,genetic lunacy,Glitch,pandemic,pharmaceutical fraud,science deception,science fraud,transhumanism,vaccines,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-01-18-big-pharma-injects-new-technology-into-people.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Scott Kesterson reveals how Big Pharma is injecting exotic technology into people via covid vaccines – Brighteon.TV", "cleaned_text": "Scott Kesterson reveals how Big Pharma is injecting exotic technology into people via covid vaccines – Brighteon.TV\n\nScott Kesterson accused Big Pharma companies of injecting new technology into people through the so-called Wuhan coronavirus (COVID-19) vaccines.\n\n“These aren’t vaccines. These are a new era of technologies based on injecting people with technologies, not vaccines as we know them. What we’re calling a vaccine is in fact a genetically modified gene-altering injection that is literally using technologies to modify the genetics and to make people function the way that Big Pharma wants them to function,” Kesterson pointed out during the January 13 episode of his show “BardsFM” on Brighteon.TV.\n\n“This whole narrative that is shifting is, in part, in my opinion, centered on the fourth industrial revolution and the push towards transhumanism. It is absolutely essential to understand that much of the COVID process has nothing to do with a pandemic.”\n\nThe BardsFM host added that a large part of it has to do with a financial reset and moving towards a complete control of the systems of supply chain logistics and transactional control of every aspect of our lives. And the center point of all of this, according to Kesterson, is “a vision of integrating both the biological and the digital into a merged space to where they all are integrated to such a degree that they are inseparable over time.” (Related: Study: People with Machiavellian tendencies are in favor of transhumanism/mind uploading technology.)\n\nRapid change to technologies, industries and social patterns and processes\n\n“It’s the understanding of what transhumanism and fourth industrial revolution really are. So the fourth industrial revolution, which is also known as 4IR or Industrial 4.0, conceptualizes rapid change to technologies, industries and social patterns and processes in the 21st century due to increasing interconnectivity,” Kesterson said.\n\nHe also mentioned the term “smart automation,” which was coined by World Economic Forum founder Klaus Schwab.\n\n“It asserts that the changes seen are more than just improvements to efficiency but express a significant shift in industrial capitalism. A part of the space of industrial change is the joining of technologies like artificial intelligence, gene editing, to advanced robotics that blur the lines between the physical, the digital and biological worlds,” he explained.\n\nA critical aspect of the process, according to Kesterson, was the integration to society of CRISPR – a gene editing technology. It has been limited by a massive resistance by the evangelical community in the past, but now it has been accepted worldwide by people who rolled up their sleeves and took the injection in their arm.\n\nThe backpack journalist and documentary filmmaker also noted that former President Donald Trump signed the executive order that opened the door for the development of mRNA – which uses CRISPR technology. He was referring to Executive Order 13887, which was signed by Trump on September 19, 2019 to promote national security and public health.\n\n“The fourth industrial revolution is a merger of technologies. All transactions are now going to be run digitally,” Kesterson said. “The point of this whole thing is that every single action that deals with some sort of transaction is ultimately integrated into a master system, a master AI system that tracks every transaction on the globe. That means that all hard money, all hard currency is erased and everything is ultimately done through a digital ecosystem.”\n\nThe “BardsFM” host also said that there is very little talk about the full scope of what the industrial 4.0 is doing, and how critical these technologies are to creating economic dominance for the United States. “We are on a pathway right now of seeing a massive integration of these technologies in a full court press and in a level we have never imagined. And it all has happened under the covert cover of COVID,” Kesterson said.\n\nWatch the full January 13 episode of the “BardsFM” show below. “BardsFM” with Scott Kesterson airs every Thursday at 5-6 p.m. on Brighteon.TV.\n\nFollow Vaccines.news to know more about COVID-19 vaccines.", "opengraph": {"title": "Scott Kesterson reveals how Big Pharma is injecting exotic technology into people via covid vaccines – Brighteon.TV", "type": "article", "url": "https://www.glitch.news/2022-01-18-big-pharma-injects-new-technology-into-people.html", "site_name": "Glitch", "description": "Scott Kesterson accused Big Pharma companies of injecting new technology into people through the so-called Wuhan coronavirus (COVID-19) vaccines. “These aren’t vaccines. These are a new era of technologies based on injecting people with technologies, not vaccines as we know them. What we’re calling a vaccine is in fact a genetically modified gene-altering injection that […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/01/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["pandemic", "Fourth Industrial Revolution", "covid-19", "crispr technology", "Big Pharma", "science deception", "future tech", "science fraud", "vaccines", "transhumanism", "coronavirus", "genetic lunacy", "Wuhan coronavirus", "Glitch", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://brighteon.tv/", "http://transhumanism.news", "http://naturalnews.com/2021-07-11-machiavellian-tendencies-mind-uploading.html", "https://imdb.com/name/nm2620976/bio", "http://www.brighteon.com/4378a7f9-a141-4202-9b87-0cc0a7bc9c08", "http://brighteon.tv", "http://vaccines.news", "https://www.brighteon.com/4378a7f9-a141-4202-9b87-0cc0a7bc9c08", "https://www.imdb.com/name/nm2620976/bio", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-01-18-big-pharma-injects-new-technology-into-people.html&linkname=Scott%20Kesterson%20reveals%20how%20Big%20Pharma%20is%20injecting%20exotic%20technology%20into%20people%20via%20covid%20vaccines%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}