{"result_id": "132028", "URL": "https://www.glitch.news/2023-04-03-italy-bans-chatgpt-over-privacy-concerns.html", "timestamp": "2023-04-25 15:16:40 CEST+0200", "meta": {"description": "Italy has banned the artificial intelligence platform ChatGPT over privacy concerns, and has also launched an investigation over its maker OpenAI. The Italian Data Protection Authority (IDPA) confirmed the ban on ChatGPT late last month, but clarified that the prohibition is temporary. Once OpenAI complies with the European Union’s General Data Protection Regulation (GDPR), the ban […]", "lang": "en", "keywords": "artificial intelligence,banned,big government,Big Tech,chatbot,ChatGPT,computing,conspiracy,deception,European Union,GDPR,Glitch,information technology,Italian Data Protection Authority,Italy,national security,OpenAI,privacy watch,robots,tech giants,technocrats", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-04-03-italy-bans-chatgpt-over-privacy-concerns.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Italy bans ChatGPT over privacy concerns", "cleaned_text": "Italy has banned the artificial intelligence platform ChatGPT over privacy concerns, and has also launched an investigation over its maker OpenAI.\n\nThe Italian Data Protection Authority (IDPA) confirmed the ban on ChatGPT late last month, but clarified that the prohibition is temporary. Once OpenAI complies with the European Union’s General Data Protection Regulation (GDPR), the ban will be lifted. The GDPR is a privacy law in the EU that protects individuals’ fundamental rights to data protection.\n\nIDPA said on March 20 that ChatGPT had experienced a data breach involving user conversations and payment information. Following the breach, an investigation into OpenAI open was launched “with immediate effect.”\n\nAccording to the regulator, there was no legal basis for OpenAI to justify “the mass collection and storage of personal data for the purpose of ‘training’ the algorithms underlying the operation of the platform.”\n\nIt also accused ChatGPT of failing to check the age of its users. Only people above the age of 13 are supposed to be allowed to access the AI platform, but there is no way for it to verify how old people are. Given this, the IDPA pointed out that ChatGPT “exposes minors to absolutely unsuitable answers compared to their degree of development and awareness.”\n\nThe regulator gave OpenAI 20 days to respond to how it would address the concerns regarding ChatGPT. Failure to respond would subject the San Francisco-based OpenAI to a fine of either €20 million ($21.68 million) or up to four percent of its annual revenues.\n\nItaly’s move to ban ChatGPT makes it the first Western country to do so, according to the BBC. Other countries that have blocked the AI platform include China, Iran, North Korea and Russia. (Related: CCP blocks ChatGPT: Party officials fear chatbot will spread American propaganda online.)\n\nOpenAI did not respond to requests for comment sent by the BBC and the Semafor news website.\n\nSerious concerns about ChatGPT growing in Europe\n\nIDPA is not the only data protection authority that moved against ChatGPT. The Irish Data Protection Commission told the BBC that it is following up with its Italian counterpart to understand the basis for its action. The regulator added that it will “coordinate with all EU data protection authorities” in connection to the ban.\n\nThe Information Commissioner’s Office (ICO) said that while it supports developments in AI, it is also ready to “challenge non-compliance” with data protection laws. The ICO handles data privacy regulations in the United Kingdom.\n\nDan Morgan from cybersecurity rating provider SecurityScorecard said the ban on ChatGPT shows the importance of regulatory compliance for companies operating in Europe.\n\n“Compliance with regulations is not an optional extra,” said Morgan, who is the senior director for European government affairs at the company. “Businesses must prioritize the protection of personal data and comply with the stringent data protection regulations set by the European Union.”\n\nConsumer advocacy group BEUC also called on European authorities to investigate ChatGPT and similar chatbots. The group’s deputy director-general Ursula Pachl warned that society was “currently not protected enough” from the harm that AI can cause.\n\n“There are serious concerns growing about how ChatGPT and similar chatbots might deceive and manipulate people,” she warned. “These AI systems need greater public scrutiny, and public authorities must reassert control over them.”\n\nSince its launch in November 2022, millions of people have used ChatGPT for various purposes. It can answer questions using human-like language and mimic other writing styles, using the internet in 2021 as its database. Technology giant Microsoft has invested in the AI chatbot, incorporating it into its Bing search engine and announcing plans to include a version on it in Microsoft Office.\n\nHowever, concerns have arisen about ChatGPT – including its threat to jobs and its potential to spread misinformation and bias. True enough, Europol – the EU’s law enforcement agency – expressed concern about the spread of disinformation when data through the chatbot is processed inaccurately.\n\nThis video is from the jonastheprophet channel on Brighteon.com.\n\nDEAD RISING: AI-powered ChatGPT to connect the living and the dead.\n\nChatGPT AI taught to single out ‘hateful content’ by silencing whites, Republicans and MEN: Research.\n\nArtificial intelligence ChatGPT program successfully passes Bar, medical licensing exams – are machines taking over the world?", "opengraph": {"title": "Italy bans ChatGPT over privacy concerns", "type": "article", "url": "https://www.glitch.news/2023-04-03-italy-bans-chatgpt-over-privacy-concerns.html", "site_name": "Glitch", "description": "Italy has banned the artificial intelligence platform ChatGPT over privacy concerns, and has also launched an investigation over its maker OpenAI. The Italian Data Protection Authority (IDPA) confirmed the ban on ChatGPT late last month, but clarified that the prohibition is temporary. Once OpenAI complies with the European Union’s General Data Protection Regulation (GDPR), the ban […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/04/Artificial-Robot-Think-Data-Cyborg-Head-Smart.jpg"}, "tags": ["conspiracy", "big government", "national security", "deception", "OpenAI", "privacy watch", "chatbot", "robots", "technocrats", "banned", "ChatGPT", "Italy", "Big Tech", "tech giants", "information technology", "computing", "European Union", "Glitch", "GDPR", "artificial intelligence", "Italian Data Protection Authority"], "tweets": [], "movies": [], "links": ["https://www.semafor.com/article/03/31/2023/chatgpt-banned-italy-privacy-concerns", "https://www.bbc.com/news/technology-65139406", "http://privacywatch.news", "https://www.naturalnews.com/2023-03-01-ccp-blocks-chatgpt-fears-spread-american-propaganda.html", "http://computing.news", "https://www.brighteon.com/d3749554-1699-4873-9816-ca8dfa8ad700", "https://www.brighteon.com/channels/jonastheprophet777", "https://wokies.news/2023-02-13-chatgpt-almighty-ai-is-neoliberal-college-graduate.html", "https://glitch.news/2023-02-06-ai-powered-chatgpt-to-connect-living-dead.html", "https://biased.news/2023-02-06-chatgpt-used-to-single-out-hateful-content.html", "https://robots.news/2023-01-27-chatgpt-passes-bar-exams-medical-licensing-exams.html", "https://www.semafor.com/article/03/31/2023/chatgpt-banned-italy-privacy-concerns", "https://www.bbc.com/news/technology-65139406", "https://www.brighteon.com/d3749554-1699-4873-9816-ca8dfa8ad700", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-04-03-italy-bans-chatgpt-over-privacy-concerns.html&linkname=Italy%20bans%20ChatGPT%20over%20privacy%20concerns", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}