{"result_id": "132024", "URL": "https://glitch.news/2022-03-02-national-vaccine-pass-quietly-rolled-out.html", "timestamp": "2023-04-25 15:16:38 CEST+0200", "meta": {"description": "The National Vaccine Pass has quietly rolled out, and the red states are getting on board. This move is a push toward total social credit and technocracy, but a lot of people are looking the other way. The Centers for Disease Control and Prevention (CDC) is ditching its indoor masking guidance, and the omicron variant is loosening its […]", "lang": "en", "keywords": "Americans,badhealth,badmedicine,big government,computing,conspiracy,coronavirus,covid-19,data security,deception,information technology,mass surveillance,privacy,social credit,Technocracy,Tyranny,vaccine passports,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2022-03-02-national-vaccine-pass-quietly-rolled-out.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "Red states pushing for social credit and technocracy as vaccine pass is quietly rolled out", "cleaned_text": "Red states pushing for social credit and technocracy as vaccine pass is quietly rolled out\n\nThe National Vaccine Pass has quietly rolled out, and the red states are getting on board. This move is a push toward total social credit and technocracy, but a lot of people are looking the other way.\n\nThe Centers for Disease Control and Prevention (CDC) is ditching its indoor masking guidance, and the omicron variant is loosening its grip. However, many destinations still require travelers to show proof of vaccination, and increasingly the CDC vaccination cards are no longer cutting it.\n\nIn the February 28 episode of “World Alternative Media, host Josh Sigurdson told his viewers that the Wuhan coronavirus (COVID-19) does not exist, and neither does the omicron strain. He said the COVID-19 vaccines are meant to kill as many people as possible.\n\nWhile the United States government has not issued a federal digital vaccine pass, the national standard has nevertheless emerged with 21 states, the District of Columbia and Puerto Rico offering accessible smart health cards as verifiable digital proof of vaccination developed through the vaccination credential initiative (VCI).\n\nVCI is a global coalition of public and private stakeholders, including Microsoft, Salesforce, Oracle, the Mayo Clinic and other health and tech heavyweights. At least four more states will also be rolling out access to smart health cards.\n\nDr. Brian Anderson, co-founder of the VCI, said there is a notable uptick in vaccination in states that have officially launched public portals, where individuals can get verifiable vaccination credentials in the form of smart health cards with QR codes.\n\nVaccine accessibility varies by state, and this could be dangerous, especially considering that the government is advertising it.\n\nSome reports say there is already widespread availability of smart health cards in the United States. More than 200 million Americans can now download, print or store their vaccination records as a QR code. Only when the code is pulled up that the name, date of birth and vaccination information of the individual is visible. No other medical information or personal data are shared.\n\nThe code is also digitally signed to ensure that it is issued from a verified location and to prevent forgery.\n\nAt an international level, many are also seeing continued interest in a coordinated approach, where governments are going for global social credit. For instance, Canadian provinces have now adopted smart health card verifications, as did Aruba, the Cayman Islands, Singapore, Japan and Africa. (Related: Vaccine passports becoming a reality in the US – is it the start of segregation?)\n\nThe smart health card has already rolled out in Kenya and Rwanda, just the first of 32 African countries on the list. Africans are looking to adopt a digital-first approach to healthcare records, saying that they’re trying to go cashless, pushing their countries to social credit and technocracy.\n\nSigurdson warned that it is likely that the stats being given by the government and mainstream media are false, as they are trying to create groupthink so that people will go along with the new mandates.\n\nMore than a dozen states have already launched their own smart health card portals, and at least seven others turned to a third-party option.\n\nVaccine passports as surveillance under the guise of health measures\n\nThe public needs to distinguish how these documents can be used for public health and how they may violate privacy and threaten security. Details of vaccine passports vary in different jurisdictions, so people should ask what kind of data is actually being collected, how it will be stored and if it is encrypted and protected from crime or misuse.\n\nHow the government defines “necessity” is one of the best indicators as to whether or not the country is adopting health policies that primarily deal with COVID, or if they are expanding mass surveillance and movement restricting activities under the guise of public health.\n\nThe vaccine passport does not need to include health information that is unrelated to a person’s vaccination status, such as health card numbers or additional personal data. In New York and California, they limit the information to the holder’s legal name, date of birth and COVID-19 related information such as test and vaccine dates, locations and test manufacturer or vaccine type. (Related: EU pushes for extending vaccine passports as many countries start relaxing restrictions.)\n\nWhile it might make sense for some to give up a certain amount of privacy for the greater good of the public, it is not as simple for those not living in democratic societies, where they can be used for mass surveillance and opposition crackdowns in totalitarian regimes.\n\nVaccine passports may become part of monitoring and managing outbreaks, but they also have the potential for mass surveillance, and the threat to individual security is real, especially in a totalitarian state. For more liberal democracies, it is important to practice prudent foresight to protect the privacy rights of civilians as well.\n\nVaccine passports thwarted in the UK, at least for now.\n\nWatch the full February 28 episode of “World Alternative Media” below.\n\nThis video is from the “World Alternative Media” channel on Brighteon.com.\n\nRead more articles related to COVID-19 vaccines on Vaccines.news.", "opengraph": {"title": "Red states pushing for social credit and technocracy as vaccine pass is quietly rolled out", "type": "article", "url": "https://www.glitch.news/2022-03-02-national-vaccine-pass-quietly-rolled-out.html", "site_name": "Glitch", "description": "The National Vaccine Pass has quietly rolled out, and the red states are getting on board. This move is a push toward total social credit and technocracy, but a lot of people are looking the other way. The Centers for Disease Control and Prevention (CDC) is ditching its indoor masking guidance, and the omicron variant is loosening its […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/03/Health-Passport-Immune-Phone-App-Vaccine.jpg"}, "tags": ["conspiracy", "data security", "big government", "covid-19", "privacy", "vaccine passports", "Technocracy", "information technology", "social credit", "Americans", "computing", "deception", "mass surveillance", "vaccines", "coronavirus", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/be3760b7-86bc-4441-8100-1639ba9afcc2", "http://computing.news", "https://naturalnews.com/2021-08-09-segregation-vaccine-passports-becoming-reality-usa.html", "https://theconversation.com/vaccine-passports-can-be-used-for-surveillance-under-the-guise-of-public-health-measures-177422", "http://surveillance.news", "https://naturalnews.com/2022-02-08-eu-pushes-extending-vaccine-passports-restrictions.html", "https://vaccines.news/2021-09-01-protesters-march-against-vaccine-passports-in-london.html", "https://pandemic.news/2021-02-09-vaccine-passports-thwarted-in-uk-for-now.html", "https://vaccines.news/2021-09-06-harvard-professor-exposes-vaccine-passports-scientific-nonsense.html", "https://vaccines.news/2021-08-24-big-tech-to-normalize-vaccine-passport-use.html", "https://vaccines.news/2021-06-09-texas-prohibits-businesses-from-requiring-vaccine-passports.html", "https://www.brighteon.com/be3760b7-86bc-4441-8100-1639ba9afcc2", "https://www.brighteon.com/channels/worldalternativemedia", "http://Vaccines.news", "https://www.brighteon.com/be3760b7-86bc-4441-8100-1639ba9afcc2", "https://theconversation.com/vaccine-passports-can-be-used-for-surveillance-under-the-guise-of-public-health-measures-177422", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-03-02-national-vaccine-pass-quietly-rolled-out.html&linkname=Red%20states%20pushing%20for%20social%20credit%20and%20technocracy%20as%20vaccine%20pass%20is%20quietly%20rolled%20out", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}