{"result_id": "132017", "URL": "https://www.glitch.news/2022-08-05-culling-of-humanity-is-about-to-accelerate.html", "timestamp": "2023-04-25 15:16:34 CEST+0200", "meta": {"description": "It’s been a while since I’ve reported on the shocking numbers in the government’s VAERS reporting system and some of the heartbreaking stories contained there, such as the recent death of a 9-year-old California girl two weeks after she was jabbed. (Article republished from LeoHohmann.com) The girl received one dose of Pfizer-BioNTech’s injection. She had no preexisting […]", "lang": "en", "keywords": "coronavirus,covid-19,current events,Globalism,globalist elites,military tech,military technology,political correctness,robots,technocrats,transhumanism,Twisted,vaccine death,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-08-05-culling-of-humanity-is-about-to-accelerate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "The culling of humanity is about to accelerate, taking many children and young adults, as the doctors, politicians and preachers remain silent", "cleaned_text": "The culling of humanity is about to accelerate, taking many children and young adults, as the doctors, politicians and preachers remain silent\n\nIt’s been a while since I’ve reported on the shocking numbers in the government’s VAERS reporting system and some of the heartbreaking stories contained there, such as the recent death of a 9-year-old California girl two weeks after she was jabbed.\n\nThe girl received one dose of Pfizer-BioNTech’s injection. She had no preexisting conditions and was not hospitalized.\n\nShe experienced two to three days of “stomach ache, sore throat and chest pain; two weeks after receiving the vaccination,” the database states.\n\nVAERS data from December 14, 2020, to July 22, 2022, shows 12,232 adverse events in 5- to 11-year-olds, including 313 “serious” cases and nine deaths.\n\nThe database also lists 24 cases of heart inflammation, 47 cases of blood clotting disorders, and 101 reports of seizures in the same age group.\n\nReaders of this website know that VAERS doesn’t begin to tell the whole story. The deaths and disabling injuries listed there only represent 1 percent of the actual numbers due to the propensity of doctors to not report most of the devastation they see being caused by their partners in Big Pharma.\n\nTaken together from nations around the world, these deaths by injection will add up to a genocide of untold magnitude, a mass culling that fulfills the purposes of a Malthusian clan of globalist elites.\n\nHow can this be happening, you ask. And who are these “elites?”\n\nMany of these so-called elites are also Luciferian but plenty of others are just plain greedy. Still others remain silent and go along out of self-preservation. They don’t want to risk being canceled and jeopardize their comfortable lifestyles.\n\nThanks to the consolidation in the healthcare industry that was accelerated by Obamacare, most doctors today are just employees. They work for a paycheck. That means they’re easily controlled.\n\nAnd what about the politicians? Won’t the Republicans change this when they take over in January?\n\nThe genocide we see playing out in real time is so evil that I find it difficult to comprehend how anyone in politics is able to talk about any other issue.\n\nI typed “died days after receiving jab Pfizer Moderna” into my search engine and I turned up pages of articles about people dying, usually days or weeks after they had been jabbed.\n\nSoaring inflation, as painful as it is, represents nothing compared to the pain and confusion so many must be feeling when their mother, father, spouse, sibling, friend, or their 9-year-old son or daughter dies “suddenly” and “unexpectedly” days or weeks after being jabbed. They’re healthy one day, gone the next.\n\nAnd yet, it’s the forbidden subject. No politician, no matter how conservative or liberal, really wants to talk about it.\n\nTheir silence plays into the hands of the globalists who are behind this dark depopulation scheme.\n\nRemember what Jesus said about these evildoers:\n\nThey hate children because they hate humanity. And most of all they hate the Creator of humanity.\n\nHistorically, these elites always hated humanity, but they had to put up with us because they needed us to operate their factories, fight their wars, clean their mansions, harvest their food, make sure the trains run on time.\n\nWith the advances in gene editing, artificial intelligence and computer algorithms, they now have robots who can do all of the above tasks, often better and more reliably than we human beings. The crops that used to be picked in the fields can now be grown in a laboratory through CRISPR gene editing.\n\nWatch the video below to get an idea how far the advancements in robotics have come in just the last 10 years. Also keep in mind this video is from one company, Boston Dynamics. There are hundreds of companies working on robotics and while Boston Dynamics claims it will not partner with anyone wishing to use its robots for military purposes, many other companies are focused on exactly that application.\n\n\n\n Now watch this terrifying robot from Sword Defense Systems which is capable of firing off ballistic rounds in rapid succession with pinpoint accuracy out to 2,100 meters. As the narrator says, this is considered “the future of unmanned weapon systems, and that future is now.”\n\nHere’s another video on robotic ghost dogs used by the U.S. Air Force.\n\nI viewed half a dozen or so of these videos on YouTube and found it interesting how many of them are narrated in an almost comical tone. This is no laughing matter, folks. But I guess this is Big Tech’s way of lulling us into a complacent acceptance of the fact that they are making machines not only to replace us but to kill us.\n\nOn top of the technological advances that allow them to replace us and kill us with machines, the mass culling of humanity is also needed, in their eyes, because they believe the rapid advances in technology will allow them to live much longer. They’re transitioning, they tell us, from one species to another, from human, to transhuman.\n\nIf they think they can live to 125 or even 150, that means they will need to get rid of those of us they consider to be “useless eaters,” in order to preserve the valuable resources for themselves.\n\nThis Great Reset really is all about resources.\n\nAs Yuval Noah Harari has openly stated on more than one occasion, the problem is not that there are too many people, but that we have too many “useless” and “unproductive” people who have no value in the new digital economy.\n\nThe need for a mass culling of the population fits perfectly with the Malthusian ideas held by so many of the globalist power elites who control our institutions and think they’re going to live forever, or at least to an age twice that of the rest of us.\n\nThese ideas are based on the teachings of the 19th century English philosopher-cleric Thomas Malthus, who believed the earth’s population must be brought into balance with the supply of food and other natural resources.\n\nThere’s plenty of evidence that “fossil fuels” like oil and natural gas actually replenish themselves under the earth’s surface. The Rockefeller clan was the first to refer to oil, gas and coal as “fossil fuels,” likely because they were followers of Malthus and wanted to give the impression that these resources were finite and scarce.\n\nThe truth is that oil and gas are plentiful and should therefore be cheap.\n\nBut if they were cheap folks like the Rockefellers and Bushes wouldn’t have become billionaires. So the lies continue.\n\nKilling off a few billion humans has always been part of the plan.\n\nThe Kissinger Report, published in 1974, was one of the first official documents advocating a depopulation scheme, and there have been a never-ending avalanche of such reports, books and speeches by the globalists since that time calling for a vastly smaller global population. The Georgia Guidestones, which recently made the news when they mysteriously got blown to bits and then leveled, called for a world population “continuously in balance with nature” and limited to no more than 500 million people, down from the current 7.5 billion.\n\nDepopulation also fits the strategy for one-world control over all resources — living and non-living — embodied in the United Nations Agenda 2030 sustainable development goals.\n\nSo why wouldn’t the globalist power elites, the richest and most powerful people in the world, engage in eugenics and genocide?\n\nThe problem with waging biological warfare has always been, how do you deliver the weapon in an efficient manner?\n\nWe’ve seen anthrax letters and other small attacks, but what if you wanted to use the bioweapon to kill off a third or more of the world’s population? How would you do that in a way that kept the elites insulated from the death and destruction?\n\nIn steps the corrupt global media, now controlled by about six or seven major corporations with interlapping owners, and the problem is solved. You simply instruct your media lapdogs to unleash the biggest propaganda campaign the world has ever seen, and pay them handsomely to do it with money from government ads and from foundations like the Bill and Melinda Gates Foundation, and presto, you convince the ignorant masses to have the bioweapon injected directly into their bodies.\n\nAnyone who doubts this and puts their trust in the governments of the world, or their corporate partners in the media, all of whom have proven themselves to be mere pawns of the Davos elites personified by Bill Gates, Klaus Schwab, Yuval Noah Harari and the World Economic Forum, surely has their heads buried in the sand.\n\nHarari spelled it out very clearly when he said, “The chief value of science is power. They use truth to some extent but that is not their highest value. Science as an institution is mainly interested in gaining control over the world.” (see video below)\n\nHarari says his favorite book is Brave New World. How telling. Aldus Huxley wrote Brave New World to show us how an elite class of technocrats would one day rise up and run a centrally planned authoritarian system that manages all human activity. And when the people in this future dystopian society reached an age when they were no longer productive or useful to the system, they were given a drug that put them to sleep, forever. No one, other than the elites, was allowed to live past the age of 60 in Harari’s favorite book, the Brave New World.\n\nThese people are ruthless. But what I love about Harari is, unlike most of the globalist elites, he doesn’t try to deceive us into thinking the outcome of their agenda will be in any way benevolent or that these monsters have any sort of altruistic motives. He comes right out and tells us what motivates their actions; they want to dominate and enslave us. It’s about power and control.\n\nWe must know our enemy and the depths of depravity of the individuals we are dealing with. If we are going to break them it will take steadfast resistance and courage to stand up, speak out, and learn to live with the consequences. We must learn to live outside of their systems. That will require us working together, not against each other. The more people we can convince to join us the better off we will be.\n\nBut even if it turns out that we cannot defeat them, they will be stopped by the hand of God. He will not stand back for long and let the world be taken over by Luciferian killers and deceivers.\n\nGod forbid that we should act like the parents of that 9-year-old girl, who unknowingly offered their child up to these demons. As God almighty said, “My people perish for lack of knowledge.”", "opengraph": {"title": "The culling of humanity is about to accelerate, taking many children and young adults, as the doctors, politicians and preachers remain silent", "type": "article", "url": "https://www.glitch.news/2022-08-05-culling-of-humanity-is-about-to-accelerate.html", "site_name": "Glitch", "description": "It’s been a while since I’ve reported on the shocking numbers in the government’s VAERS reporting system and some of the heartbreaking stories contained there, such as the recent death of a 9-year-old California girl two weeks after she was jabbed. (Article republished from LeoHohmann.com) The girl received one dose of Pfizer-BioNTech’s injection. She had no preexisting […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/08/Coronavirus-Empty-Grocery-Store-Shelves-600.jpeg"}, "tags": ["robots", "current events", "military tech", "covid-19", "political correctness", "technocrats", "vaccine injury", "Twisted", "vaccines", "transhumanism", "coronavirus", "vaccine death", "military technology", "globalist elites", "Globalism"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe class=\"youtube-player\" src=\"https://www.youtube.com/embed/Rdm2ggtFvmQ?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" width=\"560\" height=\"315\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe>", "src": "https://www.youtube.com/embed/Rdm2ggtFvmQ?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe class=\"youtube-player\" src=\"https://www.youtube.com/embed/Mnnyixbpnv8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" width=\"560\" height=\"315\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe>", "src": "https://www.youtube.com/embed/Mnnyixbpnv8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe class=\"youtube-player\" src=\"https://www.youtube.com/embed/3UBlQVB7vYI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en&amp;autohide=2&amp;wmode=transparent\" width=\"560\" height=\"315\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"></iframe>", "src": "https://www.youtube.com/embed/3UBlQVB7vYI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en&autohide=2&wmode=transparent"}], "links": ["https://truthpress.com/news/9-year-old-dies-two-weeks-after-taking-covid-vaccine-vaers/", "https://leohohmann.com/2022/08/03/the-culling-of-humanity-is-about-to-accelerate-taking-many-children-and-young-adults-as-the-doctors-politicians-and-preachers-remain-silent/", "https://wonder.cdc.gov/controller/datarequest/D8;jsessionid=B43CE86BAB405BCC3A616E859998", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Seizure+%2810039906%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://duckduckgo.com/?q=dies+two+weeks+after+receiving+jab+pfizer+moderna&atb=v312-1&ia=web", "https://www.intelligenteconomist.com/malthusian-theory/", "https://bibleandbookcenter.com/read/the-kissinger-report/", "https://leohohmann.com/2022/07/06/explosion-reported-at-georgia-guidestones-monument-to-the-devil-has-now-been-completely-demolished/", "https://leohohmann.com/2022/08/03/the-culling-of-humanity-is-about-to-accelerate-taking-many-children-and-young-adults-as-the-doctors-politicians-and-preachers-remain-silent/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-08-05-culling-of-humanity-is-about-to-accelerate.html&linkname=The%20culling%20of%20humanity%20is%20about%20to%20accelerate%2C%20taking%20many%20children%20and%20young%20adults%2C%20as%20the%20doctors%2C%20politicians%20and%20preachers%20remain%20silent", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}