{"result_id": "132016", "URL": "https://www.glitch.news/2023-04-02-twitter-temporarily-suspends-new-york-post.html", "timestamp": "2023-04-25 15:16:34 CEST+0200", "meta": {"description": "So-called “free speech absolutist” Elon Musk’s Twitter temporarily locked out the New York Post on Thursday, March 30, after it tweeted out a story about how the social media company deleted over 5,000 tweets. The Post was informed that it violated one of the social media platform’s rules, preventing it from posting any tweets to its main […]", "lang": "en", "keywords": "banned,Censored,Censorship,Elon Musk,free press,gender,Glitch,LGBT,New York Post,rigged,speech police,suppression,trans,Trans Day of Vengeance,transgender,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-04-02-twitter-temporarily-suspends-new-york-post.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Twitter temporarily suspends New York Post account for exposing the platform’s removal of over 5,000 tweets", "cleaned_text": "Twitter temporarily suspends New York Post account for exposing the platform’s removal of over 5,000 tweets\n\nSo-called “free speech absolutist” Elon Musk’s Twitter temporarily locked out the New York Post on Thursday, March 30, after it tweeted out a story about how the social media company deleted over 5,000 tweets.\n\nThe Post was informed that it violated one of the social media platform’s rules, preventing it from posting any tweets to its main account, which has 2.8 million followers.\n\nTwitter’s suppression of the publication came as multiple other news outlets were reporting the very same story of the social media platform’s decision to scrub over 5,000 tweets and retweets featuring the same subject.\n\nBruce Golding, writing for the Post, pointed out that the censorship of the publication’s Twitter account flies in the face of Musk’s description of himself as a “free speech absolutist” who desires to turn the social media platform into a marketplace of ideas that does not censor anything.\n\nFurthermore, Musk previously called Twitter’s crackdown on the Post in October 2020 due to its investigation into emails on Hunter Biden’s laptop “incredibly appropriate.” At the time, Twitter demanded that the Post delete at least six tweets that linked to the story, claiming the investigation is based on information obtained illegally.\n\nTwitter eventually restored the Post‘s access to its account after 8 p.m. EST on Thursday.\n\nThe over 5,000 tweets deleted from Twitter were discussing a “Trans Day of Vengeance” protest in front of the United States Supreme Court on Saturday, April 1, organized by the militant Trans Radical Activist Network (TRAN). (Related: Nashville transgender Christian school shooting occurred just days after “Trans Day of Vengeance” protest.)\n\nThe organization was moving forward with its planned protest for the rights of American transgenders despite the fact that, just days before, a transgender person entered the Covenant School in Nashville, Tennessee, killing six people, including three nine-year-old children.\n\nThe shooter, Audrey Hale, went by the name Aiden and identified herself as a male. Metropolitan Nashville Police Department Chief John Drake confirmed that “there is some theory” to concerns that transgender propaganda and Hale’s self-identification as a male played a role in the shooter’s decision to commit mass murder.\n\nTwitter’s head of trust and safety Ella Irwin claimed that the images involving the “Trans Day of Vengeance” were automatically compiled and deleted from the platform because Twitter “does not support tweets that incite violence, irrespective of who posts them.”\n\n“‘Vengeance’ does not imply peaceful protest,” said Irwin. “Organizing or support for peaceful protests is okay.”\n\nTRAN claims the so-called peaceful protest in front of the Supreme Court was planned before Hale’s mass shooting and was not in any way a call to violence.\n\n“Vengeance means fighting back with vehemence,” claimed the radical organization on its website. “We are fighting against false narratives, criminalization and the eradication of our existence.”\n\nLearn more about the suppression of free speech on social media platforms at Suppressed.news.\n\nWatch this video discussing in detail Twitter’s “censorship industrial complex,” supported by non-government organizations, mainstream media outlets and governments.\n\nThis video is from the Andrew Zebrun III channel on Brighteon.com.\n\nTwitter Files: US government helped launch project where millions of online posts were flagged for censorship.\n\nBREAKING: Twitter Files detail the “censorship-industrial complex,” revealing an “incestuous self-appointed truth squad” made up of media, government and NGOs.\n\nTwitter exposes how government funded a “cottage industry” of “disinformation labs” that were used to censor real info and ban truth tellers.\n\nFormer Twitter execs GRILLED by House Republicans over censorship, possible violations of the Constitution.", "opengraph": {"title": "Twitter temporarily suspends New York Post account for exposing the platform’s removal of over 5,000 tweets", "type": "article", "url": "https://www.glitch.news/2023-04-02-twitter-temporarily-suspends-new-york-post.html", "site_name": "Glitch", "description": "So-called “free speech absolutist” Elon Musk’s Twitter temporarily locked out the New York Post on Thursday, March 30, after it tweeted out a story about how the social media company deleted over 5,000 tweets. The Post was informed that it violated one of the social media platform’s rules, preventing it from posting any tweets to its main […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/04/Censored-Twitter-Lock-Computer-Keyboard.jpg"}, "tags": ["New York Post", "trans", "Trans Day of Vengeance", "free press", "Censored", "Elon Musk", "banned", "rigged", "speech police", "Censorship", "transgender", "gender", "suppression", "LGBT", "Glitch", "Twitter"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/tech/2023/03/31/free-speech-absolutist-elon-musks-twitter-locks-account-of-new-york-post/", "https://nypost.com/2023/03/30/twitter-locks-out-the-post-over-story-on-5k-scrubbed-tweets/", "https://censorship.news/", "https://www.naturalnews.com/2023-03-31-nashville-school-shooting-followed-trans-day-vengeance.html", "https://suppressed.news/", "https://www.brighteon.com/58d84568-24d8-488e-8f0e-7c7dfd1eea12", "https://www.brighteon.com/channels/andrewzebruniii", "https://www.brighteon.com/channels/andrewzebruniii", "https://speechpolice.news/2023-03-21-us-government-helped-online-posts-censorship.html", "https://suppressed.news/2023-03-14-twitter-files-detail-the-censorship-industrial-complex.html", "https://freepress.news/2023-03-14-taxpayers-fund-censorship-vaccine-injuries-deaths.html", "https://censorship.news/2023-03-07-twitter-exposes-govt-funded-cottage-industry-of-disinformation-labs.html", "https://www.naturalnews.com/2023-02-10-house-grilled-former-twitter-execs-over-censorship.html", "https://www.breitbart.com/tech/2023/03/31/free-speech-absolutist-elon-musks-twitter-locks-account-of-new-york-post/", "https://nypost.com/2023/03/30/twitter-locks-out-the-post-over-story-on-5k-scrubbed-tweets/", "https://www.brighteon.com/58d84568-24d8-488e-8f0e-7c7dfd1eea12", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-04-02-twitter-temporarily-suspends-new-york-post.html&linkname=Twitter%20temporarily%20suspends%20New%20York%20Post%20account%20for%20exposing%20the%20platform%E2%80%99s%20removal%20of%20over%205%2C000%20tweets", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}