{"result_id": "132002", "URL": "https://glitch.news/2019-02-27-internet-thought-police-are-blocking-access-to-human-knowledge.html", "timestamp": "2023-04-25 15:16:24 CEST+0200", "meta": {"description": "As you’ve probably been noticing lately, it’s becoming increasingly more difficult to access honest and truthful information online, as the tech overlords who want to control us all continue to impose all sorts of new censorship tactics aimed at stamping out facts and replacing them with lies and propaganda. Their latest target appears to be […]", "lang": "en", "keywords": "Alex Jones,assault,assault on liberty,Barbara Loe Fisher,Big Tech,Censorship,Dark Ages,disinfo,disinformation campaign,evil,Facebook,First Amendment,free speech,Glitch,Google,information control,InfoWars,National Vaccine Information Center,NVIC,Pinterest,propaganda,real investigations,search engine,Social media,tech giants,technocrats,thought police,truth,Twitter,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2019-02-27-internet-thought-police-are-blocking-access-to-human-knowledge.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "The internet’s “thought police” are fully active now, blocking access to human knowledge that’s critical for the future of our civilization", "cleaned_text": "The internet’s “thought police” are fully active now, blocking access to human knowledge that’s critical for the future of our civilization\n\nAs you’ve probably been noticing lately, it’s becoming increasingly more difficult to access honest and truthful information online, as the tech overlords who want to control us all continue to impose all sorts of new censorship tactics aimed at stamping out facts and replacing them with lies and propaganda.\n\nTheir latest target appears to be information about vaccines, as Leftists are now actively pressuring social media platforms like Facebook and Pinterest to restrict all content that in any way suggests that government-approved vaccines are unsafe and ineffective.\n\nAs revealed by Barbara Loe Fisher, co-founder of the National Vaccine Information Center (NVIC), in a recent article, the “deep state” government has been actively colluding with powerful corporations and institutions for many years to steer the conversation away from vaccine skepticism, using “thought police” coercion if necessary.\n\n“In the very near future you may not be able to find information about vaccine science, policy and law published on websites like NVIC.org and TheVaccineReaction.org or be able to connect with us on social media platforms to have an open conversation about it,” warns Fisher.\n\n“With the cancellation of net neutrality in the U.S. in 2017, the two decade forging of public-private business partnerships between governments and politically powerful corporations and institutions has cleared the way for factual information about health to be censored as ‘fake news’ and quietly removed from the Internet if it does not conform with public health policy and government recommendations for use of pharmaceutical and food products.”\n\nFor more news about Big Tech’s assault on free speech, be sure to check out Censorship.news.\n\nThe deep state is building an electronic wall to prevent you from finding the truth online\n\nAs you’ll probably recall, the first “big fish” to go down was Alex Jones of Infowars, who watched as his media empire was systematically removed from Apple, Google, Facebook, and many other tech platforms. And as we warned at the time, it won’t stop there.\n\n“An electronic wall is being built to block you from getting information you want so you only get information someone else decides you need,” Fisher explains. “An electronic burning of the books has begun, and the people are being silently herded into a virtual Dark Age. While this censorship is starting with conversations about health and vaccination, it will not end there.”\n\nJust a few days ago, The Wall Street Journal (WSJ) reported that Pinterest is altering its algorithms so users can’t even perform searches for content associated with “vaccination.”\n\nThe purpose of this censorship, the WSJ article explains, is to curb the spread of “misinformation,” as well as demonstrate to the world that tech companies truly do hold the “power … to censor discussion of hot-button issues.”\n\nIt’s already been happening for a long time on Leftist platforms like Web of Trust, Snopes, and Wikipedia, all of which have functioned as players in the orchestra of propaganda and lies. And now there are even browser plugins that are designed to tag all fake news as “truth,” and all real news as “misinformation.”\n\nBut now the thought police are going for the headshot by taking aim at social media, the last bastion where everyday folks have, up until this point, been able to freely engage in conversation and the exchange of information. Once that’s gone, it’s Game Over.\n\n“The new Internet Police scrubbing the World Wide Web of information they do not want you to see or talk about is part of the larger culture war going on today in our country and in many countries,” Fisher writes.\n\n“When it comes to vaccination, discrimination and censorship is justified in the name of public safety and The Greater Good.”\n\nBe sure to read her full piece at this link.", "opengraph": {"title": "The internet’s “thought police” are fully active now, blocking access to human knowledge that’s critical for the future of our civilization", "type": "article", "url": "https://www.glitch.news/2019-02-27-internet-thought-police-are-blocking-access-to-human-knowledge.html", "site_name": "Glitch", "description": "As you’ve probably been noticing lately, it’s becoming increasingly more difficult to access honest and truthful information online, as the tech overlords who want to control us all continue to impose all sorts of new censorship tactics aimed at stamping out facts and replacing them with lies and propaganda. Their latest target appears to be […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2019/02/Freedom-Correct-Speech-Free-Censorship-Stutter-Truth.jpg"}, "tags": ["Google", "information control", "assault", "assault on liberty", "Dark Ages", "Barbara Loe Fisher", "National Vaccine Information Center", "Twitter", "real investigations", "technocrats", "First Amendment", "truth", "disinformation campaign", "disinfo", "Big Tech", "propaganda", "NVIC", "tech giants", "Social media", "thought police", "Facebook", "Glitch", "search engine", "evil", "InfoWars", "Censorship", "vaccines", "Pinterest", "Alex Jones", "free speech"], "tweets": [], "movies": [], "links": ["http://www.greenmedinfo.com/blog/new-internet-police-protecting-you-freedom-thought-and-speech", "http://censorship.news", "https://www.naturalnews.com/2018-08-09-censorship-of-alex-jones-wont-stop-natural-medicine-cannabis-health-freedom.html", "https://www.wsj.com/articles/next-front-in-tech-firms-war-on-misinformation-bad-medical-advice-11550658601", "https://www.naturalnews.com/2019-02-04-newsguard-censorship-plug-in-labels-confirmed-media-hoaxes-to-be-credible-news-while-blacklisting-all-independent-media.html", "http://www.greenmedinfo.com/blog/new-internet-police-protecting-you-freedom-thought-and-speech", "http://www.greenmedinfo.com/blog/new-internet-police-protecting-you-freedom-thought-and-speech", "https://www.naturalnews.com/2018-08-09-censorship-of-alex-jones-wont-stop-natural-medicine-cannabis-health-freedom.html", "https://www.wsj.com/articles/next-front-in-tech-firms-war-on-misinformation-bad-medical-advice-11550658601", "https://www.naturalnews.com/2019-02-04-newsguard-censorship-plug-in-labels-confirmed-media-hoaxes-to-be-credible-news-while-blacklisting-all-independent-media.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2019-02-27-internet-thought-police-are-blocking-access-to-human-knowledge.html&linkname=The%20internet%E2%80%99s%20%E2%80%9Cthought%20police%E2%80%9D%20are%20fully%20active%20now%2C%20blocking%20access%20to%20human%20knowledge%20that%E2%80%99s%20critical%20for%20the%20future%20of%20our%20civilization", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}