{"result_id": "132009", "URL": "https://www.glitch.news/2022-02-01-doctor-bluetooth-detect-mac-address-vaccinated-covid.html", "timestamp": "2023-04-25 15:16:29 CEST+0200", "meta": {"description": "A digestive physician with a PhD in molecular biology conducted an experiment recently which found that the covid-“vaccinated” are now transmitting signals from inside their bodies. Using various Bluetooth applications, Dr. Luis Miguel de Benito identified MAC addresses emanating from the bodies of people who took the jabs, suggesting that they now contain hidden microchips […]", "lang": "en", "keywords": "5g,badmedicine,Bluetooth,computing,conspiracy,COVID,Glitch,great reset,implant,Internet of Things,Luis Miguel De Benito,MAC address,microchip,Microchips,nanotechnology,vaccinated,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-02-01-doctor-bluetooth-detect-mac-address-vaccinated-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Doctor use Bluetooth applications to detect MAC address network signals in people “vaccinated” for covid", "cleaned_text": "Doctor use Bluetooth applications to detect MAC address network signals in people “vaccinated” for covid\n\nA digestive physician with a PhD in molecular biology conducted an experiment recently which found that the covid-“vaccinated” are now transmitting signals from inside their bodies.\n\nUsing various Bluetooth applications, Dr. Luis Miguel de Benito identified MAC addresses emanating from the bodies of people who took the jabs, suggesting that they now contain hidden microchips or transmitters that could be linked to a futuristic “Mark of the Beast.”\n\nKeep in mind that on Jan. 10, 2016, World Economic Forum (WEF) founder Klaus Schwab told the world that within the next 10 years, “first we will wear them in our clothes, and then we could imagine that we will implant them in our brains or on our skin,” referring to implantable microchips.\n\nCould it be that Wuhan coronavirus (Covid-19) “vaccines” are really just digital implants hiding within the mysterious “grey matter” fluid contained inside the vials?\n\nSchwab did infamously warn that these microchips would coincide with his planned “Great Reset,” which he also promised would be achieved through the Covid-19 plandemic.\n\nSchwab actually referred to Covid-19 as “a rare but narrow window of opportunity to rethink, reinvent, and reset our world,” admitting that its main purpose is to transition the world into a new order – or you might say they want to make the entire world trans.\n\n“Dr. Benito’s findings from his experiment conducted in the summer of 2021, could suggest that Schwab’s plans for this fusion, may have already come to fruition through COVID gene therapy injections, which according to Benito, appear to install a MAC address inside individuals who have taken the jab,” reported the Daily Exposé‘s Patricia Harrity.\n\nAre the covid-vaccinated being “marked” with secret implantable microchips?\n\nHarrity, like many, believes that the “window of opportunity” that Schwab spoke about directly referred to the intentional construction of the plandemic.\n\nBillionaire eugenicist Bill Gates did, after all, hold a plandemic exercise called Event 201 months before the Fauci Flu plandemic was launched under the Trump administration.\n\nThat exercise just so happened to “simulate” exactly what would happen just a few months later when the World Health Organization (WHO) and communist China announced that a new “virus” called “Covid-19” had magically appeared out of nowhere in bat soup at a Wuhan wet market.\n\nWe now know that the whole thing was manufactured by Tony Fauci and other American government career criminals who foisted this nightmare on the world in exchange for more profit and more control.\n\nDon’t forget that Schwab himself also revealed that “in the end, maybe there will be a direct communication between our brain and the digital world,” adding that what he envisioned was “a king of fusion of the physical, digital, and biological world.”\n\nAgain, he said all of this in 2016, years before the covid plandemic was launched. Now, people who get jabbed are sending mysterious signals from their bodies that sound eerily similar to what Schwab was talking about at the time.\n\nCould it be that the “fully vaccinated” are now walking cell phone towers, of sorts, that are communicating back and forth with something, perhaps the new 5G towers that continue to be constructed and activated, thanks at least in part to the billions of dollars that Trump demanded for a fast-tracked rollout?\n\n“Is it really that big of a jump to move from recognizing that these people are deliberately trying to maim and kill with these snake bites to thinking they might also want to track and control those same people receiving the bites?” asked one reader at the Exposé.\n\nThe latest news about Wuhan coronavirus (Covid-19) “vaccines” can be found at Genocide.news.", "opengraph": {"title": "Doctor use Bluetooth applications to detect MAC address network signals in people “vaccinated” for covid", "type": "article", "url": "https://www.glitch.news/2022-02-01-doctor-bluetooth-detect-mac-address-vaccinated-covid.html", "site_name": "Glitch", "description": "A digestive physician with a PhD in molecular biology conducted an experiment recently which found that the covid-“vaccinated” are now transmitting signals from inside their bodies. Using various Bluetooth applications, Dr. Luis Miguel de Benito identified MAC addresses emanating from the bodies of people who took the jabs, suggesting that they now contain hidden microchips […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/02/5G-Cell-Tower-Social-Media-Likes.jpg"}, "tags": ["Internet of Things", "conspiracy", "great reset", "vaccinated", "vaccine wars", "5g", "COVID", "implant", "MAC address", "computing", "Microchips", "nanotechnology", "Bluetooth", "vaccines", "microchip", "Glitch", "Luis Miguel De Benito"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/01/29/doctor-detects-mac-addresses-in-covid-vaccinated-individuals-with-bluetooth-applications/", "https://naturalnews.com/2020-01-29-bill-gates-pandemic-exercise-coronavirus.html", "https://naturalnews.com/2020-06-22-trump-wants-billions-more-in-taxpayer-funding-for-5g-rollout.html", "http://genocide.news", "https://dailyexpose.uk/2022/01/29/doctor-detects-mac-addresses-in-covid-vaccinated-individuals-with-bluetooth-applications/", "https://naturalnews.com/2020-01-29-bill-gates-pandemic-exercise-coronavirus.html", "https://naturalnews.com/2020-06-22-trump-wants-billions-more-in-taxpayer-funding-for-5g-rollout.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-02-01-doctor-bluetooth-detect-mac-address-vaccinated-covid.html&linkname=Doctor%20use%20Bluetooth%20applications%20to%20detect%20MAC%20address%20network%20signals%20in%20people%20%E2%80%9Cvaccinated%E2%80%9D%20for%20covid", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}