{"result_id": "132022", "URL": "https://glitch.news/2023-02-01-governments-spied-journalists-politicians-critical-covid-policy.html", "timestamp": "2023-04-25 15:16:37 CEST+0200", "meta": {"description": "A new report from Big Brother Watch details how the British government hired contractors to spy on high-profile journalists and politicians to ensure they followed the script of the official covid narrative. Entitled “Ministry of Truth: The secretive government units spying on your speech,” the report explains at length how these hired contractors were tasked […]", "lang": "en", "keywords": "banned,Big Brother Watch,big government,Big Tech,Censorship,COVID,Glitch,health freedom,Liberty,media fact watch,medical censorship,Medical Tyranny,Ministry of Truth,pandemic,privacy watch,propaganda,real investigations,speech police,spying,surveillance,technocrats,thought police,tweets,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2023-02-01-governments-spied-journalists-politicians-critical-covid-policy.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "Governments spied on high-profile journalists, politicians that were critical of covid policy", "cleaned_text": "Governments spied on high-profile journalists, politicians that were critical of covid policy\n\nA new report from Big Brother Watch details how the British government hired contractors to spy on high-profile journalists and politicians to ensure they followed the script of the official covid narrative.\n\nEntitled “Ministry of Truth: The secretive government units spying on your speech,” the report explains at length how these hired contractors were tasked with flagging suspicious tweets for potential recategorization as “misinformation” if they contained anything that the government deemed as “false.”\n\nThose who tweeted offending tweets were then punished in accordance with Big Tech’s covid “misinformation” and “disinformation” policies, which in some cases resulted in a ban.\n\nAccording to the report, there was a special government list of offending tweets and associated accounts that Big Brother used to go after prominent targets such as MP David Davis and journalist Julia Hartley-Brewer, both of whom criticized the government’s covid monitoring apparatus.\n\nThree Tory MPs were targeted for joining Parler, a free speech alternative platform to Twitter. Silkie Carlo and Mark Johnson of Big Brother Watch, along with Adam Brooks, a pub landlord and political commentator, were also targeted for criticizing so-called “vaccine passports.”\n\n“The UK government also considered flagging Toby Young posts to Twitter while Peter Hitchens and Daily Mail journalist Ross Clark were targeted for criticizing lockdowns, just as Keir Starmer, Andy Burnham, MP Chris Green were targeted for criticizing tiered regulations and local lockdowns,” reported Reclaim the Net. “Starmer is the leader of the Labour Party and Andy Burnham is the Mayor of Manchester.”\n\nThe U.S. government is spying on and punishing “misinformation” spreaders, too\n\nMind you, what was happening in the UK as far as censorship goes was far more limited than what was happening, and continues to happen, here in the United States.\n\nOver there, potential “opinion-makers” were the primary targets of the government’s spying and surveillance operation. Here in the States, anyone who tries to tell the truth online faces potential punishment by Big Tech and the government.\n\nWe now know that in the UK, a military division called the 77th Brigade was brought in to help with that country’s “information” warfare operations. It was a whistleblower from the 77th Brigade who came forward to spill the beans that let us all know about his group’s involvement.\n\nThat whistleblower “lift[ed] the lid on the ‘sentiment analysis’ the 77th Brigade conducted, looking at how people viewed the government’s handling of the pandemic.”\n\nThrough a number of Freedom of Information requests, Big Brother Watch also determined that the following were also involved in Great Britain’s censorship operations: the Counter Disinformation Unit (covering government response from the Department for Digital, Culture Media and Sport, as well as the Rapid Response Unit in the Cabinet Office) and the Foreign Office’s Government Information Cell, and the Research, Intelligence and Communications Unit in the Home Office.\n\n“This is an alarming case of mission creep, where public money and even military power have been misused to monitor academics, journalists, campaigners and members of parliament who criticized the government, particularly during the pandemic,” commented Big Brother Watch Director Silkie Carlo.\n\nAs we also reported, Twitter hired its own army of FBI agents to help with these surveillance operations both domestically and abroad.\n\n“Twitter is just another arm of government newspeak,” wrote a commenter here at Natural News about the deceptive nature of this “social media” platform. “Censor any opposition to the party line.”\n\nThe latest censorship-related news can be found at Censorship.news.", "opengraph": {"title": "Governments spied on high-profile journalists, politicians that were critical of covid policy", "type": "article", "url": "https://www.glitch.news/2023-02-01-governments-spied-journalists-politicians-critical-covid-policy.html", "site_name": "Glitch", "description": "A new report from Big Brother Watch details how the British government hired contractors to spy on high-profile journalists and politicians to ensure they followed the script of the official covid narrative. Entitled “Ministry of Truth: The secretive government units spying on your speech,” the report explains at length how these hired contractors were tasked […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/02/Digital-Eye-Spy-Surveillance.jpg"}, "tags": ["pandemic", "big government", "Liberty", "speech police", "COVID", "tweets", "privacy watch", "Big Brother Watch", "real investigations", "spying", "technocrats", "banned", "propaganda", "media fact watch", "Big Tech", "medical censorship", "Ministry of Truth", "Medical Tyranny", "surveillance", "thought police", "Glitch", "Tyranny", "Censorship", "health freedom"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/uk-government-monitored-politician-journalists-covid-dissent/", "https://naturalnews.com/2021-04-21-apple-approves-parler-after-surrender-speech-police.html", "https://naturalnews.com/2022-10-03-twitter-hires-fbi-agents-big-brother-surveillance.html", "http://censorship.news", "https://reclaimthenet.org/uk-government-monitored-politician-journalists-covid-dissent/", "https://naturalnews.com/2021-04-21-apple-approves-parler-after-surrender-speech-police.html", "https://naturalnews.com/2022-10-03-twitter-hires-fbi-agents-big-brother-surveillance.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-02-01-governments-spied-journalists-politicians-critical-covid-policy.html&linkname=Governments%20spied%20on%20high-profile%20journalists%2C%20politicians%20that%20were%20critical%20of%20covid%20policy", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}