{"result_id": "132031", "URL": "https://www.glitch.news/2022-10-06-biotech-analyst-karen-kingston-unveils-patents-covid-vaccine-5g-link-biosynthetic-ai-nanotech.html", "timestamp": "2023-04-25 15:16:42 CEST+0200", "meta": {"description": "Few people have conducted as much research into the mRNA injections — dare not call them “vaccines” — as Karen Kingston, a biotech analyst who previously conducted contract work for Pfizer, J&J, Thermo Fisher and other corporations. In a bombshell interview that features key screen shots of patents, science journal articles and corporate documents, Karen […]", "lang": "en", "keywords": "badmedicine,Censored Science,COVID,depopulation,enslaved,genocide,Glitch,hydrogels,Karen Kingston,mRNA,nanoparticles,obey,pandemic,patents,Plandemic,quantum dots,remote control,technology,transhumanism,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-10-06-biotech-analyst-karen-kingston-unveils-patents-covid-vaccine-5g-link-biosynthetic-ai-nanotech.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Biotech analyst Karen Kingston unveils PATENTS and documents describing the covid vaccine 5G link, biosynthetic AI nanotech, “soft actuators” and NEUROWEAPONS implanted with needles", "cleaned_text": "Biotech analyst Karen Kingston unveils PATENTS and documents describing the covid vaccine 5G link, biosynthetic AI nanotech, “soft actuators” and NEUROWEAPONS implanted with needles\n\nFew people have conducted as much research into the mRNA injections — dare not call them “vaccines” — as Karen Kingston, a biotech analyst who previously conducted contract work for Pfizer, J&J, Thermo Fisher and other corporations. In a bombshell interview that features key screen shots of patents, science journal articles and corporate documents, Karen Kingston lays out the argument for mRNA covid “vaccine” injections actually being exotic technology implantations that can be used to achieve global enslavement and/or genocide.\n\nOur full one-hour interview is posted below. This interview features video screen shots of several key documents.\n\nFar from being a conspiracy theory, remote control of magnetic hydrogels — and “tissue engineering” — is well documented in the scientific literature. Here’s one published paper in ACS Nano that describes this exact thing:\n\nMagnetic Nanocomposite Hydrogels for Tissue Engineering: Design Concepts and Remote Actuation Strategies to Control Cell Fate\n\nMost tissues of the human body are characterized by highly anisotropic physical properties and biological organization. Hydrogels have been proposed as scaffolding materials to construct artificial tissues due to their water-rich composition, biocompatibility, and tunable properties.\n\n…the intrinsic properties of magnetic nanoparticles enable their use as magnetomechanic remote actuators to control the behavior of the cells encapsulated within the hydrogels under the application of external magnetic fields.\n\nSoft actuators for artificial muscles with self-healing and multimodal locomotion properties\n\nFrom the journal Nature Reviews Materials, we have a science paper entitled, “Soft actuators for real-world applications.”\n\nIn this Review, we discuss new materials and structural designs for the engineering of soft actuators with physical intelligence and advanced properties, such as adaptability, multimodal locomotion, self-healing and multi-responsiveness.\n\nFinally, we discuss the challenges and opportunities for next-generation soft actuators, including physical intelligence, adaptability, manufacturing scalability and reproducibility…\n\nEmbedded transmission and receiving devices that network to share information, turning human bodies into “cloud” computing platforms\n\nKingston also reveals how implanted biosynthetic structures have the ability to transmit and receive digitized information, allowing such structures to “network” with each other, even as they reside inside host human bodies. Combined with external AI capabilities that are accelerated by 5G bandwidth speed and low latency, these networking structures can be weaponized against humanity.\n\nOne patent cited in this tech is US11107588B2, which discusses, ” The system comprises a plurality of electronic devices comprising instructions to generate an ID and, when in proximity of another such electronic device, one or both electronic devices transmit/receive the ID to/from the other electronic device.”\n\nThe technology described in this patent specifically talks about SARS, MERS, coronavirus and influenza, or any disease that has “influenza-like symptoms.” See this list from the patent:\n\nAccording to some embodiments of the invention, said virus is a corona virus.\n\n According to some embodiments of the invention, said virus is SARS-CoV.\n\n According to some embodiments of the invention, said virus is MERS-CoV.\n\n According to some embodiments of the invention, said virus is SARS-CoV-2.\n\n According to some embodiments of the invention, said virus is an influenza virus.\n\n According to some embodiments of the invention, said disease results in influenza like symptoms.\n\nThe following diagram shows how electromagnetic signals can be broadcast and received among individuals who have been implanted or outfitted with the digital systems:\n\nThat same patent also talks about embodiments of circuitry, human networking and pathogen spreading, saying things like:\n\n…generating, by circuitry, a predicted likelihood of said subject of transmitting said pathogen based on said physical proximity information, for a plurality of subjects…\n\n…hardware for performing selected tasks according to some embodiments of the invention could be implemented as a chip or a circuit.\n\nA computer readable signal medium may include a propagated data signal with computer readable program code embodied therein, for example, in baseband or as part of a carrier wave.\n\n…some embodiments of the present invention may take the form of an entirely hardware embodiment, an entirely software embodiment (including firmware, resident software, micro-code, etc.) or an embodiment combining software and hardware aspects that may all generally be referred to herein as a “circuit,” “module” or “system.”\n\nGet the full details and documents in this one-hour interview with Karen Kingston:\n\n– Covid-19 injections contain NEUROWEAPONS embedded in Lipid Nanoparticels (LNP)\n\n – Neurological weapons were hidden through Emergency Use Authorization cover-up\n\n – Shocking patents confirm it’s all true (patent numbers shown)\n\n – Transhumanism assault on humanity now under way, people becoming LESS human\n\n – LNPs can be activated via 5G frequencies to achieve physiological changes\n\n – Covid “vaccines” appear to be exotic tech INSTALLED in human hosts\n\n – CCP-linked AI company named “national security threat” in USA\n\n – 5G infrastructure to be exploited by AI embedded systems for surveillance\n\n – Post-vaccine “biostructures” are self-assembling biosynthetic weapons\n\nDiscover more interviews and podcasts each day at:", "opengraph": {"title": "Biotech analyst Karen Kingston unveils PATENTS and documents describing the covid vaccine 5G link, biosynthetic AI nanotech, “soft actuators” and NEUROWEAPONS implanted with needles", "type": "article", "url": "https://www.glitch.news/2022-10-06-biotech-analyst-karen-kingston-unveils-patents-covid-vaccine-5g-link-biosynthetic-ai-nanotech.html", "site_name": "Glitch", "description": "Few people have conducted as much research into the mRNA injections — dare not call them “vaccines” — as Karen Kingston, a biotech analyst who previously conducted contract work for Pfizer, J&J, Thermo Fisher and other corporations. In a bombshell interview that features key screen shots of patents, science journal articles and corporate documents, Karen […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/10/Graphene-Nanotechnology-Lattice-Science-Atomic-Background-Molecule.jpg"}, "tags": ["pandemic", "COVID", "Karen Kingston", "technology", "Censored Science", "remote control", "obey", "enslaved", "nanoparticles", "depopulation", "Glitch", "patents", "quantum dots", "genocide", "vaccines", "transhumanism", "hydrogels", "Plandemic", "mRNA"], "tweets": [], "movies": [], "links": ["https://en.x-mol.com/paper/article/1347338492243496960", "https://www.nature.com/articles/s41578-021-00389-7", "http://Brighteon.com/0baeff43-2a1d-4df9-8e02-454a459ee9ae", "http://Bitchute.com/video/VQ82yqtbkqsv/", "https://Rumble.com/v1mvnzn-biotech-analyst-karen-kingston-unveils-the-covid-vaccine-5g-link-biosynthet.html", "http://Banned.video/watch?id=633f106fd408083dd71e1632", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-10-06-biotech-analyst-karen-kingston-unveils-patents-covid-vaccine-5g-link-biosynthetic-ai-nanotech.html&linkname=Biotech%20analyst%20Karen%20Kingston%20unveils%20PATENTS%20and%20documents%20describing%20the%20covid%20vaccine%205G%20link%2C%20biosynthetic%20AI%20nanotech%2C%20%E2%80%9Csoft%20actuators%E2%80%9D%20and%20NEUROWEAPONS%20implanted%20with%20needles", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}