{"result_id": "132007", "URL": "https://www.glitch.news/2023-02-19-grocery-chains-merging-big-tech-track-food-drugs.html", "timestamp": "2023-04-25 15:16:28 CEST+0200", "meta": {"description": "Grocery giant Albertsons, along with partner companies Safeway, Vons, Shaw’s, Jewel-Osco, Acme, and Tom Thumb, is rolling out a new “Sincerely Health” tech platform app for customers to keep a close eye on their food and drug purchases. The company describes the app as something that allows customers to “connect data from wearables, integrate prescriptions, […]", "lang": "en", "keywords": "albertsons,Big Tech,Dangerous,digital health space,food,Glitch,groceries,health,health freedom,information technology,kroger,Liberty,medical fascism,Medical Tyranny,obey,Orwellian,privacy,privacy watch,Safeway,surveillance,technocrats,tracking", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-02-19-grocery-chains-merging-big-tech-track-food-drugs.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "America’s large grocery chains merging with Big Tech to track, control your food and drug purchases", "cleaned_text": "America’s large grocery chains merging with Big Tech to track, control your food and drug purchases\n\nGrocery giant Albertsons, along with partner companies Safeway, Vons, Shaw’s, Jewel-Osco, Acme, and Tom Thumb, is rolling out a new “Sincerely Health” tech platform app for customers to keep a close eye on their food and drug purchases.\n\nThe company describes the app as something that allows customers to “connect data from wearables, integrate prescriptions, design their diet and make telehealth or vaccination appointments.”\n\nAlbertsons is currently in talks with Kroger, by the way, to perform a merger. Should that be a success, the new Albertson’s-Kroger mega-grocery chain would capture control over 36 percent of the American grocery supermarket business.\n\nCompetitor Walmart, America’s largest grocery chain, is also rolling out a similar program to track customer’s food purchase habits in conjunction with the pharmaceutical purchasing habits.\n\n“Your grocery purchasing habits have been considered very valuable data for decades now, with most major supermarkets offering things like ‘loyalty’ cards that give discounts on grocery products,” writes Brian Shilhavy for Health Impact News.\n\n“But now, Big Food wants to merge that with your Big Pharma purchases as well, which would include prescription drug purchases as well as vaccines.”\n\nPixel tracking technology allows Albertsons to invade users’ privacy – but they can choose to opt out of it\n\nAccording to Fierce Healthcare, the Albertsons Sincerely Health platform starts by asking users to fill out a questionnaire about the “seven dimensions of wellbeing.” These include activity, mental wellbeing, mindfulness, nutrition, physical health, self-control, and sleep.\n\n“Responses are assessed along with the user’s age, gender, lifestyle choices and mental health,” the report states.\n\n“Users can then set goals such as engaging in meditation five times a week, sleeping at least seven hours a night and taking 10 thousand steps daily.”\n\nThe Sincerely Health platform also connects users to the Albertsons pharmacy division for managing prescriptions, scheduling vaccine appointments, and making telehealth appointments through a partnership with Providence Express Care.\n\n“Users can opt in to receive reminders to take daily medications or refill prescriptions,” the report says.\n\nMore controversial is the “Pixel” tracking technology used in the app. Pixel, which is used to track users’ interests and provide “relevant content,” has been the subject of numerous lawsuits in recent years concerning its invasion of patient privacy.\n\nAlbertsons claims it does not sell any of this customer data to third parties, pointing to the Health Insurance Portability and Accountability Act (HIPAA) – but is this still true in the post-covid era?\n\n“All it takes is a declaration of a ‘public health emergency’ and pretty much the entire Constitution of the U.S. is suspended all in the name of ‘public health,'” Shilhavy notes about how HIPAA could already be a thing of the past.\n\n“Your private health decisions are then broadcast to the public to be used against you, such as whether or not you choose to wear a facemask, or show your proof of vaccination, in order to enter their stores.”\n\nIt does not take a rocket scientist to ascertain how easily Big Food can now exploit customer data to push more medical fascism. When the next scamdemic arrives, Albertsons will be in a unique spot with its Sincerely Health app to punish customers who refuse to obey the state’s orders.\n\n“These apps that combine your drug, vaccine, food, and doctor appointment purchases could easily be used in the future to prevent you from accessing these purchases if you do not comply with their requirements, such as being up-to-date on your vaccines,” Shilhavy says.\n\n“Those who receive government aid, such as food stamps, Section 8 housing, Medicare / Medicaid, etc., could all be tied into the information you provide on these apps.”\n\nMore related news coverage can be found at Globalism.news.", "opengraph": {"title": "America’s large grocery chains merging with Big Tech to track, control your food and drug purchases", "type": "article", "url": "https://www.glitch.news/2023-02-19-grocery-chains-merging-big-tech-track-food-drugs.html", "site_name": "Glitch", "description": "Grocery giant Albertsons, along with partner companies Safeway, Vons, Shaw’s, Jewel-Osco, Acme, and Tom Thumb, is rolling out a new “Sincerely Health” tech platform app for customers to keep a close eye on their food and drug purchases. The company describes the app as something that allows customers to “connect data from wearables, integrate prescriptions, […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/02/Market-Fruits-Grocery.jpg"}, "tags": ["Liberty", "kroger", "tracking", "privacy watch", "Safeway", "health", "technocrats", "groceries", "obey", "Big Tech", "privacy", "information technology", "Dangerous", "Medical Tyranny", "surveillance", "food", "Glitch", "medical fascism", "Orwellian", "albertsons", "digital health space", "health freedom"], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2023/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/", "https://naturalnews.com/2021-01-20-coronavirus-plandemic-merger-big-tech-big-pharma.html", "http://globalism.news", "https://healthimpactnews.com/2023/no-vaccine-no-food-grocery-industry-merging-with-big-tech-and-big-pharma-as-new-app-tracks-drug-and-vaccine-purchases-along-with-food/", "https://naturalnews.com/2021-01-20-coronavirus-plandemic-merger-big-tech-big-pharma.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-02-19-grocery-chains-merging-big-tech-track-food-drugs.html&linkname=America%E2%80%99s%20large%20grocery%20chains%20merging%20with%20Big%20Tech%20to%20track%2C%20control%20your%20food%20and%20drug%20purchases", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}