{"result_id": "132008", "URL": "https://glitch.news/2021-07-19-big-tech-censoring-facts-covid-vaccine-dangers.html", "timestamp": "2023-04-25 15:16:28 CEST+0200", "meta": {"description": "During a recent episode of “The Sharyl Attkisson Podcast,” investigative reporter Sharyl Attkisson talked about how Big Tech – meaning platforms like Facebook and Twitter – are “censoring factual and truthful information while propagating false information” about the dangers and ineffectiveness of Wuhan coronavirus (Covid-19) “vaccines.” It has become extremely difficult, if not impossible, to […]", "lang": "en", "keywords": "adverse events,badhealth,badmedicine,badscience,banned,Big Tech,Censored,Censorship,coronavirus,COVID,Facebook,Plandemic,Sharyl Attkisson,side effects,Social media,Suppressed,Twitter,vaccination,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2021-07-19-big-tech-censoring-facts-covid-vaccine-dangers.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "Big Tech censoring key facts about covid vaccine dangers, warns Sharyl Attkisson", "cleaned_text": "During a recent episode of “The Sharyl Attkisson Podcast,” investigative reporter Sharyl Attkisson talked about how Big Tech – meaning platforms like Facebook and Twitter – are “censoring factual and truthful information while propagating false information” about the dangers and ineffectiveness of Wuhan coronavirus (Covid-19) “vaccines.”\n\nIt has become extremely difficult, if not impossible, to find any truthful information about Chinese Virus injections online that has not already been “curated” to push a pro-jab narrative. Because of this, many are falling for the fake news that is being “falsely portrayed by propagandists and pharmaceutical interests,” Attkisson warns.\n\nAttkisson has been in the business of truth-telling about vaccines for many years now. She has repeatedly covered the pseudoscience of vaccination, the poisons the shots contain, and the deceptive marketing campaigns that are used by Big Pharma to push them on the masses.\n\nIn the case of the Chinese Virus injection, none of the shots currently being peddled have gone through the normal safety testing channels. All of them have what is known as “emergency use authorization” (EUA), which means there is no science to back them, but the government has decided that they are the only possibly helpful remedy available.\n\nThis is, of course, false. There are many remedies, in fact, that help to mitigate a “positive” test result for the Fauci Flu, and yet the government refuses to acknowledge any of them.\n\n“That’s why we’re learning things in real time as we go,” Attkisson says about the injections, noting that many more scientists are calling for an immediate halt on jab distribution unless and until legitimate science comes out to support their continued use.\n\nThe full podcast episode with Sharyl Attkisson is available for listening at this link.\n\nPaper: 57 scientists from 17 countries say covid vaccines are dangerous\n\nAttkisson further cited a paper authored by 57 scientists from 17 countries calling out Chinese Virus injections as dangerous. This study, published in the journal Authorea, demands answers from international health agencies, the government, regulatory authorities and vaccine manufacturers.\n\n“Despite progress on early multidrug therapy for COVID-19 patients, the current mandate is to immunize the world population as quickly as possible,” the paper explains. “The lack of thorough testing in animals prior to clinical trials, and authorization based on safety data generated during trials that lasted less than 3.5 months, raise questions regarding vaccine safety.”\n\n“Given the high rate of occurrence of adverse effects that have been reported to date, as well as the potential for vaccine-driven disease enhancement, Th2-immunopathology, autoimmunity and immune evasion, there is a need for a better understanding of the benefits and risks of mass vaccination, particularly in groups excluded from clinical trials.”\n\nAt this point, anyone still willing to get an injection who has not already gotten one is living in denial. It is incredibly ignorant to continue just trusting the government and taking its word on the matter when actual scientists and medical researchers are warning that getting jabbed is likely to cause problems – if not immediately then later on down the road.\n\n“Nefarious doesn’t begin to explain this,” wrote one commenter over at The Defender, claiming to be a nurse. “I don’t know one person who was vaccinated who did not have an issue from bed in a week to blood clots to autoimmune issues!”\n\nAnother responded that people she knows who got the jab and developed serious side effects are bragging about it like a badge of honor, “as if they can’t hear themselves and how stupid they sound.”\n\nMore of the latest news about the dangers and ineffectiveness of Chinese Virus injections can be found at ChemicalViolence.com.", "opengraph": {"title": "Big Tech censoring key facts about covid vaccine dangers, warns Sharyl Attkisson", "type": "article", "url": "https://www.glitch.news/2021-07-19-big-tech-censoring-facts-covid-vaccine-dangers.html", "site_name": "Glitch", "description": "During a recent episode of “The Sharyl Attkisson Podcast,” investigative reporter Sharyl Attkisson talked about how Big Tech – meaning platforms like Facebook and Twitter – are “censoring factual and truthful information while propagating false information” about the dangers and ineffectiveness of Wuhan coronavirus (Covid-19) “vaccines.” It has become extremely difficult, if not impossible, to […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2021/07/Censored-Facebook-Social-Media.jpg"}, "tags": ["Sharyl Attkisson", "Censored", "Vaccine deaths", "banned", "COVID", "Censorship", "Suppressed", "Twitter", "vaccine injury", "adverse events", "vaccines", "Social media", "coronavirus", "Facebook", "side effects", "Plandemic", "Big Tech", "vaccination"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/sharyl-attkisson-big-tech-censoring-facts-covid-vaccine-safety/", "https://www.naturalnews.com/048719_vaccines_sharyl_attkisson_propaganda.html", "https://www.naturalnews.com/2020-08-14-green-tea-zinc-and-hydroxychloroquine-coronavirus-cure.html", "https://childrenshealthdefense.org/defender/sharyl-attkisson-big-tech-censoring-facts-covid-vaccine-safety/", "http://chemicalviolence.com", "https://childrenshealthdefense.org/defender/sharyl-attkisson-big-tech-censoring-facts-covid-vaccine-safety/", "https://www.naturalnews.com/048719_vaccines_sharyl_attkisson_propaganda.html", "https://www.naturalnews.com/2020-08-14-green-tea-zinc-and-hydroxychloroquine-coronavirus-cure.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2021-07-19-big-tech-censoring-facts-covid-vaccine-dangers.html&linkname=Big%20Tech%20censoring%20key%20facts%20about%20covid%20vaccine%20dangers%2C%20warns%20Sharyl%20Attkisson", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}