{"result_id": "132013", "URL": "https://www.glitch.news/2023-01-19-big-pharma-lobbied-social-media-control-vaccine-content.html", "timestamp": "2023-04-25 15:16:32 CEST+0200", "meta": {"description": "Journalist Lee Fang has unpacked the latest Twitter Files drop, which shows that the pharmaceutical industry aggressively lobbied social media platforms like Twitter to shape allowable content around pro-vaccine policy. Pfizer and BioNTech, for instance, pressured Twitter to “censor activists demanding low-cost generic vaccines for low-income countries,” Fang revealed in a multi-part series of tweets […]", "lang": "en", "keywords": "badmedicine,badscience,Big Pharma,Big Tech,Censorship,conspiracy,corruption,Fact Check,fascism,First Amendment,free speech,Glitch,lies,lobbyists,pharmaceutical fraud,propaganda,rigged,Social media,Suppressed,tech giants,Twitter,Twitter Files,Tyranny,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-01-19-big-pharma-lobbied-social-media-control-vaccine-content.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "TWITTER FILES: Big Pharma lobbied social media companies to control all vaccine-related content", "cleaned_text": "Journalist Lee Fang has unpacked the latest Twitter Files drop, which shows that the pharmaceutical industry aggressively lobbied social media platforms like Twitter to shape allowable content around pro-vaccine policy.\n\nPfizer and BioNTech, for instance, pressured Twitter to “censor activists demanding low-cost generic vaccines for low-income countries,” Fang revealed in a multi-part series of tweets blowing the lid on Big Pharma censorship on social media.\n\nEarly on in the scamdemic, some were trying to create a more equitable solution to the crisis by forging international partnerships, sharing therapeutic technologies, and creating an open-source environment for information. The pharmaceutical industry quickly squelched that effort.\n\nThe crisis, Fang explained, was exploited by Big Pharma for profit. He explains that “[b]ehind closed doors, pharma launched a massive lobbying blitz to crush any effort to share patents / IP for new covid-related medicine, including therapeutics and vaccines.”\n\n“BIO, the lobby group that represents biopharma, including Moderna & Pfizer, wrote to the newly elected Biden admin, demanding the U.S. gov sanction any country attempting to violate patent rights and create generic low cost covid medicine or vaccines,” he added.\n\nAs for Twitter, the social media giant was directly pressured by pharmaceutical companies to censor all tweets mentioning generic, low-cost vaccines. The agenda was to make only high-priced, monopolized vaccines available to the public, ensuring large profits for the drug giants.\n\nAt the industry’s beckoning, a Twitter representative reportedly responded to the request, which was also backed by the German company, by creating content moderation teams to overlook the accounts of Pfizer, AstraZeneca, and various hashtags such as “#peoplesvaccine.”\n\nTwitter appears to have been instructed to flag all criticism of the covid jab monopoly as “fake accounts,” even though these were very real people trying to make low-cost, generic vaccines widely available to the world.\n\nAccounts protesting Pfizer or AstraZeneca were also flagged as “fake accounts” and subsequently censored, including that of “Terry,” a 74-year-old retired bricklayer from the United Kingdom who called on Pfizer and the others to put people over profits.\n\nWhile numerous Twitter employees stated that Terry and others who tweeted such messages were not in violation of the company’s tweeting standards, Twitter as a whole continued to monitor these terms and hashtags.\n\nA “separate push,” Fang explains, was launched by the Pfizer and Moderna lobbying group BIO to create a special content moderation campaign called Public Good Projects. That group worked directly with Twitter to “set content moderation rules around covid ‘misinformation,'” we are told.\n\n“BIO provided $1,275,000 to the campaign, part of which is revealed through tax forms. The PGP campaign, called ‘Stronger,’ helped Twitter create content moderation bots, select which public health accounts got verification, helped crowdsource content takedowns,” Fang revealed.\n\n“Many of the tweets the BIO-funded campaign focused on were truly unhinged misinfo, like claims that vaccines include microchips. But others Stronger lobbied Twitter on were more of a grey area, like vaccine passports & vaccine mandates, policies that coerce vaccination.”\n\nPublic Good Projects regularly communicated with Twitter via email to remove tweets and verify others. One popular media outlet, Zero Hedge, ended up being suspended from the platform entirely.\n\nDrug companies, meanwhile, were never subjected to any kind of censorship. Even when their accounts mentioned Pfizer or Moderna or covid vaccines, these were overlooked because the Public Good Projects and Stronger focused only on censoring criticism of Big Pharma’s covid jab agenda.\n\n“When big pharma wildly exaggerated the risks of creating low-cost generic covid vaccines, Stronger did nothing,” Fang wrote. “The rules applied only to critics of industry.”\n\nThe latest news about the Twitter Files can be found at Censorship.news.", "opengraph": {"title": "TWITTER FILES: Big Pharma lobbied social media companies to control all vaccine-related content", "type": "article", "url": "https://www.glitch.news/2023-01-19-big-pharma-lobbied-social-media-control-vaccine-content.html", "site_name": "Glitch", "description": "Journalist Lee Fang has unpacked the latest Twitter Files drop, which shows that the pharmaceutical industry aggressively lobbied social media platforms like Twitter to shape allowable content around pro-vaccine policy. Pfizer and BioNTech, for instance, pressured Twitter to “censor activists demanding low-cost generic vaccines for low-income countries,” Fang revealed in a multi-part series of tweets […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/01/Censored-Twitter-Jack-Dorsey-Quiet-Hoodie.jpg"}, "tags": ["conspiracy", "Big Pharma", "lobbyists", "lies", "corruption", "Twitter", "Fact Check", "First Amendment", "Twitter Files", "propaganda", "Big Tech", "vaccine wars", "tech giants", "Suppressed", "Social media", "Glitch", "Tyranny", "fascism", "rigged", "Censorship", "vaccines", "free speech", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2023/01/just-another-twitter-files-drop-pharmaceutical-industry-lobbied-social-media-shape-content-around-vaccine-policy/", "https://www.naturalnews.com/2023-01-17-fusion-gps-hillary-clinton-twitter-climate-misinformation.html", "http://bigtech.news", "http://censorship.news", "https://www.thegatewaypundit.com/2023/01/just-another-twitter-files-drop-pharmaceutical-industry-lobbied-social-media-shape-content-around-vaccine-policy/", "https://www.naturalnews.com/2023-01-17-fusion-gps-hillary-clinton-twitter-climate-misinformation.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-01-19-big-pharma-lobbied-social-media-control-vaccine-content.html&linkname=TWITTER%20FILES%3A%20Big%20Pharma%20lobbied%20social%20media%20companies%20to%20control%20all%20vaccine-related%20content", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}