{"result_id": "132039", "URL": "https://www.glitch.news/2022-08-11-covid-vaccine-injuries-support-group-faces-censorship.html", "timestamp": "2023-04-25 15:16:47 CEST+0200", "meta": {"description": "The Vaccine Injury/Side Effects Support Group was created to support not only individuals who have been injured by the Wuhan coronavirus (COVID-19) vaccine, but also the family members, friends and everyone going through the nightmare. However, the group’s posts are now being censored by Facebook. “We will be moving our group over to a new uncensored […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,Censorship,Dangerous Medicine,Facebook,fascism,freedom,health freedom,Moderna,pandemic,Pfizer,pharmaceutical fraud,Social media,speech police,thought police,truth,Tyranny,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2022-08-11-covid-vaccine-injuries-support-group-faces-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "COVID-19 vaccine injury support group faces online censorship", "cleaned_text": "The Vaccine Injury/Side Effects Support Group was created to support not only individuals who have been injured by the Wuhan coronavirus (COVID-19) vaccine, but also the family members, friends and everyone going through the nightmare.\n\nHowever, the group’s posts are now being censored by Facebook.\n\n“We will be moving our group over to a new uncensored TrialSite News soon due to the growing censorship we are facing,” said Catherine Parker, the group’s founder. She stressed the need for support groups like these to not be taken down from social media sites. (Related: Global campaign aims to break silence around COVID vaccine injuries.)\n\nParker, who was injured by Johnson & Johnson’s COVID-19 vaccine, added: “A lot of us have anxiety and depression from this now. And I hear people who just want to give up or they feel like they are dying or that [they] wanted not to wake up.”\n\nShe said she was never an anti-vaxxer. As a requirement for her job, she took the Johnson & Johnson vaccine on April 1, 2021 and the Pfizer booster on November 9, 2021.\n\nWithin two to three weeks of receiving the first shot, she began having chronic insomnia and exhaustion. But she ignored these and proceeded to have the Pfizer booster. Less than two weeks after getting the booster, she began losing hair and was diagnosed with dysautonomia, pseudoparkinsonism and Epstein Barr virus, also known as human herpesvirus 4.\n\nParker, 49, wanted to help others enduring similar experiences and founded the support group. Within two weeks, over 200 members from all over the world joined to “tell their heartbreaking stories and also inspire resiliency to keep going through the health conditions.”\n\n“It has been difficult to get out our stories to the world,” Parker said. “Everywhere we turn, we are blocked and banned on social media. Our videos are removed for ‘community standards violations,’ which makes no sense when they are videos of our pain and suffering or us going through tremors and brain fog.”\n\nShe added that groups like hers are ridiculed and made fun of as crazy, lying pigs, “anti-vax” and people with agendas to stop others from getting the vaccine.\n\n“It breaks my heart, how far humanity has fallen that it is okay to make fun of others’ suffering and downplay what others are going through,” she said.\n\nDonna Zuk Adley, 64, is a 33-year nurse from Connecticut and holds degrees in criminal justice and legal studies. She is the co-administrator of the vaccine injury support group.\n\nIn an exclusive interview with the news website Defender, she said that she was reluctant to get the coronavirus vaccine from the get-go because she had “two previous reactions to vaccines, one of which [tetanus] left her with a permanent partial disability.” She was diagnosed with fibromyalgia after a tetanus shot.\n\n“I had restricted my lifestyle, and did all the protocols to avoid COVID,” she stated. “I had been working on a COVID floor with up to 32 COVID patients, and never got COVID.”\n\nHowever, in August 2021, Connecticut Governor Ned Lamont mandated all workers in a broadly defined list of medical and long-term care facilities to get vaccinated. Adley got her first dose of the mRNA vaccine in August and her second dose in September 2021.\n\n“After the first Moderna [dose], I had severe lower back pain that felt like shattered glass. I did not realize at the time that many have this symptom after the vaccines. [On] September 17, eight hours after my second dose, I began to get the initial symptoms that I had expected (fever, muscle aches), [but] I felt very strange and weak as if I had a mono relapse, which I hadn’t had in over a decade.” she said, adding that her symptoms worsened after that.\n\nShe began to have lapses in memory and blurred vision. She also began to feel confused and felt like she has a “brain disconnect” as she lost the ability to think right, comprehend and follow directions.\n\nAdley likened the experience to feeling like “a voodoo doll where someone keeps taking turns stabbing me in my different body systems,” and a “pinball machine in slow motion.”\n\nShe kept a notebook of her symptoms and injuries and categorized them broadly as brain and cognitive, gastrointestinal, lungs (respiratory), muscular and skin.\n\nThese symptoms “affected everything,” she said. She was terminated from her job of 10 years because she “took too long” to return from the leave due to her vaccine injuries.\n\nFinding a new job has also been a challenge as she often received feedback that her medical [vaccine] exemption was denied by “corporate.” The loss of her employment also meant the loss of her health insurance and she added that “walk-ins were not accepting me.”\n\nVisit VaccineInjuryNews.com for more news related to the COVID-19 vaccine adverse events.\n\nWatch the below video that talks about the overwhelming evidence of vaccine injuries.\n\nThis video is from the New American channel on Brighteon.com.\n\nCanadian hospice group pushes to normalize euthanasia of children who are “suffering” – many due to vaccine injuries.\n\nWall of silence: Did Brown University bury COVID vaccine injuries to continue their injection mandate.\n\nMedia absurdly insists COVID shots are “safe and effective” as vaccine injuries and deaths mount.", "opengraph": {"title": "COVID-19 vaccine injury support group faces online censorship", "type": "article", "url": "https://www.glitch.news/2022-08-11-covid-vaccine-injuries-support-group-faces-censorship.html", "site_name": "Glitch", "description": "The Vaccine Injury/Side Effects Support Group was created to support not only individuals who have been injured by the Wuhan coronavirus (COVID-19) vaccine, but also the family members, friends and everyone going through the nightmare. However, the group’s posts are now being censored by Facebook. “We will be moving our group over to a new uncensored […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/08/Facebook-Censorship.jpg"}, "tags": ["pandemic", "Big Pharma", "speech police", "Pfizer", "truth", "vaccine wars", "Social media", "thought police", "pharmaceutical fraud", "Facebook", "Tyranny", "fascism", "Moderna", "Censorship", "vaccine injury", "vaccines", "freedom", "health freedom", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/people-injured-covid-vaccines-stories/", "https://www.trialsitenews.com/groups/4/covid-vaccine-injury-support-group?fbclid=IwAR2vbj1NZfNug0fAAeeI-Kd0ObcLiDHaoYmYPP1093D39wedXUnk2g-8nGU", "https://naturalnews.com/2022-07-25-breaking-silence-around-covid-vaccine-injuries.html", "http://censorship.news", "https://dangerousmedicine.com/", "https://vaccineinjurynews.com/", "https://www.brighteon.com/24fe79db-ad9b-460e-9647-b30d69661749", "https://www.brighteon.com/channels/thenewamerican", "https://naturalnews.com/2022-08-05-aussie-airlines-suppressing-vaccine-injuries-persecuting-unvaxxed.html", "https://euthanasia.news/2022-08-05-canada-normalize-euthanasia-children-suffering-vaccine-injuries.html", "https://vaccines.news/2022-07-31-did-brown-university-bury-covid-vaccine-injuries.html", "https://propaganda.news/2022-06-15-media-insists-covid-shots-safe-and-effective.html", "https://childrenshealthdefense.org/defender/people-injured-covid-vaccines-stories/", "https://www.trialsitenews.com/groups/4/covid-vaccine-injury-support-group?fbclid=IwAR2vbj1NZfNug0fAAeeI-Kd0ObcLiDHaoYmYPP1093D39wedXUnk2g-8nGU", "https://www.brighteon.com/24fe79db-ad9b-460e-9647-b30d69661749", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-08-11-covid-vaccine-injuries-support-group-faces-censorship.html&linkname=COVID-19%20vaccine%20injury%20support%20group%20faces%20online%20censorship", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}