{"result_id": "132018", "URL": "https://www.glitch.news/2023-03-30-texas-bills-mandate-age-verification-adult-websites.html", "timestamp": "2023-04-25 15:16:35 CEST+0200", "meta": {"description": "Bills have been introduced in the Texas Senate and House of Representatives to make online publishers enforce an age verification system on their platforms. Senate Bill 2164 and House Bill 3585, introduced by Republicans Sen. Bryan Hughes and Rep. Terri Leo-Wilson, seek to amend the state’s Business and Commerce Code with what their bills refer […]", "lang": "en", "keywords": "adult content,age verification,big government,Big Tech,computing,cyber war,digital verification,Glitch,information technology,internet,legislation,Louisiana,online verification,sexual materials,Social media,tech giants,technocrats,Texas,Utah,websites", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.glitch.news/2023-03-30-texas-bills-mandate-age-verification-adult-websites.html", "encoding": "UTF-8"}, "image": null, "domain": "www.glitch.news", "title": "Texas bills to mandate age verification for visitors of adult websites", "cleaned_text": "Texas bills to mandate age verification for visitors of adult websites\n\nBills have been introduced in the Texas Senate and House of Representatives to make online publishers enforce an age verification system on their platforms.\n\nSenate Bill 2164 and House Bill 3585, introduced by Republicans Sen. Bryan Hughes and Rep. Terri Leo-Wilson, seek to amend the state’s Business and Commerce Code with what their bills refer to as “reasonable” age verification methods. The goal would be to regulate adult content online. (Related: Recently passed New York state bills could pave way for future legislation mandating adult enrollment in state vaccination database.)\n\nIn the proposed bills, lawmakers state that they want to make digital identification available to sites and social media platforms that are “more than one-third” sexual in nature. The digital identification is defined by lawmakers as information stored on a digital network as proof of a user’s identity, such as a picture of a government ID. This is to verify that visitors to their sites are 18 years old or over.\n\nThe bill also states that once the age verification process has been completed, either by the site or social media platform itself or by a third party, neither the third party nor the site or platform are supposed to retain the personal information gathered in this way.\n\nAlternatively, site visitors can also provide “a commercially reasonable method that relies on public or private transnational data to verify the age of an individual.”\n\nThe websites of “bona fide” news organizations are exempt from the age verification requirement.\n\n“The porn industry has preyed on the most vulnerable, our children,” noted State Rep. Nate Schatzline, who proposed a bill similar to HB 3585 in the state house just a week prior. “Requiring age verification for explicit content should be a no-brainer. Texas has no place for people who intend to harm kids.”\n\nCall for age verification systems growing in the US\n\nTexas is not the only state to pass legislation requiring age verification online to prevent children from gaining access to adult content on the internet.\n\nLouisiana, which passed similar legislation last year, requires age verification using government-issued IDs or public or private transnational data. State residents looking to access websites that are at least one-third sexual in nature are directed to confirm their identity through a state-run app called LA Wallet that digitizes their driver’s license.\n\nJust days ago, Utah Gov. Spencer Cox signed social media regulation laws that require minors to get parental consent to remain on social media platforms.\n\nThe laws require that social media companies set up systems to verify the age of any Utah resident who makes a social media profile and get parental consent from any minor who wishes to make a profile. The laws also require social media companies to allow parents to access the posts and messages of the accounts of their children should they request it.\n\nFurthermore, social media companies are prohibited from displaying ads to minors, showing the accounts of minors in search results, collecting information about minors, targeting or suggesting content to minors or knowingly integrating any “addictive technologies” into social media apps regularly used by minors.\n\nSimilar bills are making their way through the state legislatures of Mississippi and Virginia. A similar bill has also been submitted to the United States Senate.\n\nVisit Computing.news for more stories like this.\n\nWatch this clip from the “War Room” as Steve Bannon and Mike Davis discuss how Big Tech platforms aid and abet terrorism.\n\nThis video is from the News Clips channel on Brighteon.com.\n\nRon DeSantis to introduce legislation in Florida prohibiting the use of CBDCs in the state.\n\nTwitter Files: US government helped launch project where millions of online posts were flagged for censorship.\n\nSen. Mark Kelly calls for social media CENSORSHIP of economic chatter to prevent bank runs.\n\nBig Tech companies swarming with ex-FBI, CIA agents as social media becomes part of “national security state.”", "opengraph": {"title": "Texas bills to mandate age verification for visitors of adult websites", "type": "article", "url": "https://www.glitch.news/2023-03-30-texas-bills-mandate-age-verification-adult-websites.html", "site_name": "Glitch", "description": "Bills have been introduced in the Texas Senate and House of Representatives to make online publishers enforce an age verification system on their platforms. Senate Bill 2164 and House Bill 3585, introduced by Republicans Sen. Bryan Hughes and Rep. Terri Leo-Wilson, seek to amend the state’s Business and Commerce Code with what their bills refer […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/03/Censorship-Censored-Cyber-Internet-Digital-Online-Web.jpg"}, "tags": ["big government", "online verification", "Utah", "Louisiana", "technocrats", "sexual materials", "Texas", "age verification", "internet", "Big Tech", "cyber war", "tech giants", "information technology", "computing", "websites", "Social media", "digital verification", "adult content", "legislation", "Glitch"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/texas-bills-online-age-verification-checks", "https://www.naturalnews.com/2023-03-28-ny-bills-paving-way-adult-enrollment-vaccine-database.html", "https://thetexan.news/texas-lawmaker-proposes-bill-to-require-age-verification-for-sexual-material-online/", "https://www.nbcnews.com/tech/social-media/social-media-law-utah-parent-consent-age-verification-curfew-rcna76178", "http://techgiants.news", "https://gcn.com/emerging-tech/2023/03/states-want-see-some-digital-id-you-visit-porn-site/384381/", "http://Computing.news", "https://www.brighteon.com/fc1c05a2-645e-439f-8ca5-963bf04158ba", "https://www.brighteon.com/channels/newsclipsnow", "https://www.brighteon.com/channels/newsclipsnow", "https://www.naturalnews.com/2023-03-27-ron-desantis-legislation-florida-prohibiting-cbdc.html", "https://suppressed.news/2023-03-21-us-government-helped-online-posts-censorship.html", "https://glitch.news/2023-03-20-senator-kelly-urged-censorship-prevent-bank-runs.html", "https://informationtechnology.news/2023-03-17-sophisticated-chinese-cyberattacks-target-american-corporations.html", "https://banned.news/2023-02-28-big-tech-companies-become-part-of-national-security-state.html", "https://reclaimthenet.org/texas-bills-online-age-verification-checks", "https://thetexan.news/texas-lawmaker-proposes-bill-to-require-age-verification-for-sexual-material-online/", "https://www.nbcnews.com/tech/social-media/social-media-law-utah-parent-consent-age-verification-curfew-rcna76178", "https://gcn.com/emerging-tech/2023/03/states-want-see-some-digital-id-you-visit-porn-site/384381/", "https://www.brighteon.com/fc1c05a2-645e-439f-8ca5-963bf04158ba", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-03-30-texas-bills-mandate-age-verification-adult-websites.html&linkname=Texas%20bills%20to%20mandate%20age%20verification%20for%20visitors%20of%20adult%20websites", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}