{"result_id": "132037", "URL": "https://glitch.news/2022-05-03-macron-launches-covid-jab-digital-id-program.html", "timestamp": "2023-04-25 15:16:46 CEST+0200", "meta": {"description": "The French are about to feel the heavy boot of Emmanuel Macron’s second term as the dictator readies to mandate a fourth dose of Wuhan coronavirus (COVID-19) “vaccination” on the country. Macron wasted no time after his alleged reelection unveiling a “digital identity assurance” app for French people’s phones that will verify their injection status […]", "lang": "en", "keywords": "Alicem,badhealth,badmedicine,big government,conspiracy,corruption,COVID,digital ID,Emmanuel Macron,enslaved,EU,France,health freedom,Le Pen,medical fascism,Medical Tyranny,obey,Plandemic,SGIN,vaccine wars,vaccines,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2022-05-03-macron-launches-covid-jab-digital-id-program.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "Macron launches COVID jab digital ID program in France immediately after being reelected", "cleaned_text": "Macron launches COVID jab digital ID program in France immediately after being reelected\n\nThe French are about to feel the heavy boot of Emmanuel Macron’s second term as the dictator readies to mandate a fourth dose of Wuhan coronavirus (COVID-19) “vaccination” on the country.\n\nMacron wasted no time after his alleged reelection unveiling a “digital identity assurance” app for French people’s phones that will verify their injection status for participation in French society.\n\nThe European Union at large is planning to adopt the very same app, which is being touted as a way for Europeans to enjoy the “greater flexibility ideal for post-pandemic life.”\n\nJust two days after being installed in office for a second time, Macron launched a new law that is compliant with the demands of Brussels. The “Digital Identity Guarantee Service,” or SGIN, will require French citizens to maintain a digital identity card in compliance with the EU Commission’s “European Digital Identity” program.\n\nIn response to all this, Les Patriotes leader Florian Philippot is urging French voters to fight in any way they can against Macron’s legislation, which threatens to enslave the entire country under total medical fascism (Related: Macron wants all unvaccinated people, except for “migrants,” to be banned from French society).\n\n“Just after the election, the government announces the launch of ‘a digital identity application!'” Philippot tweeted. “The goal: to put social credit in the Chinese way. control and surveillance company! Let’s totally reject this application and fight by any means!”\n\nPart of the SGIN paradigm for all of the EU will require a connection to social media platforms such as Facebook and Twitter. Users’ vaccination status will be tied to their online status, and the government will have full access to this information.\n\nAfter learning about the plan, the French reportedly pelted Macron with tomatoes to express their disapproval. On Twitter, many decried Macron’s initiative as representing “one more step towards absolute control of citizens.”\n\n“It’s all starting to get very dystopian,” someone wrote on Twitter. “The SGIN to connect to Twitter, Facebook or any other social exchange platforms. What is optional and trivial at the beginning will be essential and cumbersome in the long term. Resist!”\n\nAnother warned that it starts in France “for the moment,” but will soon be “the same everywhere.”\n\nJust like what occurred in the United States in 2020 (and likely in many previous elections as well), fraud was apparently rampant in Macron’s “reelection.”\n\nAccording to reports, the French government created an “advanced” polling system in which ballots were somehow taken a week before using election voting machines. Philippot openly criticized this decision, warning that it would increase voter fraud.\n\nOn election night, France 2 showed a dramatic decrease in votes counted for Marine Le Pen. At 9:10 p.m., she had 13,899,494 votes. At 10:45 p.m., however, the count somehow dropped to 11,558,051.\n\nIn other words, Macron is probably not France’s legitimate president, and Le Pen more than likely won without fraud – just like Donald Trump more than likely won reelection in 2020, despite the installment of fake “president” Joe Biden and his rotten regime.\n\nEven so, Macron is moving full-steam ahead with plans to force his digital ID program in France after a failed attempt to do the same back in 2019. Dubbed Alicem, the proposed system at that time was deemed too controversial and was ultimately scrapped.\n\nIt has now been resurrected, however, in a simpler format that is more digitized. Biometric ID cards can now be incorporated into a “state-of-the-art” smartphone app and phone that contains a special Near-Field Communication (NFC) microchip.\n\nThe latest news about how the plandemic is apparently here to stay can be found at Pandemic.news.", "opengraph": {"title": "Macron launches COVID jab digital ID program in France immediately after being reelected", "type": "article", "url": "https://www.glitch.news/2022-05-03-macron-launches-covid-jab-digital-id-program.html", "site_name": "Glitch", "description": "The French are about to feel the heavy boot of Emmanuel Macron’s second term as the dictator readies to mandate a fourth dose of Wuhan coronavirus (COVID-19) “vaccination” on the country. Macron wasted no time after his alleged reelection unveiling a “digital identity assurance” app for French people’s phones that will verify their injection status […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2022/05/trump-macron.jpg"}, "tags": ["conspiracy", "big government", "vote fraud", "digital ID", "COVID", "SGIN", "corruption", "Alicem", "Le Pen", "EU", "obey", "vaccine wars", "enslaved", "Medical Tyranny", "medical fascism", "France", "Emmanuel Macron", "vaccines", "health freedom", "Plandemic"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/05/01/within-days-macron-france-rolls-out-digital-id/", "https://naturalnews.com/2022-01-09-macron-unvaccinated-french-citizens-no-longer-welcome.html", "http://votefraud.news", "http://pandemic.news", "https://dailyexpose.uk/2022/05/01/within-days-macron-france-rolls-out-digital-id/", "https://naturalnews.com/2022-01-09-macron-unvaccinated-french-citizens-no-longer-welcome.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2022-05-03-macron-launches-covid-jab-digital-id-program.html&linkname=Macron%20launches%20COVID%20jab%20digital%20ID%20program%20in%20France%20immediately%20after%20being%20reelected", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}