{"result_id": "132023", "URL": "https://glitch.news/2019-03-07-facebook-bans-vaccine-dogma-ban-articles-about-chemotherapy-fluoride.html", "timestamp": "2023-04-25 15:16:38 CEST+0200", "meta": {"description": "In accordance with the company’s ongoing efforts to censor all truth while promoting only establishment fake news on its platform, social media giant Facebook has decided to launch full-scale war against online free speech about vaccines. Pandering to the demands by California Democrat Adam Schiff, Mark Zuckerberg and his team recently announced that they are […]", "lang": "en", "keywords": "Adam Schiff,banned,CDC,Censorship,Centers for Disease Control and Prevention,Chemotherapy,content,evil,Facebook,First Amendment,Fluoride,Glitch,government,knowledge,mark zuckerberg,ministry of propaganda,oppressed,pesticides,science,tech giants,Tyranny,vaccines,zuckerberg", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2019-03-07-facebook-bans-vaccine-dogma-ban-articles-about-chemotherapy-fluoride.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "The Slippery Slope: If Facebook bans content that questions vaccine dogma, will it soon ban articles about toxic chemotherapy, fluoride and pesticides, too?", "cleaned_text": "The Slippery Slope: If Facebook bans content that questions vaccine dogma, will it soon ban articles about toxic chemotherapy, fluoride and pesticides, too?\n\nIn accordance with the company’s ongoing efforts to censor all truth while promoting only establishment fake news on its platform, social media giant Facebook has decided to launch full-scale war against online free speech about vaccines.\n\nPandering to the demands by California Democrat Adam Schiff, Mark Zuckerberg and his team recently announced that they are now “exploring additional measures to best combat the problem” of Facebook users discussing and sharing information about how vaccines are harming and killing children via social media.\n\nAccording to an official statement released by Facebook, the Bay Area-based corporation is planning to implement some changes to the platform in the very near future that may include “reducing or removing this type of content from recommendations, including Groups You Should Join, and demoting it in search results, while also ensuring that higher quality and more authoritative information is available.”\n\nIn other words, the only acceptable form of online speech pertaining to vaccines that will be allowed on Facebook is speech that conforms to whatever the U.S. Centers for Disease Control and Prevention (CDC) says is “accurate” and “scientific.” Anything else, even if it comes from scientific authorities with a differing viewpoint, will be classified as false by Facebook, and consequently demoted or removed.\n\nFacebook’s censorship tactics are becoming more nefarious by the day. To keep up with the latest news, be sure to check out Censorship.news.\n\nFacebook is quickly becoming the American government’s ministry of propaganda\n\nFacebook’s rationale, of course, is that it’s simply looking out for the best interests of users who might be “misled” by information shared in Facebook groups suggesting that the MMR vaccine for measles, mumps, and rubella, as one example, isn’t nearly as safe as government health authorities claim.\n\nAnd that’s just it: There are many things that the government is wrong about, but that have been officially sanctioned as “truth” by government propagandists. If Facebook bows down to these government hacks with regards to vaccines, there’s no telling what the company will try to ban from its platform in the future.\n\nAs we saw in the case of Cassandra C. from Connecticut, the government actually forced this young girl to undergo chemotherapy against her will, claiming that the “treatment” was absolutely necessary to “cure” her of non-Hodgkin’s lymphoma.\n\nNot only did the government deny young Cassandra the right to make her own medical decisions, but it also overrode the will of her parents, who also opposed taking the chemotherapy route. In essence, the government forced Cassandra to undergo chemotherapy at gunpoint, and now it’s trying to do the exact same thing with Facebook.\n\nIf little Adam Schiff is successful at forcing Facebook to only allow information on its platform that conforms with the official government position on vaccines, the next step will be to outlaw the sharing of information on the platform about the dangers of chemotherapy, as well as the dangers of fluoride, pesticides, and other deadly chemicals that the government has deemed as “safe and effective.”\n\nSoon there won’t be any free speech at all on Facebook, assuming the social media giant actually obeys this latest prompting by the government to steamroll people’s First Amendment rights online. And where will it end?\n\n“The real national emergency is the fact that Democrats have power over our lives,” warns Mike Adams, the Health Ranger.\n\n“These radical Leftists are domestic terrorists and suicidal cultists … they are the Stasi, the SS, the KGB and the Maoists rolled all into one. They absolutely will not stop until America as founded is completely ripped to shreds and replaced with an authoritarian communist-leaning regime run by the very same tyrants who tried to carry out an illegal political coup against President Trump.”", "opengraph": {"title": "The Slippery Slope: If Facebook bans content that questions vaccine dogma, will it soon ban articles about toxic chemotherapy, fluoride and pesticides, too?", "type": "article", "url": "https://www.glitch.news/2019-03-07-facebook-bans-vaccine-dogma-ban-articles-about-chemotherapy-fluoride.html", "site_name": "Glitch", "description": "In accordance with the company’s ongoing efforts to censor all truth while promoting only establishment fake news on its platform, social media giant Facebook has decided to launch full-scale war against online free speech about vaccines. Pandering to the demands by California Democrat Adam Schiff, Mark Zuckerberg and his team recently announced that they are […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2019/03/Mark-Zuckerberg-Facebook.jpg"}, "tags": ["content", "government", "knowledge", "zuckerberg", "CDC", "banned", "First Amendment", "oppressed", "Fluoride", "ministry of propaganda", "science", "tech giants", "mark zuckerberg", "Adam Schiff", "Centers for Disease Control and Prevention", "Facebook", "Glitch", "Tyranny", "evil", "Censorship", "vaccines"], "tweets": [], "movies": [], "links": ["https://www.bloomberg.com/news/articles/2019-02-14/facebook-says-it-may-remove-anti-vaccine-recommendations", "http://censorship.news", "https://www.naturalnews.com/2019-02-19-dr-brian-hookers-bombshell-testimony-before-congress-reveals-how-mmr-vaccines-increase-deaths-from-measles.html", "https://www.naturalnews.com/048578_chemotherapy_forced_medication_Hodgkins_lymphoma.html", "https://www.naturalnews.com/2019-02-14-its-time-for-the-american-people-to-declare-our-own-national-emergency.html", "https://www.bloomberg.com/news/articles/2019-02-14/facebook-says-it-may-remove-anti-vaccine-recommendations", "https://www.naturalnews.com/2019-02-19-dr-brian-hookers-bombshell-testimony-before-congress-reveals-how-mmr-vaccines-increase-deaths-from-measles.html", "https://www.naturalnews.com/048578_chemotherapy_forced_medication_Hodgkins_lymphoma.html", "https://www.naturalnews.com/2019-02-14-its-time-for-the-american-people-to-declare-our-own-national-emergency.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2019-03-07-facebook-bans-vaccine-dogma-ban-articles-about-chemotherapy-fluoride.html&linkname=The%20Slippery%20Slope%3A%20If%20Facebook%20bans%20content%20that%20questions%20vaccine%20dogma%2C%20will%20it%20soon%20ban%20articles%20about%20toxic%20chemotherapy%2C%20fluoride%20and%20pesticides%2C%20too%3F", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}