{"result_id": "132010", "URL": "https://glitch.news/2023-03-20-prepare-for-governments-to-push-cbdcs.html", "timestamp": "2023-04-25 15:16:30 CEST+0200", "meta": {"description": "Over 100 of the world’s governments are planning to push central bank digital currencies (CBDCs) and the collapse of Silicon Valley Bank may have given them the perfect opportunity to introduce this nightmarish surveillance tech. (Article by Tom Parker republished from ReclaimTheNet.org) The heightened fear of bank runs and the growing calls for more government […]", "lang": "en", "keywords": "banking,big government,Bubble,CBDCs,chaos,Collapse,computing,conspiracy,currency reset,deception,economy,enslaved,finance riot,Glitch,insanity,money supply,Orwellian,panic,privacy watch,propaganda,risk,Silicon Valley Bank,surveillance,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://glitch.news/2023-03-20-prepare-for-governments-to-push-cbdcs.html", "encoding": "UTF-8"}, "image": null, "domain": "glitch.news", "title": "Prepare for governments to push CBDCs in the wake of the Silicon Valley Bank collapse", "cleaned_text": "Prepare for governments to push CBDCs in the wake of the Silicon Valley Bank collapse\n\nOver 100 of the world’s governments are planning to push central bank digital currencies (CBDCs) and the collapse of Silicon Valley Bank may have given them the perfect opportunity to introduce this nightmarish surveillance tech.\n\nThe heightened fear of bank runs and the growing calls for more government controls to prevent another Silicon Valley Bank-style event has created space for governments to swoop in and present CBDCs as the solution.\n\nPrepare for these talking points to become prominent as governments ramp up their efforts to push CBDCs:\n\nTalking Point 1: CBDCs will protect you from social media bank runs\n\nWithin days of Silicon Valley Bank’s failure, it was described as the “first social-media fueled bank run in history” and fears about “social media disinfo” started to be stoked.\n\nSimilar talking points were quickly echoed by politicians. United States (US) House Financial Services Chair Patrick McHenry described it as “the first Twitter fueled bank run.” During an emergency conference call with high-ranking federal government officials, Senator Mark Kelly asked if the officials were reaching out to tech platforms to monitor “misinformation” and “bad actors” and inquired about the possibility of censoring social media posts to avoid a bank run.\n\nGovernments are likely to seize upon and amplify these fears of social media bank runs as they push new regulations and proposals in the wake of the Silicon Valley Bank collapse. And they’re likely to position CBDCs as the solution.\n\nBe on the lookout for suggestions from officials that CBDCs are “safe” and immune to social media bank runs. While such promises may soothe citizens’ fear of bank runs, this fear will be replaced with something far worse for those that embrace CBDCs — programmable money that allows the government to dictate when, where, or if citizens can spend their money.\n\nAs Silicon Valley Bank collapsed, the prospect of widespread financial contagion event loomed. Companies said they were left unable to pay staff, large online platforms delayed payments to sellers, and other companies revealed that they held significant portions of their cash at Silicon Valley Bank.\n\nWhile the US government stepping in to guarantee Silicon Valley Bank customer deposits appears to have averted much of the wider financial collateral damage (although this won’t be fully apparent until more time has passed), President Joe Biden has already vowed to “reduce the risks of this happening again.”\n\nGet ready for governments to capitalize on the fear of financial instability and use this narrative to push new rules and regulations that will supposedly provide financial stability. They’ll likely blame banks for creating financial blowups, insist that governments need more control over the financial system, and present CBDCs as the tool that will bring financial stability.\n\nThose that fall for this fantasy will be locked into a system that’s anything but stable. Instead of bringing financial stability, CBDCs will force citizens into a constant state of financial uncertainty where they never know when the rules about how they can spend their money will change or how significant the changes will be.\n\nTalking Point 3: CBDCs should be used for customer deposit protection\n\nMany governments have already cited making direct payments to citizens as one of the main use cases for a CBDC. If more banks fail, expect governments to start increasingly focusing on CBDCs as a solution for affected customers.\n\nBe on the lookout for governments urging citizens to download CBDC wallet apps during times of financial uncertainty. They’ll likely assert that this is a more streamlined or efficient way for customers to have instant access to their deposits in the event of bank failures.\n\nWhile CBDCs may provide some short-term convenience during financially turbulent times, citizens that choose CBDCs will be sacrificing their freedom and privacy long-term. Once they’ve been ushered into this system, they’ll lose their ability to transact anonymously and only be allowed to spend their CBDCs on government-approved purchases.\n\nDuring the last major crisis, the Covid pandemic, governments leveraged uncertainty and fear of the virus to push dystopian surveillance tech such as contact tracing, vaccine passports, and digital ID. Expect them to use the same playbook when pushing CBDCs.\n\nGovernments are likely to use talking points that tap into people’s fear of losing money during times of economic turbulence and use false promises of safety and stability to lure citizens into a CBDC system.\n\nDon’t be fooled. Governments have already made it clear that they plan to strip users of their financial freedom and privacy by imposing CBDC spending limits and controls and removing anonymity.\n\nReject these talking points when you hear them and say no to CBDCs!", "opengraph": {"title": "Prepare for governments to push CBDCs in the wake of the Silicon Valley Bank collapse", "type": "article", "url": "https://www.glitch.news/2023-03-20-prepare-for-governments-to-push-cbdcs.html", "site_name": "Glitch", "description": "Over 100 of the world’s governments are planning to push central bank digital currencies (CBDCs) and the collapse of Silicon Valley Bank may have given them the perfect opportunity to introduce this nightmarish surveillance tech. (Article by Tom Parker republished from ReclaimTheNet.org) The heightened fear of bank runs and the growing calls for more government […]", "image": "https://www.glitch.news/wp-content/uploads/sites/19/2023/03/Coins-Currency-Economy.jpg"}, "tags": ["conspiracy", "big government", "CBDC", "deception", "Silicon Valley Bank", "privacy watch", "panic", "money supply", "chaos", "currency reset", "propaganda", "CBDCs", "Joe Biden", "banking", "Bubble", "enslaved", "computing", "economy", "surveillance", "finance riot", "insanity", "Glitch", "Tyranny", "Orwellian", "Collapse", "risk"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/silicon-valley-bank-collapse-cbdc", "https://www.ft.com/content/6943e05b-6b0d-4f67-9a35-9664fb456504", "https://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408652", "https://reclaimthenet.org/mark-kelly-social-media-censorship-bank-runs", "https://reclaimthenet.org/imf-cbdc-control-what-people-buy", "https://watcher.guru/news/silicon-valley-bank-collapse-leaves-over-200-uk-firms-unable-to-pay-staff", "https://www.nbcnews.com/business/business-news/etsy-delays-payments-sellers-due-silicon-valley-bank-collapse-rcna74475", "https://www.cnbc.com/2023/03/10/roku-says-26percent-cash-reserves-stuck-in-silicon-valley-bank.html", "https://reclaimthenet.org/topics/joe-biden", "https://www.whitehouse.gov/briefing-room/speeches-remarks/2023/03/13/remarks-by-president-biden-on-maintaining-a-resilient-banking-system-and-protecting-our-historic-economic-recovery/", "https://reclaimthenet.org/digital-euro-spending-saving-limits", "https://nairametrics.com/2021/10/20/nigerian-government-can-send-direct-payments-to-citizens-though-the-enaira-cbn/", "https://www.federalreserve.gov/publications/files/money-and-payments-20220120.pdf", "https://reclaimthenet.org/topics/cbdc", "https://reclaimthenet.org/the-digital-dollar-will-not-be-anonymous-federal-reserve-chair-jerome-powell-says", "https://news.sky.com/story/britcoin-digital-pound-decision-to-be-made-by-2025-12804842", "https://reclaimthenet.org/australian-chief-health-officer-contact-tracing-new-world-order", "https://reclaimthenet.org/germany-vaccine-passport-color-codes", "https://reclaimthenet.org/big-government-big-tech-covid-digital-id", "https://www.telegraph.co.uk/business/2023/02/06/hoarding-britcoin-banned-bank-run-fears-sunaks-digital-currency/", "https://reclaimthenet.org/china-cbdc-controllable-anonymity", "https://reclaimthenet.org/silicon-valley-bank-collapse-cbdc", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fglitch%2F2023-03-20-prepare-for-governments-to-push-cbdcs.html&linkname=Prepare%20for%20governments%20to%20push%20CBDCs%20in%20the%20wake%20of%20the%20Silicon%20Valley%20Bank%20collapse", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}