{"result_id": "133018", "URL": "https://www.globalhealingcenter.com/natural-health/aluminum-and-breast-cancer/", "timestamp": "2023-04-25 15:17:05 CEST+0200", "meta": {"description": "Research shows that aluminum is found in deodorant as well as other household products, but can this be linked to breast cancer?", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/aluminum-and-breast-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "New Research Indicates Aluminum in Deodorant Linked To Breast Cancer", "cleaned_text": "We live in a world where the products that we use on a daily basis are actually laden with some of the most toxic chemicals on the planet.\n\nStudies are now showing that continuous exposure to toxic chemicals in personal hygiene products, such as antiperspirants, may be related to allergic reactions, Alzheimer's, and even breast cancer in women [1]. This may come as no surprise considering the fact that most deodorants are made up of aluminum chlorohydrate, as well as up to 20 other toxic chemicals.\n\nResearch into the Health Concerns of Aluminum\n\nRecent research from a growing number of international scientists has indicated that the use of common antiperspirant may be linked to benign breast lumps, a condition which may make women more likely to develop breast cancer in the future.\n\nA study from the Journal of Applied Toxicology conducted research on antiperspirant with high levels of aluminum [2]. The addition of aluminum, a chemical which enters the body through the sensitive underarm tissue, works to block our sweat ducts, thus reducing the amount of sweat that the body produces. But is this lack of perspiration and neutralization of body odor worth the constant daily intake of high levels of aluminum?\n\nSimilarly, a recent study from Reading University found that cancerous tumors are most likely to appear in the parts of the female breast which is closest to where antiperspirants are applied. Of the women studied, it was found that cysts in the armpit area of the breast had 25x more aluminum than the common amount found in blood.\n\nFurthermore, aluminum acts with an estrogenic effect on the body, known to increase the incidence of breast cancer tumors when in excess. Sadly, this and other studies, show that aluminum exposure is not only related to increased chances of developing breast cancer, but also other diseases such as Alzheimer's. Studies on the brains of individuals with Alzheimer's disease found that their brain tissue often held high amounts of the aluminum toxins [3].\n\nChemical exposure in antiperspirants is not limited to aluminum. There are many other poisonous chemicals, including anti-freeze, in the conventional stick of antiperspirant. Paraben, also a common ingredient in many deodorants, has been linked to higher risks for breast cancer, due to the estrogen-mimicking effect.\n\nStudies done by the U.S. Toxicology Program in 1997 found that hormone disruptors such as PropTEA and DEA, other normal ingredients found in deodorants, were reported to be carcinogenic (cancer-causing) in animals [4].\n\nOther chemicals such as FD&C colors, triclosan and quaternium compounds have been found to lead to cancerous diseases, dermatitis, allergies and asthma-like symptoms in both animals and humans. Over 90% of the chemicals used in fragrance additives to common personal-care products come from petroleum.\n\nWARNING! These other products may contain Aluminum!\n\nHow to Eliminate Aluminum From the Body\n• Stop using common antiperspirants. Switch to mineral-based antiperspirants, or even better, a natural deodorant, which does not block the sweat glands. I use the crystal salt deodorant and add about an ounce of colloidal silver.\n• Reduce your exposure to environmental toxins in general. Especially do not drink from Aluminum cans.\n• Further educate yourself on the toxins present in many of your personal care products. Remember, once ingested, aluminum can negatively affect the kidneys, brain, lungs, liver and thyroid. It also competes with calcium for absorption, leading to reduced skeletal mineralization.\n• If you have been using an aluminum-laden antiperspirant for some time, or drinking from aluminum cans, it is a good idea to do a heavy metal cleanse. The goal is to flush them out before they have time to do serious damage to your body.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Research Indicates Aluminum in Deodorant Linked To Breast Cancer", "description": "Research shows that aluminum is found in deodorant as well as other household products, but can this be linked to breast cancer?", "url": "https://explore.globalhealing.com/aluminum-and-breast-cancer/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2009-03-23T17:54:18+00:00", "article:modified_time": "2017-03-24T18:10:16+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2009/03/organic-deodorant-02.jpeg", "image:width": "174", "image:height": "260", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#references", "#references", "https://explore.globalhealing.com/concerned-about-aluminum-dangers/", "#references", "#references", "https://explore.globalhealing.com/20-reasons-toxic-metal-cleanse/", "http://www.ncbi.nlm.nih.gov/pubmed/17629949", "http://www.ncbi.nlm.nih.gov/pubmed/16045991", "http://www.ncbi.nlm.nih.gov/pubmed/18392545", "http://ntp.niehs.nih.gov/index.cfm?objectid=070AAE68-0C37-7929-9780A12F127B27B7", "https://explore.globalhealing.com/why-you-should-use-aluminum-free-deodorant/", "https://explore.globalhealing.com/why-you-should-use-aluminum-free-deodorant/", "https://explore.globalhealing.com/detoxify-aluminum/", "https://explore.globalhealing.com/detoxify-aluminum/", "https://explore.globalhealing.com/new-study-links-aluminum-to-osteoporosis-and-alzheimers-disease/", "https://explore.globalhealing.com/new-study-links-aluminum-to-osteoporosis-and-alzheimers-disease/", "https://explore.globalhealing.com/choosing-the-right-cookware/", "https://explore.globalhealing.com/choosing-the-right-cookware/", "https://explore.globalhealing.com/beauty/", "https://explore.globalhealing.com/endocrine-and-hormone/", "https://explore.globalhealing.com/green-living/", "https://explore.globalhealing.com/hidden-dangers/", "https://explore.globalhealing.com/mind-and-body/", "https://explore.globalhealing.com/personal-care-products/", "https://explore.globalhealing.com/public-health/", "https://explore.globalhealing.com/womens-health/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2009-03-23T17:54:18+00:00"}