{"result_id": "133016", "URL": "https://www.globalhealingcenter.com/natural-health/6-health-benefits-of-eating-organic-food/", "timestamp": "2023-04-25 15:17:04 CEST+0200", "meta": {"description": "There is a lot of discussion centered around the organic foods vs. not organic foods. Here we take a look at 6 reasons why organic is a better choice.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/6-health-benefits-of-eating-organic-food/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "6 Health Benefits of Eating Organic Food", "cleaned_text": "Agribusiness, as an industry, developed a food production system that often ignores what food is really all about: nutrition, health, and flavor. The voice of those of us who are not interested in so-called conventional farming is increasing. We're not interested in consuming chemicals, toxins, or GMOs. What are we interested in? Organic food. Why? Simply put: it's better.\n\nHere are six reasons why you should make it a point to consume organic whenever possible.\n\nGenetically modified food is an unnatural mutation of real food. Only in recent history have genetics been manipulated in this way, taking genes from one species and inserting them into another. Animal genes are spliced into plants, and plant genes into animals, something that cannot happen in nature.\n\nUnlike some claims, GMOs and breeding are not identical. Studies, like the one done by Gilles-Eric Séralini, show that rats fed a diet of Roundup-ready genetically modified corn developed massive tumors and died younger.[1] Although other countries in the world have rightfully shut the door on GMO food being sold within their boundaries, organic food is the only food that people in America can be reasonably sure is GMO-free!\n\nConventionally-grown food is often produced in depleted soil under the notion that all the nutrients you require can be replaced by artificially produced fertilizers. There is a fallacy that bigger and prettier produce is synonymous with healthier produce.\n\nThe fact is that study after study has proven that organic food is more nutritious. By the way, more nutritious food usually tastes better, too. Here are some nutrient facts reported by Organic.org:[2]\n• Organic fruits and veggies contain 27 percent more vitamin C, 21.1 percent more iron, 29.3 percent more magnesium, 13.6 percent more phosphorus, and 18 percent more polyphenols.\n• Salicylic acid is an important and health-promoting substance. Researchers have found that there is an average of 600 percent more salicylic acid in organic soups. Organic carrot and coriander soup contains 1,040 nanograms of it, compared with only 20 nanograms in typical non-organic soups!\n\nThe science is clear: organic food is more nutritious.\n\nPesticides and herbicides are poison. It's that simple. Their function is to kill bugs and weeds. You can not effectively wash it off. For lack of better words, it's in all the nooks and crannies.\n\nThese chemicals are taken up by the roots and soaked in when it's sprayed. Nearly all pesticides harm the nervous system. So, if you eat foods that were grown by agribusiness, you are likely consuming neurotoxins that could gradually poison your nervous system.[3] The only way to avoid these toxins is to eat organic foods.\n\nWhen you see studies claiming that meat is bad for you, take note that they never distinguish between organic meat and the stuff that comes from concentrated animal feeding operations (CAFOs). If you eat the meat that most supermarkets sell, then you should pay attention because it's truly bad for you. It's loaded with antibiotics and other drugs, and it is, frankly, dirty. Animals that are raised wallowing in their own feces and in the stench of old urine are not healthy.\n\nIf you eat meat that comes from such places, you're not supporting your health.[4] If you're going to eat meat, the way to avoid such cruelty to animals and unhealthy meat is simple: Eat only organic and free-range meats. I strongly recommend a plant-based diet.\n\nThe news media regularly reports about massive outbreaks of food-borne illness. Cabbage. Eggs. Fast food restaurants. Spinach. Melons. Peanut butter. The list goes on and on. The more our foods are produced by agribusiness, the more such outbreaks happen. What the news media fails to report is that virtually every one of these outbreaks is a direct result of agribusiness. Animals in CAFOs are sick. No matter how much they're vaccinated or drugged, they just get sicker.\n\nFactory farms are the primary source of drug-resistant infections. In fact, they were the first source. E. coli was not even considered an infectious bacterium until around 1983. Some strains are probiotics found in everyone's gut, helpful for digestion. The E. coli that causes deadly infections is a mutant caused by CAFOs.[5] The best way to be safe from food-borne illness is to choose organic foods. The insane rush to sterilize our foods and farms simply makes us less healthy, and ultimately results in exposure to the worst food-borne illnesses that have ever existed.\n\n6. Better for Your Conscience\n\nBy now, it's clear that the stuff for ingestion sold by most supermarkets is devastating for our health, devastating for the animals raised for this travesty, and devastating to the environment. So, my final health benefit of eating organic is your conscience.\n\nWhen you're aware of the devastation brought by agribusiness to animals and the environment, surely it affects your conscience. So do yourself a huge favor — make organic food as big a part of your diet as possible. Not only will your health benefit, but so will the rest of the world. In fact, it may be the most important action you ever take.\n\nIf you are concerned about your exposure to chemicals in foods, try our Heavy Metal and Chemical Cleanse Program™. It's designed to remove heavy metals, toxins, and other chemicals that enter the body so you feel energized and lighter. Plus, our awesome customer satisfaction team can answer any questions you have!", "opengraph": {"locale": "en_US", "type": "article", "title": "6 Health Benefits of Eating Organic Food", "description": "There is a lot of discussion centered around the organic foods vs. not organic foods. Here we take a look at 6 reasons why organic is a better choice.", "url": "https://explore.globalhealing.com/6-health-benefits-of-eating-organic-food/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2013-09-30T22:59:30+00:00", "article:modified_time": "2020-03-04T19:28:12+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2017/04/organic-food-fb.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#references", "https://explore.globalhealing.com/what-is-the-bt-toxin/", "https://explore.globalhealing.com/what-is-organic-soil/", "#references", "https://explore.globalhealing.com/healthy-berries/", "https://explore.globalhealing.com/dupont-herbicide-imprelis-blamed-for-tree-deaths/", "#references", "#references", "https://explore.globalhealing.com/plant-based-diet/", "#references", "https://globalhealing.com/chemical-heavy-metal-cleanse-program?icn_ghc=cht1_1_030416_shbeo&ici_ghc=chnha", "http://www.ncbi.nlm.nih.gov/pubmed/22999595", "http://www.organic.org/articles/showarticle/article-46", "http://garden.lovetoknow.com/wiki/How_do_Pesticides_Kill_Bugs", "http://www.ucsusa.org/assets/documents/food_and_agriculture/cafos-uncovered.pdf", "https://explore.globalhealing.com/gmos-pesticides-and-the-mega-corporations-behind-your-food/", "https://explore.globalhealing.com/gmos-pesticides-and-the-mega-corporations-behind-your-food/", "https://explore.globalhealing.com/study-eating-organic-limits-toxic-pesticide-exposure/", "https://explore.globalhealing.com/study-eating-organic-limits-toxic-pesticide-exposure/", "https://explore.globalhealing.com/what-is-the-bt-toxin/", "https://explore.globalhealing.com/what-is-the-bt-toxin/", "https://explore.globalhealing.com/what-is-glyphosate-video/", "https://explore.globalhealing.com/what-is-glyphosate-video/", "https://explore.globalhealing.com/body-cleansing-diet/", "https://explore.globalhealing.com/diet/", "https://explore.globalhealing.com/foods/", "https://explore.globalhealing.com/healthy-foods/", "https://explore.globalhealing.com/nutrition/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2013-09-30T22:59:30+00:00"}