{"result_id": "133001", "URL": "http://www.globalhealingcenter.com/natural-health/concerned-about-aluminum-dangers/", "timestamp": "2023-04-25 15:16:48 CEST+0200", "meta": {"description": "Aluminum is the most widely distributed metal on the planet and used in many products, either in production or as an ingredient and we should be concerned.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/concerned-about-aluminum-dangers/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "Why I'm Concerned About the Dangers of Aluminum", "cleaned_text": "Aluminum is the most widely distributed metal on the planet and it's used in the production of many everyday products. Cookware is made from aluminum, soda cans are aluminum, and aluminum foil is found in most kitchens. Aluminum is also in antacids, aspirin, vaccines, and even flour. This overwhelming amount of aluminum means that your exposure is through the roof.\n\nUnlike vitamins, minerals, and trace elements, the body does not need aluminum. And aluminum is no innocent or benign participant. Aluminum accumulates in the kidneys, brain, lungs, liver and thyroid where it competes with calcium for absorption and can affect skeletal mineralization. In infants, this can slow growth. Animal models have linked aluminum exposure to mental impairments.[1]\n\nJust as cigarette smoke damages lung function and overexposure to UV rays will degrade your skin, aluminum is not benign and its target is your central nervous system.[2] Studies show that toxic metals contribute to brain diseases by producing oxidative stress and aluminum is one of the worst offenders.[1] The prevailing belief around the world is that aluminum is linked to degenerative brain diseases such as Alzheimer’s and Parkinson’s.\n\nUnited States and Canadian regulatory agencies are interested in aluminum as a potential risk factor in elderly cognitive impairment. It makes sense. Research shows aluminum can produce toxic, oxidative stress in the brain. A brain autopsy study of elderly persons found them to have aluminum levels 20+ times higher than a middle-aged group.[3] [4] The Agency for Toxic Substances and Disease Registry, part of the U.S. Department of Health and Human Services, recognizes aluminum as one of several metals known to affect your neurological system.[5] As far as aluminum is concerned, the supreme brain-health concern is Alzheimer's disease.\n\nMany of the formal inquiries into aluminum toxicity are specifically concerned with its association to Alzheimer's. Consistently, experts agree that aluminum exposure is something to worry about.\n• A report out of the Department of Neurology and Psychiatry at Saint Louis University suggests that aluminum may cause liver toxicity and lead to degenerative symptoms, including Alzheimer's.[6]\n• Researchers at The School of Studies in Zoology at Jiwaji University in India describe aluminum as a potent neurotoxin that may be associated with Alzheimer's.[7]\n• A researcher at The University of California, Irvine's Department of Medicine has reported that aluminum causes inflammation in the brain. No surprise, Alzheimer's disease is often associated with elevated inflammation.[8]\n• The University School of Medicine in Belgrade published information showing that drinking water with a high aluminum and low fluoride concentration is associated with Alzheimer's risk.[9] Unfortunately, this is evident in New Guinea and Papua Islands where drinking water contains aluminum ions and ALS or Parkinson's disease is collectively found.[10] The concern about aluminum pollution in drinking water has even reached as far away as Egypt.[11]\n\nExposure to aluminum, unfortunately, is common with some occupations like mining, factory work, and welding. Welding can be especially worrisome because it produces vapors that, when inhaled, send aluminum directly into the lungs in a \"super absorption\" status where it is released to the blood and distributed to the bones and brain.\n\nResearchers have repeatedly examined the consequence of inhaling aluminum vapors and the results are not good. Effects on memory and concentration have been cited.[12] An Italian study that compared 64 aluminum dust exposed workers with 32 unexposed controls found significantly higher levels of aluminum in the exposed employees and findings suggested aluminum to be to culprit for early neurotoxic effects.[13]\n\nAluminum is one of the most abundant metals on earth and it has permeated mainstream products to the degree that it's virtually impossible to completely avoid exposure. However, you can take certain measures to reduce your exposure.\n\nUse glass cookware instead of aluminum. Avoid hygiene products (antacids, deodorant) with aluminum hydroxide, natural substitutes are available. Avoid processed and frozen foods, their containers can contain aluminum. Instead opt for fresh, organic fruits and vegetables, and foods with responsible packaging. If toxic metal exposure is of concern to you, consider performing a toxic metal cleanse.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why I'm Concerned About the Dangers of Aluminum", "description": "Aluminum is the most widely distributed metal on the planet and used in many products, either in production or as an ingredient and we should be concerned.", "url": "https://explore.globalhealing.com/concerned-about-aluminum-dangers/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2012-12-28T00:26:52+00:00", "article:modified_time": "2013-07-17T21:48:55+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2018/01/aluminum-fb.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#references", "https://explore.globalhealing.com/eliminate-tobacco-smoke-indoor-air/", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "#references", "https://globalhealing.com/chemical-heavy-metal-cleanse-program?icn_ghc=cht1_1_071713_wicaa&ici_ghc=chnha", "http://www.ncbi.nlm.nih.gov/pubmed/19568732", "http://www.ncbi.nlm.nih.gov/pubmed/19436852", "http://www.ncbi.nlm.nih.gov/pubmed/21993346", "http://www.ncbi.nlm.nih.gov/pubmed/12214020", "http://www.ncbi.nlm.nih.gov/pubmed/21473383", "http://www.ncbi.nlm.nih.gov/pubmed/23261179", "http://www.ncbi.nlm.nih.gov/pubmed/22575537", "http://www.ncbi.nlm.nih.gov/pubmed/20553758", "http://www.ncbi.nlm.nih.gov/pubmed/9863396", "http://www.ncbi.nlm.nih.gov/pubmed/14577644", "http://www.ncbi.nlm.nih.gov/pubmed/23022843", "http://www.ncbi.nlm.nih.gov/pubmed/23013241", "http://www.ncbi.nlm.nih.gov/pubmed/12520766", "https://explore.globalhealing.com/baking-soda-uses/", "https://explore.globalhealing.com/baking-soda-uses/", "https://explore.globalhealing.com/tea-tree-oil-uses-and-benefits/", "https://explore.globalhealing.com/tea-tree-oil-uses-and-benefits/", "https://explore.globalhealing.com/why-is-natural-skin-care-better/", "https://explore.globalhealing.com/why-is-natural-skin-care-better/", "https://explore.globalhealing.com/lead-bullets-toxic-4-dangers-lead-dust/", "https://explore.globalhealing.com/lead-bullets-toxic-4-dangers-lead-dust/", "https://explore.globalhealing.com/brain-health/", "https://explore.globalhealing.com/cleansing/", "https://explore.globalhealing.com/environmental-awareness/", "https://explore.globalhealing.com/green-living/", "https://explore.globalhealing.com/health/", "https://explore.globalhealing.com/hidden-dangers/", "https://explore.globalhealing.com/public-health/", "https://explore.globalhealing.com/toxic-metal-cleanse/", "https://explore.globalhealing.com/whole-body-wellness/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2012-12-28T00:26:52+00:00"}