{"result_id": "133015", "URL": "https://www.globalhealingcenter.com/natural-health/the-dangers-of-mercury-exposure-to-your-health/", "timestamp": "2023-04-25 15:17:03 CEST+0200", "meta": {"description": "Mercury can be poisonous to you and even deadly. Learn how it affects your health and what to do to remove toxic metals from your body.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/the-dangers-of-mercury-exposure-to-your-health/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "The Dangers of Mercury Exposure to Your Health", "cleaned_text": "Let's be honest, human history is cluttered with screw-ups of catastrophic proportion. In a list that would extend for miles, incorrect ideas about mercury is one that really stands out. Although it’s a natural element found in the earth’s crust, often in regions with volcanic activity, its natural status doesn’t mean it’s safe. In fact, it was previously thought to be a good and healthful substance. The first emperor of China was said to have taken mercury pills to give him eternal life. Instead the mercury pills destroyed his system and eventually he died. Years ago, hat makers used mercury to stiffen and form hats. This exposure lead to the high mortality rate of hat makers, but not before driving them mad.\n\nPart of the reason mercury is extremely toxic is because it can enter the body through inhalation, ingestion or skin absorption. It’s bad stuff and is simply best avoided, though it is often used in thermometers, barometers, and other scientific equipment. Pollution into our environment has caused mercury to be found in seafood. [1] Previously, opinions existed that removing the skin of seafood may significantly reduce the exposure to mercury but other research has found this not to be the case. [2]\n\nOne of the worst ways mercury is still used is the dental industry's use of mercury amalgam fillings. If you have these, my advice is get them removed. If you need a filling, make sure your dentist does not use this toxic substance.\n\nMercury is often a danger in industrial settings and exists in power plants that use coal. Some medical applications, including vaccine production, involve mercury. Efforts to control mercury exposure have existed in the form of the 1990 United States Clean Air Act as well as activity by the EPA but mercury remains a toxic and prevalent toxin in our environment.\n\nWhat Does Mercury Do To The Body?\n\nMercury has no value to the human body and is best thought of as poison. The effects of mercury exposure vary depending on the form and level of exposure. Acute exposure to mercury vapor can produce serious effects on the nervous system including psychotic reactions, hallucinations, suicidal tendencies and delirium. Continued exposure can produce violent muscular spasms and even death. When it enters the body, it is stored in the kidneys, blood, spleen, brain, liver, bones and fatty tissues.\n\nIt’s bad stuff for everyone and this is doubly true for pregnant or nursing women. Breast milk can become contaminated and in utero exposure to mercury has been attributed to an increase in neural tube defects. [3] [4]\n\nWhat Can Be Done About Mercury Poisoning?\n\nIf mercury exposure happens through diet or environmental toxins, then your diet or environment are due for an adjustment. [5] Cilantro has long been thought to facilitate the removal of toxic metals, including mercury, from the body. You may also benefit from a rudimentary body cleansing protocol such as the Colon Cleanse Program™ to get your body to an appropriate baseline so as to begin a Chemical and Heavy Metal Cleanse™ to remove the toxic metals from your body.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Dangers of Mercury Exposure to Your Health", "description": "Mercury can be poisonous to you and even deadly. Learn how it affects your health and what to do to remove toxic metals from your body.", "url": "https://explore.globalhealing.com/the-dangers-of-mercury-exposure-to-your-health/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2012-12-03T23:53:06+00:00", "article:modified_time": "2015-11-02T21:51:57+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2013/05/mercury.jpg", "image:width": "300", "image:height": "200", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://explore.globalhealing.com/how-pollution-affects-the-gut-microbiome/", "#references", "#references", "#references", "#references", "#references", "https://globalhealing.com/colon-cleanse-program", "https://globalhealing.com/chemical-heavy-metal-cleanse-program", "http://www.ncbi.nlm.nih.gov/pubmed/23173330", "http://www.ncbi.nlm.nih.gov/pubmed/23186633", "http://www.ncbi.nlm.nih.gov/pubmed/23164984", "http://www.ncbi.nlm.nih.gov/pubmed/23122516", "http://www.ncbi.nlm.nih.gov/pubmed/23155199", "https://explore.globalhealing.com/5-scary-truths-mercury/", "https://explore.globalhealing.com/5-scary-truths-mercury/", "https://explore.globalhealing.com/lead-bullets-toxic-4-dangers-lead-dust/", "https://explore.globalhealing.com/lead-bullets-toxic-4-dangers-lead-dust/", "https://explore.globalhealing.com/10-shocking-facts-mercury-amalgam/", "https://explore.globalhealing.com/10-shocking-facts-mercury-amalgam/", "https://explore.globalhealing.com/effects-of-toxic-metals/", "https://explore.globalhealing.com/effects-of-toxic-metals/", "https://explore.globalhealing.com/cleansing/", "https://explore.globalhealing.com/environmental-awareness/", "https://explore.globalhealing.com/green-living/", "https://explore.globalhealing.com/healthy-home/", "https://explore.globalhealing.com/hidden-dangers/", "https://explore.globalhealing.com/sustainable-living/", "https://explore.globalhealing.com/toxic-metal-cleanse/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2012-12-03T23:53:06+00:00"}