{"result_id": "133002", "URL": "https://www.globalhealingcenter.com/natural-health/the-perfect-world/comment-page-1/", "timestamp": "2023-04-25 15:16:50 CEST+0200", "meta": {"description": "What do we need to do in order to create the Perfect World? Here's some insight from Dr. Group!", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/the-perfect-world/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "The Perfect World", "cleaned_text": "Below is an excerpt from a recent interview I did with Curt Butz when he asked me what my perfect world would consist of. This interview has been spreading throughout the internet and I wanted to share it with my loyal blog fans.\n\nCurt: Dr. Group, If you could create the world you wanted, the perfect world, what would it look like?\n\nDr. Group, DC: That's what my whole life has been about, is helping create the perfect dream world of what the past was and what the future can be. I guess the first thing, if I was to think about the perfect dream world, would be to wake people up and expose them to the truths about their health, about who they really are spiritually, about what power they really have, and how we're all interconnected as one.\n\nI think that people need a major shift in consciousness to be able to understand the divine power within and their connection with nature, and how we have the power to create a perfect world.\n\nWhy We Need a Change in Mass Consciousness\n\nIn order to create a perfect dream world, I think the first step is to have a mass consciousness change. I think everything starts from teaching, and people need to be taught why they're here and who they really are. Once mass consciousness reaches a certain point, like the hundredth monkey phenomenon - which is actually in process right now where consciousness is rising and there are a lot of high powered energy fields coming into the planet we will start to see and feel positive transformational change; We still, unfortunately, have the majority of the world's population under control and believing what they hear from government and the lies spread through the world media channels. But finally, especially over the last 5 years, people are finally waking up to reality and not walking around like sheep in a herd as much.\n\nThe same can be said for the brainwashing of the public about disease. We are not addressing the root cause of disease and only addressing the symptoms. The true definition of a doctor is a teacher NOT a prescriber. If people do not understand what causes disease how can they ever expect to learn how to eliminate disease?\n\nWhen I had my clinic I would ask people \"Why do you have the disease you suffer from?\" and they would say \"Well, I don't know.\" Or I would say, \"Could you explain to me about your disease? What it is? How it got there?\" and they would look at me and say, \"No, I can't. I don't know about it.\" So in order to address a concern you need to understand why the concern exists to begin with. After I explained to them the root cause of why they have the disease due to the toxins and everything else, they understand and they're able to heal – spiritually, physically, or mentally.\n\nSo the next step to the perfect dream world would be to eliminate what is killing the world and what is killing the population and all the animals and plants. Meaning all the toxins that are in the air we breathe every day. The air's been poisoned! I would make laws to prevent the production of any substance released into the air that's not completely sustainable, provided or produced by nature.\n\nAnd that would also mean to stop cutting down all the trees, to clean up the oceans, to do everything possible to increase the oxygen levels to bring the planet back to an environmentally healing, co-created, space of love.\n\nPeople are going to have to realize and understand what the concerns are and how they are having such a detrimental effect on the planet which ultimately has a detrimental effect on us. All of the water systems have also been poisoned. So I would start on air and water pollution. We could still have cars, boats and airplanes, they just don't need to run on toxic gas and emit toxic fumes, they could run on magnetic, electromagnetic, or they could run on water or hydrogen. The exhaust would be nothing but pure oxygen.\n\nThe next step I would take would be to pass a law that would restrict any type of production of any types of chemicals by any country – this would include volatile organic compounds, pesticides, insecticides, POP's, paints, heavy metal processing, arsenic, etc. Or, anything that would cause harm to the environment or the human body.\n\nThen, I would restrict the production and sale of any type of toxic beverages. And that would mean all the soft drinks and other toxic beverages out there. Anything, that would cause a major effect, as far as production is concerned, on the environment and human body. Also to teach people that the only beverage the body wants and needs is water (after breastfeeding of course).\n\nThe next step for a perfect world would be to clean up the food supply and eat healthy foods or better yet learn to live on fruit or air. I'm not a believer that the human body, after years and years of research, should eat meat or that we should slaughter animals. I've researched everything from fruitarians, to raw vegans, to vegetarianism, to half-meat half-vegetarian and breatharianism. In a perfect scenario, the body should not even need any food or liquid to survive. And in a perfect world what we'll be seeing if everything goes as planned in the future is you'll be seeing a race which lives off of air and pranic energy alone. The air would provide the necessary life-force and energy to sustain the human body which is the way the body was originally made. Actually, there are over 10,000 humans as of today which are living on air alone with no food or water. And have been living like this for 10, 20, 40, even over 60 years. You can do the research yourself if this sounds strange. Just read the book \"Living on Light\" by Jasmuheen or type in breatharian in Google. Also what we've done is we've contaminated the fluids in our body to become acidic. Not to mention the fact that one of the major, major concerns with the world today is our food supply.\n\nThe fact that they're genetically modifying our foods is a scary, scary thought considering the fact they want to depopulate the world and they're going to do it by cutting off good foods. It's just unbelievable to even think about. People need to understand and cleanse themselves and start cleansing the world. When the environment and the human body become contaminated, then microbes can create diseases of plants and diseases of the human body. Like Louis Pasteur said on his death bed, the germ is nothing, the terrain is everything. He's the one that basically, in the beginning of his research, said that the germ is everything, the germ causes disease. We now know that the germ doesn't cause disease, it's the terrain not being in the proper state that causes disease. And everything that happens with the human body also translates to the earth and the universe.\n\nNext I would address the harmful electromagnetic frequencies which are being created with the addition of all the cell phones and all the cell phone towers around the world. We have literally created a negative harmonic frequency surrounding the globe.\n\nAs well as with the HAARP systems and any of the other high-pulsed radio waves, microwaves, negative electromagnetic rays which have altered the way fish swim in the oceans, the way plants grow, the way birds fly, and it's altered the way the human body functions.\n\nBrain cancers have gone up 60% since the introduction of cell phones. So I would also restrict the use of any damaging electromagnetic rays for the perfect dream world.\n\nLimit Amount of Negativity in the Media\n\nNext I would change all negative media to positive by eliminating all negative emotional patterns sent through the media. All TV, newspapers and all other media, would only report positive life-giving, happy news.\n\nSo you'd never have to taint the minds of the newborns or the new children, or the population on a daily basis with negative, negative, negative. I would change that to completely positive – about doing stories on people's gardens, or how this person was helped by this other person. Changing everything to a positive state from a negative state and ultimately creating a world in which everybody is interconnected in a space of love, and peace, and joy.\n\nNext, I would bring people back to nature. Starting with our young children, because the children are the future of the planet. The indigo children, the star children, and the crystal children that are coming into our planet to help raise the frequency and the vibrations of the planet, are being taught the wrong things in school and having their minds corrupted with false knowledge. Also, they are being mentally suppressed with pharmaceutical drugs.\n\nAnd that's another thing I would immediately stop in the perfect dream world - the administration of any vaccinations to children and the administration of any prescription medications. Because all it does is decrease our own spiritual frequency levels. The most damaging part of it, is that this is planned by certain groups of people involved in world government affairs that are trying to suppress the coming of a new Golden Age by inoculating children - these powerful indigo children, and crystal children that are coming in - with these harmful vaccinations. The child's immune system is not fully developed until they are eleven years old. And if you put DNA and RNA fragments from chicken embryos and monkey embryos and everything else that's contained in vaccinations it alters the genetic code and the frequencies that normally come in through the pineal gland to the child's body. The spiritual frequencies can be altered in these children. So I would immediately stop any vaccinations and pharmaceutical medications that are numbing our children from becoming attuned with each other through telepathy and through the same mission that they're here for, especially with the ADD and ADHD drugs. With the elimination of all those things people will start to wake up again and they'll start to use their own powers and they'll start to feel their true selves once again. Ultimately, as the mass consciousness of the planet becomes cleansed, so does the planet become cleansed. And once the planet becomes cleansed everybody will be drawn into nature, and will have the faith to allow nature and their own spiritual ability to progress to a world of love, happiness, peace, and joy.\n\nHow to Achieve 'Heaven on Earth'\n\nTo create a heaven on earth I think you have to address the main concern on why we don't have a heaven on Earth right now. And the main concern is because the earth is being polluted and our bodies are being polluted. It's inevitable, the earth naturally cleanses itself. Everything cleanses itself on a regular basis. We have a whole society now that's tried to play God and tried to break down God's natural structure. And what they don't understand is that there's a life-force component which they can't see with their microscopes that sustains all life. And what they can take and isolate out of plants and create chemicals is just the opposite of the living force and beauty of what the world needs. By using man-made science we've literally, in the last hundred years, practically destroyed the human population as well as the natural environment. We have 2500 therapeutic plants going extinct every three months. Every therapeutic plant has been harvested by the pharmaceutical companies. Even in the wild, it's very hard to find Ginseng or a lot of other therapeutic herbs anymore. If so, there's a cell phone tower nearby, or something else polluting the environment disturbing the potency and growth patterns. Now the good news with all that being said is there are many, many people waking up and we're on the verge of reaching a mass consciousness level. And the powers that are trying to control the populations and eliminate the populations are running scared right now. Things are happening at an extremely high rate. There's a lot of different theories about what's going to happen in 2012 with the Mayan Calendar. Nobody really knows what's going to be happening, though we are on the path - regardless of what happens in the near future, the next five years, ten years - to be coming into another Golden Age. Whether the earth ascends into another dimension, or whether once we reach mass consciousness everybody wakes up and understands and is then able to communicate through telepathy and communicate through spirituality and create their own space of love. Regardless, I think we're getting extremely close. I know that's why I was put on this planet – to do good. Many are gathering together. It's the gathering of Eagles and the last times to put forth the new heaven on Earth, and so that's ultimately where we're heading. I'm not saying that we might not have to go through some bad times. But we've all known about this. These things have all been put in front of our faces to prepare us for these times that we're going to be going through.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Perfect World", "description": "What do we need to do in order to create the Perfect World? Here's some insight from Dr. Group!", "url": "https://explore.globalhealing.com/the-perfect-world/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2009-03-31T21:52:22+00:00", "article:modified_time": "2015-11-16T17:36:47+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2009/03/perfect_world.jpeg", "image:width": "220", "image:height": "204", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://explore.globalhealing.com/celebrate-earth-day-everyday/", "https://explore.globalhealing.com/celebrate-earth-day-everyday/", "https://explore.globalhealing.com/recognizing-and-avoiding-common-household-toxins/", "https://explore.globalhealing.com/recognizing-and-avoiding-common-household-toxins/", "https://explore.globalhealing.com/reduce-food-waste/", "https://explore.globalhealing.com/reduce-food-waste/", "https://explore.globalhealing.com/natural-weed-killer/", "https://explore.globalhealing.com/natural-weed-killer/", "https://explore.globalhealing.com/environmental-awareness/", "https://explore.globalhealing.com/global-healing-center-news/", "https://explore.globalhealing.com/green-living/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2009-03-31T21:52:22+00:00"}