{"result_id": "133014", "URL": "https://www.globalhealingcenter.com/natural-health/colic-remedies/", "timestamp": "2023-04-25 15:17:02 CEST+0200", "meta": {"description": "Colic in infants can be a common problem. Here are some natural colic remedies that can help stop their crying, and finally give you a little peace.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/colic-remedies/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "Colic Remedies: Natural Ways to Help Your Baby", "cleaned_text": "Colic is a frustrating and exhausting condition for both infants and parents. The time spent raising a colicky child is fraught with sleepless nights and nearly endless screaming. You may think it will never end, but here are some colic remedies that may help.\n\nThe exact causes of colic in infants is controversial, and the condition is thought to be aggravated by a variety of things, including:\n• Food allergies (especially to dairy and soy formulas)\n\nThe best way to figure out if your child's discomfort is caused by a food allergy is to use an elimination diet.\n\nIf the baby is switching to solid food for the first time, this can be rather simple, if you are breastfeeding it may take some more effort. To use the elimination diet, you have to remove all dairy and wheat products, some vegetables (legumes) and fruits, and all sugars. Once you have removed all of these foods for 30 days, you can slowly start adding foods back in to see if the symptoms come back.\n\nOf course, if you believe that the colic is being caused by an inability to digest lactose or another particular group, then the obvious solution is to reduce your infant's intake of foods in that group (or yours, if you are breastfeeding). The elimination diet is inconvenient and can be expensive if you end up throwing out 90% of your pantry, but it is the most effective way of eliminating discomfort that comes from a food allergy. Luckily, this is only one of many colic remedies you can try for your infant or toddler.\n\nInfants that display symptoms of colic often have difficulties feeding, including painful reflux and lack of \"zest\" for feeding[1]. While the exact cause of colic, in any case, is likely specific to the child in question, the tried and true ways to calm the symptoms are the same. Comforting your child by bouncing, holding, cuddling and reducing your stress levels can reduce the symptoms of colic because the baby can sense your tension and will respond to it.\n\nIf your child's discomfort is followed by a bowel movement, then help your child process the stool when he starts to get uncomfortable. Lay your baby flat on their back on a firm but soft surface and begin to slowly and gently massage the belly in a clockwise circular motion. Before you do this make sure that your hands are warm and soft by rubbing some organic olive oil quickly between your palms.\n\nFor extra comfort use aromatherapy with essential oils, such as chamomile and lavender (5 drops of chamomile combined with ten drops of lavender). You can also try acupressure, which targets particular parts of the body to receive pressure. Gently pulling or tugging the earlobes is said to help relieve infant colic, or you can look for professional acupressure therapists in your area and find out if they treat infants.\n\nNote that this is different from acupuncture, which uses needles to treat conditions. Another great solution is to find a pediatric chiropractor who can gently adjust your baby's bones.\n\nThere are also other natural ways of controlling colic. Calm and comfort your child by adding one drop of lavender and chamomile oil to a humidifier in the child's room.\n\nColicCalm gripe water is a homeopathic remedy containing herbs that help re-balance baby's digestive system. ColicCalm is the first homeopathic treatment for infant colic, which is important because it does not introduce chemicals or parasites into your baby's body like some non-homeopathic gripe water can. This is what I use when my children complain of stomach cramps. The herbs in ColicCalm gripe water are\n• Chamomile – calms the baby down and helps ease nervous tension\n\nProbiotics may also be an option for relieving colic in infants. The composition of gut flora in babies that exhibit colicky symptoms is different than in non-colicky babies. Probiotics are the opposite of antibiotics, which kill bacteria.\n\nProbiotics add beneficial bacteria back into the digestive system and can help return the digestive system to a normal state. I use a probiotic supplement called Latero-Flora™. As a colic remedy, just empty a small amount into a bowl, mix it with breastmilk and use a dropper to administer it.\n\nThe famous American born psychic and holistic health guru Edgar Cayce gave \"readings\" for people with varying ailments, including 23 for infants with colic. Cayce's answer was basically that the internal systems were out of sync, which is why probiotics are an effective way of treating colic.", "opengraph": {"locale": "en_US", "type": "article", "title": "Colic Remedies: Natural Ways to Help Your Baby", "description": "Colic in infants can be a common problem. Here are some natural colic remedies that can help stop their crying, and finally give you a little peace.", "url": "https://explore.globalhealing.com/colic-remedies/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2009-12-17T23:53:25+00:00", "article:modified_time": "2015-10-21T17:19:24+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2013/04/baby-colic.jpg", "image:width": "275", "image:height": "293", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#references", "https://explore.globalhealing.com/recommendations-for-stress-management/", "https://explore.globalhealing.com/best-essential-oils-and-their-benefits/", "https://explore.globalhealing.com/health-benefits-of-probiotics/", "https://globalhealing.com/latero-flora-probiotic-supplement?icn_ghc=lft1_1_121709_nrcix&ici_ghc=lfnha", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1719691/", "https://explore.globalhealing.com/iron-toxicity/", "https://explore.globalhealing.com/iron-toxicity/", "https://explore.globalhealing.com/is-there-a-link-between-antidepressants-and-birth-defects/", "https://explore.globalhealing.com/is-there-a-link-between-antidepressants-and-birth-defects/", "https://explore.globalhealing.com/u-s-rates-worse-for-maternal-health/", "https://explore.globalhealing.com/u-s-rates-worse-for-maternal-health/", "https://explore.globalhealing.com/5-ways-air-pollution-is-destroying-your-health/", "https://explore.globalhealing.com/5-ways-air-pollution-is-destroying-your-health/", "https://explore.globalhealing.com/childrens-health/", "https://explore.globalhealing.com/digestive-issues/", "https://explore.globalhealing.com/gut-and-digestive-health/", "https://explore.globalhealing.com/health/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2009-12-17T23:53:25+00:00"}