{"result_id": "133020", "URL": "https://www.globalhealingcenter.com/natural-health/5-dangerous-chemicals-avoid-pregnancy/", "timestamp": "2023-04-25 15:17:08 CEST+0200", "meta": {"description": "The importance of living a clean life during pregnancy cannot be overstated. Here we cover 5 common, dangerous, chemicals for pregnant women to avoid.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/5-dangerous-chemicals-avoid-pregnancy/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "5 Dangerous Chemicals to Avoid During Pregnancy", "cleaned_text": "Chemicals infiltrate our food supply, home, and environment; escape is virtually impossible. And, everyone knows, pregnancy is a time when toxin avoidance is absolutely imperative since the developing fetus is highly susceptible to the effects of common chemicals. Even low exposure to everyday toxins could cause abnormal development or birth defects.\n\nWe've come a long way as a society but today’s world still presents many great health risks to babies. Harmful chemicals are rampant, despite concerns voiced by many independent scientists. Here is a list of five chemicals that are risky for pregnant women and how to avoid them.\n\nPhthalates are a class of substances used to increase plasticity, durability, transparency, and longevity of building supplies, personal care products, medical devices, detergents and surfactants, food packaging, children's toys, pharmaceuticals, paint, inks, and cosmetics. With extensive use like this, it's no wonder why so many people are having health concerns as a result of exposure. The biggest concern with phthalates is that they're endocrine disruptors, and pregnant women especially are at a higher risk for experiencing ill effects. [1] [2] Studies have implicated phthalates as a potential cause of breast cancer. [3] In fetuses, phthalates may shorten the distance between the anus and genitals, an issue sometimes resulting in sterility. [4] Also, miscarriages have correlated with high levels of phthalates in expectant mothers. [5] Phthalates can contaminate food or beverages if these items are stored in phthalate-containing plastics. Water bottles are a common source of these chemicals. Phthalates can also be found in cars and homes, and breathing in these chemicals is another way through which they may enter the body. Avoiding plastic containers, tin cans, and synthetic fragrances can help reduce exposure to this common chemical. Also, choose phthalate-free baby toys, bottles, pacifiers, and other products to keep your child’s phthalate burden low.\n\nModern agriculture strips the soil of nutrients, introduces genetically-modified organisms into the environment, and uses toxic pesticides. Pesticide-resistant insects and glyphosate-tolerant weeds are becoming the norm due to overuse of pesticides... and the only solution agribusiness has is to use more pesticides. Today, we are living in a world swimming in pesticide poisons. The fact that their purpose is to kill should clarify their danger. [6] Studies have shown that some pesticides induce neurological harms in children and birth defects. [7] This toxic trash is so pervasive and hard to get away from – pesticides have been found in maternal blood, umbilical cord blood, and breast milk. [8]\n\nPesticides have been associated with:\n\nThe best way for pregnant women to avoid pesticides is by eating only organic foods. Now there are other sources (air, water...) to be cautious of but organic will at least protect you in your diet. Choosing organic personal care products, like shampoo or face soap, is also helpful for reducing exposure.\n\nPerhaps one of the most insidious chemicals, triclosan is exposed to the body via antibacterial soap. [9] Despite its ability to kill germs, the truth is that triclosan is one of the most dangerous chemicals known to man. It's been associated with infertility in both genders. Maternal exposure to triclosan has also been shown to impair thyroid function in developing babies. [10] [11] This single fact should be of great concern to expectant mothers because the thyroid regulates energy production in every cell of the body.\n\nThe negative health consequences associated with triclosan have become so apparent in recent years that Minnesota recently banned its use. [12] Still, for residents of other states, triclosan can be difficult to avoid. Since the primary use of triclosan is as a disinfectant, one of the simplest and best ways to avoid the compound is by ceasing the use of antibacterial hand gels, soaps, and similar products. [13]\n\nCommonly referred to as BPA, bisphenol A is an estrogen disruptor used in the production of plastics, as a lining for tin cans, and also provides a glossy feel and appearance to receipts. BPA in an expectant mother’s blood has been tied to low infant birth weight. [14] BPA has also been shown to result in lower infant survival rates. Even low doses have been associated with defects in brain function. [15]\n\nBPA is used with phthalates; therefore, the best way to avoid BPA is to follow the same advice. In general, avoid plastics and only choose food cans that are BPA free.\n\nAluminum is a lot more pervasive than most people would guess. Whether it’s food packaging, personal care products, or a cooking utensil, many people are exposed to aluminum every day. [16] This metal has been linked to behavioral changes in rats, possibly translating to behavioral disorders in humans. [17] Independent research is showing that aluminum may have neurodegenerative properties, possibly influencing an individual’s risk for developing cognitive disorders, including Alzheimer’s disease, later on in life. [18]\n\nVaccines are one exposure route through which babies are exposed to this metal. Pregnant women who receive aluminum-containing vaccines also expose their unborn baby to aluminum. Babies and developing fetuses, because of their small body weight, have a greater ability to uptake certain compounds.\n\nAvoiding conventional antiperspirant may be a viable way for expectant mothers to reduce their infant’s exposure. The active ingredient in most deodorant, unless labeled otherwise, is aluminum. Baking soda is perhaps the most inexpensive – not to mention the most effective – natural, aluminum-free deodorant. Most prepared foods contain aluminum and should be avoided, this includes organic processed food.\n\nThe health effects from chemical toxicity are ever evolving and illnesses that were once thought to be associated with adults are now becoming routine in children. Diabetes, asthma, allergies, and neurological concerns affect more kids now than ever before.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Dangerous Chemicals to Avoid During Pregnancy", "description": "The importance of living a clean life during pregnancy cannot be overstated. Here we cover 5 common, dangerous, chemicals for pregnant women to avoid.", "url": "https://explore.globalhealing.com/5-dangerous-chemicals-avoid-pregnancy/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2014-08-25T15:00:33+00:00", "article:modified_time": "2014-08-25T21:21:28+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2018/03/chemicals-to-avoid-during-pregnancy-fb.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://explore.globalhealing.com/the-top-5-harmful-toxins-in-air/", "https://explore.globalhealing.com/do-you-know-these-6-facts-about-laundry-detergent/", "#references", "#references", "#references", "#references", "#references", "https://explore.globalhealing.com/the-top-10-endocrine-disruptors-to-avoid/", "https://explore.globalhealing.com/effects-of-pesticides/", "#references", "https://explore.globalhealing.com/pesticides-linked-to-adhd/", "#references", "#references", "https://explore.globalhealing.com/6-reasons-to-use-organic-makeup/", "#references", "https://explore.globalhealing.com/chemical-in-antibacterial-soaps-may-impair-muscle/", "#references", "#references", "https://explore.globalhealing.com/minnesota-bans-triclosan/", "#references", "#references", "https://explore.globalhealing.com/10-things-to-know-about-bpa/", "#references", "#references", "https://explore.globalhealing.com/concerned-about-aluminum-dangers/", "#references", "#references", "#references", "https://explore.globalhealing.com/aluminum-and-breast-cancer/", "https://explore.globalhealing.com/10-natural-ways-to-prevent-seasonal-allergies/", "http://www.ncbi.nlm.nih.gov/pubmed/23795657", "http://www.ncbi.nlm.nih.gov/pubmed/23747553", "http://www.ncbi.nlm.nih.gov/pubmed/20368132", "http://www.ncbi.nlm.nih.gov/pubmed/11319729", "http://www.news-medical.net/news/20110906/Exposure-to-phthalates-during-pregnancy-may-increase-risk-of-developmental-problems-in-children.aspx", "http://oem.bmj.com/content/54/7/511.abstract", "http://www.tandfonline.com/doi/full/10.1080/10937404.2013.783383", "http://www.ncbi.nlm.nih.gov/pubmed/23892639", "http://www.ncbi.nlm.nih.gov/pubmed/23059059", "http://www.ncbi.nlm.nih.gov/pubmed/21058171", "http://www.ncbi.nlm.nih.gov/pubmed/20954233", "http://www.cnn.com/2014/05/21/health/triclosan-ban-antibacterial/", "http://www.ewg.org/skindeep/browse/bar+soap/", "http://www.ncbi.nlm.nih.gov/pubmed/23870093", "http://www.ncbi.nlm.nih.gov/pubmed/23716699", "http://www.ncbi.nlm.nih.gov/pubmed/23830387", "http://www.ncbi.nlm.nih.gov/pubmed/21440537", "http://www.ncbi.nlm.nih.gov/pubmed/23661775", "https://explore.globalhealing.com/whats-the-deal-with-obesogens/", "https://explore.globalhealing.com/whats-the-deal-with-obesogens/", "https://explore.globalhealing.com/the-hidden-toxins-in-your-clothing/", "https://explore.globalhealing.com/the-hidden-toxins-in-your-clothing/", "https://explore.globalhealing.com/bpa-continues-to-pervade-food-supply/", "https://explore.globalhealing.com/bpa-continues-to-pervade-food-supply/", "https://explore.globalhealing.com/why-you-should-use-aluminum-free-deodorant/", "https://explore.globalhealing.com/why-you-should-use-aluminum-free-deodorant/", "https://explore.globalhealing.com/childrens-health/", "https://explore.globalhealing.com/green-living/", "https://explore.globalhealing.com/health/", "https://explore.globalhealing.com/hidden-dangers/", "https://explore.globalhealing.com/womens-health/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2014-08-25T15:00:33+00:00"}