{"result_id": "133006", "URL": "https://www.globalhealingcenter.com/natural-health/what-is-glyphosate-video/", "timestamp": "2023-04-25 15:16:54 CEST+0200", "meta": {"description": "Glyphosate is roundup, a toxic herbicide. It's used on lawns and crops and it's a poison, learn its dangers here.", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/what-is-glyphosate-video/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "What Is Glyphosate? (Video)", "cleaned_text": "Glyphosate is RoundUp, Monsanto's overly popular toxic herbicide. It's widely used and is the effective poison it claims to be. Check out this video explaining the concerns with glyphosate.\n\n\"Glyphosate is Round-up, it’s an herbicide that you get when you go to a home and garden store. Millions of people use it on their lawns, and it’s a chemical that was developed in the 1970s by Monsanto, and has wreaked havoc on the environment, and continues to wreak havoc. Monsanto is making genetically modified crops that are round-up ready, or resistant, to Glyphosate. Glyphosate is a chelator so it actually bonds to the minerals in the plant, which prevents them from growing, and it’s an herbicide it kills weeds and it kills everything else but what’s happened is, plants are becoming resistant to it, weeds. So farmers are using 2 to 3 times the amount to control weeds now, and Glyphosate is a toxic, toxic chemical that gets into food, genetically modified food, and gets into peoples bodies, which is another reason why you need to eat organic, always eat organic. So I took the liberty to pull up all the clinical studies and research that have been done on Glyphosate and I want to read some of these to you right now. There are 40 different studies that show Glyphosate is completely linked to Lymphoma non hodgkin's lymphoma. 37 studies on DNA damage. 29 studies on the toxicity of Glyphosate. 24 studies on hormonal disorders in children. 22 on low testosterone. 21 on pesticide toxicity. 20 studies on hairy leukoplakia. And the sad thing is, it’s not even regulated. I mean, you would think with this toxic of a chemical the FDA and the EPA and everything else would shut this thing down. 20 studies proving it causes lymphoma, prenatal chemical exposure, multiple myeloma, rhinitis, Parkinsonian disorder, neuro-toxicity, endocrine diseases, liver cancer, chemical poisoning, low dopamine levels no wonder so many people are on anti-depressants. Infertility in males, why are so many people having concerns getting pregnant these days? It’s not only the women but it’s the males too. Lipid pro-oxidation, mercury poisoning, pregnancy environmental issues causing decreased pregnancy. Substantia Nigra, which is in brain, damage, botchalism, chemically induced liver meningitic, neurodegenerative diseases, oxidative stress, Parkinson’s disease, vaccine induced toxicity, breast cancer, all cancers, all cancers. Male reproductive development abnormality’s, skin cancer, dysbiosis, kidney damage, lymphatic cancer, its genotoxic, it’s an endocrine disrupter, it’s a carcinogen, it’s psydotoxic, its aquacital, biocital, hepatotoxic, I mean this is a major chemical that we’re being exposed to. So, join the Monsanto Video Revolt, go against Monsanto, call your congressman, anything you can do. I’ll tell you what, stop buying RoundUp. It’s in the stores. Use natural Herbicides if you want to use them. Get on an organic diet, please. Anyway, that’s what Glyphosate is, and that’s how damaging Glyphosate can be.\"", "opengraph": {"locale": "en_US", "type": "article", "title": "What Is Glyphosate? (Video)", "description": "Glyphosate is roundup, a toxic herbicide. It's used on lawns and crops and it's a poison, learn its dangers here.", "url": "https://explore.globalhealing.com/what-is-glyphosate-video/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2013-06-27T22:52:42+00:00", "article:modified_time": "2015-03-07T20:43:29+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2017/10/Nextopia-video-thumbnail.jpg", "image:width": "300", "image:height": "300", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://explore.globalhealing.com/toxic-substances-control-act-reform/", "https://explore.globalhealing.com/toxic-substances-control-act-reform/", "https://explore.globalhealing.com/gmos-pesticides-and-the-mega-corporations-behind-your-food/", "https://explore.globalhealing.com/gmos-pesticides-and-the-mega-corporations-behind-your-food/", "https://explore.globalhealing.com/study-eating-organic-limits-toxic-pesticide-exposure/", "https://explore.globalhealing.com/study-eating-organic-limits-toxic-pesticide-exposure/", "https://explore.globalhealing.com/5-shocking-facts-pesticides/", "https://explore.globalhealing.com/5-shocking-facts-pesticides/", "https://explore.globalhealing.com/environmental-awareness/", "https://explore.globalhealing.com/foods/", "https://explore.globalhealing.com/green-living/", "https://explore.globalhealing.com/healthy-home/", "https://explore.globalhealing.com/hidden-dangers/", "https://explore.globalhealing.com/nutrition/", "https://explore.globalhealing.com/public-health/", "#pageTop"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2013-06-27T22:52:42+00:00"}