{"result_id": "133024", "URL": "https://www.globalhealingcenter.com/natural-health/free-iodine-webinar/", "timestamp": "2023-04-25 15:17:11 CEST+0200", "meta": {"description": "Want to learn everything about iodine? Watch this webinar, \"Everything You Need To Know About Iodine\"", "lang": "en", "keywords": "", "favicon": "https://cdn.globalhealing.com/web/img/favicon/green-leaf.ico", "canonical": "https://explore.globalhealing.com/free-iodine-webinar/", "encoding": "UTF-8"}, "image": null, "domain": "www.globalhealingcenter.com", "title": "Everything You Need To Know About Iodine Webinar by Dr. Edward F. Group", "cleaned_text": "The health benefits of iodine have been known for years. But where does a person start? Is all iodine the same? What does it even do?\n\nWhether you regularly supplement with iodine or have yet to begin, this webinar is for you. Dr. Group, DC will explain exactly what iodine is, why it's essential for good health, and how to enjoy its benefits immediately. In this webinar, you'll learn...\n\n...and much more!\n\nHi, everybody. I'm Dr. Group, DC with Global Healing. And tonight, I appreciate you guys coming on and listening to this webinar. We are going to talk about one of my favorite supplements, which is iodine.\n\nAll the stuff that I talk about as far as detoxifying your body, keeping your body clean, which is great, addressing the root cause of disease. Reactivating your body's own self-healing mechanism. Normally, when you look at the amount of toxins that we are exposed to on a daily basis through the air, the water, the food. The list goes on and on.\n\nThe chemicals, the toxic metals, the pesticides, the plastics. All of those are endocrine disruptors. Your thyroid gland is an endocrine gland. And your thyroid produces hormones and it uses iodine. And when you look at the amount of chemicals and toxic metals and all of this stuff that's coming into the body. What happens is that we are severely deficient in iodine and all these other chemicals, especially the halides which are your bromine and your fluoride and your chlorine, which were put in the water supply on purpose to dumb people down.\n\nAnd the chlorine in the water and the bromide in the water, that has a major effect on the thyroid gland and many other systems in the body. So, tonight, I want to just share with everybody, my notes that I've been taking. Some of the research, give everybody a history of iodine. Talk about what it can do.\n\nI don't like to use the word \"problem\" at all because I believe everything, for every situation that's out there, there's always a solution. And maybe answer some questions. If you have any questions, just type them in and hopefully I can get to it. But we will be republishing this webinar, there's going to be a lot of good information on here. So, hopefully, you'll be able to learn a lot and be able to share a lot as well.\n\nIn its natural form, really, iodine is just a gas and it's an element. And like I said, it's in the periodic table with the halogens, which are bromine, fluorine, and chlorine. And it's a very important trace element that's required by many parts of our body. People just associate iodine with the thyroid gland, but really, iodine is utilized by every single cell in the body. And it's important to get the right type and the proper type of iodine into your cells.\n\nSo, how was iodine developed or how was it discovered? It was actually discovered in 1811. And it was discovered by a scientist who was experimenting with seaweed and he was burning the ash and he actually developed iodine. So, it hasn't even been around that long.\n\nIn 1829, there was a French physician, Dr. Lugol, who created Lugol's solution and anybody that knows about iodine out there knows and is familiar with Lugol's solution. And when he discovered iodine, he discovered that bonding it to a potassium molecule made it water-soluble and it actually unlocked its antiseptic qualities and kind of stabilized it. And that's why Lugol's solution is potassium iodide.\n\nAround 1860, there was a Swiss physician that found that iodine could be used to treat goiter. What was happening back in the 1800s, a goiter is nothing more than a cyst that grows on your thyroid gland. Later, I'm going to tell you about our own research in the United States with the goiter belt that was up around Ohio and Michigan where deficiency was common.\n\nSo, like I said, he was the one that discovered that it could be used which led to multiple discoveries or links that iodine is a very important trace mineral and it can cause major concerns in the body if you're deficient.\n\nIn 1924, which really is not that long ago, iodized salt became available in the U.S. as a means to treat goiter. Because they found that there were so many goiters along that western belt; Ohio, Michigan and everything like that. And they actually did a study and they took a group of girls and gave them potassium iodide and they took another group of girls and didn't give them anything. And the ones they gave the iodine to, the goiters went away.\n\nSo, at that time, the U.S. decided that we should add iodine into salt and make it iodized. So, that was a great discovery, although it was refined salt, which I highly disagree with. I believe in using a Celtic salt or my favorite, which is Himalayan crystal salt, which contains all of the minerals and the nutrients and everything that you have to get on a daily basis. And it even contains trace amounts of iodine.\n\nSo, what happened, though, later on, is because of heart disease, which is also initiated with all the chemicals and fluorides and everything else in the body and the toxic livers and the toxins coming in from all over the place, everybody started thinking that salt was the main cause of heart disease. So, at that point, they recommend people don't eat salt. And to this day, when you have heart disease and you go to the doctor, they're still going to recommend you don't eat salt. That caused, again, an iodine deficiency.\n\nTo this day, a lot of salt doesn't even have added in it anymore. Then, kind of another discovery which happened in 1997 was when Dr. Ghent reported that he saw benefits of iodine with fibrocystic breast disease. Now, if you notice, it's fibrocystic breast disease because any iodine deficiency is going to cause a cystic disease somewhere. The iodine is up taken in the body in every cell, but usually, you see the reproductive organs. Polycystic ovarian disease, fibrocystic breast disease.\n\nThe breasts take up a tremendous amount of iodine. The uterus, all the glandular systems. And not only that, iodine is used by the immune system because the white blood cells require iodine to fight infection. So, it's not only associating iodine with the thyroid, but more or less, associating it with every single cell in the body. And we're all familiar with metabolism and how if your metabolism is slow, then you're going to have a really hard time losing weight and burning fat. Or if your metabolism is fast, you're going to burn fat a lot faster.\n\nWell, when you look at that, you want to understand a little bit more about the thyroid. So, a lot of people always say \"What is the thyroid,\" you know? The thyroid, if you look up here in your neck, right at the base of your neck is a small gland. And that produces metabolic hormones. These hormones are what controls your energy levels.\n\nThe thyroid is controlled by your pituitary gland. Your pituitary gland also regulates hormone, testosterone, growth hormone, DHEA. Your pituitary gland is a major gland, just like your pineal gland is. And also, those glands are affected with specific antagonists or chlorine, fluoride. Fluoride, especially, which calcifies the pineal gland and also prevents iodine from being absorbed into the actual thyroid gland.\n\nBut the pituitary gland actually releases thyroid-stimulating hormone, which is TSH. And that tells the thyroid gland to produce thyroxine, which is T4 or T3. And that's just thyroid hormone with four iodine molecules or thyroid hormone with three iodine molecules. So, iodine is the base molecule of thyroid hormone and the thyroid uses iodine to produce it.\n\nBut what happens is nowadays, with so much hypothyroidism going around and people are diagnosed with hypothyroid. They're put on Synthroid, etc. Synthroid is basically T4. And Synthroid T4 is inactive. When it's released, it's inactive. Actually, 80 percent of the T4 is activated by the liver, the gallbladder, the bile ducts and actually the kidney itself. That's why it's necessary for the liver and gallbladder to be functioning properly.\n\nBecause if you're on Synthroid and you can't covert that T4 and you can't activate that T4 because your liver is congested, it's fatty or your gallbladder is gone or your gallbladder is congested or you have gallstones, the bile ducts are messed up. Then, it's going to be hard for you to activate that T4. And you might think you're doing good; you might think that you're taking this Synthroid and everything else and you're still not getting results.\n\nLike I said, 80 percent is going to be converted in the liver, in the gallbladder and the bile ducts. And then, you have 20 percent of your T4 that's going to be converted in the kidneys.\n\nNow, a lot of times, people are deficient in salt, too. Because, really, the body is made of 80 percent, 90 percent water. All living substances are composed of 80 to 90 percent water. And really, the inside of our body is nothing more than saltwater.\n\nSo, if your kidneys aren't working properly and you have a real acidic pH and you're having concern, then you might also have a concern converting or utilizing that T4 and get that conversion in the kidneys.\n\nAnother mineral that's really important to look at, while I'm thinking about it, is selenium. Because selenium is also necessary to convert T4 to T3. So, it's important that you supplement or get enough selenium in your food. Or if not, if you are taking an iodine supplement to supplement with selenium.\n\nIodine is great to take with minerals. You really want a good array of minerals and pure, clean water when you take iodine. Just like seaweed. Kelp supplies iodine. And what does kelp grow in? It grows in seawater. So, it's a perfect example of how nature simulates what's really going on inside your body.\n\nSo, just to talk about some health benefits of iodine. Mental retardation, low IQ levels is one of the main things in children that you look at. And mothers should get two to three times the amount of iodine during pregnancy. And this is a huge concern. So, if you know somebody that's pregnant or even trying to get pregnant, I highly recommend that you put them on a good form of iodine, because it affects the fetal brain development and it affects emotional health and many other things.\n\nOne of the things I like using iodine for is the fact that it helps detoxify toxic metals. And it makes water more soluble. It helps eliminate toxic metals like mercury, lead and then, of course, it also helps decalcify the pineal of fluoride and it also helps detoxify other metals and detoxify the built-up fluoride and bromide from the thyroid gland.\n\nSo, usually, what's been reported is about 12.5 to 50 milligrams of iodine will increase the urinary excretion of lead and mercury. And usually, that happens even within 24 hours. But when you're pulling metals out of the body, you want to make sure that you're very hydrated. And even when you do take iodine, initially, you might even go through a healing crisis. And a healing crisis is just headache and fatigue and everything. Just what your body starts to slowly eliminate all those toxins.\n\nAnother benefit of iodine is it's a co-factor for insulin. So, we're not talking about curing diabetes or anything like that by giving somebody insulin, but is something that every diabetic person should take a look at. And whenever diabetics make good lifestyle changes and get enough iodine, well, most of the time, their insulin functions better.\n\nAnother thing that people really don't know about the benefits of iodine is the fact that it is powerful against harmful organisms. I personally take it; I barely ever get sick, but my kids sometimes go to school. They're around a bunch of vaccinated children, they're always coming down with something. The conditions over there, the air quality is bad. All of that stuff.\n\nTo this day, there's no bacteria virus, any type of microorganism that can survive or adapt to being in an iodine-rich environment. So, it does help to protect yourself, your immune system from invading microorganisms.\n\nAnd this another trick that my wife loves to do, is iodine is incredibly good for anti-aging and the skin. If you just take some good iodine, nascent iodine, and glycerin-based. I wouldn't do this with alcohol because alcohol is very dehydrating to the skin.\n\nBut glycerin in itself, vegetable glycerin. I'm not talking about animal products, but a good USP-certified vegetable glycerin with the iodine with it, like the Detoxadine that we developed. And you take a small amount and you rub it under your eyes, over here by your crow's feet. You rub it on your face, any part of your skin.\n\nAnd it takes a while because your skin is seven layers deep and you're going to have to slowly start repairing it. But if you do it for a long period of time, we've seen dramatic results. Even better than the $500 facial toxic chemical-based facial anti-aging creams that are out there, which are nothing more than plasticizers and everything else. They just fill in the wrinkles and make you think that you're looking younger, but it's actually causing cancer because of the toxic chemicals in that and sunscreens as well.\n\nSo, it's great for skincare, I would highly recommend it. Cuts, burns, stuff like that, it's a great antiseptic. So, you just can't go wrong with that.\n\nAnother benefit of iodine is the fact that it helps to elevate the pH in the body. Not only myself, but if you're watching this, you know something about natural medicine. And you've probably searched all over the Web, you've educated yourself. You know about the acid alkaline balance in the body. You know that when the body becomes acid, that's when disease starts to form.\n\nYou know that when you eat live, raw, good foods, that your body becomes alkaline. In an alkaline environment, you're able to resist disease more. Iodine actually helps raise the pH of the body, which is another great benefit.\n\nWe touched on it for women's health, but it's extremely important because when I was seeing patients and we have people that call all the time. Mostly women, because women pay way more attention to their health most of the time than men do. It's a humongous concern that women are suffering from polycystic ovary syndrome, PCOS, fibrocystic breast disease, fibromyalgia, uterine fibroids. Any type of cysts in these fibroids.\n\nThe ovaries actually have the second-highest concentration of iodine in a woman's body. When they're deficient, cysts form. So, basically, if there's no iodine in the thyroid; if it's saturated with fluoride, you're not taking iodine in through the body. Then, cysts form in the ovaries and especially around your menstrual cycles. For the ladies that are listening, if your breasts become tender, that's a sign that you have iodine deficiency.\n\nCold hands, cold feet, low body temperature. If you're always cold, that's another sign. Puffiness around the eyes is another sign. A tongue, when your tongue feels like it's too big for your mouth and you have difficulty talking, that's another sign of iodine deficiency.\n\nBrain fog, low energy in the afternoon, all of these things. We'll go into some more symptoms that you can look for to see if you have an iodine deficiency.\n\nBut breast tissue is also a huge sponge for iodine and iodine is concentrated in the breasts. There was research I wanted to take note of... From 1993, it was recommended that women take 3,000 to 4,000 micrograms a day to promote healthy breasts.\n\nNow, that's a huge difference considering the fact that the RDA; our trusted FDA and U.S. government who gets everything right, actually says that we require 150 micrograms per day of iodine. That is extremely low level.\n\nHow they came up with that number was, they looked at when they added iodine to make iodized salt... what was the minimum amount of iodine that would prevent a goiter from forming. And that was 150 micrograms a day.\n\nPersonally, now, especially with Fukushima, especially with the chem trails, especially with all the stuff that's coming down on top of us. The radiation from Fukushima. The radioactive iodine 131. We have to protect and saturate our thyroid even more.\n\nSo, if a woman's thyroid or if a men's thyroid is iodine deficient, her breasts, her ovaries; everything is going to be deficient. And it's no surprise that the medical literature has found correlation between thyroid disease and breast disease and sub-par thyroid function. And even a leading cause of breast cancer.\n\nWhat really upsets me is the fact that everybody is going on these walks for breast cancer and all this stuff and donating all this money. When they're not addressing the root cause of these concerns, all they're doing is putting a Band-Aid on the symptoms. And hopefully, you've taken the time and effort to read my book \"The Green Body Cleanse,\" because that's going to tell you about the root cause of all disease instead of just the symptoms of disease.\n\nSo, another thing iodine deficiency can affect is the structure and the function of the breast tissue. You know if you're breastfeeding, it can also alter that. And the fact that the cystic breasts end up being very painful.\n\nAnd, actually, there has even been correlation that cystic breasts may even lead to breast cancer. There was a study in 1967 by the Journal of American Medical Association that found breast cancer in mice was linked to iodine deficiency. The National Health and Nutrition Survey from 1971 to 2000 showed iodine levels had dropped 50 percent from 1971 to the year 2000.\n\nThink about this: how many thyroid disorders, how much breast cancer, how much prostate cancer, ovarian cancer? All of that has increased since iodine has been taken out of everything and bromine has been replaced into it.\n\nThe fact is, there's no more iodine in the soil. I have this argument with people, they're like \"Will I get iodine through the food I eat?\" \"No, you do not. You are deficient in iodine.\" The whole world is pretty much deficient in iodine unless you live right next to the ocean and you eat seafood all day.\n\nSo, there was a research that took place between 1975 and 1989. 1,300 patients were examined with breast pathology and found that iodine improved 40 to 70 percent of pain fibrosis symptoms.\n\nThere was another in 1995 where it was observed that histological changes in breast tissue reversed with iodine. And 1996, rat studies demonstrated that iodine suppresses the formation of breast tumors.\n\n1996, \"Breasts have a relatively large capacity for iodine uptake.\" In, 1997, \"An incorporation into tissues occurs in the same ductal epithelium as the majority of breast cancers.\" \"Over 60 percent of women may experience fibrocystic changes. These changes may respond to 3 to 4 milligrams a day of iodine taken for three to four months.\"\n\nHow expensive is iodine? Not nearly as expensive as having breast cancer, that's for sure.\n\nHow can we ignore how vital and how important iodine is for pregnant and nursing women, too? If you're a woman, if you're pregnant, you should get two to three or four times the amount of iodine than you do when you're not pregnant.\n\nIodine deficiency has been directly associated with miscarriages, stillbirth, pre-term delivery, cognitive concerns. It can impair fetal brain development. Even mild iodine deficiency during pregnancy can be detrimental.\n\nSo, iodine deficiency just is affecting everyone. In 1990, the World Health Organization estimated a third of the world population is iodine deficient. And that situation hasn't even improved. That was in 1990. I think that, right now, we're looking at 75 percent, at least, of the world's population is iodine-deficient.\n\nA National Health and Nutrition Examination Survey, a massive survey that examines current health trends; the first study in the early '70s found that 2.5 percent of citizens were iodine-deficient. Now, 75 percent, off the charts.\n\nThe Journal of Clinical Endocrinology and Metabolism warned that these numbers extreme iodine deficiency and doesn't include mild deficiencies. And the reason why I'm actually looking and giving you these real studies is so you don't think I'm just making this up. Because a lot of people will look at videos sometimes and they'll be like \"Oh, yeah. He's just saying a bunch of stuff, he's just making it up.\"\n\nBut I wanted to actually have these studies on there. And I will post all these studies, too, to the followup to this webinar. So, everybody can actually see and read and they can go track it back themselves, because it doesn't take a rocket scientist to figure out how easy it is to heal the body just by cleansing it and giving the body what it wants.\n\nIt's just like the medical profession that tells you; it's just like high cholesterol, heart disease, all that stuff. Every single thing that you look at; it doesn't matter what degenerative disease that you have, it's all caused by too many toxins coming in and not enough toxins coming out.\n\nThere are a couple of things, though, that I do want to talk about that will kind of affect and block small amounts of iodine. It's not something serious, but if you are taking iodine, you want to watch out for eating a lot of cruciferous vegetables like cabbage and kale. Those do have goitrogenic compounds and that can block small amounts of iodine. It's probably not the biggest concern. But you do want to look out for that.\n\nAnother great, easy and inexpensive remedy, just like iodine is distilled water with organic, raw apple cider vinegar. And raw apple cider vinegar, I always put it in my water because it contains the mother of vinegar and enzymes. It's great; you get used to the taste and it's great for the body. It just enhances the water.\n\nSo, some other endocrine gland disruptors... Pesticides, herbicides, such a big concern. Because most of the food these days is heavily sprayed, you have a genetically modified situation. Then you have Roundup, which is Glyphosate, which is an extremely toxic chemical. These are all sprayed on crops.\n\nNow, what happens is your endocrine glands or your hormone-producing glands are exposed to these pesticides and these chemicals. And that also causes an iodine deficiency and it also causes the initiation of disease-causing compounds, they're endocrine disruptors.\n\nYou have soy, which has high estrogen in it. And so, a lot of these disruptors cause a malfunction in your hormones. That's what we're talking about, really, here is with a lack of iodine, you're talking about disruption of hormones.\n\nNow, a couple other things that can affect iodine absorption and utilization: antidepressants. Did you know that most antidepressants and antipsychotics out there are fluoride compounds? I mean, fluoride is coming at us from every single direction and there's a reason for that, too. Because there's no money in healthy people, there's only money in sick people.\n\nBeta blockers, birth control pills, estrogen mimickers, antidepressants are those you want to look at. If you're on any of those things, mostly, for sure, you're blocking your iodine uptake. We talked about bromine, toxic halides. We talked about chlorine, we talked about fluorine. Those have a similar structure to iodine and they compete for the receptor sites.\n\nSo, if there's fluoride going around in the bloodstream by your thyroid, whoop. It's going to take it in and it's going to be stuck right there because it's almost exactly the same as iodine is. How do you get that fluoride out? You don't. Iodine will actually draw some of that out. It could take a month, two months or whatever, even longer, to bring all of that bromide and that fluoride out of your system and start replacing your thyroid with healthy iodine.\n\nThere's a lot of iodine supplements out there, too, that are in an alcohol base. But an alcohol-based iodine is an endocrine disruptor and a hormone disruptor, too. Because alcohol, itself, is an endocrine disruptor. And I'm going to talk to you about that a little bit later on, as well.\n\nYou're going to find in bromine in all of your breads. You're going to find bromine in the sodas; Mountain Dew, stuff like that. You're going to find it in a lot of processed, packaged foods that are going to have bromine in there. Because it's a natural insecticide agent and they put it in flour to keep the bugs out of it. So, you want to make sure that you switch to all organic products; organic flours, organic breads, although I do recommend non-grains and non-GMO. And try to learn more about or just read the labels and see if it has bromine in it.\n\nChlorine... It's in the tap water, it's in all of our systems. Pools. They don't have to use that. There's way to keep the water clean without poisoning it.\n\nSo, I mean, we're just saturated with these and chlorine and the by-products, these are all these halogens, these toxic halogens, are directly linked to birth defects, cancer, reproductive concerns, sterility. Why do you think so many people are having problems getting pregnant these days?\n\nI never had a concern with people coming into my office that had been to all the top specialists in the world saying \"Oh, you have to do IVF and all this stuff to get pregnant.\" No, you don't. All you have to do is clean out your body. I put them on an intestinal cleanse, liver and gallbladder cleansing, chemical and toxic metal cleansing, harmful organism cleansing.\n\nNext thing you know, their body is clean. They get rid of all these chemicals that they're exposed to outside. On the inside, they're home and they're pregnant. And guess what? They have a healthy baby, too, because they don't have all of that contaminant in there.\n\nBut perchlorate is another thing that we're finding in breast milk right now, which is an endocrine disruptor. And that's an industrial chemical and it's used in rocket fuel, airbags, fireworks. It's contaminated areas around military bases and it's now in the food supply.\n\nI was in the military and my heart goes out to the military personnel that are being contaminated, especially overseas and all the chemicals they're exposed to. I try to help them as much as I can whenever they call me up.\n\nOne of the things that most people don't know is 83 percent. 83 percent of organically-grown lettuce and conventional lettuce from the southwest United States contains significant perchlorate. So, that means you could be getting organic lettuce and you're going to be contaminated.\n\nThe entire lower portion of the Colorado River is contaminated with perchlorate. The Colorado River, the whole lower portion provides water for 20 percent of the nation's crops and over 10 percent of the nation's livestock. 90 percent of the U.S. winter lettuce supply is grown in areas irrigated by this river. And is grown in perchlorate-rich soil. Which means you think you're eating organic, but you're really not.\n\nSo, for the water, there's a couple of solutions you can do. If you have the money, I don't have any ties to any of these companies by the way. Pelican water system is pretty good to have for the whole house and you can put it in. It's probably going to be somewhere around $10,000, but you don't even have to start with that. You can look online for fluoride under-sink units, filtration units, shower head units that are going to take the chlorine and the fluoride and all this stuff out. And those are just the solutions that you can do to reduce your exposure to it on a daily basis.\n\nAnd do not drink tap water. I mean, when you go to restaurants, it might cost you a little bit more money, but just buy the spring water in a glass bottle. Do what I do, get distilled water. You can make your own distilled water. You can make five gallons of distilled water a day with a Durastill counter-top distillation unit. You get the glass five-gallon things.\n\nThat's what we have, that's what all the employees here at the office drink, distilled water. We all put apple cider vinegar in it and we don't have any chlorine, we don't have any fluoride in the water and we have all the healthy nutrients in there.\n\nLike I was saying earlier, until the early 1970s, even bread contained iodine. And then, for strange reasons which we don't know about, all of a sudden, bromide replaced iodine. Who knows? I don't know why. But bromine is a toxic substance and has zero nutritional value. Dr. Brownstein, he's like the guru on iodine.\n\nI recommend you read his books if you have a chance. He tested thousands and thousands of patients for iodine deficiency and he tested them for bromide, too. Every single one of them tested for high bromide levels. Bromine, in itself, can cause hypothyroidism.\n\nWhenever the bromine was introduced into the food supply and into the sodas and the soft drinks and all that stuff, the increase in hypothyroidism shot up. And one of the most toxic pesticides, actually, is methylbromide. And then, you have polybrominated biphenyl ether compounds, which are your fire retardants.\n\nNow, isn't it strange how the European Union has banned most of this stuff, but the United States still keeps it in the water supplies. I mean, the EU has banned fluoride, it's banned a lot of the bromine, it's banned a lot of these toxic chemicals. You start seeing all the genetically-modified foods being banned everywhere.\n\nPeople here in the United States have to wake up and actually do something about it. People are waking up, actually, it's really good. But I mean, the public water supplies and the toothpaste and they even have nursery water to give kids fluoride. I mean, people are mixing their baby waters; there's medical doctors and pediatricians that are recommending people mix nursery water, which contains fluoride, in with soy baby formulas.\n\nFluoridated water never prevented cavities. The largest fluoridated water study took place in the 1980s and it involved 39,000 children. And it was determined that cities with fluoridated water had no difference in tooth decay from the cities that didn't.\n\nThere is tons of research out there that proves fluoride is damaging and it that it never did anything. And the best way to avoid fluoride is just avoid all the dental products. Don't even have those in your house, don't shower in the water. But the good news is iodine can help you detoxify those halides and protect yourselves from the damage of fluoride and all those other compounds.\n\nSo, we knew that iodine deficiency really had the cause for goiters. And we really tried, in the 1920s, to determine how much iodine was required and that's what I was talking about with the goiter belt, right around Akron, Ohio. And with the girls that were given potassium iodide... the other girls that were given none... and from that researchers concluded that 150 micrograms of iodine a day was necessary to prevent the goiter.\n\nThat is the bare minimum to prevent severe iodine deficiency. With the research that we've been doing and with all the information that we have on there, we know that, like I said, every cell in the body requires iodine. It's necessary to address. And there hasn't really been any studies out there that suggest what level of iodine is actually toxic to you.\n\nBut we do know this. I thought I was going to talk about some of the symptoms of iodine deficiency. Number one, you might start feeling little nodules on your thyroid. That might be the beginning signs of a goiter forming.\n\nMental imbalances. If you have brain fog, if you're starting to feel depressed for no reason at all. All of a sudden, you go from being calm to having anxiety, panic attacks. You have hypothyroidism or you've been diagnosed with hypothyroidism.\n\nFatigue. Fatigue is one of the biggest things of iodine deficiency. Usually around 2:00 or 3:00 in the afternoon. Weakness. You might be starting to become weak, I was talking about the tongue earlier, the cold hands and feet, the dry skin. Insomnia, if you're having concerns sleeping at night.\n\nHair loss, if you're starting to see hair loss, that could be a sign of iodine deficiency. Fibrocystic breasts, ovary cysts. We talked about depression. Immune system concerns. If you feel like you're getting sick a lot and you're not getting better.\n\nSlow metabolism. Everybody has a hard time losing weight. If you're just trying different things and you can't seem to lose weight, most likely, you might have an iodine deficiency.\n\nEspecially, it affects your mind. You might think of something and then you forget. And then, you're still trying to think about it and you're just having a hard time. You have those forgetful moments.\n\nI get the question \"Can you take too much iodine?\" And what happens, it just really depends. There's certain tests out there that you can do. One of them is the iodine loading test. Your endocrinologist can do that for you, your natural healthcare practitioner can do that for you.\n\nIf they don't know who to send you to or don't know how to do the testing, then there's plenty of people online or you can find or call some different ones. And basically, you take no vitamins for four days. You urinate in a cup, then you take 50 milligrams of iodine. You capture the urine for the next 24 hours to see how much iodine is excreted and how much your body is absorbing.\n\nIf you put 50 in and 40 comes out, you're probably saturated. You have a good iodine if you put 50 in and 5 comes out, that's usually what happens with most people. You're severely deficient.\n\nRight now, like I said, I just believe that everybody can use iodine. I haven't had any situation where someone has taken... I actually had a mother call me the other day with a four-year-old. She walked into the kitchen and she saw the whole bottle, 1 ounce of Detoxadine, which is the product that we manufacture, sitting next to her four-year-old son empty on the floor.\n\nNow, I have kids and I'm sure a lot of you guys have kids out there, too. That would be pretty shocking for me, if I was taking an iodine supplement or something else and I walked into the kitchen and I saw my son sitting on the floor with a whole empty bottle next to him.\n\nBut the good news is, nothing happened to the son. He probably just saturated his thyroid with iodine. He was probably iodine-deficient anyway.\n\nBut it just goes to show you that anything else, if that would have been anything else. You can take anything from a drug store. And if you take half a bottle of aspirin; if you take half a bottle of any over-the-counter thing and you will die, you know? So, iodine is extremely safe and usually, your body will excrete any of the leftovers that you might have.\n\nThere's natural foods that are also really rich in iodine. And right now, with the Pacific Ocean being contaminated; the Atlantic is the best. If you can find seaweed from the Atlantic Ocean, that's going to be a good source of iodine. Kelp, arame, kombu, wakame.\n\nSeaweed, a quarter-ounce of dried seaweed is about 4,500 micrograms. There's really not that many sources of iodine. Although, I do also recommend Himalayan crystal salt.\n\nAnd it's good for you. Like I said, it contains 84 different minerals. There are a lot of different types of iodine supplements on the market. We get that question all the time. \"What's the best type of iodine to take?\" There's so many of them out there. There's colloidal iodide, there's colloidal iodine, there's Lugol's. There's super-saturated potassium iodide, there's the nascent iodine.\n\nBecause of that, it led me to do in research into what is the best form of iodine. And I'm going to go over some of those things in a little while with you in the benefits and why I recommend taking an iodine in a glycerin base.\n\nBut it's also important to take a look at your body and your diet, in general. We talked about avoiding soy, avoiding gluten, avoiding trans fats, junk foods, refined sugars. Just switch over to an organic diet.\n\nYes, we're finding high levels of toxins and chemicals and stuff in organic food because we know the air is polluted and the water is polluted. Under the National Organic Program, by the way, you can water your crops with tap water or water from rivers, like they do the Colorado River.\n\nOn our farm, we have pure, clean spring water that we use to water our herbs and everything with. But it just goes to show you that it can be organic and it can be watered with tap water and still be organic.\n\nSo, what I wanted to go over now with you is just some of the differences because there's different companies out there that are saying different things about iodine and theirs is the best and it's in an alcohol base and it's better than glycerin and alcohol holds more iodine.\n\nAnd basically, what it boils down to, and I actually wrote an article about vegetable glycerin iodine versus alcohol-based iodine. Here's the thing, for absorption purposes, alcohol has a drying and puckering effect that negatively affects the absorption. Glycerin, on the other hand, is completely opposite. It's a humectant and it moisturizes and hydrates to promote iodine absorption.\n\nGlycerin, actually when you put it in the mouth, triggers salivation to supply the necessary enzymes for absorption. Alcohol doesn't. Alcohol actually dries up the saliva in the mouth and so, it's detrimental.\n\nAs a preservative, glycerin and alcohol, they have different preservation mechanisms. Glycerin gently encapsulates the substance into its molecular matrix and it preserves the characteristics of it.\n\nAlcohol has a harsh de-naturing action and it actually alters cell structure and renders vitamins, enzymes, and other beneficial constituents inert or not even any good. And anybody will tell you, alcohol is dangerous. We talked about it being an endocrine disruptor in itself.\n\nAlcohol has a long history of being a solvent. Mostly because it has such a low cost and a lot of people have used alcohol to make tinctures. However, glycerin and again, I'm talking about vegetable glycerin, is a natural, nontoxic food substance that extracts more constituents than grain alcohol.\n\nFor example, if you were to do an extraction of an herb or iodine or whatever in glycerin and do it the right way, you would be able to extract probably close to 70, 80, even up to 90 percent of the constituents of that herb. If you were to do that herb in an alcohol extraction, you're going to be only extracting 40 percent of the herb's materials.\n\nNow, for me, I would want all that stuff working in unison. It's the same way with the iodine. It's not easy. You can't just put iodine crystals in glycerin because that can be extremely dangerous.\n\nWe literally spent hundreds of thousands of dollars to create this production of even using some of the top physicists to be able to stabilize the iodine compounds into the matrix of the glycerin to where they're released, the free iodine is released whenever it comes in contact. A true nascent form or atomic form instead of the diatomic form which makes it more easily accessible and absorbed into the body. Glycerin is actually one of the most hungry iodine compounds in existence and it's the solvent of choice for whoever demands it the most.\n\nAnother thing, it's got better micro-encapsulating properties. \"Alcohol is a harsh and rigid solvent that disrupts cell membranes in DNA.\" \"Glycerin has unparalleled micro-encapsulating qualities that fully capture complete constituents and compounds in its matrix. This reduces ingredient inversion, evaporation.\" Alcohol evaporates, glycerin doesn't. \"Precipitation and it slows redox reaction.\"\n\nNow, this is big because personally, I don't want my kids having alcohol. Or my pets, for that matter. Alcohol is an intoxicant and is not appropriate for children.\n\nFunctionally, glycerin is far more gentle and safe. And my kids take the iodine and the glycerin and they do great on it. Actually, it improves their brain function and since I started giving them iodine, they've actually become smarter, retained more, have a better memory. I honestly think that my kids were iodine deficient, too.\n\nVegetable glycerin has a good taste to it. Alcohol has a horrible taste if it's in an iodine product. It burns your mouth, it turns your tongue purple. It is very harsh to take.\n\nAnother thing is that vegetable glycerin iodine is better for people who want to maintain balanced blood sugar levels. Glycerin converts to sugar very slowly and doesn't cause blood sugar spikes.\n\nThe alcohol-based iodine is prone to evaporation, sublimation, oxidation. And studies have demonstrated that this effect can happen as early as six months after production.\n\nI'm not sitting here saying \"Buy my product. Blah, blah, blah. Iodine is bad in alcohol,\" whatever. Iodine is great. If you have access to iodine no matter what, it's going to be better if you take it in whatever form it's in. Except for the raw form, of course, because that's extremely dangerous. But any form of nascent iodine is going to be fairly good for your body. I'm just giving you the pros and the cons between alcohol-based and vegetable glycerin-based and vegetable glycerin-based preserves the stable atomic bond longer and it doesn't break down and change over time.\n\nAlcohol iodine can contain ethanol. Grain alcohol, which can be made from corn, which can be genetically modified. It's the same alcohol in alcoholic beverages. Alcohol is toxic to the liver and can be problematic for children. Vegetable glycerin, safe for everybody.\n\nI was talking about pets, too, and how safe it is for pets. Let me tell you, pets are coming down with hypothyroidism. They're coming down with the same degenerative diseases that we are because people are feeding their pets the wrong foods.\n\nThey're feeding their pets all the toxic meat and everything else. And if you just type in \"Hypothyroidism in dogs,\" \"Hypothyroidism in cats,\" \"Hyperthyroidism,\" most of it is due to an iodine deficiency.\n\nIf you have pets and that's the concern, iodine can be a good solution for you. Just make sure you take it in a vegetable glycerin form.\n\nAlso, iodine and glycerin is used, actually glycerin's use itself dates back as far as the 1800s. When it was used to keep wounds hydrated, but free from air contact. And the Russians were known to spread a thin layer of glycerin on their face to protect their skin against the cold when they went out in the winter because it wouldn't evaporate. It's so gentle and hydrating, that it's even been used during eye surgery to keep the eyes moisturized.\n\nSo, I know we're running out of time here. It's 8:53, we have a few more minutes. I hope that I've been able to cover a lot of the information about iodine. A little bit of the history, a little bit of the uses of it. I didn't cover the fact that, just kind of looking at my list, phthalates and plastics, the BPA plastics have a big role to play. So, try to avoid any plastics or phthalates or cooking food in plastic containers, storing it in plastic containers during the week.\n\nWe are getting a lot of questions, so what I'm going to do is I would appreciate any additional feedback. Follow us on Facebook, go to my blog. We will post on this blog post and probably on Facebook, a list of questions and some of the answers that you guys are writing in.\n\nLet me just see if I can take a couple good ones here. One of them is \"My son has hypothyroid since he was four, now 16. He's on Synthroid. Will nascent iodine help him get off the pill?\"\n\nUnfortunately, I can't give medical advice. But from the feedback that we've had through Dr. Brownstein's patients, the research out there, I would definitely recommend that you go and type in \"Iodine for hyperthyroidism.\" \"Iodine for hypothyroidism.\" There's plenty of information out there. Let me just say this. Iodine pretty much helps with anything.\n\nOne good question, though. \"How soon after taking iodine does a person begin to feel the detox symptoms of fatigue?\" That's going to be different for everybody. It depends on your age, your weight.\n\nWe've had people that have taken iodine that were severely deficient, but actually felt worse for two weeks. They were just detoxing, I mean, all that stuff was coming out of their system. We just recommend you drink tons of water, avoid tap water, of course. Let your body detox naturally, do an intestinal cleanse using oxygen. Do a liver and gallbladder cleansing.\n\nAssist your body in its ability to eliminate toxins. But over a period of two weeks or so, like I said, it just depends. But you will be feeling better eventually. And usually, the first thing that people notice is they notice their energy levels. They wake up with so much energy and as a matter of fact, I've even had to tell people not to take iodine at night because it increases your energy so much that you might even have concerns sleeping or going to bed.\n\nI've had people that have written in and said that they want to go out with their friends. And their friends are going out to clubs til 2:00 in the morning and they don't want to drink, so they take a shot. They take some B12 and they take some iodine. It just keeps them up and gives them the energy to stay up til 2:00 in the morning without having to take any stimulants or do anything like that.\n\nSomebody asked the question on how much apple cider vinegar do I put in my water per cup? I just take the bottle and pour it in. But you start with, let's say 8 ounces and a capful. I actually have my vinegar right here. I use Bragg's apple cider vinegar with the mother in there. I keep it right next to my desk. And now, I'll just fill up my whole cup with water and just pour a little bit in there.\n\nBut if you take a gallon of distilled water, probably a tablespoon to start per gallon. But then, you can work up as high as two tablespoons. And you know, just work it up to taste. I mean, apple cider vinegar does incredible things. There's over 100 documented health benefits for organic apple cider vinegar, so I highly recommend it.\n\nOne of the cheapest and most effective things you can do for your help is what we're talking about right now, iodine and organic apple cider vinegar. Of course, I recommend cleansing the body on a regular basis, too.\n\nOne question \"Is alcohol-nascent iodine more potent than a vegetable glycerin nascent iodine?\" That just depends on how much iodine is used during the manufacturing process. Doing tests with iodine and alcohol versus iodine and glycerin, we've been able to stabilize up to 7 percent glycerin, I mean, iodine in glycerin. There's no possible way you can do that with alcohol.\n\nSo, glycerin will hold probably five, six times the amount of iodine than alcohol. And as a matter of fact, we're going to actually be coming out with a stronger version fairly soon, which will provide roughly around 650 micrograms per drop of iodine. So, that's going to be very effective. Especially when you're talking about going with higher servings, because most of the iodine supplements out there, 450 micrograms per drop, 500 micrograms per drop.\n\nBut we're talking about 25,000 to 35,000 micrograms on a daily basis. And it's like everything, I always recommend cycling everything. I don't like to put stuff in my body every single day so the body gets used to it. I usually do it every other day.\n\nFor the first period of time, I would recommend going for a month, let's say, of 30, 40 milligrams a day, 30,000 to 40,000 micrograms a day. But after that, just taking a few drops, a dropper full a few times a week should be sufficient, as long as you're not taking in massive amounts of chemicals and toxins and stuff like that.\n\nSo, anyway. I just wanted to thank everybody for coming on. I hope you enjoyed the webinar tonight. And if you have any further questions, like I said, don't hesitate to e-mail us. E-mail us at [email protected]\n\nEverybody have a wonderful evening and until next time, if you want to see another webinar on another topic, please let us know. Otherwise, be safe, be healthy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Everything You Need To Know About Iodine Webinar by Dr. Edward F. Group", "description": "Want to learn everything about iodine? Watch this webinar, \"Everything You Need To Know About Iodine\"", "url": "https://explore.globalhealing.com/free-iodine-webinar/", "site_name": "Dr. Group's Healthy Living Articles", "article:publisher": "https://www.facebook.com/GlobalHealingCenter", "article:published_time": "2014-02-06T22:15:26+00:00", "article:modified_time": "2022-01-25T20:58:11+00:00", "image": "https://explore.globalhealing.com/wp-content/uploads/2016/12/Iodine-fb.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection"], "authors": ["", "Dr. Edward Group, DC"], "publish_date": "2014-02-06T22:15:26+00:00"}