{"result_id": "134048", "URL": "https://www.globalresearch.ca/urgent-warning-covid-19-vaccine-related-deaths-elderly-care-homes/5736791", "timestamp": "2023-04-25 15:17:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/urgent-warning-covid-19-vaccine-related-deaths-elderly-care-homes/5736791", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Urgent Warning on COVID-19 Vaccine-related Deaths in the Elderly and Care Homes", "cleaned_text": "In this letter we draw to your attention the mounting evidence that the public health risks we identified may be materialising.\n\nWe now call for an immediate and urgent audit of deaths that have occurred since the beginning of the Covid-19 vaccine rollout, to ascertain if Covid-19 vaccines (in general or any one brand in particular) are leading to an increased number of deaths (Covid-19 and non-Covid-19 related), Covid- 19 cases or increased risk of death in certain age groups or cohorts.\n\nAmong our concerns in our previous Open Letter, we raised the potential issues of: 1. Antibody Dependent Enhancement (ADE) induced by the vaccines causing more severe Covid-19, with increased hospitalisations and deaths in the weeks or months after vaccinations. 2. The lack of safety data on elderly people with multiple comorbidities. This cohort was under represented and a statistically insignificant group in the clinical vaccine trials . We postulated that there may be increased vaccine side-effects in this group, which would only become apparent when many thousands of them had received vaccinations. 3. The absence of any safety data regarding those who have already had Covid-19, and the possibility that prior immunity may lead to increased side-effects from the Covid-19 vaccines. Our particular concern is the impact of Covid-19 vaccines on the very elderly and those in care homes. ONS data shows that weekly care home deaths tripled in the two weeks between 8th and 22nd January 2021[ii], at a time when there was a massive increase in the rate of vaccinations of care home residents[iii] (Fig 1 and Fig 2). At the same time, the MHRA CEO, Dr June Raine, stated that Covid-19 vaccine adverse events reports were coming in “thick and fast”[vi] but there is no transparency around these reports, unlike in the US. The US government vaccine adverse event reporting system (VAERS) is open to the public and is already showing a high number of serious adverse events and deaths in the initial stages of the vaccine rollout, compared to previous vaccinesvii, particularly in the elderly. There are, however, public data showing a spike in care home deaths (Fig 3) which began very soon after mass vaccination began in this setting just before Christmas and appears to correlate with the increasing rollout of vaccines in this setting and age group. This followed a period of months of stability in the rate of mortality in these cohorts. As stated above, many the deaths from January 2021 have been in UK care homes. There are no robust data to indicate that the reported new variant, which appeared around this time, increases mortality or severe illness from Covid-19. It seems very plausible that the main or major causative factor could be the rollout of these experimental vaccines, to millions in this cohort, over a very short space of time. One possible explanation for a rise in infections or deaths could be the transient reduction in lymphocyte levels following vaccination seen in data from Pfizer’s Phase 1/2 Trial. The pronounced lowering of lymphocyte levels, especially in those who received the high dose, lasted about 7 days[viii] This could result in a heightened susceptibility to infections in the week post- vaccination, which could be catastrophic for some frail and elderly people. We are calling upon the UK Government and regulators to urgently investigate, and categorically rule out, the possibility of unanticipated negative effects of the Covid-19 vaccines in the frail and elderly before proceeding with the second doses to this group. We would like to draw your attention to three sources of information that signal the possibility of a significant problem with adverse reactions, leading to deaths and increased Covid-19 illness, in the cohorts who are being vaccinated first:\n• Media reports of care home outbreaks and deathsMultiple, similar, media reports from around the world show a pattern emerging of outbreaks of Covid-19 and clusters of deaths occurring in care homes in the week or two AFTER the vaccine has been rolled out to residents there. This pattern has been also reported by many whistle-blowers on social media.\n• Regulators, doctors and others are sounding the alarmStatements from national regulators and other official organisations, as well as doctors speaking out to raise serious concerns and to call for investigations to be carried out.\n• Epidemiological EvidenceThere is strong epidemiological evidence, from around the world, to support the hypothesis that the Covid-19 vaccine rollout may be linked with increased deaths in certain age groups. Each of these is a potential ‘red flag’ which we expand upon in more detail below. Since the Covid-19 vaccine has been rolled out, there has been a steady stream of national and international media reports concerning Covid-19 outbreaks, hospitalisations and deaths occurring in care homes around the world, within hours or days of vaccination. Whilst some authorities have sought to imply that these events are unconnected to the vaccine rollout, the emerging correlations are striking and deserve further investigation. The following list represents some of the media reports from the UK and overseas:\n• UK: Dozens of deaths of UK care home residents reported after first dose of Covid-19 vaccine[ix]\n• England: Basingstoke care home has serious Covid-19 outbreak with 60% of residents testing positive and 22 deaths around the time of Covid-19 vaccination of residents[x]\n• Scotland: Abercorn care home residents and staff received the Pfizer vaccine on 15 December and had significant Covid-19 outbreak by 10 January 2021[xi]\n• Scotland: Meallmore Lodge care home reports outbreak of 35 residents and staff following Covid-19 vaccination in early January[xii]\n• US: New York State – a care home reports major Covid-19 outbreak – 130 cases and 32 deaths, which started at the same time as the first vaccine dose was administered to residents and staff[xiii]\n• Germany: 10 deaths of frail, elderly people aged 79-93 years within four days of vaccination with Pfizer vaccine[xiv]\n• Germany: 11 deaths from 41 residents in care home die within days of receiving first dose of Covid-19 vaccine[xv]\n• Israel: Care home that has had zero Covid-19 throughout the pandemic has outbreak with 30 hospitalisations and 1 death within 2 weeks of first dose of Covid-19 vaccine rollout[xvi]\n• Sweden: Covid-19 Care Home outbreak affecting 10 residents and 5 staff members despite all having had 2 doses of Pfizer vaccine[xvii]\n• Canada: 7 care home residents develop Covid-19 following first dose of Pfizer vaccine[xviii]\n• Norway: 29 deaths of elderly people in care homes shortly after receiving Pfizer vaccine[xix] The Norwegian Medicines Regulators were quick to flag up a cluster of deaths occurring in care homes, linking 29 deaths to the first dose of the Pfizer vaccine. Norwegian officials listed fever, vomiting, and nausea as side effects which “may have led to the deaths of some frail patients”, and led them to update their advice regarding administration of Covid-19 vaccines to the frailest[xx]. The WHO GACVS COVID-19 Vaccine Safety subcommittee were apparently sufficiently concerned to convene a meeting on 22 January 2021, to review reports of deaths of very frail, elderly individuals vaccinated with the Pfizer COVID-19 vaccine, BNT162b2[xxi]. While they decided that there was not yet enough evidence to change their recommendations to vaccinate the elderly, they plan to continue to monitor the safety of the Covid-19 vaccines in this sub-population. The Israeli Supreme Helsinki Commission – in charge of supervising human trials in Israel – is expected to submit an opinion to the Israeli Health Ministry stating that the vaccine campaign led by the Israeli government together with Pfizer is fundamentally clinical research (human trials) and thus, needed to receive explicit Committee authorization[xxii]. The implication is that the UK (and all other countries) are also conducting a vaccine trial on the public, without their knowledge or informed consent. US doctor, Dr Hooman Noorchashm, wrote an open letter to the US Food and Drug Administration (FDA) and Pfizer[xxiii] on 26 January 2021, warning that if viral antigens (from current or recent exposure or Covid-19 illness) are present in the tissues of subjects who undergo vaccination, the antigen-specific immune response triggered by the vaccine could target those tissues and cause tissue inflammation and damage e.g. to the vascular endothelium, resulting in blood clot formation, with the potential for major thromboembolic complications, e.g. stroke, myocardial infarction or pulmonary embolism. This mechanism could explain some deaths being reported in care homes that we have highlighted. Dr Noorchashm’s recommended solution is to use antibody screening to exclude/delay vaccination in persons who might have been exposed to the virus and have viral antigens lingering in their tissues. Several countries have recorded a rise in deaths since they began their Covid-19 vaccine rollout. A comparison between those countries that have started vaccination programmes and those that have not, is striking. Below we present graphs of data from the UK, Ireland, Sweden, Israel, UAE, Bahrain, and Jordan. The graphs of Covid-19 mortality rates in different countries and Covid-19 vaccination rates show marked rising deaths rates commencing around the time the rollouts began which correlate with rate and number of vaccinations administered. The UK was one of the first countries in the world to begin the mass rollout of vaccines, starting slowly in the first week of December 2020 and increasing dramatically mid-late December. It is therefore striking to see such a sharp uptick in deaths starting shortly after this, correlating to vaccination rate (Fig 4), just at the time when overall mortality from Covid-19 had started to fall, having been stable through November and December 2020. Ireland shows a similar pattern. The number of weekly deaths was stable from mid-October to mid- December 2020 but increased five-fold in the last three weeks in January 2021, correlating with the number of vaccines being administered, which also increased five-fold in the first two weeks of January (Fig 5). It is striking to compare Covid-19 deaths in December and January in Sweden (red), which has yet to begin its vaccine rollout, with England (black) (Fig 6). Israel has the highest rate of Covid-19 vaccination in the world, with over 58 doses administered per 100 people since 20 December 2020, yet they are suffering their worst levels of Covid-19 cases and deaths since the pandemic began[xxiv], again the rise in these metrics corresponds in timescale with the number of vaccines given (Fig 7). It was reported that 17% of those patients hospitalised had already received their first Pfizer vaccine dose[xxv]. United Arab Emirates have also had a fast vaccine rollout, with nearly 35 doses per 100 people administered since 5 January 2021. They have experienced a significant surge in cases and deaths coinciding with the rollout[xxvi] (Fig 8). Bahrain began their Covid-19 vaccine programme around the end of December 2020 and have experienced a sharp spike in deaths from mid-January 2021 (Fig 9). Jordan is interesting as it has NOT begun its vaccine rollout yet and is NOT suffering the same second rise in deaths this winter that is being experienced by its neighbours Israel, Bahrain, and UAE. Instead, the death rate has steadily fallen from a peak in mid-November 2020, through December and January 2021 (Fig 10). It is a huge responsibility to rollout an experimental vaccine to millions of people in a short space of time. It is therefore imperative that any early warning signs of unexpected issues are heeded, to safeguard the public. We believe that there is compelling evidence that the vaccines could be causing Covid-19 illness and deaths (Covid-19 and non-Covid-19 related) in certain cohorts. We therefore demand an urgent audit and full investigation of all the deaths that have occurred since the vaccine rollout began on 8 December 2020, to be carried out by scientists that are independent to SAGE and the Government and overseen by an All-Party Committee. We would like to see the results published publicly, before any rollout of second vaccine doses to those who have received the first dose. Thank you for your consideration of our concerns. We look forward to hearing your response. Note to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {"locale": "en_US", "type": "article", "title": "Urgent Warning on COVID-19 Vaccine-related Deaths in the Elderly and Care Homes - Global Research", "description": "All Global Research articles can be read in 27 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version). *** Open Letter from the UK Medical Freedom Alliance to: Nadhim Zahawi – Minister for Covid-19 Vaccine Deployment Matt Hancock – Secretary of State for Health and Social Care …", "url": "https://www.globalresearch.ca/urgent-warning-covid-19-vaccine-related-deaths-elderly-care-homes/5736791", "site_name": "Global Research", "article:tag": "United Kingdom", "article:section": "English", "article:published_time": "2021-02-09T14:44:09+00:00", "article:modified_time": "2021-02-09T16:09:57+00:00", "updated_time": "2021-02-09T16:09:57+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2020/04/Ehret-930x520.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2020/04/Ehret-930x520.jpg", "image:width": "930", "image:height": "520"}, "tags": ["Europe", "Media Disinformation", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.08.12-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.08.52-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.13.50-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.14.50-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.15.25-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.16.27-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.17.10-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.17.41-PM.png", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Screen-Shot-2021-02-09-at-8.18.10-PM.png", "http://www.ukmedfreedom.org"], "authors": [], "publish_date": "2021-02-09T14:44:09+00:00"}