{"result_id": "134041", "URL": "https://www.globalresearch.ca/catastrophic-covid-19-vaccine-casualties-2021/5806072", "timestamp": "2023-04-25 15:17:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/catastrophic-covid-19-vaccine-casualties-2021/5806072", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Catastrophic COVID-19 Vaccine Casualties in 2021", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nSeveral sources of data emerged in 2021 pointing to a biopharmaceutical public health disaster with the COVID-19 vaccine campaign.\n\nPfizer recorded 1223 deaths occurring shortly after administration of their product within the first 90 days of use starting December 10, 2020. Pantazatos and Seligmann reported an excess in all-cause mortality from vaccine administration and US census data during 2021 between 146k and 187k, with a midpoint of 166k deaths.\n\nBy the end of December, 2021, the CDC VAERS system had reported ~8K with an under-reporting factor of 30, the casualty estimate from that source was 240k. In a recent paper published in BMC Infectious Diseases, Dr. Mark Skidmore used a valid representative survey to learn from population reporting. A total of 22% knew of someone who was seriously injured by the vaccine and the estimate based upon deaths attributed to the vaccine by respondents was 278K deaths.\n\nSkidmore, M. The role of social circle COVID-19 illness and vaccination experiences in COVID-19 vaccination decisions: an online survey of the United States population. BMC Infect Dis 23, 51 (2023). https://doi.org/10.1186/s12879-023-07998-3\n\nIn the Skidmore analysis, the average age of death reported was 48 years. This paper is important since it triangulates with two other sources for the same time interval with a conclusion that approximately one quarter of a million American lives where lost during the first year of the catastrophic COVID-19 vaccine campaign.\n\nDuring 2021 the Delta outbreak took an additional toll with lives lost to the infection and there was no evidence to support a tradeoff.\n\nThat is, no randomized, double-blind, placebo controlled trial of COVID-19 vaccination demonstrated a reduction in death as a component of a primary or secondary endpoint.\n\nThe consent form for immunization does not list mortality reduction as an expected benefit yet it mentions death is possible with the vaccine. I anticipate more direct sources of information will become available including vaccine administration information from the CDC linked with the National Death Index. No matter what source is used, the number of deaths is far too large and the campaign should have been terminated for excess mortality before February, 1, 2021.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nSkidmore, M. The role of social circle COVID-19 illness and vaccination experiences in COVID-19 vaccination decisions: an online survey of the United States population. BMC Infect Dis 23, 51 (2023). https://doi.org/10.1186/s12879-023-07998-3\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Catastrophic COVID-19 Vaccine Casualties in 2021 - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** Several sources of data emerged in 2021 pointing to …", "url": "https://www.globalresearch.ca/catastrophic-covid-19-vaccine-casualties-2021/5806072", "site_name": "Global Research", "article:tag": "vaccine deaths", "article:section": "English", "article:published_time": "2023-01-26T15:04:56+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/08/Death-Body-Under-White-Cloth.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/08/Death-Body-Under-White-Cloth.jpg", "image:width": "1200", "image:height": "676"}, "tags": ["Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://phmpt.org/pfizers-documents/", "https://www.researchgate.net/publication/355581860_COVID_vaccination_and_age-stratified_all-cause_mortality_risk", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3#citeas", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://petermcculloughmd.substack.com/p/catastrophic-covid-19-vaccine-casualties?utm_source=post-email-title&publication_id=1119676&post_id=99010697&isFreemail=true&utm_medium=email", "https://www.globalresearch.ca/author/peter-mccullough", "https://petermcculloughmd.substack.com/p/catastrophic-covid-19-vaccine-casualties?utm_source=post-email-title&publication_id=1119676&post_id=99010697&isFreemail=true&utm_medium=email", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-01-26T15:04:56+00:00"}