{"result_id": "134036", "URL": "https://www.globalresearch.ca/a-vaccine-in-record-speed/5812344", "timestamp": "2023-04-25 15:17:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/a-vaccine-in-record-speed/5812344", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Covid-19: \"A Vaccine in Record Speed\"", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version)\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThree years ago, on March 16, 2020, the NIH issued a press release titled NIH Clinical Trial of Investigational Vaccine for COVID-19 Begins. Though most Americans didn’t notice it at the time, it announced a project that was already the SOLE focus of the official pandemic response. In Chapter 4 of The Courage to Face COVID-19: Preventing Hospitalization and Death, Dr. McCullough and I tell the story of this event and its link to the ruthless suppression of early treatment for COVID-19. If you find this chapter interesting, please consider ordering a copy of our book, which has earned over 1,000 5-Star ratings on Amazon.\n\nOn March 16—the same day that Elon Musk retweeted a reference to the Rigano-Todaro paper [on the efficacy of chloroquine in treating COVID-19]—the National Institute of Allergy and Infectious Diseases (NIAID) announced that it was beginning a clinical trial of a new investigational vaccine at the Kaiser Permanente Washington Health Research Institute (KPWHRI) in Seattle.\n\nThe vaccine is called mRNA-1273 and was developed by NIAID scientists and their collaborators at the biotechnology company Moderna, Inc., based in Cambridge, Massachusetts. The Coalition for Epidemic Preparedness Innovations (CEPI) supported the manufacturing of the vaccine candidate for the Phase 1 clinical trial.\n\n“Finding a safe and effective vaccine to prevent infection with SARS-CoV-2 is an urgent public health priority,” said NIAID Director Anthony S. Fauci, M.D. “This Phase 1 study, launched in record speed, is an important first step toward achieving that goal.” The investigational vaccine was developed using a genetic platform called mRNA (messenger RNA). The investigational vaccine directs the body’s cells to express a virus protein that it is hoped will elicit a robust immune response. The mRNA-1273 vaccine has shown promise in animal models, and this is the first trial to examine it in humans.\n\nScientists at NIAID’s Vaccine Research Center (VRC) and Moderna were able to quickly develop mRNA-1273 because of prior studies of related coronaviruses that cause severe acute respiratory syndrome (SARS) and Middle East respiratory syndrome (MERS). Coronaviruses are spherical and have spikes protruding from their surface, giving the particles a crown-like appearance. The spike binds to human cells, allowing the virus to gain entry. VRC and Moderna scientists already were working on an investigational MERS vaccine targeting the spike, which provided a head start for developing a vaccine candidate to protect against COVID-19. Once the genetic information of SARS-CoV-2 became available, the scientists quickly selected a sequence to express the stabilized spike protein of the virus in the existing mRNA platform.[i]\n\nRecord speed indeed. The causal agent of COVID-19 wasn’t known until Chinese researchers announced they’d identified it on January 7, 2020. A draft copy of the genome was made available to researchers on January 11, and the first reported U.S. case was on January 21 in Seattle.[ii] The WHO did not declare COVID-19 a pandemic until March 11—five days before NIAID and Moderna began their human clinical trial.[iii] Clearly this partnership had been developing their new mRNA vaccine technology against coronaviruses such as SARS and MERS for some time. According to Moderna’s website, the company had been working on mRNA technology for a decade, investing tens of millions in its development. Now it seemed they had an opportunity to deploy it on a global scale.[iv]\n\nNIAID’s March 16, 2020 announcement not only reported a promising new vaccine technology to combat COVID-19, but also a declaration from Anthony Fauci—who assumed the countenance of the nation’s chief public health advisor—that the vaccine his institute had developed (and made a substantial investment in) was an urgent health priority. As long as no drugs were available to inhibit SARS-CoV-2 and prevent the COVID-19 illness it caused, the new vaccine was apparently mankind’s only hope, and therefore justified enormous resources for its development. Dr. Fauci did not mention in the announcement that the NIH (a government research funding institution) had not only invested in the vaccine for promoting public health, but also claimed to co-own the patent and therefore stood to share the royalties from its commercial exploitation.[v]\n\nDuring the Event 201 Pandemic Simulation on October 19, 2019, several participants believed that a repurposed anti-viral medication was the best hope for immediately addressing the emergency because it would take at least a year to develop a vaccine. However, Dr. Timothy Evans drew his colleagues’ attention to the fact that CEPI—the Coalition for Epidemic Preparedness Innovations—was already working on a coronavirus vaccine. Now CEPI “supported the manufacturing of the vaccine candidate for the Phase 1 clinical trial.” This was the first step in executing the “Preliminary Business Plan” that CEPI published in November 2016.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\n[ii] CDC. First Travel-related Case of 2019 Novel Coronavirus Detected in United States. January 21, 2020. https://www.cdc.gov/media/releases/2020/p0121-novel-coronavirus-travel-case.html", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid-19: \"A Vaccine in Record Speed\" - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version) To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** Three years ago, on March 16, 2020, …", "url": "https://www.globalresearch.ca/a-vaccine-in-record-speed/5812344", "site_name": "Global Research", "article:tag": "COVID vaccines", "article:section": "English", "article:published_time": "2023-03-18T16:51:37+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.niaid.nih.gov/news-events/nih-clinical-trial-investigational-vaccine-covid-19-begins", "https://www.amazon.com/Courage-Face-COVID-19-Hospitalization-Bio-Pharmaceutical/dp/151077680X/?_encoding=UTF8&pd_rd_w=yuCqG&content-id=amzn1.sym.bc5f3394-3b4c-4031-8ac0-18107ac75816&pf_rd_p=bc5f3394-3b4c-4031-8ac0-18107ac75816&pf_rd_r=GZFKDPXVY93MG1N2P294&pd_rd_wg=uKAv0&pd_rd_r=af146b4f-36a6-42ac-af99-dad7f8b11c49&ref_=pd_gw_ci_mcx_mr_hp_atf_m", "https://www.amazon.com/Courage-Face-COVID-19-Hospitalization-Bio-Pharmaceutical/dp/151077680X/?_encoding=UTF8&pd_rd_w=yuCqG&content-id=amzn1.sym.bc5f3394-3b4c-4031-8ac0-18107ac75816&pf_rd_p=bc5f3394-3b4c-4031-8ac0-18107ac75816&pf_rd_r=GZFKDPXVY93MG1N2P294&pd_rd_wg=uKAv0&pd_rd_r=af146b4f-36a6-42ac-af99-dad7f8b11c49&ref_=pd_gw_ci_mcx_mr_hp_atf_m", "https://twitter.com/elonmusk/status/1239650597906898947", "https://www.niaid.nih.gov/news-events/nih-clinical-trial-investigational-vaccine-covid-19-begins", "https://www.cdc.gov/media/releases/2020/p0121-novel-coronavirus-travel-case.html", "https://www.cdc.gov/museum/timeline/covid19.html", "https://www.modernatx.com/about-us/our-story", "https://www.cbsnews.com/news/moderna-covid-vaccine-patent-dispute-national-institutes-health/", "https://childrenshealthdefense.org/defender/fda-advisers-bivalent-vaccine/", "https://petermcculloughmd.substack.com/p/a-vaccine-in-record-speed?utm_source=post-email-title&publication_id=1119676&post_id=108884803&isFreemail=true&utm_medium=email", "https://www.globalresearch.ca/author/john-leake", "https://petermcculloughmd.substack.com/p/a-vaccine-in-record-speed?utm_source=post-email-title&publication_id=1119676&post_id=108884803&isFreemail=true&utm_medium=email", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-03-18T16:51:37+00:00"}