{"result_id": "134015", "URL": "https://www.globalresearch.ca/u-s-approves-first-3-covid-vaccine-injury-claims-and-pays-out-a-total-of-4634-89/5816108", "timestamp": "2023-04-25 15:17:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/u-s-approves-first-3-covid-vaccine-injury-claims-and-pays-out-a-total-of-4634-89/5816108", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "U.S. Approves First Three COVID Vaccine Injury Claims — And Pays Out a Total of $4,634.89", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nClick the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThe U.S. government approved its first three payments to people injured by COVID-19 vaccines — amounting to a total of $4,634.89.\n\nThe Health and Resources Service Administration (HRSA) vaccine injury claims report, updated monthly, shows one $2,019.55 payment for anaphylaxis and two payments — $1,582.65 and $1,032.69 — for myocarditis.\n\nThe payments were made through HRSA’s Countermeasures Injury Compensation Program (CICP).\n\nThe CICP was established under the Public Readiness and Emergency Preparedness (PREP) Act, which protects pharmaceutical companies from liability for injuries sustained from “countermeasures,” such as vaccines and medications, administered during a public health emergency.\n\nSince 2010, when it approved its first claim, the program has compensated a total of 33 claims for vaccine injuries — but these are the first awards for COVID-19 vaccines.\n\n“These long-awaited awards were overdue, highly anticipated and speculated upon,” said Kim Mack Rosenberg, acting general counsel for Children’s Health Defense (CHD). “What is remarkable is that less than $5,000 was paid — total. This is a tragedy that highlights the severe limitations of the program.”\n\nCHD Acting President Laura Bono called the payouts for myocarditis “insulting,” given that mortality rates increase to 50% within five years of diagnosis.\n\n“The CICP is a pathetic, government-run program that gives complete liability protection to the very industries profiting from the COVID vaccine or product. While victims linger with their injuries, paying out-of-pocket for expenses, or at worst die, the industries run to the bank.”\n\nSince the start of the pandemic, people claiming injuries related to COVID-19 vaccines and other countermeasures submitted 11,425 requests for compensation.\n\nOf those, only 19 have been declared eligible for compensation and are undergoing a “medical benefits review” to determine payment.\n\nThe anaphylaxis case had been pending medical benefits review since the fall of 2021, and the two myocarditis cases had been pending review since January.\n\nDuring the medical benefits review, HRSA determines any costs remaining after insurance, workers’ comp, disability or other reimbursements or payments.\n\nWayne Rohde, an expert in vaccine injury compensation, wrote on his Substack that given the “18+ months to review previous medical benefits that may have been awarded to the injured party [the anaphylaxis case], this process tells me it was a major injury that resulted in very large medical bills.”\n\nMyocarditis is a serious condition that also requires a lot of medical attention, Rohde said.\n\nTo date, there have been 1,541,275 reports of adverse events following COVID-19 vaccination submitted to the Vaccine Adverse Event Reporting System (VAERS).\n\nHow does vaccine injury compensation work? the VICP and CICP\n\nHRSA, which operates under the U.S. Department of Health and Human Services (HHS), administers two vaccine injury compensation programs: the National Vaccine Injury Compensation Program (VICP) and the Countermeasures Injury Compensation Program (CICP).\n\nThe VICP is a special, no-fault tribunal housed within the U.S. Court of Federal Claims that handles injury claims for 16 common vaccines on the childhood vaccination schedule. To date, it has awarded more than $4 billion for medical bills, lost wages, lawyer fees, and pain and suffering to thousands of people for vaccine injuries.\n\nThe program does not currently cover COVID-19 vaccine injuries. Should COVID-19 vaccines be moved into the program, any injuries would be handled by the already overwhelmed VICP.\n\nThe CICP, the only program that covers COVID-19 vaccine injuries at this time, is even less equipped to deal with them, Rohde told The Defender.\n\n“For COVID-19 vaccine-injured people, the CICP is the worst place, it’s the worst option,” Rohde said, “because it is not really a compensation program, it’s a reimbursement program for medical costs.”\n\nThe CICP allows individuals to claim compensation only for unreimbursed medical expenses — meaning those not fully reimbursed by insurance or government programs, such as Medicaid — for death and for lost wages up to $50,000.\n\nAccording to the Centers for Disease Control and Prevention, under the CICP:\n\n“Eligible individuals may be compensated for certain reasonable and necessary medical expenses and for lost employment income at the time of the injury. Death benefits may be paid to certain survivors of covered countermeasures recipients who have died as a direct result of the covered countermeasure injury.\n\n“The U.S. Department of Health and Human Services is the payer of last resort. Therefore, payments are reduced by those of other third-party payers.”\n\n“There’s no pain and suffering here, there’s nothing,” Rohde said.\n\nBecause the CICP reviews and resolves claims through an administrative rather than a judicial process, no details other than the amount of the payments have to be shared with the public.\n\n“It’s designed to be very convoluted, very non-transparent,” Rohde said.\n\nThe CICP was known for its cumbersome claims process and low likelihood of success for claimants even before the pandemic. Since then, it has seen unsustainable growth.\n\nAccording to HRSA’s numbers, of the 11,941 claims filed with the CICP since 2010, nearly 11,000 of them are still under review.\n\nThe HRSA budget for COVID-19 vaccine injury compensation will increase in fiscal year 2023 — from approximately $1 million to $5 million — and its budget for staffing and contractors will jump from $5 million to $9.5 million.\n\nHow would COVID vaccine injury compensation change under the VICP?\n\nFor vaccine injury claims to be covered under the VICP rather than the CICP, three requirements must be met:\n• None The vaccine needs to be recommended for routine administration for children and/or pregnant women.\n• None It needs to have an excise tax imposed upon it through the legislature.\n• None There needs to be a notice of coverage published in the federal record.\n\nThe COVID-19 vaccine was added to the childhood immunization schedule earlier this year — but the next two steps in the process have yet to be completed and public health officials have not indicated when this might happen.\n\nThe National Academies of Science, Engineering, and Medicine met for three days last month — behind closed doors, except for a two-hour public comment period — to review the epidemiological, clinical and biological evidence on adverse events associated with COVID-19 vaccines.\n\nThe committee will generate a report that will be used to add injuries to the federal Vaccine Injury Table, which lists known adverse events associated with existing vaccines.\n\nThis list helps the VICP and the CICP decide whether to compensate vaccine injury claims.\n\nAt the National Academies meeting, Professor Renee Gentry, director of the Vaccine Injury Litigation Clinic at The George Washington University Law School, told the committee the stakeholders that created the VICP — vaccine manufacturers, lawyers and parents — set it up to be petitioner-friendly, informal, generous and non-adversarial.\n\nBut instead, she said, HHS has been “unrelenting” in its opposition to recognizing vaccine injuries.\n\n“I believe the VICP as it exists today would be unrecognizable to those original stakeholders,” she said.\n\nNote to readers: Please click the share button above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nBrenda Baletti Ph.D. is a reporter for The Defender. She wrote and taught about capitalism and politics for 10 years in the writing program at Duke University. She holds a Ph.D. in human geography from the University of North Carolina at Chapel Hill and a master’s from the University of Texas at Austin.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "U.S. Approves First Three COVID Vaccine Injury Claims — And Pays Out a Total of $4,634.89 - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Click the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share …", "url": "https://www.globalresearch.ca/u-s-approves-first-3-covid-vaccine-injury-claims-and-pays-out-a-total-of-4634-89/5816108", "site_name": "Global Research", "article:tag": "vaccine injuries payments", "article:section": "English", "article:published_time": "2023-04-17T06:46:23+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/04/covid-vaccine-injury-claims-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/04/covid-vaccine-injury-claims-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["USA", "Law and Justice", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.hrsa.gov/", "https://www.hrsa.gov/cicp/cicp-data/table-4", "https://childrenshealthdefense.org/defender/myocarditis-pfizer-covid-vaccine/", "https://www.hrsa.gov/cicp", "https://childrenshealthdefense.org/defender/prep-act-covid-vaccine-injury-liability/", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.hrsa.gov/cicp/cicp-data", "https://childrenshealthdefense.org/", "https://www.hrsa.gov/cicp/cicp-data", "https://childrenshealthdefense.org/defender/injury-covid-countermeasure-backlog-grows/", "https://childrenshealthdefense.org/authors/wayne-rohde/", "https://thevaccinecourt.substack.com/p/hrsa-actually-compensated-3-c19-vaccine", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX[]=COVID19&VAX[]=COVID19-2", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/chd-lawsuit-cdc-covid-vaccine-vaers/", "https://childrenshealthdefense.org/national-vaccine-injury-compensation-program/", "https://www.hrsa.gov/vaccine-compensation", "https://www.mctlaw.com/vaccine-injury/vaccinations/coronavirus-covid-19/", "https://www.reuters.com/legal/litigation/covid-vaccine-injury-claims-2022-were-stuck-limbo-whats-next-2022-12-30/", "https://childrenshealthdefense.org/defender/", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/d/cicp.pdf", "https://www.hrsa.gov/cicp/filing-benefits", "https://childrenshealthdefense.org/defender/angela-marie-wulbrecht-covid-vaccine-injury-no-federal-compensation/", "https://www.hrsa.gov/cicp/cicp-data", "https://childrenshealthdefense.org/defender/hrsa-budget-vaccine-injury-compensation-programs/", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/", "https://childrenshealthdefense.org/defender/", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vaccine-injury-table-01-03-2022.pdf", "https://childrenshealthdefense.org/defender/prep-act-covid-vaccine-injury-liability/", "https://www.law.gwu.edu/vaccine-injury-litigation-clinic", "https://www.globalresearch.ca/conservative-risk-benefit-analyses-decide-against-covid-19-vaccination/5802216", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-claims-hrsa/", "https://www.globalresearch.ca/author/brenda-baletti", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-claims-hrsa/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-17T06:46:23+00:00"}