{"result_id": "134026", "URL": "https://www.globalresearch.ca/covid-19-vaccines-gene-therapy/5740003", "timestamp": "2023-04-25 15:17:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-19-vaccines-gene-therapy/5740003", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "COVID-19 mRNA \"Vaccines\" Are \"Gene Therapy\"", "cleaned_text": "All Global Research articles can be read in 27 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nAs calls for mandatory COVID-19 vaccination grow around the world, it’s becoming ever more crucial to understand what these injections actually are. The mRNA “vaccines” created by Moderna and Pfizer are in fact gene therapies.\n\nAs I’ll explain below, there’s simply no way around this, and drug manufacturers and public health officials must be made to admit this fact. Why? Because it makes all the difference in the world. You cannot mandate a gene therapy against COVID-19 any more than you can force entire populations to undergo gene therapy for a cancer they do not have and may never be at risk for.\n\nInterestingly enough, mainstream media, fact checkers and various industry front groups insist the gene therapy claim is bogus, even though every single detail about the vaccines shouts otherwise. Why are they spreading this disinformation? Why do they not want you to know what these injections actually are?\n\nIn short, they know labeling them as “gene therapies” would be like slapping a skull and crossbones label on them. Most people have enough common sense to realize that gene therapy is a different ballgame from a regular vaccination, and might be a bad idea, especially for children and younger individuals.\n\nmRNA ‘Vaccines’ Fulfill None of the Criteria for a Vaccine\n\nTo start, let’s take a look at some basic definitions of words. According to the U.S. Centers for Disease Control and Prevention, a vaccine is:1\n• “A product that stimulates a person’s immune system to produce immunity to a specific disease, protecting the person from that disease.”\n\nImmunity, in turn, is defined as:\n• “Protection from an infectious disease,” meaning that “If you are immune to a disease, you can be exposed to it without becoming infected.”\n\nThat’s the medical definition. The legal definition, in the few cases where it has been detailed, is equally unequivocal:\n• Iowa code — “Vaccine means a specially prepared antigen administered to a person for the purpose of providing immunity.”\n• Washington state code , — “Vaccine means a preparation of a killed or attenuated living microorganism, or fraction thereof …” The statute also specifies that a vaccine “upon immunization stimulates immunity that protects us against disease …”\n\nThese definitions, both medical and legal, present problems for mRNA “vaccines,” since:\n• mRNA injections do not impart immunity. Moderna and Pfizer both admit that their clinical trials aren’t even looking at immunity. As such they do not fulfill the medical and/or legal definition of a vaccine.\n• They do not inhibit transmissibility of SARS-CoV-2 infection. As such they do not fulfill the medical and/or legal definition of a vaccine.\n\nWe should not be fooled by attempts to condition the public to accept redefined terms. As of February 2019, Merriam-Webster defined5 “vaccine” as “a preparation of killed microorganisms, living attenuated organisms, or living fully virulent organisms that is administered to produce or artificially increase immunity to a particular disease.” By February 26, 2021, they had updated the definition of “vaccine” to:6\n\nLet’s be clear. Merriam-Webster does not dictate medical terminology. It can be used, however, to confuse people. For now, all medical dictionaries still show the traditional definition of vaccine,7 as Merriam-Webster did up until this year. That said, I would not be surprised if changes are made there as well, eventually, if the misrepresentation of COVID-19 mRNA vaccines is allowed to stand.\n\nThere’s also the issue of whether a gene therapy can be mandated, and this may hinge on it being accepted as a vaccine. The 1905 Supreme Court ruling in Jacobson v. Massachusetts8 essentially established that collective benefit supersedes individual benefit.\n\nPut another way, the ruling argues (although legal experts diverge on some of the finer details of its interpretation) that it’s acceptable for some individuals to be harmed by a public health directive as long as it benefits the collective. However, if vaccination is a public health measure meant to protect and benefit the collective, then it would need to accomplish two things:\n• Ensure that the vaccinated person is rendered immune from the disease.\n• Inhibit transmission of the disease from the vaccinated person to other individuals.\n\nWe’re now back to the original problem that mRNA therapies for COVID-19 do not accomplish either of these things. Since these gene therapies do not render the person immune, and do not inhibit transmission of the virus, they cannot qualify as a public health measure capable of providing collective benefit that supersedes individual risk.\n\nOn the contrary, the only one benefiting from an mRNA “vaccine” is the individual receiving the gene therapy, since all they are designed to do is lessen clinical symptoms associated with the S-1 spike protein.\n\nIn other words, they won’t keep you from getting sick with SARS-CoV-2; they are only supposed to lessen your infection symptoms if or when you do get infected. So, getting vaccinated protects no one but yourself. Since you’re the only one who will reap a benefit (less severe COVID-19 symptoms upon infection), the justification to accept the risks of the therapy “for the greater good” of your community is blatantly irrational.\n\nSince mRNA “vaccines” do not meet the medical and/or legal definition of a vaccine, referring to them as vaccines, and marketing them as such, is a deceptive practice that violates9 15 U.S. Code Section 41 of the Federal Trade Commission Act,10 the law that governs advertising of medical practices.\n\nThe lack of completed human trials also puts these mRNA products at odds with 15 U.S. Code Section 41. Per this law,11,12 it is unlawful to advertise “that a product or service can prevent, treat, or cure human disease unless you possess competent and reliable scientific evidence, including, when appropriate, well-controlled human clinical studies, substantiating that the claims are true at the time they are made.”\n\nHere’s the problem: The primary end point in the COVID-19 “vaccine” trials is not an actual vaccine trial end point because, again, vaccine trial end points have to do with immunity and transmission reduction. Neither of those was measured.\n\nWhat’s more, key secondary end points in Moderna’s trial include prevention of severe COVID-19 disease (defined as need for hospitalization) and prevention of infection by SARS-CoV-2, regardless of symptoms.13,14 However, Moderna did not actually measure rate of infection, stating that it was too “impractical” to do so.\n\nThat means there’s no evidence of this gene therapy having an impact on infection, for better or worse. And, if you have no evidence, you cannot fulfill the U.S. Code requirement that states you must have “competent and reliable scientific evidence … substantiating that the claims are true.”\n\nMaking matters worse, both Pfizer and Moderna are now eliminating their control groups by offering the real vaccine to any and all placebo recipients who want it.15 The studies are supposed to go on for a full two years, but by eliminating the control group, determining effectiveness and risks is going to be near impossible.\n\nAlright. Let’s move on to the definition of “gene therapy.” As detailed on MedlinePlus.gov’s “What Is Gene Therapy” page:16\n\nHere, it’s worth noting that there are many different treatments that have been shown to be very effective against COVID-19, so it certainly does not qualify as a disease that has no cure. It makes sense that gene therapy should be restricted to incurable diseases, as this is the only time that taking drastic risks might be warranted. That said, here’s how the U.S. Food and Drug Administration defines gene therapy:17\n\nNovember 17, 2020, the American Society of Gene + Cell Therapy (ASGCT) announced “COVID-19 Vaccine Candidates Show Gene Therapy Is a Viable Strategy,” noting that:18\n\nAs explained in the ASGCT’s video above, mRNA are molecules that contain genetic instructions for making various proteins. mRNA “vaccines” deliver a synthetic version of mRNA into your cells that carry the instruction to produce the SARS-CoV-2 spike protein, the antigen, that then activates your immune system to produce antibodies. Then there’s Moderna’s trial website,19 where they describe their technology thus:\n\nImportantly, as reported by David Martin, Ph.D.,21,22 “Moderna … describes its product not as a vaccine, but as ‘gene therapy technology’ in SEC filings. This is because neither Moderna nor Pfizer … make any claims about their products creating immunity or preventing transmission.” Additionally, Moderna’s SEC filings specifically state that “Currently, mRNA is considered a gene therapy product by the FDA,” as well.23\n\nClick here to watch the video.\n\nIn a February 2021 article, MIT Technology Review reviewed the history of mRNA technology in general, and Moderna’s in particular, stating:24\n\nBloomberg, in August 2020, reported25 that the Moderna vaccine would seek to transform your body into “a vaccine-making machine.” The New York Times was more to the point. In May 2020, they reported26 that “Researchers at two Harvard-affiliated hospitals are adapting a proven form of gene therapy to develop a coronavirus vaccine.” Read it again — A proven form of gene therapy.\n\nSo, to summarize: The definition of “genetic” is something relating to genes, and the definition of “therapy” is the medical treatment of a disease. The definition of “gene therapy” is the process of modifying or manipulating the expression of a gene, or altering the biological properties of living cells.\n\nmRNA are snippets of genetic code that instructs cells to produce proteins. mRNA COVID-19 therapies “deliver genetic instructions into your cells,” thereby triggering your body to produce a fragment of the virus (the spike protein). So, mRNA vaccines ARE gene therapy. There’s simply no way around this. They fulfill all the definitions of gene therapy and none of the definitions for a vaccine.\n\nThere’s yet one more potential problem with the “COVID-19 vaccine” narrative as a whole, which Martin unpacked in a January 25, 2021, interview on the Wise Traditions podcast (above).27 In it, he explains:\n\nIn short, SARS-CoV-2 has yet to be definitively proven to be the actual cause of COVID-19. So, a gene therapy that instructs your body to produce a SARS-CoV-2 antigen — the viral spike protein — cannot even be touted as a preventative against COVID-19, as the two have not been shown to be causally linked.\n\nAs for why drug companies are misrepresenting this technology, Martin suspects “it’s done exclusively so that they can get themselves under the umbrella of public health laws that exploit vaccination.”\n\nExperimental gene therapies do not have financial liability shielding from the government, but pandemic vaccines do, even in the experimental stage, as long as the emergency use authorization is in effect. This is indeed a major incentive to make sure this technology is perceived as a vaccine and nothing else.\n\nSo, by maintaining the illusion that COVID-19 is a state of emergency, when in reality it is not, government leaders are providing cover for these gene therapy companies so that they are insulated from any liability.\n\nI’ve written many articles detailing the potential and expected side effects of these gene therapy “vaccines.” If all of this is new to you, consider reviewing “How COVID-19 Vaccine Can Destroy Your Immune System,” “Seniors Dying After COVID Vaccine Labeled as Natural Causes” and “Side Effects and Data Gaps Raise Questions on COVID Vaccine.”\n\nThe take-home message here is that these injections are not vaccines. They do not prevent infection, they do not render you immune and they do not prevent transmission of the disease. Instead, they alter your genetic coding, turning you into a viral protein factory that has no off-switch. What’s happening here is a medical fraud of unprecedented magnitude, and it really needs to be stopped before it’s too late for a majority of people.\n\nIf you already got the vaccine and now regret it, you may be able to address your symptoms using the same strategies you’d use to treat actual SARS-CoV-2 infection. I review these strategies at the end of “Why COVID Vaccine Testing Is a Farce.”\n\nLast but not least, if you got the vaccine and are having side effects, please help raise public awareness by reporting it. The Children’s Health Defense is calling on all who have suffered a side effect from a COVID-19 vaccine to do these three things:28\n• If you live in the U.S., file a report on VAERS\n• Report the injury on VaxxTracker.com, which is a nongovernmental adverse event tracker (you can file anonymously if you like)\n• Report the injury on the CHD website\n\nThe National Vaccine Information Center (NVIC) recently posted more than 50 video presentations from the pay-for-view Fifth International Public Conference on Vaccination held online October 16 to 18, 2020, and made them available to everyone for free.\n\nThe conference’s theme was “Protecting Health and Autonomy in the 21st Century” and it featured physicians, scientists and other health professionals, human rights activists, faith community leaders, constitutional and civil rights attorneys, authors and parents of vaccine injured children talking about vaccine science, policy, law and ethics and infectious diseases, including coronavirus and COVID-19 vaccines.\n\nIn December 2020, a U.K. company published false and misleading information about NVIC and its conference, which prompted NVIC to open up the whole conference for free viewing. The conference has everything you need to educate yourself and protect your personal freedoms and liberties with respect to your health.\n\nDon’t miss out on this incredible opportunity. I was a speaker at this empowering conference and urge you to watch these video presentations before they’re censored and taken away by the technocratic elite.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\n7 The Free Dictionary, Listing of medical dictionary definitions of vaccine\n\n9, 21 G. Edward Griffin’s Need To Know January 19, 2021\n\n16 Medline Plus What Is Gene Therapy?\n\n26 New York Times May 4, 2020, updated May 7, 2020 (Archived)", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 mRNA \"Vaccines\" Are \"Gene Therapy\" - Global Research", "description": "All Global Research articles can be read in 27 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version). *** As calls for mandatory COVID-19 vaccination grow around the world, it’s becoming ever more crucial to understand what these injections actually are. The mRNA “vaccines” created by Moderna …", "url": "https://www.globalresearch.ca/covid-19-vaccines-gene-therapy/5740003", "site_name": "Global Research", "article:tag": "mRNA vaccines", "article:section": "English", "article:published_time": "2021-03-16T13:04:23+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2020/11/vaccine-hesitancy-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2020/11/vaccine-hesitancy-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["USA", "Science and Medicine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe src=\"https://www.youtube.com/embed/SR-9Bo2CaRQ\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/SR-9Bo2CaRQ"}], "links": ["https://articles.mercola.com/sites/articles/archive/2020/08/24/quercetin-and-vitamin-c-synergistic-effect.aspx", "https://articles.mercola.com/sites/articles/archive/2021/03/16/mrna-vaccine-gene-therapy.aspx", "https://articles.mercola.com/sites/articles/archive/2021/03/16/mrna-vaccine-gene-therapy.aspx", "https://articles.mercola.com/sites/articles/archive/2020/11/11/coronavirus-antibody-dependent-enhancement.aspx", "https://articles.mercola.com/sites/articles/archive/2021/02/02/covid-vaccine-death-seniors.aspx", "https://articles.mercola.com/sites/articles/archive/2021/01/26/covid-vaccine-side-effects.aspx", "https://articles.mercola.com/sites/articles/archive/2021/03/02/covid-vaccine-testing.aspx", "https://vaers.hhs.gov/reportevent.html", "https://www.vaxxtracker.com/", "https://childrenshealthdefense.org/covid-19-vaccine-reactions/", "https://www.cdc.gov/vaccines/vac-gen/imz-basics.htm", "https://rules.iowa.gov/Notice/Details/4096C", "https://www.sos.wa.gov/_assets/elections/initiatives/finaltext_2141.pdf", "https://www.sos.wa.gov/_assets/elections/initiatives/finaltext_1984.pdf", "https://web.archive.org/web/20190206184116/https:/www.merriam-webster.com/dictionary/vaccine", "https://web.archive.org/web/20210226153704/https://www.merriam-webster.com/dictionary/vaccine", "https://medical-dictionary.thefreedictionary.com/vaccine", "https://supreme.justia.com/cases/federal/us/197/11/", "https://needtoknow.news/2021/01/rna-vaccines-are-gmo-implants-not-vaccines/", "https://www.law.cornell.edu/uscode/text/15/chapter-2/subchapter-I", "https://www.ftc.gov/system/files/warning-letters/covid-19-letter_to_american_chinese_medicine_association_clinic.pdf", "https://www.ftc.gov/sites/default/files/documents/statutes/federal-trade-commission-act/ftc_act_incorporatingus_safe_web_act.pdf", "https://www.modernatx.com/sites/default/files/mRNA-1273-P301-Protocol.pdf", "https://www.cidrap.umn.edu/news-perspective/2020/07/phase-3-trial-moderna-covid-19-vaccine-begins-amid-us-summer-surge", "https://www.npr.org/2021/02/17/968760642/long-term-covid-19-vaccine-studies-hampered-as-placebo-recipients-get-real-shot", "https://medlineplus.gov/genetics/understanding/therapy/genetherapy/", "https://www.fda.gov/vaccines-blood-biologics/cellular-gene-therapy-products/what-gene-therapy", "https://www.asgct.org/research/news/november-2020/covid-19-moderna-nih-vaccine", "https://www.modernatx.com/cove-study", "https://www.wired.com/story/why-its-a-big-deal-if-the-first-covid-vaccine-is-genetic/", "https://www.davidmartin.world/wp-content/uploads/2021/01/BotW_transcript_01112021.pdf", "https://www.sec.gov/Archives/edgar/data/1682852/000168285220000017/mrna-20200630.htm", "https://www.technologyreview.com/2021/02/05/1017366/messenger-rna-vaccines-covid-hiv/", "https://www.bloomberg.com/features/2020-moderna-biontech-covid-shot/", "https://archive.is/oDB2T#selection-595.12-599.1", "https://www.westonaprice.org/podcast/its-gene-therapy-not-a-vaccine/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://articles.mercola.com/sites/articles/archive/2021/03/16/mrna-vaccine-gene-therapy.aspx", "https://www.globalresearch.ca/author/dr-mercola", "https://articles.mercola.com/sites/articles/archive/2021/03/16/mrna-vaccine-gene-therapy.aspx", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2021-03-16T13:04:23+00:00"}