{"result_id": "134013", "URL": "https://www.globalresearch.ca/now-published-peer-reviewed-scientific-literature-mrna-vaccines-neither-safe-nor-effective-but-outright-dangerous/5811276", "timestamp": "2023-04-25 15:17:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/now-published-peer-reviewed-scientific-literature-mrna-vaccines-neither-safe-nor-effective-but-outright-dangerous/5811276", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "\"The mRNA Vaccines are neither safe nor effective, but Outright Dangerous.\"", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nIn case you missed it. Every health authority in the world should be warning the public about this. The paper was published Sept 21, 2022.\n\nCOVID-19 vaccines – An Australian Review was published in the peer-reviewed scientific literature on Sept 21, 2022.\n\nHere’s the two sentences from the paper that everyone should read:\n\nA worldwide Bayesian causal Impact analysis suggests that COVID-19 gene therapy (mRNA vaccine) causes more COVID-19 cases per million and more non-Covid deaths per million than are associated with COVID-19 [43].\n\nAn abundance of studies has shown that the mRNA vaccines are neither safe nor effective, but outright dangerous.\n\nOther key insights from the paper\n\nIf you don’t have time to read the entire paper, here are some of the highlights.\n\nHere are some other direct quotes from the paper:\n• COVID-19 vaccines cause more side effects than any other vaccine\n• Not only does spike protein produce unwanted side effects, but mRNA and nanoparticles do as well.\n• Never in vaccine history have we seen 1011 case studies showing side effects of a vaccine (See this).\n• Again, it is inconceivable why it would be impossible to go through the study data in a few months, when it took the CDC less than 4 weeks to give the injections emergency use authorization – unless you want to entertain the idea that the study data were never actually read and scrutinised, a frightening perspective.\n• The official public message is that the mRNA vaccines are safe. However, the Therapeutic Goods Administration (TGA), the medicine and therapeutic regulatory agency of the Australian Government, states quite clearly on their website that the large-scale trials are still progressing and no full data package has been received from any company.\n• The mRNA vaccines were supposed to remain at the injection site and be taken up by the lymphatic system. This assumption proved to be wrong. During an autopsy of a vaccinated person that had died after mRNA vaccination it was found that the vaccine disperses rapidly from the injection site and can be found in nearly all parts of the body [1]. … Research has shown that such nanoparticles can cross the blood-brain barrier and the blood-placenta barrier.\n• Despite not being able to prove a causal link with vaccines, as no autopsies were performed, they still believed that a link with vaccination is possible and further analysis is warranted.\n• In summary, it is unknown where exactly the vaccine travels once it is injected, and how much spike protein is produced in which (and how many) cells.\n• The S1 subunit of the SARS-CoV-2 spike protein when injected into transgenic mice overexpressing human ACE-2 caused a COVID-19 like response. It was further shown that the spike protein S1 subunit, when added to red blood cells in vitro, could induce clotting.\n• The authors found consistent alteration of gene expression following vaccinationin many different immune cell types.\n• Seneff et al (2022) describe another mechanism by which the mRNA vaccines could interfere with DNA repair.\n• It is an amazing fact that natural immunity is completely disregarded by health authorities around the world. We know from SARSCoV-1 that natural immunity is durable and persists for at least 12-17 years [17]. Immunologists have suggested that immunity to SARS-Cov-2 is no different\n• Immunity induced by COVID infection is robust and long lasting.\n• mRNA vaccines seem to suppress interferon responses. A literature review by Cardozo and Veazev [26] concluded that COVID-19 vaccines could potentially worsen COVID-19 disease.\n• Natural immunity is still not accepted as proof of immunity in Australia.\n• A study at the University of California followed up on infections in the workforce after 76% had been fully vaccinated with mRNA vaccines by March 2021 and 86.7% by July 2021. In July 2021 75.2% of the fully vaccinated workforce had symptomatic COVID.\n• Acharya et al. (2021) and Riemersma et al. (2021) both showed that the vaccinated have very high viral loads similar to the unvaccinated and are therefore as infectious.\n• Brown et al. (2021) and Servelitta et al (2021) suggested that vaccinated people with symptomatic infection by variants, such as Delta, are as infectious as symptomatic unvaccinated cases and will contribute to the spread of COVID even in highly vaccinated communities.\n• Countries with higher vaccination rates have also higher caseloads. It was shown that the median of new COVID-19 cases per 100,000 people was largely similar to the percent of the fully vaccinated population.\n• Multiple recent studies have indicated that the vaccinated are more likely to be infected with Omicron than the unvaccinated. A study by Kirsch (2021) from Denmark suggests that people who received the mRNA vaccines are up to eight times more likely to develop Omicron than those who did not [40]. This and a later study by Kirsch (2022a) conclude that the more one vaccinates, the more one becomes susceptible to COVID-19 infection [41].\n• This has to be seen in context with the small risk of dying from COVID-19… The chances of someone under 18 years old dying from COVID is near 0%. Those that die usually have severe underlying medical conditions. It is estimated that children are seven times more at risk to die from influenza than from COVID-19. [Editor’s note: so why do colleges mandate the COVID vaccine instead of the influenza vaccine?]\n\nOK, the paper is 18 pages long and those were just excerpts from the first 3 pages. Get the picture?\n• Never in Vaccine history have 57 leading scientists and policy experts released a report questioning the safety and efficacy of a vaccine. They not only questioned the safety of the current Covid-19 injections, but were calling for an immediate end to all vaccination. Many doctors and scientists around the world have voiced similar misgivings and warned of consequences due to long-term side effects. Yet there is no discussion or even mention of studies that do not follow the narrativeon safety and efficacy of Covid-19 vaccination.\n• Medical experts that have questioned the safety of these vaccines have been attacked and demonized, called conspiracy theorists and have been threatened to be de-registered if they go against the narrative. Alternative treatments were prohibited and people who never practised medicine are telling experienced doctors how to do their job. AHPRA is doing the same here in Australia to the detriment and in ignorance of science.\n\nThe final paragraph sums it up\n\nIs this paper right?\n\nI was very impressed with this paper. The authors were very thorough.\n\nThe paper has been in public view since September 21, 2022 which is more than enough time for scientists to question it.\n\nAs far as I am aware, there have not been any mistakes that have been called out that would change the statements or the conclusions of the paper.\n\nHow do you resolve conflicts in scientific papers?\n\nOf course, there have been many papers saying the COVID vaccines are life-saving.\n\nOne of my all-time favorites is the Barda paper published in the NEJM because it was used at an ACIP meeting where they showed Figure 3. When I saw that it showed that the vaccine dramatically cut your risk of pulmonary embolism, I couldn’t believe that anyone took this paper seriously.\n\nLet’s be clear: there is no possible mechanism of action that can reduce your risk of pulmonary embolism.\n\nIn the X-factor analysis I published long ago, the reporting rate of pulmonary embolism was 954 times higher than baseline. There is no way that can happen if the vaccines reduce the rates of pulmonary embolism.\n\nThe CDC itself knows that “pulmonary embolism” has triggered a “safety signal” in VAERS, but they never investigated it. The rates of pulmonary embolism with the COVID vaccines are off-the-charts compared with any other vaccine.\n\nPulmonary embolism was just one of over 700 safety signals in VAERS reported by the CDC in a FOIA request. They never bothered to warn the public about any of these safety signals (including “death”) because they didn’t want to create vaccine hesitancy.\n\nGenerally, review articles are considered the most definitive papers. So when papers disagree, we can often turn to the review articles for guidance since these papers look to resolve conflicting evidence.\n\nSo we have to ask: is there a more comprehensive paper that reviewed the same body of literature which came to the opposite conclusion?\n\nThere was a Cochrane review that appeared after this paper (in Dec 2022) entitled Efficacy and safety of COVID‐19 vaccines. But it was simply a review of the randomized trials and, unlike the current paper, it did not review any of the adverse event data outside of the main trials. Nor did it question the quality of the trials.\n\nIf you restrict your view to just the trial data and ignore all the evidence of tampering, the vaccines look good. It is absolutely stunning how the Cochrane review completely missed all the anomalies with the trials, isn’t it? See these two articles: Adverse events in Pfizer trial may have been underreported by 8X or more and Pfizer Phase 3 clinical trial fraud allegations that should be immediately investigated by the FDA. They didn’t even mention that in the limitations sections that they basically assumed that the drug companies were honest and that they decided to ignore all the obvious data that the trials were gamed. Evidence of gaming has been in full public view for a long time. Cochrane ignored it.\n\nHowever, the Cochrane review noted that “There is insufficient evidence regarding deaths between vaccines and placebo (mainly because the number of deaths was low).”\n\nIn short, even in the view of the most supportive paper, there is no evidence that the vaccines did anything to reduce mortality.\n\nFurthermore, there were more deaths in the vaccine group than the placebo group in the Pfizer trial. There were 4X as many cardiac deaths in the treatment group. How do we know for sure that none of those deaths were caused by the vaccine? Has any health official anywhere in the world asked Pfizer to show us the histopathology that was done on the people who died in their trial that proves that the vaccine didn’t kill anyone in the treatment group? Of course not. When I asked Pfizer for that data, they ghosted me.\n\nSince there is not a more recent, comprehensive review paper, then the precautionary principle of medicine suggests that this paper should be controlling until such time as it is shown to be incorrect.\n\nThat’s how science is supposed to work.\n\nEvery health authority in the world should inform the public about this study NOW\n\nUnless they can cite a newer, more comprehensive review paper which reached the opposite conclusion, every health authority (including the CDC) should let everyone know about this paper.\n\nI’m sure they will all do this immediately, right? Just like they let the public know about the benefits of maintaining normal levels of Vitamin D.\n\nIf you have inadequate levels of vitamin D, you can reduce your risk of getting COVID substantially by fixing the deficiency.\n\nThe public health authorities did a stellar job of getting the word out on that one, didn’t they? I didn’t see a single public announcement. Did you?\n\nDr. Joe Mercola has been talking about Vitamin D for COVID for years. This is why he’s listed as the #1 misinformation spreader on the White House’s Disinformation Dozen list.\n\nI know a top scientist at the CDC (who is also an MD and MPH) who wanted the CDC to study vitamin D. She sent over 750 emails on the subject. She was ignored every time by her superiors. After 10 years at the agency, she is fed up; she is leaving the CDC next month.\n\nMy tweet about the paper\n\nHere’s my tweet about it.\n\nThe mainstream media has no responsibility to report this\n\nUnlike public health officials, the mainstream media has no public duty to report this.\n\nIn fact, the mainstream media will make sure NOBODY finds out about this review paper.\n\nThey will keep promoting the false narratives from the government no matter how many people are killed and no matter what the peer-reviewed science says. Nobody wants to lose their job over this!\n\nClinical & Experimental Immunology is a peer-reviewed medical journal covering clinical and translational immunology. The editor-in-chief is Leonie Taams. It is published by Oxford University Press on behalf of the British Society for Immunology, of which it is the official journal.\n\nOther reviews of this paper\n\nThere will be no apologies because science just doesn’t matter anymore.\n\nWhat do you think?\n\nIt’s now in the peer-reviewed scientific literature:\n\nThe mRNA vaccines are neither safe nor effective, but outright dangerous.\n\nAll of us misinformation spreaders were right after all.\n\nDon’t expect any apologies though. They will continue to defend the vaccines because otherwise they’ll look bad for recommending them in the first place.\n\nSo the public health officials, the mainstream medical community, and the mainstream media will all ignore this paper.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "\"The mRNA Vaccines are neither safe nor effective, but Outright Dangerous.\" - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** In case you missed it. Every health authority in …", "url": "https://www.globalresearch.ca/now-published-peer-reviewed-scientific-literature-mrna-vaccines-neither-safe-nor-effective-but-outright-dangerous/5811276", "site_name": "Global Research", "article:section": "English", "article:published_time": "2023-03-08T15:27:19+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/06/spencer-davis-rxTTNlar62o-unsplash-700x420.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/06/spencer-davis-rxTTNlar62o-unsplash-700x420.jpg", "image:width": "700", "image:height": "420"}, "tags": ["Science and Medicine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">ICYMI from paper in peer-reviewed literature: \"An abundance of studies has shown that the mRNA vaccines are neither safe nor effective, but outright dangerous.\" </p>\n<p>Every health authority (including the CDC) should let everyone know this new finding.<a href=\"https://t.co/afafLCU5ZI\">https://t.co/afafLCU5ZI</a></p>\n<p>— Steve Kirsch (@stkirsch) <a href=\"https://twitter.com/stkirsch/status/1631730672175046656?ref_src=twsrc%5Etfw\">March 3, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">Turni and Lefringhausen, Univ Queensland, comprehensive review concludes not safe for human use and more disturbing remarks on bias in the literature against any data or analysis not aligned with the false narrative. Cites our Bruno paper May 2021, 57 authors 17 countries. <a href=\"https://t.co/1MbuG8MUiq\">pic.twitter.com/1MbuG8MUiq</a></p>\n<p>— Peter A. McCullough, MD, MPH™ (@P_McCulloughMD) <a href=\"https://twitter.com/P_McCulloughMD/status/1573680144354607105?ref_src=twsrc%5Etfw\">September 24, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.opastpublishers.com/open-access-articles/covid19-vaccinesan-australian-review.pdf", "https://www.saveusnow.org.uk/covid-vaccine-scientific-proof-lethal", "https://www.nejm.org/doi/full/10.1056/nejmoa2110475", "https://stevekirsch.substack.com/p/new-vaers-analysis-reveals-hundreds", "https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD015477/full", "https://stevekirsch.substack.com/p/adverse-events-in-pfizer-trial-may", "https://stevekirsch.substack.com/p/pfizer-phase-3-clinical-trial-fraud", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7377789/", "https://www.cnn.com/2021/07/16/tech/misinformation-covid-facebook-twitter-white-house/index.html", "https://twitter.com/stkirsch/status/1631730672175046656?s=20", "https://t.co/afafLCU5ZI", "https://twitter.com/stkirsch/status/1631730672175046656?ref_src=twsrc%5Etfw", "https://t.co/1MbuG8MUiq", "https://twitter.com/P_McCulloughMD/status/1573680144354607105?ref_src=twsrc%5Etfw", "https://www.opastpublishers.com/open-access-articles/covid19-vaccinesan-australian-review.pdf", "https://www.globalresearch.ca/conservative-risk-benefit-analyses-decide-against-covid-19-vaccination/5802216", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://stevekirsch.substack.com/p/now-published-in-the-peer-reviewed?utm_source=post-email-title&publication_id=548354&post_id=106266142&isFreemail=true&utm_medium=email", "https://www.globalresearch.ca/author/steve-kirsch", "https://stevekirsch.substack.com/p/now-published-in-the-peer-reviewed?utm_source=post-email-title&publication_id=548354&post_id=106266142&isFreemail=true&utm_medium=email", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-03-08T15:27:19+00:00"}