{"result_id": "134038", "URL": "https://www.globalresearch.ca/the-misplaced-attacks-on-bridgens-speech-to-the-uk-parliament/5813850", "timestamp": "2023-04-25 15:17:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/the-misplaced-attacks-on-bridgens-speech-to-the-uk-parliament/5813850", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Misplaced Attacks on MP Andrew Bridgen's Speech on the COVID Vaccine to the UK Parliament", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nClick the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nOn March 17th 2023, Member of Parliament (MP) Andrew Bridgen made an important speech in the U.K. Parliament asking ministers to critically consider the risks as well as the benefits for the Covid vaccines. Bridgen is one of the only MPs to highlight vaccine safety concerns and has been suspended from the Conservative Party on supposedly unconnected but obviously spurious grounds.\n\nUnfortunately, there was almost nobody in the chamber to listen to his speech and it seems the Conservative Party or the Government ensured that not only the vast majority of Conservative but also Labour, Liberal, SNP and other MPs deserted the chamber as soon as he took the floor. Following protocol, the Government minister responsible for drug regulation, Will Quince MP, was present to respond; in this he stated (without challenging any of Bridgen’s detailed claims) the standard mantra that the vaccine was effective and safe and had saved “tens of thousands of lives” in the U.K.\n\nInevitably, instead of focusing on the details of the speech – most of which was based on either official data from U.K. Government agencies or from 2020 vaccine clinical trial data – the on-narrative media universally criticised Bridgen as a “conspiracy theorist” (see here, here and here) or spreading “dangerous misinformation” (see here, here and here). YouTube even removed the video of the speech that Bridgen had put up on his channel (although it did eventually reinstate it, perhaps after realising that censoring a speech that had been made in Parliament and could be read on Hansard was pretty futile).\n\nYou can see excerpts of and commentary on Mr. Bridgen’s speech (here) and what appears to be collusion between opposing party members in the U.K. Parliament to ‘empty the house’ on Dr. John Campbell’s YouTube channel.\n\nThe attacks against Bridgen continued and on March 23rd the BBC dedicated an entire one-hour radio show AntiSocial hosted by Adam Fleming on Radio 4 to attacking his speech. His guests were:\n• David Grimes – who had already declared that Bridgen was “spreading fiction“.\n• Marianna Spring (the BBC’s “Disinformation and Social Media Correspondent”) who has spent the last three years self-promoting her adopted role as a ‘debunker’ of information from Covid sceptics, much of which was subsequently proven to be true, while simultaneously proclaiming her victimhood at the hands of what she calls ‘conspiracy theorists’.\n• Brendan O’Neill, present as the token free speech advocate and not there to defend what Bridgen said but rather his right to say it. Indeed, O’Neill said (without any attempt to be specific) that some of what Mr. Bridgen said was “strongly misinformation”.\n• Professor Sir David Spiegelhalter, who has been a fierce defender of the ‘official’ Covid narrative and criticised the claims made by Bridgen; this formed the majority of the substantial content of the BBC radio show.\n\nYou can listen the AntiSocial radio show here.\n\nThe one person who should have been present to defend himself, but was curiously denied the opportunity, was Andrew Bridgen himself, who tweeted: “I was contacted by BBC Radio 4’s AntiSocial for a programme going out right now. They declined my offer to come on, even though, or perhaps because, they were talking about me. I sent them this statement instead.”\n\nGiven most of the AntiSocial radio show focused on Prof. Spiegelhalter’s criticisms of Bridgen’s data, these deserve close analysis and rebuttal, for the simple reason that on hearing Spiegelhalter’s one-sided commentary members of the public may be left with the impression that the attacks on Bridgen were wholly warranted, when they were not.\n\nFirst of all, although Spiegelhalter half-praised Bridgen for highlighting the need to look at the overall risk-benefit of the vaccines, he did not comment at all on any of the Government data (including the enormous economic costs of the vaccines) that Bridgen quoted in his speech. Similarly, and right from the start, the BBC and Spiegelhalter demonstrated bias by totally ignoring these and other important indisputable facts presented in Bridgen’s speech. Not only did the entire episode completely avoid any discussion of the Government’s own data, the existence of which appears to have been deliberately overlooked or censored across the entire mainstream media in spite of being of obvious interest to the public.\n\nDespite a long monologue, Spiegelhalter presented very little explicit criticism of Bridgen’s data and with regard to the comments he did make, it is a simple matter to show that it is Spiegelhalter, not Bridgen, who was actually misleading the public.\n\nOne specific piece of data formed the thrust of Spiegelhalter’s challenge. This was Bridgen’s claim that there was one serious adverse event (SAE) for every 800 people vaccinated. Spiegelhalter said this figure was from a paper “that had been the subject of a lot of criticism” suggesting to the audience that the paper was flawed, without really stating what the flaws were.\n\nIn academia, every major paper is (quite properly) subject to criticism. That’s what peer review is for. However, Bridgen was quoting the 1 in 800 figure from Fraiman et al., a peer-reviewed paper whose senior author is BMJ Senior Editor Dr. Peter Doshi and was published in the prestigious journal Vaccine (which we can only surmise probably knows something about vaccines). The paper showed that the vaccinated participants reported more SAEs than the placebo participants – on average 12.5 SAEs more per 10,000 participants, equating to the 1 in 800 figure. So, the figure wasn’t dreamt up by some fly-by-night author or ‘dodgy’ journal spreading disinformation. And the data used in the paper were those from the Pfizer and Moderna placebo-controlled, Phase 3 randomised clinical trials.\n\nWe strongly suspect the ‘criticisms’ that Spiegelhalter refers to stem largely from one unreliable source, rather than the many separate sources suggested by his use of the phrase “lot of criticism”. This source is Dr. Susan Oliver, whose supposed take-down of Fraiman et al. we have previously refuted in detail here.\n\nSpiegelhalter’s criticism of the 1 in 800 claim is extremely weak. He said the figure was misleading because it counted “the total number of events rather than the number of people experiencing at least one event”, with some people reporting multiple events. His criticism is unfounded because the authors had already accounted for this in the paper, wherein they describe (bold added):\n\nThird, without individual participant data, we could only compare the number of individuals hospitalised for COVID-19 against the number of serious AESI events, not the number of participants experiencing any serious AESI. Some individuals experienced multiple SAEs whereas hospitalised COVID-19 participants were likely only hospitalised once, biassing the analysis towards exhibiting net harm. To gauge the extent of this bias, we considered that there were 20% (Pfizer) and 34% (Moderna) more SAEs than participants experiencing any SAE.\n\nAs we can see, Fraiman et al. had already factored in the possibility of some people reporting multiple events by assuming, for the Pfizer vaccine, that there were 20% more SAEs reported than people reporting, and they assumed 34% more for Moderna. So, Spiegelhalter’s first criticism doesn’t hold water.\n\nThere are other reasons to contest Spiegelhalter’s claim that the 1 in 800 figure is exaggerated. The Fraiman paper only examined data which covered the primary two doses of each vaccine. If there is a 1 in 800 chance that a person with two doses will suffer at least one SAE, then it is reasonable to conclude that there is approximately a 1 in 400 chance that a person who has had four doses will suffer at least one SAE. The risk increases with each additional dose. In fact, the Government’s own data show that the adverse event rates worsen with the boosters, making the situation potentially worse than simply multiplying by the number of doses. Bridgen’s speech was about the risk of additional boosters; many of the people targeted for these will have had four doses already. Spiegelhalter failed to consider this in his claim that the 1 in 800 figure was exaggerated.\n\nIt is also important to note that the data in the Fraiman paper is from the 2020 Pfizer and Moderna clinical trials which were conducted on a young and generally healthy population, not those actually at significant risk of severe illness from SARS-CoV-2 (the aged and infirm, having been judged ineligible to participate). It is generally accepted that the frequency and range of adverse drug events is always greater in the elderly and frail. So, given these high rates of SAE in the young and healthy then it is reasonable to infer that the SAE rate in the older and more infirm, who are eligible for boosters, will be significantly higher. So, again, this points to an even greater current risk than 1 in 800.\n\nSpiegelhalter also sought to dismiss the number of reported SAEs in the vaccine arm of the Pfizer study as not being significantly different to the number reported in the placebo arm. This is because the total number of SAEs in the trial was quite small meaning that some of the 95% confidence intervals (CIs) had lower bounds less than one, as the authors clearly reported:\n\nIn the Pfizer trial, 52 serious AESI (27.7 per 10,000) were reported in the vaccine group and 33 (17.6 per 10,000) in the placebo group. This difference corresponds to a 57 % higher risk of serious AESI (RR 1.57 95% CI 0.98 to 2.54) and a risk difference of 10.1 serious AESI per 10,000 vaccinated participants (95% CI −0.4 to 20.6). In the Moderna trial, 87 serious AESI (57.3 per 10,000) were reported in the vaccine group and 64 (42.2 per 10,000) in the placebo group. This difference corresponds to a 36% higher risk of serious AESI (RR 1.36 95% CI 0.93 to 1.99) and a risk difference of 15.1 serious AESI per 10,000 vaccinated participants (95% CI −3.6 to 33.8). Combining the trials, there was a 43% higher risk of serious AESI (RR 1.43; 95% CI 1.07 to 1.92) and a risk difference of 12.5 serious AESI per 10,000 vaccinated participants (95% CI 2.1 to 22.9).\n\nIn our own (Bayesian) analysis of these data we showed that there was a 96% probability that the SAE rate for the combined Covid vaccines was higher than the SAE rate for those with the placebo and a 99.7% chance that serious adverse events of special interest were higher in the combined covid vaccines. There is a 90% probability the difference is greater than 1 in 2,500.\n\nIn summary, and contrary to what Spiegelhalter claims, the figure of 1 in 800 for the risk of serious adverse reaction to those people being targetted for the booster is, if anything, more than likely an underestimate.\n\nSpiegelhalter’s concern about the 1 in 800 figure was also the basis for his criticism of the claim Bridgen made about the number needed to vaccinate (NNV). However, the NNV figures quoted by Bridgen were based entirely on the U.K. Health Security Agency (UKHSA) presentation to the Joint Committee on Vaccination and Immunisation (JCVI) on October 25th 2022, published January 25th 2023. For example, Bridgen stated:\n\nThe Government’s own data show that, in healthy adults aged 50 to 59, it was necessary to give 256,400 booster jabs to prevent just one severe hospitalisation… For healthy 40 to 49-year-olds, that number increases to 932,500 who needed to be boosted to keep one Covid patient out of an intensive therapy unit… And for healthy 30 to 39-year-olds, no one knows the answer to the number needed to be boosted to prevent a serious hospitalisation because the Government’s own data say that there has never been such a case of this age group being put into intensive care due to the current variant of COVID-19.\n\nThe host of the radio show, Adam Fleming, suggested to Spiegelhalter that Bridgen’s use of the NNV numbers was “a crime against statistics” without explaining the basis for this comment. Ignoring the Government NNV figures that Bridgen correctly stated, Spiegelhalter instead implied that this figure was flawed because Bridgen had also used the 1 in 800 SAE estimate from the Fraiman paper to compare the number of people who would be hospitalised from the vaccine to the number saved from hospitalisation by the vaccine. This is indeed what Bridgen did, but this was an appropriate, not flawed, approach. For example, he said (bold added):\n\nThe Government’s own data show that, in healthy adults aged 50 to 59, it was necessary to give 256,400 booster jabs to prevent just one severe hospitalisation, putting 321 people into hospital with a serious side-effect from the booster, which includes, obviously, risk of death.\n\nThe 256,400 is the Government’s own figure for the number of ‘not at risk’ 50-59 year-olds who would need to be vaccinated to prevent one severe hospitalisation. To obtain the figure of 321 all Bridgen has done is divide 256,400 by 800 (the severe adverse event rate)! An entirely rational calculation, since it is reasonable to equate a serious adverse reaction with a hospitalisation.\n\nGiven that we have already established the 1 in 800 figure was reasonable (or even an underestimate), Spiegelhalter’s criticism here is nothing more than an attempt to divert attention away from the Government’s own alarming NNV figure. It should also be noted that the figure 321 is so large that even if the severe adverse event rate was overstated 100-fold the risks would still far outweigh the purported benefits in this age group (and bear in mind we are ignoring unknown longer-term effects in this analysis).\n\nIt seems that Spiegelhalter was aware he was on shaky grounds here because he followed up with a different (but extremely weak) attempt to downplay the NNV figure. He claimed that they were only high because they were based on a time when Covid was no longer prevalent – implying that the reason for this is because the vaccines had already done their job. Hence the data were then simply confirming that the vaccines were no longer needed for those age groups. But if that is the case, it merely supports the view that boosters are simply unnecessary and more likely to be net harmful.\n\nThe only other substantive criticism Spiegelhalter made was of Bridgen’s claim that the 63,000 excess deaths could have been caused by the vaccine. Spiegelhalter simply said that this was “dangerous misinformation” and that “there was absolutely no evidence of any link to the vaccines”. But the only ‘evidence’ Spiegelhalter provided that the excess was not due to the vaccines was to state the (incorrect) mantra that: “we know that ‘all cause mortality’ when age-adjusted is ‘lower in the vaccinated’”.\n\nThis claim is based on the flawed ONS data that has been thoroughly exposed here.\n\nIndeed, as was noted in our article, the Statistics Regulator agreed with us that the ONS data cannot be used to make comparisons between the mortality rate of the vaccinated against the unvaccinated. What makes it especially curious is that Spiegelhalter made this error, and spread misinformation, despite the fact that since 2020 he has been on the Board of the Statistics Authority!\n\nHis logic is difficult to understand. If the vaccines have done their job then that implies they have vastly reduced Covid mortality. But he also claims that all-cause mortality is lower in the vaccinated thus giving an immortality benefit. But given the very high vaccination rates in the elderly, who contribute nearly all deaths, how can this statement be true whilst all-cause mortality is in excess? Basically, nothing adds up.\n\nDespite the presence of Brendan O’Neill, whose written views especially with respect of lockdowns would appear to be directly at odds to those of Prof. Sir David Spiegelhalter, at no point did any member of the panel present a dissenting view to the position that Mr. Bridgen’s speech was misinformation. The entire episode of AntiSocial was essentially the empanelment of a single mind or opinion.\n\nDuring the show it was laughably notable that in response to a comment about a tweet by Greta Thunberg the host, Adam Fleming, cut off the conversation by saying it is inappropriate to opine about her tweets because she wasn’t present to explain her comments. It is therefore extremely ironic that Fleming set aside his entire one-hour program to proceed with one-sided dissection and discussion of the speech made by a sitting MP Andrew Bridgen whilst denying him the opportunity to be present to defend himself.\n\nThe absence of impartiality in Fleming’s radio show is obviously a clear breach of the BBC charter. Perhaps BBC licence-fee-payers will be so appalled at this that they might consider complaining against this latest abuse of their licence fee.\n\nStop Press: Some not unrelated eye-opening details of Prof Spiegelhalter’s background are presented in the Law, Health and Technology newsletter, which is worth a read.\n\nNote to readers: Please click the share button above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nUntil he retired in January, Norman Fenton was Professor in Risk Information Management at Queen Mary University of London.\n\nDr. Clare Craig is a diagnostic pathologist and Co-Chair of the HART group with Dr. Jonathan Engler.\n\nMartin Neil is Professor in Computer Science and Statistics at Queen Mary University of London.\n\nMr. Law is a pseudonym for the author of the Law, Health and Technology Newsletter.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Misplaced Attacks on MP Andrew Bridgen's Speech on the COVID Vaccine to the UK Parliament - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Click the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share …", "url": "https://www.globalresearch.ca/the-misplaced-attacks-on-bridgens-speech-to-the-uk-parliament/5813850", "site_name": "Global Research", "article:tag": "UK parliament", "article:section": "English", "article:published_time": "2023-03-28T15:49:27+00:00", "article:modified_time": "2023-03-28T17:42:48+00:00", "updated_time": "2023-03-28T17:42:48+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/03/bridgen-750x375.png.jpeg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/03/bridgen-750x375.png.jpeg", "image:width": "750", "image:height": "375"}, "tags": ["Europe", "Media Disinformation", "Science and Medicine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">Appalling that <a href=\"https://twitter.com/ABridgen?ref_src=twsrc%5Etfw\">@ABridgen</a> spreads these fictions in the houses of parliament – COVID vaccines saved about 14.4 millions lives worldwide between 2020 and 2021 alone, and are safe and effective. Maybe have a public enquiry to try and locate Bridgen's sense of shame instead.. <a href=\"https://t.co/DkmgZZJjl5\">pic.twitter.com/DkmgZZJjl5</a></p>\n<p>— Dr David Robert Grimes (@drg1985) <a href=\"https://twitter.com/drg1985/status/1637406177020477441?ref_src=twsrc%5Etfw\">March 19, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/WnFEnuAQmjQ\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/WnFEnuAQmjQ"}], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.andrewbridgen.com/parliament/andrew-bridgen-leads-debate-mrna-covid-19-booster", "https://bylinetimes.com/2023/02/21/whos-for-dinner-andrew-bridgen-the-conspiracy-theorists/", "https://www.newstatesman.com/comment/2023/01/andrew-bridgen-conspiracy-theorist-the-nhs", "https://fullfact.org/blog/2023/jan/andrew-bridgen-mps-false-claims-put-lives-at-risk/", "https://www.theguardian.com/politics/2023/jan/11/tory-mp-andrew-bridgen-loses-whip-over-covid-vaccine-comments", "https://www.independent.co.uk/news/uk/andrew-bridgen-rishi-sunak-simon-hart-covid-holocaust-b2260196.html", "https://www.msn.com/en-in/lifestyle/lifestylegeneral/no-10-refuses-to-say-if-sunak-uses-nhs-gp-he-says-he-is-registered-with-or-if-he-might-use-private-healthcare-in-future-%E2%80%93-uk-politics-live/amp/ar-AA16d0QZ", "https://hansard.parliament.uk/Commons/2023-03-17/debates/24E9387E-B440-4A32-8100-715A645F0F6D/MrnaCovid-19Booster?highlight=andrew%20bridgen#contribution-FD2F5DF6-A28D-43BB-87CC-40183CD3DDBD", "https://www.youtube.com/watch?v=JvSHD_n3Lyg", "https://www.youtube.com/watch?v=SpGcEf2yCok", "https://www.bbc.co.uk/sounds/play/m001k837", "https://twitter.com/drg1985/status/1637406177020477441?s=20", "https://inews.co.uk/news/long-reads/qanon-coronavirus-conspiracy-theories-online-abuse-journalism-reporting-799670", "https://twitter.com/ABridgen?ref_src=twsrc%5Etfw", "https://t.co/DkmgZZJjl5", "https://twitter.com/drg1985/status/1637406177020477441?ref_src=twsrc%5Etfw", "https://embed.podcasts.apple.com/gb/podcast/antisocial/id1630388287?i=1000605738307", "https://twitter.com/ABridgen/status/1639239258312507394?s=20", "https://pubmed.ncbi.nlm.nih.gov/36055877/", "https://wherearethenumbers.substack.com/p/response-to-susan-oliver-video", "https://wherearethenumbers.substack.com/p/response-to-susan-oliver-video", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1131409/appendix-1-of-jcvi-statement-on-2023-covid-19-vaccination-programme-8-november-2022.pdf", "https://wherearethenumbers.substack.com/p/the-latest-ons-data-on-deaths-by", "https://wherearethenumbers.substack.com/p/postmodern-science-delivers-immortality", "https://www.bbc.co.uk/contact/complaints", "https://lawhealthandtech.substack.com/p/the-attacks-on-bridgens-speech", "https://www.hartgroup.org/fda-approve-covid-vaccine-for-0-4-years/", "https://lawhealthandtech.substack.com/", "https://www.globalresearch.ca/conservative-risk-benefit-analyses-decide-against-covid-19-vaccination/5802216", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://wherearethenumbers.substack.com/p/the-misplaced-attacks-on-bridgens", "https://www.globalresearch.ca/author/norman-fenton", "https://www.globalresearch.ca/author/clare-craig", "https://www.globalresearch.ca/author/et-al", "https://wherearethenumbers.substack.com/p/the-misplaced-attacks-on-bridgens", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-03-28T15:49:27+00:00"}