{"result_id": "134031", "URL": "https://www.globalresearch.ca/estimated-50-americans-now-question-vaccine-safety/5798953", "timestamp": "2023-04-25 15:17:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/estimated-50-americans-now-question-vaccine-safety/5798953", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Covid-19 Shots: Estimated 50% of Americans Now Question Vaccine Safety", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThis week, we celebrate our 13th anniversary of Vaccine Awareness Week. Barbara Loe Fisher, cofounder and president of the National Vaccine Information Center (NVIC) summarizes some of the high and low points we’ve experienced over the past year\n\nThe Vaccine Adverse Event Reporting System (VAERS) has now logged over 1.4 million adverse events associated with the COVID-19 shots, including more than 30,000 deaths, half of which are from the United States. No other vaccine has ever caused as many injuries\n\nWhile the harms are undeniable, health authorities are still doing what they can to deny the risks associated with the COVID shots. The U.S. Centers for Disease Control and Prevention fought for 15 months to avoid releasing V-Safe data. The U.S. Food and Drug Administration is also refusing to release autopsy reports of those who died post-jab\n\nThe culture wars that are going on in the world are really about collectivism versus individualism. The globalist cabal are desperately trying to convince countries to adopt a collectivist philosophy, which they refer to as “prosociality,” and move away from respect for the individual and individual rights. Nowhere is this currently more apparent than in the medical field and public health policy\n\nThis week, we celebrate our 13th anniversary of Vaccine Awareness Week. In this video, Barbara Loe Fisher, cofounder and president of the National Vaccine Information Center (NVIC) — which celebrated its 40th anniversary as a nonprofit organization in April 2022 — summarizes some of the high and low points we’ve experienced over the past year.\n\nAs usual, I will match all donations made to the NVIC during this week, so it’s a great time to contribute, as each dollar you give will be doubled. As a company, we’ve supported the NVIC for 14 years. In 2023, it’ll be 15 years since I made the commitment to support this extraordinary charitable organization, which fights for protection of informed consent rights and medical freedom like no other.\n\nNeedless to say, it’s been a rough couple of years in terms of defending the human right to autonomy and medical freedom. Unconstitutional and dangerous COVID shot mandates have resulted in the greatest avalanche of medically-induced injuries ever seen. As explained by Fisher:\n\n“It was parents of DPT vaccine-injured children [who] launched the vaccine safety and informed consent movement in this country — the modern vaccine safety and informed consent movement — because, really, we owe a debt of gratitude to the parents, doctors and scientists back in the 1800s and early 1900s [who] rang the first warning bell about the risks associated with the smallpox vaccine — one of the most reactive vaccines that has ever been used — until the COVID shots.\n\nThe statistics in the Vaccine Adverse Event Reporting System (VAERS) on MedAlerts, which has been operating since 2003 … has logged in over 1.4 million adverse events associated with the COVID-19 shots and over 30,000 deaths. About 15,000 of those death reports are from the United States, because the VAER system also accepts reports from foreign countries that use U.S. vaccines.\n\nThere’s never been a vaccine that has generated that kind of adverse event reporting ever … at least since 1990 when they started [operating] VAERS. The VAER system was created under the [1986] National Childhood Vaccine Injury Act.\n\nThe VAER system was a unique contribution that we [parents of vaccine-injured children] made. We insisted [on] a centralized vaccine adverse event reporting system that was transparently open to the public, accessible by the public, and that the public could report reactions [to], not just doctors.\n\nThe 1.4 million adverse events associated with COVID ‘vaccines’ is the highest number ever reported for a vaccine since 1990, and comprises about half of all reports that have been made to VAERS since 1990. It’s a stunning statistic.\n\nIt’s something they cannot deny, even though they try to say, ‘Well, not everything that’s reported is causally associated with the vaccines.’ Of course, they don’t know how many are or are not. The stark fact that more than half of the reports in VAERS have been made for COVID-19 ‘vaccines’ is something that can’t be denied.”\n\nWhile the harms are undeniable, based on the statistics, health authorities are still doing what they can to deny the risks associated with the COVID shots. For example, the U.S. Centers for Disease Control and Prevention fought for 15 months to avoid releasing V-Safe data.1,2 They eventually lost the fight and the data confirm what we’re seeing in VAERS.\n\nThe U.S. Food and Drug Administration is also refusing to release autopsy reports,3 even though those reports can be de-identified. They also will not release de-identified information on myocarditis, which is strongly associated with the COVID shots.\n\n“When I look back at the last three years of this COVID pandemic, all I see are lies and cover-ups,” Fisher says. “It breaks my heart. We tried for many, many decades, we presented [information] to state legislatures, to the federal government, to the CDC, NIH [National Institutes of Health], FDA.\n\nI sat on government vaccine advisory committees begging them to do the science, the biological mechanism work that would inform the policy makers about what happens in the body when vaccines are injected. They refused to do that work so they could identify people who are genetically, biologically and environmentally at high risk for having a vaccine reaction.\n\nThey refused to reform the system that would take out the vaccine safety oversight mechanism from HHS [Health and Human Services], which has the legal responsibility for developing vaccines, for regulating vaccines, for making policy for vaccines, and also has the safety oversight mechanism.\n\nThere is so much corruption now in this mass vaccination system — because it has been hijacked by Pharma and because Congress refused to have oversight on the whole vaccine program. They have allowed Pharma to hijack the system … There were failures all along, for 40 years, failures to deal with the problem of conflicts of interest within the mass vaccination program …\n\nWhen I finally realized after several decades that they had absolutely no intention of fixing anything, or of learning, or trying to screen out people, that they didn’t care [about injuries] — that’s when I realized that this was a much bigger problem than I originally had thought when we were looking at just DPT vaccine …\n\nThese public-private partnerships that have grown and been allowed by Congress have corrupted the system. You cannot have the same people who are profiting from the product in charge of making policy, regulating and [conducting] oversight on the safety of the product.”\n\nObedient Self-Sacrifice Is the New Virtue\n\nFisher cites The Lancet Commission’s report on “Lessons for the Future of the COVID-19 Pandemic,”4 and an accompanying editorial, “COVID-19: The Case for Prosociality,”5 both of which are published in the October 8, 2022, issue of The Lancet. The Commission’s report politicizes the COVID pandemic response and both it and the editorial try to make a case for what the authors call “prosociality.”\n\n“What they want is for all countries to adopt a collectivist philosophy and move away from focusing on the individual,” Fisher explains. “The culture wars that are going on in the world are really about collectivism versus individualism. The United States of America was founded on the basic concept that the individual has rights which limit the power of the state.\n\nThat’s why we have a Bill of Rights in the U.S. Constitution, and why we have had in this country respect for freedom of thought, speech, conscience, religious belief and assembly — all of those things in the Bill of Rights that allow the individual to limit the power of the state.\n\nThese people, and I’m talking basically the World Health Organization, these folks want a major reorganization and a refocus on the collectivist ideology, which means that the individual is less important than the state. What they’re calling for is more power and more money to be given to the WHO so that future pandemics can be handled better.\n\nOne of the top things they focus on is the fact that in the societies that are more individualistic — like the U.S. and Europe, [and] have more civil liberties, more respect for the individual — there was disobedience. People protested, people would not agree uniformly to masking and lockdowns and vaccination.\n\nThey want more power and more money to create basically a quasi-world government that is led by WHO, by public health officials. Reading this report, I could not believe that they think they can get away with this. It is completely political. It is not scientific or medical.\n\nThey blame everybody but themselves for the pandemic response that has ruined economies, that has affected the mental health and the educational status of children and adults, and has caused such devastation …\n\nWe better start realizing that what happened with COVID had as much to do with politics and ideology as it did about a virus. If you look at the World Economic Forum (WEF), which has called for The Great Reset of society, it’s the same thing that was said in this Lancet Commission report.\n\nThey [authors of the report] talk about hiring more behavioral psychologists and others to persuade people to be more obedient the next time around. It’s really shocking.”\n\nSurveys now show trust in public health officials is on the decline, which should come as no surprise considering how they’ve flip-flopped on their policies and denied easily provable facts. One of the biggest lies perpetuated was that the COVID shots would prevent infection and transmission.\n\nEverybody assumed this was the case, as all other vaccines have been promoted as a way to prevent infection and transmission. Only those who actually read the FDA briefing document issued at the very beginning, like Fisher and I did, saw that manufacturers were only required to prove a 50% efficacy in preventing severe COVID disease — not in preventing infection and transmission.\n\n“Only if you looked at that would you realize, from the get-go, that they knew the vaccines were not going to prevent infection and transmission,” Fisher says.\n\nThey never tested it, and without testing, no claims can be made whatsoever. And yet that’s what they did. They claimed the shots would stop COVID, that you wouldn’t get sick or spread it to others. This was the sole premise behind the vaccine passports. Vaccination was supposed to be a way to make you “safe” to be around. They pushed this lie for all it was worth, knowing they didn’t have a scientific leg to stand on.\n\nAnother way by which health authorities deceived the public into thinking the shots would work like a traditional vaccine was by changing the very definition of a vaccine. No longer is a “vaccine” something that actually prevents infection and transmission of disease. Rather, it’s now defined as something that triggers an “immune response,” which may or may not prevent disease.\n\nClearly, they knew what they were doing and they developed a strategy to deceive the public in a variety of different ways.\n\nThey also misled people into thinking the shots were far more effective than they were by conflating relative and absolute risk. While the relative risk reduction was around 95%, the absolute risk reduction was below 1%.6 As noted by Fisher, the idea of vaccine-induced herd immunity is also terribly flawed, and we’ve certainly seen that with the COVID shots.\n\nThe U.S. is one of the few countries in the world that has pushed these lethal and completely useless COVID shots on young children. Fortunately, uptake in this age group has been low. As of July 20, 2022, only 2.8% of children under 5 had received at least one dose.7\n\nThat may soon change, however, as the CDC’s Advisory Committee on Immunization Practices (ACIP) unanimously voted, October 20, 2022, to add the COVID shot to the recommended CDC’s vaccination schedules for both children and adults.8\n\nThe day before that, October 19, ACIP also recommended the shots become part of the CDC’s Vaccines for Children Program (VFC),9 a federal entitlement program that pays for vaccines for children who don’t have insurance. So, clearly, the FDA and CDC have no intention of coming clean about the dangers of these shots.\n\nThey may have miscalculated their ability to keep people brainwashed, however. Fisher estimates that about half of the American population now question vaccination, and not just the COVID shots. The distrust is also spilling over into other vaccines.\n\nThe truth would be even more widespread were it not for Big Tech censoring public conversations about COVID and COVID shots that criticize government public health policies and laws. Yes, it’s illegal and unconstitutional for government officials to violate freedom of speech and censor by proxy, using private companies to do their dirty work, but they’re doing it anyway. Fisher continues:\n\n“One of the reasons they were successful too in these last three years is because they shut down all [dissenting voices] … There was an article published in The Lancet in March 2021, talking about how these anti-vaccine groups, these groups criticizing the COVID vaccine, how they were to blame for [public health officials] not being able to get everybody to line up and take this vaccine.\n\nNVIC was deplatformed in March 2021 by Facebook and Instagram. Then we were deplatformed by Twitter. Then we were deplatformed by YouTube. All of my commentaries for over a decade, completely gone.\n\nThen PayPal, in December 2021 … in the midst of our year-end fundraising campaign – without warning one night blocked all donations to NVIC, completely tanking our fundraising campaign.\n\nWe were completely taken off of social media in 2021. This hampers the ability of people who have history, who have knowledge, who have something to say from being able to communicate in the public square. Online access is the new 21st century public square. We’re completely blocked from communicating with the majority of people here or in other countries.”\n\nAround the World People Are Standing Up for Health Freedom\n\nBut despite the heavy-handed censorship, people around the world are still waking up to what’s happening. More and more people are starting to realize that the COVID pandemic wasn’t so much about responding to infectious disease as it was about manipulating people into accepting a new world order.\n\n“What has gladdened my heart in the last few years has been to see the millions of people who stood up in the physical public squares in London, Berlin, Rome and Amsterdam. In so many places around the world, including Canada, people stood up for their freedom, for their right to be able to assemble, to be able to have free speech and to be able to say no to a vaccine they considered too dangerous.\n\nYou can tell from reports, these [COVID] lessons-learned reports, that are coming out from big universities, these doctors are furious that a significant portion of the public dared to stand up in public and fight for their freedom. This is a good sign for us. It means that the spirit of freedom that lives in the hearts of so many people around the world is not dead. It is not gone.\n\nThis is something that we can build on because all we’re asking for is the right to have full information about these pharmaceutical products, and be able to make an informed and voluntary decision. Nobody’s telling people not to do it. Nobody’s telling people that you shouldn’t make vaccines.\n\nI believe in the free market system, and I believe that a product should be subject to the forces of the marketplace. It shouldn’t be forced on anybody. If people want the product, that’s their choice.\n\nBut they shouldn’t force people to do something that’s against their conscience, against their intellectual analysis of the product … People shouldn’t be forced to put their physical health at risk if they believe that they’re going to be harmed by it. That’s tyranny …\n\nWe get letters from people who were heads of their families, who were responsible for feeding and housing their families. They were made to make this Faustian choice between putting their health at risk by getting that vaccine … or of losing their job and not being able to provide for their family. Literally, families went bankrupt.\n\nOn top of all of this deception and cover up, they want to muzzle anybody who brings up these issues. If you don’t learn from your experience, you’re going to repeat it. This is why reports like the Lancet Commission report are so dangerous. All they want to do is more of the same, the next time around, and force more people to salute smartly.”\n\nThis update is not all doom and gloom, however. Fisher also brings some good news. Throughout the pandemic, the NVIC has been instrumental in alerting people about proposed COVID vaccine-related legislation in the U.S. — both good and bad — through the NVIC Advocacy Portal. When you sign up to the Portal, which is free, you receive information about vaccine-related bills moving in your state.\n\nOften NVIC issues position papers and talking points that you can use when speaking about proposed bills with your state legislators. Since NVIC launched the Advocacy Portal in 2010, their staff and volunteers have been working with families and educating state legislators about the need to protect informed consent rights in public health laws when it comes to vaccination.\n\nIn 2021, not a single state legislature successfully passed a COVID vaccine mandate. “That’s huge. I mean that’s really big considering how many other countries did it,” Fisher says.\n\nFor the 2022 legislative session, NVIC analyzed about 900 vaccine-related bills for the Portal, and the number of bills the NVIC supported were more than twice the number they opposed. That’s a record number of positive, freedom-affirming bills.\n\nThey included bills prohibiting COVID jab mandates for students, employees and patients. Some required exemptions to be available for employer COVID-19 vaccine mandates. Others prohibited discrimination over COVID-19 vaccination status.\n\n“We’re really proud of our record in the states because vaccine laws are state laws. I’m a big believer that you have to participate in government.\n\nOnly by showing up at the polls and voting for people who will affirm natural rights, human rights, civil liberties that are in the Bill of Rights, only by electing those kinds of people will we be able to function in society and protect it from becoming a collectivist society where the state is supreme and where individuals are devalued and individual rights are eliminated.\n\nI don’t believe in giving up on government. I believe the only thing that’s going to save us is to be involved in the system and pass laws that govern us that we can support.”\n\nThe full “NVIC 2022 Annual Report on U.S. State Vaccine Legislation” will be published Thursday, November 17, 2022, on Mercola.com and NVIC.org during this Vaccine Awareness Week.\n\nSeveral of the negative bills the NVIC opposed this legislative session were bills allowing doctors to persuade minor children as young as 11 years old to give informed consent to vaccination without the knowledge or consent of their parents. Washington, D.C., was the only jurisdiction that managed to pass such a dangerous bill, which is another good sign.\n\n“It’s great news,” Fisher says. “Again, it shows the education of the state legislators and it shows that they’re listening to their constituents. I think this is good news for all of us.\n\nIt shows that when you get active, when you take talking points to your legislators, when you have your facts straight and you sit down with the people that you elect and explain to them why it’s important to protect vaccine freedom of choice, most of them are listening. Not all, but many of them. Many more than they did before COVID, that’s for sure.”\n\nAgain, it’s people like you actually using the NVIC Advocacy Portal that has made these positive shifts a reality. It’s a profoundly useful and helpful tool that everyone can use. Keeping it going requires funding, however, which is why we have this fundraiser once a year, during which I double your donations.\n\nGoing forward, tools like the NVIC Advocacy Portal will only become more crucial, as the medical industry is clearly switching to the “vaccine” product model going forward. There are literally hundreds of new vaccines, both traditional and mRNA, in the research and development pipeline.\n\nThat’s what we’re up against. They’re going to have a “vaccine” for just about every disease, which violates every basic tenet of human biology and physiology. Genetically engineered pharmaceutical products like vaccines that manipulate the body’s cells and affect immune and brain function will never address the foundational issues that cause human disease, which is the failure to integrate ancestral lifestyle strategies and diets.\n\nOur genes have been modified over tens of thousands of years. They don’t shift overnight. Now you can do that with CRISPR/Cas9 technology, but it’s a profoundly risky venture that’s going to cause far more harm than good before they ever perfect it.\n\nPharma is going to switch to the vaccine model because vaccine manufacturers and vaccine administrators have no liability when people are harmed by a product labeled a “vaccine.” They can make and distribute these products that harm — and even kill — people and it won’t cost them a dime.\n\nThe main protection you have against that is to not volunteer your body for medical experimentation and to take action to protect your right to know and freedom to make voluntary medical decisions, especially decisions about using pharmaceutical products called “vaccines.” It is unfortunate, but true, that everyone who has received a COVID jab has participated in an uncontrolled medical experiment.\n\nSo, in closing, sign up for the NVIC Advocacy Portal and get involved in the legislative process. Also, please make a donation today — every dollar counts — to help the NVIC keep their life-saving educational and advocacy programs going for another year.\n\nStand Up for Your Right to Make Informed Vaccine Choices\n\nThe 13th Annual Vaccine Awareness Week from November 13 to November 19, 2022, will feature important information about vaccine science, policy and law that you can share with your family and friends.\n\nWith every donation you make during Vaccine Awareness Week, you can help support the legal right to make an informed, voluntary decision about vaccinations. During this week, we’ll match your donations up to $100,000 to the National Vaccine Information Center (NVIC), a nonprofit charity advocating for vaccine safety and informed consent rights since 1982.\n\nDuring the COVID pandemic, government has collaborated with pharmaceutical corporations, medical trade groups and businesses to promote COVID-19 vaccine mandates and has partnered with Silicon Valley and corporate media to censor public conversations about vaccination and health. It is critical that you take action now to protect your legal right to make informed, voluntary vaccine choices.\n\nThankfully, for 40 years NVIC has been providing the public with independent, well-referenced information on vaccination and advocating for the inclusion of vaccine safety and informed consent protections in public health policies and laws.\n\nNVIC’s work in state legislatures over the past decade through the free online NVIC Advocacy Portal is one big reason why no state legislature mandated the COVID vaccine in 2021 or 2022.\n\nJust before the U.S. Food and Drug Administration (FDA) granted vaccine manufacturers an Emergency Use Authorization (EUA) to distribute experimental mRNA COVID-19 vaccines in December 2020, NVIC sponsored the groundbreaking 5th International Public Conference on Vaccination: Protecting Health & Autonomy in the 21st Century featuring 51 speakers. You can watch or listen to the conference for free here.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid-19 Shots: Estimated 50% of Americans Now Question Vaccine Safety - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** This week, we celebrate our 13th anniversary of Vaccine …", "url": "https://www.globalresearch.ca/estimated-50-americans-now-question-vaccine-safety/5798953", "site_name": "Global Research", "article:tag": "VAERS", "article:section": "English", "article:published_time": "2022-11-14T08:15:56+00:00", "article:modified_time": "2022-11-14T08:16:37+00:00", "updated_time": "2022-11-14T08:16:37+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/08/covid-vaccine-injury-vaers.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/08/covid-vaccine-injury-vaers.jpg", "image:width": "800", "image:height": "417"}, "tags": ["USA", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://takecontrol.substack.com/p/cdc-data", "https://takecontrol.substack.com/p/missing-autopsies-of-post-covid-vaccine-deaths", "https://nvicadvocacy.org/members/", "https://nvicadvocacy.org/members/", "https://www.nvic.org/", "https://www.protectinghealthandautonomyinthe21stcentury.com/", "https://stevekirsch.substack.com/p/why-did-the-cdc-hide-the-v-safe-data", "https://www.icandecide.org/v-safe/", "https://thevaccinereaction.org/2022/10/fda-withholds-autopsy-results-of-those-who-died-after-covid-shots/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01585-9/fulltext", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)01761-5/fulltext", "https://blogs.bmj.com/bmj/2020/11/26/peter-doshi-pfizer-and-modernas-95-effective-vaccines-lets-be-cautious-and-first-see-the-full-data/", "https://www.kff.org/coronavirus-covid-19/issue-brief/covid-19-vaccination-rates-among-children-under-5-have-peaked-and-are-decreasing-just-weeks-into-their-eligibility/", "https://www.reuters.com/world/us/us-cdc-advisers-approve-adding-covid-shots-vaccine-schedules-2022-10-20/", "https://merylnass.substack.com/p/cdc-did-not-put-the-covid-vaccines", "https://docsend.com/view/s7gp74xwndyatqb6", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://articles.mercola.com/sites/articles/archive/2022/11/13/13th-vaccine-awareness-week.aspx?ui=7d4f35cff736f077b2ae4301813d0195449985379d483f57b37156f601517996&sd=20190616&cid_source=dnl&cid_medium=email&cid_content=art1HL&cid=20221113&cid=DM1285691&bid=1643977047", "https://www.globalresearch.ca/author/dr-mercola", "https://articles.mercola.com/sites/articles/archive/2022/11/13/13th-vaccine-awareness-week.aspx?ui=7d4f35cff736f077b2ae4301813d0195449985379d483f57b37156f601517996&sd=20190616&cid_source=dnl&cid_medium=email&cid_content=art1HL&cid=20221113&cid=DM1285691&bid=1643977047", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2022-11-14T08:15:56+00:00"}