{"result_id": "134044", "URL": "https://www.globalresearch.ca/covid-vaccine-intentional-effort-world-genocide/5804026", "timestamp": "2023-04-25 15:17:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-vaccine-intentional-effort-world-genocide/5804026", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "The COVID “Vaccine” Is an Intentional Effort at World Genocide", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nNever before have there been massive excess deaths following vaccination.\n\nNever before have there been children, young adults, athletes in their prime, entertainers, dropping dead “cause unknown” following vaccination.\n\nOf course, the cause is known. The leading doctors and medical scientists of our time–which excludes health agency bureaucrats, such as Fauci, who serve as marketing agents for Big Pharma and corrupt, politicized state medical boards and HMOs–have explained why and how the mRNA “vaccines,” which are not vaccines, kill, destroy the immune system, and cause health injuries. What is not known is why some die immediately after receiving the deadly substance, others a month later, and others remain, so far, alive. Some researchers think the content of the “vaccines” differed by lot, and some think some of the jabs were placebos for the purpose of producing an uninjured cadre to tout the safety of the jabs.\n\nProfessor Michel Chossudovsky has collected here a number of videos documenting the widespread sufferings and deaths of the vaccinated. It is not the unvaccinated who are “mysteriously” dropping dead all over the world. It is the vaccinated.\n\nYet the coverup continues. The western media–a collection of whores–are at work covering up for themselves as well as for Fauci, Biden, Bill Gates, Big Pharma, the FDA, NIH, CDC, and the utterly corrupt and irresponsible medical profession. Big Pharma and the FDA continue to push jabbing babies with the killer vaccine, and there are still parents so utterly stupid and insouciant that they participate in the murder of their own children.\n\nWith people all over the world so stupid and so blindly trusting of authority, we can see why the Satanic Bill Gates and Satanic Klaus Schwab are confident that they can succeed in reducing the world population and effecting their Great Reset.\n\nWhat do I mean when I say Gates and Schwab are Satanic? Think about it this way. From time to time when discussing the subject, someone will say that people can be so awful they can understand why some would want to genocide them. I ask them if they would be willing to push the genocide button, and they say “no.” They understand that they have no right to cause people’s deaths in behalf of their opinion or a climate or ideological agenda. The difference between them and Bill Gates and Klaus Schwab is that Gates and Schwab are willing and eager to push the genocide button. What is so horrifying is that this willingness has acquired a high moral position. Exterminating people has become the way to save the planet.\n\nThe perpetrators of this mass murder are confident that their crime is too huge to be recognized as such. Naive populations simply won’t believe that “their” governments would do this to them. No one wants to admit that they executed their own family members and their own children by blindly trusting “authorities” who had announced their genocide agenda in advance.\n\nIn the United States only a tiny percentage of the people have any idea what is happening. The time and energy of the population is used up in making ends meet and in entertaining themselves. They fall for one transparent crime after another. Whatever government announces they accept–President John Kennedy’s assassination, Senator Robert Kennedy’s assassination, the Gulf of Tonkin, 9/11, Saddam Hussein’s weapons of mass destruction, Covid pandemic, “safe and effective” Covid vaccine. They never learn.\n\nNow they face genocide, and they still haven’t learned.\n\nThe perpetrators of mass genocide are still in control.\n\nIf it is not genocide, tell me what it is when distinguished medical scientists warn in advance about the mRNA “vaccine” and are censored and punished;\n\n-when the inventor of the PCR “Covid test” [Kari Mullis, passed away in August 2019] stated that the test does not indicate the presence of the virus and is ignored,\n\n-when the evidence of the harmful effects of the “vaccine” are kept secret by Pfizer and the FDA,\n\n-when medical doctors are prevented from treating Covid with known cures such as Ivermectin and HCQ,\n\n-when pharmacies refuse to fill doctors’ prescriptions for the cures,\n\n-when illegal and unconstitutional mandates are used to force citizens under threat of loss of job to submit to being injected,\n\n-when no official attention is paid to the massive increase in excess deaths among the vaccinated,\n\n-when the media carries on a deceptive campaign of lies and propaganda?\n\nAmericans–indeed the world–are faced with a monstrous criminal enterprise. Do they have the strength and intelligence to recognize it?\n\nAre they going to do anything about it?\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nPaul Craig Roberts is a renowned author and academic, chairman of The Institute for Political Economy where this article was originally published. Dr. Roberts was previously associate editor and columnist for The Wall Street Journal. He was Assistant Secretary of the Treasury for Economic Policy during the Reagan Administration. He is a regular contributor to Global Research.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "The COVID “Vaccine” Is an Intentional Effort at World Genocide - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. ***   Never before have there been massive excess deaths …", "url": "https://www.globalresearch.ca/covid-vaccine-intentional-effort-world-genocide/5804026", "site_name": "Global Research", "article:tag": "vaccine genocide", "article:section": "English", "article:published_time": "2023-01-09T11:51:21+00:00", "article:modified_time": "2023-01-14T11:15:19+00:00", "updated_time": "2023-01-14T11:15:19+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/07/killer-covid-vaccine.png", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/07/killer-covid-vaccine.png", "image:width": "1280", "image:height": "1020"}, "tags": ["Law and Justice", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.globalresearch.ca/the-covid-killer-vaccine-people-are-dying-all-over-the-world-its-a-criminal-undertaking/5800358", "https://www.paulcraigroberts.org/2023/01/08/the-covid-vaccine-is-an-intentional-effort-at-world-genocide/", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://www.globalresearch.ca/author/paul-craig-roberts", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-01-09T11:51:21+00:00"}