{"result_id": "134010", "URL": "https://www.globalresearch.ca/canadians-organizing-citizen-led-inquiry-seek-accountability-covid-crimes/5815695", "timestamp": "2023-04-25 15:17:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/canadians-organizing-citizen-led-inquiry-seek-accountability-covid-crimes/5815695", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Canadians Are Organizing a Citizen-Led Inquiry to Seek Accountability for COVID Crimes", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nClick the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThe word is getting out that almost nothing is true about what governments and legacy media have been telling us concerning the COVID-19 disaster. Moreover, all the imposed remedies, but especially the global lockdowns and the gene-modifying injection procedures, are resulting in absolutely catastrophic effects whose full scale is basically still unfathomable in these increasingly apocalyptic times.\n\nSo far the world’s eight billion habitants have received about 14 billion shots collectively. Many will recognize that this worldwide jab fest is not good news at all. It is very bad news with enormous consequences for all of humanity and our posterity as well.\n\nThe governments of almost every one of the world’s 192 countries came up with similar sets of bad policies that have been doing the lion’s share of the damage constituting the manufactured COVID crisis. The simultaneous similarity of these consistently destructive policies indicate that some supranational initiative above the level of nation states has been mobilized to orchestrate our ongoing descent into tyranny. This descent kicked into high gear in the winter of 2020, but especially after the World Health Organization declared a global pandemic without sufficient credible evidence.\n\nHence the imperative of thinking globally while acting locally is absolutely apt right now when it comes to developing the collective muscle we need to stop the horrific continuing predations.\n\nHere and there citizens are organizing to initiate our own public inquiries into the genesis of the disaster we are living through. In Canada there is a “citizen-led inquiry” presently underway. The mission of the National Citizens Inquiry (NCI) is to investigate “Canada’s COVID-19 responses.” To advance this mission, a cross-country tour of citizen-appointed NCI Commissioners is underway.\n\nIt is my intention to participate in this process, including by giving expert testimony if and when I am called upon to do so. My intention is to send out regular dispatches on GlobalResearch.ca. I am checking my tires and updating my laptop to prepare myself to join the tour as it approaches Saskatchewan and then my home province of Alberta.\n\nThe principle that this inquiry is citizen-led, not government-led, is crucial to understanding the larger significance of what is taking place here in Canada. Government-led investigations are rarely credible when it comes to investigating suspected crimes committed by governments. Such investigations usually turn out to be whitewashes of the powerful and well connected. Very often the investigations turn into witch hunts directed at smearing the most effective critics of government policies and actions.\n\nThis pattern is almost perfectly illustrated by Trudeau’s outrageous effort to criminalize the Canadian Freedom Convoy movement and thereby distinguishing himself as a vigilant champion of law and order. In mid-February of 2022 Trudeau invoked Canada’s version of martial law. Trudeau’s purpose was to vanquish the Freedom Convoy by tactics like unleashing police violence on peaceful demonstrators on Parliament Hill and by seizing the bank accounts of some Truckers and their supporters.\n\nJustin appointed a very politicized Liberal Party judge and Trudeau family friend, Paul Rouleau, to lead in early 2023 a Commission charged to investigate whether the Canadian government had acted properly or not by imposing the highest level of emergency measures provisions on top of layer upon layer of prior COVID emergency measures. Variations of this same process have happened all over the world as the executive branches of government have seized vast new powers by suspending civil liberties in the name of fighting the celebrity virus.\n\nNot surprisingly the Liberal Party judge gave his friend Justin and his cronies a clean bill of health. Trudeau’s friend found the Trudeau government, Not Guilty. Nothing to see here folks, just keep moving along.\n\nSo in Canada the precedent is being set that we cannot count on governments to investigate their own crimes in instigating and worsening the manufactured COVID crisis and the subsequent manufactured crises flowing from the Mother of All Medical False Flags. We need local initiatives, national initiatives, regional initiatives and ultimately worldwide initiatives to get to the bottom of what has happened and to initiate the kind of juridical procedures necessary to stop this spree of serial Crimes Against Humanity.\n\nOnly trials, criminal verdicts when justified, and appropriate punishments will serve the cause of the kind of justice we desperately need right now as the rule of law continues to vanish day-by-day.\n\nIn late 2022 Preston Manning, founder of Canada’s Reform Party and the son of former Alberta Premier Ernest Manning, initiated the NCI in a press conference in Parliament’s press gallery in Ottawa. He explains very clearly the importance in these circumstances of not waiting for governments to investigate themselves.\n\nClick here to view the video\n\nThe following link contains some examples of the testimony gathered so far by the NCI: click here.\n\nI recommend particularly the testimony of Vincent Gircys, a retired senior police official in Ontario who has been working diligently with colleagues to clarify what the rule of law demands of police officers in these times. Constable Gircys had his bank account seized by the Trudeau government zealots in one of the most characteristic demonstrations of the fascistic tactics being developed to stifle legitimate dissent.\n\nThe testimony of Embalmer Laura Jeffey is gripping. Ms. Jeffrey is an exemplary model of a resolute whistle blower coming forward when all the public officials around and above her, refuse to honour their professional responsibilities and do the right thing.\n\nJournalist Rodney Palmer has presented a well documented assessment of the Canadian Broadcasting Corporation’s appalling refusal to investigate the COVID-19 scandal. He names names and chronicles explicitly the depth to which the CBC has fallen by renouncing its role as a public broadcaster. Palmer provides the evidentiary goods to prove that the CBC has become a purveyor of gross propaganda to serve the agenda of its thoroughly corrupt paymasters. Clearly we need a new public broadcaster to replace the now-thoroughly discredited CBC.\n\nNote to readers: Please click the share button above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nDr. Anthony Hall is currently Professor of Globalization Studies at University of Lethbridge in Alberta Canada. He has been a teacher in the Canadian university system since 1982. Dr. Hall, has recently finished a big two-volume publishing project at McGill-Queen’s University Press entitled “The Bowl with One Spoon”.\n\nHe is a Research Associate of the Centre for Research on Globalization (CRG).\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Canadians Are Organizing a Citizen-Led Inquiry to Seek Accountability for COVID Crimes - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Click the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share …", "url": "https://www.globalresearch.ca/canadians-organizing-citizen-led-inquiry-seek-accountability-covid-crimes/5815695", "site_name": "Global Research", "article:tag": "National Citizens Inquiry", "article:section": "English", "article:published_time": "2023-04-18T08:52:15+00:00", "article:modified_time": "2023-04-18T08:53:31+00:00", "updated_time": "2023-04-18T08:53:31+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/08/canada-covid-vaccine.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/08/canada-covid-vaccine.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Law and Justice", "Canada", "Police State & Civil Rights"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.globalresearch.ca/the-covid-killer-vaccine-people-are-dying-all-over-the-world-its-a-criminal-undertaking/5800358", "https://www.globalresearch.ca/canadians-organizing-citizen-led-inquiry-seek-accountability-covid-crimes/5815695/mail-184", "https://www.globalresearch.ca", "https://www.globalresearch.ca/canadians-organizing-citizen-led-inquiry-seek-accountability-covid-crimes/5815695/mail-2-55", "https://www.cpac.ca/episode?id=e2a8d178-36f3-4d33-8515-1ff3e4b12186", "https://nationalcitizensinquiry.ca/testimony-clips/", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://www.globalresearch.ca/author/anthony-j-hall", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-18T08:52:15+00:00"}