{"result_id": "134017", "URL": "https://www.globalresearch.ca/higher-infant-mortality-rates-linked-higher-number-vaccine-doses-new-study-confirms/5807731", "timestamp": "2023-04-25 15:17:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/higher-infant-mortality-rates-linked-higher-number-vaccine-doses-new-study-confirms/5807731", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Higher Infant Mortality Rates Linked to Higher Number of Vaccine Doses, New Study Confirms", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nA new peer-reviewed study found a positive statistical correlation between infant mortality rates (IMRs) and the number of vaccine doses received by babies — confirming findings made by the same researchers a decade ago.\n\nIn “Reaffirming a Positive Correlation Between Number of Vaccine Doses and Infant Mortality Rates: A Response to Critics,” published Feb. 2 in Cureus, authors Gary S. Goldman, Ph.D., an independent computer scientist, and Neil Z. Miller, a medical researcher, examined this potential correlation.\n\nTheir findings indicate a “positive correlation between the number of vaccine doses and IMRs is detectable in the most highly developed nations” — which, on average, administer the most vaccine doses to infants.\n\nThe authors replicated the results of a 2011 statistical analysis they conducted, and refuted the results of a recent paper that questioned those findings.\n\nMiller spoke to The Defender about the study and its implications for infant and childhood vaccination schedules.\n\nThe more doses, the higher the infant mortality rate\n\nIn 2011, Miller and Goldman published a peer-reviewed study in Human and Experimental Toxicology, which first identified a positive statistical correlation between IMRs and number of vaccine doses.\n\n“The infant mortality rate (IMR) is one of the most important indicators of the socio-economic well-being and public health conditions of a country. The U.S. childhood immunization schedule specifies 26 vaccine doses for infants aged less than 1 year — the most in the world — yet 33 nations have lower IMRs.\n\n“Using linear regression, the immunization schedules of these 34 nations were examined and a correlation coefficient of r = 0.70 (p < 0.0001) was found between IMRs and the number of vaccine doses routinely given to infants.”\n\nIn the above figures, “r” refers to the correlation coefficient, a number that ranges from -1 to 1. Any figure above zero is understood as a positive correlation, with figures between 0.6 and 0.79 considered a “strong” positive correlation, and 0.8 and above a “very strong” positive correlation.\n\nThe “p-value” indicates the extent to which the predictor’s value, in a linear regression analysis, is related to changes in the response variable.\n\nA p-value of 0.05 or below is considered statistically significant, and indicative that the predictor and the response variable are related to each other and move in the same direction.\n\nIn the same 2011 study, which used 2009 data, the researchers found the highest positive correlation in countries that administered the most vaccine doses to infants (between 21 and 26 months old).\n\n“Linear regression analysis of unweighted mean IMRs showed a high statistically significant correlation between increasing number of vaccine doses and increasing infant mortality rates, with r = 0.992 (p = 0.0009),” the researchers wrote.\n\n“In 2011, we published a study that found a counterintuitive, positive correlation, r = 0.70 (p < .0001), demonstrating that among the most highly developed nations (n = 30), those that require more vaccines for their infants tend to have higher infant mortality rates (IMRs).”\n\nHowever, “critics of the paper recently claimed that this finding is due to ‘inappropriate data exclusion,’ i.e., the failure to analyze the ‘full dataset’ of all 185 nations.”\n\n“A team of researchers recently read our study and found it ‘troublesome’ that it’s in the top 5% of all research outputs. They wrote a rebuttal to our paper to ‘correct past misinformation’ and to reduce the impact of vaccine hesitancy.\n\n“Their paper has not been published but it was posted on a preprint server.”\n\nMiller said he and Goldman “wrote our current paper to examine the various claims made by these critics, to assess the validity of their scientific methods and to perform new investigations to assess the reliability of our original findings.”\n\nThe original paper studied the U.S. and 29 other countries with better IMRs “to explore a potential association between the number of vaccine doses … and their IMRs,” finding a strong positive correlation.\n\nThe 10 researchers — Elizabeth G. Bailey, Ph.D., a biology assistant professor at Brigham Young University, and several students associated with her Bioinformatics Capstone course who wrote the rebuttal to Goldman and Miller’s 2011 analysis — combined “185 developed and Third World nations that have varying rates of vaccination and socioeconomic disparities” in their analysis.\n\n“One stated rationale behind Bailey’s reanalysis (and additional new investigations) is to reduce the impact of vaccine hesitancy, which ‘has intensified due to the rapid development and distribution of the COVID-19 vaccine,’” Goldman and Miller said. “They also appear to be targeting our study for a potential retraction.”\n\n“The critics select[ed] 185 nations and use linear regression to report a correlation between the number of vaccine doses and IMRs.\n\n“They also perform[ed] multiple linear regression analyses of the Human Development Index(HDI) vs. IMR with additional predictors and investigate IMR vs. percentage vaccination rates for eight different vaccines.”\n\nAccording to Miller, “Despite the presence of inherent confounding variables in their paper, a small, statistically significant positive correlation (r = 0.16, p < .03) is reported that corroborates the positive trend in our study (r = 0.70, p < .0001).”\n\nIn other words, there is still a positive correlation between the IMR and the number of vaccine doses, albeit weaker, among the 185 countries Miller’s critics studied.\n\nHowever, this positive correlation is “attenuated in the background noise of nations with heterogeneous socioeconomic variables that contribute to high rates of infant mortality, such as malnutrition, poverty, and substandard health care” — meaning that there are confounding factors in poorer nations that significantly contribute to their higher IMRs.\n\n“We both used linear regression to analyze a potential correlation between the number of vaccine doses and IMRs. However, we analyzed the 30 most highly developed nations with high vaccination rates (consistently above 90%) and uniformity of socioeconomic factors.\n\n“In contrast, our critics analyzed 185 nations with variable vaccination rates (ranging from less than 40% to greater than 90%) and heterogeneous socioeconomic factors.\n\n“By mixing highly developed and Third World nations in their analysis, our critics inadvertently introduced numerous confounders. For example, malnutrition, poverty, and substandard healthcare all contribute to infant mortality, confounding the data and rendering the results unreliable.”\n\nMiller and Goldman also conducted three other types of statistical analysis: odds radio, sensitivity and replication analyses. These tests confirmed their findings, as they wrote in their new paper:\n\n“Our odds ratio analysis conducted on the original dataset controlled for several variables. None of these variables lowered the correlation below 0.62, thus robustly confirming our findings.\n\n“Our sensitivity analysis reported statistically significant positive correlations between the number of vaccine doses and IMR when we expanded our original analysis from the top 30 to the 46 nations with the best IMRs.\n\n“Additionally, a replication of our original study using updated 2019 data corroborated the trend we found in our first paper (r = 0.45, p = .002).”\n\nPut differently, the new study, which used 2019 data, found a somewhat weaker positive correlation of .045, but nevertheless confirmed a connection between the number of infant vaccine doses and IMRs.\n\nMiller explained that, unlike the critics’ dataset of 185 countries, no adjustments for vaccination rates were necessary for his dataset, as “Vaccination rates in the countries that we analyzed generally ranged from 90-99%.”\n\nHe added that the odds ratio analysis considered 11 variables, including child poverty, and, “None of these variables lowered the correlation below 0.62.”\n\nSimilarly, said Miller, “In our sensitivity analysis, where we successively analyzed nations with worse IMRs than the United States, an additional 16 nations could have been included in the linear regression of IMRs versus the number of vaccine doses, and the findings would still have yielded a statistically significant positive correlation coefficient.”\n\nMiller told The Defender the positive correlation he and Goldman identified grew stronger when the data were limited to highly developed countries, which tend to require a larger number of doses:\n\n“When we replicated our 2009 study using 2019 data, we once again found a statistically significant positive correlation between the number of vaccine doses and IMRs. Although the correlation was less robust (r = 0.45, p = .002) than our original finding, it corroborated the direction of the trend initially reported.\n\n“When our 2019 linear regression analysis was limited to the top 20 nations, the correlation coefficient increased (r = 0.73, p < .0003), revealing a strong direct relationship between number of vaccine doses and IMRs.”\n\nMiller noted that his critics’ paper based its conclusions on results it found for “high” and “very high developed nations” as categorized by HDI.\n\nTheir paper stated, “A re-analysis of only highly or very highly developed countries similarly shows that human development index (HDI) explains the variability in IMR, and more recommended vaccine doses does not predict more infant death.”\n\nHowever, Goldman and Miller, in their new paper, challenged the use of HDI as a predictor of overall health in a country, noting that HDI looks only at “educational levels, income per capita, and life expectancy” and that multiple scholars have identified “severe misclassification in the categorization of low, medium, high, or very high human development countries.”\n\n“As we discuss in our paper, up to 34% of HDI-classified nations are misclassified due to three sources of error, so it is unreliable,” Miller told The Defender. “Although our critics reported a strong correlation between HDI and IMR, this reveals no specific health measures that might be positively or negatively influencing IMR.”\n\nMiller also noted, “An alternative index, the Human Life Indicator (HLI) was created to address HDI shortcomings. While Denmark was recently ranked fifth in the world by HDI, it fell to 27th place with HLI; the U.S. was recently ranked tenth by HDI while HLI ranked it 32nd.”\n\nIn summarizing the shortcomings of his critics’ study, Miller said:\n\n“It was inappropriate for our critics to combine data from nations with highly variable vaccination rates and heterogeneous socioeconomic factors.\n\n“In Third World nations, several factors contribute to a high infant mortality rate, thus when all 185 nations are analyzed (rather than limiting the analysis to the most highly developed homogenous nations), a positive correlation between number of vaccine doses and IMRs is attenuated or lost in the background noise of these other factors.”\n\nMiller previously studied the association between pediatric vaccines and sudden infant death, in a 2021 paper titled “Vaccines and sudden infant death: An analysis of the VAERS database 1990–2019 and review of the medical literature.”\n\nCommenting on the findings of that research, Miller said:\n\n“Of the 2,605 infant deaths reported to the Vaccine Adverse Event Reporting System (VAERS) from 1990 through 2019, 58% clustered within three days post-vaccination, and 78% occurred within seven days post-vaccination, confirming that infant deaths tend to occur in temporal proximity to vaccine administration.\n\n“The excess of deaths during these early post-vaccination periods was statistically significant (p < 0.00001).”\n\nCombined with the findings of his most recent paper, Miller argued that “Vaccines are not always safe and effective. Vaccine-related morbidity and mortality are more extensive than publicly acknowledged.”\n\n“In all nations, a causal relationship between vaccines and sudden infant deaths is rarely acknowledged. Yet, physiological studies have shown that infant vaccines can produce fever and inhibit the activity of 5-HT [serotonin] neurons in the medulla, causing prolonged apneas and interfering with auto-resuscitation.”\n\nMiller also highlighted the sequence in which vaccines are administered as a potential factor contributing to IMRs. He told The Defender:\n\n“Global health officials do not test the sequence of recommended vaccines nor their non-specific effects to confirm they provide the intended effects on child survival. More studies on this topic are necessary to determine the full impact of vaccinations on all-cause mortality.\n\n“In Third World nations, numerous studies indicate that DTP and inactivated polio (IPV) vaccines have an inverse safety profile, especially when administered out of sequence. Multiple vaccines administered concurrently have also been shown to increase mortality.”\n\nMiller said that based on his latest study, “We do not know whether it is the vaccinated or unvaccinated infants who are dying at higher rates.” However, he noted most nations in his sample “had 90-99% national vaccination coverage rates.”\n\n“In our paper, we provide plausible biological evidence that the observed correlation between IMRs and the number of vaccine doses routinely given to infants might be causal,” Miller said.\n\nAs a result, argued Miller, “more investigations regarding health outcomes of vaccinated versus unvaccinated populations … would be beneficial,” adding that “Health authorities in all nations have an obligation to determine whether their vaccination schedules are achieving desired goals.”\n\n“Much more research needs to be done in this field, but more studies will only achieve limited positive change until more individuals and families begin to make the connection between vaccines and adverse events,” Miller said.\n\n“Also, legislators and health authorities must permit people to accept or reject vaccines without intimidation or negative consequences.”\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nMichael Nevradakis, Ph.D., based in Athens, Greece, is a senior reporter for The Defender and part of the rotation of hosts for CHD.TV’s “Good Morning CHD.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Higher Infant Mortality Rates Linked to Higher Number of Vaccine Doses, New Study Confirms - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** A new peer-reviewed study found a positive statistical correlation …", "url": "https://www.globalresearch.ca/higher-infant-mortality-rates-linked-higher-number-vaccine-doses-new-study-confirms/5807731", "site_name": "Global Research", "article:section": "English", "article:published_time": "2023-02-08T14:35:35+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/02/infant-mortality-vaccine-doses-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/02/infant-mortality-vaccine-doses-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.cureus.com/articles/134233-reaffirming-a-positive-correlation-between-number-of-vaccine-doses-and-infant-mortality-rates-a-response-to-critics#!/", "https://childrenshealthdefense.org/defender/", "https://journals.sagepub.com/doi/10.1177/0960327111407644#con1", "https://www.bmj.com/about-bmj/resources-readers/publications/statistics-square-one/11-correlation-and-regression#:~:text=If%20we%20wish%20to%20label,the%20results%20should%20be%20considered.", "https://blog.minitab.com/en/adventures-in-statistics-2/how-to-interpret-regression-analysis-results-p-values-and-coefficients", "https://www.medrxiv.org/content/10.1101/2021.09.03.21263082v4", "https://biology.byu.edu/directory/liz-bailey", "https://childrenshealthdefense.org/defender_category/covid/", "https://hdr.undp.org/data-center/human-development-index", "https://phys.org/news/2018-11-wellbeing-populations-human-index.html", "https://www.sciencedirect.com/science/article/pii/S2214750021001268", "https://www.medalerts.org/vaersdb/index.php", "https://childrenshealthdefense.org/defender/infant-mortality-vaccine-doses/", "https://www.globalresearch.ca/author/michael-nevradakis", "https://childrenshealthdefense.org/defender/infant-mortality-vaccine-doses/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-02-08T14:35:35+00:00"}