{"result_id": "134007", "URL": "https://www.globalresearch.ca/japan-sees-major-push-back-against-big-pharma-corrupt-japanese-health-officials-who-covering-up-covid-19-mrna-vaccine-injuries-deaths-highest-excess-deaths-now-since-wwii/5812162", "timestamp": "2023-04-25 15:17:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/japan-sees-major-push-back-against-big-pharma-corrupt-japanese-health-officials-who-covering-up-covid-19-mrna-vaccine-injuries-deaths-highest-excess-deaths-now-since-wwii/5812162", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Japan Sees Major Push Back Against Big Pharma and Corrupt Japanese Health Officials Who Are Covering Up COVID-19 mRNA Vaccine Injuries and Deaths - Highest Excess Deaths Now Since WWII", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version)\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nHirofumi Yanagase is a Japanese politician who is a member of the House of Councillors of Japan.\n\n“Compared to 2021, the number of deaths has increased by more than 140,000. Compared to 2020, the number of deaths has increased by 210,000…the highest number since World War II”\n\n“Japan has been flooded with people complaining of feeling ill after receiving the COVID vaccine”\n\n“Amazingly, even though more than 2000 people have died after vaccination, more than 99% of these deaths cannot be evaluated”\n\n“According to our calculations, the percentage of reported deaths after COVID vaccine is more than 38 times higher in comparison with the flu vaccine”\n\nOut of more than 2000 deaths after COVID-19 vaccination, on March 10, 2023 a Japanese Ministry of Health panel made the first of a causal link between the death of a 42 year old woman and the COVID-19 vaccine (click here)\n\nThe woman received a Pfizer shot (bivalent) on Nov. 5, 2022 at a mass vaccination center. She felt sick seven minutes later, and her breathing stopped after about 15 minutes.\n\nThe woman was taken to a hospital but died of acute heart failure an hour and 40 minutes after receiving the COVID-19 shot. A postmortem CT scan showed that she had experienced acute pulmonary edema, a sudden buildup of fluid in the lungs, the report said.\n\n“From the data obtained from (CT) images, no abnormalities were found that could have caused the death other than the vaccine. All things considered, the direct causal link between the vaccination and the death cannot be denied,” the report said.\n\n“Today, we filed a lawsuit against the Japanese government” announced Dr. Masanori Fukushima during a press conference on February 2, 2023. Because the Japanese Health Ministry refuses to acknowledge the causal link between vaccines and deaths, Professor Fukushima and a team of researchers said they “had no choice but to dare to take legal action.” (click here)\n\nDr. Masanori Fukushima is an infectious disease expert and Professor Emeritus at Kyoto University — with over 25 years of oncology experience. He has been hammering at the cracks in the vaccine narrative and publicly condemned Japan’s Ministry of Health late last year.\n\n“Today, it is a matter of fundamental importance for the Japanese government to continuously collect and disclose accurate data,” Professor Fukushima expressed. “However, I have witnessed the recent fraud scandal committed by the Health Ministry.”\n\n“Japan cancels 140M dose order for Novavax Covid vaccine amid ‘lower than expected’ demand” (click here)\n\nThe country initially agreed in 2021 to purchase 150 million doses of the vaccine from Takeda, which has been producing Novavax’s vaccine at its Hikari-based facility. But after only purchasing 8.24 million doses, the Ministry of Health, Labour and Welfare has canceled the remaining 141.76 million doses.\n\n“We are seeing low market demand for Nuvaxovid, lower than expected given the current situation of vaccination in Japan and prevalence of Omicron,” Costa Saroukos, CFO at Takeda, said during the company’s Q3 call last week.\n\nCOVID-19 vaccine uptake in Japan is very high. Almost 69% of the population have had at least 3 doses. (click here)\n\nThe split is about 78% Pfizer and 22% Moderna (click here):\n\nJapan has effectively mRNA poisoned most of its population with 382 million doses of mRNA administered. Consequently, it now has the highest excess deaths since World War II.\n\nThousands of Japanese citizens have died shortly after taking a COVID-19 vaccine but Japan’s Ministry of Health continues to conduct cover-ups of these deaths, even when pathologists have determined a causal link between the death and the vaccine.\n\nHowever, brave individuals are pushing back in a big way. Leading the charge is Dr.Fukushima who is suing the Japanese government over COVID-19 vaccine adverse event cover-ups, as well as politician Hirofumi Yanagase who is openly calling out the Ministry of Health and paid government lackeys who are conducting cover-ups.\n\nSomeone must always make the first move. The first doctor. The first politician. Once these first steps are taken, a house build on a foundation of fraud and deceit cannot remain standing for long.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nDr. William Makis is a Canadian physician with expertise in Radiology, Oncology and Immunology. Governor General’s Medal, University of Toronto Scholar. Author of 100+ peer-reviewed medical publications.", "opengraph": {"locale": "en_US", "type": "article", "title": "Japan Sees Major Push Back Against Big Pharma and Corrupt Japanese Health Officials Who Are Covering Up COVID-19 mRNA Vaccine Injuries and Deaths - Highest Excess Deaths Now Since WWII - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version) To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** Hirofumi Yanagase is a Japanese politician who …", "url": "https://www.globalresearch.ca/japan-sees-major-push-back-against-big-pharma-corrupt-japanese-health-officials-who-covering-up-covid-19-mrna-vaccine-injuries-deaths-highest-excess-deaths-now-since-wwii/5812162", "site_name": "Global Research", "article:tag": "vaccine deaths", "article:section": "English", "article:published_time": "2023-03-16T02:25:15+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/11/JapanBansCovidVax_large.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/11/JapanBansCovidVax_large.jpg", "image:width": "1140", "image:height": "760"}, "tags": ["Asia", "Science and Medicine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">Japanese lawmaker Mr. Hirofumi, Yanagase speaks out:<br/>\"Just in the reported cases alone, there have been as many as 2001 cases of suspected vaccine-induced deaths. There are 52 cases where a pathologist has performed an autopsy and reported that there is a link between the… <a href=\"https://t.co/mOjaG00ZPm\">https://t.co/mOjaG00ZPm</a> <a href=\"https://t.co/dapwQ4RpyZ\">pic.twitter.com/dapwQ4RpyZ</a></p>\n<p>— ShortShort News (@ShortShort_News) <a href=\"https://twitter.com/ShortShort_News/status/1635358159622782976?ref_src=twsrc%5Etfw\">March 13, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://en.wikipedia.org/wiki/House_of_Councillors_(Japan)", "https://t.co/mOjaG00ZPm", "https://t.co/dapwQ4RpyZ", "https://twitter.com/ShortShort_News/status/1635358159622782976?ref_src=twsrc%5Etfw", "https://www.japantimes.co.jp/news/2023/03/10/national/japan-first-covid19-vaccine-death/", "https://dailyclout.io/japanese-researchers-sue-the-government-for-hiding-inconvenient-truths-about-the-jab/", "https://biography.omicsonline.org/united-states-of-america/cdisc/masanori-fukushima-300985", "https://endpts.com/japan-cancels-140m-dose-order-for-novavax-covid-vaccine-amid-lower-than-expected-demand/", "https://japan.kantei.go.jp/ongoingtopics/vaccine.html", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~JPN", "https://makismd.substack.com/p/japan-sees-major-push-back-against?utm_source=substack&utm_medium=email#play", "https://www.globalresearch.ca/author/william-makis", "https://makismd.substack.com/p/japan-sees-major-push-back-against?utm_source=substack&utm_medium=email#play", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-03-16T02:25:15+00:00"}