{"result_id": "134032", "URL": "https://www.globalresearch.ca/covid-19-vaccines-scientific-proof-lethality/5767711", "timestamp": "2023-04-25 15:17:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-19-vaccines-scientific-proof-lethality/5767711", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "COVID-19 Vaccines: Proof of Lethality. Over One Thousand Scientific Studies", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @globalresearch_crg.\n\nFirst published by Global Research on January 21, 2022\n\nSince the publication of this article, the number of studies has increased. The evidence is overwhelming.\n\nOver One Thousand Scientific Studies Prove That the COVID-19 Vaccines Are Dangerous, and All Those Pushing This Agenda Are Committing the Indictable Crime of Gross Misconduct in Public Office\n\nJust over 12 months from deployment of the COVID 19 emergency use experimental vaccines, scientific studies in the thousands, and reports of criminal complaints of assault and murder from the illegal, unlawful use of biochemical poisons made to police forces around the country, verify an assault on an unsuspecting UK population. Irrefutable science shows that the COVID 19 vaccine is not safe and not effective in limiting transmission or infection from the SARS-CoV-2, coronavirus pathogens.\n\nThe “safe and effective” false propaganda, put out by public officials who now are continuing to push this vaccine, is a clear breach of duty. A public office holder is subject to, and aware of, a duty to prevent death or serious injury that arises only by virtue of the functions of the public office.\n\nMany have breached that duty and, in doing so, are recklessly causing a risk of death or serious injury, by carrying on regardless of the now-confirmed dangers associated with COVID 19 injections. Some of these risks are blood clotting, myocarditis, pericarditis, thrombosis, thrombocytopenia, anaphylaxis, Bell’s palsy, Guillain-Barre, cancer including deaths, etc.\n\nAll of these are confirmed in the following science-and-government-gathered data from the UK Health and Security agency on COVID 19 regarding vaccine damage.\n\nThe term “vaccine” was changed recently to incorporate this illegal, unlawful medical experiment to facilitate usage of mRNA technology that is demonstrably not a vaccine, and which contains biologically toxic nano-metamaterials associated with 5G urban data gathering capability.\n\nMetal nanoparticulates are known in science to be genotoxic—a poison that can also cause sterilization. The dangers posed to the victims in the near term from this medical battery are now known. However, the long term lethality of this weapon is not as yet realized due to the debilitating effects it has on the immune system, causing Acquired Immunodeficiency Syndrome(AIDS).\n\nThe Medicines and Healthcare (products) Regulatory Agency (MHRA) had prior warning of the expected large numbers of adverse reactions before the deployment—confirming the premeditated nature of the crime and public conduct offences then and now.\n• Cerebral venous thrombosis after COVID-19 vaccination in the UK: a multicentre cohort study: https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01608-1/\n• Vaccine-induced immune thrombotic thrombocytopenia with disseminated intravascular coagulation and death after ChAdOx1 nCoV-19 vaccination: https://www.sciencedirect.com/science/article/pii/S1052305721003414\n• Three cases of acute venous thromboembolism in women after vaccination against COVID-19: https://www.sciencedirect.com/science/article/pii/S2213333X21003929\n• Acute thrombosis of the coronary tree after vaccination against COVID-19: https://www.sciencedirect.com/science/article/abs/pii/S1936879821003988\n• US case reports of cerebral venous sinus thrombosis with thrombocytopenia after vaccination with Ad26.COV2.S (against covid-19), March 2 to April 21, 2020: https://pubmed.ncbi.nlm.nih.gov/33929487/\n• Management of cerebral and splanchnic vein thrombosis associated with thrombocytopenia in subjects previously vaccinated with Vaxzevria (AstraZeneca): position statement of the Italian Society for the Study of Hemostasis and Thrombosis (SISET): https://pubmed.ncbi.nlm.nih.gov/33871350/\n• Vaccine-induced immune immune thrombotic thrombocytopenia and cerebral venous sinus thrombosis after vaccination with COVID-19; a systematic review: https://www.sciencedirect.com/science/article/pii/S0022510X21003014\n• Thrombosis with thrombocytopenia syndrome associated with COVID-19 vaccines: https://www.sciencedirect.com/science/article/abs/pii/S0735675721004381\n• Covid-19 vaccine-induced thrombosis and thrombocytopenia: a commentary on an important and practical clinical dilemma: https://www.sciencedirect.com/science/article/abs/pii/S0033062021000505\n• Thrombosis with thrombocytopenia syndrome associated with COVID-19 viral vector vaccines: https://www.sciencedirect.com/science/article/abs/pii/S0953620521001904\n• COVID-19 vaccine-induced immune-immune thrombotic thrombocytopenia: an emerging cause of splanchnic vein thrombosis: https://www.sciencedirect.com/science/article/pii/S1665268121000557\n• The roles of platelets in COVID-19-associated coagulopathy and vaccine-induced immune thrombotic immune thrombocytopenia (covid): https://www.sciencedirect.com/science/article/pii/S1050173821000967\n• Roots of autoimmunity of thrombotic events after COVID-19 vaccination: https://www.sciencedirect.com/science/article/abs/pii/S1568997221002160\n• Myocarditis after immunization with COVID-19 mRNA vaccines in members of the US military. This article reports that in “23 male patients, including 22 previously healthy military members, myocarditis was identified within 4 days after receipt of the vaccine”: https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601\n• Thrombosis and thrombocytopenia after vaccination with ChAdOx1 nCoV-19: https://www.nejm.org/doi/full/10.1056/NEJMoa2104882?query=recirc_curatedRelated_article\n• Association of myocarditis with the BNT162b2 messenger RNA COVID-19 vaccine in a case series of children: https://pubmed.ncbi.nlm.nih.gov/34374740/\n• Thrombocytopenia, including immune thrombocytopenia after receiving COVID-19 mRNA vaccines reported to the Vaccine Adverse Event Reporting System (VAERS): https://www.sciencedirect.com/science/article/pii/S0264410X21005247\n• Acute symptomatic myocarditis in seven adolescents after Pfizer-BioNTech COVID-19 vaccination: https://pediatrics.aappublications.org/content/early/2021/06/04/peds.2021-052478\n• Aphasia seven days after the second dose of an mRNA-based SARS-CoV-2 vaccine. Brain MRI revealed an intracerebral hemorrhage (ICBH) in the left temporal lobe in a 52-year-old man. https://www.sciencedirect.com/science/article/pii/S2589238X21000292#f0005\n• Comparison of vaccine-induced thrombotic episodes between ChAdOx1 nCoV-19 and Ad26.COV.2.S vaccines: https://www.sciencedirect.com/science/article/abs/pii/S0896841121000895\n• Hypothesis behind the very rare cases of thrombosis with thrombocytopenia syndrome after SARS-CoV-2 vaccination: https://www.sciencedirect.com/science/article/abs/pii/S0049384821003315\n• Blood clots and bleeding episodes after BNT162b2 and ChAdOx1 nCoV-19 vaccination: analysis of European data: https://www.sciencedirect.com/science/article/pii/S0896841121000937\n• Primary adrenal insufficiency associated with thrombotic immune thrombocytopenia induced by the Oxford-AstraZeneca ChAdOx1 nCoV-19 vaccine (VITT): https://www.sciencedirect.com/science/article/pii/S0953620521002363\n• Myocarditis and pericarditis after vaccination with COVID-19 mRNA: practical considerations for care providers: https://www.sciencedirect.com/science/article/pii/S0828282X21006243\n• “Portal vein thrombosis occurring after the first dose of SARS-CoV-2 mRNA vaccine in a patient with antiphospholipid syndrome”: https://www.sciencedirect.com/science/article/pii/S2666572721000389\n• Early results of bivalirudin treatment for thrombotic thrombocytopenia and cerebral venous sinus thrombosis after vaccination with Ad26.COV2.S: https://www.sciencedirect.com/science/article/pii/S0196064421003425\n• Mechanisms of immunothrombosis in vaccine-induced thrombotic thrombocytopenia (VITT) compared to natural SARS-CoV-2 infection: https://www.sciencedirect.com/science/article/abs/pii/S0896841121000706\n• Cerebral venous sinus thrombosis negative for anti-PF4 antibody without thrombocytopenia after immunization with COVID-19 vaccine in a non-comorbid elderly Indian male treated with conventional heparin-warfarin based anticoagulation: https://www.sciencedirect.com/science/article/pii/S1871402121002046\n• Thrombosis after COVID-19 vaccination: possible link to ACE pathways: https://www.sciencedirect.com/science/article/pii/S0049384821004369\n• Cerebral venous sinus thrombosis in the U.S. population after SARS-CoV-2 vaccination with adenovirus and after COVID-19: https://www.sciencedirect.com/science/article/pii/S0735109721051949\n• A rare case of a middle-aged Asian male with cerebral venous thrombosis after AstraZeneca COVID-19 vaccination: https://www.sciencedirect.com/science/article/pii/S0735675721005714\n• Cerebral venous sinus thrombosis and thrombocytopenia after COVID-19 vaccination: report of two cases in the United Kingdom: https://www.sciencedirect.com/science/article/abs/pii/S088915912100163X\n• Antiphospholipid antibodies and risk of thrombophilia after COVID-19 vaccination: the straw that breaks the camel’s back?: https://docs.google.com/document/d/1XzajasO8VMMnC3CdxSBKks1o7kiOLXFQ\n• Vaccine-induced thrombotic thrombocytopenia, a rare but severe case of friendly fire in the battle against the COVID-19 pandemic: What pathogenesis?: https://www.sciencedirect.com/science/article/pii/S0953620521002314\n• Diagnostic-therapeutic recommendations of the ad-hoc FACME expert working group on the management of cerebral venous thrombosis related to COVID-19 vaccination: https://www.sciencedirect.com/science/article/pii/S0213485321000839\n• Thrombocytopenia and intracranial venous sinus thrombosis after exposure to the “AstraZeneca COVID-19 vaccine”: https://pubmed.ncbi.nlm.nih.gov/33918932/\n• COVID-19 vaccination: information on the occurrence of arterial and venous thrombosis using data from VigiBase: https://pubmed.ncbi.nlm.nih.gov/33863748/\n• Cerebral venous thrombosis associated with the covid-19 vaccine in Germany: https://onlinelibrary.wiley.com/doi/10.1002/ana.26172\n• Cerebral venous thrombosis following BNT162b2 mRNA vaccination of BNT162b2 against SARS-CoV-2: a black swan event: https://pubmed.ncbi.nlm.nih.gov/34133027/\n• The importance of recognizing cerebral venous thrombosis following anti-COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34001390/\n• Blood clots and bleeding after BNT162b2 and ChAdOx1 nCoV-19 vaccination: an analysis of European data: https://pubmed.ncbi.nlm.nih.gov/34174723/\n• First dose of ChAdOx1 and BNT162b2 COVID-19 vaccines and thrombocytopenic, thromboembolic, and hemorrhagic events in Scotland: https://www.nature.com/articles/s41591-021-01408-4\n• First report of a de novo iTTP episode associated with a COVID-19 mRNA-based anti-COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34105244/\n• COVID-19 Vaccination Associated with Myocarditis in Adolescents: https://pediatrics.aappublications.org/content/pediatrics/early/2021/08/12/peds.2021-053427.full.pdf\n• Acute myocarditis after administration of BNT162b2 vaccine against COVID-19: https://pubmed.ncbi.nlm.nih.gov/33994339/\n• Temporal association between COVID-19 vaccine Ad26.COV2.S and acute myocarditis: case report and review of the literature: https://www.sciencedirect.com/science/article/pii/S1553838921005789\n• COVID-19 vaccine-induced myocarditis: a case report with review of the literature: https://www.sciencedirect.com/science/article/pii/S1871402121002253\n• Potential association between COVID-19 vaccine and myocarditis: clinical and CMR findings: https://www.sciencedirect.com/science/article/pii/S1936878X2100485X\n• Recurrence of acute myocarditis temporally associated with receipt of coronavirus mRNA disease vaccine 2019 (COVID-19) in a male adolescent: https://www.sciencedirect.com/science/article/pii/S002234762100617X\n• Fulminant myocarditis and systemic hyper inflammation temporally associated with BNT162b2 COVID-19 mRNA vaccination in two patients: https://www.sciencedirect.com/science/article/pii/S0167527321012286.\n• Myocarditis following vaccination with BNT162b2 in a healthy male: https://www.sciencedirect.com/science/article/pii/S0735675721005362\n• Acute myocarditis after Comirnaty (Pfizer) vaccination in a healthy male with previous SARS-CoV-2 infection: https://www.sciencedirect.com/science/article/pii/S1930043321005549\n• Temporal relationship between the second dose of BNT162b2 mRNA Covid-19 vaccine and cardiac involvement in a patient with previous SARS-COV-2 infection: https://www.sciencedirect.com/science/article/pii/S2352906721000622\n• Myopericarditis after vaccination with COVID-19 mRNA in adolescents 12 to 18 years of age: https://www.sciencedirect.com/science/article/pii/S0022347621007368\n• Important information on myopericarditis after vaccination with Pfizer COVID-19 mRNA in adolescents: https://www.sciencedirect.com/science/article/pii/S0022347621007496\n• A series of patients with myocarditis after vaccination against SARS-CoV-2 with mRNA-1279 and BNT162b2: https://www.sciencedirect.com/science/article/pii/S1936878X21004861\n• Epidemiology and clinical features of myocarditis/pericarditis before the introduction of COVID-19 mRNA vaccine in Korean children: a multicenter study https://search.bvsalud.org/global-literature-on-novel-coronavirus-2019-ncov/resourc e/en/covidwho-1360706.\n• Myocarditis and other cardiovascular complications of COVID-19 mRNA-based COVID-19 vaccines https://www.cureus.com/articles/61030-myocarditis-and-other-cardiovascular-comp lications-of-the-mrna-based-covid-19-vaccines https://www.cureus.com/articles/61030-myocarditis-and-other-cardiovascular-complications-of-the-mrna-based-covid-19-vaccines\n• Association of myocarditis with COVID-19 mRNA vaccine in children: https://media.jamanetwork.com/news-item/association-of-myocarditis-with-mrna-co vid-19-vaccine-in-children/\n• Association of myocarditis with COVID-19 messenger RNA vaccine BNT162b2 in a case series of children: https://jamanetwork.com/journals/jamacardiology/fullarticle/2783052\n• Myocarditis after immunization with COVID-19 mRNA vaccines in members of the U.S. military: https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601%5C\n• Myocarditis associated with vaccination with COVID-19 mRNA: https://pubs.rsna.org/doi/10.1148/radiol.2021211430\n• Cardiovascular magnetic resonance imaging findings in young adult patients with acute myocarditis after COVID-19 mRNA vaccination: a case series: https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-021-00795-4\n• Clinical Guidance for Young People with Myocarditis and Pericarditis after Vaccination with COVID-19 mRNA: https://www.cps.ca/en/documents/position/clinical-guidance-for-youth-with-myocarditis-and-pericarditis\n• Cardiac imaging of acute myocarditis after vaccination with COVID-19 mRNA: https://pubmed.ncbi.nlm.nih.gov/34402228/\n• Case report: acute myocarditis after second dose of mRNA-1273 SARS-CoV-2 mRNA vaccine: https://academic.oup.com/ehjcr/article/5/8/ytab319/6339567\n• The new COVID-19 mRNA vaccine platform and myocarditis: clues to the possible underlying mechanism: https://pubmed.ncbi.nlm.nih.gov/34312010/\n• Acute myocardial injury after COVID-19 vaccination: a case report and review of current evidence from the Vaccine Adverse Event Reporting System database: https://pubmed.ncbi.nlm.nih.gov/34219532/\n• Be alert to the risk of adverse cardiovascular events after COVID-19 vaccination: https://www.xiahepublishing.com/m/2472-0712/ERHM-2021-00033\n• Myocarditis associated with COVID-19 vaccination: echocardiographic, cardiac tomography, and magnetic resonance imaging findings: https://www.ahajournals.org/doi/10.1161/CIRCIMAGING.121.013236\n• In-depth evaluation of a case of presumed myocarditis after the second dose of COVID-19 mRNA vaccine: https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.121.056038\n• Occurrence of acute infarct-like myocarditis after COVID-19 vaccination: just an accidental coincidence or rather a vaccination-associated autoimmune myocarditis?: https://pubmed.ncbi.nlm.nih.gov/34333695/\n• Recurrence of acute myocarditis temporally associated with receipt of coronavirus mRNA disease vaccine 2019 (COVID-19) in a male adolescent: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8216855/\n• Self-limited myocarditis presenting with chest pain and ST-segment elevation in adolescents after vaccination with the BNT162b2 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34180390/\n• Biopsy-proven lymphocytic myocarditis after first COVID-19 mRNA vaccination in a 40-year-old man: case report: https://pubmed.ncbi.nlm.nih.gov/34487236/\n• Insights from a murine model of COVID-19 mRNA vaccine-induced myopericarditis: could accidental intravenous injection of a vaccine induce myopericarditis https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab741/6359059\n• Perimyocarditis after the first dose of mRNA-1273 SARS-CoV-2 (Modern) mRNA-1273 vaccine in a young healthy male: case report: https://bmccardiovascdisord.biomedcentral.com/articles/10.1186/s12872-021-02183\n• Acute myocarditis after the second dose of SARS-CoV-2 vaccine: serendipity or causal relationship: https://pubmed.ncbi.nlm.nih.gov/34236331/\n• Rhabdomyolysis and fasciitis induced by the COVID-19 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34435250/\n• GM1 ganglioside antibody and COVID-19-related Guillain Barre syndrome: case report, systemic review, and implications for vaccine development: https://www.sciencedirect.com/science/article/pii/S2666354621000065\n• Sensory Guillain-Barré syndrome after ChAdOx1 nCov-19 vaccine: report of two cases and review of the literature: https://www.sciencedirect.com/science/article/pii/S0165572821002186\n• Guillain-Barré syndrome after the first dose of SARS-CoV-2 vaccine: a temporary occurrence, not a causal association: https://www.sciencedirect.com/science/article/pii/S2214250921000998.\n• Guillain-Barré syndrome presenting as facial diplegia after vaccination with COVID-19: a case report: https://www.sciencedirect.com/science/article/pii/S0736467921006442\n• Guillain-Barré syndrome after the first injection of ChAdOx1 nCoV-19 vaccine: first report: https://www.sciencedirect.com/science/article/pii/S0035378721005853.\n• SARS-CoV-2 vaccines are not safe for those with Guillain-Barre syndrome following vaccination: https://www.sciencedirect.com/science/article/pii/S2049080121005343\n• Acute hyperactive encephalopathy following COVID-19 vaccination with dramatic response to methylprednisolone: a case report: https://www.sciencedirect.com/science/article/pii/S2049080121007536\n• Facial nerve palsy following administration of COVID-19 mRNA vaccines: analysis of self-report database: https://www.sciencedirect.com/science/article/pii/S1201971221007049\n• Neurological symptoms and neuroimaging alterations related to COVID-19 vaccine: cause or coincidence: https://www.sciencedirect.com/science/article/pii/S0899707121003557.\n• Bell’s palsy after the second dose of the Pfizer COVID-19 vaccine in a patient with a history of recurrent Bell’s palsy: https://www.sciencedirect.com/science/article/pii/S266635462100020X\n• An academic hospital experience assessing the risk of COVID-19 mRNA vaccine using patient’s allergy history: https://www.sciencedirect.com/science/article/pii/S2213219821007972\n• COVID-19 vaccine-induced rhabdomyolysis: case report with review of the literature: https://www.sciencedirect.com/science/article/pii/S1871402121001880\n• Clinical and pathologic correlates of skin reactions to COVID-19 vaccine, including V-REPP: a registry-based study: https://www.sciencedirect.com/science/article/pii/S0190962221024427\n• Thrombosis with thrombocytopenia syndrome associated with COVID-19 vaccines:. https://www.sciencedirect.com/science/article/abs/pii/S0735675721004381.\n• COVID-19 vaccine-associated anaphylaxis: a statement from the Anaphylaxis Committee of the World Allergy Organization:. https://www.sciencedirect.com/science/article/pii/S1939455121000119.\n• Cerebral venous sinus thrombosis negative for anti-PF4 antibody without thrombocytopenia after immunization with COVID-19 vaccine in an elderly, non-comorbid Indian male treated with conventional heparin-warfarin-based anticoagulation:. https://www.sciencedirect.com/science/article/pii/S1871402121002046.\n• Acute myocarditis after administration of BNT162b2 vaccine against COVID-19:. https://www.sciencedirect.com/science/article/abs/pii/S188558572100133X\n• Blood clots and bleeding after BNT162b2 and ChAdOx1 nCoV-19 vaccine: an analysis of European data:. https://www.sciencedirect.com/science/article/pii/S0896841121000937.\n• Bullous drug eruption after the second dose of COVID-19 mRNA-1273 (Moderna) vaccine: Case report: https://www.sciencedirect.com/science/article/pii/S1876034121001878.\n• COVID-19 RNA-based vaccines and the risk of prion disease: https://scivisionpub.com/pdfs/covid19rna-based-vaccines-and-the-risk-of-prion-dis ease-1503.pdf\n• This study notes that 115 pregnant women lost their babies, out of 827 who participated in a study on the safety of covid-19 vaccines: https://www.nejm.org/doi/full/10.1056/NEJMoa2104983.\n• Allergic reactions, including anaphylaxis, after receiving the first dose of the Pfizer-BioNTech COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33475702/\n• Allergic reactions to the first COVID-19 vaccine: a potential role of polyethylene glycol: https://pubmed.ncbi.nlm.nih.gov/33320974/\n• Allergic reactions, including anaphylaxis, after receiving the first dose of Pfizer-BioNTech COVID-19 vaccine – United States, December 14-23, 2020: https://pubmed.ncbi.nlm.nih.gov/33444297/\n• Allergic reactions, including anaphylaxis, after receiving first dose of Modern COVID-19 vaccine – United States, December 21, 2020-January 10, 2021: https://pubmed.ncbi.nlm.nih.gov/33507892/\n• Reports of anaphylaxis after receiving COVID-19 mRNA vaccines in the U.S.-Dec 14, 2020-Jan 18, 2021: https://pubmed.ncbi.nlm.nih.gov/33576785/\n• Immunization practices and risk of anaphylaxis: a current, comprehensive update of COVID-19 vaccination data: https://pubmed.ncbi.nlm.nih.gov/34269740/\n• Relationship between pre-existing allergies and anaphylactic reactions following administration of COVID-19 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34215453/\n• Anaphylaxis Associated with COVID-19 mRNA Vaccines: Approach to Allergy Research: https://pubmed.ncbi.nlm.nih.gov/33932618/\n• Severe Allergic Reactions after COVID-19 Vaccination with the Pfizer / BioNTech Vaccine in Great Britain and the USA: Position Statement of the German Allergy Societies: German Medical Association of Allergologists (AeDA), German Society for Allergology and Clinical Immunology (DGAKI) and Society for Pediatric Allergology and Environmental Medicine (GPA): https://pubmed.ncbi.nlm.nih.gov/33643776/\n• Reported orofacial adverse effects from COVID-19 vaccines: the known and the unknown: https://pubmed.ncbi.nlm.nih.gov/33527524/\n• Cumulative adverse event report of anaphylaxis following injections of COVID-19 mRNA vaccine (Pfizer-BioNTech) in Japan: the first month report: https://pubmed.ncbi.nlm.nih.gov/34347278/\n• Biphasic anaphylaxis after exposure to the first dose of the Pfizer-BioNTech COVID-19 mRNA vaccine COVID-19: https://pubmed.ncbi.nlm.nih.gov/34050949/\n• Allergenic components of the mRNA-1273 vaccine for COVID-19: possible involvement of polyethylene glycol and IgG-mediated complement activation: https://pubmed.ncbi.nlm.nih.gov/33657648/\n• Polyethylene glycol (PEG) is a cause of anaphylaxis to Pfizer / BioNTech mRNA COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33825239/\n• Polyethylene glycole allergy of the SARS CoV2 vaccine recipient: case report of a young adult recipient and management of future exposure to SARS-CoV2: https://pubmed.ncbi.nlm.nih.gov/33919151/\n• Elevated rates of anaphylaxis after vaccination with Pfizer BNT162b2 mRNA vaccine against COVID-19 in Japanese healthcare workers; a secondary analysis of initial post-approval safety data: https://pubmed.ncbi.nlm.nih.gov/34128049/\n• Allergic reactions and adverse events associated with administration of mRNA-based vaccines. A health system experience: https://pubmed.ncbi.nlm.nih.gov/34474708/\n• Allergic reactions to COVID-19 vaccines: statement of the Belgian Society of Allergy and Clinical Immunology (BelSACI): https://www.tandfonline.com/doi/abs/10.1080/17843286.2021.1909447\n• .IgE-mediated allergy to polyethylene glycol (PEG) as a cause of anaphylaxis to COVID-19 mRNA vaccines: https://pubmed.ncbi.nlm.nih.gov/34318537/\n• Allergic reactions after COVID-19 vaccination: putting the risk in perspective: https://pubmed.ncbi.nlm.nih.gov/34463751/\n• Anaphylactic reactions to COVID-19 mRNA vaccines: a call for further studies: https://pubmed.ncbi.nlm.nih.gov/33846043/ 188.\n• Risk of severe allergic reactions to COVID-19 vaccines among patients with allergic skin disease: practical recommendations. An ETFAD position statement with external experts: https://pubmed.ncbi.nlm.nih.gov/33752263/\n• COVID-19 vaccine and death: causality algorithm according to the WHO eligibility diagnosis: https://pubmed.ncbi.nlm.nih.gov/34073536/\n• A case series of skin reactions to COVID-19 vaccine in the Department of Dermatology at Loma Linda University: https://pubmed.ncbi.nlm.nih.gov/34423106/\n• Skin reactions reported after Moderna and Pfizer’s COVID-19 vaccination: a study based on a registry of 414 cases: https://pubmed.ncbi.nlm.nih.gov/33838206/\n• Clinical and pathologic correlates of skin reactions to COVID-19 vaccine, including V-REPP: a registry-based study: https://pubmed.ncbi.nlm.nih.gov/34517079/\n• Skin reactions after vaccination against SARS-COV-2: a nationwide Spanish cross-sectional study of 405 cases: https://pubmed.ncbi.nlm.nih.gov/34254291/\n• Varicella zoster virus and herpes simplex virus reactivation after vaccination with COVID-19: review of 40 cases in an international dermatologic registry: https://pubmed.ncbi.nlm.nih.gov/34487581/\n• Immune thrombosis and thrombocytopenia (VITT) associated with the COVID-19 vaccine: diagnostic and therapeutic recommendations for a new syndrome: https://pubmed.ncbi.nlm.nih.gov/33987882/\n• Intracerebral hemorrhage due to thrombosis with thrombocytopenia syndrome after COVID-19 vaccination: the first fatal case in Korea: https://pubmed.ncbi.nlm.nih.gov/34402235/\n• Risk of thrombocytopenia and thromboembolism after covid-19 vaccination and positive SARS-CoV-2 tests: self-controlled case series study: https://pubmed.ncbi.nlm.nih.gov/34446426/\n• Nerve and muscle adverse events after vaccination with COVID-19: a systematic review and meta-analysis of clinical trials: https://pubmed.ncbi.nlm.nih.gov/34452064/.\n• A rare case of cerebral venous thrombosis and disseminated intravascular coagulation temporally associated with administration of COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33917902/\n• Primary adrenal insufficiency associated with thrombotic immune thrombocytopenia induced by Oxford-AstraZeneca ChAdOx1 nCoV-19 vaccine (VITT): https://pubmed.ncbi.nlm.nih.gov/34256983/\n• Acute cerebral venous thrombosis and pulmonary artery embolism associated with the COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34247246/.\n• Thromboaspiration infusion and fibrinolysis for portomesenteric thrombosis after administration of AstraZeneca COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34132839/\n• 59-year-old woman with extensive deep venous thrombosis and pulmonary thromboembolism 7 days after a first dose of Pfizer-BioNTech BNT162b2 mRNA vaccine COVID-19: https://pubmed.ncbi.nlm.nih.gov/34117206/\n• Cerebral venous thrombosis and vaccine-induced thrombocytopenia.a. Oxford-AstraZeneca COVID-19: a missed opportunity for a rapid return on experience: https://pubmed.ncbi.nlm.nih.gov/34033927/\n• Myocarditis and other cardiovascular complications of mRNA-based COVID-19 vaccines: https://pubmed.ncbi.nlm.nih.gov/34277198/\n• Unusual presentation of acute pericarditis after vaccination against SARS-COV-2 mRNA-1237 Modern: https://pubmed.ncbi.nlm.nih.gov/34447639/\n• Case report: acute myocarditis after second dose of SARS-CoV-2 mRNA-1273 vaccine mRNA-1273: https://pubmed.ncbi.nlm.nih.gov/34514306/\n• Immune-mediated disease outbreaks or recent-onset disease in 27 subjects after mRNA/DNA vaccination against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/33946748/\n• Insights from a murine model of myopericarditis induced by COVID-19 mRNA vaccine: could accidental intravenous injection of a vaccine induce myopericarditis: https://pubmed.ncbi.nlm.nih.gov/34453510/\n• Thrombosis with thrombocytopenia syndrome (TTS) following AstraZeneca ChAdOx1 nCoV-19 (AZD1222) COVID-19 vaccination: risk-benefit analysis for persons <60 years in Australia: https://pubmed.ncbi.nlm.nih.gov/34272095/\n• The association between COVID-19 vaccination and Bell’s palsy: https://pubmed.ncbi.nlm.nih.gov/34411533/\n• Acute transverse myelitis (ATM): clinical review of 43 patients with COVID-19-associated ATM and 3 serious adverse events of post-vaccination ATM with ChAdOx1 nCoV-19 vaccine (AZD1222): https://pubmed.ncbi.nlm.nih.gov/33981305/\n• Sequential contralateral facial nerve palsy after first and second doses of COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34281950/.\n• Facial nerve palsy after administration of COVID-19 mRNA vaccines: analysis of self-report database: https://pubmed.ncbi.nlm.nih.gov/34492394/\n• Transient oculomotor paralysis after administration of RNA-1273 messenger vaccine for SARS-CoV-2 diplopia after COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34369471/\n• A case of acute demyelinating polyradiculoneuropathy with bilateral facial palsy following ChAdOx1 nCoV-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34272622/\n• Guillian Barré syndrome after vaccination with mRNA-1273 against COVID-19: https://pubmed.ncbi.nlm.nih.gov/34477091/\n• Acute facial paralysis as a possible complication of SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/33975372/.\n• Bell’s palsy after COVID-19 vaccination with high antibody response in CSF: https://pubmed.ncbi.nlm.nih.gov/34322761/.\n• Parsonage-Turner syndrome associated with SARS-CoV-2 or SARS-CoV-2 vaccination. Comment on: “Neuralgic amyotrophy and COVID-19 infection: 2 cases of accessory spinal nerve palsy” by Coll et al. Articular Spine 2021; 88: 10519: https://pubmed.ncbi.nlm.nih.gov/34139321/.\n• Acute autoimmune-like hepatitis with atypical antimitochondrial antibody after vaccination with COVID-19 mRNA: a new clinical entity: https://pubmed.ncbi.nlm.nih.gov/34293683/.\n• A novel case of bifacial diplegia variant of Guillain-Barré syndrome after vaccination with Janssen COVID-19: https://pubmed.ncbi.nlm.nih.gov/34449715/\n• Comparison of vaccine-induced thrombotic events between ChAdOx1 nCoV-19 and Ad26.COV.2.S vaccines: https://pubmed.ncbi.nlm.nih.gov/34139631/.\n• Bilateral superior ophthalmic vein thrombosis, ischemic stroke and immune thrombocytopenia after vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/33864750/\n• Diagnosis and treatment of cerebral venous sinus thrombosis with vaccine-induced immune-immune thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/33914590/\n• Cerebral venous sinus thrombosis following vaccination against SARS-CoV-2: an analysis of cases reported to the European Medicines Agency: https://pubmed.ncbi.nlm.nih.gov/34293217/\n• Risk of thrombocytopenia and thromboembolism after covid-19 vaccination and positive SARS-CoV-2 tests: self-controlled case series study: https://pubmed.ncbi.nlm.nih.gov/34446426/\n• Blood clots and bleeding after BNT162b2 and ChAdOx1 nCoV-19 vaccination: an analysis of European data: https://pubmed.ncbi.nlm.nih.gov/34174723/\n• Arterial events, venous thromboembolism, thrombocytopenia and bleeding after vaccination with Oxford-AstraZeneca ChAdOx1-S in Denmark and Norway: population-based cohort study: https://pubmed.ncbi.nlm.nih.gov/33952445/\n• First dose of ChAdOx1 and BNT162b2 COVID-19 vaccines and thrombocytopenic, thromboembolic and hemorrhagic events in Scotland: https://pubmed.ncbi.nlm.nih.gov/34108714/\n• Cerebral venous thrombosis associated with COVID-19 vaccine in Germany: https://pubmed.ncbi.nlm.nih.gov/34288044/\n• Malignant cerebral infarction after vaccination with ChAdOx1 nCov-19: a catastrophic variant of vaccine-induced immune-mediated thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34341358/\n• celiac artery and splenic artery thrombosis complicated by splenic infarction 7 days after the first dose of Oxford vaccine, causal relationship or coincidence: https://pubmed.ncbi.nlm.nih.gov/34261633/.\n• Cerebral venous sinus thrombosis associated with thrombocytopenia after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/33845870/.\n• central venous sinus thrombosis with subarachnoid hemorrhage after COVID-19 mRNA vaccination: are these reports merely coincidental: https://pubmed.ncbi.nlm.nih.gov/34478433/\n• Intracerebral hemorrhage due to thrombosis with thrombocytopenia syndrome after COVID-19 vaccination: the first fatal case in Korea: https://pubmed.ncbi.nlm.nih.gov/34402235/\n• Cerebral venous sinus thrombosis negative for anti-PF4 antibody without thrombocytopenia after immunization with COVID-19 vaccine in a non-comorbid elderly Indian male treated with conventional heparin-warfarin-based anticoagulation: https://pubmed.ncbi.nlm.nih.gov/34186376/\n• Cerebral venous sinus thrombosis 2 weeks after first dose of SARS-CoV-2 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34101024/\n• A case of multiple thrombocytopenia and thrombosis following vaccination with ChAdOx1 nCoV-19 against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/34137813/\n• Vaccine-induced thrombotic thrombocytopenia: the elusive link between thrombosis and adenovirus-based SARS-CoV-2 vaccines: https://pubmed.ncbi.nlm.nih.gov/34191218/\n• Thrombosis with thrombocytopenia syndrome associated with COVID-19 viral vector vaccines: https://pubmed.ncbi.nlm.nih.gov/34092488/\n• Thromboaspiration infusion and fibrinolysis for portomesenteric thrombosis after administration of the AstraZeneca COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34132839/.\n• Deep venous thrombosis (DVT) occurring shortly after second dose of SARS-CoV-2 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/33687691/\n• Procoagulant antibody-mediated procoagulant platelets in immune thrombotic thrombocytopenia associated with SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/34011137/.\n• Procoagulant microparticles: a possible link between vaccine-induced immune thrombocytopenia (VITT) and cerebral sinus venous thrombosis: https://pubmed.ncbi.nlm.nih.gov/34129181/.\n• Atypical thrombosis associated with the vaccine VaxZevria® (AstraZeneca): data from the French network of regional pharmacovigilance centers: https://pubmed.ncbi.nlm.nih.gov/34083026/.\n• Acute cerebral venous thrombosis and pulmonary artery embolism associated with the COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34247246/.\n• Cutaneous thrombosis associated with cutaneous necrosis following Oxford-AstraZeneca COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34189756/\n• Thrombotic thrombocytopenia after vaccination with COVID-19: in search of the underlying mechanism: https://pubmed.ncbi.nlm.nih.gov/34071883/\n• Comparison of adverse drug reactions among four COVID-19 vaccines in Europe using the EudraVigilance database: Thrombosis in unusual sites: https://pubmed.ncbi.nlm.nih.gov/34375510/\n• Severe vaccine-induced thrombotic thrombocytopenia following vaccination with COVID-19: an autopsy case report and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34355379/.\n• A case of acute pulmonary embolism after immunization with SARS-CoV-2 mRNA: https://pubmed.ncbi.nlm.nih.gov/34452028/\n• Neurosurgical considerations regarding decompressive craniectomy for intracerebral hemorrhage after SARS-CoV-2 vaccination in vaccine-induced thrombotic thrombocytopenia-VITT: https://pubmed.ncbi.nlm.nih.gov/34202817/\n• Acquired thrombotic thrombocytopenic thrombocytopenic purpura: a rare disease associated with the BNT162b2 vaccine: https://pubmed.ncbi.nlm.nih.gov/34105247/.\n• Sensory Guillain-Barré syndrome following ChAdOx1 nCov-19 vaccine: report of two cases and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34416410/.\n• Reactivation of Vogt-Koyanagi-Harada disease under control for more than 6 years, after anti-SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/34224024/.\n• Neurological symptoms and neuroimaging alterations related to COVID-19 vaccine: cause or coincidence?: https://pubmed.ncbi.nlm.nih.gov/34507266/\n• Fatal systemic capillary leak syndrome after SARS-COV-2 vaccination in a patient with multiple myeloma: https://pubmed.ncbi.nlm.nih.gov/34459725/\n• Polyarthralgia and myalgia syndrome after vaccination with ChAdOx1 nCOV-19: https://pubmed.ncbi.nlm.nih.gov/34463066/\n• Three cases of subacute thyroiditis after SARS-CoV-2 vaccination: post-vaccination ASIA syndrome: https://pubmed.ncbi.nlm.nih.gov/34043800/.\n• Facial diplegia: a rare and atypical variant of Guillain-Barré syndrome and the Ad26.COV2.S vaccine: https://pubmed.ncbi.nlm.nih.gov/34447646/\n• fulminant myocarditis and systemic hyperinflammation temporally associated with BNT162b2 COVID-19 mRNA vaccination in two patients: https://pubmed.ncbi.nlm.nih.gov/34416319/.\n• Adverse effects reported after COVID-19 vaccination in a tertiary care hospital, centered on cerebral venous sinus thrombosis (CVST): https://pubmed.ncbi.nlm.nih.gov/34092166/\n• Induction and exacerbation of subacute cutaneous lupus erythematosus erythematosus after mRNA- or adenoviral vector-based SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/34291477/\n• Petechiae and peeling of fingers after immunization with BTN162b2 messenger RNA (mRNA)-based COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34513435/\n• Immune-mediated thrombocytopenic purpura after Pfizer-BioNTech COVID-19 vaccine in an elderly woman: https://pubmed.ncbi.nlm.nih.gov/34513446/\n• Platelet activation and modulation in thrombosis with thrombocytopenia syndrome associated with the ChAdO × 1 nCov-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34474550/\n• Two cases of Graves’ disease after SARS-CoV-2 vaccination: an autoimmune / inflammatory syndrome induced by adjuvants: https://pubmed.ncbi.nlm.nih.gov/33858208/\n• Acute relapse and impaired immunization after COVID-19 vaccination in a patient with multiple sclerosis treated with rituximab: https://pubmed.ncbi.nlm.nih.gov/34015240/\n• Transient thrombocytopenia with glycoprotein-specific platelet autoantibodies after vaccination with Ad26.COV2.S: case report: https://pubmed.ncbi.nlm.nih.gov/34516272/.\n• Acute hyperactive encephalopathy following COVID-19 vaccination with dramatic response to methylprednisolone: case report: https://pubmed.ncbi.nlm.nih.gov/34512961/\n• Lymphohistocytic myocarditis after vaccination with the COVID-19 viral vector Ad26.COV2.S: https://pubmed.ncbi.nlm.nih.gov/34514078/\n• IgA vasculitis in adult patient after vaccination with ChadOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34509658/\n• A case of leukocytoclastic vasculitis after vaccination with a SARS-CoV2 vaccine: case report: https://pubmed.ncbi.nlm.nih.gov/34196469/.\n• Onset / outbreak of psoriasis after Corona virus ChAdOx1 nCoV-19 vaccine (Oxford-AstraZeneca / Covishield): report of two cases: https://pubmed.ncbi.nlm.nih.gov/34350668/\n• Supraclavicular lymphadenopathy after COVID-19 vaccination in Korea: serial follow-up by ultrasonography: https://pubmed.ncbi.nlm.nih.gov/34116295/.\n• Report of the International Cerebral Venous Thrombosis Consortium on cerebral venous thrombosis after SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/34462996/\n• Immune thrombocytopenia after vaccination during the COVID-19 pandemic: https://pubmed.ncbi.nlm.nih.gov/34435486/\n• COVID-19: lessons from the Norwegian tragedy should be taken into account in planning for vaccine launch in less developed/developing countries: https://pubmed.ncbi.nlm.nih.gov/34435142/\n• Rituximab-induced acute lympholysis and pancytopenia following vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34429981/\n• Exacerbation of plaque psoriasis after COVID-19 inactivated mRNA and BNT162b2 vaccines: report of two cases: https://pubmed.ncbi.nlm.nih.gov/34427024/\n• Vesiculobullous cutaneous reactions induced by COVID-19 mRNA vaccine: report of four cases and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34236711/\n• Acute perimyocarditis after the first dose of COVID-19 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34515024/\n• Rare cutaneous adverse effects of COVID-19 vaccines: a case series and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34363637/\n• Immune thrombocytopenia associated with the Pfizer-BioNTech COVID-19 mRNA vaccine BNT162b2: https://www.sciencedirect.com/science/article/pii/S2214250921002018\n• Collection of complement-mediated and autoimmune-mediated hematologic conditions after SARS-CoV-2 vaccination: https://ashpublications.org/bloodadvances/article/5/13/2794/476324/Autoimmune-and-complement-mediated-hematologic\n• Petechial rash associated with CoronaVac vaccination: first report of cutaneous side effects before phase 3 results: https://ejhp.bmj.com/content/early/2021/05/23/ejhpharm-2021-002794\n• Cerebral venous thrombosis associated with COVID-19 vaccine in Germany: https://pubmed.ncbi.nlm.nih.gov/34288044/.\n• Cerebral venous sinus thrombosis and thrombocytopenia after COVID-19 vaccination: report of two cases in the United Kingdom: https://pubmed.ncbi.nlm.nih.gov/33857630/.\n• The roles of platelets in COVID-19-associated coagulopathy and vaccine-induced immune-immune thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34455073/\n• Cerebral venous sinus thrombosis in the U.S. population, After SARS-CoV-2 vaccination with adenovirus and after COVID-19: https://pubmed.ncbi.nlm.nih.gov/34116145/\n• Cerebral venous thrombosis after COVID-19 vaccination: is the risk of thrombosis increased by intravascular administration of the vaccine: https://pubmed.ncbi.nlm.nih.gov/34286453/.\n• Central venous sinus thrombosis with subarachnoid hemorrhage after COVID-19 mRNA vaccination: are these reports merely coincidental: https://pubmed.ncbi.nlm.nih.gov/34478433/\n• Cerebral venous sinus thrombosis after ChAdOx1 nCov-19 vaccination with a misleading first brain MRI: https://pubmed.ncbi.nlm.nih.gov/34244448/\n• Early results of bivalirudin treatment for thrombotic thrombocytopenia and cerebral venous sinus thrombosis after vaccination with Ad26.COV2.S: https://pubmed.ncbi.nlm.nih.gov/34226070/\n• Cerebral venous sinus thrombosis associated with post-vaccination thrombocytopenia by COVID-19: https://pubmed.ncbi.nlm.nih.gov/33845870/.\n• Cerebral venous sinus thrombosis 2 weeks after the first dose of SARS-CoV-2 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34101024/.\n• Adenovirus interactions with platelets and coagulation and vaccine-associated autoimmune thrombocytopenia thrombosis syndrome: https://pubmed.ncbi.nlm.nih.gov/34407607/.\n• Headache attributed to COVID-19 (SARS-CoV-2 coronavirus) vaccination with the ChAdOx1 nCoV-19 (AZD1222) vaccine: a multicenter observational cohort study: https://pubmed.ncbi.nlm.nih.gov/34313952/\n• Adverse effects reported after COVID-19 vaccination in a tertiary care hospital, focus on cerebral venous sinus thrombosis (CVST): https://pubmed.ncbi.nlm.nih.gov/34092166/\n• Cerebral venous sinus thrombosis following vaccination against SARS-CoV-2: an analysis of cases reported to the European Medicines Agency: https://pubmed.ncbi.nlm.nih.gov/34293217/\n• A rare case of a middle-age Asian male with cerebral venous thrombosis after COVID-19 AstraZeneca vaccination: https://pubmed.ncbi.nlm.nih.gov/34274191/\n• Cerebral venous sinus thrombosis negative for anti-PF4 antibody without thrombocytopenia after immunization with COVID-19 vaccine in a non-comorbid elderly Indian male treated with conventional heparin-warfarin-based anticoagulation: https://pubmed.ncbi.nlm.nih.gov/34186376/\n• Arterial events, venous thromboembolism, thrombocytopenia and bleeding after vaccination with Oxford-AstraZeneca ChAdOx1-S in Denmark and Norway: population-based cohort study: https://pubmed.ncbi.nlm.nih.gov/33952445/\n• Procoagulant microparticles: a possible link between vaccine-induced immune thrombocytopenia (VITT) and cerebral sinus venous thrombosis: https://pubmed.ncbi.nlm.nih.gov/34129181/\n• S. case reports of cerebral venous sinus thrombosis with thrombocytopenia after vaccination with Ad26.COV2.S, March 2-April 21, 2021: https://pubmed.ncbi.nlm.nih.gov/33929487/.\n• Malignant cerebral infarction after vaccination with ChAdOx1 nCov-19: a catastrophic variant of vaccine-induced immune-mediated thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34341358/\n• Imaging and hematologic findings in thrombosis and thrombocytopenia after vaccination with ChAdOx1 nCoV-19 (AstraZeneca): https://pubmed.ncbi.nlm.nih.gov/34402666/\n• Autoimmunity roots of thrombotic events after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34508917/\n• Massive cerebral venous thrombosis and venous basin infarction as late complications of COVID-19: a case report: https://pubmed.ncbi.nlm.nih.gov/34373991/\n• Australian and New Zealand approach to the diagnosis and treatment of vaccine-induced immune thrombosis and immune thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34490632/\n• An observational study to identify the prevalence of thrombocytopenia and anti-PF4 / polyanion antibodies in Norwegian health care workers after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/33909350/\n• Acute transverse myelitis (ATM): clinical review of 43 patients with COVID-19-associated ATM and 3 serious adverse events of post-vaccination ATM with ChAdOx1 nCoV-19 (AZD1222) vaccine: https://pubmed.ncbi.nlm.nih.gov/33981305/.\n• A case of acute demyelinating polyradiculoneuropathy with bilateral facial palsy after ChAdOx1 nCoV-19 vaccine:. https://pubmed.ncbi.nlm.nih.gov/34272622/\n• Thrombocytopenia with acute ischemic stroke and hemorrhage in a patient recently vaccinated with an adenoviral vector-based COVID-19 vaccine:. https://pubmed.ncbi.nlm.nih.gov/33877737/\n• Predicted and observed incidence of thromboembolic events among Koreans vaccinated with the ChAdOx1 nCoV-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34254476/\n• First dose of ChAdOx1 and BNT162b2 COVID-19 vaccines and thrombocytopenic, thromboembolic, and hemorrhagic events in Scotland: https://pubmed.ncbi.nlm.nih.gov/34108714/\n• ChAdOx1 nCoV-19 vaccine-associated thrombocytopenia: three cases of immune thrombocytopenia after 107,720 doses of ChAdOx1 vaccination in Thailand: https://pubmed.ncbi.nlm.nih.gov/34483267/.\n• Neurosurgical considerations with respect to decompressive craniectomy for intracerebral hemorrhage after SARS-CoV-2 vaccination in vaccine-induced thrombotic thrombocytopenia-VITT: https://pubmed.ncbi.nlm.nih.gov/34202817/\n• Polyarthralgia and myalgia syndrome after vaccination with ChAdOx1 nCOV-19: https://pubmed.ncbi.nlm.nih.gov/34463066/\n• A rare case of thrombosis and thrombocytopenia of the superior ophthalmic vein after ChAdOx1 nCoV-19 vaccination against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/34276917/\n• Limb ischemia and pulmonary artery thrombosis after ChAdOx1 nCoV-19 vaccine (Oxford-AstraZeneca): a case of vaccine-induced immune thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/33990339/.\n• Secondary thrombocytopenia after SARS-CoV-2 vaccination: case report of haemorrhage and hematoma after minor oral surgery: https://pubmed.ncbi.nlm.nih.gov/34314875/.\n• Venous thromboembolism and mild thrombocytopenia after vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34384129/\n• Fatal exacerbation of ChadOx1-nCoV-19-induced thrombotic thrombocytopenia syndrome after successful initial therapy with intravenous immunoglobulins: a rationale for monitoring immunoglobulin G levels: https://pubmed.ncbi.nlm.nih.gov/34382387/\n• A case of ANCA-associated vasculitis after AZD1222 (Oxford-AstraZeneca) SARS-CoV-2 vaccination: victim or causality?: https://pubmed.ncbi.nlm.nih.gov/34416184/.\n• Intracerebral hemorrhage associated with vaccine-induced thrombotic thrombocytopenia after ChAdOx1 nCOVID-19 vaccination in a pregnant woman: https://pubmed.ncbi.nlm.nih.gov/34261297/\n• Cutaneous thrombosis associated with cutaneous necrosis following Oxford-AstraZeneca COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34189756/\n• Thrombocytopenia in an adolescent with sickle cell anemia after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34331506/\n• Myocarditis associated with SARS-CoV-2 mRNA vaccination in children aged 12 to 17 years: stratified analysis of a national database: https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1\n• Intravenous injection of coronavirus disease 2019 (COVID-19) mRNA vaccine can induce acute myopericarditis in a mouse model: https://t.co/j0IEM8cMXI\n• A report of myocarditis adverse events in the U.S. Vaccine Adverse Event Reporting System. (VAERS) in association with COVID-19 injectable biologics: https://pubmed.ncbi.nlm.nih.gov/34601006/\n• This study concludes that: “The vaccine was associated with an excess risk of myocarditis (1 to 5 events per 100,000 persons). The risk of this potentially serious adverse event and of many other serious adverse events increased substantially after SARS-CoV-2 infection”: https://www.nejm.org/doi/full/10.1056/NEJMoa2110475\n• Myocarditis associated with SARS-CoV-2 mRNA vaccination in children aged 12 to 17 years: stratified analysis of a national database: https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1.\n• Immune-mediated hepatitis with the Moderna vaccine is no longer a coincidence but confirmed: https://www.sciencedirect.com/science/article/pii/S0168827821020936\n• Lobar hemorrhage with ventricular rupture shortly after the first dose of an mRNA-based SARS-CoV-2 vaccine: https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8553377/\n• Mrna COVID vaccines dramatically increase endothelial inflammatory markers and risk of Acute Coronary Syndrome as measured by PULS cardiac testing: a caution: https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712\n• ChAdOx1 interacts with CAR and PF4 with implications for thrombosis with thrombocytopenia syndrome:https://www.science.org/doi/10.1126/sciadv.abl8213\n• Lethal vaccine-induced immune thrombotic immune thrombocytopenia (VITT) following announcement 26.COV2.S: first documented case outside the U.S.: https://pubmed.ncbi.nlm.nih.gov/34626338/\n• Treatment of acute ischemic stroke associated with ChAdOx1 nCoV-19 vaccine-induced immune thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34461442/\n• Portal vein thrombosis due to vaccine-induced immune thrombotic immune thrombocytopenia (VITT) after Covid vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34598301/\n• Myocardial infarction and azygos vein thrombosis after vaccination with ChAdOx1 nCoV-19 in a hemodialysis patient: https://pubmed.ncbi.nlm.nih.gov/34650896/\n• Humoral response induced by Prime-Boost vaccination with ChAdOx1 nCoV-19 and BNT162b2 mRNA vaccines in a patient with multiple sclerosis treated with teriflunomide: https://pubmed.ncbi.nlm.nih.gov/34696248/\n• Predictors of mortality in thrombotic thrombocytopenia after adenoviral COVID-19 vaccination: the FAPIC score: https://pubmed.ncbi.nlm.nih.gov/34545400/\n• Ischemic stroke as a presenting feature of immune thrombotic thrombocytopenia induced by ChAdOx1-nCoV-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34035134/\n• In-hospital observational study of neurological disorders in patients recently vaccinated with COVID-19 mRNA vaccines: https://pubmed.ncbi.nlm.nih.gov/34688190/\n• Endovascular treatment for vaccine-induced cerebral venous sinus thrombosis and thrombocytopenia after vaccination with ChAdOx1 nCoV-19: report of three cases: https://pubmed.ncbi.nlm.nih.gov/34782400/\n• Cardiovascular, neurological, and pulmonary events after vaccination with BNT162b2, ChAdOx1 nCoV-19, and Ad26.COV2.S vaccines: an analysis of European data: https://pubmed.ncbi.nlm.nih.gov/34710832/\n• Cerebral venous thrombosis developing after vaccination. COVID-19: VITT, VATT, TTS and more: https://pubmed.ncbi.nlm.nih.gov/34695859/\n• Possible triggers of thrombocytopenia and/or hemorrhage by BNT162b2 vaccine, Pfizer-BioNTech: https://pubmed.ncbi.nlm.nih.gov/34660652/.\n• Multiple sites of arterial thrombosis in a 35-year-old patient after vaccination with ChAdOx1 (AstraZeneca), which required emergency femoral and carotid surgical thrombectomy: https://pubmed.ncbi.nlm.nih.gov/34644642/\n• Neuro-ophthalmic complications with thrombocytopenia and thrombosis induced by ChAdOx1 nCoV-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34726934/\n• Thrombotic events after COVID-19 vaccination in over 50 years of age: results of a population-based study in Italy: https://pubmed.ncbi.nlm.nih.gov/34835237/\n• Intracerebral hemorrhage associated with vaccine-induced thrombotic thrombocytopenia after ChAdOx1 nCOVID-19 vaccination in a pregnant woman: https://pubmed.ncbi.nlm.nih.gov/34261297/\n• Age- and sex-specific incidence of cerebral venous sinus thrombosis associated with Ad26.COV2.S COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34724036/.\n• Genital necrosis with cutaneous thrombosis following vaccination with COVID-19 mRNA: https://pubmed.ncbi.nlm.nih.gov/34839563/\n• COVID-19 vaccine-induced immune thrombosis with thrombocytopenia thrombosis (VITT) and shades of gray in thrombus formation: https://pubmed.ncbi.nlm.nih.gov/34624910/\n• A rare case of COVID-19 vaccine-induced thrombotic thrombocytopenia (VITT) affecting the venosplanchnic and pulmonary arterial circulation from a UK district general hospital: https://pubmed.ncbi.nlm.nih.gov/34535492/\n• Thrombosis with thrombocytopenia syndrome (TTS) after vaccination with AstraZeneca ChAdOx1 nCoV-19 (AZD1222) COVID-19: a risk-benefit analysis for persons <60% risk-benefit analysis for people <60 years in Australia: https://pubmed.ncbi.nlm.nih.gov/34272095/\n• Characteristics and outcomes of patients with cerebral venous sinus thrombosis in thrombotic immune thrombocytopenia induced by SARS-CoV-2 vaccine: https://jamanetwork.com/journals/jamaneurology/fullarticle/2784622\n• Case study of thrombosis and thrombocytopenia syndrome after administration of the AstraZeneca COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34781321/\n• Thrombosis with Thrombocytopenia Syndrome Associated with COVID-19 Vaccines: https://pubmed.ncbi.nlm.nih.gov/34062319/\n• Cerebral venous sinus thrombosis following vaccination with ChAdOx1: the first case of definite thrombosis with thrombocytopenia syndrome in India: https://pubmed.ncbi.nlm.nih.gov/34706921/\n• Case report of immune thrombocytopenia after vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34751013/.\n• Concerns for adverse effects of thrombocytopenia and thrombosis after adenovirus-vectored COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34541935/\n• Thrombocytopenia with acute ischemic stroke and hemorrhage in a patient recently vaccinated with an adenoviral vector-based COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33877737/\n• Intracerebral hemorrhage and thrombocytopenia after AstraZeneca COVID-19 vaccine: clinical and diagnostic challenges of vaccine-induced thrombotic thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34646685/\n• Case report: cerebral sinus vein thrombosis in two patients with AstraZeneca SARS-CoV-2 vaccine: https://pubmed.ncbi.nlm.nih.gov/34609603/\n• Thrombocytopenia, including immune thrombocytopenia after receiving COVID-19 mRNA vaccines reported to the Vaccine Adverse Event Reporting System (VAERS): https://pubmed.ncbi.nlm.nih.gov/34006408/\n• A case of ANCA-associated vasculitis after AZD1222 (Oxford-AstraZeneca) SARS-CoV-2 vaccination: victim or causality?: https://pubmed.ncbi.nlm.nih.gov/34416184/\n• Vaccine-induced immune thrombosis and thrombocytopenia syndrome after adenovirus-vectored severe acute respiratory syndrome coronavirus 2 vaccination: a new hypothesis on mechanisms and implications for future vaccine development: https://pubmed.ncbi.nlm.nih.gov/34664303/.\n• Thrombosis in peripheral artery disease and thrombotic thrombocytopenia following adenoviral COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34649281/.\n• Cerebral venous sinus thrombosis and thrombotic events after vector-based COVID-19 vaccines: systematic review and meta-analysis: https://pubmed.ncbi.nlm.nih.gov/34610990/.\n• Sweet’s syndrome after Oxford-AstraZeneca COVID-19 vaccine (AZD1222) in an elderly woman: https://pubmed.ncbi.nlm.nih.gov/34590397/\n• Prevalence of serious adverse events among health care professionals after receiving the first dose of ChAdOx1 nCoV-19 coronavirus vaccine (Covishield) in Togo, March 2021: https://pubmed.ncbi.nlm.nih.gov/34819146/.\n• Recurrence of alopecia areata after covid-19 vaccination: a report of three cases in Italy: https://pubmed.ncbi.nlm.nih.gov/34741583/\n• Shingles-like skin lesion after vaccination with AstraZeneca for COVID-19: a case report: https://pubmed.ncbi.nlm.nih.gov/34631069/\n• Thrombosis after COVID-19 vaccination: possible link to ACE pathways: https://pubmed.ncbi.nlm.nih.gov/34479129/\n• Thrombocytopenia in an adolescent with sickle cell anemia after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34331506/\n• Abdominal pain and bilateral adrenal hemorrhage from immune thrombotic thrombocytopenia induced by COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34546343/\n• A case of toxic epidermal necrolysis after vaccination with ChAdOx1 nCoV-19 (AZD1222): https://pubmed.ncbi.nlm.nih.gov/34751429/.\n• Recurrent ANCA-associated vasculitis after Oxford AstraZeneca ChAdOx1-S COVID-19 vaccination: a case series of two patients: https://pubmed.ncbi.nlm.nih.gov/34755433/\n• Rare case of contralateral supraclavicular lymphadenopathy after vaccination with COVID-19: computed tomography and ultrasound findings: https://pubmed.ncbi.nlm.nih.gov/34667486/\n• Cutaneous lymphocytic vasculitis after administration of the second dose of AZD1222 (Oxford-AstraZeneca) Severe acute respiratory syndrome Coronavirus 2 vaccine: chance or causality: https://pubmed.ncbi.nlm.nih.gov/34726187/.\n• Understanding the risk of thrombosis with thrombocytopenia syndrome following Ad26.COV2.S vaccination: https://pubmed.ncbi.nlm.nih.gov/34595694/\n• Cutaneous adverse reactions of 35,229 doses of COVID-19 Sinovac and AstraZeneca vaccine COVID-19: a prospective cohort study in health care workers: https://pubmed.ncbi.nlm.nih.gov/34661934/\n• Comments on thrombosis after vaccination: spike protein leader sequence could be responsible for thrombosis and antibody-mediated thrombocytopenia: https://pubmed.ncbi.nlm.nih.gov/34788138\n• Severe immune thrombocytopenia following COVID-19 vaccination: report of four cases and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34653943/.\n• Thrombosis in pre- and post-vaccination phase of COVID-19; https://pubmed.ncbi.nlm.nih.gov/34650382/\n• A look at the role of postmortem immunohistochemistry in understanding the inflammatory pathophysiology of COVID-19 disease and vaccine-related thrombotic adverse events: a narrative review: https://pubmed.ncbi.nlm.nih.gov/34769454/\n• An unusual presentation of acute deep vein thrombosis after Modern COVID-19 vaccine: case report: https://pubmed.ncbi.nlm.nih.gov/34790811/\n• Immediate high-dose intravenous immunoglobulins followed by direct treatment with thrombin inhibitors is crucial for survival in vaccine-induced immune thrombotic thrombocytopenia Sars-Covid-19-vector adenoviral VITT with venous thrombosis of the cerebral sinus and portal vein: https://pubmed.ncbi.nlm.nih.gov/34023956/.\n• Imaging and hematologic findings in thrombosis and thrombocytopenia after vaccination with ChAdOx1 nCoV-19 (AstraZeneca): https://pubmed.ncbi.nlm.nih.gov/34402666/\n• Spectrum of neuroimaging findings in post-CoVID-19 vaccination: a case series and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34842783/\n• Cerebral venous sinus thrombosis, pulmonary embolism, and thrombocytopenia after COVID-19 vaccination in a Taiwanese man: a case report and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34630307/\n• New portal vein thrombosis in cirrhosis: is thrombophilia exacerbated by vaccine or COVID-19: https://www.jcehepatology.com/article/S0973-6883(21)00545-4/fulltext.\n• Cerebral venous sinus thrombosis after vaccination with COVID-19 mRNA of BNT162b2: https://pubmed.ncbi.nlm.nih.gov/34796065/.\n• Increased risk of urticaria/angioedema after BNT162b2 mRNA COVID-19 vaccination in health care workers taking ACE inhibitors: https://pubmed.ncbi.nlm.nih.gov/34579248/\n• A case of unusual mild clinical presentation of COVID-19 vaccine-induced immune thrombotic thrombocytopenia with splanchnic vein thrombosis: https://pubmed.ncbi.nlm.nih.gov/34843991/\n• A case of idiopathic thrombocytopenic purpura after a booster dose of COVID-19 BNT162b2 vaccine (Pfizer-Biontech): https://pubmed.ncbi.nlm.nih.gov/34820240/\n• Thromboembolic events in younger females exposed to Pfizer-BioNTech or Moderna COVID-19 vaccines: https://pubmed.ncbi.nlm.nih.gov/34264151/\n• Potential risk of thrombotic events after COVID-19 vaccination with Oxford-AstraZeneca in women receiving estrogen: https://pubmed.ncbi.nlm.nih.gov/34734086/\n• Adenovirus interactions with platelets and coagulation and vaccine-induced immune thrombotic thrombocytopenia syndrome: https://pubmed.ncbi.nlm.nih.gov/34407607/\n• Unusual site of deep vein thrombosis after vaccination against coronavirus mRNA-2019 coronavirus disease (COVID-19): https://pubmed.ncbi.nlm.nih.gov/34840204/\n• Coagulopathies after SARS-CoV-2 vaccination may derive from a combined effect of SARS-CoV-2 spike protein and adenovirus vector-activated signaling pathways: https://pubmed.ncbi.nlm.nih.gov/34639132/\n• Isolated pulmonary embolism after COVID vaccination: 2 case reports and a review of acute pulmonary embolism complications and follow-up: https://pubmed.ncbi.nlm.nih.gov/34804412/\n• Deep venous thrombosis after vaccination with Ad26.COV2.S in adult males: https://pubmed.ncbi.nlm.nih.gov/34659839/.\n• Occurrence of COVID-19 variants among recipients of ChAdOx1 nCoV-19 vaccine (recombinant): https://pubmed.ncbi.nlm.nih.gov/34528522/\n• Prevalence of thrombocytopenia, anti-platelet factor 4 antibodies, and elevated D-dimer in Thais after vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34568726/\n• Epidemiology of acute myocarditis/pericarditis in Hong Kong adolescents after co-vaccination: https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/644 5179.\n• Myocarditis after 2019 coronavirus disease mRNA vaccine: a case series and determination of incidence rate: https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab926/6420408\n• Myocarditis and pericarditis after COVID-19 vaccination: inequalities in age and vaccine types: https://www.mdpi.com/2075-4426/11/11/1106\n• Epidemiology and clinical features of myocarditis/pericarditis before the introduction of COVID-19 mRNA vaccine in Korean children: a multicenter study: https://pubmed.ncbi.nlm.nih.gov/34402230/\n• Shedding light on post-vaccination myocarditis and pericarditis in COVID-19 and non-COVID-19 vaccine recipients: https://pubmed.ncbi.nlm.nih.gov/34696294/\n• Myocarditis and other cardiovascular complications of COVID-19 mRNA-based COVID-19 vaccines: https://pubmed.ncbi.nlm.nih.gov/34277198/\n• Possible Association Between COVID-19 Vaccine and Myocarditis: Clinical and CMR Findings: https://pubmed.ncbi.nlm.nih.gov/34246586/\n• Severe myocarditis associated with COVID-19 vaccine: zebra or unicorn?: https://www.internationaljournalofcardiology.com/article/S0167-5273(21)01477-7/fulltext.\n• Association of myocarditis with COVID-19 messenger RNA BNT162b2 vaccine in a case series of children: https://jamanetwork.com/journals/jamacardiology/fullarticle/2783052\n• Clinical suspicion of myocarditis temporally related to COVID-19 vaccination in adolescents and young adults: https://www.ahajournals.org/doi/abs/10.1161/CIRCULATIONAHA.121.056583?url_ver=Z39.88-2003&rfr_id=ori:rid:crossref.org&rfr_dat=cr_pub%20%200pubmed\n• STEMI mimicry: focal myocarditis in an adolescent patient after COVID-19 mRNA vaccination:. https://pubmed.ncbi.nlm.nih.gov/34756746/\n• Myocarditis and pericarditis in association with COVID-19 mRNA vaccination: cases from a regional pharmacovigilance center: https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8587334/\n• Myocarditis associated with COVID-19 vaccination in adolescents: https://publications.aap.org/pediatrics/article/148/5/e2021053427/181357\n• Myocarditis findings on cardiac magnetic resonance imaging after vaccination with COVID-19 mRNA in adolescents:. https://pubmed.ncbi.nlm.nih.gov/34704459/\n• Acute myocarditis after administration of the second dose of BNT162b2 COVID-19 vaccine: https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8599115/\n• Case report: probable myocarditis after Covid-19 mRNA vaccine in a patient with arrhythmogenic left ventricular cardiomyopathy: https://pubmed.ncbi.nlm.nih.gov/34712717/.\n• Acute myocarditis after administration of BNT162b2 vaccine against COVID-19: https://www.revespcardiol.org/en-linkresolver-acute-myocarditis-after-administration-bnt162b2-S188558572100133X.\n• Myocarditis associated with COVID-19 vaccination: echocardiographic, cardiac CT, and MRI findings:. https://pubmed.ncbi.nlm.nih.gov/34428917/.\n• Myocarditis and pericarditis in adolescents after first and second doses of COVID-19 mRNA vaccines:. https://academic.oup.com/ehjqcco/advance-article/doi/10.1093/ehjqcco/qcab090/64 42104.\n• COVID 19 vaccine for adolescents. Concern for myocarditis and pericarditis: https://www.mdpi.com/2036-7503/13/3/61.\n• Cardiac imaging of acute myocarditis after vaccination with COVID-19 mRNA: https://pubmed.ncbi.nlm.nih.gov/34402228/\n• Acute myocardial injury after COVID-19 vaccination: a case report and review of current evidence from the vaccine adverse event reporting system database: https://pubmed.ncbi.nlm.nih.gov/34219532/\n• Acute myocarditis associated with COVID-19 vaccination: report of a case: https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8639400/\n• Myocarditis in the setting of a recent COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34712497/.\n• Acute myocarditis after a second dose of COVID-19 mRNA vaccine: report of two cases: https://www.clinicalimaging.org/article/S0899-7071(21)00265-5/fulltext.\n• Prevalence of thrombocytopenia, antiplatelet factor 4 antibodies, and elevated D-dimer in Thais after vaccination with ChAdOx1 nCoV-19: https://pubmed.ncbi.nlm.nih.gov/34568726/\n• Epidemiology of acute myocarditis/pericarditis in Hong Kong adolescents after co-vaccination: https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/6445179\n• Myocarditis and pericarditis after COVID-19 vaccination: inequalities in age and vaccine types: https://www.mdpi.com/2075-4426/11/11/1106\n• Epidemiology and clinical features of myocarditis/pericarditis before the introduction of COVID-19 mRNA vaccine in Korean children: a multicenter study: https://pubmed.ncbi.nlm.nih.gov/34402230/\n• Shedding light on post-vaccination myocarditis and pericarditis in COVID-19 and non-COVID-19 vaccine recipients: https://pubmed.ncbi.nlm.nih.gov/34696294/\n• Three cases of acute venous thromboembolism in women after coronavirus 2019 vaccination: https://pubmed.ncbi.nlm.nih.gov/34352418/\n• Clinical and biological features of cerebral venous sinus thrombosis after vaccination with ChAdOx1 nCov-19; https://jnnp.bmj.com/content/early/2021/09/29/jnnp-2021-327340.\n• COV2-S vaccination may reveal hereditary thrombophilia: massive cerebral venous sinus thrombosis in a young man with normal platelet count: https://pubmed.ncbi.nlm.nih.gov/34632750/\n• Inflammation and platelet activation after COVID-19 vaccines: possible mechanisms behind vaccine-induced immune thrombocytopenia and thrombosis: https://pubmed.ncbi.nlm.nih.gov/34887867/.\n• Vaccine-induced cerebral venous thrombosis and thrombocytopenia. Oxford-AstraZeneca COVID-19: a missed opportunity for rapid return on experience: https://www.sciencedirect.com/science/article/pii/S235255682100093X\n• Occurrence of splenic infarction due to arterial thrombosis after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34876440/\n• Deep venous thrombosis more than two weeks after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/33928773/\n• Case report: Take a second look: Cerebral venous thrombosis related to Covid-19 vaccination and thrombotic thrombocytopenia syndrome: https://pubmed.ncbi.nlm.nih.gov/34880826/\n• Change in blood viscosity after COVID-19 vaccination: estimation for persons with underlying metabolic syndrome: https://pubmed.ncbi.nlm.nih.gov/34868465/\n• Management of a patient with a rare congenital limb malformation syndrome after SARS-CoV-2 vaccine-induced thrombosis and thrombocytopenia (VITT): https://pubmed.ncbi.nlm.nih.gov/34097311/\n• Bilateral thalamic stroke: a case of COVID-19 (VITT) vaccine-induced immune thrombotic thrombocytopenia or a coincidence due to underlying risk factors: https://pubmed.ncbi.nlm.nih.gov/34820232/.\n• Thrombocytopenia and splanchnic thrombosis after vaccination with Ad26.COV2.S successfully treated with transjugular intrahepatic intrahepatic portosystemic shunt and thrombectomy: https://onlinelibrary.wiley.com/doi/10.1002/ajh.26258\n• Incidence of acute ischemic stroke after coronavirus vaccination in Indonesia: case series: https://pubmed.ncbi.nlm.nih.gov/34579636/\n• Case report: vaccine-induced immune immune thrombotic thrombocytopenia in a patient with pancreatic cancer after vaccination with messenger RNA-1273: https://pubmed.ncbi.nlm.nih.gov/34790684/\n• Squamous cell carcinoma of the lung with hemoptysis following vaccination with tozinameran (BNT162b2, Pfizer-BioNTech): https://pubmed.ncbi.nlm.nih.gov/34612003/\n• Vaccine-induced thrombotic thrombocytopenia after Ad26.COV2.S vaccination in a man presenting as acute venous thromboembolism: https://pubmed.ncbi.nlm.nih.gov/34096082/\n• Myocarditis associated with COVID-19 vaccination in three adolescent boys: https://pubmed.ncbi.nlm.nih.gov/34851078/.\n• Cardiovascular magnetic resonance findings in young adult patients with acute myocarditis after COVID-19 mRNA vaccination: a case series: https://pubmed.ncbi.nlm.nih.gov/34496880/\n• Epidemiology of acute myocarditis/pericarditis in Hong Kong adolescents after co-vaccination: https://pubmed.ncbi.nlm.nih.gov/34849657/.\n• Myocarditis-induced sudden death after BNT162b2 COVID-19 mRNA vaccination in Korea: case report focusing on histopathological findings: https://pubmed.ncbi.nlm.nih.gov/34664804/\n• Acute myocarditis after vaccination with COVID-19 mRNA in adults aged 18 years or older: https://pubmed.ncbi.nlm.nih.gov/34605853/\n• Recurrence of acute myocarditis temporally associated with receipt of the 2019 coronavirus mRNA disease vaccine (COVID-19) in an adolescent male: https://pubmed.ncbi.nlm.nih.gov/34166671/\n• Ga-DOTATOC digital PET images of inflammatory cell infiltrates in myocarditis after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34746968/\n• Occurrence of acute infarct-like myocarditis after vaccination with COVID-19: just an accidental coincidence or rather a vaccination-associated autoimmune myocarditis?”: https://pubmed.ncbi.nlm.nih.gov/34333695/.\n• Self-limited myocarditis presenting with chest pain and ST-segment elevation in adolescents after vaccination with BNT162b2 mRNA vaccine: https://pubmed.ncbi.nlm.nih.gov/34180390/\n• Myocarditis Following Immunization with COVID-19 mRNA Vaccines in Members of the U.S. Military: https://pubmed.ncbi.nlm.nih.gov/34185045/\n• Chest pain with abnormal electrocardiogram redevelopment after injection of COVID-19 vaccine manufactured by Moderna: https://pubmed.ncbi.nlm.nih.gov/34866106/\n• Biopsy-proven lymphocytic myocarditis after first vaccination with COVID-19 mRNA in a 40-year-old man: case report: https://pubmed.ncbi.nlm.nih.gov/34487236/\n• Multimodality imaging and histopathology in a young man presenting with fulminant lymphocytic myocarditis and cardiogenic shock after vaccination with mRNA-1273: https://pubmed.ncbi.nlm.nih.gov/34848416/\n• Report of a case of myopericarditis after vaccination with BNT162b2 COVID-19 mRNA in a young Korean male: https://pubmed.ncbi.nlm.nih.gov/34636504/\n• Acute myocarditis after Comirnaty vaccination in a healthy male with previous SARS-CoV-2 infection: https://pubmed.ncbi.nlm.nih.gov/34367386/\n• Acute myocarditis in a young adult two days after vaccination with Pfizer: https://pubmed.ncbi.nlm.nih.gov/34709227/\n• Case report: acute fulminant myocarditis and cardiogenic shock after messenger RNA coronavirus vaccination in 2019 requiring extracorporeal cardiopulmonary resuscitation: https://pubmed.ncbi.nlm.nih.gov/34778411/\n• A series of patients with myocarditis after vaccination against SARS-CoV-2 with mRNA-1279 and BNT162b2: https://pubmed.ncbi.nlm.nih.gov/34246585/\n• Post-vaccination multisystem inflammatory syndrome in adults without evidence of prior SARS-CoV-2 infection: https://pubmed.ncbi.nlm.nih.gov/34852213/\n• Acute myocarditis defined after vaccination with 2019 mRNA of coronavirus disease: https://pubmed.ncbi.nlm.nih.gov/34866122/\n• Association of myocarditis with COVID-19 messenger RNA BNT162b2 vaccine COVID-19 in a case series of children: https://pubmed.ncbi.nlm.nih.gov/34374740/\n• Clinical suspicion of myocarditis temporally related to COVID-19 vaccination in adolescents and young adults: https://pubmed.ncbi.nlm.nih.gov/34865500/\n• Myocarditis following vaccination with Covid-19 in a large healthcare organization: https://pubmed.ncbi.nlm.nih.gov/34614329/\n• Guillain-Barré syndrome after the first dose of Pfizer-BioNTech COVID-19 vaccine: case report and review of reported cases: https://pubmed.ncbi.nlm.nih.gov/34796417/.\n• Association of receipt association of Ad26.COV2.S COVID-19 vaccine with presumed Guillain-Barre syndrome, February-July 2021: https://jamanetwork.com/journals/jama/fullarticle/2785009\n• Guillain-Barre syndrome after COVID-19 vaccination in an adolescent: https://www.pedneur.com/article/S0887-8994(21)00221-6/fulltext.\n• Guillain-Barre syndrome presenting with facial diplegia following vaccination with COVID-19 in two patients: https://pubmed.ncbi.nlm.nih.gov/34649856/\n• Guillain-Barre syndrome after the first dose of COVID-19 vaccination: case report; https://pubmed.ncbi.nlm.nih.gov/34779385/.\n• Bilateral facial weakness with a variant of paresthesia of Guillain-Barre syndrome after Vaxzevria COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34261746/\n• Guillain-Barre syndrome after the first injection of ChAdOx1 nCoV-19 vaccine: first report: https://pubmed.ncbi.nlm.nih.gov/34217513/.\n• A case of sensory ataxic Guillain-Barre syndrome with immunoglobulin G anti-GM1 antibodies after first dose of COVID-19 BNT162b2 mRNA vaccine (Pfizer): https://pubmed.ncbi.nlm.nih.gov/34871447/\n• Reporting of acute inflammatory neuropathies with COVID-19 vaccines: subgroup disproportionality analysis in VigiBase: https://pubmed.ncbi.nlm.nih.gov/34579259/\n• A rare variant of Guillain-Barré syndrome after vaccination with Ad26.COV2.S: https://pubmed.ncbi.nlm.nih.gov/34703690/.\n• Guillain-Barré syndrome after SARS-CoV-2 vaccination in a patient with previous vaccine-associated Guillain-Barré syndrome: https://pubmed.ncbi.nlm.nih.gov/34810163/\n• Guillain-Barré syndrome in an Australian state using mRNA and adenovirus-vector SARS-CoV-2 vaccines: https://onlinelibrary.wiley.com/doi/10.1002/ana.26218.\n• Acute transverse myelitis after SARS-CoV-2 vaccination: case report and review of the literature: https://pubmed.ncbi.nlm.nih.gov/34482455/.\n• Guillian-Barre syndrome with axonal variant temporally associated with Modern SARS-CoV-2 mRNA-based vaccine: https://pubmed.ncbi.nlm.nih.gov/34722067/\n• Guillain-Barre syndrome after the first dose of SARS-CoV-2 vaccine: a temporary occurrence, not a causal association: https://pubmed.ncbi.nlm.nih.gov/33968610/\n• SARS-CoV-2 vaccines can be complicated not only by Guillain-Barré syndrome but also by distal small fiber neuropathy: https://pubmed.ncbi.nlm.nih.gov/34525410/\n• Clinical variant of Guillain-Barré syndrome with prominent facial diplegia after AstraZeneca 2019 coronavirus disease vaccine: https://pubmed.ncbi.nlm.nih.gov/34808658/\n• Adverse event reporting and risk of Bell’s palsy after COVID-19 vaccination: https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00646-0/fulltext.\n• Left Bell’s palsy after the first dose of mRNA-1273 SARS-CoV-2 vaccine: case report: https://pubmed.ncbi.nlm.nih.gov/34763263/.\n• Bell’s palsy after inactivated vaccination with COVID-19 in a patient with a history of recurrent Bell’s palsy: case report: https://pubmed.ncbi.nlm.nih.gov/34621891/\n• Neurological complications after the first dose of COVID-19 vaccines and SARS-CoV-2 infection: https://pubmed.ncbi.nlm.nih.gov/34697502/\n• Post COVID-19 transverse myelitis; a case report with review of the literature: https://pubmed.ncbi.nlm.nih.gov/34457267/.\n• Beware of neuromyelitis optica spectrum disorder after vaccination with inactivated virus for COVID-19: https://pubmed.ncbi.nlm.nih.gov/34189662/\n• Neuromyelitis optica in a healthy woman after vaccination against severe acute respiratory syndrome coronavirus 2 mRNA-1273: https://pubmed.ncbi.nlm.nih.gov/34660149/\n• Acute bilateral bilateral optic neuritis/chiasm with longitudinal extensive transverse myelitis in long-standing stable multiple sclerosis after vector-based vaccination against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/34131771/\n• A case series of acute pericarditis after vaccination with COVID-19 in the context of recent reports from Europe and the United States: https://pubmed.ncbi.nlm.nih.gov/34635376/\n• Acute pericarditis and cardiac tamponade after vaccination with Covid-19: https://pubmed.ncbi.nlm.nih.gov/34749492/\n• Myocarditis and pericarditis in adolescents after the first and second doses of COVID-19 mRNA vaccines: https://pubmed.ncbi.nlm.nih.gov/34849667/\n• Pericarditis after administration of the BNT162b2 mRNA vaccine COVID-19: https://pubmed.ncbi.nlm.nih.gov/34149145/\n• An outbreak of Still’s disease after COVID-19 vaccination in a 34-year-old patient: https://pubmed.ncbi.nlm.nih.gov/34797392/\n• Miller-Fisher syndrome and Guillain-Barré syndrome overlap syndrome in a patient after Oxford-AstraZeneca SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/34848426/.\n• Immune-mediated disease outbreaks or new-onset disease in 27 subjects after mRNA/DNA vaccination against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/33946748/\n• Post-mortem investigation of deaths after vaccination with COVID-19 vaccines: https://pubmed.ncbi.nlm.nih.gov/34591186/\n• Acute kidney injury with macroscopic hematuria and IgA nephropathy after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34352309/\n• Relapse of immune thrombocytopenia after covid-19 vaccination in young male patient: https://pubmed.ncbi.nlm.nih.gov/34804803/.\n• Case report: anti-neutrophil cytoplasmic antibody-associated vasculitis with acute renal failure and pulmonary hemorrhage can occur after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34859017/\n• Lobar hemorrhage with ventricular rupture shortly after the first dose of a SARS-CoV-2 mRNA-based SARS-CoV-2 vaccine: https://pubmed.ncbi.nlm.nih.gov/34729467/.\n• A case of outbreak of macroscopic hematuria and IgA nephropathy after SARS-CoV-2 vaccination: https://pubmed.ncbi.nlm.nih.gov/33932458/\n• Acral hemorrhage after administration of the second dose of SARS-CoV-2 vaccine. A post-vaccination reaction: https://pubmed.ncbi.nlm.nih.gov/34092400/742.\n• Gross hematuria after severe acute respiratory syndrome coronavirus 2 vaccination in 2 patients with IgA nephropathy: https://pubmed.ncbi.nlm.nih.gov/33771584/\n• COVID-19 vaccine and death: causality algorithm according to the WHO eligibility diagnosis: https://pubmed.ncbi.nlm.nih.gov/34073536/\n• Bell’s palsy after vaccination with mRNA (BNT162b2) and inactivated (CoronaVac) SARS-CoV-2 vaccines: a case series and a nested case-control study: https://pubmed.ncbi.nlm.nih.gov/34411532/\n• Epidemiology of myocarditis and pericarditis following mRNA vaccines in Ontario, Canada: by vaccine product, schedule, and interval: https://www.medrxiv.org/content/10.1101/2021.12.02.21267156v1\n• Anaphylaxis following Covid-19 vaccine in a patient with cholinergic urticaria: https://pubmed.ncbi.nlm.nih.gov/33851711/\n• Anaphylaxis induced by CoronaVac COVID-19 vaccine: clinical features and results of revaccination: https://pubmed.ncbi.nlm.nih.gov/34675550/.\n• Association of self-reported history of high-risk allergy with allergy symptoms after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34698847/\n• Sex differences in the incidence of anaphylaxis to LNP-mRNA vaccines COVID-19: https://pubmed.ncbi.nlm.nih.gov/34020815/\n• Allergic reactions, including anaphylaxis, after receiving the first dose of Pfizer-BioNTech COVID-19 vaccine – United States, December 14 to 23, 2020: https://pubmed.ncbi.nlm.nih.gov/33641264/\n• Allergic reactions, including anaphylaxis, after receiving the first dose of Modern COVID-19 vaccine – United States, December 21, 2020 to January 10, 2021: https://pubmed.ncbi.nlm.nih.gov/33641268/\n• Prolonged anaphylaxis to Pfizer 2019 coronavirus disease vaccine: a case report and mechanism of action: https://pubmed.ncbi.nlm.nih.gov/33834172/\n• Anaphylaxis reactions to Pfizer BNT162b2 vaccine: report of 3 cases of anaphylaxis following vaccination with Pfizer BNT162b2: https://pubmed.ncbi.nlm.nih.gov/34579211/\n• Biphasic anaphylaxis after first dose of 2019 messenger RNA coronavirus disease vaccine with positive polysorbate 80 skin test result: https://pubmed.ncbi.nlm.nih.gov/34343674/\n• Takotsubo cardiomyopathy after coronavirus 2019 vaccination in patient on maintenance hemodialysis: https://pubmed.ncbi.nlm.nih.gov/34731486/.\n• Myocardial infarction, stroke, and pulmonary embolism after BNT162b2 mRNA COVID-19 vaccine in persons aged 75 years or older: https://pubmed.ncbi.nlm.nih.gov/34807248/\n• Acute myocardial infarction within 24 hours after COVID-19 vaccination: is Kounis syndrome the culprit: https://pubmed.ncbi.nlm.nih.gov/34702550/\n• Deaths associated with the recently launched SARS-CoV-2 vaccination (Comirnaty®): https://pubmed.ncbi.nlm.nih.gov/33895650/\n• A case of acute encephalopathy and non-ST-segment elevation myocardial infarction after vaccination with mRNA-1273: possible adverse effect: https://pubmed.ncbi.nlm.nih.gov/34703815/\n• Vasculitis and bursitis in [ 18 F] FDG-PET/CT after COVID-19 mRNA vaccine: post hoc ergo propter hoc?; https://pubmed.ncbi.nlm.nih.gov/34495381/.\n• Case report: ANCA-associated vasculitis presenting with rhabdomyolysis and crescentic Pauci-Inmune glomerulonephritis after vaccination with Pfizer-BioNTech COVID-19 mRNA: https://pubmed.ncbi.nlm.nih.gov/34659268/\n• Reactivation of IgA vasculitis after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34848431/\n• A rare case of Henoch-Schönlein purpura after a case report of COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/34518812/\n• IgA vasculitis following COVID-19 vaccination in an adult: https://pubmed.ncbi.nlm.nih.gov/34779011/\n• Clinical and histopathologic spectrum of delayed adverse skin reactions after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34292611/.\n• First description of immune complex vasculitis after COVID-19 vaccination with BNT162b2: case report: https://pubmed.ncbi.nlm.nih.gov/34530771/.\n• Nephrotic syndrome and vasculitis after SARS-CoV-2 vaccine: true association or circumstantial: https://pubmed.ncbi.nlm.nih.gov/34245294/.\n• Occurrence of de novo cutaneous vasculitis after vaccination against coronavirus disease (COVID-19): https://pubmed.ncbi.nlm.nih.gov/34599716/.\n• Asymmetric cutaneous vasculitis after COVID-19 vaccination with unusual preponderance of eosinophils: https://pubmed.ncbi.nlm.nih.gov/34115904/.\n• Henoch-Schönlein purpura following the first dose of COVID-19 viral vector vaccine: case report: https://pubmed.ncbi.nlm.nih.gov/34696186/.\n• Acute retinal necrosis due to varicella zoster virus reactivation after vaccination with BNT162b2 COVID-19 mRNA: https://pubmed.ncbi.nlm.nih.gov/34851795/.\n• A case of generalized Sweet’s syndrome with vasculitis triggered by recent vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34849386/\n• Recurrent herpes zoster after COVID-19 vaccination in patients with chronic urticaria on cyclosporine treatment – A report of 3 cases: https://pubmed.ncbi.nlm.nih.gov/34510694/\n• Outbreaks of mixed cryoglobulinemia vasculitis after vaccination against SARS-CoV-2: https://pubmed.ncbi.nlm.nih.gov/34819272/\n• Cutaneous small-vessel vasculitis after vaccination with a single dose of Janssen Ad26.COV2.S: https://pubmed.ncbi.nlm.nih.gov/34337124/\n• Case of immunoglobulin A vasculitis after vaccination against coronavirus disease 2019: https://pubmed.ncbi.nlm.nih.gov/34535924/\n• Hypermetabolic lymphadenopathy after administration of BNT162b2 mRNA vaccine Covid-19: incidence assessed by [ 18 F] FDG PET-CT and relevance for study interpretation: https://pubmed.ncbi.nlm.nih.gov/33774684/\n• Evolution of bilateral hypermetabolic axillary hypermetabolic lymphadenopathy on FDG PET/CT after 2-dose COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34735411/\n• Lymphadenopathy associated with COVID-19 vaccination on FDG PET/CT: distinguishing features in adenovirus-vectored vaccine: https://pubmed.ncbi.nlm.nih.gov/34115709/.\n• COVID-19 vaccination-induced lymphadenopathy in a specialized breast imaging clinic in Israel: analysis of 163 cases: https://pubmed.ncbi.nlm.nih.gov/34257025/.\n• Regional lymphadenopathy after COVID-19 vaccination: review of the literature and considerations for patient management in breast cancer care: https://pubmed.ncbi.nlm.nih.gov/34731748/\n• Subclinical axillary lymphadenopathy associated with COVID-19 vaccination on screening mammography: https://pubmed.ncbi.nlm.nih.gov/34906409/\n• Adverse events of COVID injection that may occur in children.Acute-onset supraclavicular lymphadenopathy coincident with intramuscular mRNA vaccination against COVID-19 may be related to the injection technique of the vaccine, Spain, January and February 2021: https://pubmed.ncbi.nlm.nih.gov/33706861/\n• Supraclavicular lymphadenopathy after COVID-19 vaccination in Korea: serial follow-up by ultrasonography: https://pubmed.ncbi.nlm.nih.gov/34116295/\n• Oxford-AstraZeneca COVID-19 vaccination induced lymphadenopathy on [18F] choline PET / CT, not just an FDG finding: https://pubmed.ncbi.nlm.nih.gov/33661328/\n• Biphasic anaphylaxis after exposure to the first dose of Pfizer-BioNTech COVID-19 mRNA vaccine COVID-19: https://pubmed.ncbi.nlm.nih.gov/34050949/\n• Axillary adenopathy associated with COVID-19 vaccination: imaging findings and follow-up recommendations in 23 women: https://pubmed.ncbi.nlm.nih.gov/33624520/\n• Thrombotic adverse events reported for Moderna, Pfizer, and Oxford-AstraZeneca COVID-19 vaccines: comparison of occurrence and clinical outcomes in the EudraVigilance database: https://pubmed.ncbi.nlm.nih.gov/34835256/\n• Unilateral lymphadenopathy after COVID-19 vaccination: a practical management plan for radiologists of all specialties: https://pubmed.ncbi.nlm.nih.gov/33713605/\n• Unilateral axillary adenopathy in the setting of COVID-19 vaccination: follow-up: https://pubmed.ncbi.nlm.nih.gov/34298342/\n• A systematic review of cases of CNS demyelination following COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34839149/\n• Supraclavicular lymphadenopathy after COVID-19 vaccination: an increasing presentation in the two-week wait neck lump clinic: https://pubmed.ncbi.nlm.nih.gov/33685772/\n• COVID-19 vaccine-related axillary and cervical lymphadenopathy in patients with current or previous breast cancer and other malignancies: cross-sectional imaging findings on MRI, CT and PET-CT: https://pubmed.ncbi.nlm.nih.gov/34719892/\n• Incidence of axillary adenopathy on breast imaging after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34292295/.\n• Cervical lymphadenopathy after coronavirus disease vaccination 2019: clinical features and implications for head and neck cancer services: https://pubmed.ncbi.nlm.nih.gov/34526175/\n• Lymphadenopathy associated with the COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33786231/\n• Evolution of lymphadenopathy on PET/MRI after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/33625301/.\n• Axillary lymphadenopathy in patients with recent Covid-19 vaccination: a new diagnostic dilemma: https://pubmed.ncbi.nlm.nih.gov/34825530/.\n• Acute-onset supraclavicular lymphadenopathy coincident with intramuscular mRNA vaccination against COVID-19 may be related to the injection technique of the vaccine, Spain, January and February 2021: https://pubmed.ncbi.nlm.nih.gov/33706861/\n• Supraclavicular lymphadenopathy after COVID-19 vaccination in Korea: serial follow-up by ultrasonography: https://pubmed.ncbi.nlm.nih.gov/34116295/\n• Oxford-AstraZeneca COVID-19 vaccination induced lymphadenopathy on [18F] choline PET / CT, not just an FDG finding: https://pubmed.ncbi.nlm.nih.gov/33661328/\n• Biphasic anaphylaxis after exposure to the first dose of Pfizer-BioNTech COVID-19 mRNA vaccine COVID-19: https://pubmed.ncbi.nlm.nih.gov/34050949/\n• Axillary adenopathy associated with COVID-19 vaccination: imaging findings and follow-up recommendations in 23 women: https://pubmed.ncbi.nlm.nih.gov/33624520/\n• Thrombotic adverse events reported for Moderna, Pfizer, and Oxford-AstraZeneca COVID-19 vaccines: comparison of occurrence and clinical outcomes in the EudraVigilance database: https://pubmed.ncbi.nlm.nih.gov/34835256/\n• Unilateral lymphadenopathy after COVID-19 vaccination: a practical management plan for radiologists of all specialties: https://pubmed.ncbi.nlm.nih.gov/33713605/\n• Unilateral axillary adenopathy in the setting of COVID-19 vaccination: follow-up: https://pubmed.ncbi.nlm.nih.gov/34298342/\n• A systematic review of cases of CNS demyelination following COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/34839149/\n• Supraclavicular lymphadenopathy after COVID-19 vaccination: an increasing presentation in the two-week wait neck lump clinic: https://pubmed.ncbi.nlm.nih.gov/33685772/\n• COVID-19 vaccine-related axillary and cervical lymphadenopathy in patients with current or previous breast cancer and other malignancies: cross-sectional imaging findings on MRI, CT and PET-CT: https://pubmed.ncbi.nlm.nih.gov/34719892/\n• Incidence of axillary adenopathy on breast imaging after vaccination with COVID-19: https://pubmed.ncbi.nlm.nih.gov/34292295/.\n• Cervical lymphadenopathy after coronavirus disease vaccination 2019: clinical features and implications for head and neck cancer services: https://pubmed.ncbi.nlm.nih.gov/34526175/\n• Lymphadenopathy associated with the COVID-19 vaccine: https://pubmed.ncbi.nlm.nih.gov/33786231/\n• Evolution of lymphadenopathy on PET/MRI after COVID-19 vaccination: https://pubmed.ncbi.nlm.nih.gov/33625301/.\n• Axillary lymphadenopathy in patients with recent Covid-19 vaccination: a new diagnostic dilemma: https://pubmed.ncbi.nlm.nih.gov/34825530/.\n• Abbate, A., Gavin, J., Madanchi, N., Kim, C., Shah, P. R., Klein, K., . . . Danielides, S. (2021). Fulminant myocarditis and systemic hyperinflammation temporally associated with BNT162b2 mRNA COVID-19 vaccination in two patients. Int J Cardiol, 340, 119-121. doi:10.1016/j.ijcard.2021.08.018. https://www.ncbi.nlm.nih.gov/pubmed/34416319\n• Aye, Y. N., Mai, A. S., Zhang, A., Lim, O. Z. H., Lin, N., Ng, C. H., . . . Chew, N. W. S. (2021). Acute Myocardial Infarction and Myocarditis following COVID-19 Vaccination. QJM. doi:10.1093/qjmed/hcab252. https://www.ncbi.nlm.nih.gov/pubmed/34586408\n• Azir, M., Inman, B., Webb, J., & Tannenbaum, L. (2021). STEMI Mimic: Focal Myocarditis in an Adolescent Patient After mRNA COVID-19 Vaccine. J Emerg Med, 61(6), e129-e132. doi:10.1016/j.jemermed.2021.09.017. https://www.ncbi.nlm.nih.gov/pubmed/34756746\n• Barda, N., Dagan, N., Ben-Shlomo, Y., Kepten, E., Waxman, J., Ohana, R., . . . Balicer, R. D. (2021). Safety of the BNT162b2 mRNA Covid-19 Vaccine in a Nationwide Setting. N Engl J Med, 385(12), 1078-1090. doi:10.1056/NEJMoa2110475. https://www.ncbi.nlm.nih.gov/pubmed/34432976\n• Bhandari, M., Pradhan, A., Vishwakarma, P., & Sethi, R. (2021). Coronavirus and cardiovascular manifestations- getting to the heart of the matter. World J Cardiol, 13(10), 556-565. doi:10.4330/wjc.v13.i10.556. https://www.ncbi.nlm.nih.gov/pubmed/34754400\n• Buchhorn, R., Meyer, C., Schulze-Forster, K., Junker, J., & Heidecke, H. (2021). Autoantibody Release in Children after Corona Virus mRNA Vaccination: A Risk Factor of Multisystem Inflammatory Syndrome? Vaccines (Basel), 9(11). doi:10.3390/vaccines9111353. https://www.ncbi.nlm.nih.gov/pubmed/34835284\n• Calcaterra, G., Bassareo, P. P., Barilla, F., Romeo, F., & Mehta, J. L. (2022). Concerning the unexpected prothrombotic state following some coronavirus disease 2019 vaccines. J Cardiovasc Med (Hagerstown), 23(2), 71-74. doi:10.2459/JCM.0000000000001232. https://www.ncbi.nlm.nih.gov/pubmed/34366403\n• Calcaterra, G., Mehta, J. L., de Gregorio, C., Butera, G., Neroni, P., Fanos, V., & Bassareo, P. P. (2021). COVID 19 Vaccine for Adolescents. Concern about Myocarditis and Pericarditis. Pediatr Rep, 13(3), 530-533. doi:10.3390/pediatric13030061. https://www.ncbi.nlm.nih.gov/pubmed/34564344\n• Chai, Q., Nygaard, U., Schmidt, R. C., Zaremba, T., Moller, A. M., & Thorvig, C. M. (2022). Multisystem inflammatory syndrome in a male adolescent after his second Pfizer-BioNTech COVID-19 vaccine. Acta Paediatr, 111(1), 125-127. doi:10.1111/apa.16141. https://www.ncbi.nlm.nih.gov/pubmed/34617315\n• Chamling, B., Vehof, V., Drakos, S., Weil, M., Stalling, P., Vahlhaus, C., . . . Yilmaz, A. (2021). Occurrence of acute infarct-like myocarditis following COVID-19 vaccination: just an accidental co-incidence or rather vaccination-associated autoimmune myocarditis? Clin Res Cardiol, 110(11), 1850-1854. doi:10.1007/s00392-021-01916-w. https://www.ncbi.nlm.nih.gov/pubmed/34333695\n• Chang, J. C., & Hawley, H. B. (2021). Vaccine-Associated Thrombocytopenia and Thrombosis: Venous Endotheliopathy Leading to Venous Combined Micro-Macrothrombosis. Medicina (Kaunas), 57(11). doi:10.3390/medicina57111163. https://www.ncbi.nlm.nih.gov/pubmed/34833382\n• Chelala, L., Jeudy, J., Hossain, R., Rosenthal, G., Pietris, N., & White, C. (2021). Cardiac MRI Findings of Myocarditis After COVID-19 mRNA Vaccination in Adolescents. AJR Am J Roentgenol. doi:10.2214/AJR.21.26853. https://www.ncbi.nlm.nih.gov/pubmed/34704459\n• Choi, S., Lee, S., Seo, J. W., Kim, M. J., Jeon, Y. H., Park, J. H., . . . Yeo, N. S. (2021). Myocarditis-induced Sudden Death after BNT162b2 mRNA COVID-19 Vaccination in Korea: Case Report Focusing on Histopathological Findings. J Korean Med Sci, 36(40), e286. doi:10.3346/jkms.2021.36.e286. https://www.ncbi.nlm.nih.gov/pubmed/34664804\n• Chouchana, L., Blet, A., Al-Khalaf, M., Kafil, T. S., Nair, G., Robblee, J., . . . Liu, P. P. (2021). Features of Inflammatory Heart Reactions Following mRNA COVID-19 Vaccination at a Global Level. Clin Pharmacol Ther. doi:10.1002/cpt.2499. https://www.ncbi.nlm.nih.gov/pubmed/34860360\n• Chua, G. T., Kwan, M. Y. W., Chui, C. S. L., Smith, R. D., Cheung, E. C., Tian, T., . . . Ip, P. (2021). Epidemiology of Acute Myocarditis/Pericarditis in Hong Kong Adolescents Following Comirnaty Vaccination. Clin Infect Dis. doi:10.1093/cid/ciab989. https://www.ncbi.nlm.nih.gov/pubmed/34849657\n• Clarke, R., & Ioannou, A. (2021). Should T2 mapping be used in cases of recurrent myocarditis to differentiate between the acute inflammation and chronic scar? J Pediatr. doi:10.1016/j.jpeds.2021.12.026. https://www.ncbi.nlm.nih.gov/pubmed/34933012\n• Colaneri, M., De Filippo, M., Licari, A., Marseglia, A., Maiocchi, L., Ricciardi, A., . . . Bruno, R. (2021). COVID vaccination and asthma exacerbation: might there be a link? Int J Infect Dis, 112, 243-246. doi:10.1016/j.ijid.2021.09.026. https://www.ncbi.nlm.nih.gov/pubmed/34547487\n• Das, B. B., Kohli, U., Ramachandran, P., Nguyen, H. H., Greil, G., Hussain, T., . . . Khan, D. (2021). Myopericarditis after messenger RNA Coronavirus Disease 2019 Vaccination in Adolescents 12 to 18 Years of Age. J Pediatr, 238, 26-32 e21. doi:10.1016/j.jpeds.2021.07.044. https://www.ncbi.nlm.nih.gov/pubmed/34339728\n• Das, B. B., Moskowitz, W. B., Taylor, M. B., & Palmer, A. (2021). Myocarditis and Pericarditis Following mRNA COVID-19 Vaccination: What Do We Know So Far? Children (Basel), 8(7). doi:10.3390/children8070607. https://www.ncbi.nlm.nih.gov/pubmed/34356586\n• Deb, A., Abdelmalek, J., Iwuji, K., & Nugent, K. (2021). Acute Myocardial Injury Following COVID-19 Vaccination: A Case Report and Review of Current Evidence from Vaccine Adverse Events Reporting System Database. J Prim Care Community Health, 12, 21501327211029230. doi:10.1177/21501327211029230. https://www.ncbi.nlm.nih.gov/pubmed/34219532\n• Dickey, J. B., Albert, E., Badr, M., Laraja, K. M., Sena, L. M., Gerson, D. S., . . . Aurigemma, G. P. (2021). A Series of Patients With Myocarditis Following SARS-CoV-2 Vaccination With mRNA-1279 and BNT162b2. JACC Cardiovasc Imaging, 14(9), 1862-1863. doi:10.1016/j.jcmg.2021.06.003. https://www.ncbi.nlm.nih.gov/pubmed/34246585\n• Dimopoulou, D., Spyridis, N., Vartzelis, G., Tsolia, M. N., & Maritsi, D. N. (2021). Safety and tolerability of the COVID-19 mRNA-vaccine in adolescents with juvenile idiopathic arthritis on treatment with TNF-inhibitors. Arthritis Rheumatol. doi:10.1002/art.41977. https://www.ncbi.nlm.nih.gov/pubmed/34492161\n• Dimopoulou, D., Vartzelis, G., Dasoula, F., Tsolia, M., & Maritsi, D. (2021). Immunogenicity of the COVID-19 mRNA vaccine in adolescents with juvenile idiopathic arthritis on treatment with TNF inhibitors. Ann Rheum Dis. doi:10.1136/annrheumdis-2021-221607. https://www.ncbi.nlm.nih.gov/pubmed/34844930\n• Ehrlich, P., Klingel, K., Ohlmann-Knafo, S., Huttinger, S., Sood, N., Pickuth, D., & Kindermann, M. (2021). Biopsy-proven lymphocytic myocarditis following first mRNA COVID-19 vaccination in a 40-year-old male: case report. Clin Res Cardiol, 110(11), 1855-1859. doi:10.1007/s00392-021-01936-6. https://www.ncbi.nlm.nih.gov/pubmed/34487236\n• El Sahly, H. M., Baden, L. R., Essink, B., Doblecki-Lewis, S., Martin, J. M., Anderson, E. J., . . . Group, C. S. (2021). Efficacy of the mRNA-1273 SARS-CoV-2 Vaccine at Completion of Blinded Phase. N Engl J Med, 385(19), 1774-1785. doi:10.1056/NEJMoa2113017. https://www.ncbi.nlm.nih.gov/pubmed/34551225\n• Facetti, S., Giraldi, M., Vecchi, A. L., Rogiani, S., & Nassiacos, D. (2021). [Acute myocarditis in a young adult two days after Pfizer vaccination]. G Ital Cardiol (Rome), 22(11), 891-893. doi:10.1714/3689.36746. https://www.ncbi.nlm.nih.gov/pubmed/34709227\n• Fazlollahi, A., Zahmatyar, M., Noori, M., Nejadghaderi, S. A., Sullman, M. J. M., Shekarriz-Foumani, R., . . . Safiri, S. (2021). Cardiac complications following mRNA COVID-19 vaccines: A systematic review of case reports and case series. Rev Med Virol, e2318. doi:10.1002/rmv.2318. https://www.ncbi.nlm.nih.gov/pubmed/34921468\n• Fazolo, T., Lima, K., Fontoura, J. C., de Souza, P. O., Hilario, G., Zorzetto, R., . . . Bonorino, C. (2021). Pediatric COVID-19 patients in South Brazil show abundant viral mRNA and strong specific anti-viral responses. Nat Commun, 12(1), 6844. doi:10.1038/s41467-021-27120-y. https://www.ncbi.nlm.nih.gov/pubmed/34824230\n• Fikenzer, S., & Laufs, U. (2021). Correction to: Response to Letter to the editors referring to Fikenzer, S., Uhe, T., Lavall, D., Rudolph, U., Falz, R., Busse, M., Hepp, P., & Laufs, U. (2020). Effects of surgical and FFP2/N95 face masks on cardiopulmonary exercise capacity. Clinical research in cardiology: official journal of the German Cardiac Society, 1-9. Advance online publication. https://doi.org/10.1007/s00392-020-01704-y. Clin Res Cardiol, 110(8), 1352. doi:10.1007/s00392-021-01896-x. https://www.ncbi.nlm.nih.gov/pubmed/34170372\n• Foltran, D., Delmas, C., Flumian, C., De Paoli, P., Salvo, F., Gautier, S., . . . Montastruc, F. (2021). Myocarditis and Pericarditis in Adolescents after First and Second doses of mRNA COVID-19 Vaccines. Eur Heart J Qual Care Clin Outcomes. doi:10.1093/ehjqcco/qcab090. https://www.ncbi.nlm.nih.gov/pubmed/34849667\n• Forgacs, D., Jang, H., Abreu, R. B., Hanley, H. B., Gattiker, J. L., Jefferson, A. M., & Ross, T. M. (2021). SARS-CoV-2 mRNA Vaccines Elicit Different Responses in Immunologically Naive and Pre-Immune Humans. Front Immunol, 12, 728021. doi:10.3389/fimmu.2021.728021. https://www.ncbi.nlm.nih.gov/pubmed/34646267\n• Furer, V., Eviatar, T., Zisman, D., Peleg, H., Paran, D., Levartovsky, D., . . . Elkayam, O. (2021). Immunogenicity and safety of the BNT162b2 mRNA COVID-19 vaccine in adult patients with autoimmune inflammatory rheumatic diseases and in the general population: a multicentre study. Ann Rheum Dis, 80(10), 1330-1338. doi:10.1136/annrheumdis-2021-220647. https://www.ncbi.nlm.nih.gov/pubmed/34127481\n• Galindo, R., Chow, H., & Rongkavilit, C. (2021). COVID-19 in Children: Clinical Manifestations and Pharmacologic Interventions Including Vaccine Trials. Pediatr Clin North Am, 68(5), 961-976. doi:10.1016/j.pcl.2021.05.004. https://www.ncbi.nlm.nih.gov/pubmed/34538306\n• Gargano, J. W., Wallace, M., Hadler, S. C., Langley, G., Su, J. R., Oster, M. E., . . . Oliver, S. E. (2021). Use of mRNA COVID-19 Vaccine After Reports of Myocarditis Among Vaccine Recipients: Update from the Advisory Committee on Immunization Practices – United States, June 2021. MMWR Morb Mortal Wkly Rep, 70(27), 977-982. doi:10.15585/mmwr.mm7027e2. https://www.ncbi.nlm.nih.gov/pubmed/34237049\n• Gatti, M., Raschi, E., Moretti, U., Ardizzoni, A., Poluzzi, E., & Diemberger, I. (2021). Influenza Vaccination and Myo-Pericarditis in Patients Receiving Immune Checkpoint Inhibitors: Investigating the Likelihood of Interaction through the Vaccine Adverse Event Reporting System and VigiBase. Vaccines (Basel), 9(1). doi:10.3390/vaccines9010019. https://www.ncbi.nlm.nih.gov/pubmed/33406694\n• Greenhawt, M., Abrams, E. M., Shaker, M., Chu, D. K., Khan, D., Akin, C., . . . Golden, D. B. K. (2021). The Risk of Allergic Reaction to SARS-CoV-2 Vaccines and Recommended Evaluation and Management: A Systematic Review, Meta-Analysis, GRADE Assessment, and International Consensus Approach. J Allergy Clin Immunol Pract, 9(10), 3546-3567. doi:10.1016/j.jaip.2021.06.006. https://www.ncbi.nlm.nih.gov/pubmed/34153517\n• Haaf, P., Kuster, G. M., Mueller, C., Berger, C. T., Monney, P., Burger, P., . . . Tanner, F. C. (2021). The very low risk of myocarditis and pericarditis after mRNA COVID-19 vaccination should not discourage vaccination. Swiss Med Wkly, 151, w30087. doi:10.4414/smw.2021.w30087. https://www.ncbi.nlm.nih.gov/pubmed/34668687\n• Hasnie, A. A., Hasnie, U. A., Patel, N., Aziz, M. U., Xie, M., Lloyd, S. G., & Prabhu, S. D. (2021). Perimyocarditis following first dose of the mRNA-1273 SARS-CoV-2 (Moderna) vaccine in a healthy young male: a case report. BMC Cardiovasc Disord, 21(1), 375. doi:10.1186/s12872-021-02183-3. https://www.ncbi.nlm.nih.gov/pubmed/34348657\n• Hippisley-Cox, J., Patone, M., Mei, X. W., Saatci, D., Dixon, S., Khunti, K., . . . Coupland, C. A. C. (2021). Risk of thrombocytopenia and thromboembolism after covid-19 vaccination and SARS-CoV-2 positive testing: self-controlled case series study. BMJ, 374, n1931. doi:10.1136/bmj.n1931. https://www.ncbi.nlm.nih.gov/pubmed/34446426\n• Ho, J. S., Sia, C. H., Ngiam, J. N., Loh, P. H., Chew, N. W., Kong, W. K., & Poh, K. K. (2021). A review of COVID-19 vaccination and the reported cardiac manifestations. Singapore Med J. doi:10.11622/smedj.2021210. https://www.ncbi.nlm.nih.gov/pubmed/34808708\n• Iguchi, T., Umeda, H., Kojima, M., Kanno, Y., Tanaka, Y., Kinoshita, N., & Sato, D. (2021). Cumulative Adverse Event Reporting of Anaphylaxis After mRNA COVID-19 Vaccine (Pfizer-BioNTech) Injections in Japan: The First-Month Report. Drug Saf, 44(11), 1209-1214. doi:10.1007/s40264-021-01104-9. https://www.ncbi.nlm.nih.gov/pubmed/34347278\n• In brief: Myocarditis with the Pfizer/BioNTech and Moderna COVID-19 vaccines. (2021). Med Lett Drugs Ther, 63(1629), e9. Retrieved from https://www.ncbi.nlm.nih.gov/pubmed/34544112https://www.ncbi.nlm.nih.gov/pubmed/3454412\n• Ioannou, A. (2021a). Myocarditis should be considered in those with a troponin rise and unobstructed coronary arteries following Pfizer-BioNTech COVID-19 vaccination. QJM. doi:10.1093/qjmed/hcab231. https://www.ncbi.nlm.nih.gov/pubmed/34463755\n• Ioannou, A. (2021b). T2 mapping should be utilised in cases of suspected myocarditis to confirm an acute inflammatory process. QJM. doi:10.1093/qjmed/hcab326. https://www.ncbi.nlm.nih.gov/pubmed/34931681\n• Istampoulouoglou, I., Dimitriou, G., Spani, S., Christ, A., Zimmermanns, B., Koechlin, S., . . . Leuppi-Taegtmeyer, A. B. (2021). Myocarditis and pericarditis in association with COVID-19 mRNA-vaccination: cases from a regional pharmacovigilance centre. Glob Cardiol Sci Pract, 2021(3), e202118. doi:10.21542/gcsp.2021.18. https://www.ncbi.nlm.nih.gov/pubmed/34805376\n• Jaafar, R., Boschi, C., Aherfi, S., Bancod, A., Le Bideau, M., Edouard, S., . . . La Scola, B. (2021). High Individual Heterogeneity of Neutralizing Activities against the Original Strain and Nine Different Variants of SARS-CoV-2. Viruses, 13(11). doi:10.3390/v13112177. https://www.ncbi.nlm.nih.gov/pubmed/34834983\n• Jhaveri, R., Adler-Shohet, F. C., Blyth, C. C., Chiotos, K., Gerber, J. S., Green, M., . . . Zaoutis, T. (2021). Weighing the Risks of Perimyocarditis With the Benefits of SARS-CoV-2 mRNA Vaccination in Adolescents. J Pediatric Infect Dis Soc, 10(10), 937-939. doi:10.1093/jpids/piab061. https://www.ncbi.nlm.nih.gov/pubmed/34270752\n• Kaneta, K., Yokoi, K., Jojima, K., Kotooka, N., & Node, K. (2021). Young Male With Myocarditis Following mRNA-1273 Vaccination Against Coronavirus Disease-2019 (COVID-19). Circ J. doi:10.1253/circj.CJ-21-0818. https://www.ncbi.nlm.nih.gov/pubmed/34744118\n• Kim, H. W., Jenista, E. R., Wendell, D. C., Azevedo, C. F., Campbell, M. J., Darty, S. N., . . . Kim, R. J. (2021). Patients With Acute Myocarditis Following mRNA COVID-19 Vaccination. JAMA Cardiol, 6(10), 1196-1201. doi:10.1001/jamacardio.2021.2828. https://www.ncbi.nlm.nih.gov/pubmed/34185046\n• Kim, I. C., Kim, H., Lee, H. J., Kim, J. Y., & Kim, J. Y. (2021). Cardiac Imaging of Acute Myocarditis Following COVID-19 mRNA Vaccination. J Korean Med Sci, 36(32), e229. doi:10.3346/jkms.2021.36.e229. https://www.ncbi.nlm.nih.gov/pubmed/34402228\n• King, W. W., Petersen, M. R., Matar, R. M., Budweg, J. B., Cuervo Pardo, L., & Petersen, J. W. (2021). Myocarditis following mRNA vaccination against SARS-CoV-2, a case series. Am Heart J Plus, 8, 100042. doi:10.1016/j.ahjo.2021.100042. https://www.ncbi.nlm.nih.gov/pubmed/34396358\n• Klimek, L., Bergmann, K. C., Brehler, R., Pfutzner, W., Zuberbier, T., Hartmann, K., . . . Worm, M. (2021). Practical handling of allergic reactions to COVID-19 vaccines: A position paper from German and Austrian Allergy Societies AeDA, DGAKI, GPA and OGAI. Allergo J Int, 1-17. doi:10.1007/s40629-021-00165-7. https://www.ncbi.nlm.nih.gov/pubmed/33898162\n• Klimek, L., Novak, N., Hamelmann, E., Werfel, T., Wagenmann, M., Taube, C., . . . Worm, M. (2021). Severe allergic reactions after COVID-19 vaccination with the Pfizer/BioNTech vaccine in Great Britain and USA: Position statement of the German Allergy Societies: Medical Association of German Allergologists (AeDA), German Society for Allergology and Clinical Immunology (DGAKI) and Society for Pediatric Allergology and Environmental Medicine (GPA). Allergo J Int, 30(2), 51-55. doi:10.1007/s40629-020-00160-4. https://www.ncbi.nlm.nih.gov/pubmed/33643776\n• Kostoff, R. N., Calina, D., Kanduc, D., Briggs, M. B., Vlachoyiannopoulos, P., Svistunov, A. A., & Tsatsakis, A. (2021a). Erratum to “Why are we vaccinating children against COVID-19?” [Toxicol. Rep. 8C (2021) 1665-1684 / 1193]. Toxicol Rep, 8, 1981. doi:10.1016/j.toxrep.2021.10.003. https://www.ncbi.nlm.nih.gov/pubmed/34642628\n• Kostoff, R. N., Calina, D., Kanduc, D., Briggs, M. B., Vlachoyiannopoulos, P., Svistunov, A. A., & Tsatsakis, A. (2021b). Why are we vaccinating children against COVID-19? Toxicol Rep, 8, 1665-1684. doi:10.1016/j.toxrep.2021.08.010. https://www.ncbi.nlm.nih.gov/pubmed/34540594\n• Kremsner, P. G., Mann, P., Kroidl, A., Leroux-Roels, I., Schindler, C., Gabor, J. J., . . . Group, C.-N.-S. (2021). Safety and immunogenicity of an mRNA-lipid nanoparticle vaccine candidate against SARS-CoV-2 : A phase 1 randomized clinical trial. Wien Klin Wochenschr, 133(17-18), 931-941. doi:10.1007/s00508-021-01922-y. https://www.ncbi.nlm.nih.gov/pubmed/34378087\n• Kustin, T., Harel, N., Finkel, U., Perchik, S., Harari, S., Tahor, M., . . . Stern, A. (2021). Evidence for increased breakthrough rates of SARS-CoV-2 variants of concern in BNT162b2-mRNA-vaccinated individuals. Nat Med, 27(8), 1379-1384. doi:10.1038/s41591-021-01413-7. https://www.ncbi.nlm.nih.gov/pubmed/34127854\n• Kwan, M. Y. W., Chua, G. T., Chow, C. B., Tsao, S. S. L., To, K. K. W., Yuen, K. Y., . . . Ip, P. (2021). mRNA COVID vaccine and myocarditis in adolescents. Hong Kong Med J, 27(5), 326-327. doi:10.12809/hkmj215120. https://www.ncbi.nlm.nih.gov/pubmed/34393110\n• Lee, E., Chew, N. W. S., Ng, P., & Yeo, T. J. (2021). Reply to “Letter to the editor: Myocarditis should be considered in those with a troponin rise and unobstructed coronary arteries following PfizerBioNTech COVID-19 vaccination”. QJM. doi:10.1093/qjmed/hcab232. https://www.ncbi.nlm.nih.gov/pubmed/34463770\n• Lee, E. J., Cines, D. B., Gernsheimer, T., Kessler, C., Michel, M., Tarantino, M. D., . . . Bussel, J. B. (2021). Thrombocytopenia following Pfizer and Moderna SARS-CoV-2 vaccination. Am J Hematol, 96(5), 534-537. doi:10.1002/ajh.26132. https://www.ncbi.nlm.nih.gov/pubmed/33606296\n• Li, J., Hui, A., Zhang, X., Yang, Y., Tang, R., Ye, H., . . . Zhu, F. (2021). Safety and immunogenicity of the SARS-CoV-2 BNT162b1 mRNA vaccine in younger and older Chinese adults: a randomized, placebo-controlled, double-blind phase 1 study. Nat Med, 27(6), 1062-1070. doi:10.1038/s41591-021-01330-9. https://www.ncbi.nlm.nih.gov/pubmed/33888900\n• Li, M., Yuan, J., Lv, G., Brown, J., Jiang, X., & Lu, Z. K. (2021). Myocarditis and Pericarditis following COVID-19 Vaccination: Inequalities in Age and Vaccine Types. J Pers Med, 11(11). doi:10.3390/jpm11111106. https://www.ncbi.nlm.nih.gov/pubmed/34834458\n• Lim, Y., Kim, M. C., Kim, K. H., Jeong, I. S., Cho, Y. S., Choi, Y. D., & Lee, J. E. (2021). Case Report: Acute Fulminant Myocarditis and Cardiogenic Shock After Messenger RNA Coronavirus Disease 2019 Vaccination Requiring Extracorporeal Cardiopulmonary Resuscitation. Front Cardiovasc Med, 8, 758996. doi:10.3389/fcvm.2021.758996. https://www.ncbi.nlm.nih.gov/pubmed/34778411\n• Long, S. S. (2021). Important Insights into Myopericarditis after the Pfizer mRNA COVID-19 Vaccination in Adolescents. J Pediatr, 238, 5. doi:10.1016/j.jpeds.2021.07.057. https://www.ncbi.nlm.nih.gov/pubmed/34332972\n• Luk, A., Clarke, B., Dahdah, N., Ducharme, A., Krahn, A., McCrindle, B., . . . McDonald, M. (2021). Myocarditis and Pericarditis After COVID-19 mRNA Vaccination: Practical Considerations for Care Providers. Can J Cardiol, 37(10), 1629-1634. doi:10.1016/j.cjca.2021.08.001. https://www.ncbi.nlm.nih.gov/pubmed/34375696\n• Madelon, N., Lauper, K., Breville, G., Sabater Royo, I., Goldstein, R., Andrey, D. O., . . . Eberhardt, C. S. (2021). Robust T cell responses in anti-CD20 treated patients following COVID-19 vaccination: a prospective cohort study. Clin Infect Dis. doi:10.1093/cid/ciab954. https://www.ncbi.nlm.nih.gov/pubmed/34791081\n• Mangat, C., & Milosavljevic, N. (2021). BNT162b2 Vaccination during Pregnancy Protects Both the Mother and Infant: Anti-SARS-CoV-2 S Antibodies Persistently Positive in an Infant at 6 Months of Age. Case Rep Pediatr, 2021, 6901131. doi:10.1155/2021/6901131. https://www.ncbi.nlm.nih.gov/pubmed/34676123\n• Mark, C., Gupta, S., Punnett, A., Upton, J., Orkin, J., Atkinson, A., . . . Alexander, S. (2021). Safety of administration of BNT162b2 mRNA (Pfizer-BioNTech) COVID-19 vaccine in youths and young adults with a history of acute lymphoblastic leukemia and allergy to PEG-asparaginase. Pediatr Blood Cancer, 68(11), e29295. doi:10.1002/pbc.29295. https://www.ncbi.nlm.nih.gov/pubmed/34398511\n• Martins-Filho, P. R., Quintans-Junior, L. J., de Souza Araujo, A. A., Sposato, K. B., Souza Tavares, C. S., Gurgel, R. Q., . . . Santos, V. S. (2021). Socio-economic inequalities and COVID-19 incidence and mortality in Brazilian children: a nationwide register-based study. Public Health, 190, 4-6. doi:10.1016/j.puhe.2020.11.005. https://www.ncbi.nlm.nih.gov/pubmed/33316478\n• Mevorach, D., Anis, E., Cedar, N., Bromberg, M., Haas, E. J., Nadir, E., . . . Alroy-Preis, S. (2021). Myocarditis after BNT162b2 mRNA Vaccine against Covid-19 in Israel. N Engl J Med, 385(23), 2140-2149. doi:10.1056/NEJMoa2109730. https://www.ncbi.nlm.nih.gov/pubmed/34614328\n• Minocha, P. K., Better, D., Singh, R. K., & Hoque, T. (2021). Recurrence of Acute Myocarditis Temporally Associated with Receipt of the mRNA Coronavirus Disease 2019 (COVID-19) Vaccine in a Male Adolescent. J Pediatr, 238, 321-323. doi:10.1016/j.jpeds.2021.06.035. https://www.ncbi.nlm.nih.gov/pubmed/34166671\n• Moffitt, K., Cheung, E., Yeung, T., Stamoulis, C., & Malley, R. (2021). Analysis of Staphylococcus aureus Transcriptome in Pediatric Soft Tissue Abscesses and Comparison to Murine Infections. Infect Immun, 89(4). doi:10.1128/IAI.00715-20. https://www.ncbi.nlm.nih.gov/pubmed/33526560\n• Mohamed, L., Madsen, A. M. R., Schaltz-Buchholzer, F., Ostenfeld, A., Netea, M. G., Benn, C. S., & Kofoed, P. E. (2021). Reactivation of BCG vaccination scars after vaccination with mRNA-Covid-vaccines: two case reports. BMC Infect Dis, 21(1), 1264. doi:10.1186/s12879-021-06949-0. https://www.ncbi.nlm.nih.gov/pubmed/34930152\n• Montgomery, J., Ryan, M., Engler, R., Hoffman, D., McClenathan, B., Collins, L., . . . Cooper, L. T., Jr. (2021). Myocarditis Following Immunization With mRNA COVID-19 Vaccines in Members of the US Military. JAMA Cardiol, 6(10), 1202-1206. doi:10.1001/jamacardio.2021.2833. https://www.ncbi.nlm.nih.gov/pubmed/34185045\n• Ntouros, P. A., Vlachogiannis, N. I., Pappa, M., Nezos, A., Mavragani, C. P., Tektonidou, M. G., . . . Sfikakis, P. P. (2021). Effective DNA damage response after acute but not chronic immune challenge: SARS-CoV-2 vaccine versus Systemic Lupus Erythematosus. Clin Immunol, 229, 108765. doi:10.1016/j.clim.2021.108765. https://www.ncbi.nlm.nih.gov/pubmed/34089859\n• Nygaard, U., Holm, M., Bohnstedt, C., Chai, Q., Schmidt, L. S., Hartling, U. B., . . . Stensballe, L. G. (2022). Population-based Incidence of Myopericarditis After COVID-19 Vaccination in Danish Adolescents. Pediatr Infect Dis J, 41(1), e25-e28. doi:10.1097/INF.0000000000003389. https://www.ncbi.nlm.nih.gov/pubmed/34889875\n• Oberhardt, V., Luxenburger, H., Kemming, J., Schulien, I., Ciminski, K., Giese, S., . . . Hofmann, M. (2021). Rapid and stable mobilization of CD8(+) T cells by SARS-CoV-2 mRNA vaccine. Nature, 597(7875), 268-273. doi:10.1038/s41586-021-03841-4. https://www.ncbi.nlm.nih.gov/pubmed/34320609\n• Park, H., Yun, K. W., Kim, K. R., Song, S. H., Ahn, B., Kim, D. R., . . . Kim, Y. J. (2021). Epidemiology and Clinical Features of Myocarditis/Pericarditis before the Introduction of mRNA COVID-19 Vaccine in Korean Children: a Multicenter Study. J Korean Med Sci, 36(32), e232. doi:10.3346/jkms.2021.36.e232. https://www.ncbi.nlm.nih.gov/pubmed/34402230\n• Park, J., Brekke, D. R., & Bratincsak, A. (2021). Self-limited myocarditis presenting with chest pain and ST segment elevation in adolescents after vaccination with the BNT162b2 mRNA vaccine. Cardiol Young, 1-4. doi:10.1017/S1047951121002547. https://www.ncbi.nlm.nih.gov/pubmed/34180390\n• Patel, Y. R., Louis, D. W., Atalay, M., Agarwal, S., & Shah, N. R. (2021). Cardiovascular magnetic resonance findings in young adult patients with acute myocarditis following mRNA COVID-19 vaccination: a case series. J Cardiovasc Magn Reson, 23(1), 101. doi:10.1186/s12968-021-00795-4. https://www.ncbi.nlm.nih.gov/pubmed/34496880\n• Patone, M., Mei, X. W., Handunnetthi, L., Dixon, S., Zaccardi, F., Shankar-Hari, M., . . . Hippisley-Cox, J. (2021). Risks of myocarditis, pericarditis, and cardiac arrhythmias associated with COVID-19 vaccination or SARS-CoV-2 infection. Nat Med. doi:10.1038/s41591-021-01630-0. https://www.ncbi.nlm.nih.gov/pubmed/34907393\n• Patrignani, A., Schicchi, N., Calcagnoli, F., Falchetti, E., Ciampani, N., Argalia, G., & Mariani, A. (2021). Acute myocarditis following Comirnaty vaccination in a healthy man with previous SARS-CoV-2 infection. Radiol Case Rep, 16(11), 3321-3325. doi:10.1016/j.radcr.2021.07.082. https://www.ncbi.nlm.nih.gov/pubmed/34367386\n• Perrotta, A., Biondi-Zoccai, G., Saade, W., Miraldi, F., Morelli, A., Marullo, A. G., . . . Peruzzi, M. (2021). A snapshot global survey on side effects of COVID-19 vaccines among healthcare professionals and armed forces with a focus on headache. Panminerva Med, 63(3), 324-331. doi:10.23736/S0031-0808.21.04435-9. https://www.ncbi.nlm.nih.gov/pubmed/34738774\n• Pinana, J. L., Lopez-Corral, L., Martino, R., Montoro, J., Vazquez, L., Perez, A., . . . Cell Therapy, G. (2022). SARS-CoV-2-reactive antibody detection after SARS-CoV-2 vaccination in hematopoietic stem cell transplant recipients: Prospective survey from the Spanish Hematopoietic Stem Cell Transplantation and Cell Therapy Group. Am J Hematol, 97(1), 30-42. doi:10.1002/ajh.26385. https://www.ncbi.nlm.nih.gov/pubmed/34695229\n• Revon-Riviere, G., Ninove, L., Min, V., Rome, A., Coze, C., Verschuur, A., . . . Andre, N. (2021). The BNT162b2 mRNA COVID-19 vaccine in adolescents and young adults with cancer: A monocentric experience. Eur J Cancer, 154, 30-34. doi:10.1016/j.ejca.2021.06.002. https://www.ncbi.nlm.nih.gov/pubmed/34233234\n• Sanchez Tijmes, F., Thavendiranathan, P., Udell, J. A., Seidman, M. A., & Hanneman, K. (2021). Cardiac MRI Assessment of Nonischemic Myocardial Inflammation: State of the Art Review and Update on Myocarditis Associated with COVID-19 Vaccination. Radiol Cardiothorac Imaging, 3(6), e210252. doi:10.1148/ryct.210252. https://www.ncbi.nlm.nih.gov/pubmed/34934954\n• Schauer, J., Buddhe, S., Colyer, J., Sagiv, E., Law, Y., Mallenahalli Chikkabyrappa, S., & Portman, M. A. (2021). Myopericarditis After the Pfizer Messenger Ribonucleic Acid Coronavirus Disease Vaccine in Adolescents. J Pediatr, 238, 317-320. doi:10.1016/j.jpeds.2021.06.083. https://www.ncbi.nlm.nih.gov/pubmed/34228985\n• Schneider, J., Sottmann, L., Greinacher, A., Hagen, M., Kasper, H. U., Kuhnen, C., . . . Schmeling, A. (2021). Postmortem investigation of fatalities following vaccination with COVID-19 vaccines. Int J Legal Med, 135(6), 2335-2345. doi:10.1007/s00414-021-02706-9. https://www.ncbi.nlm.nih.gov/pubmed/34591186\n• Schramm, R., Costard-Jackle, A., Rivinius, R., Fischer, B., Muller, B., Boeken, U., . . . Gummert, J. (2021). Poor humoral and T-cell response to two-dose SARS-CoV-2 messenger RNA vaccine BNT162b2 in cardiothoracic transplant recipients. Clin Res Cardiol, 110(8), 1142-1149. doi:10.1007/s00392-021-01880-5. https://www.ncbi.nlm.nih.gov/pubmed/34241676\n• Sessa, F., Salerno, M., Esposito, M., Di Nunno, N., Zamboni, P., & Pomara, C. (2021). Autopsy Findings and Causality Relationship between Death and COVID-19 Vaccination: A Systematic Review. J Clin Med, 10(24). doi:10.3390/jcm10245876. https://www.ncbi.nlm.nih.gov/pubmed/34945172\n• Sharif, N., Alzahrani, K. J., Ahmed, S. N., & Dey, S. K. (2021). Efficacy, Immunogenicity and Safety of COVID-19 Vaccines: A Systematic Review and Meta-Analysis. Front Immunol, 12, 714170. doi:10.3389/fimmu.2021.714170. https://www.ncbi.nlm.nih.gov/pubmed/34707602\n• Shazley, O., & Alshazley, M. (2021). A COVID-Positive 52-Year-Old Man Presented With Venous Thromboembolism and Disseminated Intravascular Coagulation Following Johnson & Johnson Vaccination: A Case-Study. Cureus, 13(7), e16383. doi:10.7759/cureus.16383. https://www.ncbi.nlm.nih.gov/pubmed/34408937\n• Simone, A., Herald, J., Chen, A., Gulati, N., Shen, A. Y., Lewin, B., & Lee, M. S. (2021). Acute Myocarditis Following COVID-19 mRNA Vaccination in Adults Aged 18 Years or Older. JAMA Intern Med, 181(12), 1668-1670. doi:10.1001/jamainternmed.2021.5511. https://www.ncbi.nlm.nih.gov/pubmed/34605853\n• Singer, M. E., Taub, I. B., & Kaelber, D. C. (2021). Risk of Myocarditis from COVID-19 Infection in People Under Age 20: A Population-Based Analysis. medRxiv. doi:10.1101/2021.07.23.21260998. https://www.ncbi.nlm.nih.gov/pubmed/34341797\n• Smith, C., Odd, D., Harwood, R., Ward, J., Linney, M., Clark, M., . . . Fraser, L. K. (2021). Deaths in children and young people in England after SARS-CoV-2 infection during the first pandemic year. Nat Med. doi:10.1038/s41591-021-01578-1. https://www.ncbi.nlm.nih.gov/pubmed/34764489\n• Snapiri, O., Rosenberg Danziger, C., Shirman, N., Weissbach, A., Lowenthal, A., Ayalon, I., . . . Bilavsky, E. (2021). Transient Cardiac Injury in Adolescents Receiving the BNT162b2 mRNA COVID-19 Vaccine. Pediatr Infect Dis J, 40(10), e360-e363. doi:10.1097/INF.0000000000003235. https://www.ncbi.nlm.nih.gov/pubmed/34077949\n• Spinner, J. A., Julien, C. L., Olayinka, L., Dreyer, W. J., Bocchini, C. E., Munoz, F. M., & Devaraj, S. (2021). SARS-CoV-2 anti-spike antibodies after vaccination in pediatric heart transplantation: A first report. J Heart Lung Transplant. doi:10.1016/j.healun.2021.11.001. https://www.ncbi.nlm.nih.gov/pubmed/34911654\n• Sulemankhil, I., Abdelrahman, M., & Negi, S. I. (2021). Temporal association between the COVID-19 Ad26.COV2.S vaccine and acute myocarditis: A case report and literature review. Cardiovasc Revasc Med. doi:10.1016/j.carrev.2021.08.012. https://www.ncbi.nlm.nih.gov/pubmed/34420869\n• Tailor, P. D., Feighery, A. M., El-Sabawi, B., & Prasad, A. (2021). Case report: acute myocarditis following the second dose of mRNA-1273 SARS-CoV-2 vaccine. Eur Heart J Case Rep, 5(8), ytab319. doi:10.1093/ehjcr/ytab319. https://www.ncbi.nlm.nih.gov/pubmed/34514306\n• Team, C. C.-R., Food, & Drug, A. (2021). Allergic Reactions Including Anaphylaxis After Receipt of the First Dose of Pfizer-BioNTech COVID-19 Vaccine – United States, December 14-23, 2020. MMWR Morb Mortal Wkly Rep, 70(2), 46-51. doi:10.15585/mmwr.mm7002e1. https://www.ncbi.nlm.nih.gov/pubmed/33444297\n• Thompson, M. G., Burgess, J. L., Naleway, A. L., Tyner, H., Yoon, S. K., Meece, J., . . . Gaglani, M. (2021). Prevention and Attenuation of Covid-19 with the BNT162b2 and mRNA-1273 Vaccines. N Engl J Med, 385(4), 320-329. doi:10.1056/NEJMoa2107058. https://www.ncbi.nlm.nih.gov/pubmed/34192428\n• Truong, D. T., Dionne, A., Muniz, J. C., McHugh, K. E., Portman, M. A., Lambert, L. M., . . . Newburger, J. W. (2021). Clinically Suspected Myocarditis Temporally Related to COVID-19 Vaccination in Adolescents and Young Adults. Circulation. doi:10.1161/CIRCULATIONAHA.121.056583. https://www.ncbi.nlm.nih.gov/pubmed/34865500\n• Umei, T. C., Kishino, Y., Shiraishi, Y., Inohara, T., Yuasa, S., & Fukuda, K. (2021). Recurrence of myopericarditis following mRNA COVID-19 vaccination in a male adolescent. CJC Open. doi:10.1016/j.cjco.2021.12.002. https://www.ncbi.nlm.nih.gov/pubmed/34904134\n• Vidula, M. K., Ambrose, M., Glassberg, H., Chokshi, N., Chen, T., Ferrari, V. A., & Han, Y. (2021). Myocarditis and Other Cardiovascular Complications of the mRNA-Based COVID-19 Vaccines. Cureus, 13(6), e15576. doi:10.7759/cureus.15576. https://www.ncbi.nlm.nih.gov/pubmed/34277198\n• Warren, C. M., Snow, T. T., Lee, A. S., Shah, M. M., Heider, A., Blomkalns, A., . . . Nadeau, K. C. (2021). Assessment of Allergic and Anaphylactic Reactions to mRNA COVID-19 Vaccines With Confirmatory Testing in a US Regional Health System. JAMA Netw Open, 4(9), e2125524. doi:10.1001/jamanetworkopen.2021.25524. https://www.ncbi.nlm.nih.gov/pubmed/34533570\n• Watkins, K., Griffin, G., Septaric, K., & Simon, E. L. (2021). Myocarditis after BNT162b2 vaccination in a healthy male. Am J Emerg Med, 50, 815 e811-815 e812. doi:10.1016/j.ajem.2021.06.051. https://www.ncbi.nlm.nih.gov/pubmed/34229940\n• Weitzman, E. R., Sherman, A. C., & Levy, O. (2021). SARS-CoV-2 mRNA Vaccine Attitudes as Expressed in U.S. FDA Public Commentary: Need for a Public-Private Partnership in a Learning Immunization System. Front Public Health, 9, 695807. doi:10.3389/fpubh.2021.695807. https://www.ncbi.nlm.nih.gov/pubmed/34336774\n• Welsh, K. J., Baumblatt, J., Chege, W., Goud, R., & Nair, N. (2021). Thrombocytopenia including immune thrombocytopenia after receipt of mRNA COVID-19 vaccines reported to the Vaccine Adverse Event Reporting System (VAERS). Vaccine, 39(25), 3329-3332. doi:10.1016/j.vaccine.2021.04.054. https://www.ncbi.nlm.nih.gov/pubmed/34006408\n• Zimmermann, P., & Curtis, N. (2020). Why is COVID-19 less severe in children? A review of the proposed mechanisms underlying the age-related difference in severity of SARS-CoV-2 infections. Arch Dis Child. doi:10.1136/archdischild-2020-320338. https://www.ncbi.nlm.nih.gov/pubmed/33262177\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccines: Proof of Lethality. Over One Thousand Scientific Studies - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version). To receive Global Research’s Daily Newsletter (selected articles), click here. Visit and follow us on Instagram at @globalresearch_crg. First published by Global Research on January 21, 2022 Since the publication …", "url": "https://www.globalresearch.ca/covid-19-vaccines-scientific-proof-lethality/5767711", "site_name": "Global Research", "article:tag": "United Kingdom", "article:section": "English", "article:published_time": "2023-04-15T15:02:30+00:00", "article:modified_time": "2023-04-15T19:53:20+00:00", "updated_time": "2023-04-15T19:53:20+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/08/RFK-Jr-journalists-report-truth-Covid-vaccines-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/08/RFK-Jr-journalists-report-truth-Covid-vaccines-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Europe", "Media Disinformation", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01608-1/", "https://www.sciencedirect.com/science/article/pii/S1052305721003414", "https://pubmed.ncbi.nlm.nih.gov/33928772/", "https://www.sciencedirect.com/science/article/pii/S2666602221000409", "https://www.sciencedirect.com/science/article/pii/S2213333X21003929", "https://www.sciencedirect.com/science/article/abs/pii/S1936879821003988", "https://pubmed.ncbi.nlm.nih.gov/33929487/", "https://www.thelancet.com/journals/langas/article/PIIS2468-1253(21)00197-7/", "https://pubmed.ncbi.nlm.nih.gov/33871350/", "https://www.sciencedirect.com/science/article/pii/S0022510X21003014", "https://www.sciencedirect.com/science/article/abs/pii/S0735675721004381", "https://www.sciencedirect.com/science/article/abs/pii/S0033062021000505", "https://www.sciencedirect.com/science/article/abs/pii/S0953620521001904", "https://www.sciencedirect.com/science/article/pii/S1665268121000557", "https://www.sciencedirect.com/science/article/pii/S1050173821000967", "https://www.sciencedirect.com/science/article/abs/pii/S1568997221002160", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)01788-8/fulltext", "https://www.nejm.org/doi/full/10.1056/nejme2106315", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601", "https://www.nejm.org/doi/full/10.1056/NEJMoa2104882?query=recirc_curatedRelated_article", "https://pubmed.ncbi.nlm.nih.gov/34374740/", "https://www.nejm.org/doi/full/10.1056/NEJMoa2104840?query=recirc_curatedRelated_article", "https://haematologica.org/article/view/haematol.2021.279075", "https://www.sciencedirect.com/science/article/pii/S0264410X21005247", "https://pediatrics.aappublications.org/content/early/2021/06/04/peds.2021-052478", "https://www.sciencedirect.com/science/article/pii/S2589238X21000292#f0005", "https://www.sciencedirect.com/science/article/abs/pii/S0896841121000895", "https://www.sciencedirect.com/science/article/abs/pii/S0049384821003315", "https://www.sciencedirect.com/science/article/pii/S0896841121000937", "https://www.sciencedirect.com/science/article/abs/pii/S1052305721003098", "https://www.sciencedirect.com/science/article/pii/S0953620521002363", "https://www.sciencedirect.com/science/article/pii/S0828282X21006243", "https://www.sciencedirect.com/science/article/pii/S2666572721000389", "https://www.sciencedirect.com/science/article/pii/S0196064421003425", "https://www.sciencedirect.com/science/article/pii/S1443950621011562", "https://www.sciencedirect.com/science/article/abs/pii/S0896841121000706", "https://www.sciencedirect.com/science/article/pii/S0006497121009411", "https://www.sciencedirect.com/science/article/pii/S2589936821000256", "https://www.sciencedirect.com/science/article/pii/S1871402121002046", "https://www.sciencedirect.com/science/article/pii/S0049384821004369", "https://www.sciencedirect.com/science/article/pii/S0735109721051949", "https://www.sciencedirect.com/science/article/pii/S0735675721005714", "https://www.sciencedirect.com/science/article/abs/pii/S088915912100163X", "https://www.sciencedirect.com/science/article/abs/pii/S0006497121013963", "https://docs.google.com/document/d/1XzajasO8VMMnC3CdxSBKks1o7kiOLXFQ", "https://www.sciencedirect.com/science/article/pii/S0953620521002314", "https://www.sciencedirect.com/science/article/pii/S0213485321000839", "https://pubmed.ncbi.nlm.nih.gov/33918932/", "https://pubmed.ncbi.nlm.nih.gov/33606296/", "https://pubmed.ncbi.nlm.nih.gov/33854395/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7996471/", "https://pubmed.ncbi.nlm.nih.gov/33863748/", "https://onlinelibrary.wiley.com/doi/10.1002/ana.26172", "https://pubmed.ncbi.nlm.nih.gov/34133027/", "https://pubmed.ncbi.nlm.nih.gov/34001390/", "https://pubmed.ncbi.nlm.nih.gov/34181446/", "https://pubmed.ncbi.nlm.nih.gov/34174723/", "https://www.nature.com/articles/s41591-021-01408-4", "https://pubmed.ncbi.nlm.nih.gov/34075578/", "https://pubmed.ncbi.nlm.nih.gov/34105244/", "https://www.nejm.org/doi/full/10.1056/NEJMc2106383", "https://www.nature.com/articles/s41586-021-03744-4", "https://www.ahajournals.org/doi/pdf/10.1161/CIRCULATIONAHA.121.056135", "https://jamanetwork.com/journals/jama/fullarticle/2782900", "https://www.ahajournals.org/doi/pdf/10.1161/CIRCULATIONAHA.121.055891", "https://pediatrics.aappublications.org/content/pediatrics/early/2021/08/12/peds.2021-053427.full.pdf", "https://pubmed.ncbi.nlm.nih.gov/33994339/", "https://www.sciencedirect.com/science/article/pii/S1553838921005789", "https://www.sciencedirect.com/science/article/pii/S1871402121002253", "https://www.sciencedirect.com/science/article/pii/S1936878X2100485X", "https://www.sciencedirect.com/science/article/pii/S002234762100617X", "https://www.sciencedirect.com/science/article/pii/S0167527321012286", "https://www.sciencedirect.com/science/article/pii/S2214250921001530", "https://www.sciencedirect.com/science/article/pii/S2352906721001573", "https://www.sciencedirect.com/science/article/pii/S0735675721005362", "https://www.sciencedirect.com/science/article/pii/S1930043321005549", "https://www.sciencedirect.com/science/article/pii/S002234762100665X", "https://www.sciencedirect.com/science/article/pii/S1885585721002218", "https://www.sciencedirect.com/science/article/pii/S2589790X21001931", "https://www.sciencedirect.com/science/article/pii/S2352906721000622", "https://www.sciencedirect.com/science/article/pii/S0022347621007368", "https://www.sciencedirect.com/science/article/pii/S0870255121003243", "https://www.sciencedirect.com/science/article/pii/S0022347621007496", "https://www.sciencedirect.com/science/article/pii/S1936878X21004861", "https://www.sciencedirect.com/science/article/pii/S1443950621011331", "https://pubmed.ncbi.nlm.nih.gov/34268277/", "https://pubmed.ncbi.nlm.nih.gov/34399967/", "https://search.bvsalud.org/global-literature-on-novel-coronavirus-2019-ncov/resourc%20e/en/covidwho-1360706", "https://pubmed.ncbi.nlm.nih.gov/34246566/", "https://www.cureus.com/articles/61030-myocarditis-and-other-cardiovascular-complications-of-the-mrna-based-covid-19-vaccines", "https://pubmed.ncbi.nlm.nih.gov/34340927/", "https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.121.056135", "https://media.jamanetwork.com/news-item/association-of-myocarditis-with-mrna-co%20vid-19-vaccine-in-children/", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2783052", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781601%5C", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781600", "https://www.nejm.org/doi/full/10.1056/NEJMc2109975", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781602", "https://pubs.rsna.org/doi/10.1148/radiol.2021211430", "https://pediatrics.aappublications.org/content/148/3/e2021052478", "https://jcmr-online.biomedcentral.com/articles/10.1186/s12968-021-00795-4", "https://www.cps.ca/en/documents/position/clinical-guidance-for-youth-with-myocarditis-and-pericarditis", "https://pubmed.ncbi.nlm.nih.gov/34402228/", "https://academic.oup.com/ehjcr/article/5/8/ytab319/6339567", "https://science.gc.ca/eic/site/063.nsf/eng/h_98291.html", "https://journals.lww.com/pidj/Abstract/9000/Transient_Cardiac_Injury_in_Adolesce%20nts_Receiving.95800.aspx", "https://academic.oup.com/jpids/advance-article/doi/10.1093/jpids/piab060/6329543", "https://pubmed.ncbi.nlm.nih.gov/34312010/", "https://pubmed.ncbi.nlm.nih.gov/34219532/", "https://www.xiahepublishing.com/m/2472-0712/ERHM-2021-00033", "https://www.ahajournals.org/doi/10.1161/CIRCIMAGING.121.013236", "https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.121.056038", "https://pubmed.ncbi.nlm.nih.gov/34333695/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8216855/", "https://pubmed.ncbi.nlm.nih.gov/34118375/", "https://pubmed.ncbi.nlm.nih.gov/34180390/", "https://pubmed.ncbi.nlm.nih.gov/34133825/", "https://pubmed.ncbi.nlm.nih.gov/34487236/", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab741/6359059", "https://pubmed.ncbi.nlm.nih.gov/34447639/", "https://bmccardiovascdisord.biomedcentral.com/articles/10.1186/s12872-021-02183", "https://pubmed.ncbi.nlm.nih.gov/34236331/", "https://pubmed.ncbi.nlm.nih.gov/34435250/", "https://pubmed.ncbi.nlm.nih.gov/34186348/", "https://www.sciencedirect.com/science/article/pii/S2666354621000065", "https://www.sciencedirect.com/science/article/pii/S0303846721004169", "https://www.sciencedirect.com/science/article/pii/S0165572821002186", "https://www.sciencedirect.com/science/article/pii/S2214250921000998", "https://www.sciencedirect.com/science/article/pii/S0736467921006442", "https://www.sciencedirect.com/science/article/pii/S0035378721005853", "https://www.sciencedirect.com/science/article/pii/S2049080121005343", "https://www.sciencedirect.com/science/article/pii/S2049080121007536", "https://www.sciencedirect.com/science/article/pii/S1201971221007049", "https://www.sciencedirect.com/science/article/pii/S0899707121003557", "https://www.sciencedirect.com/science/article/pii/S0165572821001569", "https://www.sciencedirect.com/science/article/pii/S0165572821002137", "https://www.sciencedirect.com/science/article/pii/S1473309921002735", "https://www.sciencedirect.com/science/article/pii/S266635462100020X", "https://www.sciencedirect.com/science/article/pii/S2451993621001456", "https://www.sciencedirect.com/science/article/pii/S217358082100122X", "https://www.sciencedirect.com/science/article/pii/S2213219821007972", "https://www.sciencedirect.com/science/article/pii/S1930043321002612", "https://www.sciencedirect.com/science/article/pii/S0272638621007423", "https://www.sciencedirect.com/science/article/pii/S2213219821007996", "https://www.sciencedirect.com/science/article/pii/S1871402121001880", "https://www.sciencedirect.com/science/article/pii/S0190962221024427", "https://www.sciencedirect.com/science/article/abs/pii/S0735675721004381", "https://www.sciencedirect.com/science/article/pii/S1939455121000119", "https://www.sciencedirect.com/science/article/pii/S1871402121002046", "https://www.sciencedirect.com/science/article/abs/pii/S188558572100133X", "https://www.sciencedirect.com/science/article/pii/S0896841121000937", "https://www.sciencedirect.com/science/article/pii/S2214250921002018", "https://www.sciencedirect.com/science/article/pii/S1876034121001878", "https://www.nejm.org/doi/full/10.1056/NEJMoa2104983", "https://www.researchsquare.com/article/rs-477964/v1", "https://link.springer.com/article/10.1007/s00415-021-10780-7", "https://pubmed.ncbi.nlm.nih.gov/33475702/", "https://pubmed.ncbi.nlm.nih.gov/33320974/", "https://pubmed.ncbi.nlm.nih.gov/33384356/", "https://pubmed.ncbi.nlm.nih.gov/33444297/", "https://pubmed.ncbi.nlm.nih.gov/33507892/", "https://pubmed.ncbi.nlm.nih.gov/34414880/", "https://pubmed.ncbi.nlm.nih.gov/33576785/", "https://pubmed.ncbi.nlm.nih.gov/34269740/", "https://pubmed.ncbi.nlm.nih.gov/34215453/", "https://pubmed.ncbi.nlm.nih.gov/33932618/", "https://pubmed.ncbi.nlm.nih.gov/33643776/", "https://pubmed.ncbi.nlm.nih.gov/33571463/", "https://pubmed.ncbi.nlm.nih.gov/33527524/", "https://pubmed.ncbi.nlm.nih.gov/34518015/", "https://pubmed.ncbi.nlm.nih.gov/34347278/", "https://pubmed.ncbi.nlm.nih.gov/33685103/", "https://pubmed.ncbi.nlm.nih.gov/34050949/", "https://pubmed.ncbi.nlm.nih.gov/33657648/", "https://pubmed.ncbi.nlm.nih.gov/33825239/", "https://pubmed.ncbi.nlm.nih.gov/33683290/", "https://pubmed.ncbi.nlm.nih.gov/33919151/", "https://pubmed.ncbi.nlm.nih.gov/34128049/", "https://pubmed.ncbi.nlm.nih.gov/34474708/", "https://www.tandfonline.com/doi/abs/10.1080/17843286.2021.1909447", "https://pubmed.ncbi.nlm.nih.gov/34318537/", "https://pubmed.ncbi.nlm.nih.gov/34463751/", "https://pubmed.ncbi.nlm.nih.gov/33752263/", "https://pubmed.ncbi.nlm.nih.gov/34073536/", "https://pubmed.ncbi.nlm.nih.gov/33928772/", "https://pubmed.ncbi.nlm.nih.gov/34423106/", "https://pubmed.ncbi.nlm.nih.gov/33838206/", "https://pubmed.ncbi.nlm.nih.gov/34517079/", "https://pubmed.ncbi.nlm.nih.gov/34254291/", "https://pubmed.ncbi.nlm.nih.gov/34487581/", "https://pubmed.ncbi.nlm.nih.gov/33987882/", "https://pubmed.ncbi.nlm.nih.gov/34138513/", "https://pubmed.ncbi.nlm.nih.gov/34402235/", "https://pubmed.ncbi.nlm.nih.gov/34446426/", "https://pubmed.ncbi.nlm.nih.gov/34365148/", "https://pubmed.ncbi.nlm.nih.gov/34452064/", "https://pubmed.ncbi.nlm.nih.gov/33917902/", "https://pubmed.ncbi.nlm.nih.gov/34256983/", "https://pubmed.ncbi.nlm.nih.gov/34247246/", "https://pubmed.ncbi.nlm.nih.gov/34132839/", "https://pubmed.ncbi.nlm.nih.gov/34117206/", "https://pubmed.ncbi.nlm.nih.gov/34033927/", "https://pubmed.ncbi.nlm.nih.gov/34277198/", "https://pubmed.ncbi.nlm.nih.gov/34364831/", "https://pubmed.ncbi.nlm.nih.gov/34447639/", "https://pubmed.ncbi.nlm.nih.gov/34514306/", "https://pubmed.ncbi.nlm.nih.gov/33946748/", "https://pubmed.ncbi.nlm.nih.gov/34453510/", "https://pubmed.ncbi.nlm.nih.gov/33476455/", "https://pubmed.ncbi.nlm.nih.gov/34451967/", "https://pubmed.ncbi.nlm.nih.gov/34377889/", "https://pubmed.ncbi.nlm.nih.gov/34272095/", "https://pubmed.ncbi.nlm.nih.gov/34165512/", "https://pubmed.ncbi.nlm.nih.gov/34411533/", "https://pubmed.ncbi.nlm.nih.gov/33611630/", "https://pubmed.ncbi.nlm.nih.gov/33981305/", "https://pubmed.ncbi.nlm.nih.gov/34336436/", "https://pubmed.ncbi.nlm.nih.gov/34281950/", "https://pubmed.ncbi.nlm.nih.gov/34458035/", "https://pubmed.ncbi.nlm.nih.gov/33734623/", "https://pubmed.ncbi.nlm.nih.gov/34044114/", "https://pubmed.ncbi.nlm.nih.gov/34492394/", "https://pubmed.ncbi.nlm.nih.gov/34369471/", "https://pubmed.ncbi.nlm.nih.gov/34014316/", "https://pubmed.ncbi.nlm.nih.gov/34330676/", "https://pubmed.ncbi.nlm.nih.gov/34272622/", "https://pubmed.ncbi.nlm.nih.gov/34477091/", "https://pubmed.ncbi.nlm.nih.gov/33975372/", "https://pubmed.ncbi.nlm.nih.gov/34322761/", "https://pubmed.ncbi.nlm.nih.gov/34139321/", "https://pubmed.ncbi.nlm.nih.gov/34032902/", "https://pubmed.ncbi.nlm.nih.gov/33862041/", "https://pubmed.ncbi.nlm.nih.gov/34332438/", "https://pubmed.ncbi.nlm.nih.gov/34293683/", "https://pubmed.ncbi.nlm.nih.gov/34225251/", "https://pubmed.ncbi.nlm.nih.gov/34449715/", "https://pubmed.ncbi.nlm.nih.gov/34139631/", "https://pubmed.ncbi.nlm.nih.gov/33864750/", "https://pubmed.ncbi.nlm.nih.gov/33914590/", "https://pubmed.ncbi.nlm.nih.gov/34420802/", "https://pubmed.ncbi.nlm.nih.gov/34293217/", "https://pubmed.ncbi.nlm.nih.gov/34446426/", "https://pubmed.ncbi.nlm.nih.gov/34174723/", "https://pubmed.ncbi.nlm.nih.gov/33952445/", "https://pubmed.ncbi.nlm.nih.gov/34108714/", "https://pubmed.ncbi.nlm.nih.gov/34288044/", "https://pubmed.ncbi.nlm.nih.gov/34341358/", "https://pubmed.ncbi.nlm.nih.gov/34261633/", "https://pubmed.ncbi.nlm.nih.gov/34256983/", "https://pubmed.ncbi.nlm.nih.gov/34332437/", "https://pubmed.ncbi.nlm.nih.gov/33845870/", "https://pubmed.ncbi.nlm.nih.gov/34236343/", "https://pubmed.ncbi.nlm.nih.gov/34364657/", "https://pubmed.ncbi.nlm.nih.gov/34287612/", "https://pubmed.ncbi.nlm.nih.gov/34478433/", "https://pubmed.ncbi.nlm.nih.gov/34402235/", "https://pubmed.ncbi.nlm.nih.gov/34186376/", "https://pubmed.ncbi.nlm.nih.gov/34101024/", "https://pubmed.ncbi.nlm.nih.gov/34137813/", "https://pubmed.ncbi.nlm.nih.gov/34191218/", "https://pubmed.ncbi.nlm.nih.gov/34175640/", "https://pubmed.ncbi.nlm.nih.gov/34153802/", "https://pubmed.ncbi.nlm.nih.gov/34092488/", "https://pubmed.ncbi.nlm.nih.gov/34261635/", "https://pubmed.ncbi.nlm.nih.gov/34132839/", "https://pubmed.ncbi.nlm.nih.gov/34144250/", "https://pubmed.ncbi.nlm.nih.gov/33687691/", "https://pubmed.ncbi.nlm.nih.gov/34011137/", "https://pubmed.ncbi.nlm.nih.gov/34393988/", "https://pubmed.ncbi.nlm.nih.gov/34129181/", "https://pubmed.ncbi.nlm.nih.gov/34083026/", "https://pubmed.ncbi.nlm.nih.gov/34247246/", "https://pubmed.ncbi.nlm.nih.gov/34235757/", "https://pubmed.ncbi.nlm.nih.gov/34473841/", "https://pubmed.ncbi.nlm.nih.gov/34189756/", "https://pubmed.ncbi.nlm.nih.gov/34045111/", "https://pubmed.ncbi.nlm.nih.gov/34366434/", "https://pubmed.ncbi.nlm.nih.gov/34330677/", "https://pubmed.ncbi.nlm.nih.gov/34181446/", "https://pubmed.ncbi.nlm.nih.gov/34477089/", "https://pubmed.ncbi.nlm.nih.gov/34071883/", "https://pubmed.ncbi.nlm.nih.gov/34033367/", "https://pubmed.ncbi.nlm.nih.gov/34375510/", "https://pubmed.ncbi.nlm.nih.gov/34107198/", "https://pubmed.ncbi.nlm.nih.gov/34355379/", "https://pubmed.ncbi.nlm.nih.gov/34452028/", "https://pubmed.ncbi.nlm.nih.gov/34202817/", "https://pubmed.ncbi.nlm.nih.gov/34237213/", "https://pubmed.ncbi.nlm.nih.gov/34105247/", "https://pubmed.ncbi.nlm.nih.gov/34405870/", "https://pubmed.ncbi.nlm.nih.gov/34416410/", "https://pubmed.ncbi.nlm.nih.gov/34462013/", "https://pubmed.ncbi.nlm.nih.gov/34224024/", "https://pubmed.ncbi.nlm.nih.gov/34324214/", "https://pubmed.ncbi.nlm.nih.gov/34507266/", "https://pubmed.ncbi.nlm.nih.gov/34459725/", "https://pubmed.ncbi.nlm.nih.gov/34463066/", "https://pubmed.ncbi.nlm.nih.gov/34043800/", "https://pubmed.ncbi.nlm.nih.gov/34447646/", "https://pubmed.ncbi.nlm.nih.gov/34479760/", "https://pubmed.ncbi.nlm.nih.gov/34416319/", "https://pubmed.ncbi.nlm.nih.gov/34092166/", "https://pubmed.ncbi.nlm.nih.gov/34291477/", "https://pubmed.ncbi.nlm.nih.gov/34513435/", "https://pubmed.ncbi.nlm.nih.gov/34512037/", "https://pubmed.ncbi.nlm.nih.gov/34483273/", "https://pubmed.ncbi.nlm.nih.gov/34513446/", "https://pubmed.ncbi.nlm.nih.gov/34474550/", "https://pubmed.ncbi.nlm.nih.gov/34033732/", "https://pubmed.ncbi.nlm.nih.gov/33858208/", "https://pubmed.ncbi.nlm.nih.gov/34015240/", "https://pubmed.ncbi.nlm.nih.gov/34482558/", "https://pubmed.ncbi.nlm.nih.gov/34480607/", "https://pubmed.ncbi.nlm.nih.gov/34462647/", "https://pubmed.ncbi.nlm.nih.gov/34325334/", "https://pubmed.ncbi.nlm.nih.gov/34513398/", "https://pubmed.ncbi.nlm.nih.gov/34362727/", "https://pubmed.ncbi.nlm.nih.gov/34469919/", "https://pubmed.ncbi.nlm.nih.gov/34516272/", "https://pubmed.ncbi.nlm.nih.gov/34512961/", "https://pubmed.ncbi.nlm.nih.gov/34077949/", "https://pubmed.ncbi.nlm.nih.gov/34171435/", "https://pubmed.ncbi.nlm.nih.gov/34447349/", "https://pubmed.ncbi.nlm.nih.gov/34514078/", "https://pubmed.ncbi.nlm.nih.gov/34406660/", "https://pubmed.ncbi.nlm.nih.gov/34509658/", "https://pubmed.ncbi.nlm.nih.gov/34196469/", "https://pubmed.ncbi.nlm.nih.gov/34350668/", "https://pubmed.ncbi.nlm.nih.gov/34436620/", "https://pubmed.ncbi.nlm.nih.gov/34116295/", "https://pubmed.ncbi.nlm.nih.gov/34509271/", "https://pubmed.ncbi.nlm.nih.gov/34462996/", "https://pubmed.ncbi.nlm.nih.gov/34435486/", "https://pubmed.ncbi.nlm.nih.gov/34435142/", "https://pubmed.ncbi.nlm.nih.gov/34429981/", "https://pubmed.ncbi.nlm.nih.gov/34427024/", "https://pubmed.ncbi.nlm.nih.gov/34510014/", "https://pubmed.ncbi.nlm.nih.gov/34236711/", "https://pubmed.ncbi.nlm.nih.gov/34525282/", "https://pubmed.ncbi.nlm.nih.gov/34515024/", "https://pubmed.ncbi.nlm.nih.gov/34435250/", "https://pubmed.ncbi.nlm.nih.gov/34363637/", "https://www.sciencedirect.com/science/article/pii/S2214250921002018", "https://casereports.bmj.com/content/14/5/e242220.abstract", "https://pubmed.ncbi.nlm.nih.gov/34155844/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8176657/", "https://www.annemergmed.com/article/S0196-0644(21)00122-0/fulltext", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8014568/", "https://casereports.bmj.com/content/14/7/e242678", "https://ashpublications.org/bloodadvances/article/5/13/2794/476324/Autoimmune-and-complement-mediated-hematologic", "https://ejhp.bmj.com/content/early/2021/05/23/ejhpharm-2021-002794", "https://ashpublications.org/blood/article/137/26/3670/475905/COVID-19-vaccines-induce-severe-hemolysis-in", "https://pubmed.ncbi.nlm.nih.gov/34288044/", "https://pubmed.ncbi.nlm.nih.gov/34327553/", "https://pubmed.ncbi.nlm.nih.gov/33878469/", "https://pubmed.ncbi.nlm.nih.gov/33857630/", "https://pubmed.ncbi.nlm.nih.gov/34090750/", "https://pubmed.ncbi.nlm.nih.gov/34312301/", "https://pubmed.ncbi.nlm.nih.gov/34333995/", "https://pubmed.ncbi.nlm.nih.gov/34455073/", "https://pubmed.ncbi.nlm.nih.gov/34111775/", "https://pubmed.ncbi.nlm.nih.gov/34045111/", "https://pubmed.ncbi.nlm.nih.gov/33983464/", "https://pubmed.ncbi.nlm.nih.gov/34116145/", "https://pubmed.ncbi.nlm.nih.gov/34286453/", "https://pubmed.ncbi.nlm.nih.gov/34478433/", "https://pubmed.ncbi.nlm.nih.gov/34244448/", "https://pubmed.ncbi.nlm.nih.gov/34226070/", "https://pubmed.ncbi.nlm.nih.gov/33845870/", "https://pubmed.ncbi.nlm.nih.gov/34101024/", "https://pubmed.ncbi.nlm.nih.gov/34393988/", "https://pubmed.ncbi.nlm.nih.gov/34407607/", "https://pubmed.ncbi.nlm.nih.gov/34313952/", "https://pubmed.ncbi.nlm.nih.gov/34092166/", "https://pubmed.ncbi.nlm.nih.gov/34293217/", "https://pubmed.ncbi.nlm.nih.gov/34274191/", "https://pubmed.ncbi.nlm.nih.gov/34186376/", "https://pubmed.ncbi.nlm.nih.gov/33952445/", "https://pubmed.ncbi.nlm.nih.gov/34129181/", "https://pubmed.ncbi.nlm.nih.gov/33929487/", "https://pubmed.ncbi.nlm.nih.gov/34341358/", "https://pubmed.ncbi.nlm.nih.gov/34175640/", "https://pubmed.ncbi.nlm.nih.gov/34159588/", "https://pubmed.ncbi.nlm.nih.gov/34402666/", "https://pubmed.ncbi.nlm.nih.gov/34508917/", "https://pubmed.ncbi.nlm.nih.gov/34370974/", "https://pubmed.ncbi.nlm.nih.gov/34373991/", "https://pubmed.ncbi.nlm.nih.gov/34490632/", "https://pubmed.ncbi.nlm.nih.gov/33909350/", "https://pubmed.ncbi.nlm.nih.gov/33981305/", "https://pubmed.ncbi.nlm.nih.gov/34272622/", "https://pubmed.ncbi.nlm.nih.gov/33877737/", "https://pubmed.ncbi.nlm.nih.gov/34254476/", "https://pubmed.ncbi.nlm.nih.gov/34108714/", "https://pubmed.ncbi.nlm.nih.gov/34483267/", "https://pubmed.ncbi.nlm.nih.gov/34261635/", "https://pubmed.ncbi.nlm.nih.gov/34202817/", "https://pubmed.ncbi.nlm.nih.gov/34273119/", "https://pubmed.ncbi.nlm.nih.gov/34463066/", "https://pubmed.ncbi.nlm.nih.gov/34276917/", "https://pubmed.ncbi.nlm.nih.gov/34237213/", "https://pubmed.ncbi.nlm.nih.gov/34268278/", "https://pubmed.ncbi.nlm.nih.gov/33990339/", "https://pubmed.ncbi.nlm.nih.gov/34479760/", "https://pubmed.ncbi.nlm.nih.gov/34314875/", "https://pubmed.ncbi.nlm.nih.gov/34384129/", "https://pubmed.ncbi.nlm.nih.gov/34382387/", "https://pubmed.ncbi.nlm.nih.gov/34416184/", "https://pubmed.ncbi.nlm.nih.gov/34261297/", "https://pubmed.ncbi.nlm.nih.gov/34261296/", "https://pubmed.ncbi.nlm.nih.gov/34250318/", "https://pubmed.ncbi.nlm.nih.gov/34059191/", "https://pubmed.ncbi.nlm.nih.gov/34189756/", "https://pubmed.ncbi.nlm.nih.gov/34331506/", "https://pubmed.ncbi.nlm.nih.gov/34525282/", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://www.medrxiv.org/content/10.1101/2021.09.13.21262182v1.full?s=09", "https://onlinelibrary.wiley.com/doi/10.1111/trf.16672", "https://t.co/j0IEM8cMXI", "https://pubmed.ncbi.nlm.nih.gov/34601006/", "https://www.nejm.org/doi/full/10.1056/NEJMoa2110475", "https://www.sciencedirect.com/science/article/pii/S1201971221007797", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v1", "https://www.sciencedirect.com/science/article/pii/S0168827821020936", "https://www.nature.com/articles/s41421-021-00329-3", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8553377/", "https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712", "https://pubmed.ncbi.nlm.nih.gov/34626338/", "https://europepmc.org/article/PPR/PPR304469%20435", "https://pubmed.ncbi.nlm.nih.gov/34731555/", "https://pubmed.ncbi.nlm.nih.gov/34159588/", "https://pubmed.ncbi.nlm.nih.gov/34461442/", "https://pubmed.ncbi.nlm.nih.gov/34719776/", "https://pubmed.ncbi.nlm.nih.gov/34370974/", "https://pubmed.ncbi.nlm.nih.gov/34373413/", "https://pubmed.ncbi.nlm.nih.gov/34598301/", "https://pubmed.ncbi.nlm.nih.gov/34620638/", "https://pubmed.ncbi.nlm.nih.gov/34650896/", "https://pubmed.ncbi.nlm.nih.gov/34625447/", "https://pubmed.ncbi.nlm.nih.gov/34696248/", "https://pubmed.ncbi.nlm.nih.gov/34548920/", "https://pubmed.ncbi.nlm.nih.gov/34672380/", "https://pubmed.ncbi.nlm.nih.gov/34556531/", "https://pubmed.ncbi.nlm.nih.gov/34535076/", "https://pubmed.ncbi.nlm.nih.gov/34379914/", "https://pubmed.ncbi.nlm.nih.gov/34545400/", "https://pubmed.ncbi.nlm.nih.gov/34035134/", "https://pubmed.ncbi.nlm.nih.gov/34688190/", "https://pubmed.ncbi.nlm.nih.gov/34782400/", "https://pubmed.ncbi.nlm.nih.gov/34710832/", "https://pubmed.ncbi.nlm.nih.gov/34695859/", "https://pubmed.ncbi.nlm.nih.gov/34453762/", "https://pubmed.ncbi.nlm.nih.gov/34660652/", "https://pubmed.ncbi.nlm.nih.gov/34644642/", "https://pubmed.ncbi.nlm.nih.gov/34694650/", "https://pubmed.ncbi.nlm.nih.gov/34726934/", "https://pubmed.ncbi.nlm.nih.gov/34835237/", "https://pubmed.ncbi.nlm.nih.gov/34261297/", "https://pubmed.ncbi.nlm.nih.gov/34724036/", "https://pubmed.ncbi.nlm.nih.gov/34839563/", "https://pubmed.ncbi.nlm.nih.gov/34783932/", "https://pubmed.ncbi.nlm.nih.gov/34624910/", "https://pubmed.ncbi.nlm.nih.gov/34585145/", "https://pubmed.ncbi.nlm.nih.gov/34580132/", "https://pubmed.ncbi.nlm.nih.gov/34535492/", "https://pubmed.ncbi.nlm.nih.gov/34527501/", "https://pubmed.ncbi.nlm.nih.gov/34272095/", "https://pubmed.ncbi.nlm.nih.gov/34756770/", "https://jamanetwork.com/journals/jamaneurology/fullarticle/2784622", "https://pubmed.ncbi.nlm.nih.gov/34781321/", "https://pubmed.ncbi.nlm.nih.gov/34062319/", "https://pubmed.ncbi.nlm.nih.gov/34706921/", "https://pubmed.ncbi.nlm.nih.gov/34698582/", "https://pubmed.ncbi.nlm.nih.gov/34751013/", "https://pubmed.ncbi.nlm.nih.gov/34684047/", "https://pubmed.ncbi.nlm.nih.gov/34541935/", "https://pubmed.ncbi.nlm.nih.gov/34273119/", "https://pubmed.ncbi.nlm.nih.gov/34327553/", "https://pubmed.ncbi.nlm.nih.gov/33877737/", "https://pubmed.ncbi.nlm.nih.gov/34646685/", "https://pubmed.ncbi.nlm.nih.gov/34242687/", "https://pubmed.ncbi.nlm.nih.gov/34609603/", "https://pubmed.ncbi.nlm.nih.gov/34557507/", "https://pubmed.ncbi.nlm.nih.gov/34641797/", "https://pubmed.ncbi.nlm.nih.gov/34812326/", "https://pubmed.ncbi.nlm.nih.gov/34006408/", "https://pubmed.ncbi.nlm.nih.gov/34416184/", "https://pubmed.ncbi.nlm.nih.gov/34664303/", "https://pubmed.ncbi.nlm.nih.gov/34649281/", "https://pubmed.ncbi.nlm.nih.gov/34420249/", "https://pubmed.ncbi.nlm.nih.gov/34610990/", "https://pubmed.ncbi.nlm.nih.gov/34590397/", "https://pubmed.ncbi.nlm.nih.gov/34670143/", "https://pubmed.ncbi.nlm.nih.gov/34819146/", "https://pubmed.ncbi.nlm.nih.gov/34581453/", "https://pubmed.ncbi.nlm.nih.gov/34741583/", "https://pubmed.ncbi.nlm.nih.gov/34631069/", "https://pubmed.ncbi.nlm.nih.gov/34479129/", "https://pubmed.ncbi.nlm.nih.gov/34331506/", "https://pubmed.ncbi.nlm.nih.gov/34546608/", "https://pubmed.ncbi.nlm.nih.gov/34546343/", "https://pubmed.ncbi.nlm.nih.gov/34849183/", "https://pubmed.ncbi.nlm.nih.gov/34853744/", "https://pubmed.ncbi.nlm.nih.gov/34751429/", "https://pubmed.ncbi.nlm.nih.gov/34559576/", "https://pubmed.ncbi.nlm.nih.gov/34608345/", "https://pubmed.ncbi.nlm.nih.gov/34384129/", "https://pubmed.ncbi.nlm.nih.gov/34755433/", "https://pubmed.ncbi.nlm.nih.gov/34839830/", "https://pubmed.ncbi.nlm.nih.gov/34667486/", "https://pubmed.ncbi.nlm.nih.gov/34726187/", "https://pubmed.ncbi.nlm.nih.gov/34781027/", "https://pubmed.ncbi.nlm.nih.gov/34595694/", "https://pubmed.ncbi.nlm.nih.gov/34661934/", "https://pubmed.ncbi.nlm.nih.gov/34788138", "https://pubmed.ncbi.nlm.nih.gov/34753210/", "https://pubmed.ncbi.nlm.nih.gov/34653943/", "https://pubmed.ncbi.nlm.nih.gov/34591991/", "https://pubmed.ncbi.nlm.nih.gov/34650382/", "https://pubmed.ncbi.nlm.nih.gov/34769454/", "https://pubmed.ncbi.nlm.nih.gov/34786893/", "https://pubmed.ncbi.nlm.nih.gov/34833382/", "https://pubmed.ncbi.nlm.nih.gov/34670287/", "https://pubmed.ncbi.nlm.nih.gov/34790811/", "https://pubmed.ncbi.nlm.nih.gov/34023956/", "https://pubmed.ncbi.nlm.nih.gov/34629931/", "https://pubmed.ncbi.nlm.nih.gov/34402666/", "https://pubmed.ncbi.nlm.nih.gov/34842783/", "https://pubmed.ncbi.nlm.nih.gov/34630307/", "https://pubmed.ncbi.nlm.nih.gov/33983464/", "https://pubmed.ncbi.nlm.nih.gov/34508917/", "https://www.jcehepatology.com/article/S0973-6883(21)00545-4/fulltext", "https://pubmed.ncbi.nlm.nih.gov/33962903/", "https://pubmed.ncbi.nlm.nih.gov/34796065/", "https://pubmed.ncbi.nlm.nih.gov/34579248/", "https://pubmed.ncbi.nlm.nih.gov/34843991/", "https://pubmed.ncbi.nlm.nih.gov/34595867/", "https://pubmed.ncbi.nlm.nih.gov/34820240/", "https://pubmed.ncbi.nlm.nih.gov/33851389/", "https://pubmed.ncbi.nlm.nih.gov/33980419/", "https://pubmed.ncbi.nlm.nih.gov/34264151/", "https://pubmed.ncbi.nlm.nih.gov/34734086/", "https://pubmed.ncbi.nlm.nih.gov/34755555/", "https://pubmed.ncbi.nlm.nih.gov/34407607/", "https://pubmed.ncbi.nlm.nih.gov/34264514/", "https://pubmed.ncbi.nlm.nih.gov/34840204/", "https://pubmed.ncbi.nlm.nih.gov/34750810/", "https://pubmed.ncbi.nlm.nih.gov/34639132/", "https://pubmed.ncbi.nlm.nih.gov/34804412/", "https://pubmed.ncbi.nlm.nih.gov/34571653/", "https://pubmed.ncbi.nlm.nih.gov/34835275/", "https://pubmed.ncbi.nlm.nih.gov/34659839/", "https://pubmed.ncbi.nlm.nih.gov/34668274/", "https://pubmed.ncbi.nlm.nih.gov/34549821/", "https://pubmed.ncbi.nlm.nih.gov/34528522/", "https://pubmed.ncbi.nlm.nih.gov/34568726/", "https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/644%205179", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab926/6420408", "https://www.mdpi.com/2075-4426/11/11/1106", "https://pubmed.ncbi.nlm.nih.gov/34402230/", "https://pubmed.ncbi.nlm.nih.gov/34696294/", "https://journals.lww.com/pec-online/Abstract/2021/11000/Myocarditis_Following_%20mRNA_COVID_19_Vaccine.9.aspx", "https://pubmed.ncbi.nlm.nih.gov/34614328/", "https://www.heartlungcirc.org/article/S1443-9506(21)01156-2/fulltext", "https://pubmed.ncbi.nlm.nih.gov/34277198/", "https://pubmed.ncbi.nlm.nih.gov/34246586/", "https://pubmed.ncbi.nlm.nih.gov/34856634/", "https://www.internationaljournalofcardiology.com/article/S0167-5273(21)01477-7/fulltext", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8522388/", "https://www.nejm.org/doi/10.1056/NEJMoa2110737", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2783052", "https://www.ahajournals.org/doi/abs/10.1161/CIRCULATIONAHA.121.056583?url_ver=Z39.88-2003&rfr_id=ori:rid:crossref.org&rfr_dat=cr_pub%20%200pubmed", "https://pubmed.ncbi.nlm.nih.gov/34756746/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8587334/", "https://pubmed.ncbi.nlm.nih.gov/34546329/", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2781602", "https://www.sciencedirect.com/science/article/pii/S0264410X21011725?via%3Dihub", "https://publications.aap.org/pediatrics/article/148/5/e2021053427/181357", "https://pubmed.ncbi.nlm.nih.gov/34704459/", "https://academic.oup.com/ehjcimaging/advance-article/doi/10.1093/ehjci/jeab230/6%20421640", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8599115/", "https://www.sciencedirect.com/science/article/pii/S2352906721001603", "https://pubmed.ncbi.nlm.nih.gov/34712717/", "https://www.revespcardiol.org/en-linkresolver-acute-myocarditis-after-administration-bnt162b2-S188558572100133X", "https://pubs.rsna.org/doi/10.1148/radiol.2021211430", "https://www.sciencedirect.com/science/article/pii/S0248866321007098", "https://pubmed.ncbi.nlm.nih.gov/34589238/", "https://academic.oup.com/jpids/article/10/10/962/6329543", "https://ecevr.org/DOIx.php?id=10.7774/cevr.2021.10.2.196", "https://pubmed.ncbi.nlm.nih.gov/34428917/", "https://pubmed.ncbi.nlm.nih.gov/34088762/", "https://www.mdpi.com/2036-7503/13/3/61", "https://pubmed.ncbi.nlm.nih.gov/34402228/", "https://pubmed.ncbi.nlm.nih.gov/34133885/", "https://pubmed.ncbi.nlm.nih.gov/34219532/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8639400/", "https://pubmed.ncbi.nlm.nih.gov/34840235/", "https://pubmed.ncbi.nlm.nih.gov/34712497/", "https://www.clinicalimaging.org/article/S0899-7071(21)00265-5/fulltext", "https://pubmed.ncbi.nlm.nih.gov/34568726/", "https://academic.oup.com/cid/advance-article-abstract/doi/10.1093/cid/ciab989/6445179", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab926/6420408", "https://www.mdpi.com/2075-4426/11/11/1106", "https://pubmed.ncbi.nlm.nih.gov/34402230/", "https://pubmed.ncbi.nlm.nih.gov/34696294/", "https://pubmed.ncbi.nlm.nih.gov/34615534/", "https://pubmed.ncbi.nlm.nih.gov/34352418/", "https://jnnp.bmj.com/content/early/2021/09/29/jnnp-2021-327340", "https://pubmed.ncbi.nlm.nih.gov/34632750/", "https://haematologica.org/article/view/haematol.2021.279075", "https://pubmed.ncbi.nlm.nih.gov/34802488/", "https://pubmed.ncbi.nlm.nih.gov/34887867/", "https://pubmed.ncbi.nlm.nih.gov/34863404/", "https://www.sciencedirect.com/science/article/pii/S235255682100093X", "https://pubmed.ncbi.nlm.nih.gov/34876440/", "https://pubmed.ncbi.nlm.nih.gov/33928773/", "https://pubmed.ncbi.nlm.nih.gov/34880826/", "https://pubmed.ncbi.nlm.nih.gov/34587242/", "https://pubmed.ncbi.nlm.nih.gov/34868465/", "https://pubmed.ncbi.nlm.nih.gov/34097311/", "https://pubmed.ncbi.nlm.nih.gov/34820232/", "https://onlinelibrary.wiley.com/doi/10.1002/ajh.26258", "https://pubmed.ncbi.nlm.nih.gov/34579636/", "https://pubmed.ncbi.nlm.nih.gov/34614491/", "https://pubmed.ncbi.nlm.nih.gov/34790684/", "https://pubmed.ncbi.nlm.nih.gov/33624509/", "https://pubmed.ncbi.nlm.nih.gov/34612003/", "https://pubmed.ncbi.nlm.nih.gov/34096082/", "https://pubmed.ncbi.nlm.nih.gov/34851078/", "https://pubmed.ncbi.nlm.nih.gov/34496880/", "https://pubmed.ncbi.nlm.nih.gov/34866957/", "https://pubmed.ncbi.nlm.nih.gov/34849657/", "https://pubmed.ncbi.nlm.nih.gov/34664804/", "https://pubmed.ncbi.nlm.nih.gov/34605853/", "https://pubmed.ncbi.nlm.nih.gov/34166671/", "https://pubmed.ncbi.nlm.nih.gov/34744118/", "https://pubmed.ncbi.nlm.nih.gov/34334935/", "https://pubmed.ncbi.nlm.nih.gov/34746968/", "https://pubmed.ncbi.nlm.nih.gov/34333695/", "https://pubmed.ncbi.nlm.nih.gov/34180390/", "https://pubmed.ncbi.nlm.nih.gov/34185045/", "https://pubmed.ncbi.nlm.nih.gov/34229940/", "https://pubmed.ncbi.nlm.nih.gov/34133825/", "https://pubmed.ncbi.nlm.nih.gov/34308326/", "https://pubmed.ncbi.nlm.nih.gov/34866106/", "https://pubmed.ncbi.nlm.nih.gov/34487236/", "https://pubmed.ncbi.nlm.nih.gov/34848416/", "https://pubmed.ncbi.nlm.nih.gov/34636504/", "https://pubmed.ncbi.nlm.nih.gov/34367386/", "https://pubmed.ncbi.nlm.nih.gov/34709227/", "https://pubmed.ncbi.nlm.nih.gov/34778411/", "https://pubmed.ncbi.nlm.nih.gov/34734821/", "https://pubmed.ncbi.nlm.nih.gov/34246585/", "https://pubmed.ncbi.nlm.nih.gov/34228985/", "https://pubmed.ncbi.nlm.nih.gov/34852213/", "https://pubmed.ncbi.nlm.nih.gov/34866122/", "https://pubmed.ncbi.nlm.nih.gov/34601566/", "https://pubmed.ncbi.nlm.nih.gov/34739045/", "https://docs.google.com/document/d/1Hc4bh_qNbZ7UVm5BLxkRdMPnnI9zcCsl/e", "https://pubmed.ncbi.nlm.nih.gov/34374740/", "https://pubmed.ncbi.nlm.nih.gov/34865500/", "https://pubmed.ncbi.nlm.nih.gov/34614329/", "https://pubmed.ncbi.nlm.nih.gov/34560365/", "https://pubmed.ncbi.nlm.nih.gov/34108736/", "https://pubmed.ncbi.nlm.nih.gov/34796417/", "https://link.springer.com/article/10.1007%2Fs10072-021-05523-5", "https://onlinelibrary.wiley.com/doi/10.1002/ana.26258", "https://jamanetwork.com/journals/jama/fullarticle/2785009", "https://pubmed.ncbi.nlm.nih.gov/34567447/", "https://pubmed.ncbi.nlm.nih.gov/34648420/", "https://jamanetwork.com/journals/jamaneurology/fullarticle/2783708", "https://www.pedneur.com/article/S0887-8994(21)00221-6/fulltext", "https://pubmed.ncbi.nlm.nih.gov/34114256/", "https://pubmed.ncbi.nlm.nih.gov/34767184/", "https://pubmed.ncbi.nlm.nih.gov/34644738/", "https://pubmed.ncbi.nlm.nih.gov/34649856/", "https://pubmed.ncbi.nlm.nih.gov/34671572/", "https://pubmed.ncbi.nlm.nih.gov/33758714/", "https://pubmed.ncbi.nlm.nih.gov/34484780/", "https://pubmed.ncbi.nlm.nih.gov/34779385/", "https://pubmed.ncbi.nlm.nih.gov/34817727/", "https://pubmed.ncbi.nlm.nih.gov/34789193/", "https://pubmed.ncbi.nlm.nih.gov/34261746/", "https://pubmed.ncbi.nlm.nih.gov/34217513/", "https://pubmed.ncbi.nlm.nih.gov/34871447/", "https://pubmed.ncbi.nlm.nih.gov/34579259/", "https://pubmed.ncbi.nlm.nih.gov/34370408/", "https://pubmed.ncbi.nlm.nih.gov/34703690/", "https://pubmed.ncbi.nlm.nih.gov/34810163/", "https://onlinelibrary.wiley.com/doi/10.1002/ana.26218", "https://pubmed.ncbi.nlm.nih.gov/34482455/", "https://pubmed.ncbi.nlm.nih.gov/34114269/", "https://pubmed.ncbi.nlm.nih.gov/34722067/", "https://pubmed.ncbi.nlm.nih.gov/33968610/", "https://pubmed.ncbi.nlm.nih.gov/34525410/", "https://pubmed.ncbi.nlm.nih.gov/34808658/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00646-0/fulltext", "https://pubmed.ncbi.nlm.nih.gov/34522557/", "https://pubmed.ncbi.nlm.nih.gov/34763263/", "https://pubmed.ncbi.nlm.nih.gov/34621891/", "https://pubmed.ncbi.nlm.nih.gov/34697502/", "https://pubmed.ncbi.nlm.nih.gov/33858693/", "https://pubmed.ncbi.nlm.nih.gov/34370410/", "https://pubmed.ncbi.nlm.nih.gov/34579245/", "https://pubmed.ncbi.nlm.nih.gov/34182207/", "https://pubmed.ncbi.nlm.nih.gov/34457267/", "https://pubmed.ncbi.nlm.nih.gov/34189662/", "https://pubmed.ncbi.nlm.nih.gov/34660149/", "https://pubmed.ncbi.nlm.nih.gov/34131771/", "https://pubmed.ncbi.nlm.nih.gov/34635376/", "https://pubmed.ncbi.nlm.nih.gov/34749492/", "https://pubmed.ncbi.nlm.nih.gov/34849667/", "https://pubmed.ncbi.nlm.nih.gov/34319393/", "https://pubmed.ncbi.nlm.nih.gov/34589238/", "https://pubmed.ncbi.nlm.nih.gov/34149145/", "https://pubmed.ncbi.nlm.nih.gov/34693198/", "https://pubmed.ncbi.nlm.nih.gov/34797392/", "https://pubmed.ncbi.nlm.nih.gov/34862234/", "https://pubmed.ncbi.nlm.nih.gov/34396358/", "https://pubmed.ncbi.nlm.nih.gov/34848426/", "https://pubmed.ncbi.nlm.nih.gov/33946748/", "https://pubmed.ncbi.nlm.nih.gov/34591186/", "https://pubmed.ncbi.nlm.nih.gov/34352309/", "https://pubmed.ncbi.nlm.nih.gov/34804803/", "https://pubmed.ncbi.nlm.nih.gov/34077572/", "https://pubmed.ncbi.nlm.nih.gov/34884407/", "https://pubmed.ncbi.nlm.nih.gov/34859017/", "https://pubmed.ncbi.nlm.nih.gov/34783899/", "https://pubmed.ncbi.nlm.nih.gov/34549178/", "https://pubmed.ncbi.nlm.nih.gov/34656887/", "https://pubmed.ncbi.nlm.nih.gov/34236717/", "https://pubmed.ncbi.nlm.nih.gov/34729467/", "https://pubmed.ncbi.nlm.nih.gov/33932458/", "https://pubmed.ncbi.nlm.nih.gov/34092400/742", "https://pubmed.ncbi.nlm.nih.gov/34754937/", "https://pubmed.ncbi.nlm.nih.gov/33771584/", "https://pubmed.ncbi.nlm.nih.gov/34846583/", "https://pubmed.ncbi.nlm.nih.gov/34073536/", "https://pubmed.ncbi.nlm.nih.gov/34411532/", "https://www.medrxiv.org/content/10.1101/2021.12.02.21267156v1", "https://pubmed.ncbi.nlm.nih.gov/33851711/", "https://pubmed.ncbi.nlm.nih.gov/34675550/", "https://pubmed.ncbi.nlm.nih.gov/34734159/", "https://pubmed.ncbi.nlm.nih.gov/34698847/", "https://pubmed.ncbi.nlm.nih.gov/34020815/", "https://pubmed.ncbi.nlm.nih.gov/33641264/", "https://pubmed.ncbi.nlm.nih.gov/33641268/", "https://pubmed.ncbi.nlm.nih.gov/33834172/", "https://pubmed.ncbi.nlm.nih.gov/34579211/", "https://pubmed.ncbi.nlm.nih.gov/34343674/", "https://pubmed.ncbi.nlm.nih.gov/34586408/", "https://pubmed.ncbi.nlm.nih.gov/34539938/", "https://pubmed.ncbi.nlm.nih.gov/34731486/", "https://pubmed.ncbi.nlm.nih.gov/33824804/", "https://pubmed.ncbi.nlm.nih.gov/34807248/", "https://pubmed.ncbi.nlm.nih.gov/34148772/", "https://pubmed.ncbi.nlm.nih.gov/34702550/", "https://pubmed.ncbi.nlm.nih.gov/33895650/", "https://pubmed.ncbi.nlm.nih.gov/34425384/", "https://pubmed.ncbi.nlm.nih.gov/34703815/", "https://pubmed.ncbi.nlm.nih.gov/34369046/", "https://pubmed.ncbi.nlm.nih.gov/34280507/", "https://pubmed.ncbi.nlm.nih.gov/34241833/", "https://pubmed.ncbi.nlm.nih.gov/34529877/", "https://pubmed.ncbi.nlm.nih.gov/33928638/", "https://pubmed.ncbi.nlm.nih.gov/34836739/", "https://pubmed.ncbi.nlm.nih.gov/34495381/", "https://pubmed.ncbi.nlm.nih.gov/34327795", "https://pubmed.ncbi.nlm.nih.gov/34660867/", "https://pubmed.ncbi.nlm.nih.gov/34659268/", "https://pubmed.ncbi.nlm.nih.gov/34848431/", "https://pubmed.ncbi.nlm.nih.gov/34310759/", "https://pubmed.ncbi.nlm.nih.gov/34720009/", "https://pubmed.ncbi.nlm.nih.gov/34518812/", "https://pubmed.ncbi.nlm.nih.gov/34611627/", "https://pubmed.ncbi.nlm.nih.gov/34705320/", "https://pubmed.ncbi.nlm.nih.gov/34779011/", "https://pubmed.ncbi.nlm.nih.gov/34451967/", "https://pubmed.ncbi.nlm.nih.gov/33928459/", "https://pubmed.ncbi.nlm.nih.gov/34250509/", "https://pubmed.ncbi.nlm.nih.gov/34292611/", "https://pubmed.ncbi.nlm.nih.gov/34530771/", "https://pubmed.ncbi.nlm.nih.gov/34245294/", "https://pubmed.ncbi.nlm.nih.gov/34599716/", "https://pubmed.ncbi.nlm.nih.gov/34115904/", "https://pubmed.ncbi.nlm.nih.gov/34247902/", "https://pubmed.ncbi.nlm.nih.gov/34696186/", "https://pubmed.ncbi.nlm.nih.gov/34237323/", "https://pubmed.ncbi.nlm.nih.gov/34851795/", "https://pubmed.ncbi.nlm.nih.gov/34849386/", "https://pubmed.ncbi.nlm.nih.gov/34310763/", "https://pubmed.ncbi.nlm.nih.gov/34251683/", "https://pubmed.ncbi.nlm.nih.gov/34557622/", "https://pubmed.ncbi.nlm.nih.gov/34510694/", "https://pubmed.ncbi.nlm.nih.gov/34713472/803", "https://pubmed.ncbi.nlm.nih.gov/34819272/", "https://pubmed.ncbi.nlm.nih.gov/34337124/", "https://pubmed.ncbi.nlm.nih.gov/34535924/", "https://www.frontiersin.org/articles/10.3389/fmed.2021.798095/", "https://pubmed.ncbi.nlm.nih.gov/33591026/", "https://pubmed.ncbi.nlm.nih.gov/33625300/", "https://pubmed.ncbi.nlm.nih.gov/33774684/", "https://pubmed.ncbi.nlm.nih.gov/33985872/", "https://pubmed.ncbi.nlm.nih.gov/34735411/", "https://pubmed.ncbi.nlm.nih.gov/34115709/", "https://pubmed.ncbi.nlm.nih.gov/34257025/", "https://pubmed.ncbi.nlm.nih.gov/34836672/", "https://pubmed.ncbi.nlm.nih.gov/34280870/", "https://pubmed.ncbi.nlm.nih.gov/34432391/", "https://pubmed.ncbi.nlm.nih.gov/34731748/", "https://pubmed.ncbi.nlm.nih.gov/34906409/", "https://pubmed.ncbi.nlm.nih.gov/33706861/", "https://pubmed.ncbi.nlm.nih.gov/34116295/", "https://pubmed.ncbi.nlm.nih.gov/33661328/", "https://pubmed.ncbi.nlm.nih.gov/34050949/", "https://pubmed.ncbi.nlm.nih.gov/33624520/", "https://pubmed.ncbi.nlm.nih.gov/34141500/", "https://pubmed.ncbi.nlm.nih.gov/34096896/", "https://pubmed.ncbi.nlm.nih.gov/34835256/", "https://pubmed.ncbi.nlm.nih.gov/33713605/", "https://pubmed.ncbi.nlm.nih.gov/34298342/", "https://pubmed.ncbi.nlm.nih.gov/34839149/", "https://pubmed.ncbi.nlm.nih.gov/33685772/", "https://pubmed.ncbi.nlm.nih.gov/34719892/", "https://pubmed.ncbi.nlm.nih.gov/33625299/", "https://pubmed.ncbi.nlm.nih.gov/34292295/", "https://pubmed.ncbi.nlm.nih.gov/33947605/", "https://pubmed.ncbi.nlm.nih.gov/34526175/", "https://pubmed.ncbi.nlm.nih.gov/33786231/", "https://pubmed.ncbi.nlm.nih.gov/33625301/", "https://pubmed.ncbi.nlm.nih.gov/34332438/", "https://pubmed.ncbi.nlm.nih.gov/34342187/", "https://pubmed.ncbi.nlm.nih.gov/34601889/", "https://pubmed.ncbi.nlm.nih.gov/34081948/", "https://pubmed.ncbi.nlm.nih.gov/34507942/", "https://pubmed.ncbi.nlm.nih.gov/34362727/", "https://pubmed.ncbi.nlm.nih.gov/34325221/", "https://pubmed.ncbi.nlm.nih.gov/34825530/", "https://pubmed.ncbi.nlm.nih.gov/34000278/", "https://pubmed.ncbi.nlm.nih.gov/34655312/", "https://pubmed.ncbi.nlm.nih.gov/34187985/", "https://pubmed.ncbi.nlm.nih.gov/33706861/", "https://pubmed.ncbi.nlm.nih.gov/34116295/", "https://pubmed.ncbi.nlm.nih.gov/33661328/", "https://pubmed.ncbi.nlm.nih.gov/34050949/", "https://pubmed.ncbi.nlm.nih.gov/33624520/", "https://pubmed.ncbi.nlm.nih.gov/34141500/", "https://pubmed.ncbi.nlm.nih.gov/34096896/", "https://pubmed.ncbi.nlm.nih.gov/34835256/", "https://pubmed.ncbi.nlm.nih.gov/33713605/", "https://pubmed.ncbi.nlm.nih.gov/34298342/", "https://pubmed.ncbi.nlm.nih.gov/34839149/", "https://pubmed.ncbi.nlm.nih.gov/33685772/", "https://pubmed.ncbi.nlm.nih.gov/34719892/", "https://pubmed.ncbi.nlm.nih.gov/33625299/", "https://pubmed.ncbi.nlm.nih.gov/34292295/", "https://pubmed.ncbi.nlm.nih.gov/33947605/", "https://pubmed.ncbi.nlm.nih.gov/34526175/", "https://pubmed.ncbi.nlm.nih.gov/33786231/", "https://pubmed.ncbi.nlm.nih.gov/33625301/", "https://pubmed.ncbi.nlm.nih.gov/34332438/", "https://pubmed.ncbi.nlm.nih.gov/34342187/", "https://pubmed.ncbi.nlm.nih.gov/34601889/", "https://pubmed.ncbi.nlm.nih.gov/34081948/", "https://pubmed.ncbi.nlm.nih.gov/34507942/", "https://pubmed.ncbi.nlm.nih.gov/34362727/", "https://pubmed.ncbi.nlm.nih.gov/34325221/", "https://pubmed.ncbi.nlm.nih.gov/34825530/", "https://pubmed.ncbi.nlm.nih.gov/34000278/", "https://pubmed.ncbi.nlm.nih.gov/34655312/", "https://pubmed.ncbi.nlm.nih.gov/34187985/", "https://www.ncbi.nlm.nih.gov/pubmed/34416319", "https://www.ncbi.nlm.nih.gov/pubmed/34092429", "https://www.ncbi.nlm.nih.gov/pubmed/34025885", "https://www.ncbi.nlm.nih.gov/pubmed/34586408", "https://www.ncbi.nlm.nih.gov/pubmed/34756746", "https://www.ncbi.nlm.nih.gov/pubmed/34432976", "https://www.ncbi.nlm.nih.gov/pubmed/34754400", "https://www.ncbi.nlm.nih.gov/pubmed/34281357", "https://www.ncbi.nlm.nih.gov/pubmed/34835284", "https://www.ncbi.nlm.nih.gov/pubmed/34366403", "https://www.ncbi.nlm.nih.gov/pubmed/34564344", "https://www.ncbi.nlm.nih.gov/pubmed/34617315", "https://www.ncbi.nlm.nih.gov/pubmed/34333695", "https://www.ncbi.nlm.nih.gov/pubmed/34833382", "https://www.ncbi.nlm.nih.gov/pubmed/34704459", "https://www.ncbi.nlm.nih.gov/pubmed/34664804", "https://www.ncbi.nlm.nih.gov/pubmed/34860360", "https://www.ncbi.nlm.nih.gov/pubmed/34849657", "https://www.ncbi.nlm.nih.gov/pubmed/34933012", "https://www.ncbi.nlm.nih.gov/pubmed/34547487", "https://www.ncbi.nlm.nih.gov/pubmed/34339728", "https://www.ncbi.nlm.nih.gov/pubmed/34356586", "https://www.ncbi.nlm.nih.gov/pubmed/34219532", "https://www.ncbi.nlm.nih.gov/pubmed/34246585", "https://www.ncbi.nlm.nih.gov/pubmed/34492161", "https://www.ncbi.nlm.nih.gov/pubmed/34844930", "https://www.ncbi.nlm.nih.gov/pubmed/34487236", "https://www.ncbi.nlm.nih.gov/pubmed/34551225", "https://www.ncbi.nlm.nih.gov/pubmed/34709227", "https://www.ncbi.nlm.nih.gov/pubmed/34921468", "https://www.ncbi.nlm.nih.gov/pubmed/34824230", "https://www.ncbi.nlm.nih.gov/pubmed/34170372", "https://www.ncbi.nlm.nih.gov/pubmed/34849667", "https://www.ncbi.nlm.nih.gov/pubmed/34646267", "https://www.ncbi.nlm.nih.gov/pubmed/34127481", "https://www.ncbi.nlm.nih.gov/pubmed/34538306", "https://www.ncbi.nlm.nih.gov/pubmed/34237049", "https://www.ncbi.nlm.nih.gov/pubmed/33406694", "https://www.ncbi.nlm.nih.gov/pubmed/34660088", "https://www.ncbi.nlm.nih.gov/pubmed/34916217", "https://www.ncbi.nlm.nih.gov/pubmed/34153517", "https://www.ncbi.nlm.nih.gov/pubmed/34668687", "https://www.ncbi.nlm.nih.gov/pubmed/34348657", "https://www.ncbi.nlm.nih.gov/pubmed/34351881", "https://www.ncbi.nlm.nih.gov/pubmed/33854395", "https://www.ncbi.nlm.nih.gov/pubmed/34446426", "https://www.ncbi.nlm.nih.gov/pubmed/34808708", "https://www.ncbi.nlm.nih.gov/pubmed/34347278", "https://www.ncbi.nlm.nih.gov/pubmed/34544112https:/www.ncbi.nlm.nih.gov/pubmed/3454412", "https://www.ncbi.nlm.nih.gov/pubmed/34463755", "https://www.ncbi.nlm.nih.gov/pubmed/34931681", "https://www.ncbi.nlm.nih.gov/pubmed/34342500", "https://www.ncbi.nlm.nih.gov/pubmed/34805376", "https://www.ncbi.nlm.nih.gov/pubmed/34834983", "https://www.ncbi.nlm.nih.gov/pubmed/34389692", "https://www.ncbi.nlm.nih.gov/pubmed/34270752", "https://www.ncbi.nlm.nih.gov/pubmed/34744118", "https://www.ncbi.nlm.nih.gov/pubmed/34568540", "https://www.ncbi.nlm.nih.gov/pubmed/34447639", "https://www.ncbi.nlm.nih.gov/pubmed/34185046", "https://www.ncbi.nlm.nih.gov/pubmed/34402228", "https://www.ncbi.nlm.nih.gov/pubmed/34396358", "https://www.ncbi.nlm.nih.gov/pubmed/34477808", "https://www.ncbi.nlm.nih.gov/pubmed/33898162", "https://www.ncbi.nlm.nih.gov/pubmed/33643776", "https://www.ncbi.nlm.nih.gov/pubmed/34952008", "https://www.ncbi.nlm.nih.gov/pubmed/34642628", "https://www.ncbi.nlm.nih.gov/pubmed/34540594", "https://www.ncbi.nlm.nih.gov/pubmed/34378087", "https://www.ncbi.nlm.nih.gov/pubmed/34127854", "https://www.ncbi.nlm.nih.gov/pubmed/34393110", "https://www.ncbi.nlm.nih.gov/pubmed/34463770", "https://www.ncbi.nlm.nih.gov/pubmed/33606296", "https://www.ncbi.nlm.nih.gov/pubmed/34535317", "https://www.ncbi.nlm.nih.gov/pubmed/33888900", "https://www.ncbi.nlm.nih.gov/pubmed/34834458", "https://www.ncbi.nlm.nih.gov/pubmed/34778411", "https://www.ncbi.nlm.nih.gov/pubmed/34332972", "https://www.ncbi.nlm.nih.gov/pubmed/34375696", "https://www.ncbi.nlm.nih.gov/pubmed/34791081", "https://www.ncbi.nlm.nih.gov/pubmed/34676123", "https://www.ncbi.nlm.nih.gov/pubmed/34398511", "https://www.ncbi.nlm.nih.gov/pubmed/33316478", "https://www.ncbi.nlm.nih.gov/pubmed/34133825", "https://www.ncbi.nlm.nih.gov/pubmed/34614328", "https://www.ncbi.nlm.nih.gov/pubmed/34166671", "https://www.ncbi.nlm.nih.gov/pubmed/34737312", "https://www.ncbi.nlm.nih.gov/pubmed/33526560", "https://www.ncbi.nlm.nih.gov/pubmed/34930152", "https://www.ncbi.nlm.nih.gov/pubmed/34185045", "https://www.ncbi.nlm.nih.gov/pubmed/34840235", "https://www.ncbi.nlm.nih.gov/pubmed/34876937", "https://www.ncbi.nlm.nih.gov/pubmed/34089859", "https://www.ncbi.nlm.nih.gov/pubmed/34889875", "https://www.ncbi.nlm.nih.gov/pubmed/34320609", "https://www.ncbi.nlm.nih.gov/pubmed/34402230", "https://www.ncbi.nlm.nih.gov/pubmed/34180390", "https://www.ncbi.nlm.nih.gov/pubmed/34496880", "https://www.ncbi.nlm.nih.gov/pubmed/34907393", "https://www.ncbi.nlm.nih.gov/pubmed/34367386", "https://www.ncbi.nlm.nih.gov/pubmed/34734240", "https://www.ncbi.nlm.nih.gov/pubmed/34738774", "https://www.ncbi.nlm.nih.gov/pubmed/34695229", "https://www.ncbi.nlm.nih.gov/pubmed/34233234", "https://www.ncbi.nlm.nih.gov/pubmed/34934954", "https://www.ncbi.nlm.nih.gov/pubmed/34228985", "https://www.ncbi.nlm.nih.gov/pubmed/34591186", "https://www.ncbi.nlm.nih.gov/pubmed/34241676", "https://www.ncbi.nlm.nih.gov/pubmed/34945172", "https://www.ncbi.nlm.nih.gov/pubmed/34707602", "https://www.ncbi.nlm.nih.gov/pubmed/33956784", "https://www.ncbi.nlm.nih.gov/pubmed/34408937", "https://www.ncbi.nlm.nih.gov/pubmed/34739045", "https://www.ncbi.nlm.nih.gov/pubmed/34605853", "https://www.ncbi.nlm.nih.gov/pubmed/34341797", "https://www.ncbi.nlm.nih.gov/pubmed/34764489", "https://www.ncbi.nlm.nih.gov/pubmed/34077949", "https://www.ncbi.nlm.nih.gov/pubmed/34911654", "https://www.ncbi.nlm.nih.gov/pubmed/34282971", "https://www.ncbi.nlm.nih.gov/pubmed/34420869", "https://www.ncbi.nlm.nih.gov/pubmed/34514306", "https://www.ncbi.nlm.nih.gov/pubmed/34955479", "https://www.ncbi.nlm.nih.gov/pubmed/33444297", "https://www.ncbi.nlm.nih.gov/pubmed/34192428", "https://www.ncbi.nlm.nih.gov/pubmed/34866957", "https://www.ncbi.nlm.nih.gov/pubmed/34865500", "https://www.ncbi.nlm.nih.gov/pubmed/34311983", "https://www.ncbi.nlm.nih.gov/pubmed/34904134", "https://www.ncbi.nlm.nih.gov/pubmed/34277198", "https://www.ncbi.nlm.nih.gov/pubmed/34731877", "https://www.ncbi.nlm.nih.gov/pubmed/34533570", "https://www.ncbi.nlm.nih.gov/pubmed/34229940", "https://www.ncbi.nlm.nih.gov/pubmed/34336774", "https://www.ncbi.nlm.nih.gov/pubmed/34006408", "https://www.ncbi.nlm.nih.gov/pubmed/34614329", "https://www.ncbi.nlm.nih.gov/pubmed/33262177", "https://www.saveusnow.org.uk/covid-vaccine-scientific-proof-lethal/", "https://www.globalresearch.ca/author/sun", "https://www.saveusnow.org.uk/covid-vaccine-scientific-proof-lethal/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-15T15:02:30+00:00"}