{"result_id": "134034", "URL": "https://www.globalresearch.ca/seeing-believing-what-data-reveal-about-deaths-following-covid-vaccine-rollouts-around-world/5804242", "timestamp": "2023-04-25 15:17:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/seeing-believing-what-data-reveal-about-deaths-following-covid-vaccine-rollouts-around-world/5804242", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Seeing Is Believing: What the Data Reveal About Deaths Following COVID Vaccine Rollouts Around the World", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nI asked Ed Dowd if I could have space in his book, “‘Cause Unknown’: The Epidemic of Sudden Deaths in 2021 and 2022,” for an article about what we saw around the world as mass vaccination commenced.\n\nIn light of Dowd’s stunning analysis, it is particularly instructive to look at data for those countries that did not have high numbers of COVID-19 deaths prior to mass vaccination, because they afford the simplest comparison:\n• They had very low rates of death attributed to COVID-19.\n• Then they experienced huge increases in deaths attributed to COVID-19.\n\nSouth Korea gives us a fast example among many: Prior to the country’s wide rollout of mRNA vaccines, Korea had almost no COVID-19 deaths. You see that nearly all their COVID-19 deaths occurred after mass vaccination.\n\nDue to frequent supply problems, South Korea’s mass vaccination program really took off after the third quarter of 2021 when they borrowed hundreds of thousands of Pfizer doses from Israel. Their COVID-19 deaths soon followed. That wasn’t supposed to happen.\n\nIn November 2021, President Moon began a massive campaign to push boosters: “The vaccination can be completed only after receiving the third jab.” His citizens complied, reaching more than 90% of adults fully vaccinated — the chart shows the COVID-19 deaths that followed.\n\nThe same pattern repeats all over the world, and since seeing is believing, I’ll pause here and resume in more detail after some quick sample charts …\n\nIsrael was the world’s poster child for Pfizer’s vaccine product: Like all these countries, Israel had the majority of its COVID-19 deaths after mass vaccination.\n\nAnd finally, Vietnam: They began mass vaccination in March 2021, purchasing five different vaccine products from around the world — and they saw no jump in COVID-19 deaths.\n\nHowever, in early July 2021, the U.S. government began donating millions of Pfizer and Moderna mRNA vaccines — and that’s exactly when Vietnam experienced the massive spike in COVID-19 deaths you see in the chart.\n\nAny way you think about it, those charts should not look like that if vaccination was effective.\n\nWhy would so many countries big and small, rich and poor, in different parts of the world, some with congested cities, some sparsely populated, cold weather or hot weather, tropical or desert, high altitude or low altitude, small islands or landlocked — why would they all see increases in COVID-19 deaths after mass vaccination?\n\nThat’s a question one imagines public health officials and media would be motivated to carefully analyze and answer. Instead, they’ve been united in keeping such facts out of public discourse.\n\nThe reality displayed on the graphs you’ve seen is undeniable, cannot be unseen and is available to anyone more interested and more industrious than media and government have been.\n\nFor curious minds, one explanation to consider is revealed through extensive pre-COVID-19 research establishing that people’s immune systems are weakened by some vaccines. Just a few examples among many:\n• 2011 study: Annual vaccination for influenza “may render young children who have not previously been infected with influenza more susceptible to infection with a pandemic influenza virus of a novel subtype.”\n• 2013 study: Vaccination may make flu worse if exposed to a second strain [as has been the case with COVID-19 for billions of people].\n• 2018 study: Acute respiratory infections increase following vaccination. This study compared vaccinated people to unvaccinated people.\n\nMore recently, a Danish study of healthcare workers showed a massive increase in COVID-19 infection in the two weeks after the first shot.\n\nAware of this Danish study, The BMJ published a letter calling for an urgent investigation:\n\n“Given the evidence of white cell depletion after COVID vaccination and the evidence of increased COVID infection rates shortly after vaccination, the possibility that the two are causally related needs urgent investigation.”\n\nThe Danish study showed “a 40% increase in infections in the first two weeks after Pfizer-BioNTech vaccination, despite not vaccinating in homes with recent outbreaks,” meaning they knew it wasn’t because people happened to already be infected at the time they were vaccinated.\n\nThe 40% number comes up again, in The BMJ letter:\n\nLooking for a more comfortable answer to the sad riddle, some people might speculate that the deaths you’ve seen on all those graphs occurred because people became less cautious after vaccination.\n\nThe BMJ considered and discounted that theory, citing several studies that show increased infections in the weeks after vaccination, and pointing out the example of care home residents, who actually shielded more after vaccination:\n\n“No one is suggesting there was a change of behaviour within care homes. However, care homes in every corner of the country saw outbreaks from December. What changed?”\n\nIf these new Pharma products had been bound by the same laws as all other Pharma products, their TV commercials would have to end with the familiar announcer hurriedly rushing through side effects:\n\nCOVID-19 vaccines will leave some people more vulnerable to infection and sickness. Some people will experience side effects including cardiac arrest, blood clots, stroke and sudden death.\n\nIt wouldn’t make for a very good sales pitch.\n\nOf course, Pfizer and Moderna didn’t need any sales pitch for these vaccines — since the products were developed, ordered, purchased, promoted, defended, indemnified and even mandated by our own government.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Seeing Is Believing: What the Data Reveal About Deaths Following COVID Vaccine Rollouts Around the World - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** First published on January 11, 2023 I asked Ed …", "url": "https://www.globalresearch.ca/seeing-believing-what-data-reveal-about-deaths-following-covid-vaccine-rollouts-around-world/5804242", "site_name": "Global Research", "article:tag": "vaccine deaths", "article:section": "English", "article:published_time": "2023-03-14T02:29:49+00:00", "article:modified_time": "2023-03-14T03:15:50+00:00", "updated_time": "2023-03-14T03:15:50+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine-seeing-believing-cause-unknown-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine-seeing-believing-cause-unknown-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Science and Medicine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">In this unusual book, “‘Cause Unknown’: The Epidemic of Sudden Deaths in 2021 and 2022,” Edward Dowd proves an undeniable and urgent reality, laid out with facts that can be confirmed by any reader, point by point, page by page.<a href=\"https://t.co/QKKGbktQF0\">https://t.co/QKKGbktQF0</a></p>\n<p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1605007827025596416?ref_src=twsrc%5Etfw\">December 20, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.amazon.com/Cause-Epidemic-Sudden-Childrens-Defense/dp/1510776397", "https://childrenshealthdefense.org/defender_category/covid/", "https://en.wikipedia.org/wiki/COVID-19_vaccination_in_South_Korea#cite_note-6", "http://www.news.cn/english/2021-11/29/c_1310340621.htm", "https://childrenshealthdefense.org/defender/israeli-health-officials-safety-problems-pfizer-covid-vaccine/", "https://childrenshealthdefense.org/defender/teens-hospitalized-dead-pfizer-vaccine-vietnam/", "https://coronavirus.jhu.edu/region", "https://t.co/QKKGbktQF0", "https://twitter.com/RobertKennedyJr/status/1605007827025596416?ref_src=twsrc%5Etfw", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3209321/", "https://www.science.org/doi/10.1126/scitranslmed.3006366", "https://www.sciencedirect.com/science/article/pii/S0264410X18303153", "https://www.medrxiv.org/content/10.1101/2021.03.08.21252200v1.full.pdf", "https://www.bmj.com/content/372/bmj.n783/rr", "https://childrenshealthdefense.org/defender/cdc-safety-signals-pfizer-moderna-covid-vaccines-et/", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://childrenshealthdefense.org/defender/covid-vaccine-deaths-cause-unknown/", "https://www.globalresearch.ca/author/gavin-de-becker", "https://childrenshealthdefense.org/defender/covid-vaccine-deaths-cause-unknown/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-03-14T02:29:49+00:00"}