{"result_id": "134029", "URL": "https://www.globalresearch.ca/andrew-bridgen-suspended-conservative-mp-criticising-covid-vaccines/5804436", "timestamp": "2023-04-25 15:17:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/andrew-bridgen-suspended-conservative-mp-criticising-covid-vaccines/5804436", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Covid Vaccine: “This is the Biggest Crime against Humanity since the Holocaust.” Andrew Bridgen Suspended as U.K. Conservative MP", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nMP Andrew Bridgen has had the Conservative whip remove him, – meaning he is suspended from sitting as a Conservative MP and must sit without party affiliation – pending a “formal investigation” after causing “great offence” with remarks saying the Covid vaccines are “causing serious harms” and the vaccination campaign was “the biggest crime against humanity since the holocaust”.\n\nAccording to Sky News, Tory Chief Whip Simon Hart said:\n\nAndrew Bridgen has crossed a line, causing great offence in the process. As a nation we should be very proud of what has been achieved through the vaccine programme. The vaccine is the best defence against Covid that we have. Misinformation about the vaccine causes harm and costs lives. I am therefore removing the whip from Andrew Bridgen with immediate effect, pending a formal investigation.\n\nHis ‘offensive’ comment came in a tweet (now deleted) on Wednesday morning linking to a write-up by Israeli academic Dr. Josh Guetzkow of the recently released CDC adverse event analysis, where Bridgen approvingly quotes an unnamed “consultant cardiologist” who he said had told him: “This is the biggest crime against humanity since the holocaust.”\n\nMr. Bridgen, who has a science background, has become Parliament’s most vocal critic of the Covid vaccines. He thus made himself a big target for the pro-vaccine zealots who will have been looking for an excuse to punish and cancel him, and who have predictably leapt on the first ‘offensive’ thing they could find.\n\nDr. Guetzkow, the academic whose article Mr. Bridgen linked to in the tweet and who is Jewish and lives in Israel, defended him from allegations of anti-Semitism. He told the Daily Sceptic that “there is nothing at all anti-Semitic about his statement” and that “the hollow accusations against him only distract from genuine examples of anti-Semitism”. He said:\n\nAs a Jew living in Israel, I’m surprised by the accusations against Bridgen, because there is nothing at all anti-Semitic about his statement. This is a tempest in a teapot. The hollow accusations against him only distract from genuine examples of anti-Semitism and ultimately hinder attempts to draw attention to them, much like the boy who cried wolf.\n\nJohn Mann, the Government’s independent anti-Semitism adviser, went straight to full-on cancel mode, saying:\n\n“There is no possibility that Bridgen can be allowed to stand at the next election. He cannot claim that he didn’t realise the level of offence that his remarks cause.”\n\nKaren Pollock, Chief Executive of the Holocaust Educational Trust, said:\n\n“This comment is highly irresponsible, wholly inappropriate and an elected politician should know better.”\n\nMatt Hancock, the disgraced lockdown Health Secretary, hit out at Mr. Bridgen’s “disgusting, antisemitic, anti-vax conspiracy theories” at Prime Minister’s Questions on Wednesday. He said the comments were “deeply offensive” and “have no place in this House or in our wider society”.\n\nPrime Minister Rishi Sunak replied that he joined Mr Hancock in “completely condemning those types of comments in the strongest possible terms”.\n\n“Obviously it is utterly unacceptable to make linkages and use language like that and I’m determined that the scourge of antisemitism is eradicated,” he told the Commons.\n\n“It has absolutely no place in our society. I know the previous few years have been challenging for the Jewish community and I never want them to experience anything like that ever again.”\n\nThe Board of Deputies of British Jews tweeted:\n\n“For an MP to suggest that Covid vaccines are the biggest crime against humanity since the Holocaust is unconscionable. We will be writing to the Chair of the Conservative Party Nadhim Zahawi to express our deep concern and to ask for clarification as to what action will be taken.”\n\nReproduced below is Mr. Bridgen’s recent speech in the Commons where he raised many issues that other MPs shy away from or don’t want to know about.\n\nThree months ago, one of the most eminent and trusted cardiologists, a man with an international reputation, Dr. Aseem Malhotra, published peer-reviewed research that concluded that there should be a complete cessation of the administration of the Covid mRNA vaccines for everyone because of clear and robust data of significant harms and little ongoing benefit. He described the roll-out of the BioNTech-Pfizer vaccine as “perhaps the greatest miscarriage of medical science, attack on democracy, damage to population health, and erosion of trust in medicine that we will witness in our lifetime”.\n\nInterestingly, there has so far not been a single rebuttal of Dr. Malhotra’s findings in the scientific literature, despite their widespread circulation and the fact that they made international news.\n\nBefore I state the key evidence-based facts that make a clear case for complete suspension of these emergency use authorisation vaccines, it is important to appreciate the key psychological barrier that has prevented these facts from being acknowledged by policymakers and taken up by the U.K. mainstream media. That psychological phenomenon is wilful blindness. It is when human beings – including, in this case, institutions – turn a blind eye to the truth in order to feel safe, reduce anxiety, avoid conflict and protect their prestige and reputations. There are numerous examples of that in recent history, such as the BBC and Jimmy Savile, the Department of Health and Mid Staffs, Hollywood and Harvey Weinstein, and the medical establishment and the OxyContin scandal, which was portrayed in the mini-series “Dopesick”. It is crucial to understand that the longer wilful blindless to the truth continues, the more unnecessary harm it creates.\n\nHere are the cold, hard facts about the mRNA vaccines and an explanation of the structural drivers that continue to be barriers to doctors and the public receiving independent information to make informed decisions about them. Since the rollout in the U.K. of the BioNTech-Pfizer mRNA vaccine, we have had almost half a million Yellow Card reports of adverse effects from the public. That is unprecedented. It is more than all the yellow card reports of the past 40 years combined. An extraordinary rate of side effects that are beyond mild have been reported in many countries across the world that have used the Pfizer vaccine, including, of course, the United States.\n\nThose who feel that they have been damaged by the vaccine should of course have the full support of their elected Members of Parliament and the NHS. Only a couple of weeks ago, I was interviewed by a journalist from a major news outlet who said that he was being bombarded by calls from people who said that they were vaccine-harmed but unable to get the support they wanted from the NHS. He also said that he thought this would be the biggest scandal in medical history in this country. Disturbingly, he also said that he feared that if he were to mention that in the newsroom in which he worked, he would lose his job. We need to break this conspiracy of silence.\n\nIt is instructive to note that, according to pharmaco-vigilance analysis, the serious adverse effects reported by the public are thought to represent only 10% of the true rate of serious adverse events occurring within the population. The gold standard of understanding the benefit and harm of any drug is the randomised controlled trial. It was the randomised controlled trial conducted by Pfizer that led to U.K. and international regulators approving the BioNTech-Pfizer mRNA vaccine for administration in the first place.\n\nContrary to popular belief, that original trial of approximately 40,000 participants did not show any statistically significant reduction in death as a result of vaccination, but it did show a 95% relative risk reduction in the development of infection against the ancestral, more lethal strain of the virus. However, the absolute risk reduction for an individual was only 0.84%. In other words, from its own data, Pfizer revealed that we needed to vaccinate 119 people to prevent one infection. The World Health Organisation and the Academy of Medical Royal Colleges have previously stated and made it clear that it is an ethical responsibility that medical information is communicated to patients in absolute benefit and absolute risk terms, which is to protect the public from unnecessary anxiety and manipulation.\n\nVery quickly, through mutations of the original strain – indeed, within a few months – Covid fortunately became far less lethal. It quickly became apparent that there was no protection against infection at all from the vaccine, and we were left with the hope that perhaps these vaccines would protect us from serious illness and death. So what does the most reliable data tell us about the best-case scenario of individual benefit from the vaccine against dying from COVID-19? Real-world data from the U.K. during the three-month wave of Omicron at the beginning of this year reveals that we would need to vaccinate 7,300 people over the age of 80 to prevent one death. The number needed to be vaccinated to prevent a death in any younger age group was absolutely enormous.\n\nOf course, it is important that the Government justify why they are rolling out a vaccine to any cohort of people, particularly our children. He will recall that, in the Westminster Hall debate, we questioned the validity of vaccinating children who have minimal risk, if a risk at all, from the virus when there is a clear risk from the vaccine. I will again report on evidence from America later in my speech about those risks, particularly to young children.\n\nIn other words, the benefits of the vaccine are close to non-existent. Beyond the alarming Yellow Card reports, the strongest evidence of harm comes from the gold standard, highest possible quality level of data. A re-analysis of Pfizer and Moderna’s own randomised controlled trials using the mRNA technology, published in the peer-reviewed journal Vaccine, revealed a rate of serious adverse events of one in 800 individuals vaccinated. These are events that result in hospitalisation or disability, or that are life changing. Most disturbing of all, however, is that those original trials suggested someone was far more likely to suffer a serious side effect from the vaccine than to be hospitalised with the ancestral, more lethal strain of the virus. These findings are a smoking gun suggesting the vaccine should likely never have been approved in the first place.\n\nIn the past, vaccines have been completely withdrawn from use for a much lower incidence of serious harm. For example, the swine flu vaccine was withdrawn in 1976 for causing Guillain-Barré syndrome in only one in 100,000 adults, and in 1999 the rotavirus vaccine was withdrawn for causing a form of bowel obstruction in children affecting one in 10,000. With the covid mRNA vaccine, we are talking of a serious adverse event rate of at least one in 800, because that was the rate determined in the two months when Pfizer actually followed the patients following their vaccination. Unfortunately, some of those serious events, such as heart attack, stroke and pulmonary embolism will result in death, which is devastating for individuals and the families they leave behind. Many of these events may take longer than eight weeks post vaccination to show themselves.\n\nAn Israeli paper published in Nature’s scientific reports showed a 25% increase in heart attack and cardiac arrest in 16 to 39-year-olds in Israel. Another report from Israel looked at levels of myocarditis and pericarditis in people who had had covid and those who had not. It was a study of, I think, 1.2 million who had not had Covid and 740,000 who had had it. The incidence of myocarditis and pericarditis was identical in both groups. This would tell the House that whatever is causing the increase in heart problems now, it is not due to having been infected with COVID-19.\n\nIt was accepted by a peer-reviewed medical journal that one of the country’s most respected and decorated general practitioners, the honorary vice-president of the British Medical Association and the Labour party’s doctor of the year, Dr. Kailash Chand, likely suffered a cardiac arrest and was tragically killed by the Pfizer vaccine six months after his second dose, through a mechanism that rapidly accelerates heart disease. In fact, in the U.K. we have had an extra 14,000 out-of-hospital cardiac arrests in 2021, compared with 2020, following the vaccine rollout. Many of these will undoubtedly be because of the vaccine, and the consequences of this mRNA jab are clearly serious and common.\n\nMinisters may understandably wish to defer the responsibility for a decision such as withdrawing vaccines from the population to regulators such as the Medicines and Healthcare products Regulatory Agency, or in America the Food and Drug Administration. Historically, when undertaking the approval of any drug, the regulators ultimately end up relying on the summary results from the drug companies in their sponsored trials, where the raw data is kept commercially confidential. Furthermore, the MHRA has a huge financial conflict of interest, receiving 86% of its funding from the pharmaceutical industry it is supposed to regulate. In effect, we have the poacher paying the gamekeeper.\n\nIn a recent investigation by the BMJ into the financial conflicts of interest of the drug regulators, the sociologist Donald Light said: “It’s the opposite of having a trustworthy organisation independently and rigorously assessing medicines. They’re not rigorous, they’re not independent, they are selective, and they withhold data.”\n\nHe went on to say that doctors and patients “must appreciate how deeply and extensively drug regulators can’t be trusted so long as they are captured by industry funding”.\n\nSimilarly, another investigation revealed that members of the Joint Committee on Vaccination and Immunisation had huge financial links to the Bill and Melinda Gates Foundation running into billions of pounds. Ministers, the media and the public know that the foundation is heavily invested in pharmaceutical industry stocks.\n\nUnfortunately, the catastrophic mistake over the approval, and the coercion associated with this emergency-use authorisation medical intervention, are not an anomaly, and in many ways this could have been predicted by the structural failures that allowed it to occur in the first place. Those shortcomings are rooted in the increasingly unchecked visible and invisible power of multinational corporations – in this case, Big Pharma. We can start by acknowledging that the drug industry has a fiduciary obligation to produce profit for its shareholders, but it has no fiduciary obligation to provide the right medicines for patients.\n\nThe real scandal is that those with a responsibility to patients and with scientific integrity – namely, doctors, academic institutions and medical journals – collude with the industry for financial gain. Big Pharma exerts its power by capturing the political environment through lobbying and the knowledge environment through funding university research and influencing medical education, preference shaping through capture of the media, financing think-tanks and so on. In other words, the public relations machinery of Big Pharma excels in subterfuge and engages in smearing and de-platforming those who call out its manipulations. No doubt it will be very busy this evening.\n\nIt is no surprise, when there is so much control by an entity that has been described as ‘psychopathic’ for its profit-making conduct, that one analysis suggests that third most common cause of death globally after heart disease and cancer is the side-effects of prescribed medications, which were mostly avoidable. Because of those systemic failures, doctors often receive biased information, deliberately manipulated by the pharmaceutical industry, which exaggerates the benefits and the safety of their drugs. Furthermore, the former editor of the BMJ, Richard Smith, claims that research misconduct is rife and is not effectively being tackled in the U.K. institutions, stating: “Something is rotten in… British medicine and has been for a long time.”\n\nIt has also been brought to my attention by a whistleblower from a very reliable source that one of these institutions is covering up clear data that reveals that the mRNA vaccine increases inflammation of the heart arteries. It is covering this up for fear that it may lose funding from the pharmaceutical industry. The lead of that cardiology research department has a prominent leadership role with the British Heart Foundation, and I am disappointed to say that he has sent out non-disclosure agreements to his research team to ensure that this important data never sees the light of day. That is an absolute disgrace. Systemic failure in an over-medicated population also contributes to huge waste of British taxpayers’ money and increasing strain on the NHS.\n\nWe need an inquiry into the influence of Big Pharma on medications and our NHS. That is been called for many occasions and by some very influential people, including prominent physicians such as the former president of the Royal College of Physicians and personal doctor to our late Queen, Sir Richard Thompson. On separate occasions in the last few years those calls have been supported and covered in the Daily Mail, the Guardian and, most recently, the i newspaper.\n\nWe are fighting not just for principles of ethical, evidence-based medical practices, but for our democracy. The future health of the British public depends on us tackling head-on the cause of this problem and finding meaningful solutions. In 2015 a commentary by Richard Houghton, Editor-in-Chief of the Lancet, suggested that possibly half of the published medical literature “may simply be untrue”. He wrote that “science has taken a turn toward darkness”, and asked who is going to take the first step to clean up the system.\n\nThat first step could start this evening with this debate. It starts here, with the Vaccine Minister and the Government ensuring in the first instance an immediate and complete suspension of any more Covid vaccines with their use of mRNA technology. Silence on this issue is more contagious than the virus itself, and now so should courage be. I would implore all the scientists, medics, nurses and those in the media who know the truth about the harm these vaccines are causing to our people to speak out.\n\nWe have already sacrificed far too many of our citizens on the altar of ignorance and unfettered corporate greed. Last week the MHRA authorised those experimental vaccines for use in children as young as six months. In a Westminster Hall debate some weeks ago, I quoted a report by the Journal of the American Medical Association studying the effect of the COVID-19 mRNA vaccination on children under five years of age. It showed that one in [500] had an adverse event that resulted in hospitalisation, and symptoms that lasted longer than 90 days.\n\nAs the data clearly shows to anyone who wants to look at it, the mRNA vaccines are not safe, not effective and not necessary. I implore the Government to halt their use immediately. As I have demonstrated and as the data clearly shows, the Government’s current policy on the mRNA vaccines is on the wrong side of medical ethics, it is on the wrong side of scientific data, and ultimately it will be on the wrong side of history.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccine: “This is the Biggest Crime against Humanity since the Holocaust.” Andrew Bridgen Suspended as U.K. Conservative MP - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** MP Andrew Bridgen has had the Conservative whip remove …", "url": "https://www.globalresearch.ca/andrew-bridgen-suspended-conservative-mp-criticising-covid-vaccines/5804436", "site_name": "Global Research", "article:tag": "MP Andrew Bridgen", "article:section": "English", "article:published_time": "2023-01-12T15:33:58+00:00", "article:modified_time": "2023-01-12T20:49:38+00:00", "updated_time": "2023-01-12T20:49:38+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/01/xbridgen-750x375.png.pagespeed.ic_.SDueGsca8g.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/01/xbridgen-750x375.png.pagespeed.ic_.SDueGsca8g.jpg", "image:width": "750", "image:height": "375"}, "tags": ["Law and Justice", "Canada", "Science and Medicine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe title=\"Vaccine dangers, UK Parliament debate\" src=\"https://www.youtube.com/embed/-MSKzoI72eU\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/-MSKzoI72eU"}], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://news.sky.com/story/mp-andrew-bridgen-has-tory-whip-removed-after-remarks-on-covid-vaccines-and-holocaust-12784275", "https://web.archive.org/web/20230111094245/https://twitter.com/ABridgen/status/1613094003611688961", "https://www.zerohedge.com/markets/cdc-finally-releases-vaers-safety-monitoring-analyses-covid-vaccines", "https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html", "https://www.telegraph.co.uk/politics/2023/01/11/andrew-bridgen-loses-tory-whip-covid-vaccine-holocaust/", "https://hansard.parliament.uk/Commons/2022-12-13/debates/EAB2E8A2-A721-47DD-A79C-4EFD10F10C2D/VaccinesPotentialHarms", "https://www.youtube.com/watch?v=-MSKzoI72eU", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://dailysceptic.org/2023/01/11/andrew-bridgen-suspended-as-conservative-mp-for-criticising-covid-vaccines/", "https://www.globalresearch.ca/author/will-jones", "https://dailysceptic.org/2023/01/11/andrew-bridgen-suspended-as-conservative-mp-for-criticising-covid-vaccines/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-01-12T15:33:58+00:00"}