{"result_id": "134049", "URL": "https://www.globalresearch.ca/mandatory-vaccination-eu-just-went-through-under-radar/5776115", "timestamp": "2023-04-25 15:17:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/mandatory-vaccination-eu-just-went-through-under-radar/5776115", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Digital Tyranny: The EU Digital Covid Vaccine Certificate Framework", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nAn earlier version of this posting mistakenly referred to a European Council Amendment of Resolution 2361 which “no longer objects to compulsory vaccination”. That information is incorrect. See: Resolution 2361 (2021) entitled “Covid-19 vaccines: ethical, legal and practical considerations”\n\nThe EU Vaccine Passport Restrictions are Dramatic. Fundamental Rights are being violated.\n\nThe substance of the EU procedures concerning the vaccine passport are contained in the EU EXPLANATORY MEMORANDUM. (summary below, scroll down for Selected Excerpts and Complete Text).\n\nThe MEMORANDUM outlined by the EU points to the derogation of fundamental human rights entrenched in the adoption of the EU Digital COVID Certificate Framework.\n\nAs noted in the above Summary, the intent is to extend the Regulation which expires on June 30 2022 for another twelve months until June 30th, 2023.\n\nThe EU Digital COVID Certificate Framework is slated to be tied into negotiations pertaining to a worldwide “Pandemic Treaty” which were initiated in early March 2022.\n\n“a green light to start negotiations on an international pandemic treaty… The Council adopted a decision to authorise the opening of negotiations for an international agreement on pandemic prevention, preparedness and response.”\n\nWhat is the timeline\n\nThe procedure is slated to be presented to the 76th World Health Assembly in 2023, “with the aim to adopt the instrument [namely the pandemic treaty] by 2024.”\n\nThe object of the Pandemic Treaty consists in creating by 2024 a global health governance entity under WHO auspices.\n\nIn turn the Pandemic Treaty would be tied into the WHO’s QR Verification Code project, which is intent upon creating a global digital data bank of 8 billion people. Both initiatives are to be carried out concurrently by the WHO in liaison with ID2020 and the Gavi Alliance, both of which are funded by the Gates Foundation.\n\n“an all-electronic ID – linking everything to everything of each individual (records of health, banking, personal and private, etc.).”\n\n“A worldwide digital ID system is in the making. [The aim] of the WEF—and of all the central banks [is] to implement a global system in which everyone’s personal data will be incorporated into the Central Bank Digital Currency (CBDC) network.”\n\nA Worldwide QR Verification Code lays the groundwork for the instatement of “a Global Police State” controlled by the financial establishment. It’s part of what the late David Rockefeller entitled “The March towards World Government” based on an alliance of bankers and intellectuals.\n\nWhat is the legitimacy as well as the science behind this diabolical project?\n\nAmply confirmed: THERE IS NO PANDEMIC. The alleged Covid-19 Pandemic is based on “Fake Science”. Both the EU Digital COVID Certificate Framework as well as the WHO QR Verification Code are based on outright lies and fabrications. It is now well established that the PCR test which has been used to “detect SARS-CoV-2” is totally invalid.\n\n“Both the WHO and the CDC (with the usual innuendos) have confirmed what was known from the very outset in January 2020, namely that the RT-PCR test used to justify every single policy mandate including lockdowns, social distancing, the mask, confinement of the labor force, closure of economic activity, etc. was flawed and invalid”\n\nThe EU Memorandum (below) confirms two types of tests for the detection of SARS-CoV-2 both of which have been declared invalid:\n\n“According to Regulation (EU) 2021/953, test certificates are to be issued based on two types of tests for SARS-CoV-2 infection, namely\n\n[1] molecular nucleic acid amplification tests (‘NAAT’), including those using reverse transcription polymerase chain reaction (‘RT-PCR’), and\n\n[2] rapid antigen tests, which rely on detection of viral proteins (antigens) using a lateral flow immunoassay that gives results in less than 30 minutes, provided they are carried out by health professionals or by skilled testing personnel. (emphasis added)”\n\nThe legitimacy of the EU Digital Covid Certification Framework, the Pandemic Treaty and the QR Verification Code rests on the presumption that the alleged “Covid-19 Pandemic is Real” and that the “mRNA Covid-19 vaccine constitutes a SOLUTION to the alleged Covid-19 pandemic.”\n\nThe CDC confirms that the PCR test does not effectively differentiate between “SARS-CoV-2 and influenza viruses”. As of 31 December 2021, the CDC has declared the PCR test as invalid.\n\nFor further details and analysis click here\n\nSustained by media disinformation and government propaganda, the mRNA vaccine was put forth as a solution to curbing the pandemic and saving lives.\n\nThe Vaccine does not Save Lives\n\nAmply documented, the Vaccine has triggered from the outset in December 2020 an upward trend in mortality and morbidity.\n\nExtending the Vaccine in the EU as outlined in the “Memorandum” is a crime against humanity. The EU Memorandum must be immediately suspended.\n\nVideo: In many countries, there was a significant shift in mortality following the introduction of the mRNA vaccine\n\nThe evidence is overwhelming. The official figures (April 2022) point to approximately:\n\nBut only a small fraction of the victims or families of the deceased will go through the tedious process of reporting vaccine-related deaths and adverse events to the national health authorities.\n\nThe following statement contained in the EU Memorandum is nonsensical:\n\n“Increasing vaccine uptake remains a crucial objective in the fight against the pandemic, given the protection against hospitalisation and severe disease afforded by vaccination\n\nAmply documented, it’s the Covid-19 mRNA “Vaccine” rather than the SARS-CoV-2 virus which is “the killer”.\n\nIn the words of Doctors for Covid Ethics:\n\n“The signal of harm is now indisputably overwhelming, and, in line with universally accepted ethical standards for clinical trials, Doctors for Covid Ethics demands that the COVID-19 “vaccination” programme be halted immediately worldwide. Continuation of the programme, in the full knowledge of ongoing serious harm and death to both adults and children, constitutes Crimes Against Humanity/Genocide, for which those found to be responsible or complicit will ultimately be held personally liable.” The Procedures described in the EU Memorandum should be immediately suspended. The Justification for a “Pandemic Treaty” is Based on Lies and “Fake Science”. The Worldwide Corona Crisis: Destroying Civil Society, Engineered Economic Depression, Global Coup d’État and the “Great Reset” As a means to reaching out to millions of people worldwide whose lives have been affected by the corona crisis, we have decided in the course of the next few weeks to distribute the eBook for FREE. Excerpts of the EU MEMORANDUM, with links to the complete text below.\n\nThe document in pdf can be accessed HERE.\n\nTo make best use of the EU Digital COVID Certificate framework, the Council has adopted several recommendations on a coordinated approach to facilitate safe free movement during the COVID-19 pandemic. According to the most recent update, Council Recommendation (EU) 2022/107 adopted on 25 January 202212, holders of EU Digital COVID Certificates meeting certain requirements should, in almost all circumstances, not be subject to any additional requirements when exercising their free movement rights. This ‘person-based approach’ thus necessitates the continuous availability of EU Digital COVID Certificates. Since the adoption of Regulation (EU) 2021/953, the epidemiological situation with regard to the COVID-19 pandemic has evolved considerably. On the one hand, by 31 January 2022, more than 80% of the adult population in the Union have completed their primary vaccination cycle, and more than 50% have received a booster dose, despite significant differences between Member States13. Increasing vaccine uptake remains a crucial objective in the fight against the pandemic, given the protection against hospitalisation and severe disease afforded by vaccination, and thus plays an important role in ensuring that restrictions to the free movement of persons can be lifted. On the other hand, the spread of the SARS-CoV-2 variant of concern ‘Delta’ in the second half of 2021 caused significant increases in the number of infections, hospitalisation and deaths, requiring Member States to adopt strict public health measures in an effort to protect their healthcare system capacity. In early 2022, the SARS-CoV-2 variant of concern ‘Omicron’ caused sharp increases in the number of COVID-19 cases, rapidly replacing Delta and reaching an unprecedented intensity of community transmission across the Union. [Nonsensical statement: The Omicron announcement on November 26, 2021 was refuted by the WHO, Moreover the PCR test does not identify the virus nor the variants of the virus]\n\nThe complete document in pdf can be accessed HERE.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nFeatured image: Collage by Global Research; EU flag from wikimedia commons, COVID vaccine from Pixabay", "opengraph": {"locale": "en_US", "type": "article", "title": "Digital Tyranny: The EU Digital Covid Vaccine Certificate Framework - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version). To receive Global Research’s Daily Newsletter (selected articles), click here. Visit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles. *** An earlier …", "url": "https://www.globalresearch.ca/mandatory-vaccination-eu-just-went-through-under-radar/5776115", "site_name": "Global Research", "article:section": "English", "article:published_time": "2022-12-26T06:20:11+00:00", "article:modified_time": "2023-04-24T05:00:08+00:00", "updated_time": "2023-04-24T05:00:08+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/04/EU-covid-vaccination.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/04/EU-covid-vaccination.jpg", "image:width": "800", "image:height": "533"}, "tags": ["Science and Medicine", "Law and Justice", "Europe", "Police State & Civil Rights"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://www.facebook.com/Global-Research-109788198342383", "https://assembly.coe.int/nw/xml/XRef/Xref-XML2HTML-EN.asp?fileid=29004", "https://www.consilium.europa.eu/en/press/press-releases/2022/03/03/council-gives-green-light-to-start-negotiations-on-international-pandemic-treaty/", "https://www.globalresearch.ca/wp-content/uploads/2022/02/qr-code.jpg", "https://id2020.org/alliance", "https://www.gavi.org", "https://www.globalresearch.ca/wp-content/uploads/2015/07/david-rockefeller.jpg", "https://www.globalresearch.ca/canada-our-home-native-dictatorship/5772052", "https://www.bis.org/about/bisih/topics/cbdc.htm", "https://www.globalresearch.ca/biggest-lie-in-world-history-the-data-base-is-flawed-there-never-was-a-pandemic-the-covid-mandates-including-the-vaccine-are-invalid/5772008", "https://www.globalresearch.ca/biggest-lie-in-world-history-the-data-base-is-flawed-there-never-was-a-pandemic-the-covid-mandates-including-the-vaccine-are-invalid/5772008", "https://www.globalresearch.ca/biggest-lie-in-world-history-the-data-base-is-flawed-there-never-was-a-pandemic-the-covid-mandates-including-the-vaccine-are-invalid/5772008", "https://www.globalresearch.ca/biggest-lie-in-world-history-the-data-base-is-flawed-there-never-was-a-pandemic-the-covid-mandates-including-the-vaccine-are-invalid/5772008", "https://www.cdc.gov/csels/dls/locs/2021/07-21-2021-lab-alert-Changes_CDC_RT-PCR_SARS-CoV-2_Testing_1.html", "https://www.cdc.gov/csels/dls/locs/2021/07-21-2021-lab-alert-Changes_CDC_RT-PCR_SARS-CoV-2_Testing_1.html", "https://www.globalresearch.ca/biggest-lie-in-world-history-the-data-base-is-flawed-there-never-was-a-pandemic-the-covid-mandates-including-the-vaccine-are-invalid/5772008", "https://www.globalresearch.ca/wp-content/uploads/2021/09/killer-covid-vaccine-1024x816-1.png", "https://www.globalresearch.ca/jaccuse-governments-worldwide-lying-you-people-populations-they-purportedly-serve/5750650", "https://www.globalresearch.ca/jaccuse-governments-worldwide-lying-you-people-populations-they-purportedly-serve/5750650", "https://www.globalresearch.ca/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/5730652", "https://www.globalresearch.ca/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/5730652", "https://www.globalresearch.ca/author/michel-chossudovsky", "https://docsend.com/view/s7gp74xwndyatqb6", "https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/13375-Extension-of-EU-Digital-COVID-Certificate-Regulation_en", "https://www.globalresearch.ca/wp-content/uploads/2022/04/EU-on-covid-vaccination.png", "https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/13375-Extension-of-EU-Digital-COVID-Certificate-Regulation_en", "https://www.globalresearch.ca/author/michel-chossudovsky", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2022-12-26T06:20:11+00:00"}