{"result_id": "134008", "URL": "https://www.globalresearch.ca/australia-drug-regulator-hid-vaccine-deaths-from-public-concerned-that-disclosure-could-undermine-public-confidence/5809005", "timestamp": "2023-04-25 15:17:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/australia-drug-regulator-hid-vaccine-deaths-from-public-concerned-that-disclosure-could-undermine-public-confidence/5809005", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Australia's Drug Regulator Hid Vaccine Deaths from the Public, Concerned that 'Disclosure Could Undermine Public Confidence'", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version)\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nDocuments obtained under Freedom of Information (FOI) request by Dr Melissa McCann reveal that the TGA appears to have hidden numerous vaccine-induced deaths from the public view, including those of two children.\n\nDr McCann shared the shocking revelation in her address at the Covid Vaccine Conference, hosted by Clive Palmer’s United Australia Party over the weekend in Brisbane, Melbourne and Sydney. The event featured leading ICU physician Dr Pierre Kory, cardiologist and epidemiologist Dr Peter McCullough, and McCullough’s collaborator, author John Leake.\n\nAddressing sold out crowds, Dr McCann shared the extraordinary lengths she had to go to to extract causality assessment documents relating to the TGA’s investigation of reported deaths after Covid vaccination, which were obtained under FOI request in a process that took six months. Dr McCann lodged the request after seeing an unexpectedly high number of patients coming through her clinic experiencing adverse events after immunisation (AEFIs). She also noticed a high number of serious AEFI reports in the in the DAEN database, including the reported death of a 14 year old in October 2021.\n\nIn her original FOI request, Dr McCann requested causality assessments for all of the reported deaths in the DAEN database. This request was denied due to the large scope, and in negotiation with the TGA, Dr McCann agreed to revise down the request to the 11 documents that were eventually handed over, of which 10 related to DAEN death reports.\n\nWhen the documents were finally provided to Dr McCann in July 2022, she was dismayed to find that there were multiple reports that the TGA had assessed as causally linked to Covid vaccination, but, with the exception of one death, had not been reported in the TGA’s regular Safety Reports.\n\nFollowing is a list of deaths that the TGA’s own reports assessed as causally linked to Covid vaccination:\n• 21 year old female\n\n Case 729139, Document 1\n\n Moderna booster. Fatal AEFIs, including myocarditis, cardiac arrest, renal impairment, femoral artery embolism, spinal cord infarction.\n\n Assessment outcome: ‘Causal’\n\n * Initially determined as ‘unclassifiable’. VSIG (FOI 4049 Doc 5) updated the assessment outcome to ‘causal’.\n\nOf the above five listed deaths, only the first (21 year old female, case 729139) has been published in the TGA Safety Reports.1\n\nThe reported deaths are listed in DAEN, but the causality assessment is not visible to the public.\n\nAustralians have been falsely and misleadingly advised by the TGA and official health representatives, that out of 973 reported deaths, only 14 have been assessed as being causally linked to the Covid vaccines (13 following Astra Zeneca, 1 following Moderna).\n\nThe causality assessment reports released under FOI 3272 prove this statement to be a lie.\n\nThe November 2022 TGA Safety Report states that, “There have been no deaths in children or adolescents determined to be linked to COVID-19 vaccination.” But the assessment reports indicating the causal role of the Pfizer vaccine in the cases of the 7 and 9 year old children were released to Dr McCann in July 2022.\n\nThe causality assessment reports released under FOI 3272 prove this statement to also be a lie.\n\nOn reading the causality assessments provided to her under FOI 3727, Dr McCann felt both shocked and confused. “Why has this information not been provided to health professionals and the public who are making consent decisions? Children are continuing to be vaccinated and this is something that parents deserve to be able to weigh up,” Dr McCann told Dystopian Down Under.\n\nIt gets worse. Dr McCann was surprised to find that documents 1-10 out of a total 11 documents from FOI 3727 had not been uploaded to the TGA’s public disclosure log, per regular protocol. She emailed the TGA to query why documents 1-10 had been withheld from the disclosure log, and was advised, in a communication on 24 August 2022,\n\n“The decision maker for this request decided not to publish documents 1-10 pursuant to section 11c(1)(a) of the FOI Act as they contain sensitive personal information about deceased persons. As you would appreciate, consultation with the families of the deceased was not considered appropriate, and, as such, consultation was not undertaken with those families. Further, the decision maker determined that disclosure of the documents could undermine public confidence and reduce the willingness of the public to report adverse events to the TGA.”\n\nThe TGA seems to have assumed that families of the deceased will not want to hear from them. On the contrary, Deb, mother of 21 year old Natalie (case 729139), told Jab Injuries Australia that the lack of contact from the TGA was, “disgraceful treatment of a grieving mother who could have made a meaningful contribution to their investigations.” Deb says that she has never been contacted by the TGA, and only discovered the causality assessment outcome of her daughter’s death via the TGA’s Safety Report (23 September 2022), which she accessed online.\n\nAs for the TGA’s assertion that disclosure of the documents could undermine public confidence – one could very well argue the opposite case. Perceived lack of transparency drives public distrust. The last thing the TGA needs is public suspicion that they are burying vaccine deaths. Full transparency is the only way to create and maintain trust in public health. Dr McCann made this argument in a further communication, but the TGA’s decision against uploading documents 1-10 to the public disclosure log was final.\n\nDuring this time, Dr McCann, in partnership with other concerned doctors, repeatedly wrote to the Health Ministers and Adjunct Professor John Skerritt of the TGA.2\n\nto advise them of concerns about vaccine safety, and to call for immediate suspension of the vaccine rollout until an urgent review of adverse event reports could be undertaken.\n\nThese correspondences were met alternately with silence, obfuscation, or blanket assurances that the TGA was closely monitoring safety, and that the vaccines were safe and effective.\n\nIs this the tip of the iceberg?\n\nThe TGA consistently reports that only 14 of the 973 reported deaths have been causally linked to vaccination. But the contents of FOI 3727 raise questions:\n• How can the TGA’s statement be true? The TGA’s own causality assessments provided in FOI 3727 indicate that there are at least four more deaths that TGA has causally linked to vaccination (two adults, two children) which remain unaccounted for in the official count of 14.\n• How many of the 959 (973-14) deaths that the TGA implies are not causally linked to vaccination have even been investigated? Are 900 reports ‘in progress’? How many have been determined as ‘not causally linked’? Dr McCann asked the TGA to state the number of causality assessment reports that had been completed, but her request was denied.\n\nDr McCann is concerned about the implications for public health and safety: “If everyone is working on the basis that all of these deaths have been investigated and have been determined as not causally linked, well we can’t be sure that that’s the case.”\n\nFor now, Dr McCann is turning her efforts to a Covid Vaccine Class Action, which is expected to file within the month. The Class Action has received over 350 expressions of interest, and the number is still growing.\n\n“Hopefully this class action will force some transparency so that there will be more clarity around how adverse events are reviewed, and how many are likely to be linked to the vaccines,” says Dr McCann.\n\nThis is not the first time Dr McCann has stepped up as a national hero. The Courier Mail reported Dr McCann’s efforts in turning her Whitsunday Family Practice into a makeshift hospital in the immediate aftermath of Tropical Cyclone Debbie, in 2017. Dr McCann has uncovered much more than this through the FOI process, but further revelations will be saved for another day. This is enough apparent malfeasance to swallow in one sitting. Credit to Jikky (Twitter) and Senator Gerard Rennick for their roles in partnering with Dr McCann to bring light to the TGA’s behaviour in relation to Covid safety surveillance and regulation. Yesterday, Federal MP Russell Broadbent (Liberal Party) added further pressure to the TGA, referring to Dr McCann’s FOI 3727 in parliament, “Why has the TGA not responded to doctors who raised these issues with you six months ago, including drawing your attention to those case reports? This information is extremely alarming and demands an immediate response from the TGA.” (Statement at question time, 14 February 2023). An answer is yet to be supplied. Sydney lawyer Tony Nikolic, of AFL Solicitors, has represented parents of children who are disputing the necessity of having their child vaccinated against Covid, and is now seeing cases related to Covid vaccine injury in children as well. Mr Nikolic told Dystopian Down Under, ”In circumstances where child deaths and serious long-term injuries are listed on the TGA DAEN database relating to new and unsatisfactorily tested vaccine technologies, there should be no other response than a complete suspension of injections until independent lawyers and medical professionals conduct a thorough investigation, which should consider any civil wrongs, crimes or other wrongdoing associated to the roll out of injections across Australia.“ Australian parents who have concerns that their child has been vaccine injured or is subject to coercion to take a Covid vaccine are invited to contact Mr Nikolic at [email protected](.) The TGA has been contacted for comment, and this post will be updated accordingly as correspondence is received. Note to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. Michel Chossudovsky reviews in detail how this insidious project “destroys people’s lives”. He provides a comprehensive analysis of everything you need to know about the “pandemic” — from the medical dimensions to the economic and social repercussions, political underpinnings, and mental and psychological impacts. “My objective as an author is to inform people worldwide and refute the official narrative which has been used as a justification to destabilize the economic and social fabric of entire countries, followed by the imposition of the “deadly” COVID-19 “vaccine”. This crisis affects humanity in its entirety: almost 8 billion people. We stand in solidarity with our fellow human beings and our children worldwide. Truth is a powerful instrument.” Get yours for FREE! Click here to download. We encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australia's Drug Regulator Hid Vaccine Deaths from the Public, Concerned that 'Disclosure Could Undermine Public Confidence' - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name (desktop version) To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** Documents obtained under Freedom of Information (FOI) …", "url": "https://www.globalresearch.ca/australia-drug-regulator-hid-vaccine-deaths-from-public-concerned-that-disclosure-could-undermine-public-confidence/5809005", "site_name": "Global Research", "article:tag": "COVID vaccines", "article:section": "English", "article:published_time": "2023-02-17T14:48:24+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/06/covid-vaccine-vaers.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/06/covid-vaccine-vaers.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Oceania", "Media Disinformation", "Science and Medicine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe title=\"Where's the TGA's transparency?\" src=\"https://www.youtube.com/embed/xD1ZV4xBl-o\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/xD1ZV4xBl-o"}], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.whitsundayfamilypractice.com.au/our-doctors/", "https://drpierrekory.com/", "https://www.petermcculloughmd.com/", "https://www.amazon.com.au/John-Leake/e/B0045AVLK4/ref=dp_byline_cont_pop_book_1", "https://www.tga.gov.au/safety/safety/safety-monitoring-daen-database-adverse-event-notifications/database-adverse-event-notifications-daen", "https://www.tga.gov.au/news/covid-19-vaccine-safety-reports", "https://www.tga.gov.au/sites/default/files/2022-08/foi-3727-01.pdf", "https://www.tga.gov.au/foi-disclosure-log", "https://www.instagram.com/p/ComB-GphZrW/?hl=en", "https://www.tga.gov.au/news/covid-19-vaccine-safety-reports/covid-19-vaccine-safety-report-23-09-2022", "https://www.couriermail.com.au/news/queensland/whitsunday/hero-doctor-in-national-spotlight/news-story/33faa718632bcaa2b7066c9524315238", "https://twitter.com/TheJikky/status/1606591158200963074", "https://twitter.com/SenatorRennick/status/1624965263514038279?s=20&t=scfxxswybCnevh65G9gKyg", "https://aflsolicitors.com.au/", "/cdn-cgi/l/email-protection", "https://www.globalresearch.ca/conservative-risk-benefit-analyses-decide-against-covid-19-vaccination/5802216", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://rebekahbarnett.substack.com/p/breaking-australias-drug-regulator", "https://www.globalresearch.ca/author/rebekah-barnett", "https://rebekahbarnett.substack.com/p/breaking-australias-drug-regulator", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-02-17T14:48:24+00:00"}