{"result_id": "134014", "URL": "https://www.globalresearch.ca/many-people-fully-vaccinated-covid-now-going-blind/5778951", "timestamp": "2023-04-25 15:17:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/many-people-fully-vaccinated-covid-now-going-blind/5778951", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Many People Fully Vaccinated for COVID Are Now Going Blind", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nWe have heard all about the many cases of myocarditis and pericarditis post-injection, as well as recipients repeatedly testing “positive” for the virus even after doing the deed. But there is another concerning side effect occurring in the “fully vaccinated” for the Wuhan coronavirus (COVID-19) that is rarely mentioned: blindness.\n\nThe latest data out of the United Kingdom suggests that a growing number of fully jabbed people are losing their eyesight. The Medicines and Healthcare products Regulatory Agency (MHRA) Yellow Card system currently shows 163 cases of total blindness among people who got jabbed with the Pfizer-BioNTech needle, along with an additional six cases of central vision loss and four cases of sudden visual loss.\n\nTwenty-one people also reportedly now suffer from “blindness transient” specifically caused by the Pfizer injection. This adverse reaction involves visual disturbance or loss of sight in one eye for a few seconds or even minutes at a time.\n\nAnother 20 people beyond that are reported to have suffered from a reaction called “unilateral blindness,” which is when a person got blind or blurred vision in just one eye.\n\n“In total, there have been 8,016 eye disorders reported as adverse reactions to the Pfizer jab as of 6th April 2022,” reported the Daily Exposé.\n\nIs it worth possibly going blind just to feel “protected” against a cold?\n\nThe AstraZeneca injection, which is one of the COVID jabs currently available in the U.K., is also linked to cases of blindness.\n\nAs of April 6, the MHRA has received 324 reports of blindness, three reports of central vision loss, five reports of sudden visual loss, and 29 reports of blindness transient among 14,895 eye disorders, all specifically linked to the AstraZeneca needle.\n\nModerna also jabs people in the UK, though at a much smaller rate than the aforementioned companies. Still, many people who take the Moderna needle are now blind as well.\n\nThe MHRA shows that in conjunction with the Moderna injection, there have been 34 reports of blindness and 56 reports of visual impairment. In total, there have been 1,519 eye disorders reported as adverse reactions to the Moderna jab.\n\n“In all, when including adverse reactions reported where the brand of vaccine was not specified, there have been 24,516 eye disorders reported as adverse reactions to the Covid-19 injections, with 525 of these reactions being complete blindness,” the Exposé reported.\n\n“‘Fact-checkers’ alongside authorities have been on the case to sweep this data under the carpet and have labelled it as unreliable. Their reasoning is that ‘just because someone reports the event after having the vaccine, it doesn’t necessarily mean it is due to the vaccine.’”\n\nOne person who goes by the name of Louis documented on Twitter the story of his wife, who in the weeks and months following her AstraZeneca jab went completely blind in her left eye and between 30-60 percent blind in her right eye.\n\nThe neurologist who treated the woman warned her not to get the second dose of the shot.\n\n“As you can see the misery which the fact checkers are disregarding as ‘not necessarily the fault of the vaccine’ is very real for the people who are reporting them,” the Exposé added.\n\n“But why are the COVID vaccines causing people to go blind?”\n\nThe answer could have to do with the fact that COVID vaccines also cause major cardiovascular problems, including stroke. Visual loss often accompanies stroke, so it is all starting to make sense.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nFeatured image is from The Conservative Woman", "opengraph": {"locale": "en_US", "type": "article", "title": "Many People Fully Vaccinated for COVID Are Now Going Blind - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version). To receive Global Research’s Daily Newsletter (selected articles), click here. Visit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles. First published on …", "url": "https://www.globalresearch.ca/many-people-fully-vaccinated-covid-now-going-blind/5778951", "site_name": "Global Research", "article:tag": "vaccine side effects", "article:section": "English", "article:published_time": "2023-04-09T12:46:01+00:00", "article:modified_time": "2023-04-09T13:10:54+00:00", "updated_time": "2023-04-09T13:10:54+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/01/vaccine.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/01/vaccine.jpg", "image:width": "600", "image:height": "300"}, "tags": ["Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://www.facebook.com/Global-Research-109788198342383", "https://dailyexpose.uk/2022/04/26/why-people-going-blind-following-covid-vaccination/", "https://vaccines.news/2022-04-28-many-people-fully-vaccinated-covid-going-blind.html", "https://www.globalresearch.ca/author/ethan-huff", "https://vaccines.news/2022-04-28-many-people-fully-vaccinated-covid-going-blind.html", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-09T12:46:01+00:00"}