{"result_id": "134035", "URL": "https://www.globalresearch.ca/covid-update-what-truth/5779037", "timestamp": "2023-04-25 15:17:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-update-what-truth/5779037", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "The COVID Pandemic and the mRNA Vaccine: What Is the Truth? Dr. Russell L. Blaylock", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\nThe COVID-19 pandemic is one of the most manipulated infectious disease events in history, characterized by official lies in an unending stream lead by government bureaucracies, medical associations, medical boards, the media, and international agencies.[3 , 6 , 57]\n\nWe have witnessed a long list of unprecedented intrusions into medical practice, including attacks on medical experts, destruction of medical careers among doctors refusing to participate in killing their patients and a massive regimentation of health care, led by non-qualified individuals with enormous wealth, power and influence.\n\nFor the first time in American history a president, governors, mayors, hospital administrators and federal bureaucrats are determining medical treatments based not on accurate scientifically based or even experience based information, but rather to force the acceptance of special forms of care and “prevention”—including remdesivir, use of respirators and ultimately a series of essentially untested messenger RNA vaccines.\n\nFor the first time in history medical treatment, protocols are not being formulated based on the experience of the physicians treating the largest number of patients successfully, but rather individuals and bureaucracies that have never treated a single patient—including Anthony Fauci, Bill Gates, EcoHealth Alliance, the CDC, WHO, state public health officers and hospital administrators.[23 , 38]\n\nThe media (TV, newspapers, magazines, etc), medical societies, state medical boards and the owners of social media have appointed themselves to be the sole source of information concerning this so-called “pandemic”.\n\nWebsites have been removed, highly credentialed and experienced clinical doctors and scientific experts in the field of infectious diseases have been demonized, careers have been destroyed and all dissenting information has been labeled “misinformation” and “dangerous lies”, even when sourced from top experts in the fields of virology, infectious diseases, pulmonary critical care, and epidemiology.\n\nThese blackouts of truth occur even when this information is backed by extensive scientific citations from some of the most qualified medical specialists in the world.[23] Incredibly, even individuals, such as Dr. Michael Yeadon, a retired ex-Chief Scientist, and vice-president for the science division of Pfizer Pharmaceutical company in the UK, who charged the company with making an extremely dangerous vaccine, is ignored and demonized. Further, he, along with other highly qualified scientists have stated that no one should take this vaccine.\n\nDr. Peter McCullough, one of the most cited experts in his field, who has successfully treated over 2000 COVID patients by using a protocol of early treatment (which the so-called experts completely ignored), has been the victim of a particularly vicious assault by those benefiting financially from the vaccines. He has published his results in peer reviewed journals, reporting an 80% reduction in hospitalizations and a 75% reduction in deaths by using early treatment.[44] Despite this, he is under an unrelenting series of attacks by the information controllers, none of which have treated a single patient.\n\nNeither Anthony Fauci, the CDC, WHO nor any medical governmental establishment has ever offered any early treatment other than Tylenol, hydration and call an ambulance once you have difficulty breathing. This is unprecedented in the entire history of medical care as early treatment of infections is critical to saving lives and preventing severe complications. Not only have these medical organizations and federal lapdogs not even suggested early treatment, they attacked anyone who attempted to initiate such treatment with all the weapons at their disposal—loss of license, removal of hospital privileges, shaming, destruction of reputations and even arrest.[2]\n\nA good example of this outrage against freedom of speech and providing informed consent information is the recent suspension by the medical board in Maine of Dr. Meryl Nass’ medical license and the ordering of her to undergo a psychiatric evaluation for prescribing Ivermectin and sharing her expertise in this field.[9 , 65] I know Dr. Nass personally and can vouch for her integrity, brilliance and dedication to truth. Her scientific credentials are impeccable. This behavior by a medical licensing board is reminiscent of the methodology of the Soviet KGB during the period when dissidents were incarcerated in psychiatric gulags to silence their dissent.\n\nAnother unprecedented tactic is to remove dissenting doctors from their positions as journal editors, reviewers and retracting of their scientific papers from journals, even after these papers have been in print. Until this pandemic event, I have never seen so many journal papers being retracted— the vast majority promoting alternatives to official dogma, especially if the papers question vaccine safety. Normally a submitted paper or study is reviewed by experts in the field, called peer review. These reviews can be quite intense and nit picking in detail, insisting that all errors within the paper be corrected before publication. So, unless fraud or some other major hidden problem is discovered after the paper is in print, the paper remains in the scientific literature.\n\nWe are now witnessing a growing number of excellent scientific papers, written by top experts in the field, being retracted from major medical and scientific journals weeks, months and even years after publication. A careful review indicates that in far too many instances the authors dared question accepted dogma by the controllers of scientific publications—especially concerning the safety, alternative treatments or efficacy of vaccines.[12 , 63] These journals rely on extensive adverting by pharmaceutical companies for their revenue. Several instances have occurred where powerful pharmaceutical companies exerted their influence on owners of these journals to remove articles that in any way question these companies’ products.[13 , 34 , 35]\n\nWorse still is the actual designing of medical articles for promoting drugs and pharmaceutical products that involve fake studies, so-called ghostwritten articles.[49 , 64] Richard Horton is quoted by the Guardian as saying “journals have devolved into information laundering operations for the pharmaceutical industry.”[13 , 63] Proven fraudulent “ghostwritten” articles sponsored by pharmaceutical giants have appeared regularly in top clinical journals, such as JAMA, and New England Journal of Medicine—never to be removed despite proven scientific abuse and manipulation of data.[49 , 63]\n\nGhostwritten articles involve using planning companies whose job it is to design articles containing manipulated data to support a pharmaceutical product and then have these articles accepted by high-impact clinical journals, that is, the journals most likely to affect clinical decision making of doctors. Further, they supply doctors in clinical practice with free reprints of these manipulated articles. The Guardian found 250 companies engaged in this ghostwriting business. The final step in designing these articles for publication in the most prestigious journals is to recruit well recognized medical experts from prestigious institutions, to add their name to these articles. These recruited medical authors are either paid upon agreeing to add their name to these pre- written articles or they do so for the prestige of having their name on an article in a prestigious medical journal.[11]\n\nOf vital importance is the observation by experts in the field of medical publishing that nothing has been done to stop this abuse. Medical ethicists have lamented that because of this widespread practice “you can’t trust anything.” While some journals insist on disclosure information, most doctors reading these articles ignore this information or excuse it and several journals make disclosure more difficult by requiring the reader to find the disclosure statements at another location. Many journals do not police such statements and omissions by authors are common and without punishment.\n\nAs concerns the information made available to the public, virtually all the media is under the control of these pharmaceutical giants or others who are benefitting from this “pandemic”. Their stories are all the same, both in content and even wording. Orchestrated coverups occur daily and massive data exposing the lies being generated by these information controllers are hidden from the public. All data coming over the national media (TV, newspaper and magazines), as well as the local news you watch every day, comes only from “official” sources—most of which are lies, distortions or completely manufactured out of whole cloth—all aimed to deceive the public.\n\nTelevision media receives the majority of its advertising budget from the international pharmaceutical companies—this creates an irresistible influence to report all concocted studies supporting their vaccines and other so-called treatments.[14] In 2020 alone the pharmaceutical industries spent 6.56 billion dollars on such advertising.[13 , 14] Pharma TV advertising amounted to 4.58 billion, an incredible 75% of their budget. That buys a lot of influence and control over the media. World famous experts within all fields of infectious diseases are excluded from media exposure and from social media should they in any way deviate against the concocted lies and distortions by the makers of these vaccines. In addition, these pharmaceutical companies spend tens of millions on social media advertising, with Pfizer leading the pack with $55 million in 2020.[14]\n\nWhile these attacks on free speech are terrifying enough, even worse is the virtually universal control hospital administrators have exercised over the details of medical care in hospitals. These hirelings are now instructing doctors which treatment protocols they will adhere to and which treatments they will not use, no matter how harmful the “approved” treatments are or how beneficial the “unapproved” treatments are.[33 , 57]\n\nNever in the history of American medicine have hospital administrators dictated to its physicians how they will practice medicine and what medications they can use. The CDC has no authority to dictate to hospitals or doctors concerning medical treatments. Yet, most physicians complied without the slightest resistance.\n\nThe federal Care Act encouraged this human disaster by offering all US hospitals up to 39,000 dollars for each ICU patient they put on respirators, despite the fact that early on it was obvious that the respirators were a major cause of death among these unsuspecting, trusting patients. In addition, the hospitals received 12,000 dollars for each patient that was admitted to the ICU—explaining, in my opinion and others, why all federal medical bureaucracies (CDC, FDA, NIAID, NIH, etc) did all in their power to prevent life- saving early treatments.[46] Letting patients deteriorate to the point they needed hospitalization, meant big money for all hospitals. A growing number of hospitals are in danger of bankruptcy, and many have closed their doors, even before this “pandemic”.[50] Most of these hospitals are now owned by national or international corporations, including teaching hospitals.[10]\n\nIt is also interesting to note that with the arrival of this “pandemic” we have witnessed a surge in hospital corporate chains buying up a number of these financially at-risk hospitals.[1 , 54] It has been noted that billions in Federal Covid aid is being used by these hospital giants to acquire these financially endangered hospitals, further increasing the power of corporate medicine over physician independence. Physicians expelled from their hospitals are finding it difficult to find other hospitals staffs to join since they too may be owned by the same corporate giant. As a result, vaccine mandate policies include far larger numbers of hospital employees. For example, Mayo Clinic fired 700 employees for exercising their right to refuse a dangerous, essentially untested experimental vaccine.[51 , 57] Mayo Clinic did this despite the fact that many of these employees worked during the worst of the epidemic and are being fired when the Omicron variant is the dominant strain of the virus, has the pathogenicity of a common cold for most and the vaccines are ineffective in preventing the infection.\n\nIn addition, it has been proven that the vaccinated asymptomatic person has a nasopharyngeal titer of the virus as high as an infected unvaccinated person. If the purpose of the vaccine mandate is to prevent viral spread among the hospital staff and patients, then it is the vaccinated who present the greatest risk of transmission, not the unvaccinated. The difference is that a sick unvaccinated person would not go to work, the asymptomatic vaccinated spreader will.\n\nWhat we do know is that major medical centers, such as Mayo Clinic, receive tens of millions of dollars in NIH grants each year as well as monies from the pharmaceutical makers of these experimental “vaccines”. In my view, that is the real consideration driving these policies. If this could be proven in a court of law the administrators making these mandates should be prosecuted to the fullest extent of the law and sued by all injured parties.\n\nThe hospital bankruptcy problem has grown increasingly acute due to hospitals vaccine mandates and resulting large number of hospitals staff, especially nurses, refusing to be forcibly vaccinated.[17 , 51] This is all unprecedented in the history of medical care. Doctors within hospitals are responsible for the treatment of their individual patients and work directly with these patients and their families to initiate these treatments. Outside organizations, such as the CDC, have no authority to intervene in these treatments and to do so exposes the patients to grave errors by an organization that has never treated a single COVID-19 patient.\n\nWhen this pandemic started, hospitals were ordered by the CDC to follow a treatment protocol that resulted in the deaths of hundreds of thousands of patients, most of whom would have recovered had proper treatments been allowed.[43 , 44]\n\nThe majority of these deaths could have been prevented had doctors been allowed to use early treatment with such products as Ivermectin, hydroxy-chloroquine and a number of other safe drugs and natural compounds. It has been estimated, based on results by physicians treating the most covid patients successfully, that of the 800,000 people that we are told died from Covid, 640,000 could have not only been saved, but could have, in many cases, returned to their pre-infection health status had mandated early treatment with these proven methods been used. This neglect of early treatment constitutes mass murder. That means 160,000 would have actually died, far less than the number dying at the hands of bureaucracies, medical associations and medical boards that refused to stand up for their patients. According to studies of early treatment of thousands of patients by brave, caring doctors, seventy-five to eighty percent of the deaths could have been prevented.[43 , 44]\n\nIncredibly, these knowledgeable doctors were prevented from saving these Covid-19 infected people. It should be an embarrassment to the medical profession that so many doctors mindlessly followed the deadly protocols established by the controllers of medicine.\n\nOne must also keep in mind that this event never satisfied the criteria for a pandemic. The World Health Organization changed the criteria to make this a pandemic. To qualify for a pandemic status the virus must have a high mortality rate for the vast majority of people, which it didn’t (with a 99.98% survival rate), and it must have no known existing treatments—which this virus had—in fact, a growing number of very successful treatments.\n\nThe draconian measures established to contain this contrived “pandemic” have never been shown to be successful, such as masking the public, lockdowns, and social distancing. A number of carefully done studies during previous flu seasons demonstrated that masks, of any kind, had never prevented the spread of the virus among the public.[60]\n\nIn fact, some very good studies suggested that the masks actually spread the virus by giving people a false sense of security and other factors, such as the observation that people were constantly breaking sterile technique by touching their mask, improper removal and by leakage of infectious aerosols around the edges of the mask. In addition masks were being disposed of in parking lots, walking trails, laid on tabletops in restaurants and placed in pockets and purses.\n\nWithin a few minutes of putting on the mask, a number of pathogenic bacteria can be cultured from the masks, putting the immune suppressed person at a high risk of bacterial pneumonia and children at a higher risk of meningitis.[16] A study by researchers at the University of Florida cultured over 11 pathogenic bacteria from the inside of the mask worn by children in schools.[40]\n\nIt was also known that children were at essentially no risk of either getting sick from the virus or transmitting it.\n\nIn addition, it was also known that wearing a mask for over 4 hours (as occurs in all schools) results in significant hypoxia (low blood oxygen levels) and hypercapnia (high CO2 levels), which have a number of deleterious effects on health, including impairing the development of the child’s brain.[4 , 72 , 52]\n\nWe have known that brain development continues long after the grade school years. A recent study found that children born during the “pandemic” have significantly lower IQs—yet school boards, school principals and other educational bureaucrats are obviously unconcerned.[18]\n\nImage on the right is from The Corbett Report\n\nThe designers of this pandemic anticipated a pushback by the public and that major embarrassing questions would be asked.\n\nTo prevent this, the controllers fed the media a number of tactics, one of the most commonly used was and is the “fact check” scam. With each confrontation with carefully documented evidence, the media “fact checkers” countered with the charge of “misinformation”, and an unfounded “conspiracy theory” charge that was, in their lexicon, “debunked”. Never were we told who the fact checkers were or the source of their “debunking” information—we were just to believe the “fact checkers”. A recent court case established under oath that facebook “fact checkers” used their own staff opinion and not real experts to check “facts”.[59] When sources are in fact revealed they are invariably the corrupt CDC, WHO or Anthony Fauci or just their opinion. Here is a list of things that were labeled as “myths” and “misinformation” that were later proven to be true.\n\nThe asymptomatic vaccinated are spreading the virus equally as with unvaccinated symptomatic infected.\n\nThe vaccines cannot protect adequately against new variants, such as Delta and Omicron.\n\nNatural immunity is far superior to vaccine immunity and is most likely lifelong.\n\nVaccine immunity not only wanes after several months, but all immune cells are impaired for prolonged periods, putting the vaccinated at a high risk of all infections and cancer.\n\nCOVID vaccines can cause a significant incidence of blood clots and other serious side effects\n\nThe vaccine proponents will demand numerous boosters as each variant appears on the scene.\n\nFauci will insist on the covid vaccine for small children and even babies.\n\nVaccine passports will be required to enter a business, fly in a plane, and use public transportation.\n\nThere will be internment camps for the unvaccinated (as in Australia, Austria and Canada).\n\nThe unvaccinated will be denied employment.\n\nThere are secret agreements between the government, elitist institutions, and vaccine makers\n\nMany hospitals were either empty or had low occupancy during the pandemic.\n\nThe spike protein from the vaccine enters the nucleus of the cell, altering cell DNA repair function.\n\nHundreds of thousands have been killed by the vaccines and many times more have been permanently damaged.\n\nEarly treatment could have saved the lives of most of the 700,000 who died.\n\nVaccine-induced myocarditis (which was denied initially) is a significant problem and clears over a short period.\n\nSpecial deadly lots (batches) of these vaccines are mixed with the mass of other Covid-19 vaccines.\n\nSeveral of these claims by those opposing these vaccines now appear on the CDC website—most still identified as “myths”. Today, extensive evidence has confirmed that each of these so-called “myths” were in fact true. Many are even admitted by the “saint of vaccines”, Anthony Fauci.\n\nFor example, we were told, even by our cognitively impaired President, that once the vaccine was released all the vaccinated people could take off their masks. Oops! We were told shortly afterward— the vaccinated have high concentrations (titers) of the virus in their noses and mouths (nasopharynx) and can transmit the virus to others in which they come into contact—especially their own family members. On go the masks once again— in fact double masking is recommended. The vaccinated are now known to be the main superspreaders of the virus and hospitals are filled with the sick vaccinated and people suffering from serious vaccine complications.[27 , 42 , 45]\n\nAnother tactic by the vaccine proponents is to demonize those who reject being vaccinated for a variety of reasons.\n\nThe media refers to these critically thinking individuals as “anti-vaxxers”, “vaccine deniers”, “Vaccine resisters”, “murders”, “enemies of the greater good” and as being the ones prolonging the pandemic. I have been appalled by the vicious, often heartless attacks by some of the people on social media when a parent or loved one relates a story of the terrible suffering and eventual death, they or their loved one suffered as a result of the vaccines. Some psychopaths tweet that they are glad that the loved one died or that the dead vaccinated person was an enemy of good for telling of the event and should be banned. This is hard to conceptualize. This level of cruelty is terrifying, and signifies the collapse of a moral, decent, and compassionate society.\n\nIt is bad enough for the public to sink this low, but the media, political leaders, hospital administrators, medical associations and medical licensing boards are acting in a similar morally dysfunctional and cruel way.\n\nLogic, Reasoning, and Scientific Evidence Has Disappeared in this Event\n\nHas scientific evidence, carefully done studies, clinical experience and medical logic had any effect on stopping these ineffective and dangerous vaccines? Absolutely not! The draconian efforts to vaccinate everyone on the planet continues (except the elite, postal workers, members of Congress and other insiders).[31 , 62]\n\nIn the case of all other drugs and previous conventional vaccines under review by the FDA, the otherwise unexplained deaths of 50 or less individuals would result in a halt in further distribution of the product, as happened on 1976 with the swine flu vaccine. With over 18,000 deaths being reported by the VAERS system for the period December 14, 2020 and December 31st, 2021 as well as 139,126 serious injuries (including deaths) for the same period there is still no interest in stopping this deadly vaccine program.[61] Worse, there is no serious investigation by any government agency to determine why these people are dying and being seriously and permanently injured by these vaccines.[15 , 67] What we do see is a continuous series of coverups and evasions by the vaccine makers and their promoters.\n\nThe war against effective cheap and very safe repurposed drugs and natural compounds, that have proven beyond all doubt to have saved millions of lives all over the world, has not only continued but has stepped up in intensity.[32 , 34 , 43]\n\nDoctors are told they cannot provide these life-saving compounds for their patients and if they do, they will be removed from the hospital, have their medical license removed or be punished in many other ways. A great many pharmacies have refused to fill prescriptions for lvermectin or hydroxy- chloroquine, despite the fact that millions of people have taken these drugs safely for over 60 years in the case of hydroxy chloroquine and decades for Ivermectin.[33 , 36] This refusal to fill prescriptions is unprecedented and has been engineered by those wanting to prevent alternative methods of treatment, all based on protecting vaccine expansion to all. Several companies that make hydroxy chloroquine agreed to empty their stocks of the drug by donating them to the Strategic National Stockpile, making this drug far more difficult to get.[33] Why would the government do that when over 30 well-done studies have shown that this drug reduced deaths anywhere from 66% to 92% in other countries, such as India, Egypt, Argentina, France, Nigeria, Spain, Peru, Mexico, and others?[23]\n\nThe critics of these two life-saving drugs are most often funded by Bill Gates and Anthony Fauci, both of which are making millions from these vaccines.[48 , 15]\n\nTo further stop the use of these drugs, the pharmaceutical industry and Bill Gates/Anthony Fauci funded fake research to make the case that hydroxy chloroquine was a dangerous drug and could damage the heart.[34] To make this fraudulent case the researchers administered the sickest of covid patients a near lethal dose of the drug, in a dose far higher than used on any covid patient by Dr. Kory, McCullough and other “real”, and compassionate doctors, physicians who were actually treating covid patients.[23]\n\nThe controlled, lap-dog media, of course, hammered the public with stories of the deadly effect of hydroxy-chloroquine, all with a terrified look of fake panic. All these stories of ivermectin dangers were shown to be untrue and some of the stories were incredibly preposterous.[37 , 43]\n\nImage below is from Children’s Health Defense\n\nThe attack on Ivermectin was even more vicious than against hydroxy-chloroquine. All of this, and a great deal more is meticulously chronicled in Robert Kennedy, Jr’s excellent new book—The Real Anthony Fauci. Bill Gates, Big Pharma, and the Global War on Democracy and Public Health.[32] If you are truly concerned with the truth and with all that has occurred since this atrocity started, you must not only read, but study this book carefully. It is fully referenced and covers all topics in great detail. This is a designed human tragedy of Biblical proportions by some of the most vile, heartless, psychopaths in history.\n\nMillions have been deliberately killed and crippled, not only by this engineered virus, but by the vaccine itself and by the draconian measures used by these governments to “control the pandemic spread”. We must not ignore the “deaths by despair” caused by these draconian measures, which can exceed hundreds of thousands.\n\nMillions have starved in third world countries as a result. In the United States alone, of the 800,000 who died, claimed by the medical bureaucracies, well over 600,000 of these deaths were the result of the purposeful neglect of early treatment, blocking the use of highly effective and safe repurposed drugs, such as hydroxy-chloroquine and Ivermectin, and the forced use of deadly treatments such as remdesivir and use of ventilators. This does not count the deaths of despair and neglected medical care caused by the lockdown and hospital measures forced on healthcare systems.\n\nTo compound all this, because of vaccine mandates among all hospital personnel, thousands of nurses and other hospital workers have resigned or been fired.[17 , 30 , 51] This has resulted in critical shortages of these vital healthcare workers and dangerous reductions of ICU beds in many hospitals. In addition, as occurred in the Lewis County Healthcare System, a specialty-hospital system in Lowville, N.Y., closed its maternity unit following the resignation of 30 hospital staff over the state’s disastrous vaccine mandate orders. The irony in all these cases of resignations is that the administrators unhesitatingly accepted these mass staffing losses despite rantings about suffering from short staffing during a “crisis”. This is especially puzzling when we learned that the vaccines did not prevent viral transmission and the present predominant variant is of extremely low pathogenicity.\n\nDangers of the Vaccines Are Increasingly Revealed by Science\n\nWhile most researchers, virologists, infectious disease researchers and epidemiologists have been intimidated into silence, a growing number of high integrity individuals with tremendous expertise have come forward to tell the truth—that is, that these vaccines are deadly.\n\nMost new vaccines must go through extensive safety testing for years before they are approved. New technologies, such as the mRNA and DNA vaccines, require a minimum of 10 years of careful testing and extensive follow-up. These new so-called vaccines were “tested” for only 2 months and then the results of these safety test were and continue to be kept secret. Testimony before Senator Ron Johnson by several who participated in the 2 months study indicates that virtually no follow-up of the participants of the pre-release study was ever done.[67] Complains of complications were ignored and despite promises by Pfizer that all medical expenses caused by the “vaccines” would be paid by Pfizer, these individuals stated that none were paid.[66] Some medical expenses exceed 100,000 dollars.\n\nAs an example of the deception by Pfizer, and the other makers of mRNA vaccines, is the case of 12-year-old Maddie de Garay, who participated in the Pfizer vaccine pre-release safety study. At Sen. Johnson’s presentation with the families of the vaccine injured, her mother told of her child’s recurrent seizures, that she is now confined to a wheelchair, must be tube fed and suffers permanent brain damage. On the Pfizer safety evaluation submitted to the FDA her only side effect is listed as having a “stomachache”. Each person submitted similar horrifying stories.\n\nThe Japanese resorted to a FOIA (Freedom of Information Act) lawsuit to force Pfizer to release its secret biodistribution study. The reason Pfizer wanted it kept secret is that it demonstrated that Pfizer lied to the public and the regulatory agencies about the fate of the injected vaccine contents (the mRNA enclosed nano-lipid carrier). They claimed that it remained at the site of the injection (the shoulder), when in fact their own study found that it rapidly spread throughout the entire body by the bloodstream within 48 hours.\n\nThe study also found that these deadly nano-lipid carriers collected in very high concentrations in several organs, including the reproductive organs of males and females, the heart, the liver, the bone marrow, and the spleen (a major immune organ). The highest concentration was in the ovaries and the bone marrow. These nano-lipid carriers also were deposited in the brain.\n\nImage on the right: Dr. Ryan Cole. CEO and Medical Director of Cole Diagnostics. (Source: Health Impact News)\n\nDr. Ryan Cole, a pathologist from Idaho reported a dramatic spike in highly aggressive cancers among vaccinated individuals, (not reported in the Media). He found a frighteningly high incidence of highly aggressive cancers in vaccinated individuals, especially highly invasive melanomas in young people and uterine cancers in women.[26] Other reports of activation of previously controlled cancers are also appearing among vaccinated cancer patients.[47] Thus far, no studies have been done to confirm these reports, but it is unlikely such studies will be done, at least studies funded by grants from the NIH.\n\nThe high concentration of spike proteins found in the ovaries in the biodistribution study could very well impair fertility in young women, alter menstruation, and could put them at an increased risk of ovarian cancer. The high concentration in the bone marrow, could also put the vaccinated at a high risk of leukemia and lymphoma. The leukemia risk is very worrisome now that they have started vaccinating children as young as 5 years of age. No long-term studies have been conducted by any of these makers of Covid-19 vaccines, especially as regards the risk of cancer induction. Chronic inflammation is intimately linked to cancer induction, growth and invasion and vaccines stimulate inflammation.\n\nCancer patients are being told they should get vaccinated with these deadly vaccines. This, in my opinion, is insane. Newer studies have shown that this type of vaccine inserts the spike protein within the nucleus of the immune cells (and most likely many cell types) and once there, inhibits two very important DNA repair enzymes, BRCA1 and 53BP1, whose duty it is to repair damage to the cell’s DNA.[29] Unrepaired DNA damage plays a major role in cancer.\n\nThere is a hereditary disease called xeroderma pigmentosum in which the DNA repair enzymes are defective. These ill-fated individuals develop multiple skin cancers and a very high incidence of organ cancer as a result. Here we have a vaccine that does the same thing, but to a less extensive degree.\n\nOne of the defective repair enzymes caused by these vaccines is called BRCA1, which is associated with a significantly higher incidence of breast cancer in women and prostate cancer in men.\n\nIt should be noted that no studies were ever done on several critical aspects of this type of vaccine.\n\nThey have never been tested for long term effects.\n\nThey have never been tested for induction of autoimmunity.\n\nThey have never been properly tested for safety during any stage of pregnancy.\n\nNo follow-up studies have been done on the babies of vaccinated women.\n\nThere are no long-term studies on the children of vaccinated pregnant women after their birth (Especially as neurodevelopmental milestone occur).\n\nIt has never been tested for effects on a long list of medical conditions:\n\nPrevious experience with the flu vaccines clearly demonstrates that the safety studies done by researchers and clinical doctors with ties to pharmaceutical companies were essentially all either poorly done or purposefully designed to falsely show safety and coverup side effects and complications. This was dramatically demonstrated with the previously mentioned phony studies designed to indicate that hydroxy Chloroquine and Ivermectin were ineffective and too dangerous to use.[34 , 36 , 37] These fake studies resulted in millions of deaths and severe health disasters worldwide. As stated, 80% of all deaths were unnecessary and could have been prevented with inexpensive, safe repurposed medications with a very long safety history among millions who have taken them for decades or even a lifetime.[43 , 44]\n\nIt is beyond ironic that those claiming that they are responsible for protecting our health approved a poorly tested set of vaccines that has resulted in more deaths in less than a year of use than all the other vaccines combined given over the past 30 years. Their excuse when confronted was—“we had to overlook some safety measures because this was a deadly pandemic”.[28 , 46]\n\nIn 1986 President Reagan signed the National Childhood Vaccine Injury Act, which gave blanket protection to pharmaceutical makers of vaccines against injury litigation by families of vaccine injured individuals. The Supreme Court, in a 57-page opinion, ruled in favor of the vaccine companies, effectively allowing vaccine makers to manufacture and distribute dangerous, often ineffective vaccines to the population without fear of legal consequences. The court did insist on a vaccine injury compensation system which has paid out only a very small number of rewards to a large number of severely injured individuals. It is known that it is very difficult to receive these awards. According to the Health Resources and Services Administration, since 1988 the Vaccine Injury Compensation Program (VICP) has agreed to pay 3,597 awards among 19,098 vaccine injured individuals applying amounting to a total sum of $3.8 billion. This was prior to the introduction of the Covid-19 vaccines, in which the deaths alone exceed all deaths related to all the vaccines combined over a thirty-year period.\n\nIn 2018 President Trump signed into law the “right-to-try” law which allowed the use of experimental drugs and all unconventional treatments to be used in cases of extreme medical conditions. As we have seen with the refusal of many hospitals and even blanket refusal by states to allow Ivermectin, hydroxy-chloroquine or any other unapproved “official” methods to treat even terminal Covid-19 cases, these nefarious individuals have ignored this law.\n\nStrangely, they did not use this same logic or the law when it came to Ivermectin and Hydroxy-Chloroquine, both of which had undergone extensive safety testing by over 30 clinical studies of a high quality and given glowing reports on both efficacy and safety in numerous countries. In addition, we had a record of use for up to 60 years by millions of people, using these drugs worldwide, with an excellent safety record. It was obvious that a group of very powerful people in conjunction with pharmaceutical conglomerates didn’t want the pandemic to end and wanted vaccines as the only treatment option. Kennedy’s book makes this case using extensive evidence and citations.[14 , 32]\n\nDr. James Thorpe, an expert in maternal-fetal medicine, demonstrates that these covid-19 vaccines given during pregnancy have resulted in a 50-fold higher incidence of miscarriage than reported with all other vaccines combined.[28] When we examine his graph on fetal malformations there was a 144-fold higher incidence of fetal malformation with the Covid-19 vaccines given during pregnancy as compared to all other vaccines combined. Yet, the American Academy of Obstetrics and Gynecology and the American College of Obstetrics and Gynecology endorse the safety of these vaccines for all stages of pregnancy and among women breast feeding their babies.\n\nIt is noteworthy that these medical specialty groups have received significant funding from Pfizer pharmaceutical company. The American College of Obstetrics and Gynecology, just in the 4th quarter of 2010, received a total of $11,000 from Pfizer Pharmaceutical company alone.[70] Funding from NIH grants are much higher.[20] The best way to lose these grants is to criticize the source of the funds, their products or pet programs. Peter Duesberg, because of his daring to question Fauci’s pet theory of AIDS caused by HIV virus, was no longer awarded any of the 30 grant applications he submitted after going public. Prior to this episode, as the leading authority on retroviruses in the world, he had never been turned down for an NIH grant.[39] This is how the “corrupted” system works, even though much of the grant money comes from our taxes.\n\nA new study has now surfaced, the results of which are terrifying.[25] A researcher at Kingston University in London, has completed an extensive analysis of the VAERs data (a subdepartment of the CDC which collects voluntary vaccine complication data), in which he grouped reported deaths following the vaccines according to the manufacturer’s lot numbers of the vaccines. Vaccines are manufactured in large batches called lots. What he discovered was that the vaccines are divided into over 20,000 lots and that one out of every 200 of these batches (lots) is demonstrably deadly to anyone who receives a vaccine from that lot, which includes thousands of vaccine doses.\n\nHe examined all manufactured vaccines—Pfizer, Moderna, Johnson and Johnson (Janssen), etc. He found that among every 200 batches of the vaccine from Pfizer and other makers, one batch of the 200 was found to be over 50x more deadly than vaccines batches from other lots. The other vaccine lots (batches) were also causing deaths and disabilities, but nowhere near to this extent. These deadly batches should have appeared randomly among all “vaccines” if it was an unintentional event. However, he found that 5% of the vaccines were responsible for 90% of the serious adverse events, including deaths. The incidence of deaths and serious complications among these “hot lots” varied from over 1000% to several thousand percent higher than comparable safer lots. If you think this was by accident—think again. This is not the first time “hot lots” were, in my opinion, purposefully manufactured and sent across the nation—usually vaccines designed for children. In one such scandal, “hot lots” of a vaccine ended up all in one state and the damage immediately became evident. What was the manufacture’s response? It wasn’t to remove the deadly batches of the vaccine. He ordered his company to scatter the hot lots across the nation so that authorities would not see the obvious deadly effect.\n\nAll lots of a vaccine are numbered—for example Modera labels them with such codes as 013M20A. It was noted that the batch numbers ended in either 20A or 21A. Batches ending in 20A were much more toxic than the ones ending in 21A. The batches ending in 20A had about 1700 adverse events, versus a few hundred to twenty or thirty events for the 21A batches. This example explains why some people had few or no adverse events after taking the vaccine while others are either killed or severely and permanently harmed. To see the researcher’s explanation, go to https://www.bitchute.com/video/6xIYPZBkydsu/ In my opinion these examples strongly suggest an intentional alteration of the production of the “vaccine” to include deadly batches.\n\nI have met and worked with a number of people concerned with vaccine safety and I can tell you they are not the evil anti-vaxxers you are told they are. They are highly principled, moral, compassionate people, many of which are top researchers and people who have studied the issue extensively. Robert Kennedy, Jr, Barbara Lou Fisher, Dr. Meryl Nass, Professor Christopher Shaw, Megan Redshaw, Dr. Sherri Tenpenny, Dr. Joseph Mercola, Neil Z. Miller, Dr. Lucija Tomjinovic, Dr. Stephanie Seneff, Dr. Steve Kirsch and Dr. Peter McCullough just to name a few. These people have nothing to gain and a lot to lose. They are attacked viciously by the media, government agencies, and elite billionaires who think they should control the world and everyone in it.\n\nWhy Did Fauci Want No Autopsies of Those Who Died After Vaccination?\n\nThere are many things about this “pandemic” that are unprecedented in medical history. One of the most startling is that at the height of the pandemic so few autopsies, especially total autopsies, were being done. A mysterious virus was rapidly spreading around the world, a selected group of people with weakened immune systems were getting seriously ill and many were dying and the one way we could rapidly gain the most knowledge about this virus—an autopsy, was being discouraged.\n\nImage below is from Children’s Health Defense\n\nGuerriero noted that by the end of April, 2020 approximately 150,000 people had died, yet there were only 16 autopsies performed and reported in the medical literature.[24] Among these, only seven were complete autopsies, the remaining 9 being partial or by needle biopsy or incisional biopsy. Only after 170,000 deaths by Covid-19 and four months into the pandemic were the first series of autopsies actually done, that is, more than ten. And only after 280,000 deaths and another month, were the first large series of autopsies performed, some 80 in number.[22] Sperhake, in a call for autopsies to be done without question, noted that the first full autopsy reported in the literature along with photomicrographs appeared in a medico-legal journal from China in February 2020.[41 , 68] Sperhake expressed confusion as to why there was a reluctance to perform autopsies during the crisis, but he knew it was not coming from the pathologists. The medical literature was littered with appeals by pathologist for more autopsies to be performed.[58] Sperhake further noted that the Robert Koch Institute (The German health monitoring system) at least initially advised against doing autopsies. He also knew that at the time 200 participating autopsy institutions in the United States had done at least 225 autopsies among 14 states.\n\nSome have claimed that this dearth of autopsies was based on the government’s fear of infection among the pathologists, but a study of 225 autopsies on Covid-19 cases demonstrated only one case of infection among the pathologist and this was concluded to have been an infection contracted elsewhere.[19] Guerriero ends his article calling for more autopsies with this observation: “Shoulder to shoulder, clinical and forensic pathologists overcame the obstructions of autopsy studies in Covid-19 victims and hereby generated valuable knowledge on the pathophysiology of the interaction between the SARS-CoV-2 and the human body, thus contributing to our understanding of the disease.”[24]\n\nSuspicion concerning the worldwide reluctance of nations to allow full post mortem studies of Covid-19 victims may be based on the idea that it was more than by chance. There are at least two possibilities that stand out. First, those leading the progression of this “non-pandemic” event into a perceived worldwide “deadly pandemic”, were hiding an important secret that autopsies could document. Namely, just how many of the deaths were actually caused by the virus? To implement draconian measures, such as mandated mask wearing, lockdowns, destruction of businesses, and eventually mandated forced vaccination, they needed very large numbers of covid-19 infected dead. Fear would be the driving force for all these destructive pandemic control programs.\n\nElder et al in his study classified the autopsy findings into four groups.[22]\n• Not associated with Covid-19, despite the positive test.\n\nWhat possibly concerned or even terrified the engineers of this pandemic was that autopsies just might, and did, show that a number of these so-called Covid-19 deaths in truth died of their comorbid diseases. In the vast majority of autopsy studies reported, pathologists noted multiple comorbid conditions, most of which at the extremes of life could alone be fatal. Previously it was known that common cold viruses had an 8% mortality in nursing homes.\n\nIn addition, valuable evidence could be obtained from the autopsies that would improve clinical treatments and could possibly demonstrate the deadly effect of the CDC mandated protocols all hospitals were required to follow, such as the use of respirators and the deadly, kidney-destroying drug remdesivir. The autopsies also demonstrated accumulating medical errors and poor-quality care, as the shielding of doctors in intensive care units from the eyes of family members inevitably leads to poorer quality care as reported by several nurses working in these areas.[53 – 55]\n\nAs bad as all this was, the very same thing is being done in the case of Covid vaccine deaths—very few complete autopsies have been done to understand why these people died, that is, until recently. Two highly qualified researchers, Dr. Sucharit Bhakdi a microbiologist and highly qualified expert in infectious disease and Dr. Arne Burkhardt, a pathologist who is a widely published authority having been a professor of pathology at several prestigious institutions, recently performed autopsies on 15 people having died after vaccination. What they found explains why so many are dying and experiencing organ damage and deadly blood clots.[5]\n\nThey determined that 14 of the fifteen people died as a result of the vaccines and not of other causes. Dr. Burkhardt, the pathologist, observed widespread evidence of an immune attack on the autopsied individuals’ organs and tissues— especially their heart. This evidence included extensive invasion of small blood vessels with massive numbers of lymphocytes, which cause extensive cell destruction when unleashed. Other organs, such as the lungs and liver, were observed to have extensive damage as well. These findings indicate the vaccines were causing the body to attack itself with deadly consequences. One can easily see why Anthony Fauci, as well as public health officers and all who are heavily promoting these vaccines, publicly discouraged autopsies on the vaccinated who subsequently died. One can also see that in the case of vaccines, that were essentially untested prior to being approved for the general public, at least the regulatory agencies should have been required to carefully monitor and analyze all serious complications, and certainly deaths, linked to these vaccines. The best way to do that is with complete autopsies.\n\nWhile we learned important information from these autopsies what is really needed are special studies of the tissues of those who have died after vaccination for the presence of spike protein infiltration throughout the organs and tissues. This would be critical information, as such infiltration would result in severe damage to all tissues and organs involved—especially the heart, the brain, and the immune system. Animal studies have demonstrated this. In these vaccinated individuals the source of these spike proteins would be the injected nanolipid carriers of the spike protein producing mRNA. It is obvious that the government health authorities and pharmaceutical manufacturers of these “vaccines” do not want these critical studies done as the public would be outraged and demand an end to the vaccination program and prosecution of the involved individuals who covered this up.\n\nWe are all living through one of the most drastic changes in our culture, economic system, as well as political system in our nation’s history as well as the rest of the world.\n\nWe have been told that we will never return to “normal” and that a great reset has been designed to create a “new world order”. This has all been outlined by Klaus Schwab, head of the World Economic Forum, in his book on the “Great Reset”.[66] This book gives a great deal of insight as to the thinking of the utopians who are proud to claim this pandemic “crisis” as their way to usher in a new world. This new world order has been on the drawing boards of the elite manipulators for over a century.[73 , 74] In this paper I have concentrated on the devastating effects this has had on the medical care system in the United States, but also includes much of the Western world. In past papers I have discussed the slow erosion of traditional medical care in the United States and how this system has become increasingly bureaucratized and regimented.[7 , 8] This process was rapidly accelerating, but the appearance of this, in my opinion, manufactured “pandemic” has transformed our health care system over night.\n\nAs you have seen, an unprecedented series of events have taken place within this system. Hospital administrators, for example, assumed the position of medical dictators, ordering doctors to follow protocols derived not from those having extensive experience in treating this virus, but rather from a medical bureaucracy that has never treated a single COVID-19 patient. The mandated use of respirators on ICU Covid-19 patients, for example, was imposed in all medical systems and dissenting physicians were rapidly removed from their positions as caregivers, despite their demonstration of markedly improved treatment methods. Further, doctors were told to use the drug remdesivir despite its proven toxicity, lack of effectiveness and high complication rate. They were told to use drugs that impaired respiration and mask every patient, despite the patient’s impaired breathing. In each case, those who refused to abuse their patients were removed from the hospital and even faced a loss of license—or worse.\n\nFor the first time in modern medical history, early medical treatment of these infected patients was ignored nationwide. Studies have shown that early medical treatment was saving 80% of higher number of these infected people when initiated by independent doctors.[43 , 44] Early treatment could have saved over 640,000 lives over the course of this “pandemic”. Despite the demonstration of the power of these early treatments, the forces controlling medical care continued this destructive policy.\n\nFamilies were not allowed to see their loved ones, forcing these very sick individuals in the hospitals to face their deaths alone. To add insult to injury, funerals were limited to a few grieving family members, who were not allowed to even sit together. All the while large stores, such as Walmart and Cosco were allowed to operate with minimal restrictions. Nursing home patients were also not allowed to have family visitations, again being forced to die a lonely death. All the while, in a number of states, the most transparent being in New York state, infected elderly were purposefully transferred from hospitals into nursing homes, resulting in a very high death rates of these nursing home residents. At the beginning of this “pandemic” over 50% of all death were occurring in nursing homes.\n\nThroughout this “pandemic” we have been fed an unending series of lies, distortions and disinformation by the media, the public health officials, medical bureaucracies (CDC, FDA and WHO) and medical associations. Physicians, scientists, and experts in infectious treatments who formed associations designed to develop more effective and safer treatments, were regularly demonized, harassed, shamed, humiliated, and experience a loss of licensure, loss of hospital privileges and, in at least one case, ordered to have a psychiatric examination.[2 , 65 , 71]\n\nAnthony Fauci was given essentially absolute control of all forms of medical care during this event, including insisting that drugs he profited from be used by all treating physicians. He ordered the use of masks, despite at first laughing at the use of masks to filter a virus. Governors, mayors, and many businesses followed his orders without question.\n\nThe draconian measures being used, masking, lockdowns, testing of the uninfected, use of the inaccurate PCR test, social distancing, and contact tracing had been shown previously to be of little or no use during previous pandemics, yet all attempts to reject these methods were to no avail. Some states ignored these draconian orders and had either the same or fewer cases, as well as deaths, as the states with the most strictly enforced measures. Again, no amount of evidence or obvious demonstration along these lines had any effect on ending these socially destructive measures. Even when entire countries, such as Sweden, which avoided all these measures, demonstrated equal rates of infections and hospitalization as nations with the strictest, very draconian measures, no policy change by the controlling institutions occurred. No amount of evidence changed anything.\n\nExperts in the psychology of destructive events, such as economic collapses, major disasters and previous pandemics demonstrated that draconian measures come with an enormous cost in the form of “deaths of despair” and in a dramatic increase in serious psychological disorders. The effects of these pandemic measures on children’s neurodevelopment is catastrophic and to a large extent irreversible.\n\nOver time tens of thousands could die as a result of this damage. Even when these predictions began to appear, the controllers of this “pandemic” continued full steam ahead. Drastic increases in suicides, a rise in obesity, a rise in drug and alcohol use, a worsening of many health measures and a terrifying rise in psychiatric disorders, especially depression and anxiety, were ignored by the officials controlling this event.\n\nWe eventually learned that many of the deaths were a result of medical neglect. Individuals with chronic medical conditions, diabetes, cancer, cardiovascular disease, and neurological diseases were no longer being followed properly in their clinics and doctor’s offices. Non-emergency surgeries were put on hold. Many of these patients chose to die at home rather than risk going to the hospitals and many considered hospitals “death houses”.\n\nRecords of deaths have shown that there was a rise in deaths among those aged 75 and older, mostly explained by Covid-19 infections, but for those between the ages of 65 to 74, deaths had been increasing well before the pandemic onset.[69] Between ages of 18 and aged 65 years, records demonstrate a shocking hike in non-Covid-19 deaths. Some of these deaths were explained by a dramatic increase in drug-related deaths, some 20,000 more than 2019. Alcohol related deaths also increased substantially, and homicides increased almost 30% in the 18 to 65-year group.\n\nThe head of the insurance company OneAmerica stated that their data indicated that the death rate for individuals aged 18 to 64 had increased 40% over the pre-pandemic period.[21] Scott Davidson, the company’s CEO, stated that this represented the highest death rate in the history of insurance records, which does extensive data collections on death rates each year. Davidson also noted that this high of a death rate increase has never been seen in the history of death data collection. Previous catastrophes of monumental extent increased death rates no more than 10 percent, 40% is unprecedented.\n\nDr. Lindsay Weaver, Indiana’s chief medical officer, stated that hospitalizations in Indiana are higher than at any point in the past five years. This is of critical importance since the vaccines were supposed to significantly reduce deaths, but the opposite has happened. Hospitals are being flooded with vaccine complications and people in critical condition from medical neglect caused by the lockdowns and other pandemic measures.[46 , 56]\n\nA dramatic number of these people are now dying, with the spike occurring after the vaccines were introduced. The lies flowing from those who have appointed themselves as medical dictators are endless. First, we were told that the lockdown would last only two weeks, they lasted over a year. Then we were told that masks were ineffective and did not need to be worn. Quickly that was reversed. Then we were told the cloth mask was very effective, now it’s not and everyone should be wearing an N95 mask and before that that they should double mask. We were told there was a severe shortage of respirators, then we discover they are sitting unused in warehouses and in city dumps, still in their packing crates. We were informed that the hospitals were filled mostly with the unvaccinated and later found the exact opposite was true the world over. We were told that the vaccine was 95% effective, only to learn that in fact the vaccines cause a progressive erosion of innate immunity.\n\nUpon release of the vaccines, women were told the vaccines were safe during all states of pregnancy, only to find out no studies had been done on safety during pregnancy during the “safety tests” prior to release of the vaccine. We were told that careful testing on volunteers before the EUA approval for public use demonstrated extreme safety of the vaccines, only to learn that these unfortunate subjects were not followed, medical complications caused by the vaccines were not paid for and the media covered this all up.[67] We also learned that the pharmaceutical makers of the vaccines were told by the FDA that further animal testing was unnecessary (the general public would be the Guinea pigs.) Incredibly, we were told that the Pfizer’s new mRNA vaccines had been approved by the FDA, which was a cleaver deception, in that another vaccine had approval (comirnaty) and not the one being used, the BioNTech vaccine. The approved comirnaty vaccine was not available in the United States. The national media told the public that the Pfizer vaccine had been approved and was no longer classed as experimental, a blatant lie. These deadly lies continue. It is time to stop this insanity and bring these people to justice.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, Twitter and Facebook. Feel free to repost and share widely Global Research articles.\n\n2. Albright L. Medical nonconformity and its persecution. https://brownstone.org/articles/medical-nonconformaity-and-its-persecution [Last accessed on 2022 Feb 06].\n\n3. Ausman JI, Blaylock RL.editors. The China Virus. What is the truth?. United States: James I. and Carolyn R. Ausman Education Foundation (AEF); 2021. p.\n\n5. Bhakdi S. Presentation of autopsy findings. https://www.brighteon.com/4b6cc929-f559-4577-b4f8-3b40f0cd2f77 Pathology presentation on findings https://pathologie-konferenz.de/en [Last accessed on 2022 Feb 06].\n\n6. Blaylock RL. Covid-19 pandemic: What is the truth?. Surg Neurol Inter. 2021. 12:\n\n7. Blaylock RL. National Health Insurance (Part 1): the socialist nightmare. Aug 19, 2009 https://haciendapublishing.com/national-health-insurance-part-i-the-socialist-nightmare-by-russell-l-blaylock-md [Last accessed on 2022 Feb 06].\n\n8. Blaylock RL. Regimentation in medicine and its human price (part 1 & 2) Hacienda publishing. p.\n\n9. Blaylock RL. When rejecting orthodoxy becomes a mental illness. Aug 15, 2013 https://haciendapublishing.com/when-rejecting-orthodoxy-becomes-a-mental-illness-by-russell-l-blaylock-m-d [Last accessed on 2022 Feb 06].\n\n10. Bloche MG. Corporate takeover of Teaching Hospitals. https://scholarship.law.georgetown.edu/cgi/viewcontent.cgi?referer=https://www.google.com/&httpsredir=1&article=1731&context=facpub [Last accessed on 2022 Feb 06].\n\n12. Breggin PR, Breggin GR.editors. Top Medical Journals Sell their Souls. Breggin PR, Breggin GR. Covid-19 and the Global Predators: We are the Prey. Ithaca, NY: Lake Edge Press; 2021. p. 285-292\n\n14. Bulik BS. The top 10 ad spenders in Big Pharma for 2020. Fierce Pharma Apr 19, 2021 https://www.fiercepharma.com/special-report/top-10-ad-spenders-big-pharma-for-2020 [Last accessed on 2022 Feb 06].\n\n16. Chughtai AA, Stelzer-Braid S, Rawlinson W, Pontivivi G, Wang Q, Pan Y.editors. Contamination by respiratory viruses on outer surface of medical mask used by hospital healthcare workers. BMC Infect Dis. 2019. p.\n\n17. Coleman-Lochner L. U.S. Hospitals pushed to financial ruin as nurses quit during pandemic. Dec 21, 2021 https://www.bloomberg.com/news/articles/2021-12-21/u-s-hospitals-pushed-to-financial-ruin-as-nurses-quit-en-masse [Last accessed on 2022 Feb 06].\n\n18. D’Souza K. Pandemic effects may have lowered baby’s IQs, study says EdSource. https://edsource.org/2021/pandemic-may-have-lowered-baby-iq-study-says/661285. [Last accessed on 2022 Feb 06].\n\n20. Department of Health and Human Services: Part 1. Overview Information. https://grants.nih.gov/grants/guide/rfa-files/RFA-HD-20-013.html [Last accessed on 2022 Feb 06].\n\n21. Durden T.editors. Life Insurance CEO says deaths up 40% among those aged 18 to 64. Tyler Durden Report. 2022. p.\n\n22. Elder C, Schroder AS, Aepfelbacher M, Fitzek A, Heinemann A, Heinrich F. Dying with SARS-CoV-2 infection an autopsy study of the first consecutive 80 cases in Hamberg, Germany. Inter J Legal Med. 2020. 134: 1275-84\n\n24. Gueriero M. Restriction of autopsies during the Covid-19 epidemic in Italy. Prudence or fear? Pathologica. 2020. 112: 172-3\n\n25. Hope JR.editors. Sudden death by “hot lot”—Dr. Michael Yeadon sounds the alarm. The Desert review. 2022. p.\n\n26. Huff E. Idaho doctor reports “20 times increase” in cancer among those “vaccinated” for covid. https://www.naturalnews.com/2021-09-14-idaho-doctor-20times-increase-cancer-vaccinated-covid.html [Last accessed on 2022 Feb 06].\n\n28. James Thorpe interview by Dr. Steve Kirsch. Rumble https://rumble.com/vru732-dr.-james-thorp-on-medical-censorship.html [Last accessed on 2022 Feb 06].\n\n30. Jimenez JVigdor N. Covid-19 news: Over 150 Texas hospital workers are fired or resign over vaccine mandates. https://www.nytimes.com/live/2021/06/22/world/covid-vaccine-coronavirus-mask [Last accessed on 2022 Feb 06].\n\n31. Katz E. Postal service seeks temporary exemption from Biden’s vaccine-or-test mandate. https://www.govexec.com/workforce/2022/01/postal-service-seeks-temporary-exemption-bidens-vaccine-or-test-mandate/360376 [Last accessed on 2022 Feb 06].\n\n32. Kennedy R.editors. The Real Anthony Fauci. Bill Gates, Big Pharma, and the Global War on Democracy and Public Health. Skyhorse Publishing; 2021. p. 24-29\n\n40. Lee M. University of Florida finds dangerous pathogens on children’s face mask. NTD https://www.ntd.com/university-of-florida-lab-finds-dangerous-pathogens-on-childrens-face-masks_630275.html [Last accessed on 2022 Feb 06].\n\n42. Loffredo J. Fully vaccinated are Covid ‘Superspreaders’ Says inventor of mRNA technology. https://childrenshealthdefernce.org/defender/justin-Williams-Robert-Malone-fully-vaccinated-covid-super-spreaders [Last accessed on 2022 Feb 06].\n\n43. Marik PE, Kory P, Varon J, Iglesias J, Meduri GU. MATH+ protocol for the treatment oof SARS-CoV-2 infection: the scientific rationale. Exp rev Ant-infective Ther. 2020. p.\n\n44. McCullough P, Kelly R, Ruocco G, Lerma E, Tumlin J, Wheeland KR. Pathophysiological basis and rationale for early outpatient treatment of SARS-CoV-2 (COVID-19) Infection. Amer J Med. 2021. 134: 16-22\n\n46. McCullough P. “We’re in the middle of a major biological catastrophe”: Covid expert Dr. Peter McCullough. https://www.lifesitenews.com/news/were-in-the-middle-of-a-major-biological-catastrophe-top-covid-doc-mccullough/?_kx=9EtupqemhhFXJ1kgCo9W3xUNfwrkqB5nT7V2H15fUnA%3D.WXNMR7 [Last accessed on 2022 Feb 06].\n\n47. McGovern C. Thousands report developing abnormal tumors following Covid shots. Nov 1, 2021 https://www.lifesitenews.com/news/thousands-report-developing-abnormal-tumors-following-covid-shots [Last accessed on 2022 Feb 06].\n\n48. Mercola J. Bill Gates and Anthony Fauci: a ‘formidable, nefarious’ partnership. https://childrenshealthdefense.org/defender/rfk-jr-the-real-anthony-fauci-bill-gates [Last accessed on 2022 Feb 06].\n\n51. Muoio D. How many employees have hospitals lost to vaccine mandates?. https://www.fiercehealthcare.com/hospitals/how-many-employees-have-hospitals-lost-to-vaccine-mandates-numbers-so-far [Last accessed on 2022 Feb 06].\n\n52. Nalivaeva NN, Turner AJ, Zhuravin IA. Role of prenatal hypoxia in brain development, cognitive functions, and neurodegeneration. Front Neurosci. 2018. p.\n\n53. Nicole Sirotek shares what she saw on the front lines in NYC. # Murder. https://rumble.com/vt7tnf-registered-nurse-nicole-sirotek-shares-what-she-saw-on-the-front-lines-in-n.html [Last accessed on 2022 Feb 06].\n\n54. Noether MMat S. Hospital merger benefits: Views from hospital leaders and econometric analysis. Jan, 2017 https://www.aha.org/guidesreports/2017-01-24-hospital-merger-benefits-views-hospital-leaders-and-econometric-analysis [Last accessed on 2022 Feb 06].\n\n55. Nurse Colette Martin testimony to Louisiana House of Representatives. https://www.youtube.com/watch?v=cBwnIRUav5I [Last accessed on 2022 Feb 06].\n\n56. Nurse Dani: It’s the Covid-19 hospital protocols are killing people. https://rumble.com/vqs1v6-nurse-dani-its-the-covid-19-hospital-protocols-are-killing-people.html [Last accessed on 2022 Feb 06].\n\n57. Parpia R. Mayo Clinic fires 700 employees for refusing to get Covid-19 vaccinations. https://thevaccinereaction.org/2022/01/mayo-clinic-fires-700-employees-for-refusing-to-get-covid-19-vaccinations [Last accessed on 2022 Feb 06].\n\n58. Pomara C, Li Volti G, Cappello F. Covid-19 deaths: are we sure it is pneumonia? Please, autopsy, autopsy, autopsy!. J Clin Med. 2020. p.\n\n59. .editors. Post Editorial Board Facebook admits the truth: “Fact checks” are just (lefty) opinion. New York Post. p.\n\n60. Rancourt DG. Mask don’t work. A review of science relevant to the covid-19 social policy. https://archive.org/details/covid-censorship-at-research-gate-2 [Last accessed on 2022 Feb 06].\n\n61. Redshaw M.editors. As reports of injuries after Covid vaccines near 1 million mark. CDC, FDA clear Pfizer, Moderna boosters for all adults. p.\n\n62. Roche D.editors. Members of Congress and their staff are exempt from Biden’s vaccine mandate, Newsweek 9/10/21 Boston Herald Editorial Staff. Editorial: Political elites exempt from vax mandates. Boston Herald. 2021. p.\n\n63. Ross E. How drug companies’ PR tactics skew the presentation of medical research. https://www.theguardian.com/science/2011/may/20/drug-companies-ghost-writing-journalism [Last accessed on 2022 Feb 06].\n\n64. Saul S. Ghostwriters used in Vioxx studies, article says. April 15, 2008 https://www.fpparchive.org/media/documents/public_policy/Ghostwriters%20Used%20in%20Vioxx%20studies_Stephanie%20Saul_Apr%2015,%202008_The%20New%20Times.pdf [Last accessed on 2022 Feb 06].\n\n65. Saxena V. Doctors loses medical license. Ordered to have Psych Eval for Ivermectin Scrits, Sharing Covid “misinformation”. Available from: https://bizpacreview.com/2022/01/16/doctor-loses-license-orderedto-have-psych-eval-for-prescribing-ivermectin-sharining-covid-falsehoods-1189313. [Last accessed on 2022 Feb 06].\n\n66. Schwab K, Malleret T.editors. The Covid-19 Pandemic and the Great Reset. Forum Publishing 2020 World Economic Forum. Cologny/Geneva: p.\n\n67. Sen. Ron Johnson on Covid-19 vaccine injuries to test subjects. https://www.youtube.com/watch?v=6mxqC9SiRh8 [Last accessed on 2022 Feb 06].\n\n70. US Medical, Scientific, Patient and Civic Organization Funding Report: Pfizer: Fourth Quarter 2010. https://cdn.pfizer.com/pfizercom/responsibility/grants_contributions/pfizer_us_grants_cc_q4_2010.pdf [Last accessed on 2022 Feb 06].\n\n71. Vivek Saxena. Doctors loses license, ordered to have psych eval for Ivermectin scrits, sharing Covid ‘misinformation’. https://www.bizpacreview.com/2022/01/16/doctor-loses-license-ordered-to-have-psych-eval-for-prescribing-ivermectin-sharing-covid-falsehoods-1189313.\n\n72. Westendorf AM. Hypoxia enhances immunosuppression by inhibiting CD4+ effector T cell function and promoting Treg activity. Cell Physiol Biochem. 2017. 41: 1271-84", "opengraph": {"locale": "en_US", "type": "article", "title": "The COVID Pandemic and the mRNA Vaccine: What Is the Truth? Dr. Russell L. Blaylock - Global Research", "description": "The COVID-19 pandemic is one of the most manipulated infectious disease events in history. Official lies in an unending stream led by government bureaucracies, medical associations, medical boards, the media, and UN agencies.", "url": "https://www.globalresearch.ca/covid-update-what-truth/5779037", "site_name": "Global Research", "article:tag": "COVID-19", "article:section": "English", "article:published_time": "2023-04-09T12:00:07+00:00", "article:modified_time": "2023-04-09T13:15:39+00:00", "updated_time": "2023-04-09T13:15:39+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/08/virus-evolution-101-delta-variant-feature-800x417.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/08/virus-evolution-101-delta-variant-feature-800x417.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Media Disinformation", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://www.facebook.com/Global-Research-109788198342383", "https://www.globalresearch.ca/covid-update-what-truth/5779037/screen-shot-2022-05-01-at-5-11-30-pm", "https://www.globalresearch.ca/information-war-internet-archive-rewrite-history-alerts-sites-have-been-fact-checked/5728924/fact-check-corbett-1024x573", "https://www.globalresearch.ca/the-real-anthony-fauci-sells-sells-one-million-copies-while-heavily-censored/5775748/real-anthony-fauci-2", "https://www.globalresearch.ca/medical-doctor-director-diagnostics-laboratory-presents-cures-covid-exposes-dangers-covid-vaccines/5741876/dr-ryan-cole", "https://www.globalresearch.ca/diamond-mine-data-insurance-companies-report-40-increase-premature-non-covid-deaths/5766433/insurance-companies-premature-deaths-up-feature-800x417", "/cdn-cgi/l/email-protection#50123c31296663606710373d31393c7e333f3d", "https://surgicalneurologyint.com/surgicalint-articles/covid-update-what-is-the-truth/", "https://www.globalresearch.ca/author/russell-blaylock", "https://surgicalneurologyint.com/surgicalint-articles/covid-update-what-is-the-truth/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-09T12:00:07+00:00"}