{"result_id": "134002", "URL": "https://www.globalresearch.ca/covid-deaths-up-39-after-vaccines-rolled-out-ontario-canada/5815576", "timestamp": "2023-04-25 15:17:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-deaths-up-39-after-vaccines-rolled-out-ontario-canada/5815576", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "COVID Deaths Up 39% After Vaccines Rolled Out in Ontario Canada", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nClick the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThe official government numbers show COVID deaths are up in Ontario by nearly 40% since the vaccines rolled out and hospitalizations due to COVID are up by 31%!\n\nBoth hospitalization and deaths from COVID were up dramatically.\n\nYou can see it yourself (see the red box below):\n\nDeaths went from 5,485 in 2021 to 7,625 in 2022.\n\nCould that be statistical noise? Not likely. Sigma is 74 so it’s a 29-sigma increase. In other words, this increase in death didn’t happen by chance; something caused it.\n\nThe data from the Ontario website\n\nWe know the vax makes you more likely to get COVID. If you had 3 shots, the Cleveland Clinic study showed you are about 2.5X more likely to get COVID. So that big spike in cases in 2022 is totally expected: it was our own doing. The more people who got COVID, the more people who died from COVID.\n\nYou’re less likely to die from a COVID case in 2022 than in 2021 because the variant is less deadly, not because the vaccine worked.\n\nWas this because the virus was more deadly in 2022? I don’t think so.\n\nLet’s look the world’s least vaccinated countries: Yemen, Haiti, and PNG. As you can see, deaths are way down in 2022 because the variants are less lethal:\n\nThese numbers show that the “it would have been worse if people weren’t vaccinated” excuse won’t hold any water.\n\nFurthermore, we know the vaccines are super deadly. Consider the following recent post which is based on CDC data:\n\nIf it wasn’t the vaccine that caused this dramatic rise, what caused it?\n\nAlso, even the US data shows a decrease in 2022 vs. 2021, so it’s hard for Ontario to argue that the virus was more deadly in 2022:\n\nThis visualization was done on the CDC website on the Weekly Provisional Counts of Deaths page.\n\nSo there is no rock they can hide under.\n\nOf course, this is embarrassing for the narrative which is why nobody is talking about it.\n\nEven Professor David Fisman is silent about the report. I reached out to him for an explanation and he ignored it, exactly as expected.\n\nThis is why there is no press coverage of this: because the numbers are inexplicable if the vaccine worked.\n\nI just thought you’d like to know.\n\nIt’s unfortunate that the mainstream press isn’t covering this.\n\nI can’t figure out why. The press is supposed to report this and get comments from both sides. Instead, they ignore the story.\n\nA nearly 40% increase in COVID deaths and the mainstream press ignores the story!?! WTF is going on here?\n\nBut I thought people would want to know the truth.\n\nNote to readers: Please click the share button above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID Deaths Up 39% After Vaccines Rolled Out in Ontario Canada - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Click the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share …", "url": "https://www.globalresearch.ca/covid-deaths-up-39-after-vaccines-rolled-out-ontario-canada/5815576", "site_name": "Global Research", "article:tag": "Ontario", "article:section": "English", "article:published_time": "2023-04-12T12:20:11+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/08/fully-vaccinated-covid-deaths-thmb.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/08/fully-vaccinated-covid-deaths-thmb.jpg", "image:width": "380", "image:height": "214"}, "tags": ["Media Disinformation", "Canada", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.publichealthontario.ca/-/media/Documents/nCoV/epi/2023/03/comparison-covid-19-hospitalizations-deaths-epi-summary.pdf?rev=c9518fca8cac4f199f088154e4012853&sc_lang=en", "https://stevekirsch.substack.com/p/very-large-cleveland-clinic-study", "https://data.cdc.gov/NCHS/Weekly-Provisional-Counts-of-Deaths-by-State-and-S/muzy-jte6", "https://stevekirsch.substack.com/p/meet-professor-david-fisman-of-canada", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://stevekirsch.substack.com/p/covid-deaths-up-39-after-vaccines?utm_source=substack&utm_medium=email", "https://www.globalresearch.ca/author/steve-kirsch", "https://stevekirsch.substack.com/p/covid-deaths-up-39-after-vaccines?utm_source=substack&utm_medium=email", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-12T12:20:11+00:00"}