{"result_id": "134027", "URL": "https://www.globalresearch.ca/urgent-deaths-england-surge-again/5806106", "timestamp": "2023-04-25 15:17:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/urgent-deaths-england-surge-again/5806106", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Covid Vaccine: Deaths in England Surge Again", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nThe death surge in highly mRNA vaccinated countries continues this winter.\n\nMeanwhile, less-vaccinated countries are reporting normal or below normal mortality rates.\n\nThe latest bad news for vaccine advocates came from the British government this morning.\n\nThe Office of National Statistics said it had registered 17,381 deaths in England and Wales in the week ended Friday, January 13. That figure is about 20 percent more than the five-year average – and 30 percent more than longer-term averages – for the year’s second week.\n\nOnly about 650 of the deaths had Covid as an underlying cause, the government said, so most of the excess was not related to Covid.\n\nThe British data confirms recent trends all over Western Europe, including the Netherlands and Switzerland.\n\nMost wealthy countries that relied on mRNA Covid shots and boosters had non-Covid deaths well above normal in 2022. The problem has worsened in recent weeks, in the wake of the fall Omicron booster campaigns.\n\nWith recent upward revisions, Europe will now probably report more excess deaths in 2022 than either 2020, before Covid vaccines were available, or 2021, before boosters began in earnest.\n\nNo connection has yet been proven.\n\nBut in contrast, South Africa and Bulgaria – two middle-income countries with much lower levels of Covid vaccinations – have reported normal or below-normal deaths for several months.\n\nWhile the United States lags substantially in reporting complete death figures, many European countries post them within two to three weeks.\n\nBritain is among the fastest, as well as very highly vaccinated.\n\nAbout 90 percent of English adults received mRNA Covid jabs from Pfizer or Moderna or AstraZeneca’s DNA shots, according to government data.\n\nAbout 70 percent of English adults then received a booster, and about 60 percent of those over 50 received the “bivalent” booster against Omicron in fall 2022. (Many adults over 75 also received a spring 2022 booster, meaning they have now taken five shots.) The boosters have been almost exclusively mRNAs.\n\nYet deaths in Britain have recently soared.\n\nDeaths in Bulgaria have fallen far below their 2020 and 2021 levels – and more recently even below the 2015-2019 averages.\n\nBulgaria had among the lowest vaccination rates anywhere in the world, with only about 30 percent of adults jabbed and under 15 percent receiving even one booster. The country had widespread Covid outbreaks and high Covid deaths in 2020 and 2021.\n\nBut – as was widely predicted when Covid began and before the mRNA vaccines were introduced – it now appears to be running a deficit of deaths. The most likely explanation is that many of the people Covid killed were very old and sick and would have died within a year or two.\n\nThe Bulgarian data, and similar figures from South Africa, also appear to end “long Covid” as an explanation for the excess deaths in the mRNA countries. Both countries had nearly everyone exposed to the coronavirus.\n\nI normally try to end these pieces with a clever kicker, but I don’t have one. And I want to get this out as quickly as possibly, especially since American public health bureaucrats STILL will not lay off boosters.\n\nSo that’s it. Thanks for reading.\n\nNote to readers: Please click the share buttons above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccine: Deaths in England Surge Again - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles. *** The death surge in highly mRNA vaccinated countries continues …", "url": "https://www.globalresearch.ca/urgent-deaths-england-surge-again/5806106", "site_name": "Global Research", "article:tag": "vaccine deaths", "article:section": "English", "article:published_time": "2023-02-04T14:58:26+00:00", "article:modified_time": "2023-02-04T15:43:42+00:00", "updated_time": "2023-02-04T15:43:42+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2022/11/mrna-vaccine.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2022/11/mrna-vaccine.jpg", "image:width": "853", "image:height": "480"}, "tags": ["Europe", "Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/weeklyprovisionalfiguresondeathsregisteredinenglandandwales", "https://www.cbs.nl/en-gb/figures/detail/70895ENG", "https://www.bfs.admin.ch/bfs/en/home/statistics/health/state-health/mortality-causes-death.html", "https://coronavirus.data.gov.uk/details/vaccinations?areaType=nation&areaName=England", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/bulletins/deathsregisteredweeklyinenglandandwalesprovisional/weekending13january2023", "https://www.nsi.bg/en/content/18121/basic-page/deaths-bulgaria-weeks", "https://www.dr-rath-foundation.org/2022/11/mainstream-media-publishes-article-on-physician-who-filmed-structures-resembling-circuitry-and-microchips-in-pfizer-covid-19-vaccine/", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://alexberenson.substack.com/p/urgent-deaths-in-england-surge-again", "https://www.globalresearch.ca/author/alex-berenson", "https://alexberenson.substack.com/p/urgent-deaths-in-england-surge-again", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-02-04T14:58:26+00:00"}