{"result_id": "134045", "URL": "https://www.globalresearch.ca/hemorrhagic-strokes-brain-bleeds-young-people-brain-blood-vessel-damage-caused-by-covid-19-mrna-vaccine-spike-protein-or-turbo-cancer-16-tragic-stories/5815332", "timestamp": "2023-04-25 15:17:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/hemorrhagic-strokes-brain-bleeds-young-people-brain-blood-vessel-damage-caused-by-covid-19-mrna-vaccine-spike-protein-or-turbo-cancer-16-tragic-stories/5815332", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Hemorrhagic Strokes (Brain Bleeds) in Young People. Brain Blood Vessel Damage Caused by COVID-19 mRNA Vaccine Spike Protein", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name.\n\nClick the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\n17 year old football player Andrew Dodson was “participating in a scrimmage where he was injured”. “He was participating in a normal football action. He got tackled and hit his head on the ground.” (click here)\n\nDetroit, MI – 25 year old Alona White died of brain bleed 5 days after giving birth to her 2nd child on March 13, 2023\n\nThe sudden and tragic loss of Alona White, a 25-year-old Michigan mother, has left her family searching for answers. “She was 25, perfectly healthy.” (click here)\n\nGeorgia – 21 year old University student Liza Burke had a brain bleed on March 10, 2023 while on vacation in Mexico\n\nI wrote a substack article about this girl’s brain bleed. (click here)\n\nIt turns out she may have a turbo cancer: “a grade 4 astrocytoma glioma, a malignant & aggressive tumor located on brain stem that grows rapidly.” (click here)\n\nUK – 13 year old girl Julia Chavez died from a brain bleed caused by new leukemia dx, on Feb.13, 2023 ( click here\n\nToronto – 20 year old student Maicol Antonio Londoño Sastre had a hemorrhagic stroke on Feb. 6, 2023\n\n20 year old Colombian student Maicol Antonio Londoño Sastre was studying English in Toronto. On Feb. 6, 2023 he was at a gathering with friends when he lost consciousness. He was diagnosed with a hemorrhagic stroke. (click here)\n\nColumbia, SC – 13 year old Daniel Ahtonen had a hemorrhagic stroke in school on Feb. 6, 2023\n\nColumbia, SC – on Feb.6, 2023, 13 year old Furman Middle School student Daniel Ahtonen started having trouble speaking at school, he was taken to the hospital where he was diagnosed with a 5 cm aneurysm and a hemorrhagic stroke. (click here)\n\nSao Paulo, Brazil – 13 year old reality show participant Arthur Singer died of hemorrhagic stroke on April 6, 2023\n\nPennsburg, PA – EMT Jay Miles died after suffering a hemorrhagic stroke while on a call on March 13, 2023\n\nThe stroke occurred after Miles and another paramedic Kevin Bennett loaded the patient onto a litter. (click here)\n\nCrawford, TX – 18 year old Luis Rodgriguez suffered a brain bleed during a football game on Dec.8, 2022\n\n“He tried to make a tackle and he was on the ground, and he tried to stand up and he started stumbling around…he kept dropping.” (click here)\n\nScottsdale, AZ – 47 year old Phoenix Suns chaplain had a massive hemorrhagic stroke on Nov. 14, 2022\n\nI could not think, talk — nothing,” Hearn explains. “I suffered a brain aneurysm that led to a hemorrhagic stroke in the basal ganglia area of my brain…” (click here)\n\nUtopia, Texas – 16 year old Johnny Cazares had a brain bleed on July 18, 2022 and crashed his truck\n\nHis truck was wrecked and the crash broke his femur, collapsing his lung and also caused a traumatic brain injury on top of his brain bleed. (click here)\n\nVancouver, BC – 25 year old recording engineer Olivia Quan died from a brain bleed on July 1, 2022\n\nVancouver, BC – 25 year old recording engineer Olivia Quan died on July 1, 2022 after suffering “a brain bleed while working in bed”, Monarch Studios from Vancouver, Canada revealed. (click here)\n\n“She was home and working in her bed at the time it happened. “I hope it helps people to know that Olivia was happy and healthy right until the end.” Her employer, Monarch Studios, claims a 100% employee COVID-19 vaccination rate. (click here)\n\nChef Hideyuki Tanaka, age 40, died of brain hemorrhage on Apr. 17, 2022, collapsed after gym workout ( click here\n\n43 year old violin teacher at a British International school died of a hemorrhagic stroke Feb. 9, 2022 ( click here\n\nIreland – Roy Butler: 23-year-old Irish soccer player suffered massive “brain bleed,” died four days after COVID-19 J&J vaccine, on Aug. 17, 2021\n\n23 year old Irish soccer player Roy Butler received the COVID-19 J&J vaccine on Friday, Aug.13, 2021. He suffered severe headaches within 1 hour. By Aug.14, he was vomiting & having convulsions. He was in a coma by Aug.16. (click here)\n\nIt appears the young man had a hemorrhagic stroke and/or ruptured brain aneurysm within a day or two based on description from his aunt.\n\nManitoba – 23 year old Jackson Troy Reimer is suing AstraZeneca after suffering a hemorrhagic stroke 6 days after COVID-19 vaccine\n\nJackson Troy Reimer, now 23, was “in excellent health” before getting vaccinated while working at Whistler Blackcomb ski resort in British Columbia in 2021 (click here).\n\nBut six days after getting his shot, he started feeling dizzy, losing his vision and having severe headaches. A CT scan at Vancouver General Hospital found Reimer had a hemorrhagic stroke.\n\nHe’s now legally blind and has other symptoms related to mental focus and concentration, memory loss, mental impairment and obsessive compulsive disorder.\n\nCOVID-19 mRNA vaccine spike protein is expressed in blood vessels, and the ensuing inflammatory reaction damages these blood vessels. In the brain, this can either result in a brain aneurysm, or simply a focal weakness, both of which are at high risk of rupture and bleeding, which is often fatal.\n\nBrain bleeds can also be caused by COVID-19 mRNA vaccine induced turbo cancers that grow extremely rapidly, damaging adjacent blood vessels as they grow.\n\nNote to readers: Please click the share button above. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nDr. William Makis is a Canadian physician with expertise in Radiology, Oncology and Immunology. Governor General’s Medal, University of Toronto Scholar. Author of 100+ peer-reviewed medical publications.\n\nGet yours for FREE! Click here to download.\n\nWe encourage you to support the eBook project by making a donation through Global Research’s DonorBox “Worldwide Corona Crisis” Campaign Page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hemorrhagic Strokes (Brain Bleeds) in Young People. Brain Blood Vessel Damage Caused by COVID-19 mRNA Vaccine Spike Protein - Global Research", "description": "All Global Research articles can be read in 51 languages by activating the Translate Website button below the author’s name. To receive Global Research’s Daily Newsletter (selected articles), click here. Click the share button above to email/forward this article to your friends and colleagues. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share …", "url": "https://www.globalresearch.ca/hemorrhagic-strokes-brain-bleeds-young-people-brain-blood-vessel-damage-caused-by-covid-19-mrna-vaccine-spike-protein-or-turbo-cancer-16-tragic-stories/5815332", "site_name": "Global Research", "article:section": "English", "article:published_time": "2023-04-10T13:14:14+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2023/01/covid-vaccine.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Science and Medicine"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.wkyt.com/2023/04/03/pulaski-county-high-school-football-player-dies/", "https://www.newsonyx.com/family-demands-answers-after-25-year-old-detroit-mom-dies-of-brain-bleed-days-after-giving-birth/", "https://makismd.substack.com/p/georgia-college-student-on-life-support", "https://www.dailymail.co.uk/news/article-11939215/Mother-UGA-senior-diagnosed-stage-4-brain-tumor-prepared-worst-case-scenario.html", "https://www.dailymail.co.uk/news/article-11760103/Georgia-girl-13-went-ER-headache-dies-hours-later-undiagnosed-leukemia.html", "https://www.cbc.ca/news/canada/toronto/colombian-student-suffers-stroke-1.6787033", "https://www.wltx.com/article/news/local/awake-and-talking-after-surviving-a-stroke/101-bcd31c5f-e49b-45a8-bd03-068afbd75718", "https://www.uol.com.br/splash/noticias/2023/04/07/arthur-singer-ator-e-ex-participante-de-reality-show-morre-aos-13-anos.htm", "https://www.ems1.com/lodd-line-of-duty-deaths/lodd-pa-firefighter-emt-dies-weeks-after-suffering-stroke-during-medical-call-lowmKw8RRybL8DWd/", "https://www.kcentv.com/video/sports/crawford-pirates-football-team-rallies-together-for-teammate/500-fb3c8c21-ad24-4868-aa7e-2bec747aa328", "https://www.azfamily.com/2023/01/13/suns-chaplain-valley-pastors-miraculous-recovery-after-massive-stroke/", "https://www.ksat.com/news/local/2023/02/17/utopia-high-school-student-survives-brain-bleed-that-caused-him-to-wreck-his-truck/", "https://euroweeklynews.com/2022/07/10/cause-death-recording-engineer-olivia-quan-died-suddenly/", "https://monarchstudios.com/contact/", "https://www.asiaone.com/lifestyle/ue-square-mobomoga-izakaya-chef-hideyuki-tanaka-dies-suddenly-40-was-planning-open-own-restaurant", "https://uk.sports.yahoo.com/news/tributes-gifted-music-teacher-colchester-154500858.html", "https://thecovidblog.com/2021/08/23/roy-butler-23-year-old-irish-soccer-football-player-suffers-massive-brain-bleed-dead-four-days-after-experimental-johnson-johnson-viral-vector-dna-injection/", "https://www.cbc.ca/news/canada/manitoba/lawsuit-astrazeneca-covid-19-vaccine-1.6787374", "https://childrenshealthdefense.org/defender/fda-advisers-bivalent-vaccine/", "https://docsend.com/view/yvbmfa5hxhgjughq", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://makismd.substack.com/p/hemorrhagic-strokes-brain-bleeds?utm_source=post-email-title&publication_id=1385328&post_id=113539244&isFreemail=true&utm_medium=email", "https://www.globalresearch.ca/author/william-makis", "https://makismd.substack.com/p/hemorrhagic-strokes-brain-bleeds?utm_source=post-email-title&publication_id=1385328&post_id=113539244&isFreemail=true&utm_medium=email", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-10T13:14:14+00:00"}