{"result_id": "134037", "URL": "https://www.globalresearch.ca/covid-19-vaccines-lead-to-new-infections-and-mortality-the-evidence/5746393", "timestamp": "2023-04-25 15:17:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.globalresearch.ca/covid-19-vaccines-lead-to-new-infections-and-mortality-the-evidence/5746393", "encoding": "UTF-8"}, "image": null, "domain": "www.globalresearch.ca", "title": "Covid-19 Vaccines Lead to New Infections and Mortality: The Evidence is Overwhelming", "cleaned_text": "First published by Global Research on May 27, 2021\n\nThis article by Dr Gérard Delépine was first published in French on our French language website mondialisation.ca\n\nThe English text below is an AI Translation with some minor edits by Global Research.\n\nThis article demonstrates unequivocally that mortality and morbidity has increased dramatically as a result of the vaccine. The incidence of Covid positive cases has also increased.\n\n“And everywhere they have been followed by a dramatic rise in new infections and mortality for several weeks or months”\n\nDr Delépine carefully analyses the pre and post vaccine trends for 14 countries in major regions of the World.\n\nThe latest official figures (September 15, 2021) point to approximately:\n\n40,666 mRNA vaccine reported and registered deaths in the EU, UK and US (combined) and\n\nBut only a small fraction of the victims or families of the deceased will go through the tedious process of reporting vaccine related deaths and adverse events to the national health authorities.\n\nThose death and injury figures (EU, UK, US) SOFAR are at least ten times higher than the official reported cases.\n\n410,000 deaths, 66 million injuries out of a population of approximately 850 million.\n\nMoreover, the health authorities are actively involved in obfuscating the deaths and injuries resulting from the mRNA “vaccine”, while inflating the number of Covid-19 related deaths. (“autopsies not required”).\n\nIronically, not only does Pfizer have a criminal record with the US Department of Justice for “fraudulent marketing”, the EU Commission has chosen Pfizer BioNTech as its “Reliable Partner” for the production of 1.8 billion doses over the next 3-4 years, in a contract which is currently under negotiation.\n\nTwo months ago, we tried to alert people to the paradoxical results of the covid19 vaccines by publishing the pre- and post-vaccination mortality curves for Israel and Great Britain which already showed that these vaccinations were followed by ‘a considerable increase in contamination and mortality lasting 6 to 8 weeks after the start of vaccination.\n\nSince this period, vaccination campaigns have spread worldwide even to countries where covid was not present. And everywhere they have been followed by a dramatic rise in new infections and mortality for several weeks or months.\n\nHow many deaths and severe accidents will it take for executives, WHO, health agencies FDA, EMA among others, to look at the proven results of this experimental pseudo-vaccination in the real world and derive the results from it? consequences ?\n\nReminder of the proven facts published by the WHO\n\nWe present below the epidemic curves of the most vaccinated countries as published by the WHO (with our comments in red).\n\nThe vaccination campaign, using the Chinese vaccine and the Indian Astra Zeneca, began at the end of January 2021. So far, after ten months of the epidemic, the country had 270,092 confirmed cases and 2017 deaths and the daily average of new cases s ‘amounted to 350.\n\nFour months after vaccination began, the epidemic has exploded with a current average of 8,000 new cases daily. As of May 22, Nepal had 497,052 (+ 90%) confirmed cases and 6,024 deaths (+ 200%.)\n\nThe vaccination campaign using the Chinese vaccine began in the first week of March. So far, since the start of the epidemic, the country has only recorded 25,000 infected and 83 deaths attributed to Covid19.\n\nSince the start of vaccination, in 2 months, the number of infected has multiplied by 5 (123,066 on 22/5) and that of deaths by 9 (735 on 22/5).\n\ncountry severely affected by the disease, the epidemic began to decline sharply until the start of the vaccination campaign on February 18, 2021.\n\nSince then, the number of daily infections has quadrupled and daily mortality has multiplied by 3\n\nVaccination began on December 24 and a total of nearly 17.1 million doses of the vaccine have been administered to less than 20 million people. But despite the highest vaccination coverage rate in South America and harsh confinements, the number of daily infections and the number of deaths remain close to triple what they were before the start of the vaccination campaign …\n\nVaccination began on January 18 as weekly mortality stabilized around 7,000\n\nIn the United Arab Emirates, a country of 10.5 million inhabitants\n\nThe vaccination campaign, which began at the end of February, was followed by a sharp increase in weekly contaminations, which rose from 25,576 on February 25 to 62,265 a month later, before gradually falling back to the pre-vaccination level.\n\nIn two and a half months, Hungary has doubled its figures of infected (400,000 to 800,000) and deaths (from 14,000 to 29,000) reached after 11 months of epidemic\n\nThe vaccination campaign began at the end of December at a time when the epidemic was waning, and according to official data from May 4, 21 Bucharest has the highest vaccination rate in the country with 31.2% of its eligible population vaccinated. . But shortly after the start of vaccination, the number of daily infections and mortality increased.\n\nBefore vaccination after ten months of the epidemic, Romania had 618,000 infected and 15,000 dead. After five months of vaccination, she counts twice as much.\n\nhad only 3 deaths before vaccination and 32 since vaccination\n\n: vaccination of the entire population was followed by an 800% increase in mortality from 10 to 94)\n\nWhat can be deduced from these official data. Hypotheses\n\nVaccination advocates claim vaccinations in Israel and Britain have been successful, as current, daily contaminations and mortality are low.\n\nBut these apparent successes correspond in fact to the disappearance of a large part of the people at risk (the “harvesting ”) achieved by vaccination and to the spontaneous regression of the disease observed also in countries with little vaccination.\n\nIn these two countries, the mortality attributed to Covid increased sharply for 4 to 6 weeks, equaling all the deaths in 2020. The covid per vaccination mortality curve in Israel is demonstrative.\n\nThe “harvest” of 1,404 people in January and 949 others in February, the equivalent of a full year of Covid mortality without a vaccine (the year 2020) sharply reduced the number of Israelis at risk, resulting in de facto probably a decrease in the apparent risk of mortality in the coming year, in this age group.\n\nBut along with this decrease in its original target, the virus has mutated to attack other segments of society and especially younger age groups.\n\nIn November 2020, data from the Israeli Ministry of Health revealed that Israel had detected 400 cases of the coronavirus in children under the age of two. In February 2021, that number increased to 5,800.\n\nThe same “harvesting ” has been observed in Great Britain. As the Covid19 threatens only a small part of the population (the elderly with comorbidity), the peri-vaccination disappearance of a large part of this population (as much as the deaths of the year 2020) at risk, mathematically reduces mortality observed, at least transiently.\n\nSince the British vaccination campaign, the average mortality per million inhabitants in Great Britain (934 / M) is more than double that of the Netherlands (411 / M).\n\nThe natural regression of the epidemic\n\nAlso explains the drop in mortality as shown in the comparison between the highly vaccinated Great Britain and the very poorly vaccinated Netherlands\n\nThe mortality curves per million inhabitants follow the same temporality in these two neighboring countries. That of the United Kingdom suffers from a much higher peri-vaccination peak, the current mortality in the Netherlands is slightly higher reflecting the absence of the English “harvest”.\n\nThe current vaccination, accelerator of the epidemic and mortality?\n\nThe review of the main countries which have adopted broad vaccination shows that in real populations, generalized vaccination behaves more as an accelerator of the epidemic and of mortality than as a prevention thereof.\n\nIn all highly vaccinated countries, the mortality recorded during the two months after vaccination is equal to or exceeds that of the whole of 2020.\n\nThe tests of these vaccines were insufficient, without hindsight, because they are in progress. The first results are promised for early 2023.\n\nNone of them pointed out the possibility of a possible increase in contamination and mortality, which fortunately appear to be transitory. They are not very informative on the more or less serious side effects, such as the frequency of early vascular accidents in the days following vaccination, or the multiplication of miscarriages and menstrual disorders in women for example and of course the possible more complications. late in the medium and long term.\n\nThe race for accelerated vaccination at all costs could ultimately be ineffective for popular confidence in all vaccinations. There’s no point in running, you have to start on time, La Fontaine would have said. But new billionaires like the CEO of Moderna probably don’t think like the turtle in the Fable who has already amassed a fortune.\n\nTHE FUTURE IS EARLY TREATMENTS MASTERED BY FIELD PHYSICIANS\n\nTransparent studies are essential to understand the mechanism of these transient worsening of the epidemic after vaccination and to deduce possible preventive measures, if a new outbreak occurs.\n\nEspecially since the future, after this vaccine hecatomb, remains very uncertain. The leaders who have violated the bases of medicine and democracy by imposing express vaccination without respecting the usual procedures for the safety and effectiveness of drugs placed on the market, all find themselves promising their populations early treatment for future waves, thus proving, like Boris Johnson, that they no longer believe in the vaccination they have imposed.\n\nMEDICINE SHOULD NOT BE DECIDED BY POLICY\n\nHealth policy should no longer be imposed or guided by often inaccurate simulations (and their displays sometimes influenced by policies as English scientists admit), but should be based on respect for democracy and clinical experience. field physicians possibly guided by simple non-binding recommendations.\n\nAll data must be transparent like the figures of the Sentinels Network which reflects the number of real patients, consulting doctors for clinical signs. Much more reliable than the perennial contamination figures based on unreliable PCR tests.\n\nFREEDOM TO CARE AND BE CAREFUL\n\nSurtout les médecins doivent être autorisés à traiter librement leurs patients avec tous les moyens à leur disposition sans diktat bureaucratique, et ce dès le début de la maladie, comme dans toute autre pathologie. Dès le début de l’épidémie, les traitements précoces basés sur les antibiotiques, macrolides, l’hydroxychloroquine, l’Artemisia, les vitamines D et C et le zinc, puis l’ivermectine étaient connus et diabolisés par les médecins de plateau au service de nouvelles drogues hors de prix comme le remdésivir, et surtout des futurs vaccins.\n\nThe political choice to prohibit the free choice of treatment by the authorities has led in several countries of the world, including France, to numerous deaths, at least part of which was preventable. The ongoing trials will give voice to the families of the victims without repairing the irreparable loss of a loved one.\n\nTotalitarianism, systematic censorship and persecution of opponents and the suppression of fundamental freedoms in science, medicine and economics only lead to more or less long-term catastrophes, including for those responsible for them.\n\nIt is high time to go back to the proven facts and to their critical examination without a priori. In all countries, experimental vaccinations were followed by an increase in contamination and mortality attributed to Covid19 and the appearance of mutants. As long as the phenomenon has not been elucidated, a moratorium on anticovid vaccinations is essential and urgent.\n\n[1] Great Britain: actual results of the anti-Covid-19 vaccination as of March 29 – (ripostelaique.com)\n\n[2] Analysis of the results of the anti-Covid19 vaccination in Israel as of February 23, 2021 – Nouveau Monde (nouveau-monde.ca)\n\n[4] A Pyrrhic victory is a tactical victory, achieved at the cost of losses so heavy to the winner that they compromise his chances of final victory.\n\n[5] F Gobert Since we were vaccinated (anticovid), the average daily mortality has increased in 13 countries out of 14 Agoravox https://www.agoravox.fr/actualites/sante/article/depuis-qu-on-vaccine- anticovid-la-233252", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid-19 Vaccines Lead to New Infections and Mortality: The Evidence is Overwhelming - Global Research", "description": "Vaccination has spread worldwide. And everywhere it has been followed by a dramatic rise in new infections and mortality. How many deaths and severe accidents will it take for governments, WHO, health agencies FDA, EMA, to look at the proven results of this experimental pseudo-vaccination?", "url": "https://www.globalresearch.ca/covid-19-vaccines-lead-to-new-infections-and-mortality-the-evidence/5746393", "site_name": "Global Research", "article:tag": "fullpage", "article:section": "English", "article:published_time": "2023-04-15T18:08:15+00:00", "article:modified_time": "2023-04-15T19:56:55+00:00", "updated_time": "2023-04-15T19:56:55+00:00", "image": "https://www.globalresearch.ca/wp-content/uploads/2021/05/VCN82342.jpg", "image:secure_url": "https://www.globalresearch.ca/wp-content/uploads/2021/05/VCN82342.jpg", "image:width": "740", "image:height": "493"}, "tags": ["Europe", "Science and Medicine", "Asia", "Latin America & Caribbean"], "tweets": [], "movies": [], "links": ["https://www.mondialisation.ca/author/gerard-delepine", "https://www.mondialisation.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/5656922", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://www.globalresearch.ca/big-pharma-conglomerate-with-a-criminal-record-pfizer-takes-over-the-eu-vaccine-market-1-8-billion-doses/5742812", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-69.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-70.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-71.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-72.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-73.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-74.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-75.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-77.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-78.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-79.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-80.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-81-1024x576.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-82.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-83.png", "https://nouveau-monde.ca/wp-content/uploads/2021/05/image-84.png", "https://ripostelaique.com/grande-bretagne-resultats-reels-de-la-vaccination-anti-covid-19-au-29-mars.html", "https://nouveau-monde.ca/fr/analyse-des-resultats-de-la-vaccination-anti-covid19-en-israel-au-23-fevrier-2021/", "https://emea01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fnouveau-monde.ca%2Fet-surgit-une-hecatombe-post-vaccinale%2F&data=04%7C01%7C%7C6994c9407a914e7bc79108d90bd3d717%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637553826736800442%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=bW8jKFqpvklgPpM%2Bk6ZEuYvUkU2FH8HL%2F3i1BO%2FL808%3D&reserved=0", "https://www.agoravox.fr/actualites/sante/article/depuis-qu-on-vaccine-anticovid-la-233252", "https://www.francesoir.fr/societe-sante/boris-johnson-veut-un-traitement-precoce-contre-la-covid-dici-lautomne", "https://nouveau-monde.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/", "https://www.mondialisation.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/5656922", "https://www.mondialisation.ca/author/gerard-delepine", "https://nouveau-monde.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/", "https://www.mondialisation.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/5656922", "https://www.globalresearch.ca/author/del", "https://www.mondialisation.ca/lhecatombe-post-vaccinale-setend-dans-le-monde/5656922", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2023-04-15T18:08:15+00:00"}