{"result_id": "135041", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/why-some-people-still-believe-in-contrails.html", "timestamp": "2023-04-25 15:18:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/why-some-people-still-believe-in-contrails.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Why Some People Still Believe in Contrails", "cleaned_text": "Why Some People \n\n Still Believe in Contrails\n\nLink to this page using this short URL: http://urlbam.com/ha/M006I\n\nImportant Notice: Your government is creating Facebook accounts and using those accounts to convince the public that they have seen contrails for decades. If you encounter someone on any social network claiming to have seen contrails for decades, they may very well be a paid disinformant. (See #3 in the article below).\n\n \n\n Why They Want People To Believe in Contrails: If the government can convince the public that contrails are real, common, and harmless, then the public will accept them without opposition, just as the public accepted fluoride and mercury-based dental fillings for decades without opposition.\n\n \n\n Now that the government has the technology to spray chemical aerosols that appear as short, non-persistent trails, it's more important than ever to educate the public about the extreme rarity of water-vapor contrails, otherwise, they will mistake the new, short, non-persistent chemical aerosols (chemtrails) as harmless water vapor.\n\n \n\n Remember This: Contrails are so rare, that virtually no person will ever see one in their lifetime. So remember, on social networks, unless you know someone personally, you have no idea who they are.\n\n \n\n Don't be afraid to use social networks to help others and to spread the truth, but always remember that some of the people who you interact with will lie to you and even act angry or hurt if you don't believe them.\n\n \n\n We live in a monumental age of deception, so keep your guard up and don't be swayed by professional liars.\n\nForward: Since the writing of my series of articles exposing contrails, multiple professional airline pilots have contacted me and thanked me for my stance against the contrail deception. \n\n \n\n All of them told me personally that they have never seen trails come out of jet engines and that they appreciate my work exposing the disinformation about contrails. Every one of these pilots knew that contrails are so rare that most people will never see one in their lifetime, and if they do occur, they are at high altitudes that cannot be seen from the ground.\n\n \n\n Each of these professional pilots have flown most of their lives and have always had a deep interest in aviation. Some of them fly mainstream commercial jets while others fly large jets for major parcel carriers.\n\n \n\n If you are a pilot and would like to share information with me, please feel free to contact me any time. I'm always happy to hear from experienced professionals in the field.\n\nHave I Ever Seen A Contrail?\n\nMy audio interview about never seening \"contrails\": Global Skywatch Exposes the Contrail Myth\n\nSince I was young, I've always been into jets and rockets. For this reason, I've always watched the skies. If there was the sound of a jet overhead, I was the first one to stop what I was doing and look up. In my 35+ years of sky watching and jet watching, I've never seen a trail come out of a jet. Not once. Not ever.\n\nAfter traveling to the four corners of the U.S. by jet and by car, and after living in both the north and south of the United States for extended periods of time, I have never seen a trail come out of a jet. Not once. Not ever.\n\nI've lived on military bases, and I grew up near one of the world's most heavily traveled air spaces - Tampa, Florida. I've watched thousands upon thousands of commercial jets. I've had some flight training. As a child I amassed a sizable collection containing thousands of pictures of jets, both commercial and military, and in all this time, I never saw a trail come out of a jet. Not once. Not ever.\n\nToday, there is a persistent stream of information trying to convince us that these innumerable, short, non-persistent plumes coming out of jets today are contrails (water vapor), yet contrail formation from jet engines only occurs under very specific and very rare conditions. As a result, contrail formation is extremely rare. Furthermore, visible—although very faint—contrail formation can only occur at altitudes too-high to be seen from the ground, and even then they are still extremely rare.\n\nFor these reasons, most people will go through their entire lives without ever seeing a contrail, either from the ground or from the air.\n\nSurprisingly, today, there is a handful of people who claim that they've seen contrails come out of jets all of their lives. Some of these people are celebrities. Others are actually leaders in the anti-chemtrail movement.\n\nAll of these observers fall into one of these three categories:\n\nChemtrail Observers Who Believe in Contrails\n\nThis group of people have seen short, non-persistent chemtrails in the past and were told that they were contrails. Since short, non-persistent chemtrails have been in use on a limited basis since the Vietnam war, it is certain that some people have seen them for decades.\n\nChemtrail sightings increased throughout the 1990's. They dramatically increased in 2005 when $996 million was allocated for \"Aircraft Services\" in the United States. Before this dramatic increase in chemtrail sightings, a small number of people would have seen short, non-persistent chemtrails in some locations (usually considered \"test\" locations).\n\nSome people believe that these chemtrails are \"contrails\" because they do not know that the civilian chemtrail operation extends back for decades. In fact, most people still don't know that chemtrails were used in the Vietnam war. They also don't know the accurate, traditional science that teaches how rare the conditions for contrail formation really are; extremely low temperatures with very high humidity at high-altitudes. Still, if a contrail does form at this high altitude, it won't be visible from the ground.\n\n\"If you repeat a lie often enough, people will believe it.\"\n\nSome people accept contrails willingly while others fall prey to it subconsciously. The public is now exposed to constant neuro linguistic programming attempting to convince them that chemtrails are \"harmless contrails\". A certain portion of the population is much more susceptible to such programming techniquest than others are.\n\nMany people who never saw contrails feel tremendous social pressure to say that they did. Others have been told so many times that they saw contrails that they simply begin to believe it and repeat it. They cave under the pressure of the mainstream media mantra and the new, make-believe \"pop-science\".\n\nIncluded in this group are scientists and science-minded hobbyists who fear social ridicule or loss of employment if they deny mainstream \"scientific\" beliefs.\n\nThis group of people knows that if they deny the belief currently being promoted by mainstream \"science\" (which is that these short trails behind jets are contrails), then by implication, they would have to accept that these trails are artificial and would therefore be considered a \"conspiracy theorist\" by their colleagues.\n\nThe social pressure involved in supporting truths that conflict with mainstream \"pop-science\" (more accurately called \"science-for-profit\") is too much for them to handle.\n\nThis group consists of those who are contracted by the government to spread disinformation (lies) to convince the public that non-persistent chemtrails are:\n\nThese \"information mercenaries \" are much more numerous than many realize, and they are paid using your tax dollars. This information warfare is generously-funded with hundreds-of-millions of taxpayer dollars annually in the U.S. alone.\n\nA single disinformation worker can manage hundreds of Facebook accounts. Numerous fake accounts will join a chemtrail awareness group and will spread information and will support each other in an attempt to create the appearance of a consensus. This fake consensus creates social pressure for other real people to believe it (a surprising number of people choose to believe things simply because a majority of others appears to believe it.).\n\nThe operators of these fake accounts may also attempt to incriminate or slander the administrators of the group in order to scare people away. They also continue to draw attention to the smaller issues that may divide the group rather than focusing on the main issue that draws everyone together.\n\nDisinformationalists are on all social networks and forums. They have blogs and websites, and they attend your local social groups and churches. They are well financed and well trained in the art of deception and emotional manipulation. They specialize in causing confusion and discord. Their goal is to keep active groups small, divided, and disorganized. They also try to make active individuals discouraged and overwhelmed. Most importantly, they want the public to believe that contrails are harmless so they can keep spraying lethal chemicals and harmful metals without public opposition.\n\nDisinformationalists are just as responsible for the death and disease caused by the chemtrail holocaust as are those who invented and manage it. The chemtrail holocaust could not have continued more than a few years without paid disinformationalists selling lies to the public.\n\nDespite the fact that I never—in 30+ years of skywatching—saw a trail come out of a jet, today I am witnessing about 49 of every 50 jets leaving non-persistent trails. This changed happened suddenly (overnight) and I witnessed it personally. You can read about it in my chemtrail story.\n\nBetween 15 and 25 minutes after a non-persistent (short) chemtrail is spotted, I - having a very sensitive sense of taste and smell - can smell and taste them in the air, then, within seconds I begin to experience a predictable set of health symptoms. I have watched, waited, and timed this delay for years. There is no doubt whatsoever that the metallic tastes and horrible chemical odors are coming from the short, non-persistent chemtrails.\n\nThe first 3 years that chemtrails were sprayed in the town I used to live in, more people died than have died in the rest of my life combined, and doubled. Also, I personally witnessed a complete ladybug die-off during 2 very-intense days of spraying. I also witnessed a tremendous bee die-off the year after spraying began in our town. The bee population dropped 90% in my estimation. It was dramatic.\n\nThere are so many other changes that I've witnessed that are directly associated with chemtrails that I spent a week documenting it in my chemtrail story.\n\nDon't let anyone convince you that contrails are common or are visible from the ground. Use your own mind and memories based on your own experience. Become educated about chemtrails and realize that they have been utilized in some capacity for decades.\n\n6. Why Some People Still Believe in Contrails\n\nSee A Non-Persistent Trail? It's Either A Chemical Aerosol or a Water-Injection Turbofan\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://urlbam.com/ha/M006I", "http://urlbam.com/ha/M007k", "http://urlbam.com/ha/M003u", "#Disinformationalists", "http://urlbam.com/ha/Azzz", "http://urlbam.com/ha/1zz", "plumes-change.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=3760#Post3760", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=11839#Post11839", "http://urlbam.com/ha/M004i", "the-great-contrail-con.html", "http://urlbam.com/ha/M007M", "#HonestAndMisinformed", "#SocialConformists", "#Disinformationalists", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=postlist&Board=349&page=1", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16321#Post16321", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16108#Post16108", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=999#Post999", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=3760#Post3760", "http://globalskywatch.com/live/archive/2013-10-21,Seeing-Through-Disinformation.html", "http://urlbam.com/ha/M007B", "http://urlbam.com/ha/M003u", "the-great-contrail-con.html", "http://urlbam.com/ha/M003P", "http://urlbam.com/ha/M003W", "http://urlbam.com/ha/M005T", "http://urlbam.com/ha/M005F", "http://urlbam.com/ha/M003P", "the-great-contrail-con.html", "contrail-coverup.html", "a-photo-of-an-actual-contrail.html", "plumes-change.html", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}