{"result_id": "135023", "URL": "http://globalskywatch.com/interviews/", "timestamp": "2023-04-25 15:18:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://globalskywatch.com/interviews/", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Global Skywatch Interviews", "cleaned_text": "Below is a list of many/most Global Skywatch interviews that have occurred since the beginning of our organization. Some interviewers did not archive their interviews, so they may be missing.\n\nWhen you truly understand how the world works, then you are equipped to make smart decisions and to properly prepare for the future. We truly hope this information changes your life and the way you think about the world.\n\n\"It All Comes Down To This\"\n\n Global Skywatch on \"I've Been Thinking with\" Crypt Rick\n• Big-tech censorship: How bad it is.\n• Would the government intentionally hurt you?\n• Is it healthy to believe what you want? The danger of emotionalism.\n• The U.S. is in a state of emergency and has been for decades... Why?\n• World War III comes after the public is disarmed. This has been planned for decades.\n• 90% of shootings happen in gun-free zones. Are pubic shootings pre-planned by globalists?\n• Blood clots and heart attacks: Fauci lied to Congress and the entire world.\n• What are they spraying into the atmosphere? Why are they spraying? What is it doing to you?\n• Can you see \"the haze\"? It's everywhere.\n• I saw the bee die-off the year after chemtrails began.\n• Destroying trees, plants, and all nature. Everything is changing.\n• Chemtrails: What else are they doing to the world.\n• The U.S. Airforce used to steer and destroy hurricanes. Why are we still getting hit? How to globalists benefit from disasters?\n• Mercury causes over 200 of the most common diseases.\n• How to detox and naturally promote glutathione production in your body.\n• Study: How chemtail particulates and 5G/WiFi work together to harm your health.\n• Study: How did our food become so demineralized? What role do chemtrails play?\n• Do your rights come from government?\n• Why don't doctors know about the critical system COMT in your body?\n• When governments take your rights away, it is never for your benefit.\n• The real reason they are trying so hard to disarm the public.\n• The power you have: Will you use it?\n\n\"How To Stop The New World Order\" \n\n Global Skywatch on Ravenstar's Witching Hour\n• How they hide chemtrail spraying from the public.\n• The real reason childhood asthma is at an all-time high.\n• Why mercury is being found across the United States and around the world.\n• Ionizing the atmosphere facilitates RF transmission through the air.\n• What causes ringing in the ears (Tinnitis) and how to get rid of it?\n• They are killing the insects: The dead ladybug colony.\n• How the Bureau of Air Quality things about chemtrails.\n• Smelling and tasting chemtrails: Some do, some don't.\n• This is not conventional airport traffic.\n• Horizontal layered spraying: How they cover the entire sky.\n• All countries are working together.\n• Is Putin fighing the new world order?\n• Why spray intensity decreased between 2009 and 2019.\n• Most populated areas are sprayed the heaviest.\n• They can steer hurricanes, so why do they allow storm devastation to continue?\n• Can they create wind with chemtrails?\n• Modern governments are committing crimes rivaling any in history.\n• How to properly use cilantro in mercury detox.\n• The wet mask: The most effective protection against chemtrails.\n• What types of filters clean chemtrails from the air?\n• The array of toxic metals found in chemtrail fallout.\n• Are globalists going to have mercy upon the population?\n• Ex government employees expose secret future plans; It's all happening now.\n• All governments of the world are controlled by globalists already.\n• They want to destroy the U.S. to demonize freedom-based systems.\n• Creating disasters: How they will get the world to embrace the new world order.\n• The insanity of mRNA that produces spike proteins.\n• How to become personally involved in the battle for truth and freedom.\n• Don't be afraid of being targeted. You are already targeted.\n• Will the world wake up and realize the damage that has been done to them.\n• The globalists' system is very fragile.\n• How to win against the new world order: A winning strategy.\n\nA Very In-depth interview with Russ Tanner of Global Skywatch:\n• Chemtrails: Why, How, Who\n• Geopolitics: What the CIA man told me\n• New World Order: Already in place; What now?\n• Law: How they fooled the world\n• It's all going south soon; What happens next?\n• ...and much more.\n\n\"Doorstep of the Apocalypse\" \n\n Global Skywatch on Ravenstar's Witching Hour\n• Exclusive tips for protecting yourself from airborne biologics\n• FDA banning herbal science, censoring your ability to see studies\n• ...and much more.\n\n\"The Global Shedding Disaster, Detox, & What's Next?\"\n\n The Witching Hour with Solaris BlueRaven\n\nThis interview achieved ranking 16 on the massive TalkStream Live radio network.\n• CV vaccine shedding may be unlimited: All will be exposed very soon.\n• How chemtrails increase estrogen, cause anxiety, depression, weight gain, much more.\n• Seeing through the massive propaganda campaign.\n• How to detox and protect yourself.\n• FDA banning herbal science, censoring your ability to see studies.\n• ...and much more.\n\nAn in-depth interview with Russ Tanner of Global Skywatch:\n• ...and much more.\n\nAn in-depth interview with Russ Tanner and Laura Clement:\n• ...and much more.\n\n\"The Globalists' Favorite Poison\"\n\n The Witching Hour with Solaris BlueRaven\n• How the world really works: Thinks you have not heard before.\n• What happens in the next few years.\n• Mercury symptoms: Everyone has them.\n• One world government: How to prepare.\n• \"The Hum\": Cell wall porocity, inducing morbidity with airborne toxins and EMF,\n\nHyperspace with Solaris BlueRaven:\n\n \"The New World You Now Live In\"\n\nThis fast-paced 2-hour interview is packed with information about:\n• Bible predicts the intentional poisoning of the population\n• Divide and conquer: What globalists are doing to us\n\nOpposing The Matrix Radio Show:\n\n \"Mercury, Chemtrails, Detox, and The End of the Age\"\n\nAn in-depth interview with Russ Tanner and Laura Clement:\n• Making and using a wet mask to block chemtrails\n• We know what causes Alzheimer's\n• Why the APOe-4 genotype is a marker for Alzheimer's and mainstream media hides it from the public\n• How mercury affects nerves and the CNS\n• How much mercury is emitted from amalgam fillings\n• The danger of mixing aluminum and mercury\n• Mercury is mutagenic: It causes cancer\n• The profound personality difference between vaccinated and unvaccinated children\n• How mercury is used to control populations\n• Some religions use mercury to facilitate spiritual possession\n• Using mercury to create chaos and to implement globalism (New World Order)\n• Globalists using mercury-induced emotionalism to control populations and bring globalism\n• The connection between mercury, heart attacks, heart disease, and high-cholesterol\n• Big-pharma and big-media articles avoiding any talk about mercury\n• Why it's hard to detox when chemtrails are present\n• How chemtrails affect the mood of the entire town\n\nOpposing The Matrix Radio Show:\n\n \"An Evening with Global Skywatch\"\n\nAn in-depth inspection of the chemtrail phenomenon and much more:\n• Mercury in Chemtrails and Vaccines: The profound health effects\n• Why Mercury in Vaccines and Chemtrails?\n• APO-e 4: The Suppressed Scientific Connection Between Alzheimer's and Mercury\n• Biologics In Chemtrails: Why is everyone sick?\n\nThis fast-paced 2-hour interview is packed with information about:\n• Mercury, vaccines, and the health effects of both.\n• Ongoing Chemical Aerosol Injection (\"Chemtrails\") and how it is affecting your health and life.\n• Biologics in chemtrails: Why everyone is getting the flu.\n• The New World Order / Global Government is already here; what will happen in the near future and what you should do to prepare.\n• Agenda 21 and depopulation; why they are depopulating the Earth and how they are hiding it from the public.\n\nIn this interview, Russ Tanner, Founder of Global Skywatch covers:\n\n\"The Real Story Of Geoengineering The World\"\n\n GS on Lost Arts Radio with Richard Sacks\n\nIn this interview, Russ Tanner, Founder of Global Skywatch covers:\n• How the world really works\n\nIn this interview, Russ Tanner, Founder of Global Skywatch covers:\n• How the world really works\n\n\"Late Night In The Midlands\" with Michael Vara\n\nIn this interview, Russ Tanner, Founder of Global Skywatch speaks about chemtrails, the new world order, geopolitics, and the future of our world.\n• How the world really works\n\nVaccine Free Radio with Sallie Elkordy:\n\n \"MERCURY: The Profound Physical and Emotional Symptoms\"\n\nThe Power Hour with Dr. Joanne Conaway:\n\n \"Chemtrails and Geoengineering\"\n\nThis fast-moving 2-hour interview is packed with information about Biblical Numerology, chemtrails in the Bible, prophecy, and other related subjects.\n\nThis fast-paced 2-hour interview is packed with information about chemtrails, the Christmas Flu Outbreak, the EMF threat, world politics, alternative health suggestions, and much more.\n\nChemtrails:\n\n and The Luciferian Agenda Behind Agenda 21\n• How the world really works\n\nWe stopped posting interviews between early 2015 and 2018.\n\n We may post them at a future time.\n\nThis rapid-fire 2-hour interview is packed with information about chemtrails, world politics, and heartfelt inspiration.\n\nFirst we talk about defending our health against the chemtrail assault on our bodies.\n\nSecond, we talk about how the world really works in the big picture.\n\nFinally, we open up about vulnerability, overcoming our fears, being effective in our lives and our relationships, and how changing ourselves changes our world.\n\nWhat really happened at the Paris Climate Conference? Was it actually about climate, or was that a cover for a deeper real agenda? On the surface, it was promoted as a gathering of world leaders out of genuine concern for the future of our planet, focused on the issue of the threat to all life on Earth posed by \"climate change.\" Yet what really is climate change? Even a little study shows us that climate has been changing since the Earth was first created, and it still is today. The United Nations is warning that the climate is getting steadily warmer, and this could cause ultimate catastrophe. Many scientists believe this, and others believe the climate is getting cooler. Both sides present their data. Either one could destroy the biosphere, with us in it.\n\nLost Arts Radio welcomes back our friend Russ Tanner (http://www.globalskywatch.com), one of the hosts on \"GeoengineeringWatch Radio\", that Richard used to work with on that show. Russ and Richard get to discuss in detail and depth what is really going on with the whole chemtrail issue, all the way from basic details of how the spray operations work, to what is the motive and plan of those pulling the strings from behind the scenes. This will be a discussion you won’t want to miss, whether you are new to this subject or a veteran activist working to get the spraying stopped.\n\nAmerican Freedom and Unity Project: Project Website\n\n Sponsored by The Liberty Beacon\n\nWe who struggle for change are all constantly hearing the same old lines “There are too many Americans asleep to accomplish anything”, or “A majority of Americans are just sheep (sheeple)”.\n\nThe truth is just the opposite!\n\nOn this special 3 hour episode of TLBTV Eradicating programmed Ignorance, we present a panel of ultra dedicated individuals in the field of fighting this elite caste against many of the above listed weapons being used against humanity. Those who give their all constantly to unite us and push back on what can only be described as the darkest point in modern human history. What you will hear today will shock and awaken many to this monumental lie, and start us on the path of true unity, in numbers that can no longer be ignored, dismissed or silenced. Read the full article: http://wp.me/p2X3AR-d7X\n\nChemtrails, mercury, health, the future of our planet.\n\nThis fast-paced 2-hour interview is packed with information about chemtrails, world politics, and much more.\n\n\"At This Moment\" with Angela Black\n\n\n\nVideo Description: We talk about all things CHEMTRAILS / AEROSOL SPRAYING / GEOENGINEERING. This, being the GREATEST CRIME AGAINST, and GREATEST THREAT TO HUMANITY and ALL LIFE ON EARTH in HISTORY. Chemtrails, Geoengineering, Solar Radiation Management (SRM)... We talk about Russ' journey, how greatly humans and life forms are damaged by toxic plumes sprayed by aircraft, along with HAARP... Nanoparticulates, including Aluminum, Strontium, Cesium, Barium, Mercury, Toluene, etc. Russ has defined at LEAST thirteen (13) types of aerosol \"plumes,\" based on SMELL, due to his acute sense of taste and smell, which he has had all his life. We talk about the importance of Potassium and Magnesium, and in general, defending yourself against these deadly nanoparticulates in the air we breathe. Russ uses a, \"Wet Mask\" to protect his lungs and soft tissue from the dangers of breathing in these deadly fumes.\n\nThis is a large group interview featuring many of the most popular activists today working to raise awareness about geoengineering.\n\nGuests discussed ongoing geoengineering operations (the largest crime against humanity in human history), how they are affecting the environment and human health, how people can band together to make governments stop the spraying, what is the long-term outlook for planet Earth, how to stay encouraged and positive during difficult times.\n\nThis is a fast-paced interview containing information about geoengineering (\"chemtrails\") and quick tips about detoxing aluminum and mercury from the body.\n\nSubjects covered include: Aerosols tastes and types, spray scheduling, hiding spraying from the public, high-bypass turbofans and why they don't make trails, aluminum detox, mercury detox, and more.\n\nThis is a fast-paced interview with in-depth information about geoengineering (\"chemtrails\"). Russ Tanner, founder of Global Skywatch, shares his experiences and health consequences of living with the ongoing geoengineering program.\n\nThis program is helpful for those who want deeper insight about the chemical aerosols we are all breathing today. Subjects covered include: Aerosols tastes and types, health consequences, spray scheduling, hiding spraying from the public, changes in plume length, high-bypass turbofans and why they don't make trails, types of jets spraying, and more.\n\nMurdering Us From The Sky, Awake Radio\n\nThis is a large group interview featuring many of the most popular activists today working to raise awareness about geoengineering.\n\nMany aspects of geoengineering were discussed.\n\nA Biblical view of chemtrails; Different plume types; Spraying biologics; The role of electromagnetics; The world governments are all 1 entity now; Those who destroy the world; Detoxing chemtrails; All wars are bankers wars; The corporation nation; much more.\n\nIn The Know with Sallie Elkordy\n\nThis 45-minute interview is a great introduction to conspiracies: How rich people control the world and control individual people, and why they do it.\n\nThis comprehensive 2-hour interview covers mercury toxicity, amalgam fillings, geoengineering (\"chemtrails\"), and more. This interview provides a good overview with some detail about what is happening in the sky and why it is happening.\n\nAn interview with Jeff Saxon and Russ Tanner about chemtrials and geoengineering. A good introduction to the subject.\n\nThis inspiring and fast-paced interview covers a wide-range of topics and serves as a great introduction to the massive global conspiracy that we all live under today.\n\nLate Night In The Midlands with Michael Vara\n\nIn this fast-paced, extended lenth show, we covered a lot of ground from mercury toxicity, to geoengineering/chemtrails, to corruption in government to the Bible.\n\nRuss Tanner from Global Skywatch joins Pat to discuss the white lines we see in the sky and why the toxic spraying of chemicals is hazardous to your health. Find out what is being sprayed on you, without your consent.\n\nA white checkerboard in the sky. Could it be chemtrails?\n\nRuss Tanner of Global Skywatch joins the show to explain the unbelievable. What are they spraying on you and why? And most importantly - who is behind this? Listen and take action. This show is broadcast live on W4CY Radio\n\nPat from K-Talk AM630 In Utah speaks with Russ Tanner of Global Skywatch in a 2-hour interview about chemtrails, mercury amalgam fillings, water, deception in mainstream media, and much more.\n\nHans Oellers speaks with Russ Tanner of Global Skywatch in a long, in-depth interview that answers difficult and diverse questions about geoengineering, the corporate structure of government, the \"wet-mask\", UCC contracts and state governments, chemtrail symptoms, laws that allow spraying Americans, the truth about \"contrails\", how long have they been spraying, wild weather and weather control, chemtrail heart attack, why the majority don't stand up to tyrrany, mercury: \"The Fear Drug\", coal-burning power plants & mercury distribution, the \"elites\" are now making their \"big move\", smelling and tasting chemtrails, different types of chemtrails, rainwater and dust tests showing metals in Maine, how mercury changes personality, and more.\n\nIn the first hour, Dane Wigington covers the effect that geoengineering is having on weather and how it is triggering massive methane releases which are part of a positive feedback cycle leading to dramatic warming.\n\nIn the second hour, Russ Tanner explains the effect mercury and geoengineering has on health and offers ideas to assist detoxing.\n\nMadisonStar Moon interviews Michael Glynn, an airline pilot (allegedly) living in Sydney Australia who claims to be an A330 captain with Qantas.\n\nMichael does not believe in chemtrails and is well known in the debunker community as a non-believer in ongoing global geoengineering programs. Among those debating Michael is Russ Tanner of Global Skywatch.\n\nRuss Tanner from Global Skywatch was interviewed on \"The Witching Hour\" with Solaris BlueRaven.\n\nIn this interview we talked in detail about mercury detox, what we should call chemtrails (chemtrails or geoengineering), how mercury affects people physically and emotionally, how to counteract the health effects of mercury, how media lies to the public, and much more.\n\nMay 21, 2013 - Russ Tanner from Global Skywatch was interviewed on \"Destination Maine\" with LJ Bell. She also interviewed Dane Wigington and others on the subject which was broadcast in southern Maine on WRFR as a 3-part program.\n\n\"The Doctor Is In\"\n\nFebruary 21, 2013 - Global Skywatch appeared on \"The Doctor is In\" with Dr. Dennis Harris to talk about the health effects of chemtrails/geoengineering and how to detox. Russ Tanner and Laura Clement appeared together on this program. Unfortunately, this interview was never posted on their website.\n\nFebruary 19, 2013 - Global Skywatch appeared on \"West Kootenay Ecosociety\" with Christina Yahn to talk about chemtrails/geoengineering. Russ Tanner appeared in the last 10 minutes of the hour following Michael Murphy and Scott Stevens. Unfortunately, this interview was never posted on their website.", "opengraph": {"type": "article", "image": "http://globalskywatch.com/assets/images/open-graph/OpenGraph-Badge,158x158.jpg", "site_name": "GlobalSkywatch.com", "description": "GlobalSkywatch.com Chemtrail/Geoengineering News Forums Conferences."}, "tags": [], "tweets": [], "movies": [], "links": ["index.html", "2022-11-21,Crypt-Rick.html", "2022-11-21,Crypt-Rick.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=91402#Post91402", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=95386#Post95386", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=83020#Post83020", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=80#Post80", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=83651#Post83651", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=85053#Post85053", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=87361#Post87361", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=95955#Post95955", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=95729#Post95729", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=95837#Post95837", "http://globalskywatch.com/scientists/j-marvin-herndon/index.html#ContaminationOfTheBiosphereWithMercury", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/the-magenta-halos.html#.Y5_CinbMJHY", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-killed-the-bees.html#.Y5_CrXbMJHY", "http://globalskywatch.com/stories/Boss-of-the-Swamp.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=52451#Post52451", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6424#Post6424", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=37684#Post37684", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=64142#Post64142", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7302#Post7302", "2022-03-27,Ravenstars-Witching-Hour.html", "2022-03-27,Ravenstars-Witching-Hour.html", "2022-02-24,Longneck-News.html", "2022-02-24,Longneck-News.html", "2021-11-07,Ravenstars-Witching-Hour.html", "2021-11-07,Ravenstars-Witching-Hour.html", "2021-05-02,Ravenstars-Witching-Hour.html", "2021-05-02,Ravenstars-Witching-Hour.html", "2021-03-07,Lost-Arts-Radio.html", "2021-03-07,Lost-Arts-Radio.html", "2021-03-07,Lost-Arts-Radio.html", "2020-11-09,Opposing-The-Matrix.html", "2020-11-09,Opposing-The-Matrix.html", "2020-11-09,Opposing-The-Matrix.html", "2020-10-10,The-Witching-Hour.html", "2020-10-10,The-Witching-Hour.html", "2020-08-21,Mike-Halpern.html", "2020-08-21,Mike-Halpern.html", "2020-03-28,Hyperspace,Solaris-BlueRaven.html", "2020-03-28,Hyperspace,Solaris-BlueRaven.html", "2019-10-20,Lost-Arts-Radio,Richard-Sacks.html", "2019-10-20,Lost-Arts-Radio,Richard-Sacks.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=22284#Post22284", "http://orbisvitae.com/mc/Mystery-Babylon-Series", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=31723#.Xa3HUlVKhUQ", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16108#Post16108", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=65699#Post65699", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showgallery&Number=89089#Post89089", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html#.Xa3GmlVKhhE", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=postlist&Board=36&page=1#ForumTop", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=83651#Post83651", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=62806#Post62806", "2019-08-12,Opposing-The-Matrix.html", "2019-08-12,Opposing-The-Matrix.html", "2019-07-29,Opposing-The-Matrix.html", "2019-07-29,Opposing-The-Matrix.html", "2019-05-04,Hyperspace,Solaris-Blueraven.html", "2019-05-04,Hyperspace,Solaris-Blueraven.html", "2018-08-14,Liberation-Station.html", "2018-08-14,Liberation-Station.html", "http://globalskywatch.com/what-are-chemtrails.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://mercurytalk.com/articles/The-Emotional-Effects-of-Mercury.html#.WzO0JdVKhUQ", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/illness/", "2018-06-05,Lost-Arts-Radio,Richard-Sacks.html?v=165qoNranaY", "2018-06-05,Lost-Arts-Radio,Richard-Sacks.html?v=165qoNranaY", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://globalskywatch.com/what-are-chemtrails.html", "http://mercurytalk.com/articles/The-Emotional-Effects-of-Mercury.html#.WzO0JdVKhUQ", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=19389#Post19389", "http://globalskywatch.com/illness/", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=postlist&Board=412&page=1", "2018-06-05,A-Call-To-Decision,Butch-Paugh.html", "2018-06-05,A-Call-To-Decision,Butch-Paugh.html", "http://globalskywatch.com/what-are-chemtrails.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=19389#Post19389", "http://globalskywatch.com/illness/", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=postlist&Board=412&page=1", "2018-05-16,Late-Night-In-The-Midlands,Chemtrails.html", "2018-05-16,Late-Night-In-The-Midlands,Chemtrails.html", "http://globalskywatch.com/what-are-chemtrails.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=19866#Post19866", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16108#Post16108", "2018-03-13,Vaccine-Free-Radio,Sallie-Elkordy.html", "2018-03-13,Vaccine-Free-Radio,Sallie-Elkordy.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=36#Post36", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=postlist&Board=12&page=1", "http://globalskywatch.com/illness", "http://globalskywatch.com/health/aluminum", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16108#Post16108", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=18269#Post18269", "2018-02-27,The-Power-Hour,Dr-Joanne-Conaway.html", "2018-02-27,The-Power-Hour,Dr-Joanne-Conaway.html", "http://globalskywatch.com/illness", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#SwampWaterType", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=19389#Post19389", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=14390&Searchpage=1&Main=9844&Words=+california++drought&Search=true#Post14390", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=15626#Post15626", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6424#Post6424", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=18269#Post18269", "2018-02-20,Truth-Train,Liberty-Lisa.html", "2018-02-20,Truth-Train,Liberty-Lisa.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "2018-02-17,Hyperspace,Solaris-Blueraven.html", "2018-02-17,Hyperspace,Solaris-Blueraven.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=19389#Post19389", "2017-01-30,No-Lies-Radio.html", "2017-01-30,No-Lies-Radio.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=52619#Post52619", "http://globalskywatch.com/articles/How-The-World-Really-Works.html#.Wsb6cGobNhE", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=60638#.Wsb6QmobNhE", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16108#Post16108", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=18269#Post18269", "2016-01-03,Ravenstars-Witching-Hour.html", "2016-01-03,Ravenstars-Witching-Hour.html", "2015-12-19,Lost-Arts-Radio.html", "2015-12-19,Lost-Arts-Radio.html", "2015-10-09,Lost-Arts-Radio.html", "2015-10-09,Lost-Arts-Radio.html", "https://www.youtube.com/redirect?q=http%3A%2F%2Fwww.globalskywatch.com%2F&redir_token=_NasTWxpG0hic4CszxthtfVqb058MTQ0NTM2MjMwOEAxNDQ1Mjc1OTA4", "2015-09-30,American-Freedom-and-Unity-Project-Panel.html", "2015-09-30,American-Freedom-and-Unity-Project-Panel.html", "https://www.youtube.com/redirect?q=http%3A%2F%2Ftheamericanfreedomandunityproject.org%2F&redir_token=FtUEZPtCPW_-wFVD47C6e95BFMV8MTQ0NDI0ODU5N0AxNDQ0MTYyMTk3", "http://www.thelibertybeacon.com", "https://www.youtube.com/redirect?q=http%3A%2F%2Fwp.me%2Fp2X3AR-d7X&redir_token=FtUEZPtCPW_-wFVD47C6e95BFMV8MTQ0NDI0ODU5N0AxNDQ0MTYyMTk3", "2015-09-23,Americas-Failing-Health.html", "2015-09-23,Americas-Failing-Health.html", "2015-08-29,Ravenstars-Witching-Hour.html", "2015-08-29,Ravenstars-Witching-Hour.html", "2015-08-20,At-This-Moment.html", "2015-08-20,At-This-Moment.html", "http://globalskywatch.com/what-are-chemtrails.html", "http://globalskywatch.com/chemtrail-illness.html", "http://globalskywatch.com/stories/my-chemtrail-story/index.html", "http://globalskywatch.com/stories/Dan-McGuire,Chemtrails-Killing-Our-Garden.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/my-chemtrail-heart-attack.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=91#Post91", "2014-11-08,Ravenstars-Witching-Hour.html", "2015-07-13,Awake-Radio.html", "2015-07-13,Awake-Radio.html", "http://geoengineeringwatch.org", "http://rebelsiren.wordpress.com", "http://www.ban-geoengineering.org/", "http://globalskywatch.com", "https://www.facebook.com/madisonstar.moon", "2015-07-08,Bob-Tuskin-Radio-Show.html", "2015-07-08,Bob-Tuskin-Radio-Show.html", "../stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "../stories/my-chemtrail-story/chemtrail-information/scheduling.html", "../stories/my-chemtrail-story/chemtrail-information/plumes-change.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "http://globalskywatch.com/health/aluminum", "http://globalskywatch.com/health/mercury", "2015-06-21,Edge-of-the-Herd.html", "../stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "../chemtrail-illness.html", "../stories/my-chemtrail-story/chemtrail-information/scheduling.html", "../stories/my-chemtrail-story/chemtrail-information/plumes-change.html", "../stories/my-chemtrail-story/chemtrail-information/plumes-change.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "2014-11-08,Ravenstars-Witching-Hour.html", "2015-06-08,Murdering-Us-From-The-Sky.html", "2015-06-08,Murdering-Us-From-The-Sky.html", "2015-01-24,Opposing-The-Matrix.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=76788#Post76788", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=64465#Post64465", "2015-01-21,In-The-Know-with-Sallie-Elkordy.html", "2014-11-08,Ravenstars-Witching-Hour.html", "2014-12-16,Hyperspace.html", "2014-12-16,Hyperspace.html", "2014-12-16,Hyperspace.html", "2014-12-05,Lives-In-The-Balance-Sheet.html", "2014-12-05,Lives-In-The-Balance-Sheet.html", "2014-11-08,Ravenstars-Witching-Hour.html", "2014-11-08,Ravenstars-Witching-Hour.html", "2014-10-18,Late-Night-In-The-Midlands.html", "2014-10-18,Late-Night-In-The-Midlands.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html#.VERsLRaqZ5Y", "2014-09-27,Speak-Up-And-Stay-Alive.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2014-09-27,Speak-Up-And-Stay-Alive.html", "2014-09-25,Boil-The-Frog-Slowly.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2014-09-25,Boil-The-Frog-Slowly.html", "2013-08-14,K-Talk,630AM.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2013-08-14,K-Talk,630AM.html", "2013-07-07,Peace-and-Chemtrails.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2013-07-07,Peace-and-Chemtrails.html", "2013-06-28,The-Truth-Traveler.html", "2013-06-28,The-Truth-Traveler.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2013-06-19,MadisonStarMoon,Interview-With-A-Pilot.html", "2013-06-01,Solaris-RavenStar.html", "2013-06-01,Solaris-RavenStar.html", "http://tribalvibe.podomatic.com/profile?p=2", "http://wrfr.org/", "http://www.doctordennisharris.com/calendar/event-details?id=20", "http://kootenaycoopradio.com/index.php?/radio-show/show/kootenay_morning/P40/", "2012-11-25,PLO,Interview-With-A-Pilot.html", "2012-11-25,PLO,Interview-With-A-Pilot.html", "2012-10-07,RT-on-Project-Lights-Out.html", "2012-10-07,RT-on-Project-Lights-Out.html", "2012-08-26,RT-on-Project-Lights-Out.html", "2012-08-26,RT-on-Project-Lights-Out.html", "2012-05-26,RT-on-Wolf-Spirit-Radio.html", "2012-05-26,RT-on-Wolf-Spirit-Radio.html", "2012-05-04,RT-on-The-Truth-Denied.html", "2012-05-04,RT-on-The-Truth-Denied.html", "2012-04-13,RT-on-The-Truth-Denied.html", "2012-04-13,RT-on-The-Truth-Denied.html", "http://greenhour.myartistdna.com/#song_id=475", "http://greenhour.myartistdna.com/#song_id=475", "2012-03-01,RT-on-The-Big-Mad-Morning-Show.html", "2012-03-01,RT-on-The-Big-Mad-Morning-Show.html", "2012-04-07,RT-on-Wolf-Spirit-Radio.html", "2012-04-07,RT-on-Wolf-Spirit-Radio.html", "2012-03-29,RT-on-Wolf-Spirit-Radio.html", "2012-03-29,RT-on-Wolf-Spirit-Radio.html", "2011-08-26,RT-on-The-Truth-Denied.html", "2011-08-26,RT-on-The-Truth-Denied.html", "my-chemtrail-story/2011-02-10,Cindy,NY/index.html", "http://longislandskywatch.com", "my-chemtrail-story/2011-02-16,Judy,NH/index.html", "http://www.latalklive.com/medianmusic/dutch/ShotHeard02112011.mp3", "http://www.environmentalvoices.org/", "http://TaxFree15.com", "http://www.arnoldistheanswer.com/"], "authors": [], "publish_date": null}