{"result_id": "135034", "URL": "http://globalskywatch.com/gwr/", "timestamp": "2023-04-25 15:18:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://globalskywatch.com/gwr/", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Geoengineering Watch Radio, Tuesdays at 9pm ET, 6pm PT - Please Join Us", "cleaned_text": "Link to this page using this short URL: gsw.bz/gwr NOTICE: Geoengineering Watch Radio has ceased broadcasting for the time being to focus on research and to produce broadcast media for the general public. If we continue broadcasting on the internet, we will post a notice here.\n\n \n\n The complete show archive will remain available below. Geoengineering Watch Radio: A powerful weekly news update about geoengineering, ozone damage, weather manipulation, and much more, with Dane Wigington and Russ Tanner.\n\n More Details Call In Number: We take questions and comments during the show. Call 929-477-2297. All previous programs are available as raw MP3 files so they can be played on any device. Recent shows are listed first. Dane Wigington & Russ Tanner each bring their own expertise to help us understand the bigger picture of where we are right now in history, and how the critical issues threatening the continued existence of humanity can be turned to our advantage, by stopping the causes of the damage being done, and joining forces to heal our world on all levels. Dane Wigington has an extensive background in solar energy. He is a former employee of Bechtel Power Corp. and was a licensed contractor in California and Arizona. His personal residence was featured in a cover article on the world's largest renewable energy magazine, Home Power. He owns a 1,600-acre \"wildlife preserve\" next to Lake Shasta in northern California. Dane focused his efforts and energy on the geo-engineering issue when he began to lose very significant amounts of solar uptake due to what ever-increasing \"solar obscuration\" caused from the aircraft spraying. He also noted significant decline in forest health and began testing and research into the geo-engineering issue about a decade ago. Dane is the lead researcher for GeoengineeringWatch.org and has investigated all levels of geo engineering from chemtrails to HAARP. He assisted Michael Murphy with his production of \"What in the World are They Spraying\" and has appeared on an extensive number of interviews to explain the environmental dangers we face on a global level. He lives in Mt. Shasta, California. Russ Tanner is founder and President of Herb Allure, Inc., a company that publishes scientific research about herbs and nutritional supplements. He founded the GlobalSkywatch.com website to raise awareness about geo-engineering. Russ recovered from mercury toxicity and educates others on how to do the same. He has been interviewed on numerous radio and internet programs and has published articles and given lectures on the dangers of amalgam fillings, mercury toxcity, geo-engineering-related illnesses, and geopolitics. Russ has worked as a theater Technical Director, has a degree in electronic technology, an ISCET license, and writes and produces music, and write computer software. Russ lives in Maine.", "opengraph": {"type": "article", "image": "http://globalskywatch.com/assets/images/open-graph/OpenGraph-Badge,158x158.jpg", "site_name": "GlobalSkywatch.com", "description": "GlobalSkywatch.com Chemtrail/Geoengineering News Forums Conferences."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.blogtalkradio.com/geoengineeringwatch", "#HowToTuneIn", "#Archive", "#GeoengineeringWatchRadio", "../resources/index.html", "http://gsw.bz/gwr", "#GeoengineeringWatchRadio", "#Archive", "http://geoengineeringwatch.com", "http://herballure.com", "http://herballure.com/mms", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=64142#Post64142", "http://globalskywatch.com/interviews/index.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/index.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=45573#Post45573", "http://globalskywatch.com/chemtrail-illness.html", "http://russtanner.com/Software/", "http://globalskywatch.com", "http://orbisvitae.com"], "authors": [], "publish_date": null}