{"result_id": "135004", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-dark-dust-kills-computers.html", "timestamp": "2023-04-25 15:17:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-dark-dust-kills-computers.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "How Dust Changed After Chemtrails Were Sprayed: Can Damage Computer Fans", "cleaned_text": "Link to this page using this short URL: gsw.bz/dark-dust The Death of the Machines Nano-particles are too small to affect large machines. This is pointed out in some of the patents that describe the disbursement of nano-particles through jet engines. These patents demonstrate that jet engines are not harmed when fine metallic dust or nano-particles pass through them. That being said, these chemical aerosol nano-particles do harm small machines and some forced air electronics. For example, I have seen a dramatic increase in the failure rates of computer fans whose bearing oil dries up more quickly in the presence of reactive nano-particles. Also, I have also seen a dramatic increase in the failure rate of computer power supplies. These devices use forced-air to stay cool and consequently accumulate a large amount of semi-conductive dust which essentially shorts-out the electronics and damages sensitive control-related components. Consider how manufacturers benefit when oily chemtrail residue kills the fan on a computer video card. This causes the main chipset on the card to fail within a matter of hours or days causing you to have to purchase a new video card. Since only a small percentage of people will bother to return a video card for warranty service (if the fan happens to fail while the warranty is still valid), the net effect is dramatically increased sales and profits for manufacturers.\n\n \n\n Since I build and maintain all the computers that I use in our business, I have swapped out counless video cards in the past 7 years when the main cooling fan failed. I've also had to purchase at least 5 new power supplies to replace ones that overheated when a cooling fan failed. In short, I have seen the failure rate of computer cooling fans skyrocket in the past 7 years - the same period of time we have experienced heavy chemtrail spraying. I have also witnessed a change in the nature of the dust. Instead of the typical dry, light-gray dust we had witnessed since the mid 90's when we began building and repairing our own computers, we are now seeing dark—almost black—oily dust. Incidentally, based on the evidence we have seen, we believe that mercury may be one of the components of chemtrails, and that this mercury is combined with an oily petroleum product that acts as a delivery system because it can both carry the metal through the air and it can help it adhere to humans, animals, and crops. We had a small sample of dust tested and discovered that it contained .309 µg of mercury. You can view this dust test here. Dead computer power supplies, replacement computer fans, and oily dark-dust accumulations that began appearing only after chemtrails appeared in our area. Click to zoom each picture, then click \"More\" to view detailed descriptions at the bottom of each picture. The largest failure rate we've seen is in human bodies. The bodies we live in are highly complex machines which are highly-dependent on a fine balance of metals in our diet. These metals are even more important than vitamins to sustain body functions. Breathing toxic chemtrail nano-particles causes dramatic changes in the balance of our body-metals which lead to disease and death. My heart attack in 2011 was most-likely caused by the only related problem they found with my body; extremely low potassium. Low potassium is caused by barium exposure. In fact, barium is used to induce heart attacks in lab animals. Barium dramatically lowers body potassium which leads to heart attacks and death. Virtually all chemtrail-related research concludes that chemtrails contain enormous amounts of toxic barium. In the first 3 years of chemtrail spraying in our area, more people that I know died than in the entire rest of my life combined and doubled. Some of the most popular health issues leading to death were—and continue to be—heart attacks, strokes, aneurysms, and cancer, all of which are associated with the metallic nano-particle metals being sprayed on us daily. In fact, barium causes heart attacks and mercury causes high cholesterol, inhibited vitamin C utilization leading to strokes and aneurysms, and cancer. Mercury also causes over 200 of the most common diseases today. Make no mistake, if chemtrails contain barium and/or aluminum and/or mercury, they are deadly. In the end, the only benefactors of semiconductive chemtrail dust are the medical and pharmaceutical industries along with electronic parts manufacturers and computer manufacturers who end up selling more computers and replacement computer parts.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/stories/my-chemtrail-story/chemtrail-information/why-chemtrails.html", "/stories/my-chemtrail-story/chemtrail-information/the-great-contrail-con.html", "/stories/my-chemtrail-story/chemtrail-information/a-photo-of-an-actual-contrail.html", "/stories/my-chemtrail-story/chemtrail-information/my-chemtrail-heart-attack.html", "/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html", "/stories/my-chemtrail-story/chemtrail-information/contrail-coverup.html", "/stories/my-chemtrail-story/chemtrail-information/weather-modification.html", "/stories/my-chemtrail-story/chemtrail-information/plumes-change.html", "/stories/my-chemtrail-story/chemtrail-information/what-you-see-in-the-sky.html", "/stories/my-chemtrail-story/chemtrail-information/the-haarp-hum.html", "/stories/my-chemtrail-story/chemtrail-information/biologic-types.html", "/stories/my-chemtrail-story/chemtrail-information/case-orange.html", "/stories/my-chemtrail-story/chemtrail-information/spraying-themselves.html", "/stories/my-chemtrail-story/chemtrail-information/a-virtual-vaccination.html", "/stories/my-chemtrail-story/chemtrail-information/chemtrails-killed-the-bees.html", "/stories/my-chemtrail-story/chemtrail-information/geoengineering-artifacts.html", "/stories/my-chemtrail-story/chemtrail-information/nasa-cloud-charts.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "why-some-people-still-believe-in-contrails.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-or-geoengineering.html", "why-public-officials-neglect-chemtrails.html", "air-purifiers.html", "chemtrail-dark-dust-kills-computers.html", "/stories/my-chemtrail-story/chemtrail-information/scheduling.html", "/stories/my-chemtrail-story/chemtrail-information/white-sheen.html", "/stories/my-chemtrail-story/chemtrail-information/the-magenta-halos.html", "/stories/my-chemtrail-story/chemtrail-information/fallout.html", "/stories/my-chemtrail-story/chemtrail-information/bangor-jet-origins.html", "/stories/my-chemtrail-story/chemtrail-information/particulate-descent-time.html", "/stories/my-chemtrail-story/chemtrail-information/wrong-belief-equals-mental-illness.html", "/stories/my-chemtrail-story/chemtrail-information/dead-ladybugs.html", "/stories/my-chemtrail-story/chemtrail-information/opportunistic-infections.html", "/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "http://gsw.bz/dark-dust", "http://urlbam.com/ha/M004Q", "http://urlbam.com/ha/Uzz", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=4768#Post4768", "http://urlbam.com/ha/M001p", "my-chemtrail-heart-attack.html", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M005T", "../story/16-Ailments.html", "http://urlbam.com/ha/M001p", "http://gsw.bz/ffb", "http://gsw.bz/ffa", "http://urlbam.com/ha/M001p"], "authors": [], "publish_date": null}