{"result_id": "135007", "URL": "http://globalskywatch.com/health/solutions/index.html", "timestamp": "2023-04-25 15:17:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://globalskywatch.com/health/solutions/index.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Detox - Global Skywatch", "cleaned_text": "This information on this page will be expanded frequently. Please come back and visit.\n\nThe Products We Actually Use\n\nBelow are links the most effective natural solutions we've found for various symptoms caused by geoengineering. These are the supplements we use to remain functional and productive day after day.\n\nWe make a small commission on some products sold below. This in no way changes our product suggestions. If we find a different product that offers no commissions that works better, we will suggest that product instead.\n\nWe do not make money exposing chemical aerosol spraying. We have always operated at a loss. We never have been compensated for more than about 20% of our expenses.\n\nExpenses include server costs (~$90 per month), livestreaming costs (~$50 per month), software purchases, and much more. Our goal is to help people and stop the spraying. The ability to offset even a small part of our expenses helps us because we are people just like you; trying to make a living while fighting for our health and our lives.\n\nIf You Want To Help\n\nWe only make a commission on the products labeled (NSP). If you want to help us continue fighting and exposing the chemical aerosol (\"chemtrail\") issue, please consider using these products. Thank you in advance.\n\nNo information is intended to treat, diagnose or cure symptoms, conditions, or diseases. This information is here only to provide information based on our personal research and experience.\n\nMalic Acid is a very effective way to remove aluminum from the body. Studies show malic acid is even more effective than most pharmaceuticals for removing aluminum.\n• Fibralgia (NSP) - This product contains 350mg of pure Malic Acid.\n\nVitamin C is also very good at removing aluminum from the body. It has numerous other benefits as well.\n• Vitamin C with Citrus Bioflavonoids (NSP) - We always use Citrus Bioflavonoids because this greatly increases the bioavailability of Vitamin C in the body.\n\nBarium is especially dangerous because it lowers potassium levels in the body. Low potassium leads to heart fibrillations and eventually heart attack. Barium is so toxin in fact, that it is used to artificially induce heart attacks in animal testing.\n\nPotassium helps remove barium from the body. It also protects against barium-induced heart attacks.\n\nShortly after chemtrail programs expanded globally in the early 2000s, the FDA limited over-the-counter potassium supplements to 99 mg per capsule. To prevent a barium/chemtrail-induced heart attack you need to take 800 mg to 1400 mg in a single dose. This means people have to take 8 to 14 capsules. Taking this many capsules scares people who do not know what the FDA has done, and so they will generally take much less and as a result, may remain at risk for a heart attack. This FDA policy ultimately leads to increased heart attacks and ultimately more deaths over time, especially as barium levels accumulate in the body.\n\nThe body can handle about 1800 mg of potassium per dose and a total of about 4800 mg per day. I typically take 8 to 12 capsules (99 mg) once or twice a day for protection against heart attacks and to help remove barium from the body.\n• Potassium Combination (NSP) - A great source of high-quality bioavailable potassium. Use this if it's affordable to you.\n• Potassium Citrate (VitaCost) - This is a low-cost source of potassium that is helpful for those who are on a budget.\n\nAlgin helps remove barium, strontium, mercury, and other heavy metals from the colon including some radioactive metals. This is 3 most important detox supplements you can use because it stops redistribution, which is probably the single largest issue with metal detox.\n• Algin (NSP) - This is the only source of algin that I dare use because it's sourced in the Atlantic and always tested contamination. It is a truly excellent product.\n\nAlgin helps remove barium, strontium, mercury, and several other heavy metals from the colon. This is one of the most important detox supplements you can use because it mitigates \"redistribution\", which is probably the single largest issue with metal detox. \"Redistribution\" is the process of reabsorbing metals into the body through the colon after they have already been dumped into the colon by the liver. Most people report feeling better when taking algin.\n\nThis product has become so popular that it was brought back by popular demand after being discontinued by our company years ago.\n• Algin (NSP) - This is the only source of algin that I dare use because it's sourced in the Atlantic and always tested contamination. It is a truly excellent product.\n\nCilantro mobilizes many heavy metals from the body but must be used with a chelator at the same time. Without a chelator, these metals will be redistributed in the body. This is why cilantro can cause symptoms to surge when use incorrectly.\n\nWe use cilantro with Algin and DMSA together. Unfortunately, DMSA has recently been removed from over-the-counter sales, likely because too many Autistic and ADD children were healed with DMSA.\n• Heavy Metal Detox (NSP) - This supplement contains cilantro. it also has many other metal detox supplements in a single capsule. I would start with only 1 cap a day and also add extra Algin. If you have a detox reaction, you may want to reduce dosage.\n\nWe now have evidence of mercury being sprayed in chemtrails. This means the necessity for mercury detox is at an all-time high.\n\nDMSA is the only artificial substance that I take. When I use DMSA, I actually feel more energy and a clearer mind within an hour. Several other chemtrail-induced mercury symptoms subside as well.\n\nUnfortunately, DMSA has recently been removed from over-the-counter sales, likely because too many Autistic and ADD children were healed with DMSA, and this was leading parents to realize that mercury is the primary cause of these conditions, and this was casting a very negative light on the vaccine industry.\n\nAlgin helps remove barium, strontium, mercury, and several other heavy metals from the colon. This is one of the most important detox supplements you can use because it mitigates \"redistribution\", which is probably the single largest issue with metal detox. \"Redistribution\" is the process of reabsorbing metals into the body through the colon after they have already been dumped into the colon by the liver. Most people report feeling better when taking algin.\n\nThis product has become so popular that it was brought back by popular demand after being discontinued by our company years ago.\n• Algin (NSP) - This is the only source of algin that I dare use because it's sourced in the Atlantic and always tested contamination. It is a truly excellent product.\n\nThe chemtrail flu is a new phenomenon that appeared in the 2000's when chemical spraying became much more widespread. This flu causes an array of flu-like symptoms but generally without a fever.\n\nWe believe this illness is a direct result of a chemical plume called \"The Swamp Water\" type.\n\nThis is one of the most important and life-changing supplements I take. It's expensive, but I cannot count the number of times it kept me healthy and strong and able-to-work when the rest of my friends and family were sick. I usually begin feeling a difference within 60 minutes of taking my first dose.\n\nTo prevent getting sick, I take 4 capsules every 2 to 3 hours. I will do this 2 to 3 times a day.\n\nTo overcome an illness I already have, I take 4 to 6 capsules every 2 hours about 3 to 4 times. Then I'll back off to 4 capsules every 4 hours until the illness is gone.\n• Immune Stimulator (NSP) - An incredible supplement that stimulates the immune system like nothing else I've tried.\n\nBe sure to give your body what it needs when trying to recover from illness. One useful food is pumpkin seeds. They contain a lot of zinc which helps the immune system tremendously.\n\nIf you prefer to take high doses in supplement form, you can use this:\n• Zinc (NSP) - Very helpful for the immune system.\n\nThe metals being sprayed in chemtrails are extremely oxidative to the body. For this reason, the need for antioxidants is at an all-time high.\n\nIt's widely know that, as a general principle, vitamin E protects the brain from antioxidant damage and vitamin C protects the body.\n• Vitamin E with Selenium (NSP) - (1 to 2 caps daily) because they protect you from oxidative damage of heavy metals, but they won't likely make you feel any better, but they're still very important for defense, especially during detox.\n• Citrus Bioflavonoids (NSP) - You generally take 3000 to 8000 mg daily depending on body weight.\n\nIncreasing the detox capacity of our bodies has never been more important. The following supplements can help.\n• Reduced Glutathione (Jarrow) - Helps your body remove metals and other contaminants from the body. It must be \"Reduced\" because regular 90% of normal glutathione will be destroyed in the stomach.\n• N-Acetyl Cysteine (NSP) - Promotes the body's production of glutathione which removes heavy metals from the body. Start with small doses as this can induce a detox reaction in the body.\n\nHow To Get Involved", "opengraph": {"type": "article", "image": "http://globalskywatch.com/assets/images/open-graph/OpenGraph-Badge,158x158.jpg", "site_name": "GlobalSkywatch.com", "description": "GlobalSkywatch.com Chemtrail/Geoengineering News Forums Conferences."}, "tags": [], "tweets": [], "movies": [], "links": ["../../health", "http://globalskywatch.com/stories/my-chemtrail-story", "http://onlythebestherbs.com/how.php?sn=4061-6", "http://onlythebestherbs.com/how.php?sn=1646-4", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/my-chemtrail-heart-attack.html", "http://onlythebestherbs.com/how.php?sn=3673-1", "http://www.vitacost.com/vitacost-potassium-citrate-99-mg-180-capsules-3", "http://onlythebestherbs.com/Products/Algin", "http://onlythebestherbs.com/Products/Algin", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=44881&an=128#Post44881", "http://onlythebestherbs.com/how.php?sn=507-1", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=31723", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=44881&an=128#Post44881", "http://onlythebestherbs.com/Products/Algin", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#SwampWaterType", "http://onlythebestherbs.com/how.php?sn=1839-3", "http://onlythebestherbs.com/how.php?sn=1657-9", "http://onlythebestherbs.com/how.php?sn=1509-8", "http://onlythebestherbs.com/how.php?sn=1646-4", "http://www.vitacost.com/jarrow-formulas-glutathione-reduced", "http://onlythebestherbs.com/how.php?sn=509-7", "http://globalskywatch.com/what-you-can-do.html", "http://urlbam.com/ha/M003W", "http://globalskywatch.com/v/mcs", "http://gsw.bz/soils", "http://urlbam.com/ha/M0047"], "authors": [], "publish_date": null}