{"result_id": "135040", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/particulate-descent-time.html", "timestamp": "2023-04-25 15:18:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/particulate-descent-time.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Particulate Descent Time", "cleaned_text": "Link to this page using this short URL: urlbam.com/ha/M0074\n\nHow To Measure The Descent Time of Chemtrail Particulates\n\nI have carefully measured the amount of time it takes for both long and short (non-persistent) chemtrail plumes to be detectable at ground level. I have conducted this experiment countless times over the years in the following way.\n\nFirst, I would wait until the air was mild, having very little or no chemtrail taste or odor to it (I can smell and taste chemtrail plumes). Then, I would wait for a jet with a chemtrail to appear and pass overhead and would measure the amount of time it took for the chemtrail taste and odor to become detectable on the ground.\n\nI consistently found that it takes between 15 and 40 minutes from the time the plume is sprayed at a low altitude until the time that I can taste and smell them on the ground.\n\nIn an apparent effort to minimize the number of people noticing chemtrails, in about 2010, many chemtrail jets suddenly began spraying at higher altitudes. Performing the same experiment mentioned above, I found that the particulates usually took between 40 and 90 minutes to descend when dropped at these higher altitudes. On occasion, I found that it took over 4 hours for the smell or taste of the particulates to reach ground level. Because there are so many different chemical types being sprayed, it's only logical to presume that some types will fall much faster than others. The reason for this is explained in the next section.\n\nChemtrails are also sprayed at high altitudes (32,000 to 35,000 feet), but it's not possible to measure the descent time of these plumes for several reasons, including (1) it's hard to spot these jets from the ground, (2) the plumes become too diffused by the time they reach the ground, and (3) the plumes can travel significant distances before reaching the ground, so without detailed wind velocity information at all altitudes, it would be difficult to predict the location at which they reach ground level.\n\nToday, many people refer to short plumes as \"contrails\", but they are not. They have the same tastes and odors as long, persistent chemtrails do. See my article entitled The Great Contrail Con.\n\nSince I wrote this article exposing the descent time of chemtrail particulates, a few skeptics have challenged my honesty claiming that tiny particulates would take hours or days to reach ground level from jets. Here's why they are wrong.\n\nPhysics explains how any two objects dropped from the same distance in a vacuum will reach the ground at the same time. The acceleration of these objects is based on a principle called \"gravitational acceleration\", which is about 32.174 ft/s2 (9.8 m/s2) on Earth. However, when an object falls through the atmosphere, its speed is opposed by air resistance. The greater this resistance, the slower the object falls. The heavier (more dense) the object is, the faster it falls given the same air resistance. So the basic equation for the descent rate of a particle through an atmosphere is a ratio between air resistance and weight.\n\nFor you geeks out there, this is technically an expression of density because density is a ratio of mass to volume, and volume is a primary factor in air resistance simply because the larger something is, the more air resistance it will have. Now back to our explanation.\n\nAs an example, a man falling through the air will fall pretty quickly because he has a low ratio of air resistance to weight. When he opens his parachute, his rate of speed decreases dramatically because his air resistance increases dramatically compared to his weight. The bigger the parachute, the slower the descent. At this scale, this is pretty simple and intuitive visualize, however, when you decrease the size of the object falling through the air, the science remains the same but the process become much less intuitive. So let's walk through it.\n\nIf you drop a hammer (or bowling ball) and a feather together (at the same height) in a vacuum, they will hit the ground at the same time. When you do the same thing in an atmosphere, the feather takes much longer to hit the ground because its ratio of air resistance to weight is much higher.\n\nIn the video above, forward to about 2m 50s to see a bowling ball and feathers dropped in a vacuum at the same time.\n\nNow let's drop a hammer and a nano-particle together in a vacuum. They will hit the ground at the same time, just like the hammer and the feather did. This is simple physics. Now, if we drop a hammer and a nano-particle together in an atmosphere, what happens?\n\nUnlike the feather, the nano-particle has extremely low air resistance because of its extremely tiny size, therefore, it will fall at a high rate of speed. If the nano-particle is a dense metal, like barium, it is heavier so it will fall even faster.\n\nYou can test this principle by taking some solid, iron-based dry laser printer toner and dropping some off the roof of your house onto a piece of white poster board. You will be amazed at how quickly it reaches the ground. Toner is extremelly small, typically 3 microns in diameter (depending on brand, etc.), so it has very low air resistance.\n\nWhen you consider that the nano-particles being dropped by chemtrail jets likely contain barium and other heavy metals, it's not unlike dropping very tiny hammers to the ground. Their mass is very low so they have very low inertia so they don't hurt you when they hit you in the head, but their air resistance is extremely low so they travel very fast.\n\nWhen you think of particulate descent time in terms of numbers like physics does, it makes perfect sense. Remember, it's all about density—the ratio between size and weight—not size alone, and this makes all the difference in the world.\n\nWhy Can I Taste and Smell Chemtrails?\n\nFor me, the taste and smell of chemtrails are overwhelming because my senses of taste and smell are extremely sensitive. When I was younger I believed that everyone was like this but eventually discovered that they weren't. I've come to accept it and use it for good.\n\nUnfortunately, it's not always easy. For example, I like dogs but I could never own one because they have very strong odors. Another problem is with those who wear perfume or cologne in public. It may seem nice to them but to me it's often overwhelming.\n\nOne common medical explanation for people losing their senses of smell and taste is zinc deficiency. As a person's ability to retain zinc diminishes with age, so does their sense of smell and taste.\n\nMercury toxicity is associated with lost senses of smell and taste because mercury rapidly depletes zinc in the body. Seniors with dentures often suffer because dentures generally contain red colorings containing high levels of mercury. This also explains why many seniors experience dementia and hearing loss after denture placement. This also explain sundowning: The phenomenon that dementia and alzheimer's experience that symptoms worsen throughout the day and are at a minimum in the morning. This is because their mercury-emitting dentures are removed at night. In the morning, mercury levels are at their lowest levels. Dentures are put iin the mouth in the morning, so as the day progresses, mercury-blood levels increase causing Alzheimer's and dementia symptoms to increase.\n\nI have found that people have widely varied sensitivities of smell and taste, for example, when chemtrails are overwhelming my senses to the point of pain, Laura (my friend/business partner) is just able to begin tasting them while another friend (Chad) could not smell or taste them at all.\n\nAfter much experience and experimentation, it's clear that chemtrails are sprayed at an intensity that is just below the threshold of smell and taste for about 98% of the public. This is clearly intentional because if the public ever discovered and confronted this chemical assault, they would be actively involved in stopping it.\n\nMy hope is that people won't be deceived simply because they don't taste or smell chemtrails. People must realize that these senses are greatly varied from one person to another.\n\nFinally, I hope that people benefit from the fact that I have these sensitivities and have chosen to use them to help expose the largest crime against humanity in human history: Chemtrails.\n\nIf you see a trail come out of a jet, long or short, persistent or non-persistent, you can be sure that it's a chemtrail.\n\nA close friend shared with me that when he lived in Vacaville CA a few years ago, he would see the jets laying their white trails at dawn every morning and a few minutes later he would see the ground absolutely carpeted with dead bees! He is half Native American so an astute observer of nature and phenomena. I have read your articles saying that you have measured the time between the chemtrails being laid and the fallout landing on the ground or just above us. It is hard to believe it takes such a short time, but you must be right!\n\n \n\n —Barbara\n\nSee A Non-Persistent Trail? It's Either A Chemical Aerosol or a Water-Injection Turbofan\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://urlbam.com/ha/M0074", "contrail-coverup.html", "particulate-descent-time.html", "plumes-change.html", "chemtrail-types.html", "http://urlbam.com/ha/M003j", "the-great-contrail-con.html", "smelling-and-tasting-chemtrails.html", "http://urlbam.com/ha/M001p", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}