{"result_id": "135039", "URL": "http://www.globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/contrail-coverup.html", "timestamp": "2023-04-25 15:18:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/contrail-coverup.html", "encoding": "utf-8"}, "image": null, "domain": "www.globalskywatch.com", "title": "Chemtrail Information - The Contrail Coverup", "cleaned_text": "Link to this page using this short URL: http://urlbam.com/ha/M007O\n\nSince the writing of my series of articles exposing contrails, multiple professional airline pilots have contacted me and thanked me for my stance against the contrail deception. \n\n \n\n All of them told me personally that they have never seen trails come out of jet engines and that they appreciate my work exposing the disinformation about contrails. Every one of these pilots knew that contrails are so rare that most people will never see one in their lifetime, and if they do occur, they are from rare, obsolete water injection engines (which are no longer made) at altitudes so high, they cannot be seen from the ground.\n\n \n\n Each of these professional pilots have flown most of their lives and have always had a deep interest in aviation. Some of them fly mainstream commercial jets while others fly large jets for major parcel carriers.\n\n \n\n If you are a pilot and would like to share information with me, please feel free to contact me any time. I'm always happy to hear from experienced professionals in the field.\n\nI spent years living in 2 of the most heavily traveled air spaces in the world: Tampa, Florida and Washington D.C.\n\nI have lived on military bases and have lived near others. I have traveled and stayed temporarily on yet others.\n\nI flew yearly from Florida to New York for years.\n\nI have flown to all 4 corners of the United States, and to Hawaii.\n\nI have driven to the 4 corners of the United States on multiple occasions and have always watched the skies.\n\nAs a student, I used to collect pictures of aircraft of all types, military and commercial. I amassed a collection consisting of over a couple thousand pages filled with aircraft photographs.\n\nI used to attend skydiving shows and have ridden on skydiving jump flights.\n\nI have family members who were in the military; one is a skydiving ranger.\n\nI grew up in a family that owned airplanes.\n\nI have spent an enormous amount of my life outside and have watched the skies constantly.\n\nI have personally witnessed (likely) well over ten-thousand commercial jet flights in the air over the years.\n\n...and after all these 30-plus years, I have never, ever in my life seen a trail come out of a jet engine at any altitude, under any condition, at any time.\n\nI can taste it. I can smell it. I can feel the painful inflammatory effects of chemtrail spraying.\n\nI have measured the amount of time it takes for the taste and scent of chemtrails to become detectible in the air after spraying is visible, for both long (persistent) trails and for short (non-persistent) chemical trails.\n\nI personally witnessed spraying change from daily long persistent trails to daily short non-persistent trails, and this change happened overnight.\n\nI have monitored the schedules of chemtrail flights and have been forced to plan my life around them because of their health effects.\n\nI was forced to move away from Jamestown, New York to Maine (where spraying was less intense) after becoming so ill with chemtrail-related symptoms that it became difficult to work at all.\n\nI have witnessed their obvious effects on the behavior of others, including children.\n\nI witnessed an entire ladybug colony die after 2 days of some of the most intense spraying I have ever experienced. This event so angered me that I finally called—and spoke with—the head of the Maine Bureau of Air Quality, and other officials.\n\nIn the first three years that I experienced chemtrails (2005 to 2008), more people that I knew (either directly or indirectly) died than in the entire rest of my life combined... and doubled. Most deaths seemed to be from aneurysms, strokes, heart attacks, or cancer.\n\nWithin the first three years that we experienced continuous spraying in my previous town, pets on our street died, including one of our two cats.\n\nI have rain water and dust tests showing abnormal (to say the least) amounts of barium, aluminum, mercury, and other metals that ultimately came from the air.\n\nI witnessed the sky become overcast day-after-day from intense chemtrail spraying for over a year the point that the Bangor Globe reported that we may be experiencing the \"dimmest\" summer in history.\n\nIn March, 2011, my potassium plummeted leading to a heart attack after 2 days of intense chemtrail spraying. Barium—strongly evidenced to be a primary component of chemtrails—rapidly depletes the body of potassium.\n\nA Coverup Too Hard To Believe?\n\nWe know that testing has been performed against Americans by their own government many times. We also know that laws have been passed making this testing legal, even if it kills you.\n\nWe know that at least one witness has come out and confessed that he was compensated to make up a story about what he witnessed during a previous tragedy in American history.\n\nAnother witness was told \"what to believe\" and threatened as well.\n\nIs it too difficult to believe that many Americans and/or ex-military personnel and/or celebrities and/or television personalities have been paid to say that they have witnessed contrails throughout their lives?\n\nIs it possible that these people have been given both a carrot (money) and a stick (threats) to keep them in line?\n\nWe know of an American who was threatened in 2011 for reporting on \"HAARP Rings\" and subsequently suffered his best friend nearly beaten to death shortly after. Many other Americans have suffered similarly for their whistle blowing over the years.\n\nBribes and threats have all happened before for the purpose of covering up a government or industry crime, and now that we are experiencing the largest and most lethal aerial operation in human history, it is certainly not unreasonable to expect that bribed false witnesses will surface in our day-to-day lives and in the national media and on social media in an effort to \"normalize\" chemtrails and convince the public that they are harmless water vapor.\n\nAs unfortunate as it is, we are sometimes lied to by those close to us. We don't suspect them because we trust them, but later in our lives we find out that they have been more faithful to their club, their fraternity, their pride, or their other friends. As many have said over the years, always check information out for yourself and use logic rather than emotion when researching.\n\nThose spreading disinformation about chemtrails would like nothing more than for you to believe that short, non-persistent plumes coming out of jets are harmless contrails. If they convince you of this, then you will ignore these plumes and allow them to spray you without objection, and this is exactly what they want. \n\n \n\n They will tell you that they've seen contrails since they were children. They will tell you that contrails are scientifically proven to contain water vapor. They will tell you anything necessary to make you believe short trails are harmless. This is exactly how disinformation works.\n\n \n\n Beware of those who claim that short plumes emitted by aircraft are \"contrails\".\n\nThey are popping up all over; websites and blogs that try to convince the public that short, non-persistent plumes coming out of jets are \"contrails\". Facebook shills are government employees and contractors who are paid to convince you what short, non-persistent trails coming out of jets are harmless water vapor.\n\nDon't be deceived. Contrails are extremely rare and only occur in conditions that:\n\nIf you see a trail come out of a jet, long or short, persistent or non-persistent, you can be sure that it's a chemtrail.\n\n6. Why Some People Still Believe in Contrails\n\nSee A Non-Persistent Trail? It's Either A Chemical Aerosol or a Water-Injection Turbofan\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://urlbam.com/ha/M007O", "../story/16-Ailments.html", "particulate-descent-time.html", "plumes-change.html", "http://urlbam.com/ha/M006n", "http://urlbam.com/ha/M007N", "http://www.youtube.com/watch?v=CuI6YmrNjdE", "my-chemtrail-heart-attack.html", "http://urlbam.com/ha/M003x", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M007L", "http://urlbam.com/ha/Qzz", "http://urlbam.com/ha/M007M", "http://www.youtube.com/watch?v=lqjjzSrKDQg", "http://www.youtube.com/watch?v=vv9JirX0yzg", "http://www.naturalnews.com/033490_Facebook_infiltration.html#ixzz1h38dVMjU", "the-great-contrail-con.html", "contrail-coverup.html", "a-photo-of-an-actual-contrail.html", "plumes-change.html", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}