{"result_id": "135012", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "timestamp": "2023-04-25 15:17:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Chemtrails In the Bible", "cleaned_text": "You can link to this page using this simple URL: gsw.bz/bible\n\nThis is one of the primary methods used to dumb-down and demotivate (create apathy in) the global population:\n\nSpraying Chemicals on U.S. Citizens is Legal\n\nU.S. PUBLIC LAW 105—85 declares that spraying chemicals and biological agents on U.S. citizens perfectly legal, even if it causes permanent injury or death.\n\nVirtually all types of spraying are allowed. Spraying can be done for virtually any reason whatsoever. Finally, nearly all types of damage are permissible, including permanent damage or death to humans or animals, and damage to the environment.\n\nFollowing is a page displaying the law itself:U.S. PUBLIC LAW 105—85\n\nWant to see this law repealed? See the Facebook page: Facebook Group\n\nDoes the Bible Contain Prophecies About Chemtrails?\n\nIn certain religious practices such as Vodou (popularized as \"Voodoo\") and Santeria, mercury is believed to have special powers. Practitioners carry it around in pouches, sprinkle it on the floor, pour it into a bath, or burn it in candles.\n\nEven in the most popular religions of the world, incense is used that contains high levels of lead and mercury.\n\nSome use it for protection. Others use it for \"spiritual enlightenment\". Some believe that the resulting experiences they encounter as a result of mercury exposure are spiritual experiences. We know these to be schizophrenia, bipolar disorder, ADD, ADHD, autism, dizziness/vertigo, memory loss, and numerous other neurological diseases. The weaking of the human will induced by mercury also opens one up to spiritual oppression and perhaps even possession.\n\nThe practice of utilizing poisons such as mercury is prohibited by Biblical law (Deu 18:11-12, Exo 22:18). This practice is often referred to as witchcraft or sorcery (Strong's #3784).\n\nThe book of Revelation contains several references to \"sorcery\", but when we take a careful look at the original language, we find something very interesting.\n\nThe word \"sorcery\" in this passage is the Greek word \"pharmakeia\" (Strongs #5331) (far-mak-i'-ah). This is the source of the English word \"pharmaceutical\". The true meaning if the word pharmakeia is \"to drug or poison\", so here we see the chemical dumbing down of the world by drugging and poisoning. This is to occur shortly before the return of Christ to Earth. This modern chemical-dumbing-down of the population was predicted in the Bible thousands of years ago.\n\nAs I will show later in this article, the use of mercury in the body (as a \"medicine\" or anything else) is equivalent to the practice of pharmakeia, or \"sorcery\", or \"poisoning\". We can easily relate this word \"pharmakeia\" to \"poisoning\" because the Biblical word for a person who practices pharmakeia is defined as \"a poisoner\".\n\nSo the verse above actually predicts that a global deception will take place. This deception will be facilitated by drugging people with known poisons. The target of this drugging is the people of the nations of the Earth. In fact, this is a direct reference to the dumbing down of the population thereby making them more prone to deception.\n\nWho is going to perform this drugging?\n\nAccording to Revelation 18:23, the great drugging and the great deception will be performed by:\n\nThe word \"great\" does not mean \"good\". It means \"mighty\" or \"powerful\" (Strongs #3175 derived from #3173: \"mighty\"). So who is perpetrating this great drugging? \"Powerful merchants\".\n\nToday, the most powerful merchants in the world are men who own or control global corporations. The most powerful types of corporations in the world are:\n\nThese are not necessarily the only people who will be involved in this deception by drugging, but they certainly qualify.\n\nFurthermore, we should consider that the two most influential lobbies in the United States government are oil and pharmaceuticals. Those educated in this area will immediately think of the Bush family (oil) and the Rockefeller family (oil and pharmaceuticals).\n\nAs the pieces begin to come together, we will discover that the Rockefeller family is spearheading the move for world depopulation, and has been for the past two decades. For in-depth documentation supporting this, please see this video:\n\nAre Chemtrails the \"Sorcery\" Spoken of in Revelation 18?\n\nWe are all familiar with the widespread use of pharmaceutical drugs today, but for the past 20 years, many people have been moving away from the use of drugs, vaccines, genetically-modified (GM) foods, and other known toxins. In fact, in the past few years, this reconstruction of health values has created a virtual stampede toward healthy, natural, organic lifestyles.\n\nWith so many people moving away from drugs, how can Revelation 18:23 be fulfilled? Are there actually enough people still using drugs, vaccines, or mercury-laden \"silver\" fillings to facilitate a global deception?\n\nCertainly not. There must be more to the story. There must be something more invasive that literally \"forces\" people to take drugs and poisons so as to facilitate this massive global deception predicted by the Bible.\n\nWhen you know that mercury and aluminum clearly facilitate the dumbing down of human populations, and when you consider the strong indications that chemtrails contain both mercury and aluminum, then it is reasonable to consider that the chemtrail spraying campaign is the fulfillment—at least in part—of this Biblical prophecy concerning the deception of the nations in the end times.\n\nAs this article is being written, there is widespread talk in the United States, Europe, and Australia about forced vaccinations, and this would certainly qualify as the fulfillment of this prophecy as well.\n\nIn fact, there is nothing in this prophecy to indicate that there is any single event that accomplishes this mass poisoning. The prophecy simply says \"...by your sorcery...\" indicating the general method in which this deception takes place.\n\nIt is likely that several things including pharmaceutical drugs, chemtrails, and mass vaccinations all play a role in the fulfillment of this end-time prophecy concerning the poisoning of the nations to facilitate a great global deception.\n\nWe've already established (above) that the Biblical word \"sorcery\" in Revelation 18:23, when properly translated, means \"pharmacology\", but is there really a connection between pharmacology and \"poisoning\"?\n\nThe book of Revelation contains references to the persons who actually dispense—or practice—sorcery:\n\nIn these passages, the word \"sorcerers\" comes from the Greek word \"pharmakos\" (Strongs # 5332) which is derived from the Greek word \"pharmakon\". It is defined in Strong's Greek Dictionary of the New Testament as follows:\n\nThus, the etymology of the word itself fundamentally-associates the concepts of drugging and poisoning. It would stand to reason that a person who is called a \"poisoner\" is one who distributes \"poison\". Thus, we clearly see the fundamental connection between the Biblical word for \"sorcery\" (pharmakeia) and \"poison\".\n\nFurthermore, since mercury is a potent poison, we can certainly conclude that the distribution of mercury (a poison) is considered \"sorcery\" (poisoning) by the Bible. If this is true, then the mercury in chemtrails can indeed be considered sorcery and therefore a fulfillment—at least in part—of Revelation 18:23.\n\nEven if chemtrails only contain aluminum and barium, as a number of tests (both air and soil) have now indicated, these are still poisons to the body and would be considered Biblical \"sorcery.\"\n\nAluminum is particularly known for interfering with brain function. When mixed with existing mercury, aluminum becomes about 100-times more poisonous to the body. ( Haley, et al.)\n\nBarium interferes with potassium metabolism and can induce heart attacks and stomach pain.\n\nInterestingly, mercury has been used in modern medicine for many years. Mercury was used as a treatment for syphilis as early as 1925 and—despite its know toxicity—continued to be used into the 20th century.\n\nMercury has also been used as:\n• Mercury causes swelling and water retention—the opposite of a diuretic ,\n• Mercury is scientifically known to be an ineffective disinfectant ,\n• Mercury actually causes constipation by blocking magnesium metabolism, and is therefore the opposite of a laxative ,\n• Mercury suppresses the immune system which facilitates continued growth of bacteria and parasites ,\n• Mercury is known to facilitate gum disease, thus it is a particularly poor choice for a teething powder , and\n\nMercury has been used in eye washes, cleaning solutions, and in other products that required an antiseptic.\n\nOne of the most well-known uses of mercury has been to fill dental cavities. Amalgam (\"silver\") fillings are considered the cheapest \"cure\" for these common dental problems.\n\nThe most controversial and well-known use of mercury has been as a preservative in vaccines, even though several standing studies declare mercury a weak and inadequate preservative (Ayoub).\n\nWhat we know today is that mercury is a potent neurotoxin and is the cause for well over 130 common diseases and ailments, both physical and mental. Mercury is quite possibly the single largest cause of disease in the world today. What is shocking about this fact is that science has known the connection between mercury and numerous diseases for over 200 years.\n\nThe fact that mercury has a long history as being used as a \"medicine\"—a pharmaceutical—makes it fit even more perfectly within the framework of Revelation 18:23.\n\nMercury has been considered a \"medicine\" throughout history. In contrast, Biblical medicine has always been associated with plants, and these plants are considered \"food\".\n\nA popular example of this is found in Revelation 22:2:\n\nThere are other examples as well:\n\nOne of the most famous statements in medicine and herbology comes from Hippocrates:\n\nToday, the Food and Drug Administration (FDA) regulates herbal supplements as \"food\", and this makes sense as herbs are indeed food.\n\n\"Destroy Them Which Destroy The Earth\"\n\nThe Bible speaks about a group of people that live near the end of the current age (right now) who \"destroy the Earth\". This verse states that God will destroy those who destroy the Earth:\n\nThe word \"destroy\" here (in both instances) is the Greek word diaphtheiro (Strongs #1311) which is defined in Strong's as:\n\nSo the act of \"destroying the Earth\" in this verse is not necessarily talking about the complete and utter destruction of the Earth, but rather the process of \"ruining\" the Earth.\n\nIt's interesting that the Greek word (translated \"destroy\") makes a reference to rotting and that studies have shown that chemtrails contain mold spores which indeed cause rotting.\n\nIt's also important to contemplate that chemtrails are destroying the Earth by ruining soil, contaminating water, killing insects and wildlife, and harming people.\n\nWho Made the World \"as a Wilderness\"?\n\nFollowing is a prophecy from Isaiah that makes several interesting references to the time near the end of the age.\n\nTo look narrowly upon someone is to squint when you look, as if to say, \"Is this really true?\" This is still a common gesture today.\n\nThis phrase indicates the shock that people will feel when they discover that this mere man—the \"anti-Christ\"—caused all this destruction upon the Earth.\n\nIt is becoming more widely accepted that HAARP—a very-high power antenna array in Alaska—can cause earthquakes to occur in select locations.\n\nThis is still a \"secret\" operation so drawing hard conclusions is difficult, nevertheless, a growing number of scientists admit that it is possible. Furthermore, (now) well-known patents reveal the design and far-reaching capabilities of just such a device.\n\nIt's compelling to find that the Bible clearly states that a man—the anti-Christ—is responsible for making the Earth tremble. Without modern technology, this would certainly not be possible.\n\nThe word shake (râ‛ash in Greek) means undulate, as through fear.\n\nA good example of this would be the fearful threats of martial law and financial collapse that was threatened against the U.S. congress if they didn't pass the bailout bill.\n\nMore info: Congress Passes Bailout Amidst Secret Threats of Martial Law and Market Fallouts—Congressman Sherman\n\nDepopulation (mass murder on a scale never before seen in human history) seems to be one of the goals of chemtrails.\n\nNews articles have already been written about the need to bulldoze entire cities in the U.S. (These articles are being likely written to precondition Americans for the mass-dozing of cities across America. As chemtrails cause massive depopulation, surviving Americans must not panic at the sight of cities disappearing. Articles such as this—previous link—will ease the shock and help the powerbrokers to maintain order during this transition).\n\nWhen the world is depopulated to the levels they propose, they will have indeed turned large portions of the world into a wilderness.\n\nThe original word for wilderness in Greek is midbâr, which means a pasture or by implication, a desert.\n\nThis is very interesting because we know that chemtrails contain barium salts and aluminum.\n\nBarium salt has a very drying effect on everything it touches. It can be used for \"Salting the Earth\", as was done during various wars to subvert the food supply of the enemy. This drys the earth and alters the pH in such a way as to create a barren wasteland—a desert.\n\nWe are already seeing reports of aluminum-stressed trees and plants in various locations around the world:\n\nAs the power brokers destroy the economies of the world in order to complete their \"order from chaos\" paradigm—a phrase taken from their own literature—we will see the deliberate destruction of entire cities and suburbs as a means to the centralization of power that power brokers so desire.\n\nUS cities may have to be bulldozed in order to survive\n\n\"opened not the house of his prisoners\"\n\nShortly before the return of Christ, it is clear that many will be imprisoned and killed because they are Believers in Christ and do not accept the authority of the world power brokers. These people also tend to be the type who continually expose the global conspiracy and preach and teach the fundamental principals of freedom.\n\nOf course, the power brokers don't appreciate getting this kind of exposure, so these Christians/Conspiratorialists will be locked up where they can no longer spread these ideas, many will be murdered, but those who remain will not be set free until the return of Christ Himself, hence: the anti-Christ \"opened not the house of his prisoners\".\n\nFeel free to pass the following images around.\n\nThey are sized to work well in a Facebook gallery, on a website or blog, or attached to an email.\n\nThe graphics below are compressed by your browser. To see them full-sized and in high-resolution, right-click on them and select \"View Image\".\n\nHigh-Bypass Turbofans DO NOT Produce Contrails. So What Are Those Lines in the Sky?\n\nThe Lines In The Sky Are Not Contrails: Definitive Evidence\n\nThe Biblical \"Mystery Babylon\": What Is It? (video)\n\nApollyon Rising 2012: The Great Seal of the United States and the Rise of Antichrist (video)\n\nNew Age Bible Versions: Rewriting the English Bible -The Luciferian Conquest of Global Media (video)\n\nExposing the Illuminati from Within, Parts 1 and 2 (video)\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "object", "provider": "youtube", "width": "560", "height": "340", "embed_code": "<object width=\"560\" height=\"340\"><param name=\"movie\" value=\"http://www.youtube.com/v/izjfdfDHjWQ&amp;hl=en_US&amp;fs=1&amp;\"/><param name=\"allowFullScreen\" value=\"true\"/><param name=\"allowscriptaccess\" value=\"always\"/><embed src=\"http://www.youtube.com/v/izjfdfDHjWQ&amp;hl=en_US&amp;fs=1&amp;\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"560\" height=\"340\"/></object>", "src": "http://www.youtube.com/v/izjfdfDHjWQ&hl=en_US&fs=1&"}], "links": ["http://gsw.bz/bible", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M003Y", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=31723#Post31723", "http://urlbam.com/ha/M001p", "http://urlbam.com/ha/M001p", "http://gsw.bz/nano-aluminum", "http://urlbam.com/ha/M001R", "http://www.911weknow.com/about-the-sky/tree-decline", "dead-ladybugs.html", "http://globalskywatch.com/chemtrail-illness.html", "http://www.youtube.com/view_play_list?p=FE35C6D4EA139241&search_query=haap+ventura", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=43163#Post43163", "http://urlbam.com/ha/M0038", "http://www.telegraph.co.uk/finance/financetopics/financialcrisis/5516536/US-cities-may-have-to-be-bulldozed-in-order-to-survive.html", "http://en.wikipedia.org/wiki/Salting_the_earth", "http://www.holmestead.ca/chemtrails/soiltest.html", "http://www.911weknow.com/about-the-sky/tree-decline", "http://urlbam.com/ha/M0037", "http://www.telegraph.co.uk/finance/financetopics/financialcrisis/5516536/US-cities-may-have-to-be-bulldozed-in-order-to-survive.html", "http://urlbam.com/ha/M002w", "http://urlbam.com/ha/M003H", "http://urlbam.com/ha/M003c", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=14966#Post14966", "http://urlbam.com/ha/M003H", "http://urlbam.com/ha/M002w", "http://urlbam.com/ha/M0021", "http://urlbam.com/ha/M001D", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r"], "authors": [], "publish_date": null}