{"result_id": "135030", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-killed-the-bees.html", "timestamp": "2023-04-25 15:18:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-killed-the-bees.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Chemtrails Killed the Bees", "cleaned_text": "Link to this page using this short URL: gsw.bz/bees\n\nUPDATE June 7, 2015\n\n \n\n NEW STUDY: Academics Now Recognize Aluminum as Key Potential Cause of Bee Decline\n\n \n\n A new study published June 4, 2105 exposes aluminum as a factor in bee decline. This study makes a few shockingly-honest statements.\n\n \n\n The first statement:\n\n \n\n \"While recent attention has focused upon pesticides, other environmental pollutants have largely been ignored.\"\n\n \n\n I believe aluminum testing has been intentionally ignored in the corporate-controlled academic community specifically to prevent bringing attention to the ongoing aluminum-aerosol spraying campaign.\n\n \n\n The second statement:\n\n \n\n \"Aluminum is the most significant environmental contaminant of recent times...\"\n\n \n\n Finally, honest academics—who are not controlled by establishment banker/industrialists—admit that aluminum is a new and significant problem. \n\n \n\n Where is all this new aluminum contamination coming from? All evidence points to ongoing aerosol spray programs being performed in numerous countries worldwide.\n\n \n\n It has been my position all along that aluminum is now the primary cause of insect decline. The unprecedented spraying of very fine aluminum powder has decimated insect populations and has facilitated animal die-offs and the sudden rise of lung cancer to the position of #3 killer of humans despite smoking being at an all-time low.\n\n \n\n The article below exposes how bees and ladybugs virtually vanished in direct temporal relation to aerosol spray events. In fact, historically, all major bee decline events have occurred after heavy aluminum aerosol spraying campaigns began.\n\n \n\n Now that a few honest academics are reincorporating common sense hypothesis back into the scientific process, we can make enormous strides in connecting catastrophic animal and insect declines to ongoing metallic aerosol spray campaigns.\n\nLink To This Section (right-click to copy link address) \n\n \n\nUPDATE: July 12, 2022 - Creating Disasters: Hiding Insect Decline From the Public\n\n \n\n This is a long overdue update about the history of insect and bee decline.\n\n \n\n From 2005 to 2010, spraying was most intense and we witnessed mass insect die-offs. By 2010, the die-offs were getting much press and causing much public concern.\n\n \n\n Between 2010 and 2012 we saw a noticeable decrease in average spray intensity which lasted until 2019 when intensity increased again, but with different chemtrail types.\n\n \n\n This decrease in intensity was likely because massive insect and animal die-offs were scaring the public and convince the public that chemtrail spraying was actually happening. Of course, those of us who smell and taste chemtrails in the air need no convincing.\n\n \n\n Since globalists do not want the public to believe that they are being sprayed with known poisons, they decreased average spray intensity to allow a partial insect population recovery. They then ran a propaganda campaign blaming the collapse on a certain class of insecticides.\n\n \n\n They backed up this propaganda with a conveniently-timed study blaming the insecticide despite the fact that it had historically been used for a long time. They credited the ensuing (partial) insect recovery on the EPA's decision outlawing this insecticide. They glamorized the benefits of strong regulation.\n\n \n\n This, folks, is a propaganda campaign.\n\n \n\n In 2019, chemtrail spray intensity was increased again to levels only a little below the 2005-2010 levels. Consequently, we are witnessing another insect die-off, but this time media is largely ignoring it.\n\n \n\n Besides the reports coming in from around the world on secondary news sources, I have witnessed a dramatic insect decline in our area. Living in rural Maine, we used to have between 3,000 and 4,000 insects around the front porch light. In the past couple years, this has decreased to about 300 to 400, a tenfold decrease.\n\n \n\n Being that I can smell and taste chemtrails in the air, I have witnessed the temporal relationship between increased spray intensity and insect die-offs. Many around the world are reporting the same.\n\n \n\n You may ask why ultra-rich globalists would do this. The answer is simple, and they have revealed it themselves.\n\n \n\n Globalists are intentionally creating global disasters and calling for global government (\"New World Order\") as the solution to these problems. Whistle blowers have revealed that the list of intentionally-created disasters includes war, pollution, weather/drought, disease (human and animal), terrorism, Runaway CO2, biosphere collapse, \"global warming\", depletion of the ozone layer, asteroids, and more. \n\n \n\n You may ask how they could create a disaster based on asteroids. Their own solution is simple. They explode powerful bombs under the ocean and blame the disastrous tidal waves on an asteroid hitting the ocean. Would you be surprised to know that globalists have openly admitted to exploring this technology as a wartime weapon?\n\n \n\n\n\nIt's one of the most beautiful parts of the country. Western New York is lush from an abundance of lake effect rain and snow from Lake Erie.\n\nThousands of acres play host to Welch's concord grapes forming miles of geometric borders along the lake. In the fall, the concord grape scent saturates the air creating a surreal atmosphere. Wineries line the landscape. People come from all over the world to visit them.\n\nThe abundant rainfall creates a virtual rainforest. Everything grows and flourishes; plants, animals, flowers, and bees.\n\nI lived in western New York from 2003 to 2008. To walk in my western New York lawn was to walk in a field rich with grasses and clover. It buzzed thick with the activity of thousands of bees which created a soothing humming in the air like the quiet roar of a distant amphitheater.\n\nYou wouldn't dare walk on the lawn with bare feet. If you stood anywhere in the lawn you would see hundreds of bees at any of day. In all my life, I've never seen anything like it.\n\nI moved to Jamestown in 2003 and had a beautiful view of the city and the sky from my home-office window, but in 2005, I saw the beginning of daily chemical aerosol (\"chemtrail\") spraying. The jets suddenly began coming every day at 3pm and sprayed until 7pm making the sky completely overcast in less than 4 hours. The intensity and frequency of the spraying increased throughout the winter but was always on a predictable schedule.\n\nThe very next spring, there was no more hum. Nearly all of the bees were gone. For as long as I remember and had visited this place, I remember the bees, but this year—the first summer after the chemtrail assault began—the bees had suddenly, for the first time ever, disappeared.\n\nIs it a wild coincidence that this first-ever die-off of the bee population occurred the summer immediately after chemtrails began?\n\nThe numerous cover stories claiming that a pesticide killed off the bees are nothing more than disinformation pumped out by the military industrial complex. They are covering up the clear evidence of the collateral damage caused by toxic chemical aerosols.\n\nDon't be deceived. There is no limit to the amount of your tax money they will spend to protect themselves from the legal and criminal charges they would face if ever held accountable. Disinformation complete with well-constructed false-science has been used for decades to legitimize profiteering's destructive agendas.\n\nThe Jamestown bee die-off is not an isolated incident. After moving to Maine, during 3 days of intense spraying, I watched as an entire ladybug colony died right in front of my eyes. In fact, dozens of massive animal and insect die-offs have occurred since widespread chemical aerosol spraying began.\n\nWe used no pesticides in Jamestown, and we use none here, but toxic chemtrails fill the sky in both locations. I was forced to move away 2½ years after the bee die-off to save my own life. The bees didn't have that choice.\n\nUnfortunately, many don't notice what is going on right above their heads, but for those who pay attention, the truth is obvious:\n\nA close friend shared with me that when he lived in Vacaville CA a few years ago, he would see the jets laying their white trails at dawn every morning and a few minutes later he would see the ground absolutely carpeted with dead bees! He is half Native American so an astute observer of nature and phenomena. I have read your articles saying that you have measured the time between the chemtrails being laid and the fallout landing on the ground or just above us. It is hard to believe it takes such a short time, but you must be right!\n\n \n\n —Barbara\n\nSee A Non-Persistent Trail? It's Either A Chemical Aerosol or a Water-Injection Turbofan\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://gsw.bz/bees", "../../../assets/news/bee-decline/Bumblebee-Pupae-Contain-High-Levels-of-Aluminum.pdf", "http://orbisvitae.com/mc/Know-Your-Enemy/46,Science-Dictatorships.html#a", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=76788#Post76788", "http://globalskywatch.com/articles/Kristen-Meghan.html", "dead-ladybugs.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=1285#Post1285", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-killed-the-bees.html#HidingInsectDecline", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6395#Post6395", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=1285#Post1285", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/smelling-and-tasting-chemtrails.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=92926&an=128#Post92926", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=76788#Post76788", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=1485#Post1485", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6424#Post6424", "https://www.geoengineeringwatch.org/california-drought-how-to-party-on-the-titanic/", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=95729#Post95729", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=18659#Post18659", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=1285#Post1285", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=18692#Post18692", "https://www.geoengineeringwatch.org/biosphere-implosion-and-societal-collapse-its-not-coming-its-here/", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=59898", "https://www.geoengineeringwatch.org/category/geoengineering/results-of/ozone/", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=52451#Post52451", "http://urlbam.com/ha/M0075", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=55867&Searchpage=1&Main=11553&Words=journals&Search=true#Post55867", "http://urlbam.com/ha/M000R", "dead-ladybugs.html", "http://urlbam.com/ha/M003s", "../story/01-Welcome.html", "dead-ladybugs.html?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400"], "authors": [], "publish_date": null}