{"result_id": "135016", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/spraying-themselves.html", "timestamp": "2023-04-25 15:17:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/spraying-themselves.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Aren't They Spraying Themselves?", "cleaned_text": "Link to this page using this short URL: gsw.bz/themselves\n\nOne of the most common questions I get asked regarding chemtrails is this:\n\n\"If they are spraying toxins into the atmosphere, aren't they spraying themselves?\"\n\nChemtrail particulates are everywhere, but they are far more concentrated when spraying is taking place overhead. Nevertheless, we have to wonder if and why those in the highest positions of \"public service\" would allow themselves to be exposed to these toxins.\n\nIMPORTANT: In order to understand this article, it's vital that you understand the following concept. There are at least four explanations that the so-called elites allow themselves to be sprayed. The first two reasons described below relate to high-level politicians, but the last two reasons relate only to the very highest-level political leaders. Many of these politicians are part of a special, \"elite\" religion, and like any religion, some dabble in their beliefs for the benefits it offers, but others take it deadly seriously.\n\nNOTE: This article delves into the dark depths of the beliefs of the so-called \"elites\". Please be sure to view the supporting links before making judgements about this information. If you take the time to view all the material that we link to, it will help you understand why the world is in the condition it is today.\n\n#1 They don't allow themselves to be exposed to high-density spraying\n\nI receive eyewitness chemtrail density reports from people all over the world, and one of the most interesting observations people have made is this:\n\nIs it possible that they reduce or cease spraying in areas where high-level \"officials\" are meeting? Absolutely!\n\nIn the future, don't be surprised if this trend does not continue. Do not be surprised if you see spraying continue in areas where these high-level meetings take place.\n\nThese people are experts at disinformation, so it would be simple enough to equip a small fleet of jets with the ability to emit harmless trails by injecting large amounts of water into the engines and then emit water vapor trails during these meeting. Of course, they would do this to convince skeptics that chemtrails are harmless contrails by posing this question: \"Why would they spray themselves?\"\n\nWe must not be so naive, and we must not underestimate their cunning, their determination, and their access to tremendous resources.\n\nNormal consumer air filtration devices do not remove chemtrail particulates from the air, however, air filtration devices do exist that remove metallic nano-particles from the air, but these devices are very expensive.\n\nThe small number of very-high-level government officials who know about geoengineering can easily afford these wildly expensive air filtration devices. Spending $10,000 to $50,000 to have them installed in their residences amounts to little more than day's wages.\n\nIf money was no object and you had access to filtration devices that remove all chemtrail toxins from the air, would you be willing to spend the money?\n\nIt's not unlike the elites to plan far ahead to protect themselves and their interests. over the past decade, the elites have stockpiled seeds in enormous vaults in various locations around the world. We must ask ourselves whether these seeds are for their own personal use, or are they going to be used to replienish the Earth once chemtrails have destroyed the soils.\n\nIn the past decade, Brookhaven National Laborary has developed a technique for removing mercury from soils using sulfur-impregnated carbon rods. Will the elites' contractors be rewarded enormous contracts to repair soils or will they just buy up the destroyed land for pennies on the dollar?\n\n#3 They believe they are entitled and are willing to die for their beliefs\n\n1968 Skull and Bones with George Bush in the Back row (sixth from left).\n\nPerhaps the most bizarre reason these high-level officials are willing to be exposed to artificial airborne toxins is that they serve a religion that promises them great rewards in the afterlife if they perform their duties well. They are, therefore, willing to die in the course of their \"service\".\n\nAs strange as this may seem, this information is straight from their own literature. This literature, which has been made available to the public by a decades-long series of defectors and whistle blowers, exposes the fact that this mysterious religion rewards them even if their duties involve killing people.\n\nThe Biblical prophecy exposes this violent religion describing it like this:\n\nFurthermore, the prophecy seems to expose one of the real purposes for chemtrails, namely, to dumb down the population of the entire world so they will be unable to discern or resist the emergence of the final, short-lived kingdom (the emerging one world government) that will rise to power shortly before the return of Christ:\n\nIn this passage, the word \"sorcery\" is the Greek word \"pharmakeia\" (far-mak-i'-ah). It is the source of our modern word \"pharmaceutical\". The word \"pharmakeia\" means \"to drug or poison\". In this passage, the world \"merchants\" means \"wholesaler or manufacturer\", and the word \"great\" means \"powerful\". So if we exchange the original words for their direct modern equivalents, the passage would read:\n\nThousands of years ago, the Biblical prophecy revealed that this present dumbing down of the population by drugs and toxins would be a means to an end used by powerful members of the \"Mystery Schools\" religion (this is their own name for their religion). These members consider this dumbing down process their \"right\" and they know that it must be done in order to subdue public resistance against their one world government. Dumbing down the public using drugs and toxins is the method by which powerful men increase and secure their power through a centralized political entity—a one world government which they often refer to as a \"New World Order\".\n\nBeing that the Bible exposes the plan of these \"powerful merchants\" and reveals who they are, it should not surprise us that they attempt to discredit the book by twisting and slandering it in mainstream media and collect textbooks which are primarily funded by corporate foundations.\n\nThey believe this one world government can only be achieved by depopulating the Earth. Their religion teaches them that they are exercising their \"rights\" in committing this mass murder simply because they were born into power. In fact, their religion teaches that \"Might Makes Right\", meaning that those in power deserve the power they have been born into. They believe they are free to define the moral boundaries by which they live. The summation of their moral boundaries is quoted in one of their foundational books entitled \"The Book of the Law\" which says:\n\nAs bizarre is it may sound, many rock stars have come forward in recent years admitting that they have \"sold their souls\" to the \"chief commander\" or the \"grand architect\" in exchange for fame and fortune.\n\nIn this video from the popular \"news\" show 60 Minutes, Bob Dylan says he made a \"bargain\" with the \"chief commander...on this Earth and in the world we can't see\". Listen carefully. He actually appears to begin to say \"deal with the devil\", but he stops himself and says \"bargain\" instead. The word \"devil\" has been edited out and the video cuts away from Dylan so you can't read his lips.\n\nLikewise, \"Rock-Star Politicians\" have also sold their souls, and like musicians, they are expected to hold up their end of the \"bargain\", as Bob Dylan states in the above video.\n\n\"Holding up their end of the bargain\" means that they must follow the orders that are given to them. This is openly exposed during the initial oaths of many secret societies today. In exchange for their obedience, these members receive special personal favors and business advantages.\n\nSometimes, these orders come from a very surprising source.\n\nProfessor Walter Veith exposed how he learned first-hand about orders (directives) being passed from spiritual channelers to high-level politicians in many countries. Professor Veith learned that his father was directly involved in the process of securely delivering these orders for many years, so Walter exposed this publicly. Based on solumn oaths, the secret society members who receive these directives are obligated to follow them or face serious consequences.\n\nIn short, these Rock-Star Politicians have taken an oath to follow the orders they are given whether they come from their superiors or through spiritual channelers.\n\nWhat is the source of these orders which come through spiritual channelers?\n\nMany around the world have learned about the pyramid structure of secret societies and understand why the pyramid is so often used as a symbol of the power structure of secret societies behind global government.\n\nAt the top of the pyramid is a \"cornerstone\" with an eye which emits an aura radiating light. This eye represents the \"spiritual commander\" (a.k.a. \"the great architect\") who must be obeyed by modern secret society members or they will face dire consequences. The etymology of the word \"luce\" is lux, which means \"light\". This light is the one they call \"Lucifer\".\n\nAs strange as this information sounds, it comes directly from their own literature and their own internal correspondence.\n\nThis belief that Lucifer is God, which is held by high-level politicians and the \"powerful merchants of the Earth\", is exposed in the Bible as \"the lie\". The Bible states that this lie will become prevalent shortly before the return of Christ. The literature of the secret societies states that they will \"externalize\" (make public) their belief (that Lucifer is God) during the establishment of their one world government. We are witnessing this externalization in everything from mainstream media to Saturday morning cartoons right now. If you know what to look for, you will see it going on all around the world today.\n\nIn summary, when we learn about the pervasive nature of modern secret societies, we learn that their members are expected to follow orders, even if it means participating in a global campaign to litter the Earth with toxic nano-particles. Few men have the courage to face the consequences of disobeying direct orders, and history has shown us that those who do, don't live long after.\n\nThere are many layers to the onion that shrouds modern secret societies, and since secret society members have risen to the most powerful political positions in the modern world, their actions and secret beliefs permeates their political careers.\n\nDo not be surprised to find that the level of secrecy and deception prevalent in modern politics pervades to depths you never thought possible.\n\nAquarius: The Age of Evil (one of the most important videos available)\n\nNew Age Bible Versions: The Conquest of Global Mainstream Media\n\nThe Kay Griggs Interview: A Rare Look Inside the Military Industrial Complex\n\nWhy Some People Still Believe in Contrails", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe width=\"480\" height=\"360\" src=\"http://www.youtube.com/embed/-whkDP8bK2Q?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "http://www.youtube.com/embed/-whkDP8bK2Q?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe width=\"480\" height=\"360\" src=\"http://www.youtube.com/embed/gwJDs1cg9Eo?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "http://www.youtube.com/embed/gwJDs1cg9Eo?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "360", "embed_code": "<iframe width=\"480\" height=\"360\" src=\"http://www.youtube.com/embed/xCOF2WmNHOk?rel=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "http://www.youtube.com/embed/xCOF2WmNHOk?rel=0"}], "links": ["http://gsw.bz/themselves", "particulate-descent-time.html", "the-great-contrail-con.html", "http://urlbam.com/ha/M003u", "air-purifiers.html", "http://urlbam.com/ha/M004r", "http://urlbam.com/ha/M005S", "http://orbisvitae.com/mc/Mystery-Babylon-Series/", "http://urlbam.com/ha/M005l", "http://urlbam.com/ha/Y", "http://urlbam.com/ha/M0037", "http://urlbam.com/ha/M005s", "http://urlbam.com/ha/M004x", "http://urlbam.com/ha/M005v", "http://urlbam.com/ha/M002w", "http://orbisvitae.com/mc/Mystery-Babylon-Series/", "http://urlbam.com/ha/M0021", "http://urlbam.com/ha/8zzzz", "http://urlbam.com/ha/M0003", "http://orbisvitae.com/mc/Know-Your-Enemy/", "http://urlbam.com/ha/M007c", "http://urlbam.com/ha/M005l", "http://urlbam.com/ha/M0021", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M006O", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html"], "authors": [], "publish_date": null}