{"result_id": "135006", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/why-chemtrails.html", "timestamp": "2023-04-25 15:17:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/why-chemtrails.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - Why Chemtrails?", "cleaned_text": "Link to this page using this short URL: http://urlbam.com/ha/M0073\n\nWhy is Anyone Interested In Spraying Chemtrails?\n\nI have taken a lot of time to assemble this story because I firmly believe that chemtrails are harming and killing people.\n\nThey caused me to have a low-potassium heart attack in March, 2011 (ambulance ride and everything). We have all witnessed the continuing trail of dying celebrities. Many of us have also witnessed our friends and relatives falling sick or dying in the past few years.\n\nIn my own documented experience, you can clearly see from the list of ailments that I am experiencing from chemtrails (on the Ailments page) that the symptoms of mercury poisoning and chemtrail poisoning are very similar. Combined with the fact that many of the symptoms we experience during spraying can only be attributed to mercury poisoning, we now have tangible symptomatic evidence that chemtrails contain mercury (in addition to aluminum and barium).\n\nSoil levels of barium, aluminum, and mercury are all rising at alarming rates, and although we often hear about aluminum and barium, we don't often hear about mercury. None of these metals are helpful for life. Additionally, they are well known to be extremely harmful. This should lead us to the question, \"Why are they spraying?\"\n\nHaving studied law (personally, not in school) and spending a lot of time studying political history, I have come to the firm conclusion that there are 4 primary purposes for the chemtrail campaign:\n\nSee The Leading Cause of Death Globally That You've Never Heard About\n\nFirst, it's a cover-your-ankles campaign.\n\nThe pharmaceutical industry—probably the most powerful lobbying group on the planet—is currently poised on the edge of a cliff because of potential litigation resulting from the death and harm caused by mercury in vaccines. Add to this the rapidly-growing percentage of the population that has learned about mercury and is now refusing vaccines. This has caused human exposure to mercury to drop dramatically.\n\nWith this sudden drop in mercury exposure, you would expect mercury-related diseases—like ADD, ADHD, and autism—to decline. This decline would provide compelling epidemiological (population-based) data that would (again) point to mercury as the cause.\n\nWith the mountain of data that already exists condemning mercury as a major cause of disease, this epidemiological data could tip the scales and cause a landslide of litigation that would bankrupt the pharmaceutical industry—a good thing, in this author's opinion.\n\nTo prevent this landslide, the pharmaceutical companies had to find a way to distribute mercury—or some other childhood disease-causing toxins—to the population. Chemtrails are the perfect solution because inhaled nano particles of mercury or aluminum cause health effects very similar to vaccine-injected mercury. When you inhale these tiny particles, they pass right through the lungs and become immediately available to the bloodstream. Chemtrails are a literal vaccination from the sky.\n\nFurthermore, drenching the population with toxic metals has the added benefit of making millions of people sick, which is the way pharmaceutical corporations grew to be the second largest industry in the world, second only to oil. They sell people the instrument of disease (toxins in vaccines), then they sell people the solution. It's called \"Machiavellianism\" and it's a very effective scheme to get rich quick.\n\nIt's important to realize that the pharmaceutical companies are not working alone. They don't have the jets and other infrastructure, nor the authority, required to carry out an operation of this magnitude. This would take the federal government and the military working together. In my studies, I discovered that they do work together, so much so that they could be considered the same organization.\n\nTo this same end (illness and death), high-powered figures in the government have exposed their supported for population control.\n\nIt is well-known among contemporary researchers that a modern-day population control agenda is aggressively under way.\n\nThere are two modalities to population control:\n\nIn this respect, mercury is the perfect poison, fulfilling both of the above requirements.\n\nMercury causes cancer, miscarriage, birth defects, and a host of other common diseases that end or severely shorten life spans. In fact, most major diseases today can be traced to mercury toxicity. The greatest benefit of the use of mercury in this regard is the fact that these diseases are not known to be associated with mercury by modern medical practitioners (despite the connection in medical literature); therefore, people never suspect that their diseases or the death of their loved ones was ultimately caused by mercury.\n\nMercury is toxic to both the male and female reproductive systems. It induces sterility, yet, this symptom of mercury poisoning is completely ignored in modern medical training.\n\nThe details of this induced sterility are discussed in the video by Dr. David Ayoub called \"Mercury, Autism, and the Global Vaccine Agenda\". This is one of the most important videos any parent will ever watch.\n\nPopulation control is a hot subject. It is also a subject that is polarized: you either know all about it or you know nothing about it.\n\nThere is no sense in explaining current population control policy or agendas because many have already done this very effectively. So, I will provide you with a few links below that will introduce and document the subject. I trust that you—as a loving parent, and humanitarian—will follow up by searching the internet for more information. The information is available, well-documented, and easy to find.\n\nFollowing are the documentation links.\n\nGMO giant Monsanto has developed seeds for agriculture that are resistant to free aluminum in soils. If chemtrails contain aluminum, which all evidence now supports, then eventually the pH of soils will shift and make it difficult for many agricultural crops to grow. Monsanto, with their new aluminum resistant seeds, will come to the rescue and sell their patented seeds and in return, will gain enormous control over the world's food supply.\n\nI spoke to the head of the Maine Bureau of Air Quality in 2010 who told me that the aluminum levels in Maine soils has risen over the past few years. He then went on to offer several explanations for this, none of them related to chemtrails.\n\nMultiple tests conducted by scientists in California have revealed rising soil aluminum and barium levels.\n\nWhite bark syndrome is the slang name given to the disease found in an ever-increasing number of trees. The white bark on these trees has been tested and found to contain high levels of aluminum.\n\nWhite nose disease is the name of the mysterious disease in the northeast that is causing bats to fall out of the sky dead. The disease may be the result of chronically depressed immune systems allowing opportunistic fungal infections. Barium is well-known as an immune system depressant.\n\nI personally witnessed the die off of an entire ladybug colony during 2 days of very intensive spraying here in Maine in 2008.\n\nAs soils become more and more aluminum toxic, the future of food looks bleak, but the future of Monsanto looks extremely profitable.\n\nSo what is the connection between the military, who is spraying chemtrails, and Monsanto?\n\nThe connection is clear and well-known among geopolitical researchers but is too big to cover in this article. Nevertheless, if you understand what controlled regulation is, then you probably already understand how corporations control governments.\n\nSee The Final Threats That Will Be Used To Implement Global Government\n\nAnother major purpose of chemtrails opens a Pandora's box of conspiracy and conjecture, the world is clearly undergoing a major political shift that is thrusting every nation—against the will of the people—toward a centralization of power. Nearly all nations of the world have surrendered their sovereignty to the United Nations in the past 20 years. This has been accomplished through a series of changes in law that either \"harmonize\" national law with United Nations policy, or subjugates national law to United Nations authority.\n\nThese massive, yet relatively silent, changes to the political structure of the world are drawing a picture that looks eerily similar to predictions made in the Bible.\n\nI'll leave the detailed research of this intriguing subject in your capable hands, but I will condense this massive concept to this all-important residue:\n\nThe shift of power—although already legally accomplished—will take much coercion in order to bring the hearts and minds of the people of various nations into acceptance. The most effective fundamental method of mass coercion is through the use of fear, and few things can induce fear more effectively than a perceived shortage of food.\n\nThe punch line for this coercion of the people to accept a centralization of power is this:\n\nIn order to unify the nations, you must create a new structure—a new order—from a synthesized chaos. This chaos must be global and it must be frightening enough to coerce people into giving up their basic human rights in exchange for security: Security provided by—you guessed it—the United Nations.\n\nSo, where does the chaos come from?\n\nIt comes—in part—from the deterioration of the environment\n\n (among other sources).\n\nSince chemtrail spraying began in various places around the world, we have seen a growing number of anomalous events that seem to be connected. There have been bats dying, the loss of entire ladybug colonies, square-miles of oceans covered in an unknown fibrous organism similar to Morgellon's, and now the mysterious loss of trees. Are the trees dying of some known disease? No, their bark is turning white from the ground up as if they are pulling something up from the soil—aluminum—a substance known to be a component of chemtrails.\n\nNaturally, the architects of this plan will blame overpopulation for the visible Earth changes, environmental issues, drought, famine, pestilence, and whatever other problems they induce. These changes will induce the necessary fear to cause people to change their values and become willing to accept a loss of personal rights in exchange for security, food, and other commercial \"benefits and services\".\n\nSo the ultimate outcome of the destruction of the environment by chemtrails is the centralization of power: The justification for the need for a global government to solve global problems; problems they created.\n\nWe believe there are other uses for chemtrails as well, such as HAARP EMF waveguides. The ionized tunnels through the atmosphere created by chemtrails are perfect for increasing the efficiency-of-propagation of EMF waves.\n\nWe won't cover this now, but may expand this article in the future to provide an explanation.\n\nThe book of Revelation actually talks about global industrialists (called \"merchants of the Earth\") using drugs and poison to dumb down the global population (\"all the nations\") for the purpose of mass deception shortly before the return of Christ. This book uses the word \"sorcery\", but when we take a careful look at the original language, we find something very interesting.\n\nThe word \"sorcery\" in this passage is the Greek word \"pharmakeia\" (Strongs #5331) (far-mak-i'-ah). This is the source of the English word \"pharmaceutical\". The true meaning if the word pharmakeia is \"to drug or poison\", so here the Bible predicts the chemical dumbing down of the world by drugging and poisoning thousands of years ago.\n\nIt should also be mentioned that the phrase \"great men\" in this verse does not mean \"good men\" It actually means \"powerful men\". In today's terms, we would call them \"global industrialists and/or bankers\".\n\nSo, this verse predicts a global deception by a group of powerful industrialists. This deception will be facilitated by drugging and poisoning the population. The target of this great evil is the \"all the nations\" of the Earth. This is clearly is a direct reference to the dumbing down of the population thereby making them more prone to deception.\n\nNo matter how you look at it, this verse is a direct reference to a conspiracy of deception of global proportions.\n\nThe following links provide valuable information to help you learn more about the massive political changes that are occurring, and about changes that will occur in the near future.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://urlbam.com/ha/M0073", "http://globalskywatch.com/illness/", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/my-chemtrail-heart-attack.html", "../story/16-Ailments.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=postlist&Board=304&page=1", "http://globalskywatch.com/health/barium", "http://globalskywatch.com/health/aluminum", "http://globalskywatch.com/health/mercury", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=708#Post708", "http://urlbam.com/ha/M001R", "http://urlbam.com/ha/uz", "http://urlbam.com/ha/M004E", "http://urlbam.com/ha/M001R", "http://en.wikipedia.org/wiki/Machiavellianism", "http://urlbam.com/ha/Qzzz", "http://urlbam.com/ha/M0036", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=52441#Post52441", "http://urlbam.com/ha/M0038", "http://urlbam.com/ha/M002U", "http://urlbam.com/ha/M001p", "http://urlbam.com/ha/M001R", "http://urlbam.com/ha/M001R", "http://urlbam.com/ha/M0038", "http://urlbam.com/ha/M0036", "http://urlbam.com/ha/M0022", "http://urlbam.com/ha/M002W", "http://urlbam.com/ha/M003H", "http://www.ifpri.org/publication/delivering-genetically-engineered-crops-poor-farmers", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003m", "http://www.911weknow.com/about-the-sky/tree-decline", "http://news.nationalgeographic.com/news/2008/02/080201-AP-bat-die.html", "http://urlbam.com/ha/M005F", "http://urlbam.com/ha/M003g", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=52451#Post52451", "http://urlbam.com/ha/M0037", "http://urlbam.com/ha/M0070", "http://urlbam.com/ha/M0071", "http://urlbam.com/ha/dz", "http://urlbam.com/ha/M002U", "http://urlbam.com/ha/M0006", "http://urlbam.com/ha/M003s", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=4267#Post4267", "http://urlbam.com/ha/M0072", "http://gsw.bz/nano-aluminum", "http://urlbam.com/ha/M001R", "http://urlbam.com/ha/M002U", "http://urlbam.com/ha/Xz", "http://urlbam.com/ha/3zzzz", "http://urlbam.com/ha/M003O", "http://www.willthomas.net/chemtrails/Articles/Chemtrails_In_US_Schools.htm", "http://urlbam.com/ha/Izzz", "http://orbisvitae.com/mc/Know-Your-Enemy/", "http://orbisvitae.com/mc/Mystery-Babylon-Series/", "http://orbisvitae.com/mc/The-Lost-Light/", "http://urlbam.com/ha/M0021", "http://urlbam.com/ha/M003Z", "http://urlbam.com/ha/M002w"], "authors": [], "publish_date": null}