{"result_id": "135033", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/the-great-contrail-con.html", "timestamp": "2023-04-25 15:18:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/the-great-contrail-con.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - The Great Contrail Con", "cleaned_text": "Link to this page using this short URL: urlbam.com/ha/M006z\n\nSince the writing of my series of articles exposing contrails, multiple professional airline pilots have contacted me and thanked me for my stance against the contrail deception. \n\n \n\n All of them told me personally that they have never seen trails come out of jet engines and that they appreciate my work exposing the disinformation about contrails. Every one of these pilots knew that contrails are so rare that most people will never see one in their lifetime, and if they do occur, they are from rare, obsolete water injection engines (which are no longer made) at altitudes so high, they cannot be seen from the ground.\n\n \n\n Each of these professional pilots have flown most of their lives and have always had a deep interest in aviation. Some of them fly mainstream commercial jets while others fly large jets for major parcel carriers.\n\n \n\n If you are a pilot and would like to share information with me, please feel free to contact me any time. I'm always happy to hear from experienced professionals in the field.\n\nThose spreading disinformation about chemtrails would like nothing more than for you to believe that short, non-persistent plumes coming out of jets are harmless contrails. If they convince you of this, then you will ignore these plumes and allow them to spray you without objection, and this is exactly what they want. \n\n \n\n They will tell you that they've seen contrails since they were children. They will tell you that contrails are scientifically proven to contain water vapor. They will tell you anything necessary to make you believe short trails are harmless. This is exactly how disinformation works.\n\n \n\n Beware of those who claim that short plumes emitted by aircraft are \"contrails\".\n\nThe science is simple: Contrails only occur under conditions so rare that the vast majority of people will never see one in their lifetime. Furtheremore, these rare conditions only occur at altitudes too high to be seen from the ground.\n\n \n\n Now that the government is spending hundreds-of-millions of dollars on disinformation and are attempting to convince the public that contrails are \"normal\" and \"harmless\", people are coming out of the woodwork on social networks claiming that they have seen contrails all of their lives.\n\n \n\n So much money is being spent on disinformation, that it's not likely that you will occasionally run into them on the internet. It's much more likely that you will be inundated by them and that online groups will be saturated with them.\n\n \n\n Do not be deceived.\n\nWhen I was young and still living at home, I got a speeding ticket. My brother jokingly proposed a way for me to tell my mother without me getting into trouble.\n\nHe said, tell mom that you have a big problem. Tell her you're on drugs. When she freaks out, tell her you're just kidding... it's just a traffic ticket. Then she'll be relieved and say, \"Thank God it's only a traffic ticket.\"\n\nLittle did my brother know that he had just demonstrated the Hegelian Dialectic.\n\nThe Hegelian Dialectic is a well-known process for inducing social change in a society. It works like this.\n\nI first began seeing daily chemtrail spraying in Jamestown, New York in 2005. Spraying occurred on a consistent daily schedule.\n\nWhen daily spraying started (originally at 3pm every afternoon), I tasted a strong salty-metallic taste in the air, my sinuses would burn, and I experienced a predictable and consistent array of symptoms beginning within 30 seconds. Enormous, persistent plumes visibly covered the sky on a consistent schedule, every day, for years. I watched and photographed this activity on a daily basis from my large office windows that had a view of downtown and of half the sky.\n\nIn 2007, spraying suddenly stopped. After 2 years of painful suffering, I was desperately hoping this was the end of the aerial assault. Four days later, the spraying began again, but there was a fundamental change. The plumes were no longer long and persistent. They were short, non-persistent plumes that dissipated within seconds.\n\nThey still sprayed on the same schedules. The salty-metallic taste and odors that occurred during spraying events were identical. The symptoms caused by the spraying were also identical. The only thing that changed was the size of the trails.\n\nLet me be clear: The trails had changed from persistent (long and lingering) to non-persistent (short and quickly dissipating).\n\nIncidentally, 3 or 4 days-per-month, the long persistent trails would be sprayed for part of a day, but this was in blatant contrast to the daily, sky-saturating spraying we had witnessed before the change.\n\nIn April 2008, I moved to Bangor, Maine specifically—and exclusively—to escape the painful and debilitating health issues that chemtrails caused me to have in Jamestown.\n\nUnfortunately, throughout the summer of 2008, chemtrails covered the sky on a daily basis. These chemtrails were large and persistent, exactly like the ones that covered the skies in Jamestown before the change to short and non-persistent trails.\n\nAmazingly, in April of 2009, in a single day, all of the trails changed from long, persistent trails to short, non-persistent trails. Just like Jamestown, this change was dramatic and clearly visible. The only difference is that the change did not have a 4-day break in between. The change occurred overnight.\n\nJust like Jamestown, 3 or 4 days-per-month, persistent trails covered the sky, but the rest of the month consisted of only short, non-persistent trails.\n\nJust like Jamestown, the spraying of the short trails continued on the same schedule as the previously-sprayed long ones.\n\nJust like Jamestown, the tastes and odors that occurred in the air during spraying after the change to short trails were identical to those before the length of the trails changed. Only the appearance of the chemtrails changed. Nothing else.\n\nAgain, let me be clear: The trails had changed from persistent (long and lingering) to non-persistent (short and quickly dissipating), overnight.\n\nOn countless occasions, I stayed outside for hours and measured the time it takes for short, non-persistent plumes to reach the ground. Having a very sensitive sense of taste and smell, it was easy for me to discover that the descent time is no different between long, persistent trails and short, non-persistent trails.\n\nIn other documented observations, I have shared my interest in jet and rocket technology and that this is the reason I'm a skywatcher, so I won't repeat all of that here. Suffice it to say that, since childhood, I have always watched jets in the sky and I have never seen a trail come out of a jet. Not once. Not ever.\n\nTraveling throughout the United States by land and by air in 30+ years and seeing many thousands of jets - both civilian and military - in the north and south - in the east and west - over land and over water - during every conceivable weather condition, I have never seen a trail come out of a jet. Not once. Not ever. Never!\n\nToday, about 4 of every 5 times I go outside, even for just a minute, I see jets in the air, and I estimate that about 49 of every 50 jets have trails. Having traveled up and down the east coast of the United States the past few years, the story is the same everywhere I go, regardless of location or time-of-year:\n\nIncidentally, in the past few years I have found that websites, blogs, television shows, movies, and news reports have popped up everywhere trying to convince people that these short, non-persistent trails are contrails (short for condensation trails) and consist of only water vapor.\n\nIt is clear to me that we are witnessing a well-funded disinformation campaign, and that this campaign is utilizing the Hegelian Dialectic.\n\nGlobalists attempted to use the Hegelian Dialectic to manipulate the public into accepting geoengineering—the spraying of 20 to 30 million tons of barium and aluminum into the atmosphere to reflect sunlight. This was the plan:\n\nTo sufficiently fear-monger the public into reacting to the fabricated global warming story, globalists produced movies, television programs, newspaper and magazine articles, news stories, and Saturday morning cartoons depicting the horrific conditions that would soon engulf Earth if the public didn't make changes to battle global warming. Unfortunately for the globalists, they encountered a big problem during the course of their disinformation campaign: Climategate.\n\nClimategate was the public release of information from climate data centers and key climate scientists exposing global warming as an outright fabrication. The public learned that climate data had been fabricated to support global warming even though corrupt climate scientists knew that no such problem existed.\n\nGlobalists soon encountered yet another problem while trying to complete The Geoengineering Dialectic. Thanks to the explosion of social networking and the instant-availability of scientific information about the severe toxicity of aluminum, the public was unwilling to accept the widespread health consequences of being sprayed with a highly toxic metal like aluminum.\n\nFortunately for the public, globalists encountered yet another big problem. People on social networks began organizing and asking their friends and family to look up and see that geoengineering was already occurring. Globalists had begun spraying the public while pretending that it was nothing more than a proposal still being discussed at conferences around the world. The public collected water samples, soil samples, and blood samples and began telling their friends and local government officials that geoengineering metals were showing up everywhere in quantities high enough to be a severe health hazard.\n\nFortunately for the public, globalists were never able to finish their Geoengineering Dialectic. They were in a corner and had to invent another lie to cover up the fact that geoengineering had already begun. They had to convince the public that plumes being emitted by jets were harmless condensation trails. To this end they devised The Contrail Con.\n\nGlobalists are used to doing whatever they want and getting away with it. They have been selling the public lies for decades and have rarely been held accountable.\n\nThings are different now. Using the internet, people communicate, share information, and do research utilizing the mass of information now available to anyone online.\n\nNow that people were online exposing this enormous aerial operation and encouraging others to look up and see these huge plumes in the sky, globalists have now been forced to take the defensive. They are losing the information war.\n\nGlobalists have decided to take a two-pronged approach to cover up their massive geoengineering operation that is now underway (and has been for several years):\n\nTo make plumes less visible, globalists took two approaches.\n\nSince high-altitude spraying makes it harder to concentrate metallic particulates in the lower atmosphere where they are wanted, globalists had to continue some degree of low and medium altitude spraying. To minimize public awareness of the spraying, they upgraded their systems so plumes were much shorter and non-persistent. Nevertheless, these lower-altitude plumes were still visible to the public, so they had to devise a way to convince the public that these short plumes are harmless.\n\n(2) Make the Public Believe Short Plumes are Harmless\n\nGlobalists began utilizing all of the usual media techniques to attempt to convince the public that these short, non-persistent trails being sprayed at low and medium altitudes are harmless condensation trails (contrails). This is the con we are currently experiencing as I write this article.\n\nEverywhere you look you find the media attempting to convince the public that jet engines expel harmless plumes of water, and out of necessity, they are attempting to alter history by convincing the public that this is the way it has always been.\n\nThis is The Contrail Con.\n\nMake no mistake. Globalists spraying the public with toxic substances are fighting for their lives. If the public catches on, and it is, the globalists will be prosecuted and executed for crimes against humanity on a scale unprecedented in human history, therefore, they will do anything to to keep the public ignorant and complacent during this global holocaust. They will even go so far as to alter history.\n\nOld photos and videos have been professionally altered to show plumes coming from jets to attempt to convince the public that jet plumes are normal and have existed for decades. In other instances, plumes are shown coming from old turboprops or water-injected Spey Series 512 Turbofans and are used to convince the public using an out-of-context deception. Additionally, the public is not told that water-injection was used in just a couple engine types during world war II to decrease take off runway requirements. Any additional water was afterward dumped to lighten the aircraft's weight.\n\nOn the internet, paid disinformationalists are claiming to have seen contrails emitted from jets decades ago. These disinformationalists are a key part of any successful military operation, but in this case, the potential health effects of chemtrails—which includes death—make disinformationalists a party to a crime so immense, many simply cannot believe it.\n\nCloud charts have been developed and distributed through the public school system by NASA. These charts show chemtrails that have spread out into cloud-like structures and have assigned them various, scientific-sounding names, but there is no mention that these clouds were created by enormous jet plumes.\n\nThis disinformation is being duplicated and distributed all over the internet.\n\nMilitary jets (the U.S. military uses Boeing 747s and Airbus A330s which are also sold to commercial airline companies) painted to look like commercial jets pull up beside commercial flights in flight and spew chemtrails.\n\nPeople aboard the commercial flights are video taping this and putting the video on the internet as \"proof\" that normal commercial jets produce harmless condensation trials (contrails). For the globalists, this is easy, inexpensive disinformation.\n\nThe most convincing disinformation is not spoken, rather, it is a conclusion arrived at by the disinformation target audience themselves.\n\nNumerous popular movies, cartoons, advertisements, music videos, and other media now show trails coming out of jets. When the disinformation target audience sees this on a regular basis, they simply conclude—either consciously or subconsciously—that this is normal, so when they see it in the sky, they simply ignore it. This process is called \"Normalization\" and is probably the most popular method of disinformation used against the public today.\n\nGlobalists would love nothing more than for you to believe that chemtrails are harmless water vapor (\"contrails\").\n\nIf you believe this, you will never consider the consequences of being sprayed with millions of tons of barium and aluminum. You will never realize that the enormous plumes you see over your head are causing your health issues, and this is exactly what globalists want:\n\nTo carry out their plans unhindered by an informed public.\n\nDon't let them destroy your health or life. For the sake of your children, don't let them alter history. Don't let them succeed in—what may be—the largest con in history:\n\n\"Ostensible control over the knowable by marketing institutionally accredited science as the only path to true understanding.\" —Daniel Pouzzner\n\n \n\n In short: We will spin tales and call it accredited science to control the public, and this is exactly what we're witnessing today as propagandists attempt to convince the public that chemtrails are \"contrails\".\n\n \n\n \"Scientific societies are as yet in their infancy. It is to be expected that advances in physiology ahd psychology will give governments much more control over individual mentality than they now have even in totalitarian countries.\" —Bertrand Russell, \"The Impact of Science on Society\", 1953; 49-50\n\nContrails are extremely rare, so much so that most people will never see one in their lifetime.\n\nThe picture below shows an actual contrail in the vacuum zone of a jet's wing during full flaps and likely under very humid conditions. You will notice that the trail is so short (only perhaps 5 to 10 feet long) and so faint that it is not visible from the ground.\n\nThis photo originally came from Wikipedia in 2010 but has since been removed and replaced with photos of chemtrails. Wikipedia is trying to convince the public that chemtrails are \"harmless\" contrails. Wikipedia is well-known for their participation in disseminating mainstream media disinformation.\n\nThey are popping up all over; websites and blogs that try to convince the public that short, non-persistent plumes coming out of jets are \"contrails\". Facebook shills are government employees and contractors who are paid to convince you what short, non-persistent trails coming out of jets are harmless water vapor.\n\nDon't be deceived. Contrails are extremely rare and only occur in conditions that:\n\nIf you see a trail come out of a jet, long or short, persistent or non-persistent, you can be sure that it's a chemtrail.\n\n6. Why Some People Still Believe in Contrails\n\nHigh-Bypass Turbofans DO NOT Produce Contrails. So What Are Those Lines in the Sky?\n\nContrails DO NOT EXIST According To Older Aviation Textbooks\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://urlbam.com/ha/M006z", "http://russtanner.com/gallery/main.php?g2_itemId=1281", "../story/16-Ailments.html", "particulate-descent-time.html", "why-some-people-still-believe-in-contrails.html", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M0075", "http://urlbam.com/ha/M006y", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M0059", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M005B", "http://urlbam.com/ha/M001U", "https://www.facebook.com/groups/globalskywatch/", "http://urlbam.com/ha/M006w", "http://urlbam.com/ha/M006x", "plumes-change.html", "plumes-change.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M003v", "http://urlbam.com/ha/M0047", "http://urlbam.com/ha/M003a", "the-great-contrail-con.html", "contrail-coverup.html", "a-photo-of-an-actual-contrail.html", "plumes-change.html", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=14609#Post14609", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=11839#Post11839", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6634#Post6634", "http://globalskywatch.com/articles/Textbook-Disinformation,Weather-Studies.html", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}