{"result_id": "135015", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-or-geoengineering.html", "timestamp": "2023-04-25 15:17:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-or-geoengineering.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrails or Geoengineering?", "cleaned_text": "Link to this page using this short URL: gsw.bz/corg\n\nSome people call them \"chemtrails\". Others call them \"geoengineering\". So, what should we call them?\n\n\"Geoengineering\" is a term that is linked with science because scientists around the world use it. For this reason, it's much easier and more credible to introduce the public to chemtrails using the word \"geoengineering\".\n\nFor this reason, I believe it's beneficial—at this time—to use the word \"geoengineering\" when referring to chemtrails to a public who knows nothing about them.\n\nHaving said that, I must make a few important points.\n\nFirst we must realize that both of the following statements are true:\n\nIt simply depends on the context.\n\nLet's be clear. Chemtrails are the popularized name for the trails behind jets, so chemtrails are a physical \"thing\". Geoengineering is the science of altering the earth, so geoengineering is the science of a process.\n\n\"Geoengineering\" is being sold to the public as a beneficial method to reverse global warming, but that's not what chemtrails actually do. Consider the following facts:\n• Chemtrails do not reverse global warming. They actually heat up the atmosphere (the Venus effect). In fact, ice core sample data refutes anthropological global warming.\n• Chemtrails have many other purposes that are not spoken about openly by those proposing geoengineering.\n\nIt's safe to say that \"chemtrails\" are not \"geoengineering\" in that they do not serve the purposes claimed by geoengineering scientists.\n\nWe now have sufficient evidence that chemtrails make the earth warmer (local to the spraying activity) by trapping heat within the atmosphere. For this reason, chemtrails are changing climate, so chemtrails are \"geoengineering\". The problem is that they are changing temperature in the \"wrong\" direction (up instead of down), not to mention the fact that they are \"engineering\" other aspects of the atmosphere, soil, and water, but not for our benefit.\n\nHave you ever known the government to sell a program to the public that makes the problem worse? Of course, and this is typical government behavior we have all seen.\n\nSo, What Do We Call Them?\n\nWe should call this spraying activity either \"chemtrails\" or \"geoengineering\" depending on who we're talking to.\n\nFor example, if you're speaking with someone who knows little about computers, would we describe a problem to them as like this:\n\nor like this:\n\nIf your audience is not technically educated about computers and programming code, then you would use \"B\" above. If you're speaking to a computer engineer, then you would use \"A\" above.\n\nThe same principle holds true with chemtrails.\n\nIf we're speaking to someone who does not know about chemtrails, then it's usually best to use the term \"geoengineering\" because it's a term that is already being used by scientists and has more credibility and familiarity with the public.\n\nHowever, if we're speaking to someone who already knows and understands the many proposed uses of chemtrails, then it's best to use the term \"chemtrails\". (Although, once someone becomes educated about this issue, they will understand that termonology used isn't nearly as important as the fact that the public understands the damage that is being done.)\n\nIf you use the term \"geoengineering\" with educated activists, then they may think that you believe that the intended purpose of spraying is to stop global warming and they may lose respect for you, and hence you may lose credibility with them. (Of couse, once they know that you know that the spraying is harmful and deadly and actually causes global warming, then the termonology becomes unimportant in the communication between you.)\n\nSimilarly, if you use the term \"chemtrails\" with someone who knows nothing about the spraying, they will very likely consider you a \"conspiracy theorist\" and lose respect for you and you will lose credibility in their eyes.\n\nIt's simple social etiquette: Know your audience.\n\nThere is a danger in semantics because they often divide people, and this exactly what we don't want. Of course, the opposition would love to see us divided.\n\nKeep the big picture in focus and always remember your purpose: To teach the public about toxic chemical aerosols so we can all work together to put an end to them.\n\nNever let semantics or terminology divide us. Call chemical aerosols whatever name makes you most effective while informing the public. Once a person understands that \"chemtrails\" and \"geoengineering\" both refer to the same harmful spraying of chemical aerosols into the atmosphere, then the termonology used between you becomes a moot point. You both know that spraying is harmful and you both want it to stop. That is what is important.\n\nThere is an added bonus to using the term \"geoengineering\". When the public searches for this term online, they will discover:\n• \"Geoengineering\" is a very real, scientific term, and\n• \"Geoengineering\" means spraying 20 to 30 million tons of aluminum dust into the atmosphere.\n\nMost of the public knows that aluminum is toxic and will immediately realize that spraying it into the atmosphere is a very bad idea. Furthermore, the public will begin to ask themselves whether the massive outbreaks of respiratory (and other) illnesses that we have seen since spraying became widespread could be a result of the massive plumes they are seeing in the skies.\n\nAlthough geoengineering scientists claim that geoengineering has not yet begun, people who see the massive plumes in the skies along with the outbreaks of ailments potentially related to aluminum, and when they see the growing collection of rainwater, snow, and dust tests containing dramatically elevated aluminum, they will realize that spraying is already happening, and this is, in fact, the very premise of the ground-breaking documentary \"What In the World are They Spraying\".\n\nThe idea of saying the same thing a different way to different people is considered heretical by some. There is a purist point of view that believes in a simplistic approach to communication. They say, \"Truth is truth so you must speak it the same way to everyone\".\n\nUnfortunately, this is a simplistic point of view that tends toward failure. If you're going to be effective in your communication, you must always consider your audience.\n\nConsider how you would deter a child from putting their fingers into an electrical socket. Would you explain the mechanics of destroying nerve tissue when energetic electronics burn synapses? No. You would use concepts they can relate to. You would say, \"Don't do that because it's going to hurt!\"\n\nThe same holds true when speaking to an uneducated public about chemtrails. If you use the term \"chemtrails\", not only are you using a term that requires them to understand the mechanics of government disinformation and covert operations (because mainstream media has already associated that term as being a \"conspiracy theory\" via their disinformation campaigns), you are also using a term that has been thoroughly associated with \"conspiracy theorists\" thanks to mainstream media. If you use the term \"chemtrails\" with this group, you are bound for failure and will not have their ear for more than two sentences.\n\nHowever, if you are perceptive and know your audience—if you have the insight and self control to use terminology that your audience can relate to—then you can be effective and maintain your credibility all at the same time.\n\nGovernments have used gradualism to bring the public to the edge of a cliff without the public becoming aware of the danger. In the same way, you can speak to the public in a way that allows them to accept what you are saying. We can use gradualism to introduce them to a difficult subject in a way that maintains scientific credibility without pushing them too far outside of their comfort zone.\n\nBy using the word \"geoengineering\" instead of \"chemtrails\", you are getting a foot in a door that would otherwise be slammed in your face, and that is progress through intelligent strategy.\n\nOnce a person realizes that geoengineering is actually being seriously considered by governments, then it's only a small step for them to understand that it's already happening. Then, it's only another small step to introduce them to the concepts of weather manipulation, HAARP, population control, and all of the other known, patented, and whistle-blown uses of chemical aerosols.\n\nThe important thing to remember here is this: Three small steps are much easier to achieve than 1 really big step.\n\nThe globalists know this, and this is why they have always used gradualism on the public to shape their belief systems and their resultant behavior.\n\nThis is how I was first introduced to the massive scope of global conspiracies. One of the first movies I saw was \"The Clinton Chronicles\". This movie does not deal with the global scope of globalist corruption, but it does introduce the public to the state-wide scope of the Clinton family. For this reason, it was digestible by someone new to the subject, and it served as the all-important \"foot-in-the-door\" in the process of opening my mind.\n\nWhen you know what we know about chemtrails, it's very difficult to be gentle when talking to people about it. It's as if the house is on fire but we are forced to withhold our screams. Instead we must have credible, intellectual conversation with each person as we share the warning.\n\nIt is better that we convince people to get out of the burning house even if it takes a few extra minutes. Indeed, it's better they get out late than not at all.\n\nThis type of conversation takes patience and self control when you are so passionate about dangers that are still largely unknown. Nevertheless, you will make much faster progress by being gentle, intellectual, and convincing than you will if you just stand there and scream.\n\nBe composed, logical, and patient and people will listen.\n\nGenerally speaking, public officials are not going to be helpful until enough people actively oppose chemtrails. Until then, these officials can be helpful on a smaller scale.\n\nUsing the word \"geoengineering\", since it is a scientifically-accepted term, will get you in the door and to the podium when speaking at public meetings. Using quotes from scientists that use the word \"geoengineering\" also help you gain credibility when speaking. Once officials know about chemical aerosols, some of them may respond and become helpful in bringing this information to the public.\n\nThis is just one example of how the word \"geoengineering\" can be a useful tool for wedging your foot in the door.\n\nScientists claim that the purpose of geoengineering is to fight global warming so some say that using the word \"geoengineering\" infers that you believe in global warming.\n\nAlthough this inference could be considered valid on some levels, this inference is only skin deep and easily diffused with a little understanding.\n\nI do not believe man-made global warming occurred before chemtrails began, yet I often use the word \"geoengineering\" when introducing chemtrails to people because this word is more credible and therefore more effective. Once they know about geoengineering, then it's only a small step to teach them that geoengineering actually warms the earth rather than cooling it.\n\nThe most important thing is this: Whether or not you believe in man-made global warming, we can all agree that spraying toxic metals and chemicals into the air is a bad idea and must be stopped.\n\nDo not let the global warming debate come between you and your passion for putting and end to chemtrails. Do not let it divide you from those who are working beside you to stop chemtrails. Furthermore, do not let your choice of terms divide you either. \"Chemtrails\" and \"geoengineering\" are both useful terms to describe the release of chemical aerosols into the atmosphere. The term you choose to use should depend on how effective you believe it will be with your audience.\n\nDo we call them chemtrails or geoengineering?\n\nWe can use either term depending on who we're talking to.\n\nBe wise. Be perceptive. Be discerning. Know your audience. Speak with credibility.\n\nThere are no hard and fast rules for talking to people, only principles, and understanding these principles can help us become dramatically more effective as we spread the word about this burning house.\n\n6. Why Some People Still Believe in Contrails\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://gsw.bz/corg", "http://urlbam.com/ha/M005P", "why-chemtrails.html", "http://globalskywatch.com/live/archive/2013-01-21,Mass-Methane-Releases,Dane-Wigington.html", "http://urlbam.com/ha/M007i", "why-chemtrails.html", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/Nzzz", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=postlist&Board=260&page=1#.USz4PWcwd8E", "http://globalskywatch.com/v/tests", "http://gsw.bz/ffa", "http://globalskywatch.com/v/tests", "http://urlbam.com/ha/M003m", "http://endgeoengineering.com/what-in-the-world-are-rhey-spraying.html", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/Nzzz", "http://urlbam.com/ha/M000j", "http://urlbam.com/ha/M0072", "http://urlbam.com/ha/M001R", "http://urlbam.com/ha/M004Q", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M0036", "http://urlbam.com/ha/Lzz", "http://globalskywatch.com/chemtrail-illness.html", "http://urlbam.com/ha/M005Q", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M005C", "http://urlbam.com/ha/M005P", "http://globalskywatch.com/live/archive/2013-01-21,Mass-Methane-Releases,Dane-Wigington.html", "http://globalskywatch.com/v/tests", "https://www.facebook.com/groups/globalskywatch/", "the-great-contrail-con.html", "contrail-coverup.html", "a-photo-of-an-actual-contrail.html", "plumes-change.html", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html", "http://urlbam.com/ha/M005y", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}