{"result_id": "135038", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/a-photo-of-an-actual-contrail.html", "timestamp": "2023-04-25 15:18:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/a-photo-of-an-actual-contrail.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Information - A Photo of An Actual Contrail", "cleaned_text": "Link to this page using this short URL: gsw.bz/real-contrail\n\nThose spreading disinformation about chemtrails would like nothing more than for you to believe that short, non-persistent plumes coming out of jets are harmless contrails. If they convince you of this, then you will ignore these plumes and allow them to spray you without objection, and this is exactly what they want.\n\n \n\n They will tell you that they've seen contrails since they were children. They will tell you that contrails are scientifically proven to contain water vapor. They will tell you anything necessary to make you believe short trails are harmless. This is exactly how disinformation works.\n\n \n\n Beware of those who claim that short plumes emitted by aircraft are \"contrails\".\n\nThe picture below shows a trail of condensed air; a \"condensation trail\", or \"contrail\". This phenomenon can form in the low pressure area immediately behind a jet's wing during heavy flaps under very humid conditions. When this occurs at the wingtip, they are often called a \"wingtip vortex\".\n\nYou will notice that the trail is so short (only perhaps 6 to 10 feet long) and so faint that it's not visible from the ground. You will also notice that it only persists for a fraction of a second. Most importantly, this phenomenon is not originating from an engine.\n\nThis photo originally came from Wikipedia in 2010 and was classified as a \"contrail\". The photo has since been removed and replaced with photos of aerosol-injection chemtrails, both persistent (long) and non-persistent (short). Wikipedia is trying to convince the public that chemtrails are \"harmless\" vapor trails. Wikipedia is well-known for their participation in disseminating mainstream media disinformation. Don't be fooled.\n\nWingtip contrails form because of the inward airflow (towards the fuselage) above a wing combined with the outward airflow (away from the fuselage) below a wing. This differential causes a rapid spiraling effect at the wingtip which induces a vacuum in the center area of the spiral. When conditions are just right and enough humidity is present, this vacuum causes the humidity in the air to condense because of the dramatic drop in air pressure.\n\nThis phenomenon normally occurs when the plane or jet is pitching back which causes an increased difference in the pressure above the wing as opposed to the pressure below the wing. This condition is necessary for a vacuum sufficient to cause condensation.\n\nThis type of contrail formation may occasionally be witnessed when a commercial jet is landing in extremely humid conditions just before touch down when the jet is in the process of pitching back. It may also be witnessed when a plane or fighter jet is rapidly pitching back while in flight. Keep in mind that this contrail formation has nothing to do with jet engines or the burning of fossil fuels.\n\nWhen I was in junior high school, we performed an experiment with equipment similar to this (picture to the left).\n\nWe excavated air from a jar (created a vacuum) and witnessed the formation of condensation—like a mist—inside the jar. As soon as we restored the pressure by opening a release valve, the mist disappeared immediately.\n\nThis phenomenon occurs because of this basic principle:\n\nWhen air pressure decreases, it becomes unable to hold as much water vapor, so the very tiny particulates of water join together to form larger droplets which become visible because of their size. When the pressure is restored, the water is immediately absorbed back into the air breaking into tiny particles and becomes invisible again.\n\nThey are popping up all over; websites and blogs that try to convince the public that short, non-persistent plumes coming out of jets are \"contrails\". Facebook shills are government employees and contractors who are paid to convince you what short, non-persistent trails coming out of jets are harmless water vapor.\n\nDon't be deceived. Contrails are extremely rare and only occur in conditions that:\n\nIf you see a trail come out of a jet, long or short, persistent or non-persistent, you can be sure that it's a chemtrail.\n\n6. Why Some People Still Believe in Contrails\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://gsw.bz/real-contrail", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=999#Post999", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=17694#Post17694", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=11839#Post11839", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/plumes-change.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=292#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=292#Post6859", "plumes-change.html", "http://urlbam.com/ha/M0047", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859&an=317#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=17694#Post17694", "the-great-contrail-con.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=999#Post999", "contrail-coverup.html", "the-great-contrail-con.html", "contrail-coverup.html", "a-photo-of-an-actual-contrail.html", "plumes-change.html", "geoengineering-artifacts.html", "why-some-people-still-believe-in-contrails.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=17694#Post17694", "http://urlbam.com/ha/M005y", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}