{"result_id": "135043", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-additives_morgellons.html", "timestamp": "2023-04-25 15:18:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-additives_morgellons.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "Chemtrail Additives: Morgellon's", "cleaned_text": "Share this page using this social media safe link: gsw.bz/type-morg\n\nThis page contains information about the Morgellon's chemtrail additive.\n\nThere are several basic chemtrail types that can be categorized according to their odor, taste, and symptoms they produce. These different types often contain common \"additives\". A single additive may occur with two-or-more chemtrail types. We call these additives because they nearly always occur with other, primary chemtrail types.\n\nThis section details the attributes of the \"Morgellon's\" Chemtrail Additive.\n\nMorgellon's is a disease characterized by a set of symptoms which include:\n• The presence of a unique bacteria in the blood that appears to destroy red blood cells. This organism has been named a \"cross-domain bacteria\" by a leading Morgellon's researcher.\n• The sensation of bugs biting the skin.\n• Dramatic interference with calcium metabolism resulting in serious tooth issues including gumline cavities and eventual tooth loss.\n• Small fibers growing out out of the body. This symptom is not always present.\n• Open sores of various size on the skin. These sores usually contain unusual semi-translucent fibers. This symptom is not always present.\n\nThe Morgellon's chemtrail additive has a profound connection with Morgellon's which is explained below.\n\nMorgellon's researcher Clifford Carnicom has exposed compelling evidence that Morgellon's disease is caused by chemtrails.\n\nI am not surprised in the least by this revelation. As someone who can smell and taste chemtrail fallout when it reaches ground level, I have found that every time this additive is present, my own itchy-skin symptoms increase dramatically within minutes. Conversely, when this additive dissipates, the corresponding symptom decreases dramatically.\n\nThis symptom feels like you are being bit by a mosquito or small bug. It's very annoying, as you can imagine, and can interfere with work, sleep, and life in general.\n\nI have experienced this correlation between this chemtrail additive and this particular symptom since 2005, but in the past few months (late 2019 to present - 2/2019) this additive has been sprayed at intense levels almost daily resulting in unbearable symptoms, namely, the sensation of bug biting the skin.\n\nI don't know in which locations this additive is used, but in this area, it is used daily at the time of this writing.\n\nMany of the tastes and odors associated with chemtrails and their additives are strange and difficult to describe. This additive is no different.\n\nThe best description I can provide is that it tastes like a combination of 4 components. These are arranged with the strongest tasting component at the top:\n• A chalky sleeping pill - The first component is a unique, sharp taste very similar to unbuffered sleeping pills. This taste is not unlike the taste in the air in virtually all hospitals. This taste seems diluted a bit so as to make it somewhat \"chalky\".\n• A bitter herb - The second component is a grassy, bitter taste present in raw bitter herbs.\n• Metal - The third component is a semi-sharp metallic taste. This is a taste I experience in a room when steel or iron is being cut or ground producing airborne dust.\n• Motor oil - The last component is somewhat like motor oil. This component is experienced both as a taste and a subtle odor that is present in the air when this additive is present.\n\nHistorically, this additive has occurred with the following chemtrail types. Note that it is not always present when these chemtrail types are present:\n\nThe single most effective way I have found to reduce the symptoms associated with this chemtrail additive is using a wet mask. For me, this reduces symptoms well over 50%.\n\nI have found that stimulating immune system function helps reduce the skin sensation noticeably. I use immune stimulating herbal supplements to achieve this result.\n\nIt's important to add that the bug-biting sensation is always present but normally at \"tolerable\" levels (for me). But when this additive is in the air, the sensation become overwhelming and debilitating interfering with work and sleep.\n\nHigh-Bypass Turbofans DO NOT Produce Contrails. So What Are Those Lines in the Sky?\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://gsw.bz/type-morg", "chemtrail-types.html#ChemtrailTypes", "chemtrail-types.html#ChemtrailTypes", "https://www.carnicominstitute.org/research_papers/Carnicom_Institute_Research-2009.pdf", "http://carnicominstitute.org/", "http://globalskywatch.com/live/archive/2013-02-12,Clifford-Carnicom.html#.XlVQEf5KhhE", "smelling-and-tasting-chemtrails.html", "smelling-and-tasting-chemtrails.html", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#SaltyMetallicType", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#DrywallDustType", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#PharmaceuticalType", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#BluntMetallic", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#PlasticSolventType", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrail-types.html#SharpMetallic", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=91#Post91", "chemtrail-types.html#ChemtrailTypes", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=31723", "http://mercurytalk.com/articles/The-Emotional-Effects-of-Mercury.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "chemtrail-types.html", "#top"], "authors": [], "publish_date": null}