{"result_id": "135042", "URL": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/the-haarp-hum.html", "timestamp": "2023-04-25 15:18:09 CEST+0200", "meta": {"description": "", "lang": null, "keywords": "", "favicon": "", "canonical": "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/the-haarp-hum.html", "encoding": "utf-8"}, "image": null, "domain": "globalskywatch.com", "title": "\"The Hum\"", "cleaned_text": "Link to this page using this short URL: gsw.bz/thehum\n\nUpdate January 2017: A brand new small(ish) tower was just installed within the past 2 months a few miles from here. Within 3 weeks of the physical construction appearing to be complete, the hum suddenly became so loud and so clear that I can now virtually feel it. Many have inquired about numerous towers just like this one going up across the nation (and around the world) and have received conflicting responses from governments. What is concerning is this: If you're able to hear an electromagnetically-induced hum in your head so that you can determine that it's not audio but rather electromagnetic, then the electromagnetic source must be so strong that it would very harmful to health. This would be like building a house directly under very high voltage power lines. For more information, search for cancer clusters related to high voltage power lines. This is a very serious health issue.\n\nWant to hear the HAARP Hum? Go to the link below, set the frequency to 72 Hertz, and click PLAY (make sure your volume is not too high). You'll hear almost exactly what the HAARP hum sounds like to those of us who hear it. Tone Generator\n\nThe Hum is a low frequency sound that seems to emanate from inside my head but is shifted slightly towards my right ear. It most often begins in the early evening and continues until early morning. By 7am it's no longer audible. The hum is generally audible only at night, but occasionally occurs during the daytime. When it begins and ends, it does so suddenly.\n\nI first began hearing the hum in Maine in 2010, if I remember correctly.\n\nUPDATE 12/5/2015 - The hum for the past 6 days has been louder than it has ever been before. Many people are reporting hearing the hum and also experiencing heart fibrillations, headaches, dizziness, nausea, vomiting, heart/chest pain, and more.\n\nThe hum has been varied in amplitude (volume), but the characteristics of the volume have changed over time.\n\nWhen the hum first began occurring, the volume would change greatly from night to night. On some nights it would be barely audible. On other nights it would be so loud that it would interfere somewhat with sleep and normal conversation. Scheduling would also change. Sometimes it would continue for days at a time. Other times it would only continue for a couple hours and suddenly stop.\n\nIn 2015, the hum became very consistent in both volume and scheduling. Now it begins about 7pm almost evening and ends at some time in the mid morning when I'm still sleeping. There are a few nights that the hum does not occur, but I have not logged so as to detect and scheduling patterns. The volume is also very consistent. It's always very loud, so much so that it's somewhat annoying and makes it a little harder to get to sleep.\n\nThis hum occurs over large areas. When I drive 10 miles to the south, it's still audible but is 20% to 50% less intense. When I drive 25 miles to the west, it's about 70% to 90% less intense, sometimes not audible at all.\n\nIn 2014, I moved to Philadelphia, Pennsylvania. The hum also occurred there, but the volume was lower than compared to Maine and the scheduling was quite inconsistent, except that it usually occurred at night.\n\nI moved back to Maine in 2015 and continued experiencing the hum.\n\nBased on these observations, and based on the fact that many people hear the hum in different parts of the world, I would guess that there are multiple sources. As you move away from a source, the volume decreases. As you approach another source, the volume increases.\n\n5 years ago, there were two types of hum. One sounded like a pure sine wave and the other sounded like a rumble. The sine wave sounded like a single frequency while the rumble sounded like the combination of several low frequencies. The rumble occurred less frequently then the hum.\n\nIn 2015 after I moved back to Maine, the rumble no longer occurs, but the sine wave hum occurs almost every night.\n\nI have measured the frequency with a sine wave generator and found that it's usually 72 Hertz in frequency. On occasion it has been as low as 60 Hertz and as high as 82 Hertz. The hum's frequency does not appear to change during a given session, although it would be difficult to tell at these low frequencies unless multiple tests were conducted throughout the night, which I have not done yet.\n\nI do not know the origin of this \"sound\" but because it tends to occur, not at the ears but inside the heads of those who hear it, the hum may be electromagnetic. My best guess is that metal toxicity in the brain and nerve pathways acts as an antenna. This results in electrical currents in the microamp range being induced into the nerves. These current are interpreted by the auditory part of the brain as sound.\n\nThe more metal your body contains, the more current is induced in your body. Therefore, it's likely that those who do not naturally detoxify metal are more likely to hear the hum. This would primarily include those who don't produce as much glutathione. These are usually people who have higher testosterone levels.\n\nConsidering all this, we will likely find that those who are \"high testosterone\" are more likely to hear the hum. This is not a hard rule, but rather a tendency.\n\nI just recently found a study that reveals that dousing a human with certain frequencies of electromagnetic energy makes cell wall more porous. In other words, once toxic metals from the chemical aerosols are inhaled, HAARP makes them pass through your cell walls much more easily. Here's more information about the study.\n\nIf one of the purposes of spraying chemical aerosols is to intoxicate people so they have shorter life spans, lower intelligence, and impaired health, exposing the population to electromagnetic radiation would make the chemical aerosol program many times more effective.\n\nI have included feedback from those who have contacted me or commented on my articles below.\n\nI know something has been going on! I hear a deep humming in my left ear, and sometimes it is unbearable! I will feel pressure in my head, and the humming pulsates. I have on a couple occassions, had very bad tremors, and when my sister came over here, she experienced the same. I was thinking it was due to my having wifi, and had it turned off, but sometimes I still hear a low hum, but not the kind of pressure I felt before. I talked to Time Warner Cables tech, who told me there are many who cannot have wifi, because of that very thing! I have had irregular heartbeats, and my blood pressure had gone through the roof!!! I live 1/4 mile from electrical towers as well. Many people in this area seem to have ambulance visits often!\n\n \n\n —Connie\n\nI thought that maybe it was my ears... or my TV. I'm pretty sure I've experienced this recently also.\n\n \n\n —Laura\n\nI have been having this problem for over two years in a row non stop welcome to my world.\n\n ...\n\n It doesn't matter this happens everywhere. There is a link on Google you can give your locations etc. and few thousands have done it and the ones who hear the sound are literally everywhere in the world. I mean they have a map showing it with dots etc.\n\n \n\n —Ara\n\nI am highly sensitive to it. I always hear it and at different levels. When its really high it hurts.\n\n \n\n —Pam\n\nThis is what is happening with me too. The ringing in the ears and weird heart beating!\n\n ...\n\n I am in Michigan, and the same thing is happening to me every night between 2 and 3 am. It wakes up my dog, and she has a difficult time going back to sleep because she only weighs 4 pounds. The GWEN system works through the ground, so we can't escape it. I always hear the hum and have for well over 2 years. They are disrupting our electrical systems with their diabolical systems that they claim protect us. It's all bs, and needs to stop!\n\n \n\n —Sherri\n\nLook, when I served in Saudi, we had \"binaural canons\" or bin-ops, mostly bolted to humv or shoulder carried, it caused committing, shitting, screaming, etc, now I recognize it, but this, this is on a much grander scale, and while its subtle, its long term, and its deeper.\n\n \n\n —Steven\n\nMy husband heard the \"tone\" last night, which I had mentioned to him last week. It blends in like white noise and would never be heard if the TV would have been on. Once you hear it, it almost feels like a signal, can't really explain what I mean by that...it is very annoying and scares me as well!!!\n\n \n\n —Pamela\n\nTightness in the chest and horrible headaches. Weird humming going on for weeks.\n\n \n\n —Michael\n\nOh yes, I've noticed it too.\n\n \n\n —Martha\n\nI heard a tone yesterday evening, which according to the tone generator was about 6385. Weird that I'm not having the weird heartbeat since. But the last 5 days have been constant heart issues. Weird...\n\n \n\n —Regina\n\nNote that I have had regular tinnitus now for about 6 months. (high pitch whine) However 2 weeks ago this new sound started (the hum). I wanted to let you know that I was traveling and I heard it both overseas in Hungary and in Ontario. Until now I assumed it was some brain/ear malfunction. But it is odd I would hear the same from two places so far apart if it were a signal I am picking up\n\n \n\n —V.\n\nThe \"Hum\" Opens Cell Walls To Toxicity - New Research\n\nBBC News: Have You Heard The Hum?\n\nSee A Non-Persistent Trail? It's Either A Chemical Aerosol or a Water-Injection Turbofan\n\nCouncil On Foreign Relations: \"Millions Spent To Confuse the Public\"\n\nHistorical Examples of Biological and Chemical Testing on Americans\n\nClimategate is Still the Issue\n\nThe Aluminization of Our Soils\n\nU.S. Law Allows Spraying Citizens With Chemicals or Biological Agents Even If It Causes Permanent Injury or Death\n\nWhy A \"Doomsday Seed Vault\" In the Arctic?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://gsw.bz/thehum", "../../../resources/tone-generators/index.html", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=30829#Post30829", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7302#Post7302", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=showflat&Number=44881&an=128#Post44881", "http://globalskywatch.com/stories/my-chemtrail-story/chemtrail-information/chemtrails-in-the-bible.html", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7302#Post7302", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=24632#Post24632", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=16666", "http://orbisvitae.com/ubbthreads/ubbthreads.php?ubb=postlist&Board=337&page=1#.Umz8A5wnh8E", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=7126#Post7126", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6859#Post6859", "http://urlbam.com/ha/M005y", "http://globalskywatch.com/chemtrails/ubbthreads.php?ubb=showflat&Number=6400#Post6400", "http://urlbam.com/ha/M003x", "http://globalskywatch.com/v/mcs", "http://urlbam.com/ha/M005L", "http://urlbam.com/ha/M005P", "http://urlbam.com/ha/M004w", "http://urlbam.com/ha/M003m", "http://urlbam.com/ha/M003u", "http://urlbam.com/ha/M002Y", "http://urlbam.com/ha/M002Z", "http://urlbam.com/ha/M004r", "#top"], "authors": [], "publish_date": null}