{"result_id": "136002", "URL": "https://gmowatch.com/where-are-gmos-banned/", "timestamp": "2023-04-25 15:18:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://gmowatch.com/wp-content/uploads/2018/10/Site-Favicon.png", "canonical": "https://gmowatch.com/where-are-gmos-banned/", "encoding": "utf-8"}, "image": null, "domain": "gmowatch.com", "title": "Where are GMO's banned?", "cleaned_text": "The debate over GMOs, or genetically modified organisms, is not only going on in the United States. It’s also happening in countries all around the world. Maybe you have read articles on the Internet about the countries where GMOs are banned, and countries that use GMOs in their seeds or food production. If GMOs are so bad, why doesn’t every country ban them?\n\nThe information discussed here about GMO bans is up-to-date as of February 2021.\n\nLike everything else surrounding the GMO debate, there are no simple answers. Most countries or parts of them have moved between banning some GMOs for a specified time, letting some GMOs in after much research, and limiting others altogether. The research is changing and is challenging to keep up with.\n\nIn the European Union, a European Commission rule was passed that gave countries in the European Union the option to opt-out of growing genetically modified crops. According to the Commission’s website, nineteen out of the 27 member state countries of the EU have voted to either partially or fully ban GMOs. The Commission reports “several countries such as France, Germany, Austria, Greece, Hungary, the Netherlands, Latvia, Lithuania, Luxembourg, Bulgaria, Poland, Denmark, Malta, Slovenia, Italy and Croatia have chosen a total ban. Wallonia, the French-speaking region of Belgium has opted out, as well as Scotland, Wales and Northern Ireland.”\n\nIn the realm of GMOs in consumer food products, the EU has specific regulations requiring the labeling of GMOs in consumer foods, something the United States will begin to implement as well in January 2022.\n\nOther than mandatory labeling, in the United States, there is no official legislation banning GMOs by the Department of Agriculture or the Food and Drug Administration. However, Humboldt, Mendocino, Trinity, Santa Cruz, Sonoma and Marin counties in California are the counties in the US that have successfully banned GM crops.\n\nAround the world, countries continue to debate GMO use. In 2016, Russia imposed a full ban on growing or producing food using genetically modified plants or animals. This resulted from a 10-year moratorium placed on GMOs in 2013 so more experiments, tests and new methods of research could be developed. According to The Vice President of the National Association for Genetic Safety, Irina Ermakova at the time of the moratorium, “Biotechnologies certainly should be developed but GMOs should be stopped. (We) should stop it from spreading.”\n\nAlso banning GMOs are Turkey, Kyrgyzstan, Bhutan and Saudi Arabia in Asia; and Belize, Peru, Ecuador and Venezuela in the Americas. Only four out of 47 countries in Africa have made it legal to plant any GMO crops at all: South Africa, Burkina Faso, Sudan and Nigeria.\n\nSome countries that have not banned GMOs have restrictions on them, or have a temporary ban until more research is done. According to Zimbabwe’s policy on GMO foods outlined in the article, “No to GMOs, Position Unchanged,” the country will continue to ban GMOs until there is more evidence. As of now, the country prohibits the production of GMOs.\n\nAs Peru’s 10-year ban on GMOs is set to expire in 2021, the country banded together in 2020 to support the continuation of the ban with the campaign “La Biodiversidad es nuestra Identidad (Biodiversity is our Identity)” according to a report by Organic Without Boundaries. The ban on GMOs in the country has helped to support the 2.2 million small-scale farmer families who provide approximately 75% of the country’s produce, according to the report.\n\nDoes a GMO ban really mean a ban?\n\n\n\nPhoto by The Matter of Food on Unsplash\n\nIf a country bans GMOs, does that really mean they are fully banned? Not always. Here’s why it gets confusing:\n\nAs stated above, countries like Peru, Zimbabwe, and Russia have all established temporary bans at one time or another. These do not guarantee that GMOs stay out of a country permanently, but only until there is more research done.\n\nIn addition, governments will attempt an authorization for specific types of GM seeds. For instance, in 2017, the majority of European Union governments voted against authorizing two new strains of GMO maize, Dupont Pioneer’s 1507 and Syngenta’s Bt11. These strains are resistant to Bayer’s glufosinate herbicide and produce their own pesticide to kill insects. The EU governments also voted against renewing the license for Monsanto’s MON810, the only GMO crop currently grown in the EU.\n\nAlthough the majority opposed all three crops, “the votes for all of these did not decisively block their entry to the EU because the opposition did not represent a ‘qualified majority.’” A qualified majority means that 55% of member states, representing at least 65% of the EU population, vote in favor.\n\nUltimately the president of the EU will make the decision, but even if it gets approved, countries can use the opt-out to prevent the GMOs from being grown in their territory.\n\nIn addition to the complexities of banning GMOs fully versus allowing specific strains, the question of banning GMOs becomes even more complicated when turning from consumer to animal consumption of food. While many EU countries may not grow GMO crops for human consumption, some grow it or import it for their livestock. Dr. Robert Paarlberg, PhD, a researcher on food and agricultural policy at Wellesley College, said that the EU as a whole imports considerable GMO soy for animal feed, and some countries grow small amounts of GMO corn for their animals. Various types of GMO cotton, maize, rapeseed and sugar beets are legal to import. He said very few countries explicitly ban GMOs; instead, governments have not yet approved the domestic cultivation of GMO crops.\n\nDr. Paarlberg also states the EU is different from the US because food label rules are different. The EU required mandatory labeling of food products that have even a small trace of GMOs far before the United States. Because of these rules, and to avoid needing a label, many food companies in Europe have taken out all GMO ingredients, limiting GMO foods for direct human consumption from the market. However, Europeans continue to use GMO corn and soy for feed because label rules don’t require them to disclose it for livestock, or on the meat or products the livestock produce for human consumption.\n\nSee why there are no easy yes or no answers?\n\nAre countries banning GMOs because of science or public pressure?\n\nAccording to the World Health Organization, countries that have rules in place restricting GMOs in their food are focused centrally on whether there is a consumer health risk associated with GMOs.\n\nMuch has been written about the safety of GMOs in food, but is an example:\n\nA study published in Environmental Sciences Europe journal found severe liver and kidney damage, hormonal disturbances and large cancerous tumors in rats that were fed GM maize in conjunction with low levels of Roundup. Other studies have linked GMO feed to enlarged uteri and severe stomach inflammation in pigs. These and other studies have concluded that more research is needed before GMO foods can be accepted as safe.\n\nThe Genetic Literacy Project challenges that independent science organizations in every nation have made public statements that GM products are safe. They argue that the nations that are banning the import or cultivation of GMO products are not doing so because of science, but instead because of wanting to avoid controversy. The website suggests that public uneasiness, trade protectionism, pressure from advocates, and protecting a country’s image are reasons behind the bans. In addition, many scientists in places where severe weather patterns can impact food scarcity advocate for the use of GMO crops, citing them as less susceptible to drought and flooding. In response to these claims, government agencies like the UN argue that there are other methods to solving hunger that do not utilize genetically modified crops.\n\nSo what do you think? Should countries ban GMOs from food cultivation? What are the motivations of the countries that ban GMOs? Is it okay for countries that have banned GMOs to still give GMO feed to the animals their citizens are consuming? Should countries disclose that animals were fed using GMO crops on their labels? Let’s start talking!", "opengraph": {"locale": "en_US", "type": "article", "title": "Where are GMO's banned?", "url": "https://gmowatch.com/where-are-gmos-banned/", "site_name": "GMO Watch", "article:published_time": "2021-07-08T13:23:21+00:00", "article:modified_time": "2021-12-03T15:46:06+00:00", "image": "https://gmowatch.com/wp-content/uploads/2018/06/header_where-gmos-banned.jpg", "image:width": "1490", "image:height": "780", "image:type": "image/jpeg", "description": "Where are GMO's banned?\r\nBy Emily Journey / Contributor\r\nMuch has been researched and written about the use of genetically modified organisms, or GMOs, in food. And the findings and opinions are fervently divided.    \r\nWhere are GMO's banned?\r\nBy Emily Journey / Contributor\r\nMuch has been researched and written about the"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ec.europa.eu/environment/europeangreencapital/countriesruleoutgmos/", "https://gmowatch.com/do-genetically-modified-foods-have-to-be-labeled-in-the-us/", "https://www.ams.usda.gov/resources/industry-fact-sheet-national-bioengineered-food-disclosure-standard", "https://brownfieldagnews.com/news/california-adds-gmo-free-zones/", "https://www.loc.gov/law/foreign-news/article/russia-full-ban-on-food-with-gmos/", "https://www.rt.com/news/gmo-ban-russian-scientists-293/", "https://sustainablepulse.com/2015/10/22/gm-crops-now-banned-in-36-countries-worldwide-sustainable-pulse-research/#.YBwJjehKhaR", "https://www.sundaymail.co.zw/no-to-gmos-position-unchanged", "https://www.organicwithoutboundaries.bio/2020/08/14/peru-fights-to-keep-gmos-out-of-its-soils/", "https://unsplash.com/@thematteroffood?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/fruit?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://www.ecowatch.com/eu-nations-vote-against-gmo-crops-2332080511.html", "https://www.ecowatch.com/eu-nations-vote-against-gmo-crops-2332080511.html", "https://www.ecowatch.com/eu-nations-vote-against-gmo-crops-2332080511.html", "https://www.bestfoodfacts.org/gmos-banned/", "https://gmowatch.com/do-genetically-modified-foods-have-to-be-labeled-in-the-us/", "https://www.bestfoodfacts.org/gmos-banned/", "https://unsplash.com/@steffipereira?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/vegetable-garden?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://www.who.int/news-room/q-a-detail/food-genetically-modified", "https://gmowatch.com/are-genetically-modified-foods-safe-to-eat/", "https://www.collective-evolution.com/2017/07/19/heres-why-more-that-35-countries-have-banned-genetically-modified-crops-from-their-country/", "https://geneticliteracyproject.org/gmo-faq/where-are-gmo-crops-and-animals-approved-and-banned/", "https://allianceforscience.cornell.edu/blog/2019/04/nigerias-approval-gmo-crops-boosts-africas-hopes-technology/", "https://www.un.org/en/chronicle/article/biotechnology-solution-hunger"], "authors": ["Emily"], "publish_date": "2021-07-08T13:23:21+00:00"}