{"result_id": "137026", "URL": "https://gmwatch.org/en/news/archive/2007/10104-gm-vaccine-lab-likely-source-of-uk-foot-and-mouth", "timestamp": "2023-04-25 15:18:27 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/news/archive/2007/10104-gm-vaccine-lab-likely-source-of-uk-foot-and-mouth", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "GM vaccine lab likely source of UK foot-and-mouth", "cleaned_text": "1.Lab Likely Source of UK Foot-and-Mouth \n\n2.UK Foot And Mouth Disease Outbreak Near FMD GM Vaccine Research Lab\n\n1.Lab Likely Source of UK Foot-and-Mouth \n\nBy JILL LAWLESS Associated Press, 5 August 2007 [shortened]\n\nLONDON - Hopes rose Sunday that a potentially disastrous foot-and-mouth outbreak in Britain could be contained, as scientists grew increasingly suspicious that the disease came from a government animal laboratory near the infected farm.\n\nThe agriculture department said late Saturday that the strain of foot-and-mouth disease found on a farm in southern England was identical to one used at a research laboratory a few miles away. The department said the strain had not recently been seen in live animals.\n\n\"Chief veterinary officer Debby Reynolds has confirmed that the biosecurity arrangements at the Pirbright Laboratory are being investigated as a possible source of the foot-and-mouth disease outbreak. At a Defra briefing at 3.15pm today (Saturday), Mrs Reynolds said it was too early to favour any hypothesis of where the disease might have come from over another. But she said: 'Pirbright has been asked to review its biosecurity arrangements.'...\"\n\nNLPWESSEX: The new outbreak, the first since 2001, is on a farm at Wanborough, Nr Guildford, Surrey, in the south of England.\n\nThe farm is a relatively short distance from the UK's leading Foot And Mouth research laboratory at the Institute of Animal Health, Pirbright...\n\nWith the suddenly renewed focus on public policy in relation to the management of this highly contagious animal health disease, which occurs throughout much of the world, it is worth considering the following from our earlier bulletin of 10 September 2001:\n\n\"..... a paper submitted to the Journal of General Virology 31 October 2000 by UK government scientists from the Institute of Animal Health at Pirbright indicates that they had been working on a genetically engineered recombinant DNA vaccine [for FMD]...\n\nIn the trials described in the journal in which pigs were challenged with live virus, the recombinant DNA vaccine only provided protection for some of the animals tested and 'was not as effective as conventional virus vaccine'. The paper also states: 'A particularly serious problem is that several outbreaks in Europe have been attributed to incomplete inactivation of the virus or to the escape of live virus from vaccine production laboratories'. The paper in fact makes passing reference to the UK outbreak [in 2000], because although the paper was originally submitted in October 2000 it was not accepted for publication (presumably with interim revisions required by the journal review panel) until 30 March 2001(http://www.sgm.ac.uk/JGVDirect/17505/17505ft.htm ).\n\nIt would certainly be regrettable if, in attempting to produce a new genetically engineered vaccine only a less effective type had been created, and in the process a foot-and-mouth virus had escaped into the environment - irrespective of whether the virus itself was naturally occurring or man made.\"\n\nA wide range of interest groups, including the leading UK organic certification body the Soil Association, has long advocated vaccination as a primary control method for FMD outbreaks. However, awareness that such an approach is increasingly heading in the direction of genetically engineered options is not widespread.\n\nFor more on this area of biotechnology (including the claim by former US veterinary consultant Dr Patricia Doyle that synthetic FMD vaccine trials had been going on in the UK in the months leading up to the 2001 outbreak) see our bulletin of 10 September 2001 \"Losing Control of Global Biosecurity\".\n\n\n\nThese issues are part of a growing broader concern about the inability to effectively control the biotech sector, particularly given the potentially lethal combination of radical genetic engineering techniques and human error.\n\nIt is not possible to ban the latter. So what about banning the former?\n\nNLPWESSEX, natural law publishing\n\nnlpwessex.org \n\n\n\n\"They wanted to make a contraceptive vaccine by altering the genes of the mousepox virus. But in January the project gained notoriety after the pair inadvertently created an unusually virulent strain of mousepox. If a similar genetic manipulation were applied to smallpox, the scientists realized, this feared killer could be made even more dangerous.\"", "opengraph": {"type": "website", "title": "GM vaccine lab likely source of UK foot-and-mouth", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/46-2007/10104-gm-vaccine-lab-likely-source-of-uk-foot-and-mouth"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://www.forbes.com/feeds/ap/2007/08/05/ap3988208.html", "http://null/www.nlpwessex.org/docs/fmdlab.htm", "http://www.btinternet.com/~nlpwessex/Documents/losingcontrolbiosecurity.htm"], "authors": [], "publish_date": "2007-08-05T00:00:00+00:00"}