{"result_id": "137002", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19962-revelations-on-lancet-editor-who-published-letter-slamming-covid-lab-leak-theory-as-conspiracy", "timestamp": "2023-04-25 15:18:16 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19962-revelations-on-lancet-editor-who-published-letter-slamming-covid-lab-leak-theory-as-conspiracy", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Revelations on Lancet editor who published letter slamming COVID lab leak theory as \"conspiracy\"", "cleaned_text": "Dr Richard Horton admitted he knew that Dr Peter Daszak had links to the Wuhan laboratory at the centre of the spillover theory\n\nThis article is long and detailed – below is an excerpt. It's worth reading the full article at the URL given.\n\n---\n\nLancet editor who published letter slamming Covid lab leak theory as 'conspiracy' admits he knew about lead author's links to Chinese lab at centre of cover-up for a YEAR before acknowledging conflict of interests\n\nBy Joe Davies, health reporter for Mailonline and Victoria Allen, science correspondent for the Daily Mail\n\nDaily Mail, 17 Dec 2021\n\nhttps://www.dailymail.co.uk/news/article-10320621/Brit-scientist-took-year-declare-links-Chinese-lab-opposing-Covid-lab-leak-theory.html\n\n[excerpt only]\n\n\n\n* Dr Richard Horton, editor of The Lancet, said it took 16 months to publish official conflict of interest statement\n\n* Admitted he knew that Dr Peter Daszak had links to the Wuhan laboratory at the centre of the spillover theory\n\n* Claimed it took longer than a year to persuade Dr Daszak to formally record his links with China\n\n\n\nThe editor of one of the world's most prestigious medical journals has admitted it took more than a year to declare the conflict of interests of a scientist who denounced the Covid lab leak theory and called anyone who questioned the official Chinese narrative a conspiracy theorist.\n\n\n\nDr Richard Horton, editor of The Lancet, said it took 16 months to publish an official conflict of interest statement in which he revealed Peter Daszak had links to the Wuhan laboratory at the centre of the spillover theory.\n\n\n\nDr Daszak organised the letter in February 2020, co-signed by 26 other leading researchers which condemned 'conspiracy theories' that Covid did not arise naturally.\n\n\n\nThe move is claimed to have shut down any debate over whether the virus could have escaped from a lab last year. But the zoologist, a Lancastrian who now lives in New York, had ties to Wuhan Institute of Virology stretching back 15 years.\n\n\n\nDuring a grilling from MPs on the Science and Technology Select Committee on Wednesday, Dr Horton was forced to defend the 16-month delay before Dr Daszak's important conflicts of interest were finally published in a memorandum in the journal this June.\n\n\n\nDr Horton, who was honoured at The Great Hall of the People in Beijing's Tiananmen Square in 2008, to mark an 'unprecedented' collaboration between Peking University and The Lancet, admitted to MPs: 'A hundred per cent, I completely agree, the information that we published in June as an addendum should definitely have been included in the February letter.'\n\n\n\nBut he told the committee it took longer than a year to persuade Dr Daszak to formally record his links with China.\n\n\n\nThe Lancet editor said: 'We ended up having a debate with him about, well, do you have a competing interest or not?'\n\n\n\nDr Daszak argued that he was an expert on bat coronaviruses in China, with a view that should be listened to. Dr Horton said: 'It took us over a year to persuade him to declare his full competing interest, which we eventually did in June of this year.'\n\n\n\nThe journal editor was accused of doing 'too little too late' by Conservative MP Aaron Bell, who also questioned whether the controversial original Lancet letter had 'served to close down scientific debate'.\n\n\n\nOn why Dr Daszak's links with Wuhan Institute of Virology had not been checked, Dr Horton said: 'We ask everybody who submits a piece that's accepted for publication in The Lancet to declare their competing interests, and we take those statements on trust.\n\n\n\n'And in this particular case, regrettably, the authors claim that they have no competing interests, and of course... there were indeed competing interests that were significant, particularly in relation to Peter Daszak.'\n\n\n\nThe Lancet established an office in Beijing, in addition to its New York office and London headquarters, in 2010.\n\n\n\nIn 2015, Dr Horton travelled to Beijing to receive the Friendship Award from China – the highest honour awarded to 'foreign experts who have made outstanding contributions to the country's economic and social progress'.\n\n\n\nHe claimed China faced a 'blame game' over the origins of the pandemic, despite admitting that it had denied the World Health Organisation access to crucial information needed for an investigation into the cause of the outbreak.\n\n\n\nLeaked emails earlier this year revealed it was Dr Daszak who drafted the Lancet letter dismissing non-natural causes of the pandemic, such as a lab leak, as conspiracy theories.\n\n\n\nAs president of the EcoHealth Alliance, a not-for-profit organisation researching emerging infectious diseases, he asked colleagues to sign and 'circulate it among some eminent scientists'.\n\n\n\nOn the 'debate' with Dr Daszak over his conflicts of interest, Dr Horton told MPs: 'It's quite an interesting debate, because his view was, look, I'm an expert in working in China on bat coronaviruses.\n\n\n\nThat isn't a competing interest – it actually makes me an expert with a view that should be listened to. Our take was, well, in the court of public opinion, that is a competing interest you should declare.'\n\n\n\nDr Horton faced comparisons with The Lancet's notorious publication of a paper linking the MMR vaccine to autism, by disgraced academic Dr Andrew Wakefield, which was only retracted 12 years later.\n\n\n\nLabour MP Graham Stringer said: 'Was nothing learnt about trust in The Lancet from the experience with Wakefield?'\n\n\n\nDuring the session, Harvard scientist Dr Alina Chan said the Wuhan lab leak is now the most likely origin of the coronavirus pandemic because China tried to cover it up and because experts still haven't found an animal host despite extensive searching.\n\n\n\nShe said the idea that the virus may have been genetically engineered is 'reasonable'.\n\n\n\nShe highlighted a number of coincidences in the Covid timeline and said the state-sponsored Chinese cover-up of the early stages of the pandemic added to suspicion.\n\n\n\nSpeaking to the Science and Technology Select Committee, Dr Chan said: 'I think the lab origin is more likely than not.\n\n\n\n'Right now it's not safe for people who know about the origin of the pandemic to come forward.\n\n\n\n'But we live in an era where there is so much information being stored that it will eventually come out.\n\n\n\n'We have heard from many top virologists that a genetically engineered origin is reasonable and that includes virologists who made modifications to the first Sars virus.'\n\n\n\nDr Chan, who wrote a book on the origin of the virus, added: 'We know this virus has a unique feature, called the furin cleavage site, and without this feature there is no way this would be causing this pandemic.\n\n\n\n'A proposal was leaked showing that EcoHealth and the Wuhan Institute of Virology were developing a pipeline for inserting novel furin cleavage sites.\n\n\n\n'So, you find these scientists who said in early 2018 'I'm going to put horns on horses' and at the end of 2019 a unicorn turns up in Wuhan city.'\n\n\n\nViscount Matt Ridley, who co-authored the book with Dr Chan, also said a lab leak is now the most likely theory because experts have still not found the animal host that would support a natural origin despite two years of extensive searching.\n\n\n\nRecent revelations of China's attempted cover-up have forced British and US intelligence officials to take seriously the lab-leak hypothesis, once dismissed as a crank conspiracy theory. \n\n\n\nLord Ridley said: 'I also think it's more likely than not because we have to face the fact after two months we knew the origins of SARS, and after a couple of months we knew MERS was though through camels, but after two years we still haven't found a single infected animal that could be the progenitor, and that's incredibly surprising.\n\n\n\n'We need to find out so we can prevent the next pandemic. We need to know whether we should be tightening up work in laboratories or whether we should be tightening up regulations related to wildlife markets. At the moment we are really not doing either.\n\n\n\n'We also need to know to deter bad actors who are watching this episode and thinking that unleashing a pandemic is something they could get away with.'\n\n\n\nA May 2021 report from The Wall Street Journal cited an undisclosed intelligence report detailing how three scientists from China's Wuhan Institute of Virology (WIV) sought hospital care in November 2019, months before China disclosed the Covid pandemic.\n\n\n\nThe lab specialised in engineering dangerous coronaviruses and is the only level four biochemical lab in China.\n\n\n\nAn article in the respected Science journal on May 14 kick-started the surge in interest for the lab-leak theory.\n\n\n\nSome 18 experts wrote in the journal that 'we must take hypotheses about both natural and laboratory spillovers seriously until we have sufficient data'.\n\n\n\nLater that month, a study by British Professor Angus Dalgleish and Norwegian scientist Dr Birger Sørensen claimed it had 'prima facie evidence of retro-engineering in China' for a year.\n\n\n\nThe study included accusations of 'deliberate destruction, concealment or contamination of data' at Chinese labs.\n\n\n\nIt followed statements from the WHO Director General, US and EU that greater clarity about the origins of this pandemic is necessary and feasible to achieve.\n\n\n\nPreviously, the theory had been dismissed as conspiracy by most experts, partly because of its association with Donald Trump.\n\n\n\nPresident Joe Biden in May ordered a full investigation into the origin of the pandemic virus and demanded scientists work out whether there is truth to the theory.\n\n\n\nThe head of the WHO insisted just a day earlier that the theory that Covid emerged from a Wuhan lab has not been ruled out – as he said China should help solve the mystery out of 'respect' for the dead.\n\n\n\nThe body's director-general, Dr Tedros Adhanom Ghebreyesus, suggested that Beijing had not cooperated fully as he urged more 'transparency' in the continuing investigation.\n\n\n\nHowever, several other sects of the scientific community continue to suggest the virus could only be natural in origin.\n\n\n\nA series of recent papers pointed to the virus evolving in animals before being transmitted to humans, in the same way as all other previously discovered coronaviruses.\n\n\n\nThe first study, published in Scientific Reports , showed some 47,000 wild animals from 38 species were sold across four markets in Wuhan between May 2017 and November 2019.\n\n\n\nThe authors, including Dr Chris Newman, an evolutionary ecologist at Oxford University, claimed the evidence showed the conditions for animal-to-human transmission were in place in Wuhan.\n\n\n\nBut they acknowledged there was no proof Sars-CoV-2 was present or originated in any of these animals.\n\n\n\nA joint WHO-China investigation also concluded it was 'very likely' the virus jumped from bats to humans via an as-yet-unknown intermediary animal.\n\n\n\nLord Ridley slammed the Lancet for a 'lack of transparency', with Dr Daszak's links to the lab and role in orchestrating the letter only being revealed after it was leaked.\n\n\n\nIn the grilling with MPs, Dr Horton insisted he did not know about the scientist's connections to the lab's so-called 'bat woman' Shi Zhengli – who did experimental research on coronaviruses coming from thousands of samples from the animal – until after the letter was published.\n\n\n\nBut he admitted that his opinion on the theory has now changed, calling it a 'valid hypothesis that requires investigation'.\n\n\n\nDr Horton said the Lancet usually takes authors' declarations of interest at face value.\n\n\n\nHe said: 'In this case regrettably the authors claimed they had no interest but there were indeed competing interests that were significant, particularly in relation to Peter Daszak.\n\n\n\n'We weren't aware of those competing interests but we became very quickly aware of them afterwards because he was subject to considerable public criticism.' \n\n\n\nDr Horton added that the World Health Organization's investigation into the lab – which in March this year concluded that the leak theory was one of four valid hypotheses for Covid's origins – had changed his mind that it was impossible for the virus to have come from anything other than natural origin.\n\n\n\nBut he said he agreed with the organisation's assertion that it was an unlikely hypothesis – despite acknowledging that the investigation was hampered by Chinese authorities.\n\n\n\nAsked to provide a percentage figure on his confidence in the theory, he said: 'I agree with the World Health Organization that it's a valid hypothesis that requires investigation but is extremely unlikely.'\n\n\n\nLord Ridley slammed Dr Daszak for not revealing his direct role in funding controversial gain-of-function research – which manipulates viruses to make them more transmissible and deadly and is illegal in Europe – at the lab until the information was leaked.\n\n\n\nAnd he said it was 'extraordinary' that Dr Daszak's role in orchestrating the Lancet letter was also not revealed until it was revealed by leaked emails.\n\n\n\nHe said: '[Daszak] said to his co-authors that it should not appear to be coming from him or his organisation and he remained on the Lancet commission investigating the origin of Covid for many months thereafter.\n\n\n\n'So there has been a significant lack of transparency, not just from the Chinese authorities, but from Western ones as well on this and that does seem to me a huge problem.'\n\n\n\nEarlier this year, an investigation by The Sunday Times revealed efforts by Beijing to control the WHO's decision making, sabotage investigations and even install officials.\n\n\n\nThe newspaper claims the WHO failed to publicly challenge Chinese misinformation, delayed declaring an international emergency, and discouraged governments from placing travel bans on China to protect its economy.\n\n\n\nIt has also been suggested officials agreed a 'backroom deal' with the Chinese to water down the inquiry into the origins of Covid-19.\n\n\n\nThis meant steering scientists away from the theory coronavirus actually escaped from a Wuhan laboratory, rather than coming from wild animals in a wet market in the city in December 2019.\n\n\n\nThe theory was initially dismissed as 'extremely unlikely' by the WHO but now experts say there might have been 'human error' at the lab.\n\n\n\nCentral to the paper's claims is that close ties between the WHO's leadership and China had impacted on its ability to challenge the country over the emergence of the virus.\n\n\n\nIt is suggested China has for some time been using financial leverage over poorer nations to install its preferred figures into key roles at the WHO as well as other UN-governed bodies.\n\n\n\nChief among the decision makers at the WHO is Tedros, who is a long-time friend of China. He visited President Xi in January 2020, two months before the pandemic began.\n\n\n\nBetween 2000 and 2012, there were around 130 official Chinese finance projects in Zimbabwe, with some totalling hundreds of million of pounds to build hydroelectric dams and provide agricultural machinery.\n\n\n\nIn June last year, Zimbabwe was one of 53 countries to back the Hong Kong national security law at the United Nations, derided by Western nations as a clampdown on protestors and free speech by China.\n\n\n\nProfessor Richard Ebright, a fellow of America's Infectious Disease Society, told the Times that China's efforts had a 'decisive role' in affecting the agency's failure to act.\n\n...\n\n\n\nRead on here:\n\nhttps://www.dailymail.co.uk/news/article-10320621/Brit-scientist-took-year-declare-links-Chinese-lab-opposing-Covid-lab-leak-theory.html", "opengraph": {"type": "website", "title": "Revelations on Lancet editor who published letter slamming COVID lab leak theory as \"conspiracy\"", "url": "https://www.gmwatch.org/en/106-news/latest-news/19962-revelations-on-lancet-editor-who-published-letter-slamming-covid-lab-leak-theory-as-conspiracy", "description": "Dr Richard Horton admitted he knew that Dr Peter Daszak had links to the Wuhan laboratory at the centre of the spillover theory\r\n"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.dailymail.co.uk/news/article-10320621/Brit-scientist-took-year-declare-links-Chinese-lab-opposing-Covid-lab-leak-theory.html", "https://www.dailymail.co.uk/news/article-10320621/Brit-scientist-took-year-declare-links-Chinese-lab-opposing-Covid-lab-leak-theory.html"], "authors": ["Editor2"], "publish_date": "2022-01-03T16:48:25+00:00"}