{"result_id": "137033", "URL": "https://www.gmwatch.org/latest-listing/1-news-items/6647-fmd-and-transgenic-edible-vaccines", "timestamp": "2023-04-25 15:18:31 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/latest-listing/1-news-items/6647-fmd-and-transgenic-edible-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "FMD and transgenic edible vaccines", "cleaned_text": "The recent outbreak of foot and mouth virus (FMDV) has led many to wonder whether or not there was a connection between the outbreak and experiments in genetic technology. There have been experiments done using transgenic constructions to construct edible vaccines to treat the disease. Field testing such constructions does not fall under regulations governing transgenic crops used for food. It is worth enquiring of the governments of countries about the studies, if any, being undertaken. The transgenic vaccines reported have been transgenic alfalfa with foot and mouth virus structural proteins (Wigdorovitz et al a 1999), plants infected with tobacco mosaic virus genetically altered with FMDV structural protein (Wigdorovitz et al b1999) or bacterial plasmids containing genes for FMDV protein (Wong et al 2000). Use of genetically modified (GM) organisms to deliver edible vaccines has proven effective in protecting farm animals but the procedure is not without drawbacks. One complication with oral vaccines is called \"oral tolerance\". When antigens are taken up in food repeatedly the antigen may suppress production of antibody. In autoimmune diseases such as arthritis, diabetes and multiple sclerosis antigens are produced in target tissues leading to disease. When quantities of the target antigen , such as collagen in arthritis, is fed the autoimmune disease is suppressed and many patients experience relief. Indeed, antigens for autoimmune disease are being introduced into crop plants to treat the symptoms of autoimmune disease. However, oral vaccines in regular food supplies may suppress immunity to the disease normally protected by the vaccine(Langridge 2000, Weiner 1997). Measures must be taken to prevent the spread of food vaccines to the general food supply. Transplacental exposure to the edible vaccine may cause the fetus to be tolerant to the virus to the extent that the animal may become a carrier of the virus without showing symptoms ( an example of a carrier might be \"typhoid Mary\" of elementary texts). The crops modified to be used as edible vaccines should be scrupulously maintained for that purpose alone. Recently corn modified as an edible vaccine for a swine virus was promoted by the company inventing it. It was promised that the GM corn would be grown under \"rigorously controlled conditions and used only for the expressed purpose of vaccine production\"(\"Edible Vaccine Success\" In Brief Nature Biotechnology 18,367,2000). Such commitment is essential but such promises should be viewed in the light of StarLink corn that was approved only for animal consumption but appeared in foods for human consumption. GM crops as edible vaccines should be restricted to plant tissue culture or to contained plant growth chambers or high security greenhouses. In conclusion, edible vaccines for FMDV have been tested and described in the scientific literature. Edible vaccines are effective but have potential side effects that may actually contribute to spread of the disease. Government regulators should make any experiments with edible vaccines public.\n\nLandridge,W \"Edible Vaccines\" 2000 Scientific American on line Sept. Weiner,H. \"Oral tolerance for treatment of autoimmune diseases\" 1997 Ann Rev Med 48,341-51 \n\n\n\nWigdorovitz,A,Carrillo,C,DusSantos,M,Trono,K,Peralta,A,Gomez,M,Rios,R, Franzone,P,Sadir.A,Escribano,J and Borca,M \"Induction of a protective antibody response to foot and mouth disease virus in mice following oral or parental immunization with alfalfa transgenic plants expressing the viral structural protein VP1\" 1999 aVirology 255,347-53\n\nWigdorovitz,A,Perez Filgueira, Roberson,N,Carrilo,C, Sadir,A, Morris,T and Borca,M \"Protection of mice against challenge with foot and mouth disease virus (FMDV) by immunization with foliar extracts of plants infected with recombinant tobacco mosaic virus expressing the FMDV structural protein VP1\" 1999b Virology 264,85-91\n\nWong,T,Cheng,E,Chan,Z,Sheng,W,Yan,W,Zheng,Z and Xie,Y \"Plasmids encoding foot and mouth disease virus VP1 epitopes elicited immune responses in mice and swine and protected swine against viral infection\" 2000 Virology 278,27-35", "opengraph": {"type": "website", "title": "FMD and transgenic edible vaccines", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/40-2001/6647-fmd-and-transgenic-edible-vaccines"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share"], "authors": [], "publish_date": "2001-03-17T00:00:00+00:00"}