{"result_id": "137005", "URL": "https://gmwatch.org/en/news/archive/2014/15596-keith-kloor-trash-talking-the-enviros-or-just-talking-trash", "timestamp": "2023-04-25 15:18:18 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/news/archive/2014/15596-keith-kloor-trash-talking-the-enviros-or-just-talking-trash", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "Keith Kloor: Trash-talking the enviros – or just talking trash?", "cleaned_text": "Blogger Keith Kloor doesn’t like environmentalists – and is a stranger to science and logic, writes Jonathan Matthews\n\nTHE BLOGGER Keith Kloor doesn't like environmentalists – at least, not the ones who want real change – and he's found a way of attacking them. \n\n\n\nKloor takes the enormous frustration with the climate change denial industry that's driven many to tell denialists to stop because the science is settled, and then projects that exasperation onto quite different issues – issues like nuclear power, GMOs, or whatever else Kloor disagrees with greenies about. Kloor then operates as a kind of social media policeman, going around shouting variants on \"Shut up you denialist!\" at whoever expresses opinions he does not like. \n\n\n\nIn the case of GMOs, Kloor labels those with concerns \"the climate skeptics of the left\". He bemoans the fact that they include \"prominent environmental groups, supposed food-safety watchdogs... influential food columnists\", and even \"well-respected scholars\", \"legendary journalists\" and \"progressive media outlets\". Kloor's way of punishing these \"liberal validators\" is to associate them with whatever idiocy is perpetrated by the flakiest of GMO opponents and the \"sewage of disinformation\" to be found on the net.\n\n\n\nKloor also tries to silence the critics by associating them with fringe groups, like anti-vaxxers. Hence his recent post on GMOs, Why Vaccine and GMO Denial Should be Treated Equally, in which he goes after the dietitian Carole Bartolotto for a recent Huffington Post article in which she laments the complete absence of epidemiological research on GM food consumption and argues that without this kind of long-term data \"no one can make the claim that GMOs are proven safe\".\n\n\n\nAccording to Kloor, the editors of Huffington Post should never have allowed such a piece to be published. But his riposte to Bartolotto, whom he predictably accuses of fearmongering and \"pure denialism\", is void of either new facts or insights. Instead, Kloor relies on guilt by association, claiming that if people don't like anti-vaxxers, then they shouldn't like skepticism about GMOs because he thinks lumping the two together is the only logically consistent thing to do. But how useful is Kloor's parallel? \n\n\n\nLet's assume for a moment that the argument that vaccines are accepted as safe is just that simple (and it is not that simple). To any reasonable person, that doesn’t mean that no safety testing should be done on any existing or new vaccine. Vaccines are considered safe (or at least better than a world without vaccines) by many people – including me – largely because they are developed, produced and tested through a route we trust. Lose that trust and you lose support for vaccines. Moreover, they are administered by people we can hold to account. I can't so easily track down the cause of a problem in my food because inputs into the food chain become blended and opaque at the household level, particularly when GM foods are unlabeled in a major producer continent, North America.\n\n\n\nContrary to what Kloor says, vaccines have little in common with GMOs – except the lesson that if you lose trust you lose people. Having said that, the safety review of vaccines is neither perfect nor impossible to improve. In fact, the process relies too much on the manufacturers themselves – a problem that applies to both GMOs and vaccines.\n\n\n\nThe issue with GMOs is that manufacturers and advocates fail to create trust between themselves and those that they expect to eat their products. Astoundingly, they lack even the level of trust we hold in big pharma. And the \"GMOs haven't so far been shown to kill people\" argument does not produce more confidence in the products, especially when most people have legitimate concerns about undesirable food safety effects other than sudden death. And unlike vaccines, society has highly effective alternative ways of addressing agriculture's needs without opting into a model where large institutions, either private or public, use their concentrated economic and political resources to provide genetically engineered solutions to farmers. \n\n\n\nMoreover, no reputable science organisation has endorsed all future GMOs even if from time to time their boards issue statements saying that they have no concern for those historically used in food. It is misleading to suggest otherwise. And, of course, none of these organisations endorses any particular product. Can you see the National Academy of Sciences saying, \"We think Monsanto's NK603 Roundup Ready corn is a good, safe product and we endorse it being fed to babies\"? That would put the liability for the product on them. Why would they accept that liability when they have no control over its production? Likewise, why should society accept that these products will always be safe when they have very little access to the details of their design, manufacture and oversight? That some science organisations say that in their view there is to date no evidence of human health effects is not a case for saying that GMOs should be less regulated in the future or for denying the need for the epidemiological studies on GMOs that Bartolotto calls for. It is certainly not a case for arguing that articles that discuss these issues, like Bartolotto’s, should be barred from publication – as Kloor apparently believes.\n\n\n\nBut rather than engage with such complexities, Kloor simply projects himself as the keeper of True Science and the determiner of legitimate scientific questions. In other words, he is in the business of shutting down debate. That's why, together with industry gunslingers, Kloor has attacked the Reuters journalist Carey Gillam for supposedly showing \"false balance\" on the GM issue.\n\nAfter Gillam reported on a statement by a large number of international scientists saying there was no scientific consensus on GMO safety, Kloor accused her of \"willfully ignoring\" a \"scientific consensus\" – which clearly did not exist. Kloor dismissed the scientists who signed the statement as \"a smattering of outliers and GMO opponents\", even though they included a number of notable scientists, such as Hans Herren, the winner of the World Food Prize.\n\n\n\nThere is a particular irony to Kloor constantly invoking the consensus on climate change as a way of ganging up on those he wants to silence on other issues. This is because Kloor's own thinking on climate issues is seriously open to question. Kloor is, for instance, a keen defender of Roger Pielke Jr, whose work is frequently cited by climate skeptics. It has also been suggested that Kloor's real concern is not scientific accuracy but \"trash-talking\" environmentalists.\n\n\n\nThis view chimes with that of Glenn Davis Stone, Professor of Anthropology & Environmental Studies at Washington University, St Louis. Stone, an expert on the impact of GM cotton in India and by no means a GMO opponent, accuses Kloor of doing a disservice to science in his article, The GMO-Suicide Myth. Kloor's goal, according to Stone, is not to understand the suicide problem but \"to whip up hatred toward Vandana Shiva and 'liberal and environmentalist circles', where GMOs are unpopular\". Stone describes Kloor as a \"GMO brawler\" who aims \"to create exasperation rather than insight\" in his efforts to villainize those he disagrees with, regardless of the fact that his modus operandi creates \"real impediments\" to scientific understanding.\n\n\n\nYet it is Kloor who, in his campaign to deny a platform to those he labels \"denialists\", brands his opponents \"unscientific\". No wonder the influential climate expert Joe Romm says Kloor is not so much an \"arbiter of good journalism\" as \"a model of what not to do\".", "opengraph": {"type": "website", "title": "Keith Kloor: Trash-talking the enviros – or just talking trash?", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/85-2014/15596-keith-kloor-trash-talking-the-enviros-or-just-talking-trash", "description": "\r\nBlogger Keith Kloor doesn’t like environmentalists – and is a stranger to science and logic, writes Jonathan Matthews\r\n", "image": "https://gmwatch.org/images/banners/Keith-Kloor-doing-a-drive-by-710x300.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://www.slate.com/articles/health_and_science/science/2012/09/are_gmo_foods_safe_opponents_are_skewing_the_science_to_scare_people_.single.html#pagebreak_anchor_2", "http://blogs.discovermagazine.com/collideascape/2014/08/07/vaccine-gmo-denial-treated-equally/", "http://www.huffingtonpost.com/carole-bartolotto/have-genetically-modified_b_5597751.html", "https://twitter.com/keithkloor/status/496484704779264001", "http://www.inesglobal.com/_News/iaastd.html", "http://www.huffingtonpost.com/ken-roseboro/biotechs-assault-on-balan_b_5432699.html", "https://twitter.com/careygillam/status/433613850538016768", "http://www.reuters.com/article/2014/05/08/usa-gmo-labeling-idUSL2N0NU1R720140508", "http://www.ensser.org/increasing-public-information/no-scientific-consensus-on-gmo-safety/", "http://scienceblogs.com/deltoid/2011/12/23/keith-kloors-thinking-on-clima/", "http://www.huffingtonpost.com/david-roberts/bashing-dirty-hippies-and_b_38876.html", "http://thinkprogress.org/climate/2009/11/01/204856/keith-kloor-trash-journalist/", "http://issues.org/30-3/forum-spring-2014/", "http://en.wikipedia.org/wiki/Joseph_J._Romm", "http://thinkprogress.org/climate/2009/11/01/204856/keith-kloor-trash-journalist/"], "authors": ["Claire"], "publish_date": "2014-08-19T08:46:49+00:00"}