{"result_id": "137001", "URL": "https://gmwatch.org/en/106-news/latest-news/19387-another-expert-challenges-assertions-sars-cov-2-was-not-genetically-engineered", "timestamp": "2023-04-25 15:18:15 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/106-news/latest-news/19387-another-expert-challenges-assertions-sars-cov-2-was-not-genetically-engineered", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "Another expert challenges assertions that SARS-CoV-2 was not genetically engineered", "cleaned_text": "Prof Stuart Newman believes genetic engineering may have been involved at some point in the virus’s history\n\nAnother expert on biotechnology has attacked the evidence being used to quash suggestions that SARS-CoV-2, the virus strain that causes COVID-19, might have been genetically engineered. Professor Stuart Newman, professor of cell biology and anatomy at New York Medical College, says that a key argument used to deny that it could be a genetically engineered strain that escaped from a laboratory actually points to the exact opposite. In other words, it indicates that SARS-CoV-2 could well be genetically engineered and that it could have escaped from a lab.\n\nThe evidence that is being cited as proving that SARS-CoV-2 is “not a laboratory construct or a purposefully manipulated virus” is a paper published by the immunologist Kristian Andersen and colleagues in Nature Medicine. As Adam Lauring, an associate professor of microbiology, immunology and infectious diseases at the University of Michigan Medical School, has noted, Andersen’s paper argues that, \"the SARS-CoV-2 virus has some key differences in specific genes relative to previously identified coronaviruses – the ones a laboratory would be working with. This constellation of changes makes it unlikely that it is the result of a laboratory 'escape’.”\n\nBut Professor Newman says that this is totally unconvincing because “The ‘key differences’ were in regions of the coronavirus spike protein that were the subject of genetic engineering experiments in labs around the world (mainly in the US and China) for two decades.”\n\nSo not only does Newman think that the virus could have escaped from a lab, he also thinks that it could have originated in a virus stock that had undergone genetic engineering at some point.\n\n\n\nIn an email interview with GMWatch, Newman, who is editor-in-chief of the journal Biological Theory and co-author (with Tina Stevens) of the book Biotech Juggernaut, amplified this speculation by noting, “The Nature Medicine paper points to variations in two sites of the spike protein of the new coronavirus that the authors claim must have arisen by natural selection in the wild. However, genetic engineering of one of these sites, the ACE2 receptor binding domain, has been proposed since 2005 in order to help generate vaccines against these viruses (see this paper). It is puzzling that the authors of the Nature Medicine commentary did not cite this paper, which appeared in the prominent journal Science.” \n\n \n\nMoreover, Newman added, “The second site that Andersen et al. assert arose by natural means, a target of enzyme cleavage not usually found in this class of viruses, was in fact introduced by genetic engineering in a similar coronavirus in a paper they do cite. This was done to explore mechanisms of pathogenicity.”\n\n \n\nNewman said that he does not believe that these changes were deliberately introduced to increase the pathogenicity of any single strain, but that SARS-CoV-2 may have had genetically engineered components in its history before being inadvertently introduced into the human population.\n\n\n\nNewman is not the only scientist that has spoken out about the possibility of a genetically engineered element to the virus. We recently published an article in which the molecular geneticist Dr Michael Antoniou also cast doubt on assertions that the virus was not genetically engineered. Dr Antoniou set out a method by which the virus could have been genetically manipulated and selected for increased infectivity in the laboratory. \n\n\n\nNeither Dr Antoniou, nor Prof Newman, nor we ourselves make any suggestion that, in the event that genetic engineering was involved, the intention was to create a bioweapon. Such “enhanced infectivity” research is carried out on viruses all over the world (and not just in China) to investigate their behaviour and to develop vaccines and other therapies, as well as for “biodefence” purposes. \n\n\n\nBut the question of whether genetic engineering did play a part in the emergence of SARS-CoV-2 must continue to be investigated so that humanity can place appropriate limits and safeguards on such research.", "opengraph": {"type": "website", "title": "Another expert challenges assertions that SARS-CoV-2 was not genetically engineered", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/100-2020/19387-another-expert-challenges-assertions-sars-cov-2-was-not-genetically-engineered", "description": "\r\nProf Stuart Newman believes genetic engineering may have been involved at some point in the virus’s history\r\n", "image": "https://gmwatch.org/images/banners/Biochemist_in_hazmat_suit_sitting_near_microscope.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.nature.com/articles/s41591-020-0820-9", "https://www.livescience.com/coronavirus-wuhan-lab-complicated-origins.html", "https://twitter.com/i/status/1251615507515453440", "https://www.amazon.com/Biotech-Juggernaut-Agendas-Entrepreneurial-BioScience/dp/1138043230/ref=sr_1_1", "https://pubmed.ncbi.nlm.nih.gov/16166518/", "https://pubmed.ncbi.nlm.nih.gov/16519916/", "https://gmwatch.org/en/news/latest-news/19383"], "authors": ["Editor2"], "publish_date": "2020-04-27T11:35:30+00:00"}