{"result_id": "137028", "URL": "https://gmwatch.org/news/archive/2014/15651-prof-jack-heinemann-on-vaccines-climate-power-and-gmos", "timestamp": "2023-04-25 15:18:28 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/news/archive/2014/15651-prof-jack-heinemann-on-vaccines-climate-power-and-gmos", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "Prof Jack Heinemann on vaccines, climate, power, and GMOs", "cleaned_text": "The latest tactics of the GMO lobby are designed to mislead\n\n\n\nIn two articles below, Prof Jack Heinemann challenges popular GMO lobby memes and dishonest PR tactics.\n\nIn the first article, Prof Heinemann takes on Monsanto PR woman Janice Person over her suggestion that opposition to GMOs is comparable to opposition to vaccines. He also explains why opposition to GMOs is not equivalent to \"climate denial\".\n\nIn the second article, Prof Heinemann asks whether attacks on Reuters journalist Carey Gillam by the blogger Keith Kloor and the former Vice President for Food & Agriculture of the Biotechnology Industry Organization (BIO), Val Giddings, have any credibility. Gillam has fallen foul of these people because she presents both sides of the GMO issue.\n\n1. Vaccine and climate as sophistry on GMOs\n\n2. If it weren’t for false balance there’d be no balance at all\n\n1. Vaccine and climate as sophistry on GMOs\n\nJanice Person [Monsanto outreach] @JPlovesCOTTON: \"Vaccinations were really controversial a few years ago, science has won. Could GMOs follow that path?\"\n\nThe tweet by Janice Person links concerns about commercial vaccines with concerns about genetically modified organisms (GMOs). Others conflate resistance to accept climate change to concerns about GMOs. This, in my opinion, is sophistry: “deliberate use of a false argument with the intent to trick someone”. It attempts to discredit those who hold a particular view on GMOs by appealing to those who accept vaccines and climate change.\n\nThe generic “GMO” is also misleading when used by the people making these sophisms: “…unsound or misleading but clever, plausible, and subtle argument or reasoning”. GMO means, in the context of the discussion, commercialised genetically modified crop plants, certainly not all GMOs or research that uses similar techniques. Person is not the only one to make these kinds of links. Keith Kloor, David Tribe, and Rick Roush, among others, have attempted to do the same and the practice has been criticised effectively here.\n\nhttp://www.gmwatch.org/index.php/news/archive/2014/15596\n\nThe debate on efficacy and net benefit of GM cropping systems also differs from the debate on climate change. Increasingly frequently the term \"scientific consensus\" is used to disparage any scientific scrutiny of GMOs by metaphorical linkage to climate change denial. However, that metaphor also fails in important ways.\n\nFirst, scientific studies that find potential adverse effects from some GM products or the combination of the GM crop and its intended co-use with a \"chemical\" pesticide, are not bucking the scientific establishment. Like all research findings, there will be flaws in these studies and there will be those scientists and commentators who value the findings more than others. This is also true of studies that claim absence of adverse effects. In other words, all these studies are part of the consensus of how science is done rather than a consensus of what results are acceptable.\n\nScience is not ruled by popularity of the findings, and thus consensus conclusions are not themselves science. Real consensus exercises are ways to draw considered and qualified conclusions. They are, at best, a way to make decisions about products, set research priorities, or agree on who to invite to the next conference.\n\nThis is also true of climate science. Not everything the International Panel on Climate Change (IPCC) says or predicts is certain. Nevertheless, there is such a quality of accumulated evidence gathering from climate science as to suggest that action is needed to curb probable anthropogenic accelerants. Surprisingly, the so-called consensus of science on GM crops does not come from any actual effort to achieve and report a consensus, but mainly on the assertion of consensus by those who have access to media, social networking, or government.\n\nThis claimed consensus does not exist. In fact, the closest exercise on agriculture to the IPCC was the International Assessment on Agricultural Knowledge, Science and Technology for Development (IAASTD), and the conclusions were not in line with these other \"consensus memes\" (Kiers et al., 2008). The IAASTD recommended more research and investment in biotechnology that improved soils, reduced pest pressure and increased farmer incomes rather than agricultural models that extend the expensive high input dependences behind the green revolution, as do commercialised GM crops.\n\nSecond, most studies that conclude that a particular GMO does not cause a particular adverse effect in a chosen context nevertheless find evidence of adverse effects. However, many authors conclude that, on the basis of the strength of their study or other considerations, that they do not believe their findings point to a safety concern. To gloss over this nuance is poor science and poor science communication. We must be aware of the uncertainty in the primary data to remain vigilant of unintended and unanticipated potential adverse effects. Noting these is not necessarily problematic in an environment of transparent and trustworthy regulation, as has been proven by the adoption of many medicines that also have adverse effects.\n\nMessages that are compatible with climate change skepticism and hostile to ongoing scientific and public scrutiny of GMOs tend to align with large industries and public institutions with massive financial stakes in the adoption of the message. Conveyors of the message may not themselves represent any of these stakeholders, but their vocal champions on social media and their access to media and other important outlets are both very likely conditioned by these concentrated financial powers.\n\nIt would be naïve to think that the implications of having an opinion harmonious with power would attract the same personal or professional risk as having an opinion discordant with the interests of those who hold financial or social power.\n\nStrikingly, this is the pattern I perceive in the celebrity of climate change skeptics and resistance to better regulation of GMOs. Unlike those who see this as a political \"right\" and \"left\" issue, I instead see this as an alignment issue. Climate change skeptic celebrities are often hostile to GM regulation, positions reconciled as industry-friendly. A public concerned about the effects of climate change may also want GM products labeled, positions reconciled by wanting to have a say in how the planet is being used.\n\nThe intellectually dubious conflation of the public discourses on vaccine and GM crops, and GM crops and climate change, is, in my view, a sophism because it attempts to smear, on purpose or unintentionally, desires for proper regulation of products in food and the environment with unrelated controversies.\n\nNone of the proven solutions - transparency in product development and testing as well as robust regulation and monitoring - appears to be a high priority of those propagating the memes and thus they miss the key lesson such comparisons could hope to teach. By this I mean that, where \"science won\" (as qualified as that characterisation may be) in those other controversies, it was due to greater transparency in research and consensus forming activities (eg, IPCC) and better regulation (eg, vaccines), not belittling or patronising the public understanding of science and commerce.\n\nHeinemann, J.A. (2009). Hope not Hype. The future of agriculture guided by the International Assessment of Agricultural Knowledge, Science and Technology for Development (Penang: Third World Network). Free access here: Hope Not Hype.pdf\n\nHeinemann, J.A., and El-Kawy, O.A. (2012). Observational science in the environmental risk assessment and management of GMOs. Env Int 45, 68-71.\n\nKiers, E.T., Leakey, R.R.B., Izac, A.-M., Heinemann, J.A., Rosenthal, E., Nathan, D., and Jiggins, J. (2008). Agriculture at a Crossroads. Science 320, 320-321.\n\nPretty, J. (2001). The rapid emergence of genetic modification in world agriculture: contested risks and benefits. Environ Conserv 28, 248-262.\n\n2. If it weren’t for false balance there’d be no balance at all\n\nA recent exchange over at Twitter illustrates what can happen when expression of controversial opinions causes conflict in the media. In this episode, those serving as critic and conscience of society are not the direct targets. Instead, the journalist becomes the target for having mentioned that these other opinions exist.\n\nReuter’s reporter Cary Gillam, who has the agriculture beat, was being taken to task for her articles by Keith Kloor, a blogger, and Val Giddings, a former chief executive of an industry public relations organisation. The latter represented the companies that make genetically modified crop plants and might have been sensitive to Gillam’s story.\n\nBy including in her stories reference to studies that did not agree with Kloor and Giddings, Gillam was accused by the two of misleading her readers into thinking that there could be more than one scientific opinion on GM crops.\n\nKloor called this creating a \"false balance\". False balance has become the way science media outlets react to opinions that don’t represent their constituency. To undermine the reporter, she is described as lazy because she hasn’t used her training to “recognize pseudoscience and agenda-driven research”.\n\nKloor and Giddings’ views appear to be unchallengeable. Yet at least Kloor is no scientist even though he writes blogs for a popular science magazine. But if his work reporting his views on science news left readers or Gillam herself in any doubt of his authority, Kloor puts that to rest. “You are willfully ignoring the scientific consensus on this,” he says to Gillam. He and (elsewhere also) Giddings invoke the same reference to ultimate authority that disgruntled students write on the course survey, the \"everyone I know thinks the same thing\" argument. (Moreover, while the consensus meme is popular, that doesn’t make it true, as I discuss here.)\n\nResearch is consistently being published in peer-reviewed international journals that presents a far more nuanced evaluation of different biotechnology products. Moreover, careful reading of the literature reveals that many study authors that find some evidence of harm nevertheless reach normative judgments in favor of overall safety or benefit. In contrast, many other authors that find some evidence of harm reach normative judgments that are not definitive of either safety or benefit and subsequently recommend more research. To gloss over the actual science and dwell nearly exclusively on the normative conclusions is, I would say, false balance.\n\nAccess to large marketing and legal budgets, and influence on the way public research funds are prioritised and distributed, makes it easier for industry to claim a consensus in favor of their products. Likewise, the entrepreneurially-oriented public scientist speaking similar conclusions is not subject to the powerful reaction from these concentrated financial interests.\n\nPerhaps it is getting tedious to hear that under the regulatory regime in most countries the safety and efficacy studies of products of all kinds, including pharmaceuticals, GMOs and pesticides, is based on unpublished and un-replicated studies provided to government safety regulators. While some studies may subsequently be published, by far most are not and it would be exceedingly rare to find one published in a peer-reviewed journal prior to being evaluated by the government regulator.\n\nResearch studies have repeatedly found that the conflict of interest inherent in this way of evaluating products is not properly balanced by regulators. For example, researchers evaluating the process of pesticide approvals by the United States Environmental Protection Agency (USEPA) said in their study: “It is essential to consider that industry-supplied studies suffer from COIs [conflicts of interest], which must be mitigated. A USEPA risk assessment, however, does not mitigate COIs. In fact, the system in place increases the likelihood that only industry-supplied data will be used in the risk assessments…which potentially obscures the impact of a pesticide so that risks cannot be responsibly managed” (Boone et al., 2014). This is not a problem special to the USEPA but is generic to most safety regulators.\n\nExpressing scientific opinions that are compatible with powerful industries, governments and technology developers is always easier than expressing opinions that conflict with these centres of power. By ensuring that the voices of skeptical or cautious scientists, researchers and others with special experience are heard, Gillam brings appropriate balance to these forces. The false balance is one that ignores the power of companies and governments to broadly advertise in their own interests. Those perpetuating a false balance are those that amplify a privilege of power.\n\nBoone, M.D., Bishop, C.A., Boswell, L.A., Brodman, R.D., Burger, J., Davidson, C., Gochfeld, M., Hoverman, J.T., Neuman-Lee, L.A., Relyea, R.A., et al. (2014). Pesticide regulation amid the influence of industry. Bioscience in press.", "opengraph": {"type": "website", "title": "Prof Jack Heinemann on vaccines, climate, power, and GMOs", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/85-2014/15651-prof-jack-heinemann-on-vaccines-climate-power-and-gmos", "description": "The latest tactics of the GMO lobby are designed to mislead \r\n"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://rightbiotech.tumblr.com/post/97339408195/vaccine-and-climate-as-sophistry-on-gmos", "/index.php/news/archive/2014/15596", "http://academicfreedom.kiwi.nz/2014/09/werent-balance-thered/"], "authors": ["Annie"], "publish_date": "2014-09-18T12:04:53+00:00"}