{"result_id": "137009", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19663-daszak-facing-calls-to-step-down-from-covid-19-inquiries-as-who-team-arrives-in-wuhan", "timestamp": "2023-04-25 15:18:19 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19663-daszak-facing-calls-to-step-down-from-covid-19-inquiries-as-who-team-arrives-in-wuhan", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Daszak facing calls to step down from Covid-19 inquiries as WHO team arrives in Wuhan", "cleaned_text": "Scientist who channelled cash for risky research still key player in investigating outbreak\n\nPeter Daszak – who not only funded risky bat virus research in Wuhan but orchestrated the branding of any suggestion of a lab-leak as “conspiracy theories” – is facing calls to step down from two key Covid-19 origins inquiries, just as the World Health Organization's team of international investigators has finally got to Wuhan. \n\n\n\nThe calls for this extraordinarily conflicted, biased and unreliable scientist to resign are reported in another fine article (see below) by Ian Birrell, which is well worth reading in full as it contains a lot of under-reported details of earlier Daszak warnings about the dangers of a lab accident sparking a global pandemic, and admissions of research taking place that involves isolating SARS coronaviruses “that bind to human cells in the lab” and of scientists showing “some of these have pandemic potential, able to infect humanised mice”.\n\n\n\nWhat’s particularly pleasing about seeing this exposé in the mainstream media is that at the time Daszak was originally appointed to lead the Lancet Commission’s origins investigation, back in September, not a word of concern was published in the press, even though many experts were expressing outrage on social media, as we reported at the time.\n\n\n\nAnd in another sign that the lab-leak issue is starting to go decidedly mainstream, the day after Birrell’s article about Daszak was published, the UK tabloid The Sun ran the headline WU-JOKING? Brit WHO expert in Covid cover-up probe wanted 'party in bat cave' with China ‘batwoman’ scientist linked to ‘lab leak’. The ‘batwoman’ is, of course, Shi Zhengli, the Wuhan Institute of Virology (WIV) scientist who heads their bat coronavirus research, and the “Brit WHO expert” is Daszak - a long-term friend, collaborator and funder of those at the WIV he will now supposedly be investigating.\n\n\n\nThe bizarre Twitter exchange that gave rise to the Sun's article, in which Daszak appears to say he is looking forward to an alcohol-fuelled karaoke party in a bat cave with Shi Zhengli, also features Angela Rasmussen, the scientist who launched an insanely aggressive attack on last week’s New York magazine cover story The lab-leak hypothesis. In that harangue, Rasmussen claimed, among other things, that Peter Daszak's conflicts of interest were “long disclosed”, when in reality he has repeatedly publicly asserted that he has no conflicts of interest.\n\n\n\nMeanwhile, although Mark Woolhouse, an epidemiologist at the University of Edinburgh, told the Associated Press that a “scientific audit” of the WIV’s records and safety measures would be a “routine activity” for investigators, Peter Daszak has already poured cold water on calls for a forensic investigation. An article in Science quotes him as saying, “Some of the more anti-China rhetoric that's out there, about, we need to go into the lab and look at the video cameras, this sort of thing, that's not realistic, that's not what happens.” This prompted Richard Ebright of Rutgers to comment, “Daszak's claim that calls for a thorough and credible investigation, as opposed to a cursory and conflict-ridden investigation, are ‘anti-China rhetoric’ is self-serving nonsense.”\n\n\n\nOther just published stories include a report that the Chinese government is facing fresh accusations of a cover-up after officials deleted crucial online data about studies carried out at the WIV. As the article notes, “It is not the first time that China has been accused of suppressing vital evidence about the origins of the virus.“\n\n\n\nAnd an excellent article in Taiwan News reports on how research involving infecting humanised mice with new bat SARS coronaviruses is now known to have been taking place at the WIV during 2019, leading to questions as to whether an accident during these experiments could have led to the pandemic.\n\nAnother article in the same paper reports on a video released by Chinese state TV two years before the outbreak of the pandemic, which shows WIV scientists using little to no PPE while collecting bat viruses and working with live viruses in the lab. The Chinese news report was meant to showcase the work of Shi Zhengli and her WIV team but what comes across, in the words of the article, is “a shocking disregard for safety when handling potentially infectious bats both in the wild and in the lab.” As a result of this lax attitude, WIV bat researchers end up getting bitten and scratched by virus-laden bats, as is clear from the video, which even shows one researcher's arm swelling after a bat bite.\n\nThe Taiwan News articles are based on the work of the researcher Billy Bostickson and his colleagues at DRASTIC, who have been a driving force in exposing the dangerous work that has been going on in Wuhan, as well as those like Daszak who have been backing it.\n\n\n\nAll of these reports are highly relevant to the WHO investigation. And as their international team are going to be in isolation in a hotel in Wuhan for the next two weeks, they should have plenty of time to consider the 50 key questions about the outbreak raised by Billy Bostickson and his colleagues in this Open Letter. Please help draw their attention to it by signing on.\n\n\n\nWe need a full, unrestricted and transparent investigation into the origins of the pandemic, in which all conflicts of interest have been fully revealed and addressed.\n\nA conflict of interest: How can Peter Daszak, a British scientist who helped fund controversial experiments on coronaviruses by China's Batwoman, be part of WHO’s team investigating the original source of the outbreak?\n\nBy Ian Birrell\n\nThe Mail on Sunday, 9 Jan 2021\n\nhttps://www.dailymail.co.uk/news/article-9129749/How-Peter-Daszak-WHOs-team-investigating-original-source-outbreak.html\n\n\n\n* British scientist Peter Daszak’s organisation channelled cash to Wuhan scientists\n\n* He has spent much of the past year trying to counter claims of a possible lab leak\n\n* But he was invited by WHO to join its team of ten experts investigating outbreak \n\n\n\nA British scientist is facing calls to step down from two key inquiries into the origins of Covid-19 after leading the global battle to dismiss suggestions that it might have leaked from a Chinese laboratory linked to his charity.\n\n\n\nPeter Daszak’s organisation channelled cash to Wuhan scientists at the centre of growing concerns over a cover-up – and also collaborated on the sort of cutting-edge experiments on coronaviruses banned for several years in the United States for fear of sparking a pandemic.\n\n\n\nThe Wuhan Institute of Virology has been carrying out this risky research on bat viruses since 2015, including the collection of new coronaviruses and hugely controversial ‘gain of function’ experiments that increase their ability to infect humans.\n\n\n\nMany leading scientists argue that deliberately creating new and infectious microbes poses a huge danger of starting a pandemic from an accidental release, especially as leaks from laboratories have often occurred.\n\n\n\nDespite his close ties to the Wuhan Institute of Virology – and the way he has orchestrated efforts to stifle claims that the pandemic might not have happened naturally – Dr Daszak was invited by the World Health Organisation to join its team of ten international experts investigating the outbreak.\n\n\n\nThe prominent scientist, who runs a conservation charity originally founded by the famous naturalist and best-selling author Gerald Durrell, is also leading an investigatory panel on the pandemic’s origins set up by The Lancet medical journal.\n\n\n\n‘Peter Daszak has conflicts of interest that unequivocally disqualify him from being part of an investigation of the origins of the Covid-19 pandemic,’ said Richard Ebright, bio-security expert and professor of chemical biology at Rutgers University in New Jersey.\n\n\n\n‘He was the contractor responsible for funding of high-risk research on Sars-related bat coronaviruses at Wuhan Institute of Virology and a collaborator on this research.’\n\n\n\nDaszak, president of EcoHealth Alliance, has seen his career take him from researching rare land snails at Kingston University to his new key role investigating the eruption of the most destructive pandemic for a century.\n\n\n\nThe pugnacious scientist, originally from Manchester, spent much of the past year trying to counter claims of a possible laboratory leak while defending his friend Shi Zhengli, the Wuhan scientist known as Batwoman for her virus-hunting trips in caves.\n\n\n\n‘Ignore the conspiracy theories: scientists know Covid-19 wasn’t created in a lab,’ ran the headline to one typical article he wrote in The Guardian.\n\n\n\nBut other scientists say there is no firm evidence at this stage to back Daszak’s insistence that Covid-19 crossed from animals to humans via natural transmission. Many point to the simple yet startling coincidence that Wuhan is home to Asia’s main research centre on bat coronaviruses as well as the place where the pandemic erupted.\n\n\n\nEmails released through freedom of information requests have shown Daszak recruited some of the world’s top scientists to counter claims of a possible lab leak with publication of a landmark collective letter to The Lancet early last year. He drafted their statement attacking ‘conspiracy theories suggesting that Covid-19 does not have a natural origin’ and then persuaded 26 other prominent scientists to back it. He suggested the letter should not be identifiable as ‘coming from any one organisation or person’.\n\n\n\nThe signatories include six of the 12-strong Lancet team investigating the cause of the outbreak.\n\n\n\nYet it has emerged that Daszak had previously issued warnings over the dangers of sparking a global pandemic from a laboratory incident – and said the risks were greater with the sort of virus manipulation research being carried out in Wuhan.\n\n\n\nIn October 2015, he co-authored an article in the journal Nature on ‘spillover and pandemic properties of viruses’ that identified the risk from ‘virus exposure in laboratory settings’ and from ‘wild animals housed in laboratories’.\n\n\n\nSeven months earlier, Daszak was a key speaker at a high-powered seminar on reducing risk from emerging infectious diseases hosted by the prestigious National Academies of Science in Washington. \n\n\n\nAmong materials prepared for the meeting was a 13-page document by Daszak entitled ‘Assessing coronavirus threats’ that included a page examining ‘spillover potential’ from ‘genetic and experimental studies’.\n\n\n\nThis identified steps that increased dangers from such research – rising from lower risk sampling of viruses through to the highest risk from experiments on infecting isolated cells and on so-called ‘humanised mice’ – animals created for labs with human genes, cells or tissues in their bodies.\n\n\n\nYet on January 2 – three days after news broke outside China of a new respiratory disease in Wuhan – Daszak boasted on Twitter of isolating Sars coronaviruses ‘that bind to human cells in the lab’.\n\n\n\nHe added that other scientists have shown ‘some of these have pandemic potential, able to infect humanised mice’.\n\n\n\nAnother tweet two months earlier talked about ‘great progress’ with Sars-related coronaviruses from bats through identifying new strains, finding ones that bind to human cells and ‘using recombinant viruses/humanised mice to see Sars-like signs and showing some don’t respond to vaccines’.\n\n\n\nDaszak also told a podcast that bat coronaviruses could be manipulated in a lab ‘pretty easily’, explaining how their spike proteins – which bind to human receptors in cells – drive the risk of transmission from animals to humans.\n\n\n\n‘You can get the [genetic] sequence, build the protein, insert it into the backbone of another virus and do some work in the lab,’ he said succinctly.\n\n\n\nThis highlights the sort of research that EcoHealth Alliance supported at the top-security Wuhan Institute of Virology – where Shi is based and which boasts a collection of samples from hundreds of coronaviruses – before their funding flow was blocked by US authorities on safety grounds, when revealed by The Mail on Sunday.\n\n\n\nThe National Institutes of Health said its $3.7 million (£2.8 million) grant to EcoHealth Alliance would be restored only if outside experts could probe the Wuhan facilities and records ‘with specific attention to addressing… whether staff had Sars-Cov-2 [the strain of coronavirus that causes Covid-19] in their possession prior to December 2019.’\n\n\n\nThere has been intense debate in scientific circles over whether the risks from ‘gain of function’ research – increasing the ability of virus samples to infect humans to boost understanding and potentially develop vaccines – outweigh any benefits. This led to a ban for three years in the United States under the Obama administration – although in reality much of it was simply outsourced abroad. \n\n\n\n‘This is not ordinary science,’ wrote Tom Inglesby of Johns Hopkins University in Baltimore and Marc Lipsitch of Harvard, two prominent US epidemiologists, after the prohibition was lifted in 2017.\n\n\n\n‘The overwhelming majority of scientific studies are safe; even the worst imaginable accident, such as an infection of a lab worker or an explosion, would harm only a handful of people. But creating potentially pandemic pathogens creates a risk – albeit a small one – of infecting millions of people with a highly dangerous virus.’\n\n\n\nYet the Wuhan scientists, sometimes in tandem with leading Western experts, were creating chimeric Sars-related coronaviruses from their huge stock of bat samples collected in tropical regions of southern China hundreds of miles away.\n\n\n\nMany of these manipulated viruses showed infectivity in human cells and, in some cases, were constructed via a method of seamless cloning that leaves no trace of laboratory engineering.\n\n\n\nDetails of the suspended National Institutes of Health grant revealed the construction of viruses with ability to invade human cells using ‘infectious clone technology’ as part of their research.\n\n\n\nBio-safety concerns were, however, openly admitted by a senior official at the lab and sparked alarm among US diplomats.\n\n\n\nA video filmed in April by Zhang Zhan, a journalist jailed last month by China for ‘picking quarrels’, displayed rubbish-strewn grounds.\n\n\n\nSuspicions over the possibility of a leak have been intensified by China’s cover-up of Covid’s outbreak, crackdowns on doctors trying to warn people, clampdowns on data, and desperate claims that the disease emerged in India, Italy and even outer space.\n\n\n\nLast week, the WHO inquiry – which gave China the right to veto its members – was blocked from entering the country, sparking rare criticism of Beijing from the body’s director-general Tedros Adhanom Ghebreyesus.\n\n\n\nThe behaviour of ‘Batwoman’ Shi – who admitted her first thought on hearing about the virus was to wonder about a leak from her lab – has also raised eyebrows. She failed to detail the most surprising aspect of this new disease – a mutation not seen on similar coronaviruses that ensures it infects such a wide range of human cells – when publishing a genetic sequence for Sars-Cov-2.\n\n\n\nThen it emerged she had falsely blamed the deaths of three miners from a Sars-like respiratory disease on a fungal infection, thereby obscuring a link to their fatalities when revealing how her lab held the closest relative to Sars-Cov-2. This sample was collected at the mine, more than 1,000 miles from Wuhan, after the deaths and brought back to the Wuhan Institute.\n\n\n\nOne WHO source, defending Daszak’s inclusion on their inquiry team on basis of his expertise and knowledge of China, told me the Briton was striving simply to protect the reputation of his fellow scientist and friend.\n\n\n\n‘We have a choice whether to stand up and support colleagues who are being attacked and threatened daily by conspiracy theorists or to just turn a blind eye,’ said Daszak in February. Yet two months ago, he added to alarm over his independence as an investigator with a tweet sent to a sympathetic science writer: ‘Looking forward to that special moment when we hit the baiju [a Chinese liquor] and the karaoke with [Shi] Zhengli.’\n\n\n\nDaszak’s reputation is on the line after his stellar success in turning Durrell’s conservation charity, previously known as The Wildlife Trust, into a thriving vehicle for his ambitions to hunt down new viruses around the world.\n\n\n\nHe began working for the body after moving to the US when his wife secured a job in the country. He started by co-ordinating a small project soon after the turn of the century but ended up as overall boss.\n\n\n\nHe has shifted the charity to focus on threats of pandemic from wildlife ‘spillover’, a move that saw its revenue more than double over the past seven years and his own salary surge to an impressive $410,801 (£303,000), according to latest tax data.\n\n\n\nHis expertise, which includes a hand in more than 300 scientific papers, has won prominence in global scientific and public health circles. He has, however, been the target of abuse over his stance and had suspicious white powder sent to his home.\n\n\n\nYet he is accused of bullying opponents by those that have clashed with him, who include Colin Butler, honorary professor of environmental health at the Australian National University. Butler edited a scientific journal with Daszak for three years.\n\n\n\n‘He probably sincerely believes in his work but he has built an empire around the idea that zoonoses [animal to human infections] are the most important thing in the world,’ said Butler.\n\n\n\n‘He has also worked with the Wuhan Institute in what is reportedly gain of function research.’\n\n\n\nButler, a former WHO adviser who has worked in China, published a paper last month in the Journal Of Human Security highlighting inconsistencies in the lab’s response and ‘striking’ circumstantial evidence giving credence to the possibility that Covid-19 escaped from a lab – including the location of the outbreak in Wuhan.\n\n\n\nIf this theory is ever proven correct, he concludes, it would be a ‘powerful, indeed frightening, signal that we are in danger from hubris as much as from ignorance’.\n\n\n\nNeither Daszak nor EcoHealth Alliance responded to a request for comment.", "opengraph": {"type": "website", "title": "Daszak facing calls to step down from Covid-19 inquiries as WHO team arrives in Wuhan", "url": "https://www.gmwatch.org/en/106-news/latest-news/19663-daszak-facing-calls-to-step-down-from-covid-19-inquiries-as-who-team-arrives-in-wuhan", "description": "\r\nScientist who channelled cash for risky research still key player in investigating outbreak\r\n", "image": "https://www.gmwatch.org/images/banners/Peter-Daszak-ecohealth-alliance-1200x328.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "/en/news/latest-news/19538", "/en/news/latest-news/19600", "https://apnews.com/article/who-team-arrives-wuhan-virus-origins-db3e9adcbfa801d3e8274c1976ea5fcd", "/en/news/latest-news/19437", "/en/main-menu/news/latest-news/19538", "https://www.thesun.co.uk/news/13708205/who-investigator-covid-wuhan-lab-bat-cave/", "https://twitter.com/GMWatch/status/1349056660661129216/photo/1", "/en/news/latest-news/19661", "/en/news/latest-news/19661", "/en/news/latest-news/19437", "https://apnews.com/article/who-team-arrives-wuhan-virus-origins-db3e9adcbfa801d3e8274c1976ea5fcd", "https://www.sciencemag.org/news/2021/01/after-aborted-attempt-sensitive-who-mission-study-pandemic-origins-its-way-china", "https://twitter.com/R_H_Ebright/status/1349392347495358470", "https://www.dailymail.co.uk/news/article-9129681/New-cover-fears-Chinese-officials-delete-critical-data-Wuhan-lab.html", "https://www.taiwannews.com.tw/en/news/4099020", "https://www.taiwannews.com.tw/en/news/4102619", "https://twitter.com/BillyBostickson/status/1325749872985690112", "https://www.sutori.com/story/d-r-a-s-t-i-c-2020-origins--xCvdWonoJTx4TYVtAC4EhQ1b", "https://www.ipetitions.com/petition/open-letter-to-the-who-covid-19-international", "https://www.ipetitions.com/petition/open-letter-to-the-who-covid-19-international", "https://www.dailymail.co.uk/news/article-9129749/How-Peter-Daszak-WHOs-team-investigating-original-source-outbreak.html"], "authors": ["Editor2"], "publish_date": "2021-01-15T13:15:19+00:00"}