{"result_id": "137037", "URL": "https://gmwatch.org/en/106-news/latest-news/19434-it-s-not-mere-conspiracy-theory-to-ask-if-sars-cov-2-leaked-from-a-wuhan-lab", "timestamp": "2023-04-25 15:18:32 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/106-news/latest-news/19434-it-s-not-mere-conspiracy-theory-to-ask-if-sars-cov-2-leaked-from-a-wuhan-lab", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "It's not mere conspiracy theory to ask if SARS-CoV-2 leaked from a Wuhan lab", "cleaned_text": "Below is a well argued and balanced article by Ian Birrell that shows that the lab origin theory for SARS-CoV-2 cannot be dismissed on current evidence.\n\n\n\nNote that the article refers to former MI6 head Sir Richard Dearlove as blaming \"a lab leak based on a weak new Norwegian-British study\". However, one of the studies by this team of researchers that Dearlove is citing as evidence for the lab origin and genetic manipulation theory has not yet been published. \n\n\n\nBirrell refers via a link to an already-published study by the Norwegian-British team, which describes a candidate vaccine for COVID-19. This study refers to certain sections of the virus as \"inserted\" (though this doesn't necessarily mean \"by humans\" – it could be interpreted as meaning it happened naturally), and doesn't mention the lab origin theory. \n\n\n\nHowever, according to Dearlove and a report in the Telegraph, a separate forthcoming paper by the same team \"claims the Covid-19 virus has 'unique fingerprints' that cannot have evolved naturally and are instead 'indicative of purposive manipulation'.\"\n\n\n\nSo until that second study is published, we can't assume that the Norwegian-British team's argument is \"weak\".\n\n---\n\nSo where did Covid come from?\n\nBY IAN BIRRELL\n\nUnherd, 12 June 2020\n\nhttps://unherd.com/2020/06/so-where-did-covid-come-from/\n\n[links to sources at this URL]\n\n\n\n* It's not mere conspiracy theory to ask if this new coronavirus leaked from a Wuhan lab\n\n\n\nLast year, Yuan Zhiming published an article in the Journal of Biosafety and Biosecurity confessing to concerns about high security laboratories in China. He admitted maintenance costs were “generally neglected” and several of their top-level research centres lacked sufficient funds for “routine yet vital processes”. He said openly that “part-time researchers” performed the work of skilled staff, which “makes it difficult to identify and mitigate potential safety hazards”.\n\n\n\nIn a second article co-authored with four colleagues, he wrote that their biosafety systems needed to be “further improved and strengthened”.\n\n\n\nToday, his words carry greater significance. For Professor Yuan is head of biosafety at Wuhan Institute of Virology (WiV), the first lab in China with top-level biosecurity status. It carries out cutting-edge research into bat viruses and has been named by the US President as the possible source of the coronavirus behind the global pandemic. But Yuan now denies there is any chance this disease could have leaked from his laboratory, insisting they followed strict safety procedures to protect staff and the environment from contamination. “There is no way this virus came from us,” he told state media — and like other Chinese officials, even hinted it might have emerged in the United States rather than his city.\n\n\n\nGiven the stakes, it is not surprising Prof Yuan has suddenly become so convinced about his laboratory’s security. He is also the most senior Communist Party official on the premises. If this pandemic were ever proven to be down to mistakes or poor safety, the consequences would be huge — and not just for him and his laboratory. It would devastate public faith in science, especially for those explorers pushing at frontiers of biological knowledge. It would turbo-charge the bubbling demands around the world for reparations. It would also shake — and possibly shatter — the dictatorial Chinese regime if it was exposed for connivance in history’s worst medical cover-up just as it attempts to assume global leadership.\n\n\n\nDonald Trump’s public condemnation of the Wuhan lab, saying he had seen “strong evidence” to back his case, only makes these matters more complex. His allegations, lacking any data, served to inflame a contentious and toxic issue. Some prominent scientists and journalists have been quick to dismiss the idea as a conspiracy theory. “We do not believe that any type of laboratory-based scenario is plausible,” concluded one influential paper in Nature Medicine (although it failed to mention one author is a guest professor at a body running one of the suspect units while another has just been honoured by Beijing for his work in China).\n\n\n\nAnother tireless figure insisting “scientists know Covid-19 wasn’t created in a lab” is former Kingston University parasitologist Peter Daszak, $402,000-a-year head of a charity that investigates spillovers of disease from animals. Daszak is understandably furious after his 15-year collaboration on bat diseases with Wuhan was disrupted by the National Institutes of Health’s decision to stop funding their research due to biosecurity concerns. This was widely seen as typical Trump, lashing out at his enemies. Yet the health body’s director is Francis Collins, a well-respected geneticist appointed by Barack Obama.”Whether [the coronavirus] could have been in some way isolated and studied in this laboratory in Wuhan, we have no way of knowing,” he said later.\n\n\n\nHe is right. For scientists, like journalists, should deal in facts — and at this stage we have no clear idea about the origins of this nasty disease. It may be a natural zoonotic virus, crossing over from animals like several previous epidemics including Ebola and the Sars outbreak at the start of this century. Few experts would be surprised if this turned out to be the case, although any intermediate host species has yet to be found. Meanwhile there are some wild conspiracy theories swirling around about bio-weapons and deliberate release by the Communist regime. Yet anyone who denies with certainty that Sars-Cov-2 — the new strain of coronavirus — might have leaked accidentally from one of Wuhan’s high-security laboratories is talking tosh.\n\n\n\nWe know one thing for sure: this pandemic did not emerge from the Wuhan wild animal market instantly identified as the source by Beijing. This market was closed and cleaned up the day after Chinese officials told the World Health Organisation about a strange new disease in the city, home to 11 million citizens and a vital transport hub in the middle of the country. They failed to share data from samples collected on site. Yet, in January, George Gao Fu, director of the Centre for Disease Control and Prevention (CDC), declared with total assurance this was the place of origin. Then, last month, after a series of studies cast doubt on this concept, he admitted in a television interview that he was mistaken.\n\n\n\nGao, China’s top epidemiologist, also said something intriguing in a previous television interview. He observed that this was the seventh coronavirus to infect humans, then added that none of its predecessors had acted in similar style. “The behaviour of this virus isn’t like a coronavirus,” he said.\n\n\n\nThis has been noted by other experts investigating the virus. Last month, I revealed in the Mail on Sunday the results of an important study by two scientists at the Broad Institute, a top genetic research unit set up by Harvard University and Massachusetts Institute of Technology, with a colleague from the University of British Columbia. It disproved the market source idea based on available genetic data. But the scientists also expressed surprise that Sars-Cov-2 was “already pre-adapted to human transmission”, contrasting its genetic stability as it rampaged around the planet with the coronavirus that evolved rapidly during the global Sars epidemic between 2002 and 2004.\n\n\n\nSuch stability is good news for finding a vaccine. Yet if this coronavirus can be traced back ultimately to bats, as seems near-certain, some scientists are puzzled that it emerged in such well-honed shape to wreak havoc on humans. As Collins has noted, and diseases such as Ebola have proved, nature can be the most lethal bio-terrorist. Yet that fascinating study implied single introduction of a human-adapted form of the virus into the population — and as the authors said, this means all routes for zoonotic transmission must remain in contention unless otherwise proven. “The possibility that a non-genetically engineered precursor could have adapted to humans while being studied in a laboratory should be considered,” they concluded.\n\n\n\nThen came another significant pre-print paper by an Australian team of vaccine researchers, which found the virus was “not typical of a normal zoonotic infection” since it was “uniquely adapted to infect humans”. Nikolai Petrovsky, the professor of medicine at Flinders University who led the study, echoed Gao when telling me he had never seen a zoonotic virus behave in such a way. He dared point in public to something being muttered privately by some other scientists: the coincidence of the most closely-related known viruses to Sars-Cov-2 being studied in Wuhan in conjunction with collaborating US laboratories. “There is currently no evidence of a leak but enough circumstantial data to concern us,” he said. “It remains a possibility until it is ruled out.”\n\n\n\nThe closest relative to the new virus is called RaTG13, which was disclosed in a paper submitted to Nature on the same January day that China belatedly admitted human transmission. It was found by Shi Zhengli, a famous scientist from WiV who helped discover that Sars was ‘amplified’ from bats by civet cats. Although little information has been shared about this virus strain, it seems to have been collected from horseshoe bats living more than 1,000 miles away in Yunnan and has 96% genetic similarity to Sars-Cov-2. This sounds close — yet as pointed out by the first scientist to publish the new virus’s genetic composition, this “likely represents more than 20 years of sequence evolution”.\n\n\n\nSome experts wonder why more information has not been shared about this strain, which fuels the idea of zoonotic transmission and was revealed so quickly by Shi and her team. I have even seen one unpublished paper questioning the validity of the Nature paper. Certainly Shi is a fascinating character. A brilliant scientist, she is known as ‘Bat Woman’ for leading intrepid sample-hunting expeditions in caves. She reacted angrily to social media suggestions that her work might be responsible for the pandemic. But she also admitted to Scientific American that she never expected such an outbreak in Wuhan, so far from the sub-tropical home of the bats she studied, and that her first thought was: “Could they have come from our lab?”.\n\n\n\nSome experts wonder why more information has not been shared about this strain, which fuels the idea of zoonotic transmission and was revealed so quickly by Shi and her team. I have even seen one unpublished paper questioning the validity of the Nature paper. Certainly Shi is a fascinating character. A brilliant scientist, she is known as ‘Bat Woman’ for leading intrepid sample-hunting expeditions in caves. She reacted angrily to social media suggestions that her work might be responsible for the pandemic. But she also admitted to Scientific American that she never expected such an outbreak in Wuhan, so far from the sub-tropical home of the bats she studied, and that her first thought was: “Could they have come from our lab?”.\n\n\n\nShi’s lab was not the only one in Wuhan working on bat-borne diseases. There was another one with lower level biosecurity run by the CDC just 500 yards from the animal market. A paper posted by two Chinese scientists in February on a site for sharing research — then pulled two days later — claimed that 605 bats were kept at this laboratory, describing how the creatures had attacked, bled and urinated on a researcher. “It is plausible that the virus leaked,” the mysterious study concluded. There is also a cluster of laboratories at a university hospital, which includes a high-security research unit into infectious diseases and a breeding centre that has made more than 1,000 types of genetically engineered animals from mice to monkeys.\n\n\n\nNow go back to Sars-Cov-2. This disease is far more infectious than the previous Sars that sparked a global epidemic, partly due to its efficient ability to enter different human organs. One specialist told me to think of viruses like hitchhikers seeking a lift from cells in the human body, which they then enter to infect. Something found on this new parasite, the furin cleavage site, ensures its spike protein — sticking out of the virus particle — can bind on to cells in human tissues including the lungs, liver, small intestines and even nerve cells. This is not found on either Sars or the most similar coronaviruses — and those coronaviruses that do have this feature are genetically very different.\n\n\n\nWe also know that WiV — the biggest repository of bat coronaviruses in Asia — had been carrying out ‘gain-of-function’ experiments on bat coronaviruses since 2015. It had been playing around with the Sars virus, inserting snippets from other bat diseases and constructing new chimeric coronaviruses. Barack Obama’s administration stopped funding such work in 2013 on grounds it was too dangerous, although ironically this ban was lifted under Trump after scientists argued that it aids understanding of how pandemic viruses evolve. But critics such as Richard Ebright, a biosafety expert and professor of chemical biology at Rutgers University, insist that the only impact of such work is creation of “a new, non-natural risk”. He points out WiV was creating chimeric coronaviruses using “seamless, unidirectional ligation” procedures that leave no signatures of human manipulation in the resulting genome sequences.\n\n\n\nEbright is an outlier on these issues. Another microbiologist who works with viruses in high-security labs told me she could never “design a virus that is this diabolical”. But others have expressed alarm over China’s rush to develop a network of high-security research centres to win primacy in biosciences. The BSL-4 level laboratory in Wuhan, for instance, was built with French help against advice of its intelligence services, while the Washington Post found that, two years ago, US experts warned the State Department of safety concerns after visiting the site. Now other leading figures insist we should not discount the idea of an accident. “It’s important to be upfront that we do not have sufficient evidence to exclude entirely the possibility that it escaped from a research lab doing gain of function experiments,” tweeted Carl Bergstrom, professor of biology at Washington University.\n\n\n\nProfessor Bergstrom believes a natural zoonotic spillover is a “far more plausible” explanation. But he added that “whatever the origin of Sars-Cov-2 may have been, going forward we need to carefully assess and manage the risk associated with a range of activities from wildlife markets to gain-of-function research to BSL4 labs in urban areas where spread would be rapid”. His comment highlights how these are, in many different ways, testing times for science and the scientific establishment.\n\n\n\nIndeed, it is hard not to wonder why some other prominent scientists insist this virus must be a natural zoonotic transmission — and also question why some key research centres that specialise in virus evolution have stayed silent. Could it be more evidence that academic institutions fear Beijing’s retribution if they raise challenging questions? We know, after all, that US federal authorities are investigating some major universities for failing to disclose hundreds of millions of dollars in gifts and contracts from foreign donors while earlier this month Charles Leiber, a world-renowned Harvard nanoscientist, was indicted on charges of lying over lucrative links to China. In Britain, MPs on the foreign affairs select committee recently highlighted “alarming evidence” of China’s efforts to restrict academic freedom in universities.\n\n\n\nClearly we must be cautious when there is so much at stake — unlike former spy chief Sir Richard Dearlove when he blamed a lab leak based on a weak new Norwegian-British study. But, equally, we cannot simply dismiss the idea as conspiracy theory. Not least when the Chinese government engaged in a cover-up over the initial outbreak of the disease, even silencing doctors trying to warn people in Wuhan — and then moved fast to tighten laboratory safety, especially for handling of viruses, in February. Beijing’s suggestion the virus may have arisen in a US lab also shows acceptance such events can happen. “In making this suggestion they are endorsing the possibility the Covid-19 virus has a lab origin – just not in China,” said one sceptical Western scientist.\n\n\n\nThere is no firm evidence of an accident or leak beyond a set of strange biological quirks and suspicious coincidences. But nor does the alternative hypothesis — that this is a freak event of nature and humans were the perfect host for a new zoonotic virus — have indisputable supporting evidence at this stage. No one has discovered an intermediate host, nor offered credible explanation of how a coronavirus moved from some bats in dank Yunnan caves to infect people hundreds of miles away in the bustling city of Wuhan. Indeed, in many ways this is the more frightening concept: if it has emerged in such natural spillover style, surely next time it will be even more lethal.\n\n\n\nThese are early days in our understanding of this coronavirus. Despite the stunning work of scientists around the world as they unravel its behaviour, components and impact, it continues to confound on so many levels. And at the moment we still have no definitive proof of where it came from and so no one is yet off the hook. This isn’t conspiracy theory, simply the facts.", "opengraph": {"type": "website", "title": "It's not mere conspiracy theory to ask if SARS-CoV-2 leaked from a Wuhan lab", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/100-2020/19434-it-s-not-mere-conspiracy-theory-to-ask-if-sars-cov-2-leaked-from-a-wuhan-lab", "description": "\"This isn’t conspiracy theory, simply the facts\"\r\n"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.independent.co.uk/news/world/asia/coronavirus-chinese-laboratory-wuhan-mi6-richard-dearlove-conspiracy-theories-a9547851.html", "https://www.cambridge.org/core/journals/qrb-discovery/article/biovacc19-a-candidate-vaccine-for-covid19-sarscov2-developed-from-analysis-of-its-general-method-of-action-for-infectivity/DBBC0FA6E3763B0067CAAD8F3363E527", "https://www.telegraph.co.uk/news/2020/06/03/exclusive-coronavirus-began-accident-disease-escaped-chinese/", "https://unherd.com/2020/06/so-where-did-covid-come-from/"], "authors": ["Editor2"], "publish_date": "2020-06-14T10:01:11+00:00"}