{"result_id": "137044", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19825-former-tory-party-advisor-wants-us-to-swallow-gm-food", "timestamp": "2023-04-25 15:18:35 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19825-former-tory-party-advisor-wants-us-to-swallow-gm-food", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Former Tory Party advisor wants us to swallow GM food", "cleaned_text": "Camilla Cavendish promotes false and misleading narratives to warm up the public to deregulated GMOs. Report: Claire Robinson\n\nAn article has been published in the Financial Times, with the headline, \"We must overcome the fear of genetic engineering in our food\", and the subhead, \"From countering climate change to saving bananas, new gene-editing technology could prove crucial\".\n\nThe author is Camilla Cavendish. She's a former Conservative Party (now non-affiliated) peer and \"former head of the Number 10 Policy Unit\", as well as a Trustee of the right-wing think tank Policy Exchange, which has been described as \"close to the government\". She's married to Huw van Steenis, a banker who is senior adviser to the CEO at the Swiss bank UBS and co-chair of the World Economic Forum's Global Future Council on Financial Services 2020-21.\n\nAll this might suggest that her primary interests in urging us all to \"overcome the fear\" of GM food less about feeding the hungry or enabling farmers to cope with climate change – and more about uncritically promoting government policy, particularly one that Boris Johnson and his allies believe can produce economic benefits via the UK agricultural biotechnology research sector.\n\nCavendish's article appears to be a ham-fisted attempt to warm up the British public to accepting GM, in the wake of the government's so-called public consultation on gene editing. That \"consultation\" turned out, in one scientist's words, to be nothing more than \"a PR exercise\" for GM. It ignored scientifically based reasons for caution as well as the public's right to transparency about how our food is produced.\n\nThe article lists the usual talking points of the pro-GMO lobby that GMWatch readers will be all too familiar with. The problem is, they are all lies or half-truths, and many were debunked or discredited decades ago. Below is a small selection, with our replies.\n\nCavendish equates GM COVID vaccines with GM food. She writes, \"Having queued up to have a genetically engineered vaccine stuck in my arm, I was being encouraged to spurn genetically engineered food on my plate\" – which, she believes, doesn't \"make sense\". Referring to the EU's GMO regulations and the UK government's plans to scrap them, she says, \"Loosening such restrictions could usher in techniques to combat disease and grow crops with higher yields to feed the world.\"\n\nSince the COVID vaccine rollout, spin doctors have been using the vaccines as a validation of GM crops and animals. But as GMWatch has pointed out, this argument is cockeyed. Medical uses of GM technologies are completely different from their uses in agriculture. They are partly governed by different rules and the culture of medical research is highly safety conscious. Medicines are regulated and must go through safety and efficacy tests before they can be used on people. They are also monitored post-release. Even with these safeguards in place, serious adverse effects can still happen. But at least there is a system in place to try to ensure safety and accountability.\n\nAnd crucially, medicines are used on people for specific conditions, for a specified time, with the patient's informed consent, so that the wished-for benefits can be weighed against any risks. In contrast, GM crops and foods are intended to be eaten by millions, potentially over a lifetime. Currently, under UK and EU law, GM crops and foods are subjected to limited safety checks, but the UK government and the EU Commission are trying to remove these, as well as the GMO labelling that provides for some degree of \"informed consent\". In the case of the UK, Boris Johnson believes that this deregulation will \"liberate the UK’s extraordinary bioscience sector from anti-GM rules\".\n\nCavendish shares this aim, attacking the \"lengthy risk assessment and member state approval\" currently required before a GM crop can be approved. She wants to see product-based regulation only for GM crops, foods and animals. What she fails to mention is that product-based regulation removes all safeguards for the consumer and the environment because it ignores the process by which the GMO was made and focuses only on the intended trait. This type of regulation will miss all the process-induced errors of genetic modification techniques, including the potential production of new toxins and allergens. (See Dr Michael Antoniou's letter to the Financial Times in which he warns against deregulating gene-edited foods for this reason.)\n\nThis is not the first time that GMO lobbyists have tried to force public acceptance of GM foods on the back of GMO medicines. And the tactic has succeeded. In 1997 MEPs were strong-armed into voting for the Life Patent Directive, which paved the way for the patenting of GM crops, foods, and animals, as well as medicines, by the appearance on the steps of the European Parliament of wheelchair-bound protesters. The protesters had been organised by one Alistair Kent, director of the Genetic Interest Group (GIG), who claimed that they would be denied the chance of a cure if MEPs did not vote for the directive. The lobbying to which the proposed directive was subjected is widely regarded as having been decisive in the MEPs' approval of a directive which all surveys showed was opposed by a clear majority of Europeans and which two years earlier MEPs had vetoed.\n\nOnly afterwards did MEPs discover that since mid-1995, GIG had been receiving expenses and \"gifts in kind\" from SmithKline Beecham (SB), one of the world's most aggressive genetic patent seekers. Kent's Strasbourg expenses were covered by SB.\n\nThe only beneficiaries of the deregulation of GM foods, crops and animals are the companies and individuals who own the patents on them.\n\nCamilla Cavendish is excited about claims that genetic engineers are trying to develop disease-resistant GM bananas. The bananas that have been targeted coincidentally share her name – Cavendish. Cavendish bananas are bland-tasting but have become the go-to favourite for commercial growers. But genetic uniformity and monoculture growing conditions have led to severe problems with diseases caused by fungal infections.\n\nInterestingly, a 2016 article by banana researchers emphasises \"classical plant breeding or genetic engineering\" (our emphasis) as alternative potential ways of producing resistant bananas, using genes from wild bananas. One of the authors of this article has published research in which resistance genes were identified in wild bananas, enabling marker-assisted breeding to be carried out. Marker-assisted breeding works with traditional breeding methods and doesn’t in itself lead to GM crops.\n\nYet Camilla Cavendish completely ignores the potential of the breeding programs, instead choosing to pull the wool over the public's eyes by claiming that \"the only way to save the Cavendish banana is to alter its genome\" with GM.\n\nIn making this claim, she promotes a narrative that has been pushed by GMO promoters since 2001 – that \"Only GM can save the banana\". Twenty years down the line, it still hasn't happened. Even if genetic engineers do manage to come up with a disease-resistant banana, the trait is unlikely to prove sustainable, since disease resistance is a genetically complex trait that cannot be reliably achieved by manipulating one or a few genes. Conventional breeding is the way to maximise such traits.\n\nThis is confirmed by the fact that a team of international researchers has already developed a banana resistant to a fungal disease, using natural breeding. The Pointe d'Or is resistant to the black Sigatoka fungal disease and is suitable for organic production.\n\nCrucially, the developers of the Pointe d'Or recognise that the solution to diseases doesn't just lie in genetics, but also in production methods. So researchers have collaborated with the banana industry to develop an \"agroecological cultivation system\" for the new variety, integrating methods of disease prevention and biological controls.\n\nWhy does Cavendish disingenuously ignore a real-world natural breeding success to hype a still-experimental GM one? Could it be that she is more interested in promoting the intellectual property rights that come with GMO \"inventions\" than in promoting practical solutions to food and farming problems.\n\nThe rest of Cavendish's article consists of naive, empty, and evidence-free promises that GM can end \"dependence on fertilisers which use fossil fuels\", make crops \"more resilient\", and allow us to \"engineer rice to produce less methane\". These claims are pie-in-the-sky notions that will likely never make it out of the lab or research greenhouse and into our fields.\n\nMany traditional crops do not need synthetic fertilisers, which are strongly associated with modern hybrid and GM varieties.\n\nAttempts to produce GM nitrogen-fixing plants that don't need synthetic nitrogen fertiliser have thus far failed. Meanwhile organic farming doesn't use synthetic nitrogen fertiliser but employs natural nitrogen-fixing plants and animal or green manures to provide nitrogen, with less nitrogen losses and polluting emissions than in chemical-based farming.\n\nNo GM crop has proved \"more resilient\" than non-GM crops.\n\nCavendish is also keen on the idea of lab grown meat, which is already with us, though anyone who believes it is environmentally friendly needs to read up on the energy footprint of bioreactor technology.\n\nIn short, Cavendish provides no good reasons why we should abandon our food safety and environmental safeguards to speed the rollout of a risky and experimental technology that will only distract us from proven effective solutions to farming problems.\n\nThe UK government is late in producing its response to the public consultation on the deregulation of gene editing that was launched in January – it was supposed to be published by 17 June. It seems probable that the government will delay publication until the summer holidays, when people will be distracted with other priorities. Cavendish's article joins a number of other pro-GMO propaganda pieces in the British press that are intended to help us \"overcome the fear\" of GM foods.", "opengraph": {"type": "website", "title": "Former Tory Party advisor wants us to swallow GM food", "url": "https://www.gmwatch.org/en/106-news/latest-news/19825-former-tory-party-advisor-wants-us-to-swallow-gm-food", "description": "\r\nCamilla Cavendish promotes false and misleading narratives to warm up the public to deregulated GMOs. Report: Claire Robinson\r\n", "image": "https://www.gmwatch.org/images/banners/Camilla_Cavendish_and_GMO_Corn_Cobs.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://archive.ph/RzfxP#selection-1585.0-1585.60", "https://en.wikipedia.org/wiki/Camilla_Cavendish,_Baroness_Cavendish_of_Little_Venice", "/en/?option=com_content&view=article&id=13532", "https://en.wikipedia.org/wiki/Camilla_Cavendish,_Baroness_Cavendish_of_Little_Venice", "https://neo.life/2021/06/raw-emotion-grows-in-uk-debate-over-gene-edited-crops/", "/en/news/latest-news/19682", "/en/news/latest-news/19682", "https://www.fwi.co.uk/news/eu-referendum/boris-johnsons-vows-to-liberate-uk-from-eus-biotech-crops-stance", "/en/news/latest-news/19837", "https://web.archive.org/web/20040809214905/http://www.lobbywatch.org/profile1.asp?PrId=146", "https://web.archive.org/web/20020612034315/http://www.monbiot.com/dsp_article.cfm?article_id=151", "https://web.archive.org/web/20020612034315/http://www.monbiot.com/dsp_article.cfm?article_id=151", "https://www.wur.nl/en/newsarticle/World-first-Panama-disease-resistant-Cavendish-bananas.htm", "https://www.theguardian.com/commentisfree/2016/oct/25/banana-farming-danger-cavendish-crop-genetics", "https://www.theguardian.com/commentisfree/2016/oct/25/banana-farming-danger-cavendish-crop-genetics", "https://link.springer.com/article/10.1007/s00122-020-03677-y", "https://gmwatch.org/en/only-gm-can-save-the-banana", "https://www.foodnavigator.com/Article/2020/02/28/Saving-the-banana-New-black-Sigatoka-resistant-variety-developed", "/en/news/latest-news/19349", "https://www.foodnavigator.com/Article/2020/02/28/Saving-the-banana-New-black-Sigatoka-resistant-variety-developed", "/en/news/latest-news/19240", "http://ubinig.org/index.php/home/showAerticle/91/english/Farida-Akhter/%E2%80%98Misrepresentation%E2%80%99-of-Bt-Brinjal-farmers-for-corporate-interest", "https://link.springer.com/article/10.1007/s10705-021-10126-9", "/en/news/latest-news/19282", "https://www.sciencemag.org/news/2021/05/uk-set-loosen-rules-gene-edited-crops-and-animals", "https://www.thescottishfarmer.co.uk/news/19382228.gene-editing-big-opportunity-uk-farmers/", "https://www.bbc.co.uk/news/business-57332484"], "authors": ["Editor2"], "publish_date": "2021-06-23T12:02:19+00:00"}