{"result_id": "137041", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19742-sunday-times-gmo-promotional-veers-wildly-off-target", "timestamp": "2023-04-25 15:18:34 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19742-sunday-times-gmo-promotional-veers-wildly-off-target", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Sunday Times GMO promotional veers wildly off-target", "cleaned_text": "Widely debunked claims on GMOs reappear in attempt to fool the public\n\nThe Sunday Times has published a GMO promotional by science editor Ben Spencer arguing for the deregulation of gene editing. But the article's claims are as wildly far from the mark as the off-target errors caused by gene editing itself.\n\n \n\nThe problems start with the title and subtitle: \"You’ve had the GM jab, so what’s wrong with GM food? After decades of concern about the risks of genetic modification, the success of the Covid-19 vaccines should prompt a rethink on ‘Frankenfoods’.\"\n\nRegulated GM vaccines are different from unregulated GM foods\n\nWe've pointed out the logic bypass in the notion that vaccines somehow offer a free pass to GM foods. Only some of the COVID-19 vaccines are GM, and none are gene-edited, which is the type of GMO they’re in a rush to deregulate. Vaccines, like all medicines, are safety tested before release, labelled in use, administered with the informed consent of the patient, then monitored for side effects. Even then, we know that things can and sometimes do go wrong.\n\n \n\nBut what Spencer and the pro-GMO lobby are arguing for is that GM foods be deregulated. That means no safety testing, no labelling (so no informed consent) and no post-market monitoring.\n\n \n\nIt just doesn't make any sense to compare regulated vaccines, where there are safety checks and choice, with unregulated GM foods.\n\n \n\nThere’s also the balance of risks and benefits. And amidst a welter of faulty logic and misinformation the one moment of sanity in the Sunday Times’ article is when it quotes Professor Chris Pollock as saying, “In medical GM you take the risk — small though that is — and you get the benefit. And for Covid vaccines that benefit is rather large. But for GM food, you take the risk but the farmer gets the benefit.”\n\nAccording to Jonathan Jones, a plant genetic engineer at the Sainsbury Laboratory in Norwich whose failure to flag up his links to Monsanto and Bayer have won him adverse comment, there are lots of benefits to be had. Jones claims that deregulating the whole of GM (not just gene editing), would not only improve productivity, and therefore reduce prices, but also would have untold environmental benefits.\n\n \n\nBut there is an abundance of evidence that GM doesn't increase crop yields, improve productivity, reduce prices for farmers, or have environmental benefits (think GM herbicide-tolerant crops, which represent 85-90% of the GM crops that have been grown to date).\n\n \n\nMaurice Moloney, the former director of Rothamsted Research institute in Hertfordshire, who also has Monsanto links and is so enamoured of GM crops that he used to ride around in a Porsche with a GMO number plate, makes an even wilder claim. He says, “If you look around the world and ask, ‘What has been the biggest contribution to the improvement of soil health over the last 10 years?’, it has actually been genetic modification.”\n\n \n\nMoloney is, as usual, talking baloney. Clearly he has failed to make himself aware of the catastrophic destruction of ecosystems that has occurred over the past 25 years as a result of the spread of GM herbicide-tolerant crops.\n\n \n\nThe environmental damages that have appeared in the wake of these crops include declines in individual species like the monarch butterfly, the destruction of soil microorganisms, and the killing and damaging of non-GM crops, as well as wild plants and trees.\n\n \n\nMoloney also seems to be blissfully ignorant of the spread of herbicide-resistant weeds in GM herbicide-tolerant crop fields, which has resulted in farmers having to use more herbicide, and more different types of herbicide, in their fields, as well as returning to ploughing, the soil-harming farming method that these crops were supposed to avoid.\n\nFeeding the world (or not)\n\nSeasoned GMWatch readers may not be surprised to see the re-emergence of the zombie claim of \"We need GM to feed the world's growing population\", long after it has been repeatedly debunked. There are no food shortages in any country of the world; people go hungry not because there isn't enough food but because they lack the money to buy food and increasingly, the land to grow it on; and as we said above, GM doesn't increase yields.\n\n \n\nMost GM crops grown in the world today don't feed people, but go to feed animals in intensive livestock operations in wealthy countries. Most of the rest go into biofuels, to feed our cars.\n\nThe article claims that while Boris Johnson’s political predecessors, like Tony Blair, failed to get Britain to embrace GM crops, “scientists [read: the GM lobby] are increasingly confident the prime minister might succeed\". The Sunday Times science editor ascribes this not only to Brexit but to other factors, like gene editing supposedly being safer (in fact there are reasons to think it may be less safe).\n\nBut this is disingenuous.\n\nThe real reason for that confidence is almost certainly that Boris Johnson’s government has shown a ruthless disregard for people’s concerns in pursuing its often extreme and sometimes corrupt agenda.\n\n \n\nThat this ruthlessness includes disregarding even the clearest evidence of potential environmental harm has been shown by the government’s recent overriding of its own experts’ concerns when green-lighting the use of a neonicotinoid insecticide, despite the known risks to bees and other species.\n\n \n\nJust as Donald Trump proved a strong ally of the biotech industry, his mini-me in the UK looks set to prove the same. The fact that the public is distracted by a pandemic is likely to assist him in that endeavour. And despite its best efforts, the Sunday Times can’t hide that disreputable reality behind “GM” jabs and bogus claims.", "opengraph": {"type": "website", "title": "Sunday Times GMO promotional veers wildly off-target", "url": "https://www.gmwatch.org/en/106-news/latest-news/19742-sunday-times-gmo-promotional-veers-wildly-off-target", "description": "\r\nWidely debunked claims on GMOs reappear in attempt to fool the public\r\n", "image": "https://www.gmwatch.org/images/banners/Sunday-Times-Gene-Editing-Promotional.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.thetimes.co.uk/article/youve-had-the-gm-jab-so-whats-wrong-with-gm-food-bp3rw70dw", "/en/news/latest-news/19223", "/en/news/latest-news/19682", "/en/news/latest-news/19709", "https://powerbase.info/index.php/Jonathan_Jones", "https://www.amazon.com/GMO-Myths-Truths-Citizens-Genetically/dp/0993436722", "https://powerbase.info/index.php/Maurice_Moloney", "https://spinwatch.org/index.php/issues/science/item/163-science-one-whining-greenies-nil", "/en/latest-listing/51-2012/14239-science-media-centre-qexpertsq-who-attacked-seralinis-study-2-maurice-moloney", "https://www.amazon.com/GMO-Myths-Truths-Citizens-Genetically/dp/0993436722", "https://www.amazon.com/GMO-Myths-Truths-Citizens-Genetically/dp/0993436722", "http://www.enveurope.com/content/24/1/24", "https://www.scientificamerican.com/article/farmers-fight-explosion-of-superweeds/", "https://www.independentsciencenews.org/environment/how-the-great-food-war-will-be-won/", "https://www.amazon.com/GMO-Myths-Truths-Citizens-Genetically/dp/0993436722", "https://www.amazon.com/GMO-Myths-Truths-Citizens-Genetically/dp/0993436722", "https://doi.org/10.1186/s12302-020-00361-2", "https://www.frontiersin.org/articles/10.3389/fpls.2019.00525/full", "https://netpol.org/2021/03/09/protest-bill/", "https://www.opendemocracy.net/en/dark-money-investigations/national-audit-office-investigating-uk-government-covid-contracts-after-cronyism-accusations/", "https://friendsoftheearth.uk/nature/government-didnt-follow-expert-advice-beeharming-pesticide"], "authors": ["Editor2"], "publish_date": "2021-03-30T19:35:52+00:00"}