{"result_id": "137040", "URL": "https://gmwatch.org/en/106-news/latest-news/19419-coronavirus-began-as-an-accident-in-chinese-lab-says-former-mi6-boss", "timestamp": "2023-04-25 15:18:34 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/106-news/latest-news/19419-coronavirus-began-as-an-accident-in-chinese-lab-says-former-mi6-boss", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "Coronavirus began \"as an accident\" in Chinese lab, says former MI6 boss", "cleaned_text": "Sir Richard Dearlove says new scientific report suggests key elements of the virus were \"inserted\"\n\nThe article from the Telegraph below contains a lot of the anti-China sentiment that we've been seeing in much of the media coverage of the lab origin theory for SARS-CoV-2. But that aside, the lab escape theory is looking increasingly convincing – as GMWatch has been highlighting for some time.\n\n\n\nGMWatch has also pointed out the close involvement of the US (including massive funding from the NIH via the EcoHealth Alliance) in the dangerous virus gain-of-function research that could have led to this lab escape. That's an element that is completely missing from this article and many others on the same theme.\n\n---\n\nExclusive: Coronavirus began 'as an accident' in Chinese lab, says former MI6 boss\n\nBy Bill Gardner \n\nThe Telegraph, 3 June 2020\n\nhttps://www.telegraph.co.uk/news/2020/06/03/exclusive-coronavirus-began-accident-disease-escaped-chinese/\n\n[links to sources at this URL]\n\n\n\n* Sir Richard Dearlove tells Telegraph's Planet Normal podcast that new scientific report suggests key elements of the virus were 'inserted'\n\n\n\nA former head of MI6 has said he believes the coronavirus pandemic \"started as an accident\" when the virus escaped from a laboratory in China. \n\n\n\nIn an interview with The Telegraph, Sir Richard Dearlove said he had seen an \"important\" new scientific report suggesting the virus did not emerge naturally but was man-made by Chinese scientists.\n\n\n\nThe apparent discovery will raise the prospect of China paying \"reparations\" for the death and economic catastrophe wreaked upon the world, the former intelligence chief said. It comes as Beijing faces growing pressure to explain precisely how coronavirus first began to spread late last year.\n\n\n\nInternational scientists have reached a near-unanimous consensus, however, that the virus emerged in animals – most likely bats or pangolins – before jumping to the human population.\n\n\n\nBut Sir Richard, 75, pointed to a scientific paper published this week by a Norwegian-British research team who claim to have discovered clues within Covid-19's genetic sequence suggesting key elements were \"inserted\" and may not have evolved naturally.\n\n\n\nFrom the outset, the Chinese government has endeavoured to \"lock down\" any debate about the origins of the virus and Beijing's handling of the crisis, he claimed.\n\n\n\n\"I do think that this started as an accident,\" Sir Richard told The Telegraph's new Planet Normal podcast (listen through the player at the top of this story). \"It raises the issue, if China ever were to admit responsibility, does it pay reparations? I think it will make every country in the world rethink how it treats its relationship with China and how the international community behaves towards the Chinese leadership.\"\n\n\n\nSir Richard, who was the head of MI6 between 1999 and 2004, cited startling new peer-reviewed research produced by Professor Angus Dalgleish, of St George's Hospital at the University of London, and the Norwegian virologist Birger Sorensen.\n\n\n\nIn their paper, the scientists claim to have identified \"inserted sections placed on the SARS-CoV-2 Spike surface\" that explain how the virus binds itself to human cells.\n\n\n\n\"The SARS-CoV-2 spike is significantly different from any other Sars that we have studied,\" the paper says.\n\n\n\nIt warns that current efforts to develop a vaccine are destined for failure because the true aetiology of the virus has been misunderstood. To remedy the problem, the researchers are developing their own vaccine, produced by Immunor AS, a Norwegian pharmaceutical company led by Mr Sorensen.\n\n\n\nSir Richard described the study as \"a very important contribution to a debate which is now starting about how the virus evolved and how it got out and broke out as a pandemic\", adding: \"I think this particular article is very important, and I think it will shift the debate.\"\n\n\n\nHe revealed that the Dalgleish/Sorensen paper had been rewritten several times. An earlier version, seen by The Telegraph, concluded that coronavirus should correctly be called \"Wuhan virus\" and claimed to have proven \"beyond reasonable doubt that the Covid-19 virus is engineered\".\n\n\n\n\"We are aware that these findings could have political significance and raise troubling questions,\" the authors originally wrote. The paper was widely circulated behind the scenes after being distributed for peer review, while intelligence officials reportedly examined its findings. \n\n\n\nHowever, one of the authors, John Fredrik Moxnes, the chief scientific adviser to the Norwegian military, asked for his name to be withdrawn from the research, throwing its credibility into doubt. Scientists from the Francis Crick Institute and Imperial College London also dismissed its conclusions, it is understood.\n\n\n\nCorrespondence seen by The Telegraph shows that, in April, the initial paper was rejected by leading academic journals including Nature and the Journal of Virology, which deemed the research \"unsuitable for publication\". \n\n\n\nMuch of the paper was watered down to remove explicit accusations against China, and the rewritten study was then judged to be of sufficient scientific merit to be accepted for publication in the Quarterly Review of Biophysics Discovery, a journal chaired by leading scientists from Stanford University and the University of Dundee. \n\n\n\nA further analysis produced by Prof Dalgleish and his colleagues, due for release in the coming days, claims the Covid-19 virus has \"unique fingerprints\" that cannot have evolved naturally and are instead \"indicative of purposive manipulation\".\n\n\n\nEntitled \"A Reconstructed Historical Aetiology of the SARS-CoV-2 Spike\", the new study, seen by The Telegraph, suggests the virus is \"remarkably well-adapted virus for human co-existence\" and is likely to be the result of a Wuhan lab experiment to produce \"chimeric viruses of high potency\".\n\n\n\nThe paper concludes: \"Henceforth, those who would maintain that the Covid-19 pandemic arose from zoonotic transfer need to explain precisely why this more parsimonious account is wrong before asserting that their evidence is persuasive, most especially when, as we also show, there are puzzling errors in their use of evidence.\"\n\n\n\nThe paper has not yet been accepted for publication in any scientific journal.\n\n\n\n\"This [the first] article was submitted to a… journal, which refused it within a week of receiving it, and in the same period accepted for publication two or three Chinese articles that relate to the virus, within 48 hours,\" Sir Richard said. \n\n\n\n\"So I mean, as this debate about the virus develops, I think all this material is going to be in print and is going to embarrass a number of people, I think. Let's suggest that the Chinese maybe have too much say in their journals, in what appears and what doesn't.\"\n\n\n\nThe Chinese government has always insisted that the outbreak began in a \"wet market\" in the city of Wuhan late last year. But critics have questioned why some early human cases and their contacts appeared to have no connection to the area.\n\n\n\nTwo laboratories in Wuhan studying bat coronaviruses – the Wuhan Institute of Virology and the Wuhan Centre for Disease Control – have been suggested as the possible true sources of the outbreak. \n\n\n\nSir Richard suggested scientists may have been conducting secret gene-splicing experiments on bat coronaviruses when Covid-19 somehow escaped through a lapse in biosecurity.\n\n\n\n\"It's a risky business if you make a mistake,\" he said. \"Look at the stories... of the attempts by the leadership to lockdown any debate about the origins of the pandemic and the way that people have been arrested or silenced. \n\n\n\n\"I mean, we shouldn't really have any doubt any longer about what we're dealing with.\" \n\n\n\nSir Richard said he did not believe the Chinese had released the virus deliberately, but accused Beijing of subsequently covering up the scale of its spread.\n\n\n\n\"Of course, the Chinese must have felt, well, if they've got to suffer a pandemic maybe we shouldn't try too hard to stop, as it were, our competitors suffering the same disadvantages we've got,\" he said.\n\n\n\n\"Look, the Chinese understand us extremely well. They have made a study of us over the last decade or longer, particularly through attending our universities. We understand the Chinese very poorly. It's an imbalanced relationship in that respect.\"\n\n\n\nLast month, the US Secretary of State, Mike Pompeo, claimed there was \"enormous evidence\" that the coronavirus outbreak originated in a Chinese laboratory, but did not provide any proof. However, the US National Intelligence Director's office later said it had determined that Covid-19 \"was not manmade or genetically modified\". \n\n\n\nDuring a television interview on May 9, Matt Hancock, the Health Secretary, said: \"We don't have any evidence that this is a man-made coronavirus.\" \n\n\n\nScientists analysing Covid-19 have also reported no signs that the genetic sequence was manipulated or distorted in any way. Nevertheless, Beijing is facing growing pressure to reveal everything it knows about the origins of Covid-19 amid accusations that the rest of the world may have been misled.\n\n\n\nSir Richard praised the Australian government for leading calls for an official inquiry after Scott Morrison, the Prime Minister, suggested that the World Health Organisation needed tough new \"weapons inspector\" powers to investigate the origins of Covid-19.\n\n\n\n\"I think it's very courageous of the Australians to take China on,\" Sir Richard said. \"I mean, there's an obvious, huge imbalance in terms of power, both economic and military and political, but they are showing the way. You have to have a critical relationship with China.\"\n\n\n\nHe urged the UK Government to abandon plans to allow the Chinese telecoms firm Huawei to have a role in building Britain's new 5G network, and to reduce the reliance on Chinese factories to make cheap personal protective equipment (PPE) for frontline NHS health workers.\n\n\n\n\"We need to go into reverse,\" he said. \"It's important that we do not put any of our critical infrastructure in the hands of Chinese interests. So telecommunications, Huawei, nuclear power stations, and then things that, you know, we require and need in a crisis, like PPE. \n\n\n\n\"We have allowed China so much rope that we are now suffering the consequences, and it's time to pull the rope in and to tighten the way we do business. It's very, very important that we keep a keen eye on this and do not allow the Chinese to, as it were, benefit strategically from this situation that has been imposed on all of us.\"\n\n\n\nSir Richard criticised George Osborne, the former Chancellor, for proclaiming that Britain would be China's \"best partner in the West\" during a charm offensive in September 2015.\n\n\n\n\"I think the problem with young politicians, and when he was in office he was young, is that they lack experience and they lack depth of knowledge, and I don't think that George Osborne really understood what the leadership of a real communist party is like,\" Sir Richard said.\n\n\n\n\"I spent most of my career dealing with the issue of communism, with the autocratic nature of the way that these parties are run and their immense disregard for law, for human rights, for all of these areas, and I mean George Osborne just conveniently disregarded all of that.\"\n\n\n\nEarlier this week, Liu Xiaoming, the Chinese ambassador to the UK, said Beijing would welcome an international investigation into the origins of the pandemic, insisting his country had nothing to hide. \n\n\n\n\"China's record is clean. It can stand the test of time and history,\" he said.", "opengraph": {"type": "website", "title": "Coronavirus began \"as an accident\" in Chinese lab, says former MI6 boss", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/100-2020/19419-coronavirus-began-as-an-accident-in-chinese-lab-says-former-mi6-boss", "description": "Sir Richard Dearlove says new scientific report suggests key elements of the virus were \"inserted\"\r\n"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "/en/news/latest-news/19391", "/en/news/latest-news/19403", "https://www.telegraph.co.uk/news/2020/06/03/exclusive-coronavirus-began-accident-disease-escaped-chinese/"], "authors": ["Editor2"], "publish_date": "2020-06-04T09:31:50+00:00"}