{"result_id": "137046", "URL": "https://www.gmwatch.org/en/news/archive/2005/7789-rummys-bird-flu-bonanza-protected-from-liability-20112005", "timestamp": "2023-04-25 15:18:36 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/news/archive/2005/7789-rummys-bird-flu-bonanza-protected-from-liability-20112005", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Rummy's bird-flu bonanza protected from liability", "cleaned_text": "1.FDA to Examine Deaths of 12 Pediatric Tamiflu Patients in Japan\n\n2.Protection for Vaccine Makers Debated\n\nWe recently noted how Bush and Blair's ultra-precautionary purchases of vaccines and antivirals happened to suit the financial interests of their own cronies. (see Rummy's bird flu bonanza & Blair backer's smallpox bonanza)\n\nhttp://www.lobbywatch.org/archive2.asp?arcid=5913\n\n\n\nThe president is seeking US$7.1 billion in emergency funding to prepare for the not-imminent not-pandemic danger of bird-flu, including $1 billion for the anti-viral Tamiflu, developed and patented by Gilead Sciences Inc. (part of Roche) when chaired by Donald Rumsfeld, who still holds a Gilead stake valued at between $5 million and $25 million, according to his federal financial disclosures.\n\nThe president is also writing protections for such companies into the bill that some say they would make it extremely difficult for those harmed by such a medicine to get any financial compensation (item 2). Given the reports coming out of Japan of possible deaths caused by Tamiflu, this could be extremely useful. (item 1)\n\nDonald Rumsfeld has also done well out of the war on terror. As a precautionary measure against a smallpox attack, Rumsfeld ordered members of the armed forces to be inoculated against smallpox with a package that included injection with the drug Vistide - another product of Gilead Sciences.\n\nIn the UK the Ministry of Defence contract for the Blair government's precautionary purchase of large quantities of smallpox vaccine went to Powderject - the biotech company of Blair crony and financial supporter, Paul Drayson, who was also made a Lord and given a job in Blair's government aftyer donating a million pounds to Blair's party.\n\nhttp://www.lobbywatch.org/archive2.asp?arcid=5913\n\n\n\nPerhaps Blair will also be introducing legal protections for vaccine manufacturers, following BBC revelations that Drayson's company, \"sold faulty TB vaccines and kept quiet about it for 21 months, risking the health of thousands of people\".\n\nhttp://news.bbc.co.uk/2/hi/business/4446978.stm\n\n---\n\n1.FDA to Examine Deaths of 12 Pediatric Tamiflu Patients in Japan\n\nBy ANDREW BRIDGES Associated Press Writer\n\nThe Associated Press, nOV 18 2005\n\nhttp://abcnews.go.com/Health/wireStory?id=1325014\n\n\n\nWASHINGTON Nov 18, 2005 ”” The federal government is looking into the deaths of 12 Japanese children who took Tamiflu, but officials cautioned they have no evidence that suggests the anti-flu drug is to blame.\n\n\"Clearly, any time you get a report of a death or a serious occurrence, you want to look into it,\" said Dr. Murray Lumpkin, deputy commissioner of the U.S. Food and Drug Administration.\n\nThe reports are being discussed as part of the annual pediatric safety review of Tamiflu and seven other drugs. The Japanese deaths were detailed in papers released before Friday's meeting. There are no reports of deaths in the United States or Europe associated with Tamiflu.\n\nThe FDA sought and received more information from the Swiss pharmaceutical company Roche Holding AG, which makes Tamiflu, and from Japanese health authorities. It has not issued any warnings or initiated any other action, spokeswoman Susan Bro said.\n\n\"Based on the information we have right now, we cannot say definitively there is a causal relation between the drug and the children's death,\" Lumpkin said.\n\nAn update by FDA staff also includes reports of 32 \"neuropsychiatric events\" associated with Tamiflu, all but one experienced by Japanese patients. Those cases included delirium, hallucinations, convulsions and encephalitis.\n\nRoche said several studies in the United States and Canada had shown that the incidence of death in influenza patients who took Tamiflu was far lower than in those who did not.\n\nThe company also has supplied the FDA with two additional studies it commissioned that evaluated the safety of Tamiflu in pediatric patients.\n\nComplicating the issue is that many of the Japanese death and adverse reaction reports list symptoms commonly associated with the flu, Lumpkin said.\n\n\"It is very difficult, when the underlying disease causes what it is being reported, to figure out: Is it the underlying disease? Is it the drug?\" he said.\n\nThe popularity of Tamiflu in Japan may explain in part the number of reports from that country: Of 32 million people treated with Tamiflu since its approval in 1999, 24 million were in Japan, according to Roche. \n\n---\n\n2.Protection for Vaccine Makers Debated \n\nLegislation would require proof of willful misconduct\n\nThe Associated Press, 16 November 2005 \n\nhttp://www.truthout.org/issues_05/111705HA.shtml\n\nWashington - People injured by a vaccine against bird flu or anthrax would have to prove willful misconduct to bring a claim for damages against drug manufacturers or distributors, according to legislation being drafted behind the scenes by Republicans.\n\nA 10-page draft of the legislation obtained by The Associated Press says it would be up to the Health and Human Services secretary to declare that such misconduct occurred. If that declaration is made, the case must be heard in federal court.\n\nThe measure, which would be included in a spending bill, would bar any punitive damages and limit awards for physical and emotional pain and suffering and other noneconomic damages to a maximum of $250,000.\n\nThe draft legislation was provided to the AP separately by two parties opposed to its provisions, who did not want to be identified.\n\nAn aide to Sen. Bill Frist, R-Tennessee, confirmed the majority leader was looking to add the liability protections to a spending bill.\n\nAmy Call said the legislation is important because \"it would be a pity to appropriate $7.1 billion to purchase vaccines and antivirals but have no capacity to produce them.\"\n\nShe said Frist is seeking clearly defined standards for an industry that is already heavily regulated.\n\n\"We would only provide liability protection in a serious situation and for a set period of time and for a specific purpose,\" Call said. \"The protection would only go into effect if the secretary makes a declaration that we are grave danger and the public is advised to take the product.\"\n\nPresident Bush's plan for dealing with a flu pandemic called on Congress to give drug manufacturers sweeping immunity against lawsuits. \"In the past three decades, the number of vaccine manufacturers in America has plummeted, as the industry has been flooded with lawsuits,\" Bush said last month. \"Today, there is only one manufacturer in the United States that can produce influenza vaccine.\"\n\nLawmakers from both political parties also have cited a need to grant the industry some protections. However, the protections described in the draft are quite broad, and some say they would make it extremely difficult for those harmed by a medicine to get any financial compensation.\n\n\"The Republican leadership in Congress is trying to do another special favor for the drug companies by slipping a provision into a massive spending bill to absolve the pharmaceutical industry of any responsibility to patients injured by dangerous drugs or vaccines, with no compensation for those who are harmed,\" Sen. Edward M. Kennedy, D-Massachusetts, said in a statement.\n\nHe called for an open debate on the issue.\n\nSen. Mike Enzi, R-Wyoming, chairman of the Senate's health committee, favors liability protections for drug manufacturers, but not as part of an appropriations bill, according to spokesman Craig Orfield.\n\n\"He does not want to address biodefense in a piecemeal fashion,\" Orfield said.\n\nTrial lawyers said they oppose having to prove \"willful misconduct\" to get financial compensation from an injury.\n\n\"Basically, as an average person, I would have to prove some scientist at Merck or some CEO somewhere had made a determination to hurt me,\" said Chris Mather, a spokeswoman for the Association of Trial Lawyers for America.\n\nWillful misconduct, according to the draft legislation, would occur if manufacturers or distributors of a particular product knew that it presented \"a significant or unreasonable risk to human health\" and there was a \"conscious failure to act\" to avoid that risk.\n\nIf the HHS secretary rules against the petition, then those claiming to be harmed could seek judicial review from the US Court of Appeals.\n\nRep. Dave Weldon, R-Florida, a doctor who said he is involved peripherally in the talks, said he doesn't want protections so broad that people might be unwilling to take medicine in the event of a flu pandemic.\n\n\"The way it's being discussed is lacking,\" Weldon said.\n\nMeanwhile, House GOP leaders have delayed until December any action on President Bush's $7.1 billion request to prepare for a potential bird flu pandemic. The development came as negotiators on a huge spending bill covering health care and education programs met Monday night.\n\nThe House rejected an almost $8 billion Senate plan to fight the flu, saying it will revisit the issue next month as it also turns to Bush's request to direct emergency funds already enacted for victims of Hurricane Katrina to new purposes such as rebuilding highways, levees and federal facilities damaged by the storm.", "opengraph": {"type": "website", "title": "Rummy's bird-flu bonanza protected from liability", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/44-2005/7789-rummys-bird-flu-bonanza-protected-from-liability-20112005"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://www.lobbywatch.org/archive2.asp?arcid=5913", "http://www.lobbywatch.org/archive2.asp?arcid=5913", "http://news.bbc.co.uk/2/hi/business/4446978.stm", "http://abcnews.go.com/Health/wireStory?id=1325014", "http://www.truthout.org/issues_05/111705HA.shtml"], "authors": [], "publish_date": "2005-11-20T19:33:04+00:00"}