{"result_id": "137016", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19999-100-of-uk-government-s-gmo-advisory-body-have-potential-or-actual-conflicts-of-interest", "timestamp": "2023-04-25 15:18:22 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19999-100-of-uk-government-s-gmo-advisory-body-have-potential-or-actual-conflicts-of-interest", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "100% of members of UK government's GMO advisory body ACRE have potential or actual conflicts of interest", "cleaned_text": "List of interests reads like Who's Who of the British biotechnology industry. Report: Claire Robinson\n\nToday the UK Parliament's Delegated Legislation Committee debated the government's statutory instrument that lays the groundwork for deregulating the planting of GM crops for non-commercial purposes. Daniel Zeichner, the Shadow Minister for Food, Farming and Fisheries, voiced concerns about the instrument. He mentioned that several members of the government's GMO advisory body, the Advisory Committee on Releases to the Environment (ACRE), have conflicts of interest with the biotechnology industry – the same industry that stands to benefit from the government's plan to weaken the rules around agricultural GMOs.\n\n\n\nHis assessment is backed by the startling results of our own analysis. They show that 100% of the members of ACRE have potential or actual conflicts of interest that may enable them to benefit from any weakening of the regulations around GMOs. In addition, in spite of ACRE's role in regulating environmental releases of GMOs, only one member of the ACRE panel has expertise in ecology and none appear to have expertise in environmental toxicology.\n\nWhat does ACRE do?\n\nThe Advisory Committee on Releases to the Environment (ACRE) describes itself as \"an independent Advisory Committee composed of leading scientists\". It gives \"advice to ministers on the risks to human health and the environment from the release of genetically modified organisms (GMOs)\". These include plants, animals, microorganisms, and GMO medical applications, such as gene-based therapies and vaccines. \n\n\n\nCurrently the UK government, especially the Department for the Environment, Food and Rural Affairs (DEFRA), is relying on ACRE’s scientific advice to inform and justify its push for deregulation of gene editing in agriculture. It will be ACRE that will deliver the long-awaited definition of the hypothetical subclass of GMOs that \"could have occurred naturally or through conventional breeding\", which Boris Johnson’s government wants to exempt from the GMO regulations. This means that these GMOs will not be subjected to a safety assessment and may be exempted from GMO labelling and traceability requirements.\n\n\n\nGiven the enormous responsibility entrusted to ACRE, two questions arise: Just how independent are the members of ACRE? And are they qualified to assess the environmental and societal risks arising from the release of GMOs?\n\nACRE calls itself \"independent\" – but of what? The public has a right to assume that it means that its members are independent of the interests of the GMO industry. But our investigation shows that this assumption is incorrect. \n\n\n\nSources consulted in our investigation were the declarations of interest on the ACRE website, the patent database Espacenet, and other documentation in the public domain.\n\nJim Dunwell, chair of ACRE, is Professor of Plant Biotechnology at the University of Reading. In his ACRE declaration of interest, he lists only one commercial interest – a pension from Syngenta, a company that develops GM seeds and agrochemicals. He receives this because he is a former employee (1986–1996) of the biotech company Zeneca, which merged with Novartis to form Syngenta. \n\n\n\nHowever, he has plenty of past and present actual and potential conflicts of interest with industry. \n\n\n\nHe was a founding member of CropGen, a biotech industry-funded lobby group that describes its mission as \"to make the case for GM crops and foods\", according to a news report. Prior to his employment at Syngenta, from 1970–1986 he worked at the John Innes Centre (JIC), which has received funding from all the major GMO companies, including multi-million pound investments. In 1998 the JIC announced GBP10m of investment by Dupont and GBP50m by Syngenta (the original commitment in '98 was made by Zeneca). There is no suggestion that Dunwell benefited from these funds; these figures are only given to show the dependence of the JIC on industry funds.\n\n\n\nDunwell's University of Reading profile notes that he has \"numerous collaborative links with... commercial research organisations\", but these are not elaborated upon. He states that his research interests focus on \"the development of novel breeding methods and applications of transgenic plants\". \n\n\n\nHe holds inventor and/or applicant status on several GMO-related patents, including some held with Zeneca and its later incarnation, Syngenta. Being named on patents does not always equate to financial rewards, but it can equate to rewards in terms of career and reputation. These should be clarified.\n\n\n\nDunwell's pension from Syngenta may or may not be a conflict of interest, depending on whether the company has inserted clauses into the pension agreement restricting what he can do or say. Such \"gag\" clauses attached to pensions are not uncommon. If they apply to Dunwell, they could prevent him from speaking freely in the highly unlikely event (given his background) that he has reservations about any given GMO.\n\nProfessor Alan Raybould is Chair of Innovation in the Life Sciences at the University of Edinburgh. His university profile states that his research \"focuses on the use of science to inform decision-making, particularly improving the efficiency and effectiveness of regulation of products of new technology in agriculture and food production\".\n\n\n\nLike Dunwell, Raybould is a veteran of Syngenta and receives a pension from the company, which he lists as a commercial interest in his ACRE declaration of interests. He joined Syngenta at Jealott’s Hill in the UK in 2001. He \"led the preparation of environmental risk assessments as part of worldwide regulatory submissions for Syngenta’s genetically modified crop products\". \n\n\n\nRaybould moved to Syngenta’s headquarters in Basel, Switzerland in 2014. He was \"a Senior Science & Technology Fellow working on risk assessment and societal acceptance of agricultural products of new technology, including insect-control sprays based on RNA interference, and crops bred using gene editing\". He now seems to have retired from Syngenta – hence the pension.\n\n\n\nHe is research co-lead (with Joyce Tait) in the REACT-FIRST project, coordinated by Deep Branch Biotechnology Ltd, in collaboration with the Innogen Institute at the University of Edinburgh. The project uses synthetic biology bioreactor technology to produce a novel protein called Proton for animal feed from carbon dioxide industrial emissions (in GMWatch's view, genetically modified bacteria will likely be used to encode the proteins). Raybould and Tait are on the management team of Innogen, which says it \"supports the delivery of innovation that is profitable, safe and societally useful\". Innogen's role in the REACT-FIRST project is reportedly \"to innovate responsibly and engage with relevant stakeholders to ensure wider acceptance of the technology\". \n\n\n\nOther partners in REACT-FIRST are aquaculture feed producer BioMar, animal feed producer AB Agri, and UK retailer Sainsbury's. It is funded by the UK taxpayer to the tune of GBP 3m. \n\n\n\nThere is also a related EU-funded Proton project, coordinated by Deep Branch and funded with Euro 2.5m of taxpayer money, which \"intends to support production at scale... validate the nutritional viability of the product, complete the design for the market launch and ensure the necessary IP [intellectual property] protection\".\n\n\n\nThere is much irony in the fact that Deep Branch is hyping its Proton novel protein on the basis that it could replace \"soy, which is mainly imported from South America and has a huge environmental impact\". This is largely GM soy, which the EU imports as animal feed. It does indeed have a huge negative impact, encompassing massive herbicide spraying that poisons rural people and the environment. So in a well worn business model, the biotechnology industry wants to introduce a new product to solve the problems caused by an existing GMO product.\n\n\n\nRaybould's long career working for Syngenta, where his speciality was getting its GMOs approved and boosting their public \"acceptance\", rather than investigating their risks, more than qualifies him for his current leading role in a project aimed at generating public \"acceptance\" of bioreactor-grown feed substances. But it makes him a distinctly unsuitable candidate for a body tasked with giving the government independent advice on whether and how GMOs should be regulated.\n\nDr Ben Raymond is Associate Professor of Microbiology and Entomology at the University of Exeter. He has current research funding from GMO and agrochemical giant Bayer Crop Science and a BBSRC industrial partnership award with Corteva Agriscience. Corteva dominates the CRISPR gene editing patent landscape. According to his ACRE declaration of interests, \"all these projects are exploring ways of increasing the killing power of insect pathogens via artificial selection in the laboratory\". \n\n\n\nHis other current research interests include exploring the biology of B. thuringiensis toxin, the insecticidal toxin expressed in GM Bt crops. He is involved in \"a collaboration with social scientists that is exploring risk assessment frameworks for gene drive technologies in mosquitoes (funded by the British Academy)\". He is co-investigator in a BBSRC LINK-funded project with Oxitec, developer of GM mosquitoes, and is \"exploring risk assessment frameworks for gene drive technologies in mosquitoes (funded by the British Academy)\".\n\n\n\nRaymond describes all his research interests as \"non-commercial\", but they have clear commercial applications and are funded by the GMO and agrochemical industries, as well as public sources like the BBSRC.\n\nPeter Lund is Emeritus Professor of Molecular Microbiology in the School of Biosciences and Institute of Microbiology and Infection at the University of Birmingham. He was involved in the 1990s in attempts to develop GM plants containing antifreeze proteins. Thus far no such GMOs have been commercialised, though attempts by other scientists to engineer such proteins into plants and animals are ongoing. \n\n\n\nLund has held positions on different regulatory and advisory bodies, including the Food Ethics Council, the Advisory Committee on Novel Foods and Processes, and the Health and Safety Executive's Safety Advisory Committee on Genetic Modification. \n\n\n\nHe also \"runs an active research programme funded by BBSRC, the Leverhulme Trust, and the Darwin Trust of Edinburgh\". No details of the programme are given on the University of Birmingham's website but his research interests are described in general as \"how bacteria respond to different stresses in their environment\". It is unclear whether this is GMO work and this should be clarified in his ACRE declaration of interests.\n\n\n\nThe Darwin Trust was founded with royalties from the American multinational pharmaceutical biotechnology company Biogen, though this funding came to an end in 2020-21. The BBSRC, the UK public funding body for science, has employees from the JIC in its Pool of Experts and a Research Committee. The JIC, as explained above (see Prof Jim Dunwell) is heavily oriented towards corporate interests. This matters because together, the BBSRC's Pool of Experts and Research Committees assess funding applications and thus decide what kind of science or technology taxpayer money will support.\n\n\n\nLund leads an EU COST Action research project on \"understanding and exploiting the impact of low pH on micro-organisms\", which is relevant to \"the microbiology of food and drink, many aspects of industrial biotechnology and bio-processing, and clinical and veterinary treatment of infections in a time of increasing antimicrobial resistance\".\n\n\n\nIn sum, it appears that Lund has current career interests in biotechnology applications for various industries, including the pharmaceutical industry.\n\nDr Andrew Wilcox is head of the Crop and Environment Sciences Department at Harper Adams University. He originally trained as a plant ecologist and has expertise in sustainable agriculture and the application of new technologies within agricultural systems. He lists as his sole commercial interest the fact that Syngenta is a partner on BBSRC-supported research project that he is also involved in. \n\n\n\nNot enough information is given in the ACRE declaration of interest to identify whether this is a conflict of interest, but it may be a project to design grass and wildflower seed mixes for planting as buffer strips next to water courses. This does not appear to constitute a conflict of interest with his ACRE role. \n\n\n\nHowever, as a general principle, ACRE should demand more details in order to clarify research aims and any commercial applications in its declarations of interest statements.\n\nDr Kathy Bamford is a consultant medical microbiologist and a specialist in human infection. She has a long list of \"commercial interests\", listed in her ACRE declaration of interests as:\n\n\"* Pfizer, Pharmacia, Wyeth, Gillead [sic; should be Gilead], Baxter, Bayer, Astellas - advisory boards, expert panel, review\n\n* Pharmacia, Baxter - research funding (investigator lead).\"\n\n\n\nThese companies focus on pharmaceutical, not agricultural, applications (with the exception of Bayer, which focuses on both), but there are crossovers in terms of the patented technologies used, such as gene editing and older-style GM. There is also a growing involvement of the pharmaceutical industry in bioreactor manufacturing, a technology that is also being touted for food production (see Alan Raybould, above). In addition, ACRE makes decisions on the safety or otherwise of GMO vaccines, which the companies named above could be involved in developing and marketing.\n\n\n\nBased on the above observations, Bamford's interests and their relationship to role at ACRE should be clarified.\n\nProf Andrew Peters is Professor of Tropical Veterinary Medicine at Edinburgh University. He lists as one of his commercial interests his pension from Pfizer (he was former Head of European Vaccine R&D at Pfizer Animal Health). As with Jim Dunwell's Syngenta pension, whether this is a conflict of interest depends on any terms imposed by the pension agreement.\n\n\n\nHe is involved in the development, as well as the regulation, of veterinary vaccines and works as an independent consultant in this field. He lists as a commercial interest his consultancy work for Ceva, a chicken vaccine company. Another listed commercial interest is his role as director of Arprexas (Scotland) Ltd, which supplies consultants to industry, academia and research institutes involved in \"animal science, veterinary medicine and animal biotechnology\". The company provides \"support… in new product development, lead seeking and knowledge transfer, with special emphasis on vaccines and production medicine\".\n\n\n\nPeters' work for vaccine companies constitutes a conflict of interest since anyone involved in the development of a product should not also be responsible for regulating this type of product. ACRE regulates the release of GMO vaccines. \n\n\n\nGates Foundation funding\n\n\n\nPeters is director of SEBI-Livestock, based at the Royal (Dick) School of Veterinary Studies, University of Edinburgh, which says it provides evidence to \"help the livestock community make better investments that improve livelihoods for smallholders in low and middle-income countries\". \n\n\n\nSEBI-Livestock receives funding from the Bill & Melinda Gates Foundation, which is heavily involved in vaccine development and rollout, as well as in the development and promotion of GMO crops. \n\n\n\nThe Gates Foundation recently appointed new trustees, which it touts as \"strong, independent voices to help shape our governance\". However, the new board has been strongly criticized for its conflicted makeup, as some trustees come from Gates-funded organisations. People in this position clearly cannot be independent or challenge Bill Gates. \n\n\n\nIndeed, GMWatch has been told by university-based academics that they have been ordered by their superiors not to say anything critical about Gates or the GMO products he funds and promotes, because the universities either receive funding from the Gates Foundation or hope to receive such funding in the future. \n\n\n\nGiven these facts, anyone who receives Gates funding should not sit on a regulatory body that oversees the safety of products that Gates funds and promotes.\n\n\n\nAs well as being a member of ACRE, Peters is also a member of the UK DEFRA Veterinary Products Committee (VPC) and is a special adviser on approval of the bovine TB BCG vaccine.\n\nACRE is governed by the UK government’s Code of Practice for Scientific Advisory Committees and Councils, which states, \"Chairs and members must regularly provide the secretariat with a declaration of interests. Members should ask themselves whether the public would reasonably consider that the interest in question might influence them.\" \n\n\n\nThe Code lists the interests that should be declared as private financial or non-financial interests which conflict or may be perceived to conflict with the SAC’s [Scientific Advisory Committee’s] duties. Examples include commercial and research interests, as well as funding secured (past or present) and/or applied for.\n\n\n\nIt stipulates that members should withdraw from discussion of matters in which there may be an existing conflict of interest and that where this occurs, it should be reflected in the record of the meeting.\n\n\n\nBut while the Code focuses on the need for transparency about conflicts of interest, it does not exclude people with conflicts of interest from the committees. The public expects \"independent\" scientific advisors to be free from conflicts of interest. But what they get is people who are transparent about the fact that they have potential or actual conflicts of interest.\n\nAccording to the above analysis, seven out of seven – 100% – of the members of ACRE who give advice to the government on the release of GMOs have potential or actual conflicts of interest with the industries that they are tasked with overseeing, or with other developers and promoters of GMOs, such as the Gates Foundation. The list of their interests reads like a Who's Who of the British biotechnology industry and gives a snapshot of its commercial goals. Their activities and interests are strongly focused on GMO development, rather than on impacts and risks.\n\n\n\nThe use of the term \"potential or actual conflicts of interest\" is carefully considered, since in many cases too little information has been made public to clarify whether the person's interests truly conflict with their advisory role in ACRE.\n\n\n\nHowever, the existing evidence indicates that ACRE is unacceptably biased in favour of industry interests. This makes it likely that in its advice, it will prioritise the commercial interests of GMO developers over and above the public interest.\n\n\n\nThis is not a new problem. Efforts have previously been made to tackle it – including ridding ACRE of a Zeneca (now Syngenta) employee and attempting to make a general purge of members with links to the biotechnology industry. The suggestions for reforms went further, by focusing on expanding the types of expertise represented on the panel. But clearly, no progress has been made in this regard.\n\n\n\nIt is undeniable that the GMO issue is highly technical and that many scientists with relevant expertise will also have industry interests. These scientists should be utilised as a knowledge resource and can act as advisors to the committee. But they must not play a part in decisions on whether or not it is safe to release any given GMO, nor must they be involved in writing the final written ACRE advice on particular GMOs, or any more general ACRE advice on how GMOs should be regulated. \n\n\n\nThe safety evaluation and corresponding advice, as well as advice on the regulation of GMOs, should instead be performed and written by a separate panel of genuinely independent scientists and experts with knowledge of the \"basic science\" involved – but without any relevant industry ties. Relevant expertise includes molecular biology, genetics, toxicology, ecology, public health, farming and agronomy, social sciences, socioeconomics, and ethics. \n\n\n\nIt is a glaring and shocking omission that even though ACRE is entrusted to consider the risks of releasing GMOs into the environment, only one member of its panel (Dr Andrew Wilcox) has expertise in ecology and none appear to have expertise in environmental toxicology. \n\n\n\nMoreover, an appropriately populated ACRE panel of public interest scientists and experts should include people with critical views and people who are actively involved in researching the scientific risks and socioeconomic effects of GMOs. \n\n\n\nIt is not enough to include one or two \"token sceptics\" on a panel of GMO enthusiasts, as, based on reports that GMWatch has received from scientists who have been in such positions, they will feel ignored, humiliated, and/or railroaded into decisions they don't agree with.\n\n\n\nACRE should be disbanded and reconstituted as a genuinely independent body designed to act in the public interest. As a first step, the UK government should not rely upon it to define a subclass of GMOs that are exempted from safety assessments and regulatory oversight.", "opengraph": {"type": "website", "title": "100% of members of UK government's GMO advisory body ACRE have potential or actual conflicts of interest", "url": "https://www.gmwatch.org/en/106-news/latest-news/19999-100-of-uk-government-s-gmo-advisory-body-have-potential-or-actual-conflicts-of-interest", "description": "\r\nList of interests reads like Who's Who of the British biotechnology industry. Report: Claire Robinson\r\n", "image": "https://www.gmwatch.org/images/banners/Conflict-sign-1200x628.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://parliamentlive.tv/event/index/8000b1d3-24ef-4e7c-a547-984f1fff25f3", "https://www.gov.uk/government/organisations/advisory-committee-on-releases-to-the-environment/about/our-governance", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://uk.linkedin.com/in/jim-dunwell-a9664723", "http://www.dailymail.co.uk/news/article-2581387/Scientists-hidden-links-GM-food-giants-Disturbing-truth-official-report-said-UK-forge-Frankenfoods.html", "https://powerbase.info/index.php/John_Innes_Centre", "https://www.reading.ac.uk/apd/staff/j-m-dunwell.aspx", "https://worldwide.espacenet.com/patent/search/family/038269093/publication/EP1972692A1?q=dunwell%20james%20martin", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.ed.ac.uk/profile/alan-raybould", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.sps.ed.ac.uk/staff/alan-raybould", "https://biocity.co.uk/deep-branch-bio-launches-with-3million-innovate-uk-funded-project/", "https://www.innogen.ac.uk/people", "https://biocity.co.uk/deep-branch-bio-launches-with-3million-innovate-uk-funded-project/", "https://biocity.co.uk/deep-branch-bio-launches-with-3million-innovate-uk-funded-project/", "https://cordis.europa.eu/project/id/101010113", "https://sbrc-nottingham.ac.uk/news/deep-branch-press-release.aspx", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.testbiotech.org/en/news/increasing-number-patents-food-plants-and-new-ge", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://pubmed.ncbi.nlm.nih.gov/1932678/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6691018/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.birmingham.ac.uk/staff/profiles/biosciences/lund-pete.aspx", "https://darwintrust.bio.ed.ac.uk/uploads/files-zP2Apu5hqSYmsbzSH-Final%20accounts%20-%202021%20fully%20signed.pdf", "https://bbsrc.ukri.org/about/governance-structure/committees/pool-of-experts/", "https://bbsrc.ukri.org/about/governance-structure/committees/committee-b/", "https://powerbase.info/index.php/John_Innes_Centre", "https://bbsrc.ukri.org/about/governance-structure/committees/", "https://euromicroph.eu/news/", "https://euromicroph.eu/about/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwiM6N3un771AhVZhlwKHXTUB9gQFnoECAMQAQ&url=https%3A%2F%2Fwww.nlaf.uk%2FLibrary%2FGetDoc.axd%3FctID%3DZWVhNzBlY2QtZWJjNi00YWZiLWE1MTAtNWExOTFiMjJjOWU1%26rID%3DMTM0MjA%3D%26pID%3DMjI5%26attchmnt%3DFalse%26uSesDM%3DFalse%26rIdx%3DNzgwNw%3D%3D%26rCFU%3D&usg=AOvVaw3yjeWxCEHU6vu7usEoc4g6", "https://www.nature.com/articles/nbt0210-107", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://sebi-livestock.org/about-us/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044812/acre-members-interests.pdf", "https://www.ceva.com/Products/Poultry/Innovative-Hatchery-Vaccines", "https://www.arpexas.co.uk/", "https://www.gov.uk/government/publications/acre-advice-application-for-a-trial-of-a-gm-vaccine-against-typhoid-and-ecoli-15r4701ni) as part of its mandate (https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwiPm5_n4KL2AhWhnVwKHad-BCYQFnoECAIQAQ&url=https%3A%2F%2Fassets.publishing.service.gov.uk%2Fgovernment%2Fuploads%2Fsystem%2Fuploads%2Fattachment_data%2Ffile%2F239574%2Facre-advice-aids-vaccine-initiative.pdf&usg=AOvVaw1FZPeSnpMYt_D9J-8IRyaR", "https://sebi-livestock.org/our-work/", "https://sebi-livestock.org/about-us/", "https://www.gatesfoundation.org/ideas/media-center/press-releases/2010/01/bill-and-melinda-gates-pledge-$10-billion-in-call-for-decade-of-vaccines", "https://www.gatesfoundation.org/our-work/programs/global-health/vaccine-development-and-surveillance", "https://www.scientificamerican.com/article/bill-gates-should-stop-telling-africans-what-kind-of-agriculture-africans-need1/", "https://www.thenation.com/article/society/gates-foundation-board-accountability/", "https://www.arpexas.co.uk/", "https://www.gov.uk/government/publications/scientific-advisory-committees-code-of-practice/code-of-practice-for-scientific-advisory-committees-and-councils-copsac-2021", "https://archive.ph/YwFO1"], "authors": ["Editor2"], "publish_date": "2022-03-02T17:01:28+00:00"}