{"result_id": "137018", "URL": "https://www.gmwatch.org/en/news/archive/2001/2479-hans-herren-on-golden-rice", "timestamp": "2023-04-25 15:18:23 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/news/archive/2001/2479-hans-herren-on-golden-rice", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Hans Herren on Golden Rice", "cleaned_text": "\"We already know today that most of the problems that are to be addressed via Golden Rice and other GMOs can be resolved in matter of days, with the right political will.\" -- Hans Herren\n\nHans Herren is the Kenyan-based Director of the International Centre of Insect Physiology and Ecology. He is a world renowned expert on biological control. In 1995 he won the World food prize after he and his team got control over the cassava mealy bug, that was endangering the cassava, a staplecrop in large areas of Africa, and threatening some 300 million people.\n\nAs Florianne Koechlin has noted, Herren got control over the bug with the help of a small wasp””without chemistry or biotechnology, and without any extra costs for the farmers.\n\nAccording to Koechlin, Hans Herren says: “Today, I probably would not get the money for such a big programme. Today, all funds go into biotechnology and genetic engineering. The genetic people would try to construct a cassava that is resistant against the mealy-bug. Biological pest-control, as we do it here at the ICIPE, is not as spectacular, not as sexy. I see a big problem here.”\u009d ‘ http://members.tripod.com/~ngin/179.htm\n\n---\n\nThe question here is: at what/whose cost will the Golden Rice (and for that matter any biotech product/solution) be further developed? Given the shortage of funding for research, capacity building and development (implementation) I would like to suggest that should any further development in the biotech (read GE for Golden rice, Bt maize, cotton etc....) continue, it must be from private sector funds only, that it must be additional to presently available funding for development issues, and that the private sector matches dollar for dollar costs for independent evaluation of new technologies/products and for all environmental and health impact studies.\n\nNone of this necessary research should be funded from public funds, as at the end of the day it is the private sector whom will benefit from selling the technology, should it prove to be of social, economical and environmental value to humanity. We already know today that most of the problems that are to be addressed via Golden Rice and other GMOs can be resolved in matter of days, with the right political will. The problem is not scientific, it is social and economical. It is of a nature that requires a bit of courage from the political establishment, which unfortunately is totally lacking. The public at large in the industrialized countries is also to blame, to prefer short term tax breaks and extra luxuries to few sacrifices for an assurance of a sound world for all of its children. If our fathers had had as little foresight as our own generation of (so called) leaders today, most of us would not even be here today to lament over this state of affairs. The greed that has brought us the pesticides that were marketed without proper testing, BSE and now the new miracle crops, will bring more of the same disasters under different incarnation......\n\nA good example for misguided investment is in vaccine research, malaria and others, whereby millions die every year, with no hope for any improvement, because the simple activity of reducing the source of the infection, i.e., the mosquito, has been forgotten. The development of an effective vaccine, just as the development of new miracle crop varieties, does not automatically solve the problem, the social and economical constraints are often far more difficult to overcome, and so need to be given far more attention. No one seems to be learning form the past experiences, be it the green revolution or the yellow fever vaccine, or untold others, all great achievements at first glance, but with meager results, once all has been considered.\n\nSad indeed, and what have we learned?\n\n[forwarded to AgBioView by Klaus Ammann <This email address is being protected from spambots. You need JavaScript enabled to view it. >]", "opengraph": {"type": "website", "title": "Hans Herren on Golden Rice", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/40-2001/2479-hans-herren-on-golden-rice"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://members.tripod.com/~ngin/179.htm"], "authors": [], "publish_date": "2001-02-18T00:00:00+00:00"}