{"result_id": "137036", "URL": "https://gmwatch.org/en/news/archive/2004/6188-qpa-theres-pig-vaccine-in-my-corn-breadqand-gm-pigs-in-the-feed", "timestamp": "2023-04-25 15:18:32 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/news/archive/2004/6188-qpa-theres-pig-vaccine-in-my-corn-breadqand-gm-pigs-in-the-feed", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "\"Pa, There's Pig Vaccine In My Corn Bread!\"/And GM pigs in the feed!", "cleaned_text": "1.\"Pa, There's Pig Vaccine In My Corn Bread!\"\n\n2.And GM pigs in the feed\n\n---\n\n\"Pa, There's Pig Vaccine In My Corn Bread!\"\n\nBy Jim Scanlon\n\nCoastal Post Online, March, 2004\n\nhttp://www.coastalpost.com/04/03/11.htm\n\nNature Biotechnology, one of the most prominent and prestigious scientific journal in the world has accused a number of biotechnology companies or provoking a suicidal tussle with environmental opponents, exposing themselves to charges of highhandedness, negligence and unnecessary commercial risk.\n\nThe row concerns the insistence of producing pharmaceutical drugs in plants used by humans for food. Why use food plants which might be accidentally contaminated with genetically modified material, when other, non food plants are available? That is, pharmaceuticals cold inadvertently find their way into food and feed crops through mix ups (as with StarLink Corn in the USA) or through pollen born gene flow.\n\nNature referred to an incident when non modified soy beans and corn were contaminated with corn engineered to produce an experimental pig vaccine. The journal expressed the opinion that concern about potentially toxic substances in food is not \"antiGM\" (anti-genetic modification)\" After all is this really so different from ...manufacturers packaging pills in candy wrappers or flour bags [and] storing its compounds ... outside the perimeter fence?\n\nNature accuses the biotech industry and some of its supporters of taking a stand that is principled and libertarian rather than sensible. \"They argue there is an unalienable right for every corporation to develop whichever technology it wants ...whenever it wants. The specific right in question is the right to grow drug containing corn crops in the US corn belt.\"\n\nIn language bordering on insult and sarcasm, Nature states, \"It seems that an industry in which the Ph.D. is the intellectual norm is either incapable of learning a simple lesson from the past, or cannot bring itself to act appropriately, despite what it has learned previously\".\n\nIt is rare indeed for a scientific journal dedicated to an industry to so forcefully criticize that industry.\n\nNature advises, \"Let's grow pharma plants, but let those plants be Arabidopsis, or flax, or duckweed.\"\n\n---\n\nTHE carcasses of three genetically modified pigs have accidentally ended up in animal feed in Canada.\n\nHealth officials seized 800 tonnes of feed after the alarm was raised on 11 February, but not before some 1 per cent of the contaminated material had been given to chicken and swine in Ontario and Quebec. The pigs, all female, came from TGN Biotech in Quebec, a research company that engineers male pigs to produce therapeutic proteins in their semen, for use in human and veterinary medicine.\n\nFemales cannot make the protein but do carry the extra genes in their DNA. The three dead animals should have been sent for incineration, but according to TGN Biotech president Jean- Francois Huc, a forklift driver missed their ID tattoos, ear tags and microchips. Huc argues that the heat used during the production of animal feed is likely to have destroyed any DNA in the meat, and health officials insist the contaminated feed poses no health risk. But anti-GM activists, including Greenpeace, have criticised the Canadian government and biotech industry, saying the incident demonstrates a lax attitude to the rules against releasing unapproved genetic material. A similar mistake has been made before. Two years ago, 11 transgenic piglets from the University of Guelph in Ontario were turned into feed and given to chickens. No charges were laid, nor are any expected in this case.", "opengraph": {"type": "website", "title": "\"Pa, There's Pig Vaccine In My Corn Bread!\"/And GM pigs in the feed!", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/43-2004/6188-qpa-theres-pig-vaccine-in-my-corn-breadqand-gm-pigs-in-the-feed"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share"], "authors": [], "publish_date": "2004-03-04T21:41:18+00:00"}