{"result_id": "137029", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19682-gm-spin-doctors-are-using-coronavirus-vaccines-to-promote-gm-crops", "timestamp": "2023-04-25 15:18:29 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19682-gm-spin-doctors-are-using-coronavirus-vaccines-to-promote-gm-crops", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "GMO spin doctors are using coronavirus vaccines to promote GM crops", "cleaned_text": "Exploiting the pandemic to market GM crops makes little sense. Report: Jonathan Matthews and Claire Robinson\n\n\n\nWith over 2 million dead, and countries as developed as the UK and the USA failing miserably to contain the virus, it’s understandable that many see vaccines as a silver bullet that can save the world from the illness and death, never mind the social isolation and economic collapse, that the current pandemic is leaving in its wake. It’s perhaps equally unsurprising that hard pressed promoters of GM crops and animals are seeing this as an ideal marketing opportunity.\n\n\n\nCharles hates GM. Will he spurn this vaccine? ran a headline in the Sunday Times to an article that declared, “Pfizer shows us genetic modification could protect humanity from Covid-19.” Its author, Dominic Lawson, lambasts the heir to the UK throne for his well known opposition to GM crops, and claims that it is politics, rather than science, that can “obstruct or even deny society the full benefits of scientific breakthroughs. This is true of genetic modification more widely.”\n\n\n\nLawson’s thesis is somewhat undermined by his record as a rightwing idealogue who has long argued against the scientific consensus on climate change. There’s also the little matter of the Pfizer vaccine being chemically synthesised rather than genetically engineered. In other words, contrary to Lawson’s claim, the Pfizer vaccine is not in any sense “GM”.\n\n\n\nBut Lawson is far from the only GM spin doctor trying to use vaccines for COVID-19 as a validation of GM crops and animals. Lawson’s sometime ally Mark Lynas is at it too, albeit with a tad more accuracy as regards the Pfizer vaccine, using his perennial gimmick of smearing all GM crop critics as anti-science.\n\n\n\nAlso at it is Bill Horan, a former board member of the National Corn Growers Association and an advocate for genetically engineering pharmaceuticals into corn (what could possibly go wrong?). “The science of GM technology may save my life. That’s because I’m about to get my COVID-19 vaccine,” Horan breathlessly tells us. Yet in the United States, where Horan farms, only two vaccines are currently authorised: Pfizer’s and Moderna’s. Like Pfizer's, Moderna’s vaccine is chemically synthesised and not genetically engineered, i.e. whichever vaccine Horan gets, it will not be GM.* But that doesn’t stop him using his upcoming appointment as the springboard for an extravagantly inaccurate article about the many wonders of GM crops.\n\n\n\nAnd then there’s former vice president of the National Farmers Union (NFU) and founder of the European Biotech Forum, Paul Temple, who writes: “New genetic technology has been welcomed, with the incredible speed of vaccine development. The crisis of COVID-19 would be worse than it already is if we had not had this technology adopted and accepted in its use. The same technologies that have produced amazing genetic advances in agriculture, are now supplying us with the vaccine that will allow us to manage COVID-19 on a global basis.”\n\n\n\nEverything about this is cockeyed. Temple implies that these vaccines were developed using technologies first developed for crops and that are now being applied for medical use. This is a joke. Only some of the vaccines (most obviously, the AstraZeneca one and the Russian vaccine) have been developed using any form of genetic engineering. And vaccine developers have not adopted “agbiotech” to develop their products but have simply used pre-existing medical technologies. Genetic technologies upon which some of the COVID-19 vaccines are based began to be developed in the late 1980s and have always been on a path that is completely independent of GM crops. In fact, if anything, advances in molecular genetics and genetic technologies for medical research and clinical use have been exploited by GM crop developers and not the other way round. \n\n\n\nJust as importantly, medical uses of GM technologies are completely different from their uses in agriculture. They are partly governed by different rules and the culture of medical research is highly safety conscious. Medicines are strictly regulated for safety and must go through lengthy safety and efficacy tests before they are allowed to be used on people, and they are also monitored post-release. Even with these safeguards in place, there are often side-effects and we know that things can still go wrong – but at least there is a system in place to try to ensure safety.\n\n\n\nAnd crucially, medicines are used on people for very specific conditions and only with their informed consent, so that people can weigh the benefits against any risks. In contrast, GM crops and foods are subjected to minimal safety checks and the UK government is even trying to remove these. \n\n\n\nWhat is more, the UK government is trying to remove informed consent regarding planting GM gene-edited seeds and eating GM gene-edited foods, in that these products will probably not be labelled if they are removed from regulation. It’s also worth noting, by the way, that none of the vaccines the GM promoters are jumping up and down about involve gene editing, which is the focus of the UK government’s current obsession with deregulation.\n\n\n\nAnd gene-edited crops and foods could turn out to contain new toxins or allergens. So safety checks are a vital protection for health, as well as the environment. Just as GM medicines are regulated, so GM crops and foods should be regulated too before being released into our fields and onto our plates.\n\n\n\nIf Paul Temple is trying to make us believe that GM crops have “produced amazing genetic advances in agriculture”, this is far from obvious. Detailed comparisons of yields and pesticide use between the United States, where GM crops have been widely adopted, and Europe, where they haven’t, show Europe has done as well or better on both scores without them.\n\n\n\nAnd there is certainly no sign that gene editing is about to change that picture. There is not one gene-edited crop that improves performance. And the first commercialised gene-edited crop, Cibus’s SU Canola, is gene edited to survive being sprayed with herbicide, which is the most common type of old-style GM crop too. So in spite of the hype about “amazing genetic advances”, there is precious little evidence to support it.\n\n\n\nFinally, we shouldn’t forget that there is a massive difference between tackling a pandemic where, despite all its wide-ranging global consequences, the target is a single virus, and the breadth and complexity involved in delivering sustainable agriculture around the world, where the cult of the quick fix has been shown time and again to be a dangerous delusion that distracts major resources and attention away from more viable long-term solutions. \n\n\n\n\n\n* The operative word here in \"genetically modified organism\" is \"organism\". The Pfizer vaccine mRNA material is chemically synthesised and is not an organism. Thus the vaccine is not a GMO.\n\nArticle updated 6 February 2021 to include details of the Bill Horan article.", "opengraph": {"type": "website", "title": "GMO spin doctors are using coronavirus vaccines to promote GM crops", "url": "https://www.gmwatch.org/en/106-news/latest-news/19682-gm-spin-doctors-are-using-coronavirus-vaccines-to-promote-gm-crops", "description": "\r\nExploiting the pandemic to market GM crops makes little sense. Report: Jonathan Matthews and Claire Robinson\r\n", "image": "https://www.gmwatch.org/images/banners/DNA_Corona_Virus_and_Needle.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.thetimes.co.uk/article/charles-hates-gm-will-he-spurn-this-vaccine-cbtjkvf32", "https://www.desmog.co.uk/dominic-lawson", "/en/news/latest-news/15938", "https://allianceforscience.cornell.edu/blog/2020/12/yes-some-covid-vaccines-use-genetic-engineering-get-over-it/", "https://commonreader.wustl.edu/c/the-dubious-virtue-of-apostasy/", "/en/news/archive/2004/7970-the-truth-about-truth-about-trade", "https://www.thenation.com/article/archive/three-mile-island-biotech/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines.html", "https://globalfarmernetwork.org/2021/02/covid-19-vaccine-is-a-science-based-technology-life-saver/", "/en/news/archive/2006/2128", "https://globalfarmernetwork.org/2021/01/science-based-free-flowing-trade-benefits-the-world/", "https://www.tandfonline.com/doi/full/10.1080/14735903.2013.806408#.UcDJUxYlwd2", "https://www.nytimes.com/2016/10/30/business/gmo-promise-falls-short.html", "https://www.scientificamerican.com/article/farm-protests-in-india-are-writing-the-green-revolutions-obituary/", "http://pages.wustl.edu/files/pages/imce/stone/stone_2019_green_rev.pdf", "/en/news/archive/2008/10474-iaastds-new-and-improved-green-revolution"], "authors": ["Editor2"], "publish_date": "2021-02-03T11:07:46+00:00"}