{"result_id": "137045", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19890-lab-grown-meat-is-vapourware-expert-analysis-shows", "timestamp": "2023-04-25 15:18:36 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19890-lab-grown-meat-is-vapourware-expert-analysis-shows", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Lab-grown meat is vapourware, expert analysis shows", "cleaned_text": "Cell-cultured meat is \"a fable driven by hope, not science, and when the investors finally realise this the market will collapse\"\n\nLab-grown meat is supposed to be inevitable – but the science tells a different story, concludes a long but incisive article by Joe Fassler in The Counter. The article confirms what we've long said about lab-grown fake meat – that it's too expensive, impractical, energy-hungry, and dangerous to scale up, and will never make financial or environmental sense.\n\n\n\nBut the article goes much further, in that it provides the data and independent expert analysis that so far have been absent from all media articles about this topic. After reading this article, the author and journalist Tom Philpott, who dug into the same topic himself in a recent piece that concluded lab-grown meat was largely hype, tweeted that he was now “convinced that lab-grown meat… is basically vapourware”.\n\n\n\nHere are key points from the article that led to that conclusion:\n\n\n\n* David Humbird is a UC Berkeley-trained chemical engineer who spent over two years researching a report on lab-grown meat funded by Open Philanthropy, a research and investment entity with a nonprofit arm. He found that the cell-culture process will be plagued by extreme, intractable technical challenges at food scale. In an extensive series of interviews with The Counter, he said it was “hard to find an angle that wasn’t a ludicrous dead end.”\n\n\n\nHumbird likened the process of researching the report to encountering an impenetrable “Wall of No” — his term for the barriers in thermodynamics, cell metabolism, bioreactor design, ingredient costs, facility construction, and other factors that will need to be overcome before cultivated protein can be produced cheaply enough to displace traditional meat. \n\n\n\n“And it’s a fractal no,” he said. “You see the big no, but every big no is made up of a hundred little nos.”\n\n\n\n* Open Philanthropy appears to have \"buried\" the report it funded Humbird to carry out. This is possibly because it continues to fund “efforts to help the food industry transition from suffering-intense factory farming\", including the Good Food Institute (GFI), a nonprofit that represents the alternative protein industry and hypes the potential of lab grown meat.\n\n\n\n* Using large, 20,000 L bioreactors would result in a production cost of about $17 per pound of meat, according to Humbird's analysis. Relying on smaller, more medium-efficient perfusion reactors would be even pricier, resulting in a final cost of over $23 per pound.\n\n\n\nBased on Humbird’s analysis of cell biology, process design, input expenses, capital costs, economies of scale, and other factors, these figures represent the lowest prices companies can expect. And if $17 per pound doesn’t sound too high, consider this: The final product would be a single-cell slurry, a mix of 30 percent animal cells and 70 percent water, suitable only for ground-meat-style products like burgers and nuggets. With markups being what they are, a $17 pound of ground cultivated meat at the factory quickly becomes $40 at the grocery store—or a $100 quarter-pounder at a restaurant. Anything resembling a steak would require additional production processes, introduce new engineering challenges, and ultimately contribute additional expense.\n\n\n\n* Humbird concluded, “Clearly, I don’t think cultured meat has legs... it seems like a bunch of hooey to me.”\n\n\n\n* Regarding the high potential for contamination in bioreactor technology, Humbird said, “There are documented cases of, basically, operators getting the culture sick. Not even because the operator themselves had a cold. But there was a virus particle on a glove. Or not cleaned out of a line. The culture has no immune system. If there’s virus particles in there that can infect the cells, they will. And generally, the cells just die, and then there’s no product anymore. You just dump it.”\n\n\n\n* Humbird said we already know enough to point out a basic, sobering contradiction: “You can make a big plant, or you can make a clean plant. So if you want to feed millions and millions of people, it’s got to be big. But if you want to do it with animal cells, it’s got to be clean. We need both, and you can’t do that.”\n\n\n\n* Even at a projected cost of $450 million, one hypothetical cultured meat factory wouldn’t come much cheaper than a traditional slaughterhouse — but it would produce a lot less meat.\n\n\n\n* Huw Hughes, a private consultant who helps biomanufacturers design and project costs for their production facilities, commented on the massive costs of cell culture medium ingredients used to grow lab grown meat: “They say, oh, but these costs are just going to go away in five years or 10 years. And there’s no explanation as to how or why.”\n\n\n\n* The truth is that for cultured meat to move the needle on climate, a sequence of as-yet-unforeseen breakthroughs will still be necessary. We’ll need to train cells to behave in ways that no cells have behaved before. We’ll need to engineer bioreactors that defy widely accepted principles of chemistry and physics. We’ll need to build an entirely new nutrient supply chain using sustainable agricultural practices, inventing forms of bulk amino acid production that are cheap, precise, and safe. Investors will need to care less about money. Germs will have to more or less behave. It will be work worthy of many Nobel prizes — certainly for science, possibly for peace. And this expensive, fragile, infinitely complex puzzle will need to come together in the next 10 years.\n\n\n\nOn the other hand, none of that could happen.\n\n\n\n* Former pharmaceutical industry executive Paul Wood, former executive director of global discovery for Pfizer Animal Health, who oversaw vaccine production in bioreactors, said of lab grown meat, “To me this sounds like the story of the Emperor’s Clothes. It’s a fable driven by hope, not science, and when the investors finally realise this the market will collapse.”\n\n\n\n* Neil Renninger, a chemical engineer who is on the board of Ripple Foods, a dairy alternatives company that he co-founded, and who previously ran Amyris, a biotechnology company that uses fermentation to produce rare molecules, said he finds it “frustrating” to see so many resources going into cultured meat: “It is a zero-sum game, to a certain extent. Money we spend chasing cultured meat is money we can’t use on converting coal plants to biomass, or scaling solar and wind, or modernizing concrete and steel.\"\n\n\n\n* There’s a reason that the US government employs people like Humbird to do rigorous due diligence on attractive new ideas. When billions are spent on science that doesn’t come together, the biggest losers aren’t really the private companies and trade associations, or the class of professional investors who get rich on speculative tech. Instead, the public loses out — and we lose time we don’t have.\n\n\n\nAs Humbird put it, “If society pays for it and it doesn’t work out, then society’s left holding the bag.”\n\n\n\n* The environmental ravages we face are vast, destabilizing, and encroaching on our real lives right now. The fires, the floods, are already at our door. In all this, it would be so good to know we have a silver bullet. But until solid, publicly accessible science proves otherwise, cultured meat is still a gamble — a final trip to the casino, when our luck long ago ran out. We should ask ourselves if that’s a chance we want to take.", "opengraph": {"type": "website", "title": "Lab-grown meat is vapourware, expert analysis shows", "url": "https://gmwatch.org/en/106-news/latest-news/19890-lab-grown-meat-is-vapourware-expert-analysis-shows", "description": "\r\nCell-cultured meat is \"a fable driven by hope, not science, and when the investors finally realise this the market will collapse\"\r\n", "image": "https://gmwatch.org/images/banners/Laboratory-bioreactor_1200x628.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://thecounter.org/lab-grown-cultivated-meat-cost-at-scale/", "/en/news/latest-news/19282", "https://www.motherjones.com/food/2021/08/is-lab-meat-about-to-hit-your-dinner-plate/", "https://twitter.com/tomphilpott/status/1441024876488183817"], "authors": ["Editor2"], "publish_date": "2021-09-26T09:05:14+00:00"}