{"result_id": "137031", "URL": "https://www.gmwatch.org/en/component/content/article/13315", "timestamp": "2023-04-25 15:18:30 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/component/content/article/13315", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "REVIEW number 312", "cleaned_text": "Claire < This email address is being protected from spambots. You need JavaScript enabled to view it. >\n\nThe recently broadcast German documentary, 'The silence of the Pandas', exposed WWF's close ties with corporations, including Monsanto. The film showed how WWF has partnered with Monsanto in the Round Table on Responsible Soy (RTRS), an industry greenwash forum which certifies GM soy sprayed with glyphosate herbicide as \"responsible\". The film, which examines the terrible health effects of GM soy production in South America, has caused shockwaves in Germany and many donors have reportedly withdrawn their support for WWF. An article about the documentary quotes Hartmut Vogtmann, head of the Deutscher Naturschutzring (German League for Nature Conservation and Environmental Protection), as saying that the RTRS, co-founded by the WWF, is \"artificially keeping a failed system of agriculture alive\".\n\nEnglish subtitled interview with Wilfried Huismann, the maker of the documentary 'The silence of the Pandas':\n\nThe biotech industry-backed lobby group ISAAA and ICRISAT (International Crops Research Institute for the Semi-arid Tropics) ran a training course in India for the media called 'Demystifying crop biotechnology: Issues and concepts for the Asian media'. ISAAA board members include representatives of Monsanto, Syngenta, and the AusBiotech Alliance. The Chair of ICRISAT's Governing Board is one Nigel Poole, who was once the public face of GM tomato paste.\n\nA new study conducted in India's cotton belt, Vidarbha, shows that the economic benefits or risks of growing Bt cotton vary according to how it is grown. The main beneficiaries appear to be the small minority of farmers who grow Bt cotton as a stand-alone crop. The experience of small and marginal farmers, who usually intercrop cotton on rainfed land, is less positive. Bt cotton seeds are more expensive than other varieties of cotton, and these farmers' expenditure on chemical pesticides was also higher. The authors add that \"variability in production was also higher for Bt cotton than for other types of cotton.\" These factors could place small and marginal farmers, who may already be encumbered with debt, in a very vulnerable position.\n\n+ THE HUMAN COST OF THE WAR ON SUPERWEEDS\n\nA comprehensive new report from GM Freeze and Greenpeace International links Roundup herbicide to cancer, birth defects and water pollution – and says its use in public parks and on agricultural crops is a danger to public health. The report analyses almost 200 independent and peer-reviewed scientific studies, mostly carried out in the last decade, to demonstrate that Roundup is far from benign. Evidence shows that the chemical has a damaging impact on our rivers and on the animals that live in them. It disrupts nutrients in soil, exposing plants to disease, and could end up contaminating drinking water. With the spread of GM Roundup Ready crops, the amount of Roundup applied worldwide is escalating, increasing the toxic burden on humans and the environment.\n\nIndustry tests showed back in the 1980s that Roundup causes birth defects (Earth OPen Source report):\n\nArticle in The Ecologist on both reports:\n\n+ TAKE ACTION TO ROUND UP GLYPHOSATE\n\nIn late 2010 the European Commission postponed for three years a badly needed safety review of Roundup's active ingredient glyphosate and 38 other chemicals. GM Freeze believes the scientific evidence is so strong that a fully independent review should be conducted immediately. Please write to your MP and/or MEPs and ask them to press for this safety assessment to be retabled urgently.\n\n+ NO ONE IS BUYING WESTERN AUSTRALIA'S GM CANOLA\n\nWestern Australia's agriculture minister has admitted in Parliament that none of the GM canola grown in Western Australia last year has been sold, sparking renewed calls for an inquiry into the lifting of the moratorium on GM canola from Greens spokesperson on GMOs Lynn MacLaren. Ms MacLaren says \"When lifting the moratorium, Agriculture Minister Terry Redman claimed that the introduction of GM canola would have no impacts on markets – this revelation raises serious questions about that claim.\n\n\"95% of WA's canola went to Europe last year – a market with no tolerance for GM canola. Canola is an open pollinated crop, so now that GM canola has been introduced in the state it is only a matter of time before our non-GM shipments get contaminated and start being rejected. Canada completely lost its canola exports to Europe and WA risks the same thing happening here if it continues down the GM path,\" added Ms MacLaren.\n\nAustralian wheat farmers stand to lose billions of dollars if the CSIRO's trials of GM wheat are allowed to continue, Greenpeace says. \"The economic implications of GM wheat are dire,\" Greenpeace spokeswoman Laura Kelly said, since every one of Australia's global wheat market competitors, including Canada and Europe, had rejected the crop.\n\nTAKE ACTION: Tell the Australian Government you won't swallow GM bread:\n\nA group of prominent scientists and researchers from around the world has urged Australia not to go ahead with human trials of GM wheat. The CSIRO is carrying out a study of feeding GM wheat on rats and pigs and could extend the trial to humans. The eight scientists and academics believe not enough studies have been done on the effects of GM wheat on animals to warrant human trials.\n\nGM wheat will worsen hunger and hurt farmers, because it comes with expensive patent fees and restrictive contracts, writes Kumi Naidoo of Greenpeace International.\n\nThe biotech takeover of our daily bread\n\nTell the Australian Government that you won't swallow GM bread. PEOPLE IN ANY COUNTRY CAN SUPPORT THIS PETITION.\n\nThe European Parliament has voted to strengthen a draft EU law, giving member states a new right to ban GM crops from being grown in their territories. The Parliament voted to:\n\n* Strengthen the draft legislation by recognising environmental grounds for bans, including the development of herbicide resistant weeds and biodiversity impacts.\n\n* Allow bans where a lack of information prevents thorough safety testing. GM seed companies are notoriously secretive about their products.\n\n* Changing the legal basis of bans from trade to environment, making any ban based on environmental grounds more robust if challenged in court.\n\n* Oblige biotech companies to give access to material necessary for independent research into GM risks.\n\n* Have all countries take mandatory measures against GM contamination. In the event these measures fail, governments should ensure that those responsible pay damages.\n\n* Call again on the European Commission to fully implement an earlier unanimous call by environment ministers to improve safety testing of GM crops at European level.\n\n* Ensure that the precautionary principle is embedded in the right to ban.\n\n* Give regions the right to ban GM crop cultivation.\n\nThe law still needs approval from a qualified majority of member states.\n\n+ BASF PULLS THE PLUG ON NEW GM CROP DEVELOPMENT IN THE EU\n\nBASF Plant Sciences has decided not to develop GM crops for the European market. In an email to a member of the public, Britta Stellbrink, BASF communications manager, wrote that due to \"the difficult political situation GMO crops face in Europe,\" the company \"decided some time ago to not initiate any new projects that are focused exclusively on the European market.\" BASF's Amflora potato has faced stiff opposition in Europe.\n\nA French court has acquitted eight defendant Volunteer Reapers of GM crops (including Jose Bove, a \"repeat offender\") and dismissed Monsanto's financial demands. The trial marked the third court victory for Volunteer Reapers (les Faucheurs Volontaires).\n\nAn application to field test a GM wheat in the UK should be rejected by Defra, say GM Freeze, because there is no scientific or agricultural justification for it and no market willing to buy it. The groups says the GBP1.28 million in public money already poured into the crop by the Biotechnology and Biological Sciences Research Council should have been better spent.\n\nThe USDA has exempted GM bluegrass from federal regulation. The USDA said that a glyphosate-tolerant Kentucky bluegrass being developed by Scotts Miracle-Gro was not subject to federal regulation because its creation did not entail use of any plant pests. The decision frees Scotts to sell the grass, which is meant for lawns, without federal approval. The company also does not need federal permits to conduct field trials, even though a different type of GM grass escaped from company test plots in the past and established itself in the wild.\n\nGMWatch comment: The US is widely regarded as having a lax regulatory regime for GM crops. But this latest move by the USDA looks set to substantially weak the regime even further. What makes this particularly ominous is that the crop the USDA has chosen to exempt from federal regulation is common in pastures in many parts of the US, so it will add to the growing problem of contamination of organic agriculture, which GM alfalfa is already set to worsen.\n\nThat this deregulatory decison is based in political expediency rather than science is emphasised by the fact that even the USDA-APHIS assessment tool showed there's a high chance bluegrass will be a noxious weed, but they then went to great lengths to dismiss their own analysis!\n\nThe USDA's deregulation of Scotts' GM bluegrass may portend a major change in how the federal regulators will deal with GM crops, writes Tom Philpott in Grist. A 1950s-era law called the Plant Pest Act gave the USDA power to restrict the introduction of organisms that might harm plants. GM crops technically qualified as \"plant pests\" because industry scientists used DNA \"promoters\" derived from natural plant pathogens, most notably cauliflower mosaic virus, to amplify the genetic traits they introduced into new crops. These promoters ensure that the desired trait is always 'on', that is, expressed.\n\nBut the GM bluegrass does not contain any pest components, so Scotts was able to tell the USDA that it \"is not a regulated article\". So industry gets free rein to plant the GM grass wherever it wants, and the courts cannot intervene because it is not defined as a plant pest. Dr Doug Gurian-Sherman of the Union of Concerned Scientists says the industry has begun routinely using non-pest material to develop GM crops. \"If the companies don't use plant pests, then the USDA ostensibly doesn't have a legal hook to regulate the crops,\" he says.\n\n+ U.S. ENDS OPPOSITION TO GM LABELING GUIDELINES – VICTORY FOR CONSUMERS\n\nThe US delegation to Codex, the UN/World Health Organisation food safety body, has dropped its opposition to the GM labelling guidance document, allowing it to move forward and become an official Codex text.\n\nThe new Codex agreement means that any country wishing to adopt GM food labelling will no longer face the threat of a legal challenge from the World Trade Organization (WTO). This will have immediate implications for consumers. Edita Vilcapoma of the Peruvian consumer group ASPEC, representing Consumers International at the Codex meeting in Geneva, said:\n\n\"Peru's recent introduction of GM food labelling faced the threat of a legal challenge from the WTO. This new Codex agreement now means that this threat has gone and the consumer right to be informed has been secured. This is major victory for the global consumer movement.\"\n\n+ U.S.: BAYER TO PAY $750M IN GM RICE SETTLEMENT\n\nBayer CropScience has agreed to pay up to $750 million to settle several lawsuits with US farmers who claimed a strain of the company's unapproved GM rice contaminated the food supply and hurt their crop prices. The litigation goes back to 2006, when an experimental strain of GM rice was found in US food supplies.\n\nThe Obama administration's top antitrust officer, Christine Varney, is stepping down after two and a half years. She will join a large Washington, DC, law firm. Last year, Varney and secretary of agriculture Tom Vilsack hosted a series of workshops around the country to talk about antitrust problems in the food business. Thousands turned out for discussions that looked at concentration in the seed business, among meat processors, in the chicken industry and among food retailers. Nothing has yet come of those hearings.\n\nFred Stokes of the Organization for Competitive Markets said Vilsack and Varney were \"totally sincere\" in their intention, but that the effort was crushed by the demands of the election season. \"The people they promised to go after and hang high are being shaken down to provide the billion dollar Obama campaign fund,\" Stokes said. \"Varney was shut down by Obama's political machine.\"\n\nOlivier De Schutter, the United Nations special rapporteur on the right to food, has urged the Mexican government to resume a moratorium on GM varieties of corn. He said the introduction of GM varieties of the country's staple crop would threaten Mexico's crop diversity, which he called \"a crucial asset in the face of future threats and unpredictable changes brought about by climate change\" and necessary in fighting hunger. He added that the best insurance against the unpredictable was the continuous improvement of landraces by farmers' practices of saving, re-sowing and exchanging seeds.\n\nA GM soy and maize farming project in South Africa has ended in disaster for poor farmers. Farmers taking part in the Eastern Cape government project were introduced to farming packages of hybrid and GM seeds, pesticides and fertilisers produced by private companies linked to the scheme. A university report on the project says the government vigorously encouraged the farmers to produce GM maize and soya but those were not crops that addressed food security needs of the local population. The production methods undermined traditional agricultural production, making the farmers depend on expensive agrochemical inputs by the private sector.\n\nThis is not the first time that South African farmers have suffered at the hands of the GM industry. The failed GM Bt cotton experiment in Makhatini Flats is documented here:\n\nAnd in 2009, Monsanto's GM maize harvest in South Africa failed massively:\n\nHundreds of people have marched in the Kenyan capital, Nairobi, against government plans to import GM maize. They were protesting at reports that Kenya would lift its restrictions on GM crops following a recent drought, leading to maize shortages.\n\nIn a clear case of conflict of interest in clearing GM crop trials, a member of the environment ministry's statutory appraisal body and senior agriculture ministry scientist Swapan Kumar Datta has pushed and got clearance for trials of GM rice to be conducted by his wife, Karabi Datta of Calcutta University. He too will be participating in the trials.\n\nThe GM regulator GEAC at first cleared the trials for GM rice with the Supreme Court-mandated condition that the isolation distance of 200 metres must be maintained during experiments. But on the insistence of Datta, who is a member of GEAC and deputy director general at the Indian Council for Agricultural Research, the appraisal body re-opened the case. Datta insisted that the isolation distance was too much. The GEAC went against the Supreme Court orders and was persuaded by Datta to permit Karabi Datta to carry out trials at a 10-metre isolation distance instead.\n\nAfter Greenpeace and a TV channel caught Monsanto violating biosafety rules in a GM maize seed production plot, the leading farmers union, Karnataka Rajya Raitha Sangha (KRRS) and civil society organisations demanded an immediate ban on all open field experiments of GM crops in the country. The investigation found that Monsanto left viable seed lying in the field and failed to destroy potentially contaminated refuge crops after the crop was harvested.\n\nIn a letter sent to India's Environment Minister, Jairam Ramesh, the Coalition for a GM-Free India, with endorsements from hundreds of organisations and concerned individuals from all over India, expressed the growing outrage at the way GM crops are being regulated in India, and Monsanto's brazen disregard of biosafety issues.\n\nThe EU has now ended its so-called \"zero tolerance\" approach to unauthorised GM imports in GM animal feed. This means that GM material that hasn't been determined \"safe\" – even by inadequate EU standards (courtesy of the EU regulators, EFSA) – can now be mixed into GM animal feed in the EU. If anything did go wrong with approved GMOs, EFSA would have to accept liability for approving it. Who will take liability for anything going wrong now that animal feed may contain unapproved GMOs?\n\nTell them: \"Not only do I not want to eat GM-fed meat and dairy, but I certainly don't want to eat unapproved GM! You really must move away from GM animal feed, and meantime label your non-GM-fed lines.\"\n\nAlso ask: \"Who is now in charge of determining whether GM feed is safe?\"\n\n+ SIGN PETITION AGAINST ENVIRONMENTAL RELEASE OF GM VACCINE TESTED ON CALVES\n\n+ SIGN PETITION AGAINST ENVIRONMENTAL RELEASE OF GM VACCINE TESTED ON FOALS\n\nAt the GMO-Free Europe Conference 2010, Dr Vandana Shiva takes stock of the resistance against the takeover of agriculture by the biotech industry. An inspiring roundup of the GM battle.", "opengraph": {"type": "website", "title": "REVIEW number 312", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/50-2011/13315-review-number-312", "description": "GMWATCH REVIEW number 312 from Claire Robinson, REVIEW editor––––––––––––––––––––––––––––––––––"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "/en/?id=13315#AUSTRALASIA", "/en/?id=13315#LOBBYWATCH", "/en/?id=13315/#THE%20AMERICAS", "/component/content/article/13315#ACTION%20ALERTS", "/en/?id=13315/#EUROPE", "http://stienster.blogspot.com/2011/07/fw-birth-defects-covered-up-new-video.html", "http://www.responsibletechnology.org/", "/", "http://www.lobbywatch.org", "http://www.lobbywatch.org", "http://bit.ly/12UAI2", "http://www.lobbywatch.org/", "http://www.lobbywatch.org/", "http://twitter.com/GMWatch", "http://bit.ly/c6OnaX", "#LOBBYWATCH", "#RESEARCH", "#AUSTRALASIA", "/en/?id=13315#EUROPE", "/en/?id=13315#THE%20AMERICAS", "#AFRICA", "#ASIA", "/en/?id=13315#ACTION%20ALERTS", "#VIDEOS", "/en/?id=13305", "http://www.toxicsoy.org/toxicsoy/news/Artikelen/2011/7/1_Interview_with_WWF_doc_maker_in_English.html", "/en/?id=13283", "/en/?id=13288", "/en/?id=13289", "http://www.scribd.com/doc/57277946/RoundupandBirthDefectsv5", "/en/?id=13290", "http://www.gmfreeze.org/actions/19/", "/en/?id=13279", "/en/?id=13294", "/en/?id=13311", "http://bit.ly/stopgmwheat", "/en/?id=13275", "/en/?id=13301", "http://www.greenpeace.org/australia/en/what-we-do/Food/resources/reports/Australias-wheat-scandal/", "http://bit.ly/stopgmwheat", "http://www.stopgm.org.uk/gathering-momentum.html", "http://www.stopgm.org.uk/gathering-momentum.html", "/en/?id=13303", "/en/?id=13314", "/en/?id=13306", "/en/?id=13310", "/en/?id=13285", "/en/?id=13299", "/en/?id=13294", "/en/?id=13309", "/en/?id=13308", "/en/?id=13313", "http://www.wired.com/wiredscience/2011/07/engineered-bluegrass/", "/en/?id=13304", "/en/?id=13297", "/en/?id=13312", "/en/?id=13295", "/en/?id=13286", "/latest-listing/1-news-items/12693", "/latest-listing/1-news-items/5358", "/latest-listing/1-news-items/10849", "/en/?id=13296", "/latest-listing/1-news-items/13307", "/en/?id=13298", "/en/?id=13302", "/en/?id=13302", "http://bit.ly/stopgmwheat", "http://bit.ly/stopgmwheat", "/component/content/article/13315#EUROPE", "http://www.gmfreeze.org/take-action/resources/useful-addresses/useful-addresses-food-retailers/", "/en/?id=13293", "http://www.gmfreeze.org/why-freeze/unwanted/where-buy-non-gm-fed/", "http://www.change.org/petitions/stop-the-permission-for-an-introduction-in-the-environment-of-a-gm-vaccine-tested-on-little-calves?share_id=TEoeFvIFYW&pe=pce", "http://www.change.org/petitions/stop-a-dutch-genetically-engineered-gm-vaccination-study-in-foals-from-3-days-old-untill-6-months", "/gm-videosb/6-must-see-videos/13284", "/en/?id=12211:videos-introduction", "/gm-videosb/6-must-see-videos/13284", "/", "http://www.powerbase.info/index.php/GM_Watch:_Portal", "http://twitter.com/GMWatch", "http://www.facebook.com/pages/GMWatch/276951472985?ref=nf"], "authors": [], "publish_date": "2011-07-12T13:29:14+00:00"}