{"result_id": "137035", "URL": "https://gmwatch.org/en/106-news/latest-news/19410-chinese-and-us-scientists-genetically-engineered-bat-coronaviruses-in-dangerous-gain-of-function-research-stretching-back-years", "timestamp": "2023-04-25 15:18:32 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/106-news/latest-news/19410-chinese-and-us-scientists-genetically-engineered-bat-coronaviruses-in-dangerous-gain-of-function-research-stretching-back-years", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "Chinese and US scientists genetically engineered bat coronaviruses in dangerous gain-of-function research stretching back years", "cleaned_text": "Research was omitted from landmark paper claiming natural origin of SARS-CoV-2. Report: Claire Robinson\n\nChinese and US scientists have been collaborating for years in dangerous gain-of-function experiments that involve genetically engineering coronaviruses from bats and other animals, as revealed by a series of scientific publications. The coronaviruses are related to the SARS viruses that cause severe respiratory diseases in humans. The scientists were based at the Wuhan Institute of Virology (WIV) in China, the lab suspected by some of accidentally releasing the SARS-CoV-2 virus that caused the COVID-19 pandemic, and at the University of North Carolina (UNC) in the US. \n\n\n\nOddly, however, this long and high-profile research history was entirely omitted from the scientific paper, published in Nature in February this year, in which Shi Zhengli and her team at the WIV claimed to have identified a natural origin for SARS-CoV-2. The origin, according to the WIV scientists, was a bat virus, RaTG13, that was thought to have jumped from an animal to a human at a Wuhan seafood and wildlife market (the “zoonotic” theory – that is, coming from animals by a natural spillover event).\n\n\n\nWhy the omission? To understand the possible reason, we need to first understand the nature of the research work that was done by the WIV scientists and their US collaborators. \n\n\n\nThe purported benign aim of this line of research was to investigate the potential of bat coronaviruses to infect humans, to improve scientists’ ability to predict pandemics, and to develop vaccines or other therapies. \n\n\n\nHowever, this is also gain-of-function research, which aims to make viruses more infective or transmissible. Such research has come under increasing criticism by scientists for many years, due to its tendency to pose huge risks for little benefit.\n\n\n\nThis fear is borne out by the results of a particularly risky gain-of-function experiment carried out in the US and published in 2015 by scientists from the UNC in collaboration with WIV scientists, including Shi Zhengli, dubbed China’s “bat woman” for her work with bat coronaviruses. The work was funded by:\n\n* The National Institute of Allergy & Infectious Disease (NIAID) of the US National Institutes of Health (NIH). The director of the NIAID is Dr Anthony Fauci, who currently heads up the US COVID-19 response. The NIH’s money was directed through the US-based Eco-Health Alliance, headed by Dr Peter Daszak;\n\n* USAID; and\n\n* Chinese institutions. \n\n\n\nIn the published paper reporting the risky experiment, the scientists state that they began their work before the 2014 US temporary moratorium on virus gain-of-function studies, which was prompted by several high-profile biosafety failures at US labs. But in spite of the moratorium, as stated in the paper, the NIH gave permission for the study to continue. Dr Fauci of the NIAID “outsourced” the research to the WIV in China, in the words of one media article.\n\nIn the experiment, the scientists took a mouse coronavirus and exchanged its spike protein – the part on the surface of the virus that determines infectivity – for one from a bat coronavirus that was similar to the virus that causes the human epidemic disease SARS. They kept the mouse virus “backbone” – its basic RNA and protein molecular structure. The bat coronavirus, in its natural state, was unable to infect humans as its spike protein was inadequate – it was not able to dock onto the ACE2 receptor on human cells. \n\n\n\nInfectivity is supposed to be determined just by the spike protein. So joining the bat spike protein with the mouse virus backbone should have resulted in a virus that was non-infectious to humans. \n\n\n\nBut the resulting genetically engineered chimeric virus unexpectedly turned out to be highly infectious to humans. In fact, its infectivity, tested in human airway cells, was comparable to the human epidemic-causing virus strain SARS-CoV Urbani.\n\n\n\nThe scientists were clearly surprised and alarmed by this finding. As they state, “based on previous models of emergence”, the creation of this chimeric virus “was not expected to increase pathogenicity”. They deduced that the nature of the spike protein alone was not enough to determine infectivity – the backbone of other protein components is also important.\n\n\n\nThe researchers then tried – but failed – to develop a vaccine or antibody therapy. The antibodies were unable to block the receptor binding domain (RBD – the part of the spike protein that binds to the human ACE2 receptor, resulting in infection) of the bat-mouse chimeric virus.\n\n\n\nThe researchers conclude their publication with a caution and a question left hanging in the air. They write that their findings “represent a crossroads of GOF [gain-of-function] research concerns; the potential to prepare for and mitigate future outbreaks must be weighed against the risk of creating more dangerous pathogens. In developing policies moving forward, it is important to consider the value of the data generated by these studies and whether these types of chimeric virus studies warrant further investigation versus the inherent risks involved.”\n\n\n\nIn short, the very research that is claimed by some to be necessary to develop vaccines and other interventions risks creating a pandemic.\n\nWhile there are serious risks involved in carrying out such research, there are also risks involved in publishing it. In this case the researchers examined the amino acid sequences of the bat virus spike protein and identified the sequences required for human infectivity – and published information on them in their paper. \n\n\n\nThe London-based molecular geneticist Dr Michael Antoniou commented, “The information on amino acid sequences provided in this paper is crucial to designing a virus that is infective in humans. Anyone with access to a standard laboratory would be able to use the information to estimate the amino acid sequence needed to engineer an RBD that would be highly likely to infect human cells.”\n\n\n\nIn other words, the researchers have provided a guide to making a bioweapon.\n\n\n\nDr Antoniou explained how their data makes what would otherwise have been a laborious process far quicker and more efficient. If you start with no information, you could engineer a human-infective virus like SARS-CoV-2 by using a “directed iterative evolutionary selection process”. This would involve using genetic engineering in a mutagenesis procedure to generate a large number of randomly mutated versions of the SARS-CoV spike protein RBD, which would then be selected for strong binding to the human ACE2 receptor and consequently high infectivity of human cells.\n\n\n\nHowever, using the information provided by the UNC and WIV researchers, Dr Antoniou says, “You don’t have to go in blind using a total ‘saturation’ mutagenesis of the RBD amino acid sequence. You don’t have to start from a black box of unknowns. You already have an insight into which amino acid sequence is needed for human infectivity, so that guides you as to how to engineer the virus.”\n\n\n\nThis raises the ethical question of whether gain-of-function research is ever worth the risk. Dr Antoniou believes that it is not: “Research of this type is not necessary to identify new targets for therapeutic intervention. An investigation of the basic mechanisms of how virus infection takes place and progresses is sufficient for this. Thus gain-of-function research with known dangerous pathogens such as coronaviruses should be banned.”\n\nIn spite of the dangers highlighted in the 2015 paper, and in the wake of the US temporary moratorium on virus gain-of-function work, the research with bat coronaviruses continued – this time in China. In 2017 WIV scientists, including Shi Zhengli, published a study with funding shared between Chinese and US institutions, the latter including the US NIH and USAID. \n\n\n\nThe researchers report the findings from virus infectivity experiments where genetic material was combined from different SARS-related coronaviruses to form novel chimeric versions. They were trying to find out which mutations were needed to allow certain bat coronaviruses to bind to the human ACE2 receptor. They found that two genetically engineered chimeric viruses replicated “efficiently” in human cells. The consequences of escape of such viruses could be serious.\n\n\n\nThen, only this month, WIV scientists led by Shi Zhengli published a pre-print reporting work in which they investigated the ability of spike proteins from bat SARS-related coronavirus (SARSr-CoV), among other coronaviruses, to bind to bat and human ACE2 receptors. In other words, they examined how efficiently these coronaviruses infect humans and how human infectivity can be optimised.\n\nThe three papers examined above show that over a period of several years, Chinese and US scientists were using genetic engineering techniques for gain-of-function experiments with coronaviruses, resulting in the generation of viruses better adapted to infect humans. \n\n\n\nAgainst this background Shi Zhengli published her landmark paper in the journal Nature in February this year, after the COVID-19 pandemic had spread across the globe. In this paper, Shi and her co-authors claimed to have identified the closest relative to SARS-CoV-2 and its “probable” origin, a natural bat coronavirus, which she called RaTG13. The paper highlights the natural origin zoonotic theory for SARS-CoV-2 – that it jumped from an animal into humans at the Huanan seafood and wildlife market. This theory has not subsequently been supported by emerging evidence.\n\n\n\nAll publications arguing for a natural origin for SARS-CoV-2 rely heavily on this one paper by Shi Zhengli and colleagues, describing the sequence of a purported natural bat coronavirus named RaTG13. But notably absent from the paper is any reference at all to Shi and her collaborators’ long history of gain-of-function genetic engineering research with bat coronaviruses, described above. That includes the important paper by UNC and WIV scientists of 2015, which had the alarming result of turning a harmless bat virus into a human pathogen.\n\nIt is as if this research background simply didn’t exist. Why? Could it be because drawing attention to it might raise the suspicion in people’s minds that SARS-CoV-2 might also have been intentionally or accidentally optimised in the lab during gain-of-function research? \n\n\n\nAfter all, if the belief gained traction that the virus might have escaped from a lab, virologists could expect their research to be “impacted adversely by tighter laboratory controls”, as the leading vaccine researcher Professor Nikolai Petrovsky has pointed out in explaining why the majority of scientists seem to be supporting the idea that the virus originated in a wet market rather than a lab. \n\n\n\nIt would also, of course, almost certainly bring the “gravy train” of virus gain-of-function research to an abrupt halt, quite apart from causing a massive political storm. It might even awaken public doubts about the safety of other risky applications of genetic engineering. \n\n\n\nBut despite this array of vested interests, a forensic investigation needs to begin as soon as possible into the exact origins of a pandemic virus that, in the words of Professor Petrovsky, seems “like it was designed to infect humans”.", "opengraph": {"type": "website", "title": "Chinese and US scientists genetically engineered bat coronaviruses in dangerous gain-of-function research stretching back years", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/100-2020/19410-chinese-and-us-scientists-genetically-engineered-bat-coronaviruses-in-dangerous-gain-of-function-research-stretching-back-years", "description": "\r\nResearch was omitted from landmark paper claiming natural origin of SARS-CoV-2. Report: Claire Robinson\r\n", "image": "https://gmwatch.org/images/banners/Coronavirus_in_green_1200x628.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.nature.com/articles/s41586-020-2012-7", "https://www.nature.com/articles/nm.3985/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(18)30006-9/fulltext", "https://www.nature.com/articles/nm.3985/", "https://www.nature.com/articles/nm.3985/", "http://www.phe.gov/s3/dualuse/Documents/gain-of-function.pdf", "/en/news/latest-news/19391", "https://asiatimes.com/2020/04/why-us-outsourced-bat-virus-research-to-wuhan/", "https://www.nature.com/articles/nm.3985/", "https://gmwatch.org/en/news/latest-news/19383", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1006698#ack", "https://www.biorxiv.org/content/10.1101/2020.05.13.093658v1", "https://www.nature.com/articles/s41586-020-2012-7", "https://arxiv.org/abs/2005.06199", "https://www.biorxiv.org/content/10.1101/2020.05.01.073262v1", "https://www.nature.com/articles/s41586-020-2012-7", "https://www.skynews.com.au/details/_6158843835001", "https://www.skynews.com.au/details/_6158843835001"], "authors": ["Editor2"], "publish_date": "2020-05-26T11:56:34+00:00"}