{"result_id": "137043", "URL": "https://www.gmwatch.org/en/latest-listing/41-2002/3278-prodigene-officials-may-face-jailcontamination-could-be-aids-vaccine-or-blood-thickener", "timestamp": "2023-04-25 15:18:35 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/latest-listing/41-2002/3278-prodigene-officials-may-face-jailcontamination-could-be-aids-vaccine-or-blood-thickener", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Prodigene officials may face jail/Contamination could be AIDS vaccine or blood thickener", "cleaned_text": "PRODIGENE OFFICIALS MAY FACE JAIL/CONTAMINATION COULD BE AIDS VACCINE OR BLOOD THICKENER\n\n1. US foodmakers urge ban on food crops for medicine \n\n2. ProdiGene officials may face jail \n\n3. Biopharmaceutical contamination could be AIDS vaccine or blood thickener\n\n1. US foodmakers urge ban on food crops for medicine\n\nWASHINGTON, Nov 14 (Reuters) - U.S. food companies urged the government on Thursday to temporarily ban the use of corn, soybeans and other food crops to produce pharmaceuticals after a Texas company accidentally mixed its gene-altered corn with other crops.\n\nProdiGene Inc., a small biotech company experimenting with corn engineered to make medications for diabetes and diarrhea, faces two federal investigations for contaminating other crops in Nebraska and Iowa.\n\nThe National Food Processors Association said the federal government should halt plantings of gene-altered crops for pharmaceuticals until it imposes tougher regulations to prevent future incidents.\n\n\"There should be no testing of this kind unless you can get 100 percent confinement and containment. The risk is too high,\" said Rhona Applebaum, the group's senior vice president of regulatory affairs.\n\nThe Grocery Manufacturers of America, whose members include major foodmakers such as General Mills Inc., Kellogg Co. and Del Monte, said it was \"deeply concerned by ProdiGene's reported conduct.\"\n\n\"We strongly urge the biotech industry to direct its substantial research capabilities into investigating the use of nonfood crops for the development of pharmaceuticals,\" said Karil Kochenderfer, the group's environment director.\n\nBoth industry groups are supporters of biotech foods such as corn engineered to repel pests or to produce a better quality crop. But they part company with the biotech industry when it comes to growing so-called \"pharm-foods\" next to crops destined for human or animal food.\n\nEnvironmental groups and many European nations take a different view. They oppose all biotech plants, contending that not enough is yet known about their long-term safety for humans.\n\nAlthough unwanted corn often sprouts in soybean fields, ProdiGene failed to pull out its bio-corn in Nebraska and removed it too late in Iowa, according to the U.S. Agriculture Department.\n\nAs a result, ProdiGene was ordered to destroy 155 acres of corn in Iowa and may have to buy 500,000 bushels of soybeans quarantined in Nebraska because of possible contamination.\n\n\"These incidents reaffirm the Grocery Manufacturers of America concerns about the use of food crops for the development of plant-made pharmaceuticals,\" Kochenderfer said.\n\nDow Chemical Co. and Monsanto Co. are among other companies field testing new crops with the aim of commercializing them in three years.\n\nBo Miller, biotechnology policy director for Dow Chemical, said the company planted its first pharmaceutical crop in the U.S. Southwest only this year. Next year, Dow will closely monitor the field for unwanted stray plants, he said.\n\nMiller did not disclose how many acres were planted with the company's experimental pharma-corn variety. The company has said it plans to take \"extraordinary measures\" to control corn pollen, including mile-wide buffer zones, covering plants with special screens and timing the planting of a field so it is not fertile at the same time as neighboring crops.\n\n\"Planting in the U.S. Southwest has been part of our business model from the beginning,\" Miller said.\n\nOnly about 300 acres throughout the United States was planted with pharm-crops this year, according to the industry.\n\nLast month, the Biotechnology Industry Organization announced its members would follow new voluntary guidelines to grow plant-produced pharmaceuticals outside the Midwest and Plains states.\n\nWASHINGTON (AP)--Officials at a biotechnology company face a possible one-year jail term if the government finds they broke laws when genetically engineered corn contaminated two soybean crops, the Agriculture Department said Thursday.\n\nThe department has been meeting with attorneys for ProdiGene Inc., of College Station, Texas, to discuss possible penalties for the incidents in Iowa and Nebraska, said Cindy Smith, deputy administrator for USDA's Animal and Plant Health Inspection Service.\n\nProdiGene may have violated the Plant Protection Act, which regulates the transportation and planting of genetically engineered plants. Federal inspectors found a soybean crop in Iowa and another in Nebraska were contaminated with experimental corn and took steps to ensure it did not taint the food supply.\n\nThe government ordered ProdiGene to burn 155 acres of the contaminated crop in Iowa in September after inspectors found stray biotech corn plants growing in the field. A similar incident occurred in Nebraska in October.\n\nThe Food and Drug Administration ordered the company Wednesday to destroy 500,000 bushels of soybeans that have been under quarantine in a Nebraska grain elevator because of contamination.\n\nUnder the law, the government can order a violator to pay a fine that is twice the value of the damaged crops, or up to $500,000 for each case. Smith said corporate officers responsible for the violations also could face criminal penalties of up to one year in jail.\n\nThe Nebraska crop is valued at $2.7 million. The Agricultural Department did not have a value for the Iowa crop.\n\nAnthony G. Laos, president and CEO of ProdiGene, said the Iowa incident ``has been fully resolved'' to the government's satisfaction. But USDA spokesman Jim Rogers said the Iowa and Nebraska cases are now being viewed as a single proceeding that has not been resolved.\n\nThe company has not disclosed what substance was in the corn. USDA's Smith said because of confidentiality rules, she could not confirm what substance officials feared might taint the food supply. Laos said the biotech corn--part of a test crop--that is at the center of the investigation contains DNA from a protein that is not toxic. He said the protein ``addresses persistent digestive health conditions.''\n\nThe ProdiGene incidents frustrated the food industry, which said Thursday that biotech companies need to change which crops they've chosen for making drugs and industrial products.\n\nUntil the government and companies have proven that the crops won't taint food, ``we strongly urge the biotech industry to direct its substantial research capabilities into investigating the use of nonfood crops for the development of pharmaceuticals,'' said Karil Kochenderfer, director for new technologies at the Grocery Manufacturers of America.\n\nEnvironmental groups critical of the biotech industry contend the incidents should have been handled better and are seeking tougher federal regulations.\n\n``ProdiGene should certainly be punished for this reckless lapse, but let us not forget that the USDA has irresponsibly continued to allow drugs and, industrial chemicals to be engineered into food crops,'' said Mark Helm, a spokesman for Friends of the Earth. ``It has to stop.''\n\nHelm said the government should ban open-air cultivation of plants designed to contain pharmaceuticals so they won't be able to contaminate other crops.\n\nOn the other side, Lisa Dry, a Biotechnology Industry Organization spokeswoman, said that while the ProdiGene incidents are a black eye for the industry, the government has the rules needed to block contaminated soybeans from entering the food supply.\n\n``The regulations that are in place were designed to stop this from happening,'' she said, calling the Nebraska and Iowa incidents a matter of noncompliance with the rules. ``The company did not follow the regulations.''\n\nDry said the ProdiGene case is very different from StarLink--an unapproved variety of corn that tainted the food supply two years ago. ``This was the antithesis of StarLink because with StarLink, it wasn't caught.''\n\n3. BIOPHARMACEUTICAL CONTAMINATION COULD BE: AIDS VACCINE OR BLOOD THICKENER\n\nCoalition to File Legal Petition Demanding Immediate Halt of Experimental Biopharmaceuticals Grown on Farms\n\nWashington-Today, the U. S. Department of Agriculture (USDA) revealed a second incident of contamination of a food crop by an experimental genetically engineered crop, engineered to contain a pharmaceutical or industrial chemical, in Iowa. This follows yesterday's announcement that 500,000 bushels of soybeans in Nebraska destined for human consumption have also been quarantined due to biocontamination by a similar crop.\n\nThe USDA has refused to reveal what chemical or drug was grown in either crop, but research into the company that produces the biopharmaceutical crops, ProdiGene, reveals that the contaminates could be one of the following:\n\nOther biopharm crops reportedly grown by ProdiGene include experimental oral vaccines for hepatitis B and for a pig disease, transmissible gastroenteritis. According to USDA records ProdiGene has received 85 test permits for experimental open-air trials of genetically engineered biopharmaceutical and chemical crops for planting in at least 96 locations. More information on ProdiGene products can be found on the attached document.\n\n\"With this latest contamination the government should halt all experimental genetically engineered crops grown on farms,\" Stated Matt Rand, Biotechnology Campaign Manager for the National Environmental Trust. \"If the governmentm continues to develop policies for the biotech industry instead of for the safety of the U.S. food supply it is just a matter of time before one of these experimental crops ends up on our dinner plates,\" continued Rand.\n\nToday, with the second contamination of an experimental genetically engineered biopharmaceutical crop, the GEFoodAlert coalition announced its intention to file a legal petition to the USDA calling for the immediate halt to all biopharms. Additionally with the US government not revealing pertinent information on the contamination incidents, the Center for Food Safety, a member of the coalition, filed a Freedom of Information Act (FOIA) petition to access all government documents on ProdiGene. A similar FOIA was submitted by Friends of the Earth in April 2001and the USDA declined to provide permit information.\n\nLast week members of GEFoodAlert coalition met with the USDA regarding the open farm testing of biopharmaceuticals and asked the USDA if contamination testing was taking place. The USDA flatly denied that any contamination testing was being performed.\n\n\"The government clearly knew about this contamination weeks ago and chose not to reveal the information to the public, but instead worked behind closed doors with the industry to try to cover this up,\" said Joseph Mendelson, Legal Director at the Center for Food Safety.\n\n### For a comprehensive report on biopharm, see www.gefoodalert.org. The GEFoodAlert is a coalition of health, consumer and environmental groups that supports the removal of genetically engineered ingredients from grocery store shelves unless they are adequately safety tested and labeled. \n\n--------------------------------------------------------------------- \n\nPRODIGENE FIELD TRIALS OF DRUG- AND CHEMICAL-PRODUCING CORN\n\nInformation compiled from USDA's website for field trials of genetically engineered crops (www.nbiap.vt.edu/cfdocs/fieldtests1.cfm )(1)\n\nAn Excel file with a complete list of ProdiGene field trials nationwide is available upon request\n\nNebraska soybeans were contaminated with engineered corn grown by ProdiGene in 2001. All of the substances involved in these trials were kept secret as confidential business information (CBI), except one that listed the substances involved as aprotinin and gp120. ProdiGene has also reported that it is growing trypsin-corn on hundreds of acres in the Midwest, including Nebraska, though for some reason this trial is not listed on the USDA's website. The ProdiGene permit for planting in Iowa in 2001 was simply listed as a pharmaceutical without further specification.\n\nAprotinin is a blood-clotting agent used to reduce blood loss in surgery. A version of aprotinin derived from cow lung tissue is sold by Bayer under the name of Trasylol. ProdiGene's first reported field trial of corn genetically engineered to produce aprotinin was in Nebraska in 1998. ProdiGene sees several prospective uses for its corn-grown aprotinin: as a reagent in biological research, as a blood-clotting drug, and as a built-in insecticide similar to the Bt toxins in commercialized varieties of engineered corn. Aprotinin belongs to a class of substances known as trypsin inhibitors that are known to cause pancreatic disease when fed to animals. Aprotinin has insecticidal properties as well, and has been shown to shorten the lives of honeybees that ingest it at low levels. Expert scientific advisors to the EPA have recommended that transgenic plants producing trypsin inhibitors such as aprotinin be subjected to animal feeding experiments before approval:\n\n\"Like any transgenic plant with pesticide properties, those containing trypsin inhibitor should be tested for their biological effects at dietary concentrations which, at minimum, are likely to be encountered in the transgenic plant itself. Such studies should also be accompanied by tests designed to evaluate how much heat treatment may be necessary to reduce the trypsin inhibitor activity to non-toxic levels.\" (3) It is not known if the government has required any animal testing on ProdiGene's aprotinin-producing corn.\n\ngp120 is a glycoprotein (protein with sugar groups attached) found on the surface of two strains of HIV and the closely related simian immunodeficiency virus (SIV). It is being grown in corn for possible development as an AIDS vaccine, though many researchers believe it will never be effective, and might even suppress an effective immune response in vaccinated individuals. Injection of gp120 into the brain of rats has been shown to kill brain cells, while injection into the human blood stream results in the death of white blood cells. It is not known if the USDA or FDA has conducted any environmental or health assessment of gp120-producing corn. It would seem advisable to test for possible adverse effects upon inhalation of or contact with gp120-corn dust and pollen.\n\nTrypsin is a digestive enzyme used in biological research and pharmaceutical processing. It is traditionally obtained from cow or pig pancreas. ProdiGene announced plans to grow hundreds of acres of its trypsin-producing corn in the Midwest this year, including Nebraska, with hopes of marketing hundreds of pounds of corn-derived trypsin by year's end. Trypsin is a known inhalant allergen, causing occupational asthma in pharmaceutical and industrial workers exposed to it. Similar concerns might apply to farmers and farmworkers exposed to trypsin-corn dust and pollen, especially since trypsin is produced at very high concentrations in corn kernels. Trypsin corn is reportedly being grown under the USDA's weak \"notification\" system, which does not require a permit. A USDA spokesperson indicated that neither the USDA nor the FDA had conducted any health or environmental assessment of trypsin corn.\n\nAnother possible substance is laccase, an enzyme derived from a fungus. It is intended for use in the adhesives industry. ProdiGene foresees a market for corn-grown laccase that would require the planting of anywhere from 200,000 to 2 million acres of corn. A related version of laccase from the Japanese lacquer tree \"may be harmful by inhalation, ingestion or skin absorption. Prolonged or repeated exposure may cause allergic reactions in certain sensitive individuals. The toxicological properties have not been thoroughly investigated.\"(4) Other biopharm crops reportedly grown by ProdiGene include experimental oral vaccines for hepatitis B and a pig disease, transmissible gastroenteritis. There is no indication that the USDA or the FDA has conducted any health or environmental assessment of these substances. \n\n \n\nEndnotes:\n\n1. Search on the following parameters: Phenotype category = Other; Institution = ProdiGene; Location = Nebraska.\n\n2. For detailed treatments of the substances discussed below, including references, see \"Manufacturing Drugs and Chemicals in Crops: Biopharming Poses New Threats to Consumers, Farmers, Food Companies and the Environment,\" July 2002, by Bill Freese of Friends of the Earth for Genetically Engineered Food Alert. Available for downloading at www.foe.org/biopharm/.\n\n3. \"Mammalian Toxicity Assessment Guidelines for Protein Plant Pesticides,\" Scientific Advisory Panel to the EPA, SAP Report No. 2000-03B, September 28, 2000.", "opengraph": {"type": "website", "title": "Prodigene officials may face jail/Contamination could be AIDS vaccine or blood thickener", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/41-2002/3278-prodigene-officials-may-face-jailcontamination-could-be-aids-vaccine-or-blood-thickener"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share"], "authors": [], "publish_date": "2002-11-15T10:08:06+00:00"}