{"result_id": "137012", "URL": "https://gmwatch.org/en/archives/5-Interview-about-attacks-on-GM-Watch.html", "timestamp": "2023-04-25 15:18:20 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://gmwatch.org/en/archives/5-Interview-about-attacks-on-GM-Watch.html", "encoding": "utf-8"}, "image": null, "domain": "gmwatch.org", "title": "GM crops' days may be numbered", "cleaned_text": "This email address is being protected from spambots. You need JavaScript enabled to view it.", "opengraph": {"type": "website", "title": "GM crops' days may be numbered", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/47-2008/5-gm-crops-days-may-be-numbered", "description": "  1.EUROPE: GM Crops' Days May Be Numbered\r\n2.Belarus: Double GMO labelling  \r\n3.Madagascar: Faustian bargain\r\n4.New Zealand: GMO risk unfair\r\n5.Kenya: Environmentalists Urge Leaders to Reject Bio Bill\r\n6.USA: The GMO industry has been scraping by on bad science\r\n7.USA: Tell Hershey's to kiss G"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share"], "authors": ["Claire"], "publish_date": "2008-09-17T09:20:04+00:00"}