{"result_id": "137030", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19403-wuhan-and-us-scientists-used-undetectable-methods-of-genetic-engineering-on-bat-coronaviruses", "timestamp": "2023-04-25 15:18:29 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19403-wuhan-and-us-scientists-used-undetectable-methods-of-genetic-engineering-on-bat-coronaviruses", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Wuhan and US scientists used undetectable methods of genetic engineering on bat coronaviruses", "cleaned_text": "Some of the work was done at minimal levels of biosafety. Report by Jonathan Matthews and Claire Robinson\n\nEvidence has emerged that researchers at the Wuhan Institute of Virology (WIV) in China, working in collaboration with scientists in the USA, have been genetically engineering bat viruses for the past several years to investigate infectivity – using undetectable methods. The WIV is just a few miles from the Chinese city where the COVID-19 pandemic is thought to have originated and is the chief suspect in the possible scenario that the virus emerged from a lab.\n\n\n\nThe evidence rebuts claims by journalists and some scientists that the SARS-CoV-2 virus responsible for the current COVID-19 pandemic could not have been genetically engineered because it lacks the “signs” or “signatures” that supposedly would be left behind by genetic engineering techniques. \n\n\n\nThose making these claims cite as evidence a letter published in Nature Medicine in March by American microbiologist Kristian Andersen and colleagues. The article stated that there was no evidence that the virus had been genetically manipulated and concluded that it emerged through natural mutation and selection in animal and human hosts.[1]\n\n\n\nTypical of the media response to the Nature Medicine letter was an article published in The Scientist, which stated, “there are no signs of genetic manipulation in the SARS-CoV-2 genome”. The BBC also reported that “the study of the coronavirus genome … found no signs it had been engineered”.\n\n\n\nOther experts, however, have pointed out that there are well known ways of manipulating the genetic material of a virus without leaving any such signs. \n\n\n\nNow Dr Richard Ebright, an infectious disease expert at Rutgers University (USA), has alerted the public to evidence that WIV and US-based researchers were genetically engineering bat viruses to investigate their ability to infect humans, using commonly used methods that leave no sign or signature of human manipulation.\n\n\n\nEbright flagged up a scientific paper published in 2017 by WIV scientists, including Shi Zhengli, the virologist leading the research into bat coronaviruses, working in collaboration with Peter Daszak of the US-based EcoHealth Alliance. Funding was shared between Chinese and US institutions, the latter including the US National Institutes of Health and USAID. The researchers report having conducted virus infectivity experiments where genetic material is combined from different varieties of SARS-related coronaviruses to form novel “chimeric” versions. This formed part of their research into what mutations were needed to allow certain bat coronaviruses to bind to the human ACE2 receptor – a key step in the human infectivity of SARS-CoV-2. \n\n\n\nThe WIV scientists did this, Ebright points out, “using ‘seamless ligation’ procedures that leave no signatures of human manipulation”. This is noteworthy because it is a type of genetic engineering that Andersen and his team excluded from their investigation into whether SARS-CoV-2 could have been engineered – and it was in use at the very lab that is the prime suspect for a lab escape.\n\n\n\nA group of scientists from the University of North Carolina in the USA, with the WIV’s Shi Zhengli as a collaborator, published a study in 2015 describing similar experiments involving chimeric coronaviruses, which were also created using standard undetectable genetic engineering techniques.\n\n\n\nDr Michael Antoniou, a London-based molecular geneticist, told us that these methods of genetic engineering have been commonly used for decades and do not leave any kind of “signature”. Commenting on Andersen and his team’s omission of these methods from their article in Nature Medicine, Dr Antoniou told us, “This shows that these authors’ conclusions about whether genetic engineering could have been involved are not justified by the available evidence.”\n\nRichard Ebright also flagged up another paper by WIV scientists that raises concerns. In a just-published pre-print, they describe investigating the ability of spike proteins from bat SARS-related CoV (SARSr-CoV), among other coronaviruses, to bind to bat and human ACE2 receptors – in other words, how efficiently they infect humans. Ebright points out that the paper states, \"All work with the infectious virus was performed under biosafety level 2 conditions\". This level is suitable for work involving agents of only “moderate potential hazard to personnel and the environment”.\n\n\n\nThe highest level of biosafety is level 4 (BSL-4). This is for work with agents that could easily be aerosol-transmitted within the laboratory and cause severe to fatal disease in humans for which there are no available vaccines or treatments. Because the WIV has a BSL-4 lab, many have assumed that work like this on infectious bat coronaviruses linked to SARS, a closely related coronavirus to SARS-CoV-2, was being conducted at the highest BSL-4 level of biosecurity. Clearly, as the WIV researchers state, this was not the case. But they are not at fault in failing to use BSL-4 for this work, as SARS coronaviruses are not aerosol-transmitted. \n\n\n\nThe work does, however, fall under biosafety level 3, which is for work involving microbes that can cause serious and potentially lethal disease via inhalation. So it seems inexcusable that it was carried out only at the relatively low biosafety level 2, which, as Ebright says, “provides only minimal protections against infection of lab workers”.\n\nEvolutionary opportunity for viruses to jump to humans\n\nThe bioscientist Dr Jonathan Latham criticised the kind of research on bat coronaviruses that has been taking place in Wuhan and the USA as “providing an evolutionary opportunity” for such viruses “to jump into humans”. Latham, who has a doctorate in virology, argues that this kind of work is simply “providing opportunities for contamination events and leakages from labs, which happen on a routine basis\".\n\n\n\nGiven that lab accidents are common, including in China where the SARS virus has escaped from high-level containment facilities multiple times, the details emerging about the research activities of the WIV and US scientists again underline the need for a credible independent investigation of the most forensic kind into the origins of the current pandemic. And a broader investigation is also needed into the full range of biological threats arising from various areas of potentially hazardous but laxly regulated biotechnology research.\n\n\n\nNotes\n\n\n\n1. In the Nature Medicine letter, Andersen and colleagues didn’t actually look for – and fail to find – a “sign” or “signature” of genetic engineering, akin to a calling card left by a visitor. That’s no surprise, as they doubtless knew that such a search would have been futile. What they actually said was that if genetic engineering had been involved, the virus would be different from how it is: it would have been designed in a more “ideal” way for human infectivity, based on the predictions of their computer modelling system. \n\n\n\nThere are massive problems with this argument, as experts have pointed out. Computer modelling programs are only as good as the data that are put into them by humans, so it is not valid to assume that the program – or the humans that designed it – knows what an “ideal” virus would look like in real-world conditions. \n\n\n\nThe letter also stated that if someone were trying to engineer the virus as a pathogen, they would “probably” have constructed it from the backbone of a virus already known to be infective to humans (note that “probably” leaves plenty of wriggle room for alternative methods of constructing a virus). But it’s possible that if it was engineered from a backbone, it was one that is not known outside their research group. This is possible if secrecy were involved – for example, for bioweapons/biodefence research or commercial vaccine development.\n\n\n\nIt should be clear to all by now that the claim that SARS-CoV-2 is not genetically engineered is an unproven assumption resting on other unproven assumptions, and does not constitute scientific proof.\n\n\n\nBy analogy, we can equate Andersen and colleagues’ “investigation” into the origins of SARS-CoV-2 to a police investigation into a suspicious death that might be a murder or due to natural causes. What Andersen and colleagues did was equivalent to looking at the corpse and death scene, drawing up a computer modelling profile of what the murderer (in the event that it was a murder) should look like, but then dismissing a prime suspect because he doesn’t match the profile, and concluding that the death was from natural causes.\n\n\n\nSuch a procedure and conclusion would not make sense, and neither does Andersen and colleagues’ argument.", "opengraph": {"type": "website", "title": "Wuhan and US scientists used undetectable methods of genetic engineering on bat coronaviruses", "url": "https://gmwatch.org/en/main-menu/news-menu-title/archive/100-2020/19403-wuhan-and-us-scientists-used-undetectable-methods-of-genetic-engineering-on-bat-coronaviruses", "description": "\r\nSome of the work was done at minimal levels of biosafety. Report by Jonathan Matthews and Claire Robinson\r\n", "image": "https://gmwatch.org/images/banners/Medical_Scientist_Works_in_Hazmat_Suit_1200x628.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://www.nature.com/articles/s41591-020-0820-9", "https://www.the-scientist.com/news-opinion/theory-that-coronavirus-escaped-from-a-lab-lacks-evidence-67229", "https://www.bbc.co.uk/news/science-environment-52318539", "/en/news/latest-news/19383-where-did-the-covid-19-virus-come-from", "https://twitter.com/R_H_Ebright/status/1261660326082367489", "https://twitter.com/R_H_Ebright/status/1261649950078836736", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1006698", "https://twitter.com/R_H_Ebright/status/1261660326082367489", "/en/news/latest-news/19383-where-did-the-covid-19-virus-come-from", "https://www.nature.com/articles/nm.3985", "https://www.chelseagreen.com/writer/michael-antoniou/", "https://twitter.com/R_H_Ebright/status/1261649950078836736", "https://www.biorxiv.org/content/10.1101/2020.05.13.093658v1.full.pdf", "https://twitter.com/R_H_Ebright/status/1261692182408421376", "https://en.wikipedia.org/wiki/Biosafety_level#Biosafety_level_2", "https://en.wikipedia.org/wiki/Biosafety_level", "https://thebulletin.org/2020/03/experts-know-the-new-coronavirus-is-not-a-bioweapon-they-disagree-on-whether-it-could-have-leaked-from-a-research-lab/", "/en/news/latest-news/19392", "https://www.theguardian.com/science/2014/dec/04/-sp-100-safety-breaches-uk-labs-potentially-deadly-diseases", "https://www.newscientist.com/article/mg18224451-700-chinas-sars-cases-sound-alarm-over-lab-security/", "https://thebulletin.org/2020/05/will-the-who-call-for-an-international-investigation-into-the-coronaviruss-origins/", "/en/news/latest-news/19377", "https://www.nature.com/articles/s41591-020-0820-9", "https://gmwatch.org/en/news/latest-news/19387", "/en/news/latest-news/19383"], "authors": ["Editor2"], "publish_date": "2020-05-20T20:40:43+00:00"}