{"result_id": "137042", "URL": "https://www.gmwatch.org/en/106-news/latest-news/19709-gmo-boosters-suffer-logic-bypass-in-using-covid-vaccines-to-promote-gmo-deregulation", "timestamp": "2023-04-25 15:18:35 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/106-news/latest-news/19709-gmo-boosters-suffer-logic-bypass-in-using-covid-vaccines-to-promote-gmo-deregulation", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "GMO boosters suffer logic bypass in using COVID vaccines to promote GMO deregulation", "cleaned_text": "Authors arguing for deregulation of GM crops and foods fail to mention that vaccines are tightly regulated – scientist\n\n\n\nEarlier this month we published an article reporting how pro-GMO spin doctors are using COVID-19 vaccines to promote GM crops. Examples of this phenomenon are now coming thick and fast, with the latest being published in a peer-reviewed journal. But that doesn’t make it any less fatuous than the other examples. And notably, many COVID vaccines are not genetically engineered at all.[1] \n\n\n\nSo the authors have to fudge the issue by using vague wording.\n\n\n\nIn the new article in EuroChoices, a journal focusing on agricultural and food issues, agricultural economist Justus Wesseler and life sciences professor Kai Purnhagen cite \"the contribution of biotechnologies to the creation of a vaccine\" for COVID-19 to argue for a weakening of the EU's GMO regulations. They argue that this will allow the \"potential\" of GMOs, and in particular new GM techniques such as gene editing, to be realised. \n\n\n\nTheir article is titled, in hope, \"COVID-19: A game changer in GMO regulation?\"\n\n\n\nDr Judy Carman, epidemiologist, biochemist, and director of the Institute of Health and Environmental Research in South Australia, took issue with their argument. \n\n\n\nShe commented, \"It seems that the authors would like to hitch a ride on the roll-out of the vaccines for COVID-19, in order to push an agenda for GM crops. I’m sure we are going to see a lot more of this argument in the future.\n\n\n\n\"However, my concern about GM crops has always been their lack of safety testing.\n\n\n\n\"The authors are conveniently forgetting that the vaccines were safety tested on animals, then went through Phases I, II and III of human clinical trials to determine safety, and are undergoing post-vaccination monitoring for safety (Phase IV), whereas those who make GM crops have no intention of putting their crops through any of that, because, based on a series of assumptions rather than evidence, these crops are apparently so safe, they don't need such testing.\n\n\n\n\"So in my view, if they want to argue that their crops are as safe as these vaccines, they can first safety test them like these vaccines, publish the evidence in peer-reviewed scientific journals for us all to see, and then go through the kind of regulatory process that the vaccines have gone through.\n\n\n\n\"Instead, they want their GM crops to avoid safety testing and be deregulated.\"\n\n\n\nClearly these GMO boosters have suffered a logic bypass in attempting to exploit people's fear of COVID-19 to justify allowing untested GMOs into our food supply.\n\n\n\nNotes\n\n\n\n1. The Pfizer and Moderna vaccines are chemically synthesised mRNA and lack the \"organism\" status required to constitute a GMO; the AstraZeneca and Russian vaccines are GMO.", "opengraph": {"type": "website", "title": "GMO boosters suffer logic bypass in using COVID vaccines to promote GMO deregulation", "url": "https://www.gmwatch.org/en/106-news/latest-news/19709-gmo-boosters-suffer-logic-bypass-in-using-covid-vaccines-to-promote-gmo-deregulation", "description": "\r\nAuthors arguing for deregulation of GM crops and foods fail to mention that vaccines are tightly regulated – scientist\r\n", "image": "https://www.gmwatch.org/images/banners/sprayed_glyphosate_covid_vaccine_1200x600.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "https://gmwatch.org/en/news/latest-news/19682", "https://onlinelibrary.wiley.com/doi/10.1111/1746-692X.12301", "https://onlinelibrary.wiley.com/doi/10.1111/1746-692X.12301"], "authors": ["Editor2"], "publish_date": "2021-02-24T13:31:19+00:00"}