{"result_id": "137049", "URL": "https://www.gmwatch.org/en/news/archive/2014/15240-fakethrough-gmos-and-the-capitulation-of-science-journalism", "timestamp": "2023-04-25 15:18:37 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/news/archive/2014/15240-fakethrough-gmos-and-the-capitulation-of-science-journalism", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "Fakethrough! GMOs and the capitulation of science journalism", "cleaned_text": "Golden rice is just one example among many of preliminary or doubtful research projects being inflated into positive global GMO news stories, writes Dr Jonathan Latham\n\nFakethrough! GMOs and the capitulation of science journalism\n\nGood journalism examines its sources critically, it takes nothing at face value, places its topics in a historical context, and it values above all the public interest. Such journalism is, most people agree, essential to any equitable and open system of government. These statements about journalism are especially applicable to the science media. But while the media in general has recently taken much criticism, for trivialising news and other flaws, the science media has somehow escaped serious attention. This is unfortunate because no country in the world has a healthy science media.\n\nAccording to the New York Times genetically engineered Xa21 rice was big news (Song et al 1995). In a 1995 article titled “Genetic Engineering Creates Rice Resistant to Destructive Blight”, journalist Sandra Blakeslee wrote it was:\n\n“the first time that a disease-resistance gene has been put into rice”\n\nBlakeslee then quoted a senior figure, Gary Toenissen, deputy director of agricultural sciences at the Rockefeller Institute in New York, as saying it heralded\n\n“a new era in plant genetics and resistance breeding”.\n\nBut eighteen years after that article was written, the failure of these predictions is clear. No commercial GMO rice of any kind exists, nor has Xa21, or any similar gene for disease resistance, been developed for commercial purposes.\n\nNeither was the research as novel as the Times made it sound. Toenissen claimed it was:\n\n“the first time that a disease-resistance gene has been put into rice”,\n\nbut readers weren’t told that this gene was already in rice plants, because rice is where it came from (Song et al 1995). Blakeslee thus described neither a conceptual nor a commercial breakthrough. But it was certainly a very useful PR boost for plant biotechnology.\n\nThe high protein cassava that never was\n\n“Cassava packs a protein punch with bean genes“ was the title of a 2011 New Scientist article portraying a new GMO cassava developed by Dr Claude Fauquet and colleagues of the Donald Danforth Center, St Louis, USA. The Center, which is largely funded by Monsanto, had produced a GMO cassava using money from the Bill and Melinda Gates Foundation. Thanks to the addition of a synthetic protein (called zeolin), the modified cassava was reported to contain protein levels elevated by a factor of four and apparently sufficient to greatly improve the nourishment of “hungry children” (Abhary et al 2011).\n\nBut despite the enthusiasm of New Scientist, SciDevNet, and many other media outlets, no such cassava is ever likely to feed the hungry of Africa. A subsequent investigation at the Danforth Center found that the “modified” cassava plants in their greenhouses had no zeolin gene in them. They were not transgenic despite the fact that illustrations in the Abhary publication appeared to show they were. The Abhary paper was therefore retracted (this was later noted by New Scientist and SciDevNet).\n\nAccording to Danforth President James Carrington, the main author (Abhary) had left the country along with vital information:\n\n“The specific route by which these [plants] were produced we could not determine.“\n\nAs Retraction Watch discovered, that appears to have been the end of high-protein cassava:\n\n“The Fauquet lab has not gone back to redo the study properly, because the Gates grant that funded the project ended a few years ago”, Carrington said.\n\nIn 2001 US special envoy Dr Andrew Young flew into Kenya to launch a GM virus-resistant sweet potato developed with Monsanto by Dr. Florence Wambugu. According to Forbes magazine its yields were “astonishing”, fully twice that of standard sweet potatoes. Dr. Wambugu, at that time the Kenyan project leader, told the Toronto Globe and Mail that her “modified sweet potato, for example, can increase yields from four tonnes per hectare to 10 tonnes”, and Canada’s National Post called GMOs a technology to pull “the African continent out of decades of economic and social despair”.\n\nThese eulogies appeared despite the absence of any scientific confirmation of the claims.\n\nSubsequently, in 2004, it was acknowledged in Kenyan newspapers and on the website GMWatch that Monsanto’s virus resistance was ineffective in field tests and an official one report even claimed that “non-transgenic crops used as controls yielded much more per tuber compared to the transgenics”. Kenyan scientists involved in field testing were quoted as saying that:\n\n“all lines tested were susceptible to viral attacks” and\n\n“The transgenic material did not quite withstand virus challenge in the field.”\n\nEven these negative reports, however, didn’t prevent this being cited once again in the US press, this time by celebrity scientist Pamela Ronald. Ronald wrote in the May 14th 2010 New York Times, that “virus-resistant sweet potatoes and high-yielding pearl millet are just a few examples of genetically engineered foods that could improve the lives of the poor around the globe.”\n\nBut in fact no GMO virus-resistant sweet potato varieties or scientific publications have ever emerged from Kenya or elsewhere. Presumably the story reported by Kenyan newspapers, that yields were considerably less than “astonishing”, was the accurate one.\n\nWhile successful nutrient-fortified crops and virus resistance traits are routinely developed in non-GMO plant breeding programmes, the creation of edible vaccines seemed to be a potentially unique opportunity for GMO crops:\n\n“Tangible consumer benefits could turn the debate on genetically modified food,”\n\nsaid Novartis CEO Daniel Vasella about the PR possibilities of edible vaccines.\n\nThe edible vaccine concept (variously, lettuce, tomatoes, bananas, and potatoes) was described by the Guardian in 2000 as “the most exciting area of biological science”, almost ready to “benefit millions of people in the developing world who could not afford western medicine.” Similar reports, spanning the years 2000-2005, appeared on PBS radio, in the New York Times, Scientific American (twice), and many other high profile media sources.\n\nThe articles typically focused on the theoretical advantages of edible vaccines (cheapness and ease of preservation) but neglected to discuss their downsides. These turn out to dwarf (as discussed at length here) the problems they are intended to solve. Some of these problems are applicable to any vaccine, but others relate to the GE process. For example, most established vaccines are not edible. They are injected expressly so as to bypass the saliva and stomach acids that would render them useless. Problems also arose getting GMO plants that produce vaccines to still grow well.\n\nBut many of the downsides of edible vaccines are more basic. Some stem from the questionable wisdom of making living medical products that are visually indistinguishable from food; others from the problems associated with self-medication by untrained individuals. With plants grown in backyards how will individuals keep track of the dose they have received? How does one safeguard the food supply against contamination with vaccine genes? How should edible vaccine programmes overcome likely inconsistencies of dose due to natural variations in climate, season, and other factors?\n\nAn alternative edible vaccine scenario often put forward, in which the vaccine is grown in a regional centre and distributed from there, poses its own problems, such as how to transport the edible vaccine, which is a perishable foodstuff, separately from the rest of the food supply?\n\nAs a consequence of these unresolved issues no product has gone beyond the status of a small initial trial in people or animals and a 2011 scientific review concluded: “Edible transgenic plant vaccines have a long way to go before they will be ready for large-scale tests”. Yet even a large-scale test is not a final product.\n\nGolden rice has the kind of PR to ensure it needs no introduction. The search term: “golden rice” + vitamin A generates 131,000 results on Google’s internet search engine.[1]\n\nGolden rice has genes inserted which produce in its endosperm modest quantities of beta-carotene, the precursor molecule of vitamin A. Golden rice has become the standard bearer for the humanitarian and beneficial use of a GMO and was famously featured on the cover of Time magazine as well as being the inspiration for eleven separate articles in the New York Times alone.\n\nAs documented in a recent report from German NGO Testbiotech, the PR campaign for golden rice patented the phrase “crime against humanity”. Typical is The Hindu of India’s description of a recent visit to that country by Nobel prizewinner Richard J. Roberts (whose prize was unrelated to agriculture). The Hindu wrote:\n\n“Describing the protest by 'green' parties in Europe against GM crops as a 'crime against humanity,' he particularly drew attention to the project to produce a GM rice variety for tackling the problem of vitamin A deficiency in India and other countries.” (The Hindu Dec 10th 2013)\n\nThe scientific reality of golden rice could hardly be more different to that implied by the heavy-handed PR. Prior to 2005, all such publicity pertained to golden rice 1 (GR1) (Ye et al. 2000). Amidst an almost total absence of journalistic scepticism, only Greenpeace and Vandana Shiva pointed out that the claims for it were false: GR1 was incapable of solving vitamin A deficiencies because the levels of beta-carotene were too low. This was disputed at the time, but it is a clear acknowledgement of GR1′s failure that Syngenta developed a new rice (GR2) (Paine et al 2005).\n\nThe current version of golden rice (GR2) has been the subject of just three scientific publications (Paine et al 2005; Tang et al 2009; Tang et al 2012). Nothing is known about its yield or agronomic characteristics and hardly any more is known about its efficacy or safety. GR2 has not been approved for commercial use or public consumption in any country. It is thus a product still in development, and indeed the transgenes in GR2 have only recently been crossed into the indica rice subspecies that most Asian people eat. There is thus what must surely be an unprecedented disparity between the number of articles generated around golden rice and its actual achievement, which currently stands at zero.\n\nOn occasion, the better parts of this press coverage have indicated that there are socio-cultural and technical obstacles to golden rice achieving genuine success in improving the nutrition of those with a Vitamin A deficiency. For a start golden rice will have to be widely grown (which means replacing many thousands of local varieties, or breeding the transgenes into each one); it must be made available to the poorest and most isolated (who actually need it); and it will have to overcome strong cultural preferences for white rice (by means not yet known). Moreover, in both scientific trials on humans (Tang et al 2009; Tang et al 2012) GR2 was immediately frozen at -70C to prevent loss of the apparently easily degraded beta-carotene.[2] It was then fed to the study participants with 10% or more butter or oil (to ensure the availability of the fat necessary for absorption of beta-carotene). It perhaps doesn’t need saying that -70C storage capability and comparably fatty diets are not characteristics of those likely to be deficient in vitamin A.\n\nThus, between its technical flaws and its requirement for very large quantities of financial resources and political will (for plant breeding, distribution, etc.), it is highly probable that golden rice will never progress beyond a nice media story.\n\nIndeed, following Greenpeace and Vandana Shiva, Michael Pollan proposed that golden rice (at that time GR1) was a “purely rhetorical technology”. Pollan’s scepticism proved fully correct, yet somehow only those three managed to disclose certain key facts. The entire science media failed, being apparently too enthralled by golden rice’s grenade-proof greenhouse in Switzerland.\n\nBut the main point, besides that New York Times readers may be the world’s most misinformed, is that golden rice is not alone, it is just one example among many of preliminary or doubtful research projects being inflated into positive global GMO news stories.\n\nThese five \"humanitarian\" GMO stories, often presented without doubts or caveats, are to be found literally by the thousands in the global news media. To adequately understand the full extent of this journalistic problem, however, it is necessary to briefly consider the specific intellectual and journalistic deficiencies they contain.\n\nFirstly, these news stories offer robust evidence that science reporting is plagued by the same fundamental problem that pervades the rest of commercial journalism. It is the problem summed up by newspaper man Lord Northcliffe as:\n\n“News is what people do not want you to print. All the rest is advertising.”\n\nIn biotech reporting, this defect is characterised firstly by missing context. Science journalism could at any point over the lifetime of biotechnology have asked some foundational public interest questions: Is the technology ready? Are the regulators competent? Why is it considered appropriate for industry to fund and conduct its own safety studies? What are the views of dissenting scientists? And many others. Yet only a tiny handful of professional science journalists have ever escaped the standard narrow framing around a specific product, which therefore leaves the reader imagining there are good answers to these questions. Michael Pollan’s excellent Playing God in the Garden is almost unique in this respect.\n\nThe second failing is that fakethrough reporting is simple old-time boosterism, whose art largely consists of leaving information out. Except it isn’t quite that innocuous. Because these products are not just the latest cell phone, the quantity of information left out is enormously large and hugely significant. As a non-technical example: when the reader is expected to believe that the agribusiness industry is operating a humanitarian enterprise, is it appropriate to leave out (or deny) the same industry’s historical record of intimidating farmers or manufacturing dangerous agricultural products and then denying and evading responsibility?\n\nThe authors of these articles may reasonably argue that in a short space some assumptions have to be made; but readers can hardly note omissions for themselves when the contradictory facts or viewpoints have never been reported, either in their own newspaper, or even in any commercial media.\n\nFor example, when the UN published a major report by hundreds of scientists proposing that industrial agriculture and GMOs were inappropriate solutions for agriculture and poverty, the New York Times never once mentioned it. Only years later did guest writers ever reference the IAASTD at “the paper of record”.\n\nAs a further example, in the typical fakethrough article, technical success is treated as a given. The presumption seems to be that biotech seed developers can introduce at will almost any trait they choose. What is never pointed out, however, is that all existing commercialised GMO crops are based on a very small number of conceptually simple modifications of conventionally-bred crops. These insect resistance and herbicide resistance traits are single genes and do not require complex understanding of, or deliberate interference with, existing biochemical pathways. In contrast, the new ‘humanitarian’ traits are (in often numerous ways) adventures into much less well understood areas of biology.\n\nThe gap between the global coverage and wide acclaim versus the ensuing reality in which two of these five ‘breakthroughs’ failed (or never existed) and the rest which never progressed, can now be understood. That vast gap is a precise and evidence-based barometer of the integrity of GMO news coverage worldwide and unquestionably it points to uniformly one-sided reporting of no value to readers. Its major use is to demonstrate the extent to which biotech journalism has been captured by agribusiness interests.\n\nThe journalistic rationale for celebrating putative future successes and discounting actual failures, was advanced by Gregg Easterbrook in a New York Times opinion piece about biofortified GMOs:\n\n“The important thing to keep in mind is that the transgenic crops in the news today are just the first manifestations of a fundamental new idea. Much better versions are coming.” (New York Times Nov 19 1999)\n\nIn this view theoretical possibilities alone are what matter; real GMO failures are irrelevant. Which just happens to be how the industry sees the situation. It is as if reporters covering the nuclear power industry, rather than describing accidents, cost overruns, or cover-ups, were to focus on the humanitarian uses of nuclear-powered electricity.[4]\n\nUnfortunately, as these and other equally important stories show, this uncritical industry-pleasing approach guides almost all science journalism today.[3]\n\nScience journalists can do better, however. Michael Pollan (in Playing God) ably dissected GMO regulatory gaps and later critiqued golden rice (nota bene: from outside the science pages), pointing out in the process golden rice’s $50 million PR budget. The website GMWatch.org frequently points out unheralded non-GMO breeding successes of comparable importance.\n\nThe way of total information control\n\nThese misreports of biotechnology are endlessly useful to the industry. Articles about supposed breakthroughs constitute the excuse for stern editorials in prestigious magazines decrying ‘irrational objections’ to GMOs. Supposed breakthroughs, like golden rice, are also an opportunity to prize open specific foreign markets. But the main benefit is less obvious but more fundamental. Agribusiness is an industry whose financial success springs ultimately from building a technological treadmill and establishing monopoly control of agriculture. However, its products are invariably dispensable to agriculture and it struggles to develop new ones. Therefore, fakethroughs’ great value is to confirm, in the eyes of the world, the industry’s claim to be ethical, innovative, and essential to a sustainable future.\n\nThe fundamental driver behind scientific misreporting, therefore, is not intellectually lazy journalists (though they do help). It is that for agribusinesses and other powerful corporations everything is at stake in science journalism. Their reputations as essential and ethical organisations are daily at risk for the reason that it is in science that the hypocrisy is most self-evident: of financing climate change denial while espousing corporate responsibility, of insisting on due process while buying ones way into the political process (or bribing government officials), of attempting to undermine environmental and worker safety legislation, while describing oneself as a clean green global good citizen, and so on.\n\nImagine if the New York Times or NBC published, under appropriately scathing headlines, a full and detailed analysis of how GMO corporations perennially manipulate the scientific literature? And then Fox News reported the real story of how the FDA, advised by its own scientists that GMOs should receive close scrutiny, took the purely political and probably illegal decision to disregard that advice? And then each story was picked up by all the other radio, print and TV news outlets? Customers would rebel, political support would disappear (not least because this would discredit the official policy information democratic representatives receive) and the industry would probably collapse. Consequently, the agbiotech industry must make sure such a scenario never happens.\n\nIt is for just this reason that BASF, Coca-Cola, Merck, L’Oreal, Monsanto, Syngenta, Smith & Nephew, the Nuclear Industry Association and their competitors now support coordinated attempts to manage scientific news coverage in the form of the UK’s Science Media Centre. And now, having decided that this method of information control is effective, or maybe that the threat from the internet is sufficiently serious, they are adding some international offshoots.\n\nThe marketing of fakethroughs is an important component of a general manipulation of the science media. But interference with the media is in turn only a part of the barely understood but vast web of influence by which the biotech industry meticulously orchestrates the perception of itself (and its products).\n\nWhat is new today, and which wasn’t the case thirty years ago, is that individual industrial sectors such as the life science industry are nowadays sufficiently profitable, monopolistic, and global that they can and do coordinate, to the mutual benefit of their larger members, the flow of information that spans three distinct but interconnected domains of thought: the public domain (TV, radio, print), the scientific domain (peer-reviewed publications), and the policy domain (government reports and bureaucratic discussions).\n\nA case in point occurred when a sceptical EU parliament commissioned (in 2007) a comprehensive report (called BIO4EU) into the claims behind the new ‘knowledge-based bio-economy’. Though the evidence base uncovered in the report was extraordinarily weak the life science industry mobilised its resources to ensure that the document text inflated the underlying data and the executive summary inflated the text to the extent that thousands of biotech jobs were converted into millions. The EU parliament was even told, in BIO4EUs summary, that the new bio-economy would\n\n“break the link between economic growth and pressure on the environment”\n\n(though this assertion was not mentioned or justified in the text) and that:\n\n“It is said that money does not grow on trees, but more of our economic prosperity will be based on agricultural produce. Not only will farmers grow food for a larger population, but much of the economy will also be based on the raw materials they grow: new foods, biofuels, and biomaterials.”\n\nNothing in the underlying data of the report itself warranted these conclusions but concerted industry pressure on the independent EU institute that prepared the report averted a potential disaster for the industry. Obviously, the fakethrough data that was appearing in the print media must not be contradicted by policy-oriented research.\n\nThe EU parliamentarians were probably never made aware that their report was nothing but a giant fraud, but this case demonstrates the extent to which industry PR efforts extend, to use a military term, to full spectrum dominance of the total information environment. This is how it becomes possible for an industry image of ever increasing ambition to be separated from dull reality by a gulf so enormous that, were it to open, it would probably swallow the industry whole.\n\nBut in this the biotech industry is no different from almost every realm of economic activity. From the food industry to the mining industry, to the conduct of wars, very few people would support these activities in anything like their present form if they were fully understood. It follows that the underlying reason businesses operate as they do is that the modern press fails in its fundamental purpose. In 1822 James Madison wrote that:\n\n“A popular government without popular information or the means of acquiring it, is but a prologue to a farce or a tragedy or perhaps both.”\n\nThis statement was surely intended to be understood literally, and now, two hundred years later, when we have entered fully into the state which James Madison envisaged, it is time to take Madison at his word and ask: Is it not possible that solving the great problems of our age: climate change, social injustice, and ecological sustainability, is as simple as creating an effective media? Or, to put it another way, can it be done without one?\n• None The probable reason is that rice is dry while other sources of beta-carotene (e.g. spinach) are hydrated. The high water content probably normally protects the beta-carotene from oxidation.\n• None Internalisation of industry PR is also obvious in the value-laden terminology with which journalists refer to biotechnology. The science media has failed to dissect the language that the industry uses, and which intentionally obscures what is actually being done. Genes are “added” as if biotechnology were a simple mathematics problem; organisms are genetically “engineered” as if they were not living systems; traits are described as “approved” even though (in the US) FDA merely consults, the USDA has a very narrow remit and the EPA often has no role at all.\n• None There are intriguing parallels between nuclear power and genetic engineering. Both technologies are unnecessary (in the sense that both make a product (electricity, seeds) that was already being made, and less expensively), both are cumbersome and resource-intensive compared to their competitors, both are doubted by the wider public, and both are largely driven by an agenda their proponents attempt to keep hidden. In the case of nuclear power that agenda is to conceal activities associated with nuclear weapons and often to milk them for subsidies. For GMOs the concealed agenda is to exploit the intellectual property potential of transgenes to monopolise the seed supply and so to ultimately control agriculture. But perhaps the most important parallel is that both are attempts to control within narrow parameters, and over extended time periods, highly complex and improperly understood systems (nuclear reactors and living organisms). In this respect the two technologies are probably unique among all human endeavours.\n\nAbhary M, Siritunga D, Stevens G, Taylor N J, Fauquet CM (2011) Transgenic Biofortification of the Starchy Staple Cassava (Manihot esculenta) Generates a Novel Sink for Protein. PLoS One DOI: 10.1371/journal.pone.0016256\n\nPaine J.A., Shipton, C.A., Chaggar, S., Howells, R.M., Kennedy, M.J., Vernon, G., Wright, S.Y., Hinchliffe, E., Adams, J.L., Silverstone, A.L. & Drake, R., (2005) Improving the nutritional value of Golden Rice through increased pro vitamin A content. Nature Biotechnology, 23: 482-487.\n\nTang G, J Qin, GG Dolnikowski, RM Russell, and MA Grusak (2009) Golden Rice is an effective source of vitamin A. Am J Clin Nutr 89: 6 1776-1783.\n\nTang G, Y Hu, S Yin, Y Wang, GE Dallal, MA Grusak, and RM Russell (2012) β-Carotene in Golden Rice is as good as β-carotene in oil at providing vitamin A to children. Am J Clin Nutr 96: 658-664.\n\nSong WY, Wang G-L, Chen L-L, Kim H-S, Pi L-Y, Holsten T, et al (1995) A receptor kinase-like protein encoded by the rice disease resistance gene, Xa21″. Science 270 (5243): 1804–6. December 1995. doi:10.1126/science.270.5243.1804.\n\nYe, X. et al. (2000) Engineering the provitamin A (b -carotene) biosynthetic pathway into (carotenoid-free) rice endosperm. Science 287: 303–305.\n\nYet the scientific foundation of these breakthroughs is weak; they are invariably based on preliminary or unpublished research, or they have already failed. What they primarily showcase is the failure of the science press to fulfill the requirements of rigorous and sceptical journalism. The ag-biotech industry has taken full advantage of this to project an image of itself as ethical, innovative, and essential to a sustainable future that is virtually unrelated to reality.", "opengraph": {"type": "website", "title": "Fakethrough! GMOs and the capitulation of science journalism", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/85-2014/15240-fakethrough-gmos-and-the-capitulation-of-science-journalism", "description": "\r\nGolden rice is just one example among many of preliminary or doubtful research projects being inflated into positive global GMO news stories, writes Dr Jonathan Latham\r\n", "image": "https://www.gmwatch.org/images/banners/Yet-another-fake-bioteck-breakthrough.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://www.independentsciencenews.org/science-media/fakethrough-gmos-and-the-capitulation-of-science-journalism/"], "authors": ["Annie"], "publish_date": "2014-01-07T12:25:44+00:00"}