{"result_id": "137047", "URL": "https://www.gmwatch.org/en/news/archive/2005/7790-the-irresistible-rise-of-tonys-crony-20112005", "timestamp": "2023-04-25 15:18:37 CEST+0200", "meta": {"description": "Latest news on GMO food, GMO crops, GMO labelling and genetically modified organisms", "lang": "en", "keywords": "GMO, GMOs, GMO food, GMO labelling, GM, anti-GM, ban GM, non-GM, pro-GM, GM food, biotechnology, biotech, gm myths, transgenic, GM free, genetically modified, GM campaign, GM Watch, GMWatch, lobbywatch, spinprofiles, GM contamination, genetically engineered, GE, non-GE, GE-free, non-GMO, no GMOs, ban GMOs, stealth GMOs, GMO-free, GMO-free zone, GM crop, GM crops, gene, genetic, genetics, Monsanto, Monsanto Corporation, St. Louis, Solutia, Syngenta, Bayer, Dow, BASF, IG Farben, Aventis, Hoechst, food, food safety, farming, farmer, agriculture, feeding the world, feed the world, food crisis, animal feed, GM feed, GM animal feed, GM soya, GM soy, soya, GM maize, maize, corn, GM corn, cotton, GM cotton, seed, seeds, GM seeds, Chapela, Pusztai, label, labels, labelling, patent, patents, organic, chemical, Agent Orange, dioxin, PBCs, rBGH, BST, biofortification, golden rice, hunger, global hunger, biosafety, seeds, Bt, Bt cotton, environment, environmental, ecology, hazard, risk, precautionary, EU, EFSA, hype, FDA, EPA, Dupont, Roundup, Roundup Ready, glyphosate", "favicon": "", "canonical": "https://www.gmwatch.org/en/news/archive/2005/7790-the-irresistible-rise-of-tonys-crony-20112005", "encoding": "utf-8"}, "image": null, "domain": "www.gmwatch.org", "title": "The irresistible rise of Tony's crony", "cleaned_text": "Yet another scandal has broken around the widely tipped successor to Lord Sainsbury as Blair's Science Minister.\n\nLord Drayson, the former heard former head of the biotech industry lobby group the BioIndustry Association, was peviously at the centre of the cash for contracts scandal over the smallpox vaccine purchased from his Powederject company by the Ministry of Defence, where he now works a Blair Minister.\n\nThe smallpox contract made Drayson's fortune. Drayson was made a life peer in 2004 after selling Powderject. \n\nhttp://www.lobbywatch.org/archive2.asp?arcid=5220\n\n\n\nThe Irresistible Rise of Tony's Crony: A Money Programme Special. BBC TWO at 10pm on Monday 21 November. \n\n---\n\nThe irresistible rise of Tony's crony \n\nBy Elliot Choueka \n\nBBC Money Programme, 17 Novemnber 2004 \n\nhttp://news.bbc.co.uk/2/hi/business/4446978.stm\n\n[picture caption: Is Lord Drayson the best man for the job?]\n\nPaul Drayson is the Labour Party's leading businessman in government.\n\nHe was made a lord and then the UK defence procurement minister after giving New Labour more than £1m.\n\nIn 2004 he was the party's largest individual donor.\n\nThe Money Programme can reveal that he also ran a company which sold faulty TB vaccines and kept quiet about it for 21 months, risking the health of thousands of people.\n\nPaul Rudd Drayson was born and brought up in South London, educated at Catford's private St. Dunstan's school.\n\nHe got a degree and a PhD at Aston University, and worked in the car business, before moving on to lead a management buy-out of a division of Trebor, the sweet manufacturer.\n\nHe then got into the bio-tech business.\n\nIt was a time of growth and boom in the sector and new futuristic inventions were being snapped up by entrepreneurs with an eye for a business opportunity.\n\nIt was at Oxford University that Paul spotted the value of a revolutionary needle-free injection system.\n\nWith the device's inventor he formed a company to develop the technology.\n\nPowderject was its name.\n\nDr. John Savopoulos, an analyst at Datamonitor who specialises in the vaccine business, recalls the excitement surrounding the PowderJect device.\n\nThere are question marks over how that business was conducted that go to the very heart of Drayson's credibility so he must answer those questions\n\n\"It signed a $300m (£175m) agreement with Glaxo Wellcome at the time, for DNA vaccines.\" he says.\n\n\"It seemed to be present at all the international conferences as a company pushing forward the frontiers.\"\n\nAlthough the company attracted millions of pounds worth of investment and floated on the stock market, the Powderject device has never made it to market. It is still being developed.\n\nIt was a move which was to make Mr Drayson's fortune.\n\nDuring his ownership of the factory there were a number of problems with four different vaccines - polio, flu, hepatitis A and most worryingly the TB (BCG) vaccine, supplied to the National Health service in Britain.\n\nOfficial documents from the MHRA, the UK Health regulator, obtained by the Money Programme show that the company had been carrying out monitoring of its own TB (BCG) vaccines.\n\nThe tests showed that from 1989 to 2002, nine batches of the BCG vaccine failed to \"meet the end of shelf-life potency criteria\", as it is written in the document.\n\nThis means the vaccine was no longer as effective as it should have been.\n\nTo make matters worse, the MHRA was kept in the dark.\n\nThe risk to the public is that of the millions of people - nearly all schoolchildren - who have been vaccinated, an unknown number face the real possibility that their TB vaccines were sub-strength and may not provide immunity.\n\nOne unofficial estimate, based on health department figures, is that since the tests began in 1989 - long before Drayson bought the factory - nine batches, that is perhaps as many as 900,000 BCG doses, failed shelf-life tests.\n\nIf you take a 2% failure rate - which is what happened when a Powderject sub-batch failed in Ireland - then 18,000 people have been vaccinated but may not be protected from TB.\n\nNo-one, and that includes the British government, knows for sure.\n\nDr Savopoulos says of the non-disclosure: \"to produce a vaccine that's given to thousands of school children to protect them against TB and-and the vaccine isn't working, is unforgivable\".\n\nAlthough the problems with the TB vaccine are the most alarming failures at the Powderject plant, three different health regulators - the British, the Americans and the Irish - made repeated complaints about Powderject's TB (BCG), polio, hepatitis and flu jabs.\n\nInspectors from the US Food and Drug Administration (FDA) visited the plant twice in 2001 and once in 2003.\n\nThey found 'significant objectionable conditions' at the factory, discovered that four out of five flu vaccine batches destined for the US market failed shelf-life tests and, perhaps most worrying of all, bacterial contamination of the manufacturing process for the flu jab.\n\nBacteria including Klebsialla Oxytoca and Serratia were identified in factory areas where the flu vaccine was manufactured.\n\nIn 2003 Mr Drayson sold Powderject to Chiron, an American pharmaceutical giant, for more than £500m.\n\nJust over a year later its flu vaccine production-line was shut down by the FDA.\n\nThe result was a mass-shortage of flu vaccine in the American market.\n\nAlong the way he has become a seriously rich man, with him and his family worth an estimated £80m.\n\nHe gave more than £1m to the NHS hospital in Oxford where his third son was born, and also more than £1m to New Labour.\n\nHe has a million pound motor yacht in Antibes and a £7m chateau in the South of France.\n\nNow Labour MP, Dr Ian Gibson and Conservative MP Henry Bellingham are calling for a public inquiry into the events that brought Lord Drayson such wealth, to ensure public confidence in mass vaccinations and to ensure that nothing untoward occurred at Powderject.\n\n\"There are question marks over how that business was conducted that go to the very heart of Drayson's credibility so he must answer those questions,\" says Mr Bellingham.\n\n\"And the government, I think, should make sure that he answers those questions as soon as possible if he is to continue in his office.\"\n\nAdds Dr Gibson, who is a former chairman of the House of Commons science and technology committee: \"I think we need a public inquiry into this whole business.\"\n\n\"Because I think if we're going to produce good flu vaccines and other vaccines, we need to make sure that the process that's making them is above board and there's no corners being cut.\n\n\"A public inquiry into this situation would be quite interesting and we'll see where responsibility did lie.\"\n\nThe Money Programme has contacted Lord Drayson for a response to the many issues raised in the programme but has received no reply.", "opengraph": {"type": "website", "title": "The irresistible rise of Tony's crony", "url": "https://www.gmwatch.org/en/main-menu/news-menu-title/archive/44-2005/7790-the-irresistible-rise-of-tonys-crony-20112005"}, "tags": [], "tweets": [], "movies": [], "links": ["http://twitter.com/share", "http://www.lobbywatch.org/archive2.asp?arcid=5220", "http://news.bbc.co.uk/2/hi/business/4446978.stm"], "authors": [], "publish_date": "2005-11-20T19:34:49+00:00"}