{"result_id": "138025", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.tampabay.com%2Fnews%2Fflorida-politics%2F2022%2F12%2F01%2Fmore-deaths-among-vaccinated-americans-not-reason-avoid-vaccines-experts-say%2F", "timestamp": "2023-04-25 15:19:14 CEST+0200", "meta": {"description": "PolitiFact | It actually underscores the importance of staying up-to-date on boosters.", "lang": "en", "keywords": "", "favicon": "/pf/favicon.ico", "canonical": "https://www.tampabay.com/news/florida-politics/2022/12/01/more-deaths-among-vaccinated-americans-not-reason-avoid-vaccines-experts-say/", "encoding": null}, "image": null, "domain": "www.godlikeproductions.com", "title": "More deaths among vaccinated Americans not a reason to avoid vaccines, experts say", "cleaned_text": "A recent Washington Post headline about vaccinated Americans comprising the majority of COVID-19 deaths has been shared widely on social media to suggest that getting vaccinated is worthless.\n\n“Vaccinated people now make up a majority of covid deaths,” read the headline of the Nov. 23 article. It has since been changed to read, “Covid is no longer mainly a pandemic of the unvaccinated. Here’s why.”\n\nThe article delves into the reasons why vaccinated people now make up a greater share of COVID-19 deaths. But the social media posts have shared only the headline, and not the article’s context. “Looks like your experimental jab was pointless,” read the caption on one Instagram post.\n\nIt is true that people vaccinated against COVID-19 now comprise the majority of COVID-19 deaths in the U.S., but that’s been the case since April, and it is not a verdict on vaccine effectiveness, said Cynthia Cox, vice president at the Kaiser Family Foundation. Cox conducted the analysis for The Washington Post, updating numbers that she and others had written about in April for Kaiser Family Foundation.\n\n“It would be a misrepresentation of this finding to say it is evidence against vaccination. This finding actually underscores the importance of staying up-to-date on boosters,” Cox said.\n\nShe provided PolitiFact with the same data she shared with The Washington Post; it showed that in August, the last month of data available, 58% of deaths from COVID-19 were among vaccinated people (either with an initial two-dose regimen, or a booster), compared with 42% for unvaccinated people.\n\nThe latest figure for vaccinated people is down slightly from previous months — the data showed vaccinated people comprised 62% of the deaths in May and June.\n\nThings have been heading in that direction for a while, with vaccinated Americans steadily making up a greater share of COVID-19 deaths, according to an article Cox co-authored for Kaiser Family Foundation in April.\n\nOne reason for the trend is that there are far more vaccinated people than unvaccinated. Also, vaccine effectiveness wanes over time, and low numbers of people have received updated booster shots, experts said.\n\nMore people are vaccinated than not\n\nTwo years into the rollout of COVID-19 vaccines, there are far more people vaccinated against the virus than unvaccinated, so it’s not unexpected that vaccinated people now make up the majority of hospitalizations or deaths.\n\n“This does not mean the vaccines don’t work,” said Dr. Monica Gandhi, a professor of medicine at the University of California San Francisco.\n\n“The truth is we always knew we would see a growing proportion of vaccinated individuals among our COVID admissions,” said Dr. Shira Doron, infectious disease physician and hospital epidemiologist at Tufts Medical Center. “If 100% of the population were vaccinated — and that is what we wished for — then 100% of COVID hospitalizations and deaths would be among the vaccinated.”\n\nWhat’s more important is to consider whether the vaccine is preventing hospitalizations and deaths in vaccinated people versus the unvaccinated.\n\n“When you look at the numbers that way, you see the vaccine is still very effective,” Doron said.\n\nThe latest data from the Centers for Disease Control shows that the death rate per 100,000 people among unvaccinated people was 1.32 on Sept. 25. By comparison, the rate for people vaccinated but without the updated bivalent booster is 0.26 per 100,000 people. And among those who have received the bivalent shot, it is 0.07 per 100,000 people.\n\nThat means people 12 and older who received the updated booster were 14.9 times less likely to die from COVID-19 than unvaccinated people, the CDC said.\n\nIn addition, older Americans are more likely to be vaccinated than younger Americans, but are also at greater risk of dying from COVID-19.\n\nThe latest vaccine data from the CDC shows that 68.8% of all Americans have completed a primary series of vaccines. Among people over age 65, 93.8% have received at least a primary series.\n\n“Vaccinated and boosted people, on average, are older and more likely to have underlying health conditions that put them at risk for severe COVID outcomes,” Cox said.\n\nAnother Washington Post analysis published this week shows nearly 9 out of 10 deaths from COVID-19 in the U.S. are now among people over age 65.\n\nThat’s only part of the story. Other factors affecting COVID deaths include waning vaccine protection, low numbers of people receiving updated boosters and natural immunity protection among the unvaccinated population, Cox said.\n\nStudies have shown vaccine protection wanes, Cox said, which is “why it’s especially important for people at higher risk to stay up-to-date on boosters.”\n\nBut not many people have received the most recent bivalent booster, which targets the more prevalent omicron strain of COVID-19. Only 31.3% of people over age 65, the most vulnerable age group, have received the updated booster shot, CDC data shows. And among those ages 5 and older, only 12.1% of the population have received it.\n\nCox noted that many unvaccinated people have had COVID-19 at least once, and those who survived “may have gained some immune protection against the virus that can help protect them against severe outcomes when they have subsequent infections.”\n\nStill, she said, hundreds of thousands of unvaccinated people “have needlessly died” from the virus.\n\nU.S. deaths from COVID-19 have steadily decreased. There were more than 17,000 COVID-19 deaths in the week ending Feb. 2, compared with 2,644 the week ending Nov. 23. But COVID-19 is still on track to be the third-leading cause of death again this year, for the third year in a row, according to Kaiser Family Foundation.\n\n“Bottom line: Vaccines save lives,” said Doron, from Tufts Medical Center, who said the number of deaths among the vaccinated “should not be used by anyone to support any agenda to the contrary.”\n\nCorrection: This story was updated to note that people 12 and older who had received the bivalent booster were 14.9 times less likely to die from COVID-19 than unvaccinated people.", "opengraph": {"type": "article", "title": "More deaths among vaccinated Americans not a reason to avoid vaccines, experts say", "site_name": "Tampa Bay Times", "url": "https://www.tampabay.com/news/florida-politics/2022/12/01/more-deaths-among-vaccinated-americans-not-reason-avoid-vaccines-experts-say/", "description": "PolitiFact | It actually underscores the importance of staying up-to-date on boosters.", "image": "https://www.tampabay.com/resizer/hnXgJRRtRcy9S1fehliFxoNnBhc=/1200x675/smart/cloudfront-us-east-1.images.arcpublishing.com/tbt/WAES45ERRHM2STCOPHC5HGLTBY.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://web.archive.org/web/20221123173512/https://www.washingtonpost.com/politics/2022/11/23/vaccinated-people-now-make-up-majority-covid-deaths/", "https://www.washingtonpost.com/politics/2022/11/23/vaccinated-people-now-make-up-majority-covid-deaths/", "https://archive.ph/8HFSY", "https://archive.ph/EWSPb", "https://archive.ph/Iaagy", "https://archive.ph/FaE16#selection-181.16-181.63", "https://www.healthsystemtracker.org/brief/covid19-and-other-leading-causes-of-death-in-the-us/#COVID-19%20deaths%20among%20unvaccinated%20adults%20that%20likely%20could%20have%20been%20prevented%20with%20vaccinations,%20June%202021-March%202022", "https://www.healthsystemtracker.org/brief/covid19-and-other-leading-causes-of-death-in-the-us/#Share%20of%20adult%20population%20and%20adult%20COVID-19%20deaths%20by%20vaccination%20status,%2025%20jurisdictions%20in%20the%20U.S.,%20June%202021%20to%20February%202022", "/newsletters/", "https://covid.cdc.gov/covid-data-tracker/#rates-by-vaccine-status", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-total-admin-rate-total", "https://www.washingtonpost.com/health/2022/11/28/covid-who-is-dying/", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7107e2.htm", "https://www.thelancet.com/journals/lanhl/article/PIIS2666-7568(22)00147-7/fulltext#seccestitle140", "https://covid.cdc.gov/covid-data-tracker/#trends_weeklydeaths_select_00", "https://www.healthsystemtracker.org/brief/covid-19-leading-cause-of-death-ranking/"], "authors": [], "publish_date": "2022-12-01T10:00:00.835Z"}