{"result_id": "138022", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Ftimesofindia.indiatimes.com%2Fcity%2Famaravati%2Fandhra-pradesh-50-year-old-sanitation-worker-dies-24-hours-after-getting-vaccine-shot-in-tirupati%2Farticleshow%2F80792619.cms", "timestamp": "2023-04-25 15:19:06 CEST+0200", "meta": {"description": "A 50-year-old sanitation worker died within 24 hours after being administered a Covid-19 vaccine in Andhra Pradesh’s Tirupati on Wednesday.", "lang": "en", "keywords": "Amaravati news, Amaravati latest news, Amaravati news live, Amaravati news today, Today news Amaravati,covid-19,Andhra pradesh corona,andhra covid-19,Andhra covid,andhra coronavirus", "favicon": "https://m.timesofindia.com/touch-icon-iphone-precomposed.png", "canonical": "https://timesofindia.indiatimes.com/city/amaravati/andhra-pradesh-50-year-old-sanitation-worker-dies-24-hours-after-getting-vaccine-shot-in-tirupati/articleshow/80792619.cms", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Andhra Pradesh: 50-year-old sanitation worker dies 24 hours after getting vaccine shot in Tirupati | Amaravati News - Times of India", "cleaned_text": "TIRUPATI: A 50-year-old sanitation worker died within 24 hours after being administered a Covid-19 vaccine in Andhra Pradesh’s Tirupati on Wednesday.The deceased was identified as Krishnaiah, a resident of Ambedkar Colony of Mallamgunta panchayat.According to his family members, Krishnaiah was administered the vaccine at 10.30-11am on Tuesday as part of the second phase vaccination drive.His family members said that Krishnaiah suffered a cardiac arrest while he was at home on Wednesday morning.He was immediately rushed to the SVRR government general hospital in Tirupati where he was declared brought dead.Family members of the deceased alleged that Krishnaiah who was hale and hearty died only because of the side effects caused after being vaccinated.However, Chittoor district medical and health officer Dr Penchalaiah told reporters that Krishnaiah may have died due to a cardiac arrest and not because of the side effects caused due to vaccination.\"It is not true that the Covid-19 vaccine side effects led to his death. He may have died due to cardiac arrest. Krishnaiah was administered the Covid-19 vaccine on Tuesday morning, following which he was monitored for half an hour at the booth itself. During the observation period, there were no signs of any adverse side effects,\"stated DMHO Dr Penchalaiah.\"But because questions are being raised about his death which occurred within 24 hours after being vaccinated, we have decided to conduct a panel autopsy to ascertain the exact cause of his death. Also, a group of specialist doctors will elaborately discuss the adverse events following immunization (AEFI), if any, in this particular case,\"asserted Dr Penchalaiah.Pointing out that 30,000 odd frontline workers were administered Covid-19 vaccines in the district so far and that there have literally been no cases of any major side effects, Chittoor DMHO Dr Penchalaiah added that all those who were administered the vaccine were quite normal and did not suffer from any side effects whatsoever.", "opengraph": {"title": "Andhra Pradesh: 50-year-old sanitation worker dies 24 hours after getting vaccine shot in Tirupati | Amaravati News - Times of India", "url": "https://timesofindia.indiatimes.com/city/amaravati/andhra-pradesh-50-year-old-sanitation-worker-dies-24-hours-after-getting-vaccine-shot-in-tirupati/articleshow/80792619.cms", "image": "https://static.toiimg.com/thumb/msid-80792726,width-1070,height-580,imgsize-113018,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "description": "A 50-year-old sanitation worker died within 24 hours after being administered a Covid-19 vaccine in Andhra Pradesh’s Tirupati on Wednesday. ", "image:width": "1070", "image:height": "580", "site_name": "The Times of India", "type": "article"}, "tags": ["Covid-19"], "tweets": [], "movies": [], "links": ["https://timesofindia.indiatimes.com/topic/covid-19"], "authors": [], "publish_date": "2021-02-10T22:41:00+05:30"}