{"result_id": "138027", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.biorxiv.org%2Fcontent%2F10.1101%2F2021.02.23.432474v1", "timestamp": "2023-04-25 15:19:17 CEST+0200", "meta": {"description": "bioRxiv - the preprint server for biology, operated by Cold Spring Harbor Laboratory, a research and educational institution", "lang": "en", "keywords": "", "favicon": "https://www.biorxiv.org/sites/default/files/images/favicon.ico", "canonical": "https://www.biorxiv.org/content/10.1101/2021.02.23.432474v1", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "SARS-CoV-2 causes brain inflammation and induces Lewy body formation in macaques", "cleaned_text": "", "opengraph": {"title": "SARS-CoV-2 causes brain inflammation and induces Lewy body formation in macaques", "url": "https://www.biorxiv.org/content/10.1101/2021.02.23.432474v1", "site_name": "bioRxiv", "description": "SARS-CoV-2 may cause acute respiratory disease, but the infection can also initiate neurological symptoms. Here we show that SARS-CoV-2 infection causes brain inflammation in the macaque model. An increased metabolic activity in the pituitary gland of two macaques was observed by longitudinal positron emission tomography-computed tomography (PET-CT). Post-mortem analysis demonstrated infiltration of T-cells and activated microglia in the brain, and viral RNA was detected in brain tissues from one animal. We observed Lewy bodies in brains of all rhesus macaques. These data emphasize the virus’ capability to induce neuropathology in this nonhuman primate model for SARS-CoV-2 infection. As in humans Lewy body formation is an indication for the development of Parkinson’s disease, this data represents a warning for potential long-term neurological effects after SARS-CoV-2 infection.\n\nOne-Sentence Summar SARS-CoV-2 causes brain inflammation and Lewy bodies, a hallmark for Parkinson, after an asymptomatic infection in macaques.\n\n### Competing Interest Statement\n\nThe authors have declared no competing interest.", "type": "article", "image": "https://www.biorxiv.org/sites/default/files/images/biorxiv_logo_homepage7-5-small.png"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Amber Q. Mayenburg", "Department of Pathology", "Marieke A. Stammes", "Marianna Bugiani", "Biomedical Primate Research Centre (BPRC)", "Jan A.M. Langermans", "philippens@bprc.nl", "http://orcid.org/0000-0001-5330-2617", "Ernst J. Verschoor", "Jacqueline A. Wubben", "Zahra C. Fagrouch", "Lioe-Fee de Geus-Oei", "Babs E. Verstrepen", "Department of Radiology, Leiden University Medical Center", "Ronald E. Bontrop", "Biomedical Photonic Imaging Group, University of Twente", "Kinga P. Böszörményi", "Jinte Middeldorp", "Eva Roos", "Department of Biology, Theoretical Biology and Bioinformatics, Utrecht University", "Bernadette Schurink", "Diana Lozovagia", "Ingrid H.C.H.M. Philippens", "Willy M. Bogers", "Department Population Health Sciences, Division of Animals in Science and Society, Faculty of Veterinary Medicine, Utrecht University", "Nikki van Driel"], "publish_date": null}