{"result_id": "138028", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.sciencemag.org%2Fnews%2F2021%2F07%2Fscientists-quit-journal-board-protesting-grossly-irresponsible-study-claiming-covid-19", "timestamp": "2023-04-25 15:19:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/products/aaas/releasedAssets/images/favicon/favicon/favicon-2e8a2b125385ae5ae8b5890099c6f845.ico", "canonical": "https://www.science.org/content/article/scientists-quit-journal-board-protesting-grossly-irresponsible-study-claiming-covid-19", "encoding": "UTF-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Scientists quit journal board, protesting ‘grossly irresponsible' study claiming COVID-19 vaccines kill", "cleaned_text": "'s COVID-19 reporting is supported by the Heising-Simons Foundation.\n\nSeveral respected virologists and vaccinologists have resigned as editors of the journal to protest its 24 June publication of a peer-reviewed article that misuses data to conclude that \"for three deaths prevented by [COVID-19] vaccination, we have to accept two inflicted by vaccination.\"\n\nSince Friday, at least six scientists have resigned positions as associate or section editors with , including Florian Krammer, a virologist at the Icahn School of Medicine at Mount Sinai, and Katie Ewer, an immunologist at the Jenner Institute at the University of Oxford who was on the team that developed the Oxford-AstraZeneca COVID-19 vaccine. Their resignations were first reported by Retraction Watch.\n\n\"The data has been misused because it makes the (incorrect) assumption that all deaths occurring post vaccination are caused by vaccination,\" Ewer wrote in an email. \"[And] it is now being used by anti-vaxxers and COVID-19-deniers as evidence that COVID-19 vaccines are not safe. [This] is grossly irresponsible, particularly for a journal specialising in vaccines.\"\n\nThe paper is a case of \"garbage in, garbage out,\" says Helen Petousis-Harris, a vaccinologist who directs the Vaccine Datalink and Research Group at the University of Auckland and who also resigned as a editor after reading the paper. Diane Harper, an epidemiologist at the University of Michigan, Ann Arbor, who was founding editor-in-chief of , also resigned, as did Paul Licciardi, an immunologist at Murdoch Children's Research Institute in Parkville, Australia, and Andrew Pekosz, a respiratory virologist at the Johns Hopkins University Bloomberg School of Public Health.\n\nThe resignations began Friday, the day after the paper was published. By early Monday, Fanny Fang, the journal's managing editor, wrote to the editorial board members that —a reputable open-access journal launched in 2013 by Basel, Switzerland–based publisher MDPI—had opened an investigation into the paper. \"We are treating this case with the utmost seriousness and are committed to swiftly correcting the scientific record,\" she wrote.\n\nLater on Monday, 's editors published an Expression of Concern about the paper. \"The major concern is the misrepresentation of the COVID-19 vaccination efforts and misrepresentation of the data,\" they wrote. (On 2 July, the journal officially retracted the paper.)\n\nThe paper has drawn nearly 350,000 readers as of 1 July and has been tweeted by antivaccination activists with hundreds of thousands of followers.\n\nNone of the paper's authors is trained in vaccinology, virology, or epidemiology. They are: Rainer Klement, a physicist who studies ketogenic diets in cancer treatment at the Leopoldina Hospital in Schweinfurt, Germany; Wouter Aukema, an independent data scientist in Hoenderloo, Netherlands; and first author Harald Walach, a clinical psychologist and science historian by training who until 30 June was a health researcher at Poznan University of Medical Sciences in Poland. (The university said in a statement that it severed its relationship with Walach on that date, adding: \"We wish to emphasize most strongly that the [Vaccines] article does not express the views of our university.\")\n\nThe three peer reviewers on the paper, two of them anonymous, did not offer any substantial criticism of the authors' methodology in these brief reviews. One of them, Anne Ulrich, a chemist who directs the Institute of Biological Interfaces and is chair of biochemistry at the Karlsruhe Institute of Technology in Germany, wrote that the authors' analysis \"is performed responsibly … and without methodological flaws … and the results were interpreted with the necessary caveats.\"\n\nUlrich reiterated that view in a 1 July email to Insider: \"The analysis by Walach et al. was done in my opinion responsibly and without flaws,\" she wrote.\n\nOne of the anonymous reviewers wrote that the manuscript \"is very important and should be published urgently,\" offering almost no other comment.\n\nDamaris Critchlow, head of publication ethics for MDPI, wrote in an email to ScienceInsider that its academic editor, Ralph DiClemente, a health psychologist at New York University, made the decisions to send the article out for peer review and to publish it. \"We are … consulting the Editor-in-Chief and Editorial Board to establish further ways to support our Academic Editors,\" she wrote. Petousis-Harris says: \"It's very evident from their reviews that they don't have any topic expertise. The authors don't either. It's a bit remiss when you don't bring any of a large body [of expert vaccine safety scientists] into your study and manuscript review.\"\n\nTo draw their conclusions, the paper's authors computed COVID-19 deaths prevented by vaccines by using data from a study of 1.2 million Israelis, half of whom received the Pfizer-BioNTech vaccine and half of whom did not. They estimated that 16,000 people needed to be vaccinated to prevent one COVID-19 death—a measure that is problematic, critics say, because as a vaccine succeeds, the number of people that must be vaccinated to prevent a death grows ever-larger.\n\nTo compute deaths \"caused\" by vaccine side effects, they used EU data on the number of vaccine doses delivered in the Netherlands and data from that country's national database for adverse drug reaction reporting, which was more voluminous than registry data from other EU countries.\n\nThe Netherlands Pharmacovigilance Center, called Lareb, is similar to the United States's VAERS reporting system, in which anyone can file a report of an adverse event that occurs after vaccination; the existence of a report in the database does not prove a vaccine caused an adverse event or death. Such databases are not used to systematically assess vaccine risks, but to search for early signals of rare but real vaccine side effects, such as the clotting disorder associated with some COVID-19 vaccines, that can then be followed up with systematic study.\n\nThe website of the Dutch registry clearly notes its reports do not imply causality. But the authors reported that, using it, they found \"16 serious side effects per 100,000 vaccinations and the number of fatal side effects is at 4.11/100,000 vaccinations. For three deaths prevented by vaccination we have to accept two inflicted by vaccination.\"\n\nOn 25 June, the day after the paper's publication, Lareb's head of science and research, Eugène van Puijenbroek, sent an email to 's editors, criticizing the paper and requesting a correction or retraction.\n\n\"A reported event that occurred after vaccination is … not necessarily being caused by the vaccination, although our data was presented as being causally related by the authors,\" van Puijenbroek wrote. \"Suggesting all reports with a fatal outcome to be causally related is far from truth.\"\n\nHe also took the authors to task for stating in the paper that \"the Dutch [registry] data, especially the fatal cases, were certified by medical specialists.\"\n\n\"This point is simply incorrect,\" van Puijenbroek wrote. \"The authors seem to refer to [Lareb's] policy plan. However, in this plan (in Dutch), it is nowhere mentioned that the reports are ‘certified' by medical specialists.\"\n\nIn an email to Insider, van Puijenbroek also worried that the paper will erode public willingness to report to the Dutch registry. \"[People who report adverse events to us] have to be sure that the data they are contributing will be used in a correct and scientific sound way. Articles like this undermine this confidence.\"\n\nWalach, the first author, says he stands by the paper. He adds that the clinical trials of the vaccines that are now authorized for emergency use, which involved tens of thousands of people, \"were not big enough or long enough to really see whatever safety concerns you will have.\"\n\nAukema adds that he's pleased about the controversy, because it means \"the [COVID-19 vaccine safety] topic is getting a lot of attention. I'm happy about that.\"\n\nThe three authors submitted a rebuttal to 's expression of concern on 29 June. In it, they write that they interpreted Lareb's public statements \"to mean that those reports that are obviously without any foundation are taken out such that the final data-base is at least reliable to some degree.\"\n\nThe authors also insist that they did not imply that the side effects reported in the Dutch registry were necessarily caused by COVID-19 vaccines. \"Currently we only have association, we agree, and we never said anything else.\"\n\nAfter the retraction was published, Petousis-Harris wrote to ScienceInsider: \"I am pleased with the way they have handled it so happy to stay on [the Editorial Board.] Mistakes were made but they seem to have owned it and followed a rapid retraction process.\"\n\nHarper, the journal's founding Editor-in-Chief, also rejoined the board after the retraction was published, she wrote in an email, \"because the journal management and leadership has acted quickly to retract the article and to change editorial internal processes about review.\"\n\n*Update, 7 July, 11:30 a.m.: This article has been updated to note that Poznan University of Medical Sciences terminated Harald Walach's employment on 30 June.\n\n*Update, 6 July, 1:10 p.m.: This article has been updated to include comment from MDPI, the publisher of Vaccines, and to note that Petousis-Harris and Harper rejoined the editorial board after the retraction was published.\n\n*Update, 2 July, 12:10 p.m.: This article has been updated to note Vaccines retracted the paper.", "opengraph": {"type": "article", "url": "https://www.science.org/content/article/scientists-quit-journal-board-protesting-grossly-irresponsible-study-claiming-covid-19", "title": "Scientists quit journal board, protesting ‘grossly irresponsible' study claiming COVID-19 vaccines kill", "description": "Critics say authors of Vaccines report misrepresented Dutch data", "image": "https://www.science.org/do/10.1126/science.abk2629/abs/Vax_death_resignations_1280x720.jpg", "image:width": "400", "image:height": "400"}, "tags": ["Health", "Coronavirus", "Careers Articles", "Scientific Community"], "tweets": [], "movies": [], "links": ["https://www.mdpi.com/2076-393X/9/7/693/htm", "https://twitter.com/florian_krammer/status/1408762002512789509", "https://twitter.com/ProfKatieEwer/status/1409125241142513670", "https://retractionwatch.com/2021/06/29/paper-claiming-two-deaths-from-covid-19-vaccination-for-every-three-prevented-cases-earns-expression-of-concern/", "https://www.mdpi.com/2076-393X/9/7/705/htm", "https://www.mdpi.com/2076-393X/9/7/729/htm", "https://www.mdpi.com/2076-393X/9/7/693#metrics", "https://www.mdpi.com/2076-393X/9/7/693/review_report", "https://www.nejm.org/doi/full/10.1056/nejmoa2101765", "https://www.sciencemag.org/news/2021/05/antivaccine-activists-use-government-database-side-effects-scare-public"], "authors": [], "publish_date": "24 Apr 2023"}