{"result_id": "138045", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.news-medical.net%2Fnews%2F20201019%2FDesign-of-an-mRNA-SARS-CoV-2-vaccine-encapsulated-in-lipid-nanoparticles.aspx", "timestamp": "2023-04-25 15:19:42 CEST+0200", "meta": {"description": "Now, a new study presented on the preprint server bioRxiv in October 2020 describes the efficient design of an mRNA vaccine against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), based on the use of the viral receptor-binding domain (RBD) mRNA encapsulated in lipid nanoparticles (LNP).", "lang": "en", "keywords": "Antibodies, Antibody, Antigen, Cell, Cell Membrane, Coronavirus, covid-19, DNA, Efficacy, Immune Response, Intracellular, Lipids, Luciferase, Membrane, Molecule, Mortality, Nanoparticles, Pandemic, Protein, Receptor, Research, Respiratory, RNA, SARS-CoV-2, Severe Acute Respiratory, Severe Acute Respiratory Syndrome, siRNA, Spike Protein, Syndrome, Technology, Vaccine, Viral Vector, Virus", "favicon": "/favicon-16x16.png", "canonical": "https://www.news-medical.net/news/20201019/Design-of-an-mRNA-SARS-CoV-2-vaccine-encapsulated-in-lipid-nanoparticles.aspx", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Design of an mRNA SARS-CoV-2 vaccine encapsulated in lipid nanoparticles", "cleaned_text": "As the COVID-19-related mortality surpasses 1 million, hundreds of scientific papers have reported the performance of a host of vaccine candidates against the virus. Now, a new study presented on the preprint server bioRxiv* in October 2020 describes the efficient design of an mRNA vaccine against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), based on the use of the viral receptor-binding domain (RBD) mRNA encapsulated in lipid nanoparticles (LNP). This is a novel approach for mRNA vaccines for any indication and may benefit the field of vaccine development as a whole.\n\nThe different vaccine types include inactivated/live attenuated virus, recombinant viral vector, recombinant protein, DNA vaccine, and messenger RNA (mRNA) vaccine. Among these, the mRNA vaccine has become deservedly popular as the technology to ensure stable mRNA developed, along with superior delivery methods to get the vaccine into the host cell.\n\nNot only is mRNA non-infectious and thus safer, but it also obviates the need for the vaccine to enter the nucleus, which is more complicated. Moreover, it uses a rapid, simple production process, which is a crucial advantage in the current pandemic's acute setting. In fact, the Moderna vaccine, based on the viral spike protein mRNA, took only 66 days to travel from the selection of the RNA sequence to the first administration to a human.\n\nHowever, mRNA uptake is a challenge since almost every tissue in the human body contains ribonucleases that degrade any RNA they encounter. This, coupled with the mRNA's negative charge, makes it difficult for the vaccine to enter the cell and its trafficking across the cell membrane, which is also negatively charged.\n\nFor this reason, the researchers used a carrier molecule to preserve mRNA in intact form and promote its uptake into the cell. This is the role played by LNPs, which are a sophisticated form of delivering siRNA into the host organism without having to use a viral vector. Having obtained FDA approval, these are now widely used for antigen-encoding mRNA delivery, encapsulating viral antigens against HIV, CMV, rabies, and influenza, to mention a few.\n\nA typical LNP contains four parts, the ionizable lipid that allows the LNP to self-assemble, the stabilizing agent (cholesterol), a phospholipid that lends stability to the bilayered encapsulating lipid structure, and a stabilizing lipid-containing polyethylene glycol (PEG) that promotes stability.\n\nThe first is crucial to the intracellular entry of the mRNA. The ionizable lipid enhances the rate of encapsulation of the mRNA, increases the extent of interaction between the mRNA and the cell membrane despite the negative charge on both, and may even help with endosomal escape, whereby the mRNA enters the cytoplasm from the endosome so that it can be translated into the encoded immunogenic protein. Thus, the LNP platform seems to address the stability and negative charge-related issues with mRNA intended for intracellular use.\n\nThe researchers, who had previous experience developing novel ionizable lipids that would be useful for LNP formulations to achieve siRNA delivery, examined the potential use of several ionizable lipids in vivo. They identified appropriate lipids that would allow the mRNA to escape from the endosomal compartment and enter the cytosol for translation.\n\nThey selected two of the most popular LNPs for testing their vaccine formulation. They employed a luciferase indicator to demonstrate the uptake of the mRNA and thus assess the LNP formulation's efficacy.\n\nThe two selected formulations were found to produce intense and long-lived expression of luciferase, with a burst of luminescence after the addition of luciferin. The investigators found a limited antibody response after one immunization, but a higher level of cellular response directed against the luciferase antigen. Both LNPs elicited comparable cellular immunity, but the luminescence with one was more transient than the other.\n\nThe pattern of protein expression does not, therefore, predict the immunogenicity of the molecule. Rather, this is determined by the antigen's uptake efficiency by the antigen-presenting cells (APC), which deliver it to the lymphocytes in the lymph node. This will result in the activation of T cells and the production of immune mediators.\n\nIn the current experiment, the immune response appeared to be robust because of the expressed protein's tissue and cell distribution. Further research is required to examine how the luciferase protein is expressed in various tissues and organs.\n\nUsing a mouse model, they compared the immune response following inoculation intramuscularly or intradermally, with RBD mRNA and LNP-RBD mRNA. The first was ineffective.\n\nWith the second, the priming dose alone elicited a limited humoral response but substantial cellular immunity, especially with the intramuscular route. However, with a prime-boost regimen, the vaccine induced a robust immune response with a high level of neutralizing antibodies and a Th1-skewed cellular response.\n\nAgain, one of the two tested formulations showed enhanced immunogenicity after intradermal administration, perhaps because it can activate APCs after both intradermal and intramuscular administration. The other one has significant immunogenicity only via the intramuscular route.\n\nThese findings could indicate the importance of the route of administration when assessing vaccine efficacy for future experiments.\n\nThe LNP-RBD formulation was demonstrably superior to recombinant spike or RBD, using a prime-boost regimen. Even though the latter induced comparable titers of neutralizing antibodies, the cellular response was markedly missing, vs. the use of LNP RBD mRNA vaccine.\n\nThis is explained by the fact that the recombinant protein requires to be taken up by APCs for an immune response to occur. However, the expression of intracellular antigen that inevitably follows the entry of mRNA into the cell means that MHC class I presentation of the epitopes results from vaccine administration, which primes cytotoxic T cells and Th cells.\n\nThe presence of two complementary subsets of activated T cells results in a strong and durable immune response, both antibody- and cell-mediated, following LNP RBD mRNA vaccination.\n\nFinally, the worry that vaccination might induce antibody-dependent enhancement (ADE) and vaccine-associated enhanced respiratory disease (VAERD), and thus be deleterious rather than helpful for the patient, is mitigated by the occurrence of a Th1- rather than Th2-biased response. Research is required to explore the role played by the physical and chemical properties of the lipids used in the LNPs, which could guide the composition of future LNP-based mRNA vaccines.\n\nThe demonstration of a robust immune response indicates the promise in this approach to vaccine development.", "opengraph": {"title": "Design of an mRNA SARS-CoV-2 vaccine encapsulated in lipid nanoparticles", "type": "article", "image": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2020/10/shutterstock_533717242.jpg", "url": "https://www.news-medical.net/news/20201019/Design-of-an-mRNA-SARS-CoV-2-vaccine-encapsulated-in-lipid-nanoparticles.aspx", "description": "Now, a new study presented on the preprint server bioRxiv in October 2020 describes the efficient design of an mRNA vaccine against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), based on the use of the viral receptor-binding domain (RBD) mRNA encapsulated in lipid nanoparticles (LNP).", "site_name": "News-Medical.net", "article:published_time": "2020-10-19T22:05:00.0000000-04:00", "article:modified_time": "2023-03-29T02:20:00.0000000-04:00", "article:section": "Medical News"}, "tags": ["Rabies", "Research", "Cell", "B Cell", "Translation", "Coronavirus", "T-Cell", "in vivo", "Mortality", "Antibody", "Vaccine", "Membrane", "Receptor", "covid-19", "Intracellular", "HIV", "DNA", "Technology", "siRNA", "Luciferase", "Syndrome", "Molecule", "Immunization", "Virus", "Mouse Model", "Lipids", "Lymph Node", "Immune Response", "Respiratory Disease", "Coronavirus Disease COVID-19", "Cholesterol", "Respiratory", "Dynamic Light Scattering", "Spike Protein", "Cytoplasm", "Viral Vector", "Cell Membrane", "Protein", "RNA", "Severe Acute Respiratory Syndrome", "Antigen", "Influenza", "Antibodies", "Protein Expression", "Efficacy", "SARS-CoV-2", "Pandemic", "Severe Acute Respiratory", "Nanoparticles"], "tweets": [], "movies": [], "links": ["https://www.biorxiv.org/content/10.1101/2020.10.15.341537v1", "https://www.biorxiv.org/content/10.1101/2020.10.15.341537v1", "/health/What-are-Spike-Proteins.aspx", "/health/What-is-an-Antigen.aspx", "/news/20230415/How-SARS-CoV-2-Omicron-subvariants-have-evolved-to-evade-host-T-cell-immunity.aspx", "/news/20230417/Vaccine-component-BNT162b4-enhances-T-cell-immunity-against-SARS-CoV-2-variants-for-reduced-COVID-19-disease-severity.aspx", "/news/20230418/As-pandemic-emergencies-end-people-battling-long-covid-feel-e28098swept-under-the-ruge28099.aspx", "/health/What-are-Neutralizing-Antibodies.aspx", "https://doi.org/10.1101/2020.10.15.341537", "https://www.biorxiv.org/content/10.1101/2020.10.15.341537v1", "https://doi.org/10.1021/acsnano.0c10180", "https://pubs.acs.org/doi/10.1021/acsnano.0c10180"], "authors": ["Dr. Liji Thomas, MD"], "publish_date": "2020-10-19T22:05:00.0000000-04:00"}