{"result_id": "138013", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Ftimesofindia.indiatimes.com%2Fcity%2Fmadurai%2Fwoman-claims-vaccine-caused-hubbys-death-autopsy-ordered%2Farticleshow%2F80697001.cms", "timestamp": "2023-04-25 15:18:54 CEST+0200", "meta": {"description": "Madurai:A woman has approached the Madras high court on Thursday seeking to ascertain the cause of her husband’s death a few days after he was adminis.", "lang": "en", "keywords": "City News,City Latest News, News, Times Of India, Latest news", "favicon": "https://m.timesofindia.com/touch-icon-iphone-precomposed.png", "canonical": "https://timesofindia.indiatimes.com/city/madurai/woman-claims-vaccine-caused-hubbys-death-autopsy-ordered/articleshow/80697001.cms", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Woman claims vaccine caused hubby’s death, autopsy ordered | Madurai News - Times of India", "cleaned_text": "Madurai:A woman has approached the Madras high court on Thursday seeking to ascertain the cause of her husband’s death a few days after he was administered Covid-19 vaccine. After hearing the petition, the court ordered the authorities concerned to perform a re-postmortem by a team of experts.The petitioner, M Ambika, a resident of Tuticorin district, stated that her husband Manoharan, 39, was appointed as a sanitation worker at Vilathikulam Pudur town panchayat on temporary-basis in February 2020. She said that he was forcibly administered Covid-19 vaccine at a camp on January 21. After taking the shot, he felt pain, nausea and fatigue. Later, Manoharan went to the Government Rajaji Hospital for a check-up on January 30. While returning to home, he started vomiting and died at the Aruppukottai bus stand.She stated that her husband was the sole breadwinner of the family and he died after getting vaccinated. In the petition, she sought the court for compensation for her husband’s death and employment to a family member. She also sought a re-postmortem by an expert team to ascertain the cause of her husband’s death.The counsel appearing for the petitioner submitted that as per adverse effect following immunization (AEFI) guidelines issued in 2015, postmortem should be done by a team of experts in such cases. tnn", "opengraph": {"title": "Woman claims vaccine caused hubby’s death, autopsy ordered | Madurai News - Times of India", "url": "https://timesofindia.indiatimes.com/city/madurai/woman-claims-vaccine-caused-hubbys-death-autopsy-ordered/articleshow/80697001.cms", "image": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "description": "Madurai:A woman has approached the Madras high court on Thursday seeking to ascertain the cause of her husband’s death a few days after he was adminis.", "image:width": "1070", "image:height": "580", "site_name": "The Times of India", "type": "article"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-02-05T04:41:00+05:30"}