{"result_id": "138024", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.connexionfrance.com%2FFrench-news%2FFive-deaths-in-France-reported-after-Covid-Pfizer-BioNTech-vaccination", "timestamp": "2023-04-25 15:19:11 CEST+0200", "meta": {"description": "The deaths were all among elderly care home residents aged 75 and over with pre-existing conditions. France's health minister has said studies will be carried out to determine if there is a link to the vaccine or it is just 'bad timing'", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://www.connexionfrance.com/article/French-news/Five-deaths-in-France-reported-after-Covid-Pfizer-BioNTech-vaccination", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Covid France: Five deaths after vaccine, no link proven", "cleaned_text": "Investigations are continuing in France after five people died days after having the Covid-19 vaccine.\n\nAll five people who died were aged 75 or over, were elderly care home residents, and had existing underlying conditions. No clear link between the vaccinations and the deaths has been formally established.\n\nThree deaths were recorded by the health alert unit le centre régional de pharmaco-vigilance in Nancy, one by the centre in Tours, and one from Montpellier.\n\nAll five had been given the Pfizer/BioNTech jab.\n\nIn a statement, medicine safety agency l’Agence nationale de sécurité du médicament et des produits de santé (ANSM) said: “Based on the information we have today, nothing leads us to believe that these deaths were linked to the vaccinations. All of them happened to elderly patients in care homes.”\n\nThe statement continued: “Even without the context of Covid-19, 465 elderly care home residents die every day, and more than 1,000 are hospitalised every day.\n\n“The campaign rollout is rising each day, so within this population, the probability of seeing deaths after vaccination is also rising, even in the absence of any effects of the vaccine.”\n\nHealth Minister Olivier Véran told local news hub France Bleu Sud Lorraine that “these people may have died in the days after vaccination, without having shown any signs of allergic side-effects after the vaccination”.\n\nHe said: “When we’re talking about people in elderly care homes, we are by definition talking about people who are very fragile, with a loss of autonomy, often with many illnesses and medicines, for whom the causes of death may be totally separate [to the Covid-19 vaccination].”\n\nHe added: “Obviously, within the context of pharmaco-vigilance work, there will be studies done by health authorities, with doctors, to determine if there is a link or not with vaccination, or if it was, in inverted commas, ‘just a coincidence’ and bad timing.”\n\nIn Europe, there have been 71 deaths reported following a Covid-19 vaccination - including from across the UK, Germany, Norway, and Denmark. Almost all were people aged 75 or over.\n\nThe European Medicines Agency has so far said: “No death among these elderly people has been attributed to the [Pfizer/BioNTech] vaccination at this stage.”\n\nIn total in France, 139 cases of severe or unexpected side-effects have been reported since the start of the vaccination campaign.\n\nThe latest figures show that so far, 585,664 people in France have received the vaccination - with 105,791 doses delivered in the past 24 hours.\n\nThe government is expecting to have vaccinated one million people in France by January 26.\n\nFrance Covid: Vaccine was painless and very well organised\n\nNew Covid UK variant ‘dominant’ in France by February", "opengraph": {"title": "Covid France: Five deaths after vaccine, no link proven", "description": "\nThe deaths were all among elderly care home residents aged 75 and over with pre-existing conditions. France's health minister has said studies will be carried out to determine if there is a link to the vaccine or it is just 'bad timing'\n", "url": "https://www.connexionfrance.com/article/French-news/Five-deaths-in-France-reported-after-Covid-Pfizer-BioNTech-vaccination", "type": "article", "image:alt": "Covid France: Five deaths after vaccine, no link proven", "site_name": "https://www.connexionfrance.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.francebleu.fr/sud-lorraine", "https://www.lefigaro.fr/sciences/covid-19-cinq-deces-en-france-de-personnes-vaccinees-pas-de-lien-etabli-avec-l-injection-20210119", "https://www.connexionfrance.com/French-news/France-Covid-Vaccine-was-painless-and-very-well-organised", "https://www.connexionfrance.com/French-news/New-Covid-UK-variant-likely-dominant-in-France-by-February-says-new-Inserm-study", "https://www.connexionfrance.com/French-news/France-s-Covid-vaccine-booking-system-to-be-improved", "https://www.connexionfrance.com/French-news/Vaccine-passports-France-in-favour-as-jab-support-rises-among-the-public"], "authors": [], "publish_date": null}