{"result_id": "138019", "URL": "https://www.godlikeproductions.com/external?https%3A%2F%2Fwww.jpost.com%2Fbreaking-news%2Fisrael-nears-100000-coronavirus-vaccinations-per-day-goal-653461", "timestamp": "2023-04-25 15:19:04 CEST+0200", "meta": {"description": "\"We share in the grief of the family,\" Health Ministry director-general Chezy Levy said.", "lang": "en", "keywords": "", "favicon": "https://images.jpost.com/image/upload/f_auto,fl_lossy/Icons/PNG/jp-favicon-16.png", "canonical": "https://www.jpost.com/breaking-news/israel-nears-100000-coronavirus-vaccinations-per-day-goal-653461", "encoding": "utf-8"}, "image": null, "domain": "www.godlikeproductions.com", "title": "Man's fatal heart attack likely unlinked to vaccine he took hours before", "cleaned_text": "A 75-year-old man from Beit She’an died of a heart attack about two hours after being vaccinated against the novel coronavirus on Monday morning, the Health Ministry reported.\n\nHealth Ministry director-general Chezy Levy has launched an investigation into the incident. “We share in the grief of the family,” he said in a statement.\n\nAccording to reports, the man was inoculated at around 8:30 a.m. at a Clalit Health Services clinic. He stayed at the facility, as is customary, for a short period of time to ensure he had no side effects. When he felt well, the clinic released him.\n\nWhen Pfizer presented its safety data to the US Food and Drug Administration in early December, it was found that two trial participants had died after receiving the vaccine. One of the deceased was immunocompromised, meaning the person’s immune defenses were low.\n\nIn response to the report of those deaths, Israel’s Midaat Association said when vaccines are administered to at-risk populations, “there may be unfortunate cases. One should not infer from this about the safety of the vaccine, but welcome the transparency required from the pharma companies in the drug approval process.”\n\nIn large trials of tens of thousands of people, death can occur without any connection to the trial, but companies such as Pfizer are required to report those deaths, Midaat said at the time.\n\n“According to the published data, six of the participants in the experiment died, two of whom received the vaccine and four of the control group,” said Dr. Uri Lerner, Midaat’s scientific director. “After an in-depth examination, no connection was found between the experiment and the cause of death.”\n\nThe main side effects reported in the trials of the Pfizer and Moderna vaccines were pain, swelling and redness at the site of injection and chills, tiredness and headaches. But these effects usually only lasted a few hours or days at most.\n\nAny potential longer-term side effects are still unverified, as the vaccines are still new. However, the majority of health officials have said they believe the vaccines will cause no long-term harm. In Israel, more than 80% of medical personnel are expected to be inoculated.\n\nAs of Monday evening, Israel had vaccinated 500,000 citizens with the first dose of the coronavirus vaccine. According to Health Minister Yuli Edelstein , 99,000 people were vaccinated on Sunday.\n\nCurrently, Israel is vaccinating medical personnel, people over the age of 60 and those with chronic illnesses. It hopes to begin vaccinating teachers and school staff later this week or next.\n\nIsrael hopes to vaccinate as many as 150,000 people per day, Prime Minister Benjamin Netanyahu said Saturday night. If successful, 2.25 million Israelis will be vaccinated within a month and a half.", "opengraph": {"site_name": " The Jerusalem Post | JPost.com ", "title": "Man's fatal heart attack likely unlinked to vaccine he took hours before", "type": "Article", "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/467969", "url": "https://www.jpost.com/breaking-news/israel-nears-100000-coronavirus-vaccinations-per-day-goal-653461", "description": "\"We share in the grief of the family,\" Health Ministry director-general Chezy Levy said."}, "tags": ["Yuli Edelstein", "JNF-USA", "beit shean"], "tweets": [], "movies": [], "links": ["https://www.jpost.com/health-science/edelstein-millions-more-covid-19-vaccines-en-route-to-israel-653519", "https://www.jpost.com/tags/yuli-edelstein"], "authors": [], "publish_date": "2020-12-28T23:23Z"}