{"result_id": "139028", "URL": "https://goop.com/wellness/relationships/resolving-arguments-in-relationships/", "timestamp": "2023-04-25 15:20:29 CEST+0200", "meta": {"description": "Therapist Terry Real is famous for his straightforward approach to couples therapy, which succeeds in improving communication, developing accountability, and enhancing intimacy even when other methods fail. And if you’ve ever been locked in a battle over who’s right, his new book is required reading.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/relationships/resolving-arguments-in-relationships/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Resolving Relationship Arguments When Nobody’s Right", "cleaned_text": "The excerpt here is from chapter two: “The Myth of the Individual.” If you and your partner have ever been locked in a battle over who’s right, it’s required reading.\n\nWe position ourselves as apart and above in many relationships. We attempt to control our partners, our kids, our bodies, and even the way we think (“I will not be so negative”). Take a step back, and you’ll see that running your relationships from a place of power and control is lunacy. Even with that awareness, the minute the emotional temperature begins to rise, more reactive parts of the brain take over, and that is precisely the model we revert to: “I’m right, and you’re wrong. You win, and I lose. I can let you in, or I can protect myself.”\n\nCollectively and personally, we stand in desperate need of a new paradigm. The relational answer to the question “Who’s right and who’s wrong?” is “Who cares?” The real question is “How are we as a team going to approach the issue at hand in a way that works for both of us?” The shift from individualistic to relational thinking may at first seem like pie-in-the-sky idealism, but I see its transformative potential day by day in my office.\n\nLet me give a perfectly ordinary example.\n\nStan: You Can Be Right or Be Married\n\n“He won’t listen!” cries Lucy, who is white and in her mid-thirties. She flings open her arms as she sits on the edge of the couch, as if to implore me.\n\n“I don’t get her,” says Stan, also white, and forty-three. He is sinking his face into his hands, beleaguered, exhausted, as if to say, “No matter what I do…”\n\nAnd then there’s me, watching, listening. Lucy and Stan’s marriage is on the edge of dissolution—and over what? A misapprehension.\n\nThis past weekend was a disaster. “It was supposed to be a restorative time alone together in our house on the Cape,” Lucy tells me. “We were both looking forward to it. We needed it.” She looks down at her hands. “We almost didn’t even make it there. I almost turned my car around and drove home.”\n\n“It’s so trivial you could laugh,” she says. “But nevertheless…”\n\nNevertheless, I think—that good old, familiar, nevertheless.\n\nSo trivial one could laugh, but nevertheless…worth falling on your sword over. Domestic life plays out on a small stage full of gigantic emotions.\n\n“This whole thing is ridiculous,” Stan declares, one leg pumping, impatient, annoyed.\n\n“We took two cars,” Lucy cuts him off, taking charge.\n\n“Both were loaded with groceries. So, I couldn’t see out the back. Already I’m nervous. I don’t like driving at night. I ask Stan to stay by me, in case I—I don’t know, I get lost, take a wrong turn, whatever.”\n\n“She wanted me to keep an eye on her,” Stan tells me, to hurry the story along. “Which I did.”\n\n“Which is exactly what I did. Look.” Stan turns to me, the arbiter. “I was winding my way through the traffic—”\n\n“I’m about two cars ahead of her—”\n\n“I’ve got her square in my rearview mirror.” Stan’s expression is harried.\n\nI’m already sensing where this is going.\n\n“She calls me, panicked, out of her mind. ‘You said you wouldn’t leave me!’ Already, she’s like screaming at me.”\n\n“Oh, Stan,” from Lucy, as if dismissing a child.\n\n“Honey, I’m sorry you were out of it, you said—”\n\n“But you left me! After you said—”\n\n“You were right behind me. I told you the goddamn make of the car in front of you. I was there, honey. There was no need—”\n\nStan and Lucy are caught in a typical who’s-right-who’s-wrong battle, hinging on their slightly different definitions of what it means to “be there” for Lucy. And they are both right in saying the argument is trivial—but then there’s that pesky, nevertheless. Nevertheless can screw up a marriage. Nevertheless can lead to divorce.\n\nTo Lucy, “being there” means being right by her side. For Stan, it means keeping an eye on her. Who is objectively right? Well, to be fair, that’s a trick question.\n\nI ask the couples I work with to swallow a few important bitter pills. Here’s the first: There is no place for objective reality in personal relationships. Objective reality is great for getting trains to run on time or for developing an important vaccine, but for ferreting out which point of view is “valid” in an interpersonal transaction, it is a loser. It leads to objectivity battles. Is Lucy overreacting, or is Stan neglecting her? These circular arguments go on forever, like a dog chasing its own tail; there’s no way out because the assumption of objective facts is wrong to begin with.\n\nIn intimate relationships, it’s never a matter of two people landing on the one true reality, but rather of negotiating differing subjective realities. Between the two, I side with Lucy—a difference between Relational Life Therapy and other therapies. We take sides. Stan is factually correct but relationally incorrect. Did Stan, as promised, look after Lucy to make sure she was all right? Yes, absolutely. And if he had been the one to make the request, he would have been fine. But Stan isn’t married to Stan. Lucy wanted the comfort of Stan by her side, in sight of her. It wasn’t his aid she was after, but the reassurance of his company. In this instance—as in so many others just like it, Lucy assures me—Stan didn’t “get it.” He missed the point because he wasn’t thinking relationally. Like so many of the men I treat, Stan was being instrumental. His focus was on the task at hand, not on the subjective feelings of his partner. He was looking after her; he was not attending to her emotional needs.\n\nThe noted linguist Deborah Tannen addressed this point in her 1990 book You Just Don’t Understand, in which she wrote of men’s “report talk” versus women’s “rapport talk.” “Objectively” Stan was 100 percent right. At the same time, however, he was 100 percent tin-eared when it came to his wife’s subjective experience. Worse, every time Lucy tried to tell him what bothered her, every time she tried to bridge the gap between them, Stan only retreated more staunchly into his precious rightness.\n\n“Let me explain,” I try helping Stan out. “Let’s see if you can’t change your reference point. When Lucy speaks, you, Stan, have two orientations, two reference points that you use as touchstones. The first is objective reality. Did you or did you not look after her as she wished? Is she or is she not valid in her assessment? To which I say, my friend, ‘Good luck!’ Was she, or wasn’t she; did she, or didn’t she—I’m sorry Stan. I’m afraid no one cares. What you’re doing is applying the scientific method to your relationship. It doesn’t work.\n\n“And your second point of reference, judging by the look on your face, has been, well…you. You tell yourself, ‘Oh my god. Do I really need to listen to this?’”\n\nStan stirs on the couch, but he’s not balking.\n\nI go on. “What I want you to do is change your reference. Just try it. It’s not about accuracy, I’m sorry to tell you, and it’s certainly not about you or how put out you are by the whole thing. Stan, it’s about Lucy, her feelings, her reality—her subjective experience. In this moment, right now, ask yourself, would you rather make the case that you’re right, or would you rather make peace with your wife and help her feel better?”\n\n“Meaning?” he says, tentative but listening.\n\nI turn to Lucy, role-playing Stan. The first thing I do is soften my expression, my voice. “Honey,” I say gently, “I’m sorry you felt bad. I didn’t mean to make you feel that way. Is there anything I can say or do right now that would help you feel better?” Then I turn to Stan. “‘I’m sorry you feel bad,’” I repeat. “‘Is there anything I can say to help you feel better?’ Stamp that on your forehead,” I tell him. “Put it on your mirror when you shave in the morning.”\n\nStan says nothing, sitting quietly, thinking it over.\n\nNext to him, Lucy cries.\n\n“If those tears could speak,” I say, turning toward her, “what would they be saying?”\n\n“It’s just…,” she begins but falters. “It’s just…” It doesn’t matter if she’s momentarily inarticulate; I know why she’s crying. She dragged her husband to three therapists before me, and not one of them had taken him on. She’s crying from relief.\n\nEven though he is on the brink of divorce, Stan isn’t a bad guy. What he argued so vehemently for, the point he got so defensive about, was, in fact, right—in the linear, individualistic, Newtonian world we all live in. But to be emotionally present to his wife, all he needs to do is trade in his usual worldview for a completely different paradigm. Listen, clients drag their partners in to see me not because they want better communication—although that’s what many initially say—or to improve a few behavioral transactions. Women like Lucy bring in men like Stan so I can teach them how to be more relational.\n\nWhat Lucy wants is nothing less than a whole different Stan. Most couples’ therapists back away from such bold aspirations, but in Relational Life Therapy we embrace it. “I’m in the personality transplant business,” I tell Lucy, then turn to Stan. “Wanna try it?”\n\n“Turn to your wife right now, and tell her something from the heart,” I coach him, and bless him if, with a bit of encouragement, he doesn’t comply.\n\n“Lucy,” he takes her hand. “I’m sorry, okay? I’m sorry you felt so abandoned that day.”\n\n“I am,” Stan says. “Really. No BS. I wish I could have listened better.” He looks at his wife’s tearful face.\n\n“Wanna hug from the guy?” I ask her, and she lurches forward, reaching for him. “Take your time,” I tell them, as Stan rocks her gently. “Take all the time you need.”\n\nStan’s well-meaning but misguided loyalty to “sorting things out,” that is, to determining the one right reality about it (which was, of course, his), deprived them both of moments like the one they are having now in my office: moments of repair. Virtually all the couples I see in extremis, like Stan and Lucy, lack a mechanism of correction. They feel it important not to sweep things under the rug; rather, they are committed to trying to resolve things. The problem is that their model of resolution is to come to agreement—to figure out the one correct answer, to be on the same page together. It’s a common, deep, and understandable wish. Unfortunately, for most partners, the one right version of the story is, well, mine—and my stubborn partner thinks the same of theirs. The paradox is that resolution comes only by giving up that dream and taking in that you and your partner are not, in fact, going to see all things the same way.\n\nAnd you needn’t. You can have different realities, which in turn may kick out a different set of emotions for each of you. When Stan stopped defending himself and instead tended to his wife’s bruised feelings, she felt heard, the chasm between them was bridged, and everyone could breathe again. That moment brings up an important point. Relationality doesn’t mean that you’re both seeing with the same eyes, thinking the same thoughts, and feeling the same emotions; Relationality is not some boundaryless form of fusion. Quite the opposite—relationality demands an I. But it’s an I embedded in a larger context. By recognizing that Lucy might have a legitimate vision of reality that differs from his, I am actually inviting Stan to be more differentiated from her, not less, but differentiated within that larger whole called his marriage.\n\nWhat I’d like us to appreciate is that shifting from an individualistic, linear world to a relational one can be nothing short of transformative. As clients learn to think and act relationally, their character, their level of emotional development, evolves, often dramatically. They come to live for the most part in their Wise Adult self, led by the right hemisphere and governed by the prefrontal cortex. As we learn to think and act relationally, simply put, we grow up.", "opengraph": {"locale": "en_US", "type": "article", "title": "Resolving Relationship Arguments When Nobody’s Right | goop", "description": "Therapist Terry Real is famous for his straightforward approach to couples therapy, which succeeds in improving communication, developing accountability, and enhancing intimacy even when other methods fail. And if you’ve ever been locked in a battle over who’s right, his new book is required reading.", "url": "https://goop.com/wellness/relationships/resolving-arguments-in-relationships/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2022-04-21T05:20:02+00:00", "article:modified_time": "2022-07-21T18:13:40+00:00", "updated_time": "2022-07-21T18:13:40+00:00", "image": "https://goop-img.com/wp-content/uploads/2022/04/Resolving-Relationship-Arguments-When-Nobody’s-Right_Terry-Real_Stocksy_txpf66a9c72h6K300_Medium_3690288.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2022/04/Resolving-Relationship-Arguments-When-Nobody’s-Right_Terry-Real_Stocksy_txpf66a9c72h6K300_Medium_3690288.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://bookshop.org/a/3543/9780593233672", "https://bookshop.org/a/3543/9780593233672", "https://bookshop.org/a/3543/9780593233672", "https://goop.com/wellness/relationships/how-to-manage-conflict/", "https://goop.com/wellness/mindfulness/what-it-takes-to-give-and-receive-a-good-apology/", "https://goop.com/wellness/relationships/what-is-your-support-language/", "https://goop.com/wellness/relationships/how-to-know-if-your-marriage-is-over/", "https://goop.com/wellness/relationships/communication-mistakes-in-relationships/", "https://goop.com/wellness/relationships/how-attachment-styles-affect-relationships/"], "authors": [], "publish_date": "2022-04-21T05:20:02+00:00"}