{"result_id": "139042", "URL": "https://goop.com/wellness/career-money/why-we-all-need-family-leave/", "timestamp": "2023-04-25 15:20:48 CEST+0200", "meta": {"description": "We live in the only developed country in the world with no paid maternity or family leave—and it’s just got to change.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/career-money/why-we-all-need-family-leave/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Why We All Need Family Leave", "cleaned_text": "Why is it important to society that we make it easier on women to balance work and motherhood?\n\nThere are so many reasons, and they’re so intertwined, that it’s hard to find the space to list them all. Know I’ll try to be brief. As you read these, remember that, right now, 23% of new, working mothers are back on the job within two weeks of giving birth—two weeks! And only 5% of low-wage workers get any paid maternity leave. Yet women make up 47% of the workforce.\n\nMen matter: When policies focus on women only, they can unintentionally open women up to job discrimination. And women-focused policies reinforce the cultural assumption that it’s only women who should step away from work when family needs call. At the same time, women-focused policies deprive men of the opportunity to participate fully in family life, from bonding with a new baby to caring for ailing parents at the end of life. We need a cultural shift that allows and encourages all workers to be active caregivers in their families.\n\nMoral and ethical: For all of human history, we have viewed childbirth as a major life event for a family, one necessitating societal support and time for rest, healing, and bonding for mother and child. This is Humanity 101, and we cannot ignore it without all suffering terrible consequences.\n\nPublic health (which is also an national economic issue): The shorter a woman’s maternity leave, the greater the likelihood that she will suffer from a postpartum mood disorder . Suicide is the second most common cause of new mothers’ mortality in their first year. Babies whose parents have paid time at home are more likely to get their well-checks and vaccinations, and they are more likely to be breastfed.\n\nNational economics: Families with paid leave are less likely to go on public assistance , like food stamps, in the year following a birth.\n\nEconomics for the employer: Paid leave increases retention and reduces turnover of workers, which saves employers up to one-fifth of an employee’s annual salary. Also important is the small business owner’s ability to attract and retain talent. When a small business goes up against a big corporation for the same talented worker, a paid leave program can level the playing field.\n\nEconomics for the employee: Paid leave—or lack thereof—is a major factor in the ongoing wage and wealth gap between women and men. When new mothers do not have paid leave, they are more likely to drop back or drop out of the workforce, affecting their lifetime earnings and pension benefits.\n\nWhat is the current state of affairs on paid family leave in the U.S.? Which states provide the best options and which are the furthest behind?\n\nThe current state of American paid leave is, in two words, shameful…and promising.\n\nOn the shameful front: We are the only developed country with no paid maternity leave. We’re almost the only country, period, without it. Today, seventy-seven percent of American women do not get paid for a single day off after having a baby. The numbers are even worse for paternity leave, and for workers who need to care for sick children, spouses, or parents.\n\nSome assert that the Family and Medical Leave Act (FMLA) is America’s solution to the fact that inconvenient things like birth, death, and illness happen to all human families. FMLA is a federal law that entitles some employees to take 12 weeks of unpaid, job-protected leave for family and medical reasons. But because of many exemptions (including employer size and length of time employed), 41% of workers – about 90 million people – are ineligible. Of those who are eligible, many do not use it because they cannot afford the loss of income.\n\nSome politicians say that the market will solve paid leave, so they want voluntary paid leave, with some tax credits thrown in. But our system is already voluntary, and only about 12% of private sector workers have access to paid family leave through their employers. Far too many low-income people are left out, putting them at even greater disadvantage. And when people at any income level change jobs—as they often do in today’s economy—they lose all benefits if their new employer does not offer them.\n\nOn the exciting front: Paid leave is being talked about more than ever. In all of 2014, only 1,708 news stories were written about paid leave. From just January to July of 2016, we saw 4,138 news stories on the topic. It’s also being picked up by conservative groups like the American Enterprise Institute.\n\nSenator Kirsten Gillibrand (D-NY) has taken the lead, proposing a national plan called the FAMILY Act. It works like an insurance program, and for the cost of a cup of coffee a week, workers would have access to family leave in the form of twelve weeks at 66% wage replacement.\n\nMore good news: With virtually every other country ahead of us, we can look at what works and what doesn’t work, and that can help us innovate. That innovation is happening already: Five states—California, New Jersey, Rhode Island, Washington, and New York—have passed their own versions of a social insurance plan for paid family leave (Washington’s program remains unfunded to date; New York’s kicks in in 2018). These insurance plans require small payments—sometimes from employers, sometimes from workers, sometimes from both—over time, that go into a pooled fund. When the worker needs family leave, her pay comes out of that fund. Data from the states with active programs shows that these plans are good for business, especially small business.\n\nOther states, including Connecticut, Massachusetts, Minnesota, and Washington, D.C. all have had substantial legislative action on paid leave this year.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why We All Need Family Leave | goop", "description": "We live in the only developed country in the world with no paid maternity or family leave—and it’s just got to change.", "url": "https://goop.com/wellness/career-money/why-we-all-need-family-leave/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "teaching kids about money", "article:section": "Be", "article:published_time": "2016-09-22T14:00:25+00:00", "article:modified_time": "2018-08-31T21:15:59+00:00", "updated_time": "2018-08-31T21:15:59+00:00", "image": "https://goop-img.com/wp-content/uploads/2016/09/Familyleave_Stocksy_txp9826e8abIGA100_Medium_730805.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2016/09/Familyleave_Stocksy_txp9826e8abIGA100_Medium_730805.jpg", "image:width": "820", "image:height": "625"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.theatlantic.com/business/archive/2014/06/good-job-america-a-map-of-maternity-leave-policies-around-the-world/373117/", "http://www.nationalpartnership.org/research-library/work-family/fmla/dol-fmla-survey-key-findings-2012.pdf", "http://www.techrepublic.com/article/10-things-you-need-to-know-about-maternity-leave-in-the-us/", "https://www.dol.gov/wb/PaidLeave/PaidLeave.htm", "http://www.aei.org/publication/lets-talk-about-paid-family-leave/", "http://www.nationalpartnership.org/issues/work-family/family-act.html", "http://www.nationalpartnership.org/research-library/work-family/paid-leave/state-paid-family-leave-laws.pdf", "http://www.nationalpartnership.org/research-library/work-family/paid-leave/paid-leave-works-in-california-new-jersey-and-rhode-island.pdf", "https://www.washingtonpost.com/local/dc-politics/go-ahead-and-have-that-baby--paid-family-leave-isnt-coming-to-dc-soon/2016/07/12/647130b8-47ad-11e6-bdb9-701687974517_story.html", "https://www.dol.gov/whd/fmla/spouse/factsheet.htm", "https://www.govtrack.us/congress/members", "http://openstates.org/find_your_legislator/", "http://familyvaluesatwork.org/states", "http://www.makeitworkcampaign.org/issues/work-and-family/", "http://www.nationalpartnership.org/issues/work-family/paid-leave.html", "http://cepr.net/documents/publications/parental_2008_09.pdf", "http://www.workingmother.com/sites/workingmother.com/files/attachments/2015/09/wm100bestpaidleavefinal.pdf", "http://www.coca-colacompany.com/stories/want-to-empower-women--start-with-parental-leave", "http://www.theatlantic.com/business/archive/2016/04/no-family-leave/476577/", "http://www.mainstreetalliance.org/", "http://asbcouncil.org/", "https://www.uschamber.com/", "http://www.nfib.com/", "https://fairygodboss.com/", "http://www.listyourleave.com/", "http://www.nationalpartnership.org/research-library/work-family/fmla/fmla-23-lrp-poll-memo.pdf", "http://ted.com/talks/jessica_shortall_how_america_fails_new_parents_and_their_babies", "http://www.nationalpartnership.org/about-us/staff/vicki-shabo.html", "http://leavelogic.com/", "http://joshlevs.com/", "http://amzn.to/2cyQw9t", "http://jessicashortall.com/speaking/", "http://amzn.to/2cWAEDm", "http://www.facebook.com/jessicashortallwrites", "http://www.twitter.com/jessicashortall", "http://www.instagram.com/workpumprepeat", "https://goop.com/goop-wellness-the-mother-load/p/", "https://goop.com/the-mother-load/", "https://www.facebook.com/Goop", "https://twitter.com/goop", "https://instagram.com/goop", "https://www.youtube.com/user/goop", "http://www.pinterest.com/goop/", "https://play.spotify.com/user/gooptunes?play=true&utm_source=open.spotify.com&utm_medium=open"], "authors": [], "publish_date": "2016-09-22T14:00:25+00:00"}