{"result_id": "139021", "URL": "https://goop.com/wellness/environmental-health-civics/what-we-need-to-know-about-pfoas/", "timestamp": "2023-04-25 15:20:18 CEST+0200", "meta": {"description": "The toxic saga of chemical contamination related to Teflon and other highly fluorinated chemicals is a long and dark one—it’s most recently captured in Nathaniel Rich’s story, \"The Lawyer Who Became DuPont's Worst Nightmare\" for the New York Times Magazine.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/environmental-health-civics/what-we-need-to-know-about-pfoas/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "What We Need to Know About PFOAs", "cleaned_text": "The toxic saga of chemical contamination related to Teflon and other highly fluorinated chemicals is a long and dark one—it’s most recently captured in Nathaniel Rich’s story, “The Lawyer Who Became DuPont’s Worst Nightmare” for the New York Times Magazine. The chemicals in question (more generally referred to as highly fluorinated chemicals) were originally developed as a powerful waterproofing and anti-stick agent, used to waterproof rain jackets, make frying pans non-stick, improve the texture of beauty products, and even to keep grease from leaking out of food packaging—in short, they’re prevalent in practically every American home.\n\nThe health effects on employees who work with highly fluorinated chemicals–and the repercussions for local communities who might be exposed to them through contaminated water—are terrible, ranging from increased cancer risk to birth defects. Combine those dangers with the fact that highly fluorinated chemicals are persistent in the environment (i.e., they never break down), and it’s no surprise that advocates have long been pushing for their removal from consumer products, for the sake of employees, communities, consumers, and the environment.\n\nTo get a better understanding of the entire situation, we tapped environmental scientist Arlene Blum, the director of the Green Science Policy Institute at Berkeley. Blum is widely known and respected as a member of the team that first raised the alarm on flame retardants in children’s pajamas and furniture (side-note, she’s also a badass mountain climber, but that’s a story for another article). While she’s fighting hard to keep corporations from using harmful chemicals in the first place, her overall message is one of moderation: It’s impossible to completely eliminate your, or your family’s, exposure, so the best thing to do is make substitutions when available and, whenever possible, abstain from buying affected products in the first place (her Consumer Guide is an excellent resource for both strategies). Below, she breaks down the extraordinarily complicated topic.\n\nWhat exactly are fluorinated chemicals, and how are they dangerous for your health? Highly fluorinated chemicals, or fluorochemicals, are manmade substances that contain carbon-fluorine bonds, which are some of the strongest bonds in chemistry. These bonds make them very useful—they render products stain-resistant, nonstick, or water-repellant—but their convenience comes at a cost. The highly fluorinated chemicals that have been well-studied have been linked to high cholesterol, ulcerative colitis, lower birth weight and size, lowered vaccine protection in children, obesity, hormonal changes, liver malfunction, thyroid disruption, and testicular and kidney cancer. The strong bonds also make fluorochemicals resistant to breakdown in the environment and in our bodies. The half-life of some fluorochemicals in humans is 2.3 years and longer, so they tend to build up in our bodies. Others transit our bodies more rapidly, but if they are in products we use every day, we will continue to be exposed nonetheless. Although fluorochemicals are eventually excreted from humans, they are not metabolized in our bodies, and do not break down in the environment; studies have found concentrations of fluorochemicals in natural ecosystems worldwide. Part of what’s so worrisome about fluorinated chemicals is that they’re persistent in the environment and our bodies, and can be transferred from mothers to children through breast milk and through the placenta — can you explain how that works and what it means for our health? Fluorochemicals are unnatural to mammalian biochemistry, so the placenta barrier doesn’t keep them out. Some fluorochemicals passively diffuse across cell membranes and cross the placental barrier into the fetus. According to researchers who led a significant study on the subject: “For breast-fed infants, breast milk was calculated to be the single most important source to PFCs by far.” The result is that young children are hit with a triple dose of highly fluorinated chemicals—they’re exposed in utero, through breast milk, and as toddlers through hand-to-mouth behavior (these chemicals are present in dust, which toddlers are exposed to when they’re crawling). This toxic exposure is of particular concern at such a young age, when brains and bodies are developing; it might also put children at higher risk for cancers later in life. To be clear, many health experts, including the CDC, agree that the benefits of breastfeeding far outweigh the risks. That said, there are strong incentives to reduce both mother and child’s exposure to highly fluorinated chemicals as much as possible. Further cause for concern is that highly fluorinated chemicals can last for up to millions of years in the environment. This means that the fluorochemicals released during our lifetimes will build up in the environment, and many future generations will be exposed to them, and be at risk for the associated health problems, at even higher levels than we are today. There are a lot of terms and acronyms that get thrown around in this conversation (PFOA, PFTE, C8, teflon, etc.); how important are the differences between them? There are several thousand fluorochemicals used in consumer products, so it is unlikely there will ever be adequate information to evaluate the majority of them under the current regulatory system. One solution to the problem, and a way to avoid “regrettable substitutions,” is to address entire families or classes containing toxic chemicals rather than tackling them one by one. At the Green Science Policy Institute we’ve called for a 50% reduction over the next five years in the use of six families of chemicals in consumer products where the studied members have been found to be harmful: highly fluorinated chemicals, antimicrobials, flame retardants, bisphenols and phthalates, organic solvents, and certain metals.\n• The class, or family, of per- and poly-fluorinated compounds are sometimes called PFCs or PFASs.\n• Teflon® is the best known trade name for polytetrafluoroethylene- or PTFE-based fluorocarbon formulas.\n• PFOA and PFOS are two fluorochemicals that were widely used for decades. They are also called C8 to signify a chain of eight carbon atoms surrounded by fluorine atoms. In 2015, fifty years after scientists first documented their potential for human health harm, C8 was phased out in the US.\n• C8 has been replaced by many forms of similar, shorter-chain molecules called C6 (perfluorohexanoic acid or PFHA) and C4 (PFBS). These replacements are more rapidly excreted by humans but have not been well tested for toxicity. They are increasing in humans and the environment, and they appear to be associated with health harm similar to that of their “relative,” C8. One of the reasons we first became interested in this topic was because of a fascinating New York Times article that exposes DuPont Chemical’s production of PFOA. The article explains that PFOA is currently being phased out by every US-based company that currently produces it, and the FDA recently banned three PFCs in food packaging. Are there still consumer products on the market that contain it? The three recently banned fluorochemicals are no longer used in food packaging but several dozen other related fluorochemicals are still in use (PFOA and PFOS are also still manufactured overseas). Is it safe to assume that C8 substitutes are equally dangerous? PFOA (C8) was replaced with numerous related C6 and C4 compounds that are more rapidly excreted by humans than C8. However, there are so many sources of exposure that the shorter chain compounds continue to be in our bodies in spite of faster elimination. Like C8, the shorter chain substitutes show extreme environmental persistence. The toxicity of some alternatives has been found in animal studies (see Sharon Lerner’s reporting for more information on that), but it’s unlikely to be proven in humans because we are exposed to such a variety of fluorochemicals and other toxic compounds. Regardless, C6s are increasing in humans and in the environment, and share the potential toxicity of their C8 relatives; they should be avoided in consumer products whenever possible. Since PFOA can build up in landfills, how can we responsibly dispose of old products that may contain it? There is no way to safely dispose of them. The C8 products that we produced in the past, continue to use, and/or dispose of in landfills will contaminate our environment for generations to come. The best strategy is to avoid buying products that contain fluorochemicals in the first place. What types of commercial products contain fluorinated chemicals, and what is the risk of exposure? There are more than 2,000 fluorochemicals in commerce—they are found in many consumer products, including carpeting and furnishings; indoor and outdoor clothing; building materials; food contact paper; nonstick cookware; cosmetics; and even a brand of dental floss. We are exposed not only through products we purchase, but also through air, water, and food. Another concerning element to the story is that fluorochemicals from products and manufacturing are not removed by wastewater treatment plants. Treated products are thrown into landfills where they can leach into the soil and can contaminate groundwater. They are increasingly found in waterways, drinking water, and food. As an individual, it would be almost impossible to completely eliminate exposure to fluorinated chemicals. A more realistic approach is to reduce your overall burden by avoiding products made with them, both to stop supporting companies who manufacture them and to reduce exposure in your own household. Below, goop’s tips for reducing your exposure:\n• Choose textiles, furniture, and carpeting without water- and stain-repellants.\n• Buy waterproof clothing only when necessary—the outdoor industry has eliminated C8, but most waterproof fabric still contains C4 and C6.\n• If you’re using teflon pans, cook on low heat, ventilate your kitchen, and never pre-heat an empty pan. Once they’re scratched or damaged, it’s time to throw them away. For a safer option, opt for cast iron or stainless steel instead.\n• Make popcorn on the stovetop—it tastes better anyway. Grease-proof paper that fast food comes in can also be treated with fluorochemicals.\n• Steer clear of any ingredients with terms like “perfluor,” “polyfluor,” and PTFE on the label.\n• In general, avoid Scotchgard™, GORE-TEX®, Teflon®, STAINMASTER®, and similar treatments. Astonishingly, GORE-TEX can even be found in some dental floss—try Cocofloss for a totally clean option.", "opengraph": {"locale": "en_US", "type": "article", "title": "What We Need to Know About PFOAs | goop", "description": "The toxic saga of chemical contamination related to Teflon and other highly fluorinated chemicals is a long and dark one—it’s most recently captured in Nathaniel Rich’s story, \"The Lawyer Who Became DuPont's Worst Nightmare\" for the New York Times Magazine.", "url": "https://goop.com/wellness/environmental-health-civics/what-we-need-to-know-about-pfoas/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "common household toxins", "article:section": "Detoxes & Cleanses", "article:published_time": "2016-03-31T16:00:00+00:00", "article:modified_time": "2018-11-20T20:23:07+00:00", "updated_time": "2018-11-20T20:23:07+00:00", "image": "https://goop-img.com/wp-content/uploads/2016/03/Teflon-GS3574313-1.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2016/03/Teflon-GS3574313-1.jpg", "image:width": "820", "image:height": "625"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.nytimes.com/2016/01/10/magazine/the-lawyer-who-became-duponts-worst-nightmare.html?_r=1", "http://greensciencepolicy.org/", "http://amzn.to/1VQFmQh", "http://greensciencepolicy.org/highly-fluorinated-chemicals/", "http://ehp.niehs.nih.gov/1509934/", "http://ehp.niehs.nih.gov/1509934/", "http://www.ncbi.nlm.nih.gov/pubmed/21334069", "http://www.environmentalhealthnews.org/ehs/news/2015/aug/breastfeeding-baby-health-chemicals-endocrine-disruption", "https://theintercept.com/staff/sharon-lerner/", "https://shop.goop.com/collections/staub?sort_by=created-descending", "https://shop.goop.com/collections/cocolab/products/cocofloss", "https://goop.com/common-household-toxins/", "https://www.facebook.com/Goop", "https://twitter.com/goop", "https://instagram.com/goop", "https://www.youtube.com/user/goop", "http://www.pinterest.com/goop/", "https://play.spotify.com/user/gooptunes?play=true&utm_source=open.spotify.com&utm_medium=open"], "authors": [], "publish_date": "2016-03-31T16:00:00+00:00"}