{"result_id": "139032", "URL": "https://goop.com/food/entertaining/easy-dinner-party-ideas-2021/", "timestamp": "2023-04-25 15:20:35 CEST+0200", "meta": {"description": "Our streamlined list of easy dinner party ideas gives DIY a refresher. Level up your next postpandemic get together with a low-lift menu and final touches.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/food/entertaining/easy-dinner-party-ideas-2021/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "7 Easy Dinner Party Ideas - DIY Dinner Level Up", "cleaned_text": "Caitlin O’Malley is goop’s food director. She gives us recipes, takeout recommendations, and advice on anything not related to food. She makes us laugh every day. She’s wise, which you can see for yourself on the sixth episode of The goop Lab on Netflix: “Are You Intuit?”\n\nDear Caitlin, Now that I’m fully vaccinated, I’m so looking forward to hosting dinner parties this summer. But honestly, I might not be able to go all out as I used to—my social stamina isn’t what it was before last year. Do you have any tips for keeping it laid-back and easy without missing out on the fun? —Julie\n\nDear Julie, I am right there with you! After hosting my first post-vax event (an outdoor birthday lunch for four), I was surprisingly tuckered out. I had forgotten just how much work entertaining can be. I have always gravitated toward an unfussy, casual vibe when hosting—which tends to put your guests at ease and be less work for you—and I think that strategy can also serve us as we make our reentry into the world of get-togethers and dinner parties. Here are some ideas that might help.\n\nThe Falcon Enamelware Bake Set is indeed great for baking—it’s safe for the oven, the stove top, and even the freezer. But calling it a bake set undersells my favorite use for this five-piece set, which is as servingware for outdoor entertaining. That timeless enamel look has a cool camping vibe. And the pans are both sturdy and lightweight, so no one will have to be too precious about passing the peas. The enamel coating might chip a bit over time, but the pans will still be safe to use, and those imperfections will give them some character and a lived-in feel. I use them for going straight from oven to table, like with a chicken, a lasagna, or roasted veggies. Or I use them as serving dishes for cold salads or even small sides, like sauces and pickles—the variety of sizes in this set makes it particularly useful. And yes, these work well for pastry, too. Cobblers, pies, cookies, cakes—they can all be cooked and served in the enamelware.\n\nA DIY bar is super fun for guests, especially if you go the extra mile to have all the accoutrements available. Luckily this can all be done way ahead of time, and it ultimately frees you up from having to make drinks all night. Set up a table with an assortment of liqueurs, mixers, bitters, tonic, seltzer, ice, some beers, and a few different bottles of wine. Set up a mixing station with a shaker; little dishes filled with olives, cocktail onions, and cherries; and a bowl of citrus, along with a paring knife and a cutting board. Fresh herbs like mint and basil are lovely additions to the mix as well. A couple more thoughtful add-ons: Put out a cocktail book or print a few cocktail recipes for inspiration. Toothpicks and reusable straws will both come in handy, too. Oh, and don’t forget a little scrap bowl for citrus peels.\n• Less fancy than a traditional\n\n rocks glass but still fun.\n• Every tool, for every bar\n\n trick in the book.", "opengraph": {"locale": "en_US", "type": "article", "title": "7 Easy Dinner Party Ideas - DIY Dinner Level Up | goop", "description": "Our streamlined list of easy dinner party ideas gives DIY a refresher. Level up your next postpandemic get together with a low-lift menu and final touches.", "url": "https://goop.com/food/entertaining/easy-dinner-party-ideas-2021/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2021-05-13T11:49:10+00:00", "article:modified_time": "2021-09-15T20:48:46+00:00", "updated_time": "2021-09-15T20:48:46+00:00", "image": "https://goop-img.com/wp-content/uploads/2021/05/Easy-Dinner-Party-Ideas_falcon-fish-RGB-1.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2021/05/Easy-Dinner-Party-Ideas_falcon-fish-RGB-1.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/mediumship-and-grief/", "https://goop.com/falcon-enamelware-bake-set/p/", "https://goop.com/recipes/sticky-sweet-lemongrass-roast-chicken/", "https://goop.com/recipes/chipotle-shrimp-tacos/", "https://goop.com/recipes/crockpot-veggie-chili/ ", "https://goop.com/earl-cocktail-straws/p/", "https://goop.com/caravan-bistro-glasses-set-of-6/p/", "https://goop.com/nappa-dori-bar-tool-kit-1/p/", "https://goop.com/kitchen/c/"], "authors": [], "publish_date": "2021-05-13T11:49:10+00:00"}