{"result_id": "139034", "URL": "https://goop.com/wellness/health/how-to-boost-your-immune-system/", "timestamp": "2023-04-25 15:20:37 CEST+0200", "meta": {"description": "With more developments coming every day on the novel coronavirus, it’s helpful to be informed, prepared, and vigilant for your health and for the health of those around you. We’ll be updating this page (and our Instagram) with interviews, stories, tools, and episodes of The goop Podcast that feel relevant right now.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/how-to-boost-your-immune-system/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "COVID-19 Conversations and Tools for Bolstering Your Immune System", "cleaned_text": "With more developments coming every day on the novel coronavirus, it’s helpful to be informed, prepared, and vigilant for your health and for the health of those around you. We’ll be updating this page (and our Instagram ) with interviews, stories, tools, and episodes of The goop Podcast that feel relevant right now. If you want to learn more about how we’re navigating our shops, we’ve posted a separate note about that. And if there are questions you have that you want us to be asking or other stories you’d like to read, please drop us a line at [email protected]\n\nCOVID-19 is a serious respiratory disease caused by a form of coronavirus that has not been previously identified in humans. It was first detected in China and has now spread across the globe, with over 133,311,000 confirmed cases globally and more than 2,891,000 global deaths as of April 8, 2021 (see the COVID-19 dashboard from Johns Hopkins University for daily updates).\n• How it spreads: COVID-19 is thought to spread from person to person through close contact or droplets that are produced when a person coughs or sneezes. People are most contagious when they have symptoms; however, new data suggests it may also spread before people are symptomatic (CDC). That’s why it’s important to practice social distancing—limiting contact with others-and always wear a mask in public (Johns Hopkins).\n• Symptoms: Two to fourteen days after exposure, symptoms such as fever, cough, shortness of breath, chills, muscle pain, headache, sore throat, and loss of smell or taste may appear (CDC).\n• What to do if you are sick: If you are sick or have symptoms of COVID-19, stay home and isolate yourself, avoiding contact with other people. If you live with another person, practice rigorous hygiene, disinfect surfaces regularly, and avoid sharing items. Call your doctor, tell them that you may have COVID-19, and ask them to alert your local or state health department. Have your doctor determine when it is safe to end home isolation (CDC).\n• How serious is COVID-19: Older adults, those with existing health conditions, and people who are immunocompromised are more likely to develop a severe form of illness that may be fatal (CDC). This is why it’s especially important to isolate yourself if you have symptoms so that you do not spread it to susceptible people.\n• How to protect yourself and others: There is currently no vaccine for COVID-19, although there is one in development that may be available in one to two years. To protect yourself from infection, wear a mask (CDC). Wash your hands regularly for at least twenty seconds or use a hand sanitizer that contains at least 60 percent alcohol. Avoid touching your face (read this New York Times article for tips on how to resist the urge). Disinfect items you touch often, such as your phone or laptop, with EPA-registered household disinfectants, since COVID-19 can stay active anywhere from a few hours to a few days on surfaces (NIH). Avoid close contact with others and practice social distancing (CDC).\n\nHow to Help\n\nDuring the COVID-19 pandemic, there’s a lot that feels out of our control. One way to cope is channeling this into positive action.\n• None How to Support Kids, Seniors, and Vulnerable Communities We can do our part by supporting others in our communities—and worldwide—who need additional help during this difficult time.\n• None We’ve highlighted nonprofits that are well worth contributing to, providing crucial assistance to those who need it most.\n• None A severe shortage of personal protective equipment—including masks, gloves, and gowns—poses an enormous threat to the health of frontline health care workers and the patients they care for.\n\nNew Research and Information About COVID-19\n\nImportant news and guidance from researchers, doctors, and journalists.\n• None Vivek Murthy, MD, nineteenth surgeon general of the United States, joins The goop Podcast from the front lines to share what we need to prioritize right now.\n• None Angela Rasmussen, PhD, a virologist at Columbia University who studies highly pathogenic viruses, explains what we know now about COVID-19.\n• None JoAnn Manson, MD, DrPH, the chief of the Division of Preventive Medicine at Brigham and Women’s Hospital shares what researchers have learned about sex and gender differences in health during this pandemic.\n• None An Epidemiologist and COVID-19 Researcher on What Happens Next Infectious disease epidemiologist Anne Rimoin helped answer the question looming in our mind: How will this pandemic end?\n• None What Scientists are Learning about COVID-19 With the outbreak of the COVID-19 pandemic, researchers around the globe are racing to better understand and predict how the virus works, how it’s spreading, and how we can mount a response to best protect our communities. We’ve summarized four of the most important new research findings on COVID-19.\n• None We’ve been curating our feeds toward those who make us feel seen, comforted, and informed (not necessarily all at the same time).\n• None Four articles each week to help you stay informed.\n\nYou may find yourself experiencing more stress, anxiety, and even grief. We’ve asked experts for their rituals and tools that can help us process difficult emotions and feel a little more grounded. (If you’re looking for guided meditations, head to our YouTube page.)\n• None What Happens during Prolonged Stress “The reality is challenging, and then, of course, our fears about what might happen magnify immensely the actual situation,” says psychiatrist James Gordon, MD, author of The Transformation. Gordon returns to The goop Podcast to offer strategies that can help us ease anxiety.\n• None GP and Barry Michels on Mastering Our Emotions Psychotherapist Barry Michels shares his three-point plan that he’s been teaching to clients during the COVID-19 crisis, helping them to cope with a sense of powerlessness, feelings of negativity, and the realities of being cooped up with family.\n• None Psychiatrist Judson Brewer, MD, describes anxiety as a form of uncertainty. How do we bring some certainty to our lives when our world feels out of control?\n• None Therapist Carder Stout, PhD, knows that we’re in a near-constant state of high alert, but he tells us there are ways we can still release fear and be present.\n• None Breathwork practitioner Ashley Neese walks us through the basics of breathwork and an extended exhale practice that takes just ninety seconds.\n• None Psychiatrist Ellen Vora, MD, has a gentle approach to anxiety: We are all somewhere on the anxiety spectrum, she says.\n• None Our Crash Course in Being Mortal An essay from palliative-care physician Ira Byock on how to deal with feelings of grief and fear of death.\n• None GP talks to Glennon Doyle, the New York Times–bestselling author of Untamed, about how to manage difficult emotions and manage your expectations for productivity. Instead of doing, Doyle says, focus on feeling.\n\nWhile it’s necessary to physically distance from one another, there are ways we can still find meaningful connection. And if you’re cooped up with loved ones—there are ways to try to strengthen those relationships (and keep your sanity).\n• None How Do We Build Connection While Social Distancing? Psychiatrist James Gordon, MD, the founder and director of the Center for Mind-Body Medicine, shared with us two techniques for opening up to vulnerability, to one another, and to the healing we can achieve when we go at it together.\n• None GP and her husband did a video call with intimacy teacher Michaela Boehm, who offers a framework to help partners process hard emotions and reconnect with each other.\n• None Therapist Lori Gottlieb, MFT, offers advice for couples who are navigating the challenges of being long-distance during a pandemic.\n• None Until the time comes when we can safely meet up with our friends and wider social circles again, here’s how we’re keeping our social lives intact.\n\nIf your living room has become a home office-turned-playroom-turned-classroom, we feel you. Here are resources to help you and your children adjust.\n• None Family therapist Ashley Graber shares her tips for parents to create a positive space at home as well as some online resources.\n• None Family counselor, school consultant, and educator Kim John Payne says that kids feel safe when they sense their parents are in charge—even, and perhaps especially, in uncertain moments.\n• None The best approach to being a homeschooling parent, says a homeschool teacher, is to give your kids and give yourself a break.\n• None How an Ob-Gyn Is Handling Pregnancy and Birth Now There are some special considerations when you’re delivering babies during a pandemic. Every one of them is about protecting every person in the room: mom, baby, and medical professionals.\n\nNothing here is a cure (clearly), but there are a few things that can help support our immune system and a few other things that make being home-bound more bearable in our experience (like a certain bath, Manuka honey, and streaming yoga classes).\n• None Simple Wellness Tools That Help Us Get Through the Day We’re reaching for little things that offer support, asking our friends what their routines (or lack thereof) look like right now, and sending thinking-of-you packages from this wellness short list.\n• None 8 Ways to Feel Joy and Find Support While Social Distancing Staying connected with friends, meditating, allowing yourself to feel gratitude, and moving around are a few things that can buoy us. Also, a vibrator for self-pleasure, because why not?\n• None The comforting elements we turn to when we want to support our bodies or feel relief while we get some much-needed rest.\n• None Ask Gerda: Can You Get Enough Vitamin D from Food? The short answer is: no.\n• None We asked our chief content officer, Elise Loehnen, to share what’s been keeping her busy at home these days.\n• None 12 Ways to Unplug When You’re Sick of Screen Time but Can’t Quit It Here’s how we’re finding reprieve from all this newfound screen time.\n• None Should I Take Vitamin C for Immunity? Vitamin C’s role in immunity looks more extensive and interesting than ever.\n• None Many studios and trainers are offering free trial periods, if you’re looking to try something new.\n• None 11 Ways to Self-Soothe and Feel Healthy at Home Gerda shares her favorites products and services for staying calm and cared for while at home.\n• None We ask four goop staffers what sacred Sunday rituals they’re embracing now, more than ever.\n\nIf you’re finding yourself in the kitchen much more often these days, we’re collating simple recipes, as well as general nutrition advice from experts.\n• None Tips, Tools, and Vegetable-Forward Recipes to Make Your Produce Last Longer Here are some tricks and strategies to maximize pantry goods and use leftovers for a more efficient kitchen.\n• None Gerda Endemann, our senior director of science and research, gave our food editor, Caitlin O’Malley, a list of immune-supporting ingredients. And Caitlin came up with four new feel-good soups.\n• None 27 Recipes That Will Reinvent Your Leftovers We asked our staffers what leftover ingredients had them stumped and picked our favorite recipes to give them a little inspiration.\n• None Three spruced-up freezer favorites your future self will be grateful to have.\n• None Harvard physician William Li, MD, talks about what the body is capable of when it’s properly supported by both food and medicine. (We also interviewed him for a Q&A.)\n• None 3 Make-Ahead Salads That Will Last in the Fridge Chef Seamus Mullen created three salad recipes that allow us to get ahead of our WFH schedule with simple meal prep.\n• None Three easy and good-for-us dishes that will soothe, satiate, and help support the body.\n• None Recipes and Tips for Maximizing Your Pantry Staples From beans and lentils to noodles and canned foods, we’re coming back to this guide to make use of all the odds and ends in our pantries.\n• None Here are some of our go-to recipes that are simple to prepare, taste great, and can get your little ones excited to spend time in the kitchen.\n\nFOR THE MIND, BODY, AND SPIRIT\n\nWe’ve asked our favorite healers, intuitives, writers, and therapists for their perspectives and advice during this time.\n• None 7 Ways to Take Care of Ourselves—and One Another—Emotionally Therapist Shira Myrow, MFT, and mindfulness teacher Laurie Cousins offers techniques for how we can emotionally take care of ourselves and one another.\n• None An updated collection of meditations, breathwork practices, sound baths, and Reiki sessions from some of our favorite practitioners.\n• None What Are We Being Called to Do? Award-winning author Terry Tempest Williams offers a spiritual perspective on this moment, asking if we can redefine what we deem essential and allow ourselves to find refuge in change.\n• None What Intuitives and Healers Are Drawing On for Strength We asked a few of our favorite healers how they are approaching this time of uncertainty. They shared with us their tips and tools for emotional and spiritual health.\n• None What Does It Mean to Have Faith Now? Psychological astrologer Jennifer Freed on how to strengthen, awaken, and build faith in the times of COVID-19.\n• None Many of our favorite intuitives and energy healers are currently offering distant sessions by phone.\n• None Claire Bidwell Smith, a grief therapist and the author of Anxiety: The Missing Stage of Grief, talked to us about how we can harness the wisdom of grief and loss to help guide us now.\n• None What Happens When We’re Not Busy? Author and researcher Bethany Saltman writes of our unique opportunity to know what it means to present now.\n• None Grieving, Mourning, and Honoring Loved Ones in Social Isolation We asked psychiatrist and bereavement researcher Dr. Kathy Shear for her advice on coping with grief during a pandemic and how to lend help to friends who need it.\n• None Throw a Chic, Safe Summer Party— with Help from an Epidemiologist and an Event Planner If you’re thinking of throwing a party this summer, we’ve compiled some great advice from an epidemiologist and an event planner on how to plan a safe and gorgeous event.\n• None We’ve compiled some COVID-specific precautions as well as what to pack and bring to a protest to show your support for the Black Lives Matter movement.\n• None How to Deal with Zoom Fatigue You may have noticed: There is a special kind of tiredness that comes from a day of Zoom calls. We asked psychiatrist Gianpiero Petriglieri how to deal.\n• None 11 Things to See and Do—from Home—on the Weekend We rounded up ideas for making the most of your downtime at home—from a night at the opera to a journey through an Alaskan fjord.\n• None Sallie Krawcheck, CEO and cofounder of Ellevest, walks us through what’s happening right now with the market and what we can do for our financial health.\n• None How to Decontaminate Packages and Reduce the Risk of Bringing the Coronavirus Home Some of us want more information about how to bring groceries and packages inside without bringing along the novel coronavirus. So we asked Ron Kopito, PhD, a professor of biology at Stanford University, what he’s doing at home.\n• None Why Vaccinations and Herd Immunity Save Our Communities The science boils down to this: Vaccination works when we all work together.\n• None How Employees, Managers, and Companies Can Adjust to Working from Home Harvard Business School associate professor Prithwiraj Choudhury has long advocated for a work-from-anywhere approach built on boundaries and trust.\n• None We started a book club and hope you’ll join, or at least check out these twelve books we’re loving right now.\n• None Pasta by the Pound, DIY Sewing Kits, and 13 Other Things We’re Talking About From homemade pasta that benefits food banks to cookbooks that spark joy, here are fifteen things staffers are loving right now at home.\n• None We asked Ruby Warrington, author of Sober Curious, Holly Whitaker, founder of Tempest, and Veronica Valli of Soberful about managing different levels of sobriety and drinking behaviors right now.\n• None While we look forward to browsing, shopping, and hanging together in person again, we’re finding joy and comfort in supporting these brands, businesses, and people from home in the meantime.\n• None We spoke to Pamela Capalad, a Brooklyn-based CFP and the founder of the financial planning platform Brunch & Budget, about how she’s advising her clients to navigate unemployment, budgeting in a time of crisis, their 401(k)s, credit cards, and the stimulus package.\n• None How to Fight Boredom with Curiosity Harvard professor Francesca Gino works to understand the psychology that drives our decisions and the tools that help people live fulfilled lives. According to Gino, childlike curiosity is a skill we should all rediscover.\n\nThis article is for informational purposes only, even if and regardless of whether it features the advice of physicians and medical practitioners. This article is not, nor is it intended to be, a substitute for professional medical advice, diagnosis, or treatment and should never be relied upon for specific medical advice. The views expressed in this article are the views of the expert and do not necessarily represent the views of goop.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Conversations and Tools for Bolstering Your Immune System | goop", "description": "With more developments coming every day on the novel coronavirus, it’s helpful to be informed, prepared, and vigilant for your health and for the health of those around you. We’ll be updating this page (and our Instagram) with interviews, stories, tools, and episodes of The goop Podcast that feel relevant right now.", "url": "https://goop.com/wellness/health/how-to-boost-your-immune-system/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-03-12T13:00:06+00:00", "article:modified_time": "2021-04-08T16:36:51+00:00", "updated_time": "2021-04-08T16:36:51+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/03/iStock-1182622704.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/03/iStock-1182622704.jpg", "image:width": "1400", "image:height": "1066"}, "tags": [], "tweets": [], "movies": [], "links": ["https://coronavirus.jhu.edu/map.html", "https://www.cdc.gov/coronavirus/2019-ncov/about/transmission.html", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/coronavirus-social-distancing-and-self-quarantine", "https://www.cdc.gov/coronavirus/2019-ncov/about/symptoms.html", "https://www.cdc.gov/coronavirus/2019-ncov/about/steps-when-sick.html", "https://www.cdc.gov/mmwr/volumes/69/wr/mm6908e1.htm", "https://time.com/5790545/first-covid-19-vaccine/", "https://www.cdc.gov/media/releases/2020/p0714-americans-to-wear-masks.html", "https://www.nytimes.com/2020/03/05/health/stop-touching-your-face-coronavirus.html", "https://www.nih.gov/news-events/news-releases/new-coronavirus-stable-hours-surfaces", "https://www.cdc.gov/coronavirus/2019-ncov/about/steps-when-sick.html", "https://goop.com/work/civics/how-to-help-others-during-covid-19/", "https://goop.com/work/civics/how-to-help-others-during-covid-19/", "https://goop.com/work/civics/how-to-help-others-during-covid-19/", "https://goop.com/travel/culture/covid-19-relief-efforts-to-support/", "https://goop.com/travel/culture/covid-19-relief-efforts-to-support/", "https://goop.com/travel/culture/covid-19-relief-efforts-to-support/", "https://goop.com/wellness/environmental-health-civics/companies-helping-with-medical-supply-shortages/", "https://goop.com/wellness/environmental-health-civics/companies-helping-with-medical-supply-shortages/", "https://goop.com/wellness/environmental-health-civics/companies-helping-with-medical-supply-shortages/", "https://goop.com/the-goop-podcast/navigating-covid-19/", "https://goop.com/the-goop-podcast/navigating-covid-19/", "https://goop.com/the-goop-podcast/navigating-covid-19/", "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "https://goop.com/wellness/health/why-covid-19-affects-men-and-women-differently/", "https://goop.com/wellness/health/why-covid-19-affects-men-and-women-differently/", "https://goop.com/wellness/health/why-covid-19-affects-men-and-women-differently/", "https://goop.com/wellness/health/how-will-covid-19-end", "https://goop.com/wellness/health/how-will-covid-19-end", "https://goop.com/wellness/health/how-will-covid-19-end", "https://goop.com/wellness/health/new-coronavirus-research/", "https://goop.com/wellness/health/new-coronavirus-research/", "https://goop.com/wellness/health/new-coronavirus-research/", "https://goop.com/wellness/health/coronavirus-social-media-resources/", "https://goop.com/wellness/health/coronavirus-social-media-resources/", "https://goop.com/wellness/health/coronavirus-social-media-resources/", "https://goop.com/wellness/health/4-coronavirus-stories-worth-reading-right-now/", "https://goop.com/wellness/health/4-coronavirus-stories-worth-reading-right-now/", "https://goop.com/wellness/health/4-coronavirus-stories-worth-reading-right-now/", "https://www.youtube.com/playlist?list=PL5hh9tZbeimRJCoTuKeLpWPRMDfeB16o0", "https://goop.com/the-goop-podcast/what-happens-during-prolonged-stress/", "https://goop.com/the-goop-podcast/what-happens-during-prolonged-stress/", "https://goop.com/the-goop-podcast/what-happens-during-prolonged-stress/", "https://goop.com/wellness/mindfulness/managing-your-emotional-triggers", "https://goop.com/wellness/mindfulness/managing-your-emotional-triggers", "https://goop.com/wellness/mindfulness/managing-your-emotional-triggers", "https://goop.com/the-goop-podcast/ways-to-ground-yourself-during-anxiety/", "https://goop.com/the-goop-podcast/ways-to-ground-yourself-during-anxiety/", "https://goop.com/the-goop-podcast/ways-to-ground-yourself-during-anxiety/", "https://goop.com/wellness/mindfulness/affirmations-for-overcoming-fear/", "https://goop.com/wellness/mindfulness/affirmations-for-overcoming-fear/", "https://goop.com/wellness/mindfulness/affirmations-for-overcoming-fear/", "https://goop.com/wellness/mindfulness/a-90-second-breathwork-tool-to-reduce-stress/", "https://goop.com/wellness/mindfulness/a-90-second-breathwork-tool-to-reduce-stress/", "https://goop.com/wellness/mindfulness/a-90-second-breathwork-tool-to-reduce-stress/", "https://goop.com/wellness/health/ways-to-reduce-anxiety/", "https://goop.com/wellness/health/ways-to-reduce-anxiety/", "https://goop.com/wellness/health/ways-to-reduce-anxiety/", "https://goop.com/wellness/spirituality/contemplating-death/", "https://goop.com/wellness/spirituality/contemplating-death/", "https://goop.com/wellness/spirituality/contemplating-death/", "https://goop.com/wellness/mindfulness/glennon-doyle-metabolizing-difficult-emotions/", "https://goop.com/wellness/mindfulness/glennon-doyle-metabolizing-difficult-emotions/", "https://goop.com/wellness/mindfulness/glennon-doyle-metabolizing-difficult-emotions/", "https://goop.com/wellness/mindfulness/how-to-build-connection-while-social-distancing/?ref=newsletter", "https://goop.com/wellness/mindfulness/how-to-build-connection-while-social-distancing/?ref=newsletter", "https://goop.com/wellness/mindfulness/how-to-build-connection-while-social-distancing/?ref=newsletter", "https://goop.com/wellness/relationships/how-to-build-intimacy-in-difficult-times/", "https://goop.com/wellness/relationships/how-to-build-intimacy-in-difficult-times/", "https://goop.com/wellness/relationships/how-to-build-intimacy-in-difficult-times/", "https://goop.com/wellness/relationships/long-distance-relationship-during-a-pandemic", "https://goop.com/wellness/relationships/long-distance-relationship-during-a-pandemic", "https://goop.com/wellness/relationships/long-distance-relationship-during-a-pandemic", "https://goop.com/wellness/relationships/resources-for-virtual-connection", "https://goop.com/wellness/relationships/resources-for-virtual-connection", "https://goop.com/wellness/relationships/resources-for-virtual-connection", "https://goop.com/wellness/parenthood/parenting-during-coronavirus-pandemic/", "https://goop.com/wellness/parenthood/parenting-during-coronavirus-pandemic/", "https://goop.com/wellness/parenthood/parenting-during-coronavirus-pandemic/", "https://goop.com/the-goop-podcast/special-episode-reducing-anxiety-for-kids/", "https://goop.com/the-goop-podcast/special-episode-reducing-anxiety-for-kids/", "https://goop.com/the-goop-podcast/special-episode-reducing-anxiety-for-kids/", "https://goop.com/wellness/parenthood/homeschooling-tips-for-parents/", "https://goop.com/wellness/parenthood/homeschooling-tips-for-parents/", "https://goop.com/wellness/parenthood/homeschooling-tips-for-parents/", "https://goop.com/wellness/health/pregnancy-and-birth-during-covid-19/", "https://goop.com/wellness/health/pregnancy-and-birth-during-covid-19/", "https://goop.com/wellness/health/pregnancy-and-birth-during-covid-19/", "https://goop.com/wellness/health/tools-for-staying-healthy-at-home/", "https://goop.com/wellness/health/tools-for-staying-healthy-at-home/", "https://goop.com/wellness/health/tools-for-staying-healthy-at-home/", "https://goop.com/wellness/mindfulness/ways-to-feel-joy-while-social-distancing/", "https://goop.com/wellness/mindfulness/ways-to-feel-joy-while-social-distancing/", "https://goop.com/wellness/mindfulness/ways-to-feel-joy-while-social-distancing/", "https://goop.com/wellness/health/best-products-for-immune-system/", "https://goop.com/wellness/health/best-products-for-immune-system/", "https://goop.com/wellness/health/best-products-for-immune-system/", "https://goop.com/wellness/health/should-i-take-vitamin-d-for-immunity/%20", "https://goop.com/wellness/health/should-i-take-vitamin-d-for-immunity/%20", "https://goop.com/wellness/health/should-i-take-vitamin-d-for-immunity/%20", "https://goop.com/wellness/mindfulness/best-products-for-staying-at-home/", "https://goop.com/wellness/mindfulness/best-products-for-staying-at-home/", "https://goop.com/wellness/mindfulness/best-products-for-staying-at-home/", "https://goop.com/wellness/mindfulness/how-to-unplug-when-working-from-home", "https://goop.com/wellness/mindfulness/how-to-unplug-when-working-from-home", "https://goop.com/wellness/mindfulness/how-to-unplug-when-working-from-home", "https://goop.com/wellness/health/should-i-take-vitamin-c-for-immunity/", "https://goop.com/wellness/health/should-i-take-vitamin-c-for-immunity/", "https://goop.com/wellness/health/should-i-take-vitamin-c-for-immunity/", "https://goop.com/wellness/fitness/the-best-streaming-workouts/", "https://goop.com/wellness/fitness/the-best-streaming-workouts/", "https://goop.com/wellness/fitness/the-best-streaming-workouts/", "https://goop.com/wellness/health/ways-to-stay-healthy-at-home/", "https://goop.com/wellness/health/ways-to-stay-healthy-at-home/", "https://goop.com/wellness/health/ways-to-stay-healthy-at-home/", "https://goop.com/wellness/mindfulness/ways-to-stay-entertained-during-quarantine/", "https://goop.com/wellness/mindfulness/ways-to-stay-entertained-during-quarantine/", "https://goop.com/wellness/mindfulness/ways-to-stay-entertained-during-quarantine/", "https://goop.com/food/recipes/", "https://goop.com/food/tutorials/how-to-make-produce-last-longer", "https://goop.com/food/tutorials/how-to-make-produce-last-longer", "https://goop.com/food/tutorials/how-to-make-produce-last-longer", "https://goop.com/food/recipes/immune-boosting-soup-recipes/", "https://goop.com/food/recipes/immune-boosting-soup-recipes/", "https://goop.com/food/recipes/immune-boosting-soup-recipes/", "https://goop.com/food/recipes/ways-to-reinvent-your-leftovers/", "https://goop.com/food/recipes/ways-to-reinvent-your-leftovers/", "https://goop.com/food/recipes/ways-to-reinvent-your-leftovers/", "https://goop.com/food/recipes/freezer-friendly-dinner-recipes/", "https://goop.com/food/recipes/freezer-friendly-dinner-recipes/", "https://goop.com/food/recipes/freezer-friendly-dinner-recipes/", "https://goop.com/the-goop-podcast/dr-william-li-on-eating-to-beat-disease/", "https://goop.com/the-goop-podcast/dr-william-li-on-eating-to-beat-disease/", "https://goop.com/wellness/health/disease-prevention-foods/", "https://goop.com/the-goop-podcast/dr-william-li-on-eating-to-beat-disease/", "https://goop.com/food/recipes/make-ahead-salads-that-will-last/", "https://goop.com/food/recipes/make-ahead-salads-that-will-last/", "https://goop.com/food/recipes/make-ahead-salads-that-will-last/", "https://goop.com/wellness/health/what-to-cook-when-you-have-the-flu/", "https://goop.com/wellness/health/what-to-cook-when-you-have-the-flu/", "https://goop.com/wellness/health/what-to-cook-when-you-have-the-flu/", "https://goop.com/food/recipes/pantry-friendly-recipes/", "https://goop.com/food/recipes/pantry-friendly-recipes/", "https://goop.com/food/recipes/pantry-friendly-recipes/", "https://goop.com/food/recipes/fun-recipes-to-make-with-kids/", "https://goop.com/food/recipes/fun-recipes-to-make-with-kids/", "https://goop.com/food/recipes/fun-recipes-to-make-with-kids/", "https://goop.com/wellness/mindfulness/tips-for-staying-sane-during-self-isolation", "https://goop.com/wellness/mindfulness/tips-for-staying-sane-during-self-isolation", "https://goop.com/wellness/mindfulness/tips-for-staying-sane-during-self-isolation", "https://goop.com/wellness/mindfulness/guided-meditations/", "https://goop.com/wellness/mindfulness/guided-meditations/", "https://goop.com/wellness/mindfulness/guided-meditations/", "https://goop.com/the-goop-podcast/terry-tempest-williams-on-our-calling/", "https://goop.com/the-goop-podcast/terry-tempest-williams-on-our-calling/", "https://goop.com/the-goop-podcast/terry-tempest-williams-on-our-calling/", "https://goop.com/wellness/spirituality/tips-for-emotional-and-spiritual-health-from-intuitives/", "https://goop.com/wellness/spirituality/tips-for-emotional-and-spiritual-health-from-intuitives/", "https://goop.com/wellness/spirituality/tips-for-emotional-and-spiritual-health-from-intuitives/", "https://goop.com/wellness/spirituality/faith-in-the-times-of-covid-19", "https://goop.com/wellness/spirituality/faith-in-the-times-of-covid-19", "https://goop.com/wellness/spirituality/faith-in-the-times-of-covid-19", "https://goop.com/wellness/spirituality/remote-energy-healing-practitioners", "https://goop.com/wellness/spirituality/remote-energy-healing-practitioners", "https://goop.com/wellness/spirituality/remote-energy-healing-practitioners", "https://goop.com/wellness/health/how-to-navigate-uncertainty/?ref=newsletter", "https://goop.com/wellness/health/how-to-navigate-uncertainty/?ref=newsletter", "https://goop.com/wellness/health/how-to-navigate-uncertainty/?ref=newsletter", "https://goop.com/wellness/mindfulness/what-happens-when-were-not-busy/", "https://goop.com/wellness/mindfulness/what-happens-when-were-not-busy/", "https://goop.com/wellness/mindfulness/what-happens-when-were-not-busy/", "https://goop.com/wellness/mindfulness/processing-grief-during-social-isolation/", "https://goop.com/wellness/mindfulness/processing-grief-during-social-isolation/", "https://goop.com/wellness/mindfulness/processing-grief-during-social-isolation/", "https://goop.com/food/entertaining/how-to-throw-a-safe-summer-party/", "https://goop.com/food/entertaining/how-to-throw-a-safe-summer-party/", "https://goop.com/food/entertaining/how-to-throw-a-safe-summer-party/", "https://goop.com/wellness/health/how-to-protest-safely-during-a-pandemic/", "https://goop.com/wellness/health/how-to-protest-safely-during-a-pandemic/", "https://goop.com/wellness/health/how-to-protest-safely-during-a-pandemic/", "https://goop.com/wellness/mindfulness/zoom-fatigue/", "https://goop.com/wellness/mindfulness/zoom-fatigue/", "https://goop.com/wellness/mindfulness/zoom-fatigue/", "https://goop.com/food/entertaining/things-to-do-at-home-this-weekend/?ref=newsletter", "https://goop.com/food/entertaining/things-to-do-at-home-this-weekend/?ref=newsletter", "https://goop.com/food/entertaining/things-to-do-at-home-this-weekend/?ref=newsletter", "https://goop.com/the-goop-podcast/sallie-krawcheck-managing-money-during-crisis/", "https://goop.com/the-goop-podcast/sallie-krawcheck-managing-money-during-crisis/", "https://goop.com/the-goop-podcast/sallie-krawcheck-managing-money-during-crisis/", "https://goop.com/wellness/health/how-to-reduce-coronavirus-risk-from-groceries-and-packages/", "https://goop.com/wellness/health/how-to-reduce-coronavirus-risk-from-groceries-and-packages/", "https://goop.com/wellness/health/how-to-reduce-coronavirus-risk-from-groceries-and-packages/", "https://goop.com/wellness/health/why-vaccines-save-kids-and-communities/", "https://goop.com/wellness/health/why-vaccines-save-kids-and-communities/", "https://goop.com/wellness/health/why-vaccines-save-kids-and-communities/", "https://goop.com/wellness/mindfulness/new-books-to-read-during-quarantine", "https://goop.com/wellness/mindfulness/new-books-to-read-during-quarantine", "https://goop.com/goop-book-club/", "https://goop.com/wellness/mindfulness/new-books-to-read-during-quarantine", "https://goop.com/food/decorating-design/sewing-kits-for-diy-projects-and-other-highlights/", "https://goop.com/food/decorating-design/sewing-kits-for-diy-projects-and-other-highlights/", "https://goop.com/food/decorating-design/sewing-kits-for-diy-projects-and-other-highlights/", "https://goop.com/wellness/mindfulness/sobriety-support-during-covid-19", "https://goop.com/wellness/mindfulness/sobriety-support-during-covid-19", "https://goop.com/wellness/mindfulness/sobriety-support-during-covid-19", "https://goop.com/food/decorating-design/small-businesses-to-support-now", "https://goop.com/food/decorating-design/small-businesses-to-support-now", "https://goop.com/food/decorating-design/small-businesses-to-support-now", "https://goop.com/wellness/career-money/finance-advice-during-coronavirus", "https://goop.com/wellness/career-money/finance-advice-during-coronavirus", "https://goop.com/wellness/career-money/finance-advice-during-coronavirus", "https://goop.com/wellness/mindfulness/how-to-fight-boredom-with-curiosity/", "https://goop.com/wellness/mindfulness/how-to-fight-boredom-with-curiosity/", "https://goop.com/wellness/mindfulness/how-to-fight-boredom-with-curiosity/"], "authors": [], "publish_date": "2020-03-12T13:00:06+00:00"}