{"result_id": "139016", "URL": "https://goop.com/wellness/mindfulness/breathwork-for-grief-and-trauma/", "timestamp": "2023-04-25 15:20:10 CEST+0200", "meta": {"description": "Treating racism, like treating any other ongoing public health emergency, will require intensive education, structural overhaul, and empathy. At the same time, it must involve opportunities for people of color to heal from the trauma inherent in living in a racist society. Breathwork facilitator Jasmine Marie has launched an initiative to help 1 million Black women process and heal from that trauma.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/mindfulness/breathwork-for-grief-and-trauma/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "A Breathwork Practice to Process Grief and Trauma—and a Pledge", "cleaned_text": "Jasmine Marie, the founder of breathwork healing community Black Girls Breathing, is moving the conversation forward around Black women’s trauma, grief, and overall mental health. The last time we spoke, Marie was holding space for Black women to heal in a safe container through virtual breathwork sessions. She’s still doing that. But her goals are getting bigger: Marie has also announced Black Girls Breathing’s pledge to reach 1 million Black women and girls by the year 2025. It takes a village to make this vital work happen—consider donating to Black Girls Breathing if you can.\n\nMarie will be leading the opening breathwork practice at our upcoming digital wellness summit, In goop Health. You can check out the event and get your pass here. In the meantime, try Marie’s practice for processing trauma and grief, below.\n\nIn the past year, we’ve had rapid growth in the number of Black women who joined our community. They participate in our virtual breathwork circles and stream the meditations we provide for free. And along the way, we turned into a hotline for these women. Only 28 percent of our community said that they had other mental health care resources outside of Black Girls Breathing.\n\nAs much as I love my work and love what we’re doing, that’s really sad. A majority of our community has health insurance, but they might still lack access to therapy. That might be because they’re underinsured—meaning their coverage is not extensive enough—or because the out-of-pocket costs of mental health care are too much. When we look at mental health offerings in the nonprofit space that are meant to help Black women and girls, they’re not operating in real time. You can sign up to get six months of free therapy, but you have to wait months to be able to access it. That doesn’t work for many of our community members who are dealing with extreme situations and need assistance now. These women don’t necessarily feel comfortable calling a mental health hotline; they don’t feel their specific challenges are seen or heard in those spaces.\n\nBlack Girls Breathing is a place to feel seen and understood. We hear that all the time from our community members. Our work does so much for them, and I’m grateful for it. But it’s also why my mission feels bigger than Black Girls Breathing: I want them to have other spaces where they can feel that way. I want them to have health care coverage that allows them to see a therapist, or a somatic healer, or whatever is necessary to get their needs met. Healing is not just one thing. But many of our community members do not have access to anything else.\n\nFor me, this feels like a heavy load. I look around and there isn’t anyone I could lean on too much or anyone who could understand what it’s like to make space for hundreds of Black women working through trauma at one time. It’s been difficult. I have felt isolated in this work. I haven’t seen anyone pioneering the type of work we’re doing at the volume we’re working with. That aspect has been rough. I’m not just the space holder; I also run a team and make decisions that any other start-up founder would have to make in order to plan for the future. As much as I love our community, it’s hard.\n\nThat’s why we are working on a project to grow our community and provide that real-time mental health support to Black women: We’re making a pledge to reach 1 million Black women by the year 2025. And there are several initiatives we’re taking to get there.\n\nIn addition to our virtual breathwork circles, we’re planning to launch a breathwork facilitator program. That’s not only about bringing breathworkers who are Black women onto the team but also about training them in how to approach this work. To work with the community we do, wellness practitioners need to do some unlearning. These women aren’t necessarily into wellness. They don’t need to know what yoga is. They might not have any form of self-care routine. I’m not throwing just any breathwork facilitator into this. That wouldn’t be responsible or ethical. It will take specific training.\n\nWe’re securing funding through corporate partners and building tools that will help us expand our reach. I’ve already had conversations with national organizations, corporations, and community organizations about expanding into their spaces. That includes schools: We plan to offer our services to younger girls, not just women.\n\nWe’re also using research on our community to help fill data gaps in health care. Since we began Black Girls Breathing, we’ve been asking our community members: What is going on in their lives? What is their insurance like? What do they think about talk therapy? How do they perceive the COVID-19 vaccines? Although this kind of information is critical to medical and public health research as a whole, government and nonprofit research programs—like the All of Us Research Program from the National Institutes of Health—don’t always reach the communities we work with.\n\nI work with a lot of grief. Not only over loss of life or other traumatic changes but also over major life transitions—maybe it’s simply a moment when you’re seeing yourself a new way. It’s good to release the frustrations that come with those changes, especially for Black women: We’re taught not to be this trope of the angry Black woman, so we don’t typically allow ourselves to get to that place of anger comfortably. There are actions that come naturally to our bodies—typically when we cry—that empty out stress. When something’s annoying or frustrating or sad, what do you do? You make a lot of noise, whether that’s sighing or groaning or yelling or sobbing. Sound is our body’s natural release system. This is a breathwork practice that combines breath and sound, and it’s powerful.\n• None Take a deep breath in through your nose.\n• None Audibly exhale through your mouth. Think about really letting the jaw draw open and relax. You might sigh. You might scream.\n• None At the end of the exhale, immediately continue into another inhale through your nose to repeat the exercise. Continue this connected audible breath for as little as thirty seconds and up to a couple of minutes.\n\nJasmine Marie is a breathwork practitioner and the founder of Black Girls Breathing, a community for Black women to actively manage their mental health with breathwork. She has a degree in marketing and international business from New York University and previously worked in global brand marketing at Unilever.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Breathwork Practice to Process Grief and Trauma—and a Pledge | goop", "description": "Treating racism, like treating any other ongoing public health emergency, will require intensive education, structural overhaul, and empathy. At the same time, it must involve opportunities for people of color to heal from the trauma inherent in living in a racist society. Breathwork facilitator Jasmine Marie has launched an initiative to help 1 million Black women process and heal from that trauma.", "url": "https://goop.com/wellness/mindfulness/breathwork-for-grief-and-trauma/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2021-05-27T11:45:10+00:00", "article:modified_time": "2021-05-27T03:27:28+00:00", "updated_time": "2021-05-27T03:27:28+00:00", "image": "https://goop-img.com/wp-content/uploads/2021/05/breathwork-with-jasmine-marie_Stocksy_txpc5ee19a2iQ5300_Medium_1735022-1.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2021/05/breathwork-with-jasmine-marie_Stocksy_txpc5ee19a2iQ5300_Medium_1735022-1.jpg", "image:width": "1656", "image:height": "1264"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.blackgirlsbreathing.com/", "https://goop.com/wellness/mindfulness/black-girls-breathing-breathwork-practice/", "https://www.blackgirlsbreathing.com/donate", "https://goop.com/ingoophealth/", "https://goop.com/ingoophealth/", "https://www.blackgirlsbreathing.com/"], "authors": [], "publish_date": "2021-05-27T11:45:10+00:00"}