{"result_id": "139017", "URL": "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "timestamp": "2023-04-25 15:20:12 CEST+0200", "meta": {"description": "There’s a lot of information and news out there about the novel coronavirus. Some of it is factual, some of it is not, and some hovers somewhere in between. We asked virologist Angela Rasmussen, PhD, our most pressing questions.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "A Virologist Answers Our Most Pressing COVID-19 Questions", "cleaned_text": "There’s a lot of information and news out there about the novel coronavirus. Some of it is factual, some of it is not, and some hovers somewhere in between. Because it’s an unprecedented pandemic, we have a lot of vital questions that remain. Can children be infected? Can a person be reinfected? What’s the current progress on treatments?\n\nSo we asked Angela Rasmussen, PhD, a virologist at Columbia University who studies highly pathogenic viruses, to explain what we know now about COVID-19. And importantly, she wasn’t afraid to tell us what we don’t yet know. Rasmussen knows that self-isolation is hard, but there’s an obvious upside: If we do this right—if we band together as communities advocating for good public health practices and interventions—things will be resolved much faster.\n\nWe don’t know for sure, but genomic evidence suggests that the closest related virus that we know of is a virus naturally found in bats. Many coronaviruses originate in bats and wildlife, and coronaviruses that are pathogenic, such as the SARS and MERS coronaviruses, are thought to have originated in bats and then infected other species. We don’t know if there is an intermediate species for this specific coronavirus, but we do know that there’s a very similar and closely related virus that was found in 2017 in Yunnan, China, in a bat. COVID-19 probably originated in wild bats, and either through direct exposure to those bats or exposure to another animal that was infected with a similar virus, it ended up crossing over into humans. One suggested intermediate host has been pangolins, an endangered scaled mammal that is widely traded on the black market for both meat and the use of its scales and body parts in some types of alternative medical treatments. Genetically similar coronaviruses have been identified in pangolins, but there is no evidence that this specific virus came from pangolins. We haven’t found the “smoking pangolin,” although it’s certainly possible that the wildlife trade in either bats, pangolins, or some other species could have been an opportunity for exposure to humans. Other possibilities for exposure could be a bat or another animal in somebody’s home or someone who was exposed to bats in nature or to another animal carrying the virus. It’s important to note that genomic data suggests that this pandemic has been driven by human-to-human transmission after the initial animal spillover, meaning that COVID-19 cases are acquired from other people, not from animal-to-human transmission.\n\nHow infectious is COVID-19, and how does it compare to other viruses, like SARS? We’re still investigating that. One thing we do know about this virus is that it uses the same receptor as SARS. There is a protein on the outside of your lung cells called ACE2 that both SARS and the COVID-19 viruses attach to in order to get into lung cells and infect them. This ACE2 protein in our airway is what makes it possible for the virus to infect our respiratory tract. And then when the virus is expelled in droplets by breathing or coughing, it can infect another person. We’re not yet sure why COVID-19 has spread further than SARS did in 2003. Epidemiologists use R , also called the reproductive number, which effectively measures the average number of people who will be infected from a single person with the virus. R is based on infections that have already been reported, and it can change depending on how well the virus is being treated in a particular area. For example, a recent paper came out this week in Science magazine that suggested that the original R in China was around 2.3, meaning that every person who gets infected is going to infect 2.3 people. Obviously, there is no such thing as 0.3 of a person, so that’s why we must understand these numbers as an average. This value was prior to any kind of travel restrictions or the social distancing measures put in place by China—once those policies were put in place, the R lowered to around 1, and weeks later, it dropped to less than 1. R is an average based on what we know, the cases that we can confirm, and it changes when behavior modifications occur or when human mobility is restricted, as we’ve seen in this case. It would also change if a vaccine or treatment became available. It’s really context-dependent, so you have to consider R as more of a report of what has happened than a prediction of future infections. In different populations and different countries, the way people interact and transmit infections and the demographic characteristics of the people (if they’re older or sicker) change the R . If there are a lot of older or sicker people in one country, that can change the number of cases and the number of people who would be more susceptible to having a severe disease. R is not a fixed number.\n\n“We need to practice social distancing until further notice so that we don’t overwhelm our health care infrastructure. If we have overwhelmed hospitals and not enough ventilators to treat people, more people will die.” One of the reasons we have to practice social distancing in the United States while South Korea doesn’t is because they were able to roll out testing much more rapidly and identify even mild cases and isolate those people as well as others who might have been exposed to them. The sooner we get our testing capacity up and running to test as many people as possible and identify those who should be isolated, the better—that will help us tremendously. But as of now, we need to practice social distancing until we have an accurate understanding of the prevalence of the virus in our communities so that we don’t overwhelm our health care infrastructure. If we have overwhelmed hospitals and not enough ventilators to treat people, more people will die.\n\nCan a person be reinfected with COVID-19 after initially contracting the virus? We don’t know for sure, but it seems unlikely. First of all, it is possible to get a false negative on the test because the test doesn’t detect the virus for a variety of reasons. A single negative test or the resolution of symptoms does not mean that a person is no longer infected. Also, data has suggested that patients who recover from COVID-19 have neutralizing antibodies that inactivate the virus before it can infect cells. This strongly suggests protective immunity that would defend against reinfection. Another study came out recently in which monkeys who had been experimentally infected with COVID-19 were allowed to recover and then challenged with another dose of the virus. None of them got sick or had productive infections. This suggests that their first infection produced those neutralizing antibodies and created protective immunity. The caveat here is that this study was with just four monkeys—a small sample size—and not human subjects. For these reasons, many of my colleagues have proposed that what people are calling “reinfection” is actually “recrudescence”—a return of symptoms in patients who never actually cleared the virus.\n\nIs COVID-19 mutating into different strains? The recent paper that suggested there were two different strains of COVID-19 in China, one more aggressive than the other, has been more or less debunked. The researchers identified these two groups of viruses as separate based on how similar their genomes were to each another, using an analysis called phylogenetic clustering. Then they looked back at the patients who’d gotten those particular strains and deduced that one group had more-severe disease than the other. However, they didn’t look at enough patients to see a significant strain difference, and genomic data suggests the virus is relatively stable and hasn’t diverged into separate strains. There are lots of other virus sequences that can change how these groupings occur as you feed more data into the model. The other thing to consider is that there are probably a lot of undocumented cases—cases that occurred but were not recorded by epidemiologists because they were not severe enough to be tested. If somebody doesn’t go to the hospital because they believe it’s just a mild cold, they’re not going to get picked up by the public health system as a confirmed case. If you’re not able to determine all of the cases of a virus in a community, it’s very difficult to make conclusions about a particular genetically similar group of viruses being the causative agent of a more severe disease. It’s entirely possible that the so-called severe strains were also infecting people who had very mild disease but never were recognized as COVID-19 cases.\n\n“If somebody doesn’t go to the hospital because they believe it’s just a mild cold, they’re not going to get picked up by the public health system as a confirmed case.” Mutation is something people tend to get confused about because there are so many movies that are like: “Oh my god, the virus has mutated.” It’s important to understand what this means. Mutation occurs because the enzymes that copy the genome of the virus to replicate it don’t have proofreading capabilities, so they sometimes make mistakes. Coronaviruses are RNA viruses, meaning their genetic material is RNA instead of DNA. Coronaviruses actually have some proofreading capabilities and make fewer mistakes than other RNA viruses such as influenza or Ebola. Coronaviruses have a lower mutation rate, but they do still mutate. When many of these mutations happen, they usually have no effect whatsoever on how that particular gene functions. If there are too many mistakes in the wrong places, the virus won’t be able to replicate. Occasionally, when there is a selection pressure to keep one of those mutations because it gives the virus some kind of advantage—perhaps it makes the virus resistant to an antibody or helps it infect other types of cells—those mutations may be selected for in certain populations. A good example of this is the influenza virus. Once drugs available to treat influenza, such as Tamiflu, started being used, we saw influenza viruses emerge that were resistant to them. The only influenza viruses that could survive the Tamiflu regimen were viruses that had randomly gotten a resistant mutation. Similar things could happen with this virus because it is an RNA virus, but we have no evidence right now that any particular mutations associated with increased severity or transmissibility are occurring.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Virologist Answers Our Most Pressing COVID-19 Questions | goop", "description": "There’s a lot of information and news out there about the novel coronavirus. Some of it is factual, some of it is not, and some hovers somewhere in between. We asked virologist Angela Rasmussen, PhD, our most pressing questions.", "url": "https://goop.com/wellness/health/your-coronavirus-questions-answered/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-03-26T12:57:02+00:00", "article:modified_time": "2020-03-30T21:47:11+00:00", "updated_time": "2020-03-30T21:47:11+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/03/covid-19-offset_916075.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/03/covid-19-offset_916075.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.mailman.columbia.edu/research/center-infection-and-immunity/angela-rasmussen-phd"], "authors": [], "publish_date": "2020-03-26T12:57:02+00:00"}