{"result_id": "139033", "URL": "https://goop.com/wellness/detox/a-heavy-metal-detox/", "timestamp": "2023-04-25 15:20:36 CEST+0200", "meta": {"description": "Learn some natural remedies for moving toxic metals out of your system, and find out some pretty compelling ideas about the havoc they can cause.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/detox/a-heavy-metal-detox/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Heavy Metal Detox Symptoms & Detoxification | Goop", "cleaned_text": "Editor’s note: We trust that you’ll quickly understand that this medical medium is operating well outside the bounds of medicine and science. But to avoid any confusion, our in-house PhDs want to remind readers that his claims cannot be substantiated by science.\n\nWhen we first wrote about Medical Medium Anthony William, and excerpted his now New York Times best-seller, Medical Medium: Secrets Behind Chronic and Mystery Illness and How to Finally Heal, we thought it might strike a chord—but we didn’t expect it to be the most-read story on goop for 2015, by a relative landslide. And emails from readers came pouring in, too, as people found many hints about their own ailing health in William’s explanation of how Epstein Barr Virus can migrate through our systems.\n\nWilliam, who documents his story in his book, gets his information from “Spirit”—not from medical textbooks or studies, and while that may seem well beyond the acceptable boundaries of what’s New Age, his insight makes a ton of sense. Below, he shares some natural remedies for moving toxic metals out of our system, and reveals some pretty compelling ideas about where they lurk and the havoc they can cause.\n\nDo you suffer from chronic health problems and have yet to find the answers you seek? If you feel that you have been searching for answers for far too long, you are not alone. You may already be doing everything you can think of to keep yourself healthy. You stick to your organic diet. You get as much exercise as you can tolerate. You meditate. You take your daily supplements. You take time for yourself. As far as you can tell, you’re doing everything right, and yet, your symptoms persist. Fatigue. Migraine headaches. Joint pain. Brain fog. Sluggishness. Inflammation. Constipation and other digestive disturbances. Susceptibility to infections. Nervousness and anxiety. Insomnia. Poor memory. Yeast and bacterial overgrowth. Skin eruptions. Attentional deficits. Mood dysregulation. Sadly, these types of symptoms are becoming more and more commonplace. If you suffer from any one of these on a regular basis, odds are you have been to countless health professionals, scoured the internet, and read everything you can get your hands on, awaiting relief that never comes, or lasts only a short while. You may even have been told that it’s “all in your head,” that it’s “hormonal,” or “it’s just stress.” Yet as your symptoms continue, you keep asking yourself “What have I missed? Why does my body still feel this way?”\n\nIn this modern era, we are bombarded by toxins of every kind imaginable. Our bodies are subjected to an onslaught of dangerous chemicals on a daily basis from things like air pollution, plastics, and industrial cleaning agents, not to mention the thousands of new chemicals introduced into our environment every year. Toxins also saturate our water reservoirs, fall down from the sky, and hide out in our homes and workplaces. This has become an unfortunate reality of modern life. However, if you are experiencing any of the above symptoms, there’s a good chance that a particular class of toxins are to blame. They are known as toxic heavy metals. Heavy metal toxicity—from metals such as mercury, aluminum, copper, cadmium, nickel, arsenic, and lead—represents one of the greatest threats to our health and well-being. While heavy metal toxicity is quite common, it is not commonly diagnosed. This is because heavy metal toxicity is an elusive adversary. It stays well-hidden within our bodies, never revealing itself unless you are actively looking for it.\n\n“Heavy metal toxicity—from metals such as mercury, aluminum, copper, cadmium, nickel, arsenic, and lead—represents one of the greatest threats to our health and well-being.”\n\nToxic heavy metals are virtually everywhere, and are present in things we come in contact with every day, such as aluminum cans and aluminum foil, batteries, metal cookware, old paint, and even the foods we eat. For instance, pesticides and herbicides (which are hard to completely avoid even on a strict organic diet), are a common source of heavy metals. As a result, most of us are carrying around heavy metals that have been with us for almost our whole lives and which have burrowed deep inside our tissues. Unfortunately, it is these “old” metals, the ones that have been lurking in our system for prolonged periods of time, that pose the greatest threat. For example, over time toxic heavy metals can oxidize, causing damage to surrounding tissue and promoting inflammation. They literally poison our bodies, and can inflict damage on virtually every system and organ, including our brain, liver, digestive system, and other parts of our nervous system. Toxic heavy metals put an immense burden on our immune system, leaving us vulnerable to a variety of illnesses.\n\nWhile toxins of every kind are harmful, heavy metals pose a unique threat. Not only are they damaging in their own right, they are also a form of neurotoxin (a poison that disrupts nerve function and confuses your immune system). Heavy metal neurotoxins can inflame and irritate our central nervous system (especially our brain), causing multiple symptoms such as memory loss, brain fog, fatigue, and depression. Toxic heavy metals can also promote inflammation in the digestive tract, releasing poisons into our gut as well. As if this isn’t bad enough, heavy metals also serve as a source of food for viruses, bacteria, parasites, and other pathogens in our body. For example, heavy metals can serve as a feeding ground for Streptococcus A or B, E. coli, C. difficile, H. pylori, and yeast cells. This can create an overgrowth of multiple bacteria in our gut, resulting in a condition known as SIBO (small intestinal bacterial overgrowth), which is characterized by bloating, abdominal pain, diarrhea, constipation (or both), and can lead to nutrient deficiencies. Additionally, when viruses such as Epstein-Barr and shingles feed off toxic heavy metals, this can produce symptoms such as tingling, numbness, fatigue, anxiety, heart palpitations, ringing in the ears, dizziness and vertigo, as well as neck pain, knee pain, foot pain, pain in the back of the head, and a variety of other aches and pains that are often attributed to other causes.\n\n“Over time toxic heavy metals can oxidize, causing damage to surrounding tissue and promoting inflammation.”\n\nWhen pathogens such as Epstein-Barr, shingles, and many others feed on heavy metals, they transform the metals into an especially aggressive form of neurotoxin. This secondary neurotoxin is the by-product and waste of these pathogens, and has the ability to travel throughout the body and wreak even greater havoc on the central nervous system. This phenomenon can throw medical communities off track, leading to incorrect diagnoses such as Lyme disease, lupus, rheumatoid arthritis, and many other autoimmune disorders, because blood tests start to lose their accuracy when the bloodstream becomes full of neurotoxic by-product and pathogen waste. These neurotoxins can even cross the blood-brain barrier, where they short circuit our neurotransmitters (the chemicals our brain cells use to communicate with each other). In turn, this can trigger depression and other mood disorders, memory loss, and a variety of other cognitive impairments.\n\nIt is therefore no surprise that heavy metals play a prominent role in our current epidemics of “mystery illnesses” and degenerative diseases such as Alzheimer’s and dementia. Despite all of this, heavy metal toxicity remains a relatively unexplored (and untreated) phenomenon—for everything we know about the dangers of heavy metals, there is a great deal more that has yet to be discovered. Heavy metals just may be the premier “hidden antagonizer” and mystery illness trigger in so many of us, contributing to all of the aforementioned symptoms—and more.\n\nWhile all toxic heavy metals wreak havoc on the body, mercury is an especially insidious beast, responsible for untold suffering throughout human history. Once touted as a cure-all for every disease imaginable, we now know the exact opposite is true. Mercury toxicity can be responsible for countless disorders and symptoms, including anxiety, ADHD, OCD, autism, bipolar disorder, neurological disorders, epilepsy, tingling, numbness, tics, twitches, spasms, hot flashes, heart palpitations, hair loss, brittle nails, weakness, memory loss, confusion, insomnia, loss of libido, fatigue, migraines, endocrine disorders, and depression. In fact, mercury poisoning is at the core of depression for a large percentage of people who suffer from it.\n\nHistorically, before its toxic effects were known (and acknowledged), mercury was believed to be a fountain of youth and a source of eternal wisdom. In ancient Chinese medicine, mercury was so revered that countless emperors died from mercury elixirs that healers vowed would end all their problems. Mercury elixirs (known as “quicksilver”) were also popular in the Western world. In the 1800s, medical students in the U.S. and England were taught to give a glass of mercury water to any patient who was ill, regardless of age, gender, or symptoms. Even after the medical community abandoned the practice of dispensing this misguided remedy, opportunities for mercury exposure were (and are) still plentiful: Industries were dumping mercury into rivers, lakes, and other waterways, and dentists were using mercury amalgam fillings (and some still are). In the 1800s and the first half of the 1900s, hat production relied on a mercury-based solution designed to expedite the felting process, putting hat-makers at extreme risk. In fact, the average hat-maker had about three to five years to live after starting work at a factory before madness and death set in. This is where the term “mad as a hatter” comes from: almost all mental illness of the time was from mercury poisoning (and the terrible irony is that for a long time the “treatment” for mental illness was—you guessed it—mercury!). And it wasn’t just hat-makers who suffered; anyone of that era who wore a felt hat got an infusion of mercury every time their brow sweated!\n\n“Mercury poisoning is at the core of depression for a large percentage of people who suffer from it.”\n\nAlthough the practice of using mercury as a life-giving elixir has long since been abandoned, we are currently still subject to its damaging effects. Due to the aforementioned practices, it is extremely likely that your great-great grandparents and other ancestors were exposed to high levels of mercury—and mercury literally gets passed down from one generation to the next! (Yes, this means that we have mercury in our systems because we inherited it from our quicksilver-drinking ancestors.) It is virtually guaranteed that most, if not all of us have some level of mercury inside our bodies. Some of us may even have mercury in our bodies that is over a thousand years old!\n\nAs a result of this mercury legacy, as a human race we are actually more intolerant to mercury than ever before. This is because, with each passing generation, the older mercury gets a little less concentrated, and a little more diluted. This might sound like a good thing, but this actually results in a “reverse strengthening” of the mercury: the more diluted the mercury becomes, the stronger it gets when it comes to being passed down generationally from parent to child (this is similar to the laws of homeopathy, in which successive dilutions of a compound result in increased potency). And in addition to this old mercury that we come into the world with, we collect new forms of mercury as we go along. Thus, for optimal health, we need to eliminate not only the mercury we’ve accumulated in our own lifetime, but the mercury we inherited from our ancestors as well. Otherwise, as a human race we will become increasingly sensitive and intolerant to mercury and other heavy metals inside us.\n\nAn important aspect of heavy metal toxicity is the fact that each of us has a unique signature blend, our own personal combination of heavy metals that creates an alloy. In the industrial sense, metals are blended to make them stronger and to give them broader applications. For example, a bicycle has various parts that are made from different alloys/blends of metal, to give it unique flexibility and strength; the same goes for rims on a car or even a pan for cooking. While this might be good news for the lifespan of your bicycle, it does nothing to enhance human life. For instance, one person’s signature blend of heavy metals might consist of high levels of mercury and lead, while the next person has large amounts of aluminum and nickel in her signature blend. Or perhaps two people both have extensive mercury and aluminum deposits, but have very different amounts of the two metals. Another variable contributing to a person’s individual alloy is the locations of the heavy metals in the body. For example, one person may have mercury deposits in her or his brain and central nervous system, while in the next person the metals have infiltrated her or his liver and intestines.\n\n“An important aspect of heavy metal toxicity is the fact that each of us has a unique signature blend, our own personal combination of heavy metals that creates an alloy.”\n\nRegardless, these highly individual alloys are part of why we see so much depression, anxiety, and other neurological symptoms that people are faced with every day. It is also one of the reasons why no two people with the same diagnosis have precisely the same symptoms. No one person diagnosed with depression, for example, has the exact same case of depression as the next person. The fact that everyone has a unique heavy metal signature blend is also part of why various treatments and methods can work for one person, but not for the next. Furthermore, there tends to be an interaction effect between one’s emotional history and her or his signature heavy metal blend. For example, if a person has undergone emotional trauma at some point and has high levels of heavy metal toxicity, she or he will tend to have a more difficult time processing the trauma she or he has experienced. Medical research and science is decades away from uncovering the signature heavy metals and alloys that create so many of our symptoms.\n\nAs indicated, heavy metals have the capacity to infiltrate the brain. While heavy metal deposits are damaging regardless of where they are in the body, the brain is especially vulnerable. Electrical nerve impulses are constantly passing through the neurons (nerve cells) in our brains; this is how our brain cells communicate with each other, and govern the bodily processes controlled by the brain. In healthy brains, this system runs smoothly and efficiently. If, however, the neurons are surrounded by brain tissue saturated with mercury or other heavy metals, this results in an electrical short circuiting. The metals draw on the electrical impulses, like draining a battery, much like when you leave your car’s headlights on all night. When the electrical activity of our brain is “drained” by heavy metals in this manner, it disrupts the continuity of our nerve impulses. If, for example, a person has a lot of mercury in the brain, the spike of electricity running through a neuron doesn’t reach its intended destination (the adjacent neuron)—it slams into a mercury deposit instead! This is when we start to see things like depression and cognitive impairment, including confusion, overstimulation, disorientation, etc. Another issue is the interaction between the minerals involved in the nerve impulses, such as sodium, potassium, and chloride, and the heavy metals. These minerals have the ability to oxidize heavy metals, literally causing them to corrode (this is akin to the heavy metals in your brain getting rusty!). This can spread to other areas of the brain, allowing more electrical impulses to come in contact with the heavy metal oxidation, leading to even more short-circuiting, and perpetuating a vicious cycle that contributes to anxiety, depression, memory loss, emotional upheaval (e.g., flying off the handle), migraines, mood swings (i.e., extreme highs and lows), being emotionally hypersensitive, having multiple chemical sensitivities, and so on. Additionally, our neurotransmitters (the chemical substances released by nerve cells) take a huge hit, depleting our supply of important neurochemicals such as serotonin or dopamine (contributing, again, to things like anxiety and depression).\n\n“If the neurons are surrounded by brain tissue saturated with mercury or other heavy metals, this results in an electrical short circuiting. The metals draw on the electrical impulses, like draining a battery, much like when you leave your car’s headlights on all night.”\n\nHeavy metals may already be on your radar. If so, perhaps you have tried chelation therapy (a procedure involving the administration of substances designed to remove heavy metals from the body; chelation means “to grab” or to “bind”), or you may have experimented with supplements or foods renowned for their ability to remove heavy metals. If the latter approach didn’t seem to work for you, it may be because you were using only one or two supplements or foods to try to remove the heavy metals. The truth is, most foods that can help get heavy metals out of your body need a helping hand, and work better as a team. This is why the best approach for heavy metal detox is to use not one but several different detoxifying foods together. The process is a lot like passing a football (the heavy metals are the football, metal-grabbing foods are the teammates, and the finish line represents elimination of waste). Even the fastest running backs can’t take the football to the finish line on their own—they need their teammates to block for them along the way. Because heavy metals have a long and intricate path to traverse before they get expelled from the body, a team of one simply won’t cut it. With a team effort, if the ball gets dropped along the way (i.e., the toxic heavy metals get dropped during the lengthy trip out of your body), the other team members are ready and waiting to pick it up and continue the journey toward the finish line. All the teammates have to work together, passing the ball to the next player, for the process to work.\n\nIn the modern world, the accumulation of heavy metals and other toxins, along with inherited mercury deposits, is inevitable—that’s the bad news. The good news is that it is relatively easy to get rid of the heavy metals that you may have already accumulated (both generational and recent), and there are steps you can take to minimize your future exposure. Adding the following all-star team of foods to your diet and being diligent in your efforts to consume them will go a long way toward ridding your body of heavy metals:\n• Spirulina (preferably from Hawaii): This edible blue-green algae draws out heavy metals from your brain, central nervous system, and liver, and soaks up heavy metals extracted by barley grass juice extract powder. Take 2 teaspoons mixed in water, coconut water, or juice.\n• Barley grass juice extract powder: This nutritive grass has the ability to draw heavy metals out of your spleen, intestinal tract, pancreas, thyroid, and reproductive system. Barley grass juice extract prepares the mercury for complete absorption by the spirulina. Drink 1-2 teaspoons mixed into coconut water or juice.\n• Cilantro: Goes deep into hard-to-reach places, extracting metals from yesteryear (so it’s great for that mercury inheritance you’re carrying around!). Blend one cup in a smoothie or juice, or add to salad or guacamole.\n• Wild blueberries (only from Maine): Draw heavy metals out of your brain tissue, healing and repairing any gaps created by oxidation when the heavy metals are removed. It is important to use wild blueberries, as they possess unique phytonutrients with special detoxifying capabilities. The potent antioxidants in wild blueberries help reverse any oxidative damage left behind by the heavy metal removal. This is especially important for your brain tissue—in fact, wild blueberries are the most powerful food for halting or in some cases reversing Alzheimer’s and dementia. Eat at least one cup daily. Note: while cultivated blueberries are nutritious, they lack the metal-drawing ability of the wild blueberries.\n• Atlantic dulse: In addition to mercury, this edible seaweed binds to lead, aluminum, copper, cadmium, and nickel. Unlike other seaweeds, Atlantic dulse is a powerful force for removing mercury on its own. Atlantic dulse goes into deep, hidden places of the digestive tract and gut, seeking out mercury, binding to it, and never releasing it until it leaves the body. Eat two tablespoons of flakes daily, or an equal amount of strips if it’s in whole-leaf form. Note: As it comes from the ocean, if you are concerned about the dulse itself having mercury, be aware that Atlantic sea dulse will not release any mercury it might possess into the body. It holds on to the mercury as it works its way through, and even grabs onto other metals along the way and drives them out as well. Atlantic dulse is a critical part of the team because it can hang out near the finish line (i.e., our colon), waiting for the other foods that have been grabbing on to heavy metals along the way. It serves as emergency backup, helping ensure that all the heavy metals that made it as far as the colon actually leave the body.\n\nThese five foods constitute your best offensive action against heavy metals, and as you can see, they each have their strengths, performing slightly different roles in the detoxification process. On its own, each individual player isn’t 100 percent effective, but as a team, they are your anti-heavy metal secret weapon! At some point in the removal process, metals get “dropped” or dispersed back into the organs, at which point another member of the team will swoop in, grab the metal, and continue the journey toward the finish line. You don’t need to eat all the foods in one sitting, but this is why it is important to consume these foods within 24 hours of each other for optimal effect. If you can’t fit them all in, try to eat at least two or three of the foods every day. While this is still helpful, this approach won’t be as effective in terms of results and symptom relief. In addition to helping draw metals out of the body, all of these powerful foods leave behind critical nutrients for repairing heavy metal damage and restoring the body. Another point in favor of this regimen is that it is effective regardless of your unique heavy metal signature—no matter the type, quantity, or location of the heavy metals, the five foods still help. This is truly the most effective way to rid your body of toxic heavy metals that could be causing so many of the symptoms and labels of conditions that you and your loved ones may be living with.\n\nIf the concept of heavy metal detoxification is already on your radar, or you have already tried similar detoxification methods, you may be wondering why chlorella (another popular algae often used for heavy metal detox) is not part of the team. Chlorella is a bit like a carpenter’s irresponsible apprentice, one who has good references, yet just isn’t reliable. If you are a carpenter, and you hire a carpenter’s apprentice to help you build some furniture, no matter how good the apprentice’s reputation, if she or he is clumsy and keeps dropping the hammer (i.e., mercury) at precisely the wrong moment, you aren’t going to keep the apprentice around for long. While chlorella is nutritious, it just doesn’t have the dexterity that is needed to get the job of heavy metal detox done. In this way, it is an irresponsible supplement—so it didn’t make the team.\n\nThe above recommendations are extremely effective for removing metals already in your system. However, we are constantly coming in contact with heavy metals and other toxins—the exposure is ongoing. While complete avoidance of toxins is impossible, there are many things you can do to minimize your risk and bolster your detox efforts.\n\nTips to Minimize Toxic Load and Supercharge Your \n\nHeavy Metal Detox Efforts\n\nEven if you eat the five heavy metal detoxifying foods religiously, if the rest of your diet is off-kilter, the process will be less effective. In the process of eliminating heavy metals, it is very beneficial to keep your blood fat ratio lower than usual. If you are trying to remove mercury and other heavy metals from your body, extra fats from the foods you eat can slow down or even halt the removal process, because the fat tends to soak up the metals you’re trying to get rid of. You don’t need to completely remove fat from your diet, just scale it back a bit. If you eat a vegan diet, reduce the amount of fat you take in from nuts, seeds, oil, avocadoes, and so on. If you are lacto-ovo-vegetarian, cut back on fish, eggs, dairy, nuts, seed oils, avocado, etc. If your diet is Paleo and/or includes animal protein, try to cut back to about one or two servings of meat per day (one serving is optimal, if you can swing it). With each of these dietary approaches, scaling back your usual fat intake by about twenty-five percent should be sufficient in most cases. This has nothing to do with whether or not dietary fat is good for you. This is a blood fat reduction technique that helps expedite the toxic heavy metal removal process. Decreasing your fat intake by about twenty-five percent reduces the amount of fat circulating in your bloodstream, helping prevent blood fats from taking up mercury and other metals that are on their way out. If you don’t make any changes to your diet during the metal detox, you will still receive benefits over time, but you will get better, quicker results by keeping your fat intake a bit lower than is typical for you.\n\nWhen performing a heavy metal detox, it is absolutely essential that you are sufficiently hydrated for the duration. Performing a detox without drinking enough water is like taking out the trash without trash service. Imagine if you gather up your household trash, put it all in a big garbage can, and put the garbage can out to the curb, but no one ever comes to take it away. Eventually this becomes a huge problem, because the trash doesn’t go anywhere—it just sits on the curb, becoming more toxic with each passing day. The same goes for detoxifying your body! Detoxification efforts help draw the “junk” out of your cells and tissues, but if you aren’t eliminating properly and frequently, eventually those toxins will just settle back in.\n\nA highly effective means of detoxifying the body is to drink two 16-ounce glasses of water on an empty stomach first thing in the morning, squeezing half of a freshly cut lemon into each glass. The lemon is critical here, because most water has lost its living factor by the time it makes it to your glass due to filtering and processing. Fresh lemon juice helps breathe life back into your “deadened” water, because the water that resides in the lemon is alive. The fresh lemon juice enhances the water’s ability to latch onto toxins in your body and help flush them out. This practice is especially effective for cleansing your liver, which works while you sleep to gather and purge toxins from your body. When you wake up, it is primed to be hydrated and flushed clean with activated water. After you drink the water, give your liver half an hour to clean up, then go ahead and eat breakfast. If you make this a regular part of your routine, your health can improve dramatically. For an extra boost, you can add one teaspoon each raw honey and freshly grated ginger to the lemon water. Your liver will draw in the honey to restore its glucose reserves, purging deep toxins at the same time to make room.\n\nConsuming fresh aloe vera leaf juice is another great addition to your heavy metal detox toolkit. Aloe is very adept at helping flush metals out of your body. For optimal results, cut off a four-inch section of a fresh aloe leaf (if it is large, as is typically the case for store-bought aloe. If you’re using a homegrown aloe plant, it will likely have smaller, skinnier leaves, so you will need to cut off more). Filet the leaf like a fish, trimming away the green skin and spikes. Scoop out the clear gel, taking care not to include any from the bitter base of the leaf. Blend it into a smoothie or eat as-is.\n\nYou can give your heavy metal detox an additional boost with infrared sauna sessions. Infrared saunas emit infrared light on your skin for the purpose of healing. The rays deeply penetrate the body, providing benefits such as increased blood flow and oxygenation of the blood, removal of toxins from the skin, elimination of aches and pains, and enhanced immunity. Infrared sauna sessions assist the body’s innate detoxification efforts, which expedites the heavy metal removal process. You can often find an infrared sauna at local gyms, massage therapy centers, and/or sauna centers. Recommended usage: 15- to 20-minute sessions twice per week. If you do it right, you should feel an immediate change for the better after each session. Be sure to drink plenty of water after your session to facilitate the removal of toxins from the body.\n\nIf you want to take things up a notch, consider the practice of one-day “fasts” in which you consume nothing but juices. Your juice should consist of celery, cucumbers, and apples. If you want, add in a bit of spinach or cilantro for variety; however, the core ingredients must remain celery, cucumbers, and apples. This combination has the proper balance of mineral salts, potassium, and natural sugar to keep your glucose levels stable as your body cleanses itself of toxic heavy metals. Make each juice 16- to 20-ounces, and drink one every two to three hours. Consume nothing in between except water—preferably a 16-ounce glass of it an hour after each juice. Your goal is to drink six juices and six glasses of water over the course of the day. When trying this for the first time, it is highly recommended to do it on a weekend when you can stay at home. If you’ve never detoxed before, the poisons it brings out of your body may make you feel uncomfortable. If so, lie down and rest. After you’ve gone through this detox a few times and feel comfortable with it, you can optionally expand it to a two-day juice fast. Plan on being home for at least the second day, though, in case your energy dips. For many people, however, energy actually increases.\n\nYou can experiment with the juice and add other ingredients—e.g., kale instead of spinach, or an occasional pinch of ginger for taste, or some extra cilantro, but don’t overdo it. The celery, cucumber, and apple all help flush toxic heavy metals out of you. If you put in too much of anything else, you take away space from these key ingredients. If you do this juice fast every two weeks, over time you should achieve impressive detox results and really feel the difference.\n\nAll of the above techniques are very effective at helping flush your system of heavy metals that are already on their way out thanks to your heavy metal detox team players.\n\nModern life has its upsides and downsides—and you no doubt see proof of this every day. While today’s technology means that, for example, we’re plugged in and reachable 24/7, it also means that, well, we’re plugged in and reachable 24/7. We have incredible resources today that our ancestors couldn’t even have imagined—societal advancements have made our lives easier in so many ways—and yet we’re suffering. Never before in our history have we been exposed to so many poisonous substances. On top of which, we are still bearing the brunt of our ancestors’ heavy metal toxicity.\n\nWhile avoiding the daily onslaught of heavy metals and other toxins is tough, protecting your body from these threats is not. You can take a stand against your personal blend of toxic heavy metals! The truth is, your body wants to heal, and it is working for you every day. All you need to do is give it the tools and resources it needs to begin the healing process. Start by assembling your all-star team of heavy metal detoxifiers, and incorporating a few of the lifestyle practices. By taking advantage of these simple tips, you can assume an active and powerful role in reclaiming the vibrant health that you deserve—and are meant to have.\n\nStacy had always suffered from depression, starting when she was a little girl, around age 10. Even at that time, she always felt that no one understood her depression, and felt very alone in her plight. Whenever she tried to express her feelings to her family, her complaints were dismissed. Her family would simply remind her of how “good” she had it, and pointed out all the positive things she had in her life. As a result, she felt as though she was not allowed to talk about her depression, so she learned to hold it all inside. She would do her best to put on a happy face, trying to appear as cheerful as possible in all her school photos and family portraits. In reality, though, she was in agony. She felt lost, hopeless, and disconnected from everything and everyone around her. Though she had friends, she always felt that she could not relate to them, as they always appeared happy and upbeat, while she struggled to suppress the sadness and loneliness that permeated her life.\n\nHer struggle went on for decades. During that time, she visited dozens of therapists, psychologists, and psychiatrists. She tried various medications, including anti-depressants and anti-psychotics, but none of these things really helped; in fact, in some ways they seemed to just make things worse. Stacy continued to put on her happy face through her 30s, even doing her best to hide her depression from her husband, until she felt safe and secure enough in the belief that, if she revealed her depression to him, he would not leave her. After the birth of her first child, however, things got even worse. She was diagnosed with post-partum depression. But this diagnosis never sat right with her, because she had always felt this way, had been experiencing depression at different levels of severity her entire life. She would tell her doctors, “I must have always had post-partum depression.” Now that she had a husband and child, her desire to feel whole, to feel alive and awake and capable of caring for her baby, was stronger than ever before. She sought out various holistic health professionals, with some success, but her depression continued to ebb and flow. At one point, one of her doctors told her that she had toxic heavy metal poisoning. So, she underwent a series of blood tests, as well as hair mineral analysis. These tests revealed that she had traces of mercury in her body, most of which were concentrated in her brain. Her doctor recommended homeopathic treatments to remove the heavy metals, along with a regimen of herbs and vitamins. Eventually she even underwent intravenous chelation therapy to rid her body of the metals.\n\nStacy experienced slight improvement with these treatments, more so than any other natural remedy she had tried previously. Over a period of about six months, she felt subtle differences in her mood, but after this period, things seemed to have reached an impasse, so she started to lose faith again. There just wasn’t enough of a difference to give her the motivation she needed to sustain her efforts. Not long after, a friend of hers who was already a client of mine recommended that she speak with me. Within moments of speaking to Stacy, it became clear that Stacy still had toxic levels of heavy metals in her body. Specifically, she had high levels of mercury as well as some aluminum. Together, the mercury and aluminum were causing an alloy reaction, which was part of why her symptoms were so bad and had persisted for so long. As her doctor had already told her that she had toxic levels of heavy metals, she was confident we were on the right track. I advised Stacy to start a daily regimen of the five foods (the cilantro, Hawaiian spirulina, wild blueberries, barley grass juice extract, and Atlantic dulse). Over a period of three months, Stacy started to feel a significant reduction in her depression. She said it was as though a huge weight had been lifted from her shoulders, and a dark veil had been lifted from her eyes. These feelings ignited her motivation to stick with the protocol. After two years of taking the foods on a regular basis, she claimed that she felt the way she did before age ten, before the depression had really set in. Her feelings of sadness and dread were gone, and Stacy felt like she had a fresh start in life. She was even able to rekindle past relationships with family and friends that had been adversely affected by her years of depression. For Stacy, this was a true rebirth. She moved ahead, and never looked back.\n\nFor over twenty-five years, Anthony William has devoted his life to helping people overcome and prevent illness—and discover the lives they were meant to live. What he does is several decades ahead of scientific discovery. His compassionate approach has time and again given relief and results to those who seek him out. He is the host of the weekly radio show “Medical Medium” and the #1 New York Times bestselling author of Medical Medium Thyroid Healing: The Truth behind Hashimoto’s, Graves’, Insomnia, Hypothyroidism, Thyroid Nodules & Epstein Barr; Medical Medium Life-Changing Foods: Save Yourself and the Ones You Love with the Hidden Healing Powers of Fruits & Vegetables; and Medical Medium: Secrets Behind Chronic and Mystery Illness and How to Finally Heal.\n\nThe views expressed in this article intend to highlight alternative studies and induce conversation. They are the views of the author and do not necessarily represent the views of goop, and are for informational purposes only, even if and to the extent that this article features the advice of physicians and medical practitioners. This article is not, nor is it intended to be, a substitute for professional medical advice, diagnosis, or treatment, and should never be relied upon for specific medical advice.", "opengraph": {"locale": "en_US", "type": "article", "title": "Heavy Metal Detox Symptoms & Detoxification | Goop", "description": "Learn some natural remedies for moving toxic metals out of your system, and find out some pretty compelling ideas about the havoc they can cause.", "url": "https://goop.com/wellness/detox/a-heavy-metal-detox/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "medical mysteries", "article:section": "Detoxes & Cleanses", "article:published_time": "2016-01-21T18:57:00+00:00", "article:modified_time": "2022-11-02T18:42:32+00:00", "updated_time": "2022-11-02T18:42:32+00:00", "image": "https://goop-img.com/wp-content/uploads/2016/01/Heavy-metal-detox-Stocksy_txp60a03900phm000_Medium_83760.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2016/01/Heavy-metal-detox-Stocksy_txp60a03900phm000_Medium_83760.jpg", "image:width": "820", "image:height": "625"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/the-medical-medium-and-whats-potentially-at-the-root-of-medical-mysteries/", "http://www.amazon.com/Medical-Medium-Secrets-Chronic-Mystery/dp/1401948294", "http://www.medicalmedium.com/", "https://goop.com/the-power-of-infrared-saunas/", "http://www.medicalmedium.com/", "http://www.hayhouseradio.com/#!/host/anthony-william", "http://a.co/2NkjI3E", "http://amzn.to/2eyn5XC", "http://amzn.to/2ecmQFV"], "authors": [], "publish_date": "2016-01-21T18:57:00+00:00"}