{"result_id": "139022", "URL": "https://goop.com/wellness/health/covid-questions-answered-vaccines-variants-more/", "timestamp": "2023-04-25 15:20:20 CEST+0200", "meta": {"description": "A full two years into the pandemic, there are still plenty of unknowns and disagreements over how we move forward. We asked clinician and researcher Otto Yang, MD, how to understand the virus and its variants going forward, what might come next with vaccines, and if there are any new insights about the possible long-term effects of COVID infection.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/covid-questions-answered-vaccines-variants-more/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Answering Your Latest COVID Questions on Vaccines, Variants, and more", "cleaned_text": "A full two years into the pandemic—and a few hundred visits to the New York Times COVID map later—we have a lot more knowledge than we did at the start about the virus we’re up against, how best to protect ourselves from it, and how to treat the infection it causes. Still, there are plenty of unknowns and plenty of disagreements over how we move forward. In late 2020, physician-scientist Otto Yang, MD, joined GP for a podcast conversation to answer our questions about the virus as we knew it then. (At the time, GP was enrolled in a clinical trial run by Yang and sponsored by the NIH.) He’s back to give us the latest updates as we face Omicron and to level with us about what might be coming our way next. Listening to Yang talk is refreshing: His answers are clear and honest, and he helps us understand on a deeper level the virus, variants, vaccines, and complicated issues like long COVID.\n\nHow should we think about Omicron’s severity, considering it’s much more transmissible but less likely to kill a person than previous variants? A lot of people are jumping on this bandwagon that Omicron is milder and therefore it’s a good thing. But that’s not what we’re seeing in the hospitals. The effect of Omicron being milder but more contagious is complex, and it’s all about context. One thing to point out is that current research estimates that Omicron may be about as lethal as the original strain of the virus, even though most of us think about it as milder. It’s just that the subsequent strains, particularly Delta, have been deadlier. So we’ve become a little blasé about how lethal it is, thinking that Omicron is something relatively harmless, like a flu or cold. Here’s the math: If Omicron is two or three times as contagious and half as deadly as Delta, it’s not an advantage overall. Because that means that just as many people may die overall, even if the risk is smaller for an individual. One of the big challenges of this pandemic has been personal interest versus society-level interest. That’s what’s been a problem with Omicron. On a personal level, perhaps it is good news, right? If you’re vaccinated and Omicron is somewhat milder, your personal level of risk really does go down. If I’m vaccinated and in good health and I don’t have any immune problems, I can feel confident that if I get infected, I’m probably not going to get very sick. Omicron has mutated from the original virus—the one the vaccines are targeted against—enough that the vaccines probably won’t prevent me from getting infected. The vaccines are targeted against the original strain, not against Omicron. And while they are still preventing people from getting very sick, they’re no longer preventing people from getting infected. It’s a little socially complex, right? For those in a good position in terms of health and vaccination, on a personal level, it is lower risk. But for those who aren’t in that position, it’s much worse. There are many people in our society who either won’t get vaccinated or can’t get vaccinated—or are vaccinated but their immune systems don’t respond to the vaccine, like lung transplant patients whose medications keep the vaccines from working. Those people are paying the price—a heavy price, as we are seeing in our hospitals. Then, of course, the indirect impact is that the hospitals are once again overfilled with people who are sick with Omicron. And that affects healthy people, too. Because if you get in a car accident or develop cancer suddenly and you urgently need hospital treatment, hospitals are not going to be as able to provide care. And god forbid you need an ICU bed—the ICUs are just packed.\n\nWith Omicron so contagious, what does it mean functionally for everyday life? How should we adjust our everyday behaviors for this version of the virus? The really big change—and the reason Omicron is so much more contagious—is probably that there is more infectious virus being expelled when people breathe or talk. That change has made this virus into what doctors classically call an airborne infection. “The fact that Omicron now produces so much more virus in people’s respiratory tracts means that now even the very small droplets that can float around in the air probably have enough virus to cause infection.” In the beginning, the original strain was mostly considered a droplet infection, meaning that only the larger respiratory droplets that don’t float in the air had enough of the virus to pass it on, so you had to be close to somebody to get infected. The smaller particles that float through the air probably didn’t have enough virus to be contagious in most circumstances. The fact that Omicron now produces so much more virus in people’s respiratory tracts means that now even the very small droplets that can float around in the air probably have enough virus to cause infection. What that means is you should avoid being in closed spaces where there’s not good air circulation. Being indoors with crowds is very risky. If you have to be indoors—to go get your groceries or whatever—an N95 (or similar) mask is probably the best one to wear right now. A cloth or surgical mask does not have pores small enough to filter out the tiny aerosol droplets. N95 masks are designed exactly for that purpose: to filter out the really tiny droplets that can float around in the room for minutes or even hours. Being outdoors is still not that big of a risk, especially if you stay separated enough that the bigger droplets can’t get to you—that’s six feet or so. Just the fact that you’re outdoors means those little droplets can diffuse away very fast, so the risk is much, much lower than being inside. It’s probably okay to be doing outdoor events.\n\nIs this virus acting how we might expect it to, knowing what we know about other viruses that have caused epidemics and pandemics? It’s a mixture of expected and unexpected things. What’s consistent with other viruses is how the virus jumped into humans and what makes it able to cause a pandemic. The first thing to know is that viruses don’t have all the parts that they need to make copies of themselves, so they have to use host cells in order to replicate. It’s like they turn that host cell into a virus factory. To do that, they have to be able to interact with the proteins in that host cell. And the host proteins they use to make their various virus parts vary from species to species. Generally, when a new virus enters into humans, it comes from an animal. (Viruses don’t just appear out of nowhere.) But it’s not easy for a virus to jump into humans from an animal. First, the virus has to get into the cell, which usually involves binding to a receptor. In this case, it’s the ACE-2 receptor. Receptors will vary from species to species, so the most common thing that happens if a person is exposed to a virus from another species is nothing—because the virus can’t use human receptors or can’t use their cell proteins to replicate itself. It’s adapted to work best in the cells of its original host. Occasionally, a virus will be able to use human proteins and get into human cells. “This novel coronavirus hits this sweet spot where it’s deadly, but it’s not so deadly that it can be easily stamped out.” That’s what happened in the biggest pandemic in recent history before this one: HIV. HIV originally came from chimpanzees, and chimpanzees are very similar to humans genetically, so the virus was able to jump species because human cells were similar enough to the chimpanzee ones. Unfortunately for us, the virus was adapted for chimpanzees, where it’s a mild infection with few or no health consequences. In humans, it was new, and it became a deadly infection. It was able to interact with human proteins and grow in human cells. Another virus that has jumped into humans is Ebola. The Ebola virus is adapted to its host animal—bats—and it’s not a harmful infection in those animals. In humans, it is very harmful. But Ebola has not become a pandemic because the virus is too aggressive. People die too quickly. By the time they’re contagious, they have serious symptoms. So it’s been relatively easy to stamp out Ebola breakouts. This novel coronavirus hits this sweet spot where it’s deadly, but it’s not so deadly that it can be easily stamped out. It happened to be able to deal with human proteins, grow in human cells, and spread from person to person before it kills them. In that way, this virus is what you would expect: It’s deadlier than in its original host. What’s been unpredictable are the twists and turns of how these different variants come up. And the other unusual part is that with this virus, people are contagious before they have any symptoms. For respiratory viruses, that’s pretty much unheard of. This is the first virus we’ve seen that has that property.\n\nWhy are the current vaccines less effective against these variants? The vaccine does two things (I’ll oversimplify it a little bit): It makes antibodies, and it makes T cells. The antibodies are like the front gate. They slow down or reduce the amount of virus that gets into the body. If you’re lucky, the antibodies will slow the virus down to the point that the virus doesn’t get established in your body. But once the virus gets past the antibodies, they don’t help anymore. Then, it’s all T cells. T cells, particularly so-called killer T cells, are what keep you healthy or keep you from dying if you do get a viral infection. Antibodies are very, very specific to one spot on the spike proteins for the virus they protect against. And that’s because antibodies work by blocking the interaction of the virus with the ACE-2 receptor. So the virus has to bind ACE-2 to get into a cell, and antibodies bind the virus to block that from happening. The mutations defining these new variants are changes that affect how the virus interacts with ACE-2. They are exactly in that area the antibodies would need to bind to stop the virus. And because the antibodies produced by the vaccines are directed specifically to the original-version virus, not the variants, the antibodies don’t fit as well to the variants as they did to the original virus and don’t work as well as a result. That’s why there are so many breakthrough infections with Delta and now Omicron. On the other hand, T cells don’t need to work on just a small area the way antibodies do. They can work by recognizing any part of the spike protein. That’s why the T cell protection you get from the vaccine has really not been affected by these variants: Omicron is still 97 percent unchanged from the original strain, so the T cells still work. That’s why we’re seeing vaccinated people getting breakthrough infections but not often suffering very severe illness—because the T cells, the second part of that equation, are still working fine.", "opengraph": {"locale": "en_US", "type": "article", "title": "Answering Your Latest COVID Questions on Vaccines, Variants, and more | goop", "description": "A full two years into the pandemic, there are still plenty of unknowns and disagreements over how we move forward. We asked clinician and researcher Otto Yang, MD, how to understand the virus and its variants going forward, what might come next with vaccines, and if there are any new insights about the possible long-term effects of COVID infection.", "url": "https://goop.com/wellness/health/covid-questions-answered-vaccines-variants-more/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2022-01-27T12:48:16+00:00", "article:modified_time": "2022-07-26T18:14:31+00:00", "updated_time": "2022-07-26T18:14:31+00:00", "image": "https://goop-img.com/wp-content/uploads/2022/01/Covid-QA_iStock-1312600071.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2022/01/Covid-QA_iStock-1312600071.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/the-goop-podcast/gwyneth-paltrow-x-otto-yang-covid-19-antibodies-vaccines-and-cutting-edge-research/", "https://www.uclahealth.org/Infectious-Diseases/shandling-biomedical-future-fund", "https://goop.com/the-goop-podcast/gwyneth-paltrow-x-otto-yang-covid-19-antibodies-vaccines-and-cutting-edge-research/", "https://www.uclahealth.org/Infectious-Diseases/shandling-biomedical-future-fund", "https://www.uclahealth.org/Infectious-Diseases/shandling-biomedical-future-fund"], "authors": [], "publish_date": "2022-01-27T12:48:16+00:00"}