{"result_id": "139015", "URL": "https://goop.com/wellness/health/how-to-do-lymphatic-massage/", "timestamp": "2023-04-25 15:20:08 CEST+0200", "meta": {"description": "With lymphatic drainage massage, we're moving lymph fluid through the vessels to mimic muscle contractions and speed up lymph circulation.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/how-to-do-lymphatic-massage/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "How To Do A Lymphatic Drainage Massage", "cleaned_text": "How to Do (or Get) a Lymphatic Massage\n\nLisa Levitt Gainsley’s mother passed away from cancer when she was thirteen. Later, in massage school, Gainsley (above) had an aha moment: “I loved the way a lymphatic treatment felt,” she says. “I had never experienced anything like it before. The rhythm and cadence of the strokes felt like the undulating ocean. Once I understood the connection between the lymphatic system and the immune system and that manual lymph drainage can benefit cancer patients, I knew I had found my life’s work.”\n\nLymph vessels collect fluid that has leaked out of blood vessels and cells. When the delicate lymph vessels are damaged, fluid can build up—for example in the arms after treatment for breast cancer—causing swelling called lymphedema. There’s no pump for lymph fluid as there is for blood. The lymphatics rely on muscle contractions to push fluid unidirectionally toward the neck area, where it empties into the subclavian vein. It’s not easy to manage lymphedema, but lymphatic massage is an important part of therapies to reduce swelling.\n\nThe lymphatic system does a lot more than provide drainage: It’s crucial for immunity. The fluid—containing waste products and bacteria—passes through lymph nodes where white blood cells inactivate infectious microorganisms and filter out waste. And scientists are beginning to discover roles that the lymph system plays in a variety of health concerns.\n\nGainsley takes us through the why and how of lymphatic self-massage, which, regardless of other potential benefits, feels wonderful and leaves you relaxed and tingly.\n\nCan you give us some tips for self-massage? Understanding the lymphatic map of the body will help you to know which direction to massage. Lymphatic massage strokes are gentle, light, slow, rhythmic, and nurturing. Respecting the cadence of lymph flow can also have a calming effect on your nervous system. If somebody comes to me and they have swelling, the first thing I’m going to do is massage the lymph nodes that drain that fluid. For instance, if you have inflammation in your hand, I first massage the lymph nodes in the neck and the armpit. If lymph nodes have been removed in cancer treatment, then we also massage several other sets of lymph nodes in order to reroute fluid to other functioning lymph nodes in the body. I usually tell people to massage the lymph nodes in the neck no matter what they’re doing, because lymph fluid empties into the bloodstream—into the subclavian veins—at the base of the neck. The way I help people understand this concept is: Let’s say you have a dirty ring around your bathtub and you want to clean it. What’s the first thing you’re going to do? Most people say: Put soap on it and start scrubbing the ring. But if you do that and you haven’t cleaned the hair out of the drain first, when you start scrubbing and put the water in the tub, you’ll get a backlog of dirty water at the drain. So when I’m teaching somebody lymphatic massage, I teach them to massage their lymph nodes first at the neck, the armpit, and the top of the thigh and abdomen. Let’s say someone comes in and they want their legs to look better. You massage the lymph nodes in the neck and the top of the thigh and do deep belly breathing to move fluid up the abdomen through the thoracic duct, the largest lymph vessel in the body. The thoracic duct takes the fluid from the lower half of your body and puts it back into the bloodstream via the subclavian vein at the neck. Deep belly breathing contracts that thoracic duct to help move your lymph fluid.\n\nHow do you work on the arm and chest? Before draining a sore or swollen arm, we’re going to work the lymph nodes in your neck and armpit. Start with the neck: Find your right and left lymph ducts at the base of your neck. You’ll feel hollow, soft spots above your collarbone. Using the pads of your fingers, gently stroke straight downward ten times on both sides. Strokes are not a circle. You might see some people on YouTube telling you to massage in a circle. If you do that, you’re putting the fluid back where it began. We want to move the fluid one way toward our lymph nodes. Then place your hands behind your ears and massage lightly straight down your neck. The fluid from your head drains from the ears to the base of your neck at the right and left lymphatic ducts above the collarbone. Drain the fluid from the neck with little strokes from the base of the ear down to the base of your neck. You’re just stretching the skin down until it can’t stretch anymore. And then you let go. Then swallow two times. Clear the head: Next, separate your fingers in a V like Spock’s “Live long and prosper.” If any of you are Star Trek fans, you know what I mean. Place your middle fingers behind your ears and the other fingers in front of your ears. Massage gently over and back behind your ears and then down your neck. Your goal is to bring the fluid down your neck. Do this ten times. Then do light brushstrokes from your ear all the way down your neck. Then gently brush your face from your cheek to your ears, chin to your ears, mustache to your ears, and forehead to your ears. Brush all the way down your neck again and swallow three times. Release the shoulders: Now we’re going to drain the lymph fluid from the back of your neck and the trapezius. I call this the lymphatic shirt-collar zone. It’s the area at the back of your neck where your shirt collar sits. That fluid wraps around and drains into the right and left lymphatic ducts at your collarbone. To work this area, place your hands on top of your shoulders with elbows straight in front of you. Take an inhale, then exhale and drop your elbows. Repeat this five times. People tell me that moving the fluid here helps their muscles relax. Pump the armpits: Now let’s massage the axillary nodes under the armpits. The fluid from your arms and your breasts drains into these lymph nodes, so it’s important to massage them. First, place your palm directly into your armpit and pump your hand upward into your armpit. Do this ten times. Next, place your hand a little lower on your torso—this is where your side breast tissue is located. With the palm of your hand, pump from your side torso directly up into your armpit ten times. Next, raise your arm, place your hand where the arm and armpit meet, and stroke downward directly into your armpit. You don’t want to squeeze your arm; you want to pump the fluid gently. Massage the chest: Now let’s massage the chest. So many people don’t touch their breasts unless they are looking for a breast lump. A majority of breast fluid is going to drain into the armpits. Remember: You want to work lightly, gently, using a nurturing touch. Place your hand in the middle of your chest and with the palm of your hand, slowly massage over your breast moving toward your armpit. Repeat ten times. Then massage underneath your breast where your bra line is located, moving the fluid to your side torso then into your armpit ten times. We typically do not use oil because what we want to do is stretch the skin and move the lymph along its channel. If we have oil, we’re just slipping on the skin. Make sure you aren’t moving fluid into your nipples. You want to move fluid from the breast away from your nipples into the armpit. I’m on a campaign to get everyone to touch their armpits and breasts! If someone has had lymph nodes removed, we can reroute the fluid from the armpit where lymph nodes were removed down to the inguinal nodes at the top of the thigh and across the chest to the lymph nodes in the opposite armpit. Even if you’ve had two lymph nodes removed, you are at risk for developing lymphedema. Typically, there are between seventeen and thirty-five axillary lymph nodes in each armpit. Massage the arms: To massage your arm, place your hand like a cap over your shoulder. Massage half circles up and over your shoulder ten times. Next, massage from your forearm up toward the armpit. Now work the elbow crease. Using your palm, pump directly into your elbow crease. You have lymph nodes here. Once you’ve cleared the upper arm, you can massage from your lower arm and your fingers up toward your armpit in slow, continuous strokes encouraging the fluid into the armpit. To finish, massage the lymph nodes in your armpits again.", "opengraph": {"locale": "en_US", "type": "article", "title": "How To Do A Lymphatic Drainage Massage | goop", "description": "With lymphatic drainage massage, we're moving lymph fluid through the vessels to mimic muscle contractions and speed up lymph circulation.", "url": "https://goop.com/wellness/health/how-to-do-lymphatic-massage/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-10-18T11:55:10+00:00", "article:modified_time": "2022-08-30T15:47:04+00:00", "updated_time": "2022-08-30T15:47:04+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/10/LisaG.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/10/LisaG.jpg", "image:width": "1400", "image:height": "1067"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/goop-authors/gerda-endemann-phd", "https://pubmed.ncbi.nlm.nih.gov/22920313/", "https://pubmed.ncbi.nlm.nih.gov/22064427/", "https://www.cell.com/cell/pdf/S0092-8674(20)30816-3.pdf", "https://www.thelymphaticmessage.com/videos", "https://www.instagram.com/thelymphaticmessage/", "https://lymphaticnetwork.org/centers-of-excellence", "https://lymphnet.org/", "https://www.clt-lana.org/search/therapists/", "https://www.thelymphaticmessage.com/"], "authors": [], "publish_date": "2020-10-18T11:55:10+00:00"}