{"result_id": "139007", "URL": "https://goop.com/wellness/health/understanding-diabetes/", "timestamp": "2023-04-25 15:19:55 CEST+0200", "meta": {"description": "In people with diabetes, high levels of sugar in the blood damage blood vessels and nerves, frequently without obvious symptoms. This can cause heart attacks, kidney failure, and other health issues if not treated properly. In type 2 diabetes, insulin is no longer effective at lowering blood sugar, referred to as insulin resistance. Type 1 diabetes is considered an autoimmune disease because the immune system destroys insulin-producing cells. We do know that diabetes is one of the diseases most responsive to lifestyle changes, so we’ve summarized recent research about diets, foods, supplements, and exercises, to aid in making worthwhile lifestyle upgrades. We’ve also gathered some of the most interesting research on innovative ways to prevent and treat diabetes.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/understanding-diabetes/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Diabetes", "cleaned_text": "Our science and research team launched goop PhD to compile the most significant studies and information on an array of health topics, conditions, and diseases. If there is something you’d like them to cover, please email us at [email protected] .\n\nOur science and research team launched goop PhD to compile the most significant studies and information on an array of health topics, conditions, and diseases. If there is something you’d like them to cover, please email us at [email protected]. In diabetes, high levels of sugar in the blood damage blood vessels and nerves, frequently without obvious symptoms. This can cause heart attacks, kidney failure, and other health issues if not treated properly. In type 2 diabetes, insulin is no longer effective at lowering blood sugar, referred to as insulin resistance. Type 1 diabetes is considered an autoimmune disease because the immune system destroys insulin-producing cells. Diabetes is diagnosed when blood sugar is consistently high. Blood sugar refers to glucose, a small type of sugar molecule that is found in sugar and starch. Blood glucose increases after meals containing these carbohydrates, and blood glucose can also be high first thing in the morning due to production of glucose by the liver. Although medical treatment is essential for both types of diabetes, they are also hugely impacted by lifestyle choices. How Many People Are Affected by Diabetes? According to the Centers for Disease Control and Prevention (CDC), more than 30 million people in the US—over 9 percent of the population—have diabetes, and of those, 7 million have not been diagnosed. Globally, over 400 million people have diabetes. Northeastern Europe has the lowest prevalence at 6 percent of the population, and Polynesia and Macronesia having the highest at 25 percent of the population. Type 2 diabetes makes up around 90 to 95 percent of cases. Increases in obesity, inactivity, and sugar consumption are thought to have contributed to an increased prevalence of type 2 diabetes since the 1980s. There is finally good news: After a peak in 2009, the number of new cases diagnosed annually in the US has dropped, and the number of people living with diabetes is no longer increasing (Centers for Disease Control and Prevention [CDC], 2019; CDC, 2019a; Gregg & Bracco, 2019). There are symptoms that provide clues when someone has very high blood sugar levels, as is the case with type 1 diabetes. When glucose is high, it spills over into the urine. Infants and children who develop type 1 diabetes urinate frequently, maybe wetting the bed. They’re very thirsty, hungry, and tired, and they lose weight. Symptoms can get much worse if blood sugar levels reach over 600 milligrams per deciliter (mg/dl), causing life-threatening fever, vision loss, and hallucinations. Alternatively, another dangerous development could be diabetic ketoacidosis—if you have loss of appetite, nausea, vomiting, confusion, or breath that smells fruity, get medical care immediately (CDC, 2019c; Mayo Clinic, 2018c, 2018b). Less extreme but still high blood sugar—known as hyperglycemia— can remain undiagnosed for years, and during this time it can cause extensive damage to blood vessels and nerves. Symptoms of both types 1 and 2 diabetes may include numbness, pain, and tingling in hands and feet, tiredness, weight loss, frequent urination, slowly healing sores, frequent infections, and blurry vision. Damage can progress to blindness, kidney failure, amputation of legs, or heart attacks.\n\nPotential Causes of Diabetes and Related Health Concerns How should your body be keeping blood glucose in the proper range, and what’s going wrong in diabetes? Properly functioning beta cells of the pancreas make insulin in response to high blood sugar. The insulin then directs fat and muscle cells to remove glucose from the blood. In type 1 diabetes there is not enough insulin, and in type 2 diabetes, muscle and fat cells are resistant to insulin’s actions. Many gene variants are associated with the probability of developing type 1 or type 2 diabetes. However, each gene accounts for only a small fraction of the total probability. Adding up the risk factors from all of the genes can be used to calculate a “polygenic” score, but this is not yet ready for clinical use (Udler, McCarthy, Florez, & Mahajan, 2019). Exposure to endocrine-disrupting chemicals has been linked with the prevalence of diabetes in some but not all studies. A pesticide has been associated with human diabetes, and brominated flame retardants have been implicated in diabetes in animal research (Kozlova et al., 2020; Lind and Lind, 2018). In type 1 diabetes, the pancreas stops making insulin. For some reason, the immune system attacks and kills the pancreatic cells that are making insulin, hence the classification of type 1 diabetes as an autoimmune disease. Contrary to common perception, type 1 diabetes can develop in adults as well as in children, and an endocrinologist can help avoid misdiagnosis as type 2 (Mayo Clinic, 2017). In type 2 diabetes, the pancreas still makes insulin, but muscle and fat cells do not respond normally by removing glucose from the blood. This is called insulin resistance. It isn’t clear what causes insulin resistance, but being overweight, being inactive, and having a family history increase the likelihood of developing it. For a while the pancreas can make extra insulin and overcome the resistance, but if preventive lifestyle actions are not taken, the disease can progress to the point where medications are required to prevent seriously high blood sugar. Type 2 is more common in adults but can start in childhood (CDC, 2019d, 2019d). After years of uncontrolled high blood sugar, serious complications develop from damaged blood vessels and nerves. Damage to blood vessels leads to high blood pressure, stroke, and heart attacks. Damage to blood vessels in the eye increases the chance of developing glaucoma, cataracts, retinopathy, and blindness. Damage to small vessels in the kidneys can lead to kidney disease. The feet suffer from poor circulation caused by diseased blood vessels, and from damaged nerves (neuropathy), which can cause pain or numbness. These conditions can result in foot ulcers, infections, and amputation. Neuropathy of the nerve that normally tells the stomach to empty can lead to serious discomfort and blockages (gastroparesis). Preventing high blood sugar is key to avoiding all of these complications (Mayo Clinic, 2018c). Illnesses, trauma, and some drugs can trigger diabetic ketoacidosis, a potentially fatal condition in which excessive levels of ketone bodies cause fluid and electrolyte imbalances. Ketoacidosis requires immediate medical attention. If blood sugar is very high, it’s recommended to check ketone levels with a urine test strip (Mayo Clinic, 2018a). However, moderate levels of ketone bodies are not a problem. Beta-hydroxybutyrate and acetoacetate are fuels that your liver makes when the body’s cells need an alternative to glucose. Ketone bodies are made in diabetes because although glucose is plentiful, it can’t get inside cells to be burned as a fuel. Ketone bodies are also produced in the opposite situation, when there is no glucose around. This could be because you are on a very low-carbohydrate keto diet or it could be because you are fasting. Most kinds of cells in the body are okay without glucose because they are happy to burn fat instead. However, a couple of very important cell types can’t use fat—brain cells and red blood cells—hence the need for ketone bodies.\n\nDiet is key in both types 1 and 2 diabetes. Digestion of sugars and starches releases glucose that enters the blood and directly raises blood sugar after eating. The amounts and types of carbohydrates consumed determines the level of blood sugar after meals as well as the amount of insulin that someone with diabetes needs to self-administer. It might seem logical that eliminating all sources of glucose—carbohydrates including sugars and starches—from the diet would be effective in lowering blood sugar, but it is controversial whether this is helpful. The Mediterranean diet—which incorporates whole grains, fruits and vegetables, olive oil, nuts, and fish—has been shown to be associated with lower rates of diabetes (Koloverou & Panagiotakos, 2017). The National Institute of Diabetes and Digestive Kidney Diseases (NIDDK) provides basic information on good nutrition for preventing or dealing with diabetes (NIDDK, 2016). Medicare and some insurance plans cover medical nutrition therapy with a registered dietitian, who can help take into account your likes and dislikes to develop a plan you can stick to. Diets associated with benefits for people with diabetes are:\n• \n• Whole grains, such as oats, brown rice, and whole wheat flour. (Look for whole wheat or rye flour as the first ingredient on the bread label. “Wheat flour” means white flour.)\n• \n• Beans, such as chickpeas/garbanzos, lentils, split peas, kidney beans, and black beans\n• \n• Nuts, oils, olives, avocados, seafood, seeds, tahini, peanut butter, mayo (which is mostly vegetable oil)\n• \n• Less dairy fat from butter, ice cream, and sour cream You can control some, but not all, of your blood sugar by eating the right amounts and types of carbohydrates. In addition to obtaining glucose from food, our liver makes glucose from protein, breaking down muscle protein if necessary. This is one reason blood sugar can be high first thing in the morning, before breakfast. On a very-low-carbohydrate diet—less than fifty grams of carbohydrates per day—the body will produce ketone bodies as a fuel alternative to glucose, so a very-low-carbohydrate diet is also called a ketogenic diet. Whether or not a low-carbohydrate ketogenic diet is a good strategy for lowering blood sugar has been controversial. This may change, as a meta-analysis of clinical research on people with diabetes concluded that low-carbohydrate diets result in lower blood sugar, and that effects are greatest with very-low-carbohydrate diets (Sainsbury et al., 2018). Whatever amount of carbohydrates someone with diabetes consumes, it’s important to choose foods that are digested slowly, delivering glucose to the blood gradually to avoid blood sugar spikes. Eating refined-carbohydrate foods, like white flour and sugar, is like injecting glucose. The technical term is that these foods have a high glycemic index (GI). Eating a food with a high GI causes blood sugar to increase more than eating an equivalent amount of carbohydrate from a low-GI food. Information on the GI of a variety of foods is available from Harvard Medical School and from the Institute of Obesity, Nutrition and Exercise, University of Sydney (Atkinson, Foster-Powell, & Brand-Miller, 2008). Why does white rice have a higher GI than sugar? Because the carbohydrates in grains and vegetables—including rice, flour, and potato—are starch, and starch is pure glucose. It doesn’t taste very sweet because the glucose is in long chains, but digestive enzymes quickly convert those chains to individual glucose molecules. Table sugar, or sucrose, is one molecule of glucose linked to one of fructose, so it contains half as much glucose. This is not saying that eating sugar is good for people with diabetes, who need to minimize intake of sugar and other refined carbohydrates. In general, foods with a higher fiber content that can slow glucose absorption will have a lower GI. Foods that take longer to digest because they have not been precooked or finely ground will also have lower GIs. In addition to fiber content and lower GI, there is another good reason to choose whole foods, and that’s their vitamins and mineral content. Making whole wheat into white flour or making beets into sugar removes potassium, magnesium, calcium, vitamin B6, and more—valuable nutrients that many people don’t get enough of. Avoid powders and syrups that claim to be unrefined. If they don’t look like whole foods, they probably aren’t. People with kidney disease who require medical treatment will need to follow diets low in protein. But high-protein diets have several health benefits for individuals with diabetes as well as for the general population. Protein is satiating, it can help with weight loss, and it is a reasonable alternative to carbs for calories. It’s not a cure-all, though—a large analysis of eighteen clinical trials concluded that there was only a small benefit to high-protein diets for people with diabetes—so it might come down to individual preference as to whether you choose a high-protein diet or another type. Eggs are a good option for adding protein to the diet: In one clinical study, twelve eggs a week did not have any adverse effects in those with type 2 diabetes (Fuller et al., 2018; Samkani et al., 2018; Zhao, Luo, Zhang, Zhou, & Zhao, 2018). People like to have a good guy and a bad guy. And these days, omega-3 fats seem to be the good guys and omega-6s are said to be the bad guys. It’s not that simple, of course. Both linoleic acid, an omega-6, and linolenic acid, an omega-3, are essential fatty acids. We can’t make them, and we must eat them. In a very large European study, higher blood levels of both of these fatty acids were associated with a lower incidence of diabetes (Forouhi et al., 2016; Forouhi, Krauss, Taubes, & Willett, 2018). Fats can be saturated or unsaturated—this refers to their chemical structure—and unsaturated fats are further broken down into monounsaturated and polyunsaturated fats. Omega-3 and omega-6 fats are all polyunsaturated. The only monounsaturated fat to know is oleic acid, the omega-9 fat in olive oil. Omega-3s are highest in flaxseeds, walnuts, canola, soy, and fish. Omega-6s are found in most fatty foods we eat, including plant oils, such as corn, soy, peanut, and safflower. Eating healthy whole foods containing unsaturated fats, not limited to omega-3 fats, is associated with good health. Diets high in fat, especially monounsaturated-fat-rich foods, like olives, olive oil, avocados, and nuts, can be good for people with diabetes. We tend to think of carbohydrates as the energy food, but fat is a great source of energy—it’s what mostly fuels our constantly working heart and is almost always the major fuel for muscles. And if need be, the liver can convert fat to ketone bodies, a good fuel for brain cells. All unsaturated fats also have the benefit of lowering blood cholesterol, which is important since cardiovascular disease is the major cause of death and disability in people with diabetes. When low-calorie diets that were either high or low in fat were compared, both diets resulted in weight loss and improved A1C. The high-fat diet had additional benefits, though, such as reducing the amounts of diabetes medications needed (Tay et al., 2018). Fasting has gained popularity in the last few years—and it does seem like a good idea to give our bodies a rest and a chance to clean out. In animals with diabetes, a diet that mimicked fasting restored insulin production by the pancreas, helping to restore the animals’ health (Cheng et al., 2017). With diabetes there is the complication of adjusting medications and lifestyle to avoid low blood sugar. People with diabetes carefully control diet, exercise, and meds to keep blood sugar low, but if you’re fasting, your blood sugar may go too low. This was the case in one study in New Zealand of people with type 2 diabetes who were using blood-sugar-lowering medications. The people with diabetes who fasted (they ate around 500 calories a day) every other day or two days in a row every week experienced some low blood sugar (hypoglycemic) episodes. So this isn’t an approach that someone with diabetes should casually try without the help of a medical professional (Corley et al., 2018).\n\nClinical diabetes research has demonstrated the value of zinc, chromium, magnesium, vitamin D, and vitamin B12 supplements, as well as the value of prickly pear pads. The situation is less clear for alpha-lipoic acid, omega-3 fats, and other nutrients. The pendulum has swung back and forth over the years as to how significant the benefits of omega-3 fats are. A review by the well-respected Cochrane Library concluded recently that contrary to popular opinion, omega-3 supplements haven’t been shown to have much benefit for heart disease in the general population (Abdelhamid et al., 2018), and another Cochrane review concluded that benefits for blood sugar control haven’t been demonstrated either (Hartweg et al., 2008). However, a recent review concluded that omega-3 supplements do have some benefits for people with type 2 diabetes in that they lower blood cholesterol and fat and possibly lead to a small decrease in blood glucose and inflammation (O’Mahoney et al., 2018). Research has suggested that not having optimal vitamin D levels could be a factor in people progressing from prediabetes to full-blown diabetes, and that there may be a therapeutic window when intervention with vitamin D is worthwhile. A clinical trial with people at high risk of diabetes or with newly diagnosed type 2 diabetes reported that supplementing with 5,000 IU vitamin D for six months was helpful—it significantly reduced insulin resistance (Lemieux et al., 2019). Note that these subjects had low vitamin D status to begin with. Supplements have not been shown to be helpful for people who already have diabetes (Pittas et al., 2014). Zinc is important for insulin secretion and for glucose uptake by cells, so adequate zinc intake is important in diabetes. Many clinical studies have evaluated zinc supplements for their effect on people with diabetes, but there hasn’t been agreement as to how significant any benefit is, especially for those consuming a relatively high-zinc Western diet. A 2019 meta-analysis combined the data from thirty-two of the best clinical studies and concluded that the benefits for type 2 diabetes are indeed significant. Fasting glucose, postprandial glucose, A1C, insulin sensitivity, and inflammation were all reduced significantly by taking thirty to fifty milligrams of zinc for at least one month. Most of the studies were on Asian populations, although it looked like there were equal benefits in the small number of studies on Western populations (Wang et al., 2019). Chromium plays a role in the response of cells to insulin, allowing them to take up glucose from the blood. The Daily Value, the amount considered to meet nutritional requirements, is 120 micrograms, and it is not generally accepted that higher amounts of supplemental chromium will improve control of blood glucose in diabetes (Moradi, Maleki, Saleh-Ghadimi, Kooshki, & Pourghassem Gargari, 2019; Nahas & Moher, 2009). However, when researchers from Guangdong, China, pooled the results from twenty-eight clinical trials of type 2 diabetes, they reported significant benefits resulting from chromium supplements for blood sugar and A1C (Huang, Chen, Dong, Zhu, & Chen, 2018). Since then, an additional clinical trial reported benefits for blood sugar and insulin resistance in people with type 2 diabetes who were given 200 micrograms chromium daily (Farrokhian et al., 2019). It has been suggested that these effects are seen only in populations likely to be chromium deficient, and that this is not relevant for most people with diabetes. Until this is sorted out, it seems prudent to ensure an adequate intake of chromium. In a number of controlled clinical trials, magnesium supplements have been shown to provide significant benefits for blood glucose and for insulin sensitivity. The benefits were greatest when supplements were taken for more than four months. Whether or not magnesium supplements are helpful depends on the magnesium status of the individual. In people with low magnesium levels and prediabetes, 380 milligrams of magnesium daily was shown to provide significant benefits (Guerrero-Romero, Simental-Mendía, Hernández-Ronquillo, & Rodriguez-Morán, 2015; Simental-Mendía, Sahebkar, Rodríguez-Morán, & Guerrero-Romero, 2016; Veronese et al., 2016). Magnesium supplements can also be helpful in women who develop diabetes during pregnancy—gestational diabetes. Just six weeks of magnesium (250 milligrams as magnesium oxide) lowered blood sugar and had beneficial effects on gene expression in two studies. In another study of women with gestational diabetes who were deficient in magnesium, the same supplement regimen improved blood sugar levels and also resulted in fewer infants being hospitalized after birth (Asemi et al., 2015; Jamilian et al., 2017; Maktabi, Jamilian, Amirani, Chamani, & Asemi, 2018). As an added benefit, a number of studies have revealed that magnesium supplements also may help lower blood pressure in people with prediabetes or other ailments. Amounts used in the studies ranged from 365 to 450 milligrams of magnesium (Dibaba et al., 2017). A recent review concluded that of all the nondrug therapies, alpha-lipoic acid (ALA) is the best for the relief of pain in diabetic polyneuropathy, nerve damage that can occur in people with diabetes. One study compared ALA to methylcobalamin, a form of vitamin B12, for diabetic neuropathy and found that ALA was better for burning and pain, and methylcobalamin was superior for numbness and lack of feeling (Han et al., 2018; Nesbit et al., 2019). High fiber intake from whole grains and other plant foods is associated with lower risk of diabetes. Beta-glucans from oats, psyllium seed husk (e.g. Metamucil), and guar gum are viscous, gel-forming fibers that can improve blood sugar control after a meal (Andrade et al., 2015; McRorie & McKeown, 2017; Weickert & Pfeiffer, 2018). Benfotiamine is a fat-soluble form of thiamine (vitamin B1) that is purported to be more bioavailable than thiamine itself (Raj, Ojha, Howarth, Belur, & Subramanya, 2018). Like all the B vitamins, thiamine is crucial for glucose metabolism, and it has been proposed that benfotiamine can be especially helpful for people with type 2 diabetes. People should be concerned about whether they’re getting enough thiamin; the National Institutes of Health (NIH) has reported that 20 to 30 percent of older adults have some degree of thiamine deficiency (NIH, Office of Dietary Supplements, 2019). Before dismissing irritability and confusion as inevitable consequences of aging, consider that they may be signs of thiamine deficiency. Two factors that might play into thiamine deficiency are drinking alcohol, which depletes thiamine, and eating white rice. Thiamine is lost when rice is refined, which is a major cause of the thiamine-deficiency disease called beriberi (Hoyumpa, 1983). So has benfotiamine proven helpful in clinical research on type 2 diabetes? It’s not looking great. A preliminary study reported that three days of benfotiamine supplements was beneficial, but in larger follow-up studies, benefits were not significant (Alkhalaf et al., 2012; A. Stirban, Pop, & Tschoepe, 2013; Alin Stirban et al., 2006). Mushrooms, seaweeds, and other plants possess a large array of bioactive components being studied for blood sugar regulation, but efficacy has not yet been demonstrated for diabetes. Components of the shaggy ink cap mushroom, Coprinus comatus, were able to lower blood sugar in diabetic mice (Shuai Zhou, Liu, Yang, Tang, & Zhang, 2015). Extracts of chaga, Inonotus obliquus, may be able to block carbohydrate digestion (Stojkovic et al., 2019), like the drug Acarbose, which is discussed in the conventional treatments section. In test tube studies, red seaweed extracts have been found to inhibit the enzymes that digest carbohydrates (Brabakaran & Thangaraju, 2018); we don’t know yet if these results will translate to useful effects in the human body. Many benefits of green tea have been reported, and it is now a common ingredient in dietary supplements. Green tea intake has been associated with good health in several small studies, and animal research has also found additional benefits. However, recent research found that green tea intake was associated with more diabetes, not less. In the Shanghai Women’s and Men’s Health Studies, drinking green tea was associated with a higher likelihood of developing type 2 diabetes (Liu et al., 2018). It is not clear why this would be the case, but it is known that the antioxidant polyphenols in tea can be toxic to the liver at high doses. More research is required before any conclusions about green tea and diabetes can be reached. Opuntia is a cactus commonly known as prickly pear. The part of the plant that is important medicinally is the pad, which is also called a cladode or leaf. A review of twenty clinical trials concluded that the cladode, but not the fruit, had glucose-lowering effects that were worth further investigation. Benefits were seen both for fasting glucose and blood glucose after a meal. The pad is commonly eaten grilled or boiled, and is a nutritious source of fiber, vitamins, minerals, and phytochemicals. A small capsule of prickly pear is not likely to be useful—in the clinical trials it was used as a food, with serving sizes of 100 to 500 grams (3 to 15 ounces), or 50 grams of a powder (Gouws, Georgousopoulou, Mellor, McKune, & Naumovski, 2019). It’s been proposed that maqui berry extract can lower blood sugar after a meal by slowing glucose absorption in the gut, and more specifically by inhibiting the transporter that brings glucose into intestinal cells (Hidalgo et al., 2014). Does its bioactive component, delphinidin, reduce glucose after a meal? Two clinical trials said: Not really, but preliminary data would be worth following up on (J. L. Alvarado et al., 2016; J. Alvarado, Schoenlau, Leschot, Salgad, & Vigil Portales, 2016).\n\nDiabetes is one of the diseases most clearly affected by lifestyle, and the value of diet and exercise in its prevention and treatment is well established. Specific dietary factors are discussed more extensively in the dietary changes section of this article. Is it possible to prevent type 2 diabetes? The answer from the Diabetes Prevention Program (DPP), a huge clinical trial funded by the CDC (and from other studies), was a definite yes. In the DPP, researchers recruited people with high blood sugar and tested whether either a drug or an intensive lifestyle intervention would have an effect on whether they went on to develop diabetes. These people did not have blood sugar high enough to be classified as diabetic—theirs was in the intermediate range, referred to as prediabetes or impaired glucose tolerance (IGT) (American Diabetes Association [ADA], 2019a; Diabetes Prevention Program Research Group, 2002). Participants in the DPP either received a placebo, the drug metformin (a diabetes medication), or what was referred to as intensive lifestyle intervention. The results were impressive and have since been widely used to guide clinical practice. Over a three-year period, 29 percent of the placebo group became diabetic. In comparison, only 14 percent of the lifestyle group and 22 percent of the metformin group became diabetic. Both the lifestyle intervention and metformin helped lower fasting blood sugar, but the lifestyle group stood out with lower A1C levels, probably due to lower blood sugar after meals. Interested in the lifestyle intervention but afraid of the word “intensive”? Don’t be put off—the intervention was actually quite moderate. One-on-one counseling was given for six months on exercising and eating a diet low in calories and fat. Participants lost an average of about fifteen pounds (seven kilograms) in the first year. The exercise goal was at least 150 minutes per week of moderate activity such as brisk walking. This simple regimen significantly reduced progression to diabetes. A ten-year follow-up confirmed significant benefits of the lifestyle intervention (Diabetes Prevention Program Research Group et al., 2009). A type 2 diabetes diagnosis is not always permanent. Over 800 people newly diagnosed with diabetes in the United Kingdom were followed for five years. Remission was achieved in 30 percent of people after five years. The factor most related to remission was weight loss. Those who lost at least 10 percent of their body weight were twice as likely to achieve remission as those who maintained the same weight (Dambha-Miller, Day, Strelitz, Irving, & Griffin, 2019). Programs to Help with a Healthy Lifestyle Health care practitioners have recognized that it hasn’t worked very well so far just to tell people to lose weight and to leave them on their own with an occasional slap on the wrist. For prevention of type 2 diabetes, you can also choose from a long list of programs registered with the CDC that use an evidence-based lifestyle-change curriculum. Some of these have demonstrated that their programs get results and are described by the CDC as having “achieved full recognition.” Lark Health’s diabetes prevention program, which has achieved full recognition by the CDC, offers personalized treatment through a combination of real-time human coaching and artificial intelligence. For diabetes, the American Diabetes Association (ADA) 2019 Standard of Care emphasizes the need for care to be more interactive than it typically is now, with patients involved in decision-making. It also underscores the need for individualized care based on each person’s unique situation (ADA, 2019b). In the absence of a personal trainer or dietitian, there are numerous apps designed to help people keep track of blood glucose numbers and to stick with a healthy lifestyle. A review of 21 studies assessing the value of apps concluded that overall, they were beneficial and were associated with lower A1C numbers (Hou et al., 2018). The functions these apps offer can be seen in a 2019 review by Healthline. Work with your medical doctor to find the app that best meets your requirements. People can be healthy at every size (HAES), but for many people extra weight brings with it health problems, including high blood sugar. The majority of people with type 2 diabetes are overweight, and long-term studies have shown that the risk of developing diabetes decreases significantly with weight loss. The minimum amount of weight loss to aim for is 5 percent of body weight—losing less than 5 percent hasn’t been shown to significantly improve blood sugar control. Interventions that did improve blood sugar and other important metrics were intensive lifestyle interventions—comprising low-calorie diets, regular physical activity, and regular contact with health professionals—that resulted in losing more than 5 percent body weight. An additional benefit was that intensive intervention led to a reduction in the number of diabetes medications needed (Franz, Boucher, Rutten-Ramos, & VanWormer, 2015; Look AHEAD Research Group et al., 2013). How to Feel Full When You’re Cutting Calories The ADA recommends eating 500 to 750 fewer calories than usual every day to lose weight (ADA, 2017), which means cutting out a significant portion of your usual food intake or restructuring your meals. If you’re feeling hungry: Piling on the vegetables helps fill you up. And increasing protein and fat can help with lasting satiety. So you might try substituting a large grilled chicken salad with an oil-based dressing in place of a pasta with cream sauce, for example. Any diet you can stick to that helps you eat fewer calories—and that ideally focuses on whole, unrefined foods—is a good step. Honor your individual preferences. On the other hand, once someone has diabetes, the benefits of weight loss may not be all-encompassing. In a large study of over 5,000 overweight people with type 2 diabetes, half were given an intensive lifestyle intervention aimed at eating less and exercising more. Compared to people in the control group, the intervention group lost more weight and had lower A1C levels. But over the ten-year study, people in both groups were equally likely to die or have a heart attack (Look Ahead Research Group et al., 2013). Exercise is very effective at lowering blood sugar. When calculating their dose of insulin, people with type 1 diabetes have to take into account not only what they are eating but how much they are exercising (more on this below). The extent of the blood-sugar-lowering effect of exercise may vary with long-term training, and it’s still not clear what the optimal exercise program is (Steenberg et al., 2019). The ADA recommends thirty or more minutes of moderately vigorous aerobic exercise at least five days a week—and it’s okay to break it up into shorter sessions. They also recommend strength training at least twice a week (Colberg et al., 2016). Building muscle is important—muscle burns calories even at rest, and it is key for removing glucose from the blood. High-intensity interval training (HIIT) has also been shown to be beneficial for those with type 2 diabetes. HIIT can be broadly defined as short bouts of intense exercise—ten seconds to five minutes—interspersed with brief periods of low-intensity activity that don’t allow full recovery (Karstoft, Safdar, & Little, 2018; Laursen & Jenkins, 2002). While exercising for thirty minutes a day is great, it’s not ideal to spend the rest of the day sitting in a chair. Sedentary behavior is associated with a shorter life span in everyone, including people with diabetes. Interrupt your work or couch session every half hour with some walking, which has been shown to help control blood sugar in diabetes, along with light weightlifting. After meals, take a fifteen-minute walk if you can (Colberg et al., 2016). If you have prediabetes and want to do all you can to prevent things from progressing, regular aerobic training can increase your insulin sensitivity (Colberg et al., 2016). Only fifteen minutes daily of a supervised high-intensity interval training program resulted in improvements in insulin sensitivity in people with prediabetes (Phillips et al., 2017). Pregnant women at risk of diabetes or with gestational diabetes are advised to exercise moderately for twenty to thirty minutes daily. Regular exercise can improve blood sugar control, can lower the risk of developing diabetes, and can lower the risk of pregnancy complications like eclampsia (Colberg et al., 2016). In one small study, researchers asked whether exercise might be useful in slowing the progression of type 1 diabetes. After diagnosis and initial treatment of type 1 diabetes, there is typically a honeymoon period, where the pancreas seems to rally, and blood sugar is controlled more easily. In this study, men who reported that they started significant exercise programs after diagnosis had an average honeymoon period more than five times as long as men who did not exercise (Chetan et al., 2019). We’ll eagerly look for this result to be validated in a controlled clinical trial. It’s not easy to predict the extent to which exercise will lower blood sugar, so it can be difficult for people with type 1 diabetes to take exercise into account and to adjust their insulin dose and/or food intake accordingly. When you’re using insulin, you need to avoid hypoglycemia after exercise, and the effect can be quite delayed, even extending into nighttime hours. We don’t understand why, but exercise of varying intensities can help prevent swings in blood sugar. Preliminary research has suggested that doing a ten-second sprint before or after a moderate aerobic session, or switching briefly to high-intensity exercise every so often during a moderate exercise session, can help smooth blood sugar responses. Resistance exercise prior to aerobic exercise may also be useful (Colberg et al., 2016). Making it even more difficult for people with type 1 diabetes to exercise is a paradoxical effect of increased blood sugar after high-intensity interval training. Recent research points to a need for additional insulin administration in some cases(Aronson, Brown, Li, & Riddell, 2019). Discuss any changes in exercise regimens with your health care practitioner.\n\nFor people with type 1 diabetes who require insulin, there are a variety of options for delivering the insulin. New options attempt to mimic the pancreas, automatically monitoring blood glucose and dispensing the correct amount of insulin. For people with type 2 diabetes, there are multiple medications, each with particular benefits and indications. Lifestyle modifications are an important part of conventional treatment of diabetes, as discussed in the lifestyle section of this article. Insulin was originally obtained from pig and cow pancreases, but now “human” insulin is produced by bacteria and yeast. Researchers at Genentech figured out how to insert the human gene for insulin into bacteria and to get the bacteria to produce “human” insulin. This use of genetic engineering was a milestone in the history of biotechnology ((Goeddel et al., 1979). Now insulin is made in short-, intermediate-, and long-acting forms. People with type 1 diabetes (and some people with type 2) have to measure their blood glucose and self-administer the appropriate amount of insulin based on glucose results, taking into account diet and exercise. Insulin is injected via a syringe or a pen or a wearable pump. There is also an insulin patch and Afrezza, an inhaled insulin that is fast-acting and may be useful after meals. There are many options for type of insulin, type of pump, syringe, pen, needle size, etc. According to the ADA, there is no one best product, and determining which route to go could benefit from more research. Frequently monitoring your blood glucose and adjusting insulin is important for reducing complications and for maintaining good blood sugar control (ADA, 2019c). Smart pumps that can work with a glucose meter to measure blood glucose and inject insulin are being developed. The best one so far can do everything automatically except guess the amounts of carbs you’ll be eating. Omnipod DASH is a customizable wearable insulin pump from Insulet Corp that works together with glucose-monitoring devices and a handheld wireless controller to provide the optimal amount of insulin. It was recently FDA approved and became available in 2019 (American Association of Clinical Endocrinologists, 2018). Measuring blood glucose requires a glucose meter and finger sticks, or a continuous glucose monitor (CGM). Glucose meters vary in their accuracy, so discuss this important choice with your doctor, and look for updates from the Diabetes Technology Society. Only six of eighteen commercially available glucose meters performed well in thorough assessments of accuracy (Klonoff et al., 2018). Glucose meters require blood and test strips that the blood is applied to. All this is expensive. These supplies are covered by some but not all insurance policies. (In an article in The New York Times, journalist Ted Alcorn reported that there’s a thriving grey market for blood glucose test strips.) Continuous glucose monitors (CGMs) that have a tiny sensor under your skin can send your smartphone continuous real-time results. This sounds preferable to doing ten finger pricks a day, but according to the NIDDK, CGMs have limitations. They need to be replaced frequently and calibrated with blood, and you have to confirm results with finger pricks before taking insulin (NIDDK, 2017). What we might call an artificial pancreas, researchers call a closed-loop system of insulin delivery. It connects a continuous glucose monitor to an insulin pump that automatically secretes the needed amount of insulin. The iDCL Trial Research Group has reported successful control of blood glucose in people with type 1 diabetes with a closed-loop system called Control-IQ. The percentage of time that subjects’ blood sugar was in a desirable range increased from 61 percent at baseline to 71 percent during a six-month multicenter trial. Good results have also been reported with this system in children, and the FDA has given clearance for use in children as young as six (Breton et al., 2020; Brown et al., 2019; NIH, 2020). Because of the limited commercial availability and affordability of the artificial pancreas, many people have made their own closed loop systems. The #WeAreNotWaiting and #OpenAPS communities have shared open-source algorithms to connect commercial glucose meters with insulin pumps in order to automate insulin delivery. Caregivers of children with diabetes have reported better control of blood glucose overall using these systems (Braune et al., 2019). Along with reliance on insulin treatments comes the risk of taking too much insulin and developing low blood sugar. Injecting too much insulin can also make people act irrationally, which is scary and not uncommon in people with type 1 diabetes. This can also happen with other glucose-lowering medications and can be brought on by skipping meals or exercising more than planned. Look out for irritability, hunger, faintness, weakness, and headache, and treat with glucose (dextrose), fruit juice, or sugar (Mayo Clinic, 2018b; Mittermayer et al., 2017). For type 2 diabetes, metformin (Glucophage, Glumetza) is the first medication people try; if it isn’t sufficient, other medications can also be used (ADA, 2019d). Metformin appears to act on the liver and the intestine to lower fasting blood sugar and blood sugar after meals (Rena, Hardie, & Pearson, 2017). The major problems with this drug are possible abdominal discomfort, bloating, and diarrhea. These symptoms typically do not last forever, and starting with a low dose and gradually increasing may be helpful. As with all medications, be informed about the serious side effects, and if you have chest pain or a rash with metformin, tell your doctor. It’s wise for metformin users to take a vitamin B12 supplement, as long-term use of metformin is associated with B12 deficiency. This B12 deficiency is in turn associated with worsening of neuropathy (Out, Kooy, Lehert, Schalkwijk, & Stehouwer, 2018). Similar to diabetes, B12 deficiency can result in numbness and tingling of extremities. For people who can’t get their blood sugar low enough with metformin alone and who also have cardiovascular disease or kidney disease, it’s recommended to add either an SGLT-2 drug or a GLP-1 drug because of their cardiovascular benefits. People who don’t have cardiovascular disease or kidney disease and who need something in addition to metformin to reach a target A1C goal have options including sulfonylureas, thiazolidinediones, and DPP-4 inhibitors. The ADA has published a comparison of monthly costs of the currently recommended medications (ADA, 2019d).\n• \n• Acarbose (Precose) is a drug that blocks the carbohydrate-digesting enzyme alpha-glucosidase in the intestine. It can suppress or delay intestinal carbohydrate breakdown and significantly lower the absorption of glucose. It has been shown to be helpful for blood sugar control in prediabetes and in diabetes. It has other benefits, including reductions in blood lipids and blood pressure, healthier blood vessels, and as confirmed by a meta-analysis of multiple studies, a reduction in heart attacks. The use of this drug has been limited because it can cause gastrointestinal discomfort, gas, and loose stools resulting from undigested carbohydrates. However, many people do not have a significant problem with these side effects and usually only experience them for a limited time. Starting with a low dose and minimizing sugar intake can make this a great option (DiNicolantonio, Bhutani, & O’Keefe, 2015; Joshi et al., 2015).\n• \n• SGLT-2 inhibitors (dapagliflozin [Farxiga] and other drugs ending in “gliflozin”) not only help control blood sugar but also have benefits for people with cardiovascular disease, renal disease, and heart failure. They work by increasing glucose and sodium excretion in urine. They lower blood sugar and A1C and have favorable effects on body fat, weight, and blood pressure (Kramer & Zinman, 2019; Pereira & Eriksson, 2019; Zelniker et al., 2019).\n• \n• GLP-1 (glucagon-like peptide) receptor agonists have to be given by daily or weekly injection. These include albiglutide (Tanzeum) and other “glutides.” They lower blood sugar by reducing glucagon, the hormone that increases blood glucose. These drugs, albiglutide in particular, also appear to significantly reduce the risk of heart attacks and stroke (Zweck & Roden, 2019).\n• \n• Sulfonylureas stimulate insulin production, help with blood sugar control, and are not expensive. But they’ve been problematic in terms of hypoglycemia and weight gain, and they have not been shown to have cardiovascular benefits. But newer drugs (glimepiride and gliclazide modified release) may be better (Bester, Ton, & Korownyk, 2018; Kalra et al., 2018).\n• \n• Thiazolidinediones (e.g. rosiglitazone and pioglitazone) work by improving insulin sensitivity. They not only lower blood sugar but also lower blood cholesterol and fat. You may have heard that rosiglitazone has the serious side effect of increased heart attacks, but the FDA decided that conclusion was no longer justified, and the black box warning has since been removed. There is now some concern that pioglitazone is associated with bladder cancer, and the FDA has mandated a warning on the box (Nanjan, Mohammed, Prashantha Kumar, & Chandrasekar, 2018).\n• \n• DPP-4 (dipeptidyl peptidase) inhibitors can be helpful for blood sugar control; however, the FDA has asked practitioners and patients to be aware of a possible link to development of arthritis (Mascolo et al., 2016). DPP-4 drugs include sitagliptin (Januvia) and anything else with “gliptin” in the name. Always read about the possible side effects of medications. People frequently experience side effects but don’t realize that they are related to a medication. If you are diagnosed with diabetes and depression, talk to your health care practitioner about options that could help. Researchers in Taiwan discovered an apparent benefit to taking antidepressant medications for people diagnosed with diabetes and depression. They were able to look at data in the National Health Insurance Research Database to examine the health records of over 50,000 people newly diagnosed with diabetes and depression. Over the next ten years or so, there were 35 percent fewer deaths in the group that took antidepressants compared to those who did not take them. The only antidepressants this did not apply to were reversible inhibitors of monoamine oxidase A (RIMAs), which were associated with increased mortality instead of decreased mortality (H.-M. Chen et al., 2019). Surgery to bypass a portion of the digestive tract may be helpful for weight loss and to lower blood sugar among people who are obese (Pareek et al., 2018). But it comes with risks, and whether it’s really worthwhile for people with type 2 diabetes is unclear. Lifestyle and medications are first-line treatments, and surgery is recommended only if these are not effective. Two types of surgery are sleeve gastrectomy, which makes the stomach so small that you can’t fit much food in, and Roux‐en‐Y gastric bypass, which prevents digestion and absorption of food. In Roux-en-Y bypass, the upper part of the stomach is rerouted to empty into the intestine past the portion of the intestine where most digestion and absorption take place. When people either eat less or don’t absorb what they eat, this can result in dramatic weight loss, but the weight loss varies greatly from person to person. These procedures can be effective for prevention of diabetes and even for remission of diabetes, but the effectiveness depends on the degree of weight loss (Pucci et al., 2018). For people with a body mass index (BMI) of at least thirty-five kg/meter squared (thirty-two and one half for Asians) who don’t have good control of their blood glucose with lifestyle and medications, the benefits of surgery are thought to outweigh the risks (Rubino et al., 2016).\n\nNew and Promising Research on Diabetes Research on diabetes ranges from disease prevention to improving how we treat symptoms of advanced disease. Scientists are investigating better ways of delivering insulin and also trying to promote or even restore insulin production by the pancreas. How Do You Evaluate Clinical Studies and Identify Promising Results? The results of clinical studies are described throughout this article, and you may wonder which treatments are worth discussing with your doctor. When a particular benefit is described in only one or two studies, consider it of possible interest, or perhaps worth discussing, but definitely not conclusive. Repetition is how the scientific community polices itself and verifies that a particular treatment is of value. When benefits can be reproduced by multiple investigators, they are more likely to be real and meaningful. We’ve tried to focus on review articles and meta-analyses that take all the available results into account; these are more likely to give us a comprehensive evaluation of a particular subject. Of course, there can be flaws in research, and if by chance all of the clinical studies on a particular therapy are flawed—for example, with insufficient randomization or lacking a control group—then reviews and meta-analyses based on these studies will be flawed. But in general, it’s a compelling sign when research results can be repeated. A relatively new vaccine against rotavirus has been associated with lower incidence of type 1 diabetes in children. Why might this be more than just a coincidence? Rotavirus is a very common virus that infects most children, causing diarrhea that usually resolves, leaving the child with immunity to the virus. However, it can cause dehydration, hospitalization, and death. This infection has been associated with children developing type 1 diabetes. It is hypothesized that because parts of the virus look like pancreatic beta cells, it helps trigger an immune attack on the pancreas. If this were the case, then fewer children should be developing diabetes since a rotavirus vaccine became available about ten years ago. Sure enough, in an Australian study this seemed to be the case, but only for children ages four and younger (Perrett, Jachno, Nolan, & Harrison, 2019). The link between vaccination and lower incidence of diabetes is only a correlation, but given the reported safety and efficacy of this vaccine, it’s an additional incentive to be vaccinated (Hoffman et al., 2018; Lamberti, Ashraf, Walker, & Black, 2016). Whether or not this association holds up will doubtless be the subject of further research. An intestinal bacterium called Akkermansia muciniphila is associated with healthy body weight, blood pressure, and blood sugar regulation. A small controlled human clinical trial has now reported that a daily probiotic with 10 billion A. muciniphila led to improvements in insulin sensitivity, body weight, and inflammation in people who were insulin resistant. The really surprising part of all this was that the bacteria were dead as a result of pasteurization. Hopefully these results will be verified and this species will be commercialized soon (Depommier et al., 2019). A supplement containing live A. muciniphila plus other probiotic bacteria (Clostridium beijerinckii, Clostridium butyricum, Bifidobacterium infantis, and Anaerobutyricum hallii), has been shown to be beneficial for people with type 2 diabetes. After twelve weeks of subjects’ taking this daily probiotic, two measures of their blood sugar regulation, postprandial glucose and A1C, were lower than in people given a placebo (Perraudeau et al., 2020). The gut microbiome isn’t limited to bacteria. Viruses that infect these bacteria—called bacteriophages— are also present. These viruses, the gut viome, may be as important as gut bacteria for our health. Transplants of feces containing bacteria and viruses from a healthy donor have been used to treat people with an intestinal Clostridium difficile infection. This is called fecal microbiota transplantation. Now researchers from the University of Copenhagen have reported that in mice, fecal transplants can also promote better glucose tolerance. The kicker is that all bacteria were filtered out of the fecal material before the transplant. They attribute the benefits of the transplant to the viruses that remained (Rasmussen et al., 2020). Human stem cells can be turned into pancreatic beta cells that produce insulin, but we want them to only make insulin when glucose levels are high. Now that goal looks possible. Researchers at Washington University in St. Louis have coaxed human stem cells into making insulin in response to glucose. Cells implanted in diabetic mice are able to help control blood sugar. They are not ready for use in humans, so stay tuned for more (Velazco-Cruz et al., 2019). Imagine that instead of sticking a needle into yourself, you could pop a sugar-coated pill that would attach to the wall of your stomach, insert a tiny tube, and inject insulin into your body via a spring-loaded injector. Scientists at MIT and other research institutes have made progress toward making this seemingly outrageous scenario real with their publication of successful results in pigs. They delivered insulin just as well with their self-orienting millimeter applicator (SOMA) as they could with subcutaneous injection. It will be a while until this translates into a drug available for human use, but it should be a worthwhile leap in convenience (Abramson et al., 2019). Another major advance is an insulin patch that uses hundreds of tiny needles to measure glucose levels and to automatically inject insulin. Jicheng Yu and Zhen Gu, PhD, at the University of North Carolina at Chapel Hill and North Carolina State, Raleigh, and collaborators from multiple institutions, have shown that this type of patch can keep blood glucose under control in diabetic pigs for up to twenty hours. The technology will be further developed by Zenomics, Inc. (Yu et al., 2020). GPR119 is the name of a receptor found on the insulin-producing beta cells of the pancreas. When the appropriate partner molecule binds to this receptor, insulin secretion is enhanced. Daiichi Sankyo at TK has developed a drug called DS-8500a that binds to and activates GPR119. Following the usual progression of drug research, DS-8500a was shown to work in cell culture studies, and then in animal research, and then was shown to be safe in people. Most drugs are abandoned along this long path, but DS-8500a has continued to show promise—and its ability to lower blood sugar has been demonstrated in a clinical study of Japanese people with type 2 diabetes. It has been noted that this type of drug that stimulates insulin production may work better in Asians than in Caucasians. The new drug also reduced blood cholesterol and triglyceride levels very significantly (Yamada et al., 2018). Another drug targeting GPR119 is enrolling subjects now—see the clinical trials section. GPR119 has been called an endocannabinoid receptor since an endocannabinoid-related molecule in our bodies binds to it. Endocannabinoids are compounds in our body that affect us similarly to THC from marijuana. Gut cells make a molecule called OEA (oleoylethanolamide) that binds to GPR119 and generates feelings of satiety. OEA has been found to cause animals to eat less and to gain less weight. Pharmaceutical companies are likely hopeful that their GPR119-activator drugs might be weight-loss drugs. It might seem counterintuitive that anything related to marijuana could help with eating less, but the endocannabinoid system is complex and not yet fully understood (Horn, Böhme, Dietrich, & Koch, 2018). A new type of treatment for painful diabetic peripheral neuropathy targets specific receptors on neurons. Glutamate is a neurotransmitter that you don’t hear that much about—and it’s important in neuropathic pain when it binds to a particular kind of receptor, an NMDA receptor. Aptinyx Inc. has developed a drug that interacts with these receptors, resulting in a balancing or normalizing effect. The drug has been very effective in studies of neuropathic pain in animals (Ghoreishi-Haack et al., 2018), and enrollment has been completed for a phase 2 trial of the drug.\n\nClinical trials are research studies intended to evaluate a medical, surgical, or behavioral intervention. They are done so that researchers can study a particular treatment that may not have a lot of data on its safety or effectiveness yet. If you’re considering signing up for a clinical trial, it’s important to note that if you’re placed in the placebo group, you won’t have access to the treatment being studied. It’s also good to understand the phase of the clinical trial: Phase 1 is the first time most drugs will be used in humans, so it’s about finding a safe dose. If the drug makes it through the initial trial, it can be used in a larger phase 2 trial to see whether it works well. Then it may be compared to a known effective treatment in a phase 3 trial. If the drug is approved by the FDA, it will go on to a phase 4 trial. Phase 3 and phase 4 trials are the most likely to involve the most effective and safest up-and-coming treatments. In general, clinical trials may yield valuable information; they may provide benefits for some people but have undesirable outcomes for others. Speak with your doctor about any clinical trial you are considering. To find studies that are currently recruiting for diabetes, go to clinicaltrials.gov. We’ve also outlined some below. In the DAWN trial, Jay Skyler, MD, MACP, of the University of Miami Diabetes Research Institute, and Tolerion, Inc., are testing gene therapy for people recently diagnosed with type 1 diabetes. There must be less than 100 days from your first insulin treatment to the time you start the trial. The idea is to find people whose pancreases are not completely destroyed yet by the autoimmune attack that occurs in type 1 diabetes and to halt the autoimmune attack. It’s hoped that shots of DNA coding for a form of insulin, similar to allergy shots, will induce tolerance and stop the immune attack (Roep et al., 2013). This is a phase 2 study, meaning that safety and dose have been preliminarily assessed. Insulet Corp. is sponsoring a clinical study of its Omnipod Horizon Automated Glucose Control System under the direction of Bruce Buckingham, MD, at Stanford University and Sue Brown, MD, at the University of Virginia. Enrollment of over 200 volunteers with type 1 diabetes has been completed in this test of Insulet’s artificial pancreas. Instead of self-monitoring glucose levels, calculating how much insulin to administer, and self-administering insulin, this closed-loop system will use a continuous glucose monitor, personalized algorithms, and automated insulin administration to achieve optimal glucose control. Women with gestational diabetes are at increased risk for developing type 2 diabetes. Jacinda Nicklas, MD, from University of Colorado, Denver, and Ellen Seely, MD, Brigham & Women’s Hospital in Boston are asking whether support from a lifestyle coach and Web-based education can help women with gestational diabetes recover their health and weight postpartum. They adapted the web-based Diabetes Prevention Program (from the NIH) to be more relevant for women with gestational diabetes. The trial is called the Balance After Baby Intervention. Depression increases the risk of developing type 2 diabetes. Lauren Shomaker, PhD, at Colorado State University is asking whether cognitive behavioral therapy can reduce this risk—preliminary research indicated it might (Shomaker et al., 2017). Moderately depressed adolescent girls who are at a high risk of developing diabetes because of family history and obesity will participate in six weeks of group therapy or, as a control, health education. The therapy (Blues Program) involves “psychoeducation on depression; cognitive restructuring of negative thoughts; engagement in pleasant activities; healthy rewards; stress and coping.” The researchers will evaluate benefits for depression and for insulin sensitivity and also evaluate changes in behaviors, i.e., changes in activity or diet. Suzanne Mitchell, MD, MS, at the Boston Medical Center is overseeing a study called Women in Control: A Virtual World Study of Diabetes Self-Management. Face-to-face group medical visits will be compared with virtual group visits. Mitchell is looking for women with uncontrolled diabetes of black/African American or Hispanic/Latina origin. The goal is to empower women in the self-management of diabetes, resulting in increased physical activity and better blood sugar control. Jeff Huffman, MD, at the Massachusetts General Hospital in Boston is trying a positive psychology approach to help people with type 2 diabetes take better care of themselves. In addition to educating people about diet and exercise, there will be gratitude-based activities, meaning-based activities, strength-based activities, and goal-setting exercises. The interventions are delivered by phone for eight weeks. TECHDMBAT is the name of a clinical trial that is exploring whether a multicomponent intervention can improve blood sugar control in African Americans, who are disproportionately affected by type 2 diabetes. Leonard Egede, MD, MS, at the Medical College of Wisconsin is the principal investigator on this study, in which people with diabetes will receive diabetes education, home telemonitoring, and behavior therapy, delivered by nurses via smartphones. Athena Philis-Tsimikas, MD, and Addie Fortmann, PhD, at the Scripps Whittier Diabetes Institute are trying to find ways to improve blood sugar control in Hispanic people attending neighborhood health clinics. In the US, the prevalence of diabetes and of complications from diabetes are higher than average in Hispanics. One approach that has been beneficial is asking patients to text the clinic their blood glucose measurements, so they can be monitored by nurses. The goal for the current study, called Dulce Digital-Me, is to see if more personalized advice, either from automated algorithm-generated messaging or from medical assistants, is even more successful. The Lobag Diet is a low-carb, high-protein, high-fat—but nonketogenic—diet that was shown to improve blood sugar in a small study in which subjects were provided with all their food (Gannon & Nuttall, 2004). Anne Bantle, MD, at the University of Minnesota is asking if this success can be reproduced when people have to make their own meals with guidance. The diet does not require calorie restriction or weight loss. Darren Casey, PhD, at the University of Iowa is testing whether a supplement called SuperBeets can improve the typically poor exercise capacity of people with type 2 diabetes. The assumption is that the nitrate in this product will help increase nitric oxide production, which will increase blood flow to muscles and improve the ability to exercise. One approach to type 2 diabetes is to encourage the pancreas to make more insulin, and drugs that activate a molecule called GPR119 appear to do just that (as discussed in the research section of this article). The bottom line is that activating GPR119 can increase insulin production by the pancreas, and more than one company is hoping to find a drug that activates GPR119 safely in humans. Julie Willard, MD, and Jiyoon Jeong are evaluating the safety of a drug called DA-1241 in healthy subjects and in those with type 2 diabetes. Matthew Ziegelmann, MD, at the Mayo Clinic is assessing whether penile traction therapy will be helpful in men with type 2 diabetes, who have a higher rate of sexual dysfunction and of diminished penile length. This therapy has been used historically for decreased penile length but this will be the first study to evaluate its efficacy in diabetes.", "opengraph": {"locale": "en_US", "type": "article", "title": "Diabetes | goop", "description": "In people with diabetes, high levels of sugar in the blood damage blood vessels and nerves, frequently without obvious symptoms. This can cause heart attacks, kidney failure, and other health issues if not treated properly. In type 2 diabetes, insulin is no longer effective at lowering blood sugar, referred to as insulin resistance. Type 1 diabetes is considered an autoimmune disease because the immune system destroys insulin-producing cells. We do know that diabetes is one of the diseases most responsive to lifestyle changes, so we’ve summarized recent research about diets, foods, supplements, and exercises, to aid in making worthwhile lifestyle upgrades. We’ve also gathered some of the most interesting research on innovative ways to prevent and treat diabetes.", "url": "https://goop.com/wellness/health/understanding-diabetes/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2021-08-12T13:01:05+00:00", "article:modified_time": "2022-10-06T18:52:10+00:00", "updated_time": "2022-10-06T18:52:10+00:00", "image": "https://goop-img.com/wp-content/uploads/2019/12/Goop-PHD_diabetes-Stocksy_txp67937b14BlY200_Medium_571184.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2019/12/Goop-PHD_diabetes-Stocksy_txp67937b14BlY200_Medium_571184.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/research-scientist-bios/", "https://goop.com/goop-phd/", "/cdn-cgi/l/email-protection#93f6f7fae7fce1faf2ffd3f4fcfce3bdf0fcfe", "https://www.niddk.nih.gov/health-information/diabetes/overview/diet-eating-physical-activity", "https://www.health.harvard.edu/diseases-and-conditions/glycemic-index-and-glycemic-load-for-100-foods", "https://care.diabetesjournals.org/content/31/12/2281.full", "#conventional-treatment", "#dietary-changes-for-diabetes", "https://nccd.cdc.gov/DDT_DPRP/Registry.aspx", "https://www.lark.com/", "https://www.healthline.com/health/diabetes/top-iphone-android-apps", "https://haescommunity.com/", "#lifestyle-support-for-diabetes", "http://investor.insulet.com/news-releases/news-release-details/insulet-showcase-its-recently-launched-omnipodr-dashtm-system", "https://www.diabetestechnology.org/surveillance.shtml", "https://www.nytimes.com/2019/01/14/health/diabetes-test-strips-resale.html", "https://twitter.com/hashtag/wearenotwaiting?lang=en", "https://openaps.org/what-is-openaps/", "https://care.diabetesjournals.org/content/42/Supplement_1/S90.figures-only", "https://www.americanherbalistsguild.com/member-profiles", "#clinical-trials-on-diabetes", "https://clinicaltrials.gov/ct2/show/NCT03219320", "https://clinicaltrials.gov/ct2/results?recrs=ab&cond=Diabetes&term=&cntry=&state=&city=&dist=", "https://clinicaltrials.gov/ct2/show/NCT03794973", "https://clinicaltrials.gov/ct2/show/NCT04196140", "https://clinicaltrials.gov/ct2/show/NCT02744300", "https://clinicaltrials.gov/ct2/show/NCT03263351", "https://clinicaltrials.gov/ct2/show/NCT02726425?recrs=ab&cond=diabetes&cntry=US&rank=7", "https://clinicaltrials.gov/ct2/show/NCT03150199", "https://clinicaltrials.gov/ct2/show/NCT03593694", "https://clinicaltrials.gov/ct2/show/NCT03130699", "https://clinicaltrials.gov/ct2/show/NCT02717078", "https://clinicaltrials.gov/ct2/show/NCT02804932", "https://www.humann.com/getsuperbeets-2/?&gclid=Cj0KCQiAsdHhBRCwARIsAAhRhsl8ZMHujxezdSHJqDqb3R72cT1PoTRMq711HdRZEIlaj-rGtI56XE8aAsLQEALw_wcB", "#new-and-promising", "https://clinicaltrials.gov/ct2/show/NCT03646721", "https://clinicaltrials.gov/ct2/show/NCT03756688", "http://www.diabetes.org/", "https://www.cdc.gov/diabetes/index.html", "https://www.niddk.nih.gov/health-information/diabetes/overview/what-is-diabetes", "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "https://beyondtype1.org/", "https://goop.com/wellness/food-planet/the-guide-to-new-wave-sugars-sweeteners/", "https://goop.com/wellness/health/overcoming-sugar-addiction/", "https://doi.org/10.1002/14651858.CD003177.pub3", "https://doi.org/10.1126/science.aau2277", "https://doi.org/10.1371/journal.pone.0040427", "https://doi.org/10.1002/ptr.6512", "https://doi.org/10.1155/2016/9070537", "https://www.ncbi.nlm.nih.gov/pubmed/27820958", "https://www.aace.com/disease-state-resources/diabetes/recent-news-and-updates/omnipod-dash-insulin-management-system", "https://doi.org/10.2337/dc17-S010", "https://doi.org/10.2337/dc19-S003", "https://doi.org/10.2337/dc19-S005", "https://doi.org/10.2337/dc19-S007", "https://doi.org/10.2337/dc19-S009", "https://doi.org/10.3305/nh.2015.31.1.7597", "https://doi.org/10.2337/dc18-1475", "https://doi.org/10.3945/ajcn.114.098616", "https://doi.org/10.2337/dc08-1239", "https://doi.org/10.1111/j.1462-8902.2004.00315.x", "https://www.ncbi.nlm.nih.gov/pubmed/29650607", "https://doi.org/10.31024/ajpp.2018.4.3.16", "https://doi.org/10.2196/14087", "https://doi.org/10.1056/NEJMoa2004736", "https://doi.org/10.1056/NEJMoa1907863", "https://www.cdc.gov/media/releases/2019/p0529-diabetes-cases-decline.html", "https://www.cdc.gov/diabetes/data/statistics/statistics-report.html", "https://www.cdc.gov/diabetes/basics/getting-tested.html", "https://www.cdc.gov/diabetes/basics/symptoms.html", "https://www.cdc.gov/diabetes/basics/insulin-resistance.html", "https://doi.org/10.1210/jc.2018-02362", "https://doi.org/10.1615/IntJMedMushrooms.v21.i7.70", "https://doi.org/10.1016/j.cell.2017.01.040", "https://doi.org/10.1111/dme.13802", "https://doi.org/10.2337/dc16-1728", "https://doi.org/10.1111/dme.13595", "https://doi.org/10.1111/dme.14122", "https://doi.org/10.1038/s41591-019-0495-2", "https://doi.org/10.1056/NEJMoa012512", "https://doi.org/10.1016/S0140-6736(09)61457-4", "https://doi.org/10.3945/ajcn.117.155291", "https://doi.org/10.1136/openhrt-2015-000327", "https://doi.org/10.1007/s12011-019-01783-7", "https://doi.org/10.1371/journal.pmed.1002094", "https://doi.org/10.1136/bmj.k2139", "https://doi.org/10.1016/j.jand.2015.02.031", "https://doi.org/10.1093/ajcn/nqy048", "https://doi.org/10.2337/diabetes.53.9.2375", "https://doi.org/10.1124/jpet.118.249409", "https://doi.org/10.1073/pnas.76.1.106", "https://doi.org/10.3390/medicina55050138", "https://doi.org/10.1007/978-3-030-11815-0_2", "https://doi.org/10.1016/j.diabet.2015.03.010", "https://doi.org/10.1097/MD.0000000000002584", "https://doi.org/10.23736/S0391-1977.16.02505-0", "https://doi.org/10.1002/14651858.CD003205.pub2", "https://www.ncbi.nlm.nih.gov/pubmed/?term=PMID%3A+24861886", "https://doi.org/10.1080/21645515.2018.1450123", "https://doi.org/10.3390/ph11020055", "https://doi.org/10.1111/dom.13307", "https://doi.org/10.1111/j.1530-0277.1983.tb05403.x", "https://doi.org/10.1002/mnfr.201700438", "https://doi.org/10.1016/s0891-5849(99)00089-1", "https://doi.org/10.1684/mrh.2017.0425", "https://doi.org/10.1517/14656566.2015.1070827", "https://doi.org/10.4103/ijem.IJEM_556_17", "https://doi.org/10.3389/fendo.2018.00237", "http://1681–1688. https://doi.org/10.2337/dc17-1960", "https://doi.org/10.1007/s13668-017-0209-7", "https://doi.org/10.1038/s41598-020-74853-9", "https://doi.org/10.1146/annurev-med-042017-094221", "https://doi.org/10.1097/INF.0000000000001232", "https://doi.org/10.2165/00007256-200232010-00003", "https://doi.org/10.1530/EJE-19-0156", "https://doi.org/10.1507/endocrj.EJ18-0109", "https://doi.org/10.1007/s00125-018-4621-3", "https://doi.org/10.1093/ije/dyy173", "https://doi.org/10.1056/NEJMoa1212914", "https://doi.org/10.1186/s12944-018-0814-5", "https://doi.org/10.1007/s40264-016-0399-8", "https://www.mayoclinic.org/diseases-conditions/type-1-diabetes-in-children/symptoms-causes/syc-20355306", "https://www.mayoclinic.org/diseases-conditions/diabetic-ketoacidosis/symptoms-causes/syc-20371551", "https://www.mayoclinic.org/diseases-conditions/diabetes/diagnosis-treatment/drc-20371451", "https://www.mayoclinic.org/diseases-conditions/diabetes/symptoms-causes/syc-20371444", "https://doi.org/10.1016/j.jand.2016.09.021", "https://doi.org/10.2174/1573399812666160413115655", "https://doi.org/10.1016/j.nut.2018.04.010", "https://doi.org/10.1111/1440-1681.13144", "http://www.cfp.ca/content/55/6/591.abstract", "https://doi.org/10.1016/j.ctim.2019.01.002", "https://doi.org/10.1016/j.bioorg.2018.02.009", "https://www.niddk.nih.gov/health-information/diabetes/overview/diet-eating-physical-activity", "https://www.niddk.nih.gov/health-information/diabetes/overview/managing-diabetes/continuous-glucose-monitoring", "https://ods.od.nih.gov/factsheets/Thiamin-HealthProfessional/", "https://www.nih.gov/news-events/news-releases/artificial-pancreas-effectively-controls-type-1-diabetes-children-age-6", "https://doi.org/10.1080/03007995.2018.1497958", "https://doi.org/10.1186/s12933-018-0740-x", "https://doi.org/10.1016/j.jdiacomp.2017.11.001", "https://doi.org/10.1016/j.jacc.2017.12.014", "https://doi.org/10.1007/s40265-019-1057-0", "https://doi.org/10.1136/bmjdrc-2020-001319", "https://doi.org/10.1001/jamapediatrics.2018.4578", "https://doi.org/10.3389/fendo.2017.00229", "https://doi.org/10.2337/dc14-1005", "https://doi.org/10.1111/dme.13532", "https://doi.org/10.26355/eurrev_201805_15089", "https://doi.org/10.1136/gutjnl-2019-320005", "https://doi.org/10.1007/s00125-017-4342-z", "https://doi.org/10.1126/scitranslmed.3006103", "https://doi.org/10.2337/dc16-0236", "https://doi.org/10.1016/j.diabres.2018.02.026", "https://doi.org/10.1017/S0007114518000521", "https://doi.org/10.1002/da.22617", "https://doi.org/10.1016/j.phrs.2016.06.019", "https://doi.org/10.3389/fmolb.2018.00021", "https://doi.org/10.1113/JP276735", "https://doi.org/10.1177/0269881117728541", "https://doi.org/10.1111/dme.12240", "https://doi.org/10.2337/dc06-0531", "https://doi.org/10.1016/j.sajb.2018.01.007", "https://doi.org/10.2169/internalmedicine.46.1893", "https://doi.org/10.1111/dom.13164", "https://doi.org/10.1210/er.2019-00088", "https://doi.org/10.1016/j.stemcr.2018.12.012", "https://doi.org/10.1038/ejcn.2016.154", "https://doi.org/10.1007/s00394-018-1642-0", "https://doi.org/10.1093/ajcn/nqz041", "https://doi.org/10.1093/jn/nxx008", "https://doi.org/10.1007/s12325-018-0668-2", "https://doi.org/10.1038/s41551-019-0508-y", "https://doi.org/10.1016/S0140-6736(18)32590-X", "https://doi.org/10.3389/fphar.2019.00123", "https://doi.org/10.1097/MD.0000000000013149", "https://doi.org/10.1615/IntJMedMushrooms.v17.i10.50", "https://doi.org/10.1007/s11306-019-1565-7", "https://doi.org/10.1016/S2213-8587(18)30351-6"], "authors": [], "publish_date": "2021-08-12T13:01:05+00:00"}