{"result_id": "139012", "URL": "https://goop.com/wellness/parenthood/why-vaccines-save-kids-and-communities/", "timestamp": "2023-04-25 15:20:04 CEST+0200", "meta": {"description": "When a parent doesn’t vaccinate their child, they put their children—and their entire community—at risk. Learn why vaccinations save our kids and community.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/parenthood/why-vaccines-save-kids-and-communities/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Why Vaccinations Save Our Kids and Our Communities", "cleaned_text": "Why Vaccinations and Herd Immunity Save Our Kids and Our Communities\n\nThink of it as the greatest version of teenage rebellion: A growing number of young adults are going against their parents’ wishes and helping the larger community by getting vaccinated.\n\nJennifer Zavolinsky, MHS, a health educator and director at the public health organization Vaccinate Your Family, is surprised. Pleasantly so. As the children of anti-vax parents affected by the MMR controversy—a conspiracy theory triggered by a fraudulent and debunked article that was published in 1998—come of age, their medical care is legally in their own hands for the first time. And considering recent outbreaks of otherwise near-extinct diseases, many of these now adults are rattled by the risk their parents took with not only their own health but also that of their peers.\n\nWhen a parent doesn’t vaccinate their child, they put their children—and their entire community—at risk. This is because of something called herd immunity, explains Zavolinsky. And it’s part of why young, unvaccinated people are going in for their shots. Even if they don’t consider themselves likely to get sick with measles, mumps, rubella, chicken pox, or polio, remaining unvaccinated is a deadly risk to others—and a public health burden they don’t want to carry.\n\nSays Zavolinsky, it’s perfectly okay—encouraged even—to be curious and ask questions about anything related to your health. And it’s important to know where to find credible, reliable, science-backed information so you are empowered to make smart, informed decisions. It’s equally important to remember this: Vaccination works when we all work together.\n\nThere are a lot of kids from anti-vax families who are now getting themselves vaccinated as teenagers. How powerful is this in the bigger picture? As unvaccinated kids are getting older, hearing new voices apart from their parents’, and seeing news reports about vaccine-preventable outbreaks, they’re starting to do their own research on why and how to get vaccinated. We’re seeing a new pattern where, after they learn the science, these teens are making their own decisions about vaccination and their health. It’s extremely powerful. Teenagers are naturally inquisitive, and it’s completely natural for them to question what their parents tell them. We realize that vaccinating against their parents’ wishes is a huge decision. We know it’s difficult. And we give credit to these kids who are looking to follow science and do the right thing for their own health and the health of others.\n\nWhat is herd immunity? And why is it so important for the health of whole communities? Vaccine-preventable diseases are those infectious diseases that can travel quickly through a community and make a lot of people sick. But when there are enough people vaccinated against a certain disease, the germs can’t travel as easily from person to person. Therefore, the disease has fewer opportunities to spread. This means the entire community is less likely to get the disease. So the more people who are vaccinated in the community, the smaller the likelihood that others in the community will get the disease. This is known as herd immunity (or community immunity). That means people who don’t vaccinate themselves or their children are not only putting their family at risk but also increasing the risk of disease for other people. The limited number of vaccine-preventable disease cases that we have here in the United States now—even though we’re having outbreaks—is still relatively contained. But if we were to stop vaccinating, the number of cases could quickly become tens—or hundreds—of thousands every year. Some people mistakenly believe that they don’t need to vaccinate their family members because so many other people have had immunizations. But there are hundreds of thousands of people who don’t have full immunity for a number of reasons. When people don’t vaccinate, here’s whom they’re putting at risk—besides, of course, themselves: Young children. There are nearly 4 million children born in the US every year. Young children are not fully protected until they’ve received all of the recommended doses of each vaccine. And because their natural immunity is not yet built up, they’re extra vulnerable to communicable diseases. People with weakened immune systems. There are so many reasons why you might have a weakened immune system, and even if you’re vaccinated, that immunosuppressed state will leave you more vulnerable to infectious diseases. People with chronic health conditions, HIV, or cancer—especially those going through radiation and chemotherapy—are at a much-increased risk. Possibly anyone. Just like any other medication, no vaccine is 100 percent effective. That means there is a small number of people who get vaccinated but still don’t have full immunity, so they are vulnerable if they are exposed to the disease. If we maintain high vaccination rates, we protect ourselves, our families, and those in our communities who are more vulnerable to disease.\n\nHow is it decided which vaccines are made and added to immunization schedules? The vaccines we have now were created to fight some of the most dangerous diseases we know: polio, measles, flu, etcetera. Companies looking to develop a new vaccine have to consider the level of harm the disease is causing (or is going to cause), how many people it affects, and their ability to research and create the vaccine. Some diseases, like Zika, are simpler because we already have vaccines for similar infections. Others are more difficult; researchers have been trying to develop a vaccine for HIV for decades. Here’s how it happens in the US: It can take about fifteen to twenty years—sometimes longer—and approximately $1 billion for a company to develop and thoroughly test their vaccine before it gets licensed by the FDA and then approved by the Advisory Committee on Immunization Practices. Since vaccines are given to otherwise healthy children and healthy people, they are actually among the most rigorously tested and safest medical products on the market. Before a vaccine can be even considered for approval by the FDA, the vaccine manufacturer has to show that it’s a safe and effective vaccine with a preclinical stage and three stages of clinical trials. Then the FDA looks at the studies and determines whether the vaccine is safe, effective, and ready to be licensed for use. If they question any of the data from the clinical trials or think there might be some information missing, they ask the vaccine manufacturer to go back and find that information. Once the FDA is fully satisfied that there is enough scientific data proving the vaccine is safe, the vaccine goes through the Advisory Committee on Immunization Practices, a group of independent experts convened by the CDC. They review all the scientific evidence on safety and efficacy, and if they are satisfied, they decide whether they want to add it to the recommended immunization schedule. And once a vaccine is approved for use, it’s still monitored. There are four separate safety systems in the US that monitor vaccinations for any possible adverse reactions. That said, those reactions are usually not serious and typically affect a teeny subset of the population.\n\nWhat are the laws about vaccination? What rights do parents have if they find themselves in a situation where their child is exposed to unvaccinated kids? Vaccines are a requirement for public school enrollment in every state. Exemptions are made for those who have certain medical conditions, and most states allow either religious or philosophical exemptions. California, Mississippi, and West Virginia have the strictest regulations and do not recognize any exemptions but medical ones. Every year, advocates both for and against vaccines try to pass laws to tighten or loosen state vaccination requirements, which means the laws change often. For example, California allowed religious and philosophical (meaning personal belief) exemptions up until 2016, when the Disneyland measles outbreak prompted the California state legislature to pass SB 277, which removed the possibility of belief-based exemptions to school vaccine requirements. Unfortunately, parents don’t have legal rights if they find themselves in a situation where their child is exposed to unvaccinated children. Many states do have provisions in their vaccination laws that dictate that unvaccinated children be sent home from school during a disease outbreak. However, it varies state to state, and usually the government has rule over only public schools. Private schools, largely, can do their own thing. That means parents have to be really careful. If you know there are kids in your child’s school who are not vaccinated, keep your child away from them as much as possible, if you can.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Vaccinations Save Our Kids and Our Communities | goop", "description": "When a parent doesn’t vaccinate their child, they put their children—and their entire community—at risk. Learn why vaccinations save our kids and community.", "url": "https://goop.com/wellness/parenthood/why-vaccines-save-kids-and-communities/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2019-04-11T12:58:02+00:00", "article:modified_time": "2020-05-27T19:38:34+00:00", "updated_time": "2020-05-27T19:38:34+00:00", "image": "https://goop-img.com/wp-content/uploads/2019/04/48546119217_63174cef9f_o.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2019/04/48546119217_63174cef9f_o.jpg", "image:width": "900", "image:height": "686"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.vaccinateyourfamily.org/staff_board/jennifer-zavolinsky-mhs-ches/", "https://www.vaccinateyourfamily.org/", "https://www.cdc.gov/vaccines/index.html", "https://www.aap.org/en-us/advocacy-and-policy/aap-health-initiatives/immunizations/Pages/Immunizations-home.aspx", "https://www.who.int/topics/vaccines/en/", "https://www.acog.org/About-ACOG/ACOG-Departments/Immunization", "https://www.chop.edu/centers-programs/vaccine-education-center", "https://www.vaccinateyourfamily.org/questions-about-vaccines/", "https://www.vaccinateyourfamily.org/staff_board/jennifer-zavolinsky-mhs-ches/", "https://www.vaccinateyourfamily.org/"], "authors": [], "publish_date": "2019-04-11T12:58:02+00:00"}