{"result_id": "139035", "URL": "https://goop.com/wellness/health/the-autism-epidemic/", "timestamp": "2023-04-25 15:20:38 CEST+0200", "meta": {"description": "Seventy-five years ago, autism did not exist as a diagnosis. A few generations ago, children with autism were sent to institutions. Today, it’s estimated that 1 in 68 school-aged children have been diagnosed with autism, and it remains one of the least understood and most controversial conditions in every sense, from cause and effect to treatment.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/the-autism-epidemic/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "The Autism Epidemic", "cleaned_text": "Seventy-five years ago, autism did not exist as a diagnosis. A few generations ago, children with autism were sent to institutions. Today, it’s estimated that 1 in 68 school-aged children have been diagnosed with autism, and it remains one of the least understood and most controversial conditions in every sense, from cause and effect to treatment.\n\nWritten by Emmy Award-winning news correspondent John Donvan and Peabody Award-winning TV news journalist Caren Zucker—who have been covering autism together for fifteen-plus years—In A Different Key tells the important (and necessarily still incomplete) story of autism. One of those nonfiction narratives that reads like a novel, In A Different Key is told through the key players who have shaped the trajectory of autism, from the first child to be diagnosed with it, to the scientists and doctors who have defined the condition, to (in largest part) the parents who continue to fight so hard to make life better and more just for people with autism. The book serves as a reminder of how each of us (whether we realize it or not) has an enormous impact on the lives of others—and how profoundly we can affect the lives of people who are labeled or perceived as somehow different from us. Below, we ask the authors (one of whom is the parent of an autistic child) to speak to autism’s history—as well as its future.\n\nAs journalists, what about autism has captivated your attention for so long, and what made you want to tell the story of In a Different Key? ZUCKER: John and I had worked together for decades before we wrote In a Different Key. But in 1996, my son was diagnosed with autism, and a few years after, John and I started putting together a series at ABC, called Echoes of Autism. ABC was the first network to do anything like this on autism. The idea was to educate people about it—not to sensationalize, but to help people understand what the lives of people with autism (and their families’ lives) were like. About a half dozen years into doing this series, we knew we wanted to do something that was more enduring. We started looking further into the history of autism, and that’s how the book came to be. DONVAN: Looking at autism’s past, we found so many really dark stories—originally, children diagnosed with autism were sent to institutions—but we also saw how much had been overcome throughout the years by parents, activists, and organizations in support of children with autism. Looking at how far we have come inspired us. There are so many unsung heroes in the history of autism—we wanted to sing their praises and to share their stories so others could be inspired, too. Can you talk a little bit about the first diagnosis of autism in the 1940s? Do you think many people had autism before the term existed? DONVAN: We think, for sure, that there were people who lived before the first diagnosis of autism who had the traits that define autism today. If people from the 17th, 18th, 19th century could be examined today, some would likely be diagnosed with autism. Psychiatry can be arbitrary and inconsistent in how it connects dots—and with autism, the dots didn’t get connected until the 1930’s, into the 1940’s. The first person to be diagnosed with autism is named Donald Triplett, who is still alive today. He was born in 1933 and at the time presented unusual traits. A child psychologist in Boston named Leo Kanner looked at Donald and said he didn’t have mental illness—or feeble-mindedness, which was the term doctors would have used to describe Donald then. Kanner saw that Donald had a lot of intelligence. And that he had born with a disorder of social aptitude. Donald’s diagnosis was important because it was a matter of a doctor recognizing something different, and beginning to see what autism was and wasn’t. The great thing about Donald is that he has gone on to live a wonderful life in his small Mississippi town, where he is really cherished by the community there. This wasn’t the case for many others diagnosed with autism in these early days—but it’s one reminder of how friendship and acceptance can change someone’s life. Much of the book features the parents of autistic children who fought to raise awareness of autism and funding for research. What made their movement successful and is there more left to be done? ZUCKER: Many people forget that people who had autism and developmental disorders were once sent to institutions; it was parents who got together and changed the way society treated people with autism—who helped close down the institutions, who pushed for research to be done, who went to court to fight for their children’s right to go to school. Legal action was key, and an effective way to enact change. DONVAN: The other key ingredient was parental love—that’s what made these parents such fierce advocates for their children. One thing that’s interesting about this parent movement is that it happened before the internet and even before long-distance phone calls were common. It started in the 1960’s with a man named Bernard Rimland, whose son had been diagnosed with autism. Rimland’s job took him to different places around the country, and every time he had a trip, he would organize a meeting at a church, or maybe in a school basement. Rimland would put a little notice in the local newspaper beforehand, saying that he was going to be visiting and wanted to meet any parents in town who had kids with autism. From these gatherings, the first autism organization, the Autism Society of America, was born. They had a newsletter that kept all the parents connected. In 1965, they held their first annual meeting in Teaneck, New Jersey. People there said it was like they all fell on each other—being able to talk about a shared experience that other people didn’t get at the time. This is how they began to fight back against the isolation. ZUCKER: We’ve come really far in fighting isolation—especially for children with autism. But we’ve just started to touch the surface in supporting adults with autism—we really need to change the way we understand adults with autism and provide them with much better services and life options. [More on this coming.] How did the spectrum model of autism come about? Do you find it to be an effective way of thinking about autism, or is there potentially a better model? DONVAN: The spectrum idea was invented in the 1980’s by a British psychologist named Lorna Wing, who was a powerful thinker and a mother of an autistic child; she was writing about autism at a time when essentially no one else was. Through her own work, Wing became convinced that she was seeing people with varying degrees of the same traits. Rather than divide people with autism into separate categories (i.e. Asperger’s versus “classic” autism), she came up with the autism spectrum. Wing’s idea caught on in the mid to late ’90s and has become the dominant theory; people think it’s a hard fact. We believe the spectrum is just one way to look at autism, one way of categorizing autistic behaviors (many models have come and gone), and one that has its pluses and minuses. The spectrum has allowed people who would have been overlooked in the past—whose challenges weren’t previously seen as significant—to be diagnosed and get help. The downside is that it groups together people at the extreme ends of the spectrum who have very different realities and possibilities—from a nonverbal person who will wear a diaper for the rest of his/her life, to someone who is a brilliant mathematician with social challenges. And it’s not yet clear whether those two people have the same condition. This has created a lot of tension: On the one hand, there are people who see autism as a gift, as a piece of who they are, one they wouldn’t want to change. On the other hand, many parents of severely autistic children would embrace a cure if there could be one. ZUCKER: Time—and research—will help decide whether people at each end of the spectrum have the same traits, or if they are different, in which case the spectrum model could be replaced. How do you interpret rising rates of autism? Do they reflect changes in the definition of autism, societal factors, or are more children being born today with autism for some reason? DONVAN: The unsatisfying answer is: We don’t know. It is clear that there has been an increase in diagnoses. We do think that some portion of this increase is due to societal factors. The definition of autism has changed so much over the years—so we count diagnoses differently now. And the diagnosis process is so subjective—it’s essentially based on someone watching someone else’s behavior. But a large portion of the rising rate of autism cannot be explained by societal factors. And yet, we don’t know what could explain it. ZUCKER: This is where science is headed—figuring out what might cause autism. We know there is a genetic component, but we don’t know what factors might play into it. DONVAN: We know autism tends to run in families. And some research shows that autism may be linked to older fathers—but not everyone with autism has an older father. We also could be talking about many different causes of many different conditions that all look the same. We’re still far from knowing what causes autism. More boys are still diagnosed with autism than girls (about 4:1)—what might explain this? Does autism manifest differently in boys and girls? DONVAN: From 1933 until today, that 4:1 ratio has pretty much held—with negative consequences for girls with autism because the vast majority of the research has been on boys with autism simply because there are more of them. There are two ideas behind this: One is that maybe there really are more boys with autism than girls; studies are being done to try to find out what might make girls less likely to get autism and boys more vulnerable. Is it a DNA component, or something else? The other idea is the complete opposite, which is that girls simply aren’t diagnosed as often, and that their autism might be overlooked. This is a “hot topic” in the autism field right now, and a major focus of a conference we attended this spring at Princeton. One of the researchers (Kevin Pelphrey, Ph.D. of George Washington University) presented the case that there is boy autism and girl autism, and that they are not the same thing at all. Figuring out what might be the differences or similarities between girls and boys diagnosed with autism could be the key to really understanding autism and its causes. Has the autism vaccine scare had a lasting impact? DONVAN: Gigantic, and in many ways. On the one hand, it caused people to lose faith in science and eroded public trust in the vaccine program, which led to disease outbreaks that shouldn’t have happened (because parents weren’t having their children vaccinated). On the other hand, the vaccine scare got people’s attention and made them suddenly care about autism, now that it seemed like a condition that any child could get. In this sense, it was a public wake-up call, and the most powerful autism awareness campaign to date. Which available treatment methods are most effective? ZUCKER: Different forms of applied behavior analysis can be very effective, and ABA is the gold standard at the moment. People being cured of autism is unusual, but it doesn’t mean people can’t do extraordinarily well, or even possibly move off the spectrum. ZUCKER: Autism Speaks is a very good resource—especially for parents whose children have just been diagnosed with autism. They publish a lot of helpful guides, including practical ones on everyday life, like how to handle a first haircut. And their 100 Day Kit for families of newly diagnosed autistic children is an incredible tool. When my son was growing up, there wasn’t anything like that. DONVAN: The Autism Society, which is big and growing, is also a great resource. What resources exist for adults with autism? What resources should exist that don’t yet? ZUCKER: Adults is the sore spot. All of the kids we have diagnosed with autism are now grown up, or are soon-to-be grown-ups. And while there are pockets of excellence, few services exist for adults with autism. We need more programs that help adults with autism navigate society—particularly adults who fall somewhere on the middle of the spectrum. We’ve been working on a PBS NewsHour about one such emerging program called First Place in Phoenix, Arizona, a partnership with the Southwest Autism Research & Resource Center (SARRC). First Place will have three components: apartments for residents who span across the spectrum (as well as others who need a supported environment), a transition academy for those students working towards independence, and a Leadership Institute where educators will train, do research, and provide additional support. We also need to do more to make our communities accepting of, rather than hostile toward, adults with autism. And this is where we can all pitch in. What’s surprised you most during your research, and what’s the one thing everyone should know about autism? DONVAN: What surprised me when we started writing the book was that everyone who was using the word “autism” thought they were talking about the same thing. The meaning of autism and people’s understanding of it has been so vague throughout history. To have better conversations about autism, we need to realize that the definition and conception of the condition is still evolving. ZUCKER: A story we tell quite frequently is borrowed from an educator whom we interviewed for the book: A teenager who was pretty severely autistic was riding the bus one day. He was he was sitting in his seat, flicking his fingers in front of his face, swaying, and making noises. Two people on the bus started giving him a hard time: “What’s your problem?” they asked. Another guy on the bus stood up and turned to these two people and said: “He has autism. What’s your problem?” And then everyone else on the bus started getting behind the teenager with autism and the guy who stood up for him. Suddenly, the two people who were giving the teenager a hard time were the outcasts, and everyone else became a community. That bus is what we could do. We could have the backs of people who are different from us. We could stand up for them when they can’t stand up for themselves. Embrace them, accept them, welcome them into our workplaces, include them in our lives. People who have autism are people. They are, and deserve to be, a part of the larger community.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Autism Epidemic | goop", "description": "Seventy-five years ago, autism did not exist as a diagnosis. A few generations ago, children with autism were sent to institutions. Today, it’s estimated that 1 in 68 school-aged children have been diagnosed with autism, and it remains one of the least understood and most controversial conditions in every sense, from cause and effect to treatment.", "url": "https://goop.com/wellness/health/the-autism-epidemic/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "how to help a struggling kid", "article:section": "Do", "article:published_time": "2016-08-11T16:00:19+00:00", "article:modified_time": "2018-08-31T21:28:03+00:00", "updated_time": "2018-08-31T21:28:03+00:00", "image": "https://goop-img.com/wp-content/uploads/2016/08/Stocksy_txp5affc3f3Sc6100_Medium_277675_autism.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2016/08/Stocksy_txp5affc3f3Sc6100_Medium_277675_autism.jpg", "image:width": "820", "image:height": "625"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cdc.gov/media/releases/2016/p0331-children-autism.html", "http://amzn.to/2akEGlI", "http://inadifferentkey.com/bios/john-donvan-and-caren-zucker", "http://abcnews.go.com/WNT/video/echoes-autism-aspergers-syndrome-3009328", "http://www.autism-society.org/", "http://www.scientificamerican.com/article/autism-it-s-different-in-girls/", "https://www.autismspeaks.org/", "https://www.autismspeaks.org/docs/family_services_docs/100day2/100_Day_Kit_Version_2_0.pdf", "http://www.autism-society.org/", "http://www.pbs.org/newshour/", "http://firstplaceaz.org/", "http://www.autismcenter.org/", "https://www.facebook.com/Goop", "https://twitter.com/goop", "https://instagram.com/goop", "https://www.youtube.com/user/goop", "http://www.pinterest.com/goop/", "https://play.spotify.com/user/gooptunes?play=true&utm_source=open.spotify.com&utm_medium=open"], "authors": [], "publish_date": "2016-08-11T16:00:19+00:00"}