{"result_id": "139019", "URL": "https://goop.com/wellness/health/an-epidemiologist-on-covid-19-immunity-and-vaccines/", "timestamp": "2023-04-25 15:20:15 CEST+0200", "meta": {"description": "Infectious disease epidemiologist Jessica Malaty Rivera, MS, wants us all to understand the novel coronavirus. She’s made it her job: She’s the science communications lead at The COVID Tracking Project, where she talks regularly about how we can make informed decisions and manage risks. Which makes her the first person we asked to talk to when we wanted to know: What’s the state of the pandemic now, and what’s next?", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/an-epidemiologist-on-covid-19-immunity-and-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "COVID-19 Immunity, Vaccines, and What Comes Next", "cleaned_text": "COVID-19 Immunity, Vaccines, and What Comes Next\n\nCOVID-19 Immunity, Vaccines, and What Comes Next Infectious disease epidemiologist Jessica Malaty Rivera, MS, wants us all to understand the novel coronavirus. She’s made it her job: As the science communications lead at The COVID Tracking Project, which provides the most complete data we have in the United States on COVID-19 testing, cases, hospitalizations, and outcomes, Rivera talks regularly about how we can make informed decisions and manage risks. She wants us all to be asking questions, and she discusses the biggest ones every Friday on Instagram. When an outlet or group manipulates data to tell a misleading narrative or seeds misinformation about the virus or vaccines, Rivera dispels it with solid and complete data. Which makes her the first person we asked to interview when we wanted to know: What’s the state of the pandemic now, and what’s next?\n\nHow would you say the pandemic is different now from when the WHO first declared COVID-19 a pandemic in March 2020? The pandemic has changed since March, but it’s also still the same in many ways. It’s changed in the sense that we are better equipped to respond to COVID-19 cases. We are caring for patients better in hospitals and increasing positive outcomes in hospitalized cases. We’re further along in vaccine development, too. It has not changed in the sense that we are still in the first wave of this pandemic. For a wave to end and another to begin, there must be a significant low point between surges. We haven’t had that. If you look at the case count data, the United States is trending like a wave that’s fluctuating, and we’re in the third increased fluctuation. In the US, our death numbers have never returned to a normal baseline rate between surges as they have in many other countries. We’re in this third surge at a time when we can expect viral respiratory infections to grow in prevalence because more people are indoors and more people are congregating because of the holidays. It’s the perfect storm for things to go really badly.\n\nWhat have the last nine months taught us about the virus itself and how we can best protect ourselves and our communities? The coronavirus that causes COVID-19, SARS-CoV-2, is a novel virus. We have not seen it before. So even though we are nine months into this pandemic, there are still a lot of unknowns. And because of that, we can’t make any long-term conclusions about immunity. We can’t even make any long-term conclusions about recovery. Recovery: We don’t know what the long-term effects of this disease are. And that’s one of the most confounding and frightening factors of this pandemic. Time is the only way we will be able to determine what it looks like to be a fully recovered COVID-19 patient and whether there are any residual effects. Mutations: We know that the virus is mutating at a very slow rate. It’s not changing a lot. That’s good: Potential vaccines are not going to be outpaced by any viral mutation. Mutations have gotten a bad rap because you get these Hollywood images of things getting completely out of control. Really, mutations are an incredibly normal and expected process in how viruses replicate. A great way to think about mutations in viruses is that they’re like typos: Many times, you’re typing fast and a typo changes the spelling of a word a little bit, but it doesn’t dramatically change the meaning of the sentence. The same is true in a virus: A slight mutation during replication doesn’t necessarily mean the virus changes in a meaningful way. “Apart from public health mitigation efforts, we are dependent on a vaccine to prevent infections.” Immunity and reinfection: Based on the data we have, we can presume that it’s pretty unlikely somebody would get reinfected with the virus within ninety days of their first infection, but we have seen cases of reinfection. They are very few and far between, but reinfection is not impossible. The reason it isn’t impossible is because there is no blanket post-infection situation. Not everybody’s immune response is the same. Some people may not develop long-lasting antibodies, and they will be in a position of vulnerability. Some people may develop some antibodies and still get reinfected. Also, antibodies aren’t the only measurement of an immune response. We have to consider T cell and B cell responses as well, which can vary. Here is the difference with vaccination: Vaccines tend to produce robust long-term immune responses. The only way to establish herd immunity is through vaccination. It’s entirely inappropriate to be using the term “herd immunity” outside of a vaccination campaign.\n\nWhy should people get a vaccine when one becomes available to them? This is a novel virus, and we cannot rely on any current medications to prevent the disease absolutely. It’s a virus; you can’t give it antibiotics. We have no other prophylaxis. Apart from public health mitigation efforts, we are dependent on a vaccine to prevent infections. It’s important that everybody gets the vaccine in order to establish herd immunity. Also: Our regulatory system is incredibly robust. Our standards for safety and efficacy are excellent, and they have not been sacrificed for the purpose of expedience. Full stop. “If multiple vaccines are available, it will be because the FDA has determined that each of them is safe and effective for use.” What’s happened that’s made vaccine development go faster is that we’ve created a much more efficient system that’s cut through a lot of unnecessary red tape. We’ve had unprecedented global cooperation, vaccine trials have been generously financed to prevent delays in advancing through the clinical phases, and we weren’t starting from scratch. We had years of research and early data from SARS and even influenza. So in many ways, we had a running start. That’s why this has been moving so fast compared to a normal vaccine development process. That is encouraging: It shows us that our government is valuing science and prioritizing doing this in a way that can help people in a public health emergency as soon as possible.\n\nWhen we have a vaccine, what comes next? A vaccine will not be a panacea. It will not solve all our problems and make everything go back to normal immediately. There are a number of factors that need to be considered when we’re thinking about the vaccine and the end of the pandemic.\n• 1. If, in an ideal scenario, we get a vaccine approved by the end of this year and prioritize distribution to populations that are at high risk—frontline health care workers, older people, people who live in long-term care facilities, people with comorbidities that put them at a risk for severe outcomes—followed by good distribution to the general public, that puts us at next spring or early summer at the earliest that we would have an adequately immunized population. The pandemic doesn’t immediately end when the vaccine is approved.\n• 2. The vaccines that are at the front of the race so far seem to be two-dose vaccines. Think about the logistics: We’re talking about everybody getting the first dose of the vaccine, going home—still exercising caution through mask wearing and physical distancing—and then four weeks later going back for the second dose. All of that has to go smoothly.\n• 3. When we’re talking about good vaccine distribution, remember that good distribution requires the majority of people (somewhere around 70 percent) to get the vaccine. From the surveys we have so far, up to 40 percent of people are already planning to opt out of a vaccine that hasn’t yet become available and hasn’t even had a chance to be approved by the FDA. That vaccine hesitancy is directly connected to the incredible amount of misinformation about COVID-19 vaccines—and about vaccines in general—that is persistent in the US. So far, these vaccines have proven to be effective at preventing severe illness. But it’s still possible that people could get mild or asymptomatic infections and potentially transmit it to others. We will likely be wearing masks and practicing physical distancing well into 2021 as we work toward decreasing disease transmission and increasing vaccination. Only then can we start to ease up on some of the public health mitigation efforts.\n\nWho is lower on the list for vaccine eligibility? Right now, it’s probably children. Children are still not at the greatest risk for severe disease, which is informing the prioritization of who gets the vaccine and in what order. (“Children” technically means anyone under eighteen. Pediatric data is so complicated: Often, it’s not stratified by age group. So when you’re looking at pediatric cases of COVID-19, sometimes the age grouping is zero to seventeen, which makes it difficult to give specific recommendations for schools and families. High school students tend to fare very similarly to adults, but we’ve definitely seen severe outcomes in children and young adults.) Before we are able to vaccinate children, we need safety and efficacy data to inform that decision. We haven’t yet tested any pediatric COVID-19 vaccines, so we don’t have clinical data on COVID-19 vaccine outcomes in children. On December 2, Moderna listed its pediatric vaccine clinical trial on clinicaltrials.gov. It hasn’t started enrollment, but I’m excited to see that the process has started. These pediatric trials are a great next step.\n\nWhat do we need to know about our health care infrastructure right now? The pandemic is stressing the US health care system in a way that the system hasn’t been stressed before. Right now, all eyes are on health care infrastructure: We cannot risk it straining or, god forbid, collapsing. This goes back to early in the pandemic when we were talking about flattening the curve. We can’t expect patients to have the good outcomes that I was talking about earlier if we don’t have enough beds, ventilators, or doctors—or enough PPE to protect the people who need to go see patients. We’re dealing with serious personnel shortages in hospitals. That is terrifying. Hospitals are filling up and running out of the staff they need to take care of the patients. I’ve heard reports of nurses being flown in from New Orleans to help alleviate the burdens in Midwest hospitals. It’s an extremely dangerous thing when your staff is not large enough to deal with surging admissions or when staff themselves are getting sick and dying. There are a number of states, like North Dakota, that are having health care workers who are COVID-positive but asymptomatic continue to work. That’s the situation we’re in: We can’t risk being short-staffed, but now asymptomatic health care workers who can and do spread the virus to others are being asked to continue working.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Immunity, Vaccines, and What Comes Next | goop", "description": "Infectious disease epidemiologist Jessica Malaty Rivera, MS, wants us all to understand the novel coronavirus. She’s made it her job: She’s the science communications lead at The COVID Tracking Project, where she talks regularly about how we can make informed decisions and manage risks. Which makes her the first person we asked to talk to when we wanted to know: What’s the state of the pandemic now, and what’s next?", "url": "https://goop.com/wellness/health/an-epidemiologist-on-covid-19-immunity-and-vaccines/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-12-10T12:59:16+00:00", "article:modified_time": "2020-12-10T15:47:47+00:00", "updated_time": "2020-12-10T15:47:47+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/12/COVID-19-Immunity-Vaccines-and-What-Comes-Next-Stocksy_txp25b7eb807yu200_Medium_3205757.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/12/COVID-19-Immunity-Vaccines-and-What-Comes-Next-Stocksy_txp25b7eb807yu200_Medium_3205757.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://covidtracking.com/", "https://www.instagram.com/jessicamalatyrivera/", "https://goop.com/wellness/parenthood/why-vaccines-save-kids-and-communities/", "https://www.nytimes.com/2020/12/02/health/Covid-Moderna-vaccine-children.html", "https://goop.com/wellness/health/how-to-boost-your-immune-system/", "https://covidtracking.com/"], "authors": [], "publish_date": "2020-12-10T12:59:16+00:00"}