{"result_id": "139023", "URL": "https://goop.com/wellness/detox/gwyneth-paltrows-long-term-detox-tips/", "timestamp": "2023-04-25 15:20:22 CEST+0200", "meta": {"description": "“All jokes aside (no, 2021 wasn’t the easiest year to do dry January), cleaning up my diet, exercise, and even thought patterns last month left me feeling energized, healthier, and—believe it or not—wanting more,” says GP. “With the help of functional medicine practitioner Dr. Will Cole and his about-to-be-in-stores book, I’m extending my focus on what I’m putting in and on my body further, through the full first quarter.”", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/detox/gwyneth-paltrows-long-term-detox-tips/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "GP’s Picks: Healing My Body with a Longer-Term Detox", "cleaned_text": "Editor’s note: This is one person’s story and recounts an individual experience. It is not meant to be a diagnosis for healing or treating any specific disease, symptoms, or side effects.\n\nAll jokes aside (no, 2021 wasn’t the easiest year to do dry January), cleaning up my diet, exercise, and even thought patterns last month left me feeling energized, healthier, and—believe it or not—wanting more. I’m extending this focus further, through the full first quarter.\n\nA little background: I had COVID-19 early on, and it left me with some long-tail fatigue and brain fog. In January, I had some tests done that showed really high levels of inflammation in my body. So I turned to one of the smartest experts I know in this space, the functional medicine practitioner Dr. Will Cole. After he saw all my labs, he explained that this was a case where the road to healing was going to be longer than usual.\n\nSo we’ve been doing a version of a protocol he outlines in his forthcoming book, Intuitive Fasting. It’s keto and plant-based but flexible (I’ve been having fish and a few other meats), and I fast until 11 a.m. every day. Now, I’m accustomed to cleanses—like the straight-up six-day bone broth cleanse from OWL Venice I did in January—but something that’s more freewheeling like Will’s plan has definitely been more of an adjustment. So I’ve been cooking a lot, and some of it is really delicious: I made scallops with crispy capers and sage the other day, asparagus with bacon vinaigrette, and some little artichokes with stuffed herbs and garlic. I’ve even found a great sugar-free kimchi (Madge’s vegan daikon kimchi—it’s amazing) and a sugar-free kombucha, and I’ve been using lots of coconut aminos in my recipes. Will gives you the guidelines and lots of recipes, but you do steer yourself a bit more, and I’m hoping that helps me form some lasting habits.\n\nThere’s no sugar, and of course no alcohol, so I’ve been doing major research and finding some great stuff to support what I’m doing. One of my favorites is Seedlip—the incredible herbal nonalcoholic cocktails really scratch that end-of-day itch (or the I-need-something-sophisticated-with-dinner itch, or the something-in-front-of-a-roaring fire one, or the laughing-with-girlfriends one) for me. There are three flavors (I especially love Garden 108), and all are sugar-free with no calories. I like it in a diamond-patterned double old-fashioned glass, with lemon and a splash of sparkling water. It’s so good.\n• In partnership with our friends at Seedlip\n\nWill’s also got me on supplements, most of them in service of a healthier gut: There’s butyrate, which Will says supports a healthy microbiome, and then in my daily Madame Ovary supplement, I get fish oil, B vitamins, some vitamin D3 (I add more, but there’s 500 IU in there to start), selenium, and zinc, all of which Will says are critical for me right now. I get even more zinc and selenium, along with the antioxidants vitamin C and resveratrol, in my G.Tox Detoxifying Superpowder, which I mix with water. Will has me taking the G.Tox morning and night.\n• Everything I’m doing feels good, like a gift to my body. I have energy, I’m working out in the mornings, and I’m doing an infrared sauna as often as I can, all in service of healing. A side benefit is my skin, which makes me happy—and makes me want to double down on skin care even more. Let’s make 2021 the year of never needing makeup, people!\n• I see a real difference when I use vitamin C serum in the mornings—a difference in glow. It’s noticeable enough that people have asked me what I’m using, and this is over Zoom!\n• The secret formula—for my skin, anyway—is to combine the vitamin C (smooth it in, then wait a beat) with our new face oil. I’ve always been into oils, but this one’s got amazing clinical results: You see fewer wrinkles, firmer skin, softer skin. But layer it on over the vitamin C serum and I’m telling you, the glow is next-level. Do that every morning and your skin is going to look great no matter what.\n• Then the foundation that makes it all work—always—is my super powerful once-a-week (I do it on Sunday nights) 15% glycolic acid peel. And right now it’s even more important, in the absence of being able to get to the dermatologist or the facialist. You swipe the peel onto clean skin and go to bed, and you’ve taken care of your skin for a whole week—you wake up, wash your face, and check out your skin in the mirror. Worth it!\n• Moving your body and sweating out toxins makes an enormous difference, of course. But beyond the benefits of a sauna and even my favorite workouts, when I go for a hike, I know I’m getting something different—stimulating my brain and body in ways I can’t get otherwise. Nature heals, really! I’m obsessed with Hoka boots, especially this pair.\n• I love to wear something that’s easily layerable and (important) can transition to a Zoom call if I end up spending more time hiking than originally planned (guilty), like this sleek tank.\n• The necklace is just me. I can’t go out without a necklace. I love to wear several at once, but for a hike, just this one is perfect. And it gives me a little bit of polish for that Zoom call I’m late for.\n• This T-shirt is my favorite thing. I dress it up, dress it down—I wear it all the time\n• Last of all, I’m reaching out to the people I’m not seeing every day. It’s almost been a year; we all need some encouragement to keep going—and to keep going on a healthier path. This wellness care package has liposomal vitamin C, herbal tea, and manuka honey, along with one of the more incredible memoirs you’ll ever read and some fantastic essential oil blends. I’ve been sending it off to just about everybody I can think of—it’s such a nice present to unwrap.\n• If a full care package doesn’t work with the budget, this bath is another of my favorite presents to send with a similar sentiment.\n• Bonus: What’s Back in Stock on goop \n\n(That I Could Not Be More Excited About)\n• These babies really work—that’s all I can say. And they taste like the best chocolate mint ever. I can start having them when I begin easing up on the protocol, and I cannot wait. goop Wellness Knock Me Out goop, $55 for 60 chews/$30 for 30 chews\n• This is magic for your pores. I use it in the shower every morning: It’s a foamy, fresh combination of malachite and fruit acids that sweeps everything away and leaves my skin baby-soft and—not kidding—practically poreless.\n\nWe hope you enjoy the products recommended here. Our goal is to suggest only things we love and think you might, as well. We also like transparency, so, full disclosure: We may collect a share of sales or other compensation if you purchase through the external links on this page.\n\nThis article is for informational purposes only. It is not, nor is it intended to be, a substitute for professional medical advice, diagnosis, or treatment and should never be relied upon for specific medical advice. To the extent that this article features the advice of physicians or medical practitioners, the views expressed are the views of the cited expert and do not necessarily represent the views of goop.", "opengraph": {"locale": "en_US", "type": "article", "title": "GP’s Picks: Healing My Body with a Longer-Term Detox | goop", "description": "“All jokes aside (no, 2021 wasn’t the easiest year to do dry January), cleaning up my diet, exercise, and even thought patterns last month left me feeling energized, healthier, and—believe it or not—wanting more,” says GP. “With the help of functional medicine practitioner Dr. Will Cole and his about-to-be-in-stores book, I’m extending my focus on what I’m putting in and on my body further, through the full first quarter.”", "url": "https://goop.com/wellness/detox/gwyneth-paltrows-long-term-detox-tips/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2021-02-16T12:49:36+00:00", "article:modified_time": "2023-04-12T21:04:53+00:00", "updated_time": "2023-04-12T21:04:53+00:00", "image": "https://goop-img.com/wp-content/uploads/2021/02/Seedlip-GP’s-Picks-Healing-My-Body-with-a-Longer-Term-Detox-20200709_EDITORIAL_FASHION_JUNE-GLABEL-CORE_IMG-1845.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2021/02/Seedlip-GP’s-Picks-Healing-My-Body-with-a-Longer-Term-Detox-20200709_EDITORIAL_FASHION_JUNE-GLABEL-CORE_IMG-1845.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/de-en/g-label-goop-university-t-shirt/p/", "https://bookshop.org/a/3543/9780593232330", "https://bookshop.org/a/3543/9780593232330", "https://www.madgesfood.com/product/vegan-kimchi-no-sugar-cabbage/", "https://bookshop.org/a/3543/9780593232330", "https://goop.com/seedlip-garden-108/p/", "https://www.seedlipdrinks.com/en-us/shop/seedlip-special-offer-trio/", "https://goop.com/richard-brendon-diamond-double-old-fashioned/p/", "https://goop.com/vitamins-and-supplements/c/", "https://goop.com/wellness/health/butyrate-supplements-for-gut-health/", "https://goop.com/goop-wellness-madame-ovary/p/", "https://goop.com/goop-beauty-g-tox-detoxifying-superpowder/30-pack/p/", "https://goop.com/hum-nutrition-here-comes-the-sun-high-potency-vitamin-d3/p/", "https://goop.com/higherdose-infrared-sauna-blanket-v3/p/", "https://goop.com/goop-beauty-goopglow-20-vitamin-c-hyaluronic-acid-glow-serum/p/", "https://goop.com/goop-beauty-goopgenes-all-in-one-super-nutrient-face-oil/30-ml/p/", "https://goop.com/goop-beauty-goopglow-15-glycolic-acid-overnight-glow-peel/12-pack/p/", "https://goop.com/hoka-one-one-kaha-high-gore-tex-hiking-shoes/p/", "https://goop.com/g-label-anastasia-racerback-tank/p/", "https://goop.com/foundrae-wholeness-medallion-and-gemstone-heart-necklace/p/", "https://goop.com/de-en/g-label-goop-university-t-shirt/p/", "https://goop.com/goop-wellness-box/p/", "https://goop.com/goop-beauty-nurse-under-the-weather-bath-soak/p/", "https://goop.com/goop-wellness-knock-me-out/60-chews/p/", "https://goop.com/goop-beauty-g-tox-malachite-fruit-acid-pore-purifying-cleanser/5-fl-oz/p/"], "authors": [], "publish_date": "2021-02-16T12:49:36+00:00"}