{"result_id": "139026", "URL": "https://goop.com/the-ensemble-book-club/", "timestamp": "2023-04-25 15:20:26 CEST+0200", "meta": {"description": "Back to Current Book JOIN THE CONVERSATION We share more in our new book club group on Facebook. Connect goop Your Inbox Sign up for our newsletter Sign", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/the-ensemble-book-club/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Book Club June21 Spinoff", "cleaned_text": "How did the idea for The Ensemble come to you? I’d always wanted to write about a string quartet, but I didn’t know what the anchor of the story would be. It wasn’t until I landed on the Brit and Daniel relationship that I saw, Okay, this is a love story. I felt comfortable with that. And then as I wrote, I slowly realized, Oh, this whole thing is a love story. You have to fall into a kind of love with people you work with in this way, as long-term artistic collaborators. That’s when the book really took off. What was it like being a competitive musician growing up? Honestly, horrible! I hated that part of it. I wasn’t good at competing. I choked. I loved playing by myself or playing in a group. But I always psyched myself out and panicked at competitions or auditions. That’s part of what propelled me through The Ensemble—I was writing about scenarios that terrified me. Putting these characters in high-stakes professional situations and matching that with personal-life drama kept the story alive for me as I figured it out. Did you have a playlist that you listened to while writing the book? I listened closely to all the pieces that feature in the book, and I made a Spotify playlist of them. But when I needed noise that wasn’t a part of the book, I would listen to these Handel suites for keyboard by jazz pianist Keith Jarrett. They’re so simple and mathematical that it was easy to tune in and out of them. Tell us about “Little Fish.” “Little Fish”! It’s a short story I wrote a long time ago about a global pandemic that affects the population with memory loss. A feature film adaptation of it was made in early 2019, before COVID, and was released this past February. Though I had absolutely nothing to do with the film’s production, I’m super proud to be associated with it. Awesome script by Mattson Tomlin, tender direction by Chad Hartigan, and a truly incredible lead performance by Olivia Cooke. Rent it now! But have tissues ready. It’s a sad one. Will you share some nail-art looks and inspiration? I’m so glad you asked. @topknotnails and @asabree are incredible nail artists in Portland whom I love. Here in LA, I go to @nailsby_Kana, a Japanese nail artist who does really pretty and detailed work. As a freshly vaccinated person, I cannot wait to go back to her to get a manicure. Side note: Manicures became a part of my life only after I stopped playing cello, because I always had to keep my nails sooooo short to play. My first meal after I gave birth this past February was the spicy vodka fusilli and chocolate cake from Jon & Vinny’s. But also: Suehiro in Little Tokyo for Japanese comfort food, like tonkatsu or donburi. The ricotta pancakes from Little Dom’s. Burritos from El Zarape. A sandwich named after Terry Gross at Wax Paper. Shakshuka from Republique. The burger at All Time. I could go on. The food in LA is *chef’s kiss*. What are your favorite books about friends? I will always and forever admire A Little Life by Hanya Yanagihara. The Group by Mary McCarthy is a must-read. And most recently, Sally Rooney’s Conversations with Friends, the adaptation of which I am so excited to watch.\n\nDid you have a playlist that you listened to while writing the book? I listened closely to all the pieces that feature in the book, and I made a Spotify playlist of them. But when I needed noise that wasn’t a part of the book, I would listen to these Handel suites for keyboard by jazz pianist Keith Jarrett. They’re so simple and mathematical that it was easy to tune in and out of them. Tell us about “Little Fish.” “Little Fish”! It’s a short story I wrote a long time ago about a global pandemic that affects the population with memory loss. A feature film adaptation of it was made in early 2019, before COVID, and was released this past February. Though I had absolutely nothing to do with the film’s production, I’m super proud to be associated with it. Awesome script by Mattson Tomlin, tender direction by Chad Hartigan, and a truly incredible lead performance by Olivia Cooke. Rent it now! But have tissues ready. It’s a sad one. Will you share some nail-art looks and inspiration? I’m so glad you asked. @topknotnails and @asabree are incredible nail artists in Portland whom I love. Here in LA, I go to @nailsby_Kana, a Japanese nail artist who does really pretty and detailed work. As a freshly vaccinated person, I cannot wait to go back to her to get a manicure. Side note: Manicures became a part of my life only after I stopped playing cello, because I always had to keep my nails sooooo short to play. My first meal after I gave birth this past February was the spicy vodka fusilli and chocolate cake from Jon & Vinny’s. But also: Suehiro in Little Tokyo for Japanese comfort food, like tonkatsu or donburi. The ricotta pancakes from Little Dom’s. Burritos from El Zarape. A sandwich named after Terry Gross at Wax Paper. Shakshuka from Republique. The burger at All Time. I could go on. The food in LA is [chef’s kiss]. What are your favorite books about friends? I will always and forever admire A Little Life by Hanya Yanagihara. The Group by Mary McCarthy is a must-read. And most recently, Sally Rooney’s Conversations with Friends, the adaptation of which I am so excited to watch.", "opengraph": {"locale": "en_US", "type": "article", "title": "Book Club June21 Spinoff | goop", "description": "Back to Current Book JOIN THE CONVERSATION We share more in our new book club group on Facebook. Connect goop Your Inbox Sign up for our newsletter Sign", "url": "https://goop.com/the-ensemble-book-club/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "image": "https://goop-img.com/wp-content/uploads/2021/06/Paperback-Cover-1-1.png", "image:secure_url": "https://goop-img.com/wp-content/uploads/2021/06/Paperback-Cover-1-1.png", "image:width": "352", "image:height": "532"}, "tags": [], "tweets": [], "movies": [], "links": ["https://open.spotify.com/playlist/13CNn7Wm5ms7ILhCtkmzcg?si=Op5zj8crSmuFld_z2Uv0cg", "https://www.instagram.com/topknotnails/?hl=en", "https://www.instagram.com/asabree/?hl=en", "https://www.instagram.com/nailsby_kana/?hl=en", "https://goop.com/place/california/los-angeles/west-hollywood-restaurants/jon-vinnys/", "https://www.suehirocafe.com/", "https://goop.com/place/california/los-angeles/los-feliz-restaurants/little-doms/", "https://elzarapemelrose.com/", "https://goop.com/place/california/los-angeles/frogtown-specialty/wax-paper/", "https://goop.com/place/california/los-angeles/hancock-park-restaurants/republique/", "https://goop.com/place/california/los-angeles/los-feliz-restaurants/all-time/", "https://bookshop.org/a/3543/9780804172707", "https://bookshop.org/a/3543/9780156372084", "https://bookshop.org/a/3543/9780451499066", "https://www.instagram.com/topknotnails/?hl=en", "https://www.instagram.com/asabree/?hl=en", "https://www.instagram.com/nailsby_kana/?hl=en", "https://goop.com/place/california/los-angeles/west-hollywood-restaurants/jon-vinnys/", "https://www.suehirocafe.com/", "https://goop.com/place/california/los-angeles/los-feliz-restaurants/little-doms/", "https://elzarapemelrose.com/", "https://goop.com/place/california/los-angeles/frogtown-specialty/wax-paper/", "https://goop.com/place/california/los-angeles/hancock-park-restaurants/republique/", "https://goop.com/place/california/los-angeles/los-feliz-restaurants/all-time/", "https://bookshop.org/a/3543/9780804172707", "https://bookshop.org/a/3543/9780156372084", "https://bookshop.org/a/3543/9780451499066"], "authors": [], "publish_date": null}