{"result_id": "139002", "URL": "https://goop.com/wellness/health/the-new-thinking-on-allergies/", "timestamp": "2023-04-25 15:19:45 CEST+0200", "meta": {"description": "We’ve been following the rise in allergies and are always on the lookout for new research and the accompanying viable treatment options. Dr. Sharon Chinthrajah at Stanford’s Sean N. Parker Center for Allergy and Asthma Research, is a prominent clinician who’s also at the forefront of promising research on food allergies.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/the-new-thinking-on-allergies/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "The New Thinking On Allergies", "cleaned_text": "We’ve been following the rise in allergies (see this goop piece on the epidemic with Dr. Leo Galland), and are always on the lookout for new research and the accompanying viable treatment options. Dr. Sharon Chinthrajah, at Stanford’s Sean N. Parker Center for Allergy and Asthma Research, is a prominent clinician who’s also at the forefront of promising research on food allergies. Her work revolves around the connections between food allergies, environmental allergies, and asthma, as well as the root causes of these types of problems—and, ultimately, what we can do about them. Below, she overturns persistent myths and shares the latest thinking—starting with the once-radical idea that introducing more foods (like peanuts) to our kids earlier on may actually be beneficial. (And if you’re on the lookout for allergen-free, kid-friendly recipes, read this goop piece next.)\n\nWhere are most food allergies thought to stem from? And at what age do they typically develop?\n\nMany factors cause food allergies, likely involving many genes in combination with lifestyle and environmental factors. We do believe that there is a critical time period during fetal, infant, and adult development during which the immune system can be programmed to become allergic. Genes interact with the environment, affecting the natural course of allergic disease.\n\nSeveral investigations have shown that the avoidance of certain substances—pollution, highly-processed foods, arsenic-containing foods, and smoking, among others—during pregnancy and infancy can decrease the risk of allergies and asthma later in life. Other potential causes may also translate to prevention leads—including vitamin D, exposure to animals, and changes to an individual’s microbiome.\n\nMost food allergies are diagnosed during childhood, but many patients develop allergies as adults. The rate of people diagnosed with food allergies has doubled over the last ten years.\n\nWhat’s the best way (medical test or otherwise) to diagnose a food allergy? Do you see new tests existing in the future? The gold standard to diagnose a food allergy is a combination of patient history of reaction, skin prick tests, blood tests that measure specific IgE levels, and a food challenge in the doctor’s office. There are also newer component tests for a few allergens, including peanuts, that can help to distinguish between the risk of a minor oral reaction vs. a life-threatening systemic response. But most families with food allergies are usually left with ambiguous information; current diagnostics for food allergies and asthma have limitations. Very importantly, there’s no commercially available test to determine when an allergy resolves permanently. There are potentially better predictive diagnostics on the horizon that may capitalize on skin testing with microneedles or blood tests, which would measure a combination of peripheral basophils, antibodies, T cell receptors, peptides, or DNA methylation, all integral in the mechanisms of food allergy. But these may still be years away. Traditional wisdom has been not to introduce too many (or certain kinds of) foods to kids when they are young. Can you talk a bit about more current research that suggests otherwise? Are there certain foods that parents should be feeding to infants or toddlers that we commonly shy away from? Yes, the guidelines have flip flopped for more than a decade—understandably confusing for parents. But recently there has been a rapid and significant reaction to the landmark LEAP, LEAP-ON, and EAT studies within the medical community. For instance, the American Academy of Allergy, Asthma and Immunology Consensus Communication on Early Peanut Introduction and the Prevention of Peanut Allergy in High-Risk Infants states: “The LEAP data provide Level 1 evidence that the practice of early peanut introduction is safe and effective in selected high risk infants…” The American Academy of Pediatrics modified their long-standing recommendations to endorse early introduction of food after the robust data from these studies. More data has begun to emerge supporting early introduction of egg, cow’s milk, etc.—and studies are ongoing. However, we still have to be mindful of choking hazards when introducing foods into a baby’s diet. If you have a family history of food allergies, or your child has eczema or known food allergies, you should consult with your doctor before introducing foods. What else might prevent children from developing food allergies? In addition to the early diversification of diet, there are many potential causes that could translate to prevention. Use of probiotics, sufficient vitamin D, judicious antibiotic use, avoiding preservatives, and treating eczema aggressively early on to prevent sensitizing through the skin may all play a role in prevention. For kids and adults who already have allergies, what treatment paths have you found to be successful, and are there others on the horizon that might be promising? Yes, a few treatment paths hold tremendous potential. Clinical trials have been investigating Epicutaneous Immunotherapy (EPIT) with a patch, Oral Immunotherapy (OIT), and, to a lesser extent Sublingual Immunotherapy (SLIT), for several years. At the Sean N. Parker Center for Allergy and Asthma Research at Stanford University, we are looking for ways to improve the safety and efficacy of the treatment for food allergies. Some of these treatments may combine OIT with other medications already proven safe in other allergic conditions. This fall, we’re launching a first-in-human Phase I clinical trial to evaluate the safety and efficacy of a peanut vaccine. As the research evolves, so does the definition of cutting-edge treatment. We’re striving towards the safest, fastest route to the holy grail of permanent desensitization. How does treatment differ for people who have multiple allergies, as opposed to those who are allergic to a single food? Patients with multiple food allergies also tend to have other allergic conditions, such as eczema, asthma, and environmental allergies. In all of our studies, we try to optimize the control of these other allergic conditions to improve the safety of food desensitization. Our team developed the first protocol to treat patients with multiple food allergies simultaneously. Desensitizing to multiple foods can be a longer process than a single food—unless we add concurrent treatment with a drug called Xolair. We’ve been excited to share our protocols with other centers across the country in a Phase 2 study using Xolair to treat multiple food allergies. Can you explain what the Atopic March is, and how food allergies are connected to seasonal allergies, as well as asthma? Common allergic diseases include atopic dermatitis (eczema), allergic rhinitis (hay fever), food allergies, and allergic asthma. Interestingly, there appears to be a natural progression of these diseases, suggesting the presence of common mechanisms of action. Often, the first manifestation of allergic disease is eczema, occurring during infancy or early childhood. It is found in ten to twenty percent of all children. Food allergies also develop early in life. These early allergic diseases are often followed by asthma and hay fever. In fact, studies have shown that two-thirds of patients with eczema develop hay fever and one-third develop asthma. The natural progression of these diseases from eczema to food allergies to asthma to hay fever is termed the Allergic March, alternatively known as the Atopic March. Not all children follow this trend and there are variations. Some children outgrow their allergies and asthma; others develop asthma and allergies for the first time in adulthood. We do know that having food allergies and asthma puts you at higher risk for having severe reactions with accidental exposures. At the Sean N. Parker Center for Allergy and Asthma Research, we’re exploring the immunological differences between the people who follow Atopic March and those who only develop food allergies. Thanks to recent funding from E•A•T (End Allergies Together), we’re able to study this. Are there potential immune system differences, or other differences, that might explain why some people are more prone to allergies and asthma than others? We are still very early in our understanding of why allergies are on the rise and who is specifically predisposed to developing allergies. This is what makes the field so exciting for clinicians and scientists alike. For patients with a family history of asthma and allergies, there may be some genetic predisposition skewing towards allergy that is compounded by certain interactions with the environment and ultimately passed on to future generations. For others, who develop allergies after childhood, or for families without a history of allergies who now have a child with eczema or food allergies, we believe immune programming or reprogramming that somehow switches on the allergy genes is at play. This is likely due to epigenetic modification of our genes—our center and others are striving to understand these key triggers.", "opengraph": {"locale": "en_US", "type": "article", "title": "The New Thinking On Allergies | goop", "description": "We’ve been following the rise in allergies and are always on the lookout for new research and the accompanying viable treatment options. Dr. Sharon Chinthrajah at Stanford’s Sean N. Parker Center for Allergy and Asthma Research, is a prominent clinician who’s also at the forefront of promising research on food allergies.", "url": "https://goop.com/wellness/health/the-new-thinking-on-allergies/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "nutrition tips for kids", "article:section": "Do", "article:published_time": "2016-08-18T16:00:26+00:00", "article:modified_time": "2018-08-01T23:51:26+00:00", "updated_time": "2018-08-01T23:51:26+00:00", "image": "https://goop-img.com/wp-content/uploads/2016/08/allergens-MediaBakery_PUR0047758.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2016/08/allergens-MediaBakery_PUR0047758.jpg", "image:width": "820", "image:height": "625"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.leapstudy.co.uk/leap-study-results#.V62dl5N97BI", "http://www.leapstudy.co.uk/leap-study-results-0#.V62dq5N97BI", "http://www.eatstudy.co.uk/", "http://www.ncbi.nlm.nih.gov/pubmed/23374261", "http://www.ncbi.nlm.nih.gov/pubmed/24117677", "http://endallergiestogether.com/", "https://goop.com/understanding-epigenetics-and-what-it-means-for-aging-cancer-and-obesity/", "https://www.facebook.com/Goop", "https://twitter.com/goop", "https://instagram.com/goop", "https://www.youtube.com/user/goop", "http://www.pinterest.com/goop/", "https://play.spotify.com/user/gooptunes?play=true&utm_source=open.spotify.com&utm_medium=open"], "authors": [], "publish_date": "2016-08-18T16:00:26+00:00"}