{"result_id": "139005", "URL": "https://goop.com/wellness/health/hpv-and-cervical-cancer/", "timestamp": "2023-04-25 15:19:51 CEST+0200", "meta": {"description": "HPV is the most common sexually transmitted infection, and the CDC estimates that 79 million Americans are infected with some type of this virus. Following infection with HPV, many people fight off the virus completely. However, in about 10 percent of cases, the active infection subsides but the virus is incorporated into our cells’ DNA and may result in cervical, anal, throat, and other cancers many years later. The HPV vaccine is expected to prevent 90 percent of all cervical and anal cancers. The vaccine is also effective at preventing oral HPV infections and is expected to protect against throat cancer.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/hpv-and-cervical-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "What to Know about the HPV Vaccine, Latent Infections, and Preventing Cervical Cancer", "cleaned_text": "What to Know about the HPV Vaccine, Latent Infections, and Preventing Cervical Cancer\n\nWhat to Know about the HPV Vaccine, Latent Infections, and Preventing Cervical Cancer Whether or not you’ve been vaccinated, it’s worth knowing about human papilloma virus infections—their consequences and how to test for them. HPV is the most common sexually transmitted infection, and the CDC estimates that 79 million Americans are infected with some type of this virus. Following infection with HPV, many people fight off the virus completely. In some people, an active infection persists. However, in about 10 percent of cases, the active infection subsides but the virus is incorporated into our cells’ DNA and may result in cervical, anal, throat, and other cancers many years later. The HPV vaccine is expected to prevent 90 percent of all cervical and anal cancers. It is also effective at preventing oral HPV infections and is expected to protect against throat cancer. The vaccine has already prevented many cervical abnormalities and cervical surgeries. Unfortunately, some people have been scared away from this lifesaving vaccination. We asked Judith A. Smith, a board-certified oncology pharmacist and an associate professor at the University of Texas Health Science Center, to tell us about HPV—the vaccine, the risk of cancer, the problems with testing, and her research on persistent infections.\n\nHow does it cause cancer and what kinds of cancer? HPV infection is often cleared by the healthy immune system in six to eighteen months. It’s the persistent HPV infection that may lead to the development of cancer. This happens when the HPV DNA inserts itself into the DNA of human mucosal cells, then is triggered by physiological stress in a way that leads to uncontrolled cell growth, or cancer. Infection with HPV occurs during sexual contact, most commonly during vaginal and anal sex, and has been associated with cervical, vaginal, vulvar, penile, anal, and throat cancers.\n\nThe quadrivalent HPV vaccine—which protects against four strains—was first approved in 2006. The vaccine that protects against nine strains wasn’t approved until 2014. The HPV vaccination rates in the US are low—now it’s 60 percent on average nationwide. But even back in 2006, when the vaccine was first approved, an impact on the rates of cervical cancer was not projected until 2020. Once somebody is infected, it’s estimated to take anywhere from ten to fifteen years for cancer to develop. That’s why starting with vaccination in 2006, you should start to see changes in rates in 2020. Unfortunately, it’s still too early to see the benefits of HPV vaccination.\n\nAt what age should girls and boys be vaccinated? Per the CDC guidelines, girls and boys both should be vaccinated prior to potential exposure. It’s recommended to complete the two-shot series between the ages of nine and fourteen, and after the age of fifteen to complete the three-shot series. The vaccine is approved in people up to the age of forty-five, but the American Cancer Society does not recommend vaccination in those older than twenty-six because there is not yet data supporting a benefit in this age group. [Editor’s note: Condoms also offer protection from genital HPV infections.] The vaccine has been shown to be safe based on the data in the clinical trials and the post-marketing data that’s been routinely gathered. There are reports of patients with allergies, so patients who have allergies should talk to their doctors before receiving the HPV vaccine. But overall, the HPV vaccine is safe.\n\nHow do you know if you have an HPV infection? There’s now an RNA test as well as a DNA test. The DNA assay tells you whether the virus is there, even if it’s not active—what we call a latent infection. The RNA assay will pick up HPV only if the virus is active. The HPV RNA assay could give you a false negative. If you have a latent infection, it will tell you you’re HPV negative, but you could still have the DNA present. The HPV RNA assay is automated, it’s less expensive, and it has much higher sensitivity for picking up early cellular changes. So a lot of pathologists switched over to that not realizing that from a screening perspective and a cancer-prevention perspective, we need to know whether the latent HPV infection is present. The screening guidelines from the American Society of Colposcopy and Cervical Pathology (ASCCP) change based on whether HPV is present or not. I tell patients, “Go back and make sure you’re DNA negative, not RNA negative,” because I don’t want people to think that they’re clear of the infection when it’s really just an RNA negative. A lot of gynecologists don’t even realize that their labs switched assays to the new RNA assay, and many don’t realize the limitations of the HPV RNA assays. If they specifically order HPV DNA tests, then the pathologist has to run that test. But if the gynecologist doesn’t specify, then the pathologist does whatever their standard assay is in the lab. So there’s a big education gap right now.\n\nWhat’s the focus of your research? Our research is about finding a way to clear HPV in people with persistent infections. Over 80 percent of the sexually active adult population in the US has been infected with HPV at one time or another. The majority of people with a healthy immune system will clear the HPV infection within six to eighteen months. But about 10 percent of the population has a persistent infection. We have focused on finding ways to help support the host’s immune function to clear persistent HPV infections. It’s estimated that there are about 3 million women worldwide with persistent high-risk HPV infections. About 15 percent of those will progress to precancerous or early-stage lesions that can be treated and resolved with proper screening and treatment. It’s a bigger problem in countries where people don’t have access to that screening. Another 1 percent or so of these women will develop cervical cancer. It’s very fortunate we have the Pap smear, which has had a significant impact on cancer prevention through early detection of cellular changes. That same technology has been adopted in clinical practice—not universally yet—to help screen for anal cancers in recent years. But that is certainly is not a standard of practice yet. [Editor’s note: Although the prevalence of genital HPV infection is similar across sexes, the development of persistent infections appears to be less common in men. There is a lack of research on HPV infection in trans and nonbinary people.]\n\nHow often is a Pap test recommended? If you have a normal Pap and you’re HPV negative, the recommendation is not to be seen again for five years. The ASCCP guidelines for 2020 also recommend primary screening with HPV testing alone. One of the biggest concerns with these new screening guidelines is how the RNA assay can give a false negative. That is a big concern if you really are HPV DNA positive—a lot can happen in five years. You may think you’re in a monogamous relationship, but you never really know. In our study, we’ve had people say, “I’ve been married for twenty years, I’ve never been with anyone else, nor has my husband, and I have HPV.” Our audience is largely women in their maybe late twenties to mid-fifties. Many of those are married. It’s a difficult population to target STI education toward because they’re like, “I don’t need to worry about that.”\n\nThis article is for informational purposes only, even if and regardless of whether it features the advice of physicians and medical practitioners. This article is not, nor is it intended to be, a substitute for professional medical advice, diagnosis, or treatment and should never be relied upon for specific medical advice. The views expressed in this article are the views of the expert and do not necessarily represent the views of goop.", "opengraph": {"locale": "en_US", "type": "article", "title": "What to Know about the HPV Vaccine, Latent Infections, and Preventing Cervical Cancer | goop", "description": "HPV is the most common sexually transmitted infection, and the CDC estimates that 79 million Americans are infected with some type of this virus. Following infection with HPV, many people fight off the virus completely. However, in about 10 percent of cases, the active infection subsides but the virus is incorporated into our cells’ DNA and may result in cervical, anal, throat, and other cancers many years later. The HPV vaccine is expected to prevent 90 percent of all cervical and anal cancers. The vaccine is also effective at preventing oral HPV infections and is expected to protect against throat cancer.", "url": "https://goop.com/wellness/health/hpv-and-cervical-cancer/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-07-23T06:55:23+00:00", "article:modified_time": "2020-07-23T16:39:05+00:00", "updated_time": "2020-07-23T16:39:05+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/07/What-to-Know-about-the-HPV-Vaccine-Stocksy_txpa384d6c3TAm200_Medium_589784.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/07/What-to-Know-about-the-HPV-Vaccine-Stocksy_txpa384d6c3TAm200_Medium_589784.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5691644/", "https://www.cancer.org/cancer/cancer-causes/infectious-agents/hpv/acs-recommendations-for-hpv-vaccine-use.html", "https://journals.lww.com/jlgtd/Fulltext/2020/04000/2019_ASCCP_Risk_Based_Management_Consensus.3.aspx", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4254924/", "https://www.obgproject.com/2020/04/02/the-new-asccp-management-consensus-guidelines-for-abnormal-cervical-cancer-screening-results-what-are-the-key-changes/", "https://www.gynecologiconcology-online.net/article/S0090-8258(19)30591-8/abstract"], "authors": [], "publish_date": "2020-07-23T06:55:23+00:00"}