{"result_id": "139010", "URL": "https://goop.com/wellness/health/long-covid-symptoms-and-healing/", "timestamp": "2023-04-25 15:20:00 CEST+0200", "meta": {"description": "There’s a lot we don’t yet understand about long COVID, but we do know that it can be devastating and debilitating for those who have it—and seeking help can be a painful and frustrating process. Jason Maley, MD, MS, helps patients toward recovery.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/long-covid-symptoms-and-healing/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Recognizing and Healing from Long COVID", "cleaned_text": "For pulmonary and critical care doctor Jason Maley, MD, MS, it became clear early in the pandemic that some of his ICU patients were struggling to recover fully from COVID-19 even after leaving the hospital. And later, he found that the same was often true for those who had a mild course of initial illness. What he noticed soon became known as long COVID, a loosely defined chronic illness—connected to an initial COVID-19 infection—that has a range of symptoms: Extraordinary fatigue, brain fog, and shortness of breath just scratch the surface. There’s a lot we don’t yet understand about long COVID, but we do know that it can be devastating and debilitating for those who have it—and that seeking help can be a painful and frustrating process. As patients continue to suffer from symptoms, their concerns are often swept aside by medical providers who don’t believe the condition is real or that anything can be done about it, and many communities and government officials are eager to move into a post-COVID world despite the disability the virus has caused for millions of people with long COVID. Maley and his colleagues at Beth Israel Deaconess Medical Center in Boston established a program for patients living with long-term symptoms following COVID. They keep up with the latest research and work with their patients toward recovery. But what may be most valuable about their care is their genuine partnership with their patients. “When you’re a long COVID patient, even if there isn’t an easy solution to your illness, it can be therapeutic just to have someone who believes you,” Maley says.\n\nWhat does the course of illness typically look like? There’s a wide range. As research continues, we’ll learn more about why people fall into different buckets in terms of how they’re experiencing long COVID. At this point, with our experience—and talking to others around the country—patients fall into two broad categories. There’s a group of people who have a very slow recovery but who are recovering nevertheless, moving forward each month. By six to nine months or so, they feel well recovered. Though that’s still a long recovery for a virus, we’re happy to see when patients follow that positive path. And then there are patients who got COVID in March 2020 and still have symptoms two years later. They’re having a very prolonged course of illness, and it’s not clear where they may go over time. For the most part, we see these patients tend to make steps in the right direction in terms of their recovery. But it can be very slow and full of setbacks and unpredictable ups and downs: Patients may be getting better, then get a flare of their symptoms after getting sick with a new infection or experiencing some other stressor. After that, over the course of months, they’re really getting better again. And then something else happens where they again have a flare. It’s hard to say accurately how many patients belong to that very long group—it hasn’t been clearly studied—but I would say it’s at least a third of the patients we see.\n\nWhat do we know so far about what’s causing long COVID? That’s the key question. Since the earliest cases of long COVID, there have been studies looking into different hypotheses. In the past year, many studies have shown long COVID has to do with the immune system not recovering appropriately after someone has COVID. In a healthy immune response, the immune system responds to a viral infection and then calms down appropriately, without ongoing inflammation, after the virus is cleared. For people with long COVID, numerous studies have suggested that the immune system, initially intended just to respond to the infection, remains active longer than you would expect. For me, that’s the most promising theory: broad inflammation and reactivity in the immune system. It’s an idea that fits the patterns of symptom flares we’re seeing in our patients as well. Then we have questions of why that’s happening. Is it that there are leftover remnants of the virus that the body is seeing and inappropriately responding to? Or is it because of the original trigger from the virus—which is now gone—and the immune system is just running out of control? Or is it that the body has developed an autoimmune response where the body thinks it’s fighting off an infection but is actually hurting itself?\n\nHas the rate of long COVID changed over the course of the pandemic? It’s unclear, though my experience has been that we are seeing an ever-increasing need for long COVID care, with no signs of slowing. I haven’t seen a study yet to clearly show differences in long COVID incidence across variants, but if there were a change, it could have to do with the fact that vaccination rates have changed over time. There’s one published study and another that’s in pre-print—meaning it’s not yet reviewed—that suggest vaccination may have a protective effect against long COVID: Vaccinated people who get infected with the virus as a breakthrough infection are less likely to have these long-term symptoms than people who were infected around the same time but didn’t have vaccination protection. Here’s how having that immunity from vaccination serves you in terms of long COVID: It helps your body clear the virus quickly and prevent it from spreading around your body and infecting tissues—which leads to inflammation—beyond the local area of infection in your nose and mouth. And when we look at people who have had a single dose of the vaccine versus those who have had two doses, it appears additional doses of the vaccine may provide more protection and support against long COVID.\n\nIs the same true for immunity acquired after infection? Like: If you’ve had the virus before and contract it again, are you less likely to develop long COVID than on your first go-round? We don’t know the exact answer to that. But your chances of getting long COVID during any sequential infection may have more to do with your unique biology than if you’ve had the virus before. For that, we can look to research on post-acute infectious syndromes with symptoms that look very much like those of long COVID—like myalgic encephalomyelitis/chronic fatigue syndrome, or ME/CFS. There’s research on ME/CFS suggesting certain genetic factors make one person more likely to develop this chronic condition after an infection where another person might recover fully from the exact same infection. We do come across long COVID patients that mention to us that decades ago they had a several-year recovery period after having Epstein-Barr virus (EBV) or some other infection. So different bodies respond to the COVID virus in their own way—and it’s possible that if you were infected and recovered well the first time, you may be the type of person, in terms of your body’s immune system and response to infection, who is less likely to develop long COVID.\n\nWhat might a treatment protocol look like? Most of what’s widely available are ways to best manage symptoms and support someone’s recovery and rehabilitation. In our clinic, we do our best to understand the symptoms each patient is having—there are so many, from head to toe—and go from there. Recognizing the symptoms of long COVID early and taking steps to prevent flares do help. Hopefully, with time, we will find more targeted treatments that get at the underlying cause of long COVID. Currently, the exact approach will vary depending on the symptoms, but here’s what we do for the most common ones: Brain Fog\n\n We see many patients who experience brain fog. We hear stories where they go back to work and have trouble just reading emails—they get to the end of a paragraph and need to restart because they can’t recall what they just read. If someone is having difficulty with thinking, memory, and returning to work, we help them manage those symptoms and reduce their severity. Generally, these symptoms flare as people reintroduce a workload on their brain. As with recovering from a concussion, we’ve observed that reduced work intensity, breaks from work, and time off have helped people in their recovery. We’ve seen some promise in medications that treat focus and attention, too. In the meantime, they work with cognitive rehabilitation specialists who help them develop strategies to pace the use of their brain, compensate for the changes that they’ve noticed in memory or thinking, and support healing over time. Fatigue\n\n A very common symptom—and one of the longest-lasting ones—of long COVID is debilitating fatigue. It’s one of the symptoms that’s very similar to what we see in ME/CFS. In particular, people experience something called post-exertional malaise, or post-exertional symptom exacerbation, where after even minimal physical activity they may feel physically ill—achy, chills—almost as if they’re sick with an infection again. For the patients we’re seeing, this symptom tends to be worst in the early months after having the infection. Many people who only come to our clinic 6 to 12 months after COVID infection mention that they used to have that post-exertional fatigue, and now, while they feel that they’re not able to do everything they used to do physically, they no longer experience that feeling of illness and have progressed on their own. With patients who have that severe fatigue, we usually reduce the intensity of their activity. We understand what they’re doing on a day-to-day basis—if they’ve tried to jump back into exercise or if they’re trying to push themselves in other ways—as we’ve found that it can propagate the symptom if you are on a pattern of pushing and crashing rather than finding a steadier pace to the day, where you can function without those crashes. Then, as people improve with time and no longer experience that post-exertional malaise, we may try to see what progress they’re able to make in their day-to-day activities and if they’re able to make more steps forward without experiencing that crash. Anosmia and Parosmia\n\n We see some people whose main concern is that their sense of smell hasn’t returned fully. When loss of smell (also known as anosmia) is part of long COVID, many people have something called parosmia, which is when the ability to smell returns but things smell different than what they’re supposed to smell like. Unfortunately, it’s usually unpleasant: Food smells rotten; things smell like they’re burning or metallic. That will change the taste of them, too; people have trouble finding foods that they can enjoy because they all smell and taste different than expected. There are some recent studies suggesting that persisting anosmia or parosmia is linked to inflammation around the cells in the nose, resulting in injury to the pathways of smell that lead back to the brain. The treatments that we’ve done for parosmia—even prior to the pandemic—have been around rehabilitating the small pathways through a process called small training, which involves smelling specific essential oils several times a day and focusing on those scents for months at a time. You are trying to, in essence, retrigger and retrain those pathways of smell. There has been modest evidence that smell training could help people with smell changes after viruses. I’ve seen mixed results. We do recommend it because it’s simple and straightforward, but unfortunately some people do come to us 18 months out from having COVID because their senses of smell and taste haven’t returned to normal even after trying smell training and every other method they could find. For those patients, right now, we’re at a loss of how we can help their parosmia.", "opengraph": {"locale": "en_US", "type": "article", "title": "Recognizing and Healing from Long COVID | goop", "description": "There’s a lot we don’t yet understand about long COVID, but we do know that it can be devastating and debilitating for those who have it—and seeking help can be a painful and frustrating process. Jason Maley, MD, MS, helps patients toward recovery.", "url": "https://goop.com/wellness/health/long-covid-symptoms-and-healing/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2022-03-17T11:49:06+00:00", "article:modified_time": "2022-11-14T21:53:45+00:00", "updated_time": "2022-11-14T21:53:45+00:00", "image": "https://goop-img.com/wp-content/uploads/2022/03/Recognizing-and-Healing-from-Long-COVID_@typo.grafka-1.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2022/03/Recognizing-and-Healing-from-Long-COVID_@typo.grafka-1.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/goop-authors/goop-editorial-team", "https://goop.com/goop-authors/kelly-martin", "https://www.instagram.com/typo.grafka/", "https://www.bidmc.org/centers-and-departments/pulmonary-critical-care-and-sleep-medicine/services-and-programs/critical-illness-survivorship-program", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00460-6/fulltext", "https://www.medrxiv.org/content/10.1101/2022.01.05.22268800v2", "https://www.cell.com/cell/fulltext/S0092-8674(22)00072-1", "https://www.wearebodypolitic.com/", "https://www.wearebodypolitic.com/covid-19", "https://www.aapmr.org/members-publications/covid-19/physiatrist-resource-center/long-covid-pasc-resources", "https://recovercovid.org/", "https://www.bidmc.org/centers-and-departments/pulmonary-critical-care-and-sleep-medicine/services-and-programs/critical-illness-survivorship-program"], "authors": [], "publish_date": "2022-03-17T11:49:06+00:00"}