{"result_id": "139030", "URL": "https://goop.com/wellness/health/breast-cancer/", "timestamp": "2023-04-25 15:20:32 CEST+0200", "meta": {"description": "Breast cancer remains all too common, but earlier detection and personalized treatments have been steadily decreasing the deadliness of this disease. Scientists have a general understanding of factors that make breast cancer more likely for certain people than for others, like mutations in the BRCA genes and being exposed to estrogen, but they can’t yet predict with certainty who will develop this disease and who will not.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/health/breast-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "Breast Cancer", "cleaned_text": "Our science and research team launched goop PhD to compile the most significant studies and information on an array of health topics, conditions, and diseases. If there is something you’d like them to cover, please email us at [email protected] .\n\nOur science and research team launched goop PhD to compile the most significant studies and information on an array of health topics, conditions, and diseases. If there is something you’d like them to cover, please email us at [email protected]. Breast cancer remains all too common, but earlier detection and personalized treatments have been steadily decreasing the deadliness of this disease. Scientists and clinicians have a general understanding of factors that make breast cancer more likely for certain people than for others, like mutations in the BRCA genes and being exposed to estrogen, but they can’t yet predict with certainty who will develop this disease and who will not. Although Black and White women have similar incidences of breast cancer, Black women are more likely to die from the disease. Delays in diagnosis and treatment due to lack of access to health care may contribute to this disparity. The aggressiveness of early-stage cancers and BRCA gene mutations also appear to contribute to increased mortality. Breast cancer is much less common in men than in women, but it is more deadly for men. Trans women have a higher risk of breast cancer than cisgender men do, and trans men have a lower risk than cisgender women do. These effects are attributed to treatments that affect hormone levels. Most of the research cited here simply refers to the people studied as “women” or “men” and does not make clear whether or not trans women or men were included. Use of “women” reflects the term used in the cited references (de Blok et al., 2019; Monticciolo et al., 2018; Wang et al., 2019). Look for any change to your breast: a change in size or shape, a lump or dimpling, redness, peeling or pitting of the skin, or a nipple becoming inverted. Even if a recent mammogram was normal, tell your doctor about any of these symptoms (Mayo Clinic, 2019b). How Many People Are Affected by Breast Cancer? Breast cancer is the second most common cancer in women behind skin cancer. Around 12 percent of women will be diagnosed with breast cancer in their lifetime. Ninety percent of these women will live more than five years following the diagnosis. The five-year survival rate ranges from 99 percent for a localized cancer diagnosis to 27 percent for cancer that has metastasized. While the number of new cases annually in the US is pretty consistent (around 268,000 in 2019), since 1992 the number of deaths due to breast cancer has gone down. However, the death rate remains 40 percent higher for Black people than it is for White people (DeSantis et al., 2019; Surveillance, Epidemiology, and End Results Program, 2019). In breast cancer, cells escape the normal constraints on cell growth and start to multiply uncontrollably, forming a tumor. The tumor may remain localized, or tumor cells may spread within the breast or throughout the body.\n• \n• Ductal carcinoma in situ (DCIS) is the most common type of breast cancer. It occurs in the ducts that carry milk to the nipples. DCIS cells have not yet become invasive and moved out of the ducts. It’s not entirely clear whether this diagnosis should be counted as breast cancer, but these cells can evolve into invasive breast cancer.\n• \n• Lobular carcinoma is cancer in the milk-producing lobules of the breast. If confined to the lobules, it is called lobular carcinoma in situ (LCIS).\n• \n• Inflammatory breast cancer results in red, warm, and swollen breasts, and there may be no lumps that can be felt.\n• \n• Invasive breast cancer has migrated out of the ducts or lobules into the surrounding breast tissue.\n• \n• Metastatic cancer has spread from the breast—through lymphatic vessels or blood vessels—to other locations in the body. Cancer that has metastasized is responsible for almost all deaths from breast cancer.\n• \n• Breast cancer cells are characterized as estrogen-receptor-positive or negative (ER-positive or negative) based on whether they have receptors that bind estrogen resulting in cell growth. The same goes for progesterone receptors (PR).\n• \n• Atypia is not breast cancer—it is slightly abnormal cells that may be a risk factor for developing breast cancer. (National Cancer Institute [NCI], 2019d, 2019f, 2019f)\n\nPotential Causes of Breast Cancer and Related Health Concerns Breast cancer occurs when a combination of mutations in breast cell DNA, hormones, and other factors come together to cause cells to proliferate abnormally. Scientists know a fair bit about many DNA mutations and environmental factors that promote breast cancer, but not enough to be able to predict with certainty that one person will develop breast cancer in their lifetime and another person will not. While individuals can influence a few of the factors that increase their risk of breast cancer, most are outside of our control.\n• \n• Having a family history of breast cancer or gene variants associated with high risk\n• \n• Having a personal history of breast cancer or other breast disease\n• \n• Age—most new cases are diagnosed in women ages forty-five through seventy-four\n• \n• Using estrogen plus progesterone hormone replacement therapy (HRT) after menopause is associated with higher rates of breast cancer. But in women who’ve had a hysterectomy, use of estrogen alone may have the opposite effect and lower breast cancer risk.\n• \n• Dense breast tissue as determined with a mammogram or ultrasound\n• \n• Never having children or later age at first pregnancy. The risk of breast cancer is 50 percent lower in women who have a full-term pregnancy before age twenty than it is in women who give birth after thirty-five. Risk is also lower in women who breastfeed.\n• \n• Obesity is a risk factor for postmenopausal women who have not used HRT.\n• \n• Inactivity. Exercise for more than four hours per week is associated with 30 to 40 percent less breast cancer, but any level of activity is helpful. (NCI, 2019e, 2019e) The National Cancer Institute has created a questionnaire that asks about risk factors and predicts an overall risk of developing cancer. Medical Approaches to Lower the Risk of Breast Cancer Several medical approaches can lower the probability of developing breast cancer:\n• \n• In women with a high risk of developing breast cancer, estrogen-blocking drugs like tamoxifen can be preventative. However, the risks and benefits need to be evaluated because of serious side effects, such as blood clots and bone pain.\n• \n• Double mastectomy may reduce the occurrence of breast cancer in people with a family history of breast cancer and in people with BRCA1/2 gene mutations.\n• \n• Removal of ovaries is associated with less breast cancer in premenopausal women, including women with the BRCA gene mutations. (Breastcancer.org, 2020b; Cuzick et al., 2013; Garcia-Estevez & Moreno-Bueno, 2019; NCI, 2019e) Mutant genes that cause disease are called pathogenic variants. They may be inherited or may develop spontaneously. Our DNA accumulates multiple mutations over a lifetime. Some mutations do no harm, and some contribute to the transition of a normal cell into a cancer cell. Cells that acquire mutations encouraging growth will survive and grow more than normal cells, resulting, for example, in a benign tumor. Subsequent additional mutations in these cells may allow them to become invasive and metastatic. Metastatic tumor cells contain DNA mutations that were not present in the original tumor (Gerstung et al., 2020). About 5 to 10 percent of breast cancer is due to inheritance of gene mutations. All sexes can inherit and pass on genes that cause this disease. Many men are not aware that if they have a close relative with premenopausal breast cancer, they are also at increased risk of the disease. If you have a family history of breast or ovarian cancer, your doctor may recommend testing for genes associated with these cancers. Mutations in BRCA1/2, PALB2, ataxia-telangiectasia, and other genes are predictive of risk: 45 to 80 percent of people with certain BRCA genes will develop breast cancer in their lifetime. Black people are more likely than White people to have BRCA1/2 mutations, and people of Ashkenazi Jewish descent are at high risk for a BRCA mutation. In people with BRCA variants, screening for cancer should start at an earlier age and be carried out more frequently than recommended for the rest of the population (Jerzak et al., 2018; Mayo Clinic, 2019b; Monticciolo et al., 2018; NCI, 2019b; Swift et al., 1991). An estimated 12 million people in Western countries use HRT after menopause. Data from both randomized controlled clinical trials and from epidemiological studies have reported that HRT is associated with higher rates of breast cancer. Equine estrogen purified from pregnant mare urine—one brand is Premarin—is the most common type of estrogen prescribed for HRT. Some but not all studies have found that estrogen that is identical to human estrogen (bioidentical estrogen, or estradiol) and bioidentical progesterone (micronized progesterone) may be safer than other types of hormones used for HRT. Until studies show more consistent findings, women should carefully weigh the risks and benefits of HRT options (Collaborative Group on Hormonal Factors in Breast Cancer, 2019).\n• \n• HRT consisting of equine estrogen plus a synthetic progesterone promotes breast cancer. Risk of breast cancer is not increased in women without a uterus who take estrogen without progesterone. The Women’s Health Initiative (WHI) carried out large controlled clinical trials of HRT in the early 2000s. Women in their sixties who were given equine estrogen—still the most commonly prescribed form—plus a synthetic progesterone (medroxyprogesterone acetate) developed more breast cancer than the placebo group. However, women who had had a hysterectomy and were randomly assigned to estrogen alone had less breast cancer than those given a placebo (Manson et al., 2013).\n• \n• HRT consisting of vaginal estrogen may not increase risk of breast cancer. In agreement with the controlled WHI trial, a meta-analysis of survey data from the Collaborative Group on Hormonal Factors in Breast Cancer (CGHFBC) found that women who use HRT in their forties and fifties were more likely to develop breast cancer. Higher rates of breast cancer were observed with all types of HRT, with the exception of vaginal estrogen. The CGHFBC did not find significant differences in breast cancer rates between various types of progesterone (Collaborative Group on Hormonal Factors in Breast Cancer, 2019).\n• \n• Bioidentical estrogen plus bioidentical progesterone may not be associated with an increased risk of breast cancer. In contrast to the WHI and CGHFBC findings, two studies from France, where bioidentical estrogen—estradiol—is more commonly used than equine estrogen, have reported that estradiol plus micronized bioidentical progesterone is not associated with an increased risk of breast cancer. These findings have not been replicated in controlled trials (Cordina-Duverger et al., 2013; Fournier et al., 2008).\n• \n• HRT may increase the risk of breast cancer more than being overweight does. Being overweight or obese is associated with higher rates of breast cancer, but in the CGHFBC study, the effect was modest and much smaller than the effect of taking HRT. Rates of ER-positive breast cancer increased slightly with increasing BMI, but rates of ER-negative breast cancer did not. Lean women using HRT had much higher rates of breast cancer than obese women who never used HRT (Collaborative Group on Hormonal Factors in Breast Cancer, 2019). Breast cancer in men is rare, but it’s on the rise, and screening high-risk men may help detect tumors early. Risk factors associated with breast cancer in men include older age, Ashkenazi descent, genetic mutations, and history of breast cancer in close family members. There are no guidelines for screening men at high risk as there are for women. One study reported the incidence of breast cancer in trans men to be lower than it is in cisgender women—but the risk was forty-six times higher than it was for cisgender men (de Blok et al., 2019; Gao et al., 2019). BRCA1 and 2 gene variants increase the risk of ovarian cancer as well as of breast cancer. Gene variants occurring in Li-Fraumeni syndrome, Cowden syndrome, diffuse gastric and lobular breast cancer syndrome, Peutz-Jeghers syndrome, and Lynch syndrome are also associated with breast and ovarian cancers (NCI, 2019b).\n\nThe diagnosis of breast cancer begins with breast exams, mammograms, or other screening procedures to detect tumors. An accurate diagnosis requires obtaining a sample of the tumor to examine characteristics of the cancer cells including their genes and appearance—cells can appear aggressive or harmless. And it may require looking elsewhere in the body to see if the cancer has spread. Putting this all together, your doctor will determine the stage of the cancer and the best treatment options. In a breast exam, you or your doctor will feel for any lumps or abnormalities in breast tissue and in the lymph nodes in your armpits. Research has not found any long-term benefit resulting from self-exams, and it is not known if there is a benefit of a practitioner carrying out breast exams. However, many doctors and people feel that there is value to breast exams when done regularly. See our goop article on breast self-exams (NCI, 2019g). A mammogram is an X-ray of the breast. If something turns up on a screening mammogram, it may be followed up with a diagnostic mammogram or an ultrasound. Things you can do to increase the sensitivity of the test in correctly detecting cancers include taking a break from HRT before the mammogram and scheduling the exam for after your period has started. Tell the breast exam technician if the pain is significant or if your breast feels overly compressed. In one study, 90 percent of women reported pain or discomfort and 12 percent said that the discomfort was intense or intolerable. Some people with breast implants may avoid mammograms because they are afraid that the procedure may break open the implants. Although very uncommon, rupture of implants during mammograms has been reported (Brown et al., 2004; Mayo Clinic, 2019a; NCI, 2019c, 2019g). Cancers that are discovered in the interval between regular mammograms tend to be faster-growing, so don’t wait until your next scheduled mammogram to report symptoms to your doctor (NCI, 2019g). Who should be screened, how, and how often? It’s not known what optimal screening for breast cancer would entail. For women ages fifty through sixty-nine, annual mammography is associated with lower mortality from breast cancer (NCI, 2019g). But according to the National Cancer Institute, it’s not clear whether screening with mammography is beneficial for women forty to forty-nine years old or those over sixty-nine years of age. The National Cancer Institute says there is no reason for average-risk women under forty or for women with limited life expectancy—due to advanced cancer, for example—to undergo breast cancer screening. Early and more frequent screening is recommended for people at high risk because of BRCA1 or 2 gene mutations and those who received radiation for lymphoma in the 1960s. The American College of Radiology recommends that all women, especially Black women and those of Ashkenazi Jewish descent, be evaluated for their risk level before age thirty so that those at high risk can be screened appropriately. Evidence-based guidelines for screening transgender men and transgender women are not yet available. The Susan G. Komen Foundation, which advocates for breast cancer research and care, recommends yearly mammograms after age fifty for trans women who have been using hormones for more than five years. For those with a family history of breast cancer, mammograms are recommended before age fifty. Screening recommendations for transgender men may be the same as those for cisgender women but will be affected by breast reduction or chest reconstructive surgery. The major downside of unnecessary screening is the overdiagnosis and treatment of tumors that are likely not dangerous, since screening can often pick up smaller, slower-growing tumors. Surprisingly, even when these small tumors are treated, it doesn’t seem to reduce the number of advanced tumors detected. However, the benefits of using screening to discover fast-growing, invasive tumors are thought to outweigh any possible harm from the screening procedures themselves and from unnecessary treatment of slow-growing tumors (Monticciolo et al., 2018; NCI, 2019g). How reliable are mammograms? Mammograms can be difficult for radiologists to interpret. Some cancers may be missed (false negative), and other times cancer may be indicated when there is none (false positive). Overall, mammography picks up around 70 to 90 percent of breast cancers. It is less sensitive in dense breasts because dense breast tissue appears white on a mammogram, as tumors do. Tumors are easily identified against a black background of fatty tissue but can be difficult to detect on a white background of dense tissue. Having dense breast tissue greatly increases the risk of breast cancer, making it especially important to use an appropriate screening technique (NCI, 2019g). Three-dimensional mammography called tomosynthesis is becoming more common and is better at detecting more-aggressive cancers than mammograms are. This is of particular importance for Black women who for unknown reasons develop more-aggressive breast cancers at earlier ages than White women do. Whether or not 3D mammography is better for dense breasts than the usual 2D imaging is still being investigated (Conant et al., 2020; NCI, 2017). On the other hand, when radiologists interpret mammograms, sometimes they find what looks like a tumor but turns out not to be cancer upon biopsy. This is called a false positive, and it occurs 10 percent of the time. This means that if you have a mammogram every year for ten years, there is a good chance you will have at least one false positive result, with some of these leading to a biopsy to make a final determination (NCI, 2019g). Is radiation exposure from mammograms a concern? Mammograms use low levels of ionizing radiation to create an image. Exposure to high levels of ionizing radiation increases the risk of breast cancer ten to fifteen years in the future. The question has been raised whether the low amount of radiation from mammograms should ever be of concern. This seems unlikely, because repeated mammograms result in lower exposure than the lowest amount of ionizing radiation that studies have shown is associated with breast cancer. Tomosynthesis may use twice as much radiation as standard digital mammography; however, this is still significantly less than the exposure from a computed tomography (CT) scan (Pijpe et al., 2012). People with mutations in the BRCA1/2 and ataxia-telangiectasia genes may be more sensitive to ionizing radiation. Although their high risk of developing breast cancer means that they need to be screened more frequently, it has been controversial whether this screening should include mammograms due to the radiation. A large study in Europe reported that exposure to radiation from medical procedures—including mammography, fluoroscopy, radiography, CT scans, and bone scans—increased the occurrence of breast cancer in women with BRCA1/2 mutations, especially in those exposed to radiation before age thirty. In spite of this, the benefits of screening for cancer in high-risk women are believed to outweigh any potential harm. People with these gene variants should discuss with their doctors whether to start screening at age twenty-five, and the use of screening methods— such as ultrasound or MRI— that do not use ionizing radiation (Jerzak et al., 2018; NCI, 2018a; Pijpe et al., 2012; Swift et al., 1991). Many patients prefer ultrasound exams, which use sound waves to image the breast, over mammograms. With ultrasound, there is no squeezing of the breast or exposure to radiation. Another advantage to ultrasound is that it is better than mammograms at detecting tumors in dense breast tissue. Clinical studies increasingly report that ultrasound screening plus a mammogram picks up significantly more cancers than a mammogram alone, especially in women with dense breasts (Rebolj et al., 2018; Thigpen et al., 2018). In spite of these benefits, ultrasound is not widely used and is not often covered by insurance for breast cancer screening. (Some states do require that insurance covers screening procedures in addition to mammograms for women with dense breasts.) The reason that ultrasound is not more widely used is that although it may pick up more cancers, it is not clear that this saves lives. Overdiagnosis and false positive results can lead to unnecessary medical treatments that are not necessarily harmless. The US Preventive Services Task Force has not found that ultrasound or MRI reduces mortality, even for women with dense breasts, and clinical trials are currently trying to resolve this question (NCI, 2018; U.S. Preventive Services Task Force, 2019). A handheld ultrasound can cover a larger area than a mammogram can, including the armpit area where lymph nodes are located. However, its accuracy depends on a technician being able to position the probe and evaluate the image simultaneously. Automated whole breast ultrasound (AWBU) was designed to overcome this limitation using an automated arm to move the scanner over the chest while you are lying down. It works for people with small breasts and covers a broad area. Multiple pictures of the breast are put together like a film for a radiologist to examine later. In a study of over 4,000 women, carrying out exams with both AWBU and mammograms was shown to double the number of tumors detected compared to mammograms alone. AWBU greatly increased tumor detection in dense breasts and picked up significant numbers of tumors of all grades and sizes that were missed by mammography, including small, invasive tumors. The AWBU device used was made by SonoCiné. AWBU is available at some medical facilities, including SonoBreasts in Los Angeles, which uses the SonoCiné system (Kelly et al., 2010). An MRI does not use radiation; it uses magnetic fields, radio waves, and an injected dye called a contrast agent to image the breast. It is a very sensitive technique, meaning it detects most true cases, but on the other hand, it is not very specific, meaning it is prone to false positive results. Because of its sensitivity, it is used for screening high-risk people and for follow up to other screening procedures. One type of contrast agent used in MRIs, gadolinium, is a heavy metal that has been considered to be safe except for people with kidney disease. Following MRIs, some people have reported symptoms—referred to as gadolinium deposition disease—including pain, skin thickening, a metallic taste, and muscle spasms. It has not been demonstrated that gadolinium is causing these symptoms. An additional concern is that gadolinium appears to be deposited in the brain. The FDA has asked manufacturers to put a warning on gadolinium-containing contrast agents and is requiring them to conduct further safety assessment (Bassett, 2019; Fotenos, 2018; R. J. McDonald et al., 2015; Semelka et al., 2016; Shaughnessy, 2018). CT scans and positron emission tomography (PET) scans may be used to see whether the cancer has spread elsewhere in the body. In a PET scan, radioactive glucose is injected into a vein. Tumors take up more glucose than other tissues, so this allows visualization of cancer throughout the body. In a CT scan, multiple X-rays are used to construct a 3D image of tissues and organs. A regular chest CT scan exposes you to the amount of radiation you would typically get from two years of natural sources in your daily environment. The American College of Radiology and other organizations have created a form you can use to keep track of your lifetime exposure to diagnostic radiation and help you determine, with your doctor, when procedures are and are not necessary. The FDA has created a guide for consumers to help reduce radiation risks (Computed Tomography (CT) Scans and Cancer Fact Sheet, 2019). The American Cancer Society also provides information about radiation exposure from imaging techniques. Mammography or a breast exam may identify an abnormality in breast tissue. In order to see if the cells in the tissue are cancerous or not, some of them are removed by either a needle biopsy that obtains a small sample of cells, or by a biopsy that attempts to remove all of the abnormal tissue. The lymph node closest to the tumor may be biopsied to see if the cancer has spread there. Multiple tests carried out on biopsied cancer cells include the following:\n• \n• The cells are examined under a microscope by a pathologist to judge whether they look normal (benign) or abnormal. The grade is a number that indicates how abnormal the cells look.\n• \n• Cells are tested for the presence of estrogen and progesterone receptors that may predict faster tumor growth. Cancers are characterized as ER-positive or ER-negative and PR-positive or PR-negative.\n• \n• Cells are also tested for another receptor called HER2 (human epidermal growth factor receptor 2). A high level of HER2 predicts faster tumor growth and the ability to metastasize. Cancers are characterized as HER2-positive or HER2-negative.\n• \n• Cells with low levels of all three receptors are called triple-negative.\n• \n• Multigene tests assess multiple genes in the cancer cells and are used to predict if a cancer is likely to recur or metastasize. If the Oncotype DX test or the MammaPrint test predicts that an early-stage cancer will become metastatic, chemotherapy can be used to lower the risk. (American Cancer Society, 2020; NCI, 2019d, 2019d) Making a diagnosis is not easy, whether based on a mammogram or on a biopsy. Misclassification is a problem with atypia and DCIS and can lead to undertreatment or overtreatment. Invasive cancer can be more obvious to diagnose: In one large study, an expert panel estimated that only 2 percent of initial invasive cancer diagnoses were incorrect. With DCIS the differences are more subtle, and the panel concluded that for cases initially diagnosed as DCIS, 19 percent should have been classified as atypia, and 12 percent should have been classified as invasive cancer (Elmore et al., 2016). Even if pathologists are very experienced or very confident in their opinion, the accuracy of a diagnosis is improved with a second opinion. It’s recommended that you obtain more than one pathologist’s opinion on any tissue sample. The good news is that pathologists agree that second opinions are helpful and many practices already require a second opinion (NCI, 2019a). After the biopsy, your doctor will receive the pathology reports with details about the tumor that are used to determine the stage of the cancer. You’ll hear the following terms used to describe how advanced a breast cancer is: the TNM system, the tumor grade, and the biomarker status. All three are used to determine the stage of the cancer.\n• \n• The TNM system provides a shorthand descriptor of the size of the tumor and whether it has spread in the breast and into the rest of the body. T refers to tumor, N to lymph nodes, and M to metastasis, and a complex set of numbers and letters is used to describe each of these aspects. The National Cancer Institute provides a detailed explanation of what all the TMN variations stands for.\n• \n• The tumor grade refers to how cancerous, abnormal, and aggressive the cancer cells look when the biopsy is examined under the microscope.\n• \n• The biomarker status refers to the presence or absence of HER2, estrogen and progesterone receptors, and to gene variants. You’ll discuss these factors and the cancer stage with your doctor, and this information will be used to devise a treatment plan.\n• \n• Stage 0 is cancer that has not spread beyond milk ducts.\n• \n• Stages I through III: This depends on multiple factors including tumor size, how many lymph nodes are involved, and the presence of HER2 and estrogen receptors.\n• \n• Stage IV breast cancer is also called metastatic breast cancer. This means the cancerous cells have metastasized—spread to other parts of the body. (Mayo Clinic, 2019a; NCI, 2019d, 2019d, 2019f)\n\nDiet likely affects the risk of developing breast cancer, but researchers still don’t fully understand how this works, and the effects found in studies are not large. The best advice from what scientists know now is to eat lots of vegetables and less processed meat and to drink less alcohol (Michels et al., 2007). Some studies have reported that people on a Mediterranean diet are less likely to develop cancer than people who consume other diets. In 2015, a meta-analysis concluded that strict adherence to a Mediterranean diet was associated with a 7 percent lower mortality rate from breast cancer. The reduced risk is primarily seen in postmenopausal ER-negative breast cancer, and a Mediterranean diet does not seem to be associated with fewer cases of ER-positive cancer. Whether the effect is due to the diet or to other factors in the lives of people consuming this type of diet, such as levels of exercise, remains to be demonstrated (Coughlin et al., 2018; Schwingshackl & Hoffmann, 2015). Alcohol has been consistently linked to risk of developing breast cancer. For every alcoholic drink consumed daily, the increased risk appears to be between 7 percent (NCI, 2019e), and 12.6 percent (Smith-Warner et al., 1998). One drink—containing fourteen grams of pure alcohol—is a twelve-ounce beer with 5 percent alcohol, a five-ounce glass of wine with 12 percent alcohol, or one and a half ounces of distilled spirits with 40 percent alcohol. The Women’s Health Initiative (WHI) is best known for having demonstrated an increased risk of breast cancer associated with use of HRT, but the WHI also included a dietary intervention that was not as conclusive. More than 48,000 postmenopausal women were randomly assigned to a control group or to a healthy diet group that received eighteen sessions with a dietitian. The theory was that a low-fat diet would result in lower estrogen levels, which would reduce the growth of ER-positive cancers. Women in the healthy diet group were directed to consume less fat of all kinds, and more fruits, vegetables, and grains. After nineteen years, the total number of women developing invasive breast cancer was not lower in the healthy diet group compared to the control group. However, fewer women in the healthy diet group had died from breast cancer or developed diabetes over the course of the study. These findings suggest that diets emphasizing consumption of vegetables, fruits, and grains in place of high-fat foods may help support breast health (Prentice et al., 2019). Fast-growing cancer cells need a large amount of energy, but they obtain it somewhat differently than noncancer cells do. Cancer cells take up and metabolize blood sugar—glucose—more than other cells. This is why radioactively labeled glucose is injected before a PET scan—tumors accumulate more radioactive glucose than other tissues do. Attempts have been made to starve cancer cells by restricting the amount of glucose they have access to. Glucose comes from carbohydrates that we eat, so it’s been proposed that a diet low in carbohydrates might be able to slow the growth of cancer cells. This sort of diet is called a ketogenic diet, because when there’s not enough glucose to feed the body, the liver uses fat to make ketone bodies as an alternative fuel. Ketogenic diets are high in fats of all kinds, sometimes including a purified oil called medium-chain triglycerides (MCT). Both animal and human clinical studies support the potential for ketogenic diets to be beneficial add-ons to standard cancer treatments. Ketogenic diets have slowed the growth of multiple types of tumors in animal research in some but not all studies. In most cases, the diet alone did not affect tumors, but it enhanced the efficacy of chemotherapy or radiation therapy. The question is whether this will hold true in people, and if so, for what types of cancer and with which variations of a ketogenic diet. So far, most of the clinical results have been from small case studies or pilot trials. In some cases, people have dropped out of clinical studies due to the difficulty and unpalatability of the ketogenic diet, but in other cases, ketogenic diets were associated with improvements in blood sugar levels and quality of life. There is very little clinical research on ketogenic diets in people with breast cancer. One small study assigned women with breast cancer to a ketogenic diet based on MCT or to a control diet for a three-month period while undergoing chemotherapy. In women with locally advanced breast cancer—but not metastatic breast cancer—the ketogenic diet was associated with better survival after two years. Hopefully these intriguing results will be replicated and expanded on (Hopkins et al., 2018; Khodabakhshi et al., 2019; Klement et al., 2020, 2020; Poff et al., 2013; Weber et al., 2019). After cancer cells take up glucose from the blood, they burn it only partially, yielding lactic acid and other compounds—this is known as the Warburg effect. Burning a fuel only partially doesn’t yield as much energy as burning it completely, and it’s not clear why cancer cells work hard to take up glucose only to waste some of its energy potential. Burning glucose completely requires oxygen—for example, a wood fire can’t burn without air. It’s been suggested that tumors don’t have sufficient oxygen to burn glucose completely. As it turns out, there may be other reasons that cancer cells don’t burn glucose completely. One possibility is that the glucose is needed as a building block to form new cells. It’s also been proposed that lactic acid helps prevent cancer cells from being killed by white blood cells (Seyfried & Shelton, 2010; D. Zhang et al., 2019). The Physicians Committee for Responsible Medicine is petitioning the Food and Drug Administration (FDA) to require cheese manufacturers to put the following warning on all dairy cheese products: “Dairy cheese contains reproductive hormones that may increase breast cancer mortality risk.” The theory is that the small amount of estrogen in milk is concentrated in high-fat products such as some cheeses, and could stimulate the growth of breast cancer cells. Based on the available evidence, this warning appears to be uncalled for. Quite a few studies have been carried out on the relationship between dairy consumption and risk of breast cancer, and many have found either no correlation or that dairy products in the diet are associated with less breast cancer, not more. The PCRM cited the conclusion by Kroenke et al. (2013) that consuming one or more servings of high-fat dairy products per day was associated with poorer survival of women with breast cancer. However, there was nothing in this study specifically calling out cheese. In contrast, a much larger study published in 2020 looked for correlations between food intake and development of breast cancer in healthy women. The researchers found that cheese was not associated with any increased risk, but high intake of dairy milk—either high or low in fat—was correlated with a higher risk of breast cancer. Soy milk was associated with a lower risk of breast cancer. The evidence is not yet strong enough to warrant giving up cheese, and further research is needed to sort out the conflicting findings on milk and other dairy products (Fraser et al., 2020; Kroenke et al., 2013). Eating red meat and processed meats like bacon and salami has been associated with a higher risk of breast cancer in some studies but not in others. A 2018 meta-analysis of eighteen studies concluded that the prevalence of breast cancer was 9 percent higher in people consuming processed meats compared to those who did not eat processed meats. Eating any kind of red meat was associated with a smaller but not statistically significant increased risk. It could be that people who eat meat also tend to do other things that promote cancer. Or it could be that something in meat is cancer-promoting. Factors in meat that are proposed to be cancer-promoting include nitrates and nitrites added to processed meats, and heterocyclic amines, which are carcinogens that form when meat is smoked, fried, grilled, or browned by cooking at high temperatures (Farvid et al., 2018).\n\nNo supplements have been shown to prevent or treat breast cancer. However, vitamin D is well worth taking if you don’t get much sun or have dark skin, and adequate vitamin D levels could affect risk of breast cancer. Ginger may help with nausea caused by treatment regimens. Multiple types of evidence suggest that vitamin D possesses anticancer activity and that low levels of vitamin D are a risk factor for cancer. Studies in animals and in cells have shown that vitamin D can slow the growth of cancer cells and can reduce invasiveness and metastasis (Manson et al., 2019). A meta-analysis recently concluded that women with vitamin D deficiency had a 90 percent higher risk of breast cancer than women who were not deficient. Another meta-analysis concluded that low blood levels of vitamin D predicted higher mortality rates in people with breast cancer. Blood levels of vitamin D have been shown to be lower in Black women than in White women in the US, which may contribute to the higher rates of invasive cancer in Black women after an initial diagnosis of localized cancer (Grant, 2020; Hossain et al., 2019; Y. Kim & Je, 2014). A large randomized clinical trial was carried out to see if supplementation with vitamin D would lower rates of cancer or heart disease. Over 25,000 people were given 2,000 IU (international units) of vitamin D or a placebo daily for four to six years. The primary conclusion was that there were no overall effects on disease or mortality. However, Black participants in the vitamin D group had 23 percent less invasive cancer than those in the placebo group—this was not called out because it was not quite statistically significant. And cancer deaths did start to go down after one year of vitamin D supplementation. Meta-analyses have also reported that vitamin D supplements reduce death from all cancers (Manson et al., 2019). Additional clinical trials are needed to study people with low vitamin D levels—older adults, people with darkly pigmented skin, and those who get little sun exposure—who would be expected to benefit the most from supplements. If you’re curious about vitamin D, see our article for general information on diet, supplements, and sun exposure that can help achieve optimal vitamin D status. One theory as to why the Mediterranean diet is associated with lower rates of cancer than other diets are is that it is rich in plant foods that contain antioxidants. However, clinical studies have not demonstrated cancer prevention by antioxidant supplements. In a randomized controlled trial, high doses of vitamin C, vitamin E, or beta-carotene did not reduce cases of cancer in 7,600 women over a period of nine years. In another controlled trial, men who smoke were given beta-carotene supplements in the hope that this antioxidant would prevent lung cancer. The result was an eye-opener for the research community: The men taking beta-carotene had more, not less, lung cancer and higher mortality than the men taking a placebo did. So antioxidant supplements have not been shown to prevent cancer and could cause harm. The role that naturally occurring plant antioxidants play in cancer prevention is not clear (Alpha-Tocopherol, Beta Carotene Cancer Prevention Study Group, 1994; Lin et al., 2009; Schwingshackl & Hoffmann, 2015). Asian countries have lower rates of breast cancer than Western countries, and it’s been proposed that dietary factors, including green tea, might be responsible. Green tea and black tea are both made from leaves of the Camellia sinensis plant, but they are processed differently, and green tea retains more of the catechin type of antioxidants. One of these catechins is EGCG (epigallocatechin gallate), which has anticancer activity in animal research. Many studies have tried to show a correlation between the amount of green tea people drink and their risk of getting breast cancer, but meta-analyses have concluded that drinking green tea is not consistently associated with less breast cancer (Gianfredi et al., 2018; Najaf Najafi et al., 2018). As green tea extracts came into widespread use as supplements, safety issues also arose. Concentrated green tea extracts have been implicated in damage to the liver, and research on their safety is being sponsored by the National Center for Complementary and Integrative Health (NCCIH). The NCCIH recommends not using green tea extract if you have a liver problem and to stop using it if you have a sign of liver damage, such as jaundice or dark urine. When taken in tea or with food, green tea or an extract containing up to 700 milligrams of EGCG appears to be safe. But when taking green tea extract on its own, limiting the amount of EGCG to 300 milligrams is safest (Hu et al., 2018; National Center for Complementary and Integrative Health, 2006). Ginger has been used successfully to reduce nausea and vomiting during pregnancy and after surgery. It has also been shown to be helpful in managing the effects of chemotherapy in some but not all clinical trials. Its benefit may depend on the type of cancer, the types of chemotherapy drugs, and the ginger formulation. One large clinical trial found that a ginger extract significantly reduced nausea from multiple types of chemotherapy in people with breast and other cancers. This was a specialized extract from Aphios equivalent to 250 to 500 milligrams of ginger root, twice daily (Ryan et al., 2012; Thamlikitkul et al., 2017). There is a theory that dietary calcium D-glucarate can support the detoxification and excretion of estrogen, which may help prevent breast cancer. In order to excrete estrogen, the body makes it water-soluble. One way this is done is by attaching a molecule called glucuronic acid. Glucarate could in theory—by inhibiting the enzyme beta-glucuronidase—prevent the removal of glucuronic acid and help keep estrogen water-soluble so that it can be excreted. In studies of rats, an extremely high dose of calcium D-glucarate was reported to block mammary tumors induced by a chemical carcinogen. The supplement reduced estrogen levels only slightly, and it is not clear how it worked and if this is relevant for humans. The evidence in support of a benefit of calcium D-glucarate is not sufficient to justify taking a dietary supplement (Maruti et al., 2008; Walaszek et al., 1986).\n\nFollowing a breast cancer diagnosis, it’s important to get support from friends and family and to prioritize eating well, physical activity, stress management, and sleep. A 2016 review concluded that eating a healthy diet and getting regular physical activity was associated with a reduced risk of breast cancer. The American Cancer Society’s guidelines to reduce cancer risk are to be at a healthy weight; be physically active; eat healthy foods focusing on vegetables, fruits, and whole grains; and limit sugar, red meat, processed meat, and alcohol (Kohler et al., 2016; Kushi et al., 2012). People undergoing treatment for cancer may benefit from help for emotional distress and stress management. A number of therapies and educational programs for stress management have been evaluated and significant benefits have been reported in some but not all studies. In one study of women who’d recently had breast cancer surgery, those provided with ten weeks of cognitive behavioral stress management reported less depression and better quality of life than women who received just one day of psychological education. These benefits lasted through eleven years of follow-up (Stagl et al., 2015). Significant benefits of a psychological intervention program have also been reported by researchers at Ohio State University, Columbus. They designed a program to reduce stress and lower emotional distress for women undergoing chemotherapy for stage II or III breast cancer. Clinical psychologists led weekly small group sessions for four months that taught progressive muscle relaxation for dealing with stress, and positive coping techniques to deal with emotional distress. They strategized how to find social support and use assertive communication to meet medical and psychological needs. Women who completed the program had lower levels of anxiety, better lifestyle habits, and more active white blood cells than those in a control group that received standard treatments only. Feeling supported by other members of the group appeared to be important for achieving lower levels of stress. Following four months of weekly sessions, monthly sessions were provided for an additional eight months. In the following years, the women who had received the psychological intervention had about half the cancer recurrence and mortality as women in the control group (Andersen et al., 2004, 2007, 2008). Not all programs have reported such impressive success. A 2013 review of studies on multiple types of cancer concluded that individual and group psychotherapy for anxiety, depression, and quality of life provided “small to medium” benefits. A 2018 meta-analysis concluded that spirituality and mindfulness-based therapies have small benefits for well-being (Faller et al., 2013; Xing et al., 2018). There is no gold standard for therapies for coping with the emotional and physical demands of cancer diagnosis and treatment. Evaluate the options available through your medical team, as well as those available through clinical trials. If you do not wish to participate in a stress-management program, rest assured that you are not neglecting a proven therapy. The American Cancer Society (ACS) provides a wide range of services and resources for people with cancer and for family members and caregivers. You can call the cancer hotline at 800.227.2345 twenty-four hours a day, seven days a week, and there is a live chat option. Specialists answer questions about all aspects of cancer including treatment options, side effects, and support services. Other benefits the ACS provides include a cancer survivors network with chat rooms and discussion boards, and a searchable database of resources by geographical location. Under programs and services, you’ll find links to programs that provide lodging near treatment facilities and rides to treatment appointments. CancerCare provides counseling, support groups, education, and financial assistance. At its New York City national headquarters, free breast prostheses and wigs are available at regularly scheduled clinics. CancerCare moderates online support groups and telephone support groups targeted at a number of cancer diagnoses and demographics. The National Cancer Institute has compiled a list of over one hundred organizations that provide support services nationwide, including financial support, for people with cancer and for their families. When being treated for breast cancer, it may be difficult to find the time or energy to exercise, and there may be fear around damaging breast tissue or exacerbating tissue swelling. However, exercise has been associated with a lower risk of developing breast cancer, and studies have also shown that exercise is beneficial for people with breast cancer while they are receiving chemotherapy. This is true for aerobic exercise, resistance exercise, low-intensity exercise, and supervised moderate- to high-intensity exercise programs. In addition to improved fitness, exercise programs have been associated with less pain and nausea as well as a speedier return to work post-treatment. The theory is that exercise increases blood flow, which improves delivery of chemotherapy drugs to the tumor. goop’s interview with Kerry Courneya, PhD, has more information about research on exercise during treatment for breast cancer. Discuss with your health care team which exercise programs are available and best for you (Courneya et al., 2007; van Waart et al., 2015).\n\nMany factors affect the treatment options for breast cancer: the size of the tumor, whether it has spread to the lymph nodes or elsewhere, the type of cancer, and the presence of estrogen and progesterone receptors and HER2, as well as age, overall physical health, and menopausal status. Possible treatment options to be discussed with an oncologist include surgery, radiation therapy, chemotherapy, hormone therapy, and immunotherapy. Metastatic breast cancer that has spread outside of the breast can be treated in order to control and limit tumor growth; it is generally not considered curable. A small percentage of people with metastatic breast cancer have survived for over ten years (Cheng & Ueno, 2012; Westphal et al., 2018). For small tumors, a lumpectomy may be used to remove only the tumor. DCIS is treated with lumpectomy and possibly also with radiation—which will reduce the chances of recurrence and developing invasive cancer. In addition to removing the tumor, care is taken to remove enough surrounding tissue to remove all cancer cells (NCI, 2019f). Breast cancer commonly spreads through the lymphatic system. During surgery, the lymph node closest to the tumor will be removed in a procedure called sentinel lymph node biopsy. If cancer is found in this lymph node, additional lymph nodes in the armpit may be removed. A total mastectomy removes all of the breast including the nipple. If a person has a family history of breast cancer or a genetic predisposition, they may elect surgery to remove the other breast, which is called a double mastectomy. Skin-sparing and nipple-sparing mastectomy that may preserve the appearance of nipples is increasingly available. However, the nipples’ sensation and sexual arousal is not typically preserved (Dossett et al., 2016). Breast reconstruction may use silicone or saline implants or the woman’s own fat tissue. In some cases, reconstruction can be carried out at the same time as surgery. In other cases, before implants can be inserted, tissue expanders may have to be inserted and gradually filled up weekly to stretch the skin. This procedure can be uncomfortable. The FDA recommends regular MRI scans to check for leaks with silicone implants. We discussed complications from breast implants in our interview with Kevin Brenner, MD. Many women choose to forgo breast reconstruction because of cost, to avoid additional surgery and prolonged recovery, because they don’t want a foreign object implanted in their bodies, or for many other combinations of personal reasons. Breastcancer.org provides information and advice for women who feel pressured by their doctors or family members to undergo reconstructive surgery. An alternative to reconstruction is breast prostheses—premade or custom breast-shaped silicone, foam, or fiberfill inserts. And some women choose living flat: going without any implant or prosthesis after a single or double mastectomy. There is no right or wrong choice here—it’s personal, and if you’re reading this and considering your options, we hope you’re able to pick what works best for you and that you feel supported in whatever decision you make (Mayo Clinic, 2019a; U.S. Food and Drug Administration, 2019). Chemotherapy—oral or intravenous drugs that kill cancer cells—for breast cancer includes methotrexate, cyclophosphamide, doxorubicin, fluorouracil, and taxanes (paclitaxel and docetaxel). It may be used to shrink a tumor before surgery, to kill any remaining cells after surgery, or to treat a cancer that has spread. Chemotherapy works by killing fast-growing cells, so in addition to targeting cancer cells, it can kill other fast-growing cells. Toxicity to cells lining the mouth and gut causes soreness, nausea, and vomiting. Toxicity to fast-growing white blood cells damages the immune system and increases the danger of infection. Hair loss results from toxicity to the cells that produce hair. Fatigue is another major side effect (Mayo Clinic, 2019a; NCI, 2019d). The radiation used to kill cancer cells can be high energy X-rays or other types of radiation. It is used to treat breast tissue or the chest wall after lumpectomy or mastectomy to destroy any remaining cancer cells and decrease the chances of the cancer returning. Radiation can be administered as a beam that passes through the skin into the tumor (external beam radiation) or as radioactive particles directed inside your body (brachytherapy). Proton beam therapy is a highly targeted type of beam that may be used to minimize radiation exposure to nearby tissues, such as the heart. In younger women, radiation therapy may increase the risk of future cancers (Chowdhary et al., 2019; Mayo Clinic, 2019a; NCI, 2019d). Talk with your team about caring for skin after radiation treatment. The Mayo Clinic and Breastcancer.org have advice for skin damaged by radiation. ER-positive breast cancer cells grow in response to estrogen, and treatment of ER-positive tumors may include a drug like tamoxifen that blocks estrogen binding to its receptors. As an alternative to blocking estrogen receptors, treatments may be used that reduce the level of estrogen in the body. The ovaries can be prevented from producing estrogen by drugs called aromatase inhibitors or LHRH agonists. Or the ovaries—the site of most estrogen production—can be surgically removed. Use of a hormone-blocking treatment for five years reduces the chance of the cancer recurring. After treatment for breast cancer, tamoxifen can help prevent cancer in the other breast of BRCA carriers. The side effects of blocking estrogen are similar to menopausal symptoms: vaginal dryness, hot flashes, night sweats, and bone thinning. In some cases of ER-positive breast cancer, estrogen blockers may be the only treatment necessary. In other cases, an estrogen blocker may be combined with chemotherapy (Mayo Clinic, 2019a; NCI, 2019d). Chemotherapy kills all fast-growing cells, and radiation therapy kills all cells that the focused beam encounters. The ideal treatment would be more specific for cancer cells, sparing healthy cells to reduce side effects like hair loss and nausea. Some therapies are being developed along this line, with the best known one being drugs that target HER2. Cancer cells that have HER2 may be treated with monoclonal antibody drugs such as trastuzumab. Other targeted drugs that are used in certain situations include tyrosine kinase inhibitor drugs, such as neratinib; mammalian target of rapamycin (mTOR) inhibitors, such as everolimus; PARP inhibitors, such as Olaparib; and cyclin-dependent kinase (CDK4/6) inhibitors, such as abemaciclib. These targeted drugs are not without their own side effects (Hafner et al., 2019; Mayo Clinic, 2019a; NCI, 2019d). Immunotherapy involves stimulating white blood cells in the body to kill cancer cells. Tezolizumab is a drug used to help T cells, a type of white blood cell, kill cancer cells that have metastasized. It is used only when cancer cells are triple-negative, meaning that they don’t have receptors for estrogen or progesterone and don’t have HER2 (Mayo Clinic, 2019a; NCI, 2019d). Only 1 percent of breast cancer cases occur in men, but the incidence has been increasing over the past few decades. Although we know that there are differences in breast cancer between sexes, clinical trials have not been carried out to determine if the standard of care for women is also appropriate for men. Men tend to get breast cancer when they are older and tend to have more ER-positive cancer cells and more positive lymph nodes. Low testosterone is a risk factor for breast cancer (Yadav et al., 2020). Unfortunately, although the risk of breast cancer is significantly increased in transgender women compared to cisgender men, there are no evidence-based guidelines for treatments specific to this population. The Susan G. Komen Foundation and UCSF Transgender Care in the Department of Family and Community Medicine at the University of California, San Francisco, provide resources and information on screening guidelines. We hope that research will result in specific treatment guidelines soon. Discuss possible side effects of medical treatments with your doctor so that you can take preventative measures and are prepared to take action quickly should side effects occur.\n• \n• Lymphedema is swelling and pain that results from damage to the lymphatic system. Lymph nodes and vessels make up a drainage system, and when they are removed, damaged, or blocked by surgery or by radiation therapy, fluid can build up. You may notice a heavy, achy feeling around your armpit or other areas of treatment. You may see a dent when you press the swollen area. If the condition gets worse, it may be difficult to move that part of your body, and the area may be red, warm, and itchy. Skin can become tight-feeling, and pressing on it may no longer leave a dent. At this point, the risk of infections is higher than normal.\n• As soon as any of these symptoms occur, talk to your doctor about managing and treating lymphedema as quickly as possible. Protect your skin to prevent scratches and infections. Exercise gently as advised by your doctor to keep body fluids moving. Look into therapeutic massages specifically designed to increase lymph drainage. Information about lymph massage can be found in this interview with a certified lymphedema therapist. There are compression garments and devices that your health care team can recommend if necessary (Mayo Clinic, 2019a; NCI, 2015c).\n• \n• Fatigue is a common side effect of most cancer treatments. People describe feeling tired and run-down and having no energy—sometimes even after resting. Talk to your doctor about possible contributors to fatigue such as anemia, pain, and medications. If you need help controlling pain, consult a pain specialist or a palliative care specialist. It’s not easy to stay well-nourished during cancer treatment due to the side effects of the medications, and individual consultation with a dietitian is recommended. Light exercise may be helpful, but also set aside time to rest.\n• \n• Nausea and vomiting are common side effects of some chemotherapy drugs. The best approach is to take preventive measures—don’t wait until you feel nauseous. Several medications can be prescribed to control nausea. Eating small meals and avoiding skipping meals may help prevent nausea. Some people find it helpful to eat something before chemotherapy treatment. Acupuncture treatments can help some people with nausea. Deep breathing, meditation, listening to music, aromatherapy, and hypnosis can also be helpful. Drink plenty of fluids, especially if you are vomiting. If cooking smells bother you, ask someone else to do the cooking (Mayo Clinic, 2018; NCI, 2005, 2015e).\n• \n• Loss of appetite and difficulty eating may be due to nausea or to an altered sense of taste that makes foods unappealing. Chemotherapy can cause damage to the mouth and throat that makes eating difficult and unpleasant. Ask your doctor or a dietitian to help you with a diet of soft foods to prevent dehydration and malnutrition. Care for your mouth with a very soft toothbrush and saline rinses. The National Cancer Institute offers detailed advice on oral care (NCI, 2015a).\n• \n• Hair loss—called alopecia—can result from chemotherapy. Treat your hair gently: Use a soft brush, pat it dry, and don’t use hot dryers or curling irons. You may choose to shave your head until hair starts to regrow in two to three months, or you may cut it short. Be sure to take good care of your scalp with sunscreen or a comfortable hat. Your health care team should have recommendations for wigs, scarves, and support groups. Chemotherapy drugs called taxanes—paclitaxel and docetaxel—may result in severe damage to hair follicles and permanent hair loss. Scalp cooling may be helpful to protect follicles from taxanes but is not a reliable solution (NCI, 2015b; Purba et al., 2019).\n• \n• Nerve, muscle, and joint pain may result from treatment with the chemotherapy drugs docetaxel and paclitaxel. Short-term muscle and joint pain is referred to as taxane acute pain syndrome. Repeated use of these and other chemotherapy drugs can also result in chronic pain in the hands and feet, referred to as chemo-induced peripheral neuropathy. “Neuropathy” means nerve damage, and it can cause tingling, numbness, weakness, or sharp, burning pain. Sometimes the symptoms are acute, ending within a few days of drug treatment, and other times they persist for months or years. Sometimes the pain makes it necessary to stop drug treatment, so being able to prevent neuropathy is important not only for immediate quality of life but also for long-term success for cancer eradication.\n• In order to prevent nerve damage to the hands, attempts have been made to reduce the amount of blood—and therefore drug—reaching the hands. Cold treatment (cryotherapy) and compression have been used to constrict blood vessels in the hands during drug infusion, however, they have not been shown to be very effective. Wearing frozen gloves during chemotherapy may have some benefits (Asthana et al., 2020; Beijers et al., 2020).\n• Preliminary results using drugs to prevent and treat neuropathy are promising but need to be confirmed. A controlled clinical study concluded that the drug gabapentin, given during chemotherapy, is effective at preventing nerve damage and pain (Aghili et al., 2019). The drug pregabalin was shown in a recent clinical trial to be helpful for taxane-induced peripheral neuropathy in people with breast cancer (Salehifar et al., 2020).\n• \n• Early menopause results from estrogen-blocking therapies. The usual oral medications for menopausal hot flashes, vaginal dryness, and discomfort during intercourse may contain estrogen that would promote the growth of ER-positive breast cancer cells. Talk to your doctor about whether an estrogen-containing vaginal and vulvar cream, ring, or suppository is appropriate for you. Use a vaginal and vulvar moisturizer regularly, and use a lubricant during sex. Ask your health care team about the best nonirritating products. The American Cancer Society assures us that almost all women can still orgasm after cancer treatment (American Cancer Society, 2018).\n• \n• Severe constipation results from opioid painkillers, and many drugs used to treat breast cancer can cause constipation. Your doctor may prescribe a stool softener such as docusate (Colace) and laxatives such as bisacodyl (Dulcolax), senna, polyethylene glycol (Miralax), and milk of magnesia. Moving, walking, and drinking liquids can help increase bowel movements (Breastcancer.org, 2020a; Harvard Medical School, 2018).\n• \n• Brain fog—meaning memory or concentration problems—is sometimes a consequence of chemotherapy. Your doctor can tell you if you are at increased risk from your particular treatment regimen. It may be helpful to plan the most demanding activities for the time of day that you feel best. It’s normal to have to use a daily planner and lists to help remember things. Ask your health care team about resources and support available from social workers and other specialists (NCI, 2015d). Cancer and cancer therapies can be painful and emotionally difficult. Palliative care focuses on providing relief from the symptoms of breast cancer and the side effects of treatments in order to improve quality of life. It ranges from preventing the nausea and fatigue brought on by cancer treatments to providing spiritual and emotional support. Ask your medical team about options for palliative care. It’s human nature to get excited about the possible efficacy of new drugs, especially those that are heavily marketed. We are told about short-term effects but not about how there is often a lack of data on long-term benefits and side effects. Vinay Prasad, MD, MPH, at the Oregon Health & Science University in Portland, Oregon, is a practicing oncologist who wants to make clear the limitations of anticancer drugs. You can follow him on Twitter to get his reviews of clinical trials—he’s known for explaining the limitations of genomic-based medicine, personalized medicine, and the latest drugs. He has published research suggesting that the FDA has approved cancer drugs with inadequate evidence that the drugs will improve the long-term survival of people with cancer. New drugs tend to be costly and can have side effects that lower quality of life. Ask your doctor about the risks and benefits of the drugs you are considering (Hall, 2018; C. Kim & Prasad, 2015).\n\nThere is some evidence that medicinal mushrooms may help support quality of life during cancer treatment. There is also some preliminary evidence that glutamine and omega-3 fatty acid supplements may help prevent chemotherapy-induced neuropathy. The use of antioxidant supplements during cancer treatment has been associated with reduced efficacy of the treatment. In her book Radical Remission: Surviving Cancer against All Odds, Kelly Turner MS, PhD, defines a radical remission as one that is not predicted by conventional medical science—when cancer is cured in a statistically unexpected way. It could be that a cancer goes away completely without any medical intervention. Or that a cancer that does not go into remission after standard treatment does respond to alternative healing methods. Turner found that such cases existed but were not being published or analyzed, which is contrary to the scientific obligation to investigate anomalous cases that do not fit into existing hypotheses. She created a database where such cases can be easily submitted and tracked. Turner analyzed over a thousand cases of radical remission and identified factors that people thought were important in their healing: radically changing your diet, taking control of your health, following your intuition, using herbs and supplements, releasing suppressed emotions, increasing positive emotions, embracing social support, deepening your spiritual connection, and having strong reasons for living. Turner is not suggesting that people with cancer forgo conventional treatments, nor is she suggesting that her findings prove the benefits of these behaviors. She wants to learn about the factors associated with positive outcomes, and to encourage research into the benefits of these regimens. The ultimate cancer treatment would be one that stimulates the immune system’s ability to destroy cancer cells. Hot water extracts of the fruiting bodies of mushrooms have been used traditionally for thousands of years for immune support. Bioactive components of mushrooms include proteins, lectins, triterpenes, and complex carbohydrates, like beta-glucans. More recently, mushroom mycelia, the underground rootlike networks that mushrooms grow from, have been also shown to have immune-stimulating properties. Intriguing preliminary results have been reported from experiments on cancer cells and on breast cancer in mice. One small human study reported that two grams of Agaricus sylvaticus daily led to improved digestion in people undergoing chemotherapy for breast cancer. However, there is not yet confirmation from clinical studies of significant benefits of mushrooms for breast cancer (Valadares et al., 2013; Wong et al., 2020).\n• \n• Turkey tail (Trametes versicolor). Turkey tail mushroom is used in traditional Chinese medicine for fatigue and immune health. It contains immune-enhancing compounds that are thought to be beneficial in some cancers, especially colorectal cancer. There is also evidence that turkey tail extracts may reduce side effects of cancer treatments. A turkey tail mycelium extract called polysaccharide-K (PSK) is commonly given to cancer patients in Japan. Several clinical trials have evaluated the use of three grams of PSK daily as an add-on to chemotherapy in breast cancer, with results suggesting a benefit in certain cases of ER-negative cancer. A small clinical trial suggested that turkey tail mycelial powder given to women with breast cancer after completion of chemotherapy and radiation therapy may help boost white blood cell numbers. However, the Susan G. Komen Foundation advises that the evidence is not sufficient to conclude that turkey tail products will increase survival of people with breast cancer (Pilkington et al., 2016; Sakamoto et al., 2006; Standish et al., 2008; Torkelson et al., 2012).\n• \n• Shitake (Lentinula edodes). There is evidence that shiitake extracts can help support a higher quality of life in people being treated for lung cancer, and there is some evidence suggesting benefits for breast cancer. Lentinan is a beta-glucan extract from shiitake mushroom that has immune-stimulating properties. It is given clinically by injection and is used as an add-on therapy for lung cancer in China. A team of researchers reviewed thirty-eight randomized clinical trials in China that used lentinan in addition to conventional treatment for lung cancer and found that both quality of life and the response of the tumor to treatment were significantly increased with lentinan treatment. A randomized clinical trial assessed the value of a Lentinula eodes mycelial extract in people undergoing chemotherapy for breast cancer and reported a small improvement in quality of life (Nagashima et al., 2017; Wong et al., 2020; Y. Zhang et al., 2018).\n• \n• Reishi (Ganoderma lucidum). Beta-glucan polysaccharides in reishi mushrooms are believed to stimulate immune cells to destroy cancer cells, and unique reishi triterpenes are thought to be toxic to cancer cells. An extensive review of clinical studies assessing reishi mushrooms for cancer treatment found that the majority of the studies had a small sample size and were not rigorously conducted. The authors concluded that there was not yet evidence that reishi mushrooms were an effective cancer treatment, but that there was some evidence that reishi may help improve tumor response to chemotherapy. The researchers did find that reishi mushrooms improved quality of life among people with cancer, and that reishi may have a small positive effect on immune status, although further research is required to know whether or not reishi mushrooms stimulate NK cell activity. None of the studies specifically assessed breast cancer (Jin et al., 2016). European mistletoe (Viscum album) has been used traditionally for arthritis and headaches, and now it’s used in Germany to boost the immune system’s ability to fight cancers, including advanced breast cancer. Mistletoe is not approved to treat cancer in the US. It’s not clear exactly how mistletoe works, but it is known to stimulate white blood cells. A meta-analysis concluded that mistletoe extracts given by subcutaneous injection significantly improved quality of life in people being treated for cancer. Researchers analyzed data from thirty studies—nine of which focused on breast cancer—that were blinded and controlled to varying degrees. The authors concluded that even after taking into account the inconsistent quality of the research, the ability of mistletoe injections to improve quality of life was real. The biggest improvements were for nausea and pain symptoms (Loef & Walach, 2019). However, the NIH’s National Center for Complementary and Integrative Health (NCCIH) reached a different conclusion. It found that the research was inconclusive and caution against oral use of mistletoe. FYI: This is not the same plant as American mistletoe (Loef & Walach, 2019; National Center for Complementary and Integrative Health, 2016). Chemotherapy-induced peripheral neuropathy (CIPN) is a common side effect of chemotherapy drugs as described in the conventional treatments section of this article. Ways to prevent nerve damage and treatments for the pain are needed. A number of supplements are purported to be helpful, but more research is required before concluding that any particular supplement has meaningful benefits for CIPN. And a large clinical trial found that acetyl-L-carnitine (ALCAR) supplements may worsen symptoms of CIPN. Whether or not acupuncture is useful for treating neuropathic pain is not clear (Samuels & Ben-Arye, 2020). Two small clinical trials have reported that omega-3 supplements can reduce neuropathy in people treated with paclitaxel, but confirmation will require larger trials. Opinions differ as to whether goshajinkigan, an herbal blend from Japanese traditional medicine, helps reduce the incidence of CIPN. Although small clinical studies have suggested that either glutamine or glutamate—they are closely related—may be somewhat helpful for CIPN, further study is needed before claiming definitive benefits. Preliminary claims that vitamin E, glutathione, or N-acetylcysteine prevented CIPN have not been confirmed by larger trials (Anoushirvani et al., 2018; Ghoreishi et al., 2012; Jordan et al., 2019; Kuriyama & Endo, 2018; Leal et al., 2014; Loven et al., 2009; Samuels & Ben-Arye, 2020). It has been proposed that antioxidant supplements may be able to reduce side effects and increase the efficacy of chemotherapy and radiation therapy. However, there is also preliminary evidence that antioxidants may reduce the efficacy of certain cancer treatments, so oncologists do not encourage their use (Ilghami et al., 2020). Researchers from a number of medical institutions surveyed 1,134 people with breast cancer about their use of dietary supplements. They found that people who reported taking the antioxidants vitamins A, C, and E; carotenoids; or coenzyme Q10 during treatment were more likely to have their cancer recur at six months. Use of vitamin B12 and iron supplements, which are not antioxidants, was also associated with worse outcomes, but use of multivitamins was not. This does not prove that the supplements caused the recurrence, as the link may be due to other unexplained causes. But it does not seem that antioxidant supplements are helpful, and this research lends evidence to the argument against their use (Ambrosone et al., 2019). Psilocybin is a naturally occurring psychedelic compound found in certain types of mushrooms. Two double-blind studies have demonstrated that under carefully controlled conditions, psilocybin-assisted psychotherapy can significantly reduce depression and anxiety associated with cancer. In 2016, Roland Griffiths, PhD, and his colleagues at Johns Hopkins reported that a single psilocybin treatment decreased depression and anxiety among people with life-threatening cancer diagnoses. People with various cancers, including breast cancer, were given a full dose of psilocybin or a low dose considered inactive. Treatment sessions were carried out with trained monitors, who also met with the subjects on multiple occasions before and after the treatment session. People who received the larger dose of psilocybin showed less depression and anxiety, including less anxiety about death, as well as increased feelings of optimism and the meaningfulness of life. A similar study at NYU School of Medicine demonstrated that psilocybin plus psychotherapy reduced depression and anxiety associated with cancer more effectively than psychotherapy alone. In many people, benefits were sustained for at least six months (Griffiths et al., 2016; Ross et al., 2016).\n\nNew and Promising Research on Breast Cancer There is an enormous amount of ongoing research covering every aspect of breast cancer, including environmental factors, genetics, the role of the immune system, and the metabolism of cancer cells. Minimally invasive ways to screen for cancers, such as blood tests, are being developed. Researchers are developing drugs with greater specificity for cancer cells and fewer side effects. Here are some examples—not a comprehensive list—of current research on breast cancer. How Do You Evaluate Research Studies and Identify Promising Results? The results of clinical studies are described throughout this article, and you may wonder which treatments are worth discussing with your doctor. When a particular benefit is described in only one or two studies, consider it of possible interest and perhaps worth discussing, but definitely not conclusive. Repetition is how the scientific community polices itself and verifies that a particular treatment is of value. When benefits can be reproduced by multiple investigators, they are more likely to be real and meaningful. We’ve tried to focus on review articles and meta-analyses that take all the available results into account; these are more likely to give us a comprehensive evaluation of a particular subject. Of course, there can be flaws in research, and if by chance all of the clinical studies on a particular therapy are flawed—for example with insufficient randomization or lacking a control group—then reviews and meta-analyses based on these studies will be flawed. But in general, it’s a compelling sign when research results can be repeated. Estrogen promotes the growth of some breast cancer cells, and blocking estrogen is an important part of breast cancer treatment. We are exposed to many chemicals that mimic estrogen and bind to estrogen receptors—they are called xenoestrogens or endocrine disruptors. These include estrogenic compounds from plants (phytoestrogens), PCBs (polychlorinated biphenyls), BPA (bisphenol A), phthalates, dioxins, brominated flame retardants, certain pesticides, and many other chemicals used in food, agriculture, and cosmetics. Although there is evidence suggesting an association between levels of xenoestrogens in women and their risk of developing breast cancer, it is not clear whether the exposure most people have in their daily life can contribute significantly to breast cancer risk. Oxybenzone and propylparaben are xenoestrogens that have been detected in the urine of 96 percent of people in the US. Oxybenzone (BP-3) is widely used in sunscreen to block UV rays and in cosmetics as a fragrance enhancer. Propylparaben is used as a preservative in foods—although it is banned in Europe for this purpose—and in cosmetics. In the Long Island Breast Cancer Study Project, an increased risk of breast cancer was associated with having high levels of urinary parabens. Recent research has shown that low levels of oxybenzone and propylparaben that are comparable to an average person’s exposure have estrogen-like effects on human breast cells. It’s possible that these common chemicals may be present in our bodies at high enough levels to promote tumor development (Ben-Jonathan, 2019; Calafat et al., 2008; Majhi et al., 2020; Mnif et al., 2011; Parada et al., 2019). Many types of hair products including hair dyes and chemical straighteners contain endocrine disruptors and possible carcinogens. Some but not all studies have correlated use of hair dyes and chemical straighteners with increased risk of breast cancer. The types of products, ingredients, and patterns of use may differ among women of different races. A large study of 46,000 Black and White women asked them about their use of hair products, then followed up with them over eight years to see if they developed breast cancer. Personal use of permanent hair dyes was associated with a significant 45 percent higher risk of breast cancer in Black women but not in White women. Among all women, increased risk of breast cancer was correlated with applying semipermanent hair dye to other people in a nonprofessional setting. Personal use of chemical hair straighteners four or more times yearly was also associated with a higher risk of breast cancer in all women (Eberle et al., 2019). These results suggest that hair dyes may be of particular concern to Black women. However, these data are only correlations, and further research is needed to determine if the hair products were responsible for the increased cancer risk or if the association was due to other factors. You can check your products against the EWG’s Skin Deep database, which has information on the ingredients in cosmetics and gives a rating scale for which products are of most concern. Tests are being developed to detect cancer markers in blood samples. Tumors shed DNA that can be detected in the blood and can be used to follow people over time and detect breast cancer recurrence. A sensitive method called TARDIS has been developed that is tailored for individual people based on the mutations in their cancer cell DNA. It’s hoped that the test can be used clinically to assess how well people with cancer respond to treatment (B. R. McDonald et al., 2019). Investigators working with the biotechnology company Grail, Inc. are developing a blood test to be used for the screening and early detection of cancers. They have been able to detect numerous types of cancers including breast cancer with their blood test. When cancer cells die, some of their DNA ends up in the blood. The Grail test measures patterns of DNA methylation—a chemical modification that impacts the activity of DNA without physically changing its sequence—that are characteristic of specific cancers (Liu et al., 2020). Researchers from the Johns Hopkins University School of Medicine have also reported good results with their screening test. They can detect several types of cancer in blood samples by measuring specific proteins and mutations in DNA. They call the test CancerSEEK (J. D. Cohen et al., 2018; Lennon et al., 2020). Cancer cells may detach from tumors, and these cells can be detected in the blood. These circulating tumor cells (CTCs) can be used to monitor the success of treatment and the progression or regression of tumor growth. The FDA has approved the CellSearch test system for detecting CTCs. However, it is not yet established that testing for these cells provides useful enough information to guide treatment and improve patient outcomes, and research is continuing (Schochter et al., 2019). Milk ducts in the nipple contain a unique microbiome, and it’s likely that this microbiome can influence cancer progression in positive and negative ways—for example by inducing cancer-promoting inflammation. Surgeon Susan Love, MD, and researchers from institutions including the Jet Propulsion Lab at Caltech analyzed the nipple microbiome in women with and without a history of breast cancer. The researchers found differences between the microbiomes of breast cancer survivors and those who had not had breast cancer. The significance of this finding is not clear—the differences in microbiomes could be due to the treatments for breast cancer—but future research will no doubt look further into the role of the nipple microbiome in breast health (Chan et al., 2016). Obesity is linked to increased rates of some cancers, including breast cancer. Fat tissue is thought to promote breast cancer because fat cells produce estrogen. If fat tissue directly promotes cancer, then surgeries on the stomach and intestine to induce weight loss—bariatric surgeries—should reduce the incidence of cancer. Physician Daniel Schauer, MD, MSc, from the University of Cincinnati and his collaborators have reported that the incidence of breast cancer is lower in people who’ve had weight-loss surgery. The researchers looked at the medical records of 88,000 obese people who had a BMI of at least thirty-five kilograms per meter squared. Some of these people went on to have bariatric weight-loss surgery. In the following four years, the people who had had the surgery were 33 percent less likely to develop cancer than those who had not had surgery. The largest effects of bariatric surgery were seen in cancers that are promoted by estrogen, such as breast cancer and endometrial cancer. Postmenopausal women who had bariatric surgery were 42 percent less likely to develop breast cancer. This was an observational study, not a controlled trial, so we don’t know if the reduced cancer risk was due to the surgery or other factors (Schauer et al., 2019). Drugs that are initially successful at killing cancer cells may eventually stop working as cancer cells develop resistance. Scientists are investigating how drug resistance develops and how to stop it. Neratinib is a drug targeted at HER2-positive cancer cells. As is the case with many drugs, cancer cells become resistant to this drug. Dhivya Sudhan, PhD, at the University of Texas, Dallas, and collaborators have discovered that a drug called everolimus can prevent this resistance, thereby allowing neratinib to continue doing its job killing cancer cells. These findings haven’t been translated to the clinic yet, but they provide hope that drug resistance may eventually be overcome (Sudhan et al., 2020).\n\nThis article is for informational purposes only, even if and to the extent that it features the advice of physicians and medical practitioners. This article is not, nor is it intended to be, a substitute for professional medical advice, diagnosis, or treatment and should never be relied upon for specific medical advice. The information and advice in this article is based on research published in peer-reviewed journals, on practices of traditional medicine, and on recommendations made by health practitioners, the National Institutes of Health, the Centers for Disease Control and Prevention, and other established medical science organizations; this does not necessarily represent the views of goop.\n\nWe hope you enjoy the books recommended here. Our goal is to suggest only things we love and think you might, as well. We also like transparency, so, full disclosure: We may collect a share of sales or other compensation if you purchase through the external links on this page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Breast Cancer | goop", "description": "Breast cancer remains all too common, but earlier detection and personalized treatments have been steadily decreasing the deadliness of this disease. Scientists have a general understanding of factors that make breast cancer more likely for certain people than for others, like mutations in the BRCA genes and being exposed to estrogen, but they can’t yet predict with certainty who will develop this disease and who will not.", "url": "https://goop.com/wellness/health/breast-cancer/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2020-10-15T11:54:53+00:00", "article:modified_time": "2022-10-06T19:32:19+00:00", "updated_time": "2022-10-06T19:32:19+00:00", "image": "https://goop-img.com/wp-content/uploads/2020/10/breast-cancer-Stocksy_txp1eb465b9lEq200_Medium_2866604.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2020/10/breast-cancer-Stocksy_txp1eb465b9lEq200_Medium_2866604.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/research-scientist-bios/", "https://goop.com/goop-phd/", "/cdn-cgi/l/email-protection#f396979a879c819a929fb3949c9c83dd909c9e", "https://bcrisktool.cancer.gov/calculator.html", "https://goop.com/wellness/health/new-cancer-tests-that-could-save-your-life/", "https://goop.com/wellness/health/new-cancer-tests-that-could-save-your-life/", "https://ww5.komen.org/uploadedFiles/_Komen/Content/About_Breast_Cancer/Tools_and_Resources/Fact_Sheets_and_Breast_Self_Awareness_Cards/Breast%20Health%20Toolkit%20for%20hcps%20Final%202019.pdf", "https://www.sonobreasts.com/", "https://www.imagewisely.org/-/media/Image-Wisely/Files/Patient-Medical-Imaging-History.pdf?la=en", "https://www.fda.gov/consumers/consumer-updates/reducing-radiation-medical-x-rays", "https://www.cancer.org/treatment/understanding-your-diagnosis/tests/understanding-radiation-risk-from-imaging-tests.html", "https://www.cancer.gov/types/breast/patient/breast-treatment-pdq", "https://www.pcrm.org/news/news-releases/doctors-group-petitions-fda-require-breast-cancer-warning-label-cheese", "https://goop.com/wellness/health/should-i-take-vitamin-d/", "https://acsjournals.onlinelibrary.wiley.com/doi/full/10.3322/caac.20139", "https://www.cancer.org/", "https://www.cancer.org/about-us/what-we-do/providing-support.html", "https://csn.cancer.org/", "https://www.cancer.org/treatment/support-programs-and-services.html", "https://www.cancer.org/treatment/support-programs-and-services.html", "https://www.cancercare.org/", "https://www.cancercare.org/support_groups", "https://supportorgs.cancer.gov/searchresults.aspx", "https://goop.com/wellness/health/breast-cancer-and-exercise/", "https://www.fda.gov/consumers/consumer-updates/what-know-about-breast-implants", "https://goop.com/wellness/health/breast-implant-illness/", "https://www.breastcancer.org/treatment/surgery/reconstruction/no-reconstruction", "https://www.breastcancer.org/treatment/surgery/reconstruction/no-reconstruction", "https://www.mayoclinic.org/departments-centers/proton-beam-therapy-program/home/orc-20185488", "https://www.mayoclinic.org/diseases-conditions/breast-cancer/expert-answers/breast-cancer-radiation/faq-20057981", "https://www.breastcancer.org/treatment/radiation/skin/care", "https://komenpugetsound.org/lgbtq-health-care-initiative/", "https://transcare.ucsf.edu/guidelines", "https://www.cancer.gov/about-cancer/treatment/side-effects/mouth-throat", "https://ww5.komen.org/KomenPerspectives/Komen-Perspectives---Palliative-Care-for-Breast-Cancer--Important-and-Often-Underused-(March-2016).html", "https://twitter.com/vprasadmdmph/", "https://bookshop.org/a/3543/9780062268747", "https://radicalremission.com/", "https://ww5.komen.org/BreastCancer/PolysaccharideKPSK.html", "https://www.ewg.org/skindeep/", "https://clinicaltrials.gov/ct2/results?recrs=ab&cond=Breast+Cancer&term=&cntry=US&state=&city=&dist=", "https://clinicaltrials.gov/ct2/home", "https://clinicaltrials.gov/ct2/results?recrs=ab&cond=breast+cancer&term=&cntry=&state=&city=&dist=", "https://clinicaltrials.gov/ct2/show/NCT04073680", "https://l-nutra.com/pages/clinical-trials", "https://cancerres.aacrjournals.org/content/79/4_Supplement/P1-15-20.short", "https://clinicaltrials.gov/ct2/show/NCT01802346", "https://clinicaltrials.gov/ct2/show/NCT00936364", "https://clinicaltrials.gov/ct2/show/NCT03454282", "https://clinicaltrials.gov/ct2/show/NCT03570125", "https://clinicaltrials.gov/ct2/show/NCT02890095", "https://clinicaltrials.gov/ct2/show/NCT02620852", "https://clinicaltrials.gov/ct2/show/NCT03929822", "http://www.delphinusmt.com/women/the-softvue-experience/", "https://www.keckmedicine.org/whole-breast-ultrasound/", "https://www.swog.org/", "https://www.cancer.gov/about-cancer/treatment/clinical-trials/search/v?id=NCT01272037&r=1", "https://clinicaltrials.gov/ct2/show/NCT02348320", "https://clinicaltrials.gov/ct2/show/NCT03199040", "https://clinicaltrials.gov/ct2/show/NCT03036488", "https://clinicaltrials.gov/ct2/show/NCT03725059", "https://www.sciencedaily.com/releases/2019/09/190930181017.htm", "https://www.cancer.org/", "https://www.breastcancer.org/", "https://www.breastcancer.org/community/discussion", "https://www.bcrf.org/", "https://www.cancer.gov/types/breast", "https://ww5.komen.org/", "https://ww5.komen.org/AboutBreastCancer/ToolsandResources/ToolsResources.html", "https://bookshop.org/a/3543/9781580056267", "https://www.fda.gov/consumers/consumer-updates/what-know-about-breast-implants", "https://goop.com/wellness/health/new-cancer-tests-that-could-save-your-life/", "https://goop.com/wellness/health/breast-cancer-and-exercise/", "https://goop.com/wellness/health/breast-cancer-research/", "https://goop.com/wellness/health/cancer-prevention/", "https://bookshop.org/a/3543/9781432854256", "https://doi.org/10.1111/tbj.13196", "https://doi.org/10.1056/NEJM199404143301501", "https://doi.org/10.1200/JCO.19.01203", "https://www.cancer.org/treatment/understanding-your-diagnosis/staging.html", "https://www.cancer.org/treatment/treatments-and-side-effects/physical-side-effects/fertility-and-sexual-side-effects/sexuality-for-women-with-cancer/problems.html", "https://doi.org/10.1200/JCO.2004.06.030", "https://doi.org/10.1037/0022-006X.75.6.927", "https://doi.org/10.1002/cncr.23969", "https://doi.org/10.3889/oamjms.2018.333", "https://doi.org/10.1007/s00520-019-04845-7", "https://www.rsna.org/en/news/2019/April/Gadolinium-Based-Contrast-Agent-Retention", "https://doi.org/10.1016/j.annonc.2019.09.006", "https://doi.org/10.1007/978-3-319-99350-8_13", "https://www.breastcancer.org/treatment/side_effects/constipation", "https://www.breastcancer.org/treatment/hormonal/serms/tamoxifen", "https://doi.org/10.1089/154099904323087042", "https://doi.org/10.1038/s41586-020-2502-7", "https://doi.org/10.1289/ehp.11269", "https://doi.org/10.1038/srep28061", "https://doi.org/10.1007/s12282-011-0276-3", "https://doi.org/10.3389/fonc.2018.00678", "https://doi.org/10.1126/science.aar3247", "https://doi.org/10.1093/jncimonographs/lgx006", "https://doi.org/10.1016/S0140-6736(19)31709-X", "https://www.cancer.gov/about-cancer/diagnosis-staging/ct-scans-fact-sheet", "https://doi.org/10.1148/radiol.2020191751", "https://doi.org/10.1371/journal.pone.0078016", "https://doi.org/10.33582/2639-4391/1002", "https://doi.org/10.1200/JCO.2006.08.2024", "https://doi.org/10.1016/S0140-6736(13)60140-3", "https://doi.org/10.1136/bmj.l1652", "https://doi.org/10.1038/s41467-020-16138-3", "https://doi.org/10.3322/caac.21583", "https://doi.org/10.1002/jso.24264", "https://doi.org/10.1002/ijc.32738", "https://doi.org/10.7326/M15-0964", "https://doi.org/10.1200/JCO.2011.40.8922", "https://doi.org/10.1002/ijc.31848", "https://www.fda.gov/media/116492/download", "https://doi.org/10.1007/s10549-007-9523-x", "https://doi.org/10.1093/ije/dyaa007", "https://doi.org/10.1148/radiol.2019190971", "https://doi.org/10.1186/s13058-019-1124-1", "https://doi.org/10.1038/s41586-019-1907-7", "https://doi.org/10.1186/1471-2407-12-355", "https://doi.org/10.3390/nu10121886", "https://doi.org/10.1186/s13058-020-01261-2", "https://doi.org/10.1177/0269881116675513", "https://bookshop.org/a/3543/9781580056267", "https://doi.org/10.1016/j.chembiol.2019.05.005", "https://www.technologyreview.com/s/612279/the-skeptic-what-precision-medicine-revolution/", "https://www.health.harvard.edu/pain/pain-relief-opioids-and-constipation", "https://doi.org/10.1038/s41586-018-0343-4", "https://doi.org/10.1016/j.clnesp.2018.12.085", "https://doi.org/10.1016/j.yrtph.2018.03.019", "https://www.the-scientist.com/features/personalized-cancer-vaccines-in-clinical-trials-66075", "https://doi.org/10.1093/nutrit/nuz027", "https://doi.org/10.3747/co.25.3707", "https://doi.org/10.1002/14651858.CD007731.pub3", "https://doi.org/10.1159/000499599", "https://doi.org/10.1007/s00330-009-1588-y", "https://doi.org/10.1080/01635581.2019.1650942", "https://doi.org/10.1001/jamainternmed.2015.5868", "https://doi.org/10.1038/bjc.2014.175", "https://doi.org/10.1007/s12032-020-1337-2", "https://doi.org/10.1158/1055-9965.EPI-16-0121", "https://doi.org/10.1093/jnci/djt027", "https://doi.org/10.1007/s00520-017-4028-6", "https://doi.org/10.3322/caac.20140", "https://doi.org/10.1002/cncr.28654", "https://doi.org/10.1126/scitranslmed.3003293", "https://doi.org/10.1126/science.abb9601", "https://doi.org/10.1093/jnci/djn438", "https://doi.org/10.1016/j.annonc.2020.02.011", "https://doi.org/10.1186/s12906-020-03013-3", "https://doi.org/10.1111/j.1365-2354.2008.00996.x", "https://doi.org/10.1289/EHP5221", "https://doi.org/10.1001/jama.2013.278040", "https://doi.org/10.1056/NEJMoa1809944", "https://doi.org/10.1158/1055-9965.EPI-07-2660", "https://www.mayoclinic.org/tests-procedures/chemotherapy/in-depth/cancer/art-20047517", "https://www.mayoclinic.org/diseases-conditions/breast-cancer/diagnosis-treatment/drc-20352475", "https://www.mayoclinic.org/diseases-conditions/breast-cancer/symptoms-causes/syc-20352470", "https://doi.org/10.1126/scitranslmed.aax7392", "https://doi.org/10.1148/radiol.15150025", "https://doi.org/10.1002/cncr.22654", "https://doi.org/10.3390/ijerph8062265", "https://doi.org/10.1016/j.jacr.2017.11.034", "https://doi.org/10.3892/mco.2017.1346", "https://doi.org/10.1002/ptr.6124", "https://www.cancer.gov/about-cancer/treatment/cam/hp/acupuncture-pdq", "https://www.cancer.gov/about-cancer/treatment/side-effects/appetite-loss", "https://www.cancer.gov/about-cancer/treatment/side-effects/hair-loss", "https://www.cancer.gov/about-cancer/treatment/side-effects/lymphedema", "https://www.cancer.gov/about-cancer/treatment/side-effects/memory", "https://www.cancer.gov/about-cancer/treatment/side-effects/nausea", "https://www.cancer.gov/types/breast/mammograms-fact-sheet", "https://www.cancer.gov/about-cancer/causes-prevention/genetics/brca-fact-sheet", "https://www.cancer.gov/types/breast/breast-changes/dense-breasts", "https://www.cancer.gov/types/breast/hp", "https://www.cancer.gov/types/breast/hp/breast-ovarian-genetics-pdq", "https://www.cancer.gov/types/breast/patient/breast-screening-pdq", "https://www.cancer.gov/types/breast/patient/breast-treatment-pdq", "https://www.cancer.gov/types/breast/hp/breast-prevention-pdq", "https://www.cancer.gov/types/breast/hp/breast-treatment-pdq", "https://www.cancer.gov/types/breast/hp/breast-screening-pdq", "https://nccih.nih.gov/health/greentea", "https://nccih.nih.gov/health/mistletoe", "https://doi.org/10.1016/j.envint.2019.05.084", "https://doi.org/10.1136/bmj.e5660", "https://doi.org/10.1002/14651858.CD012053", "https://doi.org/10.1371/journal.pone.0065522", "https://doi.org/10.1093/jn/nxz107", "https://doi.org/10.15252/emmm.201911031", "https://doi.org/10.1038/s41416-018-0080-3", "https://doi.org/10.1177/0269881116675512", "https://doi.org/10.1007/s00520-011-1236-3", "https://doi.org/10.1007/s00262-005-0054-1", "https://doi.org/10.1007/s40261-019-00882-6", "https://doi.org/10.1007/s11912-020-0891-2", "https://doi.org/10.1097/SLA.0000000000002525", "https://doi.org/10.3390/cells8111412", "https://doi.org/10.1002/cam4.539", "https://doi.org/10.1016/j.mri.2016.07.016", "https://doi.org/10.1186/1743-7075-7-7", "https://www.aafp.org/afp/2018/1115/od5.html", "https://doi.org/10.1001/jama.279.7.535", "https://doi.org/10.1002/cncr.29076", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2845472/", "https://doi.org/10.1016/j.ccell.2019.12.013", "https://seer.cancer.gov/statfacts/html/breast.html", "https://doi.org/10.1056/NEJM199112263252602", "https://doi.org/10.1007/s00520-016-3423-8", "https://doi.org/10.3390/diagnostics8010020", "https://doi.org/10.5402/2012/251632", "http://www.fda.gov/consumers/consumer-updates/what-know-about-breast-implants", "https://www.uspreventiveservicestaskforce.org/Page/Document/RecommendationStatementFinal/breast-cancer-screening1", "https://doi.org/10.4103/0253-7613.111894", "https://doi.org/10.1200/JCO.2014.59.1081", "https://doi.org/10.1093/carcin/7.9.1463", "https://doi.org/10.1001/jamaoncol.2019.2803", "https://doi.org/10.1016/j.molmet.2019.06.026", "https://doi.org/10.1126/scitranslmed.aai8700", "https://doi.org/10.1007/s12254-018-0426-9", "https://doi.org/10.1007/s00253-020-10476-4", "https://doi.org/10.1097/MD.0000000000011948", "https://doi.org/10.1002/cncr.32472", "https://doi.org/10.1038/s41586-019-1678-1", "https://doi.org/10.1007/s00432-018-2718-1"], "authors": [], "publish_date": "2020-10-15T11:54:53+00:00"}