{"result_id": "139004", "URL": "https://goop.com/wellness/parenthood/more-than-just-a-collection-of-symptoms-raising-kids-who-are-chronically-ill/", "timestamp": "2023-04-25 15:19:50 CEST+0200", "meta": {"description": "In an original essay for goop, author Maggie O’Farrell explores her experience raising a daughter with an immunological disorder that puts her life constantly in danger; her notes here on loving and caring for the vulnerability in another are incredibly moving, reaffirming, and wise.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/wellness/parenthood/more-than-just-a-collection-of-symptoms-raising-kids-who-are-chronically-ill/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "More Than Just a Collection of Symptoms: Raising Kids Who Are Chronically Ill", "cleaned_text": "More Than Just a Collection of Symptoms: Raising Kids Who Are Chronically Ill\n\nOn Raising a Child with Additional Needs: An Incomplete Guide\n\n1. Acquaint yourself with synonyms for the word “additional”: extra, added, further, supplementary, increased, new, auxiliary, expanded. Read that list. Memorize it. These are the adjectives of your life, now; these are the words which will sum up your days, your nights, your everything. All the effort and patience and love and exhaustion and strife and challenges and exhilaration of parenting is just a baseline: You, my friend, are going to have to go beyond, to a further, extra, additional place.\n\n2. You might find the reading of parenting manuals makes you feel terrible. They may have a list of milestones, say, or advice on how to equip a legion of neuro-typical, able-bodied, healthy children with confidence and independence. If this is the case, don’t hesitate to hurl these books across the room. Or use them as firelighters or doorstops or draught-excluders. Or tear out the pages to make origami frogs. Whatever makes you feel better. Generally, make sure you know this: It’s okay to avoid anything that makes you feel worse. It took me a while to figure this out.\n\n3. Whatever the nature of your child’s particular additional needs—neurological, immunological, physical, emotional, mental—it’s important for them to know that their home is a place of safety, of acceptance, of unlimited love. It’s up to you to create this space, this right, for them. Once they are inside your front door, ensure that no one is going to criticize or judge or laugh at them. They need this, and so do you.\n\n4. If one member of a family has a medical condition, you’ll need to frame it as something that is shared by everyone in the house. It affects every single one of you. I never for a moment forget that all three of my children carry the weight of what my middle child suffers.\n\nWhen she was taken away in an ambulance last winter, her four-year-old sister was clinging to her so tightly that we had to peel away her fingers. As we zoomed to the hospital, my priority was of course the child on the gurney, but at the back of my mind was her little sister. I knew she would never forget being pulled away like that before the ambulance doors were slammed shut. I knew that when I got back home, I would need to make it okay for her—or as okay as I could.\n\n5. You may have to bear witness to your child’s pain. This is harder than you might think. To hear your beloved child scream in agony, to hold them as they writhe, to listen to their distress: There is nothing that will lacerate you as this does. These moments will etch themselves on to your heart; you will be able to summon the exact pitch, timbre, and rhythm of these cries, even years later.\n\nThough hard to live through, they will give you a specific strain of strength and awareness. You will learn from them. You will never again be able to act without compassion, without an urgent instinct to help someone in need. Which is a bonus, of sorts. It can also be inconvenient if, for example, you’re trying to get somewhere but your rewritten heart keeps making you stop to help people, animals, cars, situations, on the way. It might make you late for things: just a heads up.\n\n6. You will be desperate for people to recognize your child for the person she is, not just a collection of symptoms. Too often are my daughter’s condition, her skin, her extra needs taken as a substitute for who she is. I once heard someone refer to her as “the girl with the gloves,” and I wanted to go up to them and say, what else about her can you see?\n\n7. You are determined that your child will live as full and large as life as possible, within whatever strictures their condition dictates. You become a mother who tells your children, sure, climb higher. Yes, leap into that water. Go for it. Do it. Get on that extremely large bike/skateboard/incline/vertiginous rock face.\n\n8. When your daughter is feeling isolated, set apart, despite all your efforts, you need to look her in the eye and say, yes, it’s rubbish. I’m sorry. I wish it wasn’t so. I would swap places with you, a thousand times over, if I could. You must also tell her she isn’t alone. That everyone has something they struggle with. It may not be as visible as a skin condition or as dramatic as anaphylaxis, but everyone faces challenges.\n\n9. You might feel a bit twitchy when people say that they know exactly how you feel because they have a gluten allergy that makes them feel really bloated when they eat pasta. Others might tell you what a struggle it is to get their child to do their daily flute practice or that they haven’t slept for several nights because their child has a dreadful cough. Then there are the over-sympathizers, the ones who tell you, with tears in their eyes, that they don’t know how you cope. For all these situations, you need to perfect the neutral nod. It’s an all-purpose, single downward tilt of the head. You can add a distant, noncommital smile, if you like.\n\n10. There will be people who just don’t get it, no matter how many times you explain. They won’t remember crucial details. They may show signs of impatience or exasperation, when you are unable to make a date or go to a certain place or take part in an activity. You may sense that, spooling through their mind, is the thought that you are somehow making this all up. That these people may include good friends, close relatives, is one of the trickier things.\n\nTell yourself, over and over, that there is nothing you can do about this. You can’t change them, you can’t make them see, if they don’t want to. You have to alchemize any sadness you may feel over this into cherishing the people who do get it. Let them know how much you value them; tell them how much their understanding and support means to you.\n\n11. Track down as many enticing audiobooks for your child as you can and bring them with you for hospital appointments. You can set the headphones on their head and tune them into Harry Potter or Roald Dahl or E. Nesbit, so that you can listen to whatever it is that the doctor is saying. Remember, though, that your child is watching so be sure to smile and look upbeat, whatever the doctor is saying. This has, on occasion, given rise to the following conversation:\n\nMe: What are the risks?\n\nMe (grinning and nodding): Oh.\n\n12. Hold fast to the kindness and let go of the callousness, for you will encounter plenty of both. It will be necessary for you to devise a way to neutralize or pass over the devastation you feel when another parent at a play park pulls her son away from your daughter, saying, “Don’t play with her—you might catch something.”\n\nA woman will look you in the eye and tell you that she isn’t inviting your daughter to a birthday party along with the rest of the class because “it’s too much hassle.” You will need to metabolize this slight, this exclusion, and move on. (You will have to see this woman every day, at school drop-off; you will, when your own daughter’s birthday comes around, need to invite this woman’s child. This woman will come to your house. She will sit at your table and you will watch her drink your tea.)\n\n13. For every one of these ignoramuses are ten angels in disguise. The friends who clean and vacuum and dust their houses, so that she can come over. The people who cook special food for her, who text you five times to check ingredients, who say, tell me what to do, tell me how to help. The classmates who spot someone with a peanut butter sandwich across the playground and drag her to safety. The teacher who goes out of her way to make sure your daughter feels secure, protected, wanted, included. The lady on the bus who gazes at your daughter—and you are bracing yourself for a comment about her reddened and raw skin—but instead she says, what beautiful hair she has.\n\n14. If I start to feel even a little bit sorry for myself, I pull myself up with an important reminder. I live in a developed country with excellent healthcare; the medication which can save my daughter’s life is given to us for free; I am able pick up the phone and summon an ambulance and paramedics to our door, if we need them.\n\n15. Sometimes you have to stop chasing “the why.” As in: Why has this happened? Why him? Why her? Why us? These thoughts are, for the most part, circuitous and therefore exhausting. Various theories put to me as to why my daughter has an immune disorder, chronic eczema, and potentially fatal allergies have included the following: the amalgam fillings in my teeth, a trauma from a former life (for me or her was never clear), a vaccination I had while pregnant with her, her conception via IVF, the confluence of my mild asthma and my husband’s mild eczema, and so on and so on.\n\nIt’s possible to flush away a great deal of energy and money on pursuing this elusive question. You need to forget the why and concentrate instead on the how. How you are going to deal with this, how you are going to live your life and carry on.\n\n16. A dermatology nurse once told me I needed to make time for myself. I was, at that particular moment, standing in a hospital toilet, having a little weep. I had a sick and suffering three-year-old, a tiny baby whom I hadn’t seen that day, and a nine-year-old who happened to be in double leg casts. Also, a job. I remember raising my head to look at her and wondering, was she mad? Was I? Time for myself? Where was this time to come from? From the two or three hours of sleep I was getting? Should I skip getting dressed in the morning? Could I save a few minutes here and there by not cooking meals? Maybe I could give up doing the laundry or feeding the cats or taking the kids to school.\n\nIt was, however, good, if somewhat unrealistic, advice. You will need to carve out whatever time you can, to gather yourself, to stabilize yourself. I’m not about to tell you to find joy in small things, to be grateful for kitten paws or narcissus petals or sunsets, but to allow yourself a moment, here and there, if you can, to put down your cares. The other day, I’d had some lowering news about my daughter and we were going to have to wait several weeks for some crucial blood results. I was feeling as if someone had tunneled into my chest cavity with a blunt knife. I put on a pair of particularly warm socks and sat in a chair, watching my daughters, who were running about, both dressed as wolves. I thought: Yes, these results could be awful, but look, the world has socks, and animal costumes, and chairs. Right now, just for an instant, the blood tests can go to hell in a handcart. I’m going to just hang out here, in my Icelandic socks, with my wolf cubs.\n\n17. You can only try your best. It won’t always be perfect. You won’t always be your ideal self. Accept this.\n\n18. Hold in mind that, wherever you are, whatever circle of hell you find yourself in, there is always someone worse off than you. To get to appointments at our first hospital, I had to walk down a corridor which bifurcated into two different departments. There’s nothing like a signpost to the right, reading “Pediatric Oncology,” to make you grateful that you’re turning left to “Immunology.” You have your child. She is here. Not every mother can say that.\n\nBorn in Northern Ireland in 1972, Maggie O’Farrell grew up in Wales and Scotland and now lives in London. She has worked as a waitress, chambermaid, bike messenger, teacher, arts administrator, and journalist in Hong Kong and London, and as the deputy literary editor of The Independent on Sunday. Her debut novel, After You’d Gone (2000) won a Betty Trask Award and was followed by My Lover’s Lover (2002); The Distance Between Us (2004), winner of a Somerset Maugham Award; The Vanishing Act of Esme Lennox (2006); The Hand That First Held Mine (2010), winner of the Costa Novel Award; Instructions for a Heatwave (2013); This Must Be the Place (2016); and most recently the memoir I Am, I Am, I Am.", "opengraph": {"locale": "en_US", "type": "article", "title": "More Than Just a Collection of Symptoms: Raising Kids Who Are Chronically Ill | goop", "description": "In an original essay for goop, author Maggie O’Farrell explores her experience raising a daughter with an immunological disorder that puts her life constantly in danger; her notes here on loving and caring for the vulnerability in another are incredibly moving, reaffirming, and wise.", "url": "https://goop.com/wellness/parenthood/more-than-just-a-collection-of-symptoms-raising-kids-who-are-chronically-ill/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:tag": "how to help a struggling kid", "article:published_time": "2018-01-25T17:40:42+00:00", "article:modified_time": "2018-08-01T19:12:24+00:00", "updated_time": "2018-08-01T19:12:24+00:00", "image": "https://goop-img.com/wp-content/uploads/2018/01/More_Than_Just_a_Collection_of_Symptoms-_Raising_Kids_Who_Are_Chronically_Ill_Maggie_O_Farrell_First_Person_Essay-TRU1684786.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2018/01/More_Than_Just_a_Collection_of_Symptoms-_Raising_Kids_Who_Are_Chronically_Ill_Maggie_O_Farrell_First_Person_Essay-TRU1684786.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Am-Seventeen-Brushes-Death/dp/0525520228", "https://www.amazon.com/Am-Seventeen-Brushes-Death/dp/0525520228", "http://www.maggieofarrell.com/", "https://www.amazon.com/Am-Seventeen-Brushes-Death/dp/0525520228"], "authors": [], "publish_date": "2018-01-25T17:40:42+00:00"}