{"result_id": "139039", "URL": "https://goop.com/beauty/personal-care/norma-kamali-on-aging/", "timestamp": "2023-04-25 15:20:43 CEST+0200", "meta": {"description": "In her new book, I Am Invincible—a brilliant, can’t-put-it-down guide to life—designer Norma Kamali goes decade by decade in answering this question. Whether you’re seventeen or eighty-seven, her advice is fun to read, incredibly useful, and super inspiring (the woman makes being seventy-five look fantastic). From sleep and exercise to food and beauty (shout-out to her olive-oil-based moisturizer and self-tanner), here are some of the choicest tips from the book.", "lang": "en", "keywords": "", "favicon": "https://goop.com/favicon.ico", "canonical": "https://goop.com/beauty/personal-care/norma-kamali-on-aging/", "encoding": "UTF-8"}, "image": null, "domain": "goop.com", "title": "If You Felt You’d Get Better with Age, How Would You Live Your Life?", "cleaned_text": "If You Felt You’d Get Better with Age, How Would You Live Your Life?\n\nIn her new book, I Am Invincible—a brilliant, can’t-put-it-down guide to life—designer Norma Kamali goes decade by decade in answering this question. Whether you’re seventeen or eighty-seven, her advice is fun to read, incredibly useful, and super inspiring (the woman makes being seventy-five look fantastic). Whether she’s giving advice on sleep and exercise or food and beauty (shout-out to her olive-oil-based moisturizer and self-tanner, both of them much obsessed over here at goop), Kamali is as adept at making us laugh as she is at making us do the right—healthy—thing. The book evolved out of a present she gave, long ago, to a friend turning fifty. “We were supposed to give gifts that related to turning fifty, so I got one of those little Moleskine notebooks and wrote up, in little notes and sketches, fifty tips for turning fifty,” she says. “And then everybody wanted a copy, and we sort of went from there.”\n\nWe talked to Kamali on the day she got her first dose of the coronavirus vaccine. “I was on the phone, making the appointment, and the person was like, ‘You’re seventy-five? You don’t sound seventy-five,” she laughs. (For the record, she corrects people who say she doesn’t look or act her age. “This is what seventy-five looks like,” she says. This story gets further into this topic.) Below, a few of her choicest tips—if you’re anything like us, they’ll only serve to make you want more, and you’ll devour the book in an afternoon.\n\nSee your life in the long distance. How you’re going to live your life is up to you. You decide what it’s going to be; you set it forward. Could I live to 120? I don’t want to miss out on the future. So I’m thinking about what I eat, what my lifestyle is—I’m not just meandering through. I like to look at women in their nineties, women who are still moving and living, and use them for inspiration. My cells can keep turning over, and I can continue to be flexible—just glimpsing what’s possible in other people helps you get there yourself.\n\nYou see sweat, I see glow\n\n (i.e., you don’t need foundation) I used to spend hours putting makeup on. If you could see my actual skin, I wouldn’t leave the house. I’d go to the beach with makeup on! I always had major lashes, full foundation, red lips and nails. And then, just before I turned fifty, I decided: This isn’t working anymore. I started to focus on my skin and the power of olive oil—which I think is enormous, both to ingest and to put on your skin—and I figured out that having great skin is way better than wearing a ton of makeup. Now I haven’t worn face makeup (even on shoots or TV when they tell me I have to) in forever: I cleanse, exfoliate, moisturize, and self-tan with my NORMALIFE essentials. They’re all you need for great-looking skin—and all you need is great-looking skin. Taking off that makeup can subtract like twenty-five years. Sweat, of course, you need that at least as much as skin care. Infrared saunas are so great—I feel they give me that big physical cleanse that few things besides acupuncture can do. (Number one thing that’s worth the time spent, in my book, is acupuncture, both for your health and your skin, but not everyone has access.) And exercise, at fifty but for most people even earlier, is required—no choice, every day. You must move in order to be flexible, to stay limber. It’s essential. Exercise is the key to just about anything has to do with self-esteem. Just do it, as they say.\n\nUse clean sunscreen and get vitamin D It’s important to pick a good sunscreen, separate from any makeup you wear. At the same time, vitamin D3 is so vital. In my early years of learning about a healthier lifestyle with Andrew Weil and other early pioneers in the space, even then they were discovering that cancer patients had low blood levels of vitamin D, realizing how important it is for everyone. But overexposing your skin and your eyes to the sun is no good for you either. There’s great clothing—made with bamboo—that’s protective, and there are hats, sunglasses, and clean mineral sunscreen. Those things allow me to be on the beach, run, walk, be outside in the sun. I get my vitamin levels checked two to four times a year, and I recommend everybody past fifty be diligent—I predict this will become a more commonplace practice. People should have easier access to testing, so they know what’s going on with their bodies.\n• Hum Nutrition Here Comes the Sun High-Potency Vitamin D3 goop, $12\n\nOptimize your bedroom: Keeping it cool, dark, and smelling good is essential. A silk pillowcase is a simple investment that pays off for both your face and your hair, and beautiful materials for your bed overall make a difference, I think. Scent is important—calming essential oils help me with sleep. I love a little eucalyptus and camphor, lavender, rose—I make a calming scent for myself that even my dog loves. Keep mobile devices far away: Make sure you have to walk a distance to get to them. I keep my phone inside a quilted bag so that it’s muffled, and I keep it far away from the bed. Know your body in terms of how much caffeine is right—so many people can’t sleep because they’re drinking caffeine too late in the day. I love Japanese green tea, but I can’t drink it too late. Caffeine is the biggest culprit for many people who think they can’t sleep, so watch that simple thing. I take magnesium, which is a super helpful part of the supplements I take for my bones, and I think the magnesium is useful for a good night’s sleep, too.\n• goop Wellness Knock Me Out goop, $55 for 60 chews/$30 for 30 chews\n\nHave sex with a partner or yourself If you feel comfortable in your body, it’s so much easier to be sexual and sensual. It’s another reason I think people underestimate the value of exercise, because it makes you more comfortable in your body: If you feel comfortable, no matter what you’re wearing, you know what’s going on underneath. Also massages are magic—anything that gets you in touch with your own body. I think it’s great to give massages to friends or partners: How much you put into that massage is important for you. I think touch can be the highest level of kindness. I think lately, with all the tech, sexuality and sensuality are becoming less about the physical face-to-face, and I think we need the in-person, as human beings. Touch is part of the sexual, sensual experience. Bringing yourself pleasure through touch is a way to bring more sensuality and sexuality into your life in a real way—real touch, not just online. Put away the mobile devices!", "opengraph": {"locale": "en_US", "type": "article", "title": "If You Felt You’d Get Better with Age, How Would You Live Your Life? | goop", "description": "In her new book, I Am Invincible—a brilliant, can’t-put-it-down guide to life—designer Norma Kamali goes decade by decade in answering this question. Whether you’re seventeen or eighty-seven, her advice is fun to read, incredibly useful, and super inspiring (the woman makes being seventy-five look fantastic). From sleep and exercise to food and beauty (shout-out to her olive-oil-based moisturizer and self-tanner), here are some of the choicest tips from the book.", "url": "https://goop.com/beauty/personal-care/norma-kamali-on-aging/", "site_name": "goop", "article:publisher": "https://www.facebook.com/Goop", "article:published_time": "2021-02-16T12:48:26+00:00", "article:modified_time": "2021-02-16T04:53:54+00:00", "updated_time": "2021-02-16T04:53:54+00:00", "image": "https://goop-img.com/wp-content/uploads/2021/02/2R0A9527.jpg", "image:secure_url": "https://goop-img.com/wp-content/uploads/2021/02/2R0A9527.jpg", "image:width": "1640", "image:height": "1250"}, "tags": [], "tweets": [], "movies": [], "links": ["https://goop.com/abrams-i-am-invincible/p/", "https://goop.com/normalife-glow-color-enhancer/p/", "https://goop.com/beauty/skin/skin-care-over-70/", "https://goop.com/normalife-glow-color-enhancer/p/", "https://goop.com/normalife-soft-everyday-moisturizer/p", "https://goop.com/optp-lorox-aligned-foam-roller/p", "https://goop.com/higherdose-infrared-mat/p", "https://goop.com/the-upside-seamless-midi-pant/p", "https://goop.com/the-organic-pharmacy-cellular-protection-sun-cream-spf-30/p", "https://goop.com/hum-nutrition-here-comes-the-sun-high-potency-vitamin-d3/p/", "https://goop.com/unsun-hand-cream-spf-15/p/", "https://goop.com/de-mamiel-first-fix-serum/p", "https://goop.com/slip-white-queen-pillow-case/p", "https://goop.com/goop-wellness-knock-me-out/60-chews/p/", "https://goop.com/vitruvi-goop-exclusive-stone-diffuser/p", "https://goop.com/livon-labs-liposomal-magnesium-l-threonate/p", "https://goop.com/goop-beauty-g-day-black-pepper-rose-hip-energy-body-oil/p", "https://goop.com/province-apothecary-lover-s-kit/p", "https://goop.com/goop-wellness-double-sided-wand-vibrator/p/"], "authors": [], "publish_date": "2021-02-16T12:48:26+00:00"}