{"result_id": "141030", "URL": "https://govtslaves.com/2023-03-24-gain-of-function-research-trigger-worse-pandemic.html", "timestamp": "2023-04-25 15:21:26 CEST+0200", "meta": {"description": "The next contrived “pandemic” is already in the works, and Dr. Robert Redfield, who headed up the Centers for Disease Control and Prevention (CDC) while the Trump administration was in power (he was succeeded by Rochelle Walensky), is warning that it will be a lot worse than the Wuhan coronavirus (Covid-19) was. Appearing on a […]", "lang": "en", "keywords": "badhealth,badscience,CDC,conspiracy,COVID,deep state,gain-of-function,Global Elite,infections,outbreak,pandemic,plague,Robert Redfield,SARS-CoV-2", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-03-24-gain-of-function-research-trigger-worse-pandemic.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Former CDC head warns that gain-of-function research will trigger another pandemic that’s “much” worse than covid", "cleaned_text": "Former CDC head warns that gain-of-function research will trigger another pandemic that’s “much” worse than covid\n\nThe next contrived “pandemic” is already in the works, and Dr. Robert Redfield, who headed up the Centers for Disease Control and Prevention (CDC) while the Trump administration was in power (he was succeeded by Rochelle Walensky), is warning that it will be a lot worse than the Wuhan coronavirus (Covid-19) was.\n\nAppearing on a recent broadcast of Hill.TV’s “Rising,” Redfield painted a bleak picture of the next plandemic, which he says will arise “from gain-of-function research or intentional bioterrorism” and be “much more brutal to the world than covid was.”\n\n“I do believe the next pandemic – and we’re going to have another pandemic – and I think it’s going to be the great pandemic,” Redfield promised to the audience.\n\n“I consider covid a minor pandemic – the great pandemic’s going to come. And normally, it would come from spillover … bird flu that learns how to transmit to humans and then go to human-to-human. But I think the species barriers are very real.”\n\nThe powers that be are promising another plandemic because they’re the ones who will trigger it\n\nLater in the segment, Redfield reassured his audience that he is certain the next “great pandemic” is coming that will for sure, he seemed to suggest the second time around, be a result of gain-of-function research or intentional bioterrorism.\n\n“It’s going to be a bird flu virus that is manipulated to be able to transmit human-to-human, very similar to what we saw with covid,” he explained.\n\nDr. Paul Cottrell spoke with Mike Adams, the Health Ranger, about this very same topic. Cottrell revealed that the next pandemic will likely be a chimeric bioweapon comprised of SARS, HIV, and H5N1, also known as bird flu – watch the segment below:\n\nMore than likely these guys are right. The powers that control the world will not stop until every last person’s life is destroyed. And since covid failed to accomplish the job at hand, another plandemic will be launched to complete the agenda.\n\n“People wake up and start getting your supply of ClO2 0.3% solution (chlorine dioxide 0.3% solution),” one commenter wrote about how We the People can prepare for the coming unleashing of the next plandemic.\n\n“I have been taking it for almost 2 years and have never had Covid or any other s***, am almost 75 years old, feel like 50 and can hold my breath for almost 2 minutes even though I still smoke.”\n\nAnother person wrote that we really do have a “rogue government,” reiterating several of Cotrell’s statements and admissions to Adams during the segment.\n\n“They all need to be kick out, and the American people should be talking about ushering them, the politicians, right out of the system – all of them. No exception.”\n\n“No more four-year terms, no more vacation time – it’s a job,” this person added. “Just like everybody else, you don’t do your job, you don’t get paid.”\n\nNumerous others thanked Cottrell for sharing what he knows about what the “elite” have planned for the next biological attack on the world. Others scoffed at the notion of ever going through another covid, insisting that they will not be participating in the charade a second time around.\n\n“I hate to say it, but it is far past time for the permanent removal of the WEF (World Economic Forum) and all of its followers,” wrote someone else. “As long as they are permanently removed with no chance of coming back.”\n\nMore related news can be found at Pandemic.news.", "opengraph": {"article:published_time": "2023-03-24 06:05:22", "title": "Former CDC head warns that gain-of-function research will trigger another pandemic that’s “much” worse than covid", "type": "article", "url": "https://www.govtslaves.com/2023-03-24-gain-of-function-research-trigger-worse-pandemic.html", "site_name": "Gov't Slaves Com", "description": "The next contrived “pandemic” is already in the works, and Dr. Robert Redfield, who headed up the Centers for Disease Control and Prevention (CDC) while the Trump administration was in power (he was succeeded by Rochelle Walensky), is warning that it will be a lot worse than the Wuhan coronavirus (Covid-19) was. Appearing on a […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/03/wuhan-virology-hazmat-suits.png"}, "tags": ["pandemic", "conspiracy", "Robert Redfield", "Global Elite", "deep state", "outbreak", "COVID", "plague", "infections", "gain-of-function", "SARS-CoV-2", "CDC"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/clips/2023/03/21/redfield-gain-of-function-research-is-much-more-probable-cause-of-next-pandemic-which-will-be-much-worse-than-covid/", "https://naturalnews.com/2021-11-22-atlas-blasts-birx-redfield-fauci-dismissing-science.html", "https://www.brighteon.com/305eb2c4-b216-4ed0-b67e-af5fbb6ee291", "http://pandemic.news", "https://www.breitbart.com/clips/2023/03/21/redfield-gain-of-function-research-is-much-more-probable-cause-of-next-pandemic-which-will-be-much-worse-than-covid/", "https://naturalnews.com/2021-11-22-atlas-blasts-birx-redfield-fauci-dismissing-science.html", "https://www.brighteon.com/305eb2c4-b216-4ed0-b67e-af5fbb6ee291", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-03-24-gain-of-function-research-trigger-worse-pandemic.html&linkname=Former%20CDC%20head%20warns%20that%20gain-of-function%20research%20will%20trigger%20another%20pandemic%20that%E2%80%99s%20%E2%80%9Cmuch%E2%80%9D%20worse%20than%20covid", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-03-24 06:05:22"}