{"result_id": "141029", "URL": "https://govtslaves.com/2023-02-06-documentary-reveals-similarities-pre-holocaust-covid-propaganda.html", "timestamp": "2023-04-25 15:21:25 CEST+0200", "meta": {"description": "A documentary film revealed similarities between pre-Holocaust propaganda during the 1930s and Wuhan coronavirus (COVID-19) propaganda during the 2020s. The first part of the five-part documentary titled “Never Again,” directed by Holocaust survivor and health freedom activist Vera Sharav, debuted on Jan. 30. Among the individuals interviewed in the film was Michoel Green, a Jewish Orthodox rabbi […]", "lang": "en", "keywords": "badhealth,badmedicine,covid-19,discrimination,fascism,freedom,Holocaust,Liberty,medical fascism,medical martial law,Medical Tyranny,Michoel Green,Nazi Germany,never again,unvaccinated,vaccine,Vera Sharav,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-02-06-documentary-reveals-similarities-pre-holocaust-covid-propaganda.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Some things never change: Documentary reveals similarities between 1930s pre-Holocaust and 2020s COVID propaganda", "cleaned_text": "Some things never change: Documentary reveals similarities between 1930s pre-Holocaust and 2020s COVID propaganda\n\nA documentary film revealed similarities between pre-Holocaust propaganda during the 1930s and Wuhan coronavirus (COVID-19) propaganda during the 2020s.\n\nThe first part of the five-part documentary titled “Never Again,” directed by Holocaust survivor and health freedom activist Vera Sharav, debuted on Jan. 30. Among the individuals interviewed in the film was Michoel Green, a Jewish Orthodox rabbi from Massachusetts. Green, which the Times of Israel smeared as an “anti-vaccine rabbi,” was fired by the Jewish Chabad movement for discouraging his followers from getting the dangerous injections.\n\nAccording to Green, there was a striking resemblance between how the Nazis demonized the Jews back then and how medical authorities demonized the unvaccinated now. He said: “What we’re clearly seeing here is a reply of the same telltale signs of what precipitated the Holocaust in the 1930s.”\n\nThe rabbi continued that during the Nazi regime in Germany and the COVID-19 pandemic, authorities engaged in “the marginalization of that minority” and identification of the said minority “as a threat to public health or a public health risk.”\n\n“There is nothing more morally reprehensible than government or authority of any kind declaring other innocent human beings as a public health risk. And it doesn’t matter if these people claim to be doing so innocently, for the greater good, because that’s what Nazis did as well.”\n\nOne clear example of this dehumanization came in the form of a poster that said “Jews are lice; they cause typhus” in the Polish language. According to the U.S. Holocaust Memorial Museum, the poster was “designed to link Jews and typhus closely together in the minds of non-Jewish Poles.” It continued: “Medical professionals repeatedly pushed the false claim that Jews were responsible for outbreaks of typhus – a deadly contagious disease spread by lice.”\n\n“That was right out of the Nazi playbook,” the rabbi commented, adding that it was exactly what Joseph Goebbels – chief propagandist for the Nazi party – would have done. “But that doesn’t justify marginalization, persecution and apartheid.” (Related: ‘Right out of the Nazi playbook’: Chabad Rabbi defends Marjorie Greene’s comparison of vaccine mandates to yellow stars in Germany.)\n\nGreen: Medical authorities have become modern-day purveyors of tyranny\n\nThe rabbi also mentioned that the discrimination the Jews faced was similar to how those who refused to get the COVID-19 vaccine were barred from entering many establishments. He cited one instance involving a Jewish Holocaust survivor being invited by an orthodox Jewish college to speak. However, the Holocaust survivor’s speaking engagement was eventually canceled “because she could not show her vaccine papers.”\n\n“What we’re seeing nowadays is precisely that,” Green said. He added that the medical authorities of today “have become the modern-day purveyors of tyranny, persecution and marginalization of the minority.”\n\nGreen also blasted the “genocide” done in the name of safety perpetrated in places like the city of Shanghai in China, which aligned with the Chinese Communist Party’s zero-COVID policy.\n\n“People are literally being left to die. They’re being locked into their homes; they’re being denied nutrition, hydration [and] access to medical care in the name of combating an invisible, amorphous disease. That’s exactly what the Nazis were doing.”\n\nThe rabbi also walked the walk when it came to freedom, as he resolutely kept his synagogue open despite then-Massachusetts Gov. Charlie Baker deeming public worship “not essential” and ordering that houses of worship be closed.\n\n“I decided right then and there, [and] told my wife: ‘We are not shutting the doors of our synagogue for one day.’ My wife said: ‘Well, what if someone gets sick? What if we get sick and die?’ [I replied:] ‘We have to be ready to die. We have to be ready to die before we allow the government to shut down our religious observances, our right to live and [to] live freely.'”\n\nGreen ultimately remarked that such injustices can only take place when safety and security are elevated as the highest values of society. He argued that the two must be subordinated to freedom, “a value worth dying for.”\n\nWatch Michoel Green discuss COVID-19 vaccine mandates and medical tyranny with “The Sentinel Report” host Alex Newman below.\n\nThis video is from The New American channel on Brighteon.com.\n\nHolocaust survivor implores Westerners to ‘wake up’ and ‘resist’ ongoing tyranny in alleged ‘democratic’ countries.\n\n‘Resist, wake up, stop obeying’: Holocaust survivor draws parallels in current society to Nazi Germany.\n\nHolocaust survivor says the time to resist is now: “Never again” applies to covid tyranny.", "opengraph": {"article:published_time": "2023-02-07 10:28:21", "title": "Some things never change: Documentary reveals similarities between 1930s pre-Holocaust and 2020s COVID propaganda", "type": "article", "url": "https://www.govtslaves.com/2023-02-06-documentary-reveals-similarities-pre-holocaust-covid-propaganda.html", "site_name": "Gov't Slaves Com", "description": "A documentary film revealed similarities between pre-Holocaust propaganda during the 1930s and Wuhan coronavirus (COVID-19) propaganda during the 2020s. The first part of the five-part documentary titled “Never Again,” directed by Holocaust survivor and health freedom activist Vera Sharav, debuted on Jan. 30. Among the individuals interviewed in the film was Michoel Green, a Jewish Orthodox rabbi […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/02/Holocaust-Victims-Evil.jpg"}, "tags": ["covid-19", "Liberty", "medical fascism", "fascism", "Michoel Green", "never again", "Nazi Germany", "vaccine", "Vera Sharav", "Medical Tyranny", "unvaccinated", "freedom", "Wuhan coronavirus", "discrimination", "Holocaust", "medical martial law"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/never-again-documentary-draws-disturbing-parallels-between-pre-holocaust-and-covid-era-propaganda/", "https://www.timesofisrael.com/anti-vaxxer-rabbi-fired-by-chabad-over-social-media-posts/", "https://perspectives.ushmm.org/item/propaganda-poster-jews-are-lice-they-cause-typhus", "https://naturalnews.com/2021-06-13-chabad-rabbi-defends-marjorie-greene.html", "https://medicalfascism.news", "https://freedom.news", "https://www.brighteon.com/14dbdc61-2df1-4030-847b-6e0b5a67ba0b", "https://www.brighteon.com/channels/thenewamerican", "https://tyranny.news/2022-08-03-holocaust-survivor-implores-westerners-resist-ongoing-tyranny.html", "https://obey.news/2022-08-07-parallels-in-current-society-to-nazi-germany.html", "https://medicalfascism.news/2021-08-22-holocaust-survivor-covid-measures-similar-nazi-germany.html", "https://resist.news/2022-01-28-holocaust-survivor-resist-never-again-covid-tyranny.html", "https://medicalfascism.news/2022-03-18-nazi-policies-covid-policies-similar-holocaust-survivor.html", "https://www.lifesitenews.com/news/never-again-documentary-draws-disturbing-parallels-between-pre-holocaust-and-covid-era-propaganda/", "https://www.timesofisrael.com/anti-vaxxer-rabbi-fired-by-chabad-over-social-media-posts/", "https://perspectives.ushmm.org/item/propaganda-poster-jews-are-lice-they-cause-typhus", "https://www.brighteon.com/14dbdc61-2df1-4030-847b-6e0b5a67ba0b", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-02-06-documentary-reveals-similarities-pre-holocaust-covid-propaganda.html&linkname=Some%20things%20never%20change%3A%20Documentary%20reveals%20similarities%20between%201930s%20pre-Holocaust%20and%202020s%20COVID%20propaganda", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-02-07 10:28:21"}