{"result_id": "141003", "URL": "https://govtslaves.com/2022-04-27-lots-of-doctors-slaves-to-medical-system.html", "timestamp": "2023-04-25 15:21:09 CEST+0200", "meta": {"description": "Florida-based lawyer Jay Sanchez said a lot of doctors are slaves to the medical system. “A lot of doctors are kind of slaves to the system. They didn’t know, but I understand a lot of these doctors for economical reasons have become part of these hospitals and now they are slaves to the hospitals,” Sanchez […]", "lang": "en", "keywords": "badhealth,badmedicine,Brighteon.tv,Bryan Ardis,covid-19,enslaved,federal health agencies,insanity,Jay Sanchez,Liberty,medical censorship,medical fascism,medical freedom,Medical Tyranny,pandemic,Peter McCullough,The Dr. Ardis Show,United States", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-04-27-lots-of-doctors-slaves-to-medical-system.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Atty. Jay Sanchez tells Dr. Bryan Ardis: A lot of doctors are slaves to the medical system – Brighteon.TV", "cleaned_text": "Atty. Jay Sanchez tells Dr. Bryan Ardis: A lot of doctors are slaves to the medical system – Brighteon.TV\n\nFlorida-based lawyer Jay Sanchez said a lot of doctors are slaves to the medical system.\n\n“A lot of doctors are kind of slaves to the system. They didn’t know, but I understand a lot of these doctors for economical reasons have become part of these hospitals and now they are slaves to the hospitals,” Sanchez told host Dr. Bryan Ardis during the April 20 episode of “The Dr. Ardis Show” on Brighteon.TV.\n\nSanchez cited as an example a New York-based doctor who wasn’t able to provide a prescription for ivermectin for fear that he may lose his job for prescribing a medicine that is not approved by the federal health agencies. (Related: Japanese study finds that ivermectin is “safe and effective” for treating covid.)\n\nThe lawyer is part of a group called FormerFedsGroup Freedom Foundation (FFFF), which is headed by well-known cardiologist Dr. Peter McCullough. The group intends to help doctors who are being punished by the medical system.\n\nSanchez is encouraging doctors to join the group, saying that “it could provide a bit of protection for them.”\n\nFFFF is a New Jersey-based 501(c)(3) organization composed of former federal agents, prosecutors, lawyers, medical professionals, researchers and volunteers from the United States and all over the world.\n\nArdis mentioned that he had always wanted to defend the medical profession, especially the medical professionals who have been hammered, bullied, lied to, coerced and threatened with their livelihoods and licenses being taken away. He added that for the last two years he has been fighting non-stop and defensively for those medical doctors who are actually trying to preserve the lives of innocent people.\n\nThe host of the “The Dr. Ardis Show” added that he has no problem defending and supporting doctors who need help because they have been abused by the medical system.\n\nSome doctors are not standing up because they need the money\n\nArdis pointed out that some doctors aren’t standing up against their administrators or the federal health agencies because they are living paycheck to paycheck.\n\n“These people are relying on the hospitals to pay them on Fridays, to give them their paychecks. So yes, they are actually employees, waiting for a check and they’re scared to death,” Ardis explained. “And it’s unfortunate. I don’t think it’s a good reason. I just know they are slaves like you said of the system and that’s unfortunate.”\n\nSanchez pointed out that there are people who feel alone, especially those who are threatened. “They need to be told that they are not alone,” he said.\n\nArdis shared a story of a nurse who almost quit her job because she was not willing to get the shots. He added that the nurse and 27 other people working at the same hospital formed a group and told the administrators that they were not getting the shots. The hospital dropped its vaccine mandate.\n\nSanchez said America will be like China if people won’t stand up. He added that people should not be blinded by money, but should instead look at things rationally.\n\nFollow MedicalTyranny.com to know more about COVID mandates being enforced.\n\nWatch the full April 20 episode of “The Dr. Ardis Show” below. “The Dr. Ardis Show” airs every Wednesday at 10-11 a.m. on Brighteon.TV.\n\nMedical fascism: Hospitals DENY TREATMENT to Pennsylvania woman unable to mask up due to childhood trauma\n\nAmericans are now having to sneak ivermectin into hospitals to save their loved ones", "opengraph": {"article:published_time": "2022-04-27 11:49:43", "title": "Atty. Jay Sanchez tells Dr. Bryan Ardis: A lot of doctors are slaves to the medical system – Brighteon.TV", "type": "article", "url": "https://www.govtslaves.com/2022-04-27-lots-of-doctors-slaves-to-medical-system.html", "site_name": "Gov't Slaves Com", "description": "Florida-based lawyer Jay Sanchez said a lot of doctors are slaves to the medical system. “A lot of doctors are kind of slaves to the system. They didn’t know, but I understand a lot of these doctors for economical reasons have become part of these hospitals and now they are slaves to the hospitals,” Sanchez […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/04/Coronavirus-Briefing-Paperwork-Hospital-Staff.jpg"}, "tags": ["pandemic", "The Dr. Ardis Show", "covid-19", "Liberty", "medical censorship", "medical fascism", "enslaved", "Jay Sanchez", "federal health agencies", "Bryan Ardis", "Brighteon.tv", "Medical Tyranny", "medical freedom", "Peter McCullough", "insanity", "United States"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/7cbe700d-02fd-4d80-8e89-50e5c4fcb915", "https://brighteon.tv/", "https://naturalnews.com/2022-02-04-japanese-study-ivermectin-safe-effective-treating-covid.html", "http://medicaltyranny.com", "http://www.brighteon.com/7cbe700d-02fd-4d80-8e89-50e5c4fcb915", "https://brighteon.tv/", "https://medicaltyranny.com/2022-04-04-woman-with-mask-trauma-denied-treatment-pennsylvania.html", "https://naturalnews.com/2022-01-28-americans-sneak-ivermectin-hospitals-save-loved-ones.html", "https://naturalnews.com/2022-03-29-tyrannical-vaccine-mandates-continue-as-covid-subsides.html", "https://www.brighteon.com/7cbe700d-02fd-4d80-8e89-50e5c4fcb915", "http://formerfedsgroup.org/about/#:~:text=FormerFedsGroup%20Freedom%20Foundation%20The%20FormerFedsGroup%20Freedom%20Foundation%20%28FFFF%29,the%20United%20States%20and%20all%20over%20the%20world.", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2022-04-27-lots-of-doctors-slaves-to-medical-system.html&linkname=Atty.%20Jay%20Sanchez%20tells%20Dr.%20Bryan%20Ardis%3A%20A%20lot%20of%20doctors%20are%20slaves%20to%20the%20medical%20system%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2022-04-27 11:49:43"}