{"result_id": "141042", "URL": "https://www.govtslaves.com/2023-04-13-npr-state-propaganda-outlet-despite-its-denials.html", "timestamp": "2023-04-25 15:21:34 CEST+0200", "meta": {"description": "National Public Radio (NPR) recently decried its labeling by Twitter as a “state-affiliated media outlet.” But it’s not really hard to prove that NPR is indeed a state propaganda outlet. An April 5 article by the outlet denied the claim, pointing out that the designation is typically reserved for official state mouthpieces and propaganda outlets in countries […]", "lang": "en", "keywords": "big government,Caitlin Johnstone,conspiracy,deception,government funding,Government Slaves,John Lansing,Journalism,mainstream media,national public radio,news cartels,NPR,propaganda,Radio Free Asia,Radio Free Europe,Radio Liberty,state-affiliated outlet,Twitter", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.govtslaves.com/2023-04-13-npr-state-propaganda-outlet-despite-its-denials.html", "encoding": "UTF-8"}, "image": null, "domain": "www.govtslaves.com", "title": "NPR undoubtedly a STATE PROPAGANDA outlet despite its denials", "cleaned_text": "National Public Radio (NPR) recently decried its labeling by Twitter as a “state-affiliated media outlet.” But it’s not really hard to prove that NPR is indeed a state propaganda outlet.\n\nAn April 5 article by the outlet denied the claim, pointing out that the designation is typically reserved for official state mouthpieces and propaganda outlets in countries such as Russia and China. “NPR operates independently of the U.S. government. And while federal money is important to the overall public media system, NPR gets less than one percent of its annual budget … from federal sources,” the article stated.\n\nNPR CEO John Lansing also denounced the label, saying: “It is unacceptable for Twitter to label us this way. A vigorous, vibrant free press is essential to the health of our democracy. NPR stands for freedom of speech and holding the powerful accountable.”\n\nBut independent journalist Caitlin Johnstone begged to differ. In an April 6 piece on her Substack, she laid down her arguments as to why NPR definitely deserves the “state-affiliated media” label.\n\n“It’s a bit funny that Lansing is now cited complaining about NPR being labeled ‘state-affiliated media’ on Twitter, given that he has devoted his life to promulgating U.S. state-affiliated media,” she wrote. “NPR receives funding from the U.S. government, consistently advances the information interests of the U.S. government and is routinely run by professional propagandists of the U.S. government.” (Related: ‘P’ for public or propaganda? How NPR morphed into a voice for the ‘elite establishment.’)\n\nJohnstone also touched on the argument of NPR defenders, who claim that the label is inaccurate as the outlet “only receives a small amount of its funding from the U.S. government.” She pointed out that NPR‘s website itself said “federal funding is essential to public radio’s service to the American public and its continuation is critical for both stations and program producers” – with the website emphasizing the word “essential.”\n\nThe independent journalist then shifted the spotlight to Lansing and his predecessors at NPR. Prior to his stint at the outlet, the NPR CEO had served as the CEO of the U.S. Agency for Global Media (USAGM) from 2015 to 2019. The USAGM runs state-funded outlets such as Radio Free Asia (RFA), Radio Free Europe/Radio Liberty (RFE/RL) and Voice of America.\n\nRFE was established in 1949 and RL four years later in 1953. Both merged to form RFE/RL in 1976, with the resulting entity continuing to this day.\n\nMeanwhile, RFA was set up in 1951 as the eastern counterpart to RFE and RL – but went off the air four years later in 1955. It lay dormant for 41 years, until the efforts of the Clinton administration brought it back to life in 1996.\n\nFurther bolstering the propaganda connection, Johnstone cited a 1977 article by the New York Times that explicitly named RFE, RL and RFA as stations part of the network constructed by the Central Intelligence Agency to circulate propaganda worldwide.\n\nAccording to Johnstone, Lansing’s history “is not an anomaly” as NPR is often headed by executives that oversee propaganda efforts for Washington. Kevin Klose, who served as the outlet’s president from 1998 to 2008, had previously run RFE/RL. He then returned to the state-funded radio outlet after his 10-year stint.\n\nMeanwhile, Ken Stern became NPR‘s CEO in 2006 after assuming the executive vice president post in 1999. But prior to joining NPR, he served as the senior advisor to the director of the USAGM’s International Broadcasting Bureau.\n\nJohnstone ultimately remarked: “If you’ve conceded that you receive government funding to any extent, it’s hard to then argue that you are in no way ‘affiliated’ with that government.”\n\nVisit NPR.news for more stories about the outlet.\n\nWatch Fox News anchor Tucker Carlson discusses NPR‘s reaction to being slapped with the “government-funded media” label below.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nTaxpayer-supported NPR embraces looting and rioting — how long before the Left-wing network voices support for political genocide against conservatives?\n\nWhy should taxpayers keep paying the salaries of sex perverts and gropers at PBS and NPR?\n\nTucker Carlson: NPR has become ‘insane’ & ‘unrecognizable’ since takeover by woke left.\n\nPBS and NPR – The ultimate FAKE NEWS duo of all time.", "opengraph": {"article:published_time": "2023-04-13 10:43:38", "title": "NPR undoubtedly a STATE PROPAGANDA outlet despite its denials", "type": "article", "url": "https://www.govtslaves.com/2023-04-13-npr-state-propaganda-outlet-despite-its-denials.html", "site_name": "Gov't Slaves Com", "description": "National Public Radio (NPR) recently decried its labeling by Twitter as a “state-affiliated media outlet.” But it’s not really hard to prove that NPR is indeed a state propaganda outlet. An April 5 article by the outlet denied the claim, pointing out that the designation is typically reserved for official state mouthpieces and propaganda outlets in countries […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/04/NPR-headquarters.jpg"}, "tags": ["conspiracy", "John Lansing", "big government", "Radio Liberty", "Caitlin Johnstone", "mainstream media", "Journalism", "state-affiliated outlet", "deception", "NPR", "Twitter", "Radio Free Europe", "government funding", "news cartels", "propaganda", "Radio Free Asia", "national public radio", "Government Slaves"], "tweets": [], "movies": [], "links": ["https://www.shtfplan.com/headline-news/for-the-record-npr-absolutely-is-us-state-propaganda", "https://www.npr.org/2023/04/05/1168158549/twitter-npr-state-affiliated-media", "https://caitlinjohnstone.substack.com/p/for-the-record-npr-absolutely-is", "https://govtslaves.com/", "https://naturalnews.com/2022-11-15-how-npr-morphed-into-voice-elite-establishment.html", "https://www.nytimes.com/1977/12/26/archives/worldwide-propaganda-network-built-by-the-cia-a-worldwide-network.html", "https://npr.news/", "https://www.brighteon.com/0d24d6ab-3dce-40cc-8e04-1b0f019795df", "https://www.brighteon.com/channels/galacticstorm", "https://npr.news/2020-09-01-taxpayer-supported-npr-embraces-rioting-looting-political-genocide.html", "https://npr.news/2018-01-04-why-should-taxpayers-keep-paying-the-salaries-of-sex-perverts-and-gropers-at-pbs-and-npr.html", "https://npr.news/2022-01-27-npr-became-insane-unrecognizable-takeover-woke-left.html", "https://deception.news/2022-07-19-disinformation-spreading-npr-launches-disinformation-reporting-team.html", "https://npr.news/2020-05-11-pbs-and-npr-ultimate-fake-news-duo.html", "https://www.shtfplan.com/headline-news/for-the-record-npr-absolutely-is-us-state-propaganda", "https://www.npr.org/2023/04/05/1168158549/twitter-npr-state-affiliated-media", "https://caitlinjohnstone.substack.com/p/for-the-record-npr-absolutely-is", "https://www.nytimes.com/1977/12/26/archives/worldwide-propaganda-network-built-by-the-cia-a-worldwide-network.html", "https://www.brighteon.com/0d24d6ab-3dce-40cc-8e04-1b0f019795df", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-04-13-npr-state-propaganda-outlet-despite-its-denials.html&linkname=NPR%20undoubtedly%20a%20STATE%20PROPAGANDA%20outlet%20despite%20its%20denials", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-04-13 10:43:38"}