{"result_id": "141009", "URL": "https://govtslaves.com/2023-03-19-biden-family-member-received-cut-wire-ccp.html", "timestamp": "2023-04-25 15:21:13 CEST+0200", "meta": {"description": "An unidentified member of the Biden family allegedly received a portion of the $3 million wired by two individuals tied to the Chinese Communist Party (CCP). The existence of the new, unnamed family member was revealed by Rep. James Comer (R-KY), chairman of the House Oversight Committee. This relative allegedly received a portion of the money […]", "lang": "en", "keywords": "Biden crime family,CCP,China,corruption,Hallie Biden,House Oversight Committee,Hunter Biden,influence peddling,investigation,James Biden,James Comer,Joe Biden,national security,traitors,treason", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-03-19-biden-family-member-received-cut-wire-ccp.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Biden family member received cut of $3M wire from CCP-linked individuals", "cleaned_text": "An unidentified member of the Biden family allegedly received a portion of the $3 million wired by two individuals tied to the Chinese Communist Party (CCP).\n\nThe existence of the new, unnamed family member was revealed by Rep. James Comer (R-KY), chairman of the House Oversight Committee. This relative allegedly received a portion of the money wired to Rob Walker, a close associate of presidential son Hunter Biden, by two individuals with links to the CCP. The transfer allegedly happened in 2017, shortly after incumbent President Joe Biden ended his vice presidential tenure under the Obama administration.\n\nComer earlier said that evidence of CCP money flowing to the Biden family was “as bad as we thought.” Bank records obtained via a subpoena revealed the said family member’s involvement in the scheme. (Related: Biden is compromised: Leaked emails reveal Hunter Biden was happy to introduce business partners to top CCP official.)\n\n“The very next day after the [$3 million] wire was received, the Walker account started transferring money into different Biden family members’ accounts – including a new Biden family member that’s never before been identified as someone being involved in the influence-peddling scheme,” the Kentucky congressman told Fox News host Sean Hannity.\n\n“There are more family members involved in this than just the president’s son. [This is] just the first wire that we’ve actually been able to obtain bank records on. There are many, many more.”\n\nAccording to the chair of the House Oversight Committee, Republican investigators are curious about what work Biden family members performed in exchange for the money Walker disbursed.\n\n“What they’ve said in the media – ‘Oh, this was for business’ – we can’t identify any business. It appears [the money] went into their personal account,” the congressman continued. He believes the Biden family was running an influence-peddling operation as unregistered foreign agents.\n\nThree recipients of Walker money identified – but who’s the fourth?\n\nComer initially revealed that two of the accounts Walker transferred the money to belonged to Hunter and James Biden, the president’s younger brother. He later mentioned Hallie Biden – the widow of Hunter’s older brother Beau – as the third account owner that received money from Walker. Hunter had dated his sister-in-law after Beau died of brain cancer in 2015.\n\nWhile the three recipients of money from Walker – Hunter, James and Hallie – had been identified, the identity of the unnamed fourth member remains a mystery. This fourth member received $70,000 from the $3 million wired to the presidential son’s business associate.\n\nThe Daily Mail proposed several individuals who could be this unnamed fourth member in a March 17 report. The potential candidates are First Lady Jill Biden, James’ daughter Caroline and the president’s older brother Frank. Other names include Hunter’s sister Ashley and his oldest daughter Naomi.\n\nThe British news outlet ultimately suggested that the fourth recipient could be the U.S. president himself – the “Big Guy” pertained to in an email from Hunter. According to the said email that surfaced in 2020, the “Big Guy” would be entitled to 10 percent of money from a deal with a Chinese firm. This percentage would be held by Hunter as a proxy.\n\nComer said the GOP-controlled House will probe all of the first family’s dealings.\n\n“The [House] Oversight Committee is concerned about the national security implications resulting from President [Joe] Biden’s family receiving millions of dollars from foreign nationals. We will continue to follow the money trail and facts to determine if [the] president is compromised by his family’s business schemes and if there is a national security threat.”\n\nVisit BidenCrimeFamily.news for more stories about the Bidens’ underhanded deals.\n\nWatch Kentucky Rep. James Comer reveal that Hallie Biden received money from her family’s deals with China.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nA look back at the Biden family’s China business ties.\n\nMoney laundering: Joe Biden’s brother sent bank “wiring instructions” to “spy chief of China.”\n\nCCP takes advantage of Hunter Biden firm to take control over major swaths of American real estate.\n\nJoe Biden is making it seem like neither he nor his son are owned by Beijing’s ChiComs with head-fake “investment ban” on Chinese firms.", "opengraph": {"article:published_time": "2023-03-19 12:06:22", "title": "Biden family member received cut of $3M wire from CCP-linked individuals", "type": "article", "url": "https://www.govtslaves.com/2023-03-19-biden-family-member-received-cut-wire-ccp.html", "site_name": "Gov't Slaves Com", "description": "An unidentified member of the Biden family allegedly received a portion of the $3 million wired by two individuals tied to the Chinese Communist Party (CCP). The existence of the new, unnamed family member was revealed by Rep. James Comer (R-KY), chairman of the House Oversight Committee. This relative allegedly received a portion of the money […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/03/AP_102137492658.jpg"}, "tags": ["Biden crime family", "CCP", "Joe Biden", "Hunter Biden", "national security", "treason", "investigation", "China", "Hallie Biden", "influence peddling", "James Biden", "traitors", "corruption", "James Comer", "House Oversight Committee"], "tweets": [], "movies": [], "links": ["https://www.infowars.com/posts/rumors-swirl-over-which-biden-family-member-got-cut-of-3m-ccp-linked-wire/", "https://www.naturalnews.com/2022-09-13-hunter-biden-introduce-business-partners-ccp-official.html", "https://www.dailymail.co.uk/news/article-11873539/Is-Dr-Jill-Big-Guy-GOP-set-reveal-fourth-Biden-receive-foreign-cash.html", "http://bidencrimefamily.news/", "https://www.brighteon.com/b90e93c2-d503-480a-8ca6-669f3aa7ae5c", "https://www.brighteon.com/channels/galacticstorm", "https://corruption.news/2020-10-27-biden-familys-china-business-ties.html", "https://communistchina.news/2020-11-01-hunter-biden-maintained-close-relationship-with-ccp-energy-tycoon.html", "https://corruption.news/2020-10-28-money-laundering-joe-biden-brother-wiring-instructions-spy-chief-china.html", "https://communistchina.news/2020-10-27-ccp-takes-advantage-hunter-biden-firm-real-estate.html", "https://communistchina.news/2021-06-22-biden-faking-independence-from-ccp-with-investment-ban.html", "https://www.infowars.com/posts/rumors-swirl-over-which-biden-family-member-got-cut-of-3m-ccp-linked-wire/", "https://www.dailymail.co.uk/news/article-11873539/Is-Dr-Jill-Big-Guy-GOP-set-reveal-fourth-Biden-receive-foreign-cash.html", "https://www.brighteon.com/b90e93c2-d503-480a-8ca6-669f3aa7ae5c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-03-19-biden-family-member-received-cut-wire-ccp.html&linkname=Biden%20family%20member%20received%20cut%20of%20%243M%20wire%20from%20CCP-linked%20individuals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-03-19 12:06:22"}