{"result_id": "141050", "URL": "https://govtslaves.com/2023-02-08-gun-control-kills-people.html", "timestamp": "2023-04-25 15:21:39 CEST+0200", "meta": {"description": "When will the fascist far left admit that it has blood on its collective hands and it’s time to restore the people’s common sense civil rights? “There is no comparison whatever between an armed and disarmed man; it is not reasonable to suppose that one who is armed will obey willingly one who is unarmed; […]", "lang": "en", "keywords": "2nd Amendment,government,gun control,gun grabbers,guns,propaganda,self-defense,totalitarianism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-02-08-gun-control-kills-people.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Gun control kills people", "cleaned_text": "When will the fascist far left admit that it has blood on its collective hands and it’s time to restore the people’s common sense civil rights?\n\n“There is no comparison whatever between an armed and disarmed man; it is not reasonable to suppose that one who is armed will obey willingly one who is unarmed; or that any unarmed man will remain safe.”\n\nDid you notice that the national socialist media spent little time trying to exploit the recent mass shootings in the people’s republic of California? Anti-liberty authoritarians of the fascist far left live to exploit other people’s pain for their political gain.\n\nAnd yet aside from a few perfunctory calls for more restrictions on liberty, they only issued only desperate excuses for why their gun-grabbing agenda didn’t work.\n\nWhere was the usual wall-to-wall coverage stretching on for weeks so the result will be a new set of incremental restrictions on our civil rights? Where were the endless repetitions of the names, images, and backgrounds of the mass murderers to spread the media contagion once more?\n\nIt wasn’t just that the mass murders didn’t meet the proper media profile. They’re always ready to push the propaganda for ratings. If that just happens to inspire further attacks, as it always does through the known phenomena of media contagion, that’s just icing on the cake.\n\nWhy weren’t the ghouls of the gun-grabbing lobby looking for more restrictions on liberty? Why would they let a golden opportunity to take guns away from the innocent slip by?\n\nIt wasn’t just the perpetrator profiles; the national socialist media and the gun-grabbers have just about everything they ever wanted in controlling other people in the state. With that, the leftist gun-grabbing ghouls have run into a brick wall.\n\nThey’ve run out of ideas aside from outright gun confiscation, so now they have two big problems:\n• They have nothing else to offer.\n• Everyone is wondering why their liberty restriction agenda doesn’t work\n\nAccording to moms looking for action in Everytown, California is the perfect model for their agenda, with every demand they’ve ever wanted on the books. And with the people disarmed, they were easily slaughtered, as always is the case with gun control.\n\nYou would think they would show some remorse for disarming the innocent and thereby increasing the carnage, but you would be wrong. Being a leftist means never having to say you’re sorry. It’s always someone else’s fault when their policy proposals designed to enhance their power get people killed.\n\nThus, they can blithely move on when they fail and just make more demands against our basic freedoms without even a hint of guilt — except when they run up against the brick wall of getting everything they wanted and it still doesn’t work.\n\nThen they have to move on to the next “surrounding area” to try it all over again. When restrictions on liberty fail in a city, they blame it on the “surrounding area” of the county. When these fail in a county, they blame it on the state. When these fail in a state, they blame it on the nation. When those inevitably fail once again, they blame the “surrounding areas” around a country. They never can quite explain how that works around the island nations of New Zealand, Australia, and the U.K., but we digress.\n\nAt some point, don’t we have the right to ask when their ever-vaunted “gun safety” agenda is going to work? If not in one of the largest states in the lower 48, then where?\n\nIf they’re going to illogically claim that depriving people of their commonsense civil rights protects them, then let’s see some results instead of lying with language and an endless supply of bovine soil enhancement.\n\nPeople’s lives are at stake. This isn’t about virtue-signaling or photo ops with small groups of people in red shirts. If they’re going to promise “peace” and “safety” and fail to deliver, shouldn’t they be held accountable for their actions?\n\nLet’s just say it out loud: gun control gets people killed.\n\nDepriving people of their means of self-defense does nothing to protect them. That should be bloody obvious to anyone with common sense.\n\nBut they have those who toss off simplistic rubbish such as “remove guns, and you will have zero or few deaths by gun.”\n\nThey will self-assuredly claim that banning scary-looking guns, magazines of certain sizes (note that they rarely specify the size), and poltergeist pistols will supposedly save lives. They just won’t be able to get into the details about how it’s all going to work. After all, we’re supposed to be dependent on the government (meaning them) for our protection anyway, even though case law absolves them of having to protect us.\n\nHave you noticed that leftists don’t even believe in their most basic of policy proposals: the massacre zone (AKA “gun free” zone)?\n\nThey’ll virtue-signal all day long about keeping guns from “sensitive places.” But you had better believe they will have taxpayer-funded armed security wherever they reside. Meanwhile, they are perfectly happy to impose their massacre zones on the little people just because they care so much.\n\nConsider this thought experiment: what would you do if you wanted to deliberately encourage mass shootings, resulting in as many deaths as possible at one time?\n\nHow would you make sure there were plenty of mass-casualty events to bring forth the clarion call for more gun control?\n\nThe obvious answer is that you would set up situations where the innocent are disarmed by silly rules or signs that only good people are going to obey. The result would be that only the bad guys would have guns, and they could kill with impunity.\n\nStatistics show that while that is exactly what happens, the gaslighting ghouls of the left deny this basic reality. Why? Why would they want the carnage to continue when the obvious answer is to stop depriving the innocent of their commonsense civil rights?\n\nGun control is based on a false premise: the ridiculous idea that “if no one has a gun, no one needs a gun.”\n\nThe false promise is that if you give up your basic human right of self-defense, you will still be safe because everyone else will supposedly follow the same silly rules.\n\nExcept that these mass shootings put the lie to that magical thinking. You would think that the gun-grabber lobby would undergo some self-reflection on this point, but that never seems to happen, does it?\n\nThey never question whether their massacre zones, persecuting the innocent, and trying to eviscerate our common-sense civil rights are putting people in danger. They simply come up with new hurdles to self-defense and make things even more dangerous for people, all in the name of “gun safety.” It doesn’t work and causes even more tragedies.\n\nSo why aren’t they held accountable for all the carnage? And why do we still listen to them when they don’t have our best interests at heart?\n\nWhy not just give liberty a try and stop interfering with the people’s commonsense civil right to self-defense?", "opengraph": {"article:published_time": "2023-02-08 09:50:12", "title": "Gun control kills people", "type": "article", "url": "https://www.govtslaves.com/2023-02-08-gun-control-kills-people.html", "site_name": "Gov't Slaves Com", "description": "When will the fascist far left admit that it has blood on its collective hands and it’s time to restore the people’s common sense civil rights? “There is no comparison whatever between an armed and disarmed man; it is not reasonable to suppose that one who is armed will obey willingly one who is unarmed; […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/02/Bills-Of-Rights-Handgun-Weapon-Bullets.jpg"}, "tags": ["government", "gun grabbers", "self-defense", "guns", "gun control", "propaganda", "totalitarianism", "2nd Amendment"], "tweets": [], "movies": [], "links": ["https://www.americanthinker.com/articles/2023/02/gun_control_kills_people.html", "https://archive.ph/2etcS", "https://web.archive.org/web/20230128161613/https:/apnews.com/article/politics-shootings-texas-colorado-045c6a88439907da9895af0ceb0e9404", "https://web.archive.org/web/20230126105203/https:/abcnews.go.com/US/experts-explain-california-rife-gun-violence-despite-stringent/story?id=96665000", "https://archive.is/6CIJv", "https://web.archive.org/web/20230127064330/https:/www.politico.com/news/2023/01/23/california-supreme-court-lunar-new-year-shooting-00079141", "https://reason.com/video/2022/09/16/is-the-media-making-mass-shootings-worse/", "https://www.reuters.com/world/us/copycat-mass-shootings-becoming-deadlier-experts-warn-after-new-york-attack-2022-05-15/", "https://archive.ph/3NuqK", "https://archive.ph/X3mag", "https://web.archive.org/web/20230202035523/https:/www.eastbaytimes.com/2023/02/01/new-gun-laws-california-aims-to-limit-concealed-weapons-this-time-will-it-stick/", "https://archive.is/https:/www.everytown.org/state/california/", "https://crimeresearch.org/2023/01/what-do-the-attacks-in-monterey-park-and-half-moon-bay-in-california-have-in-common-very-strict-gun-control-and-virtually-no-one-has-a-concealed-handgun-permit/", "https://www.thetruthaboutguns.com/unpossible-six-shot-dead-including-two-cops-in-heavily-gun-controlled-australia/", "https://www.findlaw.com/legalblogs/law-and-life/do-the-police-have-an-obligation-to-protect-you/", "https://mises.org/power-market/police-have-no-duty-protect-you-federal-court-affirms-yet-again", "https://crimeresearch.org/2018/06/more-misleading-information-from-bloombergs-everytown-for-gun-safety-on-guns-analysis-of-recent-mass-shootings/", "https://web.archive.org/web/20221208012801/https:/www.whingewhingewine.co.uk/gun-control-now-please.html", "https://www.youtube.com/watch?v=j2n4RnXTS1A", "https://web.archive.org/web/20230202034513/https:/abc7news.com/sb2-california-concealed-carry-ca-gun-laws-gavin-newsom/12759930/", "https://www.americanthinker.com/articles/2023/02/gun_control_kills_people.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-02-08-gun-control-kills-people.html&linkname=Gun%20control%20kills%20people", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-02-08 09:50:12"}