{"result_id": "141022", "URL": "https://govtslaves.com/2023-03-01-its-coming.html", "timestamp": "2023-04-25 15:21:21 CEST+0200", "meta": {"description": "“It’s Coming.” That’s what Elon Musk said a while back apropos of the Twitter files that show all the US government suppression of Covid-19 information mis-labeled as “misinformation.” Think of whatever the truth is as mis-misinformation. Get it?  You might have to read that sentence more than once to comprehend what went wrong with the […]", "lang": "en", "keywords": "badhealth,badmedicine,biased,big government,Big Pharma,brainwashed,conspiracy,Dangerous Medicine,deception,Government Slaves,insanity,Journalism,left cult,mainstream media,misinformation,news cartels,pandemic,pharmaceutical fraud,propaganda,stupid,vaccine,vaccine wars,vaccines,woody harrelson", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-03-01-its-coming.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "It’s coming", "cleaned_text": "“It’s Coming.” That’s what Elon Musk said a while back apropos of the Twitter files that show all the US government suppression of Covid-19 information mis-labeled as “misinformation.” Think of whatever the truth is as mis-misinformation. Get it? You might have to read that sentence more than once to comprehend what went wrong with the American consensus the past three years. And then you’ll begin to understand why the operation is called mind-fuckery.\n\n“It” comes out in weird ways now. For instance, Woody Harrelson’s little prank on Saturday Night Live. The A-List actor opened the show acting stoned, talking about how much he likes weed and getting stoned, and, at the very end of his routine, spoke of a “movie script” that spun out in his stoned head:\n\nOne can also imagine the NBC lawyers’ iPhones lighting up and emitting a cacophony of ring-tones in the late-night hours following Woody’s little gaucherie. After all, this is the TV network that still employs the likes of Rachel Maddow, Misinformation-Informer-in-Chief of the whole USA who, for years, has performed as the icon representing how the political Left thinks of itself, and what it thinks. What the Left thinks of itself, of course, is that it’s collectively the smartest person in the world. And what the Left actually thinks is exactly what Woody’s movie script implied: believe everything that the government, the news media, and the drug companies tell you, and act accordingly, and destroy anyone who says otherwise.\n\nWoody’s gag offended the news media hugely and instantly, said media being scaffolded on the Internet. The response was wildly censorious. Vanity Fair’s insta-bulletin said, “Uncle Woody… taking the stage to float conspiracy theories disguised as provocative humor is both intellectually dishonest and tedious.” Tedious? As if you’ve heard that come out of A-list actors’ mouths a thousand times? I doubt it. Who is being “intellectually dishonest” exactly?\n\nRolling Stone, likewise headlined: “Woody Harrelson Spreads Anti-Vax Conspiracies During SNL Monologue.” (Just how anti-anti-establishment now is the old counter-culture rag I once worked for?) The Daily Beast, The Left’s house organ, echoed that: “Woody Harrelson Spews Anti-Vax Conspiracies in Rambling SNL Monologue.” Notice, “spews,” as in the most vile and disgusting bodily function imaginable, you revolting piece of filth….\n\nNow, what Woody actually didn’t say in that little riff, if you’re paying attention, is that the vaxxes in question are ineffective and dangerous. Yes, he actually left that part out, though there were enough dots in the monologue to connect that message, if you were of a mind to. The problem for the smartest people in the world is that their minds stopped working about five years ago — mainly when a certain DJT stepped onstage to declare that the Left’s management of national affairs was corrupt, depraved, and dangerous. This enraged the management class to the max.\n\nGraduates of Yale, Brown, Harvard, and the rest of the elite service academies went nuts over that and, in a bizarre switcheroo for the ages, became the staunchest defenders of anything the government decided to impose on the people of this land, starting with a series of political hoaxes — RussiaGate, Ukraine phone call impeachment — cresting with the Covid-19 hysteria and its vaccination cherry-on-top. The smartest people in the world were all-in on all of that, and knocked themselves out enforcing and defending it.\n\nAnd now… it’s coming… out. They were played. Absolutely snookered. All. These. Brilliant. Morally unassailably upright. Good. People. Taken for a ride. Spoofed. Put-on. Conned. And they sold out their country in the process. And now they cower on the verge of being unmasked for the mendacious fools they are. One might empathize at how horribly painful this is, the ethical wreckage of a whole social demographic! But don’t confuse empathy with sympathy. They are about to sink in historic disgrace and ignominy, and that’s why their official interlocutors react so harshly.\n\nAnother part Woody left out is what happens after the suckered people take the cartel’s drug over and over. They get sick and many of them die. We are just getting started with that chapter of the story and, as statistical investigator Edward Dowd said recently, the mRNA “vaccines” have already killed more Americans than all the wars this country ever fought. This is the kind of mis-misinformation that the managing elite really don’t want to face. But get ready. It’s coming.", "opengraph": {"article:published_time": "2023-03-01 19:24:16", "title": "It’s coming", "type": "article", "url": "https://www.govtslaves.com/2023-03-01-its-coming.html", "site_name": "Gov't Slaves Com", "description": "“It’s Coming.” That’s what Elon Musk said a while back apropos of the Twitter files that show all the US government suppression of Covid-19 information mis-labeled as “misinformation.” Think of whatever the truth is as mis-misinformation. Get it?  You might have to read that sentence more than once to comprehend what went wrong with the […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/03/Covid-19-Coronavirus-Vaccine-Vial-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Big Pharma", "left cult", "Journalism", "deception", "news cartels", "biased", "vaccine", "brainwashed", "propaganda", "misinformation", "vaccine wars", "stupid", "mainstream media", "insanity", "woody harrelson", "Government Slaves", "vaccines", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://kunstler.com/clusterfuck-nation/its-coming/", "https://kunstler.com/clusterfuck-nation/its-coming/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-03-01-its-coming.html&linkname=It%E2%80%99s%20coming", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-03-01 19:24:16"}