{"result_id": "141038", "URL": "https://govtslaves.com/2022-08-15-deep-state-plan-revealed-frame-civil-war-to-justify-un-troops-occupy-america.html", "timestamp": "2023-04-25 15:21:31 CEST+0200", "meta": {"description": "Thanks to sources that have stepped forward with inside information, we now know some details about a plan we’re told is being pursued by the Biden regime to achieve the complete overthrow and destruction of the United States of America. As you review this, remember that compromised American officials are working with communist China and […]", "lang": "en", "keywords": "civil war,corruption,deep state,dirty bomb,freedom,Joe Biden,Liberty,national defense,occupation,Open Borders,terrorism,traitors,treason,United Nations", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-08-15-deep-state-plan-revealed-frame-civil-war-to-justify-un-troops-occupy-america.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Deep state plan revealed: Frame a civil war to justify UN troops to OCCUPY and DISARM America", "cleaned_text": "Deep state plan revealed: Frame a civil war to justify UN troops to OCCUPY and DISARM America\n\nThanks to sources that have stepped forward with inside information, we now know some details about a plan we’re told is being pursued by the Biden regime to achieve the complete overthrow and destruction of the United States of America. As you review this, remember that compromised American officials are working with communist China and the globalists to achieve the downfall of America.\n\nThe recent FBI / DOJ raid on Mar-a-Lago is a key element of this plan. The raid was reportedly designed to provoke an armed uprising among Trump supporters, or at least encourage nationwide protests that could be exploited by the FBI to run undercover agents dressed up as MAGA supporters.\n\nDuring these uprisings, we’re told, the FBI plans to attack government buildings with some sort of large-scale destruction. Think Oklahoma City (the FBI bombed the FBI headquarters in order to blame conservatives) or 9/11. Now add to that list the possibility of dirty bombs being unleashed in America by deep state operatives as a mechanism to declare martial law and feign vulnerability on the part of the government.\n\nThe narrative is already being set in place for a dirty bomb attack. For example, DefenseNews.com recently reported on how the GAO was able to forge a few documents and purchase radioactive materials to be shipped to the United States:\n\nLate last year, government employees forged a copy of a license to buy hazardous, radioactive material. They created shell companies, then placed orders, generated invoices and paid two U.S.-based vendors.\n\nThe scheme worked. The employees successfully had the material shipped, complete with radioactive stickers on the side, then confirmed delivery.\n\n“Anyone could open a shell company with a fraudulent license to obtain dangerous amounts of radioactive material that could be weaponized into a dirty bomb,” Torres told Defense News in an interview on Wednesday. “Disperse radioactive material in a city as densely populated as New York, and it could cause catastrophic damage.”\n\nSince most people don’t understand radiation — and it’s invisible — the public can be easily terrorized by the media working in conjunction with the deep state to carry out a dirty bomb attack that might not even be very dangerous from a purely medical / radiological point of view. But hyped up by the media, the average American will believe the world is ending. (It’s the covid panic template all over again…)\n\nTo complete this reported scenario, the Biden regime plans to pretend to be weak, bombing its own offices and killing its own agents, in order to issue an international plea for United Nations assistance. “Peacekeeping,” in other words.\n\nThese so-called “peacekeepers” are, of course, human traffickers, child sodomizers and rapists, and they will ply their dark trade in US cities just like they do everywhere else in the world. But the real threat is when the UN invites China to occupy the United States under the cover of peacekeeping (or food rescue missions since so many Americans will be starving due to engineered food scarcity), with PLA troops wearing blue helmets and going door to door, attempting to disarm the American people in the name of “security.”\n\nIn effect, communist China would be simultaneously disarming America while occupying US territory. Once a critical mass of PLA troops are in place across America, the order is given to mass execute all living Americans so that China can claim North America for itself, instantly reaping the benefit of trillions of dollars worth of farmland, minerals, energy, waterways, ports, industry and more.\n\nThe UN peacekeeping mission, in other words, is a grand Trojan Horse to invite the enemy right into America where they can occupy the entire country without having to fight an actual war.\n\nAt least that’s the plan currently in play. Whether they can successfully pull it off is another story.\n\nSeeming to confirm this plan is the fact that communist China is in the process of loading up a flotilla of merchant ships with military equipment and personnel, ready to invade the continental United States with a massive military presence. Under this scenario, there would be no resistance to China’s military, as they would be deemed “peacekeepers,” so the entire US Navy would stand down and allow China’s military to roll right up to the West Coast and unload their military equipment on US soil.\n\nThe deep state needs a really large false flag attack to scare the public into compliance\n\nIn order to achieve all this, the Biden regime needs something incredibly disastrous to take place that would scare the majority of Americans into agreeing with the foreign occupation of America. They would need to paint the American people as the enemy, fabricating all sorts of scary news and scapegoating their political enemies to take the blame for whatever nefarious attack they unleash.\n\nThe most likely choice for the regime to achieve these difficult goals is to choose a dirty bomb attack on a major US city, preferably a city in a red state such as Texas or Florida. This way, heavily armed federal agents can descend upon the conservative state and attempt to seize control under federal “emergency” declarations. They can also economically punish a red state and cause local chaos for the GOP governor. This is why a red state is the most likely target for the dirty bomb false flag.\n\nOnce a dirty bomb is unleashed — likely in the state’s capitol area — the entire area will be restricted from human access, citing radiation exposure (no matter how tiny it may be). This will throw banking, regulators, legislators and courts into chaos.\n\nThe complicit media will of course follow the script and blame the attack on whatever patsy they drum up with sufficient links to conservative media, the NRA and all the usual suspects. The blame will ultimately be placed on a pro-Trump, flag-waving J6 attendee who believes in God, owns a lot of homemade guns and posted some extreme-sounding frustrations on social media. It will of course be a white Christian male, and all white people will be immediately labeled terrorists by the treasonous media.\n\nThe calls for nationwide gun confiscation won’t be far behind.\n\nFor the record, we are calling for Americans to resist being played by the deep state in this emotional con game. Do not allow yourself to be whipped up into an emotional wave, and do not resort to violence. This is what the deep state wants. The American people need to stay cool and avoid handing the deep state the uprising they desperately want to create.\n\nWill this nefarious plot succeed? Or will white hats stop it?\n\nRep. Jim Jordan says 14 FBI agents have turned whistleblower and stepped forward to expose the tyranny and corruption of the agency. That’s just a taste of things to come as an increasing number of those who work within the bureaucracy wake up and realize how evil and destructive the federal government has become under the lawless tyranny of the Biden regime.\n\nSo-called “white hats” exist inside every federal agency, including the Pentagon. It is currently rumored that the pro-America military leaders at the US military command facilities in Cheyenne Mountain are at war with the corrupt, treasonous Pentagon leaders in Virginia. There’s even talk that the FBI’s Mar-a-Lago raid was also about trying to seize nuclear launch codes so that the deep state could initiate a nuclear war with China or Russia. We can’t confirm these two points, but they are part of the current chatter behind the scenes.\n\nMany people believe the white hats will emerge victorious as the American people rapidly come to their senses and reject the outright tyranny of the democrat fascists. But the faster the American people wake up and try to vote their way out of this tyranny, the more desperate the regime becomes, willing to unleash almost any level of disaster against America in order to scare the masses into obedience.\n\nLearn more in today’s Situation Update podcast, which also features clips from The Wizard of Oz and Die Hard. Hans Gruber pretending to be Bill Clay is like the FBI pretending to be afraid of the American public, you see. Hear the podcast for yourself to get full details:\n\nDiscover more information-packaged podcasts, raw intel reports and interviews each day:\n\nBrighteon.social: Brighteon.social/@HealthRanger (my breaking news gets posted here first)\n\nTelegram: t.me/RealHealthRanger (breaking news is posted here second)\n\nJoin the free NaturalNews.com email newsletter to stay alerted about breaking news each day.\n\nDownload my current audio books — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audio book, “Resilient Prepping” at ResilientPrepping.com – it teaches you how to survive the total collapse of civilization and the loss of both the power grid and combustion engines.", "opengraph": {"article:published_time": "2022-08-15 17:19:38", "title": "Deep state plan revealed: Frame a civil war to justify UN troops to OCCUPY and DISARM America", "type": "article", "url": "https://www.govtslaves.com/2022-08-15-deep-state-plan-revealed-frame-civil-war-to-justify-un-troops-occupy-america.html", "site_name": "Gov't Slaves Com", "description": "Thanks to sources that have stepped forward with inside information, we now know some details about a plan we’re told is being pursued by the Biden regime to achieve the complete overthrow and destruction of the United States of America. As you review this, remember that compromised American officials are working with communist China and […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/08/HRR-2022-08-15-Special-Report-Chinese-troops-UN-invasion-VIDEO.jpg"}, "tags": ["dirty bomb", "Joe Biden", "Open Borders", "Liberty", "deep state", "terrorism", "treason", "national defense", "traitors", "freedom", "corruption", "occupation", "United Nations", "civil war"], "tweets": [], "movies": [], "links": ["https://www.defensenews.com/congress/2022/08/10/shell-companies-purchase-radioactive-materials-prompting-push-for-nuclear-licensing-reform/", "https://naturalnews.com/2022-06-09-china-preparing-for-all-out-war-with-us-leaked-audio-recording.html", "http://Brighteon.com/8d17e2b5-b6db-4b82-b428-12a49c5189e9", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2022-08-15-deep-state-plan-revealed-frame-civil-war-to-justify-un-troops-occupy-america.html&linkname=Deep%20state%20plan%20revealed%3A%20Frame%20a%20civil%20war%20to%20justify%20UN%20troops%20to%20OCCUPY%20and%20DISARM%20America", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2022-08-15 17:19:38"}