{"result_id": "141045", "URL": "https://govtslaves.com/2022-09-02-google-bans-apps-misleading-health-claims-censorship.html", "timestamp": "2023-04-25 15:21:36 CEST+0200", "meta": {"description": "Google Play, the Android smartphone-based app store, has unveiled sweeping new rules that ban apps deemed to contain or promote “misleading health claims that contradict existing medical consensus, or (that) can cause harm to users.” Issued on August 31, Google Play’s new “health misinformation” policy is an in-app censorship sweep that targets any and all […]", "lang": "en", "keywords": "apps,ban,Big Tech,Censorship,conspiracy,COVID,evilgoogle,Google,Google Play,health freedom,medical censorship,Ministry of Truth,misinformation,misleading health claims,Plandemic,smartphone,Social media,technocratic fascism,technocrats,thought control", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-09-02-google-bans-apps-misleading-health-claims-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Google to ban all smartphone apps that tell the truth about health in latest bid to protect LIES of Big Pharma and the vaccine industry", "cleaned_text": "Google to ban all smartphone apps that tell the truth about health in latest bid to protect LIES of Big Pharma and the vaccine industry\n\nGoogle Play, the Android smartphone-based app store, has unveiled sweeping new rules that ban apps deemed to contain or promote “misleading health claims that contradict existing medical consensus, or (that) can cause harm to users.”\n\nIssued on August 31, Google Play’s new “health misinformation” policy is an in-app censorship sweep that targets any and all apps that even so much as question official health policy about vaccines, including the idea that “vaccines can alter one’s DNA.”\n\nGoogle is also going after apps that advocate for “harmful, unapproved treatments” such as vitamin C, vitamin D, ivermectin, or any number of other remedies that the government has deemed to be “misinformation.” (Related: Google no longer allows any mention of covid vaccines in Google Surveys.)\n\nAccording to Google, “conversion therapy” is another “harmful health practice” that cannot be advocated for in any apps available on Google Play. One wonders if this means that Bible apps are now forbidden since the Holy Word addresses unnatural homosexual behavior.\n\nBig Tech is the government’s Ministry of Truth\n\nThe timing of this new policy change coincides with a major shift in the government position on things like masking and even vaccinating. Suddenly, the government is no longer pushing these things like it once was, which begs the question: Will Google be able to keep up with accurate censorship?\n\nIn 2020, Tony Fauci was insistent that Pfizer’s mRNA (messenger RNA) injection was 90 percent effective against the Fauci Flu, which he called extraordinary. Fast-forward to 2022 and now Deborah Birx is basically admitting that she, Fauci, and others lied about the shots.\n\nThe newest claim is that everyone “knew” that Chinese Virus injections were not effective at preventing infection. They all just lied about it to pad the pockets of Big Pharma and complete Operation Warp Speed.\n\nBig Tech, meanwhile, has struggled to get the narrative right at any given time. On one day, social media and tech platforms are having to silence people for saying that the shots are ineffective, while the next the government itself is saying they are ineffective.\n\nStill to this day, Facebook is banning users of notoriety who claims that covid injections might not keep a person safe from infection. YouTube is doing the same thing, even going against World Health Organization (WHO) directives about the shots.\n\n“Even after the consensus changed and some of the censorship rules were quietly dropped, most of the censored posts and channels weren’t reinstated,” reports Reclaim the Net.\n\n“The new health misinformation rules add to Google Play’s extensive set of existing misinformation rules which prohibit apps containing ‘election misinformation’ and ‘misleading’ content. Google Play has already removed thousands of apps under these existing rules.”\n\nIn the comment section, someone wrote that the type of censorship in which Google is now engaging “is just beyond insane.”\n\n“Someone REALLY needs to develop a new censorship-free alternative to Google and Apple,” this person added.\n\nAnother asked where Google starts and the government ends. It is still unclear, this person added, whether Google is a private company or a government entity in disguise. Either way, Google equals technocratic fascism.\n\n“There’s no virus,” added another. “Just a lab-made spike protein. And a fake test was used to create a scare-scam-demic.”\n\nSomeone else chimed in that the so-called “Great Reset” is obviously well underway. The question remains: Will it be successful, or will the tides turn just in the nick of time?\n\n“It is no wonder that Google’s logo has a hidden 666,” wrote another.\n\nThe latest news coverage about Big Tech’s relentless fight against truth can be found at Censorship.news.", "opengraph": {"article:published_time": "2022-09-03 11:35:31", "title": "Google to ban all smartphone apps that tell the truth about health in latest bid to protect LIES of Big Pharma and the vaccine industry", "type": "article", "url": "https://www.govtslaves.com/2022-09-02-google-bans-apps-misleading-health-claims-censorship.html", "site_name": "Gov't Slaves Com", "description": "Google Play, the Android smartphone-based app store, has unveiled sweeping new rules that ban apps deemed to contain or promote “misleading health claims that contradict existing medical consensus, or (that) can cause harm to users.” Issued on August 31, Google Play’s new “health misinformation” policy is an in-app censorship sweep that targets any and all […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/09/Editorial-Use-Google-Office.jpg"}, "tags": ["Google", "conspiracy", "COVID", "smartphone", "evilgoogle", "technocrats", "Google Play", "ban", "apps", "Big Tech", "misinformation", "medical censorship", "Ministry of Truth", "Social media", "technocratic fascism", "Censorship", "thought control", "misleading health claims", "health freedom", "Plandemic"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/google-play-bans-misleading-health-claims/", "https://naturalnews.com/2022-08-04-censorship-google-bans-mention-covid-vaccines-survey.html", "http://censorship.news", "https://reclaimthenet.org/google-play-bans-misleading-health-claims/", "https://naturalnews.com/2022-08-04-censorship-google-bans-mention-covid-vaccines-survey.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2022-09-02-google-bans-apps-misleading-health-claims-censorship.html&linkname=Google%20to%20ban%20all%20smartphone%20apps%20that%20tell%20the%20truth%20about%20health%20in%20latest%20bid%20to%20protect%20LIES%20of%20Big%20Pharma%20and%20the%20vaccine%20industry", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2022-09-03 11:35:31"}