{"result_id": "141006", "URL": "https://govtslaves.com/2022-09-08-biden-administration-officials-agencies-involved-in-censorship.html", "timestamp": "2023-04-25 15:21:11 CEST+0200", "meta": {"description": "Several officials and government agencies under the Biden administration were involved in censorship efforts on social media, documents revealed. The documents outlining the collusion between officials, agencies and Big Tech firms in a bid to crack down on alleged “misinformation” were made public on Aug. 31. They formed part of a lawsuit filed by Missouri Attorney […]", "lang": "en", "keywords": "big government,Big Tech,Censorship,conspiracy,covid-19,deception,disinfo,Disinfo Dozen,Facebook,fascism,First Amendment,freedom,Government Slaves,pandemic,Social media,speech police,tech giants,technocrats,thought police,Twitter,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-09-08-biden-administration-officials-agencies-involved-in-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Biden administration officials, agencies played in active role in Big Tech’s CENSORSHIP of dissenting views", "cleaned_text": "Biden administration officials, agencies played in active role in Big Tech’s CENSORSHIP of dissenting views\n\nSeveral officials and government agencies under the Biden administration were involved in censorship efforts on social media, documents revealed.\n\nThe documents outlining the collusion between officials, agencies and Big Tech firms in a bid to crack down on alleged “misinformation” were made public on Aug. 31. They formed part of a lawsuit filed by Missouri Attorney General (AG) Eric Schmitt and Louisiana AG Jeff Landry. The two Republican AGs found evidence of this collusion based on the documents, which they obtained from technology companies themselves.\n\nSeveral officials in the Biden White House were named in the documents – including former White House Counsel Dana Remus, former Senior Advisor to the COVID-19 Response Coordinator Andy Slavitt and current White House Digital Strategy Director Rob Flaherty. These officials were reportedly in touch with major social media firms in a bid to make the latter tighten rules on “false and misleading” COVID-19 information. They also sought to make social media companies take action against violators, as per the documents.\n\nIn one instance, Flaherty told Slavitt and others in April 2021 that White House staff would be briefed by Twitter on the issue of misinformation surrounding the Wuhan coronavirus (COVID-19) vaccine. The meeting touched on “ways the White House and its COVID-19 experts can partner in product work,” according to a message.\n\nLater in July 2021, President Joe Biden himself accused Facebook of “killing people” by not combating misinformation effectively. Surgeon General Vivek Murthy concurred with the president’s remarks, which led to an executive from Meta – Facebook’s parent company – reaching out to him.\n\nThe Meta executive told Murthy that following Biden’s comments, company representatives have met with the federal government “to better understand the scope of what the White House expects from us on misinformation going forward.” The same executive later wrote to Murthy: “I wanted to make sure you saw the steps we took just this past week to adjust policies on what we are removing with respect to misinformation, as well as steps taken to further address the ‘Disinfo Dozen.'”\n\nThe White House publicly pressured Big Tech companies to take action against the so-called “Disinfo Dozen,” a non-profit accused of being responsible for the majority of “anti-vaccine misinformation” circulating on social media. (Related: Over 50 Biden administration employees, 12 US agencies involved in social media censorship push: Documents.)\n\nAccording to the lawsuit by Landry and Schmitt, “the discovery provided so far demonstrates that this censorship enterprise is extremely broad [because] it rises to the highest levels of the U.S. government, including numerous White House officials.”\n\nThe documents from government lawyers and technology firms managed to identify officials at different departments that communicated with social media companies on the issue of misinformation. These include:\n• Department of Homeland Security – and the Cybersecurity and Infrastructure Security Agency under it\n• Department of Health and Human Services – alongside the Centers for Disease Control and Prevention, Food and Drug Administration, Office of the Surgeon General and the National Institute of Allergy and Infectious Diseases\n• Department of Commerce – and the Census Bureau under it\n\n“When the federal government colludes with Big Tech to censor speech, the American people become subjects rather than citizens,” Landry said in a statement.\n\nThree members of the Disinformation Dozen spoke out after the two AGs released their documents.\n\nIn a text message, ob-gyn Dr. Christiane Northrup praised Schmitt and Landy for having “the courage to take a stand against the massive and well-orchestrated censorship.\n\nChildren’s Health Defense Chairman Robert F. Kennedy Jr. also lauded the release of the documents. He said: “The First Amendment is not there to safeguard popular speech or government-approved speech. The framers specifically wanted to protect speech that the government finds inconvenient or even detestable.”\n\nZelenko Freedom Foundation Co-Chair Kevin Jenkins welcomed the move by the two AGs, saying that the action turns the “narrative of misinformation into a movement of truth.”\n\nJenkins, who hosts “The Zelenko Report” with Ann Vandersteel on Brighteon.TV, added that his inclusion in the “Disinfo Dozen” was reminiscent of “a dark historical period when great men and women of their time were attacked and vilified” by the government.\n\nHead over to Censorship.news for more stories about Big Government and Big Tech colluding to ban “misinformation.”\n\nWatch National Pulse reporter Natalie Winters reveal how the White House and Big Tech worked together to censor COVID-19 information.\n\nThis video is from the Prevent Global Genocide channel on Brighteon.com.\n\nCENSORSHIP: Google bans any mention of covid vaccines from its survey platform.\n\nCivil rights group joins growing lawsuit against big tech for collective censorship of COVID data.\n\nJournalist who warned about COVID jabs says White House officials targeted him for censorship.", "opengraph": {"article:published_time": "2022-09-08 11:10:43", "title": "Biden administration officials, agencies played in active role in Big Tech’s CENSORSHIP of dissenting views", "type": "article", "url": "https://www.govtslaves.com/2022-09-08-biden-administration-officials-agencies-involved-in-censorship.html", "site_name": "Gov't Slaves Com", "description": "Several officials and government agencies under the Biden administration were involved in censorship efforts on social media, documents revealed. The documents outlining the collusion between officials, agencies and Big Tech firms in a bid to crack down on alleged “misinformation” were made public on Aug. 31. They formed part of a lawsuit filed by Missouri Attorney […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/09/White-House-United-States-America.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "speech police", "deception", "Twitter", "covid-19", "technocrats", "First Amendment", "disinfo", "Big Tech", "tech giants", "Social media", "Disinfo Dozen", "thought police", "Facebook", "Government Slaves", "Tyranny", "fascism", "Censorship", "freedom"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents_4704349.html", "http://bigtech.news", "https://naturalnews.com/2022-09-06-us-agencies-involved-in-social-media-censorship-push.html", "http://biggovernment.news", "https://www.theepochtimes.com/disinformation-dozen-responds-after-documents-show-widespread-biden-administration-censorship-effort_4707020.html", "https://brighteon.tv", "https://censorship.news", "https://www.brighteon.com/55aad762-397c-402a-9cb2-e01b749c9b1c", "https://www.brighteon.com/channels/nuremberg", "https://banned.news/2020-12-14-big-tech-covid-censorship-endangering-population.html", "https://evilgoogle.news/2022-08-04-censorship-google-bans-mention-covid-vaccines-survey.html", "https://techgiants.news/2022-08-08-civil-rights-group-joins-lawsuit-against-big-tech-censorship-covid-data.html", "https://censorship.news/2022-08-18-white-house-officials-targeted-berenson-for-censorship.html", "https://www.theepochtimes.com/over-50-biden-administration-employees-12-us-agencies-involved-in-social-media-censorship-push-documents_4704349.html", "https://www.theepochtimes.com/disinformation-dozen-responds-after-documents-show-widespread-biden-administration-censorship-effort_4707020.html", "https://www.brighteon.com/55aad762-397c-402a-9cb2-e01b749c9b1c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2022-09-08-biden-administration-officials-agencies-involved-in-censorship.html&linkname=Biden%20administration%20officials%2C%20agencies%20played%20in%20active%20role%20in%20Big%20Tech%E2%80%99s%20CENSORSHIP%20of%20dissenting%20views", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2022-09-08 11:10:43"}