{"result_id": "141028", "URL": "https://govtslaves.com/2023-01-11-facebook-promised-biden-any-messaging-it-wants.html", "timestamp": "2023-04-25 15:21:25 CEST+0200", "meta": {"description": "In April 2021, the U.S. Centers for Disease Control (CDC) and the Food and Drug Administration (FDA) issued a statement pausing the administration of the Johnson & Johnson Covid-19 vaccine after it caused severe blood clotting in 6 female recipients. After this news broke, Facebook contacted the Biden regime to ensure them that the social […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Tech,Censorship,Collusion,conspiracy,covid-19,Dangerous Medicine,deception,Facebook,Glitch,Government Slaves,pandemic,propaganda,rigged,Social media,speech police,Suppressed,tech giants,technocrats,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-01-11-facebook-promised-biden-any-messaging-it-wants.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Facebook promised Biden regime “any messaging you want” in newly released emails… asked for talking points on COVID vaccines", "cleaned_text": "Facebook promised Biden regime “any messaging you want” in newly released emails… asked for talking points on COVID vaccines\n\nIn April 2021, the U.S. Centers for Disease Control (CDC) and the Food and Drug Administration (FDA) issued a statement pausing the administration of the Johnson & Johnson Covid-19 vaccine after it caused severe blood clotting in 6 female recipients. After this news broke, Facebook contacted the Biden regime to ensure them that the social media platforms would “amplify any messaging” to convince the public the shot was safe and effective.\n\nThe New Civil Liberties Alliance (NCLA) is currently part of a lawsuit that was filed by the Attorneys General of Louisiana and Missouri which alleges improper collusion between the federal government and social media companies. The emails between Facebook and the White House were obtained in discovery.\n\nIn their communications with the White House, Facebook asked how they could “get ahead” of possible doubt or fear arising in the general public about Covid vaccines.\n\nOne employee – whose name is redacted due to a court order – sent a message to Andrew Slavitt, the Biden administration’s senior advisor for the Covid response, along with Director of Digital Strategy Rob Flaherty and Director of Strategic Communications and Engagement for the Covid-19 Response Team Courtney Rowe. In the email, the employee wrote,\n\n“Re the J+J news, we’re keen to amplify any messaging you want us to project about what this means for people – it obviously has the risk of exacerbating vaccine hesitancy, so we’re keen to get ahead of the knock-on effect. Don’t hesitate to tell me – or via your teams – how we can help to provide clarity/reassurance via Facebook.”\n\nIn response to the email, Flaherty gave the employee some suggestions on how Facebook could shut down anyone questioning the safety of the vaccine, such as telling users that “adverse effects are very rare.” Flaherty also requested a “commitment from [Facebook] to make sure that a favorable review [of the vaccine] reaches as many people as the pause, either through hard product interventions or algorithmic amplification,” ensuring that “the news about J&J doesn’t spin off misinformation.”\n\nIn another email between Facebook and the Biden administration, the employee told Flaherty that the social media company would “love to talk” about ways they could adjust its algorithm to control what information is shared and what is primarily hidden from public view, ensuring that the White House has control over the dominant messaging surrounding the vaccines.\n\nFacebook worked with the federal government to only share approved messaging about the Covid-19 vaccines, silencing anyone who questioned the safety of the shots or suggested they may cause serious side effects.\n\nAlthough the government tried shutting down anyone who said the vaccine is not safe, in May 2022 the FDA ended up limiting the use of the J&J vaccine only to those who were unable or refused to take another vaccine due to the risk of blood clots, suggesting that those who questioned the vaccine’s safety were right to do so.", "opengraph": {"article:published_time": "2023-01-11 22:21:55", "title": "Facebook promised Biden regime “any messaging you want” in newly released emails… asked for talking points on COVID vaccines", "type": "article", "url": "https://www.govtslaves.com/2023-01-11-facebook-promised-biden-any-messaging-it-wants.html", "site_name": "Gov't Slaves Com", "description": "In April 2021, the U.S. Centers for Disease Control (CDC) and the Food and Drug Administration (FDA) issued a statement pausing the administration of the Johnson & Johnson Covid-19 vaccine after it caused severe blood clotting in 6 female recipients. After this news broke, Facebook contacted the Biden regime to ensure them that the social […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/01/Facebook-Logo-Screen-Close-Up.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "speech police", "deception", "covid-19", "technocrats", "propaganda", "Big Tech", "vaccine wars", "tech giants", "Suppressed", "Social media", "Facebook", "Glitch", "Government Slaves", "rigged", "Censorship", "Collusion", "vaccines"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/emails-show-facebook-colluded-with-biden-regime-to-shut-down-safety-concerns-regarding-covid-vaccines/", "https://100percentfedup.com/emails-show-facebook-colluded-with-biden-regime-to-shut-down-safety-concerns-regarding-covid-vaccines/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-01-11-facebook-promised-biden-any-messaging-it-wants.html&linkname=Facebook%20promised%20Biden%20regime%20%E2%80%9Cany%20messaging%20you%20want%E2%80%9D%20in%20newly%20released%20emails%E2%80%A6%20asked%20for%20talking%20points%20on%20COVID%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-01-11 22:21:55"}