{"result_id": "141047", "URL": "https://govtslaves.com/2023-03-21-us-government-helped-online-posts-censorship.html", "timestamp": "2023-04-25 15:21:37 CEST+0200", "meta": {"description": "More evidence of the close censorship ties between Big Tech and government. (Article by Tom Parker republished from ReclaimTheNet.org) The United States (US) federal government helped to launch a project where six Big Tech companies and a coalition of research agencies partnered to mass monitor Covid-related content and flag millions of posts for censorship each […]", "lang": "en", "keywords": "banned,big government,Big Tech,Censorship,conspiracy,cyber war,deception,deep state,Facebook,fascism,First Amendment,Glitch,Google,Government Slaves,Instagram,speech police,Suppressed,tech giants,technocrats,thought police,TikTok,truth,Twitter Files,Tyranny,Virality Project,YouTube", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-03-21-us-government-helped-online-posts-censorship.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Twitter Files: US government helped launch project where millions of online posts were flagged for censorship", "cleaned_text": "Twitter Files: US government helped launch project where millions of online posts were flagged for censorship\n\nMore evidence of the close censorship ties between Big Tech and government.\n\nThe United States (US) federal government helped to launch a project where six Big Tech companies and a coalition of research agencies partnered to mass monitor Covid-related content and flag millions of posts for censorship each day, according to new internal Twitter documents.\n\nThe documents were published by journalist Matt Taibbi as part of a new batch of “Twitter Files” — internal documents that have exposed many examples of Big Tech-federal government censorship collusion.\n\nAccording to Taibbi, “The Virality Project,” a consortium of research partners that push for online censorship, worked with the government to launch a project that surveilled online Covid content and through which millions of items were flagged for review.\n\nThe documents show the Virality Project (VP), confirming that six Big Tech platforms, Facebook (including Instagram), Twitter, Google (including YouTube), TikTok, Medium, and Pinterest, were “acting on” content that was flagged to them by the Virality Project.\n\nAccording to Taibbi, the Virality Project flagged a wide range of truthful content to Twitter and branded it as “potential violations or “disinformation ‘events.’”\n\nSome of the many types of truthful content that were flagged include:\n• The “‘vaccine passport’ narrative” (which the Virality Project claimed had “driven a larger anti-vaccination narrative about the loss of rights and freedoms”)\n• “True stories of people experiencing blood clots after receiving the AstraZeneca vaccine”\n• Discussions of “breakthrough” infections (which the Virality Project claimed were “extremely rare events” that should not be inferred to mean “vaccines are ineffective”)\n• Content that “increased distrust” in then-director of the National Institute of Allergy and Infectious Diseases (NIAID) Dr. Anthony Fauci\n\nTaibbi noted that Twitter employees soon started to echo some of the Virality Project’s language. In a March 16, 2021 email, which was sent less than a month after Twitter joined the Virality Project, a Twitter employee described tracking “campaigns against vaccine passports,” “fear of mandatory immunizations,” and “misuse of official reporting tools.”\n\nNot only did the Virality Project flag truthful content but, according to Taibbi, it would flag posts based on audience reaction and whether the responses to the post were deemed to be “disinformation.”\n\nThe Virality Project flagged a story about the death of an elderly black woman after receiving the Pfizer vaccine in Virginia because it “has received attention in anti-vax groups” and “the majority of top comments on the story are anti-vaccine.”\n\nThe Virality Project also claimed that people who were just “asking questions” were engaging in “a tactic commonly used by spreaders of misinformation to deflect culpability” and reportedly described a “Worldwide Rally for Freedom planned over Telegram” as a disinformation event.\n\nAnother technique the Virality Project used was to encourage Big Tech platforms to target people instead of posts using — something Taibbi described as “Minority Report-style ‘pre-crime’ logic.”\n\nThe Virality Project was previously called the Election Integrity Partnership (EIP) and under this previous name, it claimed to have successfully pushed for millions of tweets to be labeled in the run-up to the 2020 US presidential election.", "opengraph": {"article:published_time": "2023-03-21 19:30:57", "title": "Twitter Files: US government helped launch project where millions of online posts were flagged for censorship", "type": "article", "url": "https://www.govtslaves.com/2023-03-21-us-government-helped-online-posts-censorship.html", "site_name": "Gov't Slaves Com", "description": "More evidence of the close censorship ties between Big Tech and government. (Article by Tom Parker republished from ReclaimTheNet.org) The United States (US) federal government helped to launch a project where six Big Tech companies and a coalition of research agencies partnered to mass monitor Covid-related content and flag millions of posts for censorship each […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/03/Censorship-Censored-America-Break-Rip-Open.jpg"}, "tags": ["TikTok", "conspiracy", "Google", "big government", "speech police", "deep state", "deception", "Telegram", "technocrats", "Virality Project", "banned", "First Amendment", "truth", "Twitter Files", "Big Tech", "cyber war", "tech giants", "YouTube", "Suppressed", "thought police", "Facebook", "Glitch", "Government Slaves", "Tyranny", "Instagram", "fascism", "Censorship"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/us-government-censorship-project-millions-posts", "https://threadreaderapp.com/thread/1636729166631432195.html", "https://reclaimthenet.org/twitter-files-biden-admin-very-angry-censorship", "https://reclaimthenet.org/fbi-flagging-tweets-onslaught", "https://reclaimthenet.org/topics/facebook", "https://reclaimthenet.org/topics/tiktok", "https://reclaimthenet.org/topics/telegram", "https://reclaimthenet.org/state-entities-anti-ukraine-narratives-twitter-censorship", "https://reclaimthenet.org/us-government-censorship-project-millions-posts", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-03-21-us-government-helped-online-posts-censorship.html&linkname=Twitter%20Files%3A%20US%20government%20helped%20launch%20project%20where%20millions%20of%20online%20posts%20were%20flagged%20for%20censorship", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-03-21 19:30:57"}