{"result_id": "141020", "URL": "https://govtslaves.com/2023-03-10-fbi-secretly-working-with-hospitals-disarm-americans.html", "timestamp": "2023-04-25 15:21:20 CEST+0200", "meta": {"description": "Beginning in 2011, a new report has found, the Federal Bureau of Investigation (FBI) was conspiring with doctors in multiple states to strip Americans of their Second Amendment rights. Documents obtained by Gun Owners of America (GOA) via a Freedom of Information Act (FOIA) request reveal that FBI disarmament happened in at least five different […]", "lang": "en", "keywords": "bad doctors,badmedicine,big government,Collusion,conspiracy,dangerous doctors,deception,deep state,deepstate,FBI,firearms,Gun Owners of America,guns,hospitals,Liberty,outrage,privacy watch,Second Amendment,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2023-03-10-fbi-secretly-working-with-hospitals-disarm-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "MEDICAL MALICE: Without warrants, FBI is secretly working with hospitals to disarm Americans", "cleaned_text": "MEDICAL MALICE: Without warrants, FBI is secretly working with hospitals to disarm Americans\n\nBeginning in 2011, a new report has found, the Federal Bureau of Investigation (FBI) was conspiring with doctors in multiple states to strip Americans of their Second Amendment rights.\n\nDocuments obtained by Gun Owners of America (GOA) via a Freedom of Information Act (FOIA) request reveal that FBI disarmament happened in at least five different states, and it was all done in secret.\n\nDozens of people were affected by the sweep, including five people whose gun rights were revoked entirely. The FBI worked both with hospitals and medical clinics, the report shows, to target these people for de-gunning.\n\nInvestigative reporter Gabe Kaminsky says that U.S. Immigration and Customers Enforcement (ICE) along with the Secret Service worked alongside the FBI to remove these people’s Second Amendment rights – and all without the approval of Congress.\n\nThe Washington Examiner confirmed that people in Delaware, Massachusetts, New Hampshire, and Oklahoma were targeted by this cadre of three-letter agencies. (Related: The totalitarian FBI also arrests people for protesting the murder of children.)\n\nWhy is the FBI going after people’s Second Amendment rights?\n\nThe scheme involved the use of the FBI’s National Instant Criminal Background Check System Indices Self-Submission Form, which was filled out and signed by both patient and doctor. This form, once endorsed, blocks an individual from buying, owning, or handling firearms.\n\nThe form also allows the FBI to obtain the mental health records of anyone who signs it. And it appears as though the FBI, along with ICE and Secret Service, compelled people to sign it, possibly against their will.\n\n“The signatory is likely to be barred from exercising his or her Second Amendment rights for life,” said Johnathan Jones writing for The Western Journal.\n\nIn one instance, an agent from the FBI along with another bureau employee targeted a person’s gun rights based on social media posts in which he expressed a desire to purchase a firearm.\n\n“Agent, I have reviewed the NICS Indices Self-Submission Form regarding [redacted],” reads an email correspondence about the matter that took place in September 2019.\n\n“In order to make this entry, we will need to verify the subjects [sic] DOB. It appears as an incorrect DOB on the form. Also, if only the form is returned with no specific documents establishing federal criteria (see below), A temporary record will be created for this subject that will expire in 30 days.”\n\nThe hospital in question was not named in the email.\n\nSeveral hours later, another FBI agent responded with an attached petition submitted to the unnamed hospital calling for the target in question to be “committed for Mental Treatment along with the supporting Social Media Posts expressing a desire to obtain a firearm.”\n\nIn another instance, a man from Massachusetts is said to have been involuntarily hospitalized for mental health treatment. The FBI reportedly “brought” a form for this person to fill out, which he did, but with the caveat that his treatment was voluntary rather than involuntary.\n\nThis same process occurred for dozens of other targets between the years of 2011 and 2019, an investigation found. It is unclear why the secret program was halted when it was in 2019.\n\n“It really speaks to the rogue nature of the ‘deep state’ mentality,” says former Virginia Attorney General Ken Cuccinelli, who worked for the Department of Homeland Security (DHS) under Donald Trump, about the collusion between the FBI and the medical industry.\n\n“Any time you have evidence of private entities coordinating with federal agents to strip Americans of their rights, the public should be alarmed and demanding answers and action,” added Aidan Johnston, GOA’s federal affairs director.\n\nMore related news can be found at FBIcorruption.news.", "opengraph": {"article:published_time": "2023-03-10 12:16:06", "title": "MEDICAL MALICE: Without warrants, FBI is secretly working with hospitals to disarm Americans", "type": "article", "url": "https://www.govtslaves.com/2023-03-10-fbi-secretly-working-with-hospitals-disarm-americans.html", "site_name": "Gov't Slaves Com", "description": "Beginning in 2011, a new report has found, the Federal Bureau of Investigation (FBI) was conspiring with doctors in multiple states to strip Americans of their Second Amendment rights. Documents obtained by Gun Owners of America (GOA) via a Freedom of Information Act (FOIA) request reveal that FBI disarmament happened in at least five different […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2023/03/Coronavirus-Ventilator-Hospital-Breathing-Machine.jpg"}, "tags": ["conspiracy", "big government", "deepstate", "FBI", "hospitals", "firearms", "deep state", "Liberty", "deception", "Collusion", "bad doctors", "dangerous doctors", "privacy watch", "guns", "outrage", "Second Amendment", "Gun Owners of America", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.westernjournal.com/documents-expose-fbi-secretly-working-hospitals-disarm-americans-without-warrants-report/", "https://naturalnews.com/2022-10-12-opposing-child-murder-terrorized-arrested-totalitarian-fbi.html", "http://fbicorruption.news", "https://www.westernjournal.com/documents-expose-fbi-secretly-working-hospitals-disarm-americans-without-warrants-report/", "https://naturalnews.com/2022-10-12-opposing-child-murder-terrorized-arrested-totalitarian-fbi.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2023-03-10-fbi-secretly-working-with-hospitals-disarm-americans.html&linkname=MEDICAL%20MALICE%3A%20Without%20warrants%2C%20FBI%20is%20secretly%20working%20with%20hospitals%20to%20disarm%20Americans", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2023-03-10 12:16:06"}