{"result_id": "141036", "URL": "https://govtslaves.com/2022-06-24-congress-legalized-funded-overthrow-constitution-government-people.html", "timestamp": "2023-04-25 15:21:30 CEST+0200", "meta": {"description": "Dr. Jane Ruby has blamed Congress for allowing powerful individuals push their genocidal agenda without facing consequences. “The U.S. Congress legalized and funded the overthrow of the Constitution, the government and the American people through a massive domestic bioterrorism program,” she remarked on the June 20 episode of “Live with Dr. Jane Ruby” on Brighteon.TV. Ruby added […]", "lang": "en", "keywords": "American presidents,badmedicine,big government,bioterrorism program,Brighteon.tv,Congress,Constitution,emergency use authorization,HHS,Jane Ruby,Live with Dr. Jane Ruby,medical martial law,Medical Tyranny,PREP Act,Public Health,WHO", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-06-24-congress-legalized-funded-overthrow-constitution-government-people.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Dr. Jane Ruby: Congress legalized and funded overthrow of Constitution, government and people – Brighteon.TV", "cleaned_text": "Dr. Jane Ruby: Congress legalized and funded overthrow of Constitution, government and people – Brighteon.TV\n\nDr. Jane Ruby has blamed Congress for allowing powerful individuals push their genocidal agenda without facing consequences.\n\n“The U.S. Congress legalized and funded the overthrow of the Constitution, the government and the American people through a massive domestic bioterrorism program,” she remarked on the June 20 episode of “Live with Dr. Jane Ruby” on Brighteon.TV.\n\nRuby added that the act of bioterrorism, disguised as a public health program, is conducted by the health secretary on behalf of the World Health Organization and its financial backers. (Related: WHO attempts to take control of future plandemics in a “totalitarian power grab” move.)\n\nShe cited a Substack piece by paralegal analyst and writer Katherine Watt, who asked how the legislative and executive branches made the bioterrorism program possible.\n\nAccording to Ruby, every president for the last three decades has signed legislation and executive orders that have turned American laws into a mass genocide problem. She pointed out that a lot of things that were once federal and state crimes and civil rights violations have been legalized, mainly by changing the law.\n\n“These crimes have been legalized by Congress through a series of legislative statutory revisions to the United States Code signed by U.S. presidents, literally every one of them for the last 30 years, and implemented at the administrative regulatory level by the Department of Health and Human Services (HHS) through the Code of Federal Regulation,” said Ruby.\n\nAccording to the Brighteon.TV host, criminal conspirators such as Dr. Anthony Fauci and Bill Gates have one basic goal: to set up legal conditions in which all governing power in America could be automatically transferred from the citizens and the three constitutional branches into the hands of the HHS secretary. The latter would have the power to declare a public health emergency, legally transforming free citizens into enslaved subjects.\n\nMoreover, former President Ronald Reagan signed the National Childhood Vaccine Injury Act, which Ruby said paved the way for pharmaceutical firms to have legal immunity. It also established a child vaccine injury compensation program, which was funded by the taxpayers and not by pharmaceutical companies.\n\nBoth the legislative and executive departments created a bucket called “medical countermeasures” where anything they can throw in is exempted. Ruby said once a medical countermeasure is not considered a clinical investigation, it is off the hook for everything.\n\nThe veteran medical professional noted that emergency use authorization (EUA) products being exempted from laws that should regulate them are a very clever creation of a perfect crime that does not wait for the conditions to come along. She mentioned that the Public Readiness and Emergency Preparedness (PREP) Act and all its amendments were part of how they were able to do it.\n\nThe PREP Act authorizes the health secretary to issue a PREP Act declaration. The declaration is specifically for the purpose of providing immunity from liability and is different from, and not dependent on, other emergency declarations issued by the secretary.\n\nRuby added that people will see individuals administering EUA products that have no informed consent obligation.\n\nThere will also be no informed consent rights; no institutional review boards; no safety and efficacy standards for EUA products; no clinical investigators studying the effects of EUA products on human subjects; no coordinated public federal government monitoring for safety; and no safety inspection of the manufacturing plants because of this law.\n\nThis is the reason why the Food and Drug Administration (FDA) is not doing what it normally does, which is to go to the manufacturing plants and make sure that there isn’t contamination, dirt or garbage on the vials as they are being filled, sealed and packaged.\n\nFollow MedicalMartialLaw.com for more stories about government tyranny under the guise of public health.\n\nWatch the full June 20 episode of “Live with Dr. Jane Ruby” below. “Live with Dr. Jane Ruby” airs every Monday at 7-8 p.m. and every Saturday at 3-4 p.m. on Brighteon.TV.\n\nInstead of red flag laws, why won’t lawmakers investigate psychiatric drugs and their links to violence?\n\nCongress refuses to investigate FDA’s failure to look into claims that Pfizer falsified COVID vaccine trial data.\n\nPRE-PLANNED: Weeks before covid appeared in U.S., Congress redefined the word “vaccine” to include mRNA injections.\n\nFauci accused of misleading Congress about taxpayers’ money given to Wuhan lab.", "opengraph": {"article:published_time": "2022-06-24 10:09:12", "title": "Dr. Jane Ruby: Congress legalized and funded overthrow of Constitution, government and people – Brighteon.TV", "type": "article", "url": "https://www.govtslaves.com/2022-06-24-congress-legalized-funded-overthrow-constitution-government-people.html", "site_name": "Gov't Slaves Com", "description": "Dr. Jane Ruby has blamed Congress for allowing powerful individuals push their genocidal agenda without facing consequences. “The U.S. Congress legalized and funded the overthrow of the Constitution, the government and the American people through a massive domestic bioterrorism program,” she remarked on the June 20 episode of “Live with Dr. Jane Ruby” on Brighteon.TV. Ruby added […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/06/Obama_Health_Care_Speech_to_Joint_Session_of_Congress.jpg"}, "tags": ["big government", "bioterrorism program", "Public Health", "Jane Ruby", "Brighteon.tv", "HHS", "Constitution", "Live with Dr. Jane Ruby", "emergency use authorization", "American presidents", "Medical Tyranny", "PREP Act", "Congress", "WHO", "medical martial law"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/1a8b2a0b-939a-44d6-80e9-d343003b0f2c", "https://brighteon.tv", "https://biggovernment.news/2022-06-17-who-attempts-take-control-of-future-plandemics.html", "https://brighteon.tv", "https://enslaved.news", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://fda.news", "https://medicalmartiallaw.com/", "http://www.brighteon.com/1a8b2a0b-939a-44d6-80e9-d343003b0f2c", "https://brighteon.tv", "https://naturalnews.com/2019-08-15-instead-of-red-flag-laws-psychiatric-drugs-links-to-violence.html", "https://naturalnews.com/2021-11-16-congress-refuses-to-investigate-fda-failure.html", "https://naturalnews.com/2021-11-01-corruption-covid-congress-redefined-vaccine-mrna-injections.html", "https://naturalnews.com/2021-06-17-fauci-lied-about-money-given-to-wiv.html", "https://www.brighteon.com/1a8b2a0b-939a-44d6-80e9-d343003b0f2c", "https://aspr.hhs.gov/legal/prepact/pages/default.aspx", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fgovtslaves%2F2022-06-24-congress-legalized-funded-overthrow-constitution-government-people.html&linkname=Dr.%20Jane%20Ruby%3A%20Congress%20legalized%20and%20funded%20overthrow%20of%20Constitution%2C%20government%20and%20people%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": "2022-06-24 10:09:12"}