{"result_id": "141013", "URL": "https://govtslaves.com/2022-01-12-financial-analysts-suspended-criticizing-totalitarian-lockdowns-vaccine-mandates.html", "timestamp": "2023-04-25 15:21:15 CEST+0200", "meta": {"description": "Two financial analysts were suspended and forced to retract their truthful research report which questioned totalitarian lock downs, vaccine efficacy and vaccine mandates. Nordea Bank Abp suspended Chief Analyst Martin Enlund and Global Chief Strategist Andreas Steno Larsen, banishing them from their website. “We have initiated an internal review, and the two analysts will not […]", "lang": "en", "keywords": "banned,Censored,Censorship,corporate control,courage,crimes against humanity,dissent,endless lockdowns,endless vaccine mandates,enslaved,free speech,freedom of speech,insanity,medical fascism,Medical Tyranny,obey,propaganda,science dictatorship,slavery,subjugation,vaccine failure", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://govtslaves.com/2022-01-12-financial-analysts-suspended-criticizing-totalitarian-lockdowns-vaccine-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "govtslaves.com", "title": "Financial analysts SUSPENDED for criticizing totalitarian lockdowns and vaccine mandates", "cleaned_text": "Financial analysts SUSPENDED for criticizing totalitarian lockdowns and vaccine mandates\n\nTwo financial analysts were suspended and forced to retract their truthful research report which questioned totalitarian lock downs, vaccine efficacy and vaccine mandates. Nordea Bank Abp suspended Chief Analyst Martin Enlund and Global Chief Strategist Andreas Steno Larsen, banishing them from their website. “We have initiated an internal review, and the two analysts will not write or publish during the review,” Nordea Bank wrote.\n\nThe Helsinki-based bank is the largest in the region. The two analysts caused quite the stir online when they questioned vaccine efficacy and referred to European officials as “lockdownistas.” Even after forcing multiple vaccines on a majority of the population, European officials are still dealing with sick, vaccinated people and debating the next best ways to lock people down.\n\nWhen a Finnish government official (Mikko Karna) heard about the report, he lashed out and the bank was instructed to take down any dissent toward the government. The bank’s executive management team said it is not the bank’s right to question vaccines, lockdowns and other actions taken by the government. This is the totalitarian world we now live in.\n\nBankers forced to retract the truth and follow government tyranny\n\nThe CEOs of banks and other major corporations are the easiest to control because they have much to lose. Most of the time, bankers and corporate leaders refuse to speak out because they have prestigious positions and six-to-seven figure salaries to protect. But even the most well-connected, highest paid people can see right through the medical tyranny, and after two years of taking orders, they too are tired of going along with the narrative, the controls, the physical and psychological abuse. Some, like Martin Enlund and Andreas Steno Larsen, are willing to speak out, and risk it all…until they get threatened to get back in line.\n\nThe analysts were forced to retract this very truthful statement: “It used to be ‘two weeks to flatten the curve,’ but somehow it has developed to ‘imprison the unvaccinated (or worse).’ Lockdownistas have been on parade also over the past week, with ‘papers please’ – systems being implemented in many countries to try to boost the injection rate. Ireland has implemented a semi-lockdown with a midnight curfew. Austria has not only decided to imprison the unvaccinated (albeit so far only in their homes), the entire country is now going back into a lockdown and nationwide vaccine mandate is launched. The vaccine is apparently so good you need to force people in to taking it. This is unlikely to work wonders for the lack of trust in the system.”\n\nThe “elite” live in a world of subjugation and abuse because they lack the courage to stand against medical tyranny\n\nThe elite are often times the most enslaved because they don’t have the right to think or speak. Their positions of prestige and wealth are anything but that, because they now live in a world that is dictated to them. They have no body autonomy rights. Their civil liberties are vanquished. They can’t speak up about it, or they risk losing everything. Their children are now subjugated by vaccines that don’t work, that injure and kill. They have to show “papers” wherever they go, and wear masks when their corporate bosses tell them to. They have to continue relinquishing their bodies to new injection requirements every year, and pay their dues to government officials that find new ways to lock them down and threathen their livelihoods.\n\nIn the end, Martin Persson, head of Large Corporates & Institutions at Nordea, decided to shut his mouth and accept his chains. After being threatened, he apologized for the research report. He said he will continue to “publish credible analysis and research with integrity.” (Whatever that means now).\n\n“As a bank, our expertise is banking — supporting and advising our customers on their financial situation,” Persson said in a statement. “We leave medical advice to the experts and therefore, as a company, we follow the authorities’ guidance on vaccines against COVID.” Enlund, who worked his way up the ranks over the past ten years, ultimately followed suit with the government’s demands. He apologized and promised to keep his mouth shut, to please his masters. Their willingness to please government officials is one of the main reasons why CRIMES AGAINST HUMANITY continue, unabated.", "opengraph": {"article:published_time": "2022-01-12 11:45:14", "title": "Financial analysts SUSPENDED for criticizing totalitarian lockdowns and vaccine mandates", "type": "article", "url": "https://www.govtslaves.com/2022-01-12-financial-analysts-suspended-criticizing-totalitarian-lockdowns-vaccine-mandates.html", "site_name": "Gov't Slaves Com", "description": "Two financial analysts were suspended and forced to retract their truthful research report which questioned totalitarian lock downs, vaccine efficacy and vaccine mandates. Nordea Bank Abp suspended Chief Analyst Martin Enlund and Global Chief Strategist Andreas Steno Larsen, banishing them from their website. “We have initiated an internal review, and the two analysts will not […]", "image": "https://www.govtslaves.com/wp-content/uploads/sites/330/2022/01/free-speech-press-media-censor-e1456143012957.jpg"}, "tags": ["slavery", "banned", "corporate control", "obey", "endless lockdowns", "propaganda", "endless vaccine mandates", "vaccine failure", "freedom of speech", "science dictatorship", "dissent", "enslaved", "Medical Tyranny", "subjugation", "insanity", "crimes against humanity", "medical fascism", "Censored", "Censorship", "courage", "free speech"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/covid-19/2-nordea-strategists-suspended-questioning-vaccines-criticizing-lockdownistas", "https://twitter.com/KarnaMikko/status/1463496223919415304", "https://www.naturalnews.com/2022-01-05-austria-prison-camp-unvaccinated-lockdown-extended.html", "http://medicalfascism.news", "https://www.zerohedge.com/covid-19/2-nordea-strategists-suspended-questioning-vaccines-criticizing-lockdownistas", "https://twitter.com/KarnaMikko/status/1463496223919415304", "https://www.naturalnews.com/2022-01-05-austria-prison-camp-unvaccinated-lockdown-extended.html"], "authors": [], "publish_date": "2022-01-12 11:45:14"}