{"result_id": "142029", "URL": "https://greenmedinfo.com/blog/how-virality-project-threatens-our-freedom", "timestamp": "2023-04-25 15:23:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/how-virality-project-threatens-our-freedom", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "How the Virality Project Threatens Our Freedom", "cleaned_text": "\n• We now have proof that the U.S. Department of Homeland Security's (DHS) Cybersecurity and Infrastructure Security Agency (CISA) partnered with a censorship consortium called the Election Integrity Partnership (EIP) to illegally censor Americans\n• During the 2020 election cycle, the EIP and CISA worked with the State Department's Global Engagement Center (GEC) and the DHS-backed Elections Infrastructure Information Sharing and Analysis Center (ISAC) to police political wrongthink on social media\n• In February 2021, the EIP rebranded itself as the Virality Project, and went on to censor COVID-19 narratives on behalf of the government, even when they knew it was true\n• The Virality Project targeted first-hand accounts of COVID jab injuries to prevent vaccine hesitancy, and posts that expressed fears about vaccine passports because being against vaccine passports was a \"gateway to being anti-vax.\" They also censored jokes and satirical memes on the basis that they might \"exacerbate distrust\" in public health officials, and made asking questions a punishable event because questioning is \"commonly used by spreaders of misinformation\"\n• As bad as things are, they're about to get a whole lot worse unless Congress puts a stop to it. In the last three years, the U.S. government has granted more than 500 contracts and/or grants aimed at tackling \"misinformation\"\n• The Department of Defense is also focused on research involving AI and tech that can monitor internet conversations and deploy countermeasures before wrongthink goes viral. Congress must defund all of these programs, as well as any agency department or team involved in censoring Americans\n\nAs detailed in \"Propaganda and Censorship Dominate the Information War,\" we now have proof, courtesy of the Twitter Files, that the U.S. Department of Homeland Security's (DHS) Cybersecurity and Infrastructure Security Agency (CISA) partnered with a censorship consortium called the Election Integrity Partnership (EIP) to censor Americans.1\n\nIn an Atlantic Council interview, EIP head Alex Stamos also admitted that the partnership between the EIP and the DHS was set up to outsource censorship that the government could not do due to \"lack of legal authorization.\"2\n\nStamos, a former chief of security at Facebook, is also director of the Stanford Internet Observatory -- one of the four organizations that make up the EIP -- and is a partner in the cyber consulting firm Krebs Stamos Group together with former CISA director Chris Krebs.\n\nDuring the 2020 election cycle, the EIP and CISA worked with the State Department's Global Engagement Center (GEC) and the DHS-backed Elections Infrastructure Information Sharing and Analysis Center (ISAC) to police political wrongthink on social media. The EIP coordinated the take-down of undesirable content using a real-time chat app that the DHS, EIP and social media companies all share.3\n\nIn February 2021, the EIP rebranded itself as the Virality Project, and went on to censor COVID-19 narratives on behalf of the government in the same way the EIP censored election narratives on behalf of the political Left.4\n\nAccording to independent journalist Matt Taibbi, the Virality Project was essentially a dry run for President Biden's federal Disinformation Governance Board.5 In fact, the Virality Project proposed a federal \"Misinformation and Disinformation Center of Excellence\" just one day before President Biden announced the plan for this Orwellian outfit.\n\nPublic backlash forced Biden to reconsider, but all that means is that the government chose not to make its unconstitutional censoring of Americans official policy. They're still doing it through partnerships with the EIP/Virality Project and other third parties.\n\nIn a March 20, 2023, report (video above), The Hill host Robby Soave detailed the goals of the Virality Project, which \"above all else were to protect the perceived integrity of the federal health bureaucracy, vaccine manufacturers and government vaccine policymakers, and to advance mainstream establishment narratives and interests in general.\"\n\nAs noted by Soave, the Virality Project frequently pressured social media companies to censor COVID-19-related information and/or label it as \"misinformation\" -- even if the information was true.\n\n\"This coalition, which was working with government agencies, NGO's and the social media companies themselves, took the position that even true information could count as dangerous misinformation if its effect was to encourage a policy that clashed with the expert consensus …\n\nIf we still value the First Amendment, we must resist these pernicious calls for censorship. A call that is coming from a sordid coalition of 'truth czars' and ideological activists masquerading as fact checkers,\" Soave says.\n\nThe mere possibility of causing \"vaccine skepticism\" or \"vaccine hesitancy\" was enough of a justification to censor information about the deadly COVID shots, for example, even though the information was truthful and required in order to make an informed decision.\n\nThis even included true first-hand accounts of serious COVID jab injuries, which could have saved lives had they been allowed to be shared. As noted by Andrew Lowenthal, co-founder of EngageMedia and author at Brownstone Institute:6\n\n\"Rather than listening out for safety signals to protect the public, leaders in the 'anti-disinformation' field ran cover to protect Big Pharma, smearing and censoring critics.\n\nThe moral depravity is astounding and quite possibly criminal … [In] suppressing 'stories of true vaccine side effects' the Virality Project put people in danger. Rather than keeping people safe they exposed us to the depredations of Big Pharma.\"\n\nBest-selling author John Leake7 also commented on the Virality Project's censoring of truthful information, saying:8\n\n\"This reminded me of our recent trip to Australia in which we learned the Australian Therapeutic Goods Administration (TGA) led by Dr. John Skerritt, MD, PhD, made the decision to suppress accurate reports of vaccine-induced myocarditis in young people because such reports could cause 'vaccine hesitancy.'\n\nAs these policymakers and regulators see it, the incidence of grave and fatal side effects are sufficiently rare to warrant censoring ANY reporting of them, as such reporting could cause the greater harm of 'vaccine hesitancy.'\n\nBy their calculus, severe injuries and deaths caused by COVID-19 vaccines are the price we as a society must pay for the purportedly greater number of lives saved by the vaccines.\n\nNever in the history of medicine has this calculus been used to evaluate the benefit of a medical product. Only in a military context -- that is, commanders in the field must accept a certain number of casualties in order to achieve the greater benefit of vanquishing the enemy -- has this logic been applied.\"\n\nThe Virality Project also targeted posts that expressed fears about vaccine passports -- because being against vaccine passports was a \"gateway to being anti-vax\" -- and censored jokes and satirical memes on the basis that they might \"exacerbate distrust\" in those targeted as the butt of the joke.\n\nDr. Anthony Fauci is one example of a public health official whose reputation was protected in this way. They even made asking questions a punishable event, because asking questions is a tactic \"commonly used by spreaders of misinformation.\"9\n\nHave You Heard of Pre-Bunking?\n\nThe Virality Project also invented \"pre-bunking\" strategies to \"warn\" the public about purported misinformation before it had time to spread.\n\nFor example, when the Johnson & Johnson COVID jab was temporarily suspended by the U.S. Food and Drug Administration and Centers for Disease Control and Prevention in April 2021, the Virality Project issued a rapid response statement10 saying the number of incidents of rare and severe types of blood clots was \"very small,\" especially considering the millions of doses given.\n\nThey also analyzed the narratives put forth \"concerning the J&J suspension within anti-vaccine groups across social media platforms\" and in foreign and international media, and how these narratives might affect \"vaccine hesitancy,\" and proposed strategies to counter efforts to use the suspension as support for anti-COVID jab arguments.\n\nAs predicted, the Twitter files also contain correspondence with social media companies relating to yours truly. Taibbi points out the Twitter files \"repeatedly show media acting as proxy\"11 for the NGOs in the censoring network.\n\nAs an example, he posted the email below,12 in which the Financial Times used the shady NGO Center for Countering Digital Hate's fabricated \"Misinformation Dozen\" report to pressure Twitter into banning me, Robert F. Kennedy Jr., and the rest on its list.\n\nGovernment Censorship Campaign Is Financed by Taxpayers\n\nAs noted by Taibbi in a March 9, 2023, Twitter thread:13\n\n\"Well, you say, so what? Why shouldn't civil society organizations and reporters work together to boycott 'misinformation'? Isn't that not just an exercise of free speech, but a particularly enlightened form of it?\n\nThe difference is, these campaigns are taxpayer-funded. Though the state is supposed to stay out domestic propaganda, the Aspen Institute, Graphika, the Atlantic Council's DFRLab, New America, and other 'anti-disinformation' labs are receiving huge public awards.\n\nSome NGOs, like the GEC-funded Global Disinformation Index or the DOD-funded NewsGuard, not only seek content moderation but apply subjective 'risk' or 'reliability' scores to media outlets, which can result in reduction in revenue. Do we want government in this role? …\n\nThis is the Censorship-Industrial Complex at its essence: a bureaucracy willing to sacrifice factual truth in service of broader narrative objectives. It's the opposite of what a free press does …\n\nThis, ultimately, is the most serious problem with the Censorship-Industrial Complex. Packaged as a bulwark against lies and falsehood, it is itself often a major source of disinformation, with American taxpayers funding their own estrangement from reality.\"\n\nYou can learn more about Taibbi's work on the Twitter files in the video above. In his Twitter Files No. 19 thread, Taibbi also highlights some of the shadier characters within this censorship-industrial complex, such as Renée DiResta, technical research manager at Stanford Internet Observatory (which, again, is part of the EIP and Virality Project):14\n\n\"Profiles portray DiResta as a warrior against Russian bots and misinformation, but reporters never inquire about work with DARPA, GEC and other agencies. In the video below … Stamos introduces her as having 'worked for the CIA.'\"\n\n\"DiResta has become the public face of the Censorship-Industrial Complex, a name promoted everywhere as an unquestioned authority on truth, fact, and Internet hygiene, even though her former firm, New Knowledge, has been embroiled in two major disinformation scandals …\n\nDiResta's New Knowledge helped design the Hamilton 68 project exposed in the Twitter files. Although it claimed to track 'Russian influence,' Hamilton really followed [Conservative] Americans … Hamilton 68 was funded by the Alliance for Securing Democracy, which in turn was funded by the German Marshall Fund, which in turn is funded in part by -- the Department of State.\n\nThe far worse scandal was Project Birmingham, in which thousands of fake Russian Twitter accounts were created to follow Alabama Republican Roy Moore in his 2017 race for US Senate. Newspapers reported Russia seemed to take an interest in the race, favoring Moore.\n\nThough at least one reporter for a major American paper was at a meeting in September 2018 when New Knowledge planned the bizarre bot-and-smear campaign, the story didn't break until December, two days after DiResta gave a report on Russian interference to the Senate …\n\nThe incident underscored the extreme danger of the Censorship-Industrial Complex. Without real oversight mechanisms, there is nothing to prevent these super-empowered information vanguards from bending the truth for their own ends.\n\nBy way of proof, no major press organization has re-examined the bold claims DiResta/New Knowledge made to the Senate -- e.g. that Russian ads 'reached 126 million people' in 2016 -- while covering up the Hamilton and Alabama frauds.\"\n\nAs bad as things already are, they're about to get a whole lot worse unless Congress puts a stop to it. In a March 21, 2023, article,15 The Federalist's senior legal correspondent Margot Cleveland details grants showing the U.S. government is \"building a vast surveillance and speech suppression web around every American.\"\n\n\"Our government is preparing to monitor every word Americans say on the internet -- the speech of journalists, politicians, religious organizations, advocacy groups, and even private citizens. Should those conversations conflict with the government's viewpoint about what is in the best interests of our country and her citizens, that speech will be silenced,\" she writes.16\n\n\"While the 'Twitter Files' offer a glimpse into the government's efforts to censor disfavored viewpoints, what we have seen is nothing compared to what is planned, as the details of hundreds of federal awards lay bare.\n\nResearch by The Federalist reveals our tax dollars are funding the development of artificial intelligence (AI) and machine-learning (ML) technology that will allow the government to easily discover 'problematic' speech and track Americans reading or partaking in such conversations.\n\nThen, in partnership with Big Tech, Big Business, and media outlets, the government will ensure the speech is censored, under the guise of combatting 'misinformation' and 'disinformation.'\"\n\nIn the last three years alone, the federal government has granted more than 500 contracts and/or grants aimed at tackling \"misinformation\" and \"disinformation.\" The Department of Defense itself is also focused on research involving AI and ML tech that can monitor internet conversations for objectionable viewpoints and deploy countermeasures before they go viral.\n\nUnfortunately, many of those who have the greatest power to inform the public about what's happening, and those with the power to protect us by putting an end to this dystopian nightmare, don't want to because they have something to gain from it, or believe they do. As noted by Cleveland:17\n\n\"The threat is further heightened because those with the power to warn the public and demand the government stop silencing Americans' speech are complicit.\n\nWith Democrats, the legacy media, and many Republicans all in on the government's efforts to censor misinformation and disinformation, it will be extremely difficult for the public to recognize the risks free speech faces -- especially since those trying to sound the alarm have already been falsely branded purveyors of disinformation.\n\nA chance remains, though, that enough ordinary Americans will hear the message before it is too late and demand Congress close the Censorship-Industrial Complex.\"\n\nWhere Do We Go From Here?\n\nTaibbi, in the video above, says the revelations about the Virality Project tell us two things:18\n\n\"One, as Orwellian proof-of-concept, the Virality Project was a smash success. Government, academia, and an oligopoly of would-be corporate competitors organized quickly behind a secret, unified effort to control political messaging.\n\nTwo, it accelerated the evolution of digital censorship, moving it from judging truth/untruth to a new, scarier model, openly focused on political narrative at the expense of fact.\"\n\nThis is deeply problematic and will strangle democracy and end the republic that is the United States if allowed to continue. To quote Lowenthal:19\n\n\"Free speech and expression protect us from the most powerful actors on the planet, corporations, the State, and a growing plethora of international bodies. Ultimately, we need radically decentralized social media that is more immune to their capture. Our safety depends on it.\"\n\nDecentralizing social media is just one necessary defense tactic though. We must also demand Congress take swift action to defund and dismantle the \"censorship-industrial complex\" that is using our tax dollars to deceive us and withhold truth. Nothing less will suffice. We can't invent enough privacy laws to protect us from what's coming.\n\nFor a time, many of us suspected that this massive surveillance and control system was primarily funded and built by private interests, but now we're finding that government funding is behind much, and perhaps most, of it.\n\nCongress has, for many years, if not decades, approved funding for programs intended to destroy our constitutional rights. Now, they must defund all of them. They must also defund all government agency departments or teams involved in the federal censorship network, and that includes the FBI, CIA and DHS.\n\nDo you appreciate our work here at GreeMedInfo.com? Consider we are a 100% reader-supported platform, without advertisements. This means that without your support, we wouldn't exist. Thankfully, there are 4 easy ways for you to help us stay alive and well:\n\n1) Become a member (for as low as 29 cents a day!)\n\n4) Make a larger contribution by emailing us at [email protected]", "opengraph": {"description": "We now have proof that the U.S. Department of Homeland Security's (DHS) Cybersecurity and Infrastructure Security Agency (CISA) partnered with a censorship consortium called the Election Integrity Partnership (EIP) to illegally censor Americans", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/How_the_Vitality_Project_Threatens_Our_Freedom-GreenMedInfo.jpg", "title": "How the Virality Project Threatens Our Freedom", "type": "article", "url": "https://greenmedinfo.com/blog/how-virality-project-threatens-our-freedom"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/E04KTBDffiY\" title=\"YouTube video player\" width=\"560\"/>", "src": "https://www.youtube.com/embed/E04KTBDffiY"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/XSwOiDzovk4\" title=\"YouTube video player\" width=\"560\"/>", "src": "https://www.youtube.com/embed/XSwOiDzovk4"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/GsooGvgLh7U\" title=\"YouTube video player\" width=\"560\"/>", "src": "https://www.youtube.com/embed/GsooGvgLh7U"}], "links": ["https://www.mercola.com/", "https://takecontrol.substack.com/p/propaganda-censorship-information-war", "https://takecontrol.substack.com/p/twitter-files-government-led-censorship-network", "https://takecontrol.substack.com/p/shooting-starlings-how-masters-curate-flocks", "/disease/coronavirus-disease", "/anti-therapeutic-action/vaccination-all", "/membership", "/membership", "/donation/how-you-can-support-our-mission", "https://regenerateproject.com/", "/cdn-cgi/l/email-protection", "https://twitter.com/mtaibbi/status/1633830092576284678?s=20", "https://foundationforfreedomonline.com/11-9-22.html", "https://twitter.com/lhfang/status/1587104660355096576", "https://childrenshealthdefense.org/defender/twitter-files-virality-project-covid-misinformation/?utm_source=substack&utm_medium=email", "https://brownstone.org/articles/censorship-masquerades-and-disinformation-control/", "https://childrenshealthdefense.org/authors/john-leake/", "https://petermcculloughmd.substack.com/p/stanfords-stupid-virality-project?utm_source=twitter&utm_campaign=auto_share&r=14jb45", "https://www.viralityproject.org/rapid-response/jampj-suspension-rapid-response", "https://twitter.com/mtaibbi/status/1633830077170618376/photo/1", "https://thefederalist.com/2023/03/21/grants-reveal-federal-governments-horrific-plans-to-censor-all-americans-speech/"], "authors": [], "publish_date": null}