{"result_id": "142028", "URL": "https://greenmedinfo.com/blog/how-many-millions-are-disabled-or-injured-jab", "timestamp": "2023-04-25 15:23:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/how-many-millions-are-disabled-or-injured-jab", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "How Many Millions are Disabled or Injured From the Jab?", "cleaned_text": "\n• The 2022 U.S. Vaccine Damage Report revealed a sobering glimpse into the true carnage that occurred at the hands of the COVID-19 shot campaign\n• Total economic costs due to the shots are estimated at $147.8 billion, including $89.9 billion from related injuries, $52.2 billion from disabilities and $5.6 billion from excess deaths\n• A preprint systematic review found the mRNA-based COVID shots increased the risk of myocarditis, with a mortality of about 1 to 2 per 200 cases\n• Evidence of serious neurological harms, including Bell’s palsy, Guillain-Barré syndrome, myasthenic disorder and stroke, which are likely due to an autoimmune reaction, was also found from the shots\n\nWe're beginning to see the fallout from the mass COVID-19 shot campaign, which has been referred to as the \"greatest violation of medical ethics in the history of medicine, maybe humanity.\"1\n\nFormer BlackRock analyst and fund manager Edward Dowd is one of the few trying to get the word out about COVID-19 shot risks, and he's been using data and statistics to prove his point and publicize the undeniable increase in deaths and disability among young, healthy adults that has occurred since the shots' widespread rollout.2\n\nThis group -- the 148 million employed Americans between the ages of 18 and 643 -- is typically a healthy crowd. This is why private insurance companies love to sell group life insurance policies to large Fortune 500 corporations and mid-sized companies --they hardly ever have to pay out on a claim. But this is changing.\n\nDowd's 2022 U.S. Vaccine Damage Report4 revealed a sobering glimpse into the true carnage that occurred at the hands of the COVID-19 shot campaign, and its results are striking.\n\nDowd and colleagues published their 2022 Vaccine Damage Project at their website, Phinance Technologies.5 It revealed the following estimated human and economic costs:6\n\nTo put this into perspective, John Leake writes on Courageous Discourse, \"Note that this death count in one year is 5.2 times the number of men killed in 10 years of combat in Vietnam,\" adding:7\n\n\"Perhaps the most extraordinary thing about this state of affairs is that most Americans don't know it's happening. Every day, young people are dying from heart attacks, strokes, and seizures caused by COVID-19 vaccines. Most of their families and friends are led to believe that they just died -- suddenly and unexpectedly -- of acute conditions that were extremely rare in young people prior to 2021.\"\n\nThe report included data from employed individuals between the ages of 16 and 64, and categorized the impact into four broad groups:\n• Mild to moderate outcome including a temporary or short-term, long-term or permanent injury\n\nWhile group 1 was the largest, comprising an estimated 82% of the population, the authors pointed out that these groups are dynamic, and individuals in one group could move into another, particularly in the case of progressing from no or minor injury to severe injury, such as we've seen with elite athletes suddenly dropping dead on the field:8\n\n\"While these groupings characterize different levels of damage from the inoculations, they are not static and could interact with each other. For instance, there might be individuals who had no visible effects after vaccination but nonetheless could still be impacted from the inoculations and could therefore be represented in the sub-group of injured individuals.\n\nIn a similar way, individuals with mild injuries from the inoculations could, over time, develop severe injuries to the extent of being disabled, or an extreme outcome such as death. The likely path of outcomes would be from injury to disability to death.\n\nWe need to consider, however, that to a lesser extent there could be individuals who suffer extreme outcomes when they had previously only experienced mild injuries until then. We can relate this with the anecdotes of otherwise healthy athletes suffering heart attacks during sports competitions at an alarming rate since the 2021 inoculations.\"\n\nThe effects in the report are only what can currently be measured, and are likely to also be fluid. In terms of economic effects, for instance, the report notes that mortuary companies are likely to benefit while life insurers will be harmed, leading to a reallocation of resources.\n\nMeanwhile, in terms of economic costs, milder damage is associated with greater cost, since a larger portion of working age individuals are affected. For instance, those with mild to moderate injury made up a sizeable 18% of the population. According to the report:9\n\n\"We make the assumption that the pool of potentially vaccine-injured individuals is about 18% of the population, which is, the rate of related adverse events reported in the Pfizer clinical trial (minus the baseline rate). These injuries will likely manifest a loss of productivity since, as these individuals are likely to have higher absentee rates and, consequently, higher lost worktime rates, than the pre-2019 baseline.\n\nIn fact, we performed an analysis of absence rates and lost worktime rates10 in full time workers (using data provided by the BLS). We observed a large increase in absence rates starting in 2020, but accelerating in 2022. Absence rates in 2022 were about 28.6% higher than in 2019, representing a 11 standard deviation variation.\"\n\nFurther, many other economic costs are harder to account for, such as a worker who's still at work but not able to work to their full potential. When these types of scenarios are factored in, the damages could be even more massive. Dowd tweeted:11\n\n\"Our economic damage estimates are what we can measure. The knock effects such as lost productivity due to a worker being present but working at say 50%-75% of capacity is missed plus burn out from those picking up slack. Also supply chain delays are not captured etc and etc. The multiplier effects are massive.\"\n\nA preprint systematic review of papers with data on serious adverse events associated with COVID-19 shots again points to significant risks.12 The review was conducted by Maryanne Demasi, Ph.D., a former medical scientist with the University of Adelaide and former reporter for ABC News in Australia and Professor Peter Gøtzsche, a Danish physician-researcher who co-founded the Cochrane Collaboration in 1993.\n\nIt included 18 systematic reviews, 14 randomized trials and 34 other studies, noting that \"most studies were of poor quality\" and additional randomized trials are needed. Still, their review revealed multiple red flags, including:13\n• vaccines increased the risk of venous thrombosis and thrombocytopenia Adenovirus vectorincreased the risk of venous thrombosis and thrombocytopenia\n• mRNA-based shots increased the risk of myocarditis, with a mortality of about 1 to 2 per 200 cases\n• Evidence of serious neurological harms, including Bell's palsy, Guillain-Barré syndrome, myasthenic disorder and stroke, which are likely due to an autoimmune reaction, was found\n• Severe harms, defined as those that prevent daily activities, were underreported in the randomized trials\n• Severe harms were very common in studies of booster doses after a full round of shots and in a study of vaccination of previously infected people\n\nFurther, not only have drug regulators and public health authorities been slow to follow up on safety signals showing serious harms from the shots, Demasi notes, but, \"Population-wide recommendations for COVID vaccination and boosters ignore the negative benefit to harm balance in low-risk groups such as children and people who have already recovered from covid-19 (natural immunity).\"14\n\nIt's can be difficult to parse out adverse effects from COVID-19 shots and those due to COVID-19 infection. The Western Australia Vaccine Safety Surveillance (WAVSS) 2021 Report, however, shows a unique viewpoint that made this possible. At the time, there was virtually no COVID-19 circulating in the community, yet the area had a 90% vaccination rate among those 12 years and over.15 Umbrella News reported:16\n\n\"There are few regions in the world where most of the population was vaccinated before the spread of Covid in the community. Sealed off from the rest of Australia, and the world, for 697 days, WA's closed border earned it the moniker of the 'hermit kingdom'.\n\nState Premier Mark McGowan noted WA's unique role in the global vaccination trial, remarking to a press conference in early 2022, You see, Western Australia is an experiment. We basically have had very few Omicron cases, we have very high vaccination levels, and we have a very compliant population.\"\n\nSo, what happened in an area of the world that had very few COVID-19 cases and very high rates of COVID-19 shots? An \"exponential increase\" in reports of adverse events following immunization (AEFI), such that it necessitated changes to the vaccine safety surveillance program at the department in order to manage them.17 According to the report:18\n\n\"The number of AEFI reported to WAVSS was significantly higher in 2021 than in previous years (10,726 compared with an average of 276 per year for the 2017-2020 period) due to the introduction of the COVID-19 vaccination program.\"\n\nAs Umbrella News reported, the peak of AEFI reports coincided with the rollout of shot mandates, culminating in a rush of hospitalizations that strained area hospitals:19\n\n\"In 2021, AEFIs for Covid vaccines were reported at almost 24x the rate of AEFIs for all other vaccines combined … In the latter half of the year, as AEFIs peaked, the media regularly reported that WA hospitals were under strain, despite the lack of Covid cases.\n\nThe highest month for AEFI reports was October, the same month that vaccine mandates were announced for most of the workforce, the vaccine eligibility criteria were expanded to people aged 18 and over, and walk-in vaccinations became available.\"\n\nOther standouts from WA's report include a 35% increase in myocarditis and a 25% increase in pericarditis compared to background rates. \"Shockingly,\" Umbrella News noted, \"the risk of pericarditis in the age group in the age group 25 to 29 years old was 53.5 cases per 100,000 doses of Spikevax. It is perhaps unsurprising that chest pain was the fifth most common reported AEFI for COVID vaccines in 2021.\"20\n\nWhile the risks of adverse effects have been downplayed, the efficacy of COVID-19 shots has been overstated from the beginning. Writing in the Journal of Evaluation in Clinical Practice, a research team revealed that multiple biases, including background infection rates and cross-overs from unvaccinated to vaccinated in the early days of the campaign, led to an overstatement of COVID-19 shots' effectiveness.21\n\n\"We conclude that \"real-world\" studies using methodologies popular in early 2021 overstate vaccine effectiveness,\" the study notes.22 Board-certified internist and cardiologist Dr. Peter McCullough explained that from the lack of efficacy alone, the shots should be removed from the market. And the case gets even stronger when you factor in the significant number of related disabilities and deaths:23\n\n\"Multiple sources of bias created illusion that vaccines worked as they failed in the real world … claims that the COVID-19 vaccines worked to reduce spread of infection, hospitalization, and death must be rejected.\n\nThe burden of proof has not been met and threats to validity have not been overcome. All of the COVID-19 vaccines should be removed from the market and we should begin the investigative phase into how this massive program failed to stop COVID-19.\"\n\nNational vaccine policy recommendations in the U.S. are made at the federal level but vaccine laws are made at the state level. It is at the state level where your action to protect your vaccine choice rights can have the greatest impact.\n\nIt is critical for EVERYONE to get involved now in standing up for the legal right to make voluntary vaccine choices in America because those choices are being seriously threatened.\n\nNot only are lobbyists representing drug companies, medical trade associations and public health officials trying to persuade legislators to strip all vaccine exemptions from public health laws, but global political operatives lobbying the United Nations and World Health Organization are determined to take away the human right to autonomy and protection of bodily integrity.\n\nWe must take action to defend our constitutional republic and civil liberties, including the right to autonomy, in America. That includes reforming oppressive mandatory vaccination laws and stopping the digital health ID that will make vaccine passports a reality for us, our children and grandchildren if we don’t take action today.\n\nSigning up to use the free online Advocacy Portal sponsored by the National Vaccine Information Center at www.NVICAdvocacy.org gives you immediate, easy access to your own state and federal legislators on your smartphone or computer so you can make your voice heard.\n\nNVIC will keep you up to date on the latest bills threatening to eliminate -- or expand -- your legal right to make vaccine choices and give you guidance about what you can do to support or oppose those bills. So, please, as your first step, sign up for the NVIC Advocacy Portal.\n\nShare Your Story With Your Legislators and People You Know\n\nIf you or a family member has suffered a serious vaccine reaction, injury or death, please talk about it. If we don't share information and experiences with one another, everybody feels alone and afraid to speak up.\n\nIf you want to protect your legal right to say “no” to vaccines you do not believe are safe or effective, make an appointment to personally talk with someone you have elected to office at the local, state and federal level or write a letter in your own words stating your concerns.\n\nAttend school board and city council and town hall meetings in your community that will impact your right to know and freedom to make decisions about how you or your children will live and stay healthy. If you have a different perspective on a story about vaccination that appears in your local newspaper, write a letter to the editor.\n\nI must be frank with you: You have to be brave because there is a lot of censorship of conversations that challenge “official” narratives about vaccination. You likely will be strongly criticized for daring to talk about the \"other side\" of the vaccine story and for defending your informed consent rights. Be prepared for it and have the courage to stand your ground.\n\nOnly by sharing our perspective and what we know to be true will the public conversation about vaccination open up so people are not afraid to talk about it.\n\nWhile our rights are being threatened, the vaccine injured are being swept under the carpet and treated like nothing more than statistically acceptable “collateral damage\" of one-size-fits-all mandatory vaccination laws. Way too many people are being put at risk for injury and death and there is nothing scientific or moral about that. We should not be treating human beings like guinea pigs.\n\nInternet Resources Where You Can Learn More\n\nI encourage you to visit the four websites of the National Vaccine Information Center (NVIC), at www.NVIC.org, a nonprofit charity that has been educating the public about the need to prevent vaccine injuries and deaths since 1982. The information you get on their websites is fully referenced and will help you become an effective vaccine choice advocate in your community:\n• NVIC.org -- This website was established in 1995 and is the oldest and largest consumer operated website publishing information on diseases and vaccines on the internet. Learn about vaccine reactions, injuries and deaths and the history and current status of vaccine science, policy, law and ethics in the U.S. on more than 2,000 web pages.\n• NVICAdvocacy.org -- This communications and advocacy network, established in 2010, is your gateway to taking action to protect your right to make vaccine choices where you live.\n• TheVaccineReaction.org -- This weekly journal newspaper published by NVIC since 2015 is dedicated to encouraging an “enlightened conversation about vaccination, health and autonomy.”\n• MedAlerts.org -- This is a user-friendly search engine for the federal Vaccine Adverse Event Reporting System (VAERS) established under the 1986 National Childhood Vaccine Injury Act and sponsored by NVIC since 2006. Search for descriptions of vaccine injuries and deaths reported to VAERS on this popular website.\n\nFind A Doctor Who Will Listen and Care\n\nIf your doctor or pediatrician refuses to provide medical care to you or your child unless you agree to get vaccines you don't want, I strongly encourage you to have the courage to find another doctor. Harassment, coercion and refusal to provide medical care to someone declining one or more doses of government recommended vaccines is a violation of the informed consent ethic.\n\nUnfortunately, it is becoming routine among members of the medical establishment to be reluctant to share vaccine decision-making power with patients and parents of minor children, especially during the aggressive push for all Americans to get COVID shots.\n\nThere are doctors out there who respect the precautionary and informed consent principles, so take the time to locate a doctor who treats you with compassion and is willing to listen and respect the health care choices you make for yourself or your child.\n\nDo you appreciate our work here at GreeMedInfo.com? Consider we are a 100% reader-supported platform, without advertisements. This means that without your support, we wouldn't exist. Thankfully, there are 4 easy ways for you to help us stay alive and well:\n\n1) Become a member (for as low as 29 cents a day!)\n\n4) Make a larger contribution by emailing us at [email protected]", "opengraph": {"description": "The 2022 U.S. Vaccine Damage Report revealed a sobering glimpse into the true carnage that occurred at the hands of the COVID-19 shot campaign", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/How_Many_Milions_are_Disabled_or_Injured_from_the_Jab-GreenMedInfo.jpg", "title": "How Many Millions are Disabled or Injured From the Jab?", "type": "article", "url": "https://greenmedinfo.com/blog/how-many-millions-are-disabled-or-injured-jab"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.mercola.com", "/disease/coronavirus-disease", "https://takecontrol.substack.com/p/are-athletes-dropping-dead-covid-jab", "/anti-therapeutic-action/vaccination-all", "https://nvicadvocacy.org/", "https://nvicadvocacy.org/members/Home.aspx", "https://www.nvic.org/", "https://www.nvic.org/", "https://nvicadvocacy.org/", "https://www.thevaccinereaction.org/", "https://www.medalerts.org/", "/membership", "/membership", "/donation/how-you-can-support-our-mission", "https://regenerateproject.com/", "/cdn-cgi/l/email-protection", "https://rumble.com/v2awx7a-dr.-james-thorp-obgyn-on-tucker-carlson-harms-of-the-covid-vaccine-for-preg.html", "https://www.bitchute.com/video/7WO5d0iQ0ApV/", "https://petermcculloughmd.substack.com/p/ed-dowds-grim-accounting", "http://www.phinancetechnologies.com/HumanityProjects/The%20VDamage%20Project%20-%20Human%20%20Cost.htm", "https://www.zerohedge.com/markets/bombshell-vax-analysis-finds-147-billion-economic-damage-tens-millions-injured-or-disabled", "http://www.phinancetechnologies.com/HumanityProjects/US%20Absence%20Rates%20-%20Part1.htm", "https://twitter.com/DowdEdward/status/1640735076110716928", "https://www.medrxiv.org/content/10.1101/2022.12.06.22283145v2", "https://www.medrxiv.org/content/10.1101/2022.12.06.22283145v2", "https://maryannedemasi.substack.com/p/serious-harms-of-the-covid-19-vaccines", "https://twitter.com/dystopian_DU/status/1640597586628448256", "https://umbrellanews.com.au/featured/2023/03/how-the-hermit-kingdom-became-the-worlds-control-group-for-the-largest-vaccination-trial-ever/", "https://www.health.wa.gov.au/~/media/Corp/Documents/Health-for/Immunisation/Western-Australia-Vaccine-Safety-Surveillance-Annual-Report-2021.pdf", "https://www.health.wa.gov.au/~/media/Corp/Documents/Health-for/Immunisation/Western-Australia-Vaccine-Safety-Surveillance-Annual-Report-2021.pdf", "https://onlinelibrary.wiley.com/doi/10.1111/jep.13839"], "authors": [], "publish_date": null}