{"result_id": "142014", "URL": "https://greenmedinfo.com/guide/health-guide-vaccine-research", "timestamp": "2023-04-25 15:22:29 CEST+0200", "meta": {"description": "Greenmedinfo.com - Natural Medical Resource - The only website in the world that has free, entirely evidence-based, and solar-powered natural medical database with 19,000+ articles and growing daily", "lang": "en", "keywords": "natural medicine,integrative medicine,alternative medicine,evidence-based medicine,functional medicine,alternative toxicology,complementary medicine,pubmed", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/guide/health-guide-vaccine-research", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "Health Guide: Vaccine Research", "cleaned_text": "With the flu season hysteria nearing its peak, millions are being driven to vaccination as a 'preventive' approach. Those who abstain are often accused of being uneducated or worse, socially irresponsible \"anti-vaxxers.\" Nothing could be further from the truth.\n\nStudies Find Flu Shots Can Harm Your Heart, Infant And Fetus Flu vaccines, according to the best scientific evidence available today, will only work against 10% of the circulating viruses that cause the symptoms of seasonal epidemic influenza. So, do the theoretical benefits really outweigh the known harms?\n\nLet's face it: the only real justification for using vaccines to \"immunize\" ourselves against disease is derived from the natural fact that when challenged by infectious agents the humoral arm of our immune system launches a successful response capable of conferring lasting immunity. Were it not for the elegance, proficiency, and mostly asymptomatic success of our recombinatorial immune system in dealing so well with infectious challenges, vaccination would have no scientific...\n\nHep B Vaccine Damages the Liver it is Supposed to Protect Startling research published in the journal Apoptosis indicates that hepatitis B vaccine, which is designed to prevent Hepatitis B virus-induced damage to the liver, actually causes liver cell destruction\n\nSmoke, Mirrors, and the 'Disappearance' of Polio Unbeknownst to most doctors, the polio-vaccine history involves a massive public health service makeover during an era when a live, deadly strain of poliovirus infected the Salk polio vaccines, and paralyzed hundreds of children and their contacts. These were the vaccines that were supposedly responsible for the decline in polio from 1955 to 1961! But there is a more sinister reason for the “decline” in polio during those years; in 1955, a very creative re-definition of poliovirus infections wa\n\nNY to Give Vaccines to Minors Without Parental Consent It's illegal for children to vote. It's illegal for children to choose to drink alcohol. It's illegal for children to drive. It's illegal for children to give consent for medical procedures. Yet, New York is planning to let children give consent for vaccinations, a potentially life-changing or destroying procedure, without parental consent?\n\nUsing Merck's Gardasil vaccine as a case in point, an investigation documents Big Pharma's near-total control of governmental health agency decisions and the utter lack of concern by the decision makers. However, some scientists are speaking out, and here’s what they have to say.\n\nPolio Vaccines Now The #1 Cause of Polio Paralysis While the Polio Global Eradication Initiative (PGEI), founded in 1988, declares itself successful in nearly eradicating wild-type polio in nations like India, vaccine-induced polio paralysis cases far outnumber those the vaccines were intended to prevent. It is believed that vaccines produce at least 300% more cases of polio than those existing in the wild, indicating that a natural problem has been transformed into a manmade one.\n\nVaccine Exemptions: Do They Really Put Others at Risk? Parents who exercise a vaccine exemption for their children are often ridiculed for putting their own children and others at risk. However, legally and medically, unvaccinated children do not pose a significant health risk to themselves or anyone else. Alternative vaccine views support this assertion, but the reasoning in this article comes straight from mainstream vaccine beliefs, accepted medical practice and current law", "opengraph": {"title": "Health Guide: Vaccine Research", "url": "https://greenmedinfo.com/guide/health-guide-vaccine-research", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["/blog/shocking-lack-evidence-supporting-flu-vaccines", "/blog/shocking-lack-evidence-supporting-flu-vaccines", "/gmi-blogs/Sayer%20Ji", "/blog/studies-find-flu-shots-can-harm-your-heart-infant-and-fetus", "/blog/studies-find-flu-shots-can-harm-your-heart-infant-and-fetus", "/gmi-blogs/Sayer%20Ji", "/blog/vaccination-agenda-implicit-transhumanismdehumanism", "/blog/vaccination-agenda-implicit-transhumanismdehumanism", "/gmi-blogs/Sayer%20Ji", "/blog/hep-b-vaccine-damages-liver-it-supposed-protect", "/blog/hep-b-vaccine-damages-liver-it-supposed-protect", "/gmi-blogs/Sayer%20Ji", "/blog/smoke-mirrors-and-disappearance-polio", "/blog/smoke-mirrors-and-disappearance-polio", "/gmi-blogs/suzannemd", "/blog/study-disproves-cdcs-primary-justification-vaccination", "/blog/study-disproves-cdcs-primary-justification-vaccination", "/gmi-blogs/Sayer%20Ji", "/blog/ny-give-vaccines-minors-without-parental-consent", "/blog/ny-give-vaccines-minors-without-parental-consent", "/gmi-blogs/christina.england.btinternet.com", "/blog/scientists-point-out-corruption-vaccines-promotion", "/blog/scientists-point-out-corruption-vaccines-promotion", "/gmi-blogs/GaiaHealth", "/blog/polio-vaccines-now-1-cause-polio-paralysis", "/blog/polio-vaccines-now-1-cause-polio-paralysis", "/gmi-blogs/Sayer%20Ji", "/blog/vaccine-exemptions-do-they-really-put-others-risk", "/blog/vaccine-exemptions-do-they-really-put-others-risk", "/gmi-blogs/lawpapa"], "authors": [], "publish_date": null}