{"result_id": "142040", "URL": "https://greenmedinfo.com/blog/positive-correlation-between-number-vaccine-doses-and-infant-mortality", "timestamp": "2023-04-25 15:24:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/positive-correlation-between-number-vaccine-doses-and-infant-mortality", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "Positive Correlation Between the Number of Vaccine Doses and Infant Mortality", "cleaned_text": "OMNS (Feb 22, 2023) There exists a heated controversy as to whether COVID-19 vaccines and associated boosters are truly \"safe and effective.\" Health care providers and regulators recommend COVID-19 vaccines to all individuals, despite differences in risk factors of serious disease among various age groups. Even those who have contracted COVID and have recovered from the disease via natural immunity are strongly encouraged to be vaccinated. Various laws and mandates have been drafted that require COVID-19 vaccination of employees. Senate Bill (SB) 866, introduced on the Senate floor on May 12, 2022, was initially drafted to allow children as young as 12-years of age to make their own medical decisions, including the administration of an FDA approved COVID-19 vaccine, without the knowledge or consent of their parents and have their medical records sealed. This measure was subsequently amended, but then moved to an inactive file.\n\nAccording to Dr. E. G. Bailey, a bioinformatics course instructor and her students, vaccine hesitancy \"has intensified due to the rapid development and distribution of the COVID-19 vaccine.\" They voice concern regarding \"anti-vaccine information\" being shared on social media, and appear to target for retraction a 2011 peer-reviewed study published in the journal Human and Experimental Toxicology that I coauthored with Neil Miller. In this paper, we reported a counterintuitive correlation demonstrating that among the most highly developed nations, those that require the most vaccines for their infants tend to have the worst infant mortality rates (IMRs) [1]. Bailey and nine coauthors uploaded a preprint manuscript [2] that reports, \"it is troublesome that this [the Miller and Goldman] manuscript is in the top 5% of all research outputs since its publication, being shared extensively on social media with tens of thousands of likes and re-shares (see https://acs.altmetric.com/details/406556).\"\n\nIf all vaccines were truly \"safe and effective,\" would not everyone be actively seeking to be vaccinated to gain protection against \"vaccine preventable\" diseases? Interestingly, many individuals assigned the label \"anti-vaccine\" initially manifested a \"pro-vaccine\" mindset. It was only after one or more of their own children experienced an adverse vaccine reaction, or they learned of an adverse reaction from friends, that their perception of vaccines changed. It is not just the lay public that has become skeptical of claims that vaccines have a positive risk-to-benefit ratio. A diverse range of medical professionals and researchers challenge that paradigm as exemplified by Seneff et al. [3] and other emerging peer-reviewed studies that specifically question the-benefit of COVID-19 vaccination and subsequent boosters compared to protection afforded by natural immunity. After a 30-year career, the recent resignation of Dr. Philip R. Krause, former FDA Deputy Chief for Vaccines, likely speaks to his integrity of supporting vaccine safety and estranging himself from an agency whose decision-making has become captured by the pharmaceutical industry and increasing conflicts of interests.\n\nThe Bailey manuscript (Nysetvold et al. [2]), is methodologically flawed by its use of data from both highly developed and Third World nations that have the tendency to attenuate the strength of the correlation between number of vaccine doses and IMR. Their failure to account for differences in nations' vaccination rates and diversity (heterogeneity) of socio-economic factors, likely explains why they were only able to report a statistically significant positive correlation (r = 0.16, p < .03) that is very weak relative to the stronger correlation, r = 0.70 (p < .0001), reported by Miller and Goldman [1]. Miler and Goldman avoided introducing many confounders by performing linear regression analysis using data from the US (which specified the most vaccine doses of any nation) and the 29 nations with better IMRs than the US. These nations inherently reported high vaccination rates (exceeding 90%) and displayed homogeneity of socio-economic factors.\n\nOnce the critics achieved a \"negligible\" association, it is likely that outcome reporting biases influenced them to pursue other investigations that they considered as further evidence in support of the \"safety and effectiveness\" of vaccines [4]. For example, in their analysis of IMR versus percentage vaccination rates for each of 8 vaccines, they report inverse correlations (e.g., as the percentage vaccination rate increases, IMR improves) for 7 vaccines. However, close inspection of the scatter plot reveals that vaccines are not necessary for low IMR (some countries with low IMR have lower dose schedules) nor are they sufficient (some countries with high dose schedules have very high IMR) [5]. Moreover, the methodology used by the critics ignore the possibility of synergistic effects of combinations of vaccines.\n\nThe methodology, results, and conclusions of several analyses that were performed by these critics are critically reviewed in a recent peer-reviewed publication by Goldman and Miller [5] which includes three new analyses (e.g., odds ratio, sensitivity analysis, and 2019 replication) that affirm the positive correlation (of their original study) (Table 1). An odds ratio analysis performed by an independent statistician, Dr. Walter Schumm, split the nations at the median for IMR and for the total number of vaccine doses. Three of eleven control variables that were investigated (i.e., child poverty rate, pertussis vaccination rate, and teenage fertility rate) were statistically significant. None of these variables lowered the correlation below 0.62, thus robustly confirming the original findings [5]. A sensitivity analysis demonstrated that the original study of 30 top nations could have been expanded to sixteen additional nations with IMRs worse than the US (for a total of 46 nations) and the linear regression analysis of IMR and number of vaccine doses would have remained statistically significant. The Miller and Goldman 2011 study using 2009 data was replicated using 2019 data. Linear regression analysis based on the US (which now ranked 44th based on IMR and continued to specify the most vaccine doses of any nation) and the 43 nations with improved IMRs, corroborated the positive correlation between number of vaccine doses and IMR.\n\nTable 1. Multiple analyses by Goldman and Miller affirm a positive correlation between number of vaccine doses and infant mortality rates\n\nThere is credible evidence and biological plausibility for an association between pediatric vaccines and infant deaths. Of the 2605 infant deaths reported to the Vaccine Adverse Event Reporting System (VAERS) from 1990 through 2019, 58% clustered within three days post-vaccination, and 78% occurred within seven days post-vaccination, confirming that infant deaths tend to occur in temporal proximity to vaccine administration [6]. The excess of deaths during these early post-vaccination periods was statistically significant (p < 0.00001). This study, and studies by Aaby et al. [7-9] (who discovered that vaccines have non-specific effects that can increase or decrease mortality from infectious diseases not targeted by the vaccine), provide additional evidence for an association between increased vaccine doses and higher rates of infant mortality.\n\nVaccine-related morbidity and mortality are more extensive than publicly acknowledged. In Third World nations, numerous studies indicate that DTP and inactivated polio (IPV) vaccines have an inverse safety profile, especially when administered out of sequence [8,9]. Multiple vaccines administered concurrently have also been shown to increase mortality. In all nations, a causal relationship between vaccines and sudden infant deaths is rarely acknowledged. Yet, physiological studies have provided biological plausibility by showing that infant vaccines can produce fever and inhibit the activity of 5-HT neurons in the medulla, causing prolonged apneas and interfering with auto-resuscitation [6].\n\nVaccines are not always safe and effective. This outcome may be partially due to the US granting pharmaceutical companies immunity from litigation arising from adverse vaccine reactions.\n\nMiller and Goldman conclude their recently published 2023 study [5] by reaffirming the main finding in their original 2011 study:\n\nThere is a positive correlation between infant vaccines and infant mortality rates. This relationship is most pronounced in analyses of the most highly developed homogenous nations but is attenuated in background noise in analyses of nations with heterogeneous socioeconomic variables. Health authorities in all nations have an obligation to determine whether their immunization schedules are achieving desired goals. More investigations into the health outcomes of vaccinated vs. unvaccinated populations and the effect of vaccinations on all-cause mortality are imperative.\n\n1. Miller NZ, Goldman GS. Infant mortality rates regressed against number of vaccine doses routinely given: Is there a biochemical or synergistic toxicity? Human & Expl Toxicol 2011 May 4;30(9):1420-28. doi:10.1177/0960327111407644 https://journals.sagepub.com/doi/10.1177/0960327111407644\n\n3. Seneff S, Nigh G, Kyriakopoulos AM, McCullough PA. Innate immune suppression by SARS-CoV-2 mRNA vaccinations: the role of G-quadruplexes, exosomes, and MicroRNAs. Food Chem Toxicol 2022 Jun; 164:113008. doi: 10.1016/j.fct.2022.113008 https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9012513/\n\n4. Goldman GS. Examples of outcome reporting bias in vaccine studies: Illustrating how perpetuating medical consensus can impede progress in public health. Cureus 20200 Sep 21; 14(9): e29399. doi:10.7759/cureus.29399 https://pubmed.ncbi.nlm.nih.gov/36304385/\n\n5. Goldman GS, Miller NZ. Affirming a positive correlation between number of vaccine doses and infant mortality rates: A response to critics. Cureus 2022 Feb 2; 15(2): e34566. doi:10.7759/cureus.34566 https://pubmed.ncbi.nlm.nih.gov/36751569/\n\n6. Miller NZ. Vaccines and sudden infant death: an analysis of the VAERS database 1990-2019 and review of the medical literature. Toxicol Rep 2021 Jun 24; 8:1324-35. doi: 10.1016/j.toxrep.2021.06.020. eCollection 2021 https://pubmed.ncbi.nlm.nih.gov/34258234/\n\n7. Aaby P, Ravn H, Benn CS, Rodrigues A, Samb B, Ibrahim SA, Libman MD, Whittle HC. Randomized trials comparing inactivated vaccine after medium- or high-titer measles vaccine with standard titer measles vaccine after inactivated vaccine: a meta-analysis. Pediatr Infect Dis J 2016 Nov; 35(11):1232-41. doi: 10.1097/INF.0000000000001300 https://pubmed.ncbi.nlm.nih.gov/27753769/\n\n8. Aaby P, Benn C, Nielsen J, Lisse IM, Rodrigues A, Ravn H. Testing the hypothesis that diphtheria-tetanus-pertussis vaccine has negative non-specific and sex-differential effects on child survival in high-mortality countries. BMJ Open 2012 May 22;2(3):e000707 doi: 10.1136/bmjopen-2011-000707 https://pubmed.ncbi.nlm.nih.gov/22619263/\n\n9. Mogensen SW, Andersen A, Rodrigues A, Benn CS, Aaby P. The introduction of diphtheria-tetanus-pertussis and oral polio vaccine among young infants in an urban African community: a natural experiment. EBioMedicine. 2017;17:192-8. doi: 10.1016/j.ebiom.2017.01.041 https://pubmed.ncbi.nlm.nih.gov/28188123/", "opengraph": {"description": "There exists a heated controversy as to whether COVID-19 vaccines and associated boosters are truly \"safe and effective\"", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/Positive_Correlation_Between_the_Number_of_Vaccine_Doses_and_Infant_Mortality-GreenMedInfo.jpg", "title": "Positive Correlation Between the Number of Vaccine Doses and Infant Mortality", "type": "article", "url": "https://greenmedinfo.com/blog/positive-correlation-between-number-vaccine-doses-and-infant-mortality"}, "tags": [], "tweets": [], "movies": [], "links": ["http://orthomolecular.org/resources/omns/v19n13.shtml", "/disease/coronavirus-disease", "/anti-therapeutic-action/vaccination-all", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref1", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref2", "https://acs.altmetric.com/details/406556", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref3", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref2", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref1", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref4", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref5", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref5", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref5", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref6", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref7", "/anti-therapeutic-action/vaccination-diphtheria-pertussis-tetanus", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref8", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref6", "http://orthomolecular.org/resources/omns/v19n13.shtml#Ref5", "https://physiciansforinformedconsent.org/", "https://journals.sagepub.com/doi/10.1177/0960327111407644", "https://www.medrxiv.org/content/10.1101/2021.09.03.21263082v4", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9012513/", "https://pubmed.ncbi.nlm.nih.gov/36304385/", "https://pubmed.ncbi.nlm.nih.gov/36751569/", "https://pubmed.ncbi.nlm.nih.gov/34258234/", "https://pubmed.ncbi.nlm.nih.gov/27753769/", "https://pubmed.ncbi.nlm.nih.gov/22619263/", "https://pubmed.ncbi.nlm.nih.gov/28188123/"], "authors": [], "publish_date": null}