{"result_id": "142007", "URL": "https://greenmedinfo.com/blog/31470-deaths-after-covid-vaccines-reported-vaers-including-26-following-new-boost", "timestamp": "2023-04-25 15:22:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/31470-deaths-after-covid-vaccines-reported-vaers-including-26-following-new-boost", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "31,470 Deaths After COVID Vaccines Reported to VAERS, Including 26 Following New Boosters", "cleaned_text": "VAERS data released Friday by the Centers for Disease Control and Prevention show 1,437,273 reports of adverse events from all age groups following COVID-19 vaccines, including 31,470 deaths and 261,738 serious injuries between Dec. 14, 2020, and Oct. 7, 2022\n\nThe Centers for Disease Control and Prevention (CDC) today released new data showing a total of 1,437,273 reports of adverse events following COVID-19 vaccines were submitted between Dec. 14, 2020, and Oct. 7, 2022, to the Vaccine Adverse Event Reporting System (VAERS).\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nThe data included a total of 31,470 reports of deaths and 261,738 serious injuries, including deaths, during the same time period.\n\nThere were a total of 3,232 reports of adverse events following the new bivalent booster COVID-19 vaccine as of Oct. 7, 2022. The data included a total of 26 deaths and 162 serious injuries.\n\nOf the 31,470 reported deaths, 20,125 cases are attributed to Pfizer's COVID-19 vaccine, 8,533 cases to Moderna, 2,735 cases to Johnson & Johnson (J&J) and no cases yet reported for Novavax.\n\nExcluding \"foreign reports\" to VAERS, 880,882 adverse events, including 14,790 deaths and 91,760 serious injuries, were reported in the U.S. between Dec. 14, 2020, and Oct. 7, 2022.\n\nForeign reports are reports foreign subsidiaries send to U.S. vaccine manufacturers. Under U.S. Food and Drug Administration (FDA) regulations, if a manufacturer is notified of a foreign case report that describes an event that is both serious and does not appear on the product's labeling, the manufacturer is required to submit the report to VAERS.\n\nOf the 14,790 deaths reported as of Oct. 7, 7% occurred within 24 hours of vaccination and 15% occurred within 48 hours of vaccination.\n\nIn the U.S., 619 million COVID-19 vaccine doses had been administered as of Oct. 6, including 370 million doses of Pfizer, 234 million doses of Moderna and 19 million doses of J&J.\n\nEvery Friday, VAERS publishes vaccine injury reports received as of a specified date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nHistorically, VAERS has been shown to report only 1% of actual vaccine adverse events.\n\nVAERS data from Dec. 14, 2020, to Oct. 7, 2022, for 6-month-olds to 5-year-olds show:\n• 4,279 adverse events, including 182 cases rated as serious and 7 reported deaths.\n• 5 reports narrowed case definition excludes cases ischemic strokes and deaths due to heart problems that occur before one has the chance to go to the emergency department.\n\nVAERS data from Dec. 14, 2020, to Oct. 7, 2022, for 5- to 11-year-olds show:\n• 14,622 adverse events, including 692 rated as serious and 29 reported deaths.\n\nVAERS data from Dec. 14, 2020, to Oct. 7, 2022, for 12- to 17-year-olds show:\n• 39,833 adverse events, including 4,335 rated as serious and 127 reported deaths.According to the CDC, \"VAERS data available to the public include only the initial report data to VAERS. Updated data which contains data from medical records and corrections reported during follow up are used by the government for analysis. However, for numerous reasons including data consistency, these amended data are not available to the public.\"\n• 269 reports of anaphylaxis among 12- to 17-year-olds where the reaction was life-threatening, required treatment or resulted in death.\n• 1,332 reports of myocarditis and pericarditis with 1,163 cases\n• 26 cases of postural orthostatic tachycardia syndrome (POTS) with all cases attributed to Pfizer's vaccine.\n\nVAERS data from Dec. 14, 2020, to Oct. 7, 2022, for all age groups combined, show:\n• 16% of deaths were related to cardiac disorders.\n• 53% of those who died were male were female and the remaining death reports did not include the gender of the deceased.\n• 16,463 cases of Bell's Palsy 22% to Moderna 5% to J&J\n• 10,078 reports of anaphylaxis where the reaction was life-threatening, required treatment or resulted in death.\n• 43,453 reports of blood-clotting disorders. Of those, 29,795 reports 9,791 reports 3,808 reports\n• 24,316 cases of myocarditis and pericarditis with 18,427 cases 5,435 cases 416 cases\n\nChildren's Health Defense (CHD) asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.\n\nFDA, CDC authorize new COVID boosters for kids as young as 5 with no data or independent review\n\nThe FDA on Wednesday amended the Emergency Use Authorizations (EUAs) for the new Pfizer and Moderna COVID-19 Omicron booster shots for children as young as 5 years old despite having no direct data on the safety or effectiveness of the shots in children.\n\nIn its announcement, the FDA said it relied on \"immune response and safety data\" using the original bivalent boosters in adults and data on the original bivalent boosters \"in pediatric age groups.\" The FDA did not specify the ages or numbers of children in those age groups.\n\nWithin hours, CDC director Dr. Rochelle Walensky signed off on the new boosters without convening the agency's independent panel of vaccine experts.\n\nPfizer said in an Oct. 12 press release it had started a clinical trial on the bivalent vaccine in children 6 months to 11 years of age but did not disclose the number of participants or when the trial would be completed. Pfizer told CNN doses will be shipped immediately.\n\nCommenting on the news, Brian Hooker, Ph.D., P.E., told The Defender, \"It is preposterous to vaccinate these children with untested boosters, especially when the risks of the COVID-19 virus are minimal in this population.\"\n\n\"Since the approval of mRNA vaccines for COVID-19 in the U.S., there have been 162 reported deaths attributed to these vaccines in individuals age 17 and under.\n\n\"Yet the mortality associated with the COVID-19 virus in this age group is less than one in 100,000 cases.\"\n\n\"It is time to stop this criminal experiment on America's children,\" Hooker said.\n\nA Pfizer executive said Monday that before Pfizer released its COVID-19 vaccine into the market, neither she nor other Pfizer officials knew whether the vaccine would prevent transmission because the drugmaker hadn't tested for it. Member of the European Parliament, Rob Roos, asked during a COVID-19 session:\n\n\"Was the Pfizer COVID vaccine tested on stopping the transmission of the virus before it entered the market? Did we know about stopping immunization before it entered the market?\"\n\n\"No … You know, we had to … really move at the speed of science to know what is taking place in the market.\"\n\nRoos, of the Netherlands, argued in a Twitter video following Small's comments that \"millions of people worldwide felt forced to get vaccinated because of the myth that ‘you do it for others,'\" Roos said. \"Now, this turned out to be a cheap lie\" and \"should be exposed,\" he added.\n\nThe FDA in a December 2020 news release said there was no data available to determine whether the vaccine would prevent transmission and for how long it would protect against transmission of the SARS-CoV-2 virus that causes COVID-19. Pfizer CEO Albert Bourla, around the same time, said his firm was \"not certain\" if those who receive its mRNA vaccine will be able to transmit COVID-19 to other people.\n\nFormer White House medical adviser Dr. Deborah Birx in June admitted there was evidence in December 2020 that individuals who received COVID-19 vaccines, including Pfizer's, could still transmit the virus.\n\nMen under 40 at high risk of cardiac-related death after mRNA vaccines\n\nFollowing a Florida Department of Health analysis to evaluate the safety of COVID-19 vaccines, Surgeon General Dr. Joseph A. Ladapo on Oct. 7 issued new guidance specifically recommended against administering mRNA COVID-19 vaccines to males ages 18 to 39.\n\nLadapo also suggested those with preexisting cardiac conditions, such as myocarditis and pericarditis, take \"particular caution\" when deciding whether to get vaccinated.\n\nThe statewide analysis of vaccinated Florida residents age 18 or older found an 84% increase in the relative incidence of cardiac-related deaths among males ages 18-39, within 28 days of mRNA vaccination. Non-mRNA vaccines were not associated with the increased risks.\n\nGiven the high level of global immunity to COVID-19, the benefit of vaccination with mRNA vaccines \"is likely outweighed by this abnormally high risk of cardiac-related death among men in this age group,\" the department said.\n\nIn the new guidance, Florida's health department said it also \"continues to stand by\" its guidance for pediatric COVID-19 vaccines it issued in March recommending against COVID-19 vaccination for healthy children and adolescents ages 5-17.\n\nIt now also recommends against COVID-19 vaccination among infants and children under 5.\n\nSteven A. Ordonia of Pensacola, Florida, was a police lieutenant and a U.S. Air Force veteran. But after receiving his Pfizer COVID-19 booster shot, the 62-year-old was forced to retire, is largely confined to his home and is unable to drive a car.\n\nIn an exclusive interview with The Defender, Ordonia explained how debilitating symptoms following his Pfizer booster brought him to the brink of suicide, before his daughter -- and participation in an online support group for vaccine injury victims -- helped him recover.\n\nIn March 2021, Ordonia received the single-dose Johnson & Johnson shot. According to him, there were no problems following this initial vaccination. But after he received the Pfizer \"booster\" in December 2021, Ordonia said he experienced \"major headaches, fever and chills.\"\n\nWithin 10 months, Ordonia said he had gone from a healthy 62-year-old to a crippled 62-year-old. Ordonia's doctors suggested his symptoms were stress-induced, and his primary care doctor prescribed anti-depressants.\n\nAccording to Ordonia, a therapist was the first medical practitioner who connected the symptoms he was experiencing with the COVID-19 vaccine, telling him that she was \"treating another person [with the] same timeline, same symptoms.\"\n\nOrdonia says he filed a report to VAERS and a claim with the Countermeasures Injury Compensation Program -- and will continue to speak out and seek justice.\n\nKaiser admits risk of getting COVID increases with each shot\n\nKaiser Permanente, which is both an insurance company and healthcare provider company may be starting to worry about the amount of excess illness it's seeing.\n\nIn a Kaiser preprint study published Oct. 1, 120,000 Kaiser enrollees were tested for COVID-19 during Omicron to see how well three vaccine doses worked.\n\nKaiser sequenced 16,418 positive COVID-19 samples to determine the Omicron subvariant with which the enrollees were infected.\n\nWhat it found was that in 4 of 5 Omicron subvariants, by 150 days (five months) post-shot, efficacy had fallen into negative territory, and Kaiser's thrice-vaccinated enrollees were more likely to get COVID-19 than the unvaccinated.\n\nAfter five months, people were more likely to get a case of Omicron BA.2, BA.2.12.1, BA.4 and BA.5 if they had been vaccinated.", "opengraph": {"description": "VAERS data released Friday by the Centers for Disease Control and Prevention show 1,437,273 reports of adverse events from all age groups following COVID-19 vaccines, including 31,470 deaths and 261,738 serious injuries between Dec. 14, 2020, and Oct. 7, 2022", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/31,470_Deaths_After_COVID_Vaccines_Reported_to_VAERS_Including_26_Following_New_Boosters-GreenMedInfo.jpg", "title": "31,470 Deaths After COVID Vaccines Reported to VAERS, Including 26 Following New Boosters", "type": "article", "url": "https://greenmedinfo.com/blog/31470-deaths-after-covid-vaccines-reported-vaers-including-26-following-new-boost"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/vaers-deaths-covid-vaccines-boosters/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://childrenshealthdefense.org/defender_category/covid/", "/anti-therapeutic-action/vaccination-all", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://medalerts.org/vaersdb/findfield.php?EVENTS=ON&PAGENO=57&VAX=COVID19-2", "/disease/coronavirus-disease", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19-2&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19-2&SERIOUS=ON", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXMAN=MODERNA&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXMAN=JANSSEN&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXMAN=NOVAVAX&DIED=Yes", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&SERIOUS=ON&STATE=NOTFR", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=ONS&EVENTS=ON&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&DIED=Yes&STATE=NOTFR", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://childrenshealthdefense.org/defender/autopsies-vaccinating-teens-covid-heartbreaking/", "https://childrenshealthdefense.org/defender/joseph-keating-autopsy-death-myocarditis-pfizer-covid-vaccine/", "https://www.stroke.org/en/about-stroke/types-of-stroke/ischemic-stroke-clots", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Seizure+%2810039906%29&VAX=COVID19&WhichAge=range&LOWAGE=.5&HIGHAGE=6", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX=COVID19&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+artery+thrombosis+%2810008092%29&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Pulmonary+venous+thrombosis+%2810037459%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX=COVID19&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Seizure+%2810039906%29&VAX=COVID19&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://wonder.cdc.gov/vaers.html", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Anaphylactic+reaction+%2810002198%29&SYMPTOMS%5b%5d=Anaphylactic+shock+%2810002199%29&SYMPTOMS%5b%5d=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS%5b%5d=Anaphylactoid+shock+%2810063119%29&SYMPTOMS%5b%5d=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS%5b%5d=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&SEX=Male", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&SEX=Female", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Abnormal+labour+%2810000153%29&SYMPTOMS%5b%5d=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS%5b%5d=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5b%5d=Abortion+%2810000210%29&SYMPTOMS%5b%5d=Abortion+complete+%2810061614%29&SYMPTOMS%5b%5d=Abortion+early+%2810052846%29&SYMPTOMS%5b%5d=Abortion+incomplete+%2810000217%29&SYMPTOMS%5b%5d=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5b%5d=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5b%5d=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5b%5d=Abortion+threatened+%2810000242%29&SYMPTOMS%5b%5d=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS%5b%5d=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5b%5d=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5b%5d=Foetal+damage+%2810016852%29&SYMPTOMS%5b%5d=Foetal+death+%2810055690%29&SYMPTOMS%5b%5d=Foetal+disorder+%2810061157%29&SYMPTOMS%5b%5d=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5b%5d=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS%5b%5d=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS%5b%5d=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5b%5d=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5b%5d=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5b%5d=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5b%5d=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5b%5d=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS%5b%5d=Placental+calcification+%2810082008%29&SYMPTOMS%5b%5d=Placental+disorder+%2810035132%29&SYMPTOMS%5b%5d=Placental+insufficiency+%2810035138%29&SYMPTOMS%5b%5d=Placental+necrosis+%2810035139%29&SYMPTOMS%5b%5d=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS%5b%5d=Placenta+praevia+%2810035119%29&SYMPTOMS%5b%5d=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS%5b%5d=Pregnancy+test+positive+%2810036575%29&SYMPTOMS%5b%5d=Premature+baby+%2810036590%29&SYMPTOMS%5b%5d=Premature+ba", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5b%5d=Abortion+%2810000210%29&SYMPTOMS%5b%5d=Abortion+complete+%2810061614%29&SYMPTOMS%5b%5d=Abortion+early+%2810052846%29&SYMPTOMS%5b%5d=Abortion+incomplete+%2810000217%29&SYMPTOMS%5b%5d=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5b%5d=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5b%5d=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5b%5d=Abortion+threatened+%2810000242%29&SYMPTOMS%5b%5d=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5b%5d=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5b%5d=Foetal+damage+%2810016852%29&SYMPTOMS%5b%5d=Foetal+death+%2810055690%29&SYMPTOMS%5b%5d=Foetal+disorder+%2810061157%29&SYMPTOMS%5b%5d=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5b%5d=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5b%5d=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5b%5d=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5b%5d=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS%5b%5d=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5b%5d=Foetal+hypokinesia+%2810068461%29&SYMPTOMS%5b%5d=Foetal+malformation+%2810060919%29&SYMPTOMS%5b%5d=Foetal+malpresentation+%2810058013%29&SYMPTOMS%5b%5d=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS%5b%5d=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5b%5d=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5b%5d=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS%5b%5d=Placental+disorder+%2810035132%29&SYMPTOMS%5b%5d=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS%5b%5d=Premature+baby+%2810036590%29&SYMPTOMS%5b%5d=Premature+baby+death+%2810076700%29&SYMPTOMS%5b%5d=Premature+delivery+%2810036595%29&SYMPTOMS%5b%5d=Premature+labour+%2810036600%29&SYMPTOMS%5b%5d=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS%5b%5d=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS%5b%5d=Preterm+premature+rupture+of+membranes+%2810073024%29&SYMPTOMS%5b%5d=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Bell%27s+palsy+%2810004223%29&SYMPTOMS%5b%5d=Facial+discomfort+%2810083537%29&SYMPTOMS%5b%5d=Facial+dysmorphism+%2810016045%29&SYMPTOMS%5b%5d=Facial+nerve+disorder+%2810061457%29&SYMPTOMS%5b%5d=Facial+neuralgia+%2810061594%29&SYMPTOMS%5b%5d=Facial+palsy+%2810016060%29&SYMPTOMS%5b%5d=Facial+paralysis+%2810016062%29&SYMPTOMS%5b%5d=Facial+paresis+%2810051267%29&SYMPTOMS%5b%5d=Facial+spasm+%2810063006%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Bell%27s+palsy+%2810004223%29&SYMPTOMS%5b%5d=Facial+discomfort+%2810083537%29&SYMPTOMS%5b%5d=Facial+dysmorphism+%2810016045%29&SYMPTOMS%5b%5d=Facial+nerve+disorder+%2810061457%29&SYMPTOMS%5b%5d=Facial+neuralgia+%2810061594%29&SYMPTOMS%5b%5d=Facial+palsy+%2810016060%29&SYMPTOMS%5b%5d=Facial+paralysis+%2810016062%29&SYMPTOMS%5b%5d=Facial+paresis+%2810051267%29&SYMPTOMS%5b%5d=Facial+spasm+%2810063006%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Bell%27s+palsy+%2810004223%29&SYMPTOMS%5b%5d=Facial+discomfort+%2810083537%29&SYMPTOMS%5b%5d=Facial+dysmorphism+%2810016045%29&SYMPTOMS%5b%5d=Facial+nerve+disorder+%2810061457%29&SYMPTOMS%5b%5d=Facial+neuralgia+%2810061594%29&SYMPTOMS%5b%5d=Facial+palsy+%2810016060%29&SYMPTOMS%5b%5d=Facial+paralysis+%2810016062%29&SYMPTOMS%5b%5d=Facial+paresis+%2810051267%29&SYMPTOMS%5b%5d=Facial+spasm+%2810063006%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=JANSSEN", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Anaphylactic+reaction+%2810002198%29&SYMPTOMS%5b%5d=Anaphylactic+shock+%2810002199%29&SYMPTOMS%5b%5d=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS%5b%5d=Anaphylactoid+shock+%2810063119%29&SYMPTOMS%5b%5d=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS%5b%5d=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Myocardial+infarction+%2810028596%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=MODERNA&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5b%5d=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5b%5d=Coagulopathy+%2810009802%29&SYMPTOMS%5b%5d=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5b%5d=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5b%5d=Embolism+%2810061169%29&SYMPTOMS%5b%5d=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5b%5d=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5b%5d=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5b%5d=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5b%5d=Myocardial+infarction+%2810028596%29&SYMPTOMS%5b%5d=Petechiae+%2810034754%29&SYMPTOMS%5b%5d=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5b%5d=Purpura+%2810037549%29&SYMPTOMS%5b%5d=Thrombocytopenia+%2810043554%29&SYMPTOMS%5b%5d=Thrombosis+%2810043607%29&SYMPTOMS%5b%5d=Vasculitis+%2810047115%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=JANSSEN&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=PFIZER/BIONTECH&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=MODERNA&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5b%5d=Myocarditis+%2810028606%29&SYMPTOMS%5b%5d=Pericarditis+%2810034484%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=JANSSEN&WhichAge=range&LOWAGE=&HIGHAGE=", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Creutzfeldt-Jakob+disease+%2810011384%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=JANSSEN", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Postural+orthostatic+tachycardia+syndrome+%2810063080%29&VAX%5b%5d=COVID19&VAX%5b%5d=COVID19-2&VAXMAN=JANSSEN", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://childrenshealthdefense.org/defender/fda-cdc-authorize-new-covid-boosters-young-children/", "https://childrenshealthdefense.org/defender/covid-boosters-no-human-trials/", "https://www.cnbc.com/2022/10/12/fda-authorizes-covid-omicron-booster-shots-for-kids.html", "https://childrenshealthdefense.org/defender/fda-cdc-authorize-new-covid-boosters-young-children/", "https://www.cnn.com/2022/10/12/health/fda-covid-boosters-children/index.html", "https://childrenshealthdefense.org/authors/brian-hooker-ph-d-p-e/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-never-tested-prevent-transmission-et/", "https://twitter.com/rob_roos/status/1579759795225198593", "https://twitter.com/Rob_Roos/status/1579759795225198593", "https://www.fda.gov/news-events/press-announcements/fda-takes-key-action-fight-against-covid-19-issuing-emergency-use-authorization-first-covid-19", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-never-tested-prevent-transmission-et/", "https://childrenshealthdefense.org/defender/men-cardiac-related-death-mrna-covid-vaccines-et/", "https://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-analysis.pdf?utm_medium=email&utm_source=govdelivery", "https://childrenshealthdefense.org/defender/young-males-heart-risk-pfizer-moderna-vaccines/", "https://childrenshealthdefense.org/defender_category/covid/", "https://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-doc.pdf?utm_medium=email&utm_source=govdelivery", "http://ww11.doh.state.fl.us/comm/_partners/covid19_report_archive/press-release-assets/g2-jtr_QWBT4hJpqr_20220308-1923.pdf", "https://childrenshealthdefense.org/defender/steven-ordonia-pfizer-covid-booster-vaccine-injuries/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/wp-content/uploads/steven-ordonia-covid-vaccination-record-card.jpg", "https://childrenshealthdefense.org/defender/government-covid-vaccine-injury-compensation/", "https://www.medrxiv.org/content/10.1101/2022.09.30.22280573v1", "https://childrenshealthdefense.org/defender/kaiser-risk-covid-vaccine/"], "authors": [], "publish_date": null}