{"result_id": "142024", "URL": "https://greenmedinfo.com/blog/final-brick-vaccine-efficacy-narrative", "timestamp": "2023-04-25 15:23:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/final-brick-vaccine-efficacy-narrative", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "The Final Brick in the Vaccine Efficacy Narrative", "cleaned_text": "Two key bricks seem to have already fallen from the COVID vaccines' narrative - the one about their fantastic efficacy against infections and the one about their superb safety. However, one stubborn narrative brick seems to stand still, leading many people to believe that the booster doses of the vaccines are capable of providing long-term protection against severe illness and deaths (despite their failure to protect against infections).\n\nBut is this brick really that strong? Does the existing scientific literature really support the notion that the two types of protection are independent from each other - that the protection against severe illness and deaths somehow remained high while the protection against infections disappeared?\n\nIn our new article at the Journal of American Physicians and Surgeons, Dr. Yaffa Shir-Raz, Dr. Shay Zakov, Dr. Peter McCullough, and myself aimed to answer these questions from a purely scientific point of view. We conducted a rigorous review of representative data from three types of sources: (1) the original clinical trials by Pfizer and Moderna, (2) the more contemporary studies on the fourth dose of the vaccine, and (3) the popular dashboards of pandemic statistics.\n\nIn this relatively short article (that echoes a video I prepared on this topic), I will not be able to present our entire findings. However, I do wish to give you a taste of our review using three examples, starting with the founding clinical trial by Pfizer.\n\nNumber of Deaths in the Clinical Trial by Pfizer\n\nOne might (falsely) assume that the key question I presented above was already answered in the Phase 3, Randomized Control Trial by Pfizer - the one that allowed the FDA to issue its emergency authorization to use the COVID vaccines [1].\n\nAfter all, Randomized Controlled Trials are considered to be the gold standard in biomedical research. Nevertheless, this key clinical trial did not really teach us anything about the ability of the vaccines to protect against severe illness and deaths. Specifically for the last, Pfizer reported that 6 months after the injections, there were no significant differences in the number of deaths from all causes between the group that received the vaccines and the control group that received the placebo [2].\n\nMoreover, during the open-label stage of their study, when the blind condition was terminated and the participants receiving the placebo could have chosen to be given the real vaccine, Pfizer evidenced five additional death cases and they all occurred among people who took the vaccine. In other words, in this key clinical trial, science did not support the idea that the vaccines protect against deaths. In fact, some might argue that science provided an important warning about these vaccines.\n\nWithout clear evidence from the formal clinical trials, we ought to turn to the less strong research designs that investigated the vaccines in real-life settings through observational, but not experimental measures. Of course, observational studies should be carefully interpreted because they are vulnerable to real-life biases, such as uneven testing levels in which unvaccinated people were forced to test for COVID-19 while vaccinated people were exempted from these tests [3-5].\n\nNevertheless, we decided to review all the observational studies that were conducted on the efficacy of the fourth dose and that were published at about the time the FDA authorized this second booster. You will not be surprised that these studies emerged from Israel-- \"the world's lab,\" as termed by Pfizer officials [6]. Israel was the first country to approve the administration of this second booster (even before the FDA's official authorization) and Israel was the first to examine the efficacy of this booster in real-life settings.\n\nThe observational study mentioned in the FDA's News Release\n\nThe first Israeli study I wish to bring here is mentioned in the FDA's News Release that reported on their authorization to start using the fourth dose of the vaccine [7]. In this News Release, the FDA stated, without a blink of an eye, that the fourth dose \"improves protection against severe COVID-19″ (bold added). How do they know? The only scientific reference they brought to support this straightforward claim was an Israeli study by Sheba Medical Center that did not yield good efficacy results. Aside from the fact that this study did not address severe illness directly, its authors concluded that their findings suggest that the second booster \"may have only marginal benefits\" [8]. These are their words, not mine.\n\nThe large observational study that claimed to demonstrate efficacy against severe illness\n\nSo what can be the evidence behind this FDA's straightforward statement about the efficacy against severe illness? The News Release, as mentioned before, does not bring additional efficacy studies to rely on, but we found another Israeli study, which was published a week after the FDA's authorization of the fourth dose [9]. In this large study, the authors reported that the fourth dose remained effective against severe illness six weeks from its administration, while its efficacy against infections started to drop in about the fifth week, to the point that by the eighth week, the efficacy against infections disappeared completely. To my knowledge, this was the first time that researchers reported results from which readers may deduce that the efficacy of the fourth dose against severe illness is above and beyond its efficacy against infections.\n\nTo explain this last statement and to evaluate its validity, I need to take a scientific step backward and talk about a fundamental research concept that is called conditional probability. Theoretically speaking, when studies find indications that a given vaccine is effective against infections, they also typically obtain reduced numbers of severe illness cases in their treatment groups, compared with their control groups. Consider, for example, a research scenario whereby 10 participants from the vaccine group were infected by the virus, compared with 100 participants from the control group.\n\nThese numbers can be interpreted as a good sign for high efficacy against infections. However, what if 1 out of the 10 infected participants from the vaccine group developed severe illness compared with 10 out of the 100 participants from the control group? In this scenario, the difference in raw numbers, 1 versus 10 severe illness cases, may sound impressive, but the truth is that these numbers are simply a byproduct of the vaccine's efficacy against infections, as both groups in this hypothetical study had 10 percent severe illness cases among the participants who got infected by the virus. But what will happen in cases in which the vaccine fails to protect against infections - like the situation we face today when the first brick of the narrative has already been destroyed? Will the protection against severe illness remain?\n\nThe only way to prove that the vaccines protect against severe illness beyond their efficacy against infections is to show that the conditional probability of severe illness in the vaccine group (that is, the percentage of severe illness among those participants who were infected) is significantly lower than the conditional probability of severe illness in the control group.\n\nNow that we understand this crucial concept of conditional probability, we can go back to investigate the details of this large study that claimed to demonstrate the vaccines' efficacy against severe illness. The first thing we need to know about this study is that, for some reason, the follow-up period of severe illness lasted up until the sixth week from vaccination, while the follow-up period of infections lasted two weeks longer up until the eighth week. This means that the major claim of this study is limited to an exceptionally narrow time window, starting from the fifth week when the efficacy against infections started to drop and ending at the sixth week when the monitoring of severe illness stopped.\n\nBut more importantly, even if we disregard this strong limitation, when my co-authors and I examined the data that were provided in the article, we discovered that the conditional probability of severe illness did not really differ between the treatment and the control groups of this study. About 1 percent from the infected participants, in both groups, developed severe illness.\n\nClearly, such results cannot be used to disprove the reasonable and straightforward assumption that the reduction in the vaccines' efficacy against infections from the fifth week onward was followed by an equivalent reduction in the vaccines' efficacy against severe illness and deaths - even if this reduction happened two weeks later, which is the average time that takes for the severe illness to develop from the first symptoms of the virus [10].\n\nUnfortunately, severe illness two weeks later, which is essentially in the seventh week, was not monitored in this study, not to mention the tenth week, which is really the most interesting time - as it reflects the period when the vaccines do not provide any protection against infections.\n\nIn conclusion, in this short article, I brought three examples that challenge the seemingly consensual notion that the booster doses are capable of providing long-term protection against severe illness and death. The three examples constitute, of course, only a small part of our full-length article and I urge you to review the entire evidence we bring in the Journal of American Physicians and Surgeons.\n\nPlease know that I am not arguing that our article can substitute for a comprehensive systematic review of all the available evidence. However, in scientific discourse, a single \"black swan\" as termed by Karl Popper - a single negative instance that does not fit in with the theory - may falsify a universal claim; and I promise you that our article portrays numerous such black swans that tear down this last brick of the vaccine efficacy narrative.\n\nTo our understanding of the literature, the medical narrative today that insists that the booster doses prevent severe illness and deaths despite their failure to protect against infections lacks scientific support. We therefore call for an impartial inquiry of the decision-making processes and the global health policies that were implemented during the COVID crisis, especially considering what we know today about the negative implications of these policies and the numerous risks of the vaccines.\n\nDo you appreciate our work here at GreeMedInfo.com? Consider we are a 100% reader-supported platform, without advertisements. This means that without your support, we wouldn't exist. Thankfully, there are 4 easy ways for you to help us stay alive and well:\n\n1) Become a member (for as low as 29 cents a day!)\n\n4) Make a larger contribution by emailing us at [email protected]\n\n1. Polack, F.P., et al., Safety and efficacy of the BNT162b2 mRNA Covid-19 vaccine. New England Journal of Medicine, 2020.\n\n2. Thomas, S.J., et al., Safety and Efficacy of the BNT162b2 mRNA Covid-19 Vaccine through 6 Months. New England Journal of Medicine, 2021. 385(19): p. 1761-1773.\n\n3. Levi, R. and A. Wohl, Concerns regarding the estimated efficiency of Pfizer's Covid-19 vaccine in two large-scale observational studies in Israel. 2021, The British Medical Journal (BMJ). Last retrieved on September 9, 2021, from: https://www.bmj.com/content/372/bmj.n567/rr-0.\n\n4. di Lego, V., M. Sánchez-Romero, and A. Prskawetz, The impact of COVID-19 vaccines on the Case Fatality Rate: The importance of monitoring breakthrough infections. International journal of infectious diseases : IJID : official publication of the International Society for Infectious Diseases, 2022: p. S1201-9712(22)00197-7.\n\n5. Haas, E.J., et al., Impact and effectiveness of mRNA BNT162b2 vaccine against SARS-CoV-2 infections and COVID-19 cases, hospitalisations, and deaths following a nationwide vaccination campaign in Israel: an observational study using national surveillance data. The Lancet, 2021. 397(10287): p. 1819-1829.\n\n6. Birnhack, M., Who Controls Covid-Related Medical Data? Copyright and Personal Data. IIC - International Review of Intellectual Property and Competition Law, 2021. 52(7): p. 821-824.\n\n7. FDA, Coronavirus (COVID-19) Update: FDA Authorizes Second Booster Dose of Two COVID-19 Vaccines for Older and Immunocompromised Individuals. 2022, U.S. Food and Drug Administration, News Release from: March 29, 2022. Last retrieved on March 30, 2022 from: https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and.\n\n8. Regev-Yochay, G., et al., Efficacy of a Fourth Dose of Covid-19 mRNA Vaccine against Omicron. New England Journal of Medicine, 2022.\n\n9. Bar-On, Y.M., et al., Protection by a Fourth Dose of BNT162b2 against Omicron in Israel. New England Journal of Medicine, 2022.\n\n10. Wang, W., J. Tang, and F. Wei, Updated understanding of the outbreak of 2019 novel coronavirus (2019-nCoV) in Wuhan, China. Journal of Medical Virology, 2020. 92(4): p. 441-447.", "opengraph": {"description": "Two key bricks seem to have already fallen from the COVID vaccines' narrative - the one about their fantastic efficacy against infections and the one about their superb safety", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/The_Final_Brick_in_the_Vaccine_Efficacy_Narrative-GreenMedInfo.jpg", "title": "The Final Brick in the Vaccine Efficacy Narrative", "type": "article", "url": "https://greenmedinfo.com/blog/final-brick-vaccine-efficacy-narrative"}, "tags": [], "tweets": [], "movies": [], "links": ["https://brownstone.org/articles/final-brick-vaccine-efficacy-narrative/", "/disease/coronavirus-disease", "https://www.jpands.org/vol28no1/ophir.pdf", "/anti-therapeutic-action/vaccination-all", "https://www.youtube.com/watch?v=ZbTwoTMBB6Q&t=246s", "https://www.jpands.org/vol28no1/ophir.pdf", "/membership", "/membership", "/donation/how-you-can-support-our-mission", "https://regenerateproject.com/", "/cdn-cgi/l/email-protection", "https://www.bmj.com/content/372/bmj.n567/rr-0", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and"], "authors": [], "publish_date": null}