{"result_id": "142035", "URL": "https://greenmedinfo.com/blog/leaked-dept-defense-document-reveals-evidence-widespread-vaccine-failure1", "timestamp": "2023-04-25 15:23:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.greenmedinfo.com/sites/default/files/wilderness_favicon_1.ico", "canonical": "https://greenmedinfo.com/blog/leaked-dept-defense-document-reveals-evidence-widespread-vaccine-failure1", "encoding": "utf-8"}, "image": null, "domain": "greenmedinfo.com", "title": "Leaked Dept. of Defense Document Reveals Evidence of Widespread VACCINE FAILURE", "cleaned_text": "A leaked Department of Defense document first reported on by attorney Tom Rentz reveals high rates of \"breakthrough\" infections (4% of which died) and hospitalizations within a cohort of 5.6 million Medicare beneficiaries all of whom were fully vaccinated.\n\nAn astounding PowerPoint document posted on the Humetrix company website, titled \"Waning Effect of COVID-19 Vaccines in 5.6M U.S. Study Cohort, Weekly Update 9/28/2021,\" stamped by the Department of Defense JOINT ARTIFICIAL INTELLIGENCE CENTER's Project Salus (an AI driven analytics platform named after the Roman goddess of safety and well-being), reveals that the COVID-19 vaccines are clearly not living up to their stated promises of being highly effective -- something that should be obvious to anyone watching the aggressive push to add regular \"boosters\" on top of a failing two-dose regimen.\n\nWithin a cohort of 5.6 million Medicare beneficiaries aged 65 and older who received two doses of the COVID-19 vaccines (2.7 million Pfizer and 2.9 million Moderna), there was still a cumulative breakthrough rate (i.e., vaccine failure rate) of 2.9%, along with a 21% hospitalization rate in \"breakthrough infections.\" Among breakthrough hospitalizations, 31% required ICU care, and there was a 4% death rate overall among \"breakthrough infections.\"\n\nThis data clearly proves that the official narrative claiming the vaccines are unequivocally \"effective,\" with no questions allowed to be asked, is patently false.\n\nOn first glance, it appears that the incontrovertible evidence of widespread vaccine failure described in this document are being driven by the so-called vaccine resistant \"delta variant,\" taking the focus off the clearly ineffective vaccines themselves, and perhaps setting the public up for endless \"boosters.\" But there is another possibility which you will not hear discussed elsewhere but is worth considering...\n\nIt is quite possible that the tremendous side effects known to be caused by these experimental mRNA vaccines are being knowingly or unknowingly misidentified, misclassified or otherwise relabeled as \"breakthrough infections,\" generating the illusion that a new or old variant of a novel coronavirus is responsible for the symptoms caused by the vaccines' side effects; side effects that, as of yet, neither world governments, the global media nor the medical industrial establishment will acknowledge even exist, despite overwhelming evidence from government databases such as the Vaccine Adverse Event Reporting System (VAERS) or Vigibase that this vaccine (arguably more a gene therapy than a vaccine) is causing unprecedented harms and deaths among those who take them and who have been deprived of any semblance of informed consent, a mandatory medical ethical principle.\n\nAccording to slide 7 of 17, titled \"Total & Breakthrough Cases in the 65 Years and Older Salus Cohort,\" in the 65 and older population where the fully vaccinated rate is 80% \"an estimated 71% of COVID-19 cases occurred in fully vaccinated individuals.\"\n\nThere are a number of ways to interpret this data. Either the vaccines do not work in the majority of those who receive them, or, worse, they suppress innate immunity against COVID-19 or any of its supposed variants, or, as I refer to above, the vaccines' adverse events (which include classical symptoms of influenza-like illness and/or those attributed to COVID-19) are being misidentified and miscategorized as new \"breakthrough\" cases or the \"delta variant.\"\n\nThis latter explanation becomes all the more plausible when you consider that the \"gold standard\" tool for identifying COVID-19 cases are PCR test, which are not capable of diagnosing replication-competent viruses or viral infections. Kari Mullis, the technology's inventor himself, made this clear. You can learn more about Mullis' views, work and the problem with PCR tests here.\n\nThe Underlying Reason Why the Vaccines Are Failing?\n\nAs a quick aside, I think it is important to explain that when a cell is damaged, it releases nucleic acids (e.g., apoptotic bodies, necrotic bodies, exosomes), some of which end up in the plasma and can be mistaken as exogenous viral sequences by a PCR test.\n\nVaccines can cause profound damage to the integrity of the cell, which generates the illusion of an elevated \"viral load,\" when, in fact, the markers for elevated exogenous or \"foreign\" nucleic acids are coming from the body's natural responses (i.e., attempts to survive and heal) to the exogenous and xenobiotic toxicants and/or autoimmune generating effects of the vaccinations themselves.\n\nWhile this slide kit does not address this possibility, it may help explain the underlying reason why the vaccines are clearly failing (as well as the unprecedented signals of harm associated with them) without falling prey to the \"escape variant\" or \"delta variant\" narrative, which is being used to argue for boosters, further pharmaceutical drug intervention and, ultimately, to further consolidate and weaponize the narrative that there is an extremely dangerous set of viruses out there that require unconstitutional executive orders to completely suspend our basic human, civil and constitutionally backed rights.\n\nSlide 8 of 17, titled \"Is mRNA Vaccine Effectiveness Against Delta Infection Waning Over Time in 65 Years and Older Salus Cohort?,\" details how \"Breakthrough infection rates 5-6 months post vaccination are twice as high as 3-4 months post vaccination.\" In other words, the longer the duration after vaccination the weaker their immunity and poorer their health becomes.\n\nThis, for me, is an indication that the mRNA technology is creating an overall downward trend in the recipient's health, which is an explanation consistent with the alarming signals of harm associated with the vaccines, as evidenced by multiple government database sources, such as the U.S. government's VAERS and the World Health Organization's VigiBase. A recent estimate by Steve Kirsch presented at an FDA hearing proposes that about 200,000 Americans have died from COVID-19 vaccines thus far. Watch his presentation here.\n\nIn slide 12 of 17, titled \"Total & Breakthrough Hospitalizations in the 65 Years and Older Cohort,\" the slide proposes, \"As Delta variant surged to over 50% in June, COVID-19 hospitalizations more than doubled, reversing the prior trend of decreasing hospitalizations since April.\"\n\nOnce again, this explanation is suspect given that there is little to no evidence that a Delta variant is driving hospitalizations, whereas we know that the hundreds of adverse events listed in the VAERS database related to the vaccines' effects can indeed be life-threatening and do drive people to the hospital, despite the fact that as few as 1% of these events are reported by hospitals to the government.1\n\n\n\n This Tennessean article is one of many investigative reports that have concluded a Delta variant test does not exist yet for the public.\n\nThe U.S. Centers for Disease Control and Prevention admits that it only does about 700 Delta variant tests per week, and this is assuming we can trust them to tell the public the truth -- see the proposed Federal Grand Jury investigation of the CDC for violating federal law by hyperinflating COVID-19 death stats here). The CDC then extrapolated the data to \"estimate\" what it says is affecting the public at large, which the media promulgates as unquestionable truth. And so, one could rightfully interpret their statement, \"As Delta variant surged to over 50% in June ... ,\" to mean, \"As Vaccine Adverse Events surged ... in June.\"\n\nThe slide also states, \"In this 80% vaccinated 65+ population, an estimated 60% of COVID-19 hospitalizations occurred in fully vaccinated individuals in the week ending August 7th.\"\n\nAgain, this could mean that the COVID-19 vaccines caused hospitalizations that were wrongly attributed to COVID-19 and/or its \"variants,\" because we know that all it requires for someone to be labeled a COVID-19 case, or even to be pronounced dead by a coroner or medical examiner \"by COVID-19,\" is suspicion of infection, thanks to the WHO changing the ICD emergency use codes early in 2020, and the CDC following suit and doing the same in March 2020.\n\nWe also know that the medical industry, the government and the media are actively censoring and suppressing any link between the vaccines and the hundreds of known serious side effects associated with them, making it virtually impossible for official accounts of vaccine reactions to be openly linked back to the vaccines, much less discussed. It's much easier to blame \"COVID-19\" or \"the Delta variant.\"\n\nSlide 17 of 17, titled \"Risk Model for Breakthrough Hospitalization,\" contains two important observations:\n• \"Risk of breakthrough hospitalization increases with time elapsed since mRNA vaccination with odds ratio increasing to 2.5 at 6 months post vaccination.\" Is it the \"breakthrough\" virus or viruses driving these hospitalizations or the vaccines' many known side effects? This is the important question that the slide kit creators do not ask.\n• \"Prior COVID-19 infection has a major protective effective against breakthrough infection.\" In other words, NATURAL IMMUNITY protects against going to the hospital even among those already vaccinated. Phrased differently: contracting COVID-19 (or what might be mistakeningly labeled COVID-19 but is actually influenza-like illness) and surviving it is the best protection against hospitalization, confirming what we already know and believe as natural health advocates.\n\nThis remarkable document should be shared widely. Considering the widespread censorship of information like this, we hope that you will continue to be brave with us and get the word out.\n\nDocuments like these come directly from the government and cannot be easily written off as conspiracy theory. The more people who wake up to the fact that the vaccines do not work as advertised and are not nearly as safe as we are told, the greater chance we have of preserving our right to informed choice when it comes to our bodies.\n\nDon't forget to join the Stand for Health Freedom digital advocacy portal and sign up on the waiting list for the upcoming release of our FREE SPEECH platform here. If you like what we do, pleaes consider becoming a member or making a one time donation.\n\nNew to the Greenmedinfo.com newsletter? Get free access here. Follow us on social media via our Telegram feed here.", "opengraph": {"description": "A leaked Department of Defense document first reported on by attorney Tom Rentz reveals high rates of \"breakthrough\" infections (4% of which died) and hospitalizations within a cohort of 5.6 million Medicare beneficiaries all of whom were fully vaccinated. ", "image": "//cdn.greenmedinfo.com/sites/default/files/imagecache/ogimage/blog/Screen%20Shot%202021-10-05%20at%2012.53.51%20PM.png", "title": "Leaked Dept. of Defense Document Reveals Evidence of Widespread VACCINE FAILURE", "type": "article", "url": "https://greenmedinfo.com/blog/leaked-dept-defense-document-reveals-evidence-widespread-vaccine-failure1"}, "tags": [], "tweets": [], "movies": [], "links": ["/greenmedinfocom-re-post-guidelines", "https://www.scribd.com/document/530082359/Salus-Humetrix-VE-Study-2021-09-28a-1", "https://renz-law.com/attorney-tom-renz-discovers-leaked-dod-covid-files/", "https://www.humetrix.com/powerpoint-vaccine.html", "https://www.defense.gov/News/News-Stories/Article/Article/2269200/where-it-counts-us-leads-in-artificial-intelligence/", "/blog/nearly-15000-deaths-more-700000-injuries-reported-vaers-december-2020-rollout-cov", "/node/245895", "/node/245895", "/blog/was-covid-19-test-meant-detect-virus", "https://www.scribd.com/document/530082359/Salus-Humetrix-VE-Study-2021-09-28a-1", "/blog/nearly-15000-deaths-more-700000-injuries-reported-vaers-december-2020-rollout-cov", "/node/245895", "https://besovereign.com/greenmedinfo/greenmedinfo-open-access?recording_id=90", "https://www.scribd.com/document/530082359/Salus-Humetrix-VE-Study-2021-09-28a-1", "https://www.tennessean.com/story/news/local/coronavirus/2021/08/03/delta-variant-how-to-detect-covid-test/5467009001/", "https://www.tampabay.com/news/health/2021/08/02/tracking-delta-variant-in-covid-cases-how-does-cdc-diagnose-virus-strain/", "https://standforhealthfreedom.com/cdc-investigation/", "/blog/who-announces-suspected-cases-covid-19-should-be-written-covid-19-deaths-no-virus-2", "https://stream.greenmedinfo.com/video/153/sayer-ji-interviews-joy-m.-fritz-on-the-cdc-controversies-with-covid-death-statistics-reporting?channelName=5ea5e05b3851e", "https://www.scribd.com/document/530082359/Salus-Humetrix-VE-Study-2021-09-28a-1", "https://www.standforhealthfreedom.com", "https://besovereign.mykajabi.com/be-sovereign-waitlist", "/membership", "/donation/how-you-can-support-our-mission", "/newsletter", "https://t.me/sayeregengmi", "https://openvaers.com/images/r18hs017045-lazarus-final-report-20116.pdf"], "authors": [], "publish_date": null}