{"result_id": "143048", "URL": "https://www.greenpeace.org/international/story/58111/building-ukraine-resilience-green-reconstruction-horenka-hospital/", "timestamp": "2023-04-25 15:25:54 CEST+0200", "meta": {"description": "Greenpeace CEE is working together with environmental organisations and local authorities in Ukraine to rebuild the country sustainably. After 11 months of war, a hospital near Kyiv crippled by Russian shelling has been reconstructed with a heat pump and solar power system.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/international/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/international/story/58111/building-ukraine-resilience-green-reconstruction-horenka-hospital/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Building Ukrainian resilience: the green reconstruction of Horenka hospital", "cleaned_text": "Greenpeace Central and Eastern Europe (CEE) is working together with environmental organisations and local authorities in Ukraine to rebuild the country sustainably. After 11 months of war, a hospital near Kyiv crippled by Russian shelling has been reconstructed with a heat pump and solar power system, boosting the building’s energy independence, the community’s resilience, and reducing the country’s CO emissions.\n\nThe explosions began in Horenka on the morning of 24 February. So it was, on the first day of the war, that locals learned Russian troops were invading. The air raid warning did not work, and locals spent hours, and then days, in the basements of their houses. In neighbouring Hostomel, there was an attack on the military airfield and Russian troops got very close to the village. The invading forces failed to occupy Horenka, but more than a hundred local residents were killed by their attacks and thousands were forced to flee their homes.\n\nLocal doctor Olena Opanasenko told us that the hospital in Horenka continued to function despite the full-scale war unfolding outside. “I, with another doctor, was at the hospital. We were trying to treat people and give vaccinations,” she recalls. “It was 25 February 2022 when the electricity of the hospital was disconnected and it wasn’t reconnected until May.” A Russian shell hit the ground outside the clinic, blowing the windows out and damaging the front of the building. The lack of electricity supply during cold weather caused the hospital’s heating system to fail, making the hospital’s operation even more challenging as winter closed in.\n\nThe cold weather damaged the heating system. Clinic employees had to remove part of the heating system with their own hands so that at least part of the premises could have heating. But with winter approaching, it was clear that the heating system needed to be reconstructed. Greenpeace CEE and Ukrainian organisations Ecoaction, Ecoclub and the charity foundation Victory of Ukraine launched a project to install a heat pump and solar power system in the hospital. This was completed by February 2023: the hospital now has a modern heating system and the whole building can be heated and used again for doctors’ appointments, even during blackouts, thanks to the solar panels.\n\nGreenpeace CEE believes Horenka hospital sets an example for the green reconstruction of Ukraine. “When it comes to the long-term perspective, we must consider modern energy-efficient technologies that not only save money but also reduce CO emissions and our negative impact on the environment. We do not want the recovery money allocated by the international partners for the reconstruction to be spent on inefficient old technologies that will continue to bury the country in energy dependence and increase CO emissions even further,” says Greenpeace CEE campaigner Denys Tsutsaiev.\n\nThe project also demonstrates how much money can be saved if damaged facilities are restored to sustainable standards. According to preliminary estimates, Horenka hospital will reduce heating costs by 80% and the hybrid solar station could cover up to 60% of the building’s energy consumption per year.\n\nThe work at Horenka hospital also gave us the chance to test and explore the best ways to deliver other similar green reconstruction projects. Here the most energy-efficient solution was a heat pump, one of the most environmentally friendly means of heating, and a hybrid solar power system. Vertical depth probes were lowered into prepared wells 65 metres deep for the pump to take heat energy from the ground to heat the hospital.\n\nTo ensure that the pump works even during power cuts, a hybrid solar power system was installed in the outpatient clinic. The clinic will keep the old gas system as a backup, but over time, the solar installation can be expanded to provide 100% of the hospital’s electricity, making it fully energy-independent. We and all our partner environmental organisations in Ukraine are convinced that the future is in modern green technologies that enable communities to meet their own needs, reduce CO emissions and save money.\n\nThe cost of reconstructing the heating system in Horenka was about € 56 000, which will be made back in full in six or seven years, thanks to the energy savings.\n\nSerhiy Regeda, director of local foundation Victory of Ukraine lamented that there is not enough money in the budget for such reconstructions as she was showing us more damaged infrastructure in the village.\n\n“Our aim is to find partner cities in Europe that will be ready to help local Ukrainian communities in green reconstruction. To do this, we have prepared detailed calculations to help implement similar projects faster and will be ready to help local authorities to design sustainable projects.” Denys Tsutsaiev added.\n\nThis small hospital in Horenka is one of the thousands that were destroyed in the war. Right after the cities were liberated, a lot of Ukrainians went back home and started rebuilding what was destroyed. People reconstruct their homes, schools, hospitals and build new infrastructure. The critical principles of such reconstruction should be “Build Back Better” with the latest green technologies – do not rebuild the old, outdated system of the Soviet Union. The sustainable reconstruction of Horenka hospital shows what green reconstruction is possible even during war. This project and similar ones to come are investments into our common European future that must be in green energy solutions.\n\nKateryna Bystrytska is a member of the ‘Green Reconstruction of Ukraine’ project\n\n\n\nThe project was initiated by Greenpeace CEE within the framework of the ‘Partnership for Green Recovery of Ukraine’ project and is being implemented in cooperation with Ecoaction, Ecoclub Rivne and Victory of Ukraine with the assistance of the Gostomel Settlement Military Administration and the Gostomel Primary Health Care Center", "opengraph": {"title": "Building Ukrainian resilience: the green reconstruction of Horenka hospital - Greenpeace International", "type": "article", "url": "https://www.greenpeace.org/international/story/58111/building-ukraine-resilience-green-reconstruction-horenka-hospital", "description": "Greenpeace CEE is working together with environmental organisations and local authorities in Ukraine to rebuild the country sustainably. After 11 months of war, a hospital near Kyiv crippled by Russian shelling has been reconstructed with a heat pump and solar power system.", "image": "https://www.greenpeace.org/static/planet4-international-stateless/2023/02/78a6a027-gp0stv6a6_web_size.jpg", "image:width": "800", "image:height": "534", "site_name": "Greenpeace International"}, "tags": ["# Energy Revolution", "# Peace"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "8 February 2023"}