{"result_id": "143033", "URL": "https://www.greenpeace.org/aotearoa/press-release/climate-commission-final-report-more-concerned-about-placating-dairy-industry-than-tackling-climate-crisis/", "timestamp": "2023-04-25 15:25:34 CEST+0200", "meta": {"description": "Greenpeace says there is still a cow-shaped hole in both the Climate Change Commission’s advice and the Government’s approach to climate action, following the release of the Commission’s finalised climate&hellip;", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/aotearoa/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/aotearoa/press-release/climate-commission-final-report-more-concerned-about-placating-dairy-industry-than-tackling-climate-crisis/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Climate Commission final report more concerned about placating dairy industry than tackling climate crisis", "cleaned_text": "Greenpeace says there is still a cow-shaped hole in both the Climate Change Commission’s advice and the Government’s approach to climate action, following the release of the Commission’s finalised climate plan.\n\nThe report sets out climate action recommendations for the Government, and comes after a consultation period which saw thousands of people making submissions calling for more ambitious climate action.\n\nGreenpeace climate change campaigner Amanda Larsson says the Commission’s final report has ignored New Zealanders by continuing to give a free pass to the country’s biggest climate polluter: intensive dairying.\n\n“The Climate Change Commission’s final plan seems more anxious about placating big dairy than doing what is scientifically necessary to avert the climate crisis,” says Larsson.\n\nSince the draft climate plan was released earlier this year, a major United Nations study has shown the importance of cutting methane emissions in the short-term in order to tackle the climate crisis.\n\nThe United Nations says the world must cut methane emissions by 40% to 45% by 2030 to avoid the worst effects of the climate crisis. This compares to the Commission’s budget, which reduces methane by just 16% by 2035.\n\n“New Zealand has the world’s highest methane emissions per person, largely thanks to those six million dairy cows. The Commission’s goal of a 16% reduction in methane is not only insufficient, it’s unlikely to succeed because it relies on voluntary measures and future techno-fixes, like the fabled methane vaccine,” says Larsson.\n\n“Intensive dairying is to New Zealand what coal is to Australia and tar sands are to Canada. If this Government is serious about tackling the climate crisis, it must do what we already know will cut climate pollution from intensive dairying: phase out synthetic nitrogen fertiliser, substantially reduce stocking rates, and support farmers to shift to regenerative organic farming,” says Larsson.\n\n“The Commission is completely missing the opportunity for a thriving countryside with vibrant rural communities and plenty of jobs, which is restoring nature, protecting the climate and looking after people’s health.”\n\nLarsson was pleased to see the Commission at least acknowledge the role of the world’s ocean in preventing climate change, but was disappointed that this recognition wasn’t matched with any recommended actions.\n\n“The ocean is our biggest ally in the fight against the climate crisis, having already taken up a third of global emissions. If we’re to pass on a stable climate to our children, we must preserve the ocean’s ability to continue its essential role in absorbing carbon,” says Larsson.\n\n“That means increasing ocean protections and regulating destructive fishing practices like bottom trawling, as recommended by the Intergovernmental Panel on Climate Change.”\n\nLarsson says the process of developing the Government’s climate plan has been agonisingly slow for all New Zealanders concerned about the climate crisis.\n\n“We’re now almost four years into a Government that once said tackling the climate crisis was a priority, and yet here we are, only now settling on a list of recommendations,” says Larsson.\n\n“We can talk about recommendations until the cows come home, but until the Government gets to work and cuts climate pollution from those cows, we’re leaving ourselves and our future generations exposed to more frequent and intense droughts, floods, storms and fires that the climate crisis will bring.”\n\n“The real test of this report is not what the recommendations are, but what the action is. The Government’s response, due in November, must not be yet another excuse for yet another year’s delay in doing what we’ve known we need to do for 30 years already.”", "opengraph": {"title": "Climate Commission final report more concerned about placating dairy industry than tackling climate crisis - Greenpeace Aotearoa", "type": "article", "url": "https://www.greenpeace.org/aotearoa/press-release/climate-commission-final-report-more-concerned-about-placating-dairy-industry-than-tackling-climate-crisis", "description": "Greenpeace says there is still a cow-shaped hole in both the Climate Change Commission’s advice and the Government’s approach to climate action, following the release of the Commission’s finalised climate&hellip;", "image": "https://www.greenpeace.org/static/planet4-aotearoa-stateless/2021/06/e3cbbda9-istock-540374954-scaled.jpg", "image:width": "2560", "image:height": "1696", "site_name": "Greenpeace Aotearoa"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.climatecommission.govt.nz/our-work/advice-to-government-topic/inaia-tonu-nei-a-low-emissions-future-for-aotearoa/", "https://www.ccacoalition.org/en/resources/global-methane-assessment-full-report", "https://www.greenpeace.org/aotearoa/petition/petition-cut-climate-emissions-from-big-dairy/", "https://www.greenpeace.org/aotearoa/petition/petition-cut-climate-emissions-from-big-dairy/", "https://www.greenpeace.org/aotearoa/petition/petition-cut-climate-emissions-from-big-dairy/"], "authors": [], "publish_date": "9 June 2021"}