{"result_id": "143040", "URL": "https://www.greenpeace.org/usa/how-att-funds-right-wing-extremism-and-six-more-scary-things-you-need-to-know-about-the-company/", "timestamp": "2023-04-25 15:25:43 CEST+0200", "meta": {"description": "This year we've seen an unprecedented amount of attacks on our democracy — it's time for us to push back on the corporations behind it.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/usa/wp-content/themes/greenpeace/img/favicon.png", "canonical": "https://www.greenpeace.org/usa/how-att-funds-right-wing-extremism-and-six-more-scary-things-you-need-to-know-about-the-company/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "How AT&T Funds Right Wing Extremism and Six More Scary Things You Need to Know About the Company", "cleaned_text": "How AT&T Funds Right Wing Extremism and Six More Scary Things You Need to Know About the Company\n\nThis year we've seen an unprecedented amount of attacks on our democracy — it's time for us to push back on the corporations behind it.\n\nGreenpeace US activists demand AT&T (an American multinational conglomerate holding company) not wreck our democracy by funding racist voter suppression. The activists pass out flyers calling on AT&T to stop funding extremist politicians who sponsor racist voter suppression bills. Two activists are dressed in cell phone costumes playing an AT&T video.\n\nHalloween is the one day of the year when people can hide behind masks to make them look scarier than they actually are. But when it comes to companies like AT&T, it’s sometimes the opposite: Things can look a lot more frightening when you take a closer look.\n\nA recent investigation revealed that AT&T helped establish and fund OANN, the extremist cable outlet that pushes conspiracy theories and misinformation about the election and public health topics like vaccine safety. OANN hosts regularly interview infamous climate deniers to talk about “so-called climate change” and disparage activists and policymakers working for a clean energy future.\n\nAfter learning about AT&T’s connection to OANN, NAACP President Derrick Johnson stated that in doing so it had ”caused irreparable damage to our democracy.” It’s easy to see how: OANN has also spread lies about voting rights legislation such as the For The People Act (H.R. 1), suggesting it would “enshrine voter fraud and give democrats total control over all elections across the nation.” The bill would establish national voter protection standards that level the playing field for all political parties and protect voters – especially voters of color who have been the targets of voter suppression laws passed in numerous states.\n\nOANN hosts have also urged listeners to boycott “woke corporations” for objecting to such laws. It’s no surprise that they didn’t name AT&T.\n\nAmidst the outrage surrounding the passage of Georgia’s infamous anti-voter law, AT&T issued a statement claiming to “believe the right to vote is sacred and we support voting laws that make it easier for more Americans to vote in free, fair and secure elections.”\n\nThe company’s campaign contributions tell a different, more frightening story.\n\nAs the saying goes, states are the “laboratories of democracy,” giving life to innovative new forms of legislation. Yet in AT&T’s case, the company has been acting like Dr. Frankenstein, contributing lots of money to the lawmakers responsible for the monstrous growth of new voter suppression laws passed in Georgia and other states.\n\nIn Texas, where the company is headquartered, AT&T gave a $100,000 contribution to Texas Governor Greg Abbott on the same day that Abbott called for a special legislative session to pass Texas’ one of the most draconian voter suppression bills in the country.\n\nAT&T is also a board member of the US Chamber of Commerce, which has a long history of supporting gerrymandering and opposing restrictions on dark money campaign contributions. The Chamber has lobbied hard against the For the People Act (H.R. 1), which the Brennan Center calls “the greatest civil rights bill since the civil rights movement itself.”\n\nAfter the January 6 riot at the U.S. Capitol, AT&T pledged to suspend making contributions to all 147 Republicans who rejected the 2020 election results. That promise was short-lived. By August disclosures revealed that AT&T had abandoned its pledge and donated $15,000 each to the National Republican Congressional Committee (NRCC) and National Republican Senatorial Committee (NRSC), which will support the reelection of Republican objectors running for reelection.\n\n4. Smothering The Right to Protest\n\nAs part of a protest outside AT&T’s flagship Washington, DC store in September, Greenpeace USA arranged to have a video shown on a billboard near the store. The video was abruptly taken down and replaced with AT&T ads that urged viewers to “stand for equality.”\n\nWe don’t know who pressured the billboard company to withdraw our video, but we have a hunch.\n\nAfter supporting politicians passing laws to squash public protests, AT&T declared on the anniversary of George Floyd’s murder that it would “continue to work with the people and organizations that share our goals and our vision for a society that holds space for everyone to thrive.”\n\nIf corporations are people, then we know one company that’s looking a lot like Dr. Jekyl and Mr. Hyde.\n\nMany people learned how dependent we are on the internet during the pandemic, when they had to work or attend classes from home. But that was nearly impossible for the 6 percent to 12 percent of Americans — particularly poor people of color in both rural and urban areas — who don’t have high-speed access to the internet, or the service is too expensive to afford.\n\nAs the Center for American Progress explains, this is in part due to poor regulations and a monopolistic industry that has refused to extend affordable, high-quality services without a higher profit margin. Connect Your Community found that AT&T “systematically discriminated” against lower-income Cleveland neighborhoods in its deployment of home Internet and video technologies over the past decade,” a track record it described as “digital redlining.”\n\nCities like Chattanooga, Tennessee have begun to offer their own municipal broadband services, an idea that is hugely popular. Yet AT&T and other companies have lobbied for statewide laws prohibiting them from doing so. “AT&T is the villain,” a Tennessee Republican state senator told one reporter when describing the situation back in 2016.\n\nEarlier this year Biden proposed prioritizing support for “broadband networks owned, operated by, or affiliated with local governments, non-profits, and co-operatives” as part of the infrastructure, in part by nullifying those state restrictions. But after hordes of corporate lobbyists descended on the Hill “the corporate dominance that has been an impediment to progress” emerged unscathed.\n\nCommunity groups and nonprofits (including Greenpeace USA) often use person-to-person (P2P) text messaging to organize their supporters and provide timely information about vital social services, pending legislation, or where to vote.\n\nUnfortunately, in the name of protecting customers from spam, AT&T and other wireless carriers are creating new rules that threaten to chill civic engagement, voter participation and effective organizing.\n\nAs they roll this program out, Greenpeace and other groups will be watching closely.\n\nAT&T’s concern for protecting its customers doesn’t seem to equally apply to other ways it conducts business. For example, AT&T reportedly sells its customers’ data to third parties that use the information for targeted advertising.\n\nAT&T was given high marks for protecting its customers’ privacy from the government until it was revealed that the company has been one of the NSA’s “most trusted partners,” hosting “wiretap rooms” in eight cities where the NSA skimmed data as it passed through their networking equipment.\n\nThe Daily Beast reported that AT&T had been collecting and selling huge databases of consumer data to law enforcement agencies without a warrant and collecting millions in taxpayer money.\n\nWhat Can Be Done to Expose AT&T?\n\nAdd your name to expose AT&T. Tell its executives they must choose between supporting real democracy or forever being on the wrong side of history.\n\n sign now", "opengraph": {"url": "https://www.greenpeace.org/usa/how-att-funds-right-wing-extremism-and-six-more-scary-things-you-need-to-know-about-the-company/", "title": "How AT&T Funds Right Wing Extremism and Six More Scary Things You Need to Know About the Company", "type": "article", "description": "Halloween is the one day of the year when people can hide behind masks to make them look scarier than they actually are. But when it comes to companies like AT&T, it’s sometimes the opposite: Things can look a lot more frightening when you take a closer look. 1. Climate Denial and Democracy Disinformation One …", "image": "https://www.greenpeace.org/usa/wp-content/uploads/2021/10/ATT_Hero_900x600.jpg", "locale": "en_US", "site_name": "Greenpeace USA", "article:section": "News", "article:published_time": "2021-10-27T03:17:32-04:00", "article:modified_time": "2022-12-05T17:58:23-05:00", "updated_time": "2022-12-05T17:58:23-05:00"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">One America News host and CEO ask viewers to reach out to AT&amp;T and thank them for their support <a href=\"https://t.co/YWxg74ZiPX\">https://t.co/YWxg74ZiPX</a></p>\n<p>— Media Matters (@mmfa) <a href=\"https://twitter.com/mmfa/status/1451196138921467904?ref_src=twsrc%5Etfw\">October 21, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">4. <a href=\"https://twitter.com/Greenpeace?ref_src=twsrc%5Etfw\">@Greenpeace</a>'s digital ad was supposed to run for 10 days. But was taken down after just 2 days. </p>\n<p>Why?</p>\n<p>The company that operates the billboard told <a href=\"https://twitter.com/Greenpeace?ref_src=twsrc%5Etfw\">@Greenpeace</a> that \"their property partner complained about the content.\"</p>\n<p>— Judd Legum (@JuddLegum) <a href=\"https://twitter.com/JuddLegum/status/1436361816297312258?ref_src=twsrc%5Etfw\">September 10, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">📱 <a href=\"https://twitter.com/hashtag/10DLC?src=hash&amp;ref_src=twsrc%5Etfw\">#10DLC</a> restrictions will limit the ability of unions &amp; advocacy groups to communicate w/ their supporters to heed urgent calls to action.</p>\n<p>🛑 We can't back down. Demand <a href=\"https://twitter.com/ATT?ref_src=twsrc%5Etfw\">@ATT</a> &amp; <a href=\"https://twitter.com/TMobile?ref_src=twsrc%5Etfw\">@TMobile</a> to <a href=\"https://twitter.com/hashtag/Stop10DLC?src=hash&amp;ref_src=twsrc%5Etfw\">#Stop10DLC</a>. 🛑<a href=\"https://t.co/RLKnXVtfQT\">https://t.co/RLKnXVtfQT</a></p>\n<p>More here⤵️ <a href=\"https://t.co/5CgxmAN8M5\">https://t.co/5CgxmAN8M5</a> <a href=\"https://t.co/xCX81TyB1X\">https://t.co/xCX81TyB1X</a></p>\n<p>— Devin T. Murphy🔋🗳 (@DevinMurphyDTM) <a href=\"https://twitter.com/DevinMurphyDTM/status/1452703761550307331?ref_src=twsrc%5Etfw\">October 25, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://t.co/YWxg74ZiPX", "https://twitter.com/mmfa/status/1451196138921467904?ref_src=twsrc%5Etfw", "https://www.reuters.com/investigates/special-report/usa-oneamerica-att/", "https://www.mediamatters.org/one-america-news-network/pro-trump-oan-attacks-bans-new-mainstream-qanon-deep-state-appears-be", "https://popular.info/p/how-at-and-t-fuels-right-wing-extremists", "https://www.dailykos.com/stories/2021/10/21/2059485/-The-backlash-against-AT-T-s-support-of-OAN-is-growing-stronger?detail=emaildkre", "https://deadline.com/2021/04/viacomcbs-georgia-voting-bill-comcast-1234726035/", "https://www.greenpeace.org/usa/wp-content/uploads/2021/05/Democracy-Report-2.pdf", "https://www.accountable.us/wp-content/uploads/2021/07/2021-07-14-ATT-2021-Anti-Democracy-Contributions.pdf", "https://www.accountable.us/wp-content/uploads/2021/05/2021-04-23-US-Chamber-of-Commerce-Opposition-To-Voting-Rights-Efforts-1.pdf", "https://www.brennancenter.org/our-work/analysis-opinion/people-act-americas-next-great-civil-rights-bill", "https://www.dallasnews.com/news/politics/2021/01/11/dallas-based-att-suspends-pac-contributions-to-gop-lawmakers-who-objected-to-bidens-electoral-college-victory/", "https://www.citizensforethics.org/reports-investigations/crew-reports/this-sedition-is-brought-to-you-by/", "https://popular.info/p/at-and-t-abandons-pledge-makes-contributions", "https://twitter.com/Greenpeace?ref_src=twsrc%5Etfw", "https://twitter.com/Greenpeace?ref_src=twsrc%5Etfw", "https://twitter.com/JuddLegum/status/1436361816297312258?ref_src=twsrc%5Etfw", "https://twitter.com/JuddLegum/status/1436361371436867588", "https://about.att.com/newsroom/2021/george_floyd.html", "https://www.brookings.edu/research/5-steps-to-get-the-internet-to-all-americans/", "https://thehill.com/opinion/355709-democrats-internet-access-plan-leaves-affordability-questions-unanswered?rl=1", "https://www.americanprogress.org/issues/economy/news/2021/07/12/501530/rural-broadband-investments-promote-inclusive-economy/", "https://www.digitalinclusion.org/wp-content/uploads/dlm_uploads/2020/10/ATTs-Digital-Redlining-Leaving-Communities-Behind-for-Profit.pdf", "https://connectyourcommunity.org/atts-digital-redlining-of-cleveland-report/", "https://www.dataforprogress.org/memos/public-option-for-broadband-child-care-housing", "https://arstechnica.com/tech-policy/2016/02/att-is-the-villain-in-city-broadband-fight-republican-lawmaker-says/", "https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/", "https://prospect.org/infrastructure/building-back-america/infrastructure-summer-bipartisan-bill-boosts-corporate-giants/", "https://twitter.com/hashtag/10DLC?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/ATT?ref_src=twsrc%5Etfw", "https://twitter.com/TMobile?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Stop10DLC?src=hash&ref_src=twsrc%5Etfw", "https://t.co/RLKnXVtfQT", "https://t.co/5CgxmAN8M5", "https://t.co/xCX81TyB1X", "https://twitter.com/DevinMurphyDTM/status/1452703761550307331?ref_src=twsrc%5Etfw", "https://www.coalitionforopenmessaging.org/testimonials", "https://www.coalitionforopenmessaging.org/", "https://docs.google.com/document/d/11xPmc3-XrpWahqz41kAdCKgvt7TAjXzEPu6GVBuMGKs/edit", "https://theintercept.com/2021/04/20/att-tmobile-texting-10dlc-political-campaigns/", "https://www.coalitionforopenmessaging.org/", "https://www.vox.com/recode/22325420/t-mobile-verizon-att-ad-targeting-data", "https://www.eff.org/who-has-your-back-government-data-requests-2015#att-report", "https://www.eff.org/nsa-spying", "https://blog.credo.com/2018/07/att-one-nsas-trusted-partners/", "https://www.thedailybeast.com/atandt-is-spying-on-americans-for-profit", "https://engage.us.greenpeace.org/onlineactions/I33QC5d0KECz0Fpv370qmw2"], "authors": [], "publish_date": "2021-10-27T03:17:32-04:00"}