{"result_id": "143009", "URL": "https://www.greenpeace.org/usa/the-greenpeace-airship-flies-again-this-time-near-the-pepsico-hq/", "timestamp": "2023-04-25 15:24:58 CEST+0200", "meta": {"description": "We want to make sure that PepsiCo hears us loud and clear: it’s time to ditch plastic and switch to systems of refill and reuse.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/usa/wp-content/themes/greenpeace/img/favicon.png", "canonical": "https://www.greenpeace.org/usa/the-greenpeace-airship-flies-again-this-time-near-the-pepsico-hq/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "The Greenpeace airship flies again! This time, near the PepsiCo HQ.", "cleaned_text": "The Greenpeace airship flies again! This time, near the PepsiCo HQ.\n\nWe want to make sure that PepsiCo hears us loud and clear: it’s time to ditch plastic and switch to systems of refill and reuse.\n\nMany things about the way we work have shifted during the COVID-19 pandemic. For Greenpeace USA, it meant that many of our in-the-field, on-the-water, up-in-the-air activities and protests were canceled or postponed to keep activists and staff safe. While we are very much still in the throes of this pandemic, I am extremely grateful for the vaccines that have allowed us to get back out there in the world and do what I think Greenpeace is doing best at: calling on corporations to change their unsustainable ways.\n\nEarly yesterday morning, we launched the A.E. Bates airship near the PepsiCo headquarters in Purchase, NY. PepsiCo has been among the top plastic polluters worldwide in yearly brand audits, along with Coca-Cola, Nestlé, and Unilever. Coca-Cola announced earlier this year that they are committing to have 25% of their packaging be reusable or refillable by 2030. Coke’s biggest rival, Pepsi, said that they, too, will commit to reducing their plastic packaging, and would announce specifics later this year. We want to make sure that they hear us loud and clear: it’s time for PepsiCo to ditch plastic and switch to systems of refill and reuse.\n\nIt felt incredible to be back in the field and up in the air with colleagues, activists, and our airship pilot. And it felt even better to be calling Pepsi out and urging them to be better.\n\nHelp us keep the pressure on Pepsi by taking action here!", "opengraph": {"url": "https://www.greenpeace.org/usa/the-greenpeace-airship-flies-again-this-time-near-the-pepsico-hq/", "title": "The Greenpeace airship flies again! This time, near the PepsiCo HQ.", "type": "article", "description": "Many things about the way we work have shifted during the COVID-19 pandemic. For Greenpeace USA, it meant that many of our in-the-field, on-the-water, up-in-the-air activities and protests were canceled or postponed to keep activists and staff safe. While we are very much still in the throes of this pandemic, I am extremely grateful for …", "image": "https://www.greenpeace.org/usa/wp-content/uploads/2022/07/GP1SXZCM_Low_res_with_credit_line-1.jpg", "locale": "en_US", "site_name": "Greenpeace USA", "article:section": "News", "article:published_time": "2022-07-21T17:15:13-04:00", "article:modified_time": "2022-07-21T17:15:37-04:00", "updated_time": "2022-07-21T17:15:37-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greenpeace.org/usa/toolkits/plastic-free-july-toolkit/", "https://engage.us.greenpeace.org/OnlineActions/w1Ik80V3Sk6vG3e0QaXv2w2?utm_source=website&utm_medium=blog&utm_campaign=pepsi_airship_&sourceid=1014185"], "authors": [], "publish_date": "2022-07-21T17:15:13-04:00"}