{"result_id": "143017", "URL": "https://www.greenpeace.org/philippines/press/10887/filipino-climate-activists-join-call-for-equitable-and-inclusive-climate-summit/", "timestamp": "2023-04-25 15:25:10 CEST+0200", "meta": {"description": "Filipino environmental activists, civil society groups around the world call for an inclusive climate summit amid the worsening COVID pandemic.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/philippines/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/philippines/press/10887/filipino-climate-activists-join-call-for-equitable-and-inclusive-climate-summit/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Filipino climate activists join call for equitable and inclusive climate summit", "cleaned_text": "Quezon City/Amsterdam—Filipino environmental activists joined the call of civil society groups around the world for an inclusive climate summit amid the worsening COVID pandemic.\n\nThe activists joined over 1,500 civil society groups from 130 countries, members of Climate Action Network (CAN), to call for a postponement of the substantive negotiations of the COP26[1] due to the COP presidency and the UK government’s failure to ensure a safe, equitable, and inclusive summit.[2]\n\nExpressing concern that COP26 must be a platform where highly vulnerable communities and sectors are heard, Kyle Aboy, Filipino youth climate activist, supports the call to postpone COP26. “The Intergovernmental Panel on Climate Change (IPCC) report released this year clearly demonstrates that climate change is a threat that needs transnational collaboration among countries. The Philippines, belonging to countries most vulnerable to the impacts of climate change, must have inclusive representation, but the COVID restrictions pose a great challenge in achieving this,” he said.\n\n“The climate summit needs to be inclusive. Voices from the most vulnerable countries need not only be heard; they must be prioritized,” said Greenpeace Philippines Climate Justice Campaigner Virginia Benosa-Llorin. “Unfortunately, even while climate justice remains inadequately addressed in these talks, the crisis brought on by the pandemic has added another layer of injustice to their plight.”\n\nLlorin said that people from poorer nations have always had a harder time representing their communities in the climate talks. Now, she added, with COVID 19 restrictions and quarantines, and inequitable access to vaccines, this has become even more difficult. The Philippines, for example, is in the UK’s COVID-19 red list, and additional measures mean prohibitive financial costs.[3]\n\nCAN’s statement outlines how the COP presidency has failed to provide safe and equitable access to COP26.[4] The UK government is yet to provide Covid-19 vaccines to participants that have applied for them, and has failed to provide clarity around support for logistics and quarantine costs for delegates coming from a country on the UK government’s red list.\n\n\n\nSpeaking from Amsterdam, Juan Pablo Osornio, Senior Political Lead, Greenpeace International said, “The COP presidency has failed to guarantee the safe and equitable participation of COP26 delegates, especially people coming from countries that are disproportionately affected by Covid-19 and the climate crisis. COP26 needs to be fair and accessible to deliver global climate justice. Expecting already disadvantaged people to attend without access to vaccines, healthcare, and financial support to overcome the risks of participation is not only unfair but prohibitive.”\n\n“If the UK government wants this COP to be representative and transparent it must, at the very least, ensure that vaccines can be accessed and given sufficiently in advance to all delegates and provide financial support to cover the cost of hotel quarantine. More broadly, to rebuild the essential multilateral trust required for a successful COP26 will mean supporting the TRIPS waiver for a People’s Vaccine, delivering on commitments for climate finance for the most vulnerable countries, and kicking fossil fuels out of politics once and for all.”[5]\n\nGreenpeace maintains that regardless of whether the COP goes ahead, ambitious action on climate is urgently needed. The longer governments delay to honor their Paris climate commitments, the harder it will be to achieve the 1.5°C target. Every tenth of a degree of global heating is critical to human survival on this planet. The group is additionally calling for equitable access to vaccines globally, so that people can protect themselves from Covid-19 regardless of their social status or location. ​​\n\n[1] 26th UN Climate Change Conference of Parties (COP) summit “will bring parties together to accelerate action towards the goals of the Paris Agreement and the UN Framework Convention on Climate Change.” See https://ukcop26.org/\n\n[2] Statement: Climate Action Network calls for postponement of formal climate COP26 negotiations due to lack of plans to ensure safe and inclusive participation\n\n[3] The UK requires people from red list countries to stay in a quarantine hotel 10 days before travel to the UK, aside from quarantine upon arrival in the country. More information in this site: https://www.gov.uk/guidance/red-amber-and-green-list-rules-for-entering-england#red-list-rules\n\n[4] CAN Safety and Equity Principles and Demands for UNFCCC COP26", "opengraph": {"title": "Filipino climate activists join call for equitable and inclusive climate summit - Greenpeace Philippines", "type": "article", "url": "https://www.greenpeace.org/philippines/press/10887/filipino-climate-activists-join-call-for-equitable-and-inclusive-climate-summit", "description": "Filipino environmental activists, civil society groups around the world call for an inclusive climate summit amid the worsening COVID pandemic.", "image": "https://www.greenpeace.org/static/planet4-philippines-stateless/2014/05/9e4814d3-gp0stqljk_web_size.jpg", "image:width": "800", "image:height": "533", "site_name": "Greenpeace Philippines"}, "tags": ["# Climate"], "tweets": [], "movies": [], "links": ["https://climatenetwork.org/can-cop26-postponement-statement/", "https://ukcop26.org/", "https://climatenetwork.org/can-cop26-postponement-statement/", "https://www.gov.uk/guidance/red-amber-and-green-list-rules-for-entering-england#red-list-rules", "https://climatenetwork.org/wp-content/uploads/2021/08/cop26_demands_and_principles.pdf", "https://peoplesvaccine.org/", "/cdn-cgi/l/email-protection#20414e47454c490e43414e54494c4c414e4160475245454e50454143450e4f5247", "/cdn-cgi/l/email-protection#08656a677d7c486f7a6d6d66786d696b6d26677a6f", "/cdn-cgi/l/email-protection#6414160117170001170f4a0d0a1024031601010a14010507014a0b1603"], "authors": [], "publish_date": "September 7, 2021"}