{"result_id": "143027", "URL": "https://www.greenpeace.org/aotearoa/story/youth-activists-sailing-to-cop26-onboard-the-rainbow-warrior-ignore-warnings-from-port-authorities/", "timestamp": "2023-04-25 15:25:25 CEST+0200", "meta": {"description": "Youth strikers from impacted communities onboard the iconic ship demand world leaders ‘stop failing’.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/aotearoa/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/aotearoa/story/youth-activists-sailing-to-cop26-onboard-the-rainbow-warrior-ignore-warnings-from-port-authorities/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Youth activists sailing to COP26 onboard the Rainbow Warrior ignore warnings from port authorities", "cleaned_text": "The Rainbow Warrior will defy the authorities in Glasgow and sail up the River Clyde to the global climate conference, COP26, despite being refused access.\n\nIt is carrying activists from impacted communities who, if the ship’s voyage is successful, will be met by fellow activists on Monday afternoon outside of the summit where they will deliver a powerful message to world leaders.\n\nThe four youth climate activists onboard the ship are members of Fridays for Future MAPA (Most Affected People and Areas). They come from four countries across three continents – Namibia, Uganda, Mexico and Bangladesh – and are demanding that world leaders must ‘stop failing us’.\n\nThey are young people from impacted communities around the world who are taking a stand, having been failed by the lack of climate action from governments, and who will continue to suffer the dire consequences of any further inaction.\n\nMany activists and delegates from areas heavily hit by the climate crisis are unable to attend COP26 due to Covid travel restrictions, and vaccine inequalities. This compares to the US who are sending an entourage of more than 1,000 people to Glasgow.\n\nThe activists say that the climate negotiations should not be taking place without the most impacted people there, yet failure by rich nations to distribute vaccines equally have left many activists shut out.\n\nThe ‘stop failing us’ message is written on large banners hung between the Rainbow Warrior’s masts and on the bows of the ship.\n\nThe Rainbow Warrior set sail from the Port of Liverpool last night (30 October), at which point it contacted the Clyde port authority to request permission to berth outside of the COP26 climate conference. The authority responded by stating that as per the ‘Notice to Mariners’, the Rainbow Warrior cannot sail down the River Clyde and that this area is now controlled by the Scottish Police.\n\nThe captain has decided to ignore the warnings from the port authority and will continue the ship’s journey, as the activists’ message and presence at COP26 is fundamental to its success.\n\nOnboard the Rainbow Warrior, 19 year old climate activist Maria Reyes, from Mexico, said:\n\n“From vaccines to visas and travel restrictions, we’ve already had to overcome many obstacles that the COP26 organisers tried to use in an attempt to shut us out. But we’re here, we’re coming and we won’t be stopped.\n\n“Inequalities such as gender violence, racial discrimination, class inequality and forced migration are exacerbated by the climate crisis. By denying us entry these so-called “leaders” are fanning the flames of these inequalities. Enough empty speeches, there won’t be climate action without climate justice.”\n\n22 year old Farzana Faruk Jhumu, from Bangladesh, said:\n\n“If they think they can hold a climate summit that will decide our future without us present, they’ve got another thing coming. People from the most affected areas have been ignored for long enough. We’re here to be heard, not cause trouble, and my friends and I are sailing to the climate summit whether they like it or not. Our message, our voice, our presence is too important for us to turn back now.”\n\n“World leaders should be rolling out the red carpet to people most affected by this crisis not denying us from making our way to COP26. We’re only four activists but we’re representing millions and our voices must be heard.\n\n“We’re suffering the consequences of a crisis we did not create and those with the power to deliver the climate policies needed to stop this injustice are the same people betraying us. It’s time to uproot the system.”\n\n“We’re tired of not being listened to and we’re tired of being ignored. Despite this, we have travelled long distances to be here, and some of us during our final exams, because we need a seat at the table during these climate talks.\n\n“We are from the most affected areas and you cannot discuss and decide on our futures without us being present. We’ve been denounced as “hooligans” by our own “leaders” for speaking up for climate justice long enough. Our voices will be heard at COP26.”\n\nThe climate activists will be met by more members of Fridays for Future on Monday afternoon, once the Rainbow Warrior arrives at the COP26 climate summit. A press conference will then be held near the COP26 conference centre, where the activists will deliver their messages to world leaders and take questions from the media [4].", "opengraph": {"title": "Youth activists sailing to COP26 onboard the Rainbow Warrior ignore warnings from port authorities - Greenpeace Aotearoa", "type": "article", "url": "https://www.greenpeace.org/aotearoa/story/youth-activists-sailing-to-cop26-onboard-the-rainbow-warrior-ignore-warnings-from-port-authorities", "description": "Youth strikers from impacted communities onboard the iconic ship demand world leaders ‘stop failing’.", "image": "https://www.greenpeace.org/static/planet4-aotearoa-stateless/2021/11/697e2fd0-gp1swcvd_medium_res-e1652390308122.jpg", "image:width": "400", "image:height": "267", "site_name": "Greenpeace Aotearoa"}, "tags": ["# Climate Change"], "tweets": [], "movies": [], "links": ["https://www.theguardian.com/world/2021/oct/21/third-of-pacific-islands-unable-to-attend-cop26-sparking-fears-summit-will-be-less-ambitious", "https://www.ft.com/content/af8182e9-c287-424b-86de-99ce0f32239c"], "authors": [], "publish_date": "1 November 2021"}