{"result_id": "143038", "URL": "https://unearthed.greenpeace.org/2020/12/04/unearthed-today-the-uk-talks-the-talk-but-will-it-deliver/amp/", "timestamp": "2023-04-25 15:25:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://unearthed.greenpeace.org/2020/12/04/unearthed-today-the-uk-talks-the-talk-but-will-it-deliver/amp/", "encoding": "utf-8"}, "image": null, "domain": "unearthed.greenpeace.org", "title": "today: The UK talks the talk - but will it deliver?", "cleaned_text": "Morning! Yes, I’m here – even though it’s Friday because there’s some interesting news today.\n\nFirst up – about the vaccine rollout. The WSJ reports today that Pfizer has cut it’s production forecasts for 2021 in half – after discovering some raw materials weren’t up to scratch. That means the UK – for example – may get just 4-5 million doses of the jab during that year whilst Astra-Zenica is putting its vaccine through a new trial. News like this suggests that 2021 will not be 2020, but it will also – most likely – not be very like 2019 even as the world tries to pivot back to normality – and back to fighting the other crisis of climate change and biodiversity loss.\n\nFutureproof article of the day: When climate disaster strikes its renewable energy that keeps the lights on. “Sarita Turner believes that community-led renewables can be much more than a lifeline in a crisis; she sees them as an important tool in the fight against systemic racism and a way of achieving long-term stability for communities through jobs, education and empowerment…” read the full story here.\n\nThe UK has just committed to cut planet-warming emissions 68% compared to 1990 levels by 2030 – an upgrade to it’s contribution to the UN process designed to avoid the most catastrophic impacts of climate change.\n\nIt’s an important move which brings the government in line with the cuts demanded by its scientific advisors – though it is not as ambitious as it could be.\n\nMore importantly, it comes amidst major questions over how the target will be delivered – stretching across pretty much every area of the economy including home heating, the use of SUVs, industrial production and the restoration of natural habitats and peatlands.\n\nPolicies in most of these areas are still to be thrashed out. As things stand, the National Audit Office (NAO) has found that the UK is projected to fail to meet the government’s targets for the years 2023 to 2027 and 2028 to 2032, which were set to establish a trajectory for reducing emissions by 80% over the next 30 years.\n\nAnd that’s just about reducing domestic emissions – also crucial is the impact of UK government policy on global emissions, through the oil we extract (the North Sea), the goods we consume (soy, plastics) and the international projects we back (fossil fuels).\n\nWhich is where Denmark is showing the UK up. The government there have announced that it will stop offering new oil and gas licenses in the North Sea and will phase out production altogether in 2050 as part of the country’s goal to become fossil-free.\n\nThe UK, by contrast, retains a policy designed to maximise economic production from the North Sea, even as it lectures the rest of the world on reducing their consumption of oil and gas. The same goes for its oil giants, BP & Shell, which both retain plans to open up new basins whilst claiming climate leadership.\n\nA recent study by the left-of-centre think tank IPPR suggested the UK’s North Sea oil and gas industry should agree to phase out production through a series of five-year targets to help its 260,00 strong workforce migrate to clean energy sectors.\n\n“Denmark’s announcement marks a bold milestone on the way to a phase-out of North Sea oil production. This is a clear signal that climate leadership means an end to fossil fuel expansion and the start of a just transition and managed decline of all production,” noted Oil Change International this morning.\n\nThe history of climate action, however, suggests most countries are much better at doing things – or at least promising to do them – then at agreeing to stop doing things which remain profitable. The UK did phase out coal, remarkably still intends to mine the stuff.\n\nThree things you need to know:\n\nTrump looks to open up Arctic days before Biden sworn in: The Trump administration is racing to sell oil drilling rights in the Arctic National Wildlife Refuge before Joe Biden takes office so the president-elect can’t revoke the contracts, Bloomberg reports. “Cutting off public input by noticing a lease sale in the middle of an open comment period is politically motivated and legally questionable,” said Brook Brisson, a senior staff attorney with Trustees for Alaska, which is representing groups challenging the administration’s plans in court.\n\nBiden’s economic council to be led by former Obama climate head: Mr. Deese helped devise the bailout of large American automakers which insisted on investment in electric technology.\n\nUK Wildlife Trust raises the alarm over destruction of a crucial river: It seems like the last straw for the group which has seen environmental negligence and wrongdoing continue to increase.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Unearthed today: The UK talks the talk - but will it deliver?", "url": "https://unearthed.greenpeace.org/2020/12/04/unearthed-today-the-uk-talks-the-talk-but-will-it-deliver/", "site_name": "Unearthed", "article:publisher": "https://www.facebook.com/greenpeace.unearthed", "article:published_time": "2020-12-04T11:00:33+00:00", "article:modified_time": "2020-12-04T11:01:58+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wsj.com/articles/pfizer-slashed-its-covid-19-vaccine-rollout-target-after-facing-supply-chain-obstacles-11607027787", "https://www.huffingtonpost.co.uk/entry/renewables-clean-energy-climate-disasters_n_5fad67d1c5b6cae94043c56b", "https://www.huffingtonpost.co.uk/entry/renewables-clean-energy-climate-disasters_n_5fad67d1c5b6cae94043c56b", "https://www.bbc.co.uk/news/science-environment-55179008", "https://www.theguardian.com/environment/2020/dec/04/radical-reassessment-needed-hit-net-zero-emissions-2050-uk-nao-report", "https://www.bloomberg.com/news/articles/2020-12-03/denmark-ends-north-sea-oil-exploration-drops-production-in-2050?sref=xpkx9tNh", "https://www.theguardian.com/business/2020/dec/03/uk-north-sea-industry-urged-to-phase-out-oil-and-gas-extraction", "http://priceofoil.org/2020/12/03/danish-announcement-sends-clear-signal-climate-leadership-means-an-end-to-fossil-fuel-expansion/", "https://www.bloomberg.com/news/articles/2020-12-03/trump-sets-january-6-auction-of-arctic-refuge-drilling-rights?sref=xpkx9tNh", "https://www.nytimes.com/2020/12/03/business/brian-deese-national-economic-council.html", "https://www.nytimes.com/2009/06/01/business/01deese.html", "https://www.wildlifetrusts.org/news/horror-destruction-nationally-important-uk-river"], "authors": ["Damian Kahya"], "publish_date": "2020-12-04T11:00:33+00:00"}