{"result_id": "143032", "URL": "https://www.greenpeace.org/india/en/story/12765/2021-greenpeace-india-in-pictures/", "timestamp": "2023-04-25 15:25:32 CEST+0200", "meta": {"description": "What a year 2021 has been! The pandemic, extreme weather events kept us isolated and made it a challenging year. But through it all, the resilience of humanity shone through.&hellip;", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/india/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/india/en/story/12765/2021-greenpeace-india-in-pictures/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "2021: in pictures", "cleaned_text": "What a year 2021 has been! The pandemic, extreme weather events kept us isolated and made it a challenging year. But through it all, the resilience of humanity shone through. As we draw curtains on this eventful, stressful year that was filled with lessons on the climate crisis, we look back at the work we did together. Greenpeace India, with the unwavering support of its donors, volunteers, allies, citizens and staff worked through the crises in various aspects of the climate change campaigns – including responsive work during the testing second wave of COVID19 pandemic. Here is a throwback photoblog of some of the highlights of 2021. We could not have done it without YOU!\n\n‘Behind The Smokescreen’ report by Greenpeace India recorded a sharp rise in NO2 levels in India’s most populous cities. Among the 8 cities surveyed, Delhi saw the most dramatic increase between April 2020 and April 2021. NO2 is a dangerous air pollutant that is released when fuel is burnt and has severe health impacts. Ending fossil fuel use is key to reducing NO2 pollution. Join the fight against air pollution and sign our petition demanding CPCB to update India’s air quality standards. \n\n\n\n Photo credits: Greenpeace / Abhilash KL\n\nOur TomAto vs Tamatar video explored the journeys of the organic tamatar and industrial tomato. While TomAto traversed through a relatively toxic world full of emissions and pesticides, its initial confidence dwindled away leading to an untimely demise. Our organic friend Tamatar, however, walked through trees along with animals and worlds, completing his quest, healthy and thriving! The video shows the importance of organic farming for healthy food that can make us truly healthy.\n\n\n\n Animation credits: Greenpeace / Evansha Agarwal\n\nGlobally, Greenpeace and its allies exerted pressure on the World Trade Organisation to dislodge the monopoly of big-pharma companies and rich countries’ over COVID-19 vaccines. The campaign was aimed at demanding equitable access to vaccines for everyone on the planet. Greenpeace India campaigned in support of developing countries and their demand to temporarily waive patent rights on Covid19 vaccines. Equitable access to Covid19 vaccines and medicines to populations across the world is key to fighting the pandemic, and representative of the world’s approach to climate change.\n\n\n\n Video credits: Greenpeace / Suhaib Salman", "opengraph": {"title": "2021: Greenpeace India in pictures - Greenpeace India", "type": "article", "url": "https://www.greenpeace.org/india/en/story/12765/2021-greenpeace-india-in-pictures/", "description": "What a year 2021 has been! The pandemic, extreme weather events kept us isolated and made it a challenging year. But through it all, the resilience of humanity shone through.&hellip;", "image": "https://www.greenpeace.org/static/planet4-india-stateless/2021/12/ce0a12d6-banner-collage.png", "image:width": "399", "image:height": "299", "site_name": "Greenpeace India"}, "tags": ["#FossilFuels", "#Plastics", "#Forest", "#Oceans", "#Renewables"], "tweets": [], "movies": [], "links": ["https://www.greenpeace.org/india/en/publication/11811/the-national-capital-delhi-witnesses-an-unprecedented-spike-of-125-in-no2-pollution/", "https://act.greenpeace.org/page/90848/petition/1?_ga=2.145145522.745838900.1640325017-1862403005.1625890285", "https://www.youtube.com/watch?v=7AHaqJUSRvU"], "authors": [], "publish_date": "December 25, 2021"}