{"result_id": "143022", "URL": "https://www.greenpeace.org/international/press-release/48362/g7-leaves-vulnerable-behind-covid19-climate/", "timestamp": "2023-04-25 15:25:17 CEST+0200", "meta": {"description": "At the conclusion of the G7 Summit, Greenpeace is calling for faster and more ambitious action to respond to COVID-19 and the climate emergency.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/international/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/international/press-release/48362/g7-leaves-vulnerable-behind-covid19-climate/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "G7 leaves vulnerable behind in COVID-19 and climate emergency", "cleaned_text": "Cornwall, United Kingdom – At the conclusion of the G7 Summit, Greenpeace is calling for faster and more ambitious action to respond to COVID-19 and the climate emergency.\n\n“Everyone is being hit by COVID-19 and worsening climate impacts, but it is the most vulnerable who are faring the worst due to G7 leaders sleeping on the job. We need authentic leadership and that means treating the pandemic and the climate crisis for what they are: an interconnected inequality emergency.\n\n“The G7 have failed to set us up for a successful COP26 as trust is sorely lacking between rich and developing countries. Rebuilding this essential multilateral trust means supporting the TRIPS waiver for a People’s Vaccine, delivering on commitments for climate finance for the most vulnerable countries, and kicking fossil fuels out of politics once and for all.\n\n“The solutions to the climate emergency are clear and available, but the G7’s refusal to do what’s needed is leaving the world’s vulnerable behind. To fight COVID-19, supporting a TRIPS waiver for a People’s Vaccine is crucial. To lead us out of the climate emergency, the G7 needed to deliver clear plans to quickly phase out fossil fuels and commitments to immediately stop all new fossil fuel development with a just transition. Where is the clear national implementation with deadlines and where is the climate finance so urgently needed for the most vulnerable countries?\n\n“A resourced plan to protect at least 30% of our land and sea is missing, yet urgently needed. Nature protection must be realised in partnership with local and Indigenous Peoples within this decade. Otherwise pandemics stand to become a nightmarish norm against the backdrop of climate catastrophe.”\n\n“This summit feels like a broken record of the same old promises. There’s a new commitment to ending overseas investment in coal, which is their piece de resistance. But without agreeing to end all new fossil fuel projects – something that must be delivered this year if we are to limit dangerous rises in global temperature – this plan falls very short.\n\n“The G7’s plan doesn’t go anywhere near far enough when it comes to a legally binding agreement to stop the decline of nature by 2030. And the finance being offered to poorer nations is simply not new, nor enough, to match the scale of the climate crisis.\n\n“Boris Johnson and his fellow leaders have buried their heads in the Cornish sand rather than rising to the environmental challenge we all face.”", "opengraph": {"title": "G7 leaves vulnerable behind in COVID-19 and climate emergency - Greenpeace International", "type": "article", "url": "https://www.greenpeace.org/international/press-release/48362/g7-leaves-vulnerable-behind-covid19-climate", "description": "At the conclusion of the G7 Summit, Greenpeace is calling for faster and more ambitious action to respond to COVID-19 and the climate emergency.", "image": "https://www.greenpeace.org/static/planet4-international-stateless/2021/06/1ecdfe19-gp1sv9fx.jpg", "image:width": "1200", "image:height": "675", "site_name": "Greenpeace International"}, "tags": ["# Health", "# Climate"], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection#b7dad5d8c2c3f7d0c5d2d2d9c7d2d6d4d299d8c5d0", "/cdn-cgi/l/email-protection#3242405741411c475972554057575c42575351571c5d4055", "/cdn-cgi/l/email-protection#f686849385859293859dd89f9882b691849393988693979593d8998491"], "authors": [], "publish_date": "13 June 2021"}