{"result_id": "143024", "URL": "https://www.greenpeace.org/aotearoa/story/coronavirus-ten-reasons-why-you-ought-not-to-panic/", "timestamp": "2023-04-25 15:25:20 CEST+0200", "meta": {"description": "This is a serious situation, but we must not panic. It would be wrong to say there is good news coming out of COVID-19, but there are causes for optimism; reasons to think there may be ways to contain and defeat the virus. And lessons to learn for the future.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/aotearoa/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/aotearoa/story/coronavirus-ten-reasons-why-you-ought-not-to-panic/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Coronavirus: Ten reasons why you ought not to panic", "cleaned_text": "Regardless of whether we classify the new coronavirus as a pandemic, it is a serious issue. In less than two months, it has spread over several continents. Pandemic means sustained and continuous transmission of the disease, simultaneously in more than three different geographical regions. Pandemic does not refer to the lethality of a virus but to its transmissibility and geographical extension.\n\nWhat we certainly have is a pandemic of fear. The entire planet’s media is gripped by coronavirus. It is right that there is deep concern and mass planning for worst-case scenarios. And, of course, the repercussions move from the global health sphere into business and politics.\n\nBut it is also right that we must not panic. It would be wrong to say there is good news coming out of COVID-19, but there are causes for optimism; reasons to think there may be ways to contain and defeat the virus. And lessons to learn for the future.\n\n1. We know what it is\n\nThe first cases of AIDS were described in June 1981 and it took more than two years to identify the virus (HIV) causing the disease. With COVID-19, the first cases of severe pneumonia were reported in China on December 31, 2019 and by January 7 the virus had already been identified. The genome was available on day 10.\n\nWe already know that it is a new coronavirus from group 2B, of the same family as SARS, which we have called SARSCoV2. The disease is called COVID-19. It is thought to be related to coronavirus from bats. Genetic analyses have confirmed it has a recent natural origin (between the end of November and the beginning of December) and that, although viruses live by mutating, its mutation rate may not be very high.\n\n2. We know how to detect the virus\n\nSince January 13, a test to detect the virus has been available.\n\n3. The situation is improving in China\n\nThe strong control and isolation measures imposed by China are paying off. For several weeks now, the number of cases diagnosed every day is decreasing. A very detailed epidemiological follow-up is being carried out in other countries; outbreaks are very specific to areas, which can allow them to be controlled more easily.\n\nThe disease causes no symptoms or is mild in 81% of cases. Of course, in 14% it can cause severe pneumonia and in 5% it can become critical or even fatal. It is still unclear what the death rate may be. But it could be lower than some estimates so far.\n\nMuch of the reported data relates to the increase in the number of confirmed cases and the number of deaths, but most infected people are cured. There are 13 times more cured cases than deaths, and that proportion is increasing.\n\nOnly 3% of cases occur in people under 20, and mortality under 40 is only 0.2%. Symptoms are so mild in children it can go unnoticed.\n\n7. The virus can be wiped clean\n\nThe virus can be effectively inactivated from surfaces with a solution of ethanol (62-71% alcohol), hydrogen peroxide (0.5% hydrogen peroxide) or sodium hypochlorite (0.1% bleach), in just one minute. Frequent handwashing with soap and water is the most effective way to avoid contagion.\n\n8. Science is on it, globally\n\nIt is the age of international science cooperation. After just over a month, 164 articles could be accessed in PubMed on COVID19 or SARSCov2, as well as many others available in repositories of articles not yet reviewed. They are preliminary works on vaccines, treatments, epidemiology, genetics and phylogeny, diagnosis, clinical aspects, etc.\n\nThese articles were written by some 700 authors, distributed throughout the planet. It is cooperative science, shared and open. In 2003, with the SARS epidemic, it took more than a year to reach less than half that number of articles. In addition, most scientific journals have left their publications as open access on the subject of coronaviruses.\n\n9. There are already vaccine prototypes\n\nOur ability to design new vaccines is spectacular. There are already more than eight projects underway seeking a vaccine against the new coronavirus. There are groups that work on vaccination projects against similar viruses.\n\nThe vaccine group of the University of Queensland, in Australia, has announced it is already working on a prototype using the technique called “molecular clamp”, a novel technology. This is just one example that could allow vaccine production in record time. Prototypes may soon be tested on humans.\n\nVaccines are preventive. Right now, the treatment of people who are already sick is important. There are already more than 80 clinical trials analysing coronavirus treatments. These are antivirals that have been used for other infections, which are already approved and that we know are safe.\n\nOne of those that has already been tested in humans is remdesivir, a broad-spectrum antiviral still under study, which has been tested against Ebola and SARS/MERS.\n\nAnother candidate is chloroquine, an antimalarial that has also been seen to have potent antiviral activity. It is known that chloroquine blocks viral infection by increasing the pH of the endosome, which is needed for the fusion of the virus with the cell, thus inhibiting its entry. It has been demonstrated that this compound blocks the new coronavirus in vitro and it is already being used in patients with coronavirus pneumonia.\n\nOther proposed trials are based on the use of oseltamivir (which is used against the influenza virus), interferon-1b (protein with antiviral function), antisera from people who recovered or monoclonal antibodies to neutralise the virus. New therapies have been proposed with inhibitory substances, such as baricitinibine, selected by artificial intelligence.\n\nThe 1918 flu pandemic caused more than 25 million deaths in less than 25 weeks. Could something similar happen now? Probably not; we have never been better prepared to fight a pandemic.\n\nIgnacio López-Goñi is microbiologist and works in University of Navarra (Spain).\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.\n\nInformation about the COVID-19 (novel coronavirus) for New Zealanders can be found here.", "opengraph": {"title": "Coronavirus: Ten reasons why you ought not to panic - Greenpeace Aotearoa", "type": "article", "url": "https://www.greenpeace.org/aotearoa/story/coronavirus-ten-reasons-why-you-ought-not-to-panic", "description": "This is a serious situation, but we must not panic. It would be wrong to say there is good news coming out of COVID-19, but there are causes for optimism; reasons to think there may be ways to contain and defeat the virus. And lessons to learn for the future.", "image": "https://www.greenpeace.org/static/planet4-aotearoa-stateless/2020/03/cc729088-natanael-melchor-43lwvc-eqpm-unsplash.jpg", "image:width": "1920", "image:height": "1440", "site_name": "Greenpeace Aotearoa"}, "tags": ["# CoronaVirus", "# PeoplePower"], "tweets": [], "movies": [], "links": ["https://nextstrain.org/ncov", "https://www.who.int/docs/default-source/coronaviruse/wuhan-virus-assay-v1991527e5122341d99287a1b17c111902.pdf?sfvrsn=d381fc88_2", "https://www.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6", "https://images.theconversation.com/files/317918/original/file-20200301-166488-1muyflg.png?ixlib=rb-1.1.0&q=45&auto=format&w=1000&fit=clip", "https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6", "http://weekly.chinacdc.cn/en/article/id/e53946e2-c6c4-41e9-9a9b-fea8db1a8f51", "https://www.journalofhospitalinfection.com/article/S0195-6701(20)30046-3/fulltext", "https://pubmed.ncbi.nlm.nih.gov/?term=COVID19%20or%20SARSCov2&sort=date", "https://www.biorxiv.org/search/2019-nCoV%20numresults%3A10%20sort%3Apublication-date%20direction%3Adescending", "https://www.medrxiv.org/search/2019-nCoV%20numresults%3A10%20sort%3Apublication-date%20direction%3Adescending", "https://www.springernature.com/gp/open-research/about/what-is-open-access", "https://www.bbc.co.uk/news/health-51665497", "https://www.uq.edu.au/news/article/2020/01/race-develop-coronavirus-vaccine", "https://www.nature.com/articles/d41586-020-00444-3", "https://www.gilead.com/news-and-press/press-room/press-releases/2020/2/gilead-sciences-initiates-two-phase-3-studies-of-investigational-antiviral-remdesivir-for-the-treatment-of-covid-19", "https://www.nature.com/articles/s41422-020-0282-0", "https://www.cdc.gov/coronavirus/mers/index.html", "https://www.nature.com/articles/s41422-020-0282-0", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30304-4/fulltext", "https://theconversation.com/profiles/ignacio-lopez-goni-536052", "https://theconversation.com/institutions/universidad-de-navarra-3467", "https://theconversation.com", "https://theconversation.com/coronavirus-ten-reasons-why-you-ought-not-to-panic-132941", "https://www.health.govt.nz/our-work/diseases-and-conditions/covid-19-novel-coronavirus", "https://www.greenpeace.org/aotearoa/petition/support-a-green-covid-response/", "https://www.greenpeace.org/aotearoa/petition/support-a-green-covid-response/", "https://www.greenpeace.org/aotearoa/petition/support-a-green-covid-response/"], "authors": [], "publish_date": "11 March 2020"}