{"result_id": "143025", "URL": "https://www.greenpeace.org/usa/greenpeace-usas-just-recovery-agenda/", "timestamp": "2023-04-25 15:25:21 CEST+0200", "meta": {"description": "Our Just Recovery Agenda outlines bold, transformational policies that address the root causes of racial, environmental, and economic injustice.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/usa/wp-content/themes/greenpeace/img/favicon.png", "canonical": "https://www.greenpeace.org/usa/greenpeace-usas-just-recovery-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Greenpeace USA’s Just Recovery Agenda", "cleaned_text": "Our Just Recovery Agenda outlines bold, transformational policies that address the root causes of racial, environmental, and economic injustice.\n\nOur Just Recovery Agenda offers a bold and transformational set of policies that policymakers must pursue to address the root causes of racial, environmental, and economic injustice.\n\nThe devastation wrought by COVID-19 is just the latest in a series of anthropogenic crises catalyzed by racial capitalism and our broken system. Our Recovery Agenda is a constructive, solution-oriented, and forward-thinking vision for an inclusive, just, thriving economy and democracy that works for everyone. This guiding road map to federal policy embodies the values and principles of our work and is aimed at not just getting rid of the broken systems that govern us today, but it is a vision to replace them with something better.\n\nThough we know federal policy alone will not bring about the level of transformational and systemic change we seek, the Recovery Agenda represents one pillar of our work to create a world beyond racial capitalism. The just, green, and peaceful future we deserve is possible. Together, we will build the power to manifest it.\n\nGreenpeace USA is dedicated to building a world in which all people have what they need to thrive and the boundaries of the planet we share are respected. As we look to recover from COVID-19, address the climate crisis, advance racial justice and build an economy that puts people first, it is time to use the tools and power of the federal government to solve problems rather than exacerbate them. This just, green, and peaceful future is guided by a set of deeply held, fundamental values. These values speak to the basic human rights and sense of community we must honor to build a world where all can thrive.\n\nEquity — working to build a country where everyone’s fundamental needs are met.\n\nCommunity — embracing the value of the commons, of interconnectedness, of people power, and of global solidarity. We respect the ecological boundaries of the planet we share and upon which we all depend.\n\nJustice – Lasting peace can be achieved only by building independent power that is grounded in a commitment to restorative justice for those harmed by past and current oppressions.\n\nFreedom – Full agency and self-determination for the most marginalized people in today’s society are necessary for liberation, peace, justice, and equal opportunity for all.\n\nCompassion – The ability to extend our compassion and solidarity across identities, borders, and social divides is essential to uncovering and healing injustice and environmental degradation.\n\nCreativity – We embrace the power of art, culture, and imagination to build community and bring our story to life.\n\nCourage – We recognize courage as the commitment to bearing witness, confronting injustice, and practicing honesty, transparency, and truth no matter the obstacle.\n\nThe policies that we put forth in our Just Recovery Agenda are shaped by seven core principles that will facilitate action at the scale that science and justice demand.\n\nLow-wealth and marginalized communities, particularly Black, Brown and Indigenous communities, have disproportionately suffered because profit and economic growth are prioritized over people’s needs. To prevent such harm, our government must ensure that high-quality, affordable health care is guaranteed, pandemic vaccines are free and equitably distributed, all communities and individuals are safe, and basic human needs — including clean water, clean air, healthy food, and safe housing — are recognized as rights.\n\nFor over a century, our single-use, waste-prone society has been extracting, producing, and consuming more than our planet can sustain. In order to ensure a healthy planet for generations to come, we must rapidly move to systems based on stewardship and renewal. Immediate action must be taken to address the climate crisis while advancing a just and managed transition off fossil fuels that creates millions of dignified, union jobs for frontline workers and communities. Our food systems need a complete overhaul, transitioning from industrial agriculture to methods rooted in ecological farming. Respecting the rights of Indigenous peoples and local communities must be central as we aim to achieve these goals.\n\nWe aim to design a new economy that ensures a social safety net and dignified work, equitably redistributes wealth, offers accessible and clean infrastructure, and provides relief directly to the people. We need Green New Deal-style investments — rooted in a just transition for frontline communities, as well as workers and those affected by the transition from extraction to a new economy — to bring this more equitable and resilient system to life.\n\n4. Justice and equity across communities, generations, and borders\n\nWe are committed to helping to protect those who have been disenfranchised while repaying historical debts—particularly to Black and Indigenous communities. We must uphold Indigenous sovereignty and make sure Indigenous land, titles, and treaties are recognized and respected.\n\nWe believe that all humans deserve to have full agency and opportunity to participate in governance and the decisions that affect their lives. A society shaped around respecting science, combating disinformation, and fostering cooperation, mutual aid, and participation can drive forward the future we fight for.\n\nWe are focused on radical systemic change that allows for the support of nearer-term policies that offer immediate relief or protection to communities and individuals.\n\nThe COVID-19 pandemic exposed how our relationship to our planet can both drive and prevent crises. It is critical that we work to keep forests and other ecosystems intact to prevent future zoonotic pandemics. We must recognize and prepare for the worst impacts of climate change such as extreme weather.\n\nThe Policies We Need\n\nThe majority of the policy solutions we advocate for a just recovery embody one or more of these principles. The policies we support aim to shift mindsets, cultural norms, how people are treated, how our voices are heard, and how bedrock environmental laws are upheld.\n\nA sixth section also elevates platforms and policies of the larger progressive movement and its broad and diverse collective vision for a better world.\n\nAs an organization, we are committed to holding ourselves accountable to these values and principles, to our communities, and to the scale of action that science and justice demand. Though normal was a crisis, federal policy can bring about a just recovery from the numerous crises we’ve faced over the past year.\n\nTo learn more about our vision for federal policy, read the Recovery Agenda today.", "opengraph": {"url": "https://www.greenpeace.org/usa/greenpeace-usas-just-recovery-agenda/", "title": "Greenpeace USA’s Just Recovery Agenda", "type": "article", "description": "Our Just Recovery Agenda offers a bold and transformational set of policies that policymakers must pursue to address the root causes of racial, environmental, and economic injustice. The devastation wrought by COVID-19 is just the latest in a series of anthropogenic crises catalyzed by racial capitalism and our broken system. Our Recovery Agenda is a …", "image": "https://www.greenpeace.org/usa/wp-content/uploads/2020/11/GP0STONYB_Web_size-1.jpg", "locale": "en_US", "site_name": "Greenpeace USA", "article:section": "News", "article:published_time": "2020-11-17T16:48:46-05:00", "article:modified_time": "2020-11-18T18:21:37-05:00", "updated_time": "2020-11-18T18:21:37-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda", "https://www.greenpeace.org/usa/just-recovery-agenda"], "authors": [], "publish_date": "2020-11-17T16:48:46-05:00"}