{"result_id": "143008", "URL": "https://www.greenpeace.org/philippines/press/10505/joint-statement-of-csos-on-the-planned-mega-vaccine-center-in-nayong-pilipino/", "timestamp": "2023-04-25 15:24:57 CEST+0200", "meta": {"description": "The Filipino people need an accessible, equitable, inclusive, sustainable, and people-centered approach to the COVID19 vaccination program and not a business-oriented venture that will pose long-term threats to our health and safety.", "lang": "en", "keywords": "", "favicon": "https://www.greenpeace.org/philippines/wp-content/themes/planet4-master-theme/favicon.ico", "canonical": "https://www.greenpeace.org/philippines/press/10505/joint-statement-of-csos-on-the-planned-mega-vaccine-center-in-nayong-pilipino/", "encoding": "UTF-8"}, "image": null, "domain": "www.greenpeace.org", "title": "Joint statement of CSOs on the planned mega-vaccine center in Nayong Pilipino", "cleaned_text": "Philippines — THE CHALLENGE the government faces today is to provide vaccines for all, especially to people in places that have the least access to it, at the soonest possible time. What the government needs to do is to implement better and more equitable distribution and systems that would bring the vaccines to where people are.\n\nThe proposed mega-vaccination center will deepen vaccine inequality. It will marginalize people and groups who have limited access and mobility options to reach the centralized site. It would concentrate the vaccines and vaccine administration to one company that controls one site that would need to be accessed by hundreds of thousands of people.\n\nThe Filipino people need an accessible, equitable, inclusive, sustainable, and people-centered approach to the COVID19 vaccination program and not a business-oriented venture that will pose long-term threats to our health and safety.\n\nThe so-called mega-vaccine facility is also proposed in an area that has been earmarked as a park and necessitates the cutting of 500 trees. The proponents of the mega-vaccine facility argue that protecting 500 trees should not equate to protecting people’s lives.1 This manipulates people into a false choice that pits people’s health against nature.\n\nThe question decision-makers need to be asking is not whether we should build the mega-vaccine center and cut the trees. The question is whether this is the kind of facility the country needs to make the vaccine accessible to more people.\n\nAs we continue to struggle to access medical solutions to the pandemic, we are calling on the government to urgently drop plans to build the proposed mega-vaccination facility in a reclaimed and forested land at the Nayong Pilipino, and instead invest in decentralizing and future-proofing the country’s vaccination efforts.\n\nWe urge President Rodrigo Duterte, the Inter-Agency Task Force for the Management of Emerging Infectious Diseases, the Department of Tourism, and Mr. Enrique Razon, to stop this ill-advised plan and instead focus on long-term and people-centered solutions to the health crisis.\n\n1. Strengthen and recognize the role of local government and communities in shortening the chain by creating and improving local vaccination facilities. A localized response to the pandemic will help promote local sustainability and boost local economies, especially in communities hit hardest by the pandemic.\n\nVaccine facilities are best located where they can be accessed by people from all sectors. With the lack of safe and efficient public transportation, building a centralized vaccination facility at the Entertainment City will put marginalized communities, such as the poor, PWDs and senior citizens at a disadvantage. This facility will deepen vaccine inequity and will defeat the purpose of the vaccination program.\n\nStrengthening community-based and city-based vaccination facilities using idled facilities, such as sports complex and open grounds, will boost local economies and create more local jobs in social services and logistics services, to name a few. LGUs, such as San Juan City and Pasig, have shown success in utilizing idled sports facilities as vaccination sites.2\n\n2. Boost nature-based solutions to prevent future pandemics and promote resilience. People’s health and well-being are dependent on the health of our environment and biodiversity. During the pandemic lockdowns, we have seen how nature and greenery have been recognized to improve the well-being of people.3\n\nGreen urban spaces are also considered “lungs” of a city, helping control temperature and humidity, and providing a buffer for air pollution,4 therefore, helping people become more resilient to diseases. Urban forests help manage air pollution by absorbing carbon, as well as neutralizing air pollutants, such as PM2.5,5 which increases the likelihood of dying from cancer or stroke, suffering asthma attacks, and of experiencing severe COVID-19.\n\nThe proposed site of the facility can also be considered as a coastal forest with beach forest species6 and wetlands identified as critical habitats, which is a natural infrastructure7 to protect coastal communities from storm surges and other climate disasters.\n\nMajor outbreaks of zoonotic diseases, including coronavirus, are associated with the loss of natural habitats.8\n\nIt is important to recognize the connection between people’s health and a healthy environment, between environmental destruction and diseases, as well as the ability of communities to cope with diseases. Human health is dependent on a healthy climate and environment. The government must keep in mind that COVID recovery plans must include protecting the health of our environment.\n\n3. Prioritize people-centered solutions. This project is a waste of taxpayer’s money when Metro Manila already has many city spaces that can be utilized, such as mall grounds, stadiums, and open grounds. We urge the government to instead use the money to be spent on this facility to enable LGUs to procure more vaccines and create vaccination centers, boost mass testing, and provide support to frontline workers.\n\n4. Work towards a green and just recovery. Responding to COVID and other crises in the face of climate crisis and planetary emergency means putting the well-being of people and nature first. Concretely, this means directing finance to green, people-centred investments across a range of public sectors: health, energy, transport, water, food, waste, and education.\n\nCivil society organizations and the youth have been calling for national policies that will support green, livable, inclusive, and safe cities and municipalities, and which will mandate local governments to ensure a community-based city design that incorporates green spaces and eco-friendly infrastructure to support the physiological, mental, and societal well-being of the people.\n\nFilipinos should also scrutinize how the government is spending the funds for the COVID response; whether the government should prioritize infrastructure over vaccine and vaccine distribution, and who will benefit from this mega facility.\n\nThe Philippine Government has the opportunity to start creating a #BetterNormal for Filipinos by instituting responses during the crisis that are people- and community-centered and -directed. We urge the government to abandon this questionable project and institute solutions that are accessible, equitable, inclusive, and sustainable.\n\nGreenpeace Southeast Asia – Philippines \n\nGlobal Alliance for Incinerator Alternatives – Philippines\n\nInterfacing Development Interventions for Sustainability \n\nMother Earth Foundation \n\nOceana Philippines International\n\nLiving Laudato Si’ Philippines\n\nLinghod\n\nYouth for Climate Hope\n\nMangrove Matters PH\n\nBalud\n\nYoung Leaders for Environmental Action Federation \n\nCoal-Free Bataan Movement\n\nNuclear-Free Bataan Movement\n\nYoung Bataenos Environmental Advocates Network\n\nNational Society of Parliamentarians\n\nKuryente.org \n\nAlyansa ng Bagong Nayon Natin\n\nGreen Party of the Philippines\n\nAksyon Kalikasan \n\nSigaw ng Kabataan Coalition \n\nASEAN Youth Organization Philippines\n\nRotary Club of Alabang Madrigal Business Park \n\nANAHAW Laguna \n\nEarth – UST \n\nEcowaste Coalition \n\nHealth Care Without Harm Southeast Asia\n\nMove As One Coalition \n\nAltMobility \n\nRenacimiento Manila\n\nZero Waste Youth Pilipinas\n\nZero Waste Youth Negros Oriental\n\nYouth Strike for Climate Philippines\n\n#IAmHampasLupa Youth Movement\n\nPhilippine Rural Reconstruction Movement\n\nGlobal Shapers Manila Hub \n\nYoung Earth Scientists’ Society\n\nKalikasan PNE\n\nSTEP Philippines \n\nAsian Medical Students’ Association – Philippines\n\nPamantasan ng Lungsod ng Maynila – Society for Biological Sciences\n\nRice Watch Action Network\n\nMindanao Peace Council \n\nH.umanitarian O.rganization For P.eace E.ngagements (H.O.P.E.) KABABAIHAN Group\n\nWar on Waste Negros Occidental\n\nPUP College of Political Science & Public Adminstration Student Council\n\nGoodGov PH\n\nKamara – PH\n\nSt. Luke’s Medicine Student Council\n\nCamarines Sur Polytechnic Colleges\n\n*List of signatories as of May 12, 2021 6:00 pm", "opengraph": {"title": "Joint statement of CSOs on the planned mega-vaccine center in Nayong Pilipino - Greenpeace Philippines", "type": "article", "url": "https://www.greenpeace.org/philippines/press/10505/joint-statement-of-csos-on-the-planned-mega-vaccine-center-in-nayong-pilipino", "description": "The Filipino people need an accessible, equitable, inclusive, sustainable, and people-centered approach to the COVID19 vaccination program and not a business-oriented venture that will pose long-term threats to our health and safety. ", "image": "https://www.greenpeace.org/static/planet4-philippines-stateless/2021/05/79abb8dc-nayong-pilipino-urban-forest-park.png", "image:width": "1200", "image:height": "630", "site_name": "Greenpeace Philippines"}, "tags": ["# Pollution", "# Climate"], "tweets": [], "movies": [], "links": ["https://www.sunstar.com.ph/article/1894186/Manila/Local-News/NTF-pushes-for-mega-vaccination-site-at-Nayong-Pilipino", "https://www.philstar.com/nation/2021/04/24/2093411/5-san-juan-vaccination-hub-employees-get-covid-19", "https://www.bbc.com/news/science-environment-56889322", "https://www.sciencedirect.com/science/article/abs/pii/S1618866719304765", "https://www.greenpeace.org/southeastasia/press/44319/pm2-5-air-pollution-behind-an-estimated-160000-deaths-in-world-5-biggest-cities-in-2020/", "http://nayongpilipino.gov.ph/umpukan-sa-nayon-greening-our-cities/", "https://estuaries.org/wp-content/uploads/2019/02/Mitigating-Climate-Change-with-Coastal-Wetlands.pdf", "https://www.eurasia.undp.org/content/rbec/en/home/blog/2020/biodiversity-matters-to-stop-future-pandemics.html?fbclid=IwAR1j0_ExTDyv9U3Vo1RK_Oozjxu8p1RlFuYG5Je7ypoh8JFEdprkSaQIdBQ", "/cdn-cgi/l/email-protection"], "authors": [], "publish_date": "May 12, 2021"}