{"result_id": "146006", "URL": "https://healingoracle.ch/2021/04/20/dangerous-vaccine-side-effects/", "timestamp": "2023-04-25 15:26:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://healingoracle.ch/wp-content/uploads/2018/04/cropped-Healing_Oracle_logo5-1-1-32x32.jpg", "canonical": "https://healingoracle.ch/2021/04/20/dangerous-vaccine-side-effects/", "encoding": "UTF-8"}, "image": null, "domain": "healingoracle.ch", "title": "BE AWARE OF DANGEROUS VACCINE SIDE EFFECTS!", "cleaned_text": "The AstraZenica vaccine which is being used to vaccinate a lot of the UK population has recently stumbled across some more terrifying side effects. Some even leading to death by blood clots.\n\nEMA is reminding healthcare professionals and people receiving the vaccine to remain aware of the possibility of very rare cases of blood clots combined with low levels of blood platelets occurring within 2 weeks of vaccination.\n\nSo far, most of the cases reported have occurred in women under 60 years of age within 2 weeks of vaccination. Recent news suggests that the Australian authorities are investigating the death of a 48-year-old diabetic woman who developed blood clots after receiving a coronavirus vaccine. The woman, from Lake Macquarie on the state’s Central Coast, reportedly received the vaccine last Friday. It was initially reported she developed blood clots the next day before being placed on dialysis. But on Friday afternoon, the chief medical officer, Prof Paul Kelly, said he understood the woman had received the AstraZeneca vaccine “a few days before she became ill”. She died on Wednesday.\n\nAngela Balson: “I had my first Pfizer vaccine on 23/03/2021. For 14 days after I was feeling absolutely fine except a slight temperature and irritability. However, on day 13, I became covered in a horrendous itchy rash. I was hospitalized, I had skin biopsies taken and given various IV medications to include two types of antibiotic. I am still very fatigued, sleeping on and off all day, night sweats, pain everywhere in body, the nausea is horrendous and feel very very unwell. I will not be having my 2nd Pfizer in May.”\n\nTake a look at the photo below, do you really want to go through this? My symptoms were not even as severe as some of the other causalities that came into the same hospital.\n\nThis is extremely concerning. Yet they are still going ahead with mass vaccinations using the very same vaccine that has caused blood clots and death.\n\nEven other countries such as France, Italy and Germany have banned this specific vaccine from being used. In England alone seven people have died from unusual blood clots after getting the Oxford-AstraZeneca vaccine in the UK, the medicines regulator has confirmed to the BBC.\n\nThere have been two cases of CVSTs after Pfizer in the UK, out of more than 10 million vaccinated, but these did not have the low platelet levels. Germany has reported 31 CVSTs and nine deaths out of the 2.7 million people vaccinated there, with most cases in young or middle-aged women.\n\nAfter already administering millions of AstraZenica doses to people of all ages in the UK, under-30s in the UK are now to be offered an alternative Covid vaccine to the AstraZeneca jab due to the evidence linking it to rare blood clots. There has been 79 cases and 19 deaths and nearly two-thirds of these cases are being seen in women. The people who died were aged between 18 and 79, with three of them aged under 30. All the recorded cases occurred after the first dose, although the lower number of second doses meant it was not possible to draw any conclusions from this.\n\nThis vaccine is irreversible and even killing innocent people, this could be you, your children or your loved ones. You can decline the vaccine, do not feel pressured into getting it. Prioritise your health over statistics.\n\nSome facts to understand about the latest Vaccines for Covid 19\n\nThe vaccine is a mistake and here is the science:\n• 2. We don’t understand that vaccines should NEVER be used in an epidemic.\n• 3. We currently don’t understand exactly what the virus is.\n• 4. Do we go to war when we don’t have an understanding of our enemy.\n• 5. We don’t understand the physiology of our enemy\n• 6. We don’t know how our weapon works.\n• 7. How is that going to end?\n• 8. Please understand that this was “an environmental problem to begin with.”\n• 9. The problem is that we vaccinate people and include a long lived antibody response is that we fail to put the pieces of the puzzle together. Fact is there are long lived antibodies which have high specificity for the virus. They out compete our natural anti bodies because they are natural antibodies they have a very broad spectrum but low affinity. So by doing this even if your antibodies don’t work anymore because there is resistance or strains are different from the original strain. These specific antibodies will continue to out compete your natural antibodies. And that is a huge problem because these natural antibodies provide you with protection.\n• 10. This protection within the Vaccines are variant non specific. This doesn’t matter what variant you get, it doesn’t even matter what type of coronavirus is coming in. They protect you. Unless of course you suppress this level of immunity or it is for example out competed by long lived specific antibodies. There is no reversing this and as it stands it has the potential to do more harm.\n• 11. This is different from drugs, immunising somebody is like installing a new software on your computer. Don’t forget these antibodies will be recalled single every time you’re encountering coronavirus. You cannot just erase this. This is very serious.”\n• 12. It will leave our bodies with protection against the ONE virus Covid 19. However in the process of doing that, understand that it wipes out your natural immune system to almost zero against any other virus or attack on our immune system! In theory people could die of a common cold!\n\nWe do the research you decide, \n\n Love and Light\n\n The Healing Oracle Team \n\n Please join our growing numbers on MeWe: Healing Oracle \n\n Also join us on YouTube\n\n\n\n Global Petition\n\n\n\n Please \n\nVaccines are a global problem and need to be tackled on a global level. \n\n If we stand as one, we have a chance of saving the children of the future.\n\n\n\n Keep Us Advertising Free\n\n\n\n Healing Oracle is made possible by the support of its readers. If you find the posts and resources useful, please consider making a contribution to support us (in any amount) so we can continue to inform and assist people around the world. We feel that giving a voice to those who have transformed their health, or that of a loved one, with alternative treatment is an important mission. Thank you for valuing our work and helping it to continue.\n\n\n\n Donate. Should you choose to kindly donate towards our time and efforts, please use the ‘donations’ box above on the top right hand side (on Desktop), or the donations box below (on Mobile)\n\n\n\n Please join our growing numbers onAlso join us on Twitter Please sign our global petition against enforced vaccinations The intention of this petition is to present 5 million signatures to each President, Prime Minister, Health Minister and heads of state worldwide.Vaccines are a global problem and need to be tackled on a global level.If we stand as one, we have a chance of saving the children of the future.Healing Oracle is made possible by the support of its readers. If you find the posts and resources useful, please consider making a contribution to support us (in any amount) so we can continue to inform and assist people around the world. We feel that giving a voice to those who have transformed their health, or that of a loved one, with alternative treatment is an important mission. Thank you for valuing our work and helping it to continue.Donate. Should you choose to kindly donate towards our time and efforts, please use the ‘donations’ box above on the top right hand side, or the donations box below", "opengraph": {"description": "<p>The AstraZenica vaccine which is being used to vaccinate a lot of the UK population has recently stumbled across some more terrifying side effects. Some even leading to death by blood clots. EMA is reminding healthcare professionals and people receiving the vaccine to remain aware of the possibility of very rare cases of blood clots</p>\n", "title": "BE AWARE OF DANGEROUS VACCINE SIDE EFFECTS!", "article_author": "The Healing Oracle Team", "article_publisher": "https://www.facebook.com/healingoraclech/", "image": "https://healingoracle.ch/wp-content/uploads/2021/04/VACCINE_SIDE_EFFECTS-300x169.jpg", "type": "article", "url": "https://healingoracle.ch/2021/04/20/dangerous-vaccine-side-effects/", "site_name": "Healing Oracle", "article:published_time": "2021-04-20T11:57:36+00:00", "article:modified_time": "2021-04-20T21:29:39+00:00", "updated_time": "2021-04-20T15:29:39+03:00", "locale": "en_GB", "article:publisher": "https://www.facebook.com/healingoraclech/", "image:width": "300", "image:height": "169", "image:type": "image/jpeg"}, "tags": ["Covid Vaccine", "dangers of vacccines", "vaccine awareness", "CoVid19"], "tweets": [], "movies": [], "links": ["https://api.whatsapp.com/send?text=https%3A%2F%2Fhealingoracle.ch%2F2021%2F04%2F20%2Fdangerous-vaccine-side-effects%2F", "https://www.reddit.com/submit?url=https%3A%2F%2Fhealingoracle.ch%2F2021%2F04%2F20%2Fdangerous-vaccine-side-effects%2F", "https://www.bbc.co.uk/news/health-56620646", "https://www.bbc.co.uk/news/health-56665517", "https://drpeterscode.com/bloggers-bad-bot-exterminator-referral-affiliate-marketing-program.php", "https://mewe.com/join/healingoracle", "https://www.youtube.com/channel/UC53UQmpwLRQlnakfO5MHz7g", "https://twitter.com/_HealingOracle_", "https://healingoracle.ch/2019/05/05/make-this-a-vaccine-free-world/", "https://api.whatsapp.com/send?text=https%3A%2F%2Fhealingoracle.ch%2F2021%2F04%2F20%2Fdangerous-vaccine-side-effects%2F", "https://www.reddit.com/submit?url=https%3A%2F%2Fhealingoracle.ch%2F2021%2F04%2F20%2Fdangerous-vaccine-side-effects%2F"], "authors": ["The Healing Oracle Team"], "publish_date": "2021-04-20T11:57:36+00:00"}