{"result_id": "146008", "URL": "https://healingoracle.ch/2021/03/11/vaccine-passport-proposal-another-discriminatory-stance-by-governments/", "timestamp": "2023-04-25 15:26:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://healingoracle.ch/wp-content/uploads/2018/04/cropped-Healing_Oracle_logo5-1-1-32x32.jpg", "canonical": "https://healingoracle.ch/2021/03/11/vaccine-passport-proposal-another-discriminatory-stance-by-governments/", "encoding": "UTF-8"}, "image": null, "domain": "healingoracle.ch", "title": "‘VACCINE PASSPORT’ PROPOSAL ANOTHER DISCRIMINATORY STANCE BY GOVERNMENTS", "cleaned_text": "The President of the European Commission Ursula von der Leyen recently announced a “Digital Green Pass” for the EU citizens. This green pass will be issued to those who have received the vaccination – and excluding those who did not.\n\nWhile it seems that the support for COVI9 vaccine passports is growing, the move is bound to create a great divide amongst people. Those who can access and afford the vaccine and those who can’t will supposedly lie on the ‘good’ and ‘not so good’ side of the governments.\n\nNot to mention, besides the EU, China is the biggest supporter of Vaccine Passports. Motivated by its suppressive ‘communist philosophy,’ no wonder the probable proponent of COVID seeks to exert more control over the citizens.\n\nExperts are of the opinion that the United States can formulate a similar certification system to tag those who have received the vaccine. However, discrimination, equality and fundamental rights will pose a great hurdle for them.\n\n“It would be extraordinarily difficult in the U.S.,” Georgetown Law professor Lawrence O. Gostin stated in the context of the government’s attempt to adopt a certification system that aims to restrain the liberty of American citizens who cannot produce or possess proof of COVID-19 vaccination.\n\nExperts think that such a move will lead to increasing claims of discrimination since the vaccination will be more accessible to the privileged class than others.\n\nTo protect the so-called public health, Governments usually have a lot of legislation power to enact and enforce laws like Vaccine passport. If they can mandate vaccination by violating your bodily rights, they can definitely enforce an identifying tag on your passport!\n\nCancer and Infertility Cases Projected to Go Up\n\nWe’ve reported before how untested vaccines are leading to fatal health conditions like breast cancer, heart failure and infertility amongst people. If such blatant negligence in administering vaccines and enforcing them on people continues, it wouldn’t be surprising if one in two people come to be diagnosed with cancer or cancer-like diseases.\n\nWhile 20 years ago, such a number was considered to be a far-fetched idea, it is today a likely possibility.\n\nHowever, there are still many natural ways to subvert the ill effects of the vaccine and its side-effects. For instance, one can take GcMAF therapy from an experienced medical practitioner. Moreover, healthy eating and the inclusion of Vitamin D3 and K2 in your diet can do wonders for your health!\n\nYou can read about easing the symptoms of cancer and other health conditions through power foods and other natural ways here.\n\nWe ask why?\n\n65 years ago fund raising commenced for Cancer Research, with billions of dollars in donations every year they are still no closer to finding a “cure.” This is a huge FAIL however you look at it we see much the same options of the very same chemo, radiation and surgery, with little by way of a cure and ZERO by way of prevention.\n\nYet the billions of dollars continue to flood in and cancer research get a pat on the back for failing every year. Where is the vaccine that destroys cancer? Where is the vaccine that cures diabetes?\n\nBoth Cancer and diabetes individually have destroyed more lives than Covid. There has never been a cure for the common cold, so do you really believe that in just months that a “cure” has been found for COVID 19 and it comes in the form of vaccine? No research or longevity studies needed, yet the claims of “cure” and prevention are HUMUNGOUS but so is the propaganda, fear mongering and profiteering.\n\nWill the cost be to your health or that of a loved one? the cost of this “”cure” looks like it will be people’s health and the vaccine in this case CAN NOT be reversed. Remember this or you or/and a loved one may pay dearly later…\n\nWhy do we have Quarantine when never in the history of infectious diseases have healthy people been subject to Quarantine?\n\nThe Vaccine only allows for its use in the case of an EMERGENCY\n\nThe Vaccine remains in Trials ONLY until 2023. If lockdown and Quarantine ends, this ends the emergency administration of the Vaccine. So as things stand now, you, your children and loved ones are the trial for the vaccine. This is the Only reason for quarantine and lockdown. Hence it is now an endemic, which means it will NEVER end!\n\nWill you be taking the Vaccine?\n\nLet’s look at the word Vaccine and break it down: Vac-Sins because we have headed into a Vac-Sin-Nation with our eyes wide open to the dangers!\n\nSpread the world for a better, healthier world!\n\nWe do the research you decide, \n\n Love and Light\n\n The Healing Oracle Team \n\n Please join our growing numbers on MeWe: Healing Oracle \n\n Also join us on YouTube\n\n\n\n Global Petition\n\n\n\n Please \n\nVaccines are a global problem and need to be tackled on a global level. \n\n If we stand as one, we have a chance of saving the children of the future.\n\n\n\n Keep Us Advertising Free\n\n\n\n Healing Oracle is made possible by the support of its readers. If you find the posts and resources useful, please consider making a contribution to support us (in any amount) so we can continue to inform and assist people around the world. We feel that giving a voice to those who have transformed their health, or that of a loved one, with alternative treatment is an important mission. Thank you for valuing our work and helping it to continue.\n\n\n\n Donate. Should you choose to kindly donate towards our time and efforts, please use the ‘donations’ box above on the top right hand side (on Desktop), or the donations box below (on Mobile)\n\n\n\n Please join our growing numbers onAlso join us on Twitter Please sign our global petition against enforced vaccinations The intention of this petition is to present 5 million signatures to each President, Prime Minister, Health Minister and heads of state worldwide.Vaccines are a global problem and need to be tackled on a global level.If we stand as one, we have a chance of saving the children of the future.Healing Oracle is made possible by the support of its readers. If you find the posts and resources useful, please consider making a contribution to support us (in any amount) so we can continue to inform and assist people around the world. We feel that giving a voice to those who have transformed their health, or that of a loved one, with alternative treatment is an important mission. Thank you for valuing our work and helping it to continue.Donate. Should you choose to kindly donate towards our time and efforts, please use the ‘donations’ box above on the top right hand side, or the donations box below", "opengraph": {"description": "<p>The President of the European Commission Ursula von der Leyen recently announced a “Digital Green Pass” for the EU citizens. This green pass will be issued to those who have received the vaccination – and excluding those who did not. While it seems that the support for COVI9 vaccine passports is growing, the move is</p>\n", "title": "‘VACCINE PASSPORT’ PROPOSAL ANOTHER DISCRIMINATORY STANCE BY GOVERNMENTS", "article_author": "The Healing Oracle Team", "article_publisher": "https://www.facebook.com/healingoraclech/", "image": "https://healingoracle.ch/wp-content/uploads/2021/03/vaccines_passport-768x456.jpg", "type": "article", "url": "https://healingoracle.ch/2021/03/11/vaccine-passport-proposal-another-discriminatory-stance-by-governments/", "site_name": "Healing Oracle", "article:published_time": "2021-03-11T17:12:46+00:00", "article:modified_time": "2021-11-11T09:41:51+00:00", "updated_time": "2021-11-11T03:41:51+02:00", "locale": "en_GB", "article:publisher": "https://www.facebook.com/healingoraclech/", "image:width": "768", "image:height": "456", "image:type": "image/jpeg"}, "tags": ["covid 19", "vaccine passports"], "tweets": [], "movies": [], "links": ["https://api.whatsapp.com/send?text=https%3A%2F%2Fhealingoracle.ch%2F2021%2F03%2F11%2Fvaccine-passport-proposal-another-discriminatory-stance-by-governments%2F", "https://www.reddit.com/submit?url=https%3A%2F%2Fhealingoracle.ch%2F2021%2F03%2F11%2Fvaccine-passport-proposal-another-discriminatory-stance-by-governments%2F", "https://www.wsj.com/articles/support-for-covid-19-vaccine-passports-grows-with-european-chinese-backing-11614771850", "https://www.law.georgetown.edu/faculty/lawrence-o-gostin/", "https://healingoracle.ch/2021/03/05/covid19-vaccinated-women-show-breast-cancer-symptoms/", "https://healingoracle.ch/2021/01/20/genuine-gcmaf-for-cancer-and-autism-treatment/", "https://healingoracle.ch/2019/09/27/foods-you-can-eat-when-battling-cancer/", "https://drpeterscode.com/bloggers-bad-bot-exterminator-referral-affiliate-marketing-program.php", "https://mewe.com/join/healingoracle", "https://www.youtube.com/channel/UC53UQmpwLRQlnakfO5MHz7g", "https://twitter.com/_HealingOracle_", "https://healingoracle.ch/2019/05/05/make-this-a-vaccine-free-world/", "https://api.whatsapp.com/send?text=https%3A%2F%2Fhealingoracle.ch%2F2021%2F03%2F11%2Fvaccine-passport-proposal-another-discriminatory-stance-by-governments%2F", "https://www.reddit.com/submit?url=https%3A%2F%2Fhealingoracle.ch%2F2021%2F03%2F11%2Fvaccine-passport-proposal-another-discriminatory-stance-by-governments%2F"], "authors": ["The Healing Oracle Team"], "publish_date": "2021-03-11T17:12:46+00:00"}