{"result_id": "147048", "URL": "https://healthimpactnews.com/tag/vaccine-cult/", "timestamp": "2023-04-25 15:27:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/2/2021/07/cropped-HIN-logo-seal-2.jpg", "canonical": "https://healthimpactnews.com/tag/vaccine-cult/", "encoding": "utf-8"}, "image": null, "domain": "healthimpactnews.com", "title": "vaccine cult", "cleaned_text": "Why I am Proud to Wear the “Anti-Vaxx” Label – History and Science Show Vaccines Have NEVER Been Safe nor Effective\n\nIf you have been following the Alternative Media for any period of time now, seeking for the truth to combat the deception and lies that are coming from the pharma-funded corporate news media, you have undoubtedly heard testimonies from victims of the COVID-19 shots begin their testimony with the assertion: \"I am not an anti-vaxxer.\" The presupposition that most of these people have, whether doctors or members of the public who were fooled into taking one of the COVID-19 gene-alerting shots, is that vaccines are generally safe and effective, but the COVID-19 shots are not, and should not even be called \"vaccines\" because they don't meet the historical definition of a \"vaccine.\" For example, a recent post by a medical doctor who confessed that they had never bothered to really research the vaccine issue in the past, and has come to realize that there is no science at all behind the COVID-19 shots, and has been banned on specific social media platforms for daring to question the COVID-19 vaccine narrative, wrote this: \"Please, let me be clear: I am not commenting here on the safety or effectiveness of any vaccines, nor whether I think it’s smart or otherwise to get yourself or your children vaccinated. Of course, being vaccinated with a product that is safe in and of itself and effective at preventing an infection that can cause you long-term damage, is a very good thing. It’s a miracle. There is basically no-one on earth arguing otherwise, I promise you.\" Well, that is a false promise, because myself and many others have exposed the false narrative of the entire vaccine industry for decades now. Science has never been on the side of the vaccine peddlers. They have never been proven to be either safe, or effective. Since I have covered this issue for over a decade now, I am going to summarize in this article why those of us who have put in the long hours of research over the many years on just how evil the vaccine industry is, feel like vomiting or screaming at our computer monitors, every time someone wants to complain about how bad the COVID-19 shots are but feels compelled to begin their testimonies with the phrase \"I am not an anti-vaxxer.\" Well I AM an anti-vaxxer, and I am PROUD to wear that label, and not ashamed.", "opengraph": {}, "tags": ["Medicine Watch", "Headline"], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2021/why-i-am-proud-to-wear-the-anti-vaxx-label-history-and-science-show-vaccines-have-never-been-safe-nor-effective/"], "authors": [], "publish_date": null}