{"result_id": "147017", "URL": "https://healthimpactnews.com/tag/mandatory-vaccinations/", "timestamp": "2023-04-25 15:26:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/2/2021/07/cropped-HIN-logo-seal-2.jpg", "canonical": "https://healthimpactnews.com/tag/mandatory-vaccinations/", "encoding": "utf-8"}, "image": null, "domain": "healthimpactnews.com", "title": "mandatory vaccinations", "cleaned_text": "When Doctors Become Law Enforcement: Forced Vaccines for All Children Regardless of Medical Conditions\n\nWitnessing in their own words on the National Vaccine Information Center’s Cry for Vaccine Freedom Wall at NVIC.org, the suffering of people being abused by medical doctors enforcing one-size-fits-all vaccine policies is being revealed. Americans from all walks of life are describing the trauma of being threatened, coerced and punished by doctors violating the informed consent ethic, who have abandoned the precautionary principle of “First, do no harm” and are behaving more like prison guards than compassionate healers. When doctors and legislators are taught to consider individuals unable to get vaccinated without being harmed as expendable, and treat people defending informed consent rights like public enemy Number One, the practice of medicine and public health lawmaking has lost its way and become a prescription for prejudice, discrimination and abuse. Does the thought of going to the doctor or taking your child to a pediatrician fill you with anxiety or even fear because your doctor refuses to listen to you, makes you feel stupid and doesn’t seem to care about your child’s individual health needs? Are you concerned that your doctor will threaten or deny you or your child medical care if you decline even one of the dozens of doses of vaccines that government health officials tell your doctor to give to every patient? You are not alone. If the politically powerful Pharma-led forced vaccination lobby gets its way, all personal belief vaccine exemptions will be stripped from public health laws. Doctors employed by state health departments will be given the authority to deny vaccine vulnerable children a school education if a doctor in private practice has granted a medical exemption to vaccination for a reason that is not approved by the federal government. The goal is to force all doctors to become agents of the state without the power to depart from government policy, even if implementing government policy will increase the risk of injury or death for an individual.", "opengraph": {}, "tags": ["Medicine Watch", "Headline"], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2019/when-doctors-become-law-enforcement-forced-vaccines-for-all-children-regardless-of-medical-conditions/"], "authors": [], "publish_date": null}