{"result_id": "147024", "URL": "https://healthimpactnews.com/2023/has-wall-street-hijacked-the-vaccine-resistance-movement-by-funding-pro-vaccine-spokespeople-to-speak-against-covid-vaccines/", "timestamp": "2023-04-25 15:26:43 CEST+0200", "meta": {"description": "I have been writing about the dangers of vaccines ever since Health Impact News started 12 years ago, in January of 2011. And even before I started publishing on Health Impact News, I was warning the public about the danger of vaccines by selling books in my online store, primarily books written by Dr. Sherri Tenpenny on the flu shots, showing not only how dangerous they were, but exposing the fraud in the vaccine industry. Since 2011 I have worked with pretty much everyone in the vaccine resistance movement, giving them a voice on the Health Impact News network, until 2020 when the COVID scam was unleashed. Since 2020, the people who get the most media attention on the vaccine issue are newcomers to the movement, and the main reason they are getting most of the attention is because they have brought huge sources of funding with them to get their message out. Where has all of this funding come from since 2020, when the world's economy began to suffer a downturn, as many small and medium size businesses have now left the marketplace? We know that President Donald Trump released $trillions into the economy all in the name of \"COVID\" and the emergency health measures, and we know that most of that money went to Big Pharma and their investors. But let me be very clear right up front at the beginning of this article on just what my motivation is in publishing this. This is not just simply about money, but it is about where do we now go from here, as most of the public is now waking up to the COVID-19 \"vaccine\" fraud that is behind all the \"sudden deaths\" we are now seeing? Who do we look to for guidance in the future, as we seek to heal those who have suffered from these bioweapons, and seek justice for the criminals who caused this? This is the #1 question that has to be answered here in 2023 as we move forward, and while there are whistleblower doctors and others who have done a great job in exposing the problem, it is time now to move beyond the fact that we have a criminal problem with criminal products that are killing people, and it is time to focus on bringing the criminals to justice, and bringing down the entire criminal enterprise. And that is going to be extremely difficult, if not impossible, for those who still support the system and earn their living from the criminal system. Because the only way the COVID-19 \"vaccine\" injured are going to be healed, is to stop injecting them and their children with vaccines, ALL vaccines, and that is not going to happen with these well-funded pro-vaccine voices who only speak out against the COVID-19 shots, and not all the other vaccine products that have been maiming and killing children and adults for decades now.", "lang": "en", "keywords": "#stopallvaccines,vaccine resistance movement,headline,medicine watch", "favicon": "/wp-content/uploads/sites/2/2021/07/cropped-HIN-logo-seal-2.jpg", "canonical": "https://healthimpactnews.com/2023/has-wall-street-hijacked-the-vaccine-resistance-movement-by-funding-pro-vaccine-spokespeople-to-speak-against-covid-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "healthimpactnews.com", "title": "Has Wall Street Hijacked the Vaccine Resistance Movement by Funding Pro-Vaccine Spokespeople to Speak Against COVID Vaccines?", "cleaned_text": "I have been writing about the dangers of vaccines ever since Health Impact News started 12 years ago, in January of 2011. And even before I started publishing on Health Impact News, I was warning the public about the danger of vaccines by selling books in my online store, primarily books written by Dr. Sherri Tenpenny on the flu shots, showing not only how dangerous they were, but exposing the fraud in the vaccine industry.\n\nSince 2011 I have worked with pretty much everyone in the vaccine resistance movement, giving them a voice on the Health Impact News network, until 2020 when the COVID scam was unleashed.\n\nSince 2020, the people who get the most media attention on the vaccine issue are newcomers to the movement, and the main reason they are getting most of the attention is because they have brought huge sources of funding with them to get their message out.\n\nWhere has all of this funding come from since 2020, when the world’s economy began to suffer a downturn, as many small and medium size businesses have now left the marketplace?\n\nWe know that President Donald Trump released $trillions into the economy all in the name of “COVID” and the emergency health measures, and we know that most of that money went to Big Pharma and their investors.\n\nBut let me be very clear right up front at the beginning of this article on just what my motivation is in publishing this. This is not just simply about money, but it is about where do we now go from here, as most of the public is now waking up to the COVID-19 “vaccine” fraud that is behind all the “sudden deaths” we are now seeing?\n\nWho do we look to for guidance in the future, as we seek to heal those who have suffered from these bioweapons, and seek justice for the criminals who caused this?\n\nThis is the #1 question that has to be answered here in 2023 as we move forward, and while there are whistleblower doctors and others who have done a great job in exposing the problem, it is time now to move beyond the fact that we have a criminal problem with criminal products that are killing people, and it is time to focus on bringing the criminals to justice, and bringing down the entire criminal enterprise.\n\nAnd that is going to be extremely difficult, if not impossible, for those who still support the system and earn their living from the criminal system.\n\nBecause the only way the COVID-19 “vaccine” injured are going to be healed, is to stop injecting them and their children with vaccines, ALL vaccines, and that is not going to happen with these well-funded pro-vaccine voices who only speak out against the COVID-19 shots, and not all the other vaccine products that have been maiming and killing children and adults for decades now.\n\nI am going to begin with one of the biggest voices in the current anti COVID-19 vaccine movement, Dr. Peter McCullough.\n\nIf you search Dr. McCullough’s name on Health Impact News, you will probably find just as many positive articles on him as negative, because we gave him the credit due to him for promoting early treatments for COVID with safe, existing drugs, which could have saved the lives of millions of people, if they had listened to him.\n\nBut Dr. McCullough has also tried to censor Health Impact News, and has even threatened us via “Red Voice Media”, with slanderous statements against us, for publishing the truth about his ties to Big Pharma, including vaccine companies who have produced COVID-19 vaccines. McCullough actually accused Health Impact News of being funded by Big Pharma, with ZERO proof, because it is not true.\n\nPeter McCullough has received over $387,000 in payments from Big Pharma, including vaccine companies who produce COVID-19 vaccines, in 2020 and 2021.\n\nThis is public information and anyone can fact-check these numbers at Open Payments.\n\nPeter McCullough is now promoting his own “treatment protocol” for patients, and it includes the emergency use authorized Pfizer product, Paxlovid.\n\nDr. Joseph Ladapo is Florida’s Surgeon General. He has received a lot of press in the Alternative and Right Wing media for his alleged opposition to the COVID shots.\n\nHowever, as Surgeon General, not only has he NOT stopped the bioweapon shots from being distributed in the State of Florida, but he still recommends them for certain age groups, including young women who are pregnant and of child-bearing age.\n\nLadapo also promotes the CDC vaccine schedule, and in the most recent round table discussions held in Florida where a bunch of “experts” got together to talk about the corruption and dangers of the COVID-19 shots, several of the doctors on his panel actually LIED to the people of Florida by stating that every other vaccine, other than the COVID-19 vaccine, was perfectly safe and that parents should give all of them to their children.\n\nHear it from their own mouths:\n\nYou can easily fact-check these claims about the safety of childhood vaccines by searching the Government’s own Vaccine Adverse Events Reporting System (VAERS) for all non-COVID vaccines given to children under the age of 18, which lists over 300,000 injuries and deaths among children, which is only about 1% of the actual cases. (Source.)\n\nSurgeon General Joseph Ladapo makes $437,000 a year, and here’s how that breaks down:\n\nThe University of Florida College of Medicine announced it would pay Ladapo a base salary per year of $262,000 as a professor of general internal medicine.\n\nAccording to the employee interchange contract between UF and the Department of Health for his services, provided under a public records request filed by the USA TODAY Network–Florida, the DOH is contributing $150,000 a year to UF toward that salary.\n\nThe state also is paying an additional $100,000 a year directly to Ladapo, DOH spokeswoman Weesam Khoury said, which makes a total of $250,000 a year the DOH is paying for him. This amount is the most allowed for that position under raises for agency heads recently approved by the Florida Legislature. (Source.)\n\nDr. Ladapo earns his living from Big Pharma and the same corrupt government that gave us the COVID-19 bioweapon shots.\n\nDr. Simone Gold is the founder of America’s Frontline Doctors (AFLDS). We have published many videos and articles about Dr. Gold and the work of AFLDS, which has been invaluable to educating the public regarding the fraud surrounding the COVID-19 bioweapons.\n\nDr. Gold was reportedly sued by the AFLDS board of directors in November of 2022, for her alleged extravagant spending without the board’s approval.\n\nThis was reported by Reinette Senum, who has served as a council member and mayor of Nevada City in California. She also posted a video:\n\nWhere was all this money coming from that Simone Gold was spending?\n\nAmerica’s Frontline Doctors: All Roads Point to Israel: Big Money, hidden agendas, obfuscation, and the many disconcerting ties to AFLDS’ Dr. Simone Gold\n\nAgain, we give credit to Simone Gold and AFLDS for their very fine work in exposing the fraud surrounding COVID-19 bioweapon shots.\n\nBut is Simone Gold someone we can trust going forward to help bring down this criminal enterprise, or does she have political aspirations that would prevent that from happening?\n\nDoes Simone Gold condemn ALL vaccines, or just the COVID-19 shots?\n\nThen there is one of the newest faces in the COVID-19 “vaccine” resistance movement, Silicon Valley Billionaire Steve Kirsch. Steve admits he took the COVID shots before wising up.\n\nSteve seems to want to control who heads up this “movement,” and he certainly seems to have the money to do so. He started the Vaccine Safety Research Foundation, and he has publicly offered millions of dollars for people to join him, as he appears to be jumping into the COVID protocols market as well. He recently offered $1 million to help get a new drug, fluvoxamine, approved.\n\nHe refers to Robert F. Kennedy Jr. as his “friend and mentor,” as he anoints Kennedy as “The man who built our movement.”\n\nDoes Steve Kirsch talk about the dangers of all the other FDA approved vaccines? The name he chose for his foundation, “Vaccine Safety Research Foundation,” suggests that vaccines can be “safe”, and that he is pro-vaccine.\n\nThen there is Robert F. Kennedy Jr., and his Children’s Health Defense. Although he is a relative newcomer to the vaccine resistance movement, Children’s Health Defense (CHD) did start before COVID, in 2018. It grew out of the “World Mercury Project.”\n\nThe revenue coming into CHD has more than doubled each year, from $1,063,837 in 2018 to $2,928,566 in 2019, to $6,769,658 in 2020, the year COVID started, to an astounding $15,990,132 in 2021!\n\nMr. Kennedy’s salary has also dramatically increased, from $255,000 in 2019 to $345,561 in 2020 to $497,013 in 2021. (Source.) He now makes more money than the Florida Surgeon General, and more money than Dr. Anthony Fauci, allegedly the highest paid employee in the U.S. Federal Government. (Source.)\n\nI worked together with CHD in 2018 through 2020 by republishing much of their work and sending a ton of traffic to their site. In 2020 when they took out a lawsuit against Facebook, I made a contribution and also paid my $10 to become a “lifetime member” of CHD.\n\nAt the end of 2020 Mr. Kennedy published an article on CHD titled: It’s Time to Find Our Common Ground and Fight the Real Deep State.\n\nI was disappointed that he was seemingly promoting the same climate change agenda that the Rockefeller Foundation and others have promoted and is now being used to enslave humanity. He also stated:\n\nCHD has many fine people working for them, and a few of them used to freelance for Health Impact News, before CHD came along. So I emailed one of them requesting a time I could interview Mr. Kennedy. I wanted to clarify his position on this topic, and ask him if he was familiar with the work of Dane Wigington and geoengineering, as an alternate explanation for climate change.\n\nBut I was told he was “too busy” to be interviewed by me.\n\nSo where are all these millions of dollars flowing into CHD coming from? What other business has seen such explosive revenue during the past two years since COVID started?\n\nI was told by another publisher in the Alternative media over a year ago that the Selz Foundation, which is funded by Bernard Selz, a Wall Street Fund management company, was making large contributions to CHD, as they were the ones that funded the startup of ICAN and Del Bigtree’s Highwire.\n\nAccording to Wikipedia, the Selz Foundation no longer funds ICAN, but ICAN received $2.46 million funneled through the donor-directed charitable trust investment firm T. Rowe Price.\n\nSo there appears to be Wall Street money involved, but I decided to ask my contacts at CHD directly and emailed them:\n\nI know they received my inquiry, because they had just emailed me their 2021 tax returns, which is required by law for any 501c3 non-profit, but they declined to answer my inquiry.\n\nWhy? Are they hiding something?\n\nAgain, I want to reiterate what my motivation is in publishing this data about these declared new leaders of the vaccine resistance movement. All of these organizations and people have contributed valuable information about the fraud surrounding the COVID-19 shots. I am not suggesting anyone should stop reading or following their work.\n\nBut when it comes to the topic of solutions, and where do we go from here, I think we need to ask these tough questions about their funding and motivations, especially when it comes to healing those who have suffered, and fighting against the entire corrupt Medical Mafia system where it is hard to separate where the private sector Big Pharma corporations stop and the U.S. Government agencies, which are supposed to be looking out for the health of its citizens, start.\n\nI am going to end this article with a clip from an interview with Polly Tommey and Dr. Judy Mikovits. This was published at CHD, proving that they do put out some very fine work.\n\nDr. Mikovits pulls no punches in this interview, and drops many truth bombs. There are NO safe vaccines. They are all bioweapons, and nobody needs them. The government alphabet agencies are corrupt and run by criminals who all need to be brought to justice.\n\nJudy, more than most, would know this, because she worked for the government for years on HIV research, and knows first hand how evil these people are.\n\nIn my opinion, if anyone claims to be against the COVID-19 bioweapon shots, but does not admit the same truths that Judy clearly explains here, then they are not to be trusted when they talk about “solutions.”\n\nThis is on our Bitchute channel, but originally from CHD.TV. I have abridged it down to just over 10 minutes. Watch it! This is where we draw the line in the sand if you are part of the REAL vaccine resistance movement.\n\nNote: For anyone who feels slighted or that I mis-portrayed them in this article, and that they do in fact oppose ALL vaccines and believe that nobody should be injected with ANY vaccines, as Dr. Mikovits explains in this video, just email me your statement to that effect, and I will be happy to publish it here as a rebuttal.\n\nUnderstand the Times We are Currently Living Through\n\nThe God of All Comfort\n\nYear 2023: Will America Fulfill Its Destiny? Jesus Christ is the Only “Transhuman” the World Has Ever Seen or Will Ever See\n\nAn Invitation to the Technologists to Join the Winning Side\n\nSynagogue of Satan: Why It’s Time to Leave the Corporate Christian Church\n\nHow to Determine if you are a Disciple of Jesus Christ or Not\n\nEpigenetics Exposes Darwinian Biology as a Religion – Your DNA Does NOT Determine Your Health!\n\nWhat Happens When a Holy and Righteous God Gets Angry? Lessons from History and the Prophet Jeremiah\n\nInsider Exposes Freemasonry as the World’s Oldest Secret Religion and the Luciferian Plans for The New World Order\n\nIdentifying the Luciferian Globalists Implementing the New World Order – Who are the “Jews”?", "opengraph": {"locale": "en_US", "site_name": "Health Impact News", "type": "article", "title": "Has Wall Street Hijacked the Vaccine Resistance Movement by Funding Pro-Vaccine Spokespeople to Speak Against COVID Vaccines?", "description": "I have been writing about the dangers of vaccines ever since Health Impact News started 12 years ago, in January of 2011. And even before I started publishing on Health Impact News, I was warning the public about the danger of vaccines by selling books in my online store, primarily books written by Dr. Sherri Tenpenny on the flu shots, showing not only how dangerous they were, but exposing the fraud in the vaccine industry. Since 2011 I have worked with pretty much everyone in the vaccine resistance movement, giving them a voice on the Health Impact News network, until 2020 when the COVID scam was unleashed. Since 2020, the people who get the most media attention on the vaccine issue are newcomers to the movement, and the main reason they are getting most of the attention is because they have brought huge sources of funding with them to get their message out. Where has all of this funding come from since 2020, when the world's economy began to suffer a downturn, as many small and medium size businesses have now left the marketplace? We know that President Donald Trump released $trillions into the economy all in the name of \"COVID\" and the emergency health measures, and we know that most of that money went to Big Pharma and their investors. But let me be very clear right up front at the beginning of this article on just what my motivation is in publishing this. This is not just simply about money, but it is about where do we now go from here, as most of the public is now waking up to the COVID-19 \"vaccine\" fraud that is behind all the \"sudden deaths\" we are now seeing? Who do we look to for guidance in the future, as we seek to heal those who have suffered from these bioweapons, and seek justice for the criminals who caused this? This is the #1 question that has to be answered here in 2023 as we move forward, and while there are whistleblower doctors and others who have done a great job in exposing the problem, it is time now to move beyond the fact that we have a criminal problem with criminal products that are killing people, and it is time to focus on bringing the criminals to justice, and bringing down the entire criminal enterprise. And that is going to be extremely difficult, if not impossible, for those who still support the system and earn their living from the criminal system. Because the only way the COVID-19 \"vaccine\" injured are going to be healed, is to stop injecting them and their children with vaccines, ALL vaccines, and that is not going to happen with these well-funded pro-vaccine voices who only speak out against the COVID-19 shots, and not all the other vaccine products that have been maiming and killing children and adults for decades now.", "url": "https://healthimpactnews.com/2023/has-wall-street-hijacked-the-vaccine-resistance-movement-by-funding-pro-vaccine-spokespeople-to-speak-against-covid-vaccines/", "image": "https://healthimpactnews.com/wp-content/uploads/sites/2/2023/01/New-faces-vaccine-resistance-movement-3.jpg", "image:secure_url": "https://healthimpactnews.com/wp-content/uploads/sites/2/2023/01/New-faces-vaccine-resistance-movement-3.jpg", "image:width": "1032", "image:height": "666", "article:published_time": "2023-01-04T00:43:57+00:00", "article:modified_time": "2023-01-04T16:48:09+00:00"}, "tags": ["#stopALLvaccines", "vaccine resistance movement"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" title=\"Robert F Kenedy Jr. is Pro Vaccine\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/oisntdEljnM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/oisntdEljnM?feature=oembed"}], "links": ["https://healthytraditions.com/", "https://healthimpactnews.com/2022/pro-vaccine-dr-peter-mccullough-attacks-health-impact-news-with-false-claims/", "https://healthimpactnews.com/2022/peter-mccullough-tries-to-censor-health-impact-news/", "https://openpaymentsdata.cms.gov/physician/335114", "https://t.me/DrJaneRuby", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&PERPAGE=100&VAX[]=6VAX-F&VAX[]=ADEN&VAX[]=ADEN_4_7&VAX[]=ANTH&VAX[]=BCG&VAX[]=CEE&VAX[]=CHOL&VAX[]=DF&VAX[]=DPIPV&VAX[]=DPP&VAX[]=DT&VAX[]=DTAP&VAX[]=DTAPH&VAX[]=DTAPHEPBIP&VAX[]=DTAPIPV&VAX[]=DTAPIPVHIB&VAX[]=DTIPV&VAX[]=DTOX&VAX[]=DTP&VAX[]=DTPHEP&VAX[]=DTPHIB&VAX[]=DTPIHI&VAX[]=DTPIPV&VAX[]=DTPPHIB&VAX[]=DTPPVHBHPB&VAX[]=EBZR&VAX[]=FLU(H1N1)&VAX[]=FLU3&VAX[]=FLU4&VAX[]=FLUA3&VAX[]=FLUA4&VAX[]=FLUC3&VAX[]=FLUC4&VAX[]=FLUN(H1N1)&VAX[]=FLUN3&VAX[]=FLUN4&VAX[]=FLUR3&VAX[]=FLUR4&VAX[]=FLUX&VAX[]=FLUX(H1N1)&VAX[]=H5N1&VAX[]=HBHEPB&VAX[]=HBPV&VAX[]=HEP&VAX[]=HEPA&VAX[]=HEPAB&VAX[]=HEPATYP&VAX[]=HIBV&VAX[]=HPV2&VAX[]=HPV4&VAX[]=HPV9&VAX[]=HPVX&VAX[]=IPV&VAX[]=JEV&VAX[]=JEV1&VAX[]=JEVX&VAX[]=LYME&VAX[]=MEA&VAX[]=MEN&VAX[]=MENB&VAX[]=MENHIB&VAX[]=MER&VAX[]=MM&VAX[]=MMR&VAX[]=MMRV&VAX[]=MNC&VAX[]=MNQ&VAX[]=MNQHIB&VAX[]=MU&VAX[]=MUR&VAX[]=OPV&VAX[]=PER&VAX[]=PLAGUE&VAX[]=PNC&VAX[]=PNC10&VAX[]=PNC13&VAX[]=PNC15&VAX[]=PNC20&VAX[]=PPV&VAX[]=RAB&VAX[]=RUB&VAX[]=RV&VAX[]=RV1&VAX[]=RV5&VAX[]=RVX&VAX[]=SMALL&VAX[]=SMALLMNK&VAX[]=SSEV&VAX[]=TBE&VAX[]=TD&VAX[]=TDAP&VAX[]=TDAPIPV&VAX[]=TTOX&VAX[]=TYP&VAX[]=UNK&VAX[]=VARCEL&VAX[]=VARZOS&VAX[]=YF&WhichAge=range&LOWAGE=0&HIGHAGE=18", "https://www.tallahassee.com/story/news/local/state/2021/10/11/floridas-new-surgeon-general-gets-52-pay-hike-over-predecessor/6088509001/", "https://www.tallahassee.com/story/news/local/state/2021/10/28/florida-state-employees-jobs-pay-surgeon-general-joseph-ladapo/6180271001/", "https://americasfrontlinedoctors.org/about-us/press-releases/dr-simone-gold-reaffirms-her-leadership-role-at-america-s-frontline-doctors-aflds-and-announces-organizational-reform-and-future-initiatives", "https://www.redvoicemedia.com/wp-content/uploads/2022/11/2022.11.07-11.05-redvoicemedia-63698f44093ca.pdf", "https://www.motherjones.com/politics/2022/06/insurrectionist-anti-vaxx-doctor-simone-gold-was-just-sentenced-to-60-days-in-jail/", "https://reinettesenumsfoghornexpress.substack.com/p/americas-frontline-doctors-founder", "https://reinettesenumsfoghornexpress.substack.com/p/americas-frontline-doctors-all-roads", "https://www.skirsch.io/25-000-reward-if-you-can-show-we-need-more-data-re-fluvoxamine-for-covid-19/", "https://healthimpactnews.com/wp-content/uploads/sites/2/2022/12/CHD-2021-Form-990-Public.pdf", "https://www.forbes.com/sites/adamandrzejewski/2021/01/25/dr-anthony-fauci-the-highest-paid-employee-in-the-entire-us-federal-government/", "https://childrenshealthdefense.org/about-us/membership/", "https://childrenshealthdefense.org/defender/fight-the-real-deep-state/", "https://en.wikipedia.org/wiki/Informed_Consent_Action_Network", "https://healthimpactnews.com/wp-content/uploads/sites/2/2022/12/CHD-2021-Form-990-Public.pdf", "https://www.bitchute.com/video/9xOwiBvERWXH/", "https://created4health.org/the-god-of-all-comfort/", "https://created4health.org/the-god-of-all-comfort/", "https://created4health.org/year-2023-will-america-fulfill-its-destiny-jesus-christ-is-the-only-trans-human-the-world-has-ever-seen-or-will-ever-see/", "https://created4health.org/year-2023-will-america-fulfill-its-destiny-jesus-christ-is-the-only-trans-human-the-world-has-ever-seen-or-will-ever-see/", "https://created4health.org/an-invitation-to-the-technologists-to-join-the-winning-side/", "https://created4health.org/an-invitation-to-the-technologists-to-join-the-winning-side/", "https://created4health.org/synagogue-of-satan-why-its-time-to-leave-the-corporate-christian-church/", "https://created4health.org/synagogue-of-satan-why-its-time-to-leave-the-corporate-christian-church/", "https://created4health.org/how-to-determine-if-you-are-a-disciple-of-jesus-christ-or-not/", "https://created4health.org/how-to-determine-if-you-are-a-disciple-of-jesus-christ-or-not/", "https://healthimpactnews.com/2023/epigenetics-exposes-darwinian-biology-as-a-religion-your-dna-does-not-determine-your-health/", "https://healthimpactnews.com/2023/epigenetics-exposes-darwinian-biology-as-a-religion-your-dna-does-not-determine-your-health/", "https://created4health.org/what-happens-when-a-holy-and-righteous-god-gets-angry-lessons-from-history-and-the-prophet-jeremiah/", "https://created4health.org/what-happens-when-a-holy-and-righteous-god-gets-angry-lessons-from-history-and-the-prophet-jeremiah/", "https://healthimpactnews.com/2021/insider-exposes-freemasonry-as-the-worlds-oldest-secret-religion-and-the-luciferian-plans-for-the-new-world-order/", "https://healthimpactnews.com/2021/insider-exposes-freemasonry-as-the-worlds-oldest-secret-religion-and-the-luciferian-plans-for-the-new-world-order/", "https://healthimpactnews.com/2021/identifying-the-luciferian-globalists-implementing-the-new-world-order-who-are-the-jews/", "https://healthimpactnews.com/2021/identifying-the-luciferian-globalists-implementing-the-new-world-order-who-are-the-jews/", "https://created4health.org/fact-check-christianity-and-the-christian-religion-is-not-found-in-the-bible-the-person-jesus-christ-is/", "https://created4health.org/fact-check-christianity-and-the-christian-religion-is-not-found-in-the-bible-the-person-jesus-christ-is/", "https://created4health.org/the-seal-and-mark-of-god-is-far-more-important-than-the-mark-of-the-beast-are-you-prepared-for-whats-coming/", "https://created4health.org/the-seal-and-mark-of-god-is-far-more-important-than-the-mark-of-the-beast-are-you-prepared-for-whats-coming/", "https://created4health.org/the-satanic-roots-to-modern-medicine-the-mark-of-the-beast/", "https://created4health.org/the-satanic-roots-to-modern-medicine-the-mark-of-the-beast/", "https://created4health.org/medicine-idolatry-in-the-twenty-first-century/", "https://created4health.org/medicine-idolatry-in-the-twenty-first-century/", "https://created4health.org/make-reading-the-bible-a-new-year-resolution-it-could-change-your-life/", "https://healthimpactnews.com/2020/how-to-beat-internet-censorship-and-create-your-own-newsfeed/", "https://healthimpactnews.com/2020/how-to-beat-internet-censorship-and-create-your-own-newsfeed/", "https://t.me/healthimpact", "https://www.bitchute.com/channel/HlyeDvlqcVJm/", "https://odysee.com/@HealthImpactNews:1", "https://t.me/healthimpact", "https://www.bitchute.com/channel/HlyeDvlqcVJm/", "https://odysee.com/@HealthImpactNews:1", "https://www.torproject.org/", "https://www.torproject.org/", "http://a272fk5d36p7qbmdgcf5d4dwwmhncdkteqmnzbercp75hgycbmytb4ad.onion/", "http://mhr6ji2fyhcaeviqoz2yyx7vq5neq54yqdlkvxyg2j3yl2ktxizc36id.onion/", "http://ahdemogiwgycere5gc3r4lzyusa77ksrt6q7fcc2nall27gpnxkzdvid.onion/", "http://f7rkl2pb2uwyyrw3mgaxstwig3nhpl25fhjdvoultpn4j56n3vkbgkad.onion/", "http://mh7mycgri5w3vdm3jmuir6dhtecgu76njt2eehqhiwxrygiivq53i5ad.onion/", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2023-01-04T00:43:57+00:00"}