{"result_id": "148027", "URL": "https://www.health.news/2022-10-02-pandemics-agenda-enslave-human-race-following-depopulation.html", "timestamp": "2023-04-25 15:27:34 CEST+0200", "meta": {"description": "Renowned virologist and biomedical research scientist Dr. Judy Mikovits told the equally controversial InfoWars founder and host Alex Jones that the real agenda behind the engineered Wuhan coronavirus (COVID-19) pandemic is to take full control of the human race following the depopulation efforts. “The plan of globalists is to control us, put us in a place […]", "lang": "en", "keywords": "Alex Jones,badhealth,badmedicine,Big Pharma,biological weapons,biowar,conspiracy,covid-19,Dangerous Medicine,deception,depopulation,Dr. Judy Mikovits,enslaved,evil,Fauci,freedom,genetic lunacy,genocide,great reset,HIV,humanity,InfoWars,Liberty,medical violence,mRNA vaccines,obey,pandemic,pharmaceutical fraud,Plandemic,population collapse,spike protein,transhumanism,Tyranny,vaccines,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-10-02-pandemics-agenda-enslave-human-race-following-depopulation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Plandemic end game: Real agenda behind pandemic is to enslave the human race following depopulation, says Dr. Judy Mikovits", "cleaned_text": "Plandemic end game: Real agenda behind pandemic is to enslave the human race following depopulation, says Dr. Judy Mikovits\n\nRenowned virologist and biomedical research scientist Dr. Judy Mikovits told the equally controversial InfoWars founder and host Alex Jones that the real agenda behind the engineered Wuhan coronavirus (COVID-19) pandemic is to take full control of the human race following the depopulation efforts.\n\n“The plan of globalists is to control us, put us in a place of subservience and to try to make us think our God is not all we need,” Mikovits told Jones in her recent appearance on the show. “The end game was to control your brain and movement to create human 2.0. The end game is to be God.”\n\nThe New York Times bestselling author added that the summation of what they are doing is “driving a narrative to the premeditated murder of everyone who was vaccine injured over the last 40 years, regardless of the vaccine, and preservation of the favored species that they can control.”\n\nMikovits pointed out that what they’re injecting is a synthetic lab-manufactured virus called xenotropic murine leukemia virus-related virus (XMRV). (Related: Dr. Judy Mikovits: Every single mRNA vaccine is a synthetic virus – Brighteon.TV.)\n\nShe also emphasized that the “experts” who engineered the plandemic knew that a virus knows the immune system based on race gender and even culture and so it can target the vaccine-injured.\n\n“It’s been a giant experiment for 40 years to kill these susceptible people. They intended to kill the blacks, women and children as they knew their immune systems,” she said. “The synthetic RNA was weaponized to kill the people who had been injured with the shots.”\n\nJones added that pieces of evidence are now surfacing and people are stepping up. Government agencies are slowly backing off, with the Centers for Disease Control and Prevention (CDC) admitting that it failed to do its job and the Food and Drug Administration (FDA) board now saying not to give the vaccine to kids.\n\nWith all that has happened in the last two to three years, Mikovits is confident more people will resist the vaccines and not let the president’s Chief Medical Advisor Anthony Fauci get away with the “crimes to humanity” he committed.\n\nShe is standing firm on the fact that lab origins of the current pandemic are hardly novel – that every “pandemic” has had lab origins since 1984 when Fauci started working at the National Institute of Allergy and Infectious Diseases. Mikovits even said in an article on Tap News Wire last year that the scenario will be the same as how Fauci, Institute of Human Virology’s Bob Gallo, the people at the top of the National Institutes of Health, CDC and FDA lied to the people about HIV/AIDS.\n\n“Until we hold these criminals accountable, we won’t see the end of this,” she said.\n\nFreebies, incentives offered to entice people to get vaccinated\n\nElsewhere in the show, Jones played a montage of videos showing various adverts and enticing commercials to get people vaccinated. The presentation showed how people are incentivized just to take the COVID-19 shots – bribing them with cash, college scholarships, free beer, lottery tickets, vehicles, guns, Super Bowl tickets donuts and hamburgers.\n\n“They need you to give up your free will and accept this. They’re just out there in the open,” Jones said after playing the clip.\n\nMikovits quipped: “I honestly thought the hamburger is GMO which is an adjuvant to the poison. So it’ll kill you quicker.”\n\nShe added that everyone’s being forced to take the shots right now or maybe most people aren’t taking the shots.\n\n“We’ve won already. Nobody’s taking that shot,” she said. Public health officials may attempt to put back restrictive measures and put other diseases in play, but Mikovits believes the people have already learned their lesson. “It doesn’t matter because people will say ‘not again,'” she said.\n\nVisit MedicalTyranny.com for more news about government tyranny being implemented in the guise of public health measures.\n\nWatch the full segment of “InfoWars” with Alex Jones featuring Dr. Judy Mikovits below.\n\nThis video is from the Leona Wind channel on Brighteon.com.\n\nDr. Judy Mikovits sounds the alarm on EXPLODING cancer rates courtesy of COVID vaccines.\n\nDr. Judy Mikovits: Never bypass innate immune response, never get the COVID shot – Brighteon.TV.\n\nDr. Judy Mikovits – Fauci is behind every pandemic since 1984.\n\nDr. Mikovits: SARS-CoV-2 is actually a lab-made monkey cell virus, readily deployed through the flu, MMR and polio vaccine supply.", "opengraph": {"title": "Plandemic end game: Real agenda behind pandemic is to enslave the human race following depopulation, says Dr. Judy Mikovits", "type": "article", "url": "https://www.health.news/2022-10-02-pandemics-agenda-enslave-human-race-following-depopulation.html", "site_name": "Health News", "description": "Renowned virologist and biomedical research scientist Dr. Judy Mikovits told the equally controversial InfoWars founder and host Alex Jones that the real agenda behind the engineered Wuhan coronavirus (COVID-19) pandemic is to take full control of the human race following the depopulation efforts. “The plan of globalists is to control us, put us in a place […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/10/Judy-Mikovits-science-warning.jpg"}, "tags": ["pandemic", "conspiracy", "great reset", "Liberty", "Big Pharma", "deception", "medical violence", "humanity", "covid-19", "Dr. Judy Mikovits", "HIV", "spike protein", "genetic lunacy", "obey", "Wuhan coronavirus", "population collapse", "enslaved", "Fauci", "mRNA vaccines", "depopulation", "biological weapons", "Tyranny", "evil", "biowar", "InfoWars", "genocide", "vaccines", "transhumanism", "Alex Jones", "freedom", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/6b2547c1-8e36-4b0d-a205-e3a9f680be70", "https://therealdrjudy.com/about-judy", "https://naturalnews.com/2022-04-21-judy-mikovits-mrna-vaccine-is-synthetic-virus.html#", "https://www.brighteon.tv", "https://tapnewswire.com/2021/09/dr-judy-mikovits-getting-closer-to-exposing-who-created-cancer-and-all-the-pandemics/", "https://medicaltyranny.com/", "https://www.brighteon.com/6b2547c1-8e36-4b0d-a205-e3a9f680be70", "https://www.brighteon.com/channels/leonawind", "https://naturalnews.com/2022-09-21-dr-mikovits-covid-vaccines-increased-cancer-rates.html", "https://vaccineinjurynews.com/2022-03-28-never-bypass-innate-immune-response-says-mikovitz.html", "https://deception.news/2021-09-27-fauci-is-behind-every-pandemic-since-1984.html", "https://vaccines.news/2021-08-11-dr-mikovits-sars-cov-2-lab-made-virus-deployed-through-vaccine-supply.html", "https://www.brighteon.com/6b2547c1-8e36-4b0d-a205-e3a9f680be70", "https://therealdrjudy.com/about-judy", "https://tapnewswire.com/2021/09/dr-judy-mikovits-getting-closer-to-exposing-who-created-cancer-and-all-the-pandemics/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-10-02-pandemics-agenda-enslave-human-race-following-depopulation.html&linkname=Plandemic%20end%20game%3A%20Real%20agenda%20behind%20pandemic%20is%20to%20enslave%20the%20human%20race%20following%20depopulation%2C%20says%20Dr.%20Judy%20Mikovits", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}