{"result_id": "148017", "URL": "https://health.news/2022-10-07-americans-sought-medical-care-after-covid19-vaccination.html", "timestamp": "2023-04-25 15:27:25 CEST+0200", "meta": {"description": "Hundreds of thousands of Americans sought medical care after getting a COVID-19 vaccine, according to Centers for Disease Control and Prevention (CDC) data released on Oct. 3. (Article by Zachary Stieber republished from TheEpochTimes.com) Roughly 782,900 people reported seeking medical attention, emergency room care, and/or hospitalization following COVID-19 vaccination. Another 2.5 million people reported needing to miss […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,CDC,covid-19,Dangerous Medicine,ICAN,pandemic,pharmaceutical fraud,spike protein,truth,V-safe,vaccine damage,vaccine injury,vaccine safety monitoring,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://health.news/2022-10-07-americans-sought-medical-care-after-covid19-vaccination.html", "encoding": "UTF-8"}, "image": null, "domain": "health.news", "title": "Hundreds of thousands of Americans sought medical care after COVID-19 vaccination: CDC data", "cleaned_text": "Hundreds of thousands of Americans sought medical care after COVID-19 vaccination: CDC data\n\nHundreds of thousands of Americans sought medical care after getting a COVID-19 vaccine, according to Centers for Disease Control and Prevention (CDC) data released on Oct. 3.\n\nRoughly 782,900 people reported seeking medical attention, emergency room care, and/or hospitalization following COVID-19 vaccination. Another 2.5 million people reported needing to miss school, work, or other normal activities as a result of a health event after getting a COVID-19 vaccine.\n\nThe reports were made to the CDC’s V-safe program, a new vaccine safety monitoring system to which users can report issues through smartphones.\n\nThe CDC released the data to the Informed Consent Action Network (ICAN) after being sued over not producing the data when it was requested by the nonprofit. ICAN posted a dashboard summarizing the data.\n\n“It took numerous legal demands, appeals, and two lawsuits, and over a year, but the CDC finally capitulated and agreed to a court order requiring them to do what they should have done from day one, release the V-safe data to the public,” Aaron Siri, a lawyer representing ICAN in the case, told The Epoch Times in an email.\n\nAbout 10 million people utilized V-safe during the period of time the data covers: Dec. 14, 2020, to July 31, 2022. About 231 million Americans received at least one vaccine dose during that time.\n\nThe most commonly reported symptoms were chills (3.5 million), swelling (3.6 million), joint pain (4 million), muscle or body aches (7.8 million), headache (9.7 million), fatigue (12.7 million), and general pain (19.5 million).\n\nAbout 4.2 million of the symptoms were of severe severity.\n\nUsers of V-safe filled in data for about 13,000 children younger than 2 years old, reporting more than 33,000 symptoms, including pain, loss of appetite, and irritability.\n\nThe data produced so far by the CDC don’t include free-text responses, according to ICAN. The data covered fields where users checked boxes.\n\nICAN, founded by film producer Del Bigtree, stated that the newly released data “reveals shocking information that should have caused the CDC to immediately shut down its COVID-19 vaccine program,” citing the percentage of people who reported needing to get care or missing school, work, or other normal activities, as well as the reported adverse events.\n\nCDC officials didn’t respond by press time to a request for comment.\n\nCDC researchers had presented summaries of the V-safe data during meetings with the agency’s vaccine advisory panel but hadn’t released the data for outside researchers to analyze. CDC researchers have said that V-safe raised no new safety concerns.\n\nICAN is going to keep pressing to obtain more of the V-safe data.\n\nU.S. District Judge Robert Pitman, an Obama appointee overseeing the litigation, ordered the parties to meet and confer regarding what other data the group will seek following the CDC production of the data.\n\nPitman said the parties will then file a joint status report “that proposes any additional deadlines that the parties determine are necessary for the resolution of this matter.”", "opengraph": {"title": "Hundreds of thousands of Americans sought medical care after COVID-19 vaccination: CDC data", "type": "article", "url": "https://www.health.news/2022-10-07-americans-sought-medical-care-after-covid19-vaccination.html", "site_name": "Health News", "description": "Hundreds of thousands of Americans sought medical care after getting a COVID-19 vaccine, according to Centers for Disease Control and Prevention (CDC) data released on Oct. 3. (Article by Zachary Stieber republished from TheEpochTimes.com) Roughly 782,900 people reported seeking medical attention, emergency room care, and/or hospitalization following COVID-19 vaccination. Another 2.5 million people reported needing to miss […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/10/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["pandemic", "covid-19", "Big Pharma", "V-safe", "ICAN", "vaccine injury", "vaccine safety monitoring", "vaccines", "pharmaceutical fraud", "spike protein", "truth", "vaccine damage", "biological weapon", "CDC"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/t-centers-for-disease-control-and-prevention", "https://www.theepochtimes.com/hundreds-of-thousands-of-americans-sought-medical-care-after-covid-19-vaccination-cdc-data_4772435.html", "https://www.theepochtimes.com/cdc-sued-for-withholding-post-licensure-v-safe-data-on-covid-19-vaccines_4186979.html", "https://www.icandecide.org/v-safe-data/", "https://www.brighteon.tv", "https://www.theepochtimes.com/hundreds-of-thousands-of-americans-sought-medical-care-after-covid-19-vaccination-cdc-data_4772435.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-10-07-americans-sought-medical-care-after-covid19-vaccination.html&linkname=Hundreds%20of%20thousands%20of%20Americans%20sought%20medical%20care%20after%20COVID-19%20vaccination%3A%20CDC%20data", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}