{"result_id": "148010", "URL": "https://www.health.news/2022-10-07-david-martin-covid-vaccines-will-kill-700m.html", "timestamp": "2023-04-25 15:27:17 CEST+0200", "meta": {"description": "It is a chilling thought to think of just how many people in the coming months and years are going to die because of getting “vaccinated” for the Wuhan coronavirus (COVID-19). According to Dr. David Martin, as many as 700 million people worldwide will succumb to an early grave because of the shots, which we […]", "lang": "en", "keywords": "badhealth,badmedicine,covid-19,Dangerous Medicine,David Martin,depopulation,microvascular,pandemic,Peter Halligan,Robert Young,spike proteins,Steve Kirsch,vaccination,vaccine,vaccine damage,Vaccine deaths,WHO,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-10-07-david-martin-covid-vaccines-will-kill-700m.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "700 million people will DIE from COVID injections, says Dr. David Martin", "cleaned_text": "700 million people will DIE from COVID injections, says Dr. David Martin\n\nIt is a chilling thought to think of just how many people in the coming months and years are going to die because of getting “vaccinated” for the Wuhan coronavirus (COVID-19).\n\nAccording to Dr. David Martin, as many as 700 million people worldwide will succumb to an early grave because of the shots, which we know flood a person’s body with deadly, clot-forming spike proteins (Related: Fauci Flu shots are also causing people to go bald).\n\nMartin came up with this number after poring through data from the World Health Organization’s (WHO) “Decade of Vaccines” vision, which was put together in collaboration with billionaire eugenicist Bill Gates, who lives to vaccinate.\n\nIt was in 2011 when the WHO announced the Decade of Vaccines plan, which aims to depopulate the world by about 15 percent. That figure amounts to about 700 million people.\n\nBack in August 2021, Dr. Robert Young estimated that 500 million people worldwide had already at that time been injured by the jabs, with possibly 35 million deaths.\n\nThis past August, Steve Kirsch threw out a more conservative ballpark figure of 12 million deaths from covid jabbing, based on an estimate of one death per 1,000 doses.\n\n“We are killing nearly close to 10,000 people every single day,” Kirsch wrote.\n\n“It’s going to get much worse,” Martin warns\n\nThat same month, Peter Halligan pieced together data suggesting that as many as 20 million people have thus far died from the shots, while a whopping 2.2 billion have suffered at least one injury.\n\nAll of this suggests that things are only just getting started in terms of the fallout from these mystery injections. Assuming only 20 million people have died, we are only about three percent of the way there to the full death count.\n\nTo think that hundreds of millions of people are now the walking dead – meaning they could drop dead at any moment once the clots fully form in just the right spot – is nothing short of disturbing.\n\n“It’s going to get much worse,” warned Martin during an hourlong interview with USA Watchdog back in June, referring to the injections as “bioweapons.”\n\n“It is not a coronavirus vaccine. It is a spike protein instruction manual to make the human body produce a toxin.”\n\n“The fact of the matter is the injections are an act of biomicroweapons and bioterrorism. They are not a public health measure. The facts are very simple. This was premeditated … This was a campaign of domestic terror to get the public to accept the universal vaccine platform using a known biological weapon. That is their own words and not my interpretation.”\n\nIn the United States, Martin expects up to one-third of the entire population to be dead by the time this is all said and done. Anywhere from 75 million to 100 million people who took the jabs will have passed away by the time these injections run their course around 2028.\n\n“There are a lot of reasons why they hope it will be between now and 2028 because there is this tiny little glitch of the illiquidity of the Social Security, Medicare and Medicaid programs,” Martin says.\n\n“So, the fewer recipients of Social Security, Medicare and Medicaid, the better. Not surprisingly, the recommendation was people over the age of 65 were the first ones to get injected.”\n\nMartin also spoke about all the pilots who are suffering microvascular and clotting problems due to all their time up in the air. This is, of course, dangerous for both passengers and folks on the ground who could end up becoming the unlucky ones with an airplane through their roof.\n\nThe latest news about Chinese Virus shots can be found at ChemicalViolence.com.", "opengraph": {"title": "700 million people will DIE from COVID injections, says Dr. David Martin", "type": "article", "url": "https://www.health.news/2022-10-07-david-martin-covid-vaccines-will-kill-700m.html", "site_name": "Health News", "description": "It is a chilling thought to think of just how many people in the coming months and years are going to die because of getting “vaccinated” for the Wuhan coronavirus (COVID-19). According to Dr. David Martin, as many as 700 million people worldwide will succumb to an early grave because of the shots, which we […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/10/Death-Holocaust-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "Robert Young", "covid-19", "vaccination", "Wuhan coronavirus", "Vaccine deaths", "David Martin", "spike proteins", "vaccine", "depopulation", "vaccine damage", "microvascular", "Peter Halligan", "WHO", "Steve Kirsch"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/10/05/expert-claims-covid-vaccines-will-kill-700-million/", "https://naturalnews.com/2021-09-15-want-to-go-bald-get-covid-vaccine.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://expose-news.com/2022/10/05/expert-claims-covid-vaccines-will-kill-700-million/", "https://naturalnews.com/2021-09-15-want-to-go-bald-get-covid-vaccine.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-10-07-david-martin-covid-vaccines-will-kill-700m.html&linkname=700%20million%20people%20will%20DIE%20from%20COVID%20injections%2C%20says%20Dr.%20David%20Martin", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}