{"result_id": "148016", "URL": "https://www.health.news/2022-09-16-covid-vaccination-no-more-under-50-denmark.html", "timestamp": "2023-04-25 15:27:25 CEST+0200", "meta": {"description": "The Danish Health Authority has announced that just about every young and middle-aged person in Denmark is now prohibited from getting “vaccinated” for covid. If you are under the age of 50, the Danish government says, then you are not allowed to take the shots. Previously, the Danish government prohibited the drug injections for everyone […]", "lang": "en", "keywords": "awakening,banned,big government,Big Pharma,Chinese germs,COVID,Denmark,goodhealth,goodmedicine,infections,outbreak,pharmaceutical fraud,Plandemic,vaccination,vaccine,vaccine wars,zero risk", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-09-16-covid-vaccination-no-more-under-50-denmark.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Covid vaccinations now PROHIBITED in people under 50 in Denmark", "cleaned_text": "Covid vaccinations now PROHIBITED in people under 50 in Denmark\n\nThe Danish Health Authority has announced that just about every young and middle-aged person in Denmark is now prohibited from getting “vaccinated” for covid.\n\nIf you are under the age of 50, the Danish government says, then you are not allowed to take the shots. Previously, the Danish government prohibited the drug injections for everyone under the age of 18. (Related: Last fall, Denmark joined Sweden in banning Moderna’s covid injection after it was determined to cause myocarditis in young people.)\n\nThe only people under 50 who can receive the shots are those who are deemed to have a “higher risk of becoming severely [emphasis added] [ill] from Covid-19,” the government of Denmark said.\n\nHow this will be determined has yet to be fleshed out, but what we know is that the vast majority of Denmark is not only no longer at risk of being forced to get jabbed, but is actually prohibited from ever doing so again.\n\nThis is the kind of just say no to drugs campaign that we wish would launch in the United States and elsewhere, but pigs will fly before that ever happens.\n\nImplicit in the Danish announcement is the idea that messenger RNA (messenger RNA) injections specifically come with far greater risks than any purported benefits. The same is true for the non-mRNA covid jabs still being pushed as well.\n\nDenmark expecting another “large wave” of covid over winter, but since the jabs don’t help there is no reason to allow them\n\nTo be clear, the Danish Health Authority is not necessarily saying that covid has ended. To the contrary, the government there says it expects “a large wave of [covid] infection” in the coming months.\n\nAt the same time, government officials in Denmark are admitting that the jabs have not helped, and will never help, thus the new ban.\n\n“The purpose of vaccination is not to prevent infection with covid-19, and people aged under 50 are therefore currently not being offered booster vaccination,” the Danish Health Authority announcement reads.\n\nThe announcement goes on to explain that younger people have an almost zero risk of becoming seriously ill from Chinese Germs, and many of them are already protected anyway – some of them because they “have previously been infected with covid-19.”\n\nIn other words, the Danish Health Authority is acknowledging two important things that American health officials deny:\n\n1) Covid injections do not prevent infection – and by the looks of it, they actually cause more infection while increasing the risk of death\n\n 2) Natural immunity is real, and those who have previously tested “positive” for the Fauci Flu are now protected against it.\n\nIf only we could get these same types of acknowledgements in the United States, Canada, Australia, New Zealand, and many other places that are ruled with an iron fist by globalists with a penchant for unrelenting medical fascism and abuse of citizens.\n\n“The Danish move is particularly significant because Denmark has an excellent national health care system and has aggressively collected data on Covid and vaccines,” wrote Alex Berenson on his Substack about the situation.\n\n“Denmark was among the first countries to stop giving Covid shots to healthy children and teenagers. Now other European countries are beginning to follow, with Britain ending mRNA shots for almost all children 10 and under.”\n\nBig Tech, meanwhile, is already trying to spin the announcement out of Denmark to imply that it has nothing to do with actually stopping the injection of people for the Wuhan Flu.\n\n“Good luck with that,” Berenson joked about the failing agenda of the tech giants.\n\nThe latest Chinese Virus injection news can be found at Vaccines.news.", "opengraph": {"title": "Covid vaccinations now PROHIBITED in people under 50 in Denmark", "type": "article", "url": "https://www.health.news/2022-09-16-covid-vaccination-no-more-under-50-denmark.html", "site_name": "Health News", "description": "The Danish Health Authority has announced that just about every young and middle-aged person in Denmark is now prohibited from getting “vaccinated” for covid. If you are under the age of 50, the Danish government says, then you are not allowed to take the shots. Previously, the Danish government prohibited the drug injections for everyone […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/09/Vaccine-Syringe-Shot-Arm.jpg"}, "tags": ["big government", "vaccination", "vaccine wars", "Chinese germs", "Big Pharma", "zero risk", "banned", "outbreak", "COVID", "vaccine", "infections", "Denmark", "awakening", "Plandemic", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/denmark-ends-covid-vaccinations-for-981", "https://naturalnews.com/2021-10-06-sweden-denmark-ban-moderna-covid-vaccine-myocarditis-young-people.html", "https://www.brighteon.tv", "http://Vaccines.news", "https://alexberenson.substack.com/p/denmark-ends-covid-vaccinations-for-981", "https://naturalnews.com/2021-10-06-sweden-denmark-ban-moderna-covid-vaccine-myocarditis-young-people.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-09-16-covid-vaccination-no-more-under-50-denmark.html&linkname=Covid%20vaccinations%20now%20PROHIBITED%20in%20people%20under%2050%20in%20Denmark", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}