{"result_id": "148018", "URL": "https://health.news/2022-05-03-vaccine-injuries-in-patients-12fold-mortality-increase.html", "timestamp": "2023-04-25 15:27:26 CEST+0200", "meta": {"description": "Robert Jackson, a rheumatologist with 35 years of experience, has never seen anything like this in his career. Approximately 40 percent of his fully-vaccinated patients now report significant injuries from the experimental COVID vaccines. Many of the injuries involve newly-diagnosed blood clotting disorders. Even though the Vaccine Adverse Events Reporting System (VAERS) is capturing record […]", "lang": "en", "keywords": "autoimmune diseases,badhealth,badmedicine,Big Pharma,biological weapon,blood clotting,Dangerous Medicine,immune system,neurological conditions,pandemic,pharmaceutical fraud,spike protein,vaccine damage,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://health.news/2022-05-03-vaccine-injuries-in-patients-12fold-mortality-increase.html", "encoding": "UTF-8"}, "image": null, "domain": "health.news", "title": "Rheumatologist: Significant vaccine injuries now reported in 40% of patients, with a 12-fold mortality increase", "cleaned_text": "Rheumatologist: Significant vaccine injuries now reported in 40% of patients, with a 12-fold mortality increase\n\nRobert Jackson, a rheumatologist with 35 years of experience, has never seen anything like this in his career. Approximately 40 percent of his fully-vaccinated patients now report significant injuries from the experimental COVID vaccines. Many of the injuries involve newly-diagnosed blood clotting disorders.\n\nEven though the Vaccine Adverse Events Reporting System (VAERS) is capturing record levels of vaccine injuries post COVID vaccination, the numbers do not reflect the shocking 40 percent adverse event rate being reported by Dr. Jackson. This is because vaccine injuries are being normalized. Doctors blindly trust that the vaccines are safe, and they refuse to follow up and report the vaccine injuries that occur in their patients. This is why only one percent of vaccine reactions are reported to VAERS in the first place, according to studies.\n\nDr. Jackson sees about 5,000 patients in a given year. Approximately 3,000 of the patients received at least two doses of a covid-19 mRNA injection. Of these fully vaccinated patients, 40 percent reported a significant vaccine injury or adverse event. Roughly 5 percent of the patients are still suffering a year later from a blood clotting disorder caused by the vaccines.\n\nThroughout his career, Jackson reported around 1 or 2 deaths annually. After his patients got the covid vaccines, there was an unprecedented 12 deaths recorded. The false savior vaccine was neither safe nor effective and is causing a mortality spike that the doctor has never witnessed in his thirty-five-year career! Around 1 in 300 patients were likely killed by the vaccines.\n\nThe EULAR database, published in the British Medical Journal, corroborates these findings. In the study there was over 5,000 “fully vaccinated” patients with rheumatic or musculoskeletal diseases; approximately 37 percent of these patients suffered from adverse events post vaccination and 4.4 percent of patients experienced a disease “flare up” after being inoculated. Disingenuously, the study authors concluded that covid-19 vaccine safety profiles are “reassuring” because a “majority of patients tolerated their vaccination well.”\n\nCOVID vaccines may cause further damage to people with over-reactive or compromised immune systems\n\nDr. Jackson is subcontracted across the Midwest and travels to various hospitals to monitor patients. Because he is not employed by a central medical institution, he cannot be forced to take these vaccines or be censored when he speaks up about the rate of vaccine injury in his patients.\n\nDr. Jackson was able to get a more accurate record of vaccine injuries because he was free to speak about his observations, and he dared to do the follow-up work that many doctors are afraid or too arrogant to do. Dr. Jackson didn’t blindly believe that the vaccines were safe, as was reported incessantly by the media and the CDC. He actually asked his patients what happened after they got the shots.\n\nRheumatology patients are often referred to as “immune-compromised” because they have over-reactive immune systems. Because of their pre-existing condition, these patients are told they are at greatest risk for COVID complications and therefore must be vaccinated per the CDC orders. However, according to Dr. Jackson’s research, the vaccines are more likely to exacerbate their existing autoimmune condition and cause severe adverse events.\n\nIn an Israeli study, patients with an existing autoimmune condition suffered even further after they were given a booster shot. The vaccines can exacerbate a serious condition known as antiphospholipid syndrome. This vaccine-induced syndrome causes blood clotting in patients who already have autoimmune disorders.\n\nIn the case series, “Neurological autoimmune diseases following vaccinations against SARS-CoV-2,” researchers found that covid-19 vaccines exacerbate neurological autoimmune conditions. In a Scottish study, covid-19 vaccine induced thrombocytopenic, thromboembolic and hemorrhagic events. In a German study, covid-19 vaccines caused cerebral venous thrombosis. The evidence is overwhelming: The covid-19 vaccines are causing greater suffering and death.", "opengraph": {"title": "Rheumatologist: Significant vaccine injuries now reported in 40% of patients, with a 12-fold mortality increase", "type": "article", "url": "https://www.health.news/2022-05-03-vaccine-injuries-in-patients-12fold-mortality-increase.html", "site_name": "Health News", "description": "Robert Jackson, a rheumatologist with 35 years of experience, has never seen anything like this in his career. Approximately 40 percent of his fully-vaccinated patients now report significant injuries from the experimental COVID vaccines. Many of the injuries involve newly-diagnosed blood clotting disorders. Even though the Vaccine Adverse Events Reporting System (VAERS) is capturing record […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/05/Autoimmune-Disease-Vaccine-Arthritis-Biotechnology-Blood-Care.jpg"}, "tags": ["pandemic", "vaccine damage", "Big Pharma", "Vaccine deaths", "autoimmune diseases", "neurological conditions", "vaccine injury", "vaccines", "spike protein", "blood clotting", "immune system", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/rheumatologist-robert-jackson-40?s=r", "https://thevaccinereaction.org/2020/01/only-one-percent-of-vaccine-reactions-reported-to-vaers/", "https://www.brighteon.tv", "https://ard.bmj.com/content/81/5/695", "http://vaccinedamage.news", "https://onlinelibrary.wiley.com/doi/full/10.1111/ene.15147", "https://www.nature.com/articles/s41591-021-01408-4", "https://onlinelibrary.wiley.com/doi/10.1002/ana.26172", "https://stevekirsch.substack.com/p/rheumatologist-robert-jackson-40?s=r", "https://thevaccinereaction.org/2020/01/only-one-percent-of-vaccine-reactions-reported-to-vaers/", "https://ard.bmj.com/content/81/5/695", "https://onlinelibrary.wiley.com/doi/full/10.1111/ene.15147", "https://www.nature.com/articles/s41591-021-01408-4", "https://onlinelibrary.wiley.com/doi/10.1002/ana.26172", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-05-03-vaccine-injuries-in-patients-12fold-mortality-increase.html&linkname=Rheumatologist%3A%20Significant%20vaccine%20injuries%20now%20reported%20in%2040%25%20of%20patients%2C%20with%20a%2012-fold%20mortality%20increase", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}