{"result_id": "148021", "URL": "https://www.health.news/2023-03-24-moderna-government-hid-covid-booster-trial-data.html", "timestamp": "2023-04-25 15:27:29 CEST+0200", "meta": {"description": "Vaccine advisers to the federal government expressed outrage and disappointment over news that Moderna and government scientists concealed key data regarding Wuhan coronavirus (COVID-19) booster shots. Based on the previously hidden immunogenicity data, the new bivalent booster might not be any more effective at preventing COVID-19 infections than the original shots. The information was based […]", "lang": "en", "keywords": "B11529,badhealth,badmedicine,big government,Big Pharma,booster doses,CDC,covid-19,deception,FDA,Moderna,omicron,pandemic,pharmaceutical fraud,SARS-CoV-2,Suppressed,vaccine,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2023-03-24-moderna-government-hid-covid-booster-trial-data.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Vaccine advisers outraged as Moderna, government scientists CONCEALED key data about COVID boosters", "cleaned_text": "Vaccine advisers to the federal government expressed outrage and disappointment over news that Moderna and government scientists concealed key data regarding Wuhan coronavirus (COVID-19) booster shots.\n\nBased on the previously hidden immunogenicity data, the new bivalent booster might not be any more effective at preventing COVID-19 infections than the original shots. The information was based on blood work done on study participants to assess how well each vaccine-elicited antibodies fight off the B11529 omicron strain. However, Moderna and scientists for Washington did not present these findings during a 2022 meeting.\n\nThis concealment did not sit well with experts at the Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA), with some advisors for the latter voicing out their displeasure.\n\n“I was angry to find out that there was data that was relevant to our decision that we didn’t get to see,” said Dr. Paul Offit, a member of the FDA’s Vaccines and Related Biological Products Advisory Committee (VRBPAC). Fellow member Dr. Eric Rubin agreed, saying: “It’s not a group of children. We understand how to interpret these results.”\n\nActing VRPBAC Chairman Dr. Arnold Monto reiterated that there should be full transparency, and that the findings should not have been dismissed or concealed. “They are early, but they indicate that we need to look at them and see what their value is,” he said.\n\nDr. Pablo Sanchez, a member of the CDCs Advisory Committee on Immunization Practices (ACIP), remarked that if the data “was looked at as part of the study, it should have been presented to the advisers prior to their decision.”\n\nMeanwhile, Moderna spokesman Christopher Ridley said in an email that the company shared the infection data with the FDA and posted the study manuscript before the agency’s panel meeting in June 2022 “in response to requests that we share an update from the ongoing study.”\n\nBivalent booster granted EUA with only rodent testing to back it up\n\nBack in August 2021, the FDA granted the new bivalent booster an emergency use authorization (EUA). The booster contained two mRNA components of SARS-CoV-2 to target both the original strain of the virus and two omicron subvariants.\n\nHowever, the EUA was granted even though the boosters were only tested on rodents. The ACIP unanimously voted to permit the use of the shots on individuals aged 12 and older, along with kids between the ages of five and 11. This was during the time when the world is already easing out of the public health mandates and preparing for the return to socialization in school, after-school activities and other public settings such as shopping malls.\n\nDr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research, still endorsed these COVID-19 booster doses deceptively approved without human clinical trials.\n\n“More children have gotten sick with [COVID-19] and have been hospitalized. Children may also experience long-term effects, even following initially mild disease. We encourage parents to consider primary vaccination for children and follow-up with an updated booster dose when eligible,” he said.\n\nVisit Vaccines.news for more news about COVID-19 boosters.\n\nWatch Kentucky Sen. Rand Paul confront Moderna CEO Stephane Bancel on myocarditis risks in adolescent boys linked to his company’s COVID-19 shot.\n\nThis video is from the GalacticStorm channel on Brighteon.com.\n\nUK’s booster campaign is engaging in expensive state-sponsored self-harm on a national level, says MP.\n\nVaccine pusher Paul Offit now says boosters are no longer needed, so will he be labeled “anti-vax” and “anti-science?”\n\nFDA pushing for ENDLESS covid shots… annual boosters to inflame your heart and kill you early.\n\nDoctors are JUST SAYING NO to covid “booster” shots.\n\nGrowing number of physicians now refusing to get COVID-19 booster shots.", "opengraph": {"title": "Vaccine advisers outraged as Moderna, government scientists CONCEALED key data about COVID boosters", "type": "article", "url": "https://www.health.news/2023-03-24-moderna-government-hid-covid-booster-trial-data.html", "site_name": "Health News", "description": "Vaccine advisers to the federal government expressed outrage and disappointment over news that Moderna and government scientists concealed key data regarding Wuhan coronavirus (COVID-19) booster shots. Based on the previously hidden immunogenicity data, the new bivalent booster might not be any more effective at preventing COVID-19 infections than the original shots. The information was based […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2023/03/Coronavirus-Latex-Glove-Booster-Shot-Vaccine-Vial.jpg"}, "tags": ["pandemic", "big government", "covid-19", "Big Pharma", "Moderna", "FDA", "vaccine", "deception", "Suppressed", "B11529", "pharmaceutical fraud", "booster doses", "SARS-CoV-2", "omicron", "Wuhan coronavirus", "CDC"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/shot-makers-hide-key-clinical-data-about-covid-boosters-fda-and-cdc-experts-admit.html", "https://www.brighteon.tv", "https://www.nbcnews.com/health/health-news/fda-authorize-new-covid-boosters-data-tests-people-rcna45387", "https://www.thegatewaypundit.com/2023/01/fda-cdc-vaccine-experts-now-claim-outraged-moderna-allegedly-hiding-key-data-updated-booster-effectiveness-moderna-responds/?utm_campaign=later-linkinbio-gatewaypundit&utm_content=later-32327422&utm_medium=social&utm_source=linkin.bio", "https://vaccines.news/", "https://www.brighteon.com/93536c6d-dd77-477f-af51-58d76edc3aad", "https://www.brighteon.com/channels/galacticstorm", "https://www.naturalnews.com/2023-03-21-uk-booster-campaign-state-sponsored-self-harm.html", "https://www.vaccinewars.com/2023-02-17-paul-offit-now-says-covid-boosters-unneeded.html", "https://vaccines.news/2023-01-31-fda-pushing-for-endless-covid-shots-annual-boosters.html", "https://www.immunization.news/2023-02-06-doctors-just-saying-no-covid-booster-shots.html", "https://www.healthfreedom.news/2023-02-01-growing-number-physicians-refuse-covid-booster-shots.html", "https://www.naturalhealth365.com/shot-makers-hide-key-clinical-data-about-covid-boosters-fda-and-cdc-experts-admit.html", "https://www.nbcnews.com/health/health-news/fda-authorize-new-covid-boosters-data-tests-people-rcna45387", "https://www.thegatewaypundit.com/2023/01/fda-cdc-vaccine-experts-now-claim-outraged-moderna-allegedly-hiding-key-data-updated-booster-effectiveness-moderna-responds/?utm_campaign=later-linkinbio-gatewaypundit&utm_content=later-32327422&utm_medium=social&utm_source=linkin.bio", "https://www.brighteon.com/93536c6d-dd77-477f-af51-58d76edc3aad", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2023-03-24-moderna-government-hid-covid-booster-trial-data.html&linkname=Vaccine%20advisers%20outraged%20as%20Moderna%2C%20government%20scientists%20CONCEALED%20key%20data%20about%20COVID%20boosters", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}