{"result_id": "148014", "URL": "https://www.health.news/2022-08-26-dan-bongino-getting-covid-vaccine-biggest-regret.html", "timestamp": "2023-04-25 15:27:23 CEST+0200", "meta": {"description": "Conservative radio host Dan Bongino has confessed that he deeply regrets ever getting “vaccinated” for the Wuhan coronavirus (Covid-19). Calling it “the greatest regret” of his entire life, Bongino told listeners on his Monday broadcast that “I just should have waited” to see if they were really legitimate – and more importantly, safe. A former […]", "lang": "en", "keywords": "badhealth,badmedicine,chemical violence,COVID,Dan Bongino,Dangerous Medicine,disease causes,Medical Tyranny,medical violence,pandemic,Plandemic,regret,vaccination,vaccine,vaccine regret,vaccine wars", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-08-26-dan-bongino-getting-covid-vaccine-biggest-regret.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Dan Bongino says getting vaccinated for covid is his biggest regret in life", "cleaned_text": "Dan Bongino says getting vaccinated for covid is his biggest regret in life\n\nConservative radio host Dan Bongino has confessed that he deeply regrets ever getting “vaccinated” for the Wuhan coronavirus (Covid-19).\n\nCalling it “the greatest regret” of his entire life, Bongino told listeners on his Monday broadcast that “I just should have waited” to see if they were really legitimate – and more importantly, safe.\n\nA former Secret Service agent and political commenter, Bongino is figuring out that the American health care system, including the politicians and pharmaceutical companies that control it, simply cannot be trusted.\n\nAfter being diagnosed with cancer, Bongino also decided to undergo chemotherapy, another highly toxic “conventional” Western medicine protocol that left him with “zero appetite for three days.”\n\n“I thought to myself at the time … there’s no doubt this virus was created in a lab in Wuhan, China – I have little doubt about that,” Bongino said on his show about why he decided to get jabbed for the Fauci Flu. “I figured I’d rather take my chances with something we created than something they created … because I was scared.”\n\n“My doctor told me with lymphoma and being under chemo that if I got this thing, it could be ugly.” (Related: Bongino still has a lot to learn about how “free market” health care solutions will never work as long as Big Pharma is in control of the system.)\n\nBongino says he’s “scared of what’s coming” for himself and other fully vaccinated people\n\nAfter lamenting his decision, Bongino played a clip from Fox News host Tucker Carlson citing toxicology reports about how Chinese Virus injections compromise the immune system of recipients.\n\nRather than provide true protection against disease, these shots damage the immune system and make it more prone to infection and possible death – the opposite of what Bongino had hoped for.\n\nCalling Carlson’s segment “the most troubling minute and 20 seconds I’ve had to listen to in a long time,” Bongino went on to state that the more time has passed, the more “we are starting to see” that the injections were a total scam from the very beginning.\n\n“I’m scared of what’s coming,” Bongino said chillingly. “I had [covid] a little while ago and I’m afraid the repercussions of this for a lot of people have not been felt.”\n\nThe report cited by Carlson was published in the Journal of Food and Chemical Toxicology. It shows that the gene-editing injections cause “neurodegenerative disease, myocarditis, Bell’s palsy, liver disease, impaired adaptive immunity, impaired DNA damage response and tumorigenesis.”\n\n“It’s looking likely that the vaccine might suppress the immune system,” Carlson, who never got injected for covid, explained during his segment.\n\n“We sincerely hope that’s not true. But it’s not just the conclusion of one scientific journal.”\n\nIt turns out that another study published in The Lancet found that the risk of infection, hospitalization and death following the second dose of a covid injection lasts for at least nine months.\n\nBongino urged his viewers to rethink everything they were told about the plandemic, especially if they bought into the “state of emergency” rhetoric that drove the push towards mass vaccination.\n\n“Folks, science is patient,” Bongino said. “Science is chronological. Science is the repeating and replicating of data through process, through control groups. Science is the elimination of confounding variables.”\n\n“All these things take time. Whereas, I understand we were in an emergency situation due to COVD – no emergency situation should lead a company or a government to force people to take something, to force them to take something, that may in the long-run damage their body.”\n\nThe latest news about covid injections can be found at ChemicalViolence.com.", "opengraph": {"title": "Dan Bongino says getting vaccinated for covid is his biggest regret in life", "type": "article", "url": "https://www.health.news/2022-08-26-dan-bongino-getting-covid-vaccine-biggest-regret.html", "site_name": "Health News", "description": "Conservative radio host Dan Bongino has confessed that he deeply regrets ever getting “vaccinated” for the Wuhan coronavirus (Covid-19). Calling it “the greatest regret” of his entire life, Bongino told listeners on his Monday broadcast that “I just should have waited” to see if they were really legitimate – and more importantly, safe. A former […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/08/Bongino-Torba.jpeg"}, "tags": ["pandemic", "vaccine wars", "COVID", "Dan Bongino", "medical violence", "vaccine", "disease causes", "Medical Tyranny", "regret", "chemical violence", "vaccine regret", "Plandemic", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/08/dan-bongino-reveals-getting-covid-vaccinated-greatest-regret-life/", "https://www.survivornet.com/articles/radio-host-dan-bongino-46-says-after-chemo-he-had-zero-appetite-for-3-days-now-he-cant-stop-eating/", "https://naturalnews.com/2017-07-18-health-ranger-calls-out-sean-hannity-rush-limbaugh-and-dan-bongino-for-free-market-mistake-that-pushes-pharma-monopoly.html", "https://www.brighteon.tv", "https://www.thewrap.com/tucker-carlson-not-vaccinated-covid/", "http://chemicalviolence.com", "https://www.thegatewaypundit.com/2022/08/dan-bongino-reveals-getting-covid-vaccinated-greatest-regret-life/", "https://www.survivornet.com/articles/radio-host-dan-bongino-46-says-after-chemo-he-had-zero-appetite-for-3-days-now-he-cant-stop-eating/", "https://naturalnews.com/2017-07-18-health-ranger-calls-out-sean-hannity-rush-limbaugh-and-dan-bongino-for-free-market-mistake-that-pushes-pharma-monopoly.html", "https://www.thewrap.com/tucker-carlson-not-vaccinated-covid/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-08-26-dan-bongino-getting-covid-vaccine-biggest-regret.html&linkname=Dan%20Bongino%20says%20getting%20vaccinated%20for%20covid%20is%20his%20biggest%20regret%20in%20life", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}