{"result_id": "148001", "URL": "https://www.health.news/2022-04-08-german-legislators-junk-vaccine-mandate-for-seniors.html", "timestamp": "2023-04-25 15:27:10 CEST+0200", "meta": {"description": "Germany has just rejected a bill making vaccination against the Wuhan coronavirus (COVID-19) mandatory for citizens over the age of 60. Legislators in Germany’s Bundestag (federal parliament) have been debating for months whether to introduce a policy to mandate the experimental, ineffective and deadly COVID-19 vaccines for all citizens 18 years and older. After lengthy negotiations, […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Bundestag,coronavirus,covid-19,Germany,health freedom,insanity,medical fascism,Medical Tyranny,Olaf Scholz,pandemic,politics,Resist,vaccine mandate,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-04-08-german-legislators-junk-vaccine-mandate-for-seniors.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "German legislators vote against bill that would have mandated COVID-19 vaccines for people over 60", "cleaned_text": "German legislators vote against bill that would have mandated COVID-19 vaccines for people over 60\n\nGermany has just rejected a bill making vaccination against the Wuhan coronavirus (COVID-19) mandatory for citizens over the age of 60.\n\nLegislators in Germany’s Bundestag (federal parliament) have been debating for months whether to introduce a policy to mandate the experimental, ineffective and deadly COVID-19 vaccines for all citizens 18 years and older.\n\nAfter lengthy negotiations, German Chancellor Olaf Scholz was able to get his left-wing coalition government to craft a bill that would make the vaccine mandatory for citizens over 60.\n\nThis proposal was referred to as a “compromise,” as many members of the coalition government, particularly from the more pro-free market Free Democratic Party (FDP), were unwilling to make vaccinations mandatory for all. (Related: Germany’s COVID vaccine mandate could be delayed due to “bureaucratic hurdles.”)\n\nThis compromise legislation would have made it mandatory for everybody over 60 to show proof of vaccination or recovery from a previous COVID-19 infection by Oct. 15. Unvaccinated adults under the age of 59 would have also been required to attend “counseling sessions” on the COVID-19 vaccines.\n\nThe vote was preceded by an intense series of debates that spanned several weeks. The last of the debates took place right before the vote and lasted for more than three hours.\n\nMember of Parliament (MP) Dagmar Schmidt, who introduced the bill, tried to fearmonger other MPs to support it by claiming this will prevent cases from surging later this year. “Today is not about what’s happening now, but what will very likely happen in the fall,” she said.\n\nBut the opposition, led by the conservative Christian Democratic Union (CDU) party, argued that the vaccines were not necessary because cases were already going down all over the country.\n\nCDU MP Tino Sorge argued that, because the current situation showed that it is unlikely Germany’s healthcare system will be overwhelmed once again if cases do rise, it was not necessary to make vaccination compulsory.\n\nScholz, expecting the vote to be very close, even recalled members of his coalition who were currently attending to other matters overseas. This included Foreign Minister and Greens co-leader Annalena Baerbock, who was at a major North Atlantic Treaty Organization meeting regarding Ukraine.\n\nBut the vote was far from close. Of the 674 members of the Bundestag that voted, 378 voted against the vaccine mandate, while only 296 supported it.\n\nIn the governing coalition, most if not all of the members of the left-wing Social Democratic Party (SDP) and the Greens voted for the mandate. Most of the dissenters in the government came from the FDP.\n\nTo get the FDP to even agree to bring the bill to the floor of the Bundestag for a vote, Scholz had to consent to let lawmakers vote with their conscience rather than being forced to vote along party lines. This allowed many senior FDP members to come out during the debates against the vaccine mandate.\n\nGerman chancellor gives up push to mandate vaccines for seniors\n\nThe Bundestag’s rejection of the bill is a major blow to Scholz and his coalition government. The chancellor himself said after the vote that he was disappointed with the Bundestag’s rejection of the mandate. He added that he would not launch a second campaign to make the vaccines mandatory.\n\n“I find the Bundestag’s decision very clear,” said Scholz, who added that his government would find other ways to increase the country’s vaccination rate without mandates. Currently, 76 percent of all Germans are fully vaccinated, and 59 percent have received booster vaccines.\n\n“We will do everything we can to convince more citizens of this country to get vaccinated,” said Scholz.\n\nAfter the vote, members of the Greens and the SPD blamed the FDP for not committing to the goals of the rest of the coalition and for siding with the conservative opposition.\n\nThe SPD and the Greens also tried to pin the blame on the CDU’s leadership for not letting their members vote their conscience, as they believed there were many within the ranks of both parties who would have supported the mandate but were prevented from doing so by the leadership.\n\nMinister of Health Karl Lauterbach, who along with Scholz led efforts to get the mandate passed, reacted with concern to the failure of his preferred policy choice to get passed. He warned that this could lead to more COVID-19 infections in Germany later this year.\n\n“It is a very important decision because now the fight against corona in autumn becomes much more difficult,” he claimed. “Laying political blame does not help. We move on.”\n\nLearn more about the fight against COVID-19 mandates at HealthFreedom.news.\n\nWatch this video to listen to the speech of Alternative for Germany co-leader Alice Weidel against COVID-19 vaccine mandates in Germany.\n\nThis video is from the Vigilent Citizen channel on Brighteon.com.\n\nUkrainians fleeing Putin fall right into hands of vaccine Nazis in Germany, where all refugees are being fully jabbed.\n\nFrance, Italy, Germany and Spain suspend use of AstraZeneca coronavirus vaccine amid blood clot fears.\n\nOfficial government data from Germany suggests covid fully vaccinated people will develop AIDS.\n\nTruth hurts: 96% of omicron cases in Germany are among the fully vaccinated.", "opengraph": {"title": "German legislators vote against bill that would have mandated COVID-19 vaccines for people over 60", "type": "article", "url": "https://www.health.news/2022-04-08-german-legislators-junk-vaccine-mandate-for-seniors.html", "site_name": "Health News", "description": "Germany has just rejected a bill making vaccination against the Wuhan coronavirus (COVID-19) mandatory for citizens over the age of 60. Legislators in Germany’s Bundestag (federal parliament) have been debating for months whether to introduce a policy to mandate the experimental, ineffective and deadly COVID-19 vaccines for all citizens 18 years and older. After lengthy negotiations, […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/04/3-will-germany-be-next-legalize-flag.jpg"}, "tags": ["pandemic", "big government", "covid-19", "medical fascism", "Olaf Scholz", "Bundestag", "Resist", "politics", "vaccine mandate", "Medical Tyranny", "vaccines", "coronavirus", "insanity", "health freedom", "Germany"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/breaking-german-mps-reject-mandatory-jabs-for-over-60s/", "https://www.dw.com/en/german-lawmakers-reject-vaccine-mandate-for-people-over-60/a-61387119", "https://naturalnews.com/2022-01-17-germany-vaccine-mandate-delayed-by-bureaucratic-hurdles.html", "http://medicaltyranny.com", "https://www.brighteon.tv", "https://www.reuters.com/world/europe/german-parliament-rejects-mandatory-vaccines-blow-scholz-2022-04-07/", "https://www.nytimes.com/interactive/2021/world/covid-vaccinations-tracker.html", "https://pandemic.news/", "https://healthfreedom.news/", "https://www.brighteon.com/885f52ee-404f-4aa1-94c1-2cef55791738", "https://www.brighteon.com/channels/vigilentcitizen", "https://vaccines.news/2022-03-08-ukrainians-fleeing-putin-nazi-germany-fully-vaccinated.html", "https://naturalnews.com/2022-02-14-countries-suspend-astrazeneca-jab-blod-clot-fears.html", "https://vaccines.news/2022-01-05-official-government-data-germany-covid-fully-vaccinated-develop-aids.html", "https://pandemic.news/2022-01-03-96-percent-omicron-cases-germany-fully-vaccinated.html", "https://infections.news/2021-12-07-desperate-germany-announces-national-lockdown-for-unvaccinated.html", "https://www.lifesitenews.com/news/breaking-german-mps-reject-mandatory-jabs-for-over-60s/", "https://www.dw.com/en/german-lawmakers-reject-vaccine-mandate-for-people-over-60/a-61387119", "https://www.reuters.com/world/europe/german-parliament-rejects-mandatory-vaccines-blow-scholz-2022-04-07/", "https://www.nytimes.com/interactive/2021/world/covid-vaccinations-tracker.html", "https://www.brighteon.com/885f52ee-404f-4aa1-94c1-2cef55791738", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-04-08-german-legislators-junk-vaccine-mandate-for-seniors.html&linkname=German%20legislators%20vote%20against%20bill%20that%20would%20have%20mandated%20COVID-19%20vaccines%20for%20people%20over%2060", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}