{"result_id": "148026", "URL": "https://www.health.news/2022-09-06-healthy-athletes-dying-after-covid-vaccine-rollout.html", "timestamp": "2023-04-25 15:27:33 CEST+0200", "meta": {"description": "Former English soccer player Matt Le Tissier wants to know why many young and healthy athletes are dying after the rollout of Wuhan coronavirus (COVID-19) vaccines. What’s more troubling, he said, is that the authorities don’t seem to care. “I have seen so many people, so many incidents of young, fit, healthy sports people collapsing […]", "lang": "en", "keywords": "athlete,badhealth,badmedicine,badscience,Big Pharma,cardiac issues,COVID,covid-19,Dangerous Medicine,heart attack,heart disease,heart health,myocarditis,pandemic,soccer,vaccine,vaccine damage,Vaccine deaths,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2022-09-06-healthy-athletes-dying-after-covid-vaccine-rollout.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Former soccer star Matt Le Tissier: Sudden deaths of young, healthy athletes after COVID vaccine rollout need to be investigated", "cleaned_text": "Former soccer star Matt Le Tissier: Sudden deaths of young, healthy athletes after COVID vaccine rollout need to be investigated\n\nFormer English soccer player Matt Le Tissier wants to know why many young and healthy athletes are dying after the rollout of Wuhan coronavirus (COVID-19) vaccines. What’s more troubling, he said, is that the authorities don’t seem to care.\n\n“I have seen so many people, so many incidents of young, fit, healthy sports people collapsing on the field of play,” Le Tissier told GB News anchor Mark Steyn.\n\n“It’s just not normal, and yet the media seems to be normalizing it, and nobody seems to be paying any attention whatsoever to this huge rise that has gone on. And for the authorities in charge of these sports to not notice it or not calling an investigation I think is absolutely scandalous.”\n\nHe also said that he had been trying to get a meeting with the “powers that be” in soccer to try to put evidence before them and show what is happening, because they don’t seem to want to investigate the deaths themselves. “I think that’s criminal,” he said.\n\nThe sudden rise in heart attacks and illnesses in dozens of athletes from multiple sports caught the attention of medical experts like former Pfizer executive Dr. Michael Yeadon, who linked these cases to the vaccines.\n\nEven the Centers for Disease Control and Prevention recognized the correlation between myocarditis and the mRNA vaccines, declaring a “likely association” between the two.\n\nLe Tissier also previously voiced concern over the role of the shots in the sudden onset of illnesses in athletes. John Fleck, an English soccer player, collapsed during a match last year. And Trevor Sinclair, a former English soccer player and sports pundit, was cut off on a radio broadcast because he said that people were asking if Fleck’s illness was linked to the vaccine.\n\nIn December, Le Tissier asked again about the connection between the COVID shots and the sudden illnesses in athletes after three more suffered illnesses during matches. (Related: Deadly shots: Even healthy teenagers, athletes and doctors are not safe with COVID-19 vaccines.)\n\nIn February, he spoke at the General Assembly of the World Council for Health to discuss problems appearing among professional footballers. He said that in his 17-year career as an athlete, not once did he see somebody leave the field with heart problems. But in the last year, Le Tissier added, there had been so many reports from all around the world of athletes going down with heart problems.\n\n“I’ve made no assumptions. All I’m asking for is that somebody takes a little bit of responsibility and actually comes out and says, ‘right, something’s going on here,'” he said.\n\n“I just wanted to bring attention to the authorities that something’s going on here, that that’s not quite right. And we need to find out the exact reason why that is.”\n\nRecent autopsy data from multiple studies demonstrated the link between myocarditis and COVID vaccines.\n\nA CDC study published in February by the Journal of the American Medical Association (JAMA) also found that the risk for myocarditis in young male was 133 times greater after taking the Pfizer shot.\n\nHowever, the CDC said it still recommends that everyone six months and older should get vaccinated for COVID-19 because the known risk of the virus and its possible complications far outweigh the potential risks of having a severe adverse reaction to the vaccination.\n\nThe Food and Drug Administration also approved the requests by Pfizer and Moderna for the emergency use authorization (EUA) of new boosters while relying only on data from existing vaccines and trials conducted on mice.\n\nVisit Vaccines.news for more news about COVID-19 vaccines.\n\nWatch the video below to know how the COVID vaccine mandates are affecting the sports world.\n\nThis video is from the Chinese taking down EVIL CCP channel on Brighteon.com.\n\nAthlete deaths are 1700% higher than expected since COVID vaccine rollout.\n\nThe world is starting to notice how many young athletes are DYING after taking covid vaccines.\n\nSerious adverse events in professional athletes skyrocket 6,000 percent following covid “vaccine” rollout.\n\nThe Guardian says people dying from covid vaccines is “proof” that they work.", "opengraph": {"title": "Former soccer star Matt Le Tissier: Sudden deaths of young, healthy athletes after COVID vaccine rollout need to be investigated", "type": "article", "url": "https://www.health.news/2022-09-06-healthy-athletes-dying-after-covid-vaccine-rollout.html", "site_name": "Health News", "description": "Former English soccer player Matt Le Tissier wants to know why many young and healthy athletes are dying after the rollout of Wuhan coronavirus (COVID-19) vaccines. What’s more troubling, he said, is that the authorities don’t seem to care. “I have seen so many people, so many incidents of young, fit, healthy sports people collapsing […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/09/Soccer-Ball-Grass-Sports.jpg"}, "tags": ["pandemic", "covid-19", "heart health", "Big Pharma", "soccer", "Vaccine deaths", "COVID", "cardiac issues", "vaccine", "myocarditis", "vaccines", "heart attack", "heart disease", "athlete", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/former-soccer-star-wants-to-know-why-young-athletes-are-dying-and-no-one-seems-to-notice/", "http://vaccineinjurynews.com", "https://www.brighteon.tv", "https://naturalnews.com/2022-03-29-teens-athletes-doctors-not-safe-covid-vaccines.html", "https://worldcouncilforhealth.org/multimedia/matt-le-tissier-cardiac-problems-footballers/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html", "http://Vaccines.news", "https://www.brighteon.com/1fb9d074-da84-4cc5-8e76-ec260f79e11e", "https://www.brighteon.com/channels/nfsc", "https://vaccines.news/2022-08-01-athlete-deaths-1700percent-higher-since-vaccine-rollout.html", "https://vaccines.news/2021-11-10-world-starting-to-notice-how-many-young-athletes-are-dying-after-covid-vaccination.html", "https://vaccines.news/2021-11-17-covid-vaccine-adverse-events-professional-athletes-skyrocket.html", "https://vaccines.news/2022-01-11-guatemalan-soccer-star-dies-in-training.html", "https://vaccines.news/2021-07-04-guardian-people-dying-covid-vaccines-proof-work.html", "https://www.lifesitenews.com/news/former-soccer-star-wants-to-know-why-young-athletes-are-dying-and-no-one-seems-to-notice/", "https://worldcouncilforhealth.org/multimedia/matt-le-tissier-cardiac-problems-footballers/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html", "https://www.brighteon.com/1fb9d074-da84-4cc5-8e76-ec260f79e11e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-09-06-healthy-athletes-dying-after-covid-vaccine-rollout.html&linkname=Former%20soccer%20star%20Matt%20Le%20Tissier%3A%20Sudden%20deaths%20of%20young%2C%20healthy%20athletes%20after%20COVID%20vaccine%20rollout%20need%20to%20be%20investigated", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}