{"result_id": "148023", "URL": "https://www.health.news/2023-03-05-mercks-lower-the-age-for-gardasil-vaccine.html", "timestamp": "2023-04-25 15:27:30 CEST+0200", "meta": {"description": "Merck researchers on Monday published a study suggesting evidence shows that moving routine HPV vaccination to ages 9 to 10 may improve vaccination coverage rates in early and mid-adolescence, but critics called out the vaccine maker for focusing on profits, not health. (Article by Suzanne Burdick, Ph.D republished from ChildrensHealthDefense.org) Merck wants children to get […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,California Assembly Bill 659,children's vaccine,Gardasil vaccine,immunity,marketing ploy,Merck,Twisted,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://www.health.news/2023-03-05-mercks-lower-the-age-for-gardasil-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "www.health.news", "title": "Merck’s call to lower the age for Gardasil HPV vaccine ‘just another marketing ploy,’ critic says", "cleaned_text": "Merck’s call to lower the age for Gardasil HPV vaccine ‘just another marketing ploy,’ critic says\n\nMerck researchers on Monday published a study suggesting evidence shows that moving routine HPV vaccination to ages 9 to 10 may improve vaccination coverage rates in early and mid-adolescence, but critics called out the vaccine maker for focusing on profits, not health.\n\nMerck wants children to get its Gardasil human papillomavirus (HPV) vaccine beginning at age 9 or 10, instead of 11 or 12 as the Centers for Disease Control and Prevention currently recommends.\n\nThe vaccine maker’s researchers on Monday published a study in Pediatrics suggesting evidence shows that moving routine HPV vaccination to ages 9 to 10 may improve vaccination coverage rates in early and mid-adolescence, increasing the odds children will complete the vaccine series prior to becoming sexually active.\n\n“While it may be true that starting Gardasil shots at age 9 or 10 makes it more likely that children complete the series of shots, the goal of medicine should be health, not completion of a profit-driven protocol,” said Mary Holland, president of Children’s Health Defense and author of “The HPV Vaccine On Trial: Seeking Justice For A Generation Betrayed.”\n\nMerck published the study amid a growing number of lawsuits, including a wrongful death claim alleging the company purposefully concealed the known side effects of its Gardasil vaccine.\n\nBut critics alleged the study fails to test Gardasil’s touted ability to prevent cervical cancer and ignores the fact that Merck’s Gardasil HPV vaccine has induced autoimmune disorders and other injuries in hundreds of young people.\n\nSince the Gardasil vaccine was introduced in 2006, numerous reports have linked it to debilitating autoimmune disorders, neurological side effects and other complications, prompting many families of injured children to file lawsuits alleging the company knew the vaccine could cause serious side effects, according to AboutLawsuits.com.\n\nIn August 2022, a federal panel of judges consolidated more than 31 lawsuits brought against Merck into one case that will go before U.S. District Judge Robert J. Conrad, Jr., in North Carolina.\n\nMichael Baum, a senior attorney with Wisner Baum, the law firm representing the consolidated lawsuits that now involve hundreds of young men and women across the U.S. who experienced serious injury after getting the HPV vaccine, said the study is “just another Merck marketing ploy to expand Gardasil use among 9-10-year-old children.”\n\nMerck’s profits from its Gardasil vaccine are expected to rise throughout 2023, according to Seeking Alpha, the world’s largest investing community.\n\n‘These shots should no longer be on the market’\n\n“Children and adults around the world have been disabled and died from Gardasil shots,” Holland told The Defender.\n\n“These shots should no longer be on the market, and the lawsuits underway in North Carolina federal court are likely to prove this,” she added.\n\nIn their new study, Merck’s researchers made no mention of the fact that the Gardasil vaccine has induced autoimmune conditions in hundreds of young people, Baum said.\n\nThe study also did not “actually test Gardasil’s ability to prevent cancer,” he added.\n\nUntil recently, the U.S. Food and Drug Administration had received more adverse reaction reports related to Gardasil than any other vaccine in history.\n\nAccording to those alleging injury from the Gardasil vaccine, not only did Merck fail to adequately disclose the presence of ingredients known to sometimes cause autoimmune problems — but Merck used them in the placebos given to “control” test subjects during clinical trials, leading to an inaccurate assessment of Gardasil side effects.\n\n“At some point, a conscientious pharmaceutical company would examine the patterns of harms, isolate who might suffer them, and when they might suffer them, then make recommendations on how to avoid them,” Baum said.\n\n“But Merck has simply chosen to be a sophisticated marketing company scaring parents and children into early, widespread vaccination, which this study just perpetuates,” he added.\n\nCalifornia bill would require teens in grades 8 through 12 to receive Gardasil vaccine\n\nMeanwhile, a California bill could soon require all school-age children in grades 8 through 12 to get the Gardasil vaccine.\n\nIntroduced on Feb. 9, California Assembly Bill 659 — known as the “Cancer Prevention Act” — has been assigned to the Health Committee and could be heard in committee as early as March 14.\n\nParents of injured children suing Merck are deeply concerned that other children will suffer similar consequences if they are compelled to get vaccinated in order to attend schools in California.\n\nKathy Robi, a California mother of a daughter now consigned to a wheelchair, said:\n\n“This is not a vaccine that should be mandated. There is no evidence Gardasil will prevent cervical cancer in the long term; it is entirely theoretical, based on studies testing only surrogate endpoints (lesions), not cancer itself, and like any medical intervention, Gardasil has risks, and those risks can be devastating.”\n\n“Are the risks, which can include death, worth it?” Robi asked. “I don’t think so.”\n\nChildren’s Health Defense urges California parents concerned about the bill to take these action steps, which include calling, emailing and meeting with California Assembly members.", "opengraph": {"title": "Merck’s call to lower the age for Gardasil HPV vaccine ‘just another marketing ploy,’ critic says", "type": "article", "url": "https://www.health.news/2023-03-05-mercks-lower-the-age-for-gardasil-vaccine.html", "site_name": "Health News", "description": "Merck researchers on Monday published a study suggesting evidence shows that moving routine HPV vaccination to ages 9 to 10 may improve vaccination coverage rates in early and mid-adolescence, but critics called out the vaccine maker for focusing on profits, not health. (Article by Suzanne Burdick, Ph.D republished from ChildrensHealthDefense.org) Merck wants children to get […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2023/03/Gardasil.jpg"}, "tags": ["California Assembly Bill 659", "Merck", "Big Pharma", "Gardasil vaccine", "marketing ploy", "Twisted", "vaccines", "children's vaccine", "immunity"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/merck-lower-age-gardasil-hpv-vaccine/", "https://www.cdc.gov/vaccines/vpd/hpv/public/index.html", "https://publications.aap.org/pediatrics/article/151/3/e2022058794/190722/Early-Initiation-of-HPV-Vaccination-and-Series", "https://childrenshealthdefense.org/", "https://www.amazon.com/HPV-Vaccine-Trial-Generation-Betrayed/dp/1510710809/ref=sr_1_1", "https://childrenshealthdefense.org/defender/merck-gardasil-hpv-vaccine-lawsuits-multidistrict-litigation/", "https://childrenshealthdefense.org/defender/noah-foley-wrongful-death-lawsuit-gardasil-vaccine/", "https://www.cdc.gov/cancer/hpv/basic_info/cancers.htm", "https://www.brighteon.tv", "https://childrenshealthdefense.org/defender/victoria-trevisan-gardasil-hpv-vaccine-injury-merck/", "https://www.aboutlawsuits.com/gardasil-hpv-vaccination-merck-study/", "https://www.baumhedlundlaw.com/documents/gardasil-mdl-3036-08-04-2022-transfer-order-transferring-29-actions-to-judge-robert-j-conrad.pdf", "https://www.baumhedlundlaw.com/blog/2022/august/judicial-panel-consolidates-gardasil-lawsuits-in/", "https://www.wisnerbaum.com/attorneys/michael-l-baum/", "https://www.wisnerbaum.com/", "https://seekingalpha.com/article/4580996-merck-stock-keytruda-gardasil-sales-expected-to-rise", "https://about.seekingalpha.com/", "https://childrenshealthdefense.org/defender/", "https://www.fda.gov/vaccines-blood-biologics/safety-availability-biologics/gardasil-vaccine-safety", "https://legiscan.com/CA/bill/AB659/2023", "https://childrenshealthdefense.org/community-forum/2023-ca-ab659/", "https://childrenshealthdefense.org/defender/merck-lower-age-gardasil-hpv-vaccine/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2023-03-05-mercks-lower-the-age-for-gardasil-vaccine.html&linkname=Merck%E2%80%99s%20call%20to%20lower%20the%20age%20for%20Gardasil%20HPV%20vaccine%20%E2%80%98just%20another%20marketing%20ploy%2C%E2%80%99%20critic%20says", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}