{"result_id": "148028", "URL": "https://health.news/2022-09-07-singapore-birth-rate-declines-after-vaccine-rollout.html", "timestamp": "2023-04-25 15:27:35 CEST+0200", "meta": {"description": "The first country in Southeast Asia to begin administering Wuhan coronavirus (COVID-19) vaccines to its citizens and residents was Singapore. The official rollout of the island-state’s vaccination program began on December 30, 2020, after the country received an undisclosed number of doses from Pfizer a few days prior By June 2021, nearly every Singaporean adult aged […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapons,coronavirus,COVID,Dangerous Medicine,depopulation,Infertility,men's health,miscarriage,pandemic,pharmaceutical fraud,reproductive health,Singapore,spike protein,Vaccine deaths,vaccines,women's health", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://health.news/2022-09-07-singapore-birth-rate-declines-after-vaccine-rollout.html", "encoding": "UTF-8"}, "image": null, "domain": "health.news", "title": "Singapore’s birth rate started to decline 9 MONTHS after vaccinating nearly every Singaporean adult of childbearing age", "cleaned_text": "Singapore’s birth rate started to decline 9 MONTHS after vaccinating nearly every Singaporean adult of childbearing age\n\nThe first country in Southeast Asia to begin administering Wuhan coronavirus (COVID-19) vaccines to its citizens and residents was Singapore. The official rollout of the island-state’s vaccination program began on December 30, 2020, after the country received an undisclosed number of doses from Pfizer a few days prior\n\nBy June 2021, nearly every Singaporean adult aged 20 to 39 – or those at their prime childbearing age – have received at least one dose of the vaccine.\n\nWith roughly 98 percent of the vaccinations given being mRNA vaccines from Pfizer or Moderna, the fast response of young Singaporean adults in getting their vaccines offers a natural experiment regarding the effect of mRNA shots on fertility.\n\nSingapore is suffering from an aging population. The average Singaporean woman has fewer than 1.2 children, which is barely half the birth rate needed to increase the country’s population.\n\nBut Singapore’s birth rate was at least stable, with COVID not meaningfully changing the number of births. There had been 39,259 newborns in 2019, 38,590 in 2020 and 38,672 in 2021. In the first two months of 2022, the birth rate even increased by about 7.5 percent.\n\nIn March, however, the trend abruptly reversed. Between March and June 2022, which are the most recent months for which figures are available, Singapore recorded around 1,000 fewer live births compared to the same months in 2021 – a decline of about 8.5 percent.\n\nThis shift is highly unusual. COVID itself can’t be blamed because Singapore was essentially COVID-free until the fall of 2021. (Related: Singapore COVID-19 outbreak worsens despite 80 percent vaccination rate.)\n\nThe four-month decline in birth rates in a single small country may not be a cause for concern, but this is also happening in other parts of the globe.\n\nSweden also reported birth rate decline earlier this year, with a similarly close connection to last year’s vaccination efforts. Sweden and Singapore are very different ethnically and geographically and even opposed COVID lockdown policies. Yet, both countries are seeing the same drop in fertility.\n\nThe decline in birth rates in countries like Singapore is large by their country’s standards.\n\nThe mRNA shots are known to cause disruption in menstrual cycles as well as declines in sperm counts, which can last for several months. It is possible that those changes alone account for the entire drop.\n\nPeople are advised to ask fertility specialists if healthy adults of childbearing age should avoid new biotechnologies like the mRNA vaccines unless they no longer have alternatives.\n\nDisruption in the menstrual cycle and lower sperm counts are concerning after-effects of the vaccine, but it could be even worse.\n\nDr. Roger Hodkinson, a pathologist by training, said last year that the vaccines could cause mass male infertility.\n\n“In a world where we know that sperm counts have dropped 40 percent over the last ten or 20 years – a massive unexplained drop in sperm counts – we don’t need some additional hits on male fertility,” he said.\n\n“The data I’m talking about is well-described in the literature, that of the significant expression of the ACE 2 receptor in both the placenta and the testes. And more importantly, in the testes it’s the cells that actually produce the spermatozoa, the precursors, called spermatogonia. Clearly there is an excess of spike protein circulating as a result of an unexpected surge in some people who get the vaccine.\n\n“And that circulation takes the spike protein everywhere, including the placenta of women who happen to be pregnant at the time, which is a one-time hit for that particular pregnancy, probably not for subsequent ones. But there is also potential for a hit on the testes, which of course is not a one-time hit, it could be a permanent hit.”\n\nVisit VaccineDamage.news to know more about the adverse effects of COVID-19 vaccines.\n\nWatch the video below for more information about why the COVID vaccines should be banned for pregnant women.\n\nThis video is from the Puretrauma357 channel on Brighteon.com.\n\nIs the new “morning after pill” a Covid vaccine?", "opengraph": {"title": "Singapore’s birth rate started to decline 9 MONTHS after vaccinating nearly every Singaporean adult of childbearing age", "type": "article", "url": "https://www.health.news/2022-09-07-singapore-birth-rate-declines-after-vaccine-rollout.html", "site_name": "Health News", "description": "The first country in Southeast Asia to begin administering Wuhan coronavirus (COVID-19) vaccines to its citizens and residents was Singapore. The official rollout of the island-state’s vaccination program began on December 30, 2020, after the country received an undisclosed number of doses from Pfizer a few days prior By June 2021, nearly every Singaporean adult aged […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/09/Pregnancy-Test.jpg"}, "tags": ["pandemic", "women's health", "Big Pharma", "Vaccine deaths", "COVID", "Infertility", "miscarriage", "Singapore", "depopulation", "pharmaceutical fraud", "spike protein", "coronavirus", "vaccines", "reproductive health", "men's health", "biological weapons"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/more-frightening-news-about-fertility", "https://naturalnews.com/2021-09-16-singapore-covid19-outbreak-worsens-despite-high-vaccination-rate.html", "https://www.brighteon.tv", "https://tapnewswire.com/2021/05/an-exclusive-interview-with-dr-roger-hodkinson-when-the-history-of-this-madness-is-written-reputations-will-be-slaughtered-and-there-will-be-blood-in-the-gutter/", "http://vaccinedamage.news", "https://www.brighteon.com/a51e61ed-df7a-42aa-8c32-14ee42db84ba", "https://www.brighteon.com/channels/puretrauma357", "https://vaccines.news/2021-05-27-covid-vaccine-bioweapons-attack-male-fertility-too.html", "https://vaccines.news/2022-01-21-covid-vaccine-causes-miscarriages-stillbirths.html", "https://vaccines.news/2021-07-19-new-morning-after-pill-a-covid-vaccine.html", "https://alexberenson.substack.com/p/more-frightening-news-about-fertility", "https://tapnewswire.com/2021/05/an-exclusive-interview-with-dr-roger-hodkinson-when-the-history-of-this-madness-is-written-reputations-will-be-slaughtered-and-there-will-be-blood-in-the-gutter/", "https://www.brighteon.com/a51e61ed-df7a-42aa-8c32-14ee42db84ba", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-09-07-singapore-birth-rate-declines-after-vaccine-rollout.html&linkname=Singapore%E2%80%99s%20birth%20rate%20started%20to%20decline%209%20MONTHS%20after%20vaccinating%20nearly%20every%20Singaporean%20adult%20of%20childbearing%20age", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}