{"result_id": "148025", "URL": "https://health.news/2022-11-14-india-state-vaccine-tick-disease-ineffective.html", "timestamp": "2023-04-25 15:27:32 CEST+0200", "meta": {"description": "A state in India is no longer distributing a vaccine developed to deal with a deadly endemic disease after an investigation found its efficacy waned almost immediately after the shot. In the southern regions of India, the Kyasanur Forest disease (KFD) infects between 400 to 500 people each year during the November to May disease […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,conspiracy,deception,harmful medicine,India,infections,insanity,Karnataka,Kyasanur Forest disease,pharmaceutical fraud,real investigations,vaccine efficacy,vaccine failure,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Health-fav.png", "canonical": "https://health.news/2022-11-14-india-state-vaccine-tick-disease-ineffective.html", "encoding": "UTF-8"}, "image": null, "domain": "health.news", "title": "Indian state no longer distributing vaccine for tick-borne disease after investigation finds it virtually ineffective", "cleaned_text": "Indian state no longer distributing vaccine for tick-borne disease after investigation finds it virtually ineffective\n\nA state in India is no longer distributing a vaccine developed to deal with a deadly endemic disease after an investigation found its efficacy waned almost immediately after the shot.\n\nIn the southern regions of India, the Kyasanur Forest disease (KFD) infects between 400 to 500 people each year during the November to May disease season. Around five to 10 percent of infections turn into severe cases and around 2.6 percent of all cases result in death.\n\nDespite this low fatality rate – only around a dozen people dying annually – authorities in the southwestern state of Karnataka regularly distribute hundreds of thousands of KFD vaccines each year, claiming it is very important for forest and agricultural workers to be inoculated and to receive boosters to maintain the vaccine’s high efficacy rate.\n\nBut an investigation shows that, at least for the last two decades, the vaccine’s quality has deteriorated significantly, with its potency close to negligible.\n\nResearchers compared two separate studies that looked into the effectiveness of the KFD vaccines, one from 1994 and another from 2013. What they found revealed the extent to which the vaccine’s effectiveness dropped.\n\nIn 1994, a two-dose regimen of the KFD vaccine had an efficacy rate of 93.5 percent. From 2005 to 2010, it was only 62 percent. Worse yet, one dose of the vaccine had an efficacy rate of 79.3 percent in 1994. In the more recent study, it was zero.\n\nThis meant that people who only received a single dose were unprotected against KFD. Workers most vulnerable to KFD may have been given a false sense of security by the vaccine, leading to more people than normal contracting and being killed by the disease. Healthcare workers all over India have also noticed how ineffective the vaccines are.\n\n“I don’t think it works,” said Krishna, a community health officer in the village of Kannangi in the central district of Shivamogga.\n\n“If you talked to any medical officer [in the city], they would all say that the vaccine, really, is of no value. It offers very little protection,” said Dr. Manoj Murhekar, head of the National Institute of Epidemiology in Chennai, the capital of the southern state of Tamil Nadu.\n\nKarnataka has not received authorization to distribute KFD vaccine for over two decades\n\nThe KFD vaccine is manufactured by the Institute of Animal Health and Veterinary Biologics (IAHVB), a nearly century-old institution located in Bangalore, capital of Karnataka, and heavily supported by the state government.\n\nEvery year, the institute produces between 100,000 to 500,000 doses of the KFD vaccine. The manufacturing process for the vaccine has not changed since it was developed in the 1980s.\n\nAccording to English-language Indian news outlet Mint, the Central Drugs Standard Control Organization, India’s top drug regulator, has not provided any authorization to produce the vaccine since 2002.\n\nThis means that both the IAHVB and the state government of Karnataka may have been illegally producing and distributing the vaccine for over two decades. (Related: High Court in India puts Bill Gates on notice over doctor’s death due to COVID-19 vaccine.)\n\nAt least four other states – Goa, Kerala, Maharashtra and Tamil Nadu – regularly purchase the KFD vaccine from IAHVB. Meaning, these states spent taxpayer money on a vaccine that worked so poorly and its quality and safety were very questionable that it could have led to more people dying of KFD.\n\nAs of Oct. 10, the Department of Health and Family Welfare of Karnataka is no longer distributing the KFD vaccine. In a letter sent to all of its district health officers on that day, the department said the vaccine is out of stock and will not be available for people who wish to be inoculated against the upcoming disease season for KFD.\n\nThe department is asking district health officers to control the spread of KFD through other measures, including educating people on how to avoid tick bites.\n\nLearn more about ineffective vaccines at Vaccines.news.\n\nWatch this clip of Indian parents whose children died after getting vaccinated against the Wuhan coronavirus (COVID-19).\n\nThis is from the Truth or Consequences channel on Brighteon.com.\n\nHundreds of thousands of children paralyzed by polio vaccines thanks to Gates Foundation’s vaccination program.\n\nINTERNATIONAL MEDICAL CRISIS: Over 400 doctors and scientists in India declare COVID vaccine programs must end.\n\nWHO knowingly pushed deadly vaccine in India that killed thousands of children.", "opengraph": {"title": "Indian state no longer distributing vaccine for tick-borne disease after investigation finds it virtually ineffective", "type": "article", "url": "https://www.health.news/2022-11-14-india-state-vaccine-tick-disease-ineffective.html", "site_name": "Health News", "description": "A state in India is no longer distributing a vaccine developed to deal with a deadly endemic disease after an investigation found its efficacy waned almost immediately after the shot. In the southern regions of India, the Kyasanur Forest disease (KFD) infects between 400 to 500 people each year during the November to May disease […]", "image": "https://www.health.news/wp-content/uploads/sites/378/2022/11/Flag-Of-India.jpg"}, "tags": ["Karnataka", "conspiracy", "big government", "Kyasanur Forest disease", "vaccine failure", "Big Pharma", "real investigations", "harmful medicine", "deception", "infections", "vaccines", "vaccine efficacy", "insanity", "India", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://greatgameindia.com/truth-about-vaccine/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3513490/", "http://pharmaceuticalfraud.com", "https://www.brighteon.tv", "https://www.livemint.com/science/health/how-the-kfd-vaccine-is-made-and-tested-11667398917864.html", "https://naturalnews.com/2022-09-22-high-court-india-bill-gates-death-vaccine.html", "https://vaccines.news/", "https://www.brighteon.com/dad529b8-383c-452b-b903-31ccb99abc64", "https://www.brighteon.com/channels/triplee495", "https://www.brighteon.com/channels/triplee495", "https://naturalnews.com/2022-11-10-hundreds-of-thousands-children-paralyzed-polio-vaccines.html", "https://vaccinedeaths.com/2022-09-20-400-doctors-scientists-declare-international-medical-crisis-covid-vaccine.html", "https://naturalnews.com/041590_child_mortality_vaccines_India.html", "https://naturalnews.com/035627_polio_vaccines_paralysis_India.html", "https://greatgameindia.com/truth-about-vaccine/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3513490/", "https://www.livemint.com/science/health/how-the-kfd-vaccine-is-made-and-tested-11667398917864.html", "https://www.brighteon.com/dad529b8-383c-452b-b903-31ccb99abc64", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fhealthnews%2F2022-11-14-india-state-vaccine-tick-disease-ineffective.html&linkname=Indian%20state%20no%20longer%20distributing%20vaccine%20for%20tick-borne%20disease%20after%20investigation%20finds%20it%20virtually%20ineffective", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}