{"result_id": "149048", "URL": "https://healthnutnews.com/fox-missing-cdc-doctor-harvard-grad-disappears-without-a-trace-dog-wallet-phone-left-behind/", "timestamp": "2023-04-25 15:28:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/fox-missing-cdc-doctor-harvard-grad-disappears-without-a-trace-dog-wallet-phone-left-behind/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "FOX: MISSING: CDC doctor (and Harvard grad) disappears \"Without A Trace\" (dog, wallet, phone left behind)", "cleaned_text": "Police are currently looking for CDC doctor Timothy Cunningham who seemingly disappeared “without a trace.” But his brother Anterio Cunningham is convinced his brother wouldn’t just walk away from a great job at the CDC, a beautiful home, and the dog he loves so much:\n\n“My first mind is that something has happened especially considering the length of time he’s been gone. Not having his phone, leaving his dog Bo alone, he just wouldn’t voluntarily check out like that. Tim is the consummate professional. He loves his job. He wouldn’t just cast it aside. He’s worked hard to get where he is.”\n\nCunningham, a 35-year-old Morehouse and Harvard alumni, is an epidemiologist at the CDC in Chamblee and had just been promoted to Commander under the U.S. Health Service Corps.\n\nThe doctor reported to work on Monday, February 12, but told his supervisors he needed to leave early because he wasn’t feeling well. He apparently returned home but then disappeared, leaving his cell phone, wallet, dog, and SUV at home. CBS 46 reported that his family said they did talk to him before he went missing and he sounded disoriented and even heard some ‘bits of anger’. They do not believe he would have left voluntarily, so then, did someone force him?\n\nAtlanta Police are holding on to his cell phone as part of their missing person’s investigation. Loved ones hope someone will recognize Cunningham, perhaps even as a John Doe in a hospital.\n\nThe CDC lists his bio as the following:\n\nTimothy J. Cunningham, ScD, is a team lead with CDC’s Division of Population Health. Dr. Cunningham trained with CDC as an Epidemic Intelligence Service officer. His research has been oriented towards understanding health differences related to race/ethnicity, socioeconomic status, gender, and geography. Dr. Cunningham has also deployed for numerous public health emergencies, including Superstorm Sandy, Ebola, and Zika. He is an active member of the American Public Health Association and the American College of Epidemiology. Dr. Cunningham received his S.M. and Sc.D. from the Harvard T.H. Chan School of Public Health.\n\nIf you have information on Dr. Cunningham’s whereabouts, please call 911 or the Atlanta Police Department: 404-546-4235.", "opengraph": {"locale": "en_US", "type": "article", "title": "FOX: MISSING: CDC doctor (and Harvard grad) disappears \"Without A Trace\" (dog, wallet, phone left behind)", "description": "Police are currently looking for CDC doctor Timothy Cunningham who seemingly disappeared “without a trace.” But his brother Anterio Cunningham is convinced his brother wouldn’t just walk away from a great job at the CDC, a beautiful home, and the dog he loves so much: “My first mind is that something has happened especially considering the …", "url": "https://healthnutnews.com/fox-missing-cdc-doctor-harvard-grad-disappears-without-a-trace-dog-wallet-phone-left-behind/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:section": "Featured", "article:published_time": "2018-02-20T22:22:31-05:00", "article:modified_time": "2018-02-22T09:25:36-05:00", "updated_time": "2018-02-22T09:25:36-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2018/02/missingcdcworker_1519086755005_4981788_ver1.0_640_360.jpg", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2018/02/missingcdcworker_1519086755005_4981788_ver1.0_640_360.jpg", "image:width": "640", "image:height": "360"}, "tags": ["Health", "Featured"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Missing CDC employee\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/40Z_Y-ktOGQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/40Z_Y-ktOGQ?feature=oembed"}], "links": [], "authors": [], "publish_date": "2018-02-20T22:22:31-05:00"}