{"result_id": "149025", "URL": "https://healthnutnews.com/breaking-authorities-debunk-false-rumors-brandy-vaughan-died-of-gallbladder-attack-disease/", "timestamp": "2023-04-25 15:28:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/breaking-authorities-debunk-false-rumors-brandy-vaughan-died-of-gallbladder-attack-disease/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "Breaking: Authorities debunk false rumors that Brandy Vaughan died of gallbladder attack/disease", "cleaned_text": "For months we have heard a false narrative as to the cause of the death of Brandy Vaughan. Time and again we have been told that her death was the result of gallbladder disease. We now know based on the public report of the Santa Barbara coroner that the cause of death is reported as bilateral pulmonary thromboembolism, no mention of anything gallbladder related.\n\nBasically, she had blood clots in both lungs.\n\nSadly a secret “inner circle” offered this false death by gallbladder narrative from day one, a few even spamming her non-profit’s page “Learn the Risk” within hours of her death, stating factually that she died from known gallbladder disease. The cause of death was not gall bladder disease.\n\nMeanwhile the president of Learn the Risk (who Brandy left in charge of all of her affairs, and who was with her days before her death) and Brandy’s confidant, plus Brandy’s trusted treasurer of Learn the Risk (two different people) told me they had never heard of any gallbladder complaints either. Her best friend from childhood who helped deliver her only son said the same. Furthermore, her personal physician came forward immediately to debunk a history of any complaints of her gallbladder.\n\nThis shocking revelation begs the question why the need to dupe, deceive, and defraud the public into believing within hours of her being found dead that her death was the result of gallbladder disease. How hurtful for her close friends, family and followers, not to mention her little boy who will forever more read these internet stories and wonder “if only Mommy would have gone to a doctor all those years for her gallbladder disease that killed her” (which was false).\n\nWe have always maintained that we don’t know the cause of death and we should wait until autopsy results are in before spreading false rumors that have harmed so many.\n\nA source very close to the investigation said to me today “Fools rush in where the angels fear to tread.”\n\nRest in peace to my dear friend and fellow warrior Brandy Vaughan, who we miss so much and gave the respect to wait for the autopsy results before spreading false information that has hurt her legacy and will forever more haunt her son with these stories that will sadly float around the internet forever and did not do Brandy justice.\n\nPS I knew this information weeks ago definitively, but embargoed it until authorities released the information today. Health Nut News kept this secret in deference to Brandy’s only son (and only child) out of respect for him. I hope those who spread false rumors will forthwith offer their apology to him.\n\nPPS. A private investigation with licensed professionals already hired will continue in order to honor the written wishes and directive of Brandy (which was publicly posted by her on her Facebook page Dec 2019) as there has been suspicious activity surrounding her sudden death.\n\nPPS As Brandy requested in writing, her friends at Learn The Risk will continue her legacy and you may support their efforts to continue by donating at LearnTheRisk.org", "opengraph": {"locale": "en_US", "type": "article", "title": "Breaking: Authorities debunk false rumors that Brandy Vaughan died of gallbladder attack/disease", "description": "For months we have heard a false narrative as to the cause of the death of Brandy Vaughan. Time and again we have been told that her death was the result of gallbladder disease. We now know based on the public report of the Santa Barbara coroner that the cause of death is reported as …", "url": "https://healthnutnews.com/breaking-authorities-debunk-false-rumors-brandy-vaughan-died-of-gallbladder-attack-disease/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:section": "Health", "article:published_time": "2021-02-19T01:13:04-05:00", "article:modified_time": "2021-02-19T20:22:19-05:00", "updated_time": "2021-02-19T20:22:19-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2021/02/brandy-vaughan-pic.jpeg", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2021/02/brandy-vaughan-pic.jpeg", "image:width": "730", "image:height": "376"}, "tags": ["Health"], "tweets": [], "movies": [], "links": ["http://learntherisk.org", "https://www.sbsheriff.org/coroners-office-releases-findings-in-brandy-vaughan-death-investigation/", "tg://msg?text=Breaking%3A%20Authorities%20debunk%20false%20rumors%20that%20Brandy%20Vaughan%20died%20of%20gallbladder%20attack%2Fdisease - https%3A%2F%2Fhealthnutnews.com%2Fbreaking-authorities-debunk-false-rumors-brandy-vaughan-died-of-gallbladder-attack-disease%2F", "mailto:?subject=Breaking%3A%20Authorities%20debunk%20false%20rumors%20that%20Brandy%20Vaughan%20died%20of%20gallbladder%20attack%2Fdisease&body=https%3A%2F%2Fhealthnutnews.com%2Fbreaking-authorities-debunk-false-rumors-brandy-vaughan-died-of-gallbladder-attack-disease%2F", "#"], "authors": [], "publish_date": "2021-02-19T01:13:04-05:00"}