{"result_id": "149018", "URL": "https://healthnutnews.com/famous-nyc-holistic-doctor-mitchell-gaynor-md-found-dead/", "timestamp": "2023-04-25 15:27:57 CEST+0200", "meta": {"description": "Holistic Oncologist of 30 years, Dr. Mitchell Gaynor from NYC, was found dead in the woods by his home in Upstate New York outside Manhattan.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/famous-nyc-holistic-doctor-mitchell-gaynor-md-found-dead/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "Dr. Mitchell Gaynor Found Dead", "cleaned_text": "UPDATE: The Sheriff’s office is calling it a suicide, even saying this to the NY Times. See link above. Here is a recap:\n\nIt is with great sadness that I break the news on an 11th doctor found dead in less than 90 days.\n\nBest selling author and Holistic Oncologist of 30 years, Dr. Mitchell Gaynor from NYC, was found dead in the woods by his home in upstate New York outside Manhattan.\n\nI’ve tried to break each story with as much tact as possible, given the circumstances. This has become an unintended series that I wish would never have happened. Most of the doctors are holistic, many we knew, and all are a great loss for the health community.\n\nThere is an outpouring of public support and love from his friends and colleagues who are posting about this tragic death on his personal page. His professional page and Twitter page have been removed. Again, we knew Dr. Gaynor and have spoken to his staff personally in New York and they confirmed with us that Dr. Gaynor has died. I wish it were a hoax but it is not.\n\nI had just read Mitchell Gaynor’s best selling book, “The Gene Therapy Plan,” a couple months ago as he sent an advance copy; we were honored he took the time to send us one. (I’d also had “Nurture Nature, Nurture Health” on my list, but hadn’t had a chance to read it.)\n\nI am told that Dr. Gaynor apparently died a few days ago after walking away from a car accident. It also appears from his Facebook page that he’d had an intestinal flu before that. UPDATE – Sheriff’s office says despite anything to the contrary, that it’s suicide. His body was allegedly discovered over the weekend (we are told) in the woods behind his country home in upstate New York, where he loved to walk.\n\nMore about this cutting edge doctor, who was healing cancer naturally, from his website:\n\nMitchell Gaynor, MD, is Founder and President of Gaynor Integrative Oncology and Gaynor Wellness in New York City. A renowned pioneer in the field of integrative oncology for 30 years, Dr. Gaynor is author, physician, speaker and composer of original sound healing meditations. His latest book, “The Gene Therapy Plan – Taking Control of your Genetic Destiny Through Diet and Lifestyle” (due in April, 2015, from Viking Press with a Forward by Dr. Mehmet Oz) provides a revolutionary approach to reverse gene damage associated with aging, cancer, obesity, and diabetes and to prevent future gene deterioration with specific programs that are appropriate for anyone who wants to maximize longevity for themselves, their children and future generations. Dr. Gaynor has a notable history in the treatment of chronic diseases, particularly cancer, with scientifically grounded therapies that augment traditional modalities.\n\nI don’t know the details of his death yet. Then again there are doctors who died months ago, like Dr. Nick Gonzalez (also in NYC and Suzanne Somer’s doctor) , whose website states that his autopsy results were inconclusive and didn’t support the initial findings of heart attack.\n\nAs far as Dr. Gaynor? He was perfectly healthy the last time we contacted him.\n\nMy heart goes out to family, friends and the many colleagues we have in common.\n\nI also want to share a message with all of you: despite what Snopes has written about my articles, I’ve always maintained I don’t know if these are connected. We have doctors reaching out to us today who are nervous because of the recent spate of deaths of holistic doctors, many of whom we knew. (Snopes actually attempted to debunk an article that was correct and quietly had to change the false information on their site.)\n\nSo again, it’s always wise to be aware (I say this to the holistic doctors who contact me, including my better half, one of the best known holistic doctors who is still hanging in there) but if we live in fear it can harm our immune system (and it’s no way to live, either).\n\nSo be safe, be aware, but don’t be scared.\n\nI’ll update you as soon as I know more. I’m still in a bit of shock right now…", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Mitchell Gaynor Found Dead", "description": "Holistic Oncologist of 30 years, Dr. Mitchell Gaynor from NYC, was found dead in the woods by his home in Upstate New York outside Manhattan.", "url": "https://healthnutnews.com/famous-nyc-holistic-doctor-mitchell-gaynor-md-found-dead/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:tag": "holistic doctor deaths", "article:section": "Environment", "article:published_time": "2015-09-16T19:05:56-05:00", "article:modified_time": "2020-01-22T01:19:25-05:00", "updated_time": "2020-01-22T01:19:25-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2015/09/mitchell.jpg", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2015/09/mitchell.jpg", "image:width": "480", "image:height": "360"}, "tags": ["Health", "Food", "Holistic Doctor Deaths", "Environment"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"11th (Holistic) Doctor Found Dead Dr. Mithchell Gaynor MD\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/tkU_Ds1wK7A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/tkU_Ds1wK7A?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "810", "embed_code": "<iframe loading=\"lazy\" title=\"Second Opinion with Mehmet Oz Featuring Dr. Michell Gaynor on Sound Healing\" width=\"1080\" height=\"810\" src=\"https://www.youtube.com/embed/DNCLEzVcdLA?start=478&amp;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/DNCLEzVcdLA?start=478&feature=oembed"}], "links": ["https://healthnutnews.com/breaking-ny-times-announces-11th-holistic-doctors-death-as-suicide-but-wait-theres-more/", "https://healthnutnews.com/2-more-mds-1-prominent-holistic-one-of-missing-docs-have-been-found-dead-bringing-the-total-to-8/", "https://healthnutnews.com/breaking-ny-times-announces-11th-holistic-doctors-death-as-suicide-but-wait-theres-more/", "http://genechanger.com/about-dr-mitchell-gaynor/", "https://healthnutnews.com/holistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus/", "tg://msg?text=11th%20Holistic%20MD%20%26%20Best%20Selling%20Author%20Mitchell%20Gaynor%20Found%20Dead%20In%20Woods - https%3A%2F%2Fhealthnutnews.com%2Ffamous-nyc-holistic-doctor-mitchell-gaynor-md-found-dead%2F", "mailto:?subject=11th%20Holistic%20MD%20%26%23038%3B%20Best%20Selling%20Author%20Mitchell%20Gaynor%20Found%20Dead%20In%20Woods&body=https%3A%2F%2Fhealthnutnews.com%2Ffamous-nyc-holistic-doctor-mitchell-gaynor-md-found-dead%2F", "#"], "authors": [], "publish_date": "2015-09-16T19:05:56-05:00"}