{"result_id": "149032", "URL": "https://healthnutnews.com/holistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus/", "timestamp": "2023-04-25 15:28:10 CEST+0200", "meta": {"description": "My partner had the honor of interviewing Dr. Nick Gonzalez before his death. I was fortunate enough to have met and known this brilliant man.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/holistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "Holistic MD Nick Gonzalez Death", "cleaned_text": "It brought me no joy to stumble upon the unintended series that I broke (as gently as possible) about all the holistic doctors who died within a matter of weeks. We knew some of them which made it all the more difficult to write about. I’d be writing one article as another doctor we knew died. It’s tragic and painful and I truly hope no more die or are killed.\n\nVitality Magazine published an article where Dr. Nick Gonzalez said that big pharma knew about his work and hoped he’d get “hit by a bus.” I tend to believe it, because someone very reputable who I know did the last interview ever with Dr. Gonzalez, which will be out soon and will shed more light on this. It appears there are other interviews out there too where he said virtually the same thing. I promise to share or link to the last interview whenever it does come out as, from what I hear, it’s very important to hear his final words.\n\nThe keynote speaker at this year’s Whole Life Expo is Dr. Nicholas Gonzalez of New York, one of a small number of doctors whose success in treating cancer exceeds that of mainstream oncology by a wide margin. His work thereby puts the lie to pharmaceutical propaganda that fuels a cancer industry bringing in hundreds of billions of dollars while fooling millions of desperate and bewildered patients. “I’ve been told drug companies know about my work but hope I get hit by a bus,” Dr. Gonzalez observes wryly.\n\nDr. Gonzalez helped countless patients including advocate and author Suzanne Somers. She has stated publicly that not only did she speak to him just days before he died, but that he was healthy and well. She also referenced my articles publicly that other doctors did die and that it’s all very “sinister.” Suzanne Somers also tweeted me about the death and my better half had interviewed her as well just weeks before he died. Sadly, we now have ten doctors who have died within a few months with the most recent being Mary Bovier, an osteopath just found stabbed to death days ago in her home. They had a person of interest who was interviewed and released (allegedly a doctor too and her boyfriend), but he has not been arrested at this time.\n\nWe have to wonder how many other times Dr. Gonzalez talked about big pharma wanting him to get “hit by a bus” (or whatever euphemism you want to give it), or how often he said publicly or privately that he’d heard that big pharma wanted him dead. Again, this could be a total coincidence but I think this is worthy of an article and the people I’ve been speaking to the last couple of days, agree.\n\nI’m doing a few interviews on TV shows I trust, about the series of articles I wrote, including GAIAM TV (they make the yoga mats). They have a whole TV network, like the alternative to Netflix, and I’m honored to be flying out to do two separate shows with a live studio audience that will be seen by many. I promise to post those air dates as soon as I know. I have been approached to do a few more as well, but want to make sure of their integrity.\n\nSuzanne Somers also tweeted me about the death of her beloved friend and doctor who really was what some called a miracle worker… (my twitter handle is @unhealthytruth)\n\nSince every friend, patient and family member I’ve talked with thus far have told me they are questioning the death of their loved ones – I do sincerely hope they’ll open full investigations. Some family members have even come forward publicly like the Bradstreets (family of Dr. Jeffrey Bradstreet who I interviewed exclusively) and family/loved ones of Dr. Bruce Hedendal. They appeared on CBS channel 12 saying they wanted answers in light of the other doctors who have died around the same time.\n\nBetween that and the local news calling the death and investigation of Dr. Jeffrey Whiteside (not to be confused with the death of Jeffrey Bradstreet) a total “mess,” I don’t think that we’ve gotten to the bottom of this.\n\nBoth MDs named Jeffrey were found dead, one (the first, Jeffrey Bradstreet MD) in a river with a gun shot wound to his chest and the other, Jeffrey Whiteside MD, in the woods (after 3 weeks of already searching that area which is mysterious) with a gunshot shot wound, reportedly to his head. Dr. Bradstreet’s case is still under investigation (though mainstream keeps saying apparent suicide), and Dr. Whiteside’s death was just called a suicide, but many of his peers and the public say the facts just don’t add up.\n\nAgain, just because I’ve written articles on these doctors doesn’t mean I know or believe they’re connected. I don’t know. But I can’t say with certainty that they aren’t. I know many family members believe their deaths weren’t “natural” or accidental and want answers and investigations opened now (if they aren’t already), and I hope they get the answers they deserve very soon!", "opengraph": {"locale": "en_US", "type": "article", "title": "Holistic MD Nick Gonzalez Death", "description": "My partner had the honor of interviewing Dr. Nick Gonzalez before his death. I was fortunate enough to have met and known this brilliant man.", "url": "https://healthnutnews.com/holistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:tag": "Holistic MD Nick Gonzalez", "article:section": "Health", "article:published_time": "2015-08-21T21:13:47-05:00", "article:modified_time": "2020-01-22T00:00:59-05:00", "updated_time": "2020-01-22T00:00:59-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2015/08/nickgonzalez.png", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2015/08/nickgonzalez.png", "image:width": "480", "image:height": "360"}, "tags": ["Health", "Holistic Doctor Deaths"], "tweets": [], "movies": [], "links": ["http://www.vitalitymagazine.com/article/alternative-medicine-takes-on-cancer-and-wins/", "https://healthnutnews.com/10th-doctor-osteopath-found-slain-in-her-home/", "http://twitter.com/unhealthytruth", "tg://msg?text=Holistic%20MD%20Nick%20Gonzalez%2C%20who%20died%20suddenly%2C%20said%20he%E2%80%99d%20heard%20big%20pharma%20hoped%20he%E2%80%99d%20get%20hit%20by%20a%20bus - https%3A%2F%2Fhealthnutnews.com%2Fholistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus%2F", "mailto:?subject=Holistic%20MD%20Nick%20Gonzalez%2C%20who%20died%20suddenly%2C%20said%20he%26%238217%3Bd%20heard%20big%20pharma%20hoped%20he%26%238217%3Bd%20get%20hit%20by%20a%20bus&body=https%3A%2F%2Fhealthnutnews.com%2Fholistic-md-nick-gonzalez-who-died-suddenly-said-hed-heard-big-pharma-hopes-he-gets-hit-by-a-bus%2F", "#"], "authors": [], "publish_date": "2015-08-21T21:13:47-05:00"}