{"result_id": "149020", "URL": "https://healthnutnews.com/how-medical-school-funding-from-big-pharma-impacts-your-health/", "timestamp": "2023-04-25 15:27:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/how-medical-school-funding-from-big-pharma-impacts-your-health/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "How Medical School Funding From Big Pharma Impacts Your Health", "cleaned_text": "Have you ever noticed that when you visit your doctor, they rarely- if ever- ask you about your food intake? Some doctors will go so far as to ask on a questionnaire that you fill out before your appointment, but then never reference it during your meeting time. However, most just don’t bother to ask. They likely don’t bother to ask because they don’t understand just how important food intake is. Why they don’t know that is an interesting (and terrifying) question.\n\nNow, in cases of obesity, you’ll likely have a doc ask you to cut out the fried food or if your blood pressure is elevated, maybe they will threaten you with future meds- but has one ever laid out a thoughtful food plan? And why not? In 2016 it’s nearly a consensus that food goes a long way in explaining our state of health.\n\nAnd yet, the typical medical student receives only 19.6 contact hours of nutrition education. As disturbing as this info may be the U.S. is one of the most overly medicated countries in the world who continue to struggle with issues like heart disease, obesity, and allergies. And according to an article from the Washington Post in 2015, nearly 60 percent of Americans are taking prescription drugs- the highest number ever.\n\nBut, if medicines aren’t working, and they clearly aren’t the solution, why aren’t doctors looking at something else? Anything else? Perhaps because until recently, U.S. pharmaceutical companies funded the majority of U.S. medical schools with very little regulation.\n\nFrom the One Green Planet article:\n\n“In 2008, AMSA (American Medical Student Association), in collaboration with The Pew Charitable Trusts, uncovered just how extensively pharmaceutical companies influenced medical institutions in the U.S. AMSA created a conflict-of-interests scorecard to show just how ethically academia was interacting with the pharmaceutical business:\n• 40 out 150 schools received an “F”, including Harvard, which had no conflict-of-interests policies in place. (Note: Harvard received an “A” on the next survey.)\n• Less than 15 percent of medical schools scored an “A” or “B,” insinuating the overwhelming majority of doctors have received a severely skewed education.”\n\nThat essentially means that before our physicians graduated and saw us as patients, they already knew what they were going to prescribe. All before we ever visited them. Basically that would be like Monsanto being allowed to control how the USDA handled GM foods (which kinda happens anyway, I know, I’m sadly cynical- but with good reason). I mean, if our medical schools could be bought, the U.S. would be one of the most overly medicated countries on Earth! Oh wait. Maybe there is a reason we are so sick.\n\nPills aren’t working. And if your doctor won’t even ask you about your diet, your sleep cycle, your drinking and exercise habits, it’s time to educate yourself. Let’s first overhaul our diets. There is so much good information out there now on how to eat well and what to eat. I changed my diet and life years ago and am so happy I did. If I can help encourage you with my story, I’d love to. Click here to check it out.\n\nSource: One Green Planet and The Washington Post", "opengraph": {"locale": "en_US", "type": "article", "title": "How Medical School Funding From Big Pharma Impacts Your Health", "description": "Have you ever noticed that when you visit your doctor, they rarely- if ever- ask you about your food intake? Some doctors will go so far as to ask on a questionnaire that you fill out before your appointment, but then never reference it during your meeting time. However, most just don’t bother to ask. They likely …", "url": "https://healthnutnews.com/how-medical-school-funding-from-big-pharma-impacts-your-health/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:section": "Health", "article:published_time": "2016-05-23T13:55:02-05:00", "article:modified_time": "2016-05-24T10:15:10-05:00", "updated_time": "2016-05-24T10:15:10-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2016/05/bigstock-medical-education-827652.jpg", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2016/05/bigstock-medical-education-827652.jpg", "image:width": "900", "image:height": "703"}, "tags": ["Health", "Food"], "tweets": [], "movies": [], "links": ["http://healthnutnews.com/monsanto-is-inside-everything/", "http://healthnutnews.com/fighting-cancer-by-putting-tumor-cells-on-a-diet/", "http://healthnutnews.com/about/", "http://www.onegreenplanet.org/natural-health/how-medical-school-funding-from-big-pharma-impacts-your-health/", "https://www.washingtonpost.com/news/to-your-health/wp/2015/11/03/more-americans-than-ever-are-taking-prescription-drugs/", "tg://msg?text=How%20Medical%20School%20Funding%20From%20Big%20Pharma%20Impacts%20Your%20Health - https%3A%2F%2Fhealthnutnews.com%2Fhow-medical-school-funding-from-big-pharma-impacts-your-health%2F", "mailto:?subject=How%20Medical%20School%20Funding%20From%20Big%20Pharma%20Impacts%20Your%20Health&body=https%3A%2F%2Fhealthnutnews.com%2Fhow-medical-school-funding-from-big-pharma-impacts-your-health%2F", "#"], "authors": [], "publish_date": "2016-05-23T13:55:02-05:00"}