{"result_id": "149026", "URL": "https://healthnutnews.com/the-special-ed-epidemic-what-is-happening-to-our-children-part-1-of-4-part-series/", "timestamp": "2023-04-25 15:28:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://healthnutnews.com/the-special-ed-epidemic-what-is-happening-to-our-children-part-1-of-4-part-series/", "encoding": "UTF-8"}, "image": null, "domain": "healthnutnews.com", "title": "The Special Ed Epidemic: What is happening to our children? Part 1 of 4 part series", "cleaned_text": "By Sheri A. Marino, MA, CCC-SLP, from WMP Partner: Focus for Health\n\nWMP Note: In this 4-part series, World Mercury Project partner, Focus For Health, examines the special needs epidemic and its effects on schools, the US economy, life after age 21 and the many theories that point to potential causes of the explosion of chronic disease and disability in our children.\n\nPick up a paper anywhere in the world and you are more than likely to see a story about the special needs epidemic affecting public schools.\n\nThe Hushed Chronic Disease and Disability Epidemic That Promises to Bankrupt America\n\nRecent headlines read “Wolf Creek Public Schools hires additional staff to work with severely disabled students” and “York school system nearly $1M over budget in special education spending,” and “7 EV teen suicides in 6 weeks alarm schools,” and, “How Vermont schools manage food allergies.”\n\nIf you take the time to read some of these disturbing articles, you will see quotes from school directors making comments like “What’s different from past years is the students we’ve received really do have severe, very particular learning needs that are well beyond what we would typically see. It caught us by surprise, for sure,” admits Jayson Lovell, Superintendent for Wolf Creek Public Schools. This school district is one example of districts needing to hire additional staff in order to accommodate a sharp rise in the number of students requiring services through IDEA (Individuals with Disabilities Act) due to their severely complex special education needs.\n\nThe US Centers for Disease Control and Prevention (CDC) reports disabilities affect 1 in 7 children. From the increased number of children requiring special education and related services to the increased number of health care professionals needed to care for children with chronic physical and mental health issues in the schools, school budgets are depleting rapidly. Fast-forward, when these children are adults, the workforce is affected, as is the housing industry. Every child with or without special needs is affected, just as every tax payer, with or without a child with special needs, will bear the burden.\n\nAccording to The National Center for Educational Statistics, the percentage of youth ages 3-21 served by IDEA, a federal mandate which provides a free and appropriate education has risen significantly since 1990. Data from school years 1990/91 through 2004/05 showed 4.7 million, or 11 percent, of the total public school enrollment required special education services. By 2014/15, children and youth served under IDEA had risen to 6.6 million, or 13 percent, of the total public school enrollment. And it isn’t only a rise in special education demands; sadly, there is great demand for nurses and even health clinics on school property to manage the dramatic increase in children with chronic health conditions and mental health disorders as well.\n\nOver the past 2 decades, the number of children with chronic health conditions doubled from 12.8 percent in 1994 to 26.6 percent in 2006.\n\nAs referenced in the Morbidity and Mortality Weekly Report, published by the CDC in 2013, mental health disorders among children are described as “serious deviations from expected cognitive, social, and emotional development.”\n• As many as 1 in every 33 children may be depressed. Depression in adolescents may be as high as 1 in 8.\n• In 2010, suicide was the second leading cause of death for individuals aged 12-17 yrs. The suicide rate for this age group was 4.5 suicides per 100,000.\n• It is estimated that 4.7% of adolescents aged 12–17 years reported an illicit drug use disorder in the past year and 4.2% had an alcohol abuse disorder in the past year.\n• Of the 100,000 teenagers in juvenile detention, an estimated 60% have behavioral, cognitive, or emotional problems.\n• Less than 1/3 of the children under age 18 who have a serious mental health problem receive any mental health services.\n• Mental health disorders are said to be the most costly disorders to treat in children because of the impact on the child, family, and community, costing the US an estimated $247 billion dollars annually for health care, special education, juvenile justice and decreased productivity.\n\nAlarming rise in kids hospitalized with suicidal thoughts or actions\n\nMental health disorders in children can result in difficulties in school, at home, and with peer relationships. Studies show 40% children with mental health disorders also have a second mental health diagnosis and are also more likely to develop chronic health disorders including asthma, diabetes and epilepsy. They also have a greater risk for mental health disorders as adults which negatively affects productivity, increases substance abuse, and ultimately becomes a financial burden to the individual and society.\n• The CDC reports autism rates of 1 in 68 American children, up 30% from the 1 in 88 rate reported in 2008, and more than double the 1 in 150 rate in 2000.\n• Autism affects 4-5 times as many boys than girls.\n• Compared to the general pediatric population, children with autism have higher rates of co-occurring psychiatric and medical illnesses including GI disorders, epilepsy, dyslipidemia, vision and hearing impairments, hypertension, autoimmune conditions, asthma, allergies, and others, extending across all age groups.\n• Economic costs for 2015 were at an estimated $268 billion in the United States.\n• A study published in 2015 in The Journal of Autism and Developmental Disorders projects economic costs rising to $461 billion in 2025 if autism’s prevalence continues at today’s rates. Projected costs could exceed $1 trillion by 2025 if prevalence continues to rise at the same rate it has this past decade.\n• Direct costs include medical care, hospitalizations, special education, special therapies (occupational, speech and physical therapy), and paid caregivers. Indirect costs include lost productivity for family caregivers due to the inability to maintain employment while caring for affected individuals as well as lost wages and benefits.\n• The National health Interview Survey (NHIS) 2011-2013 reported 9.5% of children ages 4-17 had been diagnosed with ADHD.\n• This study also reported the rate of ADHD in children aged 5–17 years increased significantly from 7.0% to 10.2% between 1997–1999 to 2012–2014.\n• Boys (13.3%) continue to be more than twice as likely as girls (5.6%) to have current ADHD.\n• According to a more recent population-based study using DSM-IV criteria, 15.5% of school children enrolled in Grades 1 to 5 have ADHD.\n• The economic cost of ADHD is reported to range between $143 billion to $266 billion in the US (adjusted to 2010 U.S. dollars) every year.\n• Of the total annual cost of ADHD, 26–27% was incurred by children ($38 billion–$72 billion).\n• Direct costs are inclusive of special education, special therapies (occupational, speech and physical therapy), school counseling, and disciplinary incidents. Other costs related to health care include primary care and specialty care visits, medications, emergency room visits, behavioral and emotional health care.\n• Food allergies have been skyrocketing in the United States in the last fifteen years. According to the CDC, food allergies increased 50% between 1997 and 2011.\n• Researchers estimate that up to 15 million Americans have food allergies, including 5.9 million children under age 18. That’s 1 in 13 children, or roughly two in every classroom.\n• The CDC reported a 265% increase in the rates of hospitalizations related to food allergic reactions in a ten year period.\n• Between 1997 and 2008, the prevalence of peanut or tree nut allergy appears to have more than tripled in U.S. children.\n• The New York Times reports record sales growth for EpiPens, a life-saving medical device for those with food allergies.\n• Nearly 40% of children with food allergies have experienced a severe allergic reaction such as anaphylaxis.\n• Private insurance claims for anaphylactic food reactions rose 377% from 2007 to 2016.\n• Researchers reporting in the Journal of the American Medical Association state that the costs of food allergies, from medical care to food to pharmaceuticals, is $4,184 per child per year, costing our economy $25 billion, including lost productivity.\n\nWhy Your Grandparents Didn’t Have Food Allergies but You Do\n\nThe economic burden to care for children with developmental and medical needs affects not only families, but school districts, federal and local government budgets, social security, health insurers, and the insured, as well as every tax-payer in our nation.\n\nThis concludes Part One of “The Special Ed Epidemic: What is Happening to our Children?” Part Two, “Burying our Heads and Crippling our Economy,” will explore these financial burdens, especially the responsibility on school districts to accommodate the ever-growing and expanding nature of the special needs population.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Special Ed Epidemic: What is happening to our children? Part 1 of 4 part series", "description": "By Sheri A. Marino, MA, CCC-SLP, from WMP Partner: Focus for Health WMP Note: In this 4-part series, World Mercury Project partner, Focus For Health,  examines the special needs epidemic and its effects on schools, the US economy, life after age 21 and the many theories that point to potential causes of the explosion of chronic …", "url": "https://healthnutnews.com/the-special-ed-epidemic-what-is-happening-to-our-children-part-1-of-4-part-series/", "article:publisher": "https://www.facebook.com/HealthNutNews/", "article:section": "Health", "article:published_time": "2018-02-14T15:25:30-05:00", "image": "https://healthnutnews.com/wp-content/uploads/2018/02/02-13-Boy-by-bus-window_Featured_Image.jpg", "image:secure_url": "https://healthnutnews.com/wp-content/uploads/2018/02/02-13-Boy-by-bus-window_Featured_Image.jpg", "image:width": "800", "image:height": "417"}, "tags": ["Health", "Vaccine Injury", "Kids/Children"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"Food allergies in U.S. increased nearly five times over past decade: Report\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/AwMAMW2Ph6Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/AwMAMW2Ph6Q?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe loading=\"lazy\" title=\"&quot;Sounding The Alarm&quot; Documentary\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/de-FFNCBPzk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/de-FFNCBPzk?feature=oembed"}], "links": ["https://healthnutnews.com/hushed-chronic-disease-disability-epidemic-promises-bankrupt-america/", "http://www.focusforhealth.org/wp-content/uploads/2016/06/Chronic_Illness_in_US_Children_FINAL_3-3-2016.pdf?gclid=COqN84GvyNYCFRtXDQodRI0LIg-)", "https://www.focusforhealth.org/the-dangers-of-ignoring-mental-health-and-developmental-issues/", "https://healthnutnews.com/alarming-rise-in-kids-hospitalized-with-suicidal-thoughts-or-actions/", "https://www.focusforhealth.org/asthma-its-not-just-a-matter-of-genetics/", "https://www.focusforhealth.org/juvenile-diabetes-statistics/", "https://www.focusforhealth.org/the-state-of-epilepsy/", "https://spectrumnews.org/opinion/rising-rates/", "https://www.focusforhealth.org/autism-information-complex-disorder/", "https://healthnutnews.com/grandparents-didnt-food-allergies/", "https://www.cdc.gov/mumps/outbreaks.html", "https://nces.ed.gov/programs/coe/indicator_cgg.asp", "https://www.foodallergy.org/life-food-allergies/food-allergy-101/facts-and-statistics", "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6433a11.htm", "http://www.chadd.org/understanding-adhd/about-adhd/data-and-statistics/general-prevalence.aspx", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4058092/", "http://childhealthdata.org/docs/default-source/cahmi/asdchartbookfinal.pdf?sfvrsn=2", "https://www.cdc.gov/mmwr/pdf/other/su6202.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/25911091", "https://bangordailynews.com/2017/09/27/news/york-school-system-nearly-1m-over-budget-in-special-education-spending/", "http://www.eastvalleytribune.com/news/ev-teen-suicides-in-weeks-alarm-schools/article_5a3bf82a-9fe6-11e7-9e50-7f4f87c5e0ec.html", "http://digital.vpr.net/post/how-vermont-schools-manage-food-allergies#stream/0", "https://www.ncbi.nlm.nih.gov/pubmed/26183723", "https://worldmercuryproject.org/news/the-special-ed-epidemic-what-is-happening-to-our-children/", "tg://msg?text=The%20Special%20Ed%20Epidemic%3A%20What%20is%20happening%20to%20our%20children%3F%20Part%201%20of%204%20part%20series - https%3A%2F%2Fhealthnutnews.com%2Fthe-special-ed-epidemic-what-is-happening-to-our-children-part-1-of-4-part-series%2F", "mailto:?subject=The%20Special%20Ed%20Epidemic%3A%20What%20is%20happening%20to%20our%20children%3F%20Part%201%20of%204%20part%20series&body=https%3A%2F%2Fhealthnutnews.com%2Fthe-special-ed-epidemic-what-is-happening-to-our-children-part-1-of-4-part-series%2F", "#"], "authors": [], "publish_date": "2018-02-14T15:25:30-05:00"}