{"result_id": "151005", "URL": "https://hsionline.com/2004/10/29/memory-loss/", "timestamp": "2023-04-25 15:29:00 CEST+0200", "meta": {"description": "A migraine is not just a very bad headache; it's one symptom of a larger neurological and vascular disorder. Now a new study shows how one of the B vitamins may help cut the frequency of migraines by as much as half. We'll also tell you about another important nutrient that may significantly help reduce migraine frequency and nausea.", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://hsionline.com/2004/10/29/memory-loss/", "encoding": "UTF-8"}, "image": null, "domain": "hsionline.com", "title": "Memory loss", "cleaned_text": "This Week In The HSI Forum\n\n“I am wondering if there is any information on anesthesia after surgery regarding memory loss.”\n\nIn an HSI Forum thread titled “Anesthesia,” a member who calls herself “sha” posted that comment along with this specific information about her anesthesia experience:\n\n“I had breast cancer in 2002 and ended up having 5 surgeries in the past 2+ years. This last one, which was the final one 2 weeks ago, left me quite ‘blotchy’ in memory. I just couldn’t think straight and I couldn’t remember a lot of things. I had also stopped taking all of my supplements prior to the surgery. When I started taking them again it seemed to help, but not sure how much damage has been done. I do know that I was never asked after surgery how my memory was. Just looking for info and possible supplements to take to counter act the damage, if there are some.”\n\nThere certainly are. A member named Jerry writes: “For all memory problems including Alzheimer’s, take Ginko Biloba. 120 mg a day divided into three doses. Expect it to take up to a month or more to notice a difference.”\n\nAnd a member named Jo has this suggestion about an oil that’s quite rich in vitamin E: “We have heard good reports of the benefits of rice bran oil on mental functioning and personality, so why not take some, and please tell us how you get on.”\n\nFor anyone recovering from surgery, a high intake of good nutrients is essential, as a member named Joyce understands. Joyce writes: “I recently had bilateral hip surgery and my brain didn’t seem to function at more than half strength for a few weeks afterwards. It appears to be getting more up to speed again now 6 weeks later. Whether I’ve permanently forgotten anything remains to be seen! I too stopped my supplements for the 3 weeks I was in hospital, but have begun adding them back into my diet again since discharge. Multi vit and min, Chinese herbs, extra vits C and E, B complex, CoQ10.”\n\nJoyce is definitely on the right track. In the e-Alert “Before the Knife” (9/4/03), HSI Panelist Allan Spreen, M.D., explained that some supplements (such as vitamin C and N-acetylcysteine) should be discontinued before surgery so that general anesthesia won’t be impaired.\n\nAs for post-surgery supplementation, Dr. Spreen writes: “Surgery is a major stress, and for that you want the maximum dose of nutrients for the body to choose from for the repair function. The instant I could hold something down I’d be right back at them (and tons of other supplements) full force – C, A, E, B-complex, NAC, alpha lipoic acid, milk thistle extract, zinc, essential fatty acids, and others.”\n\nVitamin C in particular helped a member named Peggy: “Anesthesia does cause memory loss. Any time after I have anesthesia, I take 5,000 mg of vit. C. Then I continue to take Vit. C. Like about 20,000 mg in the first 24 hours. I do this just for anesthesia at a dentists office. Large amounts of Vit. C will detox the remaining anesthesia. The memory loss bouts come each time the body dumps a bit more of the anesthesia out of your body. I don’t know that Ginko would detox the body from anesthesia. But vit. C will. And, when the vit. C does cause the anesthesia to leave, you will feel a bit spacey for a short while.”\n\nIf you’ve ever had memory problems associated with anesthesia, please write and share your experience with us – especially if you found an effective way to regain lost memory or to overcome that “spacey” feeling.\n\nOther topics on the HSI Forum this week include:\n\nYou can easily reach the Forum on our web site at www.hsionline.com. Just click on “Forum,” and join in with any of the dozens of discussions about nutrition and natural health care.\n\nAre you sick of eating turkey burgers and sprouts sick of forcing gallons of water down your throatsick of exercising until you can hardly breathe?\n\nBefore you give up everything just because “everyone” says it’s healthy Find out why vegetarians actually die younger, why there is no benefit to drinking gallons of water, why you should keep your cholesterol level above 200, and many more myth-busting facts that will lead you on the road to real health.\n\nStop depriving yourself and find out how you can enjoy the food you love while improving your health at the same time!\n\nWell, there’s just no denying it. Deion Sanders is back, baby! Two interceptions – one returned for a touchdown. It doesn’t get much sweeter than that – unless you add the other two interceptions and the sack/fumble the Ravens defense forced against Buffalo last Sunday.\n\nAnd for all of you who are thinking, “Yeah, but your offense is the worst in the league.” I say, “So what?” It takes a whole team to win a game. Long balls and good pass blocking that don’t result in touchdowns are just useless stats at the end of the day. So as long as we put up more points than the other team and end the day with a “W,” I don’t care how we got there.\n\nRemember, this is a team that won the Super Bowl with one of the worst offensive teams in history, and after going five games without a touchdown.\n\nI’m sure at least one or two of you are thinking that solid defense and good special teams play will not be enough to defeat the undefeated Philadelphia Eagles at home next week, especially without Jamal Lewis. And you’re probably right. But the offense has done what it needed to do in just about every game. In most cases, this has called for protecting the ball and burning the clock. But if they need to step up, I’m confident they can – and will.\n\nAnd if they don’t, I’m certainly confident about putting a needed win in the hands of Ray Lewis, Deion Sanders, Chris McAllister, Ed Reed, Terrell Suggs and, of course, our new return specialist, B.J. Samms.\n\nIt’s like the year 2000 all over again. And that’s just fine with me.\n\nAre you one of the 50% of Americans whose arthritis could be caused by a hidden bacterial infection attacking your joints?\n\n* Reduce inflammation by 97% with scientifically proven natural supplements\n\n * Block 50% of rheumatoid arthritis attacks without drugs or injections\n\n * Cut your swelling in half by sipping a soothing herbal tea\n\n * Learn if your low-fat diet is literally drying out your joints.\n\n * Reveal 15 hidden warning signs that your arthritis is getting worse\n\nDiscover more about these safe, natural, and powerful arthritis-busting solutions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Memory loss", "description": "A migraine is not just a very bad headache; it's one symptom of a larger neurological and vascular disorder. Now a new study shows how one of the B vitamins may help cut the frequency of migraines by as much as half. We'll also tell you about another important nutrient that may significantly help reduce migraine frequency and nausea.", "url": "https://hsionline.com/2004/10/29/memory-loss/", "site_name": "Health Sciences Institute - Official Site", "article:publisher": "https://www.facebook.com/Health-Sciences-Institute-eAlert-1145703862147064/", "article:published_time": "2004-10-29T00:00:00+00:00", "article:modified_time": "2012-04-23T16:03:37+00:00"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Health Sciences Institute"], "publish_date": "2004-10-29T00:00:00+00:00"}