{"result_id": "151012", "URL": "https://hsionline.com/2003/12/10/the-nasal-flu-spray-vaccine/", "timestamp": "2023-04-25 15:29:10 CEST+0200", "meta": {"description": "Remember FluMist? It's the nasal-spray flu vaccine I first told you about in the e-Alert \"Nose Candy\" (7/8/03). Unlike the conventional flu shot, which contains inactivated flu strains, FluMist contains three living flu strains.", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://hsionline.com/2003/12/10/the-nasal-flu-spray-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "hsionline.com", "title": "The nasal flu spray vaccine", "cleaned_text": "You’ve probably heard the news by now: Doctors are running low on flu vaccines and are expected to run out completely before the flu season winds down. In one of the TV reports I saw, the commentator asked, “How could this happen?” And I had to laugh. How could it happen?\n\nHmmm let’s put on our thinking caps and try real hard to\n\n figure it out. Could it possibly be because nearly every TV news broadcast for the past month has been saying that this will be the worst flu season in years and everyone needs to drop what they’re doing – RIGHT NOW! – and go get a flu shot?\n\nMaking this news all the more dire is the fact that the final\n\n drop of flu vaccine has already been shipped out, so once the vaccine supply is used up, no more vaccine can be produced until next year. But before you barricade yourself in your home,vowing to stay safe inside until the flu season has passed, rest assured that there JUST HAPPENS to be an alternative to the dwindling vaccine supplies.\n\nCome and get it!\n\nRemember FluMist? It’s the nasal-spray flu vaccine I first told you about in the e-Alert “Nose Candy” (7/8/03). Unlike the conventional flu shot, which contains inactivated flu strains, FluMist contains three living flu strains. The Centers for Disease Control (CDC) calls FluMist “live attenuated influenza vaccine” or LAIV. In other words, the three strains are diluted. They’re alive as you or me, but watered down.\n\nNow – a show of hands – how many would feel comfortable inhaling not one, not two, but THREE LIVING flu strains? Not too many, is my guess. Which is probably one of the main reasons why ABC News has described sales of FluMist as “disappointing.” Disappointing so far, anyway.\n\nAccording to the Washington Post, the CDC gave FluMist a nice little boost last week when a statement was released “reminding” the public that FluMist is an appropriate alternative to the flu shot for those who are both healthy and between the ages of 5 and 49. Then on Monday, CDC director Dr. Julie Gerberding made appearances on several national news broadcasts (including ABC and CNN) and mentioned that a large supply of FluMist is still available.\n\nNow is it just me and my cynical streak, or does it seem somehow to be a very, let’s say “interesting,” coincidence that the country has been plunged into this supposedly dire emergency of vaccine shortage in the same year that a major new vaccine product is launched? No one I know has said they haven’t been able to get a flu shot. And I haven’t read about any doctors turning away patients who have requested a shot. But if the CDC says the supply is low, then I suppose the supply is low. And ifthe CDC says that the supply of FluMist is high, then I’m sure the supply is high.\n\nWhat Dr. Gerberding didn’t mention is that FluMist costs more than twice the amount of the flu shot. And because of this much steeper cost, many insurance companies won’t offer coverage for FluMist. But that’s only part of the FluMist problem.\n\nAs I stated in the July e-Alert, there’s a long list of\n\n potential problems with FluMist, but one of the key problems is the fact that those who decide to sniff living viruses into\n\n their heads instantly become infected by the flu. The immune\n\n system then responds by creating more antibodies that, in\n\n theory, will fight off any full-strength flu strains that might\n\n come along. But in the meantime, there’s a possibility that\n\n those who are recently FluMisted could be (I’ll bet you already guessed it) contagious!\n\nNice. Just what we need in the middle of a supposed flu\n\n epidemic: more contagious people running around.\n\nOf course, the makers of FluMist (MedImmune, a subsidiary of the drug giant Wyeth) play down the possibility of their product spreading the flu, stating that only a very small percentage of FluMist users will actually transmit a virus. Nevertheless, according to a report in Knight-Ridder Newspapers, the CDC cautions those who get a FluMist vaccine to stay away from people with vulnerable immune systems, such as the elderly or those struggling with diseases, for one week. But is one week long enough? Some hospitals are telling their personnel to allow\n\n three full weeks between their FluMist vaccine and contact with hospital patients.\n\nWhy the discrepancy? My guess is that this is such a new vaccine that no one really knows the parameters yet. Nevertheless, the CDC seems to be going out of their way to help MedImmune move their struggling product.\n\nAdd to that; the CDC web site states: “The optimal time to\n\n receive influenza vaccine is usually in October or November.” So if they’re using the same calendar I’m using, we’re already 10 days past the optimal usage period.\n\nAnd add to that; the people who supposedly need a flu vaccine the most – the elderly, and those with immune system diseases – shouldn’t be taking FluMist at all. The FDA hasn’t approved it for them. So the CDC is pressing those who are least vulnerable to the flu to run out and get a snootful of this expensive and relatively untested product, even though it’s almost two weeks past the optimal timing for the vaccine to even work!\n\nDoes any of this smell bad to you?\n\nWithout question, many are going to come down with the flu or some other unpleasant virus this season. Tomorrow I’ll leave thecares and woes of vaccines behind to take a look at some of the natural treatments that can help you kick a viral illness, while giving your immune system every advantage to do its best work.\n\nAnd they even work in December!\n\n“Questions and Answers About Live Attenuated Influenza Vaccine (Trade Name FluMist)” Centers for Disease Control, cdc.gov\n\n“CDC Director: ‘Doing Everything We Can’ to Distribute Flu\n\n Vaccine” CNN, 12/8/03, cnn.com", "opengraph": {"locale": "en_US", "type": "article", "title": "The nasal flu spray vaccine", "description": "Remember FluMist? It's the nasal-spray flu vaccine I first told you about in the e-Alert \"Nose Candy\" (7/8/03). Unlike the conventional flu shot, which contains inactivated flu strains, FluMist contains three living flu strains.", "url": "https://hsionline.com/2003/12/10/the-nasal-flu-spray-vaccine/", "site_name": "Health Sciences Institute - Official Site", "article:publisher": "https://www.facebook.com/Health-Sciences-Institute-eAlert-1145703862147064/", "article:published_time": "2003-12-10T00:00:00+00:00", "article:modified_time": "2012-03-21T15:42:12+00:00"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Health Sciences Institute"], "publish_date": "2003-12-10T00:00:00+00:00"}