{"result_id": "152009", "URL": "https://www.healthyandnaturalworld.com/skin-sensitive-to-touch/", "timestamp": "2023-04-25 15:29:46 CEST+0200", "meta": {"description": "Skin that is sensitive to the touch is a frustrating, and sometimes, unbearable condition. Learn about the causes of this condition and possible treatments.", "lang": "en", "keywords": "", "favicon": "https://www.healthyandnaturalworld.com/wp-content/uploads/2017/10/favicon.ico", "canonical": "https://www.healthyandnaturalworld.com/skin-sensitive-to-touch/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyandnaturalworld.com", "title": "The Surprising Reasons for Having Skin that is Sensitive to the Touch", "cleaned_text": "Skin that is sensitive to the touch is a frustrating, and sometimes, unbearable condition which can cause people discomfort and pain. The medical name for skin pain or tenderness is allodynia and it causes the skin to become very sensitive to even the slightest of touches. So, even things like a breeze, brushing light material against the skin, or gently touching the skin can cause pain and sensitivity.\n\nSensitive skin which is sore to touch can be divided into 4 different categories:\n• Tactile or mechanical allodynia is when the skin hurts when touched.\n• Dynamic mechanical allodynia is pain caused by light brushing across the skin.\n• Static mechanical allodynia is when light pressure causes sore skin.\n• Thermal allodynia describes the pain when mild changes in temperature make the skin sore to touch.\n\nHypersensitive skin which is sore to touch can cover large areas of the body or it can be localized to a small area. It is quite easy to test if you have the symptoms of sore skin or skin that is sensitive to touch. For example, take a light piece of gauze and brush it over your skin, or try blowing on your skin. If you experience any kind of pain, itchiness, tenderness, or a tingling feeling, then you may have allodynia.\n\nUsually, this kind of skin pain is not accompanied by a rash or any other visible symptoms.\n\nThere can be many reasons for having a hypersensitive skin that is sore to touch. In some cases, there are effective home remedies which can help to relieve the pain. There are, of course, reasons for this skin sensitivity which are caused by external factors, like sunburn or skin injuries. However, this article looks at the neurological reasons why skin can become very sensitive.\n\nFibromyalgia is a complex condition which is associated with chronic pain and one of its symptoms is skin that hurts, even if you barely touch it. Changes in temperature or clothing brushing on your skin can cause pain on the skin.\n\nAssociate Professor of Clinical Medicine, Dr. Lisa R. Sammaritano says that fibromyalgia causes increased sensitivity called “tender points.” So, even light pressure from touching the skin can cause localized pain. The reason why just a light touch causes the skin to be sore seems to be the fact that the brain interprets these signals as pain.\n\nIt is important to work together with your medical practitioner to manage the pain and other symptoms of fibromyalgia. The American Academy of Family Physicians says that good nutrition, regular sleep, and low-impact aerobic exercise can help to ease your symptoms.2\n\nMy article, about the 10 foods to avoid when living with chronic pain provides some helpful advice on diet and lifestyle changes you can easily implement to get relief from chronic pain. Also the natural supplement D-ribose can help to improve energy production to alleviate chronic fatigue.\n\nIf you suffer from migraines, you may find that your skin becomes hypersensitive during a migraine attack. Even something as simple as combing your hair or touching your skin when you have a migraine could cause unbearable pain.\n\nProfessor of Anesthesia and Neuroscience at Harvard Medical School, Dr. Rami Burstein explains the reasons why migraines make the skin tender and painful to touch. He says that one of the reasons for increased skin pain is that the neurons in the nerves in the brain become more sensitive to stimuli. So even mild brushing or heat can make the skin painful to touch.3 Studies have shown that around 63% of migraine sufferers also experience skin that is sensitive to touch.4\n\nThe American Academy of Neurology says that preventative measures can reduce migraine attacks by more than half. They recommend the butterbur plant as an effective natural remedy to prevent migraines.5 This is just one of the natural ways to relieve a migraine that I have previously written about. You can also use essential oils for treating migraines as well as these natural ways to reduce stress levels.\n\nThere is also some evidence to suggest that a vitamin B deficiency could also trigger migraines in some people.\n\nDuring times of heightened stress and anxiety, you may find that your skin becomes more sensitive to touch. During times of stress, the body releases chemicals to sharpen our senses and stimulate the nervous system. Some people under extreme mental stress experience hypersensitivity in the skin which causes pain when touched. The journal Drugs Under Experimental and Clinical Research reported that patients who have anxiety and anxiety-related conditions experience symptoms associated with hypersensitivity of skin.6\n\nIf you find that your skin is painful to touch when you are anxious, you can try some relaxation techniques to reduce the skin’s sensitivity. The Anxiety and Depression Association of America recommends the following strategies to lower stress levels:7\n• Take some time out to relax, listen to music, or have a massage.\n\nBergamot essential oil is one of the best essential oils for anxiety and depression, and can be used in aromatherapy to help reduce anxiety and work-related stress. You can find out more about the amazing health benefits and uses of bergamot essential oil by reading my article. There you can read about a study that shows that bergamot oil is just as effective as diazepam, one of the most popular anti-anxiety medications, in reducing anxiety.\n\nShingles are described as a painful, blistering rash on the skin that is caused by the varicella-zoster virus. Shingles cause unbearable pain on the skin which can last for a few weeks. For shingles to develop, a person must have had chicken pox in childhood. Shingles appear when the immune system becomes weak and the virus affects the nerve cells, so the older we get the more prone we become to developing shingles.8\n\nDr. Louise Chang on WebMD says that sometimes the skin sensitivity and pain can continue after the red skin rash has disappeared and this is called postherpetic neuralgia. This is nerve pain due to damage caused by the varicella zoster virus.9 The result is that the skin is very sensitive to the touch. In fact, it can be so sensitive that even dressing, turning in your bed at night or a light breeze can make your skin painful.\n\nOne way to reduce the pain caused by shingles is to use Manuka honey as a topical treatment. Research has shown that Manuka honey can be used to treat shingles just as effectively as antiviral drugs.10 Another study showed that honey is just as effective as acyclovir in treating the herpes simplex virus.11 Acyclovir is commonly used to treat outbreaks of shingles.\n\nSoak a gauze in Manuka honey and place it directly onto the affected skin area to treat the virus that causes shingles and to soothe your painful skin.\n\nGeranium oil is another home remedy you can use if shingles have caused skin that is sensitive to touch, and it is one of the best essential oil for treating shingles. This oil has been proven to be effective in getting rid of pain caused by postherpetic neuralgia. One study showed that it provides quick relief from shingles pain and is more effective than capsaicin cream.12\n\nDiabetes can cause nerve damage which can make your skin sensitive and painful to touch. Very often diabetes sufferers find that their skin is sensitive to touch on their leg even though there is no rash with it. The journal Current Neuropharmacology says that allodynia can affect some diabetics so much that touching the skin causes extremely severe pain.13\n\nDiabetes should be managed under the supervision of a qualified medical practitioner. However, doctors generally agree that making lifestyle changes like losing weight, being more active, and having a healthy well-balanced diet can help to manage the symptoms of diabetes.14\n\nYou can find more helpful information on how to manage your diabetes in my articles about the best foods to control diabetes, how to use apple cider vinegar for diabetes, and in my article about the best spices and herbs for diabetes.\n\nLyme disease is transmitted by the bite of a tick and if left untreated can cause sensitive skin. The initial symptoms are like having the flu and maybe developing a round red rash around the area of the tick bite. If not diagnosed Lyme disease can progress and cause more serious complications, one of which is that the skin can become very sensitive to touch. According to the Indian Journal of Dermatology, Lyme disease can cause allodynia which can appear months to years after being infected.15\n\nThe best way to prevent getting Lyme disease is to avoid being bitten by a tick. The Mayo Clinic recommends the following to avoid tick bites:\n• Keep long pants tucked into your socks.\n• Check yourself for ticks after returning from a walk.\n\nIf you have been tested positive for Lyme disease and your doctor prescribes antibiotics, remember to do these 3 things after taking antibiotics to restore healthy bacteria in your digestive system.\n\nSome people experience a tingling sensation on their skin because of a vitamin B12 deficiency. Dr. Brunilda Nazario on WebMD says that other symptoms of a lack of vitamin B12 are tiredness, heart palpitations, digestive problems, and behavioral changes.16\n\nA study published in 2013 into how B12 supplements can reduce pain, found that they help to keep the brain and nervous system working properly and help blood to form. Those who took the supplements found that vitamin B12 helped to reduce the pain associated with sensitive skin. This also helped relieve pain caused by shingles.17\n\nIf you think you may suffer from a vitamin B12 deficiency, please read my article on the warning signs of vitamin B12 deficiency. There you can find practical advice on how to fix it.\n\nSkin that is sensitive to touch is also associated with diseases that affect the nervous system, for example, multiple sclerosis (MS). These diseases result in damage to the protective covering that surrounds nerve fibers in your brain and spinal cord. Of course, skin that is sore to touch and increased skin sensitivity is just one of the many symptoms of demyelinating diseases.\n\nRead these related articles:\n\n 1. Seven Types of Pain You should Never Ignore\n\n 2. The Top 16 Essential Oils to Relieve Pain and Inflammation\n\n 3. Top 22 Natural Painkillers in Your Kitchen\n\n 4. How to Make Anti-Inflammatory and Pain Relief Turmeric Ginger Tea\n\n Article Sources\n• Treatments that can help prevent migraine.\n• At risk for shingles and postherpetic neuralgia?\n• In vitro antiviral activity of honey against varicella zoster virus.\n• Topical honey application vs. acyclovir for the treatment of recurrent herpes simplex lesions.\n• Extraction of essential oil from geranium with supercritical carbon dioxide. Skin Is Sensitive to the Touch – Causes and Possible Treatments was last modified: by", "opengraph": {"locale": "en_US", "type": "article", "title": "The Surprising Reasons for Having Skin that is Sensitive to the Touch", "description": "Here's why your skin is sensitive to the touch and how to cure it", "url": "https://www.healthyandnaturalworld.com/skin-sensitive-to-touch/", "site_name": "Healthy and Natural World", "article:author": "https://www.facebook.com/HealthyAndNaturalWorld/", "article:section": "Health", "article:published_time": "2016-08-22T04:20:56+00:00", "article:modified_time": "2018-04-24T01:25:19+00:00", "updated_time": "2018-04-24T01:25:19+00:00", "image": "https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post863.jpg", "image:secure_url": "https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post863.jpg", "image:width": "560", "image:height": "290", "image:alt": "Skin Is Sensitive to the Touch – Causes and Possible Treatments"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthyandnaturalworld.com/get-rid-of-sunburn-and-sunburn-blisters/", "https://www.healthyandnaturalworld.com/12-natural-sleep-aids-to-get-better-sleep/", "https://www.healthyandnaturalworld.com/foods-to-avoid-with-chronic-pain/", "https://www.healthyandnaturalworld.com/d-ribose-for-chronic-fatigue-syndrome-fibromyalgia/", "https://www.healthyandnaturalworld.com/top-10-natural-tips-and-treatments-to-relieve-migraine/", "https://www.healthyandnaturalworld.com/best-essential-oils-for-migraines/", "https://www.healthyandnaturalworld.com/natural-remedies-for-anxiety-and-stress/", "https://www.healthyandnaturalworld.com/common-nutritional-deficiency-cause-migraine/", "https://www.healthyandnaturalworld.com/how-stress-affects-your-body/", "https://www.healthyandnaturalworld.com/simple-and-effective-meditation-techniques-to-reduce-stress/", "https://www.healthyandnaturalworld.com/best-essential-oils-anxiety-depression/", "https://www.healthyandnaturalworld.com/bergamot-essential-oil-health-benefits-and-uses/", "https://www.healthyandnaturalworld.com/natural-remedies-for-infections/", "https://www.healthyandnaturalworld.com/red-spots-on-skin/", "https://www.healthyandnaturalworld.com/manuka-honey-benefits-and-uses/", "https://www.healthyandnaturalworld.com/essential-oils-for-shingles/", "https://www.healthyandnaturalworld.com/9-secrets-of-losing-weight-without-diet/", "https://www.healthyandnaturalworld.com/early-warning-signs-of-diabetes-you-shouldnt-ignore/", "https://www.healthyandnaturalworld.com/6-best-foods-to-control-diabetes/", "https://www.healthyandnaturalworld.com/how-to-use-apple-cider-vinegar-for-diabetes/", "https://www.healthyandnaturalworld.com/spices-and-herbs-for-diabetes/", "https://www.healthyandnaturalworld.com/how-long-does-the-flu-last/", "https://www.healthyandnaturalworld.com/things-to-do-after-taking-antibiotics/", "https://www.healthyandnaturalworld.com/warning-symptoms-of-vitamin-b12-deficiency/", "https://www.healthyandnaturalworld.com/types-of-pain-you-should-never-ignore/", "https://www.healthyandnaturalworld.com/essential-oils-to-relieve-pain/", "https://www.healthyandnaturalworld.com/natural-painkillers-in-your-kitchen/", "https://www.healthyandnaturalworld.com/how-to-make-anti-inflammatory-turmeric-ginger-tea/", "https://www.hss.edu/conditions_lupus-and-fibromyalgia.asp", "http://www.aafp.org/afp/2000/1001/p1587.html", "http://brain.oxfordjournals.org/content/123/8/1703", "http://www.ncbi.nlm.nih.gov/pubmed/18059010", "http://tools.aan.com/press/index.cfm?fuseaction=release.view&release=1062", "http://www.ncbi.nlm.nih.gov/pubmed/16444909", "https://www.adaa.org/tips-manage-anxiety-and-stress", "http://www.aafp.org/afp/2000/0415/p2447.html", "http://www.webmd.com/skin-problems-and-treatments/shingles/features/at-risk-for-shingles-and-postherpetic_neuralgia#2", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3401066/", "http://www.ncbi.nlm.nih.gov/pubmed/15278008", "http://www.academia.edu/24283191/Extraction_of_essential_oil_from_geranium_Pelargonium_graveolens_with_supercritical_carbon_dioxide", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2430688/", "http://www.webmd.com/diabetes/features/five-ways-to-control-type-2-diabetes", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3667275/", "http://www.webmd.com/food-recipes/guide/vitamin-b12-deficiency-symptoms-causes#2", "http://www.hindawi.com/journals/np/2013/424651/", "https://pinterest.com/pin/create/bookmarklet/?is_video=false&url=https://www.healthyandnaturalworld.com/skin-sensitive-to-touch/&media=https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post863.jpg&description=Skin Is Sensitive to the Touch – Causes and Possible Treatments", "/cdn-cgi/l/email-protection#ab94d8dec9c1cec8df96f8c0c2c58be2d88bf8cec5d8c2dfc2ddce8bdfc48bdfc3ce8bffc4dec8c38b492b388be8caded8ced88bcac5cf8bfbc4d8d8c2c9c7ce8bffd9cecadfc6cec5dfd88dcac6db90c9c4cfd2968e999bc3dfdfdbd8918484dcdcdc85c3cecac7dfc3d2cac5cfc5cadfded9cac7dcc4d9c7cf85c8c4c684d8c0c2c586d8cec5d8c2dfc2ddce86dfc486dfc4dec8c384"], "authors": [], "publish_date": "2016-08-22T04:20:56+00:00"}