{"result_id": "152007", "URL": "https://www.healthyandnaturalworld.com/pain-in-the-back-of-head/", "timestamp": "2023-04-25 15:29:44 CEST+0200", "meta": {"description": "Discover the causes of pain in the back of head and what do to relieve and prevent headaches. Find out when you urgently need to see your doctor.", "lang": "en", "keywords": "", "favicon": "https://www.healthyandnaturalworld.com/wp-content/uploads/2017/10/favicon.ico", "canonical": "https://www.healthyandnaturalworld.com/pain-in-the-back-of-head/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyandnaturalworld.com", "title": "Why You Should NEVER Ignore a Pain in The Back of Your Head", "cleaned_text": "Have you ever wondered what causes the sharp pain in the back of your head? Usually, headaches in the back of head are the result of stress, muscle tightness, tension, the overuse of medications, and tiredness. Sometimes a pain in the base of your skull can be caused by Occipital neuralgia which is a condition that affects the nerves that run from the top of the spinal cord up through the scalp.\n\nHeadaches may also be caused by more serious conditions like tumors or disease. If you start suffering from chronic pains in your head and have other symptoms like dizziness or nausea, you should always see a doctor.\n\nThe pain in the back of your head occurs when one or a combination of factors affect your brain. The Mayo Clinic says that these factors can be chemical activity in your brain, the nerves of blood vessels surrounding your skull, or the muscles at the back of the head and neck.1 Also, some people are more prone to headaches than others.\n\nKnowing what causes headaches can help you know how to manage or prevent the pain you experience in the back of your head.\n\nWhat Causes Pain in the Back of the Head?\n\nTension headaches are usually caused by some type of emotional stress or tiredness and start with a pain at the back of your head and move toward the front. The University of Maryland says that tension headaches cause pain in your neck, scalp, and head and can affect both the right and the left side of your head. 2 People who suffer from tension headaches say that it feels as if there is a tight band across their head.\n\nDr. Neil S. Lava, who is a director of the Multiple Sclerosis Clinic at Emory University, says that tension headaches are often caused by tight muscles at the back of the neck. Usually, factors like emotional stress, fatigue, hunger, low iron levels, and bad posture can cause this.3 Along with the pain in your head, you could also feel irritated and be sensitive to light or noise.\n\nAccording to Dr. Lava, tension headaches don’t usually cause muscle weakness, nausea, blurred vision, or stomach pain.\n\nDoctors recommend taking steps to manage stress and practice relaxation techniques to prevent a pain in the back of your head which is caused by tension headaches.\n\nNeurologist, Dr. Joseph V. Campellone recommends using good posture when going about your daily activities. For example, if your job entails sitting at a desk all day, doing repetitive work or other close-up work, take some time out to exercise and stretch your neck and shoulders.4\n\nKeeping a diary can also help you identify what triggers your tension headache and help you to identify if this is the cause of the pain in the back of your head.\n\nTo get some relief from a tension headache, you can try some relaxation techniques or gently massage your temples and the back of your neck. Pain medicine can also help, but doctors warn that the overuse of pain medication can also be a cause of headaches (rebound headaches).\n\nIf you are interested in ways to reduce stress naturally, please read my article about 14 effective natural remedies for stress and anxiety.\n\nYou may experience a sharp pain at the back of your head and neck along with stiffness in your neck and shoulders. This type of pain could be caused by injured or strained muscles.\n\nDr. William H. Bland on WebMD says that the main causes for tight muscles which cause pains in the back of the head and neck are:5\n• Holding your head in one position for a long time.\n• Sleeping with a pillow that doesn’t support your head properly.\n• Injuring the neck or spine by tripping or being in an accident.\n\nHaving tight neck muscles can also cause sharp pains in the back of your head when you turn your head.\n\nIf the pain in the back of your head and neck is caused by muscle tightness, you can find out how to treat a stiff neck in one minute or less by reading my article on the subject.\n\nIf you notice that you get a sharp pain in the back of your head when you cough, sneeze, blow your nose, or even bend over you could have what doctors call a “coughing headache.” The Mayo Clinic says that this can cause a sharp, stabbing pain in the back of your head.6 It is not known what causes coughing headaches.\n\nThe best way to prevent coughing headaches is to try and avoid whatever triggers it. So, keep yourself as healthy as possible to avoid colds, sneezing or any other action which can put pressure on your brain.\n\nMigraines can cause severe headaches starting around the eyes and temple and then the pain can spread to the back of the head. Migraines can also cause neck pain and tingling sensation in your head.\n\nVery often migraines are preceded by aura – flashing lights, partial loss of vision, numbness, pins and needles, and possibly speech problems. The migraine can be accompanied by blurred vision, poor concentration, sensitivity to light and sound, nausea and vomiting. The Michigan Headache & Neurological Institute says that for most people “a migraine is a distinct and familiar event with predictable duration and resolution.”7\n\nDoctors believe that changes in the brain’s blood flow and nerve cell activity causes migraines. Migraines can be triggered by stress, hormonal factors, depression, certain foods, muscle tension, caffeine, and fatigue. Sometimes, environmental factors like flickering lights, changes in the weather and strong smells can trigger migraines.8\n\nI’ve also mentioned that migraines can be caused by a certain common nutritional deficiency.\n\nTo prevent migraines, most doctors recommend trying to avoid whatever triggers your migraines. You can also read my article on how to naturally relieve migraines.\n\nIf you have dizziness, double vision and a lack of coordination before you get severe pains in your head, then you could suffer from basilar migraines. Dr. Colin Tidy on Patient.info says that basilar-type migraine causes headaches at the back of the head.9 The pain at the back of your head can be throbbing or pulsating.\n\nThe causes of basilar migraines are similar to a regular migraine.\n\nOccipital Neuralgia and Pain at the Base of Skull\n\n\n\nA sharp jabbing pain that feels like an electric shock at the back of your head could be a symptom of occipital neuralgia. You may also find that your scalp is tender to touch and even a simple task like brushing your hair can cause pain. This type of pain can be caused by inflammation in the nerves at the back of your head.\n\nThe American Association of Neurological Surgeons (AANS) says that occipital neuralgia causes pain in the base of skull which usually radiates to just one side of the head, but can often be felt on both sides of the head.10\n\nTo help ease the pain caused by occipital neuralgia, AANS recommends using gentle heat treatments and rest for headache relief. A soothing massage can also help to get rid of the headache pain caused by occipital neuralgia. You can also use essential oils to relieve the pain.\n\nDoctors treat occipital neuralgia and migraines differently, so it’s important to know your symptoms to get the appropriate treatment for your headaches.\n\nSome people experience throbbing pains in the back of their head when working out or lifting weights. You may find that after jogging you suffer from headaches. Exercise headaches usually happen because the blood vessels at the back of the head and neck dilate and cause pain.\n\nDr. Laura J. Martin on WebMD says that there is usually nothing to worry about with exercise headaches and that they respond well to pain-relief medication.11 However, if your exercise headaches have recently started and are accompanied by nausea, vomiting, a stiff neck, loss of consciousness and/or double vision, you should contact a doctor immediately.12\n\nSometimes, you can prevent headaches that are associated with exercising by warming up before working out, running, or exercising.\n\nSharp Pain in the Back of Head After Sex\n\nMany people joke about the connection of headaches and sexual activity. However, any kind of sexual activity can cause a dull pain in the back of your head and neck that increases with sexual excitement.\n\nThe British Journal of Medical Practitioners describes this condition as “headaches associated with sexual activity” (HSA).13 Although HSA is harmless, it can have a negative impact on both partners because of a fear that sex will lead to a severe headache.\n\nIf you suffer from headaches during sex, open communication between you and your partner can help to alleviate any fears associated with headaches and sexual activity. Sometimes, taking a more passive role can help prevent headaches during sex.\n\nSevere bouts of shooting or jabbing pain in and around the head, face, and back of the neck can be a symptom of trigeminal neuralgia. The pain caused by trigeminal neuralgia has been described as “the most unbearably painful human condition.”13\n\nThe trigeminal nerve sits at the base of the brain and if an artery or vein puts pressure on it, the result is severe pain along the length of the nerve. Usually, the pain is felt on just one side of the face around the jaw, lips, gums, and cheek but it can also extend to the back of the head and neck.\n\nA headache which develops suddenly in the top, temples or back of the head and is tender to touch could be caused by giant cell arteritis (an inflammation of blood vessels in and around the scalp). You also may notice that your temples are swollen. This causes excruciating pain in the head and usually painkillers are ineffective at treating the pain.\n\nHeadaches are the main symptoms of giant cell arteritis and they occur because the arteries in the head become inflamed.\n\nIf you suspect you have giant cell arteritis, the UK’s National Health Service advise people to visit their doctor as soon as possible because early treatment is essential to prevent further serious complications.14\n\nArthritis sufferers often have headaches in the back of the head and neck. Orthopedic surgeon, Dr. Peter F. Ullrich says that the inflammation in the facet joints in the cervical spine between the shoulders and base of the head causes pain at the back of the head.16\n\nAlthough arthritis can be a difficult condition to treat and manage, there are many natural remedies for arthritis that can help you find relief from arthritic pain.\n\nIf you suffer from headaches and you have to regularly take pain-relief medication you could be suffering from rebound headaches or Medication Overuse Headaches. The Michigan Headache & Neurological Institute (MHNI) says that even regularly taking analgesic medications 3 times a week can cause rebound headaches.17\n\nMHNI recommends stopping taking analgesics regularly to break the cycle of headaches caused by the overuse of medication. At first, this may cause the pain to get worse; however, after stopping taking pain-relief medication most people feel a dramatic improvement in pain.\n\nThere are several ways that can help you get rid of headaches naturally and reduce the pain that they cause.\n\nOn some occasions, a sharp pain in the back of your head can be a symptom of a brain tumor. However, this is rarely the only symptom of severe pains in your head.\n\nNeurologist, Dr. Alicai R. Prestegaard says that generally headaches that are occasional, mild, of short duration and caused by identifiable factors are not a cause for concern. It is also very rare that a headache alone is a symptom of a brain tumor.18\n\nYou should visit a doctor if you have noticed a change in the frequency and intensity of your headaches.\n\nA sharp, throbbing pain in the back of your head is usually harmless and can be managed well. However, as I’ve mentioned in this article, headaches and neck pain can be symptoms of more serious health conditions.\n\nHowever, you may ask: “when should I call a doctor if I have a pain in the back of my head?” The National Headache Foundation recommends visiting a healthcare professional if you have any of the following conditions:19\n• Frequent headaches that are severe and come on quickly\n• Your headaches are accompanied by nausea, vomiting, confusion, fever, slurred speech, stiff neck, vision loss, frequent bouts of diarrhea.\n• You have constant throbbing pains in your head that get worse or won’t stop.\n• You have a headache following a head injury.\n• You have to take pain-relief medication more than 2 days a week.\n• The symptoms of your migraine headaches change.\n\nRead these related articles:\n\n 1. Top 15 Causes of Headaches and How to Get Rid of Them Naturally\n\n 2. Tingling in Head: Causes and Possible Treatments\n\n 3. Seven Types of Pain You should Never Ignore\n\n 4. The Best Essential Oils For Migraines and Headaches\n\n\n\n 2. \n\n 3. \n\n 4. \n\n 5. \n\n 6. \n\n 7. \n\n 8. \n\n 9. \n\n 10. \n\n 11. \n\n 12. \n\n 13. \n\n 14. \n\n 15. \n\n 16. \n\n 17. \n\n 18. \n\n 19. \n\n 1. Headache: causes 2. Tension headaches 3. Tension headaches: What are the symptoms 4. Managing tension headaches at home 5. Neck problems and injuries 6. Coughing headaches: symptoms 7. Sinus headache vs migraine 8. Migraine – causes 9. Migraine 10. Occipital neuralgia 11. Exercise headaches 12. Exercise headaches: symptoms 13. What if sexual activity is not a joke 14. What is trigeminal neuralgia 15. Giant cell arteritis symptoms 16. Cervical osteoarthritis 17. Medication overuse headache 18. Is this a brain tumor that hurts 19. When to see a healthcare professional\n\nPain in the Back of Head – Causes and Treatments was last modified: by", "opengraph": {"locale": "en_US", "type": "article", "title": "Why You Should NEVER Ignore a Pain in The Back of Your Head", "description": "This is why you have pain in the back of your head.", "url": "https://www.healthyandnaturalworld.com/pain-in-the-back-of-head/", "site_name": "Healthy and Natural World", "article:author": "https://www.facebook.com/HealthyAndNaturalWorld/", "article:section": "Health", "article:published_time": "2016-08-05T01:31:10+00:00", "article:modified_time": "2018-06-26T23:49:41+00:00", "updated_time": "2018-06-26T23:49:41+00:00", "image": "https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post853.jpg", "image:secure_url": "https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post853.jpg", "image:width": "560", "image:height": "290", "image:alt": "Pain in the Back of Head - Causes and Treatments"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthyandnaturalworld.com/headache-above-or-behind-left-eye/", "https://www.healthyandnaturalworld.com/neck-pain-headache/", "https://www.healthyandnaturalworld.com/headache-behind-right-eye/", "https://www.healthyandnaturalworld.com/pain-on-right-side-of-head/", "https://www.healthyandnaturalworld.com/how-to-increase-iron-levels-in-your-blood/", "https://www.healthyandnaturalworld.com/the-best-exercises-to-improve-your-posture/", "https://www.healthyandnaturalworld.com/natural-remedies-for-anxiety-and-stress/", "https://www.healthyandnaturalworld.com/simple-and-effective-meditation-techniques-to-reduce-stress/", "https://www.healthyandnaturalworld.com/headache-in-the-left-temple/", "https://www.healthyandnaturalworld.com/natural-remedies-for-anxiety-and-stress/", "https://www.healthyandnaturalworld.com/trapezius-strain/", "https://www.healthyandnaturalworld.com/how-to-treat-stiff-neck-and-pain/", "https://www.healthyandnaturalworld.com/sharp-pain-in-head/", "https://www.healthyandnaturalworld.com/headache-pain-in-right-temple/", "https://www.healthyandnaturalworld.com/tingling-in-head/", "https://www.healthyandnaturalworld.com/how-to-stop-vomiting/", "https://www.healthyandnaturalworld.com/signs-of-hormonal-imbalance/", "https://www.healthyandnaturalworld.com/depression-feel-better-with-these-natural-antidepressants/", "https://www.healthyandnaturalworld.com/common-nutritional-deficiency-cause-migraine/", "https://www.healthyandnaturalworld.com/top-10-natural-tips-and-treatments-to-relieve-migraine/", "https://www.healthyandnaturalworld.com/pain-or-headache-in-base-of-skull/", "https://www.healthyandnaturalworld.com/essential-oils-to-relieve-pain/", "https://www.healthyandnaturalworld.com/natural-remedies-for-arthritis/", "https://www.healthyandnaturalworld.com/best-essential-oils-for-migraines/", "https://www.healthyandnaturalworld.com/how-to-get-rid-of-diarrhea/", "https://www.healthyandnaturalworld.com/top-causes-of-headache/", "https://www.healthyandnaturalworld.com/tingling-in-head/", "https://www.healthyandnaturalworld.com/types-of-pain-you-should-never-ignore/", "https://www.healthyandnaturalworld.com/best-essential-oils-for-migraines/", "http://www.mayoclinic.org/symptoms/headache/basics/causes/sym-20050800", "http://umm.edu/health/medical/altmed/condition/tension-headache", "http://www.webmd.com/migraines-headaches/guide/tension-headaches", "https://medlineplus.gov/ency/patientinstructions/000421.htm", "http://www.webmd.com/a-to-z-guides/neck-problems-and-injuries-topic-overview", "http://www.mayoclinic.org/diseases-conditions/primary-cough-headaches/basics/symptoms/con-20024827", "http://www.mhni.com/headache-pain-faq/sinus-headache", "http://www.nhs.uk/conditions/Migraine/pages/causes.aspx", "http://patient.info/health/migraine-leaflet", "http://www.aans.org/Patient%20Information/Conditions%20and%20Treatments/Occiptal%20Neuralgia.aspx", "http://www.webmd.com/migraines-headaches/guide/triggers-exercise", "http://www.mayoclinic.org/diseases-conditions/exercise-headaches/basics/symptoms/con-20025221", "http://www.bjmp.org/content/what-if-sexual-headache-not-joke", "http://www.medicalnewstoday.com/articles/160252.php", "http://www.nhs.uk/Conditions/giant-cell-arteritis/Pages/Symptoms.aspx", "http://www.spine-health.com/conditions/arthritis/cervical-osteoarthritis-neck-arthritis", "http://www.mhni.com/headache-pain-faq/rebound-headache-moh", "http://www.mhni.com/headache-pain-faq/headaches-brain-tumors", "http://www.headaches.org/when-to-see-a-physician-for-your-headache/", "https://pinterest.com/pin/create/bookmarklet/?is_video=false&url=https://www.healthyandnaturalworld.com/pain-in-the-back-of-head/&media=https://www.healthyandnaturalworld.com/wp-content/uploads/2016/08/post853.jpg&description=Pain in the Back of Head – Causes and Treatments", "/cdn-cgi/l/email-protection#b689c5c3d4dcd3d5c28be6d7dfd896dfd896c2ded396f4d7d5dd96d9d096fed3d7d296938480958e8487878d96f5d7c3c5d3c596d7d8d296e2c4d3d7c2dbd3d8c2c590d7dbc68dd4d9d2cf8b938486dec2c2c6c58c9999c1c1c198ded3d7dac2decfd7d8d2d8d7c2c3c4d7dac1d9c4dad298d5d9db99c6d7dfd89bdfd89bc2ded39bd4d7d5dd9bd9d09bded3d7d299"], "authors": [], "publish_date": "2016-08-05T01:31:10+00:00"}