{"result_id": "152006", "URL": "https://www.healthyandnaturalworld.com/my-heart-hurts/", "timestamp": "2023-04-25 15:29:42 CEST+0200", "meta": {"description": "If you ask yourself \"why does my hurt hearts\" then this article will help you find out the most likely causes of hurt ache or hurt pain. Including common conditions causing your chest to hurt when you cough or breathe. Also discover what to do if your heart hurts.", "lang": "en", "keywords": "", "favicon": "https://www.healthyandnaturalworld.com/wp-content/uploads/2017/10/favicon.ico", "canonical": "https://www.healthyandnaturalworld.com/my-heart-hurts/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyandnaturalworld.com", "title": "Why Does My Heart Hurt? Common Reasons For Heart or Chest Pain", "cleaned_text": "Feeling like your heart hurts can cause you a lot of worry and stress. The reasons for chest or heart pain are many, and not all causes of pain in your heart area are a sign that you have cardiac pain. For example, your heart can hurt because of indigestion, stress, chest muscle strain, or lung problems. Of course, pain in the heart area could be related to problems with your heart or arteries. Therefore, you should always get squeezing or unexplained chest pains checked out.\n\nMany times when your heart hurts, you will have other accompanying symptoms that can help diagnose why your heart feels sore. For example, serious chest aches usually radiate to your left arm, shoulder, or jaw. However, signs of heartburn may also cause an aching heart along with a burning sensation in your upper abdomen. A heart that hurts with jabbing pains when you cough or breathe deeply could mean that you have a lung condition.\n\nIn this article, I will help to answer the question why your heart hurts. Even though your heart only hurts sometimes, identifying why your heart is sore can help you seek the best course of treatment. You will also find the answer to the question if it is possible to die from a “broken heart.”\n\nYour heart is located just behind your breastbone and on the left side of your upper chest. So, many aches related to your heart will be felt in your upper left chest. However, heart pain can be caused by organs, muscles, or ribs in your chest.\n\nDr. Charles Patrick Davis on MedicineNet explains about some types of chest aches and pains that can cause discomfort. These can be:1\n• Squeezing pain in the middle of your chest that radiates to the left arm\n• Discomfort around your heart caused by a rapid heartbeat\n• Random heart aches that come and go\n\nIt’s important to remember that you should never ignore feelings like your heart is aching. Even if the reason why your chest hurts is not serious, you may avoid complications of misdiagnosing serious heart conditions.\n\nOf course, your heart will hurt if you have problems with this important organ in your body. Here are some of the most common heart issues that causes chest pain near the heart.\n\nCoronary artery disease (or, sometimes called coronary heart disease) restricts blood flow to your heart causing aching pain in the center of your chest. This happens as plaque builds up in your arteries and affects your blood circulation.\n\nAccording to information published on PubMed Health, the most common symptom of coronary heart disease is chest pain in the heart area. This type of heart pain can feel like squeezing pains in the chest that spread to your arm. Your heart may start to hurt after physical exertion or it may come on suddenly.2\n\nAngina is the most common symptom of coronary artery disease. The National Heart, Lung, and Blood Institute says that other related symptoms of coronary artery disease include:3\n• Burning sensation in your chest that feels like heartburn\n• Heart pain that feels worse after physical activity or stress\n\nAngina is a serious cause of chest pain and you should see your doctor if your heart hurts after exercising. It’s also important to take care of your heart’s health by making simple lifestyle changes.\n\nIf your aching heart feels like an enormous weight is pressing on the center of your chest, it could be a sign of a heart attack. Heart attack pain can last for a couple of minutes or it could happen randomly over a few days.\n\nAccording to Dr. Melissa Conrad Stöppler, a heart attack feels like squeezing chest pain or a sense of fullness in the heart area. The heart pain can be constant for a few minutes or it can come and go. Very often the pressing chest aches spread to the left arm, back, neck, or jaw.4\n\nIf your heart hurts with any of the above symptoms, it’s important to call the emergency services immediately.\n\nMaking a few lifestyle changes can greatly reduce your risk of a heart attack. Regular exercise, enjoying a healthy diet, cutting down on saturated fats, and stopping smoking can boost the health of your heart.\n\nOther heart problems that cause aching heart\n\nOther reasons why your heart could be hurting could be due to myocarditis, pericarditis, or aortic dissection.\n\nMyocarditis. The European Heart Journal says that heart pain can be caused by myocarditis. This is inflammation of the heart muscle often caused by a viral infection. Symptoms of myocarditis include sharp jabbing pains in the heart, lightheadedness, shortness of breath, and signs of an infection.5\n\nPericarditis. Doctors say that pericarditis is an inflammation of the tissue surrounding the heart. This can cause sharp chest pains that gradually get worse. Sometimes, pericarditis heart pain can become chronic and persistent.6\n\nAortic dissection. Severe pain in your chest that feels like something is tearing through your chest could be a symptom of aortic dissection. The journal BMC Research Notes, says that a ruptured aortic artery in the chest can be accompanied by pain in the upper back. An aortic dissection can be life-threatening and requires prompt medical treatment.7\n\nThankfully, the majority of reasons why your heart hurts are not due to serious emergency conditions. Very often, heart aches can be related to stress.\n\nAcute or prolonged emotional or psychological stress can have negative impact on your health and cause heart pains.\n\nAccording to Dr. Varnada Karriem-Norwood on WebMD, stress can affect people in many different ways. However, very often stress causes your heart rate to increase, tightens heart muscles, and raises blood pressure. This can cause aching pains in your heart and tightness in the chest.8\n\nOther ways that stress can affect you physically may include any of the following:\n• Difficulty getting to sleep or disrupted sleep patterns\n\nTo help get rid of stress and lower its impact on your body, you can try some of my helpful natural remedies for stress relief. You may also find that some essential oils for relieving anxiety can help to lift your mood.\n\nStress can also lead to panic disorder that can impact your heart and cause your chest to hurt when you breathe.\n\nAccording to the Journal of Clinical Psychiatry, many people who have panic attacks say the chest pain feels like a heart attack. The heart can start to ache because of tense chest muscles, increased blood pressure, or lack of blood supply to the heart. Very often, the worry that the chest pain is cardiac-related only increases the feeling of panic and intensifies pain in the sore heart.9\n\nWhen having a panic attack, you may also suffer from some of the following symptoms:\n• Tingling in your hands or feet\n• Feeling like you are losing control or are about to die\n\nEmotional heartache can also literally cause your heart to ache. Stress from the loss of a loved one can impact the heart and may increase a person’s risk of heart-related complaints, including heart pain.\n\nA study published in the journal Open Heart found that grief can lead to a “broken heart.” Researchers found that stressful life events like the death of a partner can cause heart-related symptoms like blood clots, irregular heartbeat, heart attack, or other acute cardiovascular diseases.10\n\nConditions related to your chest or rib cage muscles can cause pain in your upper torso that feels like your heart hurts. Here are some of the most common causes of heart pain related to your musculoskeletal system.\n\nA sore heart may actually be coming from the intercostal muscles that are located between your ribs. Intercostal muscles in the ribcage can be stretched, strained, or pulled and be a reason for pain in the heart area. Pulled muscles in the chest can also cause mild to excruciating pain in your upper body.\n\nThe journal Australian Family Physician reports that chest wall pain is often caused by inflammation or tears in the chest muscles. Sometimes, pain in the back of the rib cage can wrap around to the front of the chest. Because intercostal muscle pain can feel like heart pain, it’s important for doctors to first rule out cardiac-related events.11\n\nIf doctors confirm that your heart feels sore because of intercostal muscle strain, you can try some of my home remedies for muscle pain.\n\nSternum pain (breastbone pain) is another cause of chest pain that feels like hurt pain. Sternum pain is usually caused by inflammation or an injury to the breastbone.\n\nCostochondritis is an inflammation of the cartilage that connects a rib to the breastbone (sternum) which can cause chest pain that feels as if your heart hurts.\n\nSternum pain can also be the result of an injury to the front of your ribs or viral or bacterial infections.\n\nDoctors from the Mayo Clinic say that pain of an inflamed breastbone can feel like a heart attack. The painful symptoms usually cause pain under your left ribs that gets worse when you breathe deeply. You may also find that pain in the center of your chest intensifies when you press on your breastbone.12\n\nYour heart may feel like it is aching if you injure the ribs on your left ribcage.\n\nUsing a cold or warm compress can take away the chest pain caused by injury to your ribs or breastbone.\n\nProblems with your lungs can potentially be a serious cause of noncardiac chest pain.\n\nPneumonia is often a complication of a respiratory infection like the common cold or flu and can cause an aching heart.\n\nDr. George Schiffman on eMedicineHealth says that stabbing chest pains in the heart area are often a symptom of pneumonia. Usually, the pain gets worse when you cough, sneeze, or breathe deeply. Because pneumonia causes a deep hacky cough, you might suffer from bouts of heart pain because of a chronic cough.13\n\nApart from chest pain and a cough that brings up colored mucus, other symptoms of pneumonia can include:\n\nPneumonia can be contagious and cause severe complication in infants or the elderly. Strengthening your immune system can help to prevent chest infections that lead to pneumonia. For other ways to avoid infections, please read my article on how to improve your immunity quickly.\n\nPleurisy is inflammation of the tissue surrounding the lung that can cause cardiac-like pain if it affects the left lung.\n\nDr. George Schiffman on MedicineNet describes chest pain caused by pleurisy as sharp stabbing pains that are worse when breathing. You may find that your chest feels tender to touch and it’s difficult to catch your breath if you have pleurisy. It is also possible to have back pain that worsens with coughing.14\n\nYour heart may start aching due to tightened chest muscles and constricted airways if you have an asthma attack.\n\nDr. William Blahd on WebMD says that inflammation in the bronchial tubes causes them to fill with mucus and tighten up. This can lead to severe coughing and chest pains along with wheezing and rapid breathing. It’s important to manage the symptoms of asthma and know the triggers to prevent serious breathing difficulties.15\n\nTo help ease your symptoms of asthma naturally you might find that some essential oils are useful to keep your airways open. Even if you are using some natural treatments for asthma, you should still follow your doctor’s advice to keep asthma under control.\n\nOther lung problems that can make your heart hurt\n\nCollapsed lung. Pneumothorax, or a collapsed lung, can cause sudden sharp pains that feel as if your heart is aching. According to Dr. Jaqueline Payne on Patient.info, a lung collapse can put pressure on the heart, causing stabbing pains on the left side of the chest.16\n\nPulmonary hypertension. Doctors from the Cleveland Clinic say that high blood pressure in the arteries that carry blood from the heart to the lungs can cause chest pain. This puts a lot of strain on the heart and can cause symptoms similar to those of angina.17\n\nPulmonary embolism. Doctors from the Mayo Clinic, say that a blood clot that gets into your lungs can cause your heart to hurt so much that it can feel like a heart attack. The chest pain in the heart area may get worse when you breathe. You may also have shortness of breath, cough up blood, and sweat excessively.18\n\nTo prevent complications from a pulmonary embolism, it’s important to reduce your risk of developing deep vein thrombosis.\n\nSome digestive problems can make your heart ache and can even mimic symptoms of a heart attack.\n\nHeartburn is a burning sensation in your chest caused by irritation when stomach juices escape back up your esophagus.\n\nThe journal Gastroenterology & Hepatology reports that acid reflux can be a cause of noncardiac chest pain. In fact, many people who visit the emergency room because their heart is extremely sore are actually experiencing heartburn. Sometimes, heartburn pain can even radiate to one or the other arm.\n\nHowever, the opposite could also be true. Doctors from the Harvard Medical School say that some people who think they have heartburn are actually having a heart attack. Doctors say that the difference between heartburn pain and a heart attack is that heartburn feels like burning in the chest whereas a heart attack is a squeezing pressure.20\n\nDrinking baking soda and water is a great way to relieve the symptoms of heartburn naturally.\n\nWhen to See a Doctor About Chest Pain\n\nEven though an aching heart doesn’t always mean that you have heart problems, you should never ignore chest pains. This is especially true if the chest pains around your heart are new, become very severe, or don’t go away after a few days.\n\nDoctors from the Cleveland Clinic recommend to get prompt medical attention in the following situations:19\n• Squeezing discomfort in the center of your chest\n• Feelings of pressure in your left arm, back, jaw, neck, or upper abdomen\n• Unrelenting chest pain that lasts for a few minutes\n• Heart pain that gets worse with exercise\n• Situations where your heart hurts randomly but the pain is very severe\n• 10 Signs of a Heart Attack Never to Ignore\n• Tightness in Chest: Heart Attack vs. Other Types of Chest Pain\n• Pain Under Ribs: The Most Common Causes and Treatments\n\nMedical Sources:\n• ClevelandClinic. 3 types of chest pain that won’t kill you. Why Does My Heart Hurt? Common Reasons For Heart or Chest Pain was last modified: by", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Does My Heart Hurt? Common Reasons For Heart or Chest Pain", "description": "If you ask yourself \"why does my hurt hearts\" then this article will help you find out the most likely causes of hurt ache or hurt pain. Including common conditions causing your chest to hurt when you cough or breathe. Also discover what to do if your heart hurts.", "url": "https://www.healthyandnaturalworld.com/my-heart-hurts/", "site_name": "Healthy and Natural World", "article:author": "https://www.facebook.com/HealthyAndNaturalWorld/", "article:section": "Health", "article:published_time": "2018-05-08T00:13:52+00:00", "article:modified_time": "2018-05-08T03:31:41+00:00", "updated_time": "2018-05-08T03:31:41+00:00", "image": "https://www.healthyandnaturalworld.com/wp-content/uploads/2018/05/post1212.jpg", "image:secure_url": "https://www.healthyandnaturalworld.com/wp-content/uploads/2018/05/post1212.jpg", "image:width": "560", "image:height": "290", "image:alt": "Why Does My Heart Hurt? Common Reasons of Heart or Chest Pain"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthyandnaturalworld.com/where-is-the-heart-located/", "https://www.medicinenet.com/causes_of_chest_pain_signs_and_symptoms/article.htm#what_is_chest_pain", "https://www.healthyandnaturalworld.com/types-of-pain-you-should-never-ignore/", "https://www.healthyandnaturalworld.com/pain-under-left-rib-cage/", "https://www.healthyandnaturalworld.com/improve-blood-circulation-naturally/", "https://www.healthyandnaturalworld.com/right-side-chest-pain/", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0086334/", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023366/", "https://www.healthyandnaturalworld.com/chest-pain-left-side/", "https://www.healthyandnaturalworld.com/simple-changes-to-prevent-heart-attack/", "https://www.medicinenet.com/heart_attack_symptoms_and_early_warning_signs/article.htm", "https://www.healthyandnaturalworld.com/signs-of-heart-attack-never-to-ignore/", "https://www.healthyandnaturalworld.com/nausea-after-eating/", "https://www.healthyandnaturalworld.com/upper-left-abdominal-pain-under-ribs/", "https://www.healthyandnaturalworld.com/chills-without-fever/", "https://www.healthyandnaturalworld.com/simple-changes-to-prevent-heart-attack/", "https://www.healthyandnaturalworld.com/great-natural-ways-to-quit-smoking-scientifically-proven/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2519249/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2878263/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2653043/", "https://www.healthyandnaturalworld.com/tightness-in-chest/", "https://www.webmd.com/balance/stress-management/stress-symptoms-effects_of-stress-on-the-body#1", "https://www.healthyandnaturalworld.com/reasons-your-digestive-system-doesnt-function-properly/", "https://www.healthyandnaturalworld.com/tricks-to-fall-asleep-when-your-mind-is-busy/", "https://www.healthyandnaturalworld.com/simple-and-effective-meditation-techniques-to-reduce-stress/", "https://www.healthyandnaturalworld.com/natural-remedies-for-anxiety-and-stress/", "https://www.healthyandnaturalworld.com/best-essential-oils-anxiety-depression/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2629063/", "https://www.healthyandnaturalworld.com/numbness-or-tingling-in-right-arm/", "https://www.healthyandnaturalworld.com/shivering/", "http://openheart.bmj.com/content/3/1/e000367", "https://www.healthyandnaturalworld.com/intercostal-muscle-strain/", "https://www.healthyandnaturalworld.com/pulled-muscle-in-chest/", "https://www.healthyandnaturalworld.com/back-rib-pain/", "https://www.racgp.org.au/afp/2015/august/musculoskeletal-chest-wall-pain/", "https://www.healthyandnaturalworld.com/essential-oils-for-muscle-pain/", "https://www.healthyandnaturalworld.com/sternum-pain/", "https://www.healthyandnaturalworld.com/pain-in-left-side-under-ribs/", "https://www.mayoclinic.org/diseases-conditions/costochondritis/symptoms-causes/syc-20371175", "https://www.healthyandnaturalworld.com/cold-or-heat-therapy-for-pain/", "https://www.emedicinehealth.com/bacterial_pneumonia/article_em.htm", "https://www.healthyandnaturalworld.com/types-of-mucus/", "https://www.healthyandnaturalworld.com/is-pneumonia-contagious/", "https://www.healthyandnaturalworld.com/natural-remedies-for-infections/", "https://www.healthyandnaturalworld.com/quick-life-hacks-to-improve-your-immunity-almost-immediately/", "https://www.medicinenet.com/pleurisy/article.htm", "https://www.healthyandnaturalworld.com/is-bronchitis-contagious/", "https://www.webmd.com/asthma/guide/asthma-symptoms#1", "https://www.healthyandnaturalworld.com/best-essential-oils-to-relieve-asthma/", "https://www.healthyandnaturalworld.com/natural-treatments-for-asthma/", "https://patient.info/health/chest-pain-leaflet/pneumothorax", "https://my.clevelandclinic.org/health/diseases/6530-pulmonary-hypertension-causes-symptoms-diagnosis-treatment-", "https://www.mayoclinic.org/diseases-conditions/pulmonary-embolism/symptoms-causes/syc-20354647", "https://www.healthyandnaturalworld.com/deep-vein-thrombosis-symptoms/", "https://www.health.harvard.edu/diseases-and-conditions/does-heartburn-feel-like-a-heart-attack", "https://www.healthyandnaturalworld.com/how-to-use-baking-soda-for-acid-reflux/", "https://www.healthyandnaturalworld.com/natural-treatments-for-heartburn/", "https://health.clevelandclinic.org/3-types-of-chest-pain-that-wont-kill-you/", "https://www.healthyandnaturalworld.com/signs-of-heart-attack-never-to-ignore/", "https://www.healthyandnaturalworld.com/tightness-in-chest/", "https://www.healthyandnaturalworld.com/pain-under-ribs/", "https://www.medicinenet.com/causes_of_chest_pain_signs_and_symptoms/article.htm#what_is_chest_pain", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0086334/", "https://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0023366/", "https://www.medicinenet.com/heart_attack_symptoms_and_early_warning_signs/article.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2519249/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2878263/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2653043/", "https://www.webmd.com/balance/stress-management/stress-symptoms-effects_of-stress-on-the-body#1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2629063/", "http://openheart.bmj.com/content/3/1/e000367", "https://www.racgp.org.au/afp/2015/august/musculoskeletal-chest-wall-pain/", "https://www.mayoclinic.org/diseases-conditions/costochondritis/symptoms-causes/syc-20371175", "https://www.emedicinehealth.com/bacterial_pneumonia/article_em.htm", "https://www.medicinenet.com/pleurisy/article.htm", "https://www.webmd.com/asthma/guide/asthma-symptoms#1", "https://patient.info/health/chest-pain-leaflet/pneumothorax", "https://my.clevelandclinic.org/health/diseases/6530-pulmonary-hypertension-causes-symptoms-diagnosis-treatment-", "https://www.mayoclinic.org/diseases-conditions/pulmonary-embolism/symptoms-causes/syc-20354647", "https://health.clevelandclinic.org/3-types-of-chest-pain-that-wont-kill-you/", "https://www.health.harvard.edu/diseases-and-conditions/does-heartburn-feel-like-a-heart-attack", "https://pinterest.com/pin/create/bookmarklet/?is_video=false&url=https://www.healthyandnaturalworld.com/my-heart-hurts/&media=https://www.healthyandnaturalworld.com/wp-content/uploads/2018/05/post1212.jpg&description=Why Does My Heart Hurt? Common Reasons For Heart or Chest Pain", "/cdn-cgi/l/email-protection#734c000611191610074e241b0a53371c1600533e0a533b16120107533b0601074c53301c1e1e1c1d53211612001c1d0053351c01533b16120107531c0153301b1600075323121a1d55121e0348111c170a4e5641431b07070300495c5c0404045d1b16121f071b0a121d171d12070601121f041c011f175d101c1e5c1e0a5e1b161201075e1b060107005c"], "authors": [], "publish_date": "2018-05-08T00:13:52+00:00"}