{"result_id": "152001", "URL": "https://www.healthyandnaturalworld.com/pain-on-left-side-of-head/", "timestamp": "2023-04-25 15:29:35 CEST+0200", "meta": {"description": "Learn about the reasons for left side head pain, including home remedies for sharp pain on left side of head and when to see a doctor.", "lang": "en", "keywords": "", "favicon": "https://www.healthyandnaturalworld.com/wp-content/uploads/2017/10/favicon.ico", "canonical": "https://www.healthyandnaturalworld.com/pain-on-left-side-of-head/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyandnaturalworld.com", "title": "Left Side Head Pain: What It Means and When to See a Doctor Quickly", "cleaned_text": "Dull throbbing or sharp pains on the left side of your head can affect your left temple, top of your head, or base of your skull. Left side head pain can be caused by lack of sleep, feeling hungry, being under stress, or irritated nerves in your head. Even though sharp stabbing pains on the left side of the head can be debilitating, they are rarely a sign of anything serious.\n\nThrobbing and relentless one-sided headache pain can greatly affect your daily activities. The aches and pains behind your left eye may come and go or they can become gnawing, pounding headaches. Sometimes, the shooting pain on the left side can be as sharp as a thunderclap.\n\nThere are many ways to relieve the pain of a crushing headache on the left side of your head. Very often, placing a cold compress on your temples or back of your neck soothes irritation and relieves the discomfort. Massaging the temples can also help to relieve tension and ease pressure from your head.\n\nIn this article, I will look at the reasons for a piercing headache or dull squeezing pains that affect your left side. Knowing the cause of headaches that affect just one side can also help make lifestyle choices to reduce the severity and intensity of head pain.\n\nSharp Pain on Just Left Side of Head\n\nMost headaches affecting just one side of your head are connected to arteries or nerves located on either side of your head.\n\nAccording to expert in facial cosmetic surgery Dr. Bhupendra Patel, your temporal artery and facial nerves are located on the left side and right side of your head. Irritation or inflammation along the nerve can cause one-sided head pain.1\n\nAlso, the mastoid bone behind your ear can become inflamed and sore, and this usually causes pulsating headache pain behind just one ear.\n\nAnother reason why throbbing headache pain can affect just the left side of your head is if your left sinuses are blocked.\n\nShould You Be Worried About Headache Pain on Left Side?\n\nThankfully, headaches on just the left side of your head are rarely anything to worry about. Even vise-like migraines that feel as if something is boring into your head will go with rest and/or medication.\n\nVery often, left-sided headaches or right-sided ones are due to our lifestyle choices. So, an intense throbbing headache can be caused by being hungry, drinking too much alcohol or caffeine, or being extremely tired.\n\nOf course, you should never ignore constant aching headache pain on the left side. At the end of the article, you will find out when to see a doctor for persistent pain on the left side of the head.\n\nSymptoms of Pain on Left Side of Head\n\nThe main symptom of pain on the left side of the head is, of course, a headache that varies in degrees of intensity.\n\nDr. Benjamin Wedro on MedicineNet says that other symptoms of one-sided head pain can include any of the following:2\n• Squeezing or throbbing pain in one side of the skull or face\n• A severe headache that is preceded by flashing lights or vision disturbance\n• Sharp pain from the back of the neck to the left temple\n• Intense headache pain along with nausea and vomiting\n• Changes in vision, speech, or comprehension that may or may not indicate a serious cause\n\nTypes of Headache Pain that Affect the Left Side\n\nLet’s look at some of the conditions that can affect the nerves, muscles, or tissue in your head that can cause a headache on just your left side.\n\nTension headaches are a common type of headache that can cause dull aches or pressure on the left side of your head (but can also affect the right side).\n\nDr. Colin Tidy on Patient.info says that tension headaches can affect just the left side of your head or right side. Very often, a tension headache can feel like uncomfortable pressure across the forehead. The head pain from a tension headache can spread and cause aching at the base of your skull.3\n\nTension headaches can happen frequently and the headaches can last from 30 minutes to a week.\n\nDoctors from the National Health Service say that tension headaches can be triggered by stress and anxiety, dehydration, hunger, or poor posture.4\n\nMigraines can cause intense throbbing pains that usually just affect one side of your head. Many migraine sufferers describe this as a pulsating headache pain on one side.\n\nAccording to Dr. Danette C. Taylor on MedicineNet, migraines could be caused by chemical changes in the brain. Migraines can cause one-sided pounding head pain that gets worse with physical exertion. The varying degrees of migraine pain can last from a few hours to several days.5\n\nOther symptoms of a migraine can include:\n• Pulsating pain behind one temple and seeing flashing lights\n• Numbness on one side of your body\n\nThere are many factors that can trigger a migraine headache. Please read my article for more information on how to get rid of migraines naturally. Some essential oils can also relieve pounding headaches.\n\nBeing under a lot of emotional stress or suffering from anxiety can result in squeezing pains on one side of your head.\n\nResearchers from the Anxiety and Depression Association of America say that anxiety can be a factor that triggers migraine-like headaches. This can cause pulsating pain on one side of your head or both sides. Sometimes, being under a lot of stress can cause chronic daily headaches.6\n\nLeft sided headache is just one way that stress affects your body. You can try some of my natural ways to relieve stress and anxiety as well as these essential oils to help relieve stress-induced migraines.\n\nPiercing pain behind your left eye or left temple could be a symptom of a cluster headache. It is thought that irritated facial nerves are to blame for the intense pain on one side of your head. This facial nerve irritation can also result in a runny nose, red eye, or swelling of the eyelid.\n\nDr. Michelle Blanda on Medscape says that sharp stabbing eye pain on one side of your face is the most common symptom of a cluster headache. The intense pain can start suddenly and last between a few minutes to a few hours. Cluster headaches can occur as much as 8 times in a day.7\n\nAt the end of the article, you can find some helpful ways to relieve bouts of cluster headaches.\n\nJabbing pain in your left temple that feels like something sharp stabbing your face may be an ice pick headache.\n\nResearchers in the journal Current Pain and Headache Reports say that ice pick headaches usually affect just one side of the forehead. They are usually short-lasting and may also induce nausea, sensitivity to light, or lightheadedness.8\n\nThe above study reported that taking melatonin can help reduce the frequency of ice pick headaches.\n\nCauses of Pain in Back of Head on Left Side\n\nSome conditions in your neck and back of your head can cause varying degrees of headache pain on the left side.\n\nTightness and pain that radiates from the base of your skull to the left side of your forehead could be a cervicogenic headache.\n\nYour cervical spine is the area below your skull and above your shoulders. The Journal of the American Osteopathic Association reports that damage to the vertebrae, nerves, or ligaments of your cervical spine can cause neck pain and headaches. The pain is usually localized to one side of your head and can affect the area behind your eyes, temples, or top of your head.9\n\nIf you are troubled by neck pain with a deep throbbing headache, you can try exercises to strengthen your spine. Also, many neck exercises help to relieve one-sided head pain.\n\nShooting, electric shock-like pains that affect the left side of your head and neck could be caused by irritated occipital nerves. Each side of your head has an occipital nerve that runs down the back of your head to the spine.\n\nDoctors from Johns Hopkins Medicine say that a pinched nerve in your neck can often cause “zapping” pains on one side of the scalp. Sometimes, the pain can feel like tingling in your head, other times it is like a sharp pain shooting from your neck to your left temple.10\n\nReleasing a trapped nerve in your neck may help to reduce the jabbing pains in the side of your head.\n\nThe mastoid process is a bony structure behind your ears that can cause throbbing pain behind the left ear.\n\nDr. John P. Cunha on MedicineNet says that an inner ear infection can inflame the mastoid process causing severe pain on the left side of the head behind the ear. Depending on the extent of the infection, you may also have a painful lump on the back of your head on the left side. Other symptoms can include:11\n• Redness and tenderness behind your left ear\n\nIf you have symptoms of an infected mastoid process or an inner ear infection, it’s important to seek medical advice quickly.\n\nMedical Causes of Pain in Left Temple of Head\n\nLet’s look in more detail at certain medical conditions that can cause pressure on the left side of your head.\n\nYou could have throbbing aches on the left side of your forehead if you have a sinus infection and blocked sinuses.\n\nDr. Tejas Raval, an expert on otolaryngology, says that sinusitis can cause a pressing headache on one or both sides of your head. If your sinuses just above the nose (ethmoid sinuses) are affected, pain could spread to your temples. Other symptoms of sinusitis can include:12\n• Blowing yellow or green snot from your nose\n\nTo help unblock your sinuses and relieve the head pain, try some essential oils to relieve sinus infections. Some of the best essential oils that are very effective for getting rid of nasal congestion are eucalyptus oil, lavender oil, or tea tree oil. You can also try neti pot or other home remedies for sinus infection.\n\nPain on the left side of your face or head along with a runny nose and a general feeling of being unwell are signs of an upper respiratory viral infection.\n\nThe journal American Family Physician reports that cold and flu viruses often result in a headache. Depending on your cold or flu symptoms, the headache could just affect one side of your forehead or give you a general headache. Other symptoms of the cold or flu include:13\n\nYou can help get rid of your flu symptoms faster by using some home remedies as soon as possible. For example, to treat the flu naturally, garlic has natural antimicrobial properties and honey can help to boost your immunity naturally.\n\nYour temporomandibular joint (TMJ) is between your jawbone and your skull. Any dysfunction in your TMJ can cause a one-sided headache and pain behind your left or right eye.\n\nAccording to the journal Pain, TMD can cause pain in the side of the temple where the joint disorder occurs. For some people that pain on one side of the head and jaw can last for many months or years. Other symptoms of TMD can include:14\n• Pain in the temporomandibular joint just below one or both of your temples\n\nYour temporal arteries run on either side of your head close to the temples. Inflammation of the left temporal artery can cause aching and tenderness in the left temple area.\n\nDr. Mythili Seetharaman, a Consultant Rheumatologist, says that giant cell arteritis (GCA) can cause localized temple pain on one side. Usually, GCA causes a burning, throbbing headache and eye pain. A person with GCA may also suffer from a tender scalp and have neck and shoulder pain.15\n\nGiant cell arteritis can also cause any of the following symptoms:\n• Constant severe headache on one side of your forehead\n\nLifestyle Factors that Cause Headaches on Left Side\n\nFor many people, lifestyle choices are a major cause of preventable headaches that result in temple pain or pain behind one eye.\n\nStress and tension headaches. Most doctors agree that stress is a major cause of tension headaches. Stress can tighten the muscles at the back of the neck and result in dull, aching head pain that spreads from the base of your skull to your temples.16\n\nHunger triggers headaches. Being hungry can trigger headaches with migraine-like symptoms and pain on one side of your head. The journal BMC Research Notes reports that about 30% of all headaches are in some way related to feeling hungry.17\n\nSleep deprivation. Not getting enough sleep and feeling tired can bring on a throbbing headache and make it difficult to concentrate. According to the journal Cephalalgia, lack of sleep results in deep boring headaches that can last from 1 hour to a whole day.18\n\nToo much alcohol consumption. Apart from damaging your liver, drinking too much alcohol can bring on a pounding headache along with feelings of nausea. Researchers have also discovered that even just small quantities of alcohol can increase the frequency and intensity of migraines and cluster headaches.19\n\nCompression. The journal Current Pain and Headache Reports said that wearing a helmet, a band on your head (like swimming goggles), or a tight hat can result in headaches. Usually, the head pain is worse on the side where the compression is felt. For migraine sufferers, prolonged compression of the head can lead to more intense headaches.20\n\nOther Reasons for Sharp Pains on Left Side of Head\n\nSome types of chronic headaches that don’t give you any relief can be associated with serious conditions.\n\nStroke. Although not common, Dr. Laurence C. Newman on WebMD says that a stroke can start with a sudden severe migraine-like headache. The more usual signs of stroke are weakness on one side of the body, loss of speech or slurring words, and confusion.21\n\nBrain tumor. Persistent, chronic headaches that cause vise-like squeezing head pains can be a sign of a brain tumor. However, researchers at Johns Hopkins reassure people that most headaches, even severe headaches are caused by migraines, clusters headaches, or tension headaches.22\n\nNummular headaches. Although not serious, nummular headaches can cause persistent headaches on one side of your head. The headache pain is sometimes made worse by intermittent sharp, stabbing pains that last for up to 2 hours. The pain is usually localized to an area 2-6 cm in diameter.23\n\nHome Remedies to Treat Sharp Headache Pain on Left Side of Head\n\nMany home remedies can help to get rid of a headache that affects one side of your head. These natural headache treatments can sometimes work as an alternative to over-the-counter pain medications.\n• Use a warm or cool compress on the left side of your head for quick headache relief. Cold helps to numb pain and reduce nerve irritation. Warmth relaxes tense muscles in your neck and helps you relax.\n• Add a few drops of lavender oil in a warm bath and soak for up to 20 minutes. Lavender is a natural analgesic for temple pain relief when you breathe the vapors in. The heat from the bath also helps to relax your shoulders and neck as well as helping to unblock sinuses.\n• Get some shut-eye to help your brain relax and get rid of your migraine or tension headache quicker. Sleep can also help to prevent your headache from getting worse as the head pain can increase sensitivity to light.\n• If pain on the left side of your head is accompanied by pangs of hunger, try eating a light meal. Boosting your sugar levels can help your brain to function better.\n\nYou can help to relieve dull aching pain on the left side of your head by combining essential oils. Many essential oils have natural pain-relieving properties and can help lift the head pain quickly.\n\nSome of the best essential oils you can use as a headache remedy include:\n• Chamomile oil because it has a calming effect\n• Eucalyptus oil for its cooling power and ability to unblock sinuses\n• Peppermint oil for its cooling effect and sinusitis relief\n\nMassage to relieve pain on the left temple of head\n\nYou can massage your temples to help get rid of throbbing head pain affecting one side of your skull.\n\nThe journal Cephalalgia reports that massaging the temples can help to ease painful headache symptoms.24 Also, Dr. Brunlinda Nazario on WebMD recommends massaging pressure points on your head to help get rid pounding temporal headaches.25\n• Combine 4 drops each of the 3 of the essential oils for pain relief with 1-oz. (30 ml) sweet almond oil or other carrier oil.\n• Put some of the essential oil blend on the tips of your forefingers.\n• Place your thumbs on your cheekbones in front of your ears\n• Put your fingertips on your temples and gently apply pressure in circular motions\n• Move your fingers along your hairline and continue massaging your scalp\n• Gradually work your way around your head massaging your scalp to help relieve head pain quickly and naturally.\n\nWhen to See a Doctor for Left Side Head Pain\n\nThankfully, most headaches that affect just one temple or one side of your head are nothing to be concerned about. Even thumping headaches that feel as if something is crushing your head can be a severe migraine or a cluster headache.\n\nHowever, doctors from the Cleveland Clinic say that some types of one-sided headaches require medical attention. Some of these include:26\n• Severe sharp cluster headaches that affect your daily activities or cause a lot of emotional distress.\n• Continual head pain on your left side or right side that lasts longer than 24 hours.\n\nYou should also see a doctor for any kind of headache that is accompanied by:27\n• A stiff neck and rash that could indicate meningitis\n• Severe night headaches that wake you up\n• Nausea and vomiting along with pounding head pain\n• The frequency and intensity of headaches increases\n• These Common Nutritional Deficiencies Can Cause Migraine Headaches\n• Pain in the Back of Head – Causes and Treatments\n• The Best Essential Oils For Migraines and Headaches\n\nMedical Sources\n• WebMD. Is it a migraine or a stroke?\n• HopkinsMedicine. Headache: could it be a brain tumor?\n• WebMD. Massage therapy for stress relief and much more.\n• WebMD. When to call a doctor about your migraine or headaches. Left Side Head Pain: What It Means and When to See a Doctor Quickly was last modified: by", "opengraph": {"locale": "en_US", "type": "article", "title": "Left Side Head Pain: What It Means and When to See a Doctor Quickly", "description": "Learn about the reasons for left side head pain, including home remedies for sharp pain on left side of head and when to see a doctor.", "url": "https://www.healthyandnaturalworld.com/pain-on-left-side-of-head/", "site_name": "Healthy and Natural World", "article:author": "https://www.facebook.com/HealthyAndNaturalWorld/", "article:section": "Health", "article:published_time": "2018-06-24T22:24:06+00:00", "article:modified_time": "2019-01-01T02:18:17+00:00", "updated_time": "2019-01-01T02:18:17+00:00", "image": "https://www.healthyandnaturalworld.com/wp-content/uploads/2018/06/post1242.jpg", "image:secure_url": "https://www.healthyandnaturalworld.com/wp-content/uploads/2018/06/post1242.jpg", "image:width": "560", "image:height": "290", "image:alt": "Left Side Head Pain: What It Means and When to See a Doctor Quickly"}, "tags": [], "tweets": [], "movies": [], "links": ["https://emedicine.medscape.com/article/834862-overview", "https://www.healthyandnaturalworld.com/pain-on-left-side/", "https://www.medicinenet.com/headache/article.htm", "https://www.healthyandnaturalworld.com/sharp-pain-in-head/", "https://www.healthyandnaturalworld.com/neck-pain-headache/", "https://www.healthyandnaturalworld.com/how-to-stop-vomiting/", "https://www.healthyandnaturalworld.com/headache-above-or-behind-left-eye/", "https://www.healthyandnaturalworld.com/pain-in-the-back-of-head", "https://patient.info/health/headache-leaflet/chronic-tension-headache", "https://www.healthyandnaturalworld.com/top-causes-of-headache/", "https://www.nhs.uk/conditions/tension-headaches/", "https://www.medicinenet.com/migraine/article.htm", "https://www.healthyandnaturalworld.com/tingling-or-numbness-in-left-arm/", "https://www.healthyandnaturalworld.com/headache-behind-right-eye/", "https://www.healthyandnaturalworld.com/common-nutritional-deficiency-cause-migraine/", "https://www.healthyandnaturalworld.com/top-10-natural-tips-and-treatments-to-relieve-migraine/", "https://www.healthyandnaturalworld.com/best-essential-oils-for-migraines/", "https://adaa.org/understanding-anxiety/related-illnesses/headaches", "https://www.healthyandnaturalworld.com/how-stress-affects-your-body/", "https://www.healthyandnaturalworld.com/natural-remedies-for-anxiety-and-stress/", "https://www.healthyandnaturalworld.com/best-essential-oils-anxiety-depression/", "https://www.healthyandnaturalworld.com/headache-above-or-behind-left-eye/", "https://emedicine.medscape.com/article/1142459-clinical", "https://www.ncbi.nlm.nih.gov/pubmed/27038969", "http://jaoa.org/article.aspx?articleid=2093083", "https://www.healthyandnaturalworld.com/top-13-exercises-to-strengthen-your-back-and-reduce-back-pain/", "https://www.healthyandnaturalworld.com/how-to-treat-stiff-neck-and-pain/", "https://www.healthyandnaturalworld.com/pinched-nerve-in-shoulder/", "https://www.healthyandnaturalworld.com/tingling-in-head/", "https://www.hopkinsmedicine.org/healthlibrary/conditions/adult/nervous_system_disorders/Occipital_Neuralgia_22,OccipitalNeuralgia", "https://www.healthyandnaturalworld.com/pinched-nerve-in-shoulder-blade/", "https://www.healthyandnaturalworld.com/mastoid-process/", "https://www.medicinenet.com/mastoiditis/article.htm", "https://www.healthyandnaturalworld.com/sharp-pain-in-ear/", "https://www.healthyandnaturalworld.com/lump-behind-ear/", "https://www.healthyandnaturalworld.com/ear-and-neck-pain/", "https://emedicine.medscape.com/article/1048596-overview", "https://www.healthyandnaturalworld.com/coughing-up-green-yellow-mucus/", "https://www.healthyandnaturalworld.com/swollen-cheek/", "https://www.healthyandnaturalworld.com/the-best-essential-oils-for-sinus-infection/", "https://www.healthyandnaturalworld.com/best-home-remedies-for-sinus-infection/", "https://www.healthyandnaturalworld.com/best-home-remedies-for-sinus-infection/", "https://www.aafp.org/afp/2006/1001/p1179.html", "https://www.healthyandnaturalworld.com/sore-throat-on-one-side/", "https://www.healthyandnaturalworld.com/how-to-clear-a-stuffy-or-runny-nose-in-1-minute/", "https://www.healthyandnaturalworld.com/how-long-does-the-flu-last/", "https://www.healthyandnaturalworld.com/top-10-natural-treatments-for-cold-and-flu/", "https://www.healthyandnaturalworld.com/common-mistakes-when-using-garlic-as-an-antibiotic/", "https://www.healthyandnaturalworld.com/honey-and-cinnamon-for-great-health/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3065515/", "https://emedicine.medscape.com/article/332483-clinical", "https://www.mayoclinic.org/diseases-conditions/tension-headache/symptoms-causes/syc-20353977", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4553925/", "https://www.healthyandnaturalworld.com/dangers-of-sleep-deprivation/", "https://www.ncbi.nlm.nih.gov/pubmed/2245462", "https://www.healthyandnaturalworld.com/common-habits-that-damage-your-liver/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4821937/", "https://www.healthyandnaturalworld.com/headache-in-the-left-temple/", "https://www.healthyandnaturalworld.com/early-signs-of-stroke/", "https://www.webmd.com/migraines-headaches/migraine-and-stroke#1", "https://www.hopkinsmedicine.org/health/articles-and-answers/wellbeing/headache-could-it-be-a-brain-tumor", "https://www.ncbi.nlm.nih.gov/pubmed/19810895", "https://www.healthyandnaturalworld.com/effective-natural-alternatives-to-ibuprofen/", "https://www.healthyandnaturalworld.com/uses-for-lavender-essential-oil/", "https://www.healthyandnaturalworld.com/essential-oils-to-relieve-pain/", "https://www.healthyandnaturalworld.com/essential-oils-for-migraines-and-headaches/", "https://www.ncbi.nlm.nih.gov/pubmed/11594999", "https://www.webmd.com/balance/stress-management/features/massage-therapy-stress-relief-much-more#1", "https://www.ncbi.nlm.nih.gov/pubmed/11594999", "https://www.webmd.com/migraines-headaches/guide/when-call-doctor-migraines-headaches", "https://www.healthyandnaturalworld.com/common-nutritional-deficiency-cause-migraine/", "https://www.healthyandnaturalworld.com/pain-in-the-back-of-head/", "https://www.healthyandnaturalworld.com/best-essential-oils-for-migraines/", "https://emedicine.medscape.com/article/834862-overview", "https://www.medicinenet.com/headache/article.htm", "https://patient.info/health/headache-leaflet/chronic-tension-headache", "https://www.nhs.uk/conditions/tension-headaches/", "https://www.medicinenet.com/migraine/article.htm", "https://adaa.org/understanding-anxiety/related-illnesses/headaches", "https://emedicine.medscape.com/article/1142459-clinical", "https://www.ncbi.nlm.nih.gov/pubmed/27038969", "http://jaoa.org/article.aspx?articleid=2093083", "https://www.hopkinsmedicine.org/healthlibrary/conditions/adult/nervous_system_disorders/Occipital_Neuralgia_22,OccipitalNeuralgia", "https://www.medicinenet.com/mastoiditis/article.htm", "https://emedicine.medscape.com/article/1048596-overview", "https://www.aafp.org/afp/2006/1001/p1179.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3065515/", "https://emedicine.medscape.com/article/332483-clinical", "https://www.mayoclinic.org/diseases-conditions/tension-headache/symptoms-causes/syc-20353977", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4553925/", "https://www.ncbi.nlm.nih.gov/pubmed/2245462", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4821937/", "https://www.ncbi.nlm.nih.gov/pubmed/20499214", "https://www.webmd.com/migraines-headaches/migraine-and-stroke#1", "https://www.hopkinsmedicine.org/health/articles-and-answers/wellbeing/headache-could-it-be-a-brain-tumor", "https://www.ncbi.nlm.nih.gov/pubmed/19810895", "https://www.ncbi.nlm.nih.gov/pubmed/11594999", "https://www.webmd.com/balance/stress-management/features/massage-therapy-stress-relief-much-more#1", "https://www.webmd.com/migraines-headaches/guide/when-call-doctor-migraines-headaches", "https://pinterest.com/pin/create/bookmarklet/?is_video=false&url=https://www.healthyandnaturalworld.com/pain-on-left-side-of-head/&media=https://www.healthyandnaturalworld.com/wp-content/uploads/2018/06/post1242.jpg&description=Left Side Head Pain: What It Means and When to See a Doctor Quickly", "/cdn-cgi/l/email-protection#bf80cccaddd5dadccb82f3dad9cb9fecd6dbda9ff7dadedb9fefded6d1859fe8d7decb9ff6cb9ff2daded1cc9fded1db9fe8d7dad19fcbd09fecdada9fde9ffbd0dccbd0cd9feecad6dcd4d3c699ded2cf84ddd0dbc6829a8d8fd7cbcbcfcc859090c8c8c891d7daded3cbd7c6ded1dbd1decbcacdded3c8d0cdd3db91dcd0d290cfded6d192d0d192d3dad9cb92ccd6dbda92d0d992d7dadedb90"], "authors": [], "publish_date": "2018-06-24T22:24:06+00:00"}