{"result_id": "152008", "URL": "https://www.healthyandnaturalworld.com/common-diseases-caused-by-vitamin-d-defficiency/", "timestamp": "2023-04-25 15:29:45 CEST+0200", "meta": {"description": "Vitamin D deficiency is more common than you may think. Find here common causes for lack of vitamin D and which diseases and conditions it can cause.", "lang": "en", "keywords": "", "favicon": "https://www.healthyandnaturalworld.com/wp-content/uploads/2017/10/favicon.ico", "canonical": "https://www.healthyandnaturalworld.com/common-diseases-caused-by-vitamin-d-defficiency/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyandnaturalworld.com", "title": "Vitamin D is Essential for Strong Immune System: Vitamin D Deficiency Symptoms That Most People Ignore", "cleaned_text": "Vitamin D deficiency is more common than you may think. In fact, it is so common that The American Journal of Clinical Nutrition called it a worldwide problem which is recognized as a pandemic. A survey in the UK showed that more than half of adults in the UK did not have enough vitamin D, and in the winter and spring about 1 in 6 people have a severe deficiency.\n\nStudies suggest that vitamin D deficiency is lined to diseases such as osteoporosis, dementia, diabetes, depression and even cancer.\n\nWhat is vitamin D and Why it’s So Important\n\nVitamin D is important for a good overall health and it plays an important role in making sure our muscles, heart, lungs and brain function well.\n\nVitamin D is required for strong immune system. Scientific review of 25 randomized controlled studies published in the BMJ concluded that vitamin D supplementation boosts immunity and cuts rates of cold and flu.\n\nOur body can make its own vitamin D from sunlight but many people have low levels during winter.\n\nYou can also get vitamin D from supplements, and a very small amount comes from a few foods you eat, such as some fish, fish liver oils, egg yolks and in fortified dairy, cereals and grain products.\n\nWhat makes vitamin D unique compared to other vitamins is that your body can make its own vitamin D when you expose your skin to sunlight, whereas you need to get other vitamins from the foods you eat.\n\nHow Long should you Spend in the Sun to get Enough Vitamin D?\n\nFinding out how long to stay in the sun in order to produce enough amounts of vitamin D can be very tricky and is different for every person, hence there isn’t one recommendation for everyone.\n\nThe reason for that is that the amount of time you need to spend in the sun for your skin to make enough vitamin D depends on a number of factors, such as how dark your skin is or how easily you get sunburnt, the thickness of the ozone layer, the time of the year and what time of day it is.\n\nIt is believed that short daily period of sun exposure without sunscreen (about 10-15 minutes for lighter-skinned people) during the summer months is enough for most people to make enough vitamin D.\n\nEvidence suggests that the most effective time of day for vitamin D production is between 11am and 3pm. The larger the area of skin that is exposed to sunlight, the more chance there is of making enough vitamin D before you start to burn.\n\n\n\nCommon Causes of Lack of Vitamin D\n• Limited exposure to sunlight – Some of us live in northern latitudes, wear long clothes, or have a job that is taken place mostly indoors. Also sunscreen inhibits vitamin D production.\n• Dark skin – People with dark skin have higher levels of melanin, and this pigment reduces the skin’s ability to make vitamin D when exposed to sunlight.\n• Kidney and liver function – These organs play an important role in converting vitamin D to its active form, so kidney or liver diseases can reduce the ability of these organs to create biologically active form of vitamin D in the body.\n• Strict vegetarian diet – Food sources that contain vitamin D are mostly animal-based, such as fish and fish oils, egg yolks, cheese, fortified milk and beef liver.\n• Digestive problems – Certain medical conditions, such as Crohn’s disease, cystic fibrosis, and celiac disease can reduce the ability of the intestines to absorb vitamin D from food.\n• Obesity – Obesity may cause low vitamin D levels. Research suggests that vitamin D may become ‘trapped’ inside fat tissue so less of it is available in our blood circulation.\n\nResearchers are still working to fully understand how vitamin D works within our body and how it affects our overall health, but it is believed to be a link between vitamin D deficiency to quite a number of ailments:\n\n1. Osteoporosis – An adequate amounts of calcium and vitamin D are important for maintaining bone density and strength. A lack of vitamin D causes calcium-depleted bone, which further weakens the bones and increases the risk of fractures. You can also read my article about the 4 steps to prevent osteoporosis.\n\n2. Asthma – Vitamin D deficiency is linked to lower lung functions and worse asthma control, especially in children. Vitamin D may improve asthma control by blocking inflammation-causing proteins in the lung, as well as increasing production of another protein which has anti-inflammatory effects. Read the article about natural treatments for asthma, which vitamin D is one of them.\n\n3. Heart health – Vitamin D deficiency may be linked to a higher risk of high blood pressure (hypertension) as well as increased risk of death from cardiovascular disease.\n\n4. Inflammation – It has been found that vitamin D deficiency is associated with inflammation, a negative response of the immune system. Vitamin D deficiency has been linked to a number of inflammatory diseases, including rheumatoid arthritis, lupus, inflammatory bowel disease (IBD) and type 1 diabetes.\n\n5. Cholesterol – Vitamin D regulates cholesterol levels in the blood: it has been shown that without adequate sun exposure, vitamin D precursors turn to cholesterol instead of vitamin D.\n\n6. Allergies – Studies show that children who had lower levels of vitamin D are more likely to have multiple food allergies.\n\n7. Influenza – Some studies showed a link between lack of vitamin D and common respiratory infections, and indicate that people with the lowest vitamin D levels report having significantly more cases of cold and flu than those with higher levels.\n\n8. Depression – Vitamin D deficiency is linked to depression: receptors for vitamin D are present on many areas of the brain and are involved in numerous brain processes, making it likely that this vitamin might be associated with depression and that vitamin D supplements might play an important role in treating depression.\n\n9. Type-2 Diabetes – Studies have demonstrated correlations between low vitamin D levels and the development of type 2 diabetes. Different studies provide evidence that vitamin D may contribute to glucose tolerance through its effects on insulin secretion and insulin sensitivity.\n\n10. Oral health – Several recent reports demonstrate a significant association between periodontal health and the intake of vitamin D. Also elderly patients with low vitamin D levels have a higher rate of tooth loss than those with high vitamin D levels.\n\n11. Rheumatoid arthritis – Low vitamin D may play a role in developing rheumatoid arthritis. Studies have found that women who get more vitamin D seem less likely to get rheumatoid arthritis. Also among people who already have rheumatoid arthritis, those with low vitamin D levels tend to have more active symptoms.\n\n12. Cancer – Vitamin D deficiency may be linked to cancer: a certain study indicated that more than 75% of people with a variety of cancers have low levels of vitamin D, and the lowest levels are associated with more advanced cancers. However additional research is required to determine whether higher vitamin D levels are related to lower cancer incidence or death rates.\n\nMaintaining proper vitamin D levels is one of the 70 habits featured in my e-book 70 Powerful Habits For A Great Health which will guide you how to take positive steps to improve your wellness and overall health.\n\nVitamin D Deficiency Increases the Risk of Dementia and Alzheimer’s Disease\n\nDementia is a chronic and progressive syndrome. It’s an umbrella term, under which several diseases and conditions are classified. The most prevalent type of dementia is Alzheimer’s disease.\n\nOther common types include vascular dementia, dementia with Lewy Bodies and fronto-temporal dementia. There are over 35.6 million people living with dementia worldwide, and a new case emerges every 7 seconds.\n\nNow, scientists linked vitamin D deficiency with a substantially increased risk of dementia and Alzheimer’s disease in older people. The research findings are very valuable and open up fresh possibilities in this area of health care and prevention.\n\nThe dementia study published in Neurology was conducted by an international team of researchers. 1,658 adults aged 65 and over were included in the study and followed over a period of six years.\n\nThe participants had to be able to walk unaided and were free from dementia, cardiovascular disease and stroke at the start of the study. It was discovered that adults who were moderately deficient in vitamin D (their vitamin D levels were between 25 and 50 nanomoles per liter) had a 53% increased risk of developing dementia of any kind.\n\nThe risk increased to 125% in those who were severely deficient (their vitamin D levels were below 25). For Alzheimer’s disease, the risk was 69% higher for those who were moderately deficient, and 122% higher for the severely deficient group.\n\nPrevious studies have established that there is a connection between low vitamin D levels and development of cognitive problems, but this is the first and most robust study that showed the significant risk of dementia and Alzheimer’s disease in people with vitamin D deficiency.\n\nOne of the researchers, Dr. David Llewellyn from the University of Exeter Medical School, points out that further clinical studies are needed to establish if eating vitamin D rich foods or taking supplements could indeed delay or even prevent the onset of Alzheimer’s disease and dementia.\n\nStudies suggest that vitamin D deficiency may actually be a major cause of influenza. A review of medical studies published in the British Medical Journal suggests that food should be fortified with vitamin D because it protects against acute respiratory tract infection such as cold and flu.\n\nResearchers claim that vitamin D supplements could prevent more than 3.25 million cases of cold and flu each year in the U.K alone.\n\nThe most interesting finding of the study was that vitamin D is a more effective than flu vaccine.\n\nOverall, the study said one person would be spared from influenza for every 33 people taking a vitamin D. However 40 people have to receive the flu vaccine in order to prevent one case of the flu.\n\nThat is more effective than flu vaccination, which needs to treat 40 to prevent one case.\n\nThose with severe vitamin D deficiency benefited the most from vitamin D supplementation. For these people, vitamin D supplementation was 10 times more effective than the flu vaccine.\n\nThe medical review suggests that taking vitamin D pills daily or weekly is better than taking one monthly super-dose of vitamin D.\n\nVitamin D is one of the many foods and supplements that can boost your immune system. You should also include in your diet nature’s most powerful antibiotics.\n\nAnother placebo-controlled, double-blind study showed that 93.3% of flu patients given certain food were completely symptom-free within two days.\n\nWhat to do if you have a vitamin D deficiency?\n\nTalk to your doctor if you’re concerned about the level of vitamin D you get from the sun and your diet. A simple blood test can determine whether or not you have vitamin D deficiency. Your doctor can advise if you need to take a vitamin D supplement. There is no consensus on vitamin D levels required for optimal health, and it differs depending on age and health conditions.\n\nFind here more essential nutrients you may be missing from your diet:\n• How To Fight Psoriasis With Vitamin D\n• 5 Essential Nutrients You May Be Missing From Your Diet\n\nwas last modified: by", "opengraph": {"locale": "en_US", "type": "article", "title": "Vitamin D is Essential for Strong Immune System: Vitamin D Deficiency Symptoms That Most People Ignore", "description": "Vitamin D deficiency is more common than you may think. Find here common causes for lack of vitamin D and which diseases and conditions it can cause. Vitamin D Deficiency is Linked to Gum Disease, Diabetes, Dementia, Depression and Even Cancer According to New Studies", "url": "https://www.healthyandnaturalworld.com/common-diseases-caused-by-vitamin-d-defficiency/", "site_name": "Healthy and Natural World", "article:author": "https://www.facebook.com/HealthyAndNaturalWorld/", "article:section": "Health", "article:published_time": "2019-07-20T23:02:28+00:00", "article:modified_time": "2020-03-16T03:56:19+00:00", "updated_time": "2020-03-16T03:56:19+00:00", "image": "https://www.healthyandnaturalworld.com/wp-content/uploads/2013/05/post1320.jpg", "image:secure_url": "https://www.healthyandnaturalworld.com/wp-content/uploads/2013/05/post1320.jpg", "image:width": "560", "image:height": "290", "image:alt": "Immune System Boosters: Foods, Vitamins and Supplements for Boosting the Immune System"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/356/bmj.i6583", "https://www.healthyandnaturalworld.com/4-steps-to-prevent-osteoporosis/", "https://www.healthyandnaturalworld.com/natural-treatments-for-asthma/", "https://www.healthyandnaturalworld.com/how-to-reduce-high-blood-pressure-naturally/", "https://www.healthyandnaturalworld.com/how-to-reduce-inflammation-with-these-foods/", "https://www.healthyandnaturalworld.com/simple-and-effective-ways-to-lower-cholesterol-naturally/", "https://www.healthyandnaturalworld.com/depression-feel-better-with-these-natural-antidepressants/", "https://www.healthyandnaturalworld.com/6-best-foods-to-control-diabetes/", "https://www.healthyandnaturalworld.com/natural-remedies-for-arthritis/", "https://www.healthyandnaturalworld.com/powerfulhabits", "https://www.bmj.com/content/356/bmj.i6583", "https://www.bbc.com/news/health-38988982", "https://www.healthyandnaturalworld.com/boost-immune-system/", "https://www.healthyandnaturalworld.com/powerful-antibiotics-that-dont-require-prescription", "https://www.healthyandnaturalworld.com/elderberry/", "https://www.healthyandnaturalworld.com/arthritis-and-vitamin-d-deficiency-the-connection/", "http://How To Fight Psoriasis With Vitamin D", "https://www.healthyandnaturalworld.com/5-common-vitamin-and-mineral-deficiencies/", "http://n.neurology.org/content/83/10/920", "https://pinterest.com/pin/create/bookmarklet/?is_video=false&url=https://www.healthyandnaturalworld.com/common-diseases-caused-by-vitamin-d-defficiency/&media=https://www.healthyandnaturalworld.com/wp-content/uploads/2014/06/post269b.jpg&description=12 Subtle Vitamin D Deficiency Symptoms That Most People Ignore", "/cdn-cgi/l/email-protection#4a75393f28202f293e777b786a193f283e262f6a1c233e2b2723246a0e6a0e2f2c2329232f2429336a1933273a3e2527396a1e222b3e6a0725393e6a1a2f253a262f6a032d2425382f6c2b273a7128252e33776f787a223e3e3a397065653d3d3d64222f2b263e22332b242e242b3e3f382b263d2538262e6429252765292527272524672e23392f2b392f3967292b3f392f2e672833673c233e2b272324672e672e2f2c2c2329232f24293365"], "authors": [], "publish_date": "2019-07-20T23:02:28+00:00"}