{"result_id": "153007", "URL": "https://www.healthyfoodhouse.com/were-not-gluten-intolerant-were-glyphosate-intolerant/", "timestamp": "2023-04-25 15:29:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Health, Health News, Lastest Health News, Health Tips, Natural Remedies, Diet & Weight Loss, Herbs & Oils, Healthy Drinks, Positive News", "favicon": "https://www.healthyfoodhouse.com/wp-content/uploads/2013/09/Healthy-Food-House-Logo.png", "canonical": "https://www.healthyfoodhouse.com/were-not-gluten-intolerant-were-glyphosate-intolerant/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthyfoodhouse.com", "title": "We’re Not Gluten Intolerant, We’re Glyphosate Intolerant", "cleaned_text": "Genetically Modified Foods are extremely detrimental as they wreak havoc on our health. According to a report released by the Institute for Responsible Technology (IRT), they are linked to gluten-related disorders.\n\nNumerous experts agree that the recent increase in gluten-related disorders cannot be explained by genetics alone, so they believe that some environmental trigger is a powerful contributing factor.\n\nThis can be of high importance as gluten sensitivity affects over 18 million Americans. Authors link GMO foods to five conditions that can trigger or worsen gluten-related disorders, based on U.S. Dept. of Agriculture data, Environmental Protection Act records, medical journal reviews, and international research:\n\nThere are 9 GMO food crops currently being grown for commercial use: soy, corn, cotton (oil), alfalfa, canola (oil), sugar from sugar beets, zucchini, yellow squash, and Hawaiian papaya.\n\nMost of them are made to tolerate a weed killer called glyphosate (Roundup®), and high levels of this toxin remain in them when harvested. Corn and cotton varieties are also engineered to produce an insecticide called Bt-toxin.\n\nAccording to the Executive Director of the Institute for Responsible Technology, Jeffrey Smith, the Bt-toxin is created to puncture holes in insect cells, but it does the same in human cells as well, so it can lead to leaky gut, which is common in gluten-sensitive patients.\n\nAlso, Stephanie Seneff, Senior Research Scientist at MIT, says that glyphosate is a patented antibiotic that kills beneficial bacteria in the gut, and an imbalance of gut flora is common in Celiac Disease and other gluten-related disorders.\n\nMoreover, researchers have found that Bt toxins found in Monsanto crops can damage blood cells, and potentially cause leukemia.\n\nAnother study showed that GMO animal feed leads to severe stomach inflammation and enlarged uteri in pigs, and numerous others have linked GMOs to cancer, and various other diseases.\n\nTherefore, scientists urge the ban on GMOs. Also, a growing number of people in North America continue to protest against GMO usage as well, and public figures are also continuing to speak up.\n\nThe former Canadian Government Scientist at Agriculture Canada, Dr. Thierry Vrain is one of them, as the spoke out against GMOs.\n\nGeneticist David Suzuki is another prominent public figure who has been a long time advocate against GMOs and has been speaking out about the extent to which GMOs can be hazardous to human health as well as the environment. He even declared that the use of these foods makes human beings participants in a massive experiment.\n\nDr. Tom O’Bryan, an internationally recognized expert on gluten sensitivity and Celiac Disease, says that GMOs are a potential explanation of the rapid rise in gluten-related disorders over the last few decades.\n\nAdditionally, internist Emily Linder, MD, explains that she agrees that GMOs contribute to the increase of gluten sensitivity in the US population, as when she removes genetically modified foods as part of their treatment, patients recover faster and completely.\n\nSo far, activism is paying off as numerous places around the globe have banned GMO foods, so we can hopefully push forward with this matter. Yet, we are never safe until GMOs no longer exist, so we should all go on fighting.", "opengraph": {"locale": "en_US", "type": "article", "title": "We’re Not Gluten Intolerant, We’re Glyphosate Intolerant", "description": "Genetically Modified Foods are extremely detrimental as they wreak havoc on our health. According to a report released by the Institute for Responsible Technology (IRT), they are linked to gluten-related disorders. Numerous experts agree that the recent increase in gluten-related disorders cannot be explained by genetics alone, so they believe that some environmental trigger is […]", "url": "https://www.healthyfoodhouse.com/were-not-gluten-intolerant-were-glyphosate-intolerant/", "site_name": "Healthy Food House", "article:published_time": "2019-05-12T15:50:42+00:00", "article:modified_time": "2019-05-15T00:34:39+00:00", "image": "https://www.healthyfoodhouse.com/wp-content/uploads/2019/05/were-not-gluten-intolerant-were-glyphosate-intolerant.jpeg", "image:width": "540", "image:height": "282", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://techxt.com/?", "https://theheartysoul.com/non-celiac-gluten-sensitivity-glyphosate/", "http://eatlocalgrown.com/article/12462-new-study-links-gmos-to-gluten-disorders-that-affect-18-million-americans.html"], "authors": ["hfhadmin"], "publish_date": "2019-05-12T15:50:42+00:00"}