{"result_id": "154013", "URL": "https://www.healthy-holistic-living.com/exercise-hormone-helps-improve-weight-health/", "timestamp": "2023-04-25 15:30:12 CEST+0200", "meta": {"description": "Research suggests, exercise hormone called irisin (aka FNDC5) , helps your body shed fat and keeps body fat from forming in the first place.", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/exercise-hormone-helps-improve-weight-health/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "How to Activate Your Fat Loss Hormone to Reduce Weight Gain by as Much as 60%", "cleaned_text": "While diet has the greatest impact on your weight, exercise is an important part of the total equation. It’s the ultimate levering agent for optimal health too. Exercise influences your biology in so many ways, it’s virtually impossible to pin down its benefits to one particular thing.\n\nThat said, recent research suggests a fat-burning hormone, released during exercise, plays a role.1,2,3,4 This hormone, irisin (aka, FNDC5), helps your body shed fat and keeps body fat from forming in the first place. As reported by Epoch Times:5\n\nTests show irisin is able to suppress fat cell formation by 20 to 60 percent. Normally, your body produces only small quantities of irisin. Exercise is the key to boosting its production.\n\nFat-Busting Hormone Also Improves Heart Function and More\n\nPrevious research into the effects of irisin — which is also classified as a myokine,6 meaning a cytokine or chemical messenger produced by muscle — suggests it has a number of beneficial health effects, including 7\n• \n• Reducing arterial plaque buildup by preventing the accumulation of inflammatory cells, hence lowering your risk of atherosclerosis\n• Increasing the metabolic rate and energy expenditure in your myocardium (the thickest layer of your heart muscle)\n• Inducing telomere elongation in cells.8 In humans, telomere length and integrity play a role in diseases, disease susceptibility, and aging.\n\nShort telomeres are a risk factor for many diseases, including decreased immune function, diabetes, neurodegenerative diseases, atherosclerotic lesions, and DNA damage\n\nInterestingly, irisin may also be used as a marker for polycystic ovary syndrome (PCOS) in teenage girls.9 As such, it may allow doctors to diagnose the condition easier and result in earlier treatment.\n\nPCOS10 is the most common endocrine and metabolic disease affecting women of reproductive age (puberty to menopause). An estimated 10 to 20 percent of women of reproductive age struggle with this problem.\n\nWhile many of the symptoms involve the ovaries, these abnormalities are the result of a much larger metabolic problem. Common criteria for a diagnosis of PCOS include:\n• The complete or almost complete lack of ovulation\n\nAny hormone problem that interferes with normal ovulation results in what is known as a “polycystic” ovary which, regardless of the cause, will produce increased amounts of androgen. Conversely, increased androgen production interferes with normal ovulation.\n\nEvidence suggests obesity plays a role in the androgen excess syndrome; overweight women produce increased androgens even if they have no underlying abnormality in the adrenal gland.\n\nDr. John Lee, who has written about PCOS on my website, also believes in utero exposure to xenobiotics — environmental pollutants that mimic estrogen — can be a causative factor.\n\nTeens With PCOS Tend to Have Higher Irisin Levels\n\nIn the current study, presented at the Annual European Society for Pediatric Endocrinology Meeting,11 Greek researchers compared the hormone panels of 23 teenage girls diagnosed with PCOS with those of 17 healthy girls of the same age and body mass index (BMI).\n\nThose with PCOS had significantly higher levels of irisin, which in turn was associated with higher levels of testosterone (a marker of PCOS). Next, the researchers will investigate the actual role irisin plays in the condition, with the hopes it might improve and expand treatment options.\n\nOne important treatment strategy is to dramatically reduce your net carbs (total carbohydrates minus fiber), as this is foundational for weight loss and insulin sensitivity. Since insulin resistance is a central issue in PCOS, cutting back on added sugars and grains will help control the disease.\n\nI believe the foundational issue with PCOS has severely diminished insulin receptor sensitivity. If you can restore that with fasting and nutritional ketosis, the problem should resolve.\n\nOptimizing your vitamin D is another important step, and progesterone may be helpful. You can read more about this in Lee’s article on PCOS.12\n\nGetting back to the main focus of this article, irisin appears to be an important player in weight loss associated with exercise. As mentioned, a key part of this benefit is due to its ability to transform white fat cells into brown fat cells, the latter of which primarily burn energy rather than storing it.\n\nBased on animal models, researchers estimate that just 50 grams of brown fat (which is less than what most study volunteers have been found to have) can burn about 20 percent of your daily caloric intake, so the impact of having more brown fat can be rather significant.\n\nResearch has shown that certain groups of people tend to have more brown fat than others, and there are direct correlations between the activation of brown fat and metabolic measures of good health. For example:\n• Slender people have more brown fat than obese people do\n• Younger people have more brown fat than older people\n• People with normal blood sugar levels have more brown fat than those with high blood sugar\n\nBrown Fat Is More Akin to Muscle Than Fat\n\nAs newborns, we have a healthy supply of brown fat to keep warm, but by adulthood, we lose most of our brown fat stores, which are typically found in the neck area, around blood vessels (which helps warm your blood), and “marbled” in with white fat in visceral fat tissue. The good news is you can increase your supply of brown fat. In addition to exercise, brown fat can be activated through cryotherapy,13,14 meaning exposure to cold temperatures such as ice baths or cold showers.\n\nInterestingly, brown fat actually behaves more like muscle than fat, which helps explain its fat-burning capabilities. Bruce Spiegelman, Ph.D., has published a number of studies on brown fat,15 and in one, he identified a “master switch” that promotes the production of brown fat. This molecular switch, known as PRDM16, regulates whether immature cells will turn into brown fat or into muscle cells.\n\nSo white and brown fat cells have very different origins. Brown fat is more closely related to muscle. Another set of researchers from Harvard’s Joslin Diabetes Center found yet another trigger for brown fat — a bone morphogenetic protein called BMP-7, which also promotes bone growth.16,17,18 BMP-7 acts as a growth factor for brown fat.\n\nThe Importance of Brief, High-Intensity Workouts\n\nAs mentioned, irisin is a kind of myokine, or muscle-derived chemical messenger or protein. In 2014, I interviewed Dr. Doug McGuff on this topic. In that interview (included above for your convenience), he explained the significance of myokines and the most effective way to boost their production. Myokines are very anti-inflammatory, and research suggests myokines may play an important role in combating metabolic syndrome and cancer, for example. As noted by McGuff, myokines:\n• Increase the liberation of fat from adipose fat cells\n• Increase the burning of fat, and inhibit body fat irrespective of calorie intake\n• Inhibit the release and effect of inflammatory cytokines produced by body fat\n\nYour diet is one of the major ways in which you can give either the right or wrong tissue the competitive advantage. By eating inflammatory foods, such as sugar/fructose, grains, other high-net-carb foods, trans fats and processed foods in general, your body will generate inflammatory cytokines. And you simply cannot exercise your way out of a bad diet. No amount of exercise will successfully create enough myokines to out-compete the inflammatory cytokines produced by an unhealthy diet.\n\nThat said, in combination with a healthy fat-burning diet, one of the most effective ways to boost myokines is by high-intensity strength training, also known as SuperSlow weight lifting. Regular high-intensity interval training (HIIT) can also be used, but SuperSlow strength training is more effective for boosting myokines. (Both will boost human growth hormone (HGH), which is another potent fitness and anti-aging hormone.)\n\nWhile high-intensity strength training gives you all the benefits of HIIT — including all the cardiovascular benefits — it also induces a rapid and deep level of muscle fatigue. Muscle fatigue triggers the synthesis of more contractile tissue, along with all the metabolic components to support it — including more myokines. To learn more about high-intensity strength training, please see this previous article on SuperSlow weight lifting.\n\nTo Optimize Your Weight, Remember to Address Your Diet and Meal Timing\n\nExercise is clearly a winning strategy if you’re seeking to lose weight or improve your general health. Just remember you cannot out-exercise your mouth. The real master key to shedding fat is your diet. WHEN you eat is another potent factor. If you’re struggling with weight issues and/or insulin and leptin resistance, I strongly encourage you to try intermittent fasting, the benefits of which are summarized in the video above. I also discuss this in the short lecture below.\n\nAs for WHAT to eat, the two dietary keys for shedding fat include reducing your net carbs and increasing healthy fats in your diet, as this will move your metabolism in the right direction, allowing your body to access and burn body fat for fuel. You can get all the details you need to improve your diet and health in my recently updated nutritional plan.\n\nAccurately gauging the carb, protein and fat ratios of your meals can be a challenge, so to get it right, it would be wise to use a nutritional tracker. My favorite is cronometer.com/Mercola, which is precalibrated for nutritional ketosis. You can learn more about this amazing, free tool here.\n\nThis article is shared with permission from our friends at Dr. Mercola.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Activate Your Fat Loss Hormone to Reduce Weight Gain by as Much as 60%", "description": "Research suggests, exercise hormone called irisin (aka FNDC5) , helps your body shed fat and keeps body fat from forming in the first place.", "url": "https://www.healthy-holistic-living.com/exercise-hormone-helps-improve-weight-health/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "https://www.mercola.com/", "article:published_time": "2017-12-22T17:04:40+00:00", "article:modified_time": "2019-03-31T03:08:03+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2017/12/before-after.jpg", "image:width": "800", "image:height": "419", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1068", "height": "601", "embed_code": "<iframe title=\"Dr. Mercola and Dr. McGuff on High-Intensity Strength Training\" width=\"1068\" height=\"601\" src=\"https://www.youtube.com/embed/QjGL8Rwkqug?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/QjGL8Rwkqug?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1068", "height": "601", "embed_code": "<iframe loading=\"lazy\" title=\"Burn Fat FAST With Intermittent Fasting\" width=\"1068\" height=\"601\" src=\"https://www.youtube.com/embed/PtROQjUkk9g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/PtROQjUkk9g?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "1068", "height": "601", "embed_code": "<iframe loading=\"lazy\" title=\"Get Your Body to Burn Fat for Fuel - with Dr. Joseph Mercola\" width=\"1068\" height=\"601\" src=\"https://www.youtube.com/embed/ooVdsutv7K4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ooVdsutv7K4?feature=oembed"}], "links": ["https://www.healthy-holistic-living.com/ultimate-guide-healthy-holistic-living/", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn1", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn2", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn3", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn4", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn5", "https://www.healthy-holistic-living.com/over-50-you-need-to-be-doing-these-5-exercises-at-least-once-a-week/", "https://articles.mercola.com/sites/articles/archive/2014/08/10/high-intensity-strength-training.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn6", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn7", "https://articles.mercola.com/sites/articles/archive/2016/01/24/how-mitochondria-influences-health.aspx", "https://articles.mercola.com/sites/articles/archive/2011/04/18/is-this-the-key-to-living-longer-than-150-years-old.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn8", "http://www.mercola.com/diabetes.aspx", "https://www.healthy-holistic-living.com/estrogen-imbalance/", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn9", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn10", "https://www.healthy-holistic-living.com/adrenal-stress/", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn11", "https://fitness.mercola.com/sites/fitness/archive/2012/07/27/increase-testosterone-levels.aspx", "https://articles.mercola.com/sites/articles/archive/2014/05/28/vitamin-d-deficiency-signs-symptoms.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn12", "https://www.healthy-holistic-living.com/diets-for-brain-health/", "https://articles.mercola.com/sites/articles/archive/2016/05/01/health-benefits-extreme-hot-cold-temperatures.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn13", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn14", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn15", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn16", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn17", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl#_edn18", "https://www.healthy-holistic-living.com/insulin-sensitivity/", "https://fitness.mercola.com/sites/fitness/archive/2013/02/01/whey-protein-improves-hgh.aspx", "https://fitness.mercola.com/sites/fitness/archive/2012/06/01/long-cardio-workout-dangers.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/05/27/super-slow-weight-training.aspx", "https://fitness.mercola.com/sites/fitness/archive/2013/06/28/intermittent-fasting-health-benefits.aspx", "https://articles.mercola.com/sites/articles/archive/2016/01/31/high-fat-low-carb-diet-benefits.aspx", "http://www.mercola.com/nutritionplan/index.htm", "https://cronometer.com/mercola/", "https://articles.mercola.com/sites/articles/archive/2016/08/02/cronometer-nutrient-tracker.aspx", "https://fitness.mercola.com/sites/fitness/archive/2016/10/21/irisin-exercise-hormone.aspx?utm_source=facebook.com&utm_medium=referral&utm_content=facebook-os-hhl"], "authors": ["Dr. Mercola"], "publish_date": "2017-12-22T17:04:40+00:00"}