{"result_id": "154003", "URL": "https://www.healthy-holistic-living.com/how-to-prevent-the-coronavirus-covid-19/", "timestamp": "2023-04-25 15:29:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/how-to-prevent-the-coronavirus-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "How to Prevent the Coronavirus (COVID-19)", "cleaned_text": "As cases of coronavirus continue climbing, scientists have been scrambling to control the virus and find new ways to fight infection. But although it has become a global problem, there are plenty of steps you can take to help prevent coronavirus, right at home.\n\nIn addition to practicing cough etiquette, washing your hands frequently and keeping your distance from others who are sick to prevent the spread of germs, there are several natural remedies that may be useful as well.\n\nThis article will take a closer look at all things coronavirus, including what it is, how to prevent it and what scientists are working on to help contain and combat it.\n\nWhat Is the Coronavirus?\n\nCoronviruses (CoV) are a large family of viruses found in a variety of mammals and birds. In humans, these viruses can cause a number of conditions, ranging from mild respiratory infections to more serious illnesses like severe acute respiratory syndrome (SARS) or Middle East respiratory syndrome (MERS). Coronavirus disease 2019 (COVID-19) is a new strain of coronavirus that was recently identified in humans.\n\nCoronaviruses are zoonotic, which means that they can be transmitted from animals to humans. SARS, for example, is believed to have originated from civet cats while MERS was first transmitted to humans from dromedary camels. Like other respiratory infections, coronaviruses can also be spread from person-to-person through contact with bodily fluids such as saliva, blood or urine. As of now, scientists have still not traced where exactly COVID-19 originated.\n\nCurrently, it’s also unclear exactly how contagious COVID-19 is. However, until a vaccine or treatment is released for the virus, taking a few basic protective measures against coronavirus can help keep you and those around you safe.\n\nNow that we’ve covered what exactly coronavirus is, let’s take a closer look by the numbers.\n• As of February 27, 2020, there were 82,294 confirmed cases of COVID-19, 95 percent of which were in China.\n• The global death toll for the virus is 2,804.\n• There have been cases confirmed in 46 different countries. Apart from China, the top countries affected include Korea, Italy, Japan and Iran.\n• Symptoms can emerge between 2–14 days after infection.\n• Without containment measures such as quarantine, it’s estimated that an infected person could spread the virus to 1.5-3.5 people.\n• Although the virus can infect anyone, the mortality rate increases with age. Those who are in their 50s, for example, are three times as likely to die from coronavirus as those in their 40s. Meanwhile, older adults over 80 have a mortality rate of nearly 15 percent.\n• The World Health Organization has appointed 15 COVID-19 referral laboratories around the globe, including in countries like Australia, Senegal, France, Russia, India and the U.S., among others.\n\nHealthcare providers may diagnose coronavirus by conducting a physical exam, taking your medical history and performing lab tests, including bloodwork, sputum tests or throat swabs. Those who have recently traveled to China or have been in close contact with someone who is infected are at a higher risk.\n\nThe symptoms of coronavirus are similar to other respiratory infections, including the common cold. Some of the most common symptoms include:\n\nIn severe cases, coronavirus may also cause more serious issues, including pneumonia, kidney failure, severe acute respiratory syndrome or even death.\n\nTaking a few basic protective measures against infection is a simple strategy that can help prevent the spread of the coronavirus. Here are a few steps that you can take to protect yourself and others.\n\nWash your hands regularly using either soap and water or an alcohol-based rub, which can help kill off any viruses and prevent the spread of germs. Be sure to wash hands for at least 20 seconds before eating and after coughing, sneezing, blowing your nose or using the bathroom.\n\nIdeally, try to maintain at least three feet of distance from anyone who is coughing or sneezing. This can help prevent you from breathing in any liquid droplets containing the virus, which can be sprayed through the nose or mouth through coughing and sneezing.\n\nViruses can live on surfaces for up to 48 hours. Washing and disinfectingsurfaces that you regularly use can help block the spread of germs to prevent infection.\n\nYour hands can pick up viruses from the surfaces that you touch. Touching your face with unwashed hands can transfer these germs, which can then enter the body and cause infection.\n\nCoughing or sneezing into your elbow or using a tissue to cover your mouth can help prevent the spread of germs and viruses. Be sure to also dispose of used tissues immediately and wash your hands thoroughly after exposure to any respiratory secretions.\n\nAlthough health authorities do not recommend using a face mask unless you’re actually sick or in direct contact with those who are infected, you may want to stock up on other household supplies and anything else you regularly use for your health.\n\nIdeally, you should have a 30-day supply of essentials, including laundry detergent, soap, diapers and pantry staples.\n\n7. Stay Up-to-Date to Make Sure the Virus Is Not in Your Region\n\nFind and bookmark the website of your local health department, which can help you stay up-to-date with the latest news and ensure that you know who to contact in case of infection.\n\nIf you’re not feeling well, it’s best to stay home to avoid infecting others. If you experience more serious side effects like cough, fever or shortness of breath, contact your own health provider or local health authority to determine the next steps.\n\nIn addition to practicing the strategies above, incorporating a few immune-boosting natural remedies into your routine may also be beneficial. Keep in mind that these remedies should not be used to replace hand washing or respiratory hygiene and you should seek immediate medical care if you experience any symptoms.\n\nVitamin C plays a central role in immune function and could be a useful tool to help bump up your body’s defenses against coronavirus. Although the effects of vitamin C on COVID-19 have not been studied directly, a 2006 trial in Annals of Nutrition & Metabolism found that getting enough vitamin C in your diet could help decrease symptoms and shorten the duration of respiratory infections.\n\nDaily needs for vitamin C for prevention is 300 milligrams daily and to fight an infection, 1,000–3,000 milligrams daily. The best dietary sources of vitamin C are fruits and veggies, including citrus fruits, tomatoes, peppers and berries.\n\nVitamin D3 is also beneficial for its ability to enhance immunity and protect against infection. A deficiency in this important micronutrient can actually increase the risk of infection, and vitamin D3 is also integral to the function of immune cells in the body. Dosage recommendations vary from 400 to 800 IU per day to up to 5,000 IU.\n\nSome research shows that certain compounds isolated from red algae, also known as Griffithsia, could be help protect against viral infections. Accordingto one 2016 in vitro study, griffithsin, a lectin isolated from red algae, was able to prevent infection with MERS by blocking viruses from entering host cells.\n\nWhat’s more, other studies have found that it could also be beneficial against other viral infections, including HIV. However, more research is needed to determine whether red algae could be used to protect against COVID-19.\n\nGlycyrrhizin, an active compound found in licorice root, may possess powerful virus-fighting properties. An in vitro study in Lancet examined the anti-viral properties of several compounds and found that glycyrrhizin was the most effective at blocking the replication of SARS.\n\nAnother in vitro study had similar findings, noting that glycyrrhizin also exhibited cytotoxicity against the SARS virus. Still, additional studies should be conducted to evaluate the effects of licorice on COVID-19.\n\nAlthough the impact of elderberry syrup against coronavirus has not yet been studied, it has been shown to help improve symptoms of the flu in some clinical trials. For example, one study out of Israel found that taking elderberry syrup four times daily for five days significantly shortened the duration of the flu compared to a placebo.\n\nAnother analysis in 2019 concluded that elderberry could also help treat upper respiratory symptoms. While more research is necessary on COVID-19 specifically, these studies suggest that it could potentially help alleviate symptoms.\n\n5. Immune-boosting foods and herbs that support the lungs\n\nDr. Josh Axe also recommends top immune-boosting foods that support the lungs, according to 3,000 years of Chinese medicine studies. This includes foods that are light yellow or white in color, including:\n\nSimilarly, he recommends that you consume a diet rich in vegetables, vitamin C–rich fruits, manuka honey, herbs, spices, and wild organic meat like poultry and bone broth. An ideal meal for boosting immunity, for example, is homemade chicken soup (add ginger and garlic to recipe).\n\nNative to New Zealand, manuka honey is a type of honey that has been extensively studied for its powerful healing properties. Studies show that it could have anti-viral properties, which may make it a useful natural remedy against infections like coronavirus.\n\nIn fact, one in vitro study found reported that manuka honey was able to inhibit the replication of the influenza virus. Further research is necessary to assess whether or not it offers similar benefits against coronavirus.\n\nIn addition, studies indicate that the herb echinacea is both antiviral and antimicrobial. One study showed it to be a potent antiviral for respiratory virus infections.\n\nA study measured the antiviral efficacy of oregano oil and its primary active component, carvacrol, against the nonenveloped murine norovirus (MNV), a human norovirus surrogate. It demonstrated the potential of oregano oil as a natural food and surface sanitizer to control the human norovirus.\n\nA separate study indicated the antiviral potential of oregano oil against a human respiratory syncytial virus (HRSV) and warranted further study.\n\nAccording to the Centers for Disease Control and Prevention, there is currently no specific treatment for COVID-19. Those who are infected should receive medical care to help alleviate symptoms, which may also include care to support vital organ functions in more severe cases.\n\nThere are no approved treatments for coronaviruses and very few effective antiviral medications in general. Additionally, developing new drugs can require a massive investment in terms of time, money and resources, which can make it challenging to find medical treatments against COVID-19.\n\nIn the mean time, researchers have been experimenting with using existing drugs to treat new infections like coronavirus. According to a recent case report published in The New England Journal of Medicine, physicians at Providence Regional Medical Center in Washington received permission from the FDA to treat a case of coronavirus using an investigational antiviral therapy originally designed to treat Ebola. After eight days of hospitalization, the patient’s clinical condition began to improve and symptoms like cough and fever had decreased in severity.\n\nAlthough research in humans is lacking, in vitro studies have found that this novel therapy could potentially decrease the growth of coronavirus to help control infections. Other antiviral medications are also being investigated, including lopinavir/ritonavir, which is a medication used to treat HIV.\n\nIn addition to developing antiviral medications to treat coronavirus, other organizations have begun looking for solutions to help contain and prevent outbreaks. The National Institute of Allergy and Infectious Diseases, for example, has begun conducting clinical testing on antibody-based therapies to help prevent the virus from entering and infecting cells in the first place. Regeneron Pharmaceuticals has also partnered with the U.S. Department of Health and Human Services to develop antibody treatments against coronavirus.\n• Coronaviruses are a large family of viruses that can cause a range of different symptoms.\n• Coronavirus disease 2019 (COVID-19) is a new strain of virus that was recently identified in humans and can cause symptoms such as fever, cough and shortness of breath.\n• Some natural remedies could potentially help increase immune function to decrease symptoms, including vitamin C and D, red algae, licorice, elderberry syrup and manuka honey.\n• Until new treatments and therapies are developed, however, it’s important to wash your hands frequently, maintain distance from others who are sick, disinfect surfaces, practice respiratory hygiene and seek medical care immediately if you are sick.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Prevent the Coronavirus (COVID-19)", "description": "As cases of coronavirus continue climbing, scientists have been scrambling to control the virus and find new ways to fight infection. But although it has become a global problem, there are plenty of steps you can take to help prevent coronavirus, right at home. In addition to practicing cough etiquette, washing your hands frequently and … How to Prevent the Coronavirus (COVID-19) Read More »", "url": "https://www.healthy-holistic-living.com/how-to-prevent-the-coronavirus-covid-19/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "https://www.facebook.com/DrJoshAxe", "article:published_time": "2020-03-05T15:17:28+00:00", "article:modified_time": "2020-03-24T20:42:34+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2020/03/Corona_800x365-scaled-1.jpg", "image:width": "2560", "image:height": "1168", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://draxe.com/health/flu-natural-remedies/", "https://www.who.int/health-topics/coronavirus", "https://www.who.int/docs/default-source/coronaviruse/situation-reports/20200227-sitrep-38-covid-19.pdf?sfvrsn=9f98940c_2", "https://www.nytimes.com/2020/02/25/health/prepare-for-coronavirus.html?", "http://weekly.chinacdc.cn/en/article/id/e53946e2-c6c4-41e9-9a9b-fea8db1a8f51", "https://www.cdc.gov/coronavirus/2019-ncov/faq.html", "https://draxe.com/health/home-remedies-cough/", "https://draxe.com/health/sore-throat-remedies-fast-relief/", "https://draxe.com/health/natural-cleaning-products/", "https://draxe.com/health/how-to-get-rid-of-a-fever/", "https://www.ncbi.nlm.nih.gov/pubmed/16373990", "https://draxe.com/nutrition/vitamin-c-foods/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3166406/", "https://draxe.com/nutrition/algae-benefits/", "https://www.ncbi.nlm.nih.gov/pubmed/27424494", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6835697/", "https://draxe.com/nutrition/licorice-root/", "https://www.ncbi.nlm.nih.gov/pubmed/12814717", "https://www.ncbi.nlm.nih.gov/pubmed/15715493", "https://draxe.com/nutrition/elderberry/", "https://www.ncbi.nlm.nih.gov/pubmed/15080016", "https://www.ncbi.nlm.nih.gov/pubmed/30670267", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4417560/", "https://draxe.com/nutrition/manuka-honey-benefits-uses/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4837971/", "https://www.ncbi.nlm.nih.gov/pubmed/24880005/", "https://pubmed.ncbi.nlm.nih.gov/22131823", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4058675/", "https://www.ncbi.nlm.nih.gov/pubmed/24779581", "https://www.ncbi.nlm.nih.gov/pubmed/24031796", "https://www.cdc.gov/coronavirus/2019-ncov/about/prevention-treatment.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Fcoronavirus%2Fabout%2Fprevention.html", "https://www.ncbi.nlm.nih.gov/pubmed/32004427", "https://www.ncbi.nlm.nih.gov/pubmed/32020029", "https://www.ncbi.nlm.nih.gov/pubmed/32056407", "https://www.niaid.nih.gov/diseases-conditions/coronaviruses-therapeutics-vaccines", "https://newsroom.regeneron.com/news-releases/news-release-details/regeneron-announces-expanded-collaboration-hhs-develop-antibody"], "authors": ["Dr. Josh Axe"], "publish_date": "2020-03-05T15:17:28+00:00"}