{"result_id": "154020", "URL": "https://www.healthy-holistic-living.com/top-12-best-foods-antioxidants-sick-cold-flu/", "timestamp": "2023-04-25 15:30:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/top-12-best-foods-antioxidants-sick-cold-flu/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "The Top 12 Best Foods and Antioxidants While You Are Sick With A Cold or Flu", "cleaned_text": "When you have a sore throat or if you’re congested, you might not want to eat. You feel worn down and swallowing can be very painful. Here are 12 of the most amazing foods and antioxidants that will help alleviate symptoms and even shorten the duration of any cold or flu.\n\n1) Chili Peppers\n\n Scientists have reported that chili peppers are a heart-healthy food with potential to protect against the No. 1 cause of death in the developed world. Chili peppers are a natural remedy for a sore throat that can often precede a cold or flu. Yes, that feeling of having crushed glass floating around in your throat can often be remedied without conventional over-the-counter analgesics. A mixture of hot red chili powder – often called Cayenne pepper – and orange juice is a very effective remedy for sore throats and congestion in general.\n\n2) Honey\n\n “The unique property of honey lies in its ability to fight infection on multiple levels, making it more difficult for bacteria to develop resistance,” said study leader Susan M. Meschwitz, Ph.D. That is, it uses a combination of weapons, including hydrogen peroxide, acidity, osmotic effect, high sugar concentration and polyphenols — all of which actively kill bacterial cells, she explained. The osmotic effect, which is the result of the high sugar concentration in honey, draws water from the bacterial cells, dehydrating and killing them. Honey is one of the most incredible non-perishable foods that can kill almost every type of bacteria.\n\n3) Turmeric\n\n Turmeric is fast becoming a popular remedy for just about everything that ails you. It appears to outperform many pharmaceuticals in its effects against several chronic, debilitating diseases, and does so with virtually no adverse side effects. The combination of honey with turmeric powder is an excellent remedy for a hacking cough. Research found that a substance in turmeric, curcumin, may outperform the pneumococcal vaccine in providing long lasting protection against potentially deadly lung damage in infants. Turmeric has strong anti-inflammatory and anti-oxidant properties and turmeric tea has been used for extensively worldwide for colds, congestion, headache, and sore throats.\n\n4) Ginger\n\n Along side turmeric, ginger is one of the world’s most potent disease-fighting spices. The use of ginger is numero uno when it comes to curing common cold, cough and relieving respiratory symptoms. With its high levels of Vitamin C, magnesium and other minerals, ginger root is extremely beneficial for health. Once made into tea, you can add peppermint, honey or lemon to make this beverage into an incredible tea with immunity boosters known to reduce inflammation and prevent many illnesses.\n\n5) Apple Cider Vinegar\n\n Apple cider vinegar is purported to treat numerous diseases, health conditions, and annoyances. It eases digestion, prevents flu, reduces inflammation, kills fungus, regulate pH balance, and washes toxins from the body. Some alternative practitioners recommend using apple cider vinegar to restore alkaline acid balance. Here are 8 more reasons this powerful health tonic makes your kitchen your best pharmacy.\n\n6) Lemon\n\n Lemon juice decreases the strength of the cold and flu virus in the body and reduces phlegm. They are both anti-bacterial and anti-viral. Add lemon juice to your tea or make hot or cold lemonade with honey to build resistance to cold and flu, and speed up healing if you do succumb. Lemons are loaded with vitamin C, which is known to support the body’s natural defenses. Lemon water can fight throat infections thanks to its antibacterial property. Here’s a simple recipe using lemons and garlic during the cold and flu season that will supercharge your immune system.\n\n7) Cinnamon\n\n Cinnamon may merit a place in your medicine cabinet as well as in your spice rack. Cinnamon is one of the most potent antioxidants in the world and is most certainly a superfood. Did you know that a teaspoon of raw honey and a 1/4 teaspoon of cinnamon will usually knock out a cold within a day or two? If you are to maximize the medicinal value of cinnamon,make sure you are not purchasing cassia. It must also be non-irradiated which will be labeled as such.\n\n8) Garlic\n\n Garlic is probably nature’s most potent food. It is one of the reasons people who eat the Mediterranean diet live such long healthy lives. A significant finding from Washington State University showed that garlic is 100 times more effective than two popular antibiotics. A soup based on more than 50 cloves of garlic, onions, thyme and lemon will destroy almost any virus that enters its path including colds, flu and even norovirus. Although a few garlic powder supplements are able to generate some allicin within the stomach, the amount converted, if any is converted at all, is dependant upon optimal stomach conditions. If you are to supplement with garlic, try AlliMAX which is the only nutraceutical containing a proprietary process through which the naturally occurring allicin in garlic is extracted,stabilized and concentrated.\n\n9) Elderberry\n\n Compounds in elderberry bind viruses before they can penetrate the walls of cells, thereby inhibiting their ability to spread. Since elderberry is nontoxic when cooked, it is safe for children. The hot tea from the flowers and juice from the berries promotes sweating preferable adding on lemon juice and honey which is soothing for upper respiratory infections. The tea is also considered to be anti-rheumatic, laxative and detoxifying. A liquid extract from black elderberry may inhibit the growth of pathogenic bacteria by 99 percent at highest concentrations, a feat no anti-bacterial drugs can match.\n\n10) Zinc\n\n Zinc supplements reduce the severity and duration of illness caused by the common cold. The idea that zinc might be effective against the common cold came from a study carried out in 1984, which showed that zinc lozenges could reduce how long symptoms lasted. A Cochrane Systematic Review, carried out in 1999, studies data from data from 15 trials. According to the results, zinc syrup, lozenges or tablets taken within a day of the onset of cold symptoms reduce the severity and length of illness. At seven days, more of the patients who took zinc had cleared their symptoms compared to those who took placebos.\n\n11) Vitamin D3\n\n The risk of children suffering from flu can be reduced by 50% if they take vitamin D. The finding has implications for flu epidemics since vitamin D, which is naturally produced by the human body when exposed to direct sunlight, has no significant side effects, costs little and can be several times more effective than anti-viral drugs or vaccines according to research in the American Journal of Clinical Nutrition. Researchers have recently pinpointed the mechanism behind vitamin D3’s ability to enhance the immune system and why it is so critical to our health.\n\n12) Vitamin C\n\n Vitamin C is remarkably safe even in enormously high doses. Compared to commonly used prescription drugs, side effects are virtually nonexistent. Evidence documents Vitamin C as one of the best antiviral agents now available. Vitamin C can neutralize and eliminate a wide range of toxins. Vitamin C will enhance host resistance, greatly augmenting the immune system’s ability to neutralize bacterial and fungal infections. Some scientists have stated that are no RNA viruses currently in existence which Vitamin C cannot destroy, even ebola. Intravenous (IV) vitamin C is a very powerful healing tool that can prevent dozens of diseases.\n\nTake 3 tablespoons 4 times per day or until finished.\n\nLastly, a worthy mention is the use of homemade saline nasal washes, and gargles which has long been used effectively to soothe sore throats, and keep respiratory passages moist, decongested and free of invading pathogens.\n\nKaren Foster is a holistic nutritionist, avid blogger, with five kids and an active lifestyle that keeps her in pursuit of the healthiest path towards a life of balance.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Top 12 Best Foods and Antioxidants While You Are Sick With A Cold or Flu", "description": "When you have a sore throat or if you’re congested, you might not want to eat. You feel worn down and swallowing can be very painful. Here are 12 of the most amazing foods and antioxidants that will help alleviate symptoms and even shorten the duration of any cold or flu. 1) Chili Peppers Scientists … The Top 12 Best Foods and Antioxidants While You Are Sick With A Cold or Flu Read More »", "url": "https://www.healthy-holistic-living.com/top-12-best-foods-antioxidants-sick-cold-flu/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "https://www.facebook.com/PreventDisease/info", "article:published_time": "2015-01-01T11:24:35+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2015/02/cold-and-flu-prevention-strategies-1.gif", "image:width": "800", "image:height": "419", "image:type": "image/gif"}, "tags": [], "tweets": [], "movies": [], "links": ["http://preventdisease.com/news/14/052714_Hot-Peppers-Prevent-Number-One-Cause-of-Death.shtml", "http://preventdisease.com/news/12/021312_Home-Remedy-For-Sore-Throats-Experiencing-Colds-Is-Actually-Beneficial-To-Your-Health.shtml", "http://preventdisease.com/news/12/071112_Honey-Improves-Immunity-and-Relieves-Anxiety.shtml", "http://preventdisease.com/news/14/031814_Honey-Perfect-Antibiotic-Solving-Problem-of-Antibiotic-Resistance.shtml", "http://preventdisease.com/news/12/032112_Curcumin-Outperforms-Pharmaceuticals-To-Prevent-Many-Diseases-Without-Side-Effects.shtml", "http://preventdisease.com/news/13/070313_Curcumin-Outperforms-Pneumococcal-Vaccines-In-Protecting-Infants.shtml", "http://preventdisease.com/news/13/040813_Ginger-Beats-Drugs-In-Defeating-Cancer-Motion-Sickness-and-Inflammation.shtml", "http://preventdisease.com/fundament/articles/acid_alkaline.shtml", "http://preventdisease.com/news/14/082914_8-Reasons-Apple-Cider-Vinegar-The-Most-Powerful-Health-Tonics-In-Kitchen.shtml", "http://preventdisease.com/news/13/012113_Raw-Honey-Garlic-Lemon-Shots-Supercharge-Your-Immune-System.shtml", "http://preventdisease.com/news/14/033014_Make-Sure-The-Cinnamon-You-Are-Purchasing-Is-Not-Irradiated-and-Not-Cassia.shtml", "http://preventdisease.com/news/12/050212_Garlic-Proven-100-Time-More-Effective-Than-Antibiotics.shtml", "http://preventdisease.com/news/13/012013_Garlic-Soup-With-52-Cloves-of-Garlic-Can-Defeat-Colds-Flu-and-Even-Norovirus.shtml", "http://preventdisease.com/hpp/zen-cart/index.php?main_page=product_info&cPath=71&products_id=291", "http://preventdisease.com/news/14/060414_Elderberry-Extract-Outperforms-Medication-By-Inhibiting-Growth-Pathogenic-Bacteria-99-Percent.shtml", "http://preventdisease.com/home/weeklywellness98.shtml", "http://ajcn.nutrition.org/content/91/5/1255.full", "http://preventdisease.com/news/13/021313_Researchers-Identify-How-Omega-3-and-Vitamin-D-Enhance-The-Immune-System.shtml", "http://preventdisease.com/news/12/041912_IV-Vitamin-C-A-Powerful-Healing-Tool-The-FDA-Wants-Banned.shtml", "http://preventdisease.com/", "http://preventdisease.com/news/14/122314_Top-12-Best-Foods-Antioxidants-While-You-Are-Sick-With-Cold-Flu.shtml"], "authors": ["Prevent Disease"], "publish_date": "2015-01-01T11:24:35+00:00"}