{"result_id": "154006", "URL": "https://www.healthy-holistic-living.com/this-is-the-homemade-cannabis-oil-recipe-that-people-are-using-to-treat-cancer/", "timestamp": "2023-04-25 15:30:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/this-is-the-homemade-cannabis-oil-recipe-that-people-are-using-to-treat-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Homemade Cannabis Oil, To Help Fight Cancer", "cleaned_text": "Marijuana contains cannabinoids, which can have a myriad of positive effects on our health when consumed. The cannabinoids, molecules within the plant, enter the human body on consumption and bind with receptors that are already in place.\n\nThese cannabinoids have been found to help stop symptoms linked to cancer and chemotherapy, nausea, vomiting, anxiety, and they can even increase appetite\n\nSome of the symptoms consist of:\n\nThis means many countries are taking advantage of cannabinoids and their therapeutic qualities, prescribing it to patients. Although cannabinoids have many positive effects on cancer and chemotherapy symptoms, it does not rule out the side effects associated with taking it, after all, it is illegal in most US states (5) and Canada (but maybe for not much longer)(6).\n\nHere are some of the negative side effects associated with cannabis, making it clear why countries and states are weary to legalizing the drug or prescribing it to patients as cancer medication:\n• Increased risk of developing a psychotic illness such as schizophrenia (7)\n• Can cause lung cancer or asthma if smoked\n• Can cause problems during pregnancy\n\nIf prescribed by a doctor and thought through well then cannabis could be an amazing medication, that is revolutionizing the way the world perceives the plant.\n\nJust take into account that smoking marijuana may not be the best choice due to its effects on the lungs, instead try making cannabis oil that is equally as potent as effective. Condensed recipe found below support Rick on his website.\n\nStart with one ounce of dried herb. One ounce will typically produce 3-4 grams of oil, although the amount of oil produced per ounce will vary strain to strain. A pound of dried material will yield about two ounces of high-quality oil.\n\nIMPORTANT: These instructions are directly summarized from Rick Simpson’s website. Be VERY careful when boiling solvent off, the fumes are extremely flammable. AVOID smoking, sparks, stove-tops, and red-hot heating elements. Set up a fan to blow fumes away from the pot, and set up in a well-ventilated area for the whole process.\n\n2. Dampen the material with the solvent you are using. Many solvents can be used [solvent-free option]. You can use pure naphtha, ether, butane, 99% isopropyl alcohol, or even water. Two gallons of solvent is required to extract the THC from one pound, and 500 ml is enough for an ounce.\n\n3. Crush the plant material using a stick of clean, untreated wood or any other similar device. Although the material will be damp, it will still be relatively easy to crush up because it is so dry.\n\n4. Continue to crush the material with the stick, while adding solvent until the plant material is completely covered and soaked. Remain stirring the mixture for about three minutes. As you do this, the THC is dissolved off the material into the solvent.\n\n5. Pour the solvent-oil mixture of the plant material into another bucket. At this point, you have stripped the material of about 80% of its THC.\n\n6. Second wash: again add solvent to the mixture and work for another three minutes to extract the remaining THC.\n\n7. Pour this solvent-oil mix into the bucket containing the first mix that was previously poured out.\n\n9. Pour the solvent-oil mixture through a coffee filter into a clean container.\n\n10. Boil the solvent off: a rice cooker will boil the solvent off nicely and will hold over a half gallon of solvent mixture. CAUTION: avoid stove-tops, red-hot elements, sparks, cigarettes and open flames as the fumes are extremely flammable.\n\n11. Add solvent to rice cooker until it is about ¾ full and turn on HIGH heat. Make sure you are in a well-ventilated area and set up a fan to carry the solvent fumes away. Continue to add mixture to cooker as the solvent evaporates until you have added it all to the cooker.\n\n12. As the level in the rice cooker decreases for the last time, add a few drops of water (about 10 drops of water for a pound of dry material). This will help to release the solvent residue and protect the oil from too much heat.\n\n13. When there is about one inch of solvent-water mixture in the rice cooker, put on your oven mitts and pick the unit up and swirl the contents until the solvent has finished boiling off.\n\n14. When the solvent has been boiled off, turn the cooker to LOW heat. At no point should the oil ever reach over 290 degrees F or 140 degrees C.\n\n15. Keep your oven mitts on and remove the pot containing the oil from the rice cooker. Gently pour the oil into a stainless steel container\n\n16. Place the stainless steel container in a dehydrator, or put it on a gentle heating device such as a coffee warmer. It may take a few hours, but the water and volatile terpenes will be evaporated from the oil. When there is no longer any surface activity on the oil, it is ready for use.\n\n17. Suck the oil up in a plastic syringe, or in any other container, you see fit. A syringe will make the oil easy to dispense. When the oil cools completely, it will have the consistency of thick grease.\n\nFor dosage information, you can check out more on Rick’s website. If you have been prescribed cannabis as a way to combat cancer or the side effects of chemotherapy then this recipe may be perfect! Just consult your doctor before going forward with it and make sure you abide by the state or country’s laws that you live in.\n\nPlease consult a physician before beginning any treatment program or making any adjustment to your health care, diet, and/or lifestyle.\n\nDo not remove yourself from any prescribed medications or treatments without consulting your doctor. Any and all dietary supplements or nutritional products and treatments discussed on this site are not intended to diagnose, treat, prevent, or cure any disease. The information contained in this site is for general information and for educational purposes only.\n\nNothing contained in this site is or shall be or considered, or used as a substitute for, medical advice, diagnosis, or treatment. Users should always seek the advice of a physician with any questions regarding their health or medical condition. Never disregard, avoid, or delay obtaining medical advice or following the advice of a physician because of something you have seen or read on this site.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homemade Cannabis Oil, To Help Fight Cancer - Healthy Holistic Living", "description": "Cannabis Oil and Cancer Marijuana contains cannabinoids, which can have a myriad of positive effects on our health when consumed. The cannabinoids, molecules within the plant, enter the human body on consumption and bind with receptors that are already in place. These cannabinoids have been found to help stop symptoms linked to cancer and chemotherapy, nausea, … This Is The Homemade Cannabis Oil Recipe That People Are Using To Help Fight Cancer Read More »", "url": "https://www.healthy-holistic-living.com/this-is-the-homemade-cannabis-oil-recipe-that-people-are-using-to-treat-cancer/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "https://www.facebook.com/healthyholisticliving", "article:published_time": "2015-12-04T13:50:30+00:00", "article:modified_time": "2019-03-20T15:25:53+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2015/12/1449138492.jpg", "image:width": "800", "image:height": "452", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["//www.healthy-holistic-living.com/natural-vomit-remedies.html", "//www.healthy-holistic-living.com/how-to-detox-after-chemotherapy.html", "//www.healthy-holistic-living.com/how-to-increase-fertility.html", "http://phoenixtears.ca/", "http://www.collective-evolution.com/2014/06/29/a-recipe-to-make-cannabis-oil-for-a-chemotherapy-alternative/", "http://phoenixtears.ca/dosage-information/", "https://www.minds.com/blog/view/519097515367215104", "https://www.healthy-holistic-living.com/ultimate-guide-healthy-holistic-living/"], "authors": ["Michelle Toole"], "publish_date": "2015-12-04T13:50:30+00:00"}