{"result_id": "154017", "URL": "https://www.healthy-holistic-living.com/scientists-discover-the-root-of-autoimmune-diseases-and-how-we-can-treat-them/", "timestamp": "2023-04-25 15:30:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/scientists-discover-the-root-of-autoimmune-diseases-and-how-we-can-treat-them/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Scientists Discover The Root Of Autoimmune Diseases- And How We Can Treat Them", "cleaned_text": "Autoimmune disease occurs when the immune system is unable to tell the difference between its own cells and foreign cells. When this happens, the body makes autoantibodies that attack normal cells by mistake. (1) These diseases have been on the rise throughout western countries for the last few decades. (2) Scientists have been studying the causes of autoimmune disease, and have learned that some of those causes are genes and environmental factors. But scientists have also discovered that gut bacteria triggers autoimmune disease in predisposed individuals.\n\nThe microbiome has gained a lot of attention in the last few years, and for good reason. We’ve learned it is important for overall wellness and a healthy immune system, which makes it important for the fight against autoimmune disease. Humans are mostly microbes, and the majority of those live in the gut. Those microbes make up the microbiome, which is the genetic material of all microbes (bacteria, fungi, protozoa, and viruses) that live on and inside the body. The bacteria in the microbiome digest our food, help protect against other bacteria that cause disease, produce vitamins, and regulate our immune system. (3)\n\nAutoimmune diseases are associated with microbiome dysfunction. Disease-causing microbes accumulate, change the gene activity and other processes, and this causes an abnormal immune response against normal tissues and cells. Autoimmune diseases occur through inheriting the family’s microbiome, not through DNA. (4)\n\nA 2018 study from Yale University found that bacteria in the microbiome in both humans and mice can travel to other organs and trigger autoimmune disease. This process occurs in people who are already predisposed to autoimmunity. So the study focused on a specific bacteria called Enterococcus gallinarum that is able to move outside the gut to the liver, lymph nodes, and spleen. Researchers genetically engineered mice to make them more susceptible to autoimmune disease. In these mice, they found that this bacteria started the production of antibodies and inflammation. (5)\n\nWhen they looked at humans, they found this same mechanism. Cultured liver cells of healthy people showed the bacteria triggering the autoimmune response. Additionally, they found this same bacteria in livers of people with autoimmune disease. (5)\n\nThe researchers found that they could treat the bacteria with an antibiotic or a vaccine for the e. gallinarum bacteria. They administered treatments via muscle injections to avoid further harm to the gut bacteria. They found that they could suppress the autoimmune response, bacterial growth, and stop its effects on the immune system. (5)\n\nIn a statement about the study, senior study author Dr. Martin Kriegel said, “When we blocked the pathway leading to inflammation, we could reverse the effect of this bug on autoimmunity.” (6)\n\n“The vaccine was a specific approach, as vaccinations against other bacteria we investigated did not prevent mortality and autoimmunity,” he said. “Treatment with an antibiotic and other approaches such as vaccination are promising ways to improve the lives of patients with autoimmune disease.” (6)\n\nThe study results are most relevant for systemic lupus and autoimmune liver disease. Researchers plan more studies on the e. gallinarum bacteria. (6)", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Discover The Root Of Autoimmune Diseases- And How We Can Treat Them", "description": "A 2018 study from Yale University found that bacteria in the microbiome in both humans and mice can travel to other organs and trigger autoimmune disease.", "url": "https://www.healthy-holistic-living.com/scientists-discover-the-root-of-autoimmune-diseases-and-how-we-can-treat-them/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "http://www.facebook.com/livelovelemon", "article:published_time": "2019-12-18T14:18:13+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2019/12/Autoimmune-disease.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthyholisticliving.com/stop-attacking-9-steps-heal-autoimmune-disease/", "https://www.healthyholisticliving.com/how-the-bacteria-in-our-gut-influences-our-minds/", "https://www.healthyholisticliving.com/cortisone-injections-for-hip-and-knee-pain-are-more-dangerous-than-was-thought/", "https://www.healthyholisticliving.com/new-cancer-vaccine-shows-promise-helped-kill-cancer-cells-in-patient/"], "authors": ["Cheryl Whitten"], "publish_date": "2019-12-18T14:18:13+00:00"}