{"result_id": "154007", "URL": "https://www.healthy-holistic-living.com/irish-studies-find-vitamin-d-can-build-covid-19-resistance/", "timestamp": "2023-04-25 15:30:04 CEST+0200", "meta": {"description": "Irish researchers discover Vitamin D could provide protection against COVID-19 whole also reducing the severity of the virus in those already infected.", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/irish-studies-find-vitamin-d-can-build-covid-19-resistance/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Irish studies find Vitamin D can build virus resistance", "cleaned_text": "According to a new report published by the Irish Longitudinal Study on Ageing (TILDA) at Trinity College Dublin (TCD), Vitamin D can help build resistance to COVID-19. The study found the vitamin helps prevent respiratory infections, offering hope in the fight to reduce the spread of the virus. Vitamin D can provide a boost to the immune system allowing subjects to better fight respiratory infections. (1)\n\n“We have evidence to support a role for Vitamin D in the prevention of chest infections, particularly in older adults who have low levels. In one study, Vitamin D reduced the risk of chest infections to half in people who took supplements,” says TILDA principal investigator, Professor Rose Anne Kenny. (2)\n\nIt takes just 10 to 15 minutes of sun exposure to produce a healthy dose of Vitamin D naturally. Because of this, Vitamin D has been nicknamed, the sunshine vitamin. Unfortunately, in the Irish climate the vitamin can only be produced from late March to late September. Even in the summer months, other factors like clouds and rain can interfere with Vitamin D production. (1)\n\nThe study also shows about 27% of Irish adults over 70 are deficient in Vitamin D and 47% of those over 85 suffer from Vitamin D deficiency in the winter months. For adults over the age of 50, one in eight suffer from Vitamin D deficiency throughout the year. Only 4% of men and 15% of women take a supplement. (1)\n\nWith so many of us self-isolating, we are at risk of not getting enough sun to produce Vitamin D naturally. If our diets are also not providing adequate amounts of Vitamin D rich foods, we are further increasing our risk for Vitamin D deficiency. Those with chronic lung diseases or asthma should be taking a Vitamin D supplement as these groups are already at a higher risk. People who are overweight or do not get enough exercise are also in the high-risk group. (1)\n\n“Though we do not know specifically the role of Vitamin D in COVID infections, given its wider implications for improving immune responses, and clear evidence for bone and muscle health, those cocooning and other at-risk cohorts should ensure they have an adequate intake of Vitamin D,” says Professor Kenny. (2)\n\nAdding to the challenges of self-isolation is the risk for reduced exercise. “Muscle deconditioning occurs rapidly in these circumstances and Vitamin D will help to maintain muscle health and strength in the current crisis,” she says. (2)\n\nDr. Eamon Laird, co-author and research fellow in medical gerontology, says Vitamin D deficiency could negatively impact people’s immune response to infection. “There is an even larger risk now of deficiency with those cocooning or confined indoors,” he says. “However, Vitamin D deficiency is not inevitable. Eating foods such as oily fish, eggs, Vitamin D-fortified cereals or dairy products, and a daily 400 IU (10ug) Vitamin D supplement, can help avoid deficiency.” (2)\n\nDr. Laird says Ireland is lacking a formal Vitamin D recommendation and one is needed to help people understand how to reduce their risk for deficiency. (2)\n\nResearchers feel that taking Vitamin D supplements could also help reduce the severity of COVID-19 in those already infected. “Supplementing a healthy diet with 20-50 micrograms per day of Vitamin D represents a cheap, safe and potentially very effective protection for Irish adults against COVID-19,” says Irish Medical Journal article co-author, Dr. Daniel McCartney, a lecturer in human nutrition and dietetics at TU Dublin. (2)\n\nStudy co-author, Dr. Declan Byrne, a clinical senior lecturer at St James’s Hospital and TCD’s School of Medicine says taking a Vitamin D supplement could prove to be an important recommendation while we struggle to find an effective drug or vaccine to treat COVID-19. (2)\n\n“Our findings also suggest that Vitamin D supplementation in the broader adult population, and particularly in frontline healthcare workers, may further help to limit infection and flatten the COVID-19 curve,” says Dr. Byrne. (2)\n\nResearchers believe recommending 20-50 micrograms of Vitamin D per day could reduce the risk for COVID-19 infection. People at risk could take the dose over the coming three to six months but should not continue this dose beyond this period without doctor supervision. (1)", "opengraph": {"locale": "en_US", "type": "article", "title": "Irish studies find Vitamin D can build virus resistance", "description": "Dr. Declan Byrne says taking a Vitamin D supplement could prove to be an important recommendation while we struggle to find an effective drug or vaccine.", "url": "https://www.healthy-holistic-living.com/irish-studies-find-vitamin-d-can-build-covid-19-resistance/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2020-04-09T21:35:53+00:00", "article:modified_time": "2021-01-08T01:11:40+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2020/04/safe_image-1-4.jpeg", "image:width": "540", "image:height": "281", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1068", "height": "601", "embed_code": "<iframe title=\"9 DIETARY SOURCES OF VITAMIN D (Foods with naturally occurring vitamin D for autoimmune etc.)\" width=\"1068\" height=\"601\" src=\"https://www.youtube.com/embed/dn2WNENaXR4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/dn2WNENaXR4?feature=oembed"}], "links": ["https://www.healthy-holistic-living.com/woman-dies-from-covid-19-in-belgium-after-telling-doctors-to-save-ventilator-for-the-young/", "https://www.healthy-holistic-living.com/belly-fat-linked-to-vitamin-d-deficiency/", "https://www.healthy-holistic-living.com/mom-tells-boy-he-can-pick-any-animal-at-shelter-he-picked-this-eldery-overweight-and-shy-cat/", "https://www.healthy-holistic-living.com/10-hot-immune-boosting-drinks-to-fight-colds-flu/"], "authors": ["Amanda Walsh"], "publish_date": "2020-04-09T21:35:53+00:00"}