{"result_id": "154001", "URL": "https://www.healthy-holistic-living.com/massive-government-study-concludes-cell-phone-radiation-causes-brain-cancer/", "timestamp": "2023-04-25 15:29:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/massive-government-study-concludes-cell-phone-radiation-causes-brain-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Massive government study concludes cell phone radiation causes brain cancer", "cleaned_text": "After decades of denials and attacks by the media which called people concerned about cell phone radiation “tinfoil hat-wearing conspiracy theorists,” a massive, multi-year study funded by the federal government now concludes that yes, cell phone radiation causes brain cancer.\n\nThe study is published here and it’s entitled, “Report of Partial Findings from the National Toxicology Program Carcinogenesis Studies of Cell Phone Radiofrequency Radiation in Hsd: Sprague-Dawley SD rats (Whole Body Exposures).”\n\n“The findings, which chronicle an unprecedented number of rodents subjected to a lifetime of electromagnetic radiation, present some of the strongest evidence to date that such exposure is associated with the formation of rare cancers in at least two cell types in the brains and hearts of rats,” reports Scientific American:\n\nThe researchers found that as the thousands of rats in the new study were exposed to greater intensities of RF radiation, more of them developed rare forms of brain and heart cancer that could not be easily explained away, exhibiting a direct dose-response relationship. Some of the rats had glioma — a tumor of the glial cells in the brain — or schwannoma of the heart. Furthering concern about the findings: In prior epidemiological studies of humans and cell phone exposure, both types of tumors have also cropped up as associations. In contrast, none of the control rats — those not exposed to the radiation — developed such tumors.\n\nConsumer Reports also authored this story published on Yahoo Finance, which states, “The tumors found were gliomas (in the brain), and schwannomas (of the heart).” That same story goes on to report:\n\n[T]he current study, which found the same types of tumors in rats that the earlier epidemiological research found in humans, was a controlled clinical trial; it was specifically designed to simulate the exposures of cell phone users, and all of the important parameters were tightly controlled and carefully monitored. Rats and mice were exposed to the same kinds of radiation used in cell phones, for roughly nine hours each day, spread over the course of the day.\n\nIn other words, the cell phone industry can no longer claim it’s “bad science.” This is rigorous science, and it shows a clear, dose-related causative link between exposure to cell phone radiation and the development of brain and heart tumors.\n\nFor decades, the government has actively conspired with industry to downplay any evidence linking cell phones to cancer. We see this across the federal government, of course, with the EPA downplaying the risks of pesticides, the FDA downplaying the risks of pharmaceuticals and the USDA downplaying the risks of genetically engineered crops.\n\nThe entire federal government as it operates today, is little more than the science propaganda and marketing arm of the private industry. (Corporate-government collusion, by the way, is better known as economic Fascism.)\n\nIn all this, the role of the government-controlled media has long been to ridicule anyone who questions the official science propaganda on all these topics. Think cell phones cause cancer? You’re a kook. Worried about fluoride in the tap water? You’re a nut case.\n\nExcept that now the truth is being exposed on all these fronts. Now, even the government’s own study shows that cell phone radiation causes cancerous tumors of the brain and heart. At the same time, independent science is increasingly exposing the harm of mercury in vaccines, GM crop chemicals like glyphosate, toxic pharmaceuticals and the mass fluoride poisoning of the water supply. On all these issues, Natural News has always been right! (… and the establishment has always been in denial of reality.)\n\nThe CDC, for its conspiratorial part, yanked warnings about cell phone radiation from its website. (It’s the Ministry of Truth, you see, and preventing the public from learning the truth is always the CDC’s No. 1 priority…)\n\nAs Consumer Reports says in its story:\n\nThe CDC might also consider reinstating the cautions it pulled from its website. (We’ve reached out to the agency for comment, and will update our story once we hear back from them).\n\nLikewise, the cell phone industry may have to alter its stance. The wireless association trade group CTIA has maintained that cell phones are completely safe and has fought to block San Francisco from passing laws that would require electronics retailers to notify consumers about the proper handling of cell phones.", "opengraph": {"locale": "en_US", "type": "article", "title": "Massive government study concludes cell phone radiation causes brain cancer", "description": "After decades of denials and attacks by the media which called people concerned about cell phone radiation “tinfoil hat-wearing conspiracy theorists,” a massive, multi-year study funded by the federal government now concludes that yes, cell phone radiation causes brain cancer. The study is published here and it’s entitled, “Report of Partial Findings from the National … Massive government study concludes cell phone radiation causes brain cancer Read More »", "url": "https://www.healthy-holistic-living.com/massive-government-study-concludes-cell-phone-radiation-causes-brain-cancer/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2016-12-03T11:03:05+00:00", "article:modified_time": "2019-01-21T16:08:53+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2017/01/brain-on-cell-phone.jpg", "image:width": "800", "image:height": "414", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://biorxiv.org/content/biorxiv/early/2016/05/26/055699.full.pdf", "http://www.scientificamerican.com/article/major-cell-phone-radiation-study-reignites-cancer-questions/", "http://finance.yahoo.com/news/cell-phone-radiation-causes-cancer-111727441.html", "http://glyphosate.news/", "https://humix.com/redirect?url=https%3A%2F%2Fphoenixite.com%2Fhumix%2Fvideo%2F4c9b1ec05ba67fcc49934e43254740417c035e95473c5e870640e2d9165767ea", "http://biorxiv.org/content/biorxiv/early/2016/05/26/055699.full.pdf", "http://www.scientificamerican.com/article/major-cell-phone-radiation-study-reignites-cancer-questions/", "http://finance.yahoo.com/news/cell-phone-radiation-causes-cancer-111727441.html"], "authors": ["Healthy Holistic Living"], "publish_date": "2016-12-03T11:03:05+00:00"}