{"result_id": "154018", "URL": "https://www.healthy-holistic-living.com/illnesses-promising-treatments/", "timestamp": "2023-04-25 15:30:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/illnesses-promising-treatments/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "10 Incurable Illnesses with Promising Treatments", "cleaned_text": "You know that cold you just had? You may have taken a day or two off work, but chances are it disappeared in a matter of days. We once lived in a world where illnesses like the common cold, polio, smallpox or tetanus could mean a death sentence. Luckily, medicine has advanced astronomically since that time, and life expectancy has surged on a global scale. Could there be a cure for cancer? Can stem cells end blindness? Here are ten conditions with encouraging remedies.\n\nBEFORE YOU READ: You should always consult a physician before considering any of these treatments.\n\nA new study from the University of Tsukuba theorized that mitochondrial DNA does not mutate naturally, but accumulates proteins over a lifetime. The mitochondria are the powerhouses of cells. (1)\n\nBy resetting aged cell lines with stem cells, the “old” cells morphed back into “young” cells. The process of combining stem cells with the amino acid glycine will reverse some of the defects to mitochondria that develop over long periods of time.\n\nA 2005 Stanford University study also demonstrated the effectiveness of a new process in which medications and nutritional supplements extend life expectancy and boost natural regenerative powers in the human body\n\nAIDS was not recognized before the 1980s, but now it is an epidemic that is rife in developing countries and is also a serious problem for those in industrially advanced nations. Autoimmune Deficiency Syndrome, caused by the human immunodeficiency virus (HIV) has been known to have no treatment, cure or vaccine, perhaps until recently.\n\nIN 2012, a potential vaccine dubbed RV144 was tested on rhesus monkeys. The result showed the first instance of a substance reducing the rate of the acquisition of the virus. (2)\n\nIn July of 2016, Case Western Reserve University duplicated these results using macaques. Using pre-vaccination RNA screening on the subjects allowed the researchers to accurately predict the results of the vaccine in two-thirds of the monkeys. The researchers concluded that this could be a catalyst for “personalized and predictive vaccinology.”\n\nThe most exciting part? The vaccine is now ready for human clinic trials.\n\nAlzheimer’s disease affects approximately 5.4 million Americans, with over 96% of those being over the age of 65. Alzheimer’s is a devastating illness; consuming and destroying a sufferer’s mental faculties, cognition and memory over time.\n\nAn unlikely candidate has shown to destroy the buildup of toxic proteins that cause Alzheimer’s: marijuana. THC, the potent chemical in marijuana, is responsible for the buildup removal, which inhibits inflammation in the brain. The body also produces endocannabinoids, similar but naturally occurring chemicals that trigger these responses. (3)\n\nScientists have also created a vaccine that destroys toxic proteins in the brain that produce dementia, before and during Alzheimer’s sets in.\n\nYou’d be surprised to hear that over a third of the 50 million American affected by baldness are women. People lose hair for a variety of reasons: diet, stress, age, and medication are common factors that lead to hair thinning or baldness. It is a taxing and disheartening condition.\n\nThere are many treatment options you’ve likely seen on television infomercials of satisfied customers stroking a full head of hair. Those treatments work by moving active hair follicles to inactive regions.\n\nBut a new method to eliminate baldness and restore hair growth was discovered by Japanese scientists who used stem cells to regenerate hair follicles completely. The benefit of this mechanism is that it isn’t just preventing hair loss; it is promoting growth. (4)\n\nIn 2013, over seven million Americans reported some form of visual disability. Stem cells are currently being tested by Moorfields Eye Hospital in London, the UK after an independent study by Dr. Jeffrey Weiss in Florida was conducted.\n\nThe procedure involved extracting stem cells from bone marrow and injecting them into the eye using a thin layer of polyester to distribute the cells behind the patient’s retina, and restored vision in over 100 blind patients. (5)\n\nOnce thought to be the disease humans would never cure, the active search for a cancer cure has been the strict focus of the scientific and medical community for decades.\n\nJohannes Gutenberg University has developed a substance deemed the university cancer vaccine. The procedure involves injecting RNA from cancer cells to mount a lethal immune response to any and all cancer cells in the patient’s body. (6)\n\nThe tests have been run on mice and killed “aggressively growing” tumors. The tests on humans have also shown real promise, with some brain cancer patients achieving remission in a short time.\n\nA 2014 pharmaceutical company received approval from the Food and Drug Association to conduct a 12-week course of pill treatment that would eliminate the disease in the majority patients with Hepatitis C. (7)\n\nThe course of therapy would set you back $80,000, but 350,000 are killed every year from Hepatitis C, and other treatments cause unfavorable side effects and do not always show to be effective forms of treatment. So you could say it’s worth the gamble.\n\nIf you’ve ever had a cold sore, we’ve got some bad news for you. But don’t worry, it’s a very common virus with over 100 strains, and can lay dormant in your body for your entire life without you even knowing it. The problem is it’s extremely contagious.\n\nResearchers used a gene editing technology called CRISPR to destroy double-stranded DNA in three different herpes strains, inhibiting virus replication. The research is still in its early stages, but this has been the most encouraging course of treatment to date.\n\nThe treatment for leukemia has also been shown to dispose of unneeded biological material in Parkinson’s patients. Coordination and motor skills, the two main symptoms of Parkinson’s disease have shown remarkable improvement in low doses of nilotinib.(9)\n\nHowever, over time, the beneficial effects had been reversed, and the disease’s symptoms had returned. Researchers are still assured by this new form of treatment.\n\nDiabetes is the seventh-leading cause of death in the United States. It is a genetic disease that deprives the body of insulin, which is created by pancreatic beta cells in patients. The immune system attacks these cells.\n\nThe Stem Cell Institute at Harvard has developed a complicated but effective procedure, which turns generates beta cells from stem cells. Combining these cells with an immunosuppressant, which will prevent the patient’s body from attacking the beta cells is also an option being considered.\n\nMost of these treatment options are still very much in the trial phases of development. You should never attempt to use uncorroborated forms of treatments to diseases, life-threatening or otherwise, and you should always consult the expertise of a licensed doctor before choosing to pursue any of these treatments.\n• Hashizume, O., Ohnishi, S., Mito, T., Shimizu, A., Ishikawa, K., Nakada, K., . . . Hayashi, J. (2015, May 22). Corrigendum: Epigenetic regulation of the nuclear-coded GCAT and SHMT2 genes confers human age-associated mitochondrial respiration defects. Sci. Rep. Scientific Reports, 5. doi:10.1038/srep14591\n• Case Western Reserve University. (2016, July 7). HIV study confirms clinically viable vaccine paving the way for future treatments: Findings also disprove addition of stronger immunologic agent yields a better vaccine. ScienceDaily. Retrieved October 28\n• Currais, A., Quehenberger, O., Armando, A. M., Daugherty, D., Maher, P., & Schubert, D. (2016). Amyloid proteotoxicity initiates an inflammatory response blocked by cannabinoids. NPJ Aging and Mechanisms of Disease, 2, 16012. doi:10.1038/npjamd.2016.12\n• Boyd, J. (2016, July 13). Japanese Firms Team Up To Fight Baldness With Stem Cell Cure. Retrieved October 28, 2016.\n• Baulkman, J. (2016, March 03). Florida Doctor May Have Found The ‘Cure’ For Blindness. Retrieved October 28, 2016.\n• Diemen, F. R., Kruse, E. M., Hooykaas, M. J., Bruggeling, C. E., Schürch, A. C., Ham, P. M., . . . Lebbink, R. J. (2016, June 30). CRISPR/Cas9-Mediated Genome Editing of Herpesviruses Limits Productive and Latent Infections. PLoS Pathog PLOS Pathogens, 12(6). doi:10.1371/journal.ppat.1005701", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Incurable Illnesses with Promising Treatments", "description": "You know that cold you just had? You may have taken a day or two off work, but chances are it disappeared in a matter of days. We once lived in a world where illnesses like the common cold, polio, smallpox or tetanus could mean a death sentence. Luckily, medicine has advanced astronomically since that … 10 Incurable Illnesses with Promising Treatments Read More »", "url": "https://www.healthy-holistic-living.com/illnesses-promising-treatments/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2016-11-08T21:37:21+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2016/11/HHL-APPROVED-Oct-24_4.jpg", "image:width": "800", "image:height": "419", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/hrmvdrPd09s\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/hrmvdrPd09s"}], "links": ["https://www.healthy-holistic-living.com/tetanus-vaccine-truth.html", "https://www.healthy-holistic-living.com/mitochondria-aging-therapy.html", "https://www.healthy-holistic-living.com/how-to-reverse-your-autoimmune-disease.html", "https://www.healthy-holistic-living.com/bayer-us-govt-knowingly-gave-hiv-thousands-children.html", "https://www.healthy-holistic-living.com/inflammation-affects-every-aspect-of-your-health.html", "https://www.healthy-holistic-living.com/marijuana-kills-cancer-cells-admits-us-national-cancer-institute.html", "https://www.healthy-holistic-living.com/tried-and-true-ways-to-prevent-and-combat-female-hair-loss.html", "https://www.healthy-holistic-living.com/coconut-oil-hair-mask-recipe.html", "https://www.healthy-holistic-living.com/foods-for-vision.html", "https://www.healthy-holistic-living.com/seeds-kill-cancer-cells-affect-sleep-improve-sight-much.html", "https://www.healthy-holistic-living.com/chemotherapy-free-cancer-treatment-uses-bodys-immune-system-attack-diseased-cells.html", "https://www.healthy-holistic-living.com/exercise-for-brain-cancer.html", "https://www.healthy-holistic-living.com/ignore-big-pharma-there-is-a-natural-cure-established-for-hepatitis-c.html", "https://www.healthy-holistic-living.com/7-nutraceuticals-that-will-boost-and-detox-your-liver.html", "https://www.healthy-holistic-living.com/home-remedies-for-cold-sores.html", "https://www.healthy-holistic-living.com/noodles-cause-chronic-inflammation-weight-gain-alzheimers-parkinsons-disease.html", "http://www.iflscience.com/health-and-medicine/scientists-reverse-aging-human-cells-line/", "https://www.sciencedaily.com/releases/2016/07/160707171958.htm", "https://www.sciencedaily.com/releases/2016/06/160629095609.htm", "https://www.sciencedaily.com/releases/2016/06/160629095609.htm", "http://www.forbes.com/sites/jboyd/2016/07/13/stem-cells-to-make-hair-today-gone-tomorrow-a-thing-of-the-past/#42488c43cc50", "http://www.medicaldaily.com/stem-cell-treatment-blindness-cure-376244", "http://www.sciencealert.com/scientists-making-serious-progress-on-a-universal-cancer-vaccine", "https://www.scientificamerican.com/article/we-now-have-the-cure-for-hepatitis-c-but-can-we-afford-it/", "http://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1005701", "https://www.eurekalert.org/pub_releases/2016-07/ip-lds071216.php", "http://harvardmagazine.com/2014/10/melton-creates-beta-cells", "https://nfb.org/blindness-statistics", "https://pixabay.com/en/old-man-man-face-senior-older-1208210/", "http://www.thraki.com.gr/wp-content/uploads/2016/04/M7100113-Cancer_chemotherapy-SPL.jpg"], "authors": ["Healthy Holistic Living"], "publish_date": "2016-11-08T21:37:21+00:00"}