{"result_id": "154004", "URL": "https://www.healthy-holistic-living.com/foods-that-fight-inflammation/", "timestamp": "2023-04-25 15:29:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/foods-that-fight-inflammation/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "7 Foods That Fight Inflammation and Promote Heart Health", "cleaned_text": "Inflammation is one of the most common causes of various diseases that span anywhere from arthritis and asthma to cancer and heart disease.\n\nInflammation is part of the body’s immune response and helps us to heal. But it can get out of control and cause us harm. Foods that are high in sugar and saturated fat can induce inflammation. They cause overactivity in the immune system and makes us susceptible to inflammation.\n\nOmega-3s, vitamin E, and other potent compounds work to prevent inflammation, therefore working to prevent illnesses associated with it. Luckily for us, Mother Nature has provided us with natural inflammation fighters that are not only powerful, but very tasty.\n\nWalnuts are one of the few foods that provides us with alpha-linolenic acid. This Omega-3 fatty acid is packed with heart-healthy benefits that work to reduce inflammation. They’re also full of antioxidants, and this combination is powerful when it comes to fighting cancers.\n\nWalnuts are one of the easiest foods to incorporate into your diet. You can just toss them in with your salad or eat them on their own. Added bonus, they help with your weight loss goals because they keep you fuller, longer.\n\nNot only do spices enhance your cooking, they are also natural healers. Many spices have anti-inflammatory properties that promote your overall heart health. Turmeric, for example, contains a compound called curcuminoids that helps prevent Alzheimer’s disease, joint inflammation, and carpal tunnel syndrome.\n\nOther potent spices are nutmeg, peppercorns, ginger, and cinammon and can be easily incorporated into your daily cooking routine. Add these spices to your favourite dishes to kick them up a notch and reinvent them for your family.\n\nMany herbs including rosemary, thyme, and oregano, contain both antioxidant and anti-inflammatory properties. Not only that, they also possess antifungal, and antimicrobial functions. This gives them great nutritional value with a low caloric impact.\n\n \n\n Like spices, herbs can add great new flavor profiles to some of your favorite foods. Grow some right in your kitchen and include them in marinades, rubs, soups, and stews.\n\nThis tropical fruit is loaded with significant amounts of vitamins A, C, and E that works to improve inflammation. They also prevent the oxidation of cholesterol, which is what allows the cholesterol to stick to and build up in blood vessel walls.\n\nEven though it’s a tropical fruit, you can find papayas all year round. Their soft buttery texture and sweet taste make them a great addition to fruit salads, or even blended into smoothies.\n\nFish like black cod, salmon, sardines, and anchovies are excellent sources of omega-3 fatty acids. The pink hue of wild salmon is caused by its abundance of carotenoids, which also has anti-inflammatory properties.\n\nBecause of the healthy oil content, these types of fish are great when baked. Serve them with some lightly steamed veggies or over a salad for a great meal that takes almost no time at all.\n\nThese Asian mushrooms are nutritional powerhouses. They contain the antioxidants thioproline and ergothioneine that fight free radicals and reduce inflammation. They also have the carbohydrate lentinan which works to keep the immune system strong.\n\nYou can use these mushrooms in your next stir fry to add a deep woodsy flavor and loads of heart conscious benefits.\n\nPart of the cabbage family, bok choy has a high concentration of beta-carotene and vitamin A. Both of these compounds contain potent anti-inflammatory and anti-cancer effects.\n\nBok choy is a great option for stir frys as well, but don’t just limit them to that. Try them in soups or ramen-style dishes.\n\nThese foods are great nutritional additions to any diet with the added bonus of fighting inflammation and keeping your heart healthy.", "opengraph": {"locale": "en_US", "type": "article", "title": "7 Foods That Fight Inflammation and Promote Heart Health", "description": "Inflammation is one of the most common causes of various diseases that span anywhere from arthritis and asthma to cancer and heart disease. Inflammation is part of the body’s immune response and helps us to heal. But it can get out of control and cause us harm. Foods that are high in sugar and saturated … 7 Foods That Fight Inflammation and Promote Heart Health Read More »", "url": "https://www.healthy-holistic-living.com/foods-that-fight-inflammation/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2015-09-21T19:31:49+00:00", "article:modified_time": "2019-01-07T23:00:15+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2015/09/inflammationfoods.jpg", "image:width": "800", "image:height": "419", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthy-holistic-living.com/walnut-coconut-milk-turmeric-cinnamon.html", "https://www.healthy-holistic-living.com/12-medicinal-herbs-you-can-grow-in-your-own-garden.html", "https://www.healthy-holistic-living.com/adding-this-one-ingredient-to-your-salad-helps-your-body-absorb-nutrients.html"], "authors": ["Healthy Holistic Living"], "publish_date": "2015-09-21T19:31:49+00:00"}