{"result_id": "154002", "URL": "https://www.healthy-holistic-living.com/flint-michigan-water-treatment-plant-foreman-found-dead-young-mom-murdered-home-filing-lawsuit-michigan-government/", "timestamp": "2023-04-25 15:29:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/flint-michigan-water-treatment-plant-foreman-found-dead-young-mom-murdered-home-filing-lawsuit-michigan-government/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Flint, Michigan: Water treatment plant foreman found dead... young mom murdered in her home after filing lawsuit against Michigan government", "cleaned_text": "For those who wonder why, as the editor of Natural News, I carry a loaded weapon with me at all times, consider how often whistleblowers who threaten to expose government conspiracy crimes end up dead. In just the last few days, a water treatment plant foreman who could have testified against the corrupt government of Michigan was found dead in his home. On the exact same day, Sasha Avonna Bell, who spearheaded a lawsuit against the government over the lead poisoning of the Flint water supply, was found murdered.\n\n“She was identified Thursday, the same day the death of a Flint Water Treatment Plant foreman who was wanted for questioning in connection with the crisis was announced,” reports the Daily Mail.\n\nLocal government, state government and federal government all conspired to systematically poison the water supply of a predominantly black community, carrying out their criminal scheme for many months — and poisoning countless children — with extremely high concentrations of brain-damaging lead in the municipal water.\n\nDeliberate mass poisoning of a black community, covered up by those in power\n\nWhile the EPA says the limit of lead in public water is just 15 parts per billion, at times the water coming out of the tap in Flint, Michigan registered a jaw-dropping 13,200 parts per billion (13.2 ppm), according to Scientific American.\n\nThis crime was not only covered up by the government, it was allowed to continue for many months without anyone bothering to warn the public.\n\nOnce the knowledge of this government-run mass poisoning of black people finally became known, an EPA official resigned over the criminal cover-up, but no charges were ever filed against her because federal employees appear to have absolute legal immunity, even when they deliberately poison hundreds of thousands of people.\n\nBefore long, criminal charges were filed against three local water quality scientists and managers, but not before the murders began.\n\nMatthew McFarland was murdered, of course\n\nMatthew McFarland, the foreman at the Flint Water Treatment plant, was found dead at his home on April 16th. “The Lapeer County Sheriff’s Department said a friend found McFarland unresponsive at a home in Otter Lake. There were no signs of foul play,” reported Mlive.com. “An autopsy did not determine a cause of death and police are awaiting toxicology reports. The investigation remains open… Michigan Attorney General Bill Schuette’s office confirmed that McFarland was previously interviewed as part of its ongoing investigation into the city’s water crisis.”\n\nAnyone who thinks McFarland’s death is just an untimely coincidence is living in a delusional dream world. When it comes to government cover-ups and untimely deaths, there are no coincidences. There are, however, assassination teams that target those who might embarrass the government, and there’s little question that McFarland was actually murdered in a way to make it look like a death from natural causes.\n\nDo you honestly think that a government which conspired to mass poison an entire community of children with a toxic heavy metals that causes brain damage would hesitate to order the execution of a key witness?\n\nFor anyone reading this and screaming “conspiracy theory!” you need to wake up to the reality of conspiracy FACTS. The Flint water poisoning was factually a conspiracy. Those who have now been charged with the crime have, in fact, been charged with conspiracy. It’s no longer a “theory” when it’s happening all around you. It’s simply the way the government routinely works to poison the people while hiding all evidence from the public for as long as possible.\n\nWhen the bodies start piling up surrounding a massive government conspiracy to poison the population, you know something nefarious is afoot. Flint resident Sasha Bell, who spearheaded the first lawsuit against the government over the water poisoning, was also found murdered.\n\n“A 19-year-old Michigan mother who was one of the first to file lawsuits on behalf of the thousands of children poisoned by water in Flint was found shot to death this week,” reports NY Daily News. “The body of Sasha Bell was discovered Tuesday night at Ridgecrest Village Townhouses in Flint, authorities said. The body of a second woman, Sacorya Reed, was also found in the home.”\n\nNote carefully that a second woman was also murdered in the same home. In other words, as these murders are carried out to silence people and protect the government, the murderers are willing to kill anyone who gets in their way.\n\nAn 18-year-old named Malek Thornton has been arrested in connection with the murders, with a local NBC affiliate reporting, “Thornton has been charged and arraigned in this case for two counts of first degree murder, two counts of open murder and felony firearm.”\n\nHe is obviously a patsy in all this. Does anyone really think Sasha Bell was executed by pure chance? Are we supposed to believe this is another crazy coincidence where so many people involved in the Flint, Michigan water poisoning case just happen to end up dead or executed?\n\nAmerica’s cities have devolved into Third World cesspools of Third World justice\n\nThe upshot of all this is that Detroit, much like Oakland, Chicago and Miami, has devolved into a Third World cesspool of Third World justice. Here’s how it works:\n• Government gets away with murder, poisoning the population with an extremely toxic water supply (and food supply, for that matter) that causes brain damage and lifelong crippling side effects.\n• Anyone who attempts to speak out gets threatened, intimidated or simply executed.\n• The same government that covered up the original crime also covers up the murders, either designating them to be deaths from “natural causes” or blaming some young thug they set up as a stooge to take the fall.\n• Federal officials are NEVER charged with any crimes in all this. They get away scot-free, demonstrating the absolute legal immunity currently enjoyed by the corrupt, criminal ruling class of regulatory totalitarians who repeatedly conspire to harm the American public.\n• Black communities are routinely targeted in these schemes, just as we say with the mass water supply poisoning of the Washington D.C. area just 12 years ago.\n• NO COINCIDENCE: Black communities are also targeted for other depopulation agendas, including: 1) Vaccination sweeps that cause autism in African-American boys, 2) Cancer “treatment” that kills people, 3) Abortion clinics that end the lives of black babies before they are even born. Connect the dots, people, and you’ll realize that black people in America today are being systematically targeted and destroyed by the government itself.\n\nKnowing what we all know about the criminality of government and how “science” is twisted and distorted to poison the people, are any of us really surprised?", "opengraph": {"locale": "en_US", "type": "article", "title": "Flint, Michigan: Water treatment plant foreman found dead... young mom murdered in her home after filing lawsuit against Michigan government", "description": "For those who wonder why, as the editor of Natural News, I carry a loaded weapon with me at all times, consider how often whistleblowers who threaten to expose government conspiracy crimes end up dead. In just the last few days, a water treatment plant foreman who could have testified against the corrupt government of … Flint, Michigan: Water treatment plant foreman found dead… young mom murdered in her home after filing lawsuit against Michigan government Read More »", "url": "https://www.healthy-holistic-living.com/flint-michigan-water-treatment-plant-foreman-found-dead-young-mom-murdered-home-filing-lawsuit-michigan-government/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2016-02-25T09:32:33+00:00", "article:modified_time": "2019-01-07T23:09:36+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2016/04/flint.jpg", "image:width": "800", "image:height": "423", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthy-holistic-living.com/flint-michigan-water-treatment-plant-foreman-found-dead-young-mom-murdered-home-filing-lawsuit-michigan-government.html/flint", "http://www.dailymail.co.uk/news/article-3554797/Woman-19-leading-Flint-water-crisis-lawsuit-murdered-week-suspicious-death-man-wanted-questioning-lead-poisoning.html", "http://www.scientificamerican.com/article/q-a-what-really-happened-to-the-water-in-flint-michigan/", "http://thehill.com/policy/energy-environment/266661-epa-official-resigns-amid-flint-water-crisis", "http://thehill.com/policy/energy-environment/266661-epa-official-resigns-amid-flint-water-crisis", "http://www.mlive.com/news/flint/index.ssf/2016/04/treatment_plant_foreman_dies_a.html", "http://www.nydailynews.com/news/crime/flint-mother-sue-water-found-shot-death-article-1.2611186", "http://nbc25news.com/news/local/arrest-made-in-flint-double-homicide", "http://www.today.com/health/these-moms-did-everything-right-yet-their-kids-still-got-t68721", "http://www.dailymail.co.uk/news/article-3554797/Woman-19-leading-Flint-water-crisis-lawsuit-murdered-week-suspicious-death-man-wanted-questioning-lead-poisoning.html", "http://www.scientificamerican.com/article/q-a-what-really-happened-to-the-water-in-flint-michigan/", "http://thehill.com/policy/energy-environment/266661-epa-official-resigns-amid-flint-water-crisis", "http://www.mlive.com/news/flint/index.ssf/2016/04/treatment_plant_foreman_dies_a.html", "http://www.nydailynews.com/news/crime/flint-mother-sue-water-found-shot-death-article-1.2611186", "http://nbc25news.com/news/local/arrest-made-in-flint-double-homicide", "http://www.today.com/health/these-moms-did-everything-right-yet-their-kids-still-got-t68721"], "authors": ["Healthy Holistic Living"], "publish_date": "2016-02-25T09:32:33+00:00"}