{"result_id": "154015", "URL": "https://www.healthy-holistic-living.com/victory-delaware-becomes-the-first-no-kill-state-for-shelter-animals/", "timestamp": "2023-04-25 15:30:15 CEST+0200", "meta": {"description": "Delaware is the United States' first no-kill animal shelter state, according to The Best Friends Animal Society, which wants nationwide no-kill by 2025.", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/victory-delaware-becomes-the-first-no-kill-state-for-shelter-animals/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Victory! Delaware Becomes The First No-Kill State For Shelter Animals", "cleaned_text": "Delaware has just made history as the United States’ first no-kill state for animals in shelters. The Best Friends Animal Society, an organization committed to ending shelter euthanization, announced Delaware’s exciting news at its annual conference in Dallas. (1, 2)\n\nThe Best Friends Animal Society considers a state to be no-kill if it saves at least 90% of the dogs and cats that enter its shelters. The organization recognizes that sometimes, euthanization is the most compassionate choice. This is why their no-kill benchmark is 90% instead of 100%. (1, 3)\n\nDelaware has 59 no-kill shelters. And out of the 12,800 cats and dogs that entered its shelters in 2018, 11,900 were saved – almost 93%. (3)\n\nThe Best Friends Animal Society has made “No More Homeless Pets” its mission. The organization hopes to achieve this by ending killing in animal shelters and building community programs and partnerships across the United States. Their website says that they hope to “achieve no-kill for dogs and cats nationwide by 2025.” (2, 3)\n\nAccording to the organization’s website, 2000 cats and dogs are killed in animal shelters every day in the United States. But even with such high numbers, there is still hope. The organization has determined that the nationwide number of animals being killed in animal shelters has declined significantly. In 1984, 17 million animals were killed each year in U.S. animal shelters. By 2017, that number had been reduced to 2 million per year. And in 2018, the number of cats and dogs dying in shelters dropped even more to 1.5 million annually. (2, 4)\n\nIn particular, the Brandywine Valley SPCA was instrumental in helping Delaware achieve its no-kill status. This group of shelters takes in 60% of the state’s homeless pets, They credit several different programs with their success. (5, 6)\n\nThe Brandywine Valley SPCA offers mega adoption events, low-cost veterinary clinics, and community education programs. They provide behavior training for dogs who need additional support before getting adopted. (5)\n\nThey also have a trap-neuter-vaccinate-return (TNVR) program for feral cats. The goal of the TNVR program is to stabilize populations of outdoor cats that are not adoptable. The shelter traps the cats humanely and brings them to their health center. The cats are vaccinated and spayed or neutered before being released back into the location where they were found. This allows the cats to live out their lives healthily and without reproducing and creating a larger feral cat population. (7)\n\nPrograms like the ones through the Brandywine Valley SPCA have helped Delaware become a no-kill animal shelter state. Cats and dogs get adopted more quickly, and low-cost veterinary services keep families from having to give up their pets because of financial challenges. (5)\n\nThe Best Friends Animal Society has collected data on all 50 states to inform their 2025 no-kill goal. They have learned that across the U.S., shelters have a 76.6% save rate. Of the 5.3 million dogs and cats entering shelters each year, 4.1 million are saved and 733,000 are killed. Overall, the United States has 4300 no-kill animal shelters. (3)\n\nThe organization’s website has an interactive tool showing the number of animals that die in shelters in each state. If you select your state, you can find more detailed information about specific communities and how close they are to becoming no-kill. The tool shares information on each shelter in a community and how close they are to achieving no-kill status. (3)\n\nIf you are passionate about saving the lives of shelter pets, this tool is an amazing resource. It can help you identify how you can help your community and its shelters become no-kill. (3)", "opengraph": {"locale": "en_US", "type": "article", "title": "Victory! Delaware Becomes The First No-Kill State For Shelter Animals", "description": "Delaware has just made history as the United States’ first no-kill state for animals in shelters.", "url": "https://www.healthy-holistic-living.com/victory-delaware-becomes-the-first-no-kill-state-for-shelter-animals/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "http://facebook.com/emmiscottyoga", "article:published_time": "2019-08-22T23:10:31+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2019/08/Screen-Shot-2019-08-22-at-4.06.41-PM.png", "image:width": "519", "image:height": "268", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://bestfriends.org/2025-goal"], "authors": ["Emmi Scott"], "publish_date": "2019-08-22T23:10:31+00:00"}