{"result_id": "154014", "URL": "https://www.healthy-holistic-living.com/7-prescribed-drugs-world-natural-counterparts/", "timestamp": "2023-04-25 15:30:13 CEST+0200", "meta": {"description": "These are the most prescribed drugs in the world, but are they actually doing us any good? Here's everything you need to know and their natural alternatives", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/7-prescribed-drugs-world-natural-counterparts/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "The 7 Most Prescribed Drugs In The World and Their Natural Counterparts", "cleaned_text": "We don’t have to live in a medicated world, but we certainly choose to. The crux of the matter is that we refuse to proactively think about prevention because we reactively commit to treating the symptoms of underlying health problems. This is the allopathic model. We want the quick fix so we can continue our poor lifestyle and dietary habits. It doesn’t have to be this way, but it is. We can blame doctors, the medical institutions and healthcare systems all we want, but self-responsibility is our only recourse if we are ever to surface from this mess. There are no excuses–if you’re taking one of these drugs, consult with a Natural Health Practitioner this week about phasing out your medication and phasing in these powerful natural foods and remedies.\n\nOf the over 4 billion prescriptions written every year, the United States and Canada make up more than 80% of the world’s prescription opioids (psychoactive medications). Between 1997 and 2012 prescription opioids increased in dosage by almost 500%. Pharmaceuticals and medical errors are now a leading cause of death. Painkillers are the leading cause of accidental death.\n\nIn the last 15 years of life, people are experiencing more pain for longer periods than at any point on our historical record. If you think life expectancy has increased to the benefit of mankind, you’re not looking at the numbers.\n\n78% of U.S. prescriptions written in 2010 were for generic drugs (both unbranded and those still sold under a brand name). The most prescribed drugs aren’t always the best selling drugs, there’s a difference.\n\nPrescriptions for pain, cholesterol reduction, high blood pressure, hypothyroidism, antacids, antipsychotics, diabetes and antibiotics make up 100% of the most prescribed drugs.\n\nMake a commitment to yourself right now and start incorporating some of these amazing foods into your diet with no consequence of side effects. When you accept this, you will get off prescription medications for good.\n\nMost Prescribed Drugs and the Best Natural Remedies to Treat and Prevent Disease\n\nCurrently the single most prescribed drug in the world. More and more doctors are getting huge payouts from pharmaceutical companies to promote these hydrocodone, especially generic drugs. They make up more than 20% of the top prescribed medications.\n\nDr. Thomas Frieden, director of the Centers for Disease Control and Prevention (CDC), told Fox News that doctors are handing out narcotics like candy. Some doctors are giving patients prescriptions for narcotics for even minor injuries.\n\nIt is an orally psychoactive compound that works as a narcotic and analgesic. It is biotransformed by the liver into several metabolites. It is highly dependent on metabolism by the Cytochrome P450 pathway.\n\nRespiratory depression; bradycardia; coma; seizures; cardiac arrest; liver damage; and death. Inherited genes such as the Cytochrome P450 affects metabolic pathways–some cannot process it at all, whereas a smaller percentage can get even more strength from it than usual.\n\nGinger, turmeric, berries, cayenne pepper, celery/celery seeds, cherries, dark green veggies, walnuts.\n\n See: Natural Healing Remedies: 10 Foods That Fight Inflammation And Pain\n\nApproximately 15% of the top prescribed medications are generic statins. A study published in January 2012 in the Archives of Internal Medicine linked statins to 48 percent increased risk for type-2 diabetes.\n\nThe are NO scientific studies ever documented which have proved through causation that lowering LDL cholesterol prevents disease. The obsessed culture of lowering cholesterol may actually be causing cancer.\n\nStatins artificially lower cholesterol levels by inhibiting a critical enzyme HMG-CoA reductase, which plays a central role in the production of cholesterol in the liver.\n\nInflammation and pathological breakdown of muscle, acute kidney failure, diabetes, cancer, cardiovascular disease, interference with sex hormones and death.\n\nNuts, spinach, apples, turmeric, cranberries, tomatoes, green tea, fatty fish, beans, alfalfa herb, capsicum fruit, garlic, psyllium, fenugreek seeds, butcher’s broom, licorice root, hawthorn berry.\n\n See:\n\n – New Data Shows Lycopene Reduces Heart Disease Up To 26 Percent\n\n – Two Apples a Day More Effective At Reducing Heart Disease Than Statin Medications \n\n – Top 5 Foods and Herbs To Control Cholesterol\n\n – World Renown Heart Surgeon Speaks Out On What Really Causes Heart Disease\n\nIn combination, Lisinopril and Norvasc make up a whopping 23% of the top prescribed medications. This makes them the most prescribed generic medications (if combined) for cardiovascular disease and blood pressure. Individually, Lisinopril constitutes approximately 14% and Norvasc about 9%.\n\nLisinopril is typically used for the treatment of hypertension, congestive heart failure, and heart attacks. Norvasc is used for hypertension and angina. It accomplishes this by inhibiting the influx of calcium ions into vascular smooth muscle and cardiac muscle so it essentially interferes with the metabolism of calcium.\n\nCancer, blood disorders, development of breasts in men, impotence, depression, tachycardia, enlargement of gums, inflammation of the liver, elevated blood glucose, hepatitis, life-threatening skin conditions.\n\nAny foods high in vitamin C (chili peppers, guavas, bell peppers, thyme, parsley, dark leafy greens, broccoli), any foods high in magnesium (chocolate, green leafy vegetables, Brazil nuts, almonds, cashews, blackstrap molasses, pumpkin and squash seeds, pine nuts, and black walnuts) and any foods high in potassium (mushrooms, bananas, dark green leafy vegetables, sweet potatoes, oranges and dates). Coconut oil/water and CoQ10 are also very effective for lowering blood pressure.\n\n See:\n\n – Magnesium Reduces Blood Pressure Naturally Without Side Effects\n\n – Low Salt Diets Do Not Decrease Blood Pressure, Period\n\n – Vitamin C Supplements Reduce Blood Pressure Without Side Effects Associated With Medication\n\n – Low Potassium Linked To High Blood Pressure\n\nA synthetic form of the thyroid hormone thyroxine, generic Synthroid makes up more than 11% of the top prescribed medications. It’s used to treat hypothyroidism. The related drug dextrothyroxine (D-thyroxine) was used in the past as a treatment for elevated cholesterol but was withdrawn due to cardiac side-effects.\n\nIt replaces the thyroid hormone which is naturally occurring in the thyroid gland essentially halting natural production.\n\nLong-term suppression of thyroid stimulating hormone (TSH) causes cardiac side-effects and contributes to decreases in bone mineral density (high TSH levels are also well known to contributes to osteoporosis.) May also cause elevated blood glucose levels, heart failure, coma and adrenal insufficiency. TSH directly influences the whole process of iodine trapping and thyroid hormone production so use of synthroid directly affects how the body metabolizes iodine.\n\nAny foods containing iodine such as seaweed, kelp, radish, parsley, fish, seafood, eggs, bananas, cranberries, strawberries, Himalayan crystal salt. Also, copper, iron, selenium and zinc are essential in the production of thyroid hormones. Exercise a minimum of 20-30 minutes per day — enough to raise the heartbeat.\n\n See:\n\n – Seaweed Extracts Can Help You Lose Weight, Mostly Body Fat\n\n – 8 Critical Nutrients Lacking In More Than 70 Percent of Diets\n\n – The Number One Reason So Many Women Have Trouble Losing Weight\n\nA proton pump inhibitor which constitutes just over 8% of the top prescribed medications. Omeprazole is one of the most widely prescribed drugs for reflux disease (GORD/GERD/LPR) and ulcers internationally and is available over the counter in some countries.\n\nIt suppresses gastric acid secretion by specific inhibition of the gastric acid ions in cells. The absorption of omeprazole takes place in the small intestine essentially turning off the switch which promotes healthy digestion of foods. Omeprazole is also completely metabolized by the cytochrome P450 system.\n\nAngina, ulcers, tachycardia, bradycardia, palpitations, elevated blood pressure, development of male breasts, inflammation of the pancreas, irritable colon, mucosal atrophy of the tongue, liver disease/failure, elevated blood sugar, muscle weakness, skin conditions, tinnitus, inflammation of the eyes, urinary frequency, testicular pain, anemia and blood cell disorders.\n\nGrapefruits, probiotics, broccoli sprouts, manuka honey, mastic gum, marshmallow tea, glutamine, slippery elm, deglycyrrhized liquorice (DGL), aloe vera juice, baking soda, pickle juice.\n\n See:\n\n – Grapefruit Heals Stomach Ulcers\n\n – Broccoli Sprouts May Prevent Gastritis, Ulcers and Stomach Cancers\n\n – Manuka Honey Reverses Antibiotic Resistance, Treats Disease\n\nIn combination, azithromycin and amoxicillin contribute towards a mind-blowing 17% of the top prescribed medications. Then we wonder why we have antibiotic resistance. On their own, each contributes about 8.5%. Azithromycin is one of the world’s best-selling antibiotics and derived from erythromycin. Amoxicillin is usually the drug of choice for children.\n\nInhibits the synthesis of bacterial cell walls and interfering with their protein synthesis. These drugs also inhibit the protein synthesis of good bacteria needed for immunity and proper digestion.\n\nInflammation of the liver, inflammation and destruction of the stomach lining, destruction of healthy bacterial populations, inflammation of the colon, allergic reactions, obesity, human antibiotic resistance.\n\nSunlight (vit D), garlic, coconut oil, turmeric, foods high in nicotinamide (vit B3) such as salmon, sardines and nuts. Also manuka honey, olive leaf extract, green tea, pau D’Arco, rose water, myrrh, grapeseed extract, golden seal, oregon grapes, oregano oil, andrographis paniculata, and probiotics.\n\n See:\n\n – Garlic Proven 100 Times More Effective Than Antibiotics, Working In A Fraction of The Time\n\n – Before Antibiotics Ever Existed, Sunlight Was Used To Treat Diseases With Great Success\n\n – The Most Potent B Vitamin That Combats Infections Better Than Antibiotics Ever Could\n\nGlucophage drugs round up the top 7 but the prescription rate of this drug is rapidly increasing. It makes up about 7% of the top prescribed medications. It is the first-line drug of choice for the treatment of type 2 diabetes, in particular, in overweight and obese people. It also acts to indirectly lower LDL cholesterol and triglyceride levels.\n\nBy suppressing natural glucose production by the liver, the drug activates an enzyme which plays an important role in insulin signaling, whole body energy balance, and the metabolism of glucose and fats.\n\nLactic acidosis, impaired liver/kidney function, decreasing thyroid stimulating hormone and testosterone, increased homocysteine levels, malabsorption of vitamin B12, B12 deficiency, bladder cancer, heart failure. The biggest consequence of diabetes drugs is that it causes pancreatic function to substantially decrease inhibiting several hormones and causing other imbalances which are never correctable without abstaining from the drug.\n\nBlack tea, Sunlight (vit D), potentially coffee (more research needed), turmeric, nuts, chia seeds, green leafy vegetables, apple cider vinegar, cinnamon, red grapes, steel cut oatmeal, broccoli, spinach, green beans and strawberries. 90% of all cases of diabetes can be resolved by eating foods with a low glycemic load and pursuing both weight training and aerobic exercise.\n\n See:\n\n – Study on Black Tea Consumption From 42 Countries Shows It Lowers Diabetes Risk\n\n – Two More Bombshells For Vitamin D: It Prevents Both Type I Diabetes and Cavities\n\n – Coffee’s Anti-Diabetes Benefit\n\n – Healthy Diet, Moderate Exercise Reduce Diabetes Risk Better Than Drugs\n\n – How Turmeric Has An Anti-Diabetic Effect On The Body\n\nThe drugs on which we spend the most money are those that are still new enough to be protected against generic competition. That’s why drugs like Abilify and Seroquel (antipsychotics), as well as Plavix (blood thinner) and Advair Diskus (asthma inhaler), don’t make the list.\n\n**Please note there are some medications that are medically necessary and without them, the individual would die. With that in mind, the information above is for the general population with moderate conditions that are not life and death.", "opengraph": {"locale": "en_US", "type": "article", "title": "The 7 Most Prescribed Drugs In The World and Their Natural Counterparts", "description": "These are the most prescribed drugs in the world, but are they actually doing us any good? Here's everything you need to know and their natural alternatives", "url": "https://www.healthy-holistic-living.com/7-prescribed-drugs-world-natural-counterparts/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2014-03-24T11:58:50+00:00", "article:modified_time": "2019-01-30T23:52:51+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2014/03/HHL_Viral_May_23_22_Natural_counterparts.jpg", "image:width": "800", "image:height": "419", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthy-holistic-living.com/ultimate-guide-healthy-holistic-living/", "http://preventdisease.com/news/12/032312_The-Real-Reason-Why-Those-on-Psyche-Drugs-Are-Committing-Suicide-and-Homicide.shtml", "http://preventdisease.com/news/12/032312_The-Real-Reason-Why-Those-on-Psyche-Drugs-Are-Committing-Suicide-and-Homicide.shtml", "http://preventdisease.com/news/12/082712_Natural-Healing-Remedies-10-Foods-That-Fight-Inflammation-And-Pain.shtml", "http://preventdisease.com/news/12/041012_The-Obsessed-Culture-of-Lowering-Cholesterol-May-Actually-Be-Causing-Cancer.shtml", "https://en.wikipedia.org/wiki/HMG-CoA_reductase", "http://preventdisease.com/news/13/011813_Lycopene-Reduces-Heart-Disease-Up-To-26-Percent.shtml", "http://preventdisease.com/news/12/073012_Two-Apples-a-Day-More-Effective-At-Reducing-Heart-Disease-Than-Statin-Medications.shtml", "http://preventdisease.com/news/11/122711_Top-5-Foods-and-Herbs-To-Control-Cholesterol.shtml", "http://preventdisease.com/news/12/030112_World-Renown-Heart-Surgeon-Speaks-Out-On-What-Really-Causes-Heart-Disease.shtml", "http://preventdisease.com/news/12/021412_Magnesium-Reduces-Blood-Pressure-Naturally-Without-Side-Effects.shtml", "http://preventdisease.com/news/13/011113_Low-Salt-Diets-Do-Not-Decrease-Blood-Pressure-Period.shtml", "http://preventdisease.com/news/12/041512_Vitamin-C-Supplements-Reduce-Blood-Pressure-Without-Side-Effects-Associated-With-Medication.shtml", "http://preventdisease.com/news/08/111208_potassium.shtml", "http://preventdisease.com/news/12/060412_Seaweed-Extracts-Can-Help-You-Lose-Weight-Mostly-Body-Fat.shtml", "http://preventdisease.com/news/12/121412_8-Critical-Nutrients-Lacking-In-More-Than-70-Percent-of-Diets.shtml", "http://preventdisease.com/news/12/070312_The-Number-One-Reason-So-Many-Women-Have-Trouble-Losing-Weight.shtml", "http://preventdisease.com/news/12/032312_The-Real-Reason-Why-Those-on-Psyche-Drugs-Are-Committing-Suicide-and-Homicide.shtml", "http://preventdisease.com/news/articles/072005_grapefruit_ulcers.shtml", "http://preventdisease.com/news/09/040609_sprouts.shtml", "http://preventdisease.com/news/11/041311_manuka_honey_benefits.shtml", "http://preventdisease.com/news/12/050212_Garlic-Proven-100-Time-More-Effective-Than-Antibiotics.shtml", "http://preventdisease.com/news/12/090412_Before-Antibiotics-Ever-Existed-Sunlight-Was-Used-To-Treat-Diseases-Such-As-Tuberculosis.shtml", "http://preventdisease.com/news/12/083012_The-Most-Powerful-B-Vitamin-That-Combats-Infections-Better-Than-Antibiotics-Ever-Could.shtml", "http://preventdisease.com/home/tips106.shtml", "http://preventdisease.com/news/12/080712_Weight-Training-Combined-With-Aerobic-Exercise-Reduces-Diabetes-by-Almost-60-Percent.shtml", "http://preventdisease.com/news/12/111412_Study-on-Black-Tea-Consumption-From-42-Countries-Shows-It-Lowers-Diabetes-Risk.shtml", "http://preventdisease.com/news/12/112812_Two-More-Bombshells-For-Vitamin-D-Prevents-Type-I-Diabetes-and-Cavities.shtml", "http://preventdisease.com/news/10/031710_coffee_anti-diabetes.shtml", "http://preventdisease.com/news/articles/healthy_diet_diabetes.shtml", "http://preventdisease.com/news/12/090112_How-Turmeric-Has-An-Anti-Diabetic-Effect-On-The-Body.shtml", "http://preventdisease.com/news/10/090210_medication_problem_mental_illness.shtml", "http://preventdisease.com/news/10/050410_lycopene_reduces_asthma.shtml"], "authors": ["Dave Mihalovic"], "publish_date": "2014-03-24T11:58:50+00:00"}