{"result_id": "154016", "URL": "https://www.healthy-holistic-living.com/america-is-about-to-get-a-godawful-lesson-in-why-health-care-should-never-be-a-for-profit-business/", "timestamp": "2023-04-25 15:30:16 CEST+0200", "meta": {"description": "Coronavirus looms and threatens American life, but the U.S. health care system seems inadequate to prevent and manage a nationwide pandemic.", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/america-is-about-to-get-a-godawful-lesson-in-why-health-care-should-never-be-a-for-profit-business/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "America is About to Get a Godawful Lesson in Why Health Care Should Never Be a For-Profit Business", "cleaned_text": "A flurry of articles hit the media in the first months of 2020, speculating about what the future of America will look like in the case of a nationwide coronavirus (COVID-19) pandemic. However, not all of these articles paint a positive picture of the possible future for the home of the free and brave. Using what is already know about U.S. healthcare, experts, journalists, and political advisors have made some pretty grim predictions. These concerns have now left everyday Americans ultimately wondering, ‘how good is our privatized healthcare system?’\n\nApproximately 27.5 million Americans don’t have health insurance. Often, these people are working, which disqualifies them for Medicaid – but they are still not making enough to afford private insurance. A lack of insurance forces these Americans, and those who don’t have enough insurance, to fall back on themselves to assess, treat, and monitor their health. It’s sad, but the ability to see a doctor, nurse, or any other healthcare provider is, for the most part, a luxury for these folks.\n\nAmericans without adequate insurance are expected to be particularly vulnerable to COVID-19, with no feasible way to seek care if they begin exhibiting symptoms. Some of these Americans might even ignore signs of COVID-19 or ‘tough it out’ to avoid a hospital visit, which could increase the risk of transmission to others. (1) Based on the United States Centers for Disease Control and Prevention March 2020 numbers, there are over 2,800 deaths worldwide from COVID-19 and active cases have been confirmed in at least 50 countries on six continents. (1)\n\nBeyond a public health care system allowing all citizens to seek services financially, there are other unique aspects of COVID-19 to consider here in the U.S. First, American government officials seem to be obscuring the risk of COVID-19 to the country. President Trump rejected the World Health Organization’s (WHO) status of COVID-19 as a pandemic and is telling Americans instead that they are at low risk of getting the spreading infection. The Department of Health and Human Services secretary, Alex Azar, and house speaker, Nancy Pelosi, also refused to commit to pricing controls for a possible coronavirus vaccine (still in development). There is speculation that the vaccine will be ‘affordable’, but how much that is exactly, and what is considered affordable remains up in the air. We are also most likely at least a year away from having a viable vaccine available to the public.\n\nSecondly, the United States has a for-profit health care system. Thus, the system is built to make money from any medical scenario, including a pandemic. (1, 2) It’s not set up with public health in mind – it’s set up with corporate profits in mind.\n\nAlthough it is hard to say how much the current U.S. private healthcare system plays into the spread and perpetuation of pandemics, it can be said that each item in health care is designed to generate profits. There is no proof that a pandemic will be any different, or that hospitals will charitably offer up care to everyone, regardless of cost. Some experts worry that all services rendered to treat COVID-19 by big pharmacy, technology, and care companies in the States will sum up to one enormous bill – with little actual protection from the virus. (1)\n\nKnowing the potential for a COVID-19 outbreak exists within your community, you can anticipate some changes within your daily life from the virus (if and when it spreads!). Do not necessarily be deterred from planning social events, but know that in the event of a community spread of COVID-19 some festivals, concerts, and sporting dates may be canceled. In extreme cases, schools, child care centers, and colleges could even be temporarily closed. For instance, during the 2009 H1N1 flu pandemic, more than 100 American schools closed to prevent the spread of illness.\n\nThe Centers for Disease Control and Prevention recommend keeping a distance of at least three feet between yourself and others who are ill. Based on this distance, there may be re-arrangement of seating in public settings to keep patrons safe. Employers may even urge you to work from home on days when you aren’t feeling quite ‘right’ and, conduct hand-washing audits or promote cleaning of workstations to ensure illness does not spread. (3)", "opengraph": {"locale": "en_US", "type": "article", "title": "America is About to Get a Godawful Lesson in Why Health Care Should Never Be a For-Profit Business", "description": "The Centers for Disease Control and Prevention recommend keeping a distance of at least three feet between yourself and others who are ill.", "url": "https://www.healthy-holistic-living.com/america-is-about-to-get-a-godawful-lesson-in-why-health-care-should-never-be-a-for-profit-business/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:published_time": "2020-03-04T23:52:03+00:00", "article:modified_time": "2020-03-24T20:46:26+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2020/03/safe_image-4.jpeg", "image:width": "540", "image:height": "281", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1068", "height": "601", "embed_code": "<iframe title=\"The Healthcare System of the United States\" width=\"1068\" height=\"601\" src=\"https://www.youtube.com/embed/yN-MkRcOJjY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/yN-MkRcOJjY?feature=oembed"}], "links": ["https://www.healthy-holistic-living.com/cdc-says-to-prepare-for-coronavirus-spread-in-u-s-with-the-expectation-that-this-could-be-bad/", "https://www.healthy-holistic-living.com/you-wouldnt-think-youd-go-to-jail-over-medical-bills-county-in-rural-kansas-is-jailing-people-over-unpaid-medical-debt/", "https://www.healthy-holistic-living.com/long-lines-at-costco-as-shoppers-empty-shelves-of-water-and-toilet-paper-amid-coronavirus-panic/", "https://www.healthy-holistic-living.com/the-chinese-doctor-who-tried-to-warn-others-about-coronavirus/", "https://www.healthy-holistic-living.com/scientists-verify-elderberry-beats-flu-prevents-colds-strengthens-immunity/"], "authors": ["Crystal Phyllis Mcleod"], "publish_date": "2020-03-04T23:52:03+00:00"}