{"result_id": "154011", "URL": "https://www.healthy-holistic-living.com/supercharged-turmeric-tea/", "timestamp": "2023-04-25 15:30:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicons/apple-touch-icon.png", "canonical": "https://www.healthy-holistic-living.com/supercharged-turmeric-tea/", "encoding": "UTF-8"}, "image": null, "domain": "www.healthy-holistic-living.com", "title": "Supercharged Turmeric Tea Recipe to Absorb As Much Anti-Inflammatory Power as Humanly Possible", "cleaned_text": "Here at Healthy Holistic Living, we search the web for great health content to share with you. This article is shared with permission from our friends at drfranklipman.com.\n\nAlso known as Golden Milk, turmeric tea is a warm and nourishing drink that helps the body fight inflammation while boosting the immune system. This bright orange herb has been used in different cultures for thousands of years to treat and prevent disease by supplying the body with many beneficial antioxidants and healing properties, making it a great way to turn your food into medicine!\n\nThere are many turmeric tea recipes, so feel free to play around with different ingredients. I have found this one to offer the best flavor in combination with a number of health-boosting ingredients.\n\n1. Turmeric Is the Superman of Spices\n\nTurmeric and, it’s MVP active ingredient curcumin, is one of the cornerstones of South Asian cuisine and it’s also been used medicinally for hundreds of years. More recently in the West, turmeric has been embraced as an anti-inflammatory agent with brain-boosting, anti-aging and heart-supporting effects. It’s also shown to be helpful in reducing pain and fatigue, improving mood by boosting serotonin and dopamine levels, as well as cognitive function by stimulating the production of brain growth hormones. An added bonus: it seems to also inhibit tumor growth. While perhaps not a ‘cure-all’ per se, it is an amazingly powerful antioxidant well worth getting to know better.\n\nInterested in packing in as many nutrients as possible into your meals? One no-brainer solution – do it with turmeric! Each sprinkle of this golden powder adds vitamins C, E and K, plus key minerals such as iron, magnesium and zinc and even a little protein and fiber to boot. Turmeric also supports the health of your mitochondria (the power plants inside your cells), so adding it to diet can help your body access more of the energy it needs to function well and keep you feeling powered up.\n\n3. It Tastes Great and Blends Well, While It Cools Inflammation\n\nAdd turmeric to your smoothie (don’t worry, it won’t make it taste like curry), scrambled eggs or soups, stews and, of course, curried veggies or grass-fed meats at dinnertime to boost your intake. Doing so can help cut the risk for metabolic syndrome, insulin resistance, blood pressure problems and obesity – all of which are driven by systemic inflammation. And remember to top your turmeric with a few shakes of black pepper to significantly boost curcumin absorption.\n\n4. It’s a Fighter of Bacteria, Viruses, Free Radicals and More\n\nIn addition to it’s anti-inflammatory effects, turmeric has antiseptic, antifungal, anti-viral, anti-bacterial and anti-tumor properties, so it’s fighting for you on every level. Moreover, it gives free radicals a beat-down by boosting mitochondrial health, reducing the amount of free radicals produced by aging or dying mitochondria. While I encourage patients to add tumeric to their food, for patients over 40, I often also recommend a curcumin supplement, especially if they’ve had a run-in with cancer.\n\n5. It Fights For Your Brain Health\n\nCurcumin has been shown to have positive effects on brain function, memory included, by increasing levels of the brain hormone that boosts neuron growth and fights decay. The curcumin rich diet favored in South Asia may also be a key factor in the region’s relatively low rates of Alzheimer’s compared to the high rate of the disease found in the U.S. Need another reason to dig into a dish of veggie curry? Research indicates that curcumin helps break up the amyloid plaques that form over the course of Alzheimer’s and can prevent them from re-forming, making it a potential game changer in the treatment of the disease.\n\nAs with the brain, curcumin’s anti-inflammatory effects are good news for your cardiovascular system as well, helping improve how well the endothelium, the lining of the blood vessels, functions. With the help of curcumin, the endothelium is better able to regulate blood pressure and support healthy vascular function and circulation, while relieving strain on the heart and reducing stroke risk.\n\nBy Be Well Health Coach Amanda Carney\n• Blend all ingredients in a high speed blender until smooth.\n• Place liquid in a small pot and warm over low heat until hot but not boiling.", "opengraph": {"locale": "en_US", "type": "article", "title": "Supercharged Turmeric Tea Recipe to Absorb As Much Anti-Inflammatory Power as Humanly Possible - Healthy Holistic Living", "description": "Here at Healthy Holistic Living, we search the web for great health content to share with you. This article is shared with permission from our friends at drfranklipman.com. Also known as Golden Milk, turmeric tea is a warm and nourishing drink that helps the body fight inflammation while boosting the immune system.  This bright orange … Supercharged Turmeric Tea Recipe to Absorb As Much Anti-Inflammatory Power as Humanly Possible Read More »", "url": "https://www.healthy-holistic-living.com/supercharged-turmeric-tea/", "site_name": "Healthy Holistic Living", "article:publisher": "https://www.facebook.com/healthyholisticliving/", "article:author": "http://www.drfranklipman.com", "article:published_time": "2016-03-17T20:55:02+00:00", "article:modified_time": "2019-08-01T14:17:24+00:00", "image": "https://www.healthy-holistic-living.com/wp-content/uploads/2016/03/31.jpg", "image:width": "800", "image:height": "419", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.drfranklipman.com/turmeric-tea/", "https://www.healthy-holistic-living.com/healthy-turmeric-tea.html", "https://www.healthy-holistic-living.com/curcumin-outperforms-pharmaceuticals-and-prevents-disease-without-side-effects.html", "https://www.healthy-holistic-living.com/5-ways-jumpstart-mitochondria-anti-aging-juice-recipe.html", "https://www.healthy-holistic-living.com/inflammation-and-death.html", "https://www.bewellbydrfranklipman.com/c3-curcumin-formula.html", "https://www.healthy-holistic-living.com/fasting-mimicking-diet.html", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1937555", "https://www.healthy-holistic-living.com/detox-yoga.html", "http://www.drfranklipman.com/homemade-cashew-milk-recipe/", "http://www.drfranklipman.com/turmeric-tea/", "http://www.drfranklipman.com/6-health-boosting-reasons-to-love-turmeric/", "http://www.cleaneatingveggiegirl.com/wp-content/uploads/2015/03/Turmeric-Milk-9.jpg", "http://cdn.popularpaleo.com/wp-content/uploads/2014/12/Golden-Milk-Latte-Add-the-honey-725x483.jpg"], "authors": ["Dr. Frank Lipman"], "publish_date": "2016-03-17T20:55:02+00:00"}