{"result_id": "155041", "URL": "https://www.savethemales.ca/001894.html", "timestamp": "2023-04-25 15:30:57 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "henrymakow.com", "cleaned_text": "[Note: I think this exaggerates the importance of the Jesuits but I can believe they are a factor. It's always worthwhile to note what David Icke is saying.--Makow]\n\nThe fundamental involvement of the Jesuit Order in world-changing events like the two global wars have rarely been told. Often blame is handed to a Jewish cabal, which does exist as a nexus around the Rothschilds and goes under the name of Zionism. This is an important part of the Illuminati, but not the spider. It is subordinate to the Jesuit hierarchy and the Church of Babylon, now known as the Roman Church. The Jesuit leadership has been quite happy to portray the conspiracy as Jewish-led because it hides where the true string-pullers are. \n\n \n\n Not only was Adam Weishaupt Jesuit educated and controlled, so was Joseph Stalin and many of the key Nazis. Hermann Rauschning, former Nazi head of the Danzig government, revealed in 1939 that Hitler had said: \n\n \n\n 'I learned much from the Order of the Jesuits. Until now there has never been anything more grandiose, on the earth, than the hierarchical organization of the Catholic Church. I transferred much of this organization into my own [Nazi] party. In my Burgs of the Order, we will raise up a youth that will make the world tremble ...' \n\n \n\n Walter Schellenberg, former chief of German counter-espionage, also quoted Hitler as saying: \n\n \n\n 'The S.S. organization has been constituted by Himmler according to the principles of the Jesuit Order. Their regulations and the spiritual exercises prescribed by Ignatius of Loyola were the model Himmler tried to copy exactly. \n\n \n\n 'Himmler's title as supreme chief of the S.S. was to be the equivalent to the Jesuit General and the whole structure and direction was a close imitation of the Catholic Church's hierarchical order.' \n\n \n\n Hitler, Himmler, the Jesuit-trained Goebbels, and most of the major Nazis were Catholics and this is why there was so much cooperation and collaboration between Nazi Germany and the Vatican, as endlessly revealed in the decades since. The Knights of Malta coordinated the escape of the most vicious Nazis and scientists and mind manipulators like Josef Mengele to continue their horrors in the Americas. Many were issued with Knights of Malta passports. Hitler's one-time ally, Benito Mussolini, was also Vatican [in other words Jesuit]-controlled, as you would expect. \n\n \n\n International finance appears to be the fiefdom of Jewish families, but behind them are the Knights of Malta, an arm of the Jesuit Superior General, and I know from my own research over many years that the Knights of Malta are the power behind the global banking system. It is they who control the International Monetary Fund (IMF), for example. An acquaintance of mine called me to say he had been offered a job with the IMF by the Knights of Malta at a meeting in Las Vegas. When he asked how they could possibly make such an offer, he was told that they ran the whole thing and to get the job he would have to join them. He turned them down. \n\n \n\n The Rothschilds, a Jewish family we are told, have the title 'Guardians of the Vatican Treasury' and they ensure the financial wealth and secrets of the Roman Church stay well hidden. F.Tupper Saussy, author of the book, Rulers of Evil, wrote: \n\n \n\n 'Aware that the Rothschilds are an important Jewish family, I looked them up in [the] Encyclopedia Judaica and discovered that they bear the title \"Guardians of the Vatican Treasury\"... The appointment of Rothschild gave the Black Papacy [i.e., the hierarchy of the Jesuit Order] absolute financial privacy and secrecy. Who would ever search a family of orthodox Jews for the key to the wealth of the Roman Catholic Church?' \n\n \n\n And Bill Hughes writes in The Secret Terrorists and The Enemy Unmasked: \n\n \n\n 'The Rothschilds were Jesuits who used their Jewish background as a façade to cover their sinister activities. The Jesuits, working through Rothschild and [financier Nicholas] Biddle, sought to gain control of the banking system of the United States.' \n\n \n\n There are Jesuit plants throughout politics, finance, commerce, media and military, among them Bill Clinton, who attended the Jesuit Georgetown University, the dictator, Fidel Castro, the mass murderer Robert Mugabe, and the horrific Simon Peres, the former leader of Israel. Knights of Malta have included Ronald Reagan, Gerald Ford, former Secretary of State Alexander Haig, and Prescott Bush Jr., brother of father George Bush. \n\n \n\n Bill Clinton as a boy meets President Kennedy - the future of the Jesuit-educated, Jesuit-controlled, Clinton was planned a long time ago. That's why he was given a Rhodes Scholarship to Oxford University after attending the Jesuit Georgetown. \n\n \n\n The global intelligence community is awash with them, too, with the Knights of Malta once again the prime coordinator. During the Second World War while Hitler, Stalin and Mussolini were being controlled by the Jesuit-Vatican network, so were the intelligence agencies of the United States, Germany and the Soviet Union. Their operatives included William Donovan, head of the CIA predecessor, the OSS; General Reinhard Gehlen with German Intelligence who joined the CIA after the war; and Prince Anton Turkul with Soviet Intelligence. Turkul used Jesuits as couriers. \n\n \n\n Nazi General and war criminal, Reinhard Gehlen, Hitler's head of intelligence for the Eastern Front, was given the highest honour of the Knights of Malta, the 'Grand Cross of Merit', for services rendered. \n\n \n\n Allen Dulles, first civilian head of the CIA, a Knight of Malta involved in the Kennedy assassination who was then appointed to the Warren Commission to 'investigate' how the president died \n\n \n\n Many heads of the CIA have been Knights of Malta including the first director, Allen Dulles, and George Tenet, director before and during 9/11 and the invasion of Iraq. The infamous James Jesus Angleton, a major CIA operative involved in the Kennedy assassination, was a Knight of Malta, therefore controlled by the Jesuits. He largely grew up in Rome and became the head of both the Israel and Vatican 'desks' at the CIA, chief of counterintelligence and its 'liaison' with the Warren Commission that covered up the Kennedy murder. FBI chief, J. Edgar Hoover, and Clay Shaw, a CIA agent and the only man to be brought to trial for the assassination, were Knights of Malta. So was Kim Philby, the British Intelligence agent turned Soviet spy, a man close to the Rothschilds and a friend of Angleton. \n\n \n\n My recent trip to Rome has provided a lot of new leads and areas of research and the more I uncover and understand the clearer becomes the involvement of the Vatican and its associated secret societies like the Jesuits, Opus Dei, the Knights of Malta and the Knights Templar. \n\n \n\n All roads lead to Rome, they say - and they do.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/001894.html", "description": "[Note: I think this exaggerates the importance of the Jesuits but I can believe they are a factor. It's always worthwhile to note what David Icke is saying.--Makow]  The fundamental involvement of the Jesuit Order in world-changing events like the two global wars have rarely been told. Often blame is"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}