{"result_id": "155020", "URL": "https://www.savethemales.ca/2014/09/Israel-Missing-from-ISIS-Fight%20.html", "timestamp": "2023-04-25 15:30:41 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Why is Israel Absent from ISIS Fight?", "cleaned_text": "Why do we suspect that\n\nto ISIS is for show only?\n\nIsrael is the strongest military power in the region. But apparently it bears no responsibility to help contain this \"threat.\"\n\nHow serious could Obama (or Israel) be about combating the Islamic Caliphate?\n\nHowever, don't count Israel completely out. Netanyahu will contribute large quantities of hot air:\n\nThe Likud leader stressed that all terror groups \"present a clear and present danger to the peace and security of the world and to our common civilization\" and that if \"they gain ground somewhere, they gain ground everywhere.\"\n\n Fighting these groups \"requires weapons, defensive and offensive, but above all it requires - I believe - clarity and courage. Clarity to understand they're wrong and we're right. They're evil and we're good. No moral relativism there, at all,\" insisted Netanyahu. Apparently things haven't always been so black and white. \n\n\n\nNetanyahu showed us his true colors last June, after ISIS captured Mosul.\n\nHe said that \"In the Qur'an, Allah ordered us not to fight Israel or the Jews.\" In response to Israel's \"Operation Protective Edge,\" ISIS said that they were simply too busy killing fellow Muslims to bother with a war on Jewish people. \"The greatest answer to this question is the Qur'an, where Allah speaks about the nearby enemy-those Muslims who have become infidels-as they are more dangerous than those which were already infidels,\" explained an ISIS spokesman. \n\n\n\nThe question remains, just how serious is Obama about stopping ISIS, a group Israel, the US and Saudi Arabia started in the first place?\n\nWhat is the Illuminati's hidden agenda? Terror attacks on America by ISIS? Albert Pike's World War Three pitting \"Islam\" against the Zionist West, minus Israel, who shall be protected\n\nLet's not overlook a bit of news that media mostly suppressed. August 26th UK Guardian: \n\n\n\nSyria offers to help fight Isis but warns against unilateral air strikes\n\nhttp://www.theguardian.com/ \n\n\n\n Walid al-Moallem, the Syrian foreign minister, said his government was ready \"to co-operate and co-ordinate\" with any side, including the US, or join any regional or international alliance against Isis. But he said any military action inside Syria should be coordinated with the Syrian government. \"Any strike which is not co-ordinated with the government will be considered as aggression,\" he said. \n\n\n\n Sound reasonable? Obviously \"ISIS\" is Assad's enemy. Our State Department and politicians have condemned Assad for fighting them as a 'Tyrant'. \n\n This announcement followed the \"Dictators\" recent re-election by Syrian voters, August 25th.\n\n\n\n I live in one of the largest American cities, and 'international' city - absolutely everybody is here. This is where I keep my finger on the pulse of American public perception. Yet NOT ONE person I've asked has heard of either of these news items. \n\n\n\n The Administration never publicly responded to the Syrian government's rational offer to co-operate with the US and NATO insofar as breaking up ISIS. \n\n\n\n Exactly one year ago, Sept. 11 anniversary week, or officially \"Patriot (act) Day\", Obama withdrew his demand for Congressional approval to bomb Syria. \n\n The web of lies had gotten a bit crossed when Media was reporting we were backing 'the rebels', who turned out to be the same 'Al Queda' (now ISIS) the sheeple thought we were fighting. They blew their cover. Worse, they were already massacring the indigenous Syrian Christians who lived there unmolested since the first century. \n\n\n\n The Administration is so Christian-hating that they seemed to believe their own propaganda that 'this is not a Christian nation'. They thought they had all the Churchians under televised hypnosis, but people noticed. More importantly, military combat CO's noticed and might have mutinied if they'd been ordered to fight FOR Al Queda and blow up Christians. \n\n\n\n The Administration lost that round. During the months of October and November all the presidents and prime ministers flew to meet with Netanyahu or vice versa to 'huddle' and get the new play. Including Putin. \n\n\n\n I can only conclude that the same scenario that former Gen. Wesley Clark explained in this clip. \n\n\n\nWars Were Planned - Seven Countries In Five Years \n\n\n\n Everything that's happened since 911 was due to a plan to 'take out' Iraq, Syria, Egypt, Libya and IRAN. It's not ALL about Israel. Zionists have a big stake it but the plan is a combine of the powerful ancient mafias behind Globalism. \n\n\n\n Israel is hardly 'missing' from the war on Syria. They've already carried out missile attacks on strategic targets in Syria for years. Four days ago the IAF stepped up sorties on the Syrian border. http://www.algemeiner.com/ \n\n\n\n Keep in mind Israel seemed 'missing' from the 2002 Baghdad Blitzkrieg and Iraqi occupation too. They won't squander their US supplied jets and missiles so long as the US is willing to assume the high costs of war in budget deficits and lives. \n\n\n\n\n\n\n\nThursday morning, NBC rebroadcast their live Today Show coverage of the events of 9/11/01. Video, such as is posted on your site is always debunked as having been \"altered.\" But, this morning, they showed the \"real\" events. Or at least the \"real\" events as they were presented that fateful day. Being able to watch the shots of the plane entering and exiting the tower on a modern HD plasma screen leaves little doubt that \"nose in/nose out\" is exactly what was shown.\n\nI recorded it with a modern DVR and have replayed it multiple times. I made the mistake of posting an observation of that on Dailykos. I have been suspended from that site for three days because they do not allow anyone to question the \"established facts\" of that day.\n\n\n\n Given that we are about to be dragged into yet another war which can be directly traced to 9/11, somehow the American public needs to become aware of what really happened. Otherwise intelligent people act exactly like those who deny the reality of climate change because they simply do not want to recognize THE TRUTH. It isn't pretty, but it is still the reality of that event.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/2014/09/Israel-Missing-from-ISIS-Fight .html", "title": "Why is Israel Absent from ISIS Fight?", "description": "(left, Netanyahu waxes eloquent Thursday)Why do we suspect thatIsrael's opposition to ISIS is for show only?by Henry Makow Ph.DWhat's wrong with this picture?  Israel gets $3 billion a year in military aid from the US. Over the last 60 years, the Jewish state has received about $250 billion worth of airplanes"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.huffingtonpost.com/chase-madar/israel-military-aid_b_4759159.html", "http://www.israelnationalnews.com/News/News.aspx/184994#.VBHyq_ldXE4", "http://www.ynetnews.com/articles/0,7340,L-4570128,00.html", "http://www.globalresearch.ca/isis-leader-abu-bakr-al-baghdadi-trained-by-israeli-mossad-nsa-documents-reveal/5391593", "http://rehmat1.com/2014/06/30/netanyahu-isis-is-good-for-israel/", "http://www.breitbart.com/Big-Peace/2014/07/09/Islamic-State-Not-Interested-In-Fighting-Israel-At-This-Time", "https://henrymakow.com/2014/08/ISIS-are-Sunni-Impostors%20.html", "http://thecable.foreignpolicy.com/posts/2014/06/11/why_israel_is_tending_to_the_syrian_rebels_wounded", "http://time.com/3319658/obama-isis-speech-iraq-syria/", "http://www.secretsofthefed.com/arent-isis-al-qaeda-attacking-israel/", "http://www.youtube.com/watch?v=K5nigZzgf4Y", "http://www.activistpost.com/2014/09/10-signs-that-isis-is-scripted-psyop.html", "http://m.bbc.com/news/world-middle-east-29154481", "http://www.theguardian.com/world/2014/aug/26/syria-offers-to-help-fight-isis-but-warns-against-unilateral-air-strikes", "http://www.theguardian.com/world/2014/aug/26/syria-offers-to-help-fight-isis-but-warns-against-unilateral-air-strikes", "http://www.youtube.com/watch?v=9RC1Mepk_Sw", "http://www.algemeiner.com/2014/09/07/iaf-bolsters-sorties-along-syrian-border-any-spillover-will-cost-them-dearly/"], "authors": [], "publish_date": null}