{"result_id": "155023", "URL": "https://www.savethemales.ca/brazil_also_in_illuminati_camp.html", "timestamp": "2023-04-25 15:30:44 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Brazil Firmly in Illuminati Grip", "cleaned_text": "When the former Bishop, communist president of Paraguay was caught in a scandal with a bastard child, his popularity dropped. His answer was to ask for an outrageous substantial increase in the amount paid from Brazil for the use of Itaipu. (Paraguay uses only 10%).\n\nin(Exclusive)s as bad as in Russia.[President] Lula [da Silva] is part of a communist party that is taking Brazil into the arms of the New World Order.The Workers Party is a member of the Forum de Sao Paulo, an association of Communist groups including terrorist organizations such as the FARC in Colombia. The main goal of the Forum is to develop the Marxist revolution in South America, in what is called the Bolivarian Movement, for Simon Bolivar, the historical figure who wanted an unified Hispanic South America. The main inspiration is Fidel Castro. The Communists have already taken over most universities, newspapers and media, following the teachings of Gramsci and Marcuse. There is a wave of political correctness, gay rights and all kinds of leftist agenda points.Lula has betrayed his own country several times: he has given away much of Itaipu (see note below) to Communist-led Paraguay; he has pardoned debts from Bolivia; he has given much aid to Venezuela. He also created a huge Indian reservation on the border with Venezuela, a no-man's land that is open to any kind of incursion and is a threat to Brazilian sovereignty, since it spreads into Venezuela. It is another supranational country.The narco-terrorists from FARC have free access to Brazil, and have been dumping drugs and heavy guns to the drug dealers, especially in Rio. 50,000 Brazilians are killed every year in drug-related violence, but Lula doesn't touch the drug dealers because of the (not so) secret agreements with the FARC. Lula's government is also terribly corrupt, not at the levels of previous governments, but now in billions of dollars.Queen Elizabeth and the Duke of York have just awarded Lula the Chatham House Award for bringing peace to the continent ! Yes, the man supports drug dealers, terrorists, a Marxist revolution in the continent and is regarded as a man of peace !!!Chatham House is a know Illuminati Think Tank. Lula is now the official court's jester.Lula also will take to Copenhagen the boldest proposal for CO2 reduction in the world: 40% until 2020. There was absolutely no debate about it. Nobody even knows here that hundreds of scientists are against Al Gore's lies. This policy will kill our economy. Sao Paulo state already approved a law to reduce 20% of CO2 emissions.I firmly believe Lula has been bought by the NWO. The Illuminates probably told Lula that Brazil will now be regarded as a top country. They gave Brazil the Olympics and the World Cup. This is crazy, considering the level of violence in Rio. They will probably include Brazil in the G10, where Lula will look very important to the fools here, while he does everything he is supposed to do.One has to understand that Brazil has a very deep inferiority complex. Being among the great countries will look like a victory, even though those countries will be under the thumb of the Illuminates. The game is over here: there is no real opposition and the main competitor for the next election, Jose Serra, is also a leftist.---One of the largest dams in the world. It is on the border and Brazil paid for everything.Against all reasoning, Lula agreed and made the Paraguayan look like a communist hero, a David who smashed the Brazilian Goliath.------", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/brazil_also_in_illuminati_camp.html", "title": "Brazil Firmly in Illuminati Grip", "description": "by Marcos in San Paolo (Exclusive)The situation in Brazil is as bad as in Russia.[President] Lula [da Silva] is part of a communist party that is taking Brazil into the arms of the New World Order.The Workers Party is a member of the Forum de Sao Paulo, an association of"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.chathamhouse.org.uk/events/special_events/chatham_house_prize/2009/", "http://www.olavodecarvalho.org/english", "http://lastdayswatchman.blogspot.com/2009/02/study-in-brazilian-newspaper-o-globo-99.html"], "authors": [], "publish_date": null}