{"result_id": "155026", "URL": "http://www.savethemales.ca/hitler_was_a_godsend_for_israe.html", "timestamp": "2023-04-25 15:30:46 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Hitler Was a Godsend to Israel", "cleaned_text": "tell the story. In 1927, about 15,000 of Germany's 550,000 Jews considered themselves Zionists. That's less than 2%.\n\nThe vast majority of German Jews \"vehemently rejected Zionism as an enemy from within.\" They were Germans. Eighty thousand had fought in the trenches and 12,000 had died. \"Nowhere was the opposition of Jews [to Zionism] so widespread, principled, and fierce as in Germany,\" a Zionist historian wrote. (168)\n\nThanks to Hitler, 60,000 German Jews emigrated to Israel between 1933 and 1941. Thanks to a \"Transfer Agreement\" between Nazis and Zionists, Jewish property valued at $100 million was transferred to Israel in the form of German industrial exports used to build Israel's infrastructure. The Transfer Agreement brought in tools, raw materials, heavy machinery, appliances, farm equipment as well as labor, and capital to finance expansion. Many of Israel's major industries, like textiles and the national waterworks, were thus founded. (pp. 373,379.) Thanks to Hitler, 60,000 German Jews emigrated to Israel between 1933 and 1941. Thanks to a \"Transfer Agreement\" between Nazis and Zionists, Jewish property valued at $100 million was transferred to Israel in the form of German industrial exports used to build Israel's infrastructure. The Transfer Agreement brought in tools, raw materials, heavy machinery, appliances, farm equipment as well as labor, and capital to finance expansion. Many of Israel's major industries, like textiles and the national waterworks, were thus founded. (pp. 373,379.)\n\nThis at a time when there were only 200,000 Jews in Palestine, including many anti- Zionist religious Jews. The daily wage of a Jewish worker in Palestine was $1 a day. There were 800,000 Palestinian Arabs.\n\nThanks to Hitler, the kernel of the German Jewish community was lifted up and transferred to Palestine along with their property. \"Many of these people were allowed to transfer actual replicas of their homes and factories --indeed rough replicas of their very existences.\" (379)\n\nIn 1937, when the British proposed dividing Palestine into two states, the Nazis wondered if they hadn't made a mistake by creating \"a Jewish Vatican\" dedicated to Germany's demise. But Hitler overruled all dissenters and insisted the Transfer Agreement be continued and even expanded to other countries. Italy, Rumania, Hungary and several other countries under fascist influence signed similar agreements. (378)\n\nHitler hated Jews so much he built a country for them. He could have taken all their property and kicked them out but that would have been anti-Semitic.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/hitler_was_a_godsend_for_israe.html", "title": "Hitler Was a Godsend to Israel", "description": " Truth is "}, "tags": [], "tweets": [], "movies": [], "links": ["http://northshorenumismaticsociety.org/little-known-medal-marks-nazi-zionist-co-operation-in-1933/"], "authors": [], "publish_date": null}