{"result_id": "155029", "URL": "https://www.savethemales.ca/is_the_truth_movement_false_op.html", "timestamp": "2023-04-25 15:30:48 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Slaughter of the Lambs: Is the Truth Movement Controlled Opposition?", "cleaned_text": "When Communists stole the 2020 election, the Supreme Court anointed their crime. And we're supposed to believe in the electoral process? If anything, recent events have revealed that most politicians, CEO's and professionals serve the same master, and regard the people as prey. They are traitors. (Globalists)\n\nA \"virus\" with no symptoms? (Or some suspiciously like the common flu. )\n\nWe fell for this shite?\n\nA pandemic with a microscopic death rate? Hello! This is not a pandemic. It's a psy op, a simulation, a live drill designed to impose undemocratic political change.\n\nYet they line up to be injected with untried DNA-altering serum, masquerading as a \"vaccine\" doled out by Satanists and eugenicists? Simple cheap treatments are suppressed so untested, unapproved \"vaccines\" can get \"emergency authorization.\"\n\nWhen I googled \"Patriot movement, false opposition,\" I got this 2011 article from my own site. JB wrote: \"The movement was permitted - planned - because they knew ... that the vast majority of humans are totally unconcerned about matters of principle - only direct [personal] threats can rouse them. And then they can easily be diverted. Waking the Sheep was never a possibility.\" Who is false opposition today? Let's compile a list. The of \"hopium\" like Q? Trump for sure. Red State governors? Steve Bannon? Whom else? hmakow@gmail.com Disclaimer- Despite being an ethnic Jew, I am not false opposition. As an assimilated Jew, I put my country's interests & humanity first. God is Truth. Truth is my religion. My books are all self-published; I get zero MSM attention. BIG FIND! Thanks to Jim Fetzer for featuring \"Asha Logos.\" Asha is \"a philosopher, social commentator, historian and defender of Western Culture all wrapped into one.\" This 1.12 min. video, \"A Call for Culture Creators\" is not to be missed. Finally, a credible vision of the way forward. Asha says that trying to prevent the crash of Western Civilization is playing a game of whac-a-mole that is poisoning our spirit. Western society is too corrupt to save, and that also applies to its acolytes. It is beyond repair. Do you agree? Instead, he says we should devote our energies to creating a new culture which affirms our values. He talks about false opposition too. Asha has the best \"big picture\" understanding of our predicament that I have heard. Going forward I will try to promote a new culture based on discerning God's Plan. But, at the same time, I don't think we have any choice but to resist our own genocide. \n\n \n\n The entire truth movement is false opposition. \n\n\n\nTo suppose that the Elite did not anticipate the truth movement is to suppose that they had no plan for this demographic, and stand helpless and slack-jawed while the movement undermines their plans...\n\n\n\nThe movement was permitted - planned - because they knew ... that the vast majority of humans are totally unconcerned about matters of principle - only direct threats can rouse them.\n\n\n\nAnd then they can easily be diverted. Waking the Sheep was never a possibility. A video I recommend is Aldous Huxley's Gatekeepers of the 20%. \n\n\n\nAnd if you would like to see Alex Jones totally expose himself as a shill, then watch this. \n\n\n\nAnd it amazes me that 911 truthers cheer for Jesse Ventura disclosures and yet fail to note that Time Warner pays for his show, or that mainstream media is sounding the alarm over the new world order.\n\n\n\n (Paul in Masonic handshake) Or that Ron Paul makes satanic hand signs or that his wife and daughters are in free-masonic organizations. And Rand Paul showed his colors by pushing for austerity on the poor and helpless. \n\n\n\nSome patriot! The banks rape us and now it's time to trim the fat and kill the poor - many of whom are the most sensitive individuals in the society who don't happen to be well adjusted to slavery. Go figure. \n\n\n\nThere is a reason that mainstream media is spreading the word about the new world order. There is a reason that men like Gerald Celente and Peter Schiff are invited again and again and again onto major networks.\n\n\n\nI gotta hand it to the dark ones. They are way more clever than so called people of truth who more times than not settle for idol worship over painful reality. \n\n\n\nIt's said by some that man is about to be wiped out. Perhaps its for the best because as things stand, our descendants will live in a hell world that will make Mad Max look like sweet freedom.\n\n\n\nHAVE WE BEEN DUPED?\n\n\n\nI am not provocative for personal reasons or to divide. Rather it seems that the best and the brightest in society have been duped by a ruthless enemy of greater cunning and intelligence than is generally suspected and the movement needs a wake-up call. \n\n\n\nThe Illuminati are not bumbling fools who act without intelligent planning. A one world government that was widely despised would not have staying power in the long run. \n\n\n\nA permanent scientific dictatorship would need to be something the people were manipulated to ask for. Hence, the concept of the straw-man bankster police state. It can't escape your notice that the mainstream media has been sounding the alarm over the New World Order for some time now. \n\n\n\n (l. Rush Limbaugh) MSNBC even suggested recently that perhaps the time for violent revolt had come. Persons on Fox, MSNBC, CNN, etc, have made the NWO nearly a household word at this point -(Dobbs, Judge Napolitano, Beck, etc.) \n\n\n\nAnd other less prominent figures including guests who espouse 911 conspiracy theories such as Kevin Barrett, etc. And while the hosts may mock them, the fact is that they are invited back repeatedly and often come off as very credible - that is, in the minds of those who look beyond ad-hominem attacks.\n\n\n\nThis gets to the concept that society breaks down into 2 groups (for purposes of this matter) - 1) a minority that can be roused to anger over a matter of principle & can process information and 2) the herd. To the herd, appearance is everything. To them, simply being mocked by O'Reilly, or whomever they are followers of, is enough to dismiss the matter. So I suggest that the media has engaged in a targeted disclosure of 911 as well as the New World Order. The scope of that disclosure is now being widened for reasons too complex to cover here.\n\n\n\nI don't assert or believe that the reason for the Elite's sponsoring 911 Truth was to simply ensnare its adherents for Fema camps (They are not a true threat.) But rather to create a sort of psychic battery - a potential store of energy for change - for the destruction of the current order. The dynamics of it are somewhat complex and I don't want this message to be too long. Suffice to say that that energy for change can easily be diverted to a close similar vector when the time comes - when the general public is hungry and desperate and combined disasters shake the foundations of the world. From the ashes can rise a \"true brotherhood\" of mankind. The seeds for which may be being planted by the likes of Zeitgeist/Venus project, and Michio Kaku's claims that we need to grow into a Type 1 Society - notice he says that anyone who opposes it is a terrorist.\n\n\n\n ILLUMINATI CARD GAME One small hint that the Truth Movement was not only foreseen but planned can be found in an obscure piece of evidence. Google image search \"Gordo Remora\" - the Illuminati game card from 1995 spoofs Geraldo Rivera suggesting that conspiracy theorists should be killed. There have long been conspiracy theorists but it was not until 911 that the issues became so hotly charged and divisive that media persons began openly suggesting that they should be tortured or worse. It just so happens to work out that Geraldo ends up being a central figure in this conflict - several times he has tangled with the truthers and now has been selected as the one to begin to reveal WTC7 truth.\n\n\n\n\n\n----\n\n\n\nRelated- Manufacturing Dissent by Michel Chossudovsky\n\n\n\nCriticism of \"We are Change\" Group", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/is_the_truth_movement_false_op.html", "title": "Slaughter of the Lambs: Is the Truth Movement Controlled Opposition? ", "description": "The most frustrating thing about the rigged election & covid scam is the lack of effective resistance. Apart from whinging on the Internet, Americans seem determined to bend over and take it up the ass. This is not what you'd expect from a fully-armed population. I can't think of one"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.henrymakow.com/2017/11/History-of-Zionist-Subversion.html?_ga=2.88063322.319600760.1622905010-903648786.1588285733", "https://www.henrymakow.com/2017/07/protocols-5-11.html", "https://vaccineimpact.com/2021/wolves-in-sheep-clothing-republican-governors-are-pro-bioweapon-injections-despite-opposing-covid-19-vaccine-passports/", "https://www.mintpressnews.com/steve-bannon-israel-first-america-second/224726/", "https://www.bitchute.com/video/wrxmNvd6Avik/", "https://henrymakow.com/2021/06/Biden%20Admin-is-Proxy-for-Jewish-Supremacism.html?_ga=2.53924842.319600760.1622905010-903648786.1588285733", "https://canucklaw.ca/a-guide-for-spotting-controlled-opposition-among-lockdown-critics-my-take/", "http://www.youtube.com/watch?v=Xcah3OjLTYQ", "http://www.youtube.com/watch?v=ntXlgYnJ_xc", "http://www.globalresearch.ca/index.php?context=va&aid=21110", "http://letsrollforums.com/we-change-exposed-t24621.html?s=a4c74a0283e5d88bac1151bff656dd89&amp;s=80ff9937ea3075ed4af963fc10e58c5b&t=24621"], "authors": [], "publish_date": null}