{"result_id": "155039", "URL": "https://www.savethemales.ca/", "timestamp": "2023-04-25 15:30:55 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "henrymakow.com - Exposing Feminism and The New World Order", "cleaned_text": "Below - April 24 - Cabalism is the Elephant in the Room (scroll down) There's Nothing Chic About Satanism The \"woke\" promotion of vaccines, Ukraine, homosexuality, transvestism, CRT, \"climate change\" has nothing to do with human rights, or it would not trample on the human rights of healthy people. It is a flimsy pretext for the destruction of Christian Western civilization, depopulation and the imposition of a Communist New World Order dedicated to serving Satan.\n\n Satanism is war against God, i.e. the Moral and Natural Order. It negates and unravels both. It shreds the social fabric. eligion discerns & obeys God's Will. Satanism is an anti-religion. It is anti-life. Its god is Death. It is the religion of Death and Destruction. If you deny the Creator's Design and Purpose, you are a Satanist. he only way mankind will make our is for us all to serve Him by living morally and doing His work, as we see it. Raising healthy children is an example. \n\n Revelation 12:9 \"....that old serpent, called the Devil, and Satan, which deceiveth the world.\" \n\n \"When we introduced into the State organism the poison of liberalism its whole political complexion underwent a change. States have been seized with a mortal illness--blood poisoning. All that remains is to await the end of their death agony.\" (Protocols of Zion, 9) \"In order that the true meaning of things may not strike the goyim before the proper time, we shall mask it under the alleged ardent desire to serve the working classes...\" (Protocols of Zion, 6) \n\n A millennia-old satanic conspiracy is reaching climax. If it is not arrested, mankind will enter a new Dark Age. \n\n \"But he that sinneth against Me wrongeth his own soul: all they that hate Me love death.\" Proverbs 8:36 1. They call themselves \"progressives.\" Satanists invert everything. They champion everything sick and dysfunctional. They are actually \"regressive.\" Despite their moral pretensions, \"progress\" for them is the degradation and destruction of their fellow man. God is Perfection in all things. They invert all things: Sickness is health; ugly is beautiful, false is true, injustice is justice, hate is love, misery is bliss , and vice versa. 2. Man is connected to God through his soul. Take away God and man flounders about like a fish out of water. Looking to fill the void, he idealizes anything because his God connection has been severed. Take away God, and man will create false Gods, Carl Jung said. See the absurd idealization of women, sex and romance ; literature and art; \"great men,\" politicians, celebrities, etc. Because of his hunger for God, you can sell him anything as a substitute. He imagines he's getting God. 3. We were programmed by God. True religion simply is following the program. God is the program. Satanists are trying to deprogram us. (For example, we are being forced to unlearn heterosexuality.) Why? they want it all. Like the COVID hoax and vaccinations, cancel culture is about cancelling us. Depopulation. Money and power as usual. One percent has over 50% of the wealth andLike the COVID hoax and vaccinations, cancel culture is about cancelling us.Depopulation. \n\n 4. Although we've been brainwashed to deny God, we're actually in love with God, the freedom and bliss our souls crave. God is Reality. The Only Reality. The God of Satanism is Death. 5. We are witnessing a cosmic struggle between Good and Evil, and I regret to say Evil is in charge and close to victory. Satanists (Freemasons) control both the \"progressive\" and There are no \"nationalists\" who are not also Zionists and defenders of the rich. 6. Cabalists (Satanists) believe perception is reality. Thus they seize control of education and the media. Naturally, t hey deny the existence of objective reality and objective truth (so they can substitute their own.) Denial of objective truth is the denial of God. God is Reality. \n\n \n\n 7. Man is sleepwalking to catastrophe. Satanists are setting the stage for a catastrophic third world war which will pit the US and UK , the EU (and Israel?) against the USSR, and possibly China, Iran. Everything \"American\" is already under attack. The plan already is plain to see. As far as humans are concerned, God is Consciousness. God is a Moral Dimension, the Fourth Dimension, where Truth, Justice, Beauty, and Love are self-evident We are programmed to enter into the Light. Satanists lead us into Darkness. \"We corrupt in order to control,\" said. Satanism is low or no Consciousness. said. Satanism is low or no 9. Satanists control the world central bank cartel. They have us by the short hairs. They create our \"money\" out of thin air. It is just digits on their Ledger which they can erase at any time. They' to control everything, including thought, culture, religion, and your . Banks are actively promoting homosexuality and white displacement yet we trust them with our \"money\"? 10. We're being inducted into Cabalism at the lowest level. Satanic cults exploit and control their members by making them sick, corrupt, and perverted. Sick as in gender dysphoria, sex addiction, promiscuity, pornography, pedophilia, incest, \"vaccines,\" endless war... They have undermined the most wonderful and essential thing in life, the love between man and woman, and parents and children. The nuclear family is the red blood cell of society. These fiends are determined to kill it. I'm 73 and will only be around for another decade or two. But I shudder to think of what is in store for humanity. It's time to recognize our dire predicament. A fatal cancer infects all social institutions. It must be recognized and addressed. Will Western Civilization go to its grave due to our fecklessness, cowardice and naivety? Related - Retailer promotes assisted suicide in new ad campaign - suicide chic\n\n -------------We are Mental Prisoners of a Satanic Death Cult ------------- Cabala- How Sex Became Our Religion (Explains why Cabala is Satanism) First Comment from James C I allow myself one football game a year, the so-called \"Super Bowl.\" This is why I thought that a comment in your latest article is very perceptive: \"Banks are actively promoting homosexuality and white displacement ....\" Both homosexuality and white displacement were egregiously conspicuous in the latest Super Bowl commercials and half time show. Homosexuality, white displacement, and miscegenation are also increasingly apparent in commercials in general. Banks and corporations also seem to be in the process of pushing black ethnocentrism in their commercials, along with a growing presence of Chinese. Are they trying to tell us something? Or merely conditioning us for the inevitable? \n\n You can find this article permanently at Comments for \"There's Nothing Chic About Satanism \" You can find this article permanently at https://henrymakow.com/2023/04/satanism-explained.html\n\nBelow- Hiroshima- Radiation Sickness Was Mustard Gas Poisoning (sceroll down) April 24- The Elephant in the Room is Cabalism Please send links and comment to hmakow@gmail.com He is going to be bigger than ever! You won't get a platform if you reveal the truth. Why legacy media is headed for the dumpster. I love these conservatives. But I notice there are some words they never utter: Globalism, Illuminati. Cabalism. Satanism. Communism. Freemasonry. Rothschilds. Soros. Central bank cartel. WEF. Agenda 2030. Klaws Swab. Joos. Organized Jewry. Essentially mankind is being held hostage by a satanic cult, Cabalist Judaism or Illuminism. Our feckless ancesters gave our national credit cards to members of this cult whose goal is to destroy, dispossess and enslave the goyim. The fake pandemic, masks, lockdowns, toxic gene therapy, CRT. Migration. Ukraine. BLM. Trannies in women's sports and washrooms. Gender bending our children. All of these are malevolent strategems of this cult. Our political leaders are Klaws Swab's rentboys. Biden's Admin is Jewish. Trump is a crypto Jew. Big Pharma and the CDC are run by Jews. We will never be free unless we name the enemy. These Conservatives aren't stupid. But they would be banished if they identified the problem at its source. Camille Paglia: 'Universities Are an Absolute Wreck Right Now'\n\n \n\n https://www.youtube.com/watch?v=B553na_skKI&t=339s\n\n --\n\n \n\n \n\n (Nahum Goldman, founder of the World Jewish Congress) Bud Light Admit FULL PANIC MODE As Sales HALT Amid Boycott.. An Absolute DISASTER For Anheuser Busch \n\n https://www.youtube.com/watch?v=A6DiA4CkQXE\n\n \n\n --\n\n \n\n BIPARTISAN TREASON: Obama, Clinton, and Bush partner with American Express to fly illegal aliens into American communities\n\n \n\n https://www.naturalnews.com/2023-04-23-obama-clinton-bush-american-express-fly-illegals-american-communities.html\n\n \n\n With the help of open borders organizations such as Miles4Migrants and American Express Global Business Travel, Soros et al. are funding even more flights for migrants from Cuba, Haiti, Venezuela, Nicaragua, and Ukraine, who will also be dumped in your local community in seemingly endless numbers.\n\n \n\n -\n\n \n\n Goyim have been trained to pander to Jewish sensitivities Diane Abbott Suspended From Labour Party Following Remarks On Jewish Racism\n\n \n\n \n\n \n\n Diane Abbott has been suspended as a Labour MP after suggesting Jewish people are not subject to racism “all their lives.”\n\n \n\n https://www.zerohedge.com/political/diane-abbott-suspended-labour-party-following-remarks-jewish-racism\n\n \n\n -\n\n Bud Light Gets REKT by Non-Woke Corporation’s Ad About Girls’ Sports\n\n \n\n https://www.youtube.com/watch?v=WPa825gcKOg&t=99s\n\n \n\n -\n\n \n\n Must hear\n\n \n\n William Guy Carr - The Pawns in the Game Speech (accurate forewarning from 1950's)\n\n \n\n https://www.youtube.com/watch?v=ScnW6Rv5nrg\n\n \n\n Nicole- \"n this time of the \"truther movement\" its come abundantly clear. That dead men don't lie. This man, along with others like William Cooper, Gary Webb, brietbart, larry Mcdonald, Larry campo Nancy Schaefer the list is long, attest to that. Sadly t h e ones that are on target; are not here long. Real truthers never and I mean never find fame and fortune in this world. Joe Rogan? Alex Jones? Gate keepers.\"\"\n\n \n\n -\n\n \n\n Pfizer killed your Friends & Family for Profit – 92% of COVID Deaths were among the Triple+ Vaccinated in 2022 according to UK Gov.\n\n \n\n https://expose-news.com/2023/04/23/pfizer-killed-your-friends-family-for-profit/\n\n - New US digitial identity to usher in Chinese social credit? \n\n You can find this article permanently at Comments for \"April 24- The Elephant in the Room is Cabalism\" You can find this article permanently at https://henrymakow.com/2023/04/april-24--the-elephant-in-the-.html\n\nBelow- April 23- Catherine Austin Fitts- We're at a Tipping Point (swcroll down) that was perceived by many during and after the bombings was none This begs the question - Are nuclear bombs another hoax? What's in those missile silos? Bales of hay? (henerymakow.com)\n\n \n\n In previous posts here on Henry’s website [1,2] and elsewhere [3,4], I have argued that no atomic bombs were dropped on Hiroshima and Nagasaki. However, there are numerous reports of radiation sickness from both cities. A recent post here [5] presented some of the eyewitness testimony suggesting that the “radiation sickness” was caused not by radiation but rather by mustard gas. Here, we will look at some of the objective evidence—as well as some further relevant eyewitness testimony—that supports the use of mustard gas in Hiroshima and Nagasaki.\n\n \n\n 1. Acute lung damage and respiratory distress\n\n While mustard gas has radiation-like effects on the bone marrow, the hair follicles, and other sensitive tissues, there nevertheless are telling differences between the two. Inhalation of mustard gas will cause acute and severe lung damage. In contrast, in those exposed to rapidly fatal radiation doses, it is the brain, not the lung, which shuts down first [6, p. 218]:\n\n \n\n \"In a nuclear criticality accident at Los Alamos in 1958, one worker received a total body dose … between 39 and 49 Gray. … This person went into a state of shock immediately and was unconscious within a few minutes … The patient died 35 hours after the accident.\"\n\n \n\n In contrast, many early victims at Hiroshima and Nagasaki suffered the most intense respiratory distress. An eyewitness from Hiroshima, Mr. Hashimoto, recounts from the day of the bombing [7]:\n\n \n\n \"When I reached the Misasa railway bridge … I encountered a dead man. I saw many others in the water tanks fighting for breath. The sight was horrible.\"\n\n \n\n Mr. Hashimoto also describes the aftermath:\n\n \n\n \"During those days, wherever you went, there were so many dead lying around it was impossible to walk without encountering them—swollen, discolored bodies with froth oozing from their noses and mouths.\"\n\n \n\n The \"oozing froth\" noted by the astute Mr. Hashimoto is an indication of toxic lung edema, which is also known from cases of unprotected exposure to mustard gas [8]. Other effects seen in early fatalities are lung emphysema, i.e. excessively inflated lung tissue, together with atelectasis, i.e. compressed or deflated lung tissue (see Figure 1). The simultaneous presence of emphysema and atelectasis is also described in standard works on mustard gas poisonings that were published after World War I [9,10].\n\n \n\n Figure 1: Lung emphysema (excessive inflation) and atelectasis (compression) in an early fatality from Hiroshima [11].\n\n \n\n 2. Acute radiation sickness in people who weren’t near the alleged nuclear bomb\n\n \n\n According to the official story of the bombings, rapidly fatal radiation doses could only have been received 1) within less than 1.5 km from the center of the detonation, and 2) at the exact time of the detonation [12]. However, there have been numerous cases of “radiation sickness” in persons who were not near the bombing when it happened, but who entered the zone of destruction shortly afterwards. An early case report is shown in Figure 2. The available statistical evidence on such cases is presented in Chapter 8 of my book [3].\n\n \n\n Figure 2: Excerpt from an early report of the International Committee of the Red Cross [13], describing a fatal case of “radiation sickness” in a young man who entered the inner city of Hiroshima only after the bombing.\n\n \n\n Anecdotal evidence further reinforces this point. For example, here is an excerpt from the recollections of Toyofumi Ogura, a history professor from Hiroshima University [14]:\n\n \n\n \"Yet even some people from that remote area who’d visited Hiroshima after the bombing later developed the symptoms of radiation sickness and eventually died. … They took time off from work and rested at home but in the meantime developed fevers, loose bowels and spots on the skin, all of which gradually got worse. I heard many such anecdotes from people on trains, in the town of Saijo and in nearby villages.\"\n\n \n\n 3. Skin lesions\n\n \n\n Mustard gas is a blistering agent—it disrupts the connection between the skin and the underlying tissues. Skin blisters are quite commonly described in witness testimony. Ogura’s daughter describes the aspect of her mother’s body after her death due to “radiation sickness”:\n\n \n\n \"She passed away with a photograph of our departed baby sister, Toshiko … on her breast. … Father, Kei-chan, Kinji and I cleaned her body. … There was a very big blister at her hip from a burn. It was red and must have been very painful. We dressed her in her favorite kimono and scattered paper flower petals over her breast.\"\n\n \n\n Even skin which has not yet detached from its support may do so when subjected to shear stress. Here is a description by Col. Stewart F. Alexander, the US military physician who had looked after the victims of a Luftwaffe attack on an American freight ship which had been carrying mustard gas, in the Italian port city of Bari [15]:\n\n \n\n \"In many cases large areas of the superficial layers of the epidermis were separated from their deeper layers and torn loose … The pathologists repeatedly noted that these layers of the skin were dislodged upon handling of the body … As the superficial skin layers were stripped loose they often took their surface hair with them.\"\n\n \n\n And here, for comparison, one more quote from Ogura’s book. As he makes his way across the city in search of his relatives, on the day of the bombing, he comes upon an obstacle:\n\n \n\n \"Near the end of the bridge, I came across three dead bodies lying haphazardly, face up … positioned such that I would be forced to step over one of them. … I could not bring myself to do that.\n\n \n\n Since the dead woman’s knees were raised slightly, I grasped the ankles to move the legs aside slightly so that I could pass without having to step over the body. But as I tried to lift the legs, I thought I felt my hands slip. It was an indescribably weird sensation. Looking down at my hands, I saw the exposed muscles of both legs, from the knees down, glinting in the sun. … The skin had peeled off and had gathered at the ankles, all wrinkled up.\n\n \n\n I crouched there for a minute, with the shock of it.\"\n\n \n\n Even though pathology reports on victims from Hiroshima are scarce, those that one can find also contain descriptions of peeling skin.\n\n \n\n 4. Conclusion\n\n \n\n So there you have it—the clinical signs one finds described by eyewitnesses and by pathologists clearly indicate that the malodorous “atom-bomb gas” that was perceived by many during and after the bombings was none other than mustard gas. This was, however, not the only deadly weapon deployed in these bombings; another one was napalm. If Henry agrees, I will present the corresponding evidence at a later time.\n\n \n\n References\n\n \n\n 1. Palmer, M. (2020) Japan Nuclear Attacks Were Faked.\n\n \n\n 2. Palmer, M. (2023) Smoking Gun! No Nuclear Bombs Were Dropped on Japan.\n\n \n\n 3. Palmer, M. (2020) Hiroshima revisited: the evidence that napalm and mustard gas helped fake the atomic bombings.\n\n \n\n 4. Palmer, M. (2023) The truth about the bombings of Hiroshima and Nagasaki.\n\n \n\n 5. Palmer, M. (2023) Hiroshima Deaths Due to Mustard Gas.\n\n \n\n 6. Hall, E. and Giaccia, A. (2019) Radiobiology for the Radiologist (Wolters Kluwer Health).\n\n \n\n 7. Hachiya, M. (1955) Hiroshima Diary: The Journal of a Japanese Physician, August 6-September 30, 1945 (University of North Carolina Press).\n\n \n\n 8. Freitag, L. et al. (1991) The role of bronchoscopy in pulmonary complications due to mustard gas inhalation. Chest 100:1436-41\n\n \n\n 9. Warthin, A.S. and Weller, C.V. (1919) The medical aspects of mustard gas poisoning (Mosby).\n\n \n\n 10. Gilchrist, H.L. (1933) The residual effects of warfare gases.\n\n \n\n 11. Liebow, A.A. et al. (1949) Pathology of atomic bomb casualties. Am. J. Pathol. 25:853-1027\n\n \n\n 12. Cullings, H.M. et al. (2006) Dose estimation for atomic bomb survivor studies: its evolution and present status. Radiat. Res. 166:219-54\n\n \n\n 13. Bilfinger, F.W. (2015) ICRC report on the effects of the atomic bomb at Hiroshima. International Review of the Red Cross 97:859-882\n\n \n\n 14. Ogura, T. (1997) Letters from the end of the world (Kodansha International).\n\n \n\n 15. Alexander, S.F. (1947) Medical report on the Bari Harbor mustard casualties. Mil. Surg. 101:1-17\n\n \n\n \n\n \n\n You can find this article permanently at You can find this article permanently at https://henrymakow.com/2023/04/hiroshima--radiation-sickness-.html\n\nBelow- Mike Stone - Soros' Satanists Destroy Civil Society in LA (scroll down) Please send links and comments to hmakow@gmail.com I highly recommend you set aside an hour to listen to this interview with Catherine Austin Fitts. It begins with an Oct 2020 clip from Augustin Carsten, the General Manger of the Bank of International Settlements. He explicitly says the intention of the CBDC's is Chinese Style social credit: TOTAL CONTROL by controlling your purchases based on your social media and other behavior. 'Your money is our money. You only get to use it with our consent.'\n\n \n\n https://odysee.com/@TLAVagabond:5/Catherine-Austin-Fitts-Interview-3-31-23:c Fitts says the bank runs were instigated deliberately to take out regional banks. She says the ghoulish globalist plan is to enslave mankind and create a dystopia to which she would prefer death. She says a nation that attacks and destroys its children has no future. She says COVID was just window dressing to establish a control grid. She recommends a dozen steps to fight CBDC starting with using cash. She says America's problem is one of governence - corruption and loss of faith in rule of law. https://home.solari.com/i-want-to-stop-cbdcs-what-can-i-do/ (Put this in location bar if it doesn't work) Compare this spectre of total control with how insider Christian Rakovsky described the Masonic Jewish bankers' thirst for total power. In the process, Rakovsky told his interrogator that the bankers created the Communist state as a \"machine of total power\" unprecedented in history. In the past, due to many factors, \"there was always room for individual freedom. Do you understand that those who already partially rule over nations and worldly governments have pretensions to absolute domination? Understand that this is the only thing which they have not yet reached.\" (emphasis mine)\n\n \n\n A pernicious force paralyzes our national life. Rakovsky identifies it: \"Imagine to yourself, if you can a small number of people having unlimited power through the possession of real wealth, and you will see they are the absolute dictators of the stock exchange and [economy]...If you have enough imagination then...you will see [their] anarchical, moral and social influence, i.e. a revolutionary one...Do you now understand?\"\n\n \n\n \"...They created credit money with a view to making its volume close to infinite. And to give it the speed of sound....it is an abstraction, a being of thought, a figure, number, credit, faith....\" (pp.245-246)\n\n \n\n https://www.henrymakow.com/what_is_communism.html (Put this in location bar if it doesn't work) \n\n 5 reasons to believe the global population is already one billion people less than it was in January 2020\n\n \n\n https://thecovidblog.com/2023/04/20/5-reasons-to-believe-the-global-population-is-already-one-billion-people-less-than-it-was-in-january-2020/\n\n \n\n --\n\n \n\n Russia follows WHO’s lead and ramps up fear of the Arcturus variant\n\n \n\n https://expose-news.com/2023/04/23/russia-follows-whos-lead-and-ramps-up-fear/\n\n \n\n - Secret CDC Report confirms over 1.1m Americans have ‘Died Suddenly’ since the COVID Vaccine Roll-Out; & further Government reports confirm the Vaccines are to blame\n\n \n\n https://expose-news.com/2023/04/23/over-6-million-americans-dead-covid-vaccine/\n\n \n\n \n\n -\n\n \n\n Civil Rights Complaint Filed Against Anheuser-Busch for Racist and Sexist Hiring \n\n https://www.theepochtimes.com/civil-rights-complaint-filed-against-anheuser-busch-for-racist-and-sexist-hiring_5207422.html?\n\n --\n\n Those vaccinated against COVID-19 have a 26 percent higher mortality rate on average compared to those who declined the jab – and the death toll is even more staggering for vaccinated people under 50 years old, where mortality is 49 percent higher than for those unvaccinated.\n\n \n\n https://www.theflstandard.com/top-insurance-analyst-600-000-americans-per-year-are-dying-from-covid-shots/ ---\n\n \n\n Airman's Leaks Started Just 48 Hours After Russia Invaded Ukraine\n\n \n\n \n\n Tipped off about a second, 600-member Discord chat group where Teixeira also posted, the New York Times found the Massachusetts Air National Guard information technology specialist started sharing information about the war in Ukraine within 48 hours of Russia's February 2022 invasion. In contrast to the previously reported chat group, this one was far larger and was publicly listed on a YouTube channel.\n\n \n\n https://www.zerohedge.com/political/airmans-leaks-started-just-48-hours-after-russia-invaded-ukraine\n\n \n\n -\n\n \n\n Girl with the boner is top left. A judge would not allow seven women anonymity to sue their sorority for \"allegedly coercing its members into inducting a transgender person.\" It is also alleged this trans woman gets too many boners as -- she -- watches the other sisters change. Apparently, having a sorority sister with a raging erection makes others uncomfortable. One girl dropped out of the suit, but six others are bravely going public.\n\n \n\n https://www.louderwithcrowder.com/sorority-judge-refuses Watch: Girl blasts school board, forced to beg adults for help in keeping males out of the girl's locker room\n\n \n\n https://www.louderwithcrowder.com/school-board-girl-locker-room\n\n \n\n \n\n \n\n --\n\n Biden Impeachment? Top Republican Says IRS Whistleblower, Chinese 'Collusion' And Hunter Laptop Letter Hoax \"Tip Of The Iceberg\"\n\n \n\n \n\n https://www.zerohedge.com/political/biden-impeachment-house-oversight-republican-says-irs-whistleblower-chinese-collusion-and\n\n \n\n When asked about China's influence over the Biden family, Burchett told Fox News' Maria Bartiromo on Friday: \"We know of at least eight Biden family members who have profited from dealings overseas,\" adding \"I think if you delve into it deep enough, there's prostitution rings involved in this, human trafficking has been rumored to be part of some of this. These so-called companies that have allowed the Biden family to profit. It is gross, and it is disgusting.\"\n\n --\n\n \n\n Can't believe Biden Commies are persecuting Black Leftists\n\n \n\n https://www.youtube.com/watch?v=mGekTdtvT84\n\n \n\n Viewer-\"As a black left wing dissident, I cannot praise Tucker enough for criticizing the tyrannical US regime across the board. There is nowhere in the US media environment you could get principled reporting like this. Working class Americans, left or right, black or white, regardless of artificial distinctions, should unite in a common fight against the military industrial complex, the big tech cenorship regime and Wall Street greed & corruption.\n\n \n\n \n\n --\n\n \n\n \n\n \n\n \n\n You can find this article permanently at You can find this article permanently at https://henrymakow.com/2023/04/april-23---catherine-austin-sm.html\n\nBelow- Did Prominent Jews Get the Vaccine \"Jew Call\"? Why should anyone work in Los Angeles when they can rob, loot, and steal with no fear of being arrested or prosecuted? \"California,\" he said, \"is like a beautiful wild kid on heroin, high as a kite and thinking she's on top of the world, not knowing she's dying, not believing it even if you show her the marks.\" - Rumble Fish, S.E. Hinton\n\n \n\n by Mike Stone There's a Carl's Jr. restaurant in my Los Angeles neighborhood with a huge banner out front that says NOW HIRING ON THE SPOT, Starting Wage at $16.50 per Hour.\n\n \n\n Apparently, you can walk in off the street with no experience and no resume and be immediately hired. But here's the thing: that sign has been up for two weeks. So either no one is applying, or the people that are applying are so lacking in minimal skills that they can't even work the drive-through counter at Carl's Jr.\n\n \n\n I'm guessing it's more the former than the latter. Why should anyone work in Los Angeles when they can rob, loot, and steal with no fear of being arrested or prosecuted?\n\n \n\n Last week in nearby Compton there were three street takeovers in a single night followed by the looting of an Arco gas station. The place was picked clean. Drinks, snacks, alcohol . . . They even took all the condoms. The night clerk had to lock himself in the bathroom for fear of being attacked.\n\n \n\n Local leaders say the \"youths\" were merely hungry and the looting will continue until they have enough to eat. But I thought they could make $16.50 an hour plus free hamburgers at Carl's Jr. . . . \n\n \n\n Ever notice how with all the looting we see, no one ever steals a pair of work boots?\n\n \n\n Of the pedestrians I pass on the street, 70% of them are still wearing masks, along with 10% of the people I see driving cars with the windows rolled up. I guess they haven't got the memo from our fake president that the whole farce is over. It's like the play is over, the starring actors and the audience have all gone home, but the extras are still wandering around the stage, wondering what to do.\n\n \n\n There are at least two hundred homeless people living within a three mile radius of my neighborhood. That's actually not unusual. The entire city is littered with tents and people sleeping on the street. They sleep in the subway trains too. People have stopped riding the subway, because they now resemble the streets of San Francisco, with addicts shooting up and people getting robbed.\n\n \n\n A stray cat has been hanging around my building. I felt sorry for it, so I was feeding it a can of cat food every day, that is, until it scratched me. After that, I threw out all the cat food I'd bought. I hope it dies now. Funny how people can't do the same; how they can't cut off financial support to the very people who want to see them dead. The street thugs and criminals keep biting the hand that feeds them and fat, dumb Americans keep feeding them.\n\n \n\n We had an election here last November. Like the last two national elections, it was fixed and the person that everyone voted for to be our next mayor, Rick Caruso, \"lost\" to Karen Bass, a butch-looking black woman. Can't let a white man who promises to fight crime and clean up the streets of Los Angeles be the next mayor. Crime here is so bad that Bass's own house was burglarized.\n\n \n\n Former Los Angeles mayor Richard Riordan, who led the city after the riots of 1992, died yesterday. He was 92. --\n\n \n\n \n\n Mike Stone is the author of Using ChatGPT to Predict the Future: How to Discern the Truth, Forecast the Future & Always Be Right available here: https://amzn.to/3FGpVY7 and Based, a young adult novel about race, dating and growing up in America. Related- Documentary on the Exodus out of California\n\n \n\n \n\n You can find this article permanently at You can find this article permanently at https://henrymakow.com/2023/04/mike-stone-LA-is-a-shitshow.html\n\nBelow- Feminism was the Creation of the US Communist Party (scroll down) April 22 - Did Prominent Jews Get the Vaccine \"Jew Call\" ? Please send links and comments to hmakow@gmail.com If links don't work, copy and paste into location bar. I'm not saying they did, but it's a question worth asking and answering considering that 1. Al Franken said he got the \"Jew Call\" from Ed Koch telling him to stay away from the WTC on 9-11 2. White House and Congress, Big Pharma and CDC staff were not required to get vaccinated. We know that many Israeli Jews suffered adverse reactions. But did prominent Jews in the West get the \"vaccine,\" have adverse reactions or die? Please let me know hmakow@gmail.com Here's a list of mostly non-Jewish celebrities that took the jab. The satanists are compounding their crime by debunking and suppressing vaccine injuries and deaths William Makis MD --Canadian doctor sudden deaths have reached 150 since COVID-19 vaccines rolled out - our Canadian Medical Association celebrates the occasion with a full page Pfizer ad...\n\n \n\n https://makismd.substack.com/p/canadian-doctor-sudden-deaths-have?\n\n \n\n I know that at least one of these MDs was Jewish. left, COVID is the common seasonal flu in drag The Worst Atrocity in the History of the World has been Confirmed with no accountability or justice forthcoming\n\n \n\n \n\n https://rwmalonemd.substack.com/p/the-worst-atrocity-in-the-history?\n\n \n\n All told, the estimate for total deaths from the COVIDcrisis is probably around ten million people or more. Ten million people is a very big number. It is hard to even fathom.\n\n \n\n --\n\n \n\n \n\n Man cures his terminal cancer after vet suggests a dog dewormer\n\n \n\n Big pharma is a vampire that feeds off human suffering. The COVID scam is just the latest example.\n\n \n\n https://www.youtube.com/watch?v=HYILnjc_wuY&t=149s\n\n \n\n \n\n -\n\n \n\n encore\n\n \n\n Doctors were bribed to vaccinate just like they are bribed to prescribe drugs. Most are basically whores.\n\n \n\n https://petermcculloughmd.substack.com/p/the-great-covid-19-vaccine-bribe\n\n \n\n -\n\n \n\n COVID-19 mRNA vaccines contain excessive quantities of bacterial DNA: evidence and implications by Michael Palmer, MD and Jonathan Gilthorpe, PhD\n\n \n\n Briefly, the risks are\n\n \n\n - prolonged expression of spike protein, with correspondingly prolonged autoimmune-like disease. This agrees with findings by those few pathologists who are paying attention.\n\n \n\n - increased risk of cancer and leukemia\n\n \n\n - increased risk of transgenic offspring\n\n \n\n https://doctors4covidethics.org/covid-19-mrna-vaccines-contain-excessive-quantities-of-bacterial-dna-evidence-and-implications/\n\n \n\n \n\n --\n\n \n\n http://snippits-and-slappits.blogspot.com/ The CIA, Biowarfare, and COVID—Dr. Robert Malone’s New Book Tells the Truth\n\n \n\n https://www.theepochtimes.com/the-cia-biowarfare-and-covid-dr-robert-malones-new-book-tells-the-truth_5211405.html?utm_source=Goodevening&src_src=Goodevening&utm\n\n \n\n \n\n \n\n \n\n --\n\n \n\n Senators Introduce Bill To Create Digital Identity for All Americans \n\n U.S. Senators Kyrsten Sinema, an independent of Arizona, and Cynthia Lummis, Republican of Wyoming, have introduced Senate Bill 884, also known as “the Improving Digital Identity Act of 2023.”\n\n \n\n https://lionessofjudah.substack.com/p/senators-introduce-bill-to-create?\n\n --\n\n \n\n CDC's record of Lies\n\n \n\n https://kelleyk.substack.com/p/the-shifting-narrative-on-vaccine?\n\n \n\n April 19, 2023: When asked about whether vaccinated people carry the virus, CDC Director Walensky testified to a Congressional committee that in March 2021, “all the data at the time suggested that people who were vaccinated, even if they got sick, couldn’t transmit the virus to someone else.” This contradicts statements from Fauci, from CDC spokesperson, and from the CDC web site at the time, which said the data was not clear (see my timeline from Spring 2021 for details).\n\n \n\n \n\n \n\n \n\n \n\n --\n\n Ken Adachi--\"I was surprised to discover that a reader mentioned my name, along with yours, as being flim flammed by Dr. Stever Greer. I appreciate being given a pass by this guy, but the fact is that I never embraced Steven Greer in any way, shape or form (including the lizard form). Quite the opposite, I've debunked him in a number of articles. Here's one.\n\n \n\n \n\n July 2, 2012\n\n Dr Steven Greer\n\n http://educate-yourself.org/lte/stevengreer02jul12.shtml\n\n \n\n -- Reader- I remember Steven Greer charging clients hundreds of dollars for \"field expeditions\" where he would \"call UFO's down\" out of the sky at night using flashlights. You can't make this stuff up, but if you assume EVERYONE touting UFO whatever is a CIA agent/asset/associate you won't be far off the mark. The whole field is swarming with paid agents/assets to the extent you can scarcely identify any real players anymore, if there are any. Linda Moulton Howe is a prime example, and I have personal experience with that one.\n\n \n\n Bill Cooper was IMO the past master UFO expert of all time and he said, just before they shot him, that there were no aliens other than the Annunaki. He said he verified that with 30+ Pentagon contacts he still had i.e. the whole alien thing is a certifiable psyop to cover for all the stolen tech, of which anti-grav is only a minute part.\n\n \n\n Greer posits that there are 50+ alien species extant on and off the earth and that they come and go regularly. He is the Tony Fauci of the UFO industry, which is not unlike the Holocaust enterprise.\n\n \n\n Right now the UFO bullshit is ramping up substantially, so I am thinking that a \"UFO invasion\" is still on the table as one of the cabal's options for ringing in the overt version of the NWO. They always do the same stupid shit over and over, coming up with few new ideas, and there apparently is not a creative one left the whole bunch. If you own/control the central banking system creativity, efficiency and productivity are no longer required - there are no failures, only delays and setbacks while more money is printed to support the next attempt/iteration.\n\n --- Why are the SAS in Ukraine? And how Joe Biden's visit to Ireland finished off the 'Special Relationship'\n\n \n\n This is Peter Hitchens's Mail on Sunday Column\n\n \n\n Meanwhile, as far as I know this country is not at war with Russia. If we did enter such a war, as a NATO member, we would instantly widen the current conflict to cover the whole of Europe. Can you begin to imagine what that would involve? How would the people of this country gain by such events? Is anybody thinking about what we are doing? First of all, what interest does the United Kingdom have in continuing and sustaining this war? \n\n \n\n https://hitchensblog.mailonsunday.co.uk/ \n\n You can find this article permanently at You can find this article permanently at https://henrymakow.com/2023/04/april-22---did-prominent-jews-.html", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://www.henrymakow.com", "title": "henrymakow.com - Exposing Feminism and The New World Order", "description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.amazon.com/Illuminati3-Satanic-Possession-There-Conspiracy/dp/0991821122/ref=pd_bxgy_14_img_y", "https://www.henrymakow.com/2019/07/Television-ruined-my-life.html", "https://www.henrymakow.com/kabbalah-how-sex-became-our-religion.html", "https://www.henrymakow.com/002046.html", "https://en.wikipedia.org/wiki/Giuseppe_Mazzini", "https://en.wikipedia.org/wiki/Giuseppe_Mazzini", "https://en.wikipedia.org/wiki/Giuseppe_Mazzini", "https://www.youtube.com/watch?v=_svaHSlkmZ0", "https://www.henrymakow.com/2019/11/Ten-Ways-We-Are-Enslaved.html", "https://www.henrymakow.com/2019/05/ten-signs-western-society.html", "https://www.henrymakow.com/liberals_are_shills_for_commun.html", "https://www.henrymakow.com/2020/01/god-an-update.html", "https://www.henrymakow.com/kabbalah-how-sex-became-our-religion.html", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/satanism-explained.html", "http:// https://www.wbko.com/2023/04/24/tucker-carlson-out-fox-news-network-confirms/", "https://www.youtube.com/watch?v=sMrjV37pb70", "https://www.youtube.com/watch?v=B553na_skKI&t=339s", "https://henrymakow.com/the_destuctive_principle_of_th.html", "https://www.youtube.com/watch?v=fxHjBW5QC0c&t=81s", "https://www.youtube.com/watch?v=ebG2POkoHgU&t=349s", "https://www.youtube.com/watch?v=YvRccFZZpas&t=466s", "http:// https://www.youtube.com/watch?v=A6DiA4CkQXE", "https://www.naturalnews.com/2023-04-23-obama-clinton-bush-american-express-fly-illegals-american-communities.html", "https://www.zerohedge.com/political/diane-abbott-suspended-labour-party-following-remarks-jewish-racism", "https://www.youtube.com/watch?v=WPa825gcKOg&t=99s", "https://www.youtube.com/watch?v=ScnW6Rv5nrg", "http:// https://expose-news.com/2023/04/23/pfizer-killed-your-friends-family-for-profit/", "https://needtoknow.news/2023/04/new-bill-to-create-digital-identity-for-americans-may-lead-to-chinese-style-credit-score/", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/april-24--the-elephant-in-the-.html", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/hiroshima--radiation-sickness-.html", "http:// https://odysee.com/@TLAVagabond:5/Catherine-Austin-Fitts-Interview-3-31-23:c", "https://home.solari.com/i-want-to-stop-cbdcs-what-can-i-do/", "https://home.solari.com/i-want-to-stop-cbdcs-what-can-i-do/", "http:// https://www.henrymakow.com/what_is_communism.html?", "https://thecovidblog.com/2023/04/20/5-reasons-to-believe-the-global-population-is-already-one-billion-people-less-than-it-was-in-january-2020/", "https://expose-news.com/2023/04/23/russia-follows-whos-lead-and-ramps-up-fear/", "https://thecovidblog.com/2023/04/18/tiffany-dover-is-dead-declassified-1944-cia-manual-outlines-government-mainstream-media-manipulation-tactics-as-artificial-intelligence-and-performance-art-blurs-lines-between-reality-and-theater/", "https://expose-news.com/2023/04/23/over-6-million-americans-dead-covid-vaccine/", "https://www.theepochtimes.com/civil-rights-complaint-filed-against-anheuser-busch-for-racist-and-sexist-hiring_5207422.html?", "http:// https://www.theflstandard.com/top-insurance-analyst-600-000-americans-per-year-are-dying-from-covid-shots/", "https://www.zerohedge.com/political/airmans-leaks-started-just-48-hours-after-russia-invaded-ukraine", "https://henrymakow.com/upload_images/Screenshot%202023-04-23%20at%2009-02-24%20Judge%20refuses%20anonymity%20to%20girls%20suing%20sorority%20over%20trans%20sister%20and%20her%20raging%20erections%20so%20they%20are%20going%20public.png", "https:// https://www.louderwithcrowder.com/sorority-judge-refuses", "https://www.louderwithcrowder.com/school-board-girl-locker-room", "http:// https://www.zerohedge.com/political/biden-impeachment-house-oversight-republican-says-irs-whistleblower-chinese-collusion-and", "https://www.youtube.com/watch?v=mGekTdtvT84", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/april-23---catherine-austin-sm.html", "https://amzn.to/3FGpVY7", "https://www.theepochtimes.com/leaving-california-the-untold-story-documentary_5185259.html?", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/mike-stone-LA-is-a-shitshow.html", "http:// https://www.dailymail.co.uk/tvshowbiz/article-12000669/Jamie-Foxx-awake-alert-remains-hospitalized-Georgia-suffering-health-scare.html", "https://jewishjournal.com/commentary/343040/alleged-vaccine-injuries-in-israel-underreported-coincidental-or-a-tool-for-anti-vaxxers/", "https://www.buzzfeed.com/morgansloss1/celebrities-for-covid-vaccine-and-against-it", "http:// https://makismd.substack.com/p/canadian-doctor-sudden-deaths-have?", "http:// https://rwmalonemd.substack.com/p/the-worst-atrocity-in-the-history?", "https://www.youtube.com/watch?v=HYILnjc_wuY&t=149s", "http:// https://petermcculloughmd.substack.com/p/the-great-covid-19-vaccine-bribe", "http:// https://doctors4covidethics.org/covid-19-mrna-vaccines-contain-excessive-quantities-of-bacterial-dna-evidence-and-implications/", "http://snippits-and-slappits.blogspot.com/", "https://www.theepochtimes.com/the-cia-biowarfare-and-covid-dr-robert-malones-new-book-tells-the-truth_5211405.html?utm_source=Goodevening&src_src=Goodevening&utm", "http://     https://lionessofjudah.substack.com/p/senators-introduce-bill-to-create?", "http://      https://kelleyk.substack.com/p/the-shifting-narrative-on-vaccine?", "http://educate-yourself.org/lte/stevengreer02jul12.shtml", "http:// https://hitchensblog.mailonsunday.co.uk/", "http:// https://hitchensblog.mailonsunday.co.uk/", "https://www.thetruthseeker.co.uk/?p=267938", "https://scruplesgame.com/", "archives.html", "https://henrymakow.com/2023/04/april-22---did-prominent-jews-.html", "https://assets-global.website-files.com/606d3dece4ec3c3866cc798a/60a5ff589cd77751eaf60c30_25%20The%20Israeli%20Peoples%20Committee%20Report.pdf", "https://assets-global.website-files.com/606d3dece4ec3c3866cc798a/60a5ff589cd77751eaf60c30_25%20The%20Israeli%20Peoples%20Committee%20Report.pdf", "https://www.the-people-committee.com/_files/ugd/3db409_336af74b14374e90b7478f58fd572702.pdf", "https://media.gab.com/system/media_attachments/files/127/257/439/playable/392f64254ee06ba7.mp4", "https://pipingrockhealth.com/products/cayenne-liquid-extract-2-fl-oz-59-ml-dropper-bottle?variant=43261344841966&msclkid=3af25e0bd93d1efbb3e53de184f32df4", "https://www.etsy.com/market/cayenne_pepper_seeds", "https://odysee.com/@WorldTruthSeekers:6/CancerForbiddenCures:a", "https://www.essiacproducts.com/?msclkid=8e81e33de0b612863a9080d531342175", "https://www.healthline.com/nutrition/essiac-tea#what-it-is", "https://www.cancerresearchuk.org/about-cancer/treatment/complementary-alternative-therapies/individual-therapies/essiac", "https://www.cancerwisdom.net/hoxsey-formula/", "https://www.healthline.com/health/burdock-root#Potential-risks-and-side-effects", "https://www.swansonvitamins.com/ncat1/Herbs/ncat2/Herbs+A-B/ncat3/Burdock/q?medium=PaidSearch&gclsrc=3p.ds&medium=PaidSearch&SourceCode=INTLBVDNA&gclsrc=3p.ds&msclkid=fc4c9bf99a7e1aae6553f810c0c380df", "https://www.iherb.com/c/burdock-root?msclkid=aaaebf030d861d64360bdcea51f629df&gclsrc=ds", "https://www.trueleafmarket.com/products/burdock-seeds-chiko?variant=4200357167145&msclkid=dc53af40496712f07d5ccca915cc55ea&size=250%2520mg", "https://draxe.com/nutrition/barberry/", "https://www.etsy.com/market/barberry_tincture", "https://mountainroseherbs.com/barberry-root?hsa_tgt=kwd-79508634497243%3Aloc-190&hsa_acc=5389326775&hsa_src=s&hsa_cam=1062336383&hsa_net=adwords&hsa_mt=p&hsa_ad=&hsa_grp=1272135246592139&hsa_ver=3&hsa_kw=Barberry+Roots&msclkid=98f3defd762f14631601bd142bce31d2", "https://www.ebay.com/sch/i.html?_nkw=barberry%20seeds&norover=1&mkevt=1&mkrid=711-34002-13078-0&mkcid=2&mkscid=102&keyword=barberry%20seeds&crlp=_&MT_ID=&geo_id=&rlsatarget=kwd-77103427967837:loc-190&adpos=&device=c&mktype=&loc=96598&poi=&abcId=&cmpgn=395402147&sitelnk=&adgroupid=1233652252997880&network=s&matchtype=e&msclkid=647189bfcb841870ec6fea569538721a", "https://www.healthline.com/nutrition/prickly-ash#dosage-forms", "https://www.etsy.com/market/prickly_ash_herb", "https://www.amazon.com/Prickly-Seeds-Zanthoxylum-americanum-Toothache/dp/B07CRV52WS", "https://community.bulksupplements.com/buckthorn-bark/", "https://www.verywellhealth.com/the-benefits-of-sea-buckthorn-89947", "https://www.etsy.com/market/buckthorn_bark", "https://www.ebay.com/sch/i.html?_nkw=buckthorn%20seeds&norover=1&mkevt=1&mkrid=711-34002-13078-0&mkcid=2&mkscid=102&keyword=buckthorn%20seeds&crlp=_5087&MT_ID=&geo_id=&rlsatarget=kwd-76553672338481:loc-190&adpos=&device=c&mktype=&loc=102220&poi=4132&abcId=&cmpgn=395402147&sitelnk=&adgroupid=1224856160130816&network=s&matchtype=e&msclkid=bb8ee436701f1b12076b87df1d5931fb", "https://www.healthline.com/nutrition/red-clover#downsides", "https://products.bestreviews.com/best-red-clover?yb=&cid=367846081&aid=1214960812704103&eid=&tid=kwd-75935393790327%3Aloc-190&ul=102200&mt=p&n=s&d=c&dm=&dt=&sn=&adid=&k=red+clover&p=&pc=&ap=&msclkid=32c54882b8871edd94e62b6bd85bd0c7", "https://www.netnutri.com/nature-s-answer-red-clover-1-fl-oz?scid=scbplp083000008900&sc_intid=083000008900&msclkid=40e0676c3c7c1fc7c7b404855ca06ea2", "https://www.trueleafmarket.com/collections/lawn-clover-seeds?msclkid=47331dd0e1581ab4e78b7e3983a6c6fa", "https://www.healthline.com/health/poke-root", "https://www.etsy.com/market/poke_root", "http://www.sandmountainherbs.com/pokeweed.html", "https://www.rareseeds.com/?msclkid=99ebe196b0fd1a1d0dc6827fd4e9da39", "https://www.gaiaherbs.com/blogs/herbs/stillingia", "https://youarethehealer.org/herbal-medicine/herbs-a-z/listed-by-common-name/queens-root-stillingia-sylvatica/", "https://www.herbco.com/c-197-stillingia.aspx", "https://lifetoniq.com/products/stillingia", "https://rangeplants.tamu.edu/plant/queens-delight-trecul-stillingia/", "https://www.healthline.com/nutrition/licorice-root#uses", "https://www.etsy.com/market/whole_licorice_root", "https://www.etsy.com/market/licorice_root_seeds", "https://www.puritan.com/now-foods-brand-0089/potassium-plus-iodine-024412?scid=45188&tf_adid=79577298339908&tf_asid=1273235135184476&tf_cid=402083162&msclkid=ff3a057262fd1811412f673f74f1f8ad&gclsrc=ds", "https://www.brightworkresearch.com/the-cancers-that-ivermectin-has-been-demonstrated-to-be-effective/", "https://pubmed.ncbi.nlm.nih.gov/32474842/", "https://www.aestheticsadvisor.com/2023/02/fenbendazole-joe-tippens-protocol.html", "https://healnavigator.com/treatments/fenbendazole-cancer-protocol/", "https://healnavigator.com/blog/fenbendazole-for-cancer/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3580766/", "https://healnavigator.com/blog/how-to-choose-cbd-oil/", "https://unityformulas.com/cbd-fortify/?aff=14"], "authors": [], "publish_date": null}