{"result_id": "155009", "URL": "https://www.savethemales.ca/200103.html", "timestamp": "2023-04-25 15:30:33 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Without God, We are Indeed \"Useless Eaters\"", "cleaned_text": "The second part is about God. as a reminder that we are nothing without our connection to God. It is unfashionable to talk about this because we are satanically possessed. We were born to serve God after our own fashion. That's the purpose of Life. No wonder they said life has no purpose. Our Divine soul is what defines us a \"human.\"\n\nI used to wonder why the U.S. didn't encourage Third World development. The clique's agenda is to make the U.S. more like the Third World, not the other way around.\"\n\nContrary to appearances, the human race is not stupid.\n\nA tiny clique that owns most of the world but wants more is sabotaging us.\n\nOne estimate is that 254 people own as much wealth as 47% of the world's population or some three billion people combined. They seem to be creating a feudal order consisting of themselves, a small technocratic class, and a pool of serfs and soldiers.\n\nModern religion and culture are feeble and corrupt because they are a function of this immoral plot.\n\nIn his book, The Globalization of Poverty, economist Michel Chossudovsky says that 14.8% of the world's population in the rich countries control 78.5% of the world's income. The World Bank and the IMF are the instruments of this policy, which Chossudovsky terms \"economic genocide.\"\n\nThe international bankers lend money to corrupt rulers that either squander or steal it. Then the national jewels are liquidated -- public enterprises, social programs and natural resources -- to pay the interest. \"In many indebted Third World countries, real salaried earnings in the modern sector have declined by more than 60 per cent since the [early] 1980's.\" (38)\n\nI used to wonder why the U.S. didn't encourage Third World development. The clique's agenda is to make the U.S. more like the Third World, not the other way around.\n\nWith the exception of Russia, the U.S. already has the greatest discrepancy between the richest and poorest 10%. In 1983, 54% of the total financial assets were held by just 2% of all families. The top 10% of all families held 86% of these assets. (US Bishops Economic Justice 183, quoting 1983 Federal Reserve Board figures.)\n\nRecently George W. Bush announced he would eliminate $364 billion in taxes on dividend income in the next decade to \"stimulate the economy.\" Fifty percent of this tax cut will flow to the richest one percent of taxpayers. Another quarter of the benefits will go to the remainder of the top five percent. (The New Yorker, Jan. 20, 2003, p.29)\n\nModern religion and culture are adapted to this agenda. Naturally the ruling clique does not want the masses to have a transcendent moral standard. We have been brainwashed to reject God. The Creator's Plan might interfere with the clique's.\n\nIt is absurd to think of creation without a Creator.\n\nAbsurd. Exactly. Without a Creator, existence is absurd.\n\nThe clique wants us to believe this. It facilitates genocide.\n\nModernity is founded on a belief in our absurdity. God (Perfection) is the measure of all thing. We act as though we are! \n\n\n\nWithout belief in God, we are ridiculous. Useless eaters. \n\n\n\nBy denying that man aspires for God, modern artists and intellectuals are like deaf men tuning a piano. They just don't get it.\n\nMy generation was indoctrinated to create our own reality.\n\nPaul Simon's \"Kathy's Song\" (1965) is an example:\n\n\"And so you see I have come to doubt\n\n All that I once held as true\n\n I stand alone without beliefs\n\n The only truth I know is you.\"\n\nHow many of us vainly sought salvation in relationships?\n\nWe are intended to serve these ideals in our own way. \n\n\n\nThis is Reality, accessible to everyone. You cannot feel good unless you are good.\n\nGod gave us souls so that we may know Him.\n\nIt is a bullshit detector for Truth, a conscience for Goodness and Justice, a heart for Love and Beauty.\n\nThe great religions open the door to this Dimension. But since this path has been blocked for many, I am describing it in secular terms.\n\nWe have a choice. We can enter Reality, by making God a part of our life. Or we can leave it, and take responsibility for our own unreality and misery.\n\nWe can dedicate each day to God and His will. Or we can serve mammon and never be happy. Haven't you noticed? Rich people never have enough. They are always comparing.\n\nThe cosmic battle is between Existence (Reality) and non-existence.\n\nCulture is an ongoing debate about how to live and why. Our \"culture\" is geared to non-existence. The cultural message is that money and sex brings happiness.\n\nWithout a living God, there can be no purpose, no true debate, and no shared cultural wisdom.\n\nMany feel fainthearted in the face of evil but Good will triumph because ultimately evil just doesn't work.\n\nIt self-destructs. It won't happen as fast as we may like, especially if we fail to play our part.\n\nGod has plenty of time. We don't. The question is: Do we want to experience our spiritual birthright? Do we want our children to experience theirs? Or will we cower while the planet enters a new dark age?\n\nIn conclusion, the central theme of modern history is the concentration of power and wealth in a few hands. Since this minority controls the churches, education and the mass media, modern culture is characterized by a fecklessness and decadence designed to advance this agenda. \n\n\n\nRelated - Self Discipline is the Key to Everything", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/200103.html", "title": "Without God, We are Indeed \"Useless Eaters\"", "description": "Even though they own most of the wealth, they want it all!! They see us as squatters. What do war, feminism, homosexuality, transgenderism, COVID and "}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.geocities.com/newworldorder_themovie/theosophy.html", "http://www.justpeace.org/structures/squeeze.htm", "https://henrymakow.com/2022/08/self-mastery-lies-at-the-heart.html", "https://www.henrymakow.com/2021/08/we-need-to-be-self-centered.html?_ga=2.188866860.688576618.1633215244-346964864.1627224119"], "authors": [], "publish_date": null}