{"result_id": "155040", "URL": "https://www.savethemales.ca/canada_pimps_its_girls_to_big.html", "timestamp": "2023-04-25 15:30:56 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Flashback: Canada Pimps Its Girls to Big Pharma", "cleaned_text": "This article from 2008 is a reminder that government has been an accomplice in vaccine poisoning for a long time. Essentially, big pharma has been bribing our \"leaders\" to harm us. I suspect many politicians are on-the-take. They're getting \"campaign contributions\" and personally profiting from the scamdemic.\n\nAbout a month after being vaccinated against the cervical cancer-causing HPV virus, 13-year-old Jenny Tetlock missed the lowest hurdle in gym class, the first hint of the degenerative muscle disease that, 15 months later, has left the previously healthy teenager nearly completely paralyzed. Did the vaccine, Gardasil, cause her condition? Her father, Philip Tetlock, a psychology professor at UC-Berkeley's Haas School of Business, has embarked on an odyssey to find out whether the vaccine or random coincidence is to blame. US News & World Report July 2, 2008\n\n\n\nThe Harper government has allocated $300 million to vaccinate thousands of girls as young as age nine against a sexually transmitted disease, human papillomavirus (HPV), which occasionally causes cervical cancer. \n\n \n\n The vaccine (Gardasil) only works on girls with no sexual experience. So instead of teaching these children that it is self-destructive and degrading to be promiscuous, the government is inoculating them as if they were becoming prostitutes. \n\n \n\n Instead of selling these girls, the politicians are taking their cut up front, from big pharma, profiting from promiscuity in the name of protecting \"public health.\" \n\n \n\n This is the shape of socialism in the New World Order: enriching corporations by degrading and drugging the population. \n\n \n\n In an interview with CBC-TV, a representative of Merck-Frosst, the maker of the vaccine, admitted that lobbying is how pharma business is done in Canada. [Apparently a former adviser to Harper became a lobbyist for Merck. ]\n\n \n\n The last time the Canadian government took such drastic action was during a polio outbreak in the 1950's. But there is no epidemic of cervical cancer now. In fact, it doesn't even rank in the top 10 cancers affecting Canadian women. Whereas 400 women die of cervical cancer each year, over 5000 die of breast cancer. \n\n \n\n At the same time, society is giving children the message that being \"sexually active\" is part of \"becoming a woman.\" In fact, girls become women by preparing to become wives and mothers. Promiscuity just makes them feel worthless and unwanted.\n\nIn a TV report, a mother just laughs when her 13-year-old daughter announces her intention to become \"sexually active\" at age 16. A father thinks the new vaccine is really cool while his daughter sits beside him in stunned silence. What message is she getting?\n\nThe current Canadian government pretends to be socially conservative and espouse \"family values.\" This is a funny way to do it.\n\n\n\nBOONDOGGLE WITH CONSEQUENCES \n\n \n\n At best, this vaccination campaign is a boondoggle for Merck. At worst it could have many negative effects. A reader from Argentina wrote that last Oct. the government tried to vaccinate girls for Rubeola but was stopped when some doctors revealed the vaccine contained a sterilization agent called prostaglandin. \n\n \n\n A report for the Women's Health Network by a McGill University epidemiologist calls the Canadian program \"premature and could possibly have unintended negative consequences for individuals and for society as a whole.\"\n\nWhile as many as 50% of women get some form of HPV over their lifetime, the report says most of these do not result in cervical cancer and can be cured.\n\n\"Most HPV infections are cleared spontaneously. Recent research using available molecular detection technologies suggests that clearance occurs within one year for about 70 per cent of those infected, and within two years for 90 per cent. Thus, HPV infection and cervical cancer must not be conflated: most women who are infected with even a 'high-risk' strain of HPV will not develop cervical cancer.\" \n\n \n\n The report also states that clinical trials were insufficient to test the efficacy of the vaccine since the subjects were too young to be exposed to HPV. The average cervical cancer patient is 47 years old so it isn't clear how long the vaccine will remain effective.\n\nDuring the last six months of 2006, the (US) National Vaccine Information Center (NVIC) got 385 reports of adverse reactions to Gardasil.\n\n\"There are twice as many children collapsing and four times as many children experiencing tingling, numbness and loss of sensation after getting Gardasil vaccination compared to those getting a Tdap (tetanus-diphtheria-acellular pertussis) vaccination.\"\n\n\"There have been reports of facial paralysis and Guillain-Barre Syndrome. And doctors who give Gardasil in combination with other vaccines are basically conducting an experiment on their young patients because Merck has not published any safety data for simultaneous vaccination with any vaccine except hepatitis B vaccine.\"\n\nIn May 2007, Judicial Watch reported 1600 adverse reactions to Gardasil including two deaths. \n\n \n\n INSANITY\n\nNext week in Toronto alone, 40,000 young girls and their parents will be pressured to allow an inoculation for a sexually transmitted disease. The reason for the pressure is that three injections are required over a six-months period i.e. the school year.\n\n\"My 12 year old daughter is facing this decision -- her MD. has suggested we vaccinate her right away,\" a mother posted on the CBC-TV web site. \"I am NOT a skeptical person by any means but something about this whole campaign makes me very nervous. \"\n\nAt over $400 for the three-doses, this is most exorbitantly overpriced child vaccine in existence. Apparently Merck will be paying those Vioxx settlements at the expense of Canadian taxpayers and adolescent girls.\n\nThe unstated, and outrageous assumption behind this vaccination campaign is that promiscuity is the norm. Human papilloma virus will not be transferred if people are selective and monogamous (and use condoms.) These girls have never had sex. Most will not have sex for years. Many will not be promiscuous and will not need this vaccine.\n\nThe other assumption is that sex is a necessary social experience that is divorced from courtship, love, marriage and procreation. On the contrary, a girl's healthy psychological development is based on her participation in the natural life cycle by having a family. Thus she must consecrate herself sexually for future or potential husband.\n\nContrary to feminist ideology, women are fulfilled in this way, not by becoming dentists or mechanics. Many feminist organizations are in favor of Gardasil. This is consistent with my view that the hidden agenda of feminism is to undermine marriage and family. Far from fighting the \"patriarchy,\" feminism shills for the establishment.\n\nSurely it would be less hypocritical (and cheaper) to teach these girls that promiscuity doesn't make them a woman. On the contrary, it ruins their chances for fulfillment by undermining their ability to bond permanently with their husband (i.e. love a man.)\n\nA young woman shouldn't need more than a couple of long-term relationships before she finds the right one. She doesn't need to protect herself like a prostitute would. On the other hand, many politicians and doctors could use some Gardasil.\n\nThis gratuitous mass inoculation sets a bad precedent. I don't want to speculate what excuse they will find for the next one.\n\n ------------------------- ----------------------------------------------------------\n\nNote #1: A report broadcast on NBC-News Saturday showed that Gardasil is being marketed in the US as a vaccine against HPV. One MD in Vermont has a waiting list of 288 girls. In fact, Gardasil prevents only four of about 30 strains of HPV, which represent only 70% of cancer causing HPV's. At $360 for the three doses, plus doctor's fees, there is alot of money at stake in this ruse. This is especially true since some doctors think cervical cancer is caused by feminine products and not HPV.\n\nNote #2: According to Dr. Judith Reisman, more than 80% of newborn American children are being inoculated with a vaccine for Hepatitus B, which is a venereal disease. This is not a threat to children but it is a threat to pedophiles because it identifies children who have been sexually abused by them. \n\n \n\n Related: \"Ten Things You Might Not Know About Gardasil\"\n\nPoisons in Gardasil? A page of links to articles critical of Gardasil scam", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/canada_pimps_its_girls_to_big.html", "title": "Flashback: Canada Pimps Its Girls to Big Pharma", "description": "  This article from 2008 is a reminder that government has been an accomplice in vaccine poisoning for a long time. Essentially, big pharma has been bribing our "}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.usnews.com/blogs/on-women/2008/7/2/is-hpv-vaccine-to-blame-for-a-teens-paralysis.html", "https://www.savethemales.ca/001573.html", "http://www.cwhn.ca/resources/cwhn/hpv-brief.html", "http://www.medicalnewstoday.com/articles/63586.php", "http://www.whale.to/vaccines/hpv11.html", "http://www.msmagazine.com/summer2005/cervicalcancer.asp", "http://www.whale.to/vaccines/krasner9.html", "http://www.drjudithreisman.com/archives/2006/07/mandating_pedia_1.html", "http://evilslutopia.blogspot.com/2007/01/gardasil.html", "http://www.womensenews.org/article.cfm?aid=3303", "http://www.whale.to/vaccines/gardasil_h.html", "http://www.whale.to/m/sterile.html", "http://youtube.com/watch?v=hJ8x3KR75fA", "http://video.google.com/videoplay?docid=2706003128969985648"], "authors": [], "publish_date": null}