{"result_id": "155044", "URL": "https://www.savethemales.ca/when_illuminati_shills_fear_ex.html", "timestamp": "2023-04-25 15:30:59 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Gulag Canada - Commies Imprison & Drug Vancouver MD", "cleaned_text": "\"Last month, Dr. Mel Bruchet was at his Vancouver home with Dr Daniel Nagase and Dr Charles Hoffe. Four squad cars and eight police arrived at Dr Bruchet's home. The peaceful and honorable Dr Bruchet was handcuffed and taken to Lionsgate Hospital.\n\n\n\nIn another warped chapter from the criminal covid agenda, after hours in handcuffs, this intelligent peaceful eighty-year-old physician was drugged then forcibly committed to a psychiatric ward. There he was denied his basic rights like telephone access. He was drugged with anti-psychotic medications. These anti-psychotics are contraindicated in elderly people because it gives them strokes and heart attacks. He had two mini-strokes (TIA's), and was put through mental health hearings which were kangaroo courts attempting to focus on his thoughts about the covid 'vaccines\". Though his thoughts are based on well founded scientific facts, the institution labelled his thoughts as \"delusions\": evidence of his \"dementia or psychosis\".\n\n\n\nThis is where we are folks; a complete crisis of legitimacy of government and institutions. Unquestionably dangerous and deadly injections are being forced on the masses. Even children are being targeted, injected, damaged and killed. Like the rest of us, even pregnant women are lied to, coerced and injected, before many of them give birth to dead babies. Meanwhile, a wise responsible physician, one of our respected elders, who stands up for the truth and our well being, is handcuffed, drugged, and locked up. Doctors, police, nurses, politicians, media and business leaders, and anyone else who has been going along with this, you need to wake up now. Repent and abandon the criminal covid enterprise. Join the solution, regardless of the apparent costs. IF we lose this war , we lose everything. Continued compliance will not save you. \" This story reminded me of three Vancouver lawyers who were dragged from the courtroom, drugged, disbarred and committed to a mental asylum when they attempted to expose an elite pedophile ring in 1994. Their story is below. The world is run by the Illuminati, Masonic Jewish criminal cult of sociopaths, pedophiles and Satanists who sacrifice children. \n\n\n\nThe hallmark of the Communist system is that dissidents are deemed insane and committed to mental hospitals.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/when_illuminati_shills_fear_ex.html", "title": "Gulag Canada -  Commies Imprison & Drug Vancouver MD", "description": "(Left, Mel Bruchet was one of three doctors who exposed still births among fully vaccinated women at Vancouver's Lion's Gate Hospital) Marc Trozzi MD-"}, "tags": [], "tweets": [], "movies": [], "links": ["https://drtrozzi.org/2022/01/10/heroic-dr-mel-bruchet-md-80-years-old-handcuffed-drugged-and-imprisoned-for-warning-us/", "https://jessicar.substack.com/p/mel-bruchet-is-out-dr-nagase-is-awesome", "https://drtrozzi.org/2022/01/10/heroic-dr-mel-bruchet-md-80-years-old-handcuffed-drugged-and-imprisoned-for-warning-us/", "http://www.legacy.com/obituaries/thestarphoenix/obituary.aspx?pid=179508261", "http://sisis.nativeweb.org/clark/cram.html", "http://www.legacy.com/obituaries/thestarphoenix/obituary.aspx?pid=179508261", "http://sisis.nativeweb.org/clark/currvit.html", "https://www.youtube.com/watch?v=J0-QGu8lOO4", "http://www.ourcourtssuck.com/Tale2lawyers.html", "https://www.henrymakow.com/did_the_illuminati_exterminate.html", "https://www.savethemales.ca/000683.html"], "authors": [], "publish_date": null}