{"result_id": "155042", "URL": "https://www.savethemales.ca/001924.html", "timestamp": "2023-04-25 15:30:58 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Cabalist Jews are Their Own God (Egregore)", "cleaned_text": "Soon they will be yours.\n\n\n\n\n\n \n\n Last week I noted that the Soviets razed thousands of churches but spared synagogues.\n\nIf Communists considered religion \"the opium of the masses,\" why didn't they include Judaism? Do Christians and Jews worship the same God? Is there an affinity between Communism and Judaism? Perhaps the Jewish elite has a different God. \n\n\n\nA reader, \"George,\" knew the heiress of a rich Jewish banking family \"not the Rothschilds, although her family lived in a palace neighbouring the Rothschilds.\" \n\n \"Leah was one of my classmates in the Geneva University (Switzerland) where I was studying psychology ...She was an attractive blue-eyed blond lady. ...As she was wearing a Star of David, I asked if she was a believer. She answered \"yes and no\" and added that she believed in a god of the Jews who was serving the Jews rather than served by them. I immediately asked whether she was speaking of an egregore ...Her only response was \"yes\" and she broke that conversation. Never again did we mention the subject.\" \n\n \n\n According to Wikipedia, \"egregore\" is an occult concept representing a \"thought form\" or \"collective group mind\", an autonomous psychic entity made up of, and influencing, the thoughts of a group of people. The symbiotic relationship between an egregore and its group has been compared to the more recent, non-occult concepts of the corporation (as a legal entity) and the meme.\" \n\n \n\n George speculates that elite Jews created the Jewish God as their \"egregore,\" i.e. an instrument of their collective will, i.e. their desire to vanquish the heathens and rule supreme. \n\n \"Could it be possible that the ancient Levite priests found a way to create a supernatural entity from the collective mind of the tribe of Judah? An entity born from a collective mind the Levites were shaping into self-isolationism and segregationist a.k.a, extreme ethno-centrism? ...An entity designed to help the \"chosen people\" destroy the \"alien\" nations and provide it with material rewards? An entity resulting from the black magic of the Levite priests who, as the first indoctrinated atheists, were denying the universal God of Moses because they didn't want to submit to a \"Lord and Master\" but rather become themselves \"Lords and Masters\" through their slavish \"egregorious\" god?\" \n\n \n\n This \"egregore\" is Lucifer, and elite Jews have made him the master meme of the New World Order. The elite Jews are the \"Communist Capitalist International\", the intermarried German Jewish banking families who, according to Christian Rakovsky include the Rothschilds, Warburgs, Schiffs and many others. \n\n \n\n They have also intermarried with the corrupt gentile elites of Europe and America, many of whom think they are Jews.\n\nTHE DEPRAVED SPIRIT OF OUR AGE \n\n \n\n Since the Jewish egregore is also behind the New World Order, only the \"believers\" are human; everyone else is an animal to be exploited and/or slaughtered. \n\n \n\n Nicholas Lysson, in his brilliant essay on the Ukrainian Holocaust, provides examples of this \"us-vs-them\" thinking in the Talmud and the Old Testament. For example: Isaiah 60:12 (\" . . .The nation and kingdom that will not serve [Israel] shall perish; yea, those nations shall be utterly wasted\" ); Isaiah 61:5-6 (\". . .Strangers shall stand and feed your flocks. . . : Ye shall eat the riches of the Gentiles. . .\") \n\n\n\n\"The ethnocentric hostility of the Jews--consistently commented on by the peoples who have encountered them over the millennia--can be traced ultimately to the origins of Judaism as set forth in the Torah, e.g., Genesis 9:25 (\"Cursed be Canaan; a servant of servants shall he be unto his brethren\"); Exodus 17:14-16 and 34:12-13 ; Numbers 24:8 (\"God. . . shall eat up the nations his enemies, and shall break their bones, and pierce them through with his arrows\"), 25:6-13 (wherein God commends Phineas for his initia-tive in running a javelin through both parties to a marriage of Jew and gentile), 31:7-19 and 33:50-56; and Deuteronomy 2:33-35 (\"[on God's command] we. . . utterly destroyed the men, and the women, and the little ones, of every city, we left none to remain\"), 3:4-7, 7:1-5 (\"thou shalt. . . utterly destroy them\"), 7:14-26 (\"thine eye shall have no pity\"), 20:10-17 (\"thou shalt save alive nothing that breatheth\") and 25:19.\"\n\n\"ANTI SEMITISM\" \n\n \n\n It doesn't take a genius to recognize that this \"egregore\" is the cause of anti Semitism. Jewish leaders use anti Semitism to manipulate Jews who are taught they are reviled for no reason. The real reasons for anti Semitism are hidden. As Nicholas Lysson points out, the most damning passages of the Talmud are toned down or not translated. Information about the \"Arendar\" system is suppressed. This system caused the massacre of perhaps 250,000 Jews by the Ukrainian Cossack Bohdan Khmelnytsky in 1648-1654:\n\n\"The Jews at the time of the massacres were serving the Polish szlachta (nobility) and Roman Catholic clergy on their Ukrainian latifundia as arendars--toll-, rent- and tax-farmers, enforcers of corvee obligations, licensees of feudal monopolies (e.g., on banking, milling, storekeeping, and distillation and sale of alcohol), and as anti-Christian scourges who even collected tithes at the doors of the peasants' Greek Orthodox churches and exacted fees to open those doors for weddings, christenings and funerals. They had life and death powers over the local population (the typical form of execution being impalement), and no law above them to which that population had recourse... the arendars leased estates for terms of only two or three years and had every incentive to wring the peasants mercilessly, without regard to long-term consequences.\"\n\nJews are still told that these pogroms were due to gratuitous hatred. Thus the egregore dynamic is perpetuated as ordinary Jews support Zionist policies. For example, they lobby for war with Iran, regardless of the disastrous consequences for humanity. \n\n \n\n (For this form of manipulation, also used to control Americans, See \"The Zionist Roots of the War on Terror\" and \"The Zionist Protection Racket\") \n\n \n\n In the above-mentioned essay, Nicholas Lysson discusses how the Jewish leadership actively provoke anti Semitism because it is indispensable for Jewish cohesion and survival. Are they saying that, without its \"egregore\" i.e. its predatory agenda, Jews would have no corporate raison d'etre? Of course this secret is kept from the rank-and-file, as in Freemasonry which Rakowsky said is designed to bring about \"the triumph of Communism.\"\n\n\n\n The greatest mass slaughter in history was not the Jewish holocaust but the Ukrainian Holodomor. By Stalin's own estimate, ten million Ukrainians died, mostly at the hands of Bolshevik Jews. \n\n \n\n Lysson's account suggests that this was the result of a centuries-long feud in which Jews failed to accept their common humanity with non-Jews. This continues as the murderous record of the 20th century is overshadowed by Jewish losses, as if only Jews were human. \n\n \n\n The Holodomor took place because the Bolsheviks confiscated all the grain. Lysson writes: \"A quarter of the rural population, men, women and children, lay dead or dying in a great stretch of territory with some forty million inhabitants, like one vast Belsen. The rest, in various stages of debilitation, had no strength to bury their families or neighbours. [As at Belsen] well-fed squads of police or party officials supervised the victims.\" \n\n \n\n The extermination of the Ukrainian Kulaks was directed from the Kremlin where the Bolshevik leadership lived in family apartments and maintained a fraternal atmosphere suffused by collectivist idealism i.e. their egregore. This is how historian Simon Sebag Montefiore, the scion of a British elite Jewish family, describes the scene during the Holomodor. Of course he doesn't mention that most of the main players were Jews. \n\n \n\n \"The Party was almost a family business. Whole clans were members of the leadership... This pitiless fraternity lived in a sleepless frenzy of excitement and activity, driven by adrenalin and conviction. Regarding themselves like God on the first day, they were creating a new world in a red-hot frenzy... \" (Stalin: The Court of the Red Tsar, p. 40, 45, emphasis mine) \n\n \n\n The Soviets didn't raze synagogues because Communism was an expression of the Jewish \"egregore.\" Christians and Jews apparently do not worship the same God. The Christian God represented by Jesus is universal love and brotherhood. The Jewish God has been supplanted by a Cabalistic egregore that \"serves\" elite Jews. It represents their ruthless sociopathic urge for world dominion. The same egregore--the desire to\n\n supplant God-- animates the New World Order.\n\nThe average Communist Jew or non-Jew was an idealistic dupe. Marxism, equality etc. were just window dressing to hide the real agenda: the destruction of race, religion, family and nation; the accumulation of all wealth and the enslavement of mankind. The methods have changed but the agenda has not.\n\nThe average Zionist is also an idealistic dupe. As many now realize, \"the Jewish Homeland\" was simply a step toward world government, \"an incident in a far reaching plan\" to use banker Louis Marshall's words. The goal of this plan is to enslave humanity mentally if not physically. Christian Zionists are the biggest dupes of all.\n\nThe same ersatz idealism infuses the world government movement, which is full of pious opportunists who have sold their heritage for a seat at the globalist banquet.\n\nIn many cases, the charge of \"anti Semitism\" and \"hate\" are devious attempts to outlaw opposition to Tyranny. Let's not kid ourselves. We are facing a diabolical Evil, ruthless, vicious and cunning as well. Jews and non-Jews must join hands to banish Lucifer and declare that only God is God, He is Moral and we serve Him.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/001924.html", "title": "Cabalist Jews are Their Own God (Egregore)", "description": "  Soon they will be yours.Does the "}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.savethemales.ca/001913.html", "https://www.savethemales.ca/000280.html", "https://www.savethemales.ca/000447.html", "https://www.savethemales.ca/001863.html", "https://www.savethemales.ca/181102.html", "https://www.savethemales.ca/181102.html", "https://www.savethemales.ca/000280.html", "https://www.youtube.com/watch?v=NuBT1t4dyLo"], "authors": [], "publish_date": null}