{"result_id": "155028", "URL": "https://www.savethemales.ca/why_are_babies_vaccinated_agai.html", "timestamp": "2023-04-25 15:30:47 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Why are Babies Vaccinated for a STD?", "cleaned_text": "The widespread medical practice of administering Hepatitis B vaccines to newborns is something that should sound mental alarm bells. \n\n\n\nWhy? Hep B is contracted chiefly by sexual contact, first appearing among male homosexuals then later spreading to the general population by adult heterosexual promiscuity.\n\nHep B is but one of many STDs, but is not yet an epidemic. Why not vaccinate for common contagions that become epidemics? And why subject newborns to their first Hep B vaccination at 12 hours, then a booster shot at 4 months, and another at 4 years when the vaccine 'memory' has faded?\n\nIs it because babies are going to be sexually active in their first 4-5 years? The answer is Yes, but this type of sexual contact never happens by mutual consent; it's called child molestation.\n\nPedophiles now pepper the professions landscape like warts on a witch. Some pedophiles are members of parliament that legislated exceptional powers be given to Child Protection agents. \n\n\n\nOther pedophiles are police; others are found in religious orders, there are doctors and lawyers, and teachers, and engineers, etc.etc.. Many pedophiles have Hepatitis B and are carriers infecting others, including children and babies.\n\nWhere though is the wholesale threat of Hep B infection to children?\n\nEnter the thugs of Child Protection agencies. These regularly abduct, or forcibly remove, children from parents straight into the waiting arms of individuals of an elite pedophile clientele. \n\n\n\nIn nearly every office of any Child Protection agency there is at least one Frau Goebbels that liaises with the elite clientele. Sometimes it's upon request for a particular victim that a child is forcibly removed. \n\n\n\nAn MP or doctor or policeman is attracted to the child through official capacity and requests Child Protection agents to intervene to remove the child on the flimsiest of pretexts. \n\n\n\nOther times a child is removed by Child Protection from foster care by midnight raids, or foster care perverts are actively engaged providing the elite client with 'meat'. \n\n\n\nMany children that die in Child Protection care were victims of a blind eye policy to satanic practises.\n\nTo avoid the scandal that too many children and sucking infants in Child Protection care get infected with Hep B, complicit legislators drafted a series of Hep B vaccinations into law or into standard medical practice as something good and healthy for the nation's infants.\n\nFortunately, most children are not sexually molested during their tender years; those that are may never remember the incidents. \n\n\n\nFor the former, the side-effects of vaccination cause death or maim by contaminants carefully planted within the witch's brew of vaccines. The range of vaccine contraindications is extensive but seldom are parents informed.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/why_are_babies_vaccinated_agai.html", "title": "Why are Babies Vaccinated for a STD?", "description": "Pedophiles now pepper the professional landscape like warts on a witch.   by Jack Ragnarok (henrymakow.com)The widespread medical practice of administering Hepatitis B vaccines to newborns is something that should sound mental alarm bells. Why?  Hep B is contracted chiefly by sexual contact, first appearing among male homosexuals then later"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whale.to/vaccines/reisman.html", "https://www.henrymakow.com/child_protective_services_rack.html"], "authors": [], "publish_date": null}