{"result_id": "155018", "URL": "https://www.savethemales.ca/000280.html?_ga=2.234654941.2124235623.1584814670-949981340.1431610500", "timestamp": "2023-04-25 15:30:39 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "\"The Aim of Freemasonry is the Triumph of Communism\"", "cleaned_text": "revealed that while the goal of Freemasonry is Communism, \n\n\n\nMasons will not have a seat at the NWO table. \n\n\n\nThat is reserved for Jews. \n\n\n\nWhat is Communism? Communism is not about the redistribution of wealth. Just the opposite, Communism is the monopoly over everything -- wealth, power, thought -- by the Masonic Jewish central banking cartel. \n\n\n\nThe real aim is to \"create all the required prerequisites for the triumph of the Communist revolution; this is the obvious aim of Freemasonry,\" Christian Rakovsky said in 1938. 83 years later, Freemasonry is implementing the covid hoax, vaccine passports and the emerging communist police state.\n\nThis slightly revised key article last appeared here in 2017.\n\nFreemasons \"have to die at the hands of the revolution which has been brought about with their cooperation,\" according to C.G. Rakovsky, left, a founder of the Communist International, Soviet ambassador to Paris and London, and Head of State of the Ukraine.\n\n\"The real secret of Masonry is the suicide of Freemasonry as an organization, and the physical suicide of every important Mason.\"\n\nThis disclosure is from a 1938 Stalinist police interrogation entitled \"The Red Symphony\" which was never intended to become public. (Transcript in Des Griffin, Fourth Reich of the Rich, p. 254, and online.)\n\n\"It is clear that I know of this not as a Freemason, but as one who belongs to 'Them,'\" [the Illuminati] says Rakovsky, a colleague of Leon Trotsky arrested for plotting against Stalin.\n\nRakovsky's aim is to convince Stalin, a nationalist, to co-operate with the \"the Communist-Capitalist International.\" I introduced this document last week in my \"Rothschilds Conduct 'Red Symphony'. \" \n\n\n\nFreemasonry is the world's largest secret society with over five million members, including three million in the US. It is instrumental in the totalitarian conspiracy. In The Protocols of the Elders of Zion, the author (possibly Lionel Rothschild, 1808-1879 ) writes,\n\n\"Gentile masonry blindly serves as a screen for us and our objects, but the plan of action of our force, even its very abiding-place, remains for the whole people an unknown mystery....Who and what is in a position to overthrow an invisible force?\" (Protocol 4)\n\nAgain he writes, \"we shall create and multiply free Masonic lodges... absorb into them all who may become or who are prominent in public activity, for in these lodges we shall find our principle intelligence office and means of influence.... The most secret political plots will be known to us and will fall under our guiding hands...We know the final goal...whereas the goyim have knowledge of nothing...\" (Protocol 15)\n\nIn his interrogation, Rakovsky says that millions flock to Freemasonry to gain an advantage. \"The rulers of all the Allied nations were Freemasons, with very few exceptions.\"\n\nHowever, the real aim is \"create all the required prerequisites for the triumph of the Communist revolution; this is the obvious aim of Freemasonry; it is clear that all this is done under various pretexts; but they always conceal themselves behind their well-known treble slogan [Liberty, Equality, Fraternity]. You understand?\" (254)\n\nMasons should recall the lesson of the French Revolution. Although \"they played a colossal revolutionary role; it consumed the majority of Masons...\" Since the revolution requires the extermination of the bourgeoisie as a class, [so all wealth will be held by the Illuminati in the guise of the State] it follows that Freemasons must be liquidated. \n\n\n\nWhen this secret is revealed, Rakovsky imagines \"the expression of stupidity on the face of some Freemason when he realizes that he must die at the hands of the revolutionaries. How he screams and wants that one should value his services to the revolution! It is a sight at which one can die...but of laughter!\" (254)\n\nRakovsky refers to Freemasonry as a hoax: \"a madhouse but at liberty.\" (254)\n\nIn Russia in 1929, every Mason who was not Jewish was killed along with his family, according to Alexey Jefimow (\"Who are the Rulers of Russia?\" p.77)\n\nLike Masons, other applicants for the humanist utopia master class (neo cons, liberals, Zionists, gay and feminist activists) might be in for a nasty surprise. They might be tossed aside once they have served their purpose.\n\n\n\n WHO ARE \"THEY\"?\n\nWhen the interrogator presses Rakovsky for Illuminati notables to approach with an initiative, Rakovsky is sure of only two who are now deceased: Walter Rathenau, the Wiemar foreign minister, and Lionel Rothschild. He says Trotsky is his source of information.\n\nOthers he insists are speculation:\n\n\"As an institution, the bank of Kuhn Loeb & Company of Wall Street: [and] the families of Schiff, Warburg, Loeb and Kuhn; I say families in order to point out several names since they are all connected ... by marriages; then Baruch, Frankfurter, Altschul, Cohen, Benjamin, Strauss, Steinhardt, Blom, Rosenman, Lippmann, Lehman, Dreyfus, Lamont, Rothschild, Lord, Mandel, Morganthau, Ezekiel, Lasky....any one of the names I have enumerated, even of those not belonging to \"Them\" could always lead to \"Them\" with any proposition of an important type.\" (272)\n\nBy allowing bankers the privilege of creating money, we have created an insatiable vampire. If you could manufacture money, imagine the temptation to own and control everything, including thought! This is the ultimate meaning of Communism. \n\n\n\nRakovsky refers to the 1929 Crash and Great Depression as an \"American revolution.\" It was deliberately precipitated by the Illuminati for profit, to break the \"classical American\" character and to take political power.\n\n\"The man through whom they made use of such power was Franklin Roosevelt. Have you understood? ...In that year 1929, the first year of the American Revolution, in February, Trotsky leaves Russia; the crash takes place in October...The financing of Hitler is agreed in July, 1929. You think that all this was by chance? The four years of the rule of Hoover were used for the preparation for the seizure of power in the United States and the USSR: there by means of a financial revolution, and here [Russia] with the help of war [Hitler, World War Two] and the defeat which was to follow. Could some novel with great imagination be more obvious to you?\" (273)\n\nRakovsky proposes that Stalin cooperate with the Illuminati, (which he subsequently did.) The first condition is that he stops executing Trotskyites. Then \"several zones of influence\" will be established dividing \"the formal Communism from the real one.\" There will be \"mutual concessions for mutual help for a time while the plan lasts...There will appear influential persons at all levels of society, even very high ones, who will help the Stalinist formal Communism...\" (276)\n\nRakovsky outlines the Illuminati plan to blend Communism and Capitalism. In each case, the Illuminati will control all wealth and power.\n\n\"In Moscow there is Communism: in New York capitalism. It is all the same as thesis and antithesis. Analyze both. Moscow is subjective Communism but [objectively] State capitalism. New York: Capitalism subjective, but Communism objective. A personal synthesis, truth: the Financial International, the Capitalist Communist one. And above all, 'They.' \" (276)\n\nIn the case of Communism, the State owns the corporations, and the bankers own the State. In the case of Capitalism, the bankers control the corporations, and the corporations control the State. In each case, you have monopoly capitalism with increasing political and cultural monopoly in the West resembling that of Soviet Russia. \n\n\n\nThe Red Symphony confirms that our political and cultural leaders are mostly dupes or traitors. The subversion of the United States is part of a plan for world tyranny.\n\nAn occult cabal of bankers is bent on enslaving humanity. Most religions and groups have been subverted by the Illuminati plan to rule the world and usurp all its wealth, as outlined in The Protocols. \n\n\n\nThe common denominator is Freemasonry. A manifestation of the emerging Rothschild Luciferian tyranny is the Masonic design of the new Israeli Supreme Court building, left.\n\nMost Freemasons and Jews are not aware of this plan, would oppose it, and are themselves victims of it. The charge of \"Anti-Semitism\" is used to distract us from the real issue, the creation of a global police state dedicated to projecting Cabalst Jewish wealth, perversity, and power into every sphere of life.\n\nThe \"war on terror\" is about establishing this authoritarian control. What are they planning that requires a police state and gun confiscation?\n\nAnother Great Depression? Civil war? An American gulag? A nuclear or biological \"terrorist\" attack? Sept. 11 demonstrates they will slaughter innocent Americans without compunction.\n\nWe have been born into the seventh or eighth inning of a nine-inning Game and God is trailing badly. The Illuminati have defined God in nonsensical terms and thus banished Him from our universe. God is synonymous with spiritual ideals. Instead of man making his rendezvous with the Creator, we are being degraded and turned into animals, better to serve the Illuminati. \n\n\n\nSEE TESTIMONY ON FREEMASONRY BELOW\n\n\n\n I visited my old college, since some of the guys I know there were participating in a literary reading of their own work. After the reading was over, everyone was mingling, and I hear this one guy, no older than 22, speaking about the Masons. He is apparently a member. I walk over, listen, and start to ask basic questions. We laugh about the \"conspiracy theorists\" and their ideas.\n\nMasons, he says, are good for raising money for their communities and giving members a sense of being a part of something that actually matters. Only two rules apply to join, he says: 1) You must be male. 2) You must believe in a God/higher power.\n\nThe guy gives me his business card and invites me to partake in a personal tour of the lodge where he is a member. In fact, he then offers me to join the Masons. He would be the personal reference I would need, and after an extensive background check, I would be good. Within a year, I should be able to move up to 3rd degree Mason. I took the card, said thank you and left. I have not contacted him.\n\nWeeks later, I spoke to a friend of mine about this experience, and he reminded me that the Masons are, after all, the avenue to fame and fortune. Was I tempted to join? Absolutely. The thought still runs through my head. I still have the guy's business card. This avenue would probably solve problems and bring comfort to my family's life. But at what price?\n\nMore on track, I read what the young man wrote about being approached to\n\nMy advice for him, having been approached over and over since I was 13 \n\n (first time was at my grandfather's funeral), is that the lure of 'solving \n\n problems' is strictly material, and as the old saying goes, 'if they make \n\n \n\n He would find that he would have merely exchanged one set of problems for \n\n \n\n As for the price, he would eventually be set up to betray whatever he loves \n\n most. That's an initiation: \"never love a thing you cannot bear to watch \n\n \n\n And that's only the beginning. Freemasonry is pure \n\n Luciferianism--Satanism--on the inside. And they don't play. \n\n I never did enter a lodge, because my grandfather told me before he died \n\n never to have anything to do whatsoever with them, and the reasons for it. \n\n\n\nDon't be tempted. Coin is a sorry substitute for keeping the autonomy of", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/000280.html", "title": "\"The Aim of Freemasonry is the Triumph of Communism\"", "description": "(Left. Trump and Hitler make Masonic Merkel sign. Our politicians are all Freemasons.)Illuminati insider Christian Rakovsky (Chaim Rakover) revealed that while the goal of Freemasonry is Communism, Masons will not have a seat at the NWO table. That is reserved for Jews. 1938 NKVD Interrogation Part One Most Politicians are Freemasons What"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.henrymakow.com/000275.html", "https://henrymakow.com/2014/03/Media-Mask-Masonic-Control%20.html", "https://henrymakow.com/what_is_communism.html", "http://en.wikipedia.org/wiki/Christian_Rakovsky", "http://mailstar.net/red-symphony.html", "https://www.savethemales.ca/000275.html", "https://henrymakow.com/what_is_communism.html", "https://www.henrymakow.com/what_is_communism.html", "https://www.savethemales.ca/000275.html", "https://www.youtube.com/watch?v=hhCaZLLhls4"], "authors": [], "publish_date": null}