{"result_id": "155019", "URL": "https://savethemales.ca/000185.html?_ga=2.249179392.688576618.1633215244-346964864.1627224119", "timestamp": "2023-04-25 15:30:40 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "savethemales.ca", "title": "Betty Friedan: Feminism -- Classic Commie Jewish (Satanic) Subversion", "cleaned_text": "I reprise this key 2003 essay about the mother of Feminism, Betty Friedan,\n\nas a reminder of how Communists use deceit to subvert society. Like the covid hoax,\n\n\n\ntheir appeals to \"social justice\" & \"equality\" are a con game.\n\nTheir real goal is to get rich by bankrupting and destroying the nation.\n\nCommunism is Cabalist Judaism which is Satanism.\n\nWe have all been inducted into this satanic cult.\n\nWe are under occult attack. Covid is Communism in white coat. America has been eaten alive by these satanist termites. \n\n\n\nRelated- Makow - We have de facto Communism and What is Communism?\n\n\"Comrades, you will remember the ancient tale of the capture of Troy ... The attacking army was unable to achieve victory until, with the aid of the famous Trojan Horse, it managed to penetrate to the very heart of the enemy camp.\" \n\n\n\nBetty Friedan, (1921-2006) the \"founder of modern feminism\" pretended to be a typical 1950's American housewife who had a \"revelation\" that women like her were exploited and should seek independence and self-fulfillment in a career. \n\n\n\nFriedan (nee: Betty Naomi Goldstein) didn't mention that she had been a Communist propagandist since her student days at Smith College (1938-1942) and that the destruction of the family has always been central to the Communist Jewish plan for world tyranny. Nor did the Communist Jewish-controlled mass media point this out.\n\n\n\nFriedan dropped out of grad school to become a reporter for a Communist news service. From 1946 -1952 she worked for the newspaper of the United Electrical, Radio and Machine Workers of America, (UE) \"the largest Communist-led institution of any kind in the United States.\" In 1947, Congress targeted the UE as a Communist front and its membership began a steady decline.\n\nDaniel Horowitz, a History Professor at Smith with impeccable Liberal and Feminist credentials documents all this in his book, Betty Friedan and the Making of the Feminine Mystique: The American Left, the Cold War and Modern Feminism (University of Massachusetts Press 1999). Horowitz cites a union member who described how a Communist minority \"seized control of the UE national office, the executive board, the paid-staff, the union newspaper and some district councils and locals.\" \n\n \n\n Betty Frieden doesn't want anyone to know her radical antecedents. Throughout her career, she said she had no interest in the condition of women before her \"revelation.\" She refused to cooperate with Professor Horowitz and accused him of \"Red-baiting.\"\n\nWhy? Because her book \"The Feminist Mystique\" (1963) would not have sold over five million copies if her subversive background were known.\n\nCommunists operate by subterfuge -- pretending to be just like us. This is the \"Popular Front\" strategy that consisted of starting idealistic movements in order to ensnare well-meaning people, usually students, workers, women, artists or intellectuals. The membership was ignorant that their organization was funded and controlled by people with a totally different agenda. This is also the principle behind Freemasonry, Zionism and Communism itself. Essentially the adherents are dupes.\n\nWilli Munzenberg, an early confidante of Lenin, organized the Popular Fronts in the 1920's and 1930's and referred to them as \"my innocents' clubs\". He pioneered the protest march, the demonstration, the radical bookstore and publication, the arts festival, and the recruitment of celebrities (\"fellow travellers,\" \"useful idiots\")\n\nIn the words of historian Stephen Koch, Munzenberg, left, \"was amazingly successful at mobilizing the intelligentsia of the West on behalf of a moralistic set of political attitudes responsive to Soviet needs. In the process, he organized and defined the 'enlightened' moral agenda of his era.\" (Double Lives: Spies and Writers in the Secret Soviet War of Ideas Against the West, New York, 1994, p.14.)\n\nIn a 1989 interview, Babette Gross, the wife of Willy Munstenberg, described the Popular Front modus operandi:\n\n\"You do not endorse Stalin. You do not call yourself a Communist. You do not call upon people to support the Soviets. Never. You claim to be an independent-minded idealist. You don't really understand politics but you claim the little guy is getting a lousy break.\" (Koch, p. 220)\n\nFriedan observed this principle when she helped start second-wave Feminism, which is a classic \"Popular Front.\" The very name, \"the woman's movement\" and claim to be for \"equality\" are but a smokescreen for a diabolical crusade to destroy the institution of the family. For example, feminist professor Alison Jagger calls the nuclear family \"a cornerstone of women's oppression: it enforces women's dependence on men, it enforces heterosexuality and it imposes the prevailing masculine and feminine character structures on the next generation.\" (\"Feminist Politics and Human Nature,\" 1988)\n\nThe \"Congress of American Women,\" a Popular Front organization founded in 1946 reached a membership of 250,000. It was disbanded in 1950 after being required to register as a \"foreign agent\" by the U.S. Government. Feminist historian Ruth Rosen writes that the \"CAW's agenda prefigured much of the modern women's movement that emerged in the sixties.\" (Ruth Rosen, The World Split Open: How the Modern Women's Movement Changed America, New York, 2000, p.28.)\n\nThe FBI kept tabs on the \"Women's movement\" but found no direct connection with Soviet subversion. Ruth Rosen, herself a veteran, finds this ironic.\n\n\"Ironically, the FBI searched for signs of subversion in the Women's movement but couldn't recognize what was truly dangerous. While they looked for Communists and bombs, the women's movement was shattering traditional ideas about work, customs, education, sexuality, and the family. Ultimately the movement would prove far more revolutionary than the FBI could ever imagine. Feminism would leave a legacy of disorientation, debate and disagreement, create cultural chaos and social change for millions of men and women, and, in the process, help ignite the culture wars that would polarize American society. But at the time these ideas were not what the FBI considered subversive.\" (260)\n\nBy attacking the social fabric, feminists inflicted more damage to Western society than Communists ever dreamed. Domestic violence hysteria has driven a wedge between men and women. Women have been psychologically neutered. They are encouraged to pursue sex and career, not family. The US birth rate has plummeted from 3.9 children per woman in 1960 to 1.9 today, the lowest level in history. [Replacement is 2.1] The marriage rate has declined by 1/3 while the divorce rate has doubled since 1960. Forty per cent of all first-born US children are conceived or born out of wedlock.\n\nThe feminist Trojan Horse has proven extremely effective. The question is why? How could a sick subversive philosophy that openly pits women against men have been able to succeed?\n\nThe disconcerting answer is that monopoly capitalists are behind both Communism and Feminism and use them to undermine the political and cultural institutions of Western Civilization.\n\nRockefeller-Rothschild cartels own most of the world and naturally assume they should control it too. They own most of our politicians, media and educators. Their goal is a \"new world order\" (a.k.a. \"globalization\") in which they remake mankind to fit their nefarious ends.\n\nRelated- Makow - How US Communist Party Created US Feminism", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/000185.html", "title": "Betty Friedan: Feminism -- Classic Commie Jewish (Satanic) Subversion", "description": " (Husband-Carl Friedan revealed that Betty was never a real housewife but a pill-popping psychopath.)I reprise this key 2003 essay about the mother of Feminism, Betty Friedan,as a reminder of how Communists use deceit to subvert society. Like the covid hoax,(re-branded flu) their appeals to "}, "tags": [], "tweets": [], "movies": [], "links": ["https://henrymakow.com/001995.html", "https://www.cnsnews.com/news/article/terence-p-jeffrey/7-10-richest-members-congress-are-democrats", "https://www.thestreet.com/lifestyle/bernie-sanders-net-worth-14678955", "https://nypost.com/2018/11/17/the-obamas-are-becoming-a-billion-dollar-brand/", "https://www.forbes.com/sites/danalexander/2016/11/08/how-bill-house-hillary-clinton-made-240-million-how-much-earnings-rich-white/#117bc5a17a16", "https://henrymakow.com/the_destuctive_principle_of_th.html", "https://henrymakow.com/2015/01/ten-signs-western-society.html", "https://www.henrymakow.com/2016/04/we-have-de-facto-communism.html", "https://henrymakow.com/what_is_communism.html", "https://www.henrymakow.com/000180.html", "https://henrymakow.com/001995.html"], "authors": [], "publish_date": null}