{"result_id": "155024", "URL": "https://www.savethemales.ca/_letter_from_a_readeri.html", "timestamp": "2023-04-25 15:30:44 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "henrymakow.com", "cleaned_text": "you that the 'truth movement' in Sweden has beenacknowledged in media lately and it's falling down upon us hard. Why?Yes, the anti-Semitic propaganda starts to kick in.The following link going to one of the channels (private) in Sweden,a channel heavily protected by Zionist views. I have translated thelink into English in a blink of an eye.Sweden has voted a yes to a law making FRA (~the defense radio surveydepartment) quite powerful and free to search e-mail and listen tophonecalls. It's pretty much like NSA. It's pretty apparent thatfreedom of speech is about to get big brother knocking at its door.* * *-Anti-Semitic opinions are common-The Swedish program at channel TV4 points out that some followers ofthe 'truth movement' shows signs of anti-Semitism. Despite this, themovement receives support from known cultural personalities as well ashigh-positioned politicians.Jonas Berg and Aleksandra Vujanovic continues their investigation ofthe so called 'truth movement' which is a movement that says that theUS government planned and carried out the terror attacks the 11th ofSeptember. A bunch of famous personalities, politicians and academicsrally and supports the movement's arguments. Finally, the conspiracytheories have scurried forth and reached the Swedish highest politicalassembly (known as Riksdagen, or as in German, Reichstag).-Extreme opinions-However, there also exists far more extreme people joining the ranksof the 'truth movement'. The publishing company Alhambra prints booksand arrange seminaries discussion varies topics connecting to the'truth movement'. The spokesman for Alhambra in Stockholm, LarsWilhelmsson, says: - Everyone dealing with politics at some level iswell aware that Israeli Mossad and CIA were involved to be able toblame the Arabic countries. The threat of terrorism was created.-Wide-spread anti-Semitism-Journalist and author, Torbjorn Elensky, has criticized the 'truthmovement' and the wide-spread anti-Semitism that thrives among thefollowers. - It's about blaming the Jews. The ideas are sprung out ofNazism.4 nov 2009 23:47Kajsa Lindohf", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/_letter_from_a_readeri.html", "description": " (letter from a reader)I need to inform you that the 'truth movement' in Sweden has been acknowledged in media lately and it's falling down upon us hard. Why? Yes, the anti-Semitic propaganda starts to kick in.  The following link going to one of the channels (private) in Sweden, a"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.tv4.se/1.1313822/2009/11/04/antisemitiska_asikter_vanliga", "mailto:kajsa.lindohf@tv4.se"], "authors": [], "publish_date": null}