{"result_id": "155002", "URL": "https://www.savethemales.ca/310702.html?_ga=2.5871095.537599149.1590683130-449019044.1590683130", "timestamp": "2023-04-25 15:30:27 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "The Fraud that Begets all Others", "cleaned_text": "The \"key\" to understanding the world today bears repetition.\n\nThe medium of exchange (money, currency, credit) is created out of thin air as a \"debt\" to a cartel of Masonic ( Cabalist, Satanist) Jewish bankers. This is something government could do itself interest-and-debt-free. Your \"money\" is really government IOU's to these central bankers. No matter which bank you use, you're dealing with them.\n\nHistory/current events are stratagems to max out our stolen national credit cards (wars, pandemics) ; and protect this credit monopoly by extending it to every aspect of human life. \"We corrupt in order to control,\" said Masonic Grand Master Giuseppe Mazzini. \"We have taken from the people all the gods of heaven and earth, their religious faith, their faith in monarchy, their honesty and their family values...\"\n\n\n\nSociety has been thoroughly subverted and colonized by this occult power and doesn't even know it because they control mass media and education. Many Jews and Freemasons are collaborators but everyone who wishes to succeed in public life must become a accomplice. Modern society is built on quicksand. We are mind-controlled slaves, but thanks to the Internet, more people are waking up.\n\nCol. Dall personally confronted [FDR handler] Louis Howe (left) over Russian Communist agents he saw meeting Howe in the White House. -- \"FDR: My Exploited Father-in-Law\" (1970)\n\nIn 1913, Congressman Charles August Lindbergh said: \"When the President signs this bill; the invisible government by the Monetary Power will be legalized...The greatest crime of the ages is perpetrated by this banking and currency bill...The day of reckoning is only a few years removed.\"\n\n\n\nThe establishment of the Federal Reserve Bank in 1913 set off a chain of baneful events that blighted the 20th century and darkens our prospects for the 21st. It began with the World Wars and the Great Depression, and continues with 9-11 and the wars on Afghanistan, Iraq, Libya, Syria and Ukraine.\n\nIn 1913, America's leaders were bribed and bamboozled by mostly foreign bankers and their US agents. Our \"leaders\" committed treason by giving these bankers the power to create money out of thin air backed only by the credit, i.e. taxes, of the American people.\n\nThe U.S. government now borrows its own money from international bankers and pays them interest to the tune of $400 billion per annum for the privilege.\n\nIf you hoodwinked the United States in this fashion, what would you do?\n\nYou would either give the magical power back to its rightful owner, the US government.\n\nOr, you would use it to take over the world, own everything and to control everyone.\n\nModern history displays a long-term plan by dynastic banking families and their allies to create an Orwellian World dictatorship (\"New World Order\") in which wealth will be further concentrated, and human life will be further degraded.\n\nWars and depressions, pandemics and \"vaccines,\" modern art and culture, gender dysphoria, sexual \"liberation\" and feminism, are all part of this design. The role of historians and the mass media is to obscure this plan and to beguile the masses into thinking they are free and their leaders represent their interests.\n\nThis conviction was reinforced by Col. Curtis Dall's book, \"FDR: My Exploited Father-in-Law\" (1970). Dall, who was married to Franklin Roosevelt's daughter Anna, spent many nights at the White House and often guided FDR around in his wheelchair. He was also a partner at a Wall Street brokerage.\n\nDall maintained a family loyalty but could not avoid several disheartening conclusions in his book. He portrays the legendary president not as a leader but as a \"quarterback\" with little actual power.\n\nThe \"coaching staff\" consisted of a coterie of mostly Jewish handlers (\"advisers\" like Louis Howe, Bernard Baruch and Harry Hopkins) who represented the international banking cartel. For Dall, FDR ultimately was a traitor manipulated by \"World Money\" and motivated by conceit and personal ambition.\n\nFDR's main perfidy was suppressing information about the Japanese attack on Pearl Harbor, at the cost of almost 3,000 lives. He did this because the bankers needed US involvement in WWII, something 85% of Americans opposed. The Japanese had instructions to call off the attack if they lost the element of surprise.\n\nDall relates a less known but more telling anecdote. \n\n\n\nIn 1956, George Earle, left, a former governor of Pennsylvania, told him that in 1943 the Nazis tried to surrender. At the time, Earle was Naval Attache in Istanbul when Admiral Wilhelm Canaris, head of the German Secret Service, approached him personally.\n\nCanaris told him that the German generals felt Hitler was leading Germany to destruction. They could not accept Roosevelt's policy of \"unconditional surrender,\" but if FDR would offer \"honourable surrender,\" the army was prepared to stage a coup d'etat.\n\nThey believed that Russia represented a threat to Western Civilization and they were ready to present a non-Nazi German bulwark against Communist designs in Eastern Europe.\n\nTo make a long story short, FDR repeatedly ignored this proposal which could have ended the war in 1943 and saved millions of lives. Canaris and hundreds of other decent German officers were later tortured and killed by the Gestapo.\n\nThe bankers' policy, as exhibited by the fire bombing of German cities, was clearly to 1) prolong the war and inflict maximum damage on Germany, 2) ensure that Soviet Russia occupy Eastern Europe and become a major world power. \n\n\n\nFrankly, I can't believe what weenies Canaris and the German generals were. They didn't need Allied approval to depose Hitler. They could have done it and continued the war if necessary. Didn't any of them realize that Hitler was a \"British\" agent??? \n\n\n\nThe banking cartel acted as if Communist Russia was their personal creation, which it was. One of FDR's first acts in office was to recognize the Soviet regime. FDR advisers Henry Morgenthau and Harry Dexter White arranged for U.S. treasury printing plates to be sent to Russia so the Communists could print their own US money. They arranged $8 billion in lend lease aid to Russia after the war was over. Col. Dall personally confronted Louis Howe over Russian agents he saw meeting Howe in the White House.\n\nAccording to Antony Sutton (\"Wall Street and the Bolshevik Revolution\"), the Bolshevik Revolution was funded by international bankers. In 1917, Trotsky and 200 revolutionaries were literally transferred from New York's Lower East Side to St. Petersburg to foment the revolution.\n\nWhat are we to make of all this?\n\nWe have to recognize that monopoly capitalism and Communism have an affinity. Both are enemies of competition and freedom. A Communist government can give the cartels control of raw materials and markets. It can provide huge contracts and take on huge debts. A Communist government can ensure social control in order to protect the concentration of wealth. The US economy is now controlled by a handful of cartels. We are facing Communism with private instead of public monopoly.\n\nIs it a coincidence that the Communist Party term \"politically correct\" has entered the American lexicon?", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/310702.html", "title": "The Fraud that Begets all Others ", "description": "The "}, "tags": [], "tweets": [], "movies": [], "links": ["https://henrymakow.com/what_is_communism.html", "https://en.wikipedia.org/wiki/Giuseppe_Mazzini", "https://en.wikipedia.org/wiki/Louis_Howe", "https://www.savethemales.ca/001399.html", "https://www.henrymakow.com/fdr_naive_exploited_or_fellow.html"], "authors": [], "publish_date": null}