{"result_id": "155010", "URL": "https://www.savethemales.ca/070502.html", "timestamp": "2023-04-25 15:30:34 CEST+0200", "meta": {"description": "Henry Makow's official web \nsite. Exposing Feminism and the New World Order", "lang": "en", "keywords": "", "favicon": "/save.ico", "canonical": "https://www.henrymakow.com/", "encoding": "utf-8"}, "image": null, "domain": "www.savethemales.ca", "title": "Treason at the Top: Feminism, Fertility and Fascism", "cleaned_text": "( From May 7,2002, of interest to newcomers, researchers and nostalgia buffs) \n\n\n\nA smoking gun! The elite doesn't want us to reproduce.\n\nIn 1970, Frederick Jaffe, the VP of Rockefeller-sponsored \"Planned Parenthood\" organization outlined how \"social constraints\" should be used to achieve \"fertility control.\" (\"Family Planning Perspectives\" Oct.1970.)\n\nThese \"constraints\" included encouraging \"increased homosexuality,\" altering \"the image of the ideal family,\" and encouraging women to work outside the home.\n\nIf this failed, the agency recommended the placement of \"fertility control agents in the water supply.\" We're not talking about unwanted pregnancies here.\n\nThe unprecedented decline of the American family since 1960 did not take place by accident. We are victims of a campaign of psychological warfare carried out by the CIA and foundations through the media, government and education.\n\nThey put the neutering agent in the cultural drinking water. The main ingredient is the promotion of homosexuality as an alternative to heterosexuality.\n\nFeminism, which masquerades as \"woman's rights,\" is in fact a pathological lesbian movement. It coerces women to believe that their feminine instincts are socially taught, oppressive and evil. It teaches them to fear and compete with men, and to find fulfillment in career instead of family.\n\nWomen who devote their lives to their families are the finest aspects of human life. They are saints who bring love and beauty into the world and tend to the real everyday needs of men and children. To disparage these women is a foul, vicious calumny worthy of the devil himself. Yet that's what the feminist movement is all about, though they deny it.\n\nBetty Frieden, the \"moderate\" feminist founder, who hid the fact that she was a Communist activist, compared homemakers to concentration camp victims. Simone de Beauvoir, another Communist founder, said women must not be given a choice to be mothers and homemakers because they'll choose that option. According to feminist Ellen Willis, feminism \"is the cutting edge of a revolution in cultural and moral values...The objective of every feminist reform, from legal abortion...to child-care programs, is to undermine traditional family values.\" (The Nation, Nov. 14, 1981)\n\nWhat part of traditional family values do feminists object to? Love? Sacrifice? Devotion? Loyalty? Security? The preparation of a new generation for life? \n\n\n\nRockefeller financed the Nazis through I.G. Farben. He sponsored the American Eugenics Society that had close links to its Nazi counterpart.\n\nRockefeller financed Alfred Kinsey, the homosexual pederast whose \"Kinsey Report\" replaced married love with casual sex.\n\nRockefeller continues to finance \"Women's Studies\" which is a training ground for fascist zealots who spread their poison in society as \"change agents.\" (See Daphne Patai, Professing Feminism: Cautionary Tales from the Strange World of Women's Studies .)\n\nThe elite is promoting homosexuality to bring about a fascist New World Order. Homosexuality is a developmental disorder characterized by a failure to bond with a member of the opposite sex. Lesbianism (feminism) which coerces women to be like men (and vice-versa) makes it difficult to achieve such a bond. As a result, millions of men and women have been defrauded of happiness and suffer the same symptoms as homosexuals, i.e. arrested development, and obsession with sex.\n\nThe elite's purpose is to transfer power from the nation state to their minions at the world level. Once our democratic power is gone, the elite will lower the standard of living. Look at the economic disparities in the Third World for a blueprint of the future. For the elite, the motto is \"the less there is of you, the more there is for us.\"\n\nA distracted, dysfunctional population, deprived of its history and culture, will not recognize its fate in time. Men, emasculated and demoralized, will not be able to resist.\n\nI ran headlong into this stealth elite policy when I was teaching English part-time at the University of Winnipeg. I was exploring the subject of male-female love in works by DH Lawrence, Chekhov and Henry James.\n\nA handful of militant feminists objected to my defense of traditional femininity and wrote a letter slandering me. Constance Rooke, the university president, [now deceased] accepted their allegations without investigation. The university ignored my complaint of discrimination. The Manitoba Human Rights Commission, another feminist bastion, also dismissed my complaint without investigation.\n\nWinnipeg Sun Editor Lyn Cockburn portrayed me as a 50-year-old man who got his jollies by importuning his 18-year-old female students after class with questions about their sex lives. She compared me to a MD who should be disbarred for making \"inappropriate remarks and gestures\" to a young female patient. I sued The Winnipeg Sun for defamation and won.\n\nVile slander is the lot of anyone who questions feminist dogma. Professors were afraid to speak to me.\n\nThis case is not about protecting innocence.\n\nLast year, Cockburn had nothing to say when the same university was on the front page of The Winnipeg Sun for teaching lesbian masturbation to 14-year-old high school girls. The girls signed on for a summer school course on \"women in the arts\" and received an introduction to lesbianism instead. They learned that they didn't need men and could use bananas and vegetables. President Rooke was unrepentant and opined that it may have been too soon to teach girls about male substitutes.\n\n\n\nNormally Rooke would have lost her job for this outrage. But there wasn't a peep from the Minister of Education or other stalwarts of the community. Rooke is brazen because her orders come right from the top.\n\nThis became clear when I saw Jim Carr, the executive director of the Manitoba Business Council. I thought the province's leading enterprises would be concerned that feminists teach the hatred of males, the overthrow of capitalism and discrimination in favor of women, minorities and homosexuals.\n\nHe denied this is happening. Carr's previous assignment was biographer of Duff Roblin. A former Manitoba Premier, Roblin is a member of the Council on Foreign Relations (the elite's US coordinating body.)\n\nHartley Richardson, a longtime leader of the Manitoba business community, is a member of the Trilateral Commission. Rockefeller interests set up these bodies to promote elite world government and (Canadian PM) Stephen Harper and (Manitoba Premier) Gary Doer dance to their tunes.\n\nIn conclusion, elite planners and their stooges (in government, education and the media) are actively promoting homosexuality in order to destabilize and neuter us. Their ultimate goal is to steal our birthright, in every sense of the word.", "opengraph": {"image": "https://henrymakow.com/ads/hm.png", "image:width": "200", "image:height": "200", "site_name": "HenryMakow.com", "url": "https://henrymakow.com/070502.html", "title": "Treason at the Top: Feminism, Fertility and Fascism", "description": " ( From May 7,2002, of interest to newcomers, researchers and nostalgia buffs) A smoking gun! The elite doesn't want us to reproduce. In 1970, Frederick Jaffe, the VP of Rockefeller-sponsored "}, "tags": [], "tweets": [], "movies": [], "links": ["http://uscl.info/edoc/doc.php?doc_id=49&action=inline", "https://www.henrymakow.com/180302.html", "http://www.google.ca/search?q=women%27s+studies%2C+rockefeller+foundation&hl=en&btnG=Google+Search&meta="], "authors": [], "publish_date": null}