{"result_id": "156009", "URL": "https://herb.co/news/health/could-cannabis-prevent-and-treat-coronavirus/", "timestamp": "2023-04-25 15:31:10 CEST+0200", "meta": {"description": "In these times of global pandemic, scientists from all over the world are searching for the treatment and vaccine that can put an end to COVID-19. Well, this week, a group of researchers revealed a study that points to cannabis and its potential to act against the virus.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/health/could-cannabis-prevent-and-treat-coronavirus/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Could Cannabis Prevent and Treat Coronavirus?", "cleaned_text": "A team of Canadian scientists revealed that, after conducting a series of investigations, they found that some potent strains of cannabis could potentially be effective in preventing and treating the coronavirus.\n\nIgor and Olga Kovalchuk, researchers from the University of Lethbridge, have been working with cannabis since 2015. They specialize in the creation of hybrids strains and hemp extracts to explore and demonstrate the therapeutic properties of the herb.\n\nThey revealed that in a recent study done in April, they found 13 high CBD cannabis strains that affected the pathways that the virus uses to infect humans. They say that high CBD extracts have the potential to block specific proteins that act as gateways for the infection into human cells. Their study revealed that cannabis could reduce virus entry points by up to 70%.\n\n“We were totally stunned at first, and then we were really happy. Our work could have a huge influence — there aren’t many drugs that have the potential of reducing infection by 70 to 80 percent”, said the researchers.\n\nTheir study suggests that cannabis could be used to reduce infection vulnerability, decrease contagion levels, and even as therapy for those who are already sick. They said that, eventually, cannabis could be incorporated into essential everyday use products such as mouthwash and throat gargles to convert them into preventive treatments that stop the virus from entering through the mouth.\n\nEven though the results are hopeful, researchers stated that this study is yet to be revised and validated by their peers and requires more in-depth investigation. Additionally, they emphasized that this does not mean that any store-bought cannabis will work. In their study, only a few strains out of 800 that they analyzed proved to have the mentioned effects. All of them had one thing in common: Sativa strains with high levels of anti-inflammatory CBD and low levels of THC.\n\nCurrently, the researchers work with organizations such as Pathway Rx, a cannabis therapy research company, and Swysh Inc., which specializes in cannabinoid research. They are seeking funding to continue with their investigation into the medical effects of cannabis on COVID-19, arguing that in times of a global pandemic, every possible treatment must be explored.", "opengraph": {"title": "Could Cannabis Prevent and Treat Coronavirus?", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2020/05/22215938/AdobeStock_348855415.jpeg?w=1000", "description": "In these times of global pandemic, scientists from all over the world are searching for the treatment and vaccine that can put an end to COVID-19. Well, this week, a group of researchers revealed a study that points to cannabis and its potential to act against the virus.", "type": "website", "url": "https://herb.co/news/health/could-cannabis-prevent-and-treat-coronavirus/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.preprints.org/manuscript/202004.0315/v1"], "authors": [], "publish_date": "2020-05-22T22:06:04"}