{"result_id": "156006", "URL": "https://herb.co/learn/how-does-cbd-work/", "timestamp": "2023-04-25 15:31:06 CEST+0200", "meta": {"description": "CBD is often touted as a miracle drug that cures everything from anxiety to muscle pain. Here’s what we actually know.\r\n\r\nCreated with Green Roads World.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/learn/how-does-cbd-work/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "How Does CBD Work?", "cleaned_text": "CBD is an anti-inflammatory that can help with seizures, joint pain and many other health problems. Plus, since CBD doesn’t get you high, it’s more accepted and easier to access than THC. Science is certain that CBD has positive effects on the body. What’s unknown is exactly which medical problems the cannabinoid can help. Despite this gap in knowledge, scientists have a fairly good understanding of how CBD affects the brain. This gives us some hints as to how it might be used as a medicine.\n\nWhat CBD does to the body\n\nAll cannabinoids, including cannabidiol, attach themselves to the endocannabinoid system in the brain. THC, for example, mostly binds to CB1 and CB2 receptors. CB1 and CB2 receptors play a role in many of the bodily functions that medical marijuana is known to help. CB1 receptors, when stimulated by psychoactive marijuana products, pour out neurotransmitters, which are what cause the ‘high’ feelings. CBD also affects the CB1 and CB2 receptors, but not directly. When it gets into the brain, it instead stimulates a bouquet of tertiary receptors in the endocannabinoid system. These include the adenosine receptor, which can help with bone and heart health; serotonin receptors which can help regulate mood and fight depression; and the capsaicin receptor, which is the same receptor spicy food stimulates. It helps regulate body temperature, inflammation, and pain management. As the body breaks down CBD, the compound acts as a fatty acid amide hydrolase (FAAH) inhibitor. When the FAAH enzyme is blocked, it can disrupt the CB1 receptors throughout the body. FAAH inhibitors have a ton of potential health benefits, however, it’s still controversial. One thing FAAH inhibitors do for certain is disrupt CB1 receptors. So, not only is CBD non-psychoactive, it actively suppresses the high people get from THC.\n\nWhat <a href=\"https://herb.co/news/health/cbd-oil-hpv-vaccines/\" class=\"CMY_Link CMY_Valid\">health problems</a> can CBD help?\n\nWhile it’s still inconclusive, there is strong anecdotal evidence and some scientific studies which suggest CBD can help people with epilepsy manage their seizures. One study suggests that cannabidiol can help manage addictions, specifically nicotine addiction. Smokers who used a CBD inhaler smoked 40 percent fewer cigarettes compared to a control group. The study’s authors point to the CB1 receptors’ role in rewarding addictive behavior and point out that cannabidiol has shown promising results in animal-addiction studies for more powerful drugs like methamphetamine. Orthopedic surgeons have also reported that many of their patients self-treat for their arthritis with a cannabidiol tincture or topical, but there’s little research investigating this.\n\nCBD has shown some promise as an <a href=\"https://www.greenroadsworld.com/collections/cbd-products/?rfsn=1545309.c3e2fb&utm_source=HerbSite&utm_medium=SEOArticle&utm_campaign=HowDoesCBDWork&utm_term=&utm_content=\" class=\"CMY_Link CMY_Redirect CMY_Valid\">anti-depressant</a> and anti-anxiety medication.\n\nCBD’s role in mental health is one of the most exciting, but least understood applications of the cannabinoid. CBD fans claim it helps with anxiety, depression, and focus, conditions which afflict millions of Americans and are often treated with prescription pills that have side effects. Still, interviews with doctors around the country reveal a wide range of opinions on the potential of this cannabinoid. Some suggest their patients try it while telling them there’s much more research to be done. Others say they’re not comfortable recommending it until they’ve got more data proving it works. Regardless, if you are going to give CBD a try, just make sure you’re buying the real stuff. Green Roads CBD products are developed by real pharmacists and are verified by third-party laboratories to guarantee their quality. Discover their line of products here.", "opengraph": {"title": "How Does CBD Work?", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2019/08/19105807/GettyImages-4605810321.jpg?w=1000", "description": "CBD is often touted as a miracle drug that cures everything from anxiety to muscle pain. Here’s what we actually know.\r\n\r\nCreated with Green Roads World.", "type": "website", "url": "https://herb.co/learn/how-does-cbd-work/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://herb.co/news/health/cbd-reduces-seizures/", "https://herb.co/learn/prestige-cbd/", "https://herb.co/news/health/cbd-research-public-speaking-fear/", "https://www.sciencedirect.com/science/article/abs/pii/S0885392409007878", "https://herb.co/marijuana/news/cannabis-endocannabinoid-system/", "https://www.researchgate.net/profile/Ken_Mackie/publication/15632742_Comparison_of_the_pharmacology_and_signal_transduction_of_the_human_cannabinoid_CB1_and_CB2_receptors/links/5474466a0cf245eb436dcf75.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/18537620", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1575333/", "https://www.sciencedirect.com/science/article/abs/pii/S016561470900128X", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4941643/", "https://www.epilepsy.com/connect/forums/living-epilepsy-adults/cbd-oil-seizures", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4604191/", "https://www.sciencedirect.com/science/article/pii/S0163725811001550", "https://www.greenroadsworld.com/collections/cbd-products/?rfsn=1545309.c3e2fb&utm_source=HerbSite&utm_medium=SEOArticle&utm_campaign=HowDoesCBDWork&utm_term=&utm_content=", "https://www.greenroadsworld.com/collections/cbd-products/?rfsn=1545309.c3e2fb&utm_source=HerbSite&utm_medium=SEOArticle&utm_campaign=HowDoesCBDWork&utm_term=&utm_content="], "authors": [], "publish_date": "2019-08-19T11:02:28"}