{"result_id": "156017", "URL": "https://herb.co/news/quebec-now-requires-a-vaccine-passport-when-buying-cannabis-and-alcohol/", "timestamp": "2023-04-25 15:31:19 CEST+0200", "meta": {"description": "This Canadian province is asking for proof of full vaccination when purchasing cannabis and alcohol.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/quebec-now-requires-a-vaccine-passport-when-buying-cannabis-and-alcohol/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Quebec Now Requires A Vaccine Passport When Buying Cannabis And Alcohol", "cleaned_text": "Vaccination requirements have been implemented well throughout the globe in order for the public to safely access indoor spaces, international flights, and public transit. But, one province in Canada is taking its protocol one step further.\n\nAccording to local news outlets in Quebec, Canada, the province now requires individuals to present vaccine passports when purchasing alcohol and cannabis. The new regulation will go into effect next week, on January 18.\n\nIn late December, Quebec’s capital city Montreal declared a state of emergency after witnessing the skyrocketing COVID-19 case numbers. Since September 2021, a vaccination passport has been required for ages 13 and older to access non-essential businesses in Quebec like bars, restaurants, casinos, places of worship, and sports facilities.\n\nThis vaccine passport requirement will be applied to individuals who want to buy alcohol from the Société Des Alcools du Québec (SAQ) or cannabis products at the Société Québécoise du Cannabis (SQDC). The SAQ is Quebec’s sole alcohol distributor, with more than 400 stores throughout the province. Similarly, the SQDC is the only non-medical legal retailer of cannabis in Quebec.", "opengraph": {"title": "Quebec Now Requires A Vaccine Passport When Buying Cannabis And Alcohol", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2022/01/06190219/image1.jpeg?w=1000", "description": "This Canadian province is asking for proof of full vaccination when purchasing cannabis and alcohol.", "type": "website", "url": "https://herb.co/news/quebec-now-requires-a-vaccine-passport-when-buying-cannabis-and-alcohol/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://herb.co/news/proof-of-full-vaccination-will-be-required-at-indoor-facilities-in-west-hollywood/", "https://herb.co/news/legalization/canada-ulimate-role-model-legalization/"], "authors": [], "publish_date": "2022-01-06T19:24:38"}