{"result_id": "156001", "URL": "https://herb.co/dispensaries/prohibition-herb-med-rec/", "timestamp": "2023-04-25 15:31:00 CEST+0200", "meta": {"description": "Herb", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/undefined/undefined/prohibition-herb-med-rec/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "PROHIBITION HERB – MED & REC", "cleaned_text": "Prohibition Herb has been serving the medical and recreational cannabis community since 2010! Fully compliant with Amendment 64, this Durango recreational dispensary is committed to offering only top quality cannabis products in a friendly and welcoming atmosphere. Established in 2010 as Animas Herbal Wellness Center, a medical marijuana dispensary, then expanded into the recreational market with the passing of recreational cannabis laws in 2014. Founded by a dedicated cannabis connoisseur who was passionate about serving his community, Prohibition Herb has continued to raise industry standards, and continually challenges the quality of their competition while providing superior customer service.\n\nThe Durango team at Prohibition Herb strive for complete customer satisfaction. The friendly staff at this Durango dispensary are committed to providing top quality cannabis products and are well educated on the products they carry. Prohibition Herb is dedicated to providing exceptional customer service and building relationships with their Durango cannabis community.\n\nWith over a hundred menu items, it is no wonder Prohibition Herb continues to be one of Durango’s leading recreational marijuana dispensaries. Their strains are grown in-house and have made the HIGH TIMES “Top 40 strongest Strains of All Time” list several times. Prohibition Herb is home to many strains including Gorilla Glue #4, Blue Dream, San Fernando Valley OG, Banana Kush, Alien Nightmare, East Coast Sour Diesel, Girl Scout Cookies, and many others. This dispensary’s vast selection of extracts includes concentrates from S.W.E.E.T. Co2 Oil, Newt Brothers, Craft, Glacier, Harmony, among others. Prohibition Herb also carries tinctures, capsules, topicals, and edibles including gummies, hard candies, and cannabis-infused beverages like Dixie Elixirs and OhHi drinks. In addition to their extensive menu, they also carry seeds from “The Bank”, smoking accessories, dabbing accessories, and full gram pre-rolls made with their high-quality in-house popcorn nugs.\n\nProhibition Herb proudly services the surrounding Durango communities including Durango, Farmington, Pagosa Springs, Shiprock, Los Alamos, Silvertion, Bayfield, and Alamosa. In Durango Colorado by Natural Grocers, and across the street from Baskin Robbins.", "opengraph": {"title": "PROHIBITION HERB – MED & REC", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2023/01/27080918/prohibition-herb-med-rec.jpg?w=1000", "description": "Herb", "type": "website", "url": "https://herb.co/undefined/undefined/prohibition-herb-med-rec/"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}