{"result_id": "156019", "URL": "https://herb.co/news/health/cbd-oil-hpv-vaccines/", "timestamp": "2023-04-25 15:31:21 CEST+0200", "meta": {"description": "HPV vaccines have long been controversial due to the long list of serious side effects documented by the World Health Organization.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/health/cbd-oil-hpv-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "New Research Says CBD Oil Could Improve Symptoms Of HPV Vaccines", "cleaned_text": "The HPV (Human papillomavirus) vaccine has long been controversial due to its long list of serious side effects documented by the World Health Organization (WHO) which include, complex regional pain syndrome (CRPS), postural orthostatic tachycardia syndrome (POTS), Dysautonomic syndrome, autonomic neuropathy, multiple system atrophy and chronic fatigue. Researchers in Israel may have found that CBD-rich hemp oil relieves the debilitating symptoms of HPV vaccines and can restore the quality of life of young girls affected.\n\nThe Israel Medical Association Journal sought “To investigate the short-term effect of CBD oil for relieving symptoms and improving the life quality in young girls with adverse drug effects following human papillomavirus vaccine.”\n\nResearchers observed 12 young women, ages 12-24 who had developed severe somatoform and dysautonomic syndrome following HPV vaccinations. Each subject was given sublingual, 25mg CBD-rich hemp oil drops per day over a three-month period.\n\nFour patients dropped out of the study (two of them leaving early due to lack of improvement), but the others displayed significant benefits in vitality, the reduction of body pain and improved social functioning.\n\nIn case you’re wondering, dysautonomic syndrome is a devastating disease that afflicts the autonomic nervous system. In a healthy teenager, Dysautonomia can negatively affect the proper function of the heart, bladder, intestines, blood vessels, thyroid glands and more.\n\nSymptoms can range from hypotension to weakness, low blood pressure, dizziness, difficulty swallowing, anxiety, blurred vision, urinary incontinence and more. Dysautonomia can be fatal by leading to cardiopulmonary rest or acute respiratory failure.\n\nAccording to the CDC,\n\nIn some of the latest figures, approximately 80 million Americans currently have HPV with 14 million new infections occurring each year. Apparently, HPV is such the epidemic that the CDC recommends that all 11 and 12-year-olds receive at least two doses of the vaccine, regardless of whether sexual activity is occurring.\n\nKeep in mind that approximately 70 percent of women and girls who become infected with HPV will heal naturally and without detection or treatment within the first year. That figure climbs to 90 percent within two years of infection, with only 5-10 percent acquiring an infection that progresses into precancerous lesions.\n\nIs the vaccine worth the risk?\n\nWith figures like these, it’s no wonder that many are debating the merits of the vaccine in the first place. Especially when annual pap smears to determine cervical health are already highly recommended.\n\nEven if CBD oil can help to alleviate resulting medical conditions, is the vaccine and evidently low-risk of developing cervical cancer worth risking the livelihood of young girls in the first place?\n\nDr. Dianne Harper, an OB/GYN who initially pushed for the HPV vaccine Gardasil, but now condemns it, says that such vaccines are not only useless but dangerous, saying,", "opengraph": {"title": "New Research Says CBD Oil Could Improve Symptoms Of HPV Vaccines", "image": "https://images.herb.co/wp-content/uploads/2017/07/CBD_Hemp_Oil_hero.jpg?w=1000", "description": "HPV vaccines have long been controversial due to the long list of serious side effects documented by the World Health Organization.", "type": "website", "url": "https://herb.co/news/health/cbd-oil-hpv-vaccines/"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.marijuanaandthelaw.com/wp-content/uploads/2015/11/Genny-CBD-Oil.jpg", "https://www.ima.org.il/imaj/viewarticle.aspx?year=2017&month=02&page=79", "http://www.dysautonomiainternational.org/images/dilogo.jpg", "https://sciblogs.co.nz/app/uploads/2015/09/16727-a-nurse-giving-a-young-girl-a-vaccine-shot-pv.jpg", "https://vaccineimpact.com/wp-content/uploads/sites/5/2016/07/Gardasil-needle.jpg", "https://www.cbsnews.com/news/gardasil-researcher-speaks-out/"], "authors": [], "publish_date": "2017-07-26T05:22:10.000Z"}