{"result_id": "156004", "URL": "https://herb.co/news/newly-reimposed-mask-mandate-will-not-be-enforced-by-la-county-sheriff/", "timestamp": "2023-04-25 15:31:03 CEST+0200", "meta": {"description": "While COVID-19 continues to take its toll on lives everywhere, LA County Sheriff Villanueva gives an update on the reimposed mask mandate.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/newly-reimposed-mask-mandate-will-not-be-enforced-by-la-county-sheriff/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Newly Reimposed Mask Mandate Will Not Be Enforced By LA County Sheriff", "cleaned_text": "As the Delta variant has swept the nation, Los Angeles County Sheriff Alex Villanueva released a statement on Friday which mentioned that he would not enforce the recently reinstated indoor mask mandate.\n\nThe statement was released a day after the Los Angeles County public health officials announced its reimposed mask mandate due to the alarming rise in COVID-19 cases. During Villanueva’s statement, he mentioned, “Forcing the vaccinated and those who already contracted COVID-19 to wear masks indoors is not backed by science and contradicts the U.S. Centers for Disease Control and Prevention (CDC) guidelines.”\n\n“The Los Angeles County Department of Public Health (DPH) has authority to enforce the order, but the underfunded/defunded Los Angeles County Sheriff’s Department will not expend our limited resources and instead ask for voluntary compliance.”\n\nFollowing six straight days of more than 1,000 new COVID-19 cases in Los Angeles County with nearly 400 hospitalized was the Los Angeles County Department of Public Health’s press release on Thursday.\n\nThe release noted, “We’re requiring masking for everyone while indoors at public settings & businesses, regardless of vaccination status so that we can stop the increased level of transmission we’re seeing.”\n\nContinued, “Because of this rapid rise, as well as the increasing presence of the more easily transmitted Delta variant of the virus, and the millions of people potentially at risk of infection, together we must reduce our risk of infection and our risk for potentially infecting others.”", "opengraph": {"title": "Newly Reimposed Mask Mandate Will Not Be Enforced By LA County Sheriff", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2021/09/07211425/LAPD-COVID.jpeg?w=1000", "description": "While COVID-19 continues to take its toll on lives everywhere, LA County Sheriff Villanueva gives an update on the reimposed mask mandate.", "type": "website", "url": "https://herb.co/news/newly-reimposed-mask-mandate-will-not-be-enforced-by-la-county-sheriff/"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-09-07T21:19:19"}