{"result_id": "156021", "URL": "https://herb.co/news/health/cannabis-enhances-epilepsy-meds/", "timestamp": "2023-04-25 15:31:23 CEST+0200", "meta": {"description": "Researchers are finding that cannabis used in conjunction with current epilepsy drugs are demonstrating heightened results.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/health/cannabis-enhances-epilepsy-meds/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Scientists Confirm That Cannabis Enhances The Effects Of Epilepsy Meds", "cleaned_text": "When it comes to its therapeutic and healing properties, the beauty of cannabis is that it not only functions well on its own; it also boosts the effectiveness of several pharmaceuticals used in serious conditions like HIV and cancer. Now, research is proving that it also enhances the effects of anti-epilepsy medications. After all, it’s becoming common knowledge that cannabis has powerful anti-epileptic effects, particularly in children (see: Charlotte’s Web), but now researchers are finding that cannabis used in conjunction with current epilepsy drugs are demonstrating heightened effects across the board.\n\nCannabis affects the liver’s enzyme system, which processes the different chemicals that we ingest from various sources and this increases the potency of certain medications in the bloodstream.\n\nTo back this up, the Official Journal of the International League Against Epilepsy recently published a study in which 81 epileptic patients were given doses of CBD beginning at 5 mg per day and increasing the dose to up to 50 mg per day. The scientists measured the levels of anti-epileptic drugs in the blood and found significant increases among them the more CBD was used.\n\nAs mentioned earlier, a vast amount of studies on CBD’s treatment of epilepsy show significant decreases in the frequency of seizures, pain, fatigue, and fever associated with the condition.\n\nThe theory is that CBD binds to a receptor in the brain that dampens its electrical activity, which is something that the average seizure medication cannot seem to accomplish.\n\nCBD brings out the best in so many things\n\nLike with THC or caffeine, CBD seems to enhance the effects of many substances. This is highly beneficial as it could lead many individuals to use many substances less, while achieving the same results. Taking fewer prescriptions or them in lower doses, for instance, is not only much safer, but more affordable for patients in the long run.\n\nPlus, the anti-inflammatory properties of CBD make it a powerful complement to current therapies on the market. For instance, last year Cannabis Science Inc. decided to add cannabinoids to IGXBio HIV/AIDS vaccine in hopes that it would further diminish some of the harsh symptoms of the disease.\n\nMore recently, the Israel Medical Association Journal investigated the effects of CBD oil for reducing debilitating symptoms resulting from the HPV vaccine and these are only a couple examples.\n\nThis acknowledgement by medical professionals and pharmaceutical companies is key, since they may be more open to utilizing CBD’s effects in conjunction with their meds, rather than replacing them with CBD.\n\nAll in all, CBD is becoming an amazing pharmacological tool in the treatment of an array of medical conditions.", "opengraph": {"title": "Scientists Confirm That Cannabis Enhances The Effects Of Epilepsy Meds", "image": "https://images.herb.co/wp-content/uploads/2017/09/epilepsy.jpg?w=1000", "description": "Researchers are finding that cannabis used in conjunction with current epilepsy drugs are demonstrating heightened results.", "type": "website", "url": "https://herb.co/news/health/cannabis-enhances-epilepsy-meds/"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.hcs.harvard.edu/~hghr/wp-content/uploads/2012/10/S12-Pharmaceuticals.jpeg", "https://onlinelibrary.wiley.com/doi/abs/10.1111/epi.13852", "https://herb.co/learn/what-is-cbd/", "http://www.wweek.com/resizer/EROSrC8-0_kWJjvumpafSSG5jGo=/1200x0/filters:quality(100)/s3.amazonaws.com/arc-wordpress-client-uploads/wweek/wp-content/uploads/2017/03/13110015/potlander_coffeeWeed_Crema_JakeSouthard.jpg", "https://herb.co/learn/what-is-thc/", "https://herb.co/learn/mix-weed-caffeine/", "https://herb.co/news/health/hiv-aids/", "https://herb.co/news/health/cbd-oil-hpv-vaccines/"], "authors": [], "publish_date": "2017-09-16T18:10:11.000Z"}