{"result_id": "156018", "URL": "https://herb.co/news/legalization/jay-z-and-his-legal-team-are-fighting-to-release-a-man-serving-20-years-in-prison-for-weed-charges/", "timestamp": "2023-04-25 15:31:20 CEST+0200", "meta": {"description": "Twenty years in prison for weed?", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/legalization/jay-z-and-his-legal-team-are-fighting-to-release-a-man-serving-20-years-in-prison-for-weed-charges/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Jay-Z And His Legal Team Are Fighting To Release A Man Serving 20 Years In Prison For Weed Charges", "cleaned_text": "Rapper and entrepreneur Jay-Z is lending a helping hand to one of his fans in need. Hov’s legal team has made two pleas to a North Carolina Judge, asking for the “compassionate release” of Valon Vailes, who’s facing a 20-year sentence for marijuana-related charges, discovered Page Six. Back in December 2007, Valon Vailes was charged with conspiring to possess more than one ton of marijuana from 2003 – 2007 with the intent to distribute. As a result, the 55-year-old was sentenced to 20 years in prison with an additional 10-year release under supervision.\n\nOn Wednesday, Page Six obtained the submitted court documents that state attorney Alex Spiro’s second attempt to help Vailes by asking the court to graciously reconsider their first request for a “compassionate release,” which was dropped because of Vailes’ Covid-19 vaccination record. “Mr. Vailes’ motion for compassionate release does not mention COVID-19 and does not rely on any COVID-19-related argument as a basis for arguing in favor of a reduced sentence,” Spiro debated. Spiro is an active member of Jay-Z’s legal team and was first informed of the situation when Vailes wrote a deeply merciful and compelling letter to the rapper, owner of the cannabis company Monogram, and investor in canna-tech company Flowhub.\n\nThe letter was written to Jay-Z from Vailes in February at New York’s Otisville Correctional Facility and was exclusively obtained by Page Six. “This correspondence is a plea to ask for your help with the intent to campaign for my clemency,” the letter explained. “13 and a half years is a long time to be still incarcerated over a substance that has become the ultimate green rush.” He continued by explaining how his family is in dire need of Vailes to return home. “While incarcerated, I have lost loved ones,” the letter read. “My mother passed in 2020; my grandmother in 2009; my nephew in 2020. Also, my best friend died from COVID in 2021. I have four children, and the youngest is 1.4, and 3 grand-daughters.”\n\nVailes also mentioned his admiration for Jay-Z’s career and his endeavors for the “underprivileged and voiceless,” stated a report in The Wall Street Journal. “A lot has changed in my life, but most importantly, I have a newfound view of society. Therefore, I pledge to my family, my children, and myself that my incarceration would not be in vain,” the letter concluded. Hov and his legal team were touched by Vailes’ initiative to reach out to the rapper, and they acted fast to serve justice to Vailes and his family. In August, the initial request for a compassionate release states that Vailes was a “model inmate” and mentioned how he’s completed coursework, drug treatment and that his family “desperately needs his support and assistance, and he does not present a recidivism risk.”\n\nOn Wednesday, attorney Sprio asked the judge to release Vailes due to his cooperation with the system and time served. “Mr. Vailes is the solely available caretaker for his mentally ill brother, who is in desperate need of Mr. Vailes’ support,” asked Spiro. “It is unjust to allow Mr. Vailes to remain in prison when, if sentenced under the current law, and with his good behavior credits, he would have already been released,” he concluded. The Valon Vailes’ release petition is up and running and has almost reached its mark of 25,000 signatures. Sign the petition here.", "opengraph": {"title": "Jay-Z And His Legal Team Are Fighting To Release A Man Serving 20 Years In Prison For Weed Charges", "image": "https://herb-platform-images.imgix.net/wp-content/uploads/2021/10/25222122/feature-201.jpeg?w=1000", "description": "Twenty years in prison for weed? ", "type": "website", "url": "https://herb.co/news/legalization/jay-z-and-his-legal-team-are-fighting-to-release-a-man-serving-20-years-in-prison-for-weed-charges/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://herb.co/news/industry/jay-z-invests-in-cannabis-tech-company-flowhub/", "https://www.change.org/p/non-violent-man-locked-up-for-20-years-for-marijuana-free-valon-m-vailes"], "authors": [], "publish_date": "2021-10-25T22:29:50"}