{"result_id": "156012", "URL": "https://herb.co/news/health/is-cannabis-the-secret-to-better-hiv-drugs/", "timestamp": "2023-04-25 15:31:14 CEST+0200", "meta": {"description": "A new HIV/AIDS drug may be just around the corner. What's so special about this one? It uses cannabinoids.", "lang": "en", "keywords": "", "favicon": "/favicon-32x32.png?v=fae7062f264aa941a99dd17d306b226c", "canonical": "https://herb.co/news/health/is-cannabis-the-secret-to-better-hiv-drugs/", "encoding": "utf-8"}, "image": null, "domain": "herb.co", "title": "Is Cannabis The Secret To Better HIV Drugs?", "cleaned_text": "There’s a new treatment approach on it’s way for HIV/ AIDS patients. Cannabis Science Inc., a drug company which seeks to create new cannabinoid-based drugs, has partnered with IGXBio, another drug and medical technology company, to develop a new HIV/AIDs treatment. Could cannabis be the secret to curing HIV/AIDS? The creators of this new vaccine-like drug hope so!\n\nThe partnership was first announced last year. Cannabis Science Inc. will be adding cannabinoids to IGXBio’s advanced DNA immunotherapy. The hope is that the strong anti-inflammatory effects of cannabinoids will make the therapy a more holistic treatment. Theoretically, not only will IGXBio’s product, GenePro, help facilitate the body’s own immune response to the virus, but the addition of cannabinoids will provide the anti-inflammatory boost needed to help reduce some of the harms of the disease.\n\nA need for new treatment\n\nHIV/AIDS patients are currently treated with high doses of retrovirals. Though retrovirals have been the most effective treatment for the disease that we’ve seen thus far, they’re hardly the perfect treatment. HIV can make a home for itself deep inside the bone marrow, and copies of the virus can be found inside the brain.\n\nRetrovirals do little to combat the havoc caused inside the brain in advanced cases of HIV/AIDS. This can lead to HIV-associated cognitive impairment (HANDS). Even with retroviral treatment, the inflammation associated with HIV can lead to several other comorbid conditions. Some of these conditions can be deadly: heart disease, bone disease, and certain cancers.\n\nIn a press release announcing the partnership, Raymond C Dabney, President and CEO if Cannabis Science, explains:\n\nMarijuana has been prescribed as an alternative approach to managing some of the harsh symptoms of HIV/AIDS for over a decade in some states. The plant’s strong anti-nausea and pain-fighting properties have made it a go-to choice to improve the quality of life in those who suffer from this deadly virus.\n\nIn fact, cannabinoid-based drugs are already prescribed to many HIV/AIDS patients for nausea. Marinol is a synthetic THC substitute that was approved to prevent excessive weight loss and stimulate appetite in both cancer patients and those with HIV.\n\nWhile we’ve known for quite a while that marijuana can help patients cope with debilitating diseases. Cannabis Science, Inc. hopes to tap into the plant’s more direct therapeutic properties. By combining cannabis medicines with the experimental DNA immunotherapy, it’s hoped that a powerful, more holistic, and more effective medicine can be created.\n\nIGX Bio’s new treatment, GenePro, releases certain proteins that block the replication of HIV. If used in tandem with cannabinoid treatment, researchers hope that the synergistic effects of both therapy will shine through. GenePro would hopefully block the virus from continuing to replicate, and cannabinoids would offer DNA-protecting antioxidant and anti-inflammatory properties. Both companies are expected to expand their California drug development and research program this year.\n\nThough it will be a while before see any cannabis-based HIV/AIDS therapies in the doctor’s office, the research and current trials from Cannabis Science and IGX Bio are an extremely positive sign. Like GW Pharmaceuticals’ Sativex, the work done by Cannabis Science and IGX Bio is another example of how far we’ve come in the marijuana world. From basement growers to cannabinoids incorporated into immunotherapy, the advancements just keep coming. Here’s hoping to successful drug trails for those battling HIV/AIDS.\n\nDo you have experience using cannabis in your HIV/AIDS treatment? Does someone you know? Share your story with us on social media or in the comments below.", "opengraph": {"title": "Is Cannabis The Secret To Better HIV Drugs?", "image": "https://images.herb.co/wp-content/uploads/2016/04/Better-HIV-Drugs-hero.jpg?w=1000", "description": "A new HIV/AIDS drug may be just around the corner. What's so special about this one? It uses cannabinoids.", "type": "website", "url": "https://herb.co/news/health/is-cannabis-the-secret-to-better-hiv-drugs/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.globenewswire.com/news-release/2015/11/02/1239560/0/en/Cannabis-Science-to-Begin-Its-Drug-Development-Program-With-IGXBio-and-Its-GenePro-R-DNA-Based-Immunotherapeudic-FDA-IND-Approved.html", "https://www.medscape.com/viewarticle/719383_5", "https://herb.co/learn/medical-marijuana-right/", "https://herb.co/guides/marinol-vs-thc-whats-difference/", "https://www.globenewswire.com/news-release/2016/03/18/1240974/0/en/Positive-Cannabinoid-Testing-Data-in-California-Prompts-Cannabis-Science-Lab-Expansions-for-IGXBio-s-GenePro-FDA-Investigational-New-Drug-IND-Number-015982-for-Further-Drug-Develop.html", "https://herb.co/learn/what-is-sativex/", "https://www.facebook.com/TheStonersCookbook"], "authors": [], "publish_date": "2016-04-07T16:17:51.000Z"}