{"result_id": "159026", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0040-1708489", "timestamp": "2023-04-25 15:31:53 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0040-1708489", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Objective Vaccination is the most effective and safest approach to protect public health and to prevent infectious diseases. Despite its great benefits, there has been a growing sense of distrust in the safety of vaccines and vaccination programs, leading to unwillingness to vaccinate or even refusal of vaccines altogether. The aim of this study was to determine parental attitudes toward vaccination and to derive information that would help develop appropriate strategies to tackle vaccine hesitancy and refusal (V-HR).\n\nMethods A 15-item questionnaire was administered during a face-to-face interview with 1,440 parents (88.1% women, median age: 32 years) whose children were followed up and treated in pediatric outpatient and/or inpatient clinics between July and September 2019. The influential factors on parental V-HR were statistically analyzed.\n\nResults The majority of the parents were in favor of vaccination without doubt (n = 1,184, 82.2%). The overall V-HR rate was 17.8%, with 16% of the parents (n = 230) expressing hesitancy and 1.8% (n = 26) completely refusing vaccination. Educational status significantly affected V-HR (p = 0.001), with a higher proportion of V-HR parents having a higher educational level (high school–university) than those having a lower educational status. The prevalence of V-HR was significantly higher among parents who drew vaccination-related information from written, visual, and social media (p < 0.001). Among the 256 parents, parental V-HR most commonly arose from perceived risk and safety concerns, with the feeling that vaccines might lead to another disease such as autism (57%), and the fear that vaccines might cause side effects (33%).\n\nConclusion Parental V-HR has transformed into an alarming global health problem. Of particular importance is monitoring and assessing parental V-HR in every aspect, particularly the media sources that continuously disseminate misinformation about vaccination. Besides nationwide projects to encourage vaccination, appropriate utilization of the same media sources is needed to counteract V-HR and enhance awareness about the necessity and lifesaving benefits of vaccination.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/10.1055-s-00029028/202004/lookinside/10-1055-s-0040-1708489_1900105-1.jpg", "/products/ejournals/buyDocument/10.1055/s-0040-1708489"], "authors": ["yakupcag@hotmail.com", "Yakup Çağ", "Department of Pediatrics, University of Health Sciences Kartal Dr Lufti Kirdar Training and Research Hospital, Istanbul, Turkey", "0000-0002-3855-7280"], "publish_date": null}