{"result_id": "159034", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1735878", "timestamp": "2023-04-25 15:31:57 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1735878", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Objective The aim of the study was to evaluate pregnant women's attitudes toward COVID-19 illness and vaccination and identify factors associated with vaccine acceptability.\n\nStudy Design This was a cross-sectional survey among pregnant women enrolled in a prospective COVID-19 cohort study in Salt Lake City, UT, Birmingham, AL, and New York, NY, from August 9 to December 10, 2020. Women were eligible if they were 18 to 50 years old and <28 weeks of gestation. Upon enrollment, women completed surveys regarding concerns about COVID-19 illness and likelihood of getting COVID-19 vaccine if one were available during pregnancy. Vaccine acceptability was defined as a response of “very likely” or “somewhat likely” on a 4-point Likert scale. Factors associated with vaccine acceptability were assessed with multivariable logistic regression.\n\nResults Of 939 pregnant women eligible for the main cohort study, 915 (97%) consented to participate. Among these 915 women, 39% self-identified as White, 23% Black, 33% Hispanic, and 4% Other. Sixty-two percent received an influenza vaccine last season. Seventy-two percent worried about getting sick with COVID-19. If they were to get sick, 92% worried about harm to their pregnancy and 80% about harm to themselves. Only 41% reported they would get a vaccine. Of women who were unlikely to get vaccinated, the most frequently cited concern was vaccine safety for their pregnancy (82%). Non-Hispanic Black and Hispanic women had lower odds of accepting a vaccine compared with non-Hispanic White women (adjusted odds ratios [aOR] 0.4, 95% CI 0.2–0.6 for both). Receipt of influenza vaccine during the previous season was associated with higher odds of vaccine acceptability (aOR 2.1, 95% CI 1.5–3.0).\n\nConclusion Although most pregnant women worried about COVID-19 illness, <50% were willing to get vaccinated during pregnancy. Racial and ethnic disparities in plans to accept COVID-19 vaccine highlight the need to prioritize strategies to address perceived barriers among groups at high risk for COVID-19.\n• Protecting their baby was the most common reason for acceptance and refusal of the COVID-19 vaccine.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/ajp/202201/lookinside/10-1055-s-0041-1735878_210081-1.jpg", "/products/ejournals/buyDocument/10.1055/s-0041-1735878"], "authors": ["Department of Obstetrics and Gynecology, New York-Presbyterian Hospital, New York, New York", "Abt Associates, Bethesda, Maryland", "Celibell Vargas", "Melissa S. Stockwell", "Department of Pediatrics, Division of Child and Adolescent Health, Columbia University Irving Medical Center, New York, New York", "Tiffany J. Chen", "Michael Daugherty", "0000-0002-4837-8059", "Akila Subramaniam", "Center for Women's Reproductive Health and Department of Obstetrics and Gynecology, Division of Maternal-Fetal Medicine, University of Alabama at Birmingham, Birmingham, Alabama", "Emily Powers", "Miriam Lucca-Susana", "0000-0001-9455-3973", "anbattarbee@uabmc.edu", "0000-0001-9837-0699", "Fatimah S. Dawood", "Michael Varner", "Hilda Razzaghi", "Cynthia Gyamfi-Bannerman", "Department of Obstetrics and Gynecology, University of Utah Health Sciences Center, Salt Lake City, Utah", "Department of Population and Family Health, Mailman School of Public Health, Columbia University Irving Medical Center, New York, New York", "Alan T. Tita", "Centers for Disease Control and Prevention, Atlanta, Georgia", "Gabriella Newes-Adeyi", "Lawrence Reichle", "Romeo R. Galang", "Mickey Parks", "Kelly Vorwaller", "Ashley N. Battarbee", "Department of Obstetrics and Gynecology, Division of Maternal-Fetal Medicine, Columbia University Irving Medical Center, New York, New York"], "publish_date": null}