{"result_id": "159010", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1754389", "timestamp": "2023-04-25 15:31:44 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1754389", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Seminars in Thrombosis and Hemostasis / Abstract", "cleaned_text": "Acquired hemophilia A (AHA), a rare but life-threatening disorder, most commonly occurs in older people and during pregnancy. During the coronavirus disease 2019 (COVID-19) vaccination campaign, an unexpected number of newly diagnosed AHA patients have been identified in clinical practice that were temporally related to COVID-19 vaccination. We present the result of a signal detection analysis aimed at exploring a possible association between COVID-19 immunization and occurrence of AHA. A disproportionality analysis on the World Health Organization (WHO) database was performed to investigate the presence of a signal of risk for AHA associated with COVID-19 vaccines. Reports of AHA associated with any COVID-19 vaccine included in the WHO database were then integrated with those available on the Food and Drug Administration Vaccine Adverse Events Reporting System and those published in the medical literature. The WHO database included 146 reports of AHA. The information component (IC) was significant for the association of AHA with all COVID-19 vaccines (IC025: 1.1) and with the vaccine product BNT162b2 (IC025: 1.6). After duplicate exclusion, 96 unique cases of AHA following COVID-19 vaccines have been reviewed. Median time to diagnosis was 18 days and 40% of cases documented the occurrence after the second dose. Overall, in 57% of the investigated cases, a preexisting condition predisposing to AHA was excluded. About 22% of cases occurred in subjects with age ≤65 years and there was no case associated with pregnancy. Mortality was 11%. Although we cannot exclude that the unexpected frequency of AHA diagnosis can be explained by a detection bias, the signal for COVID-19 vaccine-related AHA is robust and deserves further investigations.\n\nM.F., M.T., and D.F. conceived and developed the presented idea. M.F. and D.F. wrote the first draft. U.M. curated [Table 1]. E.C., G.V., and M.B. curated [Fig. 1], [Tables 2]–[4], and supplementary data. M.T. wrote the paper with input from all the authors.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "https://www.thieme-connect.de/media/sth/202301/lookinside/10-1055-s-0042-1754389_03014-1.jpg", "#TB03014-1", "#FI03014-1", "#TB03014-2", "#TB03014-4", "https://www.thieme-connect.de/media/sth/202301/supmat/10-1055-s-0042-1754389-s03014.pdf"], "authors": ["Emiliano Cappello", "Giulia Valdiserra", "Section of Pharmacology, Department of Diagnostics and Public Health, University of Verona, Verona, Italy", "North-Western Tuscany Blood Bank, Pisa University Hospital, Pisa, Italy", "Massimo Franchini", "Unit of Adverse Drug Reaction Monitoring, University Hospital of Pisa, Pisa, Italy", "Daniele Focosi", "Marco Tuccori", "emilianocappello@gmail.com", "Division of Transfusion Medicine, Carlo Poma Hospital, Mantua, Italy", "Ugo Moretti", "Marco Bonaso", "Unit of Pharmacology and Pharmacovigilance, Department of Clinical and Experimental Medicine, University of Pisa, Pisa, Italy"], "publish_date": null}