{"result_id": "159005", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1467-5956", "timestamp": "2023-04-25 15:31:41 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1467-5956", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Drug Research / Abstract", "cleaned_text": "During the next few months or years, vaccination against SARS-CoV-2 infection will significantly reduce the morbidity and mortality of COVID-19. However, additional measures are needed to protect those who are still not immunized. This is even more important in view of new viral mutations that result in increased transmission rates. We propose that the use of long-standing medicinal solutions based on hypochloric acid (HOCl) and intended for application on wounds may be effective as a gargling solution or nasal irrigation in blocking transmission of the virus. Here, we propose the use of HOCl-containing solutions for blocking the transmission of SARS-CoV-2 in combination with other prevention measures. This may constitute another important cornerstone in the fight against the COVID-19 pandemic.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/a-1467-5956", "javascript:;", "https://www.thieme-connect.de/media/drugres/202106/lookinside/2021-03-2245_10-1055-a-1467-5956-1.jpg"], "authors": ["Institute of Experimental and Clinical Pharmacology and Toxicology, Friedrich-Alexander-Universität Erlangen-Nürnberg, Erlangen, Germany", "Bertold Renner", "Michael Winter", "Christian A. Mueller", "Department of Otorhinolaryngology, Medical University of Vienna, Vienna, Austria", "Team Winter Kompetenztraining, Vienna, Austria", "bertold.renner@tu-dresden.de", "Institute of Clinical Pharmacology, Medical Faculty Carl Gustav Carus, Technische Universität Dresden, Dresden, Germany"], "publish_date": null}