{"result_id": "159049", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1741052", "timestamp": "2023-04-25 15:32:04 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1741052", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Indian Journal of Radiology and Imaging / Abstract", "cleaned_text": "Context Computerized tomography (CT) is an invaluable imaging investigation for evaluating COVID-19 disease. CT detects early changes of COVID-19 pneumonia and predicts the disease prognosis based on a semiquantitative 25-point CT severity score (CT-SS). India launched its vaccination drive in January 2021 with two different vaccines being approved by the government. These vaccines are believed to prevent the disease itself, in majority of the cases and at least decrease disease severity, in the rest.\n\nSubjects and Methods A total of 3,235 patients with typical COVID-19 related imaging findings on HRCT thorax were included in the study. These subjects were divided into three age categories, 18–44, 45–59 and ≥60 years. The CT severity scores were allotted by experienced radiologists. Medians of the scores in different age groups were compared amongst vaccinated and non-vaccinated individuals using the Kruskal–Wallis H test. A p-value < 0.05 was considered significant. All results were shown with 95% confidence interval.\n\nResults The difference in the medians amongst the vaccinated and non-vaccinated groups was significant, p-values being < 0.001 in all age categories.\n\nConclusion The mean CT-SS was less in vaccinated subjects and the difference in median CT-SS amongst vaccinated and non-vaccinated individuals was statistically significant, thus sending an important message that it is mandatory for the population at large to get vaccinated to reduce infection rate/disease severity.\n\nThe authors certify that they have obtained all appropriate patient consent forms. In the form, the patient(s)has/have given his/her/their consent for his/her/their images and other clinical information to be reported in the journal. The patients understand that their names and initials will not be published, and due efforts will be made to conceal their identity, but anonymity cannot be guaranteed.\n\n© 2022. Indian Radiological Association. This is an open access article published by Thieme under the terms of the Creative Commons Attribution-NonDerivative-NonCommercial License, permitting copying and reproduction so long as the original work is given appropriate credit. Contents may not be used for commercial purposes, or adapted, remixed, transformed or built upon. (https://creativecommons.org/licenses/by-nc-nd/4.0/)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "https://www.thieme-connect.de/media/10.1055-s-00050590/202104/lookinside/10-1055-s-0041-1741052_2160562-1.jpg"], "authors": ["Vandana Jahanvi", "Department of Radiodiagnosis and Imaging, Bharati Vidyapeeth Deemed to be University Medical College and Hospital, Pune, Maharashtra, India", "Mangal S. Mahajan", "vandana.jahanvi@gmail.com", "Priyankkumar G. Moradiya", "Priscilla C. Joshi", "Shivani N. Pawar", "Nivedita C. Ghule Patil"], "publish_date": null}