{"result_id": "159021", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1690-0322", "timestamp": "2023-04-25 15:31:51 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1690-0322", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Nervenheilkunde / Full Text", "cleaned_text": "Seit mehr als 2 Jahren verschlägt eine globale SARS-CoV-2-Pandemie den Menschen den Atem – mit bislang weltweit mehr als einer Drittelmilliarde Infektionen, mehr als 5,6 Millionen an und mit COVID-19 Verstorbenen, und derzeit täglich auf neue Rekordhöhen ansteigenden Infektionszahlen (Stand: 26.1.22). Glücklicherweise gibt es seit mehr als einem Jahr[ 1 ] eine neue Klasse sehr wirksamer Impfstoffe und in einem beispiellosen Tempo erfolgten zwischenzeitlich etwa 10 Milliarden Impfungen weltweit.[ 2 ] An den Grundlagen zu diesen Impfstoffen wurde mehr als 20 Jahre lang geforscht. Wie es sich darstellt, ist ihr Wirkungsmechanismus sicherer als die früheren Generationen von Impfstoffen, ihre Wirkung effizienter und die Nebenwirkungen geringer. Langzeitfolgen der Impfung sind aufgrund des neuen Wirkprinzips, dass man zunächst für Krebstherapien erforscht hat, nicht zu erwarten, denn die Wirkung erfolgt über einen Botenstoff – messenger-RNA, der überhaupt nur deswegen Botenstoff ist, weil er schnell abgebaut wird (und eben gerade nicht lange im Körper verbleibt). Die Langzeitfolgen der Krankheit COVID-19 dagegen, die auch bei jungen Menschen und nach zunächst leicht verlaufender Infektion auftreten können, sind mitunter schwerwiegend. Man spricht mittlerweile von „Long-Covid“, was über Monate andauernde Abgeschlagenheit, verminderte Aufmerksamkeit, reduzierte Fähigkeit zum Denken und vor allem allgemeine Leistungsminderung (Arbeitsunfähigkeit) und Leid bedeutet.\n\nAngesichts dieser Situation erscheint zunächst völlig unverständlich, warum in Deutschland und Europa noch immer viele Menschen behaupten, die Infektion mit dem Corona-Virus sei ungefährlich oder sogar, es gäbe sie gar nicht, und als Konsequenz die Impfung verweigern. Sie gehen auf die Straße, um zu demonstrieren, Randalierer mischen sich oft darunter, und im Fernsehen sind Szenen zu sehen, die aussehen wie Bürgerkrieg. Würde es sich hier um einige wenige handeln, gäbe es keinen Anlass für eine weitere Diskussion. Es sind aber seit Monaten in den verschiedensten Städten Tausende Menschen. Am 22.1.22 demonstrierten beispielsweise in Brüssel 70 000 gegen die Maßnahmen der Regierungen Europas zur Eindämmung der seit Wochen in nicht dagewesenem Ausmaß ansteigenden Infektionen mit SARS-CoV-2. Der soziale Frieden und vor allem der soziale Zusammenhalt in Gesellschaften im Herzen Europas scheint gefährdet. Dabei ist sich die Wissenschaft darüber einig, dass es erstens SARS-CoV-2 tatsächlich gibt und dass zweitens Impfen ganz allgemein zu den Erfolgsgeschichten der Medizin gehört: Schwere Krankheiten wie Kinderlähmung und Pocken sind verschwunden und viele andere Krankheiten haben ihren Schrecken verloren. Warum also kommt es dann zu diesen Ausschreitungen, die von Hass gegen die Obrigkeit („das System“) und Misstrauen gegenüber wissenschaftlichen Erkenntnissen einerseits und Ärzten andererseits getragen werden, obwohl Wissenschaft und Medizin ansonsten die höchsten Vertrauenswerte haben. Wer ein Auto oder Flugzeug besteigt, über eine Brücke läuft oder sich operieren lässt, tut dies nur aufgrund dieses Grundvertrauens.\n\nEs muss an dieser Stelle betont werden, dass es unter den Menschen, die z. B. an „Corona-Demonstrationen“ teilnehmen, Unterschiede in der „Breite“ und Stärke der Corona-Skepsis gibt. Viele Menschen möchten sich einfach nur wieder ungehinderter miteinander treffen und austauschen – ein sehr gesundes und nachvollziehbares Bedürfnis. Andere sind nicht generell gegen die Impfung, sondern nur gegen den Impfzwang, was aus meiner Sicht durchaus begründbar ist. Wieder andere sind mit einzelnen Aspekten der Maßnahmen gegen die Verbreitung des Erregers SARS-CoV-2 nicht einverstanden oder weisen auf Inkonsistenzen hin. Einzelne Menschen (und das ist sicher eine kleine Minderheit) bereiten sich jedoch auf den Weltuntergang vor, besorgen Waffen, horten Nahrungsmittel und glauben tatsächlich daran, dass die Vernichtung der Menschheit unmittelbar bevorstehe.\n\nTrotz der mit Sicherheit vorliegenden großen Heterogenität der Sichtweisen und Meinungen im Hinblick auf die Besonderheiten und das Ausmaß von Skepsis gegenüber der Corona-Pandemie, den ergriffenen Maßnahmen und der Impfung liegen zu diesem weltweit Dutzende von Studien vor, von denen einige in [ Tab. 1 ] zusammenfassend für eine bessere Übersicht zu deren Ergebnissen dargestellt wurden. Menschen, die entweder die Gefahren durch SARS-CoV-2 leugnen oder sogar dessen Existenz, fühlen sich weniger informiert, haben weniger Vertrauen in die staatlichen Maßnahmen zur Eindämmung des Virus, und verhalten sich in geringerem Maße nach den Sicherheitsvorschriften der Behörden, wie eine Befragung von 3487 Personen im Alter von 35 bis 45 Jahren im November 2020 während des zweiten Lockdowns ergab [36]. Interessanterweise waren Ängste vor dem Corona-Virus bei Leugnern und Nichtleugnern gleich stark ausgeprägt, generalisierte Ängste (p = 0,004) und Depressionen (p < 0,0001) waren bei Leugnern dagegen signifikant erhöht. Die Autoren vermuten, dass dies durch den erlebten Kontrollverlust in Corona-Zeiten sowie durch einen geringeren Wissensstand bedingt sein könnte.\n\nEine Gruppe von Wissenschaftlern aus Eschweiler, Hamburg, Aachen, Köln, Bonn und Regensburg untersuchte die Einstellung zur Impfung gegen SARS-CoV-2 von deutschen Krankenhausmitarbeitern vor (n = 2305) und nach (n = 3501) Beginn der Impfungen mittels zweier Umfragen im Dezember 2020 und Februar 2021 [15]. Die Einschätzung der Bedeutung der Impfung für eine wirkungsvolle Eindämmung der Corona-Pandemie stieg von Dezember bis Februar von 85,2 % auf 92,1 % an. Im Vergleich zu Männern schätzten Frauen die Bedeutung der Impfung geringer ein, nicht jedoch Ärztinnen, die im Vergleich zu anderen weiblichen Berufsgruppen die Impfung deutlich positiver bewerteten. Auch die Befragten mit einem Lebensalter von unter 55 Jahren waren eher skeptisch. Was die Impfbereitschaft anbelangt, so zeigte sich ebenfalls eine Zunahme von Dezember 2020 bis Februar 2021. Dabei war die Impfbereitschaft bei Frauen, Pflegekräften und Befragten unter 45 Jahren signifikant geringer.\n\nEine Umfrage aus Hongkong zur Impfbereitschaft des Pflegepersonals gegen COVID-19 an 1205 Mitarbeitern im Krankenpflegedienst (90 % weiblich; Durchschnittsalter 41 ± 10 Jahre) im April 2020 (also während der ersten Welle) ergab eine Impfbereitschaft von 63 % [20]. Eine höhere Impfbereitschaft zeigte sich bei jüngerem Alter, mehr Vertrauen, weniger Selbstzufriedenheit und mehr kollektiver Verantwortung. COVID-19-bezogene Anforderungen wurden mit größerem Arbeitsstress und daher mit einer stärkeren COVID-19-Impfabsicht in Verbindung gebracht.\n\nZwischen dem 26. März und dem 2. Juli 2020 (also ebenfalls während der ersten Welle) wurden in Frankreich 2047 Mitarbeitende im Gesundheitswesen zu ihrer Impfbereitschaft im Hinblick auf eine künftige Impfung befragt. Insgesamt entschieden sich 77 % für eine Impfung [14]. Höheres Alter, männliches Geschlecht, Angst vor COVID-19, das wahrgenommene individuelle Risiko und die Grippeimpfung in der vorangegangenen Saison prädizierten eine höhere COVID-19-Impfbereitschaft. Krankenschwestern waren weniger impfbereit als Ärzte. Kalifornische Mitarbeitende im Gesundheitswesen (n = 609) gaben in 67 % der Fälle an, aufgrund von Bedenken eine Impfung gegen SARS-CoV-2, sollte sie denn irgendwann verfügbar sein, eher zeitlich nach hinten zu verschieben [13]. In 26 chinesischen Provinzen nahmen im März 2020 352 Mitarbeitende im Gesundheitswesen an einer Befragung teil. 76 % der Befragten sprachen sich für eine Impfung gegen SARS-CoV-2 aus (Allgemeinbevölkerung, n = 189, im Vergleich 73 %) [12].\n\nUnter Berücksichtigung dieser Daten sowie weiterer Reviews [46], [49], [51] lässt sich Folgendes festhalten: In den meisten Befragungen von Mitarbeitenden im Gesundheitswesen (mitunter auch zusätzlich der Allgemeinbevölkerung) zeigte sich ein Unterschied im Antwortverhalten in Abhängigkeit vom Geschlecht, der Berufsgruppe und ein Zusammenhang mit dem Lebensalter. Befragte weiblichen Geschlechts, aus der Gruppe der Pflegekräfte und jüngeren Alters zeigten meist eine höhere Impfskepsis und hatten mehr Bedenken in Bezug auf Wirksamkeit der Impfungen, Nebenwirkungen und Langzeitschäden. Befragungen von Mitarbeitenden im Gesundheitswesen in den verschiedensten Ländern zeigen ähnliche Ergebnisse: Auch in Israel waren Frauen und Pflegekräfte vergleichsweise eher skeptisch gegenüber der Impfung. Ähnlich fielen Befragungen französischer und amerikanischer Mitarbeiter im Gesundheitswesen aus. Während mehrere Studien zeigten, dass eine erhöhte Bereitschaft für die Grippe-Impfung auch eine höhere Bereitschaft für die Corona-Impfung vorhersagt, fand sich der umgekehrte Zusammenhang in einer Studie, die darüber berichtete, nicht [14].\n\nSeit wenigen Jahren sieht unser Erleben anders aus: Wir hören vor allem das, was wir hören wollen, weil das Ziel der sozialen Medien, über die wir kommunizieren, nicht darin besteht, uns zu informieren, sondern darin, dass wir sie noch öfter nutzen, denn nur dies generiert ihre Einnahmen. In ihnen wird die Unwahrheit nachweislich deutlich schneller verbreitet als die Wahrheit, wie im Fachblatt Science publiziert wurde [41] und weiterhin ist die Radikalisierung der Nutzer Bestandteil ihres Geschäftsmodells, wie in der New York Times nachzulesen war [38]. Da sehr viele Menschen einen großen Teil ihrer zwischenmenschlichen Kommunikation über social media abwickeln, kam was kommen musste: Eine deutliche Zunahme der psychischen Folgen von Kommunikationsstörungen. Mehr Verunsicherung im Hinblick auf Wahrheit und Falschheit, mehr Mobbing und mehr Einsamkeit, die mittlerweile als Mortalitätsfaktor Nummer 1 (d.h. vor Übergewicht, Rauchen, Hypertonie und anderen bekannten Einflüssen auf die Sterblichkeit) angesehen wird [q, [48]. Die ursächliche Beteiligung von social media an der Skepsis gegenüber Impfungen wurde bereits vor der Corona-Pandemie nachgewiesen [52]. Eine Analyse von Mitteilungen auf der Kurznachrichtenplattform Twitter aus 137 Ländern der Welt in den Jahren 2018 und 2019 zeigte einen Zusammenhang von impfbezogener Missinformation und Impfverweigerung. Zunächst wurden 2,5 Milliarden geokodierte Twitter-Nachrichten identifiziert, um das Ausmaß der Twitter-Nutzung bezogen auf die einzelnen Länder zu ermitteln. Dann wurde eine Teilmenge von 258769 dieser Nachrichten dadurch identifiziert, dass man nach impfbezogenen Wörtern (‚vaccine‘, ‚vaccination‘, ‚vaxx‘) in den 20 auf Twitter am meisten verwendeten Sprachen (entspricht 95% aller Tweets) allen grammatischen Varianten suchte. Eine Bewertung (sentiment) der Nachrichten wurde vorgenommen und diese Daten mit denen aus einer anderen Studie zur Nutzung von social media zur Organisation von (politischen) Off-line-Aktionen. Aufgrund der Länderkodierung konnten jeweils ausländische von inländischen Nachrichten unterschieden werden. Schließlich wurde noch die Impfbereitschaft im Hinblick auf verschiedene Impfungen (Diphtherie-Tetanus-Keuchhusten, Masern, Röteln, Polio, Hepatitis B; Daten der Weltgesundheitsorganisation, WHO) zu diesen Daten in Beziehung gesetzt.\n\nVerschwörungstheorien sind definiert als Versuche, wichtige politische oder gesellschaftliche Ereignisse als durch geheime Pläne mächtiger Menschen oder Organisationen verursacht zu betrachten. Sie sind seit Jahrzehnten Gegenstand wissenschaftlicher Untersuchungen, auch wenn diese eher selten im Fachgebiet der Psychiatrie angesiedelt sind. Dies mag gerade manchen Kollegen zunächst verwundern, denn beim Glauben an das Werk höherer böswilliger Mächte als Ursache von Sachverhalten, die zufällig geschehen, handelt es sich aus psychiatrisch-psychopathologischer Sicht um Phänomene, die als Wahn klassifiziert werden können, wenn die Person, objektiv betrachtet, dadurch Schaden nimmt, auch wenn sie das selbst nicht so sieht: Die Beziehung geht kaputt, der Arbeitsplatz verloren, die Wohnung wird gekündigt etc.\n\nIn den USA glaubt gut die Hälfte der Bevölkerung an mindestens eine Verschwörungstheorie ([ Tab. 2 ]). Werden 2 geglaubt, so kann es durchaus vorkommen, dass sich diese widersprechen: Die gleichen Menschen glauben, dass Prinzessin Diana und ihr Partner vom Britischen Geheimdienst umgebracht wurden und in Wahrheit noch leben [53]. Der Glaube an Verschwörungstheorien kann handfeste Konsequenzen auf das Verhalten einer Person haben. Man braucht dabei gar nicht an fanatische Terroristen und deren Taten denken. Im Bereich der Medizin können Verschwörungstheorien beispielsweise gesundheitsrelevantes Verhalten beeinflussen und dadurch den Menschen schaden. In den USA glauben 49 % der Amerikaner an mindestens eine medizinische Verschwörungstheorie[ 5 ], 18 % glauben an 3 oder mehr. Zum Gesundheitsverhalten zeigten sich folgende Zusammenhänge: Je mehr jemand Anhänger medizinischer Verschwörungstheorien ist, desto weniger gebraucht er Sonnenschutzmittel und geht zur Vorsorgeuntersuchung, zum Zahnarzt oder zur Grippe-Schutzimpfung. Diese Effekte sind robust und bleiben bestehen, selbst wenn man den sozioökonomischen Status oder eine allgemeine soziale Entfremdung der Person aus den Daten „herausrechnet“, d. h. durch multiple Regression kontrolliert. Angesichts der gefundenen Häufigkeiten von Anhängern von Verschwörungstheorien handelt es sich bei diesen nicht um eine „kleine Randgruppe Verrückter“, sondern vielmehr um ganz normale Leute, deren Ansichten man ernst nehmen muss, weil sie mit Verhaltensweisen einhergehen, die ungesund sein können, z.B. kein Maskentragen, kein Abstandhalten und keine Impfung.\n\nDer Zusammenhang zwischen dem Glauben an Verschwörungstheorien und dem Verweigern von Impfungen für sein Kind war in einer britischen (an 89 Eltern) und einer US-amerikanischen Studie (an 246 Eltern) mit r = –0,40 hoch signifikant (p < 0,001). Die Bereitschaft, sein Kind impfen zu lassen, war signifikant geringer bei Personen, die Informationen erhalten hatten, die Anti-Impfungs-Verschwörungstheorien unterstützten, und Gefühle von Desillusionierung, Kontrollverlust und Machtlosigkeit sowie Misstrauen gegenüber Autoritäten empfanden. Umgekehrt verstärkt das Gefühl des Kontrollverlusts die Neigung zu Verschwörungstheorien [43]. Gegen Impfverweigerung allein mit der Autorität der Wissenschaft zu argumentieren, erscheint angesichts der Daten wenig erfolgreich, denn Verschwörungstheorien untergraben diese Autorität. Das direkte Widerlegen von Argumenten hingegen war erfolgreich, änderte es doch dadurch die Einstellung. Allerdings führt die Änderung der Einstellung nicht notwendig zu einer höheren Impfbereitschaft: Falschinformationen sind gegenüber Korrekturen recht resistent. Sitzen Verschwörungstheorien also erst einmal tief in den Köpfen der Leute, sind sie schwer dort wieder zu entfernen und bleiben mindestens latent verhaltensrelevant. Dies zeigte sich leider sehr deutlich im Fall der Publikation im Fachblatt Lancet zu den vermeintlichen Zusammenhängen der Masernimpfung mit Autismus im Jahr 1998 durch den Kinderarzt Andrew Wakefield. Obgleich sich die Forschungsergebnisse als gefälscht erwiesen, die Publikation zurückgezogen wurde und der betreffende Autor aufgrund seines untragbaren Gebarens sogar die Approbation als Arzt verlor, sperren sich bis heute Eltern gegen die Masernimpfung, weil sie Autismus bei ihrem Kind befürchten. In Großbritannien kam es zu deutlich geringeren Impfraten und danach zu einem drastischen Ansteigen von Masern-Fällen, was bei einer Komplikationsrate mit Todesfolge von etwa 1:1000 definitiv nicht als Kleinigkeit zu werten ist: Masern-Partys, die von Eltern veranstaltet werden, um ihren Kindern durch bewusstes Infizieren mit Masern anschließende Immunität zu verleihen, sind in Wahrheit versuchte Körperverletzung. Auch hierzulande sind die Impfraten für Masern in vielen Regionen unzureichend [44] und in Berlin bis Kalifornien sterben Kinder unnötig an Masern, also letztlich an der Unwissenheit bzw. Starrköpfigkeit ihrer Eltern.\n\nZu den Ursachen bzw. beitragenden Faktoren von Verschwörungstheorien gehört das Gefühl, den Dingen ohnmächtig ausgeliefert zu sein bzw. keine Kontrolle über die Geschicke zu haben. Die eindrucksvollste Bestätigung dieses Zusammenhangs lieferten 2 Politikwissenschaftler, die 104823 von der New York Times in den 121 Jahren von 1890 bis 2010 publizierten Leserbriefen inhaltlich auswerteten, d. h. durchschnittlich 866 Briefen pro Jahr (Median: 845; Bereich: 347–2477) [40]. In 875 Briefen war von Verschwörungstheorien die Rede und sie wurden genauestens im Hinblick darauf untersucht, wer, wem, was, aus welchen Gründen, und mit welchem Ziel unterstellte. Betrachtet man Verschwörungstheorien nicht als einen völlig abwegigen, individuellen, krankhaften Sachverhalt, sondern als „Ausdruck eines bei allen Menschen vorhandenen Alarmsystems gegenüber Bedrohungen“ [40], welches zuweilen leider auch überborden kann, dann sollte sich dies in den Daten klar zeigen. Und so war es auch: In Zeiten internationaler Kriege und Krisen stieg der Anteil ausländischer Bösewichte in den Verschwörungstheorien von 28 % auf 45 %. Noch interessanter war es, ab 1897 die innenpolitischen Verhältnisse zu betrachten, denn ab diesem Zeitpunkt hatte sich in den USA das bekannte 2-Parteien-System etabliert, bei dem die Mehrheiten wechselten und es daher in einem gegebenen Jahr immer Machthaber und Machtlose gab, also Gewinner und Verlierer. Sind Verschwörungstheorien Ausdruck von Ohnmacht, dann sollten sich Verschwörungstheorien vor allem auf die jeweils an der Macht befindliche Partei beziehen. Kurz: „Who controls the White House invites conspiracy theories“ [40]. Und wieder war es genauso: In den Jahren republikanischer Präsidentschaft herrschen Verschwörungstheorien gegenüber bösen Menschen oder Mächten aus dem rechten bzw. kapitalistischen Lager vor, wohingegen sich die Verschwörungstheorien in den Zeiten demokratischer Präsidentschaft mehrheitlich auf Linke und Kommunisten beziehen ([ Abb. 1 ]). Dieser Effekt wiederum ist geringer in Zeiten von „divided government“, d. h. wenn die Parteien des Präsidenten und der Kongressmehrheit nicht identisch sind: Geringere Machtkonzentration provoziert weniger Verschwörungstheorien. Interessant ist ferner die Auswertung der Anhänger der Verschwörungstheorien nach Berufsgruppen. Menschen, die am Bau, in der Fabrik, im Transport oder im Gesundheitswesen arbeiten, neigen deutlich mehr zu Verschwörungstheorien als Menschen aus den Bereichen Unterhaltung, Finanzwesen oder Militär ([ Abb. 2 ]). Das wirft kein gutes Licht auf das Ausmaß von erlebter Freiheit und Selbstbestimmung bei im Gesundheitswesen arbeitenden Menschen. Das könnte die Politik ändern. Mehr Eigenverantwortung und weniger Gängelung würde Ärzten und Pflegepersonal die Arbeit erleichtern! Halten wir fest: Verschwörungstheorien sind die gedanklichen Produkte erlebter Bedrohung und Ohnmacht.\n\nBei den meisten Menschen, die an Corona oder der Impfung Zweifel haben, liegt aus meiner Sicht – und ich habe mit vielen Menschen darüber gesprochen – keine psychische Störung vor. Vielmehr sind sie aus den unterschiedlichsten Gründen ungenügend informiert, haben vielleicht einmal schlechte Erfahrungen mit einem Arzt gemacht, vermuten bei sich eine Prädisposition zu Nebenwirkungen oder sind sich nicht im Klaren über den Unterschied zwischen Wissenschaft und Stammtischmeinungen. Das halte ich für eine ebenso bemerkens- wie bedauernswerte Krise der Wissenschaft, die zumindest teilweise auch auf das Konto der Medien geht: Es muss immer eine Kontroverse her, auch wenn es tatsächlich gar keine gibt.[ 6 ] Wenn also beispielsweise das Fernsehen wissenschaftliche Kontroversen in Talkshows wie Schaukämpfe inszeniert und/oder Boulevardblätter dies dann ihrerseits verzerrt und mit viel Klamauk berichten, ist niemandem gedient, aber dem Ansehen der Wissenschaft geschadet. Dies erklärt, warum viele Menschen sich nicht für Wissenschaft interessieren, obwohl sie die Grundlage unserer Lebensweise, Lebensqualität, Gesundheit und unseres ökonomischen und technologischen Erfolgs in der Welt – und damit auch unserer Zukunft – darstellt.[ 7 ]\n\nNicht wenige Menschen sind durch die Corona-Pandemie bzw. die dagegen verordneten Maßnahmen so stark betroffen, dass dadurch ihre Lebensqualität beeinträchtigt ist. Einer meiner Söhne beispielsweise lebt mit Frau und 2 Kindern in einer kleinen Wohnung ohne Garten oder Balkon. Lockdown mit Home-Schooling und Home-Office – gleichzeitig! – der pure Stress - und bei Alleinerziehenden fast prinzipiell unmöglich. Das bewirkt Frustration und Verzweiflung. Kommen dann noch ökonomisch reale Existenzängste hinzu, wird nachts schlecht geschlafen und tagsüber viel gegrübelt, dann ist man von einer klinisch manifesten Depression nicht mehr weit weg. Richtet sich die Wut nach außen, können Feindseligkeit und aggressives Verhalten entstehen. All dies ist noch kein Wahn, sondern liegt mehr oder weniger im Bereich des Normalen, was Menschen schon immer mehr oder weniger gut ausgehalten haben. Entsteht jedoch offensichtlich bei der betreffenden Person oder bei anderen Menschen Schaden, dann ist dies anders. Wenn beispielsweise eine Ärztin keine Maske trägt, falsche Bescheinigungen ausstellt und die Bürger dazu auffordert, Deutschland schnellstmöglich zu verlassen, weil sie hier mit ihrem baldigen Tod durch die Impfung demnächst das gleiche Schicksal ereilen würde wie die Juden während der NS-Zeit; wenn sich diese Ärztin vor der Polizei versteckt, dann doch aufgegriffen wird, sich aggressiv wehrt und unkorrigierbar weiter ihre Behauptungen vertritt, das Corona-Virus gäbe es nicht und die Impfung dagegen sei tödlich: – Wie soll man das nennen, wenn nicht Wahn?\n\nEtwa so, wie jeder Mensch von einer Mangelernährung oder einer Erkältung betroffen sein, oder sich ein Bein brechen kann, kann jeder Mensch auch einen Wahn bekommen. Wahn ist keineswegs dasselbe wie Psychose und schon gar nicht dasselbe wie Schizophrenie. Dies mag psychiatrische Laien zunächst überraschen, denn schließlich werden schwere psychische Störungen (wie beispielsweise schwere depressive Störungen, bipolare Störungen, hirnorganische Störungen oder Schizophrenie) bei Patienten, die sich in stationärer psychiatrischer Behandlung befinden, sehr oft von Wahn begleitet. Es gibt Wahn jedoch auch als Folge von rein psychologischen Gegebenheiten. In der älteren psychiatrischen Literatur sprach man hier von psychogenen Psychosen [33]–[35], um sie von endogenen und organischen Psychosen abzugrenzen. Die Gemeinsamkeit psychogener Wahnentwicklungen besteht in der gestörten Kommunikation eines Menschen mit seinen Mitmenschen. Betrachten wir die bekanntesten Beispiele.\n\nDass es so etwas gibt wie rein psychologische Ursachen von psychotischen Phänomenen wie Wahn und Halluzinationen (bei denen der Psychiater bis heute zunächst an schwere endogene[ 8 ] oder organische Störungen denkt), wurde durch keinen anderen als Emil Kraepelin selbst in seinen Ausführungen zum Wahn bei Schwerhörigen oder völlig ertaubten Menschen vor mehr als 100 Jahren klar herausgearbeitet. Im Jahr 1915 publizierten vierten Band der achten, von ihm völlig neu bearbeiteten Auflage seines Lehrbuchs der Psychiatrie für Studierende und Ärzte [45] findet sich hierzu Folgendes: „Bei Personen, denen die Verständigung mit der Umgebung durch starke Schwerhörigkeit oder gar völlige Taubheit nahezu unmöglich gemacht wird, kommt hier und da ein etwas verschwommener Verfolgungswahn mit eigentümlich unbestimmten Sinnestäuschungen und halb ängstlicher, halb gereizter Stimmung zur Beobachtung […]. Es ist bekannt, dass Schwerhörige im Lauf der Zeit, namentlich Fremden gegenüber, misstrauisch werden und sehr geneigt sind, Blicke, Gebärden und Heiterkeitsausbrüche auf sich zu beziehen, da ihnen die Hilfsmittel fehlen, dem Gang der Unterhaltung zu folgen […]“ [45]. Das Störungsbild entwickele sich nicht selten schleichend über Jahre hinweg, trete vor allem bei Frauen im Alter zwischen 40 und 60 Jahren auf und nehme einen chronischen Verlauf. Einsamkeit sei ein zusätzlicher Risikofaktor, eine verständnisvolle Umgebung könne das Krankheitsbild bessern. Wie man heute weiß, gehen auch leichtgradige Hörminderungen mit Misstrauen, Feindseligkeit und sozialem Rückzug einher. Umgekehrt findet man bei älteren Menschen mit paranoiden Störungen eine 3-fache Häufung von Schwerhörigkeit. Eine familiäre Belastung, d. h. eine genetische Komponente, findet man bei schwerhörigen Wahnkranken eher nicht [7], [8], was als Indiz dafür gewertet werden kann, dass eine solche Komponente nicht für jede Wahnentstehung notwendig ist. Von entscheidender Bedeutung für die Entstehung dieses Syndroms ist wahrscheinlich auch die Tatsache, dass Schwerhörigkeit eine der häufigsten Beeinträchtigungen älterer Menschen ist und zugleich meistens über lange Zeiträume unerkannt bleibt [4].\n\nStellen Sie sich vor, es verschlägt Sie ganz plötzlich und unerwartet nach China in eine ländliche Region, Sie ganz allein und auch ohne Smartphone. Sie verstehen die Menschen nicht und diese verstehen Sie auch nicht. Zuweilen werden sie misstrauisch, vermuten, dass über Sie geredet wird, und je mehr Vermutungen Sie darüber anstellen, desto mehr fällt es ihnen auf, desto ängstlicher werden Sie und desto eher hören und sehen Sie auch irgendwann, wie andere über Sie tuscheln. Vielleicht weil sie Böses im Schilde führen? – Das macht ihnen noch mehr Angst und die beschleunigt und fokussiert Ihr Wahrnehmen und Denken noch weiter in Richtung von Vermutungen und entsprechenden Wahrnehmungen. Bereits im Jahr 1920 wurde von Allers [54] die Entstehung von Wahn in sprachfremder Umgebung beschrieben und ganz ähnlich eingeordnet wie der Wahn von Schwerhörigen.\n\nBei dem von Ernst Kretschmer erstmals so bezeichneten und zusammen mit Robert Gaupp (beides bekannte Tübinger Psychiater) entwickelten Gedanken des sensitiven Beziehungswahns geht es um eine weitere Form der rein psychogenen Wahnentwicklung. Besonderheiten von Charakter, Erlebnis und Milieu lösen in einem unglücklichen Zusammenspiel diese Wahnform aus. Der Charakter sei durch starke Kontraste zwischen Stärken und Schwächen sowie starke Emotionen und ein ebenso starkes Bedürfnis nach Emotionskontrolle geprägt. Es handele sich zudem meist um differenzierte und intelligente Menschen. „Erlebnisse, die bei dieser Persönlichkeitsstruktur wie der Schlüssel zum Schloss passen und die Wahnentwicklung auslösen, sind Insuffizienzerfahrungen und persönliche Niederlagen, aber auch andere Enttäuschungen und Verfehlungen in zwischenmenschlichen Beziehungen sowie Schulderleben […], Insuffizienzerleben [und…] Zurücksetzung im beruflichen und sozialen Bereich“, beschreibt Rainer Tölle in seinem Lehrbuch der Psychiatrie das Geschehen eindrucksvoll.[ 9 ]\n\nPsychogener Wahn galt bislang in der Psychiatrie als selten. Das mag auch daran liegen, dass die Patienten definitionsgemäß keine anderen Beeinträchtigungen aufweisen und daher in unserer Gesellschaft gleichsam „unter dem Radar fliegen“, wie man sich zuweilen ausdrückt. Die gesellschaftlichen und vor allem die ökonomischen Folgen der Corona-Pandemie und der Versuche, sie durch Maßnahmen der Isolation und der Schließung ganzer Wirtschaftszweige einzudämmen, haben Wahnentwicklungen aus meiner Sicht dramatisch gefördert. Der Lockdown brachte viele Menschen in wirtschaftliche Schwierigkeiten, was zu Frustration und Erlebnissen der Insuffizienz führte. Beziehungen gingen zu Bruch und in einem ganz besonderen, vielleicht zuvor nie dagewesenen Ausmaß kam es zu einer deutlichen Reduktion der zwischenmenschlichen Kommunikation. Hierdurch wurden seelische Prozesse angeschoben, Teufelskreise zwischen sich wechselseitig befeuernden Emotionen und Gedanken in Gang gesetzt, und das Ganze dann durch veränderte mediale Kommunikation noch jeglicher Korrekturmöglichkeit beraubt, sodass sich Wahn in einem Ausmaß in der Gesellschaft verbreiten konnte, wie wir es in unserer modernen aufgeklärten Welt nicht mehr für möglich gehalten hätten.\n\nDer Ausdruck „Massenwahn“ wird heute nur noch selten gebraucht, und wenn, dann nicht im Bereich der Psychiatrie, sondern im Feuilleton und allenfalls in manchen Bereichen der Kulturwissenschaften. Nach dem zweiten Weltkrieg war das anders. Im Jahr 1947 verfasste der Psychiater und Neurologe Karl Ludwig Bonhoeffer[ 10 ] (1868–1948), von 1912 bis 1938 Ordinarius für Psychiatrie und Neurologie an der Friedrich-Wilhelms-Universität Berlin und Direktor der Klinik für psychische und Nervenkrankheiten der Charité in Berlin, die kleine Schrift „Führerpersönlichkeit und Massenwahn“, die erst im Jahr 1968 anlässlich einer Festschrift zu dessen 100. Geburtstag publiziert wurde. Dort beschreibt Bonhoeffer ein Phänomen, das auch im Zusammenhang dieser kleinen Übersicht Relevanz hat: den induzierten Wahn.[ 11 ] „Der Psychiater kennt eine Form der geistigen Erkrankung, die als induziertes Irresein bezeichnet wird. Es handelt sich dabei darum, dass ein psychisch Kranker seine Umgebung mit seinen Wahnbildungen so beeinflusst, dass diese selbst dem Wahne verfällt. Die Aufgabe ist in einem solchen Falle im Interesse der Therapie zunächst, den primär Erkrankten festzustellen, was keineswegs immer ganz einfach ist wegen der oft weitgehenden Identität der Wahnidee und der Übereinstimmung des Affektes. Weiterhin sind die Besonderheiten der Psyche der beiden Beteiligten zu klären, die die Übernahme des Wahnes verursacht haben. […] Es ist nun kein Zweifel, dass sich auch im Leben der Völker, vor allem in revolutionären Zeiten, Erscheinungen finden, die in ihrem psychischen Mechanismus diesem Vorgang beim Einzelindividuum entsprechen“ [5].\n\nAus meiner Sicht sollte der Begriff „Wahn“ für kranke Individuen reserviert bleiben, weswegen der Ausdruck „Massenwahn“ mit Recht im medizinisch-wissenschaftlichen Bereich nicht verwendet wird. Dies bedeutet jedoch nicht, dass es induzierten Wahn nicht geben kann. Und soziale Ansteckung als soziologischen bzw. sozialpsychologischen Sachverhalt gibt es durchaus. Betrachten wir als Beispiel hierfür ein Phänomen, das sich im Frühling des Jahres 1856 in Südafrika ereignet hat.[ 12 ] Ein 15-jähriges Mädchen namens Nongqawuse erzählte ihrem Onkel, dass sie 3 Geister gesehen habe. Diese hätten ihr aufgetragen, den Menschen im Dorf zu erzählen, dass die Toten auferstehen würden, wenn der gesamte Stamm (d. h. über 100 000 Menschen) das gesamte Vieh (mehr als 400 000 Tiere) töten würde. Zunächst glaubte ihr niemand, aber schon einen Tag später erzählte ihr Onkel dies den Häuptlingen und vielen anderen Mitgliedern des Stammes. Daraufhin wurden etwa 400 000 Tiere tatsächlich geschlachtet, was eine Hungerkatastrophe und den Tod von mehr als 80 000 Menschen (über drei Viertel des gesamten Stammes!) zur Folge hatte. Nongqawuse wurde von den damals Südafrika beherrschenden britischen Behörden verhaftet, lebte nach ihrer Entlassung noch etwa 40 Jahre auf einer Farm in Südafrika und verstarb im Jahr 1898. Diese Geschichte ist Inhalt der Monografie des südafrikanischen Historikers Jeff Peires (1989/2003) mit dem Titel Die Toten werden auferstehen und hat sich tatsächlich so oder so ähnlich abgespielt. Der Fall ruft bis heute in Südafrika kontroverse Diskussionen hervor, nicht zuletzt, weil die damaligen britischen Kommandeure keine – wie wir heute sagen würden – humanitäre Hilfe leisteten und dem Hungertod Zehntausender Menschen tatenlos zuschauten.\n\nWenn man nach solchen Vorfällen in der Geschichte sucht, findet man sie überall und zu allen Zeiten: Den Hexenverfolgungen der frühen Neuzeit (1450–1750) erlagen in Mitteleuropa nach neueren Schätzungen 40 000 bis 60 000 Menschen, drei Viertel davon Frauen. Der Aberglaube der Alchemisten (vom Altertum bis heute), Geisterhäuser und Spukschlösser sowie der tierische Magnetismus (Mesmerismus) sind weitere bekannte Beispiele. Derartige soziale Ansteckungsphänomene wurden als solche auch schon im Jahr 1841 vom schottischen Journalisten Charles MacKay beschrieben. Der Tulpenwahn von 1637 in den Niederlanden gilt als die erste Marktblase mit anschließendem Crash, von denen wir mittlerweile eine ganze Reihe erlebt haben. Der Klassiker unter den einschlägigen Publikationen zur sozialen Ansteckung ist die Monografie Psychologie der Massen des französischen Arztes und Gelehrten Gustave Le Bon (1841–1931) aus dem Jahr 1895. Darin beschreibt er die Ausbreitung von Emotionen analog zu Erregern von Krankheiten, und deren Konsequenzen im Sinne gesteigerter Angst und verminderter Kritikfähigkeit größerer der gegenseitigen Ansteckung unterliegender sozialer Gemeinschaften. Das Buch ist noch heute (oder gerade heute wieder!) sehr lesenswert.\n\nÄngste und Depressionen waren in der Corona-Pandemie weltweit noch häufiger als sie zuvor schon waren. Verstärkende Filterblasen und Echokammern gab es auch schon und die gesunde soziale Rückkoppelung in Form von Kritik war dadurch ebenfalls beeinträchtigt bis unterbrochen. Und das Virus selbst sorgte schon für Angst als es die Lockdown-Maßnahmen noch nicht gab, durch die Ängste, Frustration, Resignation und gelernte Hilflosigkeit noch deutlich zugenommen haben. Falsche Behauptungen („Fake News“) über die Corona-Pandemie und das Impfen sind ansteckend und verbreiten sich nachweislich schneller und weiter als die Wahrheit. Zusammen mit einschneidenden und schlecht begründeten oder gar in sich widersprüchlichen Gegenmaßnahmen haben sie negative Auswirkungen auf das das Vertrauen in das öffentliche Gesundheitswesen im Allgemeinen und auf ganz praktische Gesundheitsentscheidungen, einschließlich der Akzeptanz von Impfungen [55]. Impf-Skeptiker verwenden Verschwörungstheorien, zitieren selektiv und/oder falsche Experten, haben unmögliche Erwartungen („100% Sicherheit“), stellen Wahrscheinlichkeiten und Fakten falsch dar und stehen damit außerhalb jedes wissenschaftlichen Diskurses. – Was kann man tun?\n\nZunächst ist alles, was dazu geeignet ist, Angst zu reduzieren und Vertrauen wiederherzustellen, prinzipiell geeignet, die Situation zu bessern. Eine als Impfzwang missverstandene Impfpflicht gehört sicherlich nicht dazu. Ich habe selbst in Mitarbeitergesprächen erlebt, wie fest der Gedanke, man könnte zur Impfung gezwungen werden, in vielen Menschen verankert zu sein scheint. „Wir haben Angst, dass Sie uns zur Impfung zwingen wollen.“ Darauf antwortete ich wahrheitsgemäß: „Dann säße ich jetzt nicht mit ihnen hier. Denn ich will sie nicht zwingen, sondern versuche das genaue Gegenteil: ich möchte sie davon überzeugen, das richtige aus eigenem Entschluss zu tun.“ Dazu muss über alles gesprochen werden, wozu die Mitarbeiter wiederum nicht bereit waren. Nachdem ich einen ihrer Einwände entkräftet hatte, wurde mir entgegnet: „Das war nur einer, wir haben aber 20“. – „Ok, dann bitte den nächsten.“ – „Wir wollen aber nicht mehr mit ihnen diskutieren.“\n\nJetzt gibt es tatsächlich ein systematisches Problem: Unsere Gesellschaft lebt von der Vielfalt der Meinungen, aber auch von Tatsachen, auf die sich alle einigen können. Der geschilderte kleine Gesprächsausschnitt fand in einem Seminarraum der Universität statt, in dem sehr oft wissenschaftliche Arbeiten kritisch diskutiert werden: Was ist dran an dem Paper? Stimmt die Methode? Wird tatsächlich das, was behauptet wird, auch nachgewiesen? – Fragen wie diese gehören im Bereich der Wissenschaft zum Alltag und werden in Seminaren rauf und runter durchgesprochen; an Beispielen; zum Lernen; damit man es kann, wenn es mal nicht nur um die Wahrheit, sondern um Leben und Tod geht, wie das in der Medizin eben nicht selten der Fall ist.\n\nNiemand wird gezwungen, etwas einfach zu glauben; alle bemühen sich vielmehr, durch kritische Diskussion herauszufinden, was richtig und was falsch ist. Niemand würde am Ende einer wissenschaftlichen Diskussion ernsthaft sagen: „Das mag ja alles so sein, aber ich behaupte das Gegenteil – einfach so, weil ich da so ein Bauchgefühl habe.“ Man würde entgegnen, dass Bauchgefühle bei der Wahrheitsfindung nichts zu suchen haben und dass man seine Zeit verschwendet, wenn man es dennoch tut. Zudem würde man entgegnen, dass der Betreffende nicht begriffen hat, wie wichtig es ist, dass man sich in der Wissenschaft, in der es um tatsächliches Wissen geht, grundsätzlich nur durch kritischen Diskurs der Wahrheit annähert. Gar nicht zählt beispielsweise folgendes Argument: „Ich habe ein YouTube-Video gesehen, in dem ein Experte etwas anderes gesagt hat.“ Und erst recht nicht dieses: „Ich habe irgendwo gehört, dass Bill Gates die Weltbevölkerung mit der Corona-Impfung auslöschen will.“\n\nSolche Verschwörungstheorien sind wissenschaftlich gut untersucht und entstehen unter Bedingungen von Niederlage, Frustration, Kontrollverlust und Angst. Wer nicht an Corona glaubt, behält aus subjektiver Sicht die Kontrolle – und lässt sich auch nicht impfen. Das mag unlogisch klingen, entspricht aber bekannten bei Wahnkranken vorliegenden Denkmustern: Wer unter Verfolgung leidet, so ein Extrembeispiel, begeht einen Suizidversuch, „um den Verfolgern zuvor zu kommen“, wie man auf Nachfrage erfährt. Mit anderen Worten: Die Kontrolle wird höher bewertet als das eigene Leben. Verschwörungstheorien sind sehr häufig und kommen bei ansonsten psychisch gesunden Menschen vor. Sie zeigen jedoch, dass Denkmuster, an denen bis zur wahnhaften Gewißheit und Unkorrigierbarkeit festgehalten wird, tatsächlich bei jedem Menschen auftreten können. Wenn es hierfür eine Prädisposition gibt, dann muss diese wie die Verschwörungstheorien auch sehr häufig sein.\n\nEs gibt kein Wundermittel gegen Corona-Leugnung und Impfverweigerung, denn es handelt sich um psychiatrisch nicht unbekannte Reaktionsmöglichkeiten von Menschen. Ihr Verständnis im Rahmen unseres Fachgebiets eröffnet aber auch Perspektiven für adäquates Handeln. Ängste kann man reduzieren und bei unverschuldeten finanziellen Notlagen kann man Unterstützung gewähren. Kontrollverlust wird in geringerem Maß erlebt, wenn Gegenmaßnahmen klar begründet und kommuniziert werden. Häufig wechselnde, zuweilen in sich logisch nicht stimmige Anordnungen schaden sehr. Wenn sich wechselseitig verstärkende Kommunikationsdefizite ursächlich an der Entstehung eines Problems beteiligt sind, ist gute Kommunikation notwendig Teil von dessen Lösung.\n\nSchon vor dem Beginn der Impfungen gegen COVID-19 schrieb die kanadische Kinderärztin Noni MacDonald [50] in ihrer Arbeit „Fake News und die Attacken von Wissenschaftsleugnern auf Impfstoffe: Was kann man tun?“: „Es ist wichtig, dass Sie sich gut überlegen, was Sie sagen, und dass Sie Ihre Meinung äußern – ganz gleich, ob Sie beim Abendessen sind, mit Freunden ausgehen oder sich in ihrer Arztpraxis oder Klinik befinden. Wenn Sie nichts sagen, bedeutet das, dass Sie mit der Fehlinformation einverstanden sind“. Gegen wahnhaft überzeugte Impfgegner jedoch nützt Argumentieren nichts.\n\n2 Die Zahlen sind dem COVID-19 Dashboard, das vom Center for Systems Science and Engineering (CSSE) an der Johns Hopkins University (JHU) betrieben wird, entnommen.\n• 1 Amuzie CI, Odini F, Kalu KU. et al COVID-19 vaccine hesitancy among healthcare workers and its socio-demographic determinants in Abia State, Southeastern Nigeria: a cross-sectional study. Pan Afr Med J. 2021; 40: 10\n• 2 Bauernfeind S, Hitzenbichler F, Huppertz G. et al Brief report: attitudes towards Covid-19 vaccination among hospital employees in a tertiary care university hospital in Germany in December 2020. Infection 2021; 49: 1307-1311\n• 3 Biswas N, Mustapha T, Khubchandani J. et al The Nature and Extent of COVID-19 Vaccination Hesitancy in Healthcare Workers. J Community Health 2021; 46: 1244-1251\n• 5 Bonhoeffer KL (1947/1969) Führerpersönlichkeit und Massenwahn. In: Zutt J, et al. (Hrsg.) Karl Bonhoeffer. Zum Hundertsten Geburtstag am 31. März 1968. Berlin: Springer; 1969\n• 7 Cooper AF, Curry AR. The Pathology of Deafness in the Paranoid and Affective Psychoses of Later Life. J. Psyehosom 1976; 20: 97-105\n• 8 Cooper AF, Kay DWK, Curry AR. et al Hearing Loss in Paranoid and Affeetive Psychoses of the Elderly. Lancet 1974; II: 851-854\n• 9 Dror AA, Eisenbach N, Taiber S. et al Vaccine hesitancy: the next challenge in the fight against COVID-19. Eur J Epidemiol 2020; 35: 775-779\n• 10 Dunbar RIM.. Grooming, gossip and the evolution of language. London: Faber and Faber; 1996\n• 11 Dzieciolowska S, Hamel D, Gadio S. et al Covid-19 vaccine acceptance, hesitancy, and refusal among Canadian healthcare workers: A multicenter survey. Am J Infect Control 2021; 49 (09) 1152-1157\n• 12 Fu C, Wei Z, Pei S. et al Acceptance and preference for COVID-19 vaccination in healthcareworkers (HCWs). medRxiv. 2020 DOI: 10.1101/2020.04.09.20060103\n• 13 Gadoth A, Halbrook M, Martin-Blais R. et al Cross-sectional Assessment of COVID-19 Vaccine Acceptance Among Health Care Workers in Los Angeles. Annals of Internal Medicine 2021; 174: 6\n• 14 Gagneux-Brunon A, Detoc M, Bruel S. et al Intention to get vaccinations against COVID-19 in French healthcare workers during the first pandemic wave: a cross-sectional survey. J Hosp Infect 2021; 108: 168-173\n• 15 Janssen C, Maillard A, Bodelet C. et al A Multi-Centric Survey in France. Vaccines 2021; 09 (06) 547\n• 16 Janssens U, Kluge S, Marx G. et al Einstellung zur Impfung gegen SARS-CoV-2 : Umfrage unter Mitarbeitenden in Krankenhäusern vor und nach Beginn der Impfungen in den deutschen Krankenhäusern. Med Klin Intensivmed Notfmed 2021; 116: 421-430\n• 17 Kara Esen B, Can G, Pirdal BZ. et al COVID-19 Vaccine Hesitancy in Healthcare Personnel: A University Hospital Experience. Vaccines 2021; 09 (11) 1343\n• 18 Kose S, Mandiracioglu A, Sahin S. et al Vaccine hesitancy of the COVID-19 by health care personnel. Int J Clin Pract 2018; 75: e13917\n• 20 Kwok KO, Li KK, Wei WI. et al Influenza vaccine uptake, COVID-19 vaccination intention and vaccine hesitancy among nurses: A survey. Int J Nurs Stud 2021; 114: 103854\n• 21 Martin CA, Marshall C, Patel P. et al SARS-CoV-2 vaccine uptake in a multi-ethnic UK healthcare workforce: A cross-sectional study. PLoS Med 2021; 18 (11) 18 (11) e1003823\n• 22 Mehl MR, Vatire S, Ramirez-Esparca N. et al Are women really more talkative than men?. Science 2007; 317: 82\n• 24 Santomauro DF. et al Global prevalence and burden of depressive and anxiety disorders in 204 countries and territories in 2020 due to the COVID-19 pandemic. www.thelancet.com 2021 DOI: 10.1016/S0140-6736(21)02143-7\n• 25 Schuppert A, Polotzek K, Karschau J. et al Effectiveness of extended shutdown measures during the ´Bundesnotbremse´ introduced in the third SARS-CoV-2 wave in Germany. Infection 2021; 06: 1331-1335\n• 26 Sirikalyanpaiboon M, Ousirimaneechai K, Phannajit J. et al COVID-19 vaccine acceptance, hesitancy, and determinants among physicians in a university-based teaching hospital in Thailand. BMC Infect Dis 2021; 21 (01) 1174\n• 27 Elsayed M, El-Abasiri RA, Dardeer KT. et al Factors Influencing Decision Making Regarding the Acceptance of The COVID-19 Vaccination in Egypt: A Cross-Sectional Study in an Urban, Well-Educated Sample. Vaccines 2022; 10: 20\n• 33 Strömgren E. The Development of the Concept of Reactive Psychoses. Psychopathology 1997; 20: 62-67\n• 34 Strömgren E. The development of the concept of reactive psychoses. Br J Psychiatry 1998; 04: 47-50\n• 36 Teufel M, Schweda A, Kohler H. et al Corona doubt and scepticism: repression and denial as psychological defence mechanisms to process distress?. J Public Health 2021; 43 (03) e520-e522\n• 38 Tufekci Z. YouTube, the great redicalizer. The New York Times 2018; 12: 15\n• 39 Turbat B, Sharavyn B, Tsai FJ. Attitudes towards Mandatory Occupational Vaccination and Intention to Get COVID-19 Vaccine during the First Pandemic Wave among Mongolian Healthcare Workers: A Cross-Sectional Survey. Int J Environ Res Public Health 2022; 19: 329\n• 41 Vosoughi S, Roy D, Aral S. The spread of true and false news online. Science 2018; 359: 1146-1151\n• 42 Zürcher K, Mugglin C, Egger M. et al Vaccination willingness for COVID-19 among healthcare workers: a cross-sectional survey in a Swiss canton. Swiss Med Wkly 2021; 151: w30061\n• 43 Kay AC, Whitson JA, Gaucher D. et al Compensatory control: Achieving order through our mind, our institutions, and the heavens. Current Directions in Psychological Science 2009; 18: 264-268\n• 46 AlShurman BA, Khan AF, Mac C. et al What Demographic, Social, and Contextual Factors Influence the Intention to Use COVID-19 Vaccines: A Scoping Review. Int J Environ Res Public Health. 2021; 18 (17) 9342\n• 48 Holt-Lunstad J, Smith TB, Baker M. et al Loneliness and social isolation as risk factors for mortality: A meta-analytic review. Perspectives on Psychological Science 2015; 10: 227-237\n• 49 Joshi A, Kaur M, Kaur R. et al Predictors of COVID-19 Vaccine Acceptance, Intention, and Hesitancy: A Scoping Review. Front Public Health 2021; 09: 69811\n• 50 MacDonald NE. Fake news and science denier attacks on vaccines. What can you do?. Can Commun Dis Rep 2020; 46: 432-435\n• 51 Oleksy T, Wnuk A, Gambin M. et al Barriers and facilitators of willingness to vaccinate against COVID-19: Role of prosociality, authoritarianism and conspiracy mentality. A four-wave longitudinal study. Pers Individ Dif 2022; 190: 111524\n• 53 Wood M, Douglas KM, Sutton RM. Dead and alive: Belief in contradictory conspiracy theories. Social Psychological and Personality Science 2012; 03: 767-773", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/a-1690-0322.pdf", "javascript:;", "#N106ED", "#N10944", "#N10995", "#N10AC5", "#N10AE2", "#N10AFB", "#N10B29", "#N10B36", "#N10B4A", "#N10B90", "#N10C26", "#FN16900322-1", "#FN16900322-2", "#TB16900322-1", "#R16900322-36", "#R16900322-15", "#R16900322-18", "#R16900322-20", "#R16900322-9", "#R16900322-14", "#R16900322-13", "#R16900322-12", "#R16900322-46", "#R16900322-49", "#R16900322-51", "#R16900322-14", "#top", "#R16900322-24", "#R16900322-32", "#R16900322-41", "#R16900322-38", "#R16900322-48", "#R16900322-52", "#R16900322-22", "#R16900322-10", "#FN16900322-3", "#top", "#FN16900322-4", "#TB16900322-2", "#R16900322-53", "#FN16900322-5", "#R16900322-43", "#R16900322-44", "#R16900322-40", "#R16900322-40", "#R16900322-40", "#FI16900322-1", "#FI16900322-2", "https://www.thieme-connect.de/media/10.1055-s-00034916/202203/im_10-1055-a-1690-0322-i1.jpg", "#R16900322-40", "https://www.thieme-connect.de/media/10.1055-s-00034916/202203/im_10-1055-a-1690-0322-i2.jpg", "#R16900322-40", "#top", "#FN16900322-6", "#FN16900322-7", "#top", "#R16900322-33", "#R16900322-35", "#FN16900322-8", "#R16900322-45", "#R16900322-45", "#R16900322-7", "#R16900322-8", "#R16900322-4", "#R16900322-28", "#top", "#R16900322-54", "#top", "#FN16900322-9", "#top", "#top", "#FN16900322-10", "#FN16900322-11", "#R16900322-5", "#FN16900322-12", "#top", "#R16900322-55", "#R16900322-50", "#top", "#top", "#R16900322-30", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-1", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-2", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-3", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-4", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-5", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-6", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-7", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-8", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-9", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-10", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-11", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-12", "https://doi.org/10.1101/2020.04.09.20060103", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-13", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-14", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-15", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-16", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-17", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-18", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-19", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-20", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-21", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-22", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-23", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-24", "http://www.thelancet.com", "https://doi.org/10.1016/S0140-6736(21)02143-7", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-25", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-26", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-27", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-28", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-29", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-30", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-31", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-32", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-33", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-34", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-35", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-36", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-37", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-38", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-39", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-40", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-41", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-42", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-43", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-44", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-45", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-46", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-47", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-48", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-49", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-50", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-51", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-52", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-53", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-54", "/products/ejournals/linkout/10.1055/a-1690-0322/id/R16900322-55"], "authors": ["Manfred Spitzer"], "publish_date": null}