{"result_id": "159047", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1743136", "timestamp": "2023-04-25 15:32:03 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1743136", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Annals of the National Academy of Medical Sciences (India) / Abstract", "cleaned_text": "Background India rolled out the world's largest vaccination program on January 16, 2021, marking the beginning of an effort to vaccinate a population of 1.3 billion against coronavirus disease 2019 (COVID-19) infection. However, the hesitancy toward safe and effective vaccine against severe infection is a major global health threat. Hence, public acceptance of COVID-19 vaccine would be an essential deterrent to the pandemic control.\n\nMaterials and Methods A cross-sectional online study was conducted among the Indians from January 1 to January 31, 2021. The online questionnaire addressed several variables, including the sociodemographic parameters, COVID-19 vaccine acceptance, and concerns regarding COVID-19 vaccine.\n\nResults Out of total 450 participants, majority of them (97.1) were aware about the COVID-19 vaccination drive. Only 66.2% showed their willingness to accept vaccination, 26.0% were still indecisive, and 7.8% did not want to accept it.\n\nConclusion Despite numerous efforts by various scientific organizations, public health experts, and media outlets, to educate the general population about the COVID-19 vaccine, significant portion of the Indian population may experience vaccine hesitancy, which poses dangers to both the individual and their community. Therefore, we must target these potential candidates, who are indecisive, for intervention to increase vaccine acceptance across the country. In this regard, large-scale study is required to understand the knowledge, expectation, and apprehension covering various economic and occupational strata of the society.\n\n© 2022. National Academy of Medical Sciences (India). This is an open access article published by Thieme under the terms of the Creative Commons Attribution-NonDerivative-NonCommercial License, permitting copying and reproduction so long as the original work is given appropriate credit. Contents may not be used for commercial purposes, or adapted, remixed, transformed or built upon. (https://creativecommons.org/licenses/by-nc-nd/4.0/)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "https://www.thieme-connect.de/media/10.1055-s-00044025/202202/lookinside/10-1055-s-0042-1743136_2120296-1.jpg"], "authors": ["neetupms@gmail.com", "Amritesh Chandra Shukla", "Anila Varghese", "Neetu Shukla", "Monika Agarwal", "Anish Khanna", "Department of Botany, Faculty of Science, University of Lucknow, Lucknow, Uttar Pradesh, India", "Department of Community Medicine and Public Health, King George's Medical University, Lucknow, Uttar Pradesh, India"], "publish_date": null}