{"result_id": "159033", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0030-1266335", "timestamp": "2023-04-25 15:31:56 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0030-1266335", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Background: Human papillomavirus (HPV) vaccine has the potential to reduce the incidence of cervical cancer cases in the future; however, the vaccine's success will be dependent in part on current and future uptake. In Germany, STIKO has recommended routine vaccination of 12–17 year-old girls. At present, little is know about HPV vaccine uptake. We investigated HPV vaccine attitudes and uptake in Germany among 18–79 year-old women, their attitudes towards vaccinating a daughter or son, and associations between socio-demographic factors and attitudes towards vaccine uptake. Methods and Materials: In 2007, questionnaires were mailed to 55,000 households belonging to a population-representative panel. Among other health questions, three questions on intention to be vaccinated for HPV, and intention to have a child vaccinated were asked. Logistic regression was used to explore associations between HPV vaccine attitudes and age, education, socio-economic status (SES) and region of residence in Germany. Results: 28,050 (51%) households responded; among these, 21,484 (76.6%) women aged 18–79 from different households answered at least one HPV vaccine question. Of the 21,484 women, only 0.6% had already been vaccinated themselves, but 60.0% had a positive attitude towards doing so, while 18.1% indicated they would not have themselves vaccinated, and 13.9% did not know. Respectively 2.6% and 0.2% had already vaccinated a daughter or son. Among younger women 18–26, 3.3% had already been vaccinated, and 68.5% had a positive attitude towards doing so. In multivariable logistic regression regarding intention to vaccinate oneself, older age, higher education, higher SES and residence in Western Germany were significantly associated with lower intention to be vaccinated among women 18–79. Conclusion: While HPV vaccination uptake is low among women 18 years and older in Germany, intention to vaccinate is high. So far, the cost effectiveness of vaccinating adult women remains questionable.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["M Claus", "S Klug", "K Taylor", "M Blettner"], "publish_date": null}