{"result_id": "159030", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1535-9002", "timestamp": "2023-04-25 15:31:55 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1535-9002", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Background Coronavirus disease 2019 vaccine ChAdOx1 nCov-19 may rarely lead to vaccine-induced thrombotic thrombocytopenia (VITT). Antibody-mediated, platelet factor 4 (PF4)-dependent platelet activation appears to resemble a key mechanism in VITT, partially comparable to heparin-induced thrombocytopenia. The use of PF4/heparin immunoassays has been proposed as part of a diagnostic approach, but their sensitivity has not been established.\n\nMethods Sera from 12 well-defined VITT patients were first studied by two different laboratories in functional assays. Sera where then used for an interlaboratory comparison, in which five different PF4/heparin immunoassays were used by four laboratories.\n\nResults Results for functional testing were highly concordant. VITT antibodies were also reliably detected by PF4/heparin enzyme-linked immunosorbent assays (ELISAs) (92–100%). In contrast, only 25% of VITT antibodies were reactive in a particle gel immunoassay (PaGIA), and 8% in a lateral flow assay (LFA). An automated chemiluminescence immunoassay (CLIA) was negative for all sera tested (0%).\n\nConclusion It seems feasible to establish functional antibody testing for the confirmation of VITT. For the initial screening of suspected VITT cases, PaGIA, LFA, and CLIA are useless when applied as single tests. Only ELISA-based PF4/heparin immunoassays are sensitive enough to be incorporated in the diagnostic workup. However, a combination of a positive ELISA and a negative CLIA may be useful to identify VITT antibodies in the absence of confirmatory functional assays.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/10.1055-s-00035024/202112/lookinside/10-1055-a-1535-9002_210292-1.jpg", "https://doi.org//10.1055/a-1585-6264"], "authors": ["Andreas Czwalinna", "Bernd Pötzsch", "Karina Althaus", "Amedes WagnerStibbe Medical Laboratory, Hannover, Germany", "Institute for Clinical and Experimental Transfusion Medicine, Medical Faculty of Tuebingen, University Hospital of Tuebingen, Tuebingen, Germany", "Institute for Experimental Haematology and Transfusion Medicine, University of Bonn, Bonn, Germany", "Department of Haematology, Haemostasis, Oncology, and Stem Cell Transplantation, Hannover Medical School, Hannover, Germany", "karina.althaus@med.uni-tuebingen.demailto:ulrich.sachs@med.uni-giessen.de", "0000-0002-3600-8536", "Department of Thrombosis and Haemostasis, Giessen University Hospital, Giessen, Germany", "Nina Cooper", "Jens Müller", "Andreas Tiede", "Ulrich J. Sachs", "0000-0002-7279-4861", "Institute for Clinical Immunology and Transfusion Medicine, Justus Liebig University, Giessen, Germany"], "publish_date": null}