{"result_id": "159054", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0036-1597691", "timestamp": "2023-04-25 15:32:07 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0036-1597691", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Journal of Pediatric Infectious Diseases / Abstract", "cleaned_text": "Since the adoption of the varicella-zoster virus (VZV) vaccine, the incidence of varicella infections of all types has declined. Although uncommon, local cutaneous herpes zoster secondary to vaccine-strain VZV has been well documented in healthy children. However, there are few reports of vaccine-strain VZV central nervous system disease in this same population. We present a case of a previously healthy twice-VZV vaccinated 14-year-old girl who presented with rash and headache who was found to have herpes zoster complicated by meningitis. Cerebrospinal fluid polymerase chain reaction confirmed zoster infection secondary to reactivation of vaccine-strain VZV. Her disease course and response to therapy are reviewed.\n\nvaricella-zoster virus vaccine - varicella-zoster virus - herpes zoster - meningitis varicella-zoster virus vaccine - varicella-zoster virus - herpes zoster - meningitis", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "https://www.thieme-connect.de/media/10.1055-s-00029028/201702/lookinside/10-1055-s-0036-1597691_1600037-1.jpg"], "authors": ["Aisha James", "Vandana Madhavan", "Department of Pediatrics, Massachusetts General Hospital, Boston, Massachusetts, United States", "Emily Kung", "Department of Medicine, Massachusetts General Hospital, Boston, Massachusetts, United States", "Division of Pediatric Infectious Disease, Department of Pediatrics, Massachusetts General Hospital, Boston, Massachusetts, United States", "Division of Pediatric Hospitalist Medicine, Department of Pediatrics, Massachusetts General Hospital, Boston, Massachusetts, United States", "akjames@partners.org", "Yih-Chieh Chen"], "publish_date": null}