{"result_id": "159031", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1750788", "timestamp": "2023-04-25 15:31:55 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1750788", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "In parallel to the spread of the novel severe acute respiratory syndrome-coronavirus-2 (SARS-CoV-2), there has been the growing recognition that active SARS-CoV-2 infection has the potential to effect both the peripheral and central nervous systems. When it comes to the SARS-CoV-2 vaccine, however, reporting has been more uncertain. As the vaccination rate has risen, we have seen a rise in rare neurological complications thought to be associated with the vaccination including acute transverse myelitis, Guillain–Barre syndrome, optic neuritis, and Tolosa–Hunt syndrome. The Centers for Disease Control and Prevention (CDC) estimates 98 confirmed cases of Guillain–Barre syndrome out of 12.6 million doses. Given the initial age limits of vaccination eligibility, most reports have been limited to the adult population. Here, we report a case of intracranial hypertension (IH), evolving to fulminant IH in a healthy female after receiving the SARS-CoV-2 vaccine. While elevated intracranial pressure has been reported in the context of active SARS-CoV-2 infections and postinfection multisystem inflammatory syndrome (MIS-C), this is the first reported case of pediatric IH after vaccination alone.\n\nCOVID-19 - vaccine - intracranial hypertension - ophthalmoplegia - VP shunt COVID-19 - vaccine - intracranial hypertension - ophthalmoplegia - VP shunt", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/10.1055-s-00029030/202205/lookinside/10-1055-s-0042-1750788_2100132-1.jpg", "/products/ejournals/buyDocument/10.1055/s-0042-1750788"], "authors": ["Am35@bcm.edumailto:allie.melendez@gmail.com", "0000-0001-6057-0206", "Gunes Orman", "Department of Ophthalmology, Baylor College of Medicine, Houston, Texas, United States", "Farida Abid", "Rod Foroozan", "Alexandria E. Melendez-Zaidi", "Edward B. Singleton Department of Radiology, Texas Children's Hospital, Houston, Texas, United States", "Section of Pediatric Neurology and Developmental Neuroscience, Department of Pediatrics, Baylor College of Medicine and Texas Children's Hospital, Houston, Texas, United States"], "publish_date": null}