{"result_id": "159022", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1755193", "timestamp": "2023-04-25 15:31:51 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1755193", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Journal of Pediatric Infectious Diseases / Abstract", "cleaned_text": "Monkeypox is an emerging zoonotic infection caused by the monkeypox virus, first identified in laboratory monkeys in 1958. Western and Central Africa are endemic regions for the virus.[1] It was not reported outside the endemic countries until 2003, when an outbreak arisen from imported exotic animals took place in the United States. Between 2003 and 2021, several cases of monkeypox linked to travel have emerged in United Kingdom, Israel, and Singapore. All the cases were connected to exposures to Nigeria, except for one, which was a nosocomial infection in United Kingdom.[2] In fact, in earlier incidents, there was no evidence of documented community transmission. Since May 2022, nonendemic countries have been experiencing a global monkeypox epidemic, without documented history of travel to endemic regions. Over 6,000 cases of monkeypox virus have been confirmed in laboratories globally as of the beginning of July 2022.[3] Although not entirely, the recent outbreak has mostly affected gay, bisexual, and men who have sex with men.[4]\n\nMonkeypox has an incubation period of 5 to 21 days. A prodromal period of fever, lymphadenopathy, myalgia, and fatigue is followed by the appearance of a skin rash that characteristically appears initially as macules, which subsequently progress through papules and vesicles; pustules are usually also seen. The lesions are tender, deep-seated, and have a central depression, resembling eruptions of varicella, herpes simplex, smallpox, molluscum contagiosum, and enteroviruses. In contrast to varicella and smallpox, monkeypox frequently causes lymphadenopathy. Rashes of monkeypox disease are generally centrifugal, that is, mostly concentrated on the face, palms of the hands, and soles of the feet. On the other hand, genital, perianal, and oral lesions without involving the face and extremities and without a prodromal phase have been documented during the most recent outbreak.[4] Genital and perianal lesions of monkeypox might be mistaken for sexually transmitted infections such as lymphogranuloma venereum and secondary syphilis. A person is regarded as contagious from the beginning of symptoms until all lesions have crusted, scabbed over, and completely resolved in 7 to 14 days. The route of transmission is through direct and indirect close physical contact with lesions and body fluids, and through respiratory secretions.[5]\n\nMonkeypox is mostly a self-limited illness lasting for 2 to 7 weeks. Complications of the monkeypox virus infection are pneumonia, encephalitis, sepsis, secondary bacterial infections of the skin, retropharyngeal abscess, and keratitis, which can lead to sight loss.[6] The severity of infection is dependent on the age and immune status of the patient, and the strain of the infecting virus. Severe cases are more common in pediatric and immunocompromised patients. Infections from the Central African monkeypox virus clade are more serious and have a greater mortality rate than those from the West African clade. Also, the mortality rate is higher in children aged under 10 years than in adolescents and adults.[6] To protect children, confirmed cases that cannot be isolated away from household members should be hospitalized. The virus can infect the fetus transplacentally and may lead to miscarriage or fetal death.[7] Perinatal or postnatal mother-to-baby transmission of monkeypox is also a risk, because neonatal monkeypox can be life-threatening. The transmission risk of monkeypox virus through breastmilk is still unclear. On the other hand, the transmission risk from intimate physical contact while breastfeeding is well-acknowledged.[8] Finally, it should be noted that, similar to smallpox virus, monkeypox virus has the potential of being used as an agent of bioterrorism.\n\nThe diagnosis of monkeypox relies on epidemiologic, clinical, and laboratory findings. Diagnostic assays for monkeypox virus disease are polymerase chain reaction (PCR) tests for orthopoxvirus and subsequent confirmatory monkeypox virus PCR tests or next-generation sequencing of specimens obtained from lesions in different stages. PCR testing of respiratory and blood samples is not recommended for diagnosis. For confirmed cases, throat swabs and blood, and urine samples may be requested for testing. Isolation of monkeypox virus in culture and visualization of virions through electron microscopy are not used in routine laboratories. Immunoglobulin M and immunoglobulin G antibodies against orthopoxvirus can also be tested for, but positive results can also occur with other orthopoxvirus infections or following recent orthopox vaccination.[9] [10]\n\nAntiviral therapy is indicated for high-risk groups and those with complicated or severe disease. Tecovirimat blocks the egress and cell-to-cell dissemination of orthopoxvirus virions by inhibiting viral VP37 protein and cellular Rab9 GTPase, and TIP47 interaction.[11] The nonreplicating modified vaccinia Ankara (MVA) vaccines (Jynneos, Imvamune, and Imvanex) can be used for pre- and postexposure prophylaxis against monkeypox.[12] Compared with the replication-competent smallpox live-vaccine ACAM2000, which was previously utilized as pre-exposure prophylaxis, the MVA-based vaccines have a better safety profile and fewer contraindications. The MVA vaccines are regarded as safe in high-risk groups, including infants, pregnant and breastfeeding women.[13]\n\nRecently, there have been mounting concerns about the global spread of monkeypox cases. Although monkeypox cases have previously been documented during the past five decades in 10 African countries and 4 countries on different continents, as of July 1st, over 6,000 confirmed cases in 54 countries globally have been reported during the present epidemic.[3] The phylogenetic analysis of the genome of a recent monkeypox outbreak variant reveals numerous single nucleotide polymorphisms and deletions, indicating continuous accelerated microevolution and a sign of potential human adaptation.[14]\n\nThe findings give hints that the ongoing outbreak may be turning into a pandemic problem. Children, pregnant women, and immunocompromised individuals are high-risk groups that will certainly begin to become infected in the near future if the current epidemic continues to develop. Therefore, national and global health authorities should implement urgent preventive measures. Moreover, genomic sequencing of monkeypox virus strains will be crucial for epidemiologic surveillance and monitoring viral evolution.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/s-0042-1755193", "javascript:;", "https://www.thieme-connect.de/media/10.1055-s-00029028/202204/lookinside/10-1055-s-0042-1755193_2200086-1.jpg", "#JR2200086-1", "#JR2200086-2", "#OR2200086-3", "#JR2200086-4", "#JR2200086-4", "#JR2200086-5", "#OR2200086-6", "#OR2200086-6", "#JR2200086-7", "#JR2200086-8", "#OR2200086-9", "#JR2200086-10", "#JR2200086-11", "#OR2200086-12", "#OR2200086-13", "#OR2200086-3", "#JR2200086-14"], "authors": ["0000-0002-9622-6404", "Division of Medical Virology, Department of Medical Microbiology, Necmettin Erbakan University, Meram Faculty of Medicine, Konya, Turkey", "ayserugur@gmail.com", "0000-0002-9316-771X", "Ayşe Rüveyda Uğur", "Mehmet Özdemir", "Division of Medical Virology, Department of Medical Microbiology, Konya City Hospital, Turkey"], "publish_date": null}