{"result_id": "159056", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-1760890?id=&lang=en", "timestamp": "2023-04-25 15:32:08 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-1760890?id=&lang=en", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Pneumologie / Full Text", "cleaned_text": "Background RSV-associated acute respiratory infections (ARI), particularly lower respiratory tract diseases (LRTD), present a significant disease burden in older adults. Currently, there are no approved vaccines against RSV. We present results from an ongoing study designed to demonstrate the vaccine efficacy (VE) of the AS01 -adjuvanted RSVPreF3 OA in adults≥60 YOA.\n\nMethods This ongoing, phase 3, observer-blind, placebo-controlled, multi-country study (NCT04886596) enrolled adults≥60 YOA from the northern and southern hemispheres. Participants were randomized (1:1) to receive a single dose of RSVPreF3 OA or placebo before the RSV season. The primary objective was to demonstrate VE of a single dose of RSVPreF3 OA in preventing RSV-confirmed LRTD during one RSV season (criterion: lower limit of VE confidence interval [CI]>20%). VE is reported also against severe RSV-confirmed LRTD, RSV-confirmed ARI, RSV-confirmed LRTD and RSV-confirmed ARI by RSV subtype (RSV-A and RSV-B), and RSV-confirmed LRTD by age, baseline comorbidity and frailty status. RSV-A/B was confirmed by quantitative RT-PCR.\n\nResults A total of 26,664 participants were enrolled, of whom 24,966 (RSVPreF3 OA: 12,467; placebo: 12,499) were included in the exposed set and 24,960 (RSVPreF3 OA: 12,466; placebo: 12,494) in the efficacy analysis. The mean age was 69.5 (±6.5) years and 51.7% were women. Over a median follow-up of 6.7 months (maximum 10.1 months), 47 RSV-confirmed LRTD episodes were reported (RSVPreF3 OA: 7; placebo: 40), resulting in a VE of 82.6% (96.95% CI: 57.9–94.1), thus the primary objective was met. Consistently high VE across the clinical spectrum of RSV disease, from RSV-confirmed ARI (71.7% [95% CI: 56.2–82.3]) to severe RSV-confirmed LRTD (94.1% [95% CI: 62.4–99.9]) was observed. High VE was seen in different age groups and regardless of RSV subtype, baseline comorbidity or pre-frail status ([Figure 1]). Cumulative incidence curves for RSV-confirmed LRTD and RSV-confirmed ARI showed persistent efficacy throughout the follow-up ([Figure 2]).\n\nConclusion A single RSVPreF3 OA dose is highly efficacious against RSV-confirmed LRTD and RSV-confirmed ARI in adults≥60 YOA, regardless of RSV disease severity, RSV subtype, baseline comorbidity and pre-frail status.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/pneumologie/2023S01/10-1055-s-0043-1760890-i1760890-0001.jpg", "https://www.thieme-connect.de/media/pneumologie/2023S01/10-1055-s-0043-1760890-i1760890-0002.jpg", "#FI19751268-ABS-0005", "#FI19751268-ABS-0006", "#top"], "authors": ["I Leroux-Roels", "A Papi", "Gsk", "V Hulstrøm", "F Martinón-Torres", "L Kostanyan", "N de Schrevel", "L Fissette", "R van Zyl-smit", "J Langley", "T Schwarz", "Ghent University Hospital; Department of Laboratory Medicine", "Glaxosmithkline", "Departments of Pediatrics and Community Health and Epidemiology, Canadian Center for Vaccinology", "N Dezutter", "M David", "Hospital Clínico Universitario de Santiago, Santiago de Compostela, Spain", "M Ison", "Institute of Laboratory Medicine and Vaccination Centre, Klinikum Würzburg Mitte, Standort Juliusspital", "Northwestern University Feinberg School of Medicine", "Seoul St. Mary's Hospital, College of Medicine, The Catholic University of Korea; Division of Infectious Diseases, Department of Internal Medicine", "M Van Der Wielen", "University of Cape Town and Groote Schuur Hospital", "Respiratory Medicine Unit, University of Ferrara, S. Anna University Hospital, Ferrara, Italy", "D Lee"], "publish_date": null}