{"result_id": "159012", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0041-1741052", "timestamp": "2023-04-25 15:31:45 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0041-1741052", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Indian Journal of Radiology and Imaging / Full Text", "cleaned_text": "Context Computerized tomography (CT) is an invaluable imaging investigation for evaluating COVID-19 disease. CT detects early changes of COVID-19 pneumonia and predicts the disease prognosis based on a semiquantitative 25-point CT severity score (CT-SS). India launched its vaccination drive in January 2021 with two different vaccines being approved by the government. These vaccines are believed to prevent the disease itself, in majority of the cases and at least decrease disease severity, in the rest.\n\nAim This study aims to evaluate the CT-SS in vaccinated and non-vaccinated subjects who have been diagnosed with COVID-pneumonia or are COVID suspects.\n\nSubjects and Methods A total of 3,235 patients with typical COVID-19 related imaging findings on HRCT thorax were included in the study. These subjects were divided into three age categories, 18–44, 45–59 and ≥60 years. The CT severity scores were allotted by experienced radiologists. Medians of the scores in different age groups were compared amongst vaccinated and non-vaccinated individuals using the Kruskal–Wallis H test. A p-value < 0.05 was considered significant. All results were shown with 95% confidence interval.\n\nResults The difference in the medians amongst the vaccinated and non-vaccinated groups was significant, p-values being < 0.001 in all age categories.\n\nConclusion The mean CT-SS was less in vaccinated subjects and the difference in median CT-SS amongst vaccinated and non-vaccinated individuals was statistically significant, thus sending an important message that it is mandatory for the population at large to get vaccinated to reduce infection rate/disease severity.\n\nIn December 2019, the World Health Organization (WHO) was informed of mysterious cases of pneumonia emerging in China. Subsequently, the infection spread across the world. The WHO named the causative virus as the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) and the disease caused by it was named coronavirus disease (COVID-19). COVID-19 was declared as a pandemic by the WHO on March 11, 2020.\n\nThe world was at a “pause.” The hunt was on for a vaccine to arrest the spread of this virus and reduce the havoc caused by it. Researchers throughout the world came up with different vaccines in record time.\n\nIn India, as the government launched a mass vaccination drive in January 2021, two different vaccines were approved for emergency use. A total of 54,48,38,391 vaccines have been administered throughout India till 15–08–2021.[1]\n\nThe AstraZeneca COVID-19 Vaccine/COVISHIELD is a non-replicating viral vector vaccine.[2] The Bharat Biotech COVID-19 Vaccine (COVAXIN) on the other hand, uses a complete infective SARS-CoV-2 viral particle consisting of RNA surrounded by a protein shell, but modified so that it cannot replicate.[3] Both these vaccines are two-dose vaccines. The second dose of COVISHIELD vaccine was given 4–12 weeks after the first dose, whereas COVAXIN was given 4 to 6 weeks after the first dose. The interval period between the doses for both the vaccines were later increased to 3 months. Vaccination is believed to decrease the severity of the disease, even when it cannot prevent infection. Since the first outbreak, different strains of the SARS-CoV-2 virus are now being identified and the concern remains as to whether these vaccines can provide protection from the new strains.\n\nThe nasopharyngeal swab RT-PCR (reverse transcriptase-polymerase chain reaction) test is the preferred diagnostic test for confirmation of the COVID-19 disease.[4] In developing countries such as India, where the healthcare system has been stretched thin, particularly during the second wave of the disease; it is at times difficult to get a RT- PCR test report in time. In such a setting, a non-contrast high-resolution CT (HRCT) scan of the thorax has become an essential investigation in diagnosing the disease, particularly when RT-PCR test is false-negative. HRCT, additionally helps in aiding the management and predicting the severity of the disease.[5] [6]\n\nTypical imaging findings in COVID-19 pneumonia patients include (1) bilateral, peripheral ground glass opacities with or without consolidation or septal thickening, (2) multicentric ground glass opacities of rounded morphology with or without consolidation or visible septal lines (“crazy-paving”), and (3) reverse halo opacities.[7]\n\nA semiquantitative assessment of CT involvement in COVID-19 disease has been described with a 25-point scoring system.[8] This scoring system assesses the severity score/involvement score and can anticipate the disease prognosis. It is therefore invaluable in aiding patient management, especially when healthcare resources are limited.[8]\n\nThis study aims to observe for any difference in CT severity scores in COVID-19 patients or suspects amongst vaccinated and non-vaccinated cases.\n\nHRCT scans of a total of 3,235 patients were included in the study. Informed written consent was obtained. The dataset included patients referred to the Department of Radiodiagnosis and Imaging, B.V.D.U.M.C and Hospital, Pune, Maharashtra, India and P. H. Diagnostic center, Pune, Maharashtra, India, for COVID pneumonia. Institutional Ethics committee approval was obtained.\n\nPatients who were RT-PCR- or RAT (rapid antigen test)-positive with findings of COVID-19 pneumonia and COVID-19 suspects who underwent HRCT thorax study with findings suggestive of COVID-19 on the HRCT were included in the study.\n\nCases with history of previous COVID-19 infection or with evidence of underlying infectious/non-infectious lung disease were excluded from the study.\n\nThe vaccine status was noted for each case. The HRCT study was reported, and CT severity score allotted by experienced radiologists. The data for each case was then tabulated in an Excel spreadsheet. The results were finally evaluated with help of various statistical tests.\n\nAll CT examinations were acquired with a 16-slice helical mode CT scanner (Phillips Brilliance ICT-16). The scan parameters used were a tube voltage of 120 kV and tube current of 235 mAs/slice. The slice thickness was 2.0 mm and interslice gap was 10.0 mm. The images were obtained from the level of thyroid gland to the upper pole of the kidneys. The scans were acquired in end-inspiratory phase. Non-contrast scans were obtained. Images were evaluated by experienced radiologists in both lungs (WL 600, WW 1600) and soft tissue (WL 40, WW 400) windows. The CT dosimetry index (CTDI) was 18.2 mGy.\n\nThe statistical analysis was done using the SPSS software, version 25.0. Quantitative variable results were illustrated using descriptive statistics. Qualitative variable results were described using frequency and percentage. Kruskal–Wallis H test was used to test the medians of the CT severity scores amongst vaccinated and unvaccinated individuals. Mann–Whitney U test was used to assess pair-wise comparison. A p-value < 0.05 was considered significant. All results were shown with 95% confidence interval.\n\nOut of 3,235 cases included in the study, 2,750 (85%) patients were laboratory confirmed cases of COVID-19 pneumonia, and 485 (15%) patients were COVID-19 suspects with typical findings suggestive of COVID-19 on HRCT study. Also, 1,863 patients (57.6%) were male, and 1,372 patients (42.4%) were female. The mean age was 46.42 ± 14.88. The mean CT severity score was 7.74 ± 4.71.\n\nWe found that 1,677 cases (51.8%) were in the age group of 18–44 years, 831 cases (25.7%) were in the age group of 45–59 years, whereas 727 cases (22.5%) were in the age group ≥60 years. The mean severity scores in different age groups amongst vaccinated and unvaccinated individuals is described in [Table 1]. The percentage of mild cases was more in the vaccinated group as compared with the unvaccinated group (1 and 2 doses) in all age categories ([Fig. 1]).\n\nIn the age group 18–44 years: Medians of the CT severity scores amongst non-vaccinated cases, cases with history of 1 dose and fully vaccinated cases were 7.0, 5.0, and 3.0, respectively. The difference in the medians amongst the 3 groups was highly significant. (p-value <0.001).\n\nIn the age group 45–59 years: Medians of the CT severity scores amongst non-vaccinated cases, cases with history of 1 dose and fully vaccinated cases were 9.0, 7.0, and 7.0 respectively. The difference in the medians amongst the 3 groups was highly significant. (p-value <0.001).\n\nIn the age group ≥ 60 years: Medians of the CT severity scores amongst non- vaccinated cases, cases with history of 1 dose and fully vaccinated cases were 9.0, 8.0 and 6.0 respectively. The difference in the medians amongst the 3 groups was highly significant. (p-<0.001).\n\nPair-wise comparison between the median CT severity scores amongst vaccinated and non- vaccinated individuals (0 dose-1 dose and 0 dose-2 doses comparison) in all the three age groups was significant ([Table 2]), However, the difference in medians amongst the individuals who received 1 dose and those who received 2 doses was significant (p-value = 0.001) only in the age category ≥60 years. The p-values for pair-wise comparison between subjects who received 1 dose and those who received 2 doses were 0.08 and 0.99 in age categories 18–44 years and 45–59 years, respectively.\n\n25-point CT severity score (CT-SS): According to studies by Malpani et al, the involvement in each of the five lobes of lung can be scored from 1 to 5 as described in [Table 3].[8] The total CT severity score was calculated as a sum of individual lobar scores. The cases were further categorized as mild, moderate, and severe if their scores were ≤9, 10–17. and ≥18 respectively ([Figs. 2] [3] [4]). According to the study by Malpani et al, the patients who fell into the severe category of CT-SS had higher mortality as compared with mild and moderate groups.[8] Thus, this semiquantitative CT-based assessment method helps in the prognosis of patients with COVID-19 and is a useful imaging tool assisting clinicians in patient management in the appropriate setting.\n\nCOVID vaccines: Throughout the world, several different vaccines against COVID-19 disease have been introduced with the Pfizer/BioNtech Comirnaty vaccine being the first vaccine to be approved for the WHO emergency use on December 31, 2020. The different available vaccines can be classified into four types[9]:\n• Inactivated or weakened virus with an inactivated/weakened form of the virus that can induce immune response without causing disease.\n• Protein-based vaccines which use harmless protein fragments that mimic COVID-19 virus.\n• Viral vector vaccine which uses a safe virus as a vector to deliver coronavirus proteins.\n• RNA and DNA vaccines that use genetically engineered RNA/DNA to produce a protein that can safely incite immune response.\n\nIndia launched a mass vaccination drive in January 2021 with two vaccines being approved for emergency use. The COVISHIED vaccine which is a viral vector vaccine and the COVAXIN which is an attenuated virus vaccine.\n\nThese vaccines protect against COVID-19 disease by generating an immune response against the virus. This reduces the risk of developing COVID-19 disease and its complications. The vaccines also aid the human body to fight the virus once infected and are thus believed to reduce the disease severity as well in case the patient gets infected.\n\nCT Severity Score and the vaccines: In patients who were infected despite taking the vaccine, results from our study revealed that the administered vaccine was able to decrease the CT severity score in all the three age groups. Also, the percentage of mild cases as compared with the moderate and severe cases was more in the vaccinated group (1 and 2 doses) than in the non-vaccinated group. As CT severity score reflects clinical prognosis, it can thus be concluded that in those patients that contracted the infection, the vaccine ensured reduced severity of the COVID-19 disease.\n\nOur study had a few limitations. The first scan of the patient was used for CT-SS evaluation and any subsequent scans were not considered. The CT-SS might have changed over a period of time. Also, because it was a hospital-based study and not a population-based study, comorbidities in our subjects may have been more than in the general population affecting the CT-SS. Because the vaccination for the age categories 45–59 and ≥60 years was started earlier, the sample size was larger in this category as compared with the 18–45 years age category. This study was done on the Western–Indian population and hence results obtained cannot be used to reflect the global scenario. Also, we were unable to consider the number of days since vaccination, as we could not get a dependable history of the same. This could have affected the immune-status of the patients and hence the CT-SS.\n\nIn the present study, we were able to deduce that the mean CT-SS was less in vaccinated subjects. The difference in median CT-SS amongst vaccinated and non-vaccinated individuals was significant. Pair-wise comparison of median CT-SS revealed significant difference between vaccinated (1 and 2 doses) and non-vaccinated subjects. However, the difference in median CT-SS amongst subjects who received 1 dose and those who received 2 doses was significant only in the ≥ 60 years age group.\n\nWe could not find any similar published article, but it is recommended that similar studies are undertaken with larger cohort and at multiple centers. Through this study, we assert that the population at large should get vaccinated mandatorily to reduce infection rate/disease severity.\n\nThe authors are deeply indebted to Dr. Rupeshkumar B. Deshmukh, Statistician-Cum-Assistant Professor, Department of Community Medicine, Bharati Vidyapeeth Medical College, for his invaluable opinion and meticulous attention which helped the authors to proceed in the correct direction. The authors thank Dr. Gauri Oka, Research Consultant, Bharati Vidyapeeth Medical College, for her efficient guidance and encouragement. The authors are grateful to all the staff of the Department of Radiodiagnosis, Bharati Vidyapeeth Medical College, Pune, for their unconditional and timely help.\n\nThe authors certify that they have obtained all appropriate patient consent forms. In the form, the patient(s)has/have given his/her/their consent for his/her/their images and other clinical information to be reported in the journal. The patients understand that their names and initials will not be published, and due efforts will be made to conceal their identity, but anonymity cannot be guaranteed.\n• 3 Thiagarajan K. What do we know about India's Covaxin vaccine?. BMJ: British Medical Journal (Online) 2021; 20: 373\n• 4 Corman VM, Landt O, Kaiser M. et al. Detection of 2019 novel coronavirus (2019-nCoV) by real-time RT-PCR. Euro Surveill 2020; 25 (03) 2000045 DOI: 10.2807/1560-7917.ES.2020.25.3.2000045.\n• 5 Bernheim A, Mei X, Huang M. et al. Chest CT findings in coronavirus disease 2019 (COVID-19): Relationship to duration of infection. Radiology 2020; 295 (03) 200463\n• 6 Liu J, Yu H, Zhang S. The indispensable role of chest CT in the detection of coronavirus disease 2019 (COVID-19). Eur J Nucl Med Mol Imaging 2020; 47 (07) 1638-1639\n• 7 Simpson S, Kay FU, Abbara S. et al. Radiological Society of North America Expert Consensus Document on Reporting Chest CT Findings Related to COVID-19: Endorsed by the Society of Thoracic Radiology, the American College of Radiology, and RSNA. Radiol Cardiothorac Imaging 2020; 2 (02) e200152\n• 8 Malpani Dhoot N, Goenka U, Ghosh S. et al. Assigning computed tomography involvement score in COVID-19 patients: prognosis prediction and impact on management. BJR Open 2020; 2 (01) 20200024\n• 9 Vaccines and immunization: What is vaccination? [Internet]. [cited 2021 Jun 6]. Accessed September 9, 2021 from: https://www.who.int/news-room/q-a-detail/vaccines-and-immunization-what-is-vaccination\n\nDepartment of Radiodiagnosis and Imaging, Bharati Vidyapeeth Deemed to be University Medical College and Hospital\n\n© 2022. Indian Radiological Association. This is an open access article published by Thieme under the terms of the Creative Commons Attribution-NonDerivative-NonCommercial License, permitting copying and reproduction so long as the original work is given appropriate credit. Contents may not be used for commercial purposes, or adapted, remixed, transformed or built upon. (https://creativecommons.org/licenses/by-nc-nd/4.0/)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/s-0041-1741052.pdf", "javascript:;", "#N10918", "#N10962", "#N109A4", "#N109B6", "#N109BF", "#N109CE", "#N10ECE", "#N11011", "#N1101A", "#N11041", "#top", "#OR2160562-1", "#OR2160562-2", "#JR2160562-3", "#JR2160562-4", "#JR2160562-5", "#JR2160562-6", "#JR2160562-7", "#JR2160562-8", "#JR2160562-8", "#top", "#top", "#top", "#top", "#TB2160562-1", "#FI2160562-1", "https://www.thieme-connect.de/media/10.1055-s-00050590/202104/10-1055-s-0041-1741052-i2160562-1.jpg", "#TB2160562-2", "#top", "#TB2160562-3", "#JR2160562-8", "#FI2160562-2", "#FI2160562-3", "#FI2160562-4", "#JR2160562-8", "https://www.thieme-connect.de/media/10.1055-s-00050590/202104/10-1055-s-0041-1741052-i2160562-2.jpg", "https://www.thieme-connect.de/media/10.1055-s-00050590/202104/10-1055-s-0041-1741052-i2160562-3.jpg", "https://www.thieme-connect.de/media/10.1055-s-00050590/202104/10-1055-s-0041-1741052-i2160562-4.jpg", "#OR2160562-9", "#top", "#top", "#top", "#top", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/OR2160562-1", "https://dashboard.cowin.gov.in/", "https://www.health.gov.on.ca/en/pro/programs/publichealth/coronavirus/docs/vaccine/COVID-19_AstraZeneca_Vaccine_admin.pdf", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-3", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-4", "https://doi.org/10.2807/1560-7917.ES.2020.25.3.2000045", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-5", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-6", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-7", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/JR2160562-8", "/products/ejournals/linkout/10.1055/s-0041-1741052/id/OR2160562-9", "https://www.who.int/news-room/q-a-detail/vaccines-and-immunization-what-is-vaccination", "mailto:vandana.jahanvi@gmail.com"], "authors": ["Vandana Jahanvi", "Department of Radiodiagnosis and Imaging, Bharati Vidyapeeth Deemed to be University Medical College and Hospital, Pune, Maharashtra, India", "Mangal S. Mahajan", "vandana.jahanvi@gmail.com", "Priyankkumar G. Moradiya", "Priscilla C. Joshi", "Shivani N. Pawar", "Nivedita C. Ghule Patil"], "publish_date": null}