{"result_id": "159008", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1469-7481", "timestamp": "2023-04-25 15:31:43 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1469-7481", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Hämostaseologie / Full Text", "cleaned_text": "The COVID-19 pandemic is an ongoing global healthcare crisis. Based on reports of atypically located thromboses following vaccination with the AstraZeneca COVID-19 vaccine, the Society of Thrombosis and Haemostasis Research (GTH) has issued guidance statements on the recognition, diagnosis, and treatment of this rare complication. It shares pathophysiological features with heparin-induced thrombocytopenia (HIT) and is referred to as vaccine-induced prothrombotic immune thrombocytopenia (VIPIT).\n\nCoronavirus disease 2019 (COVID-19) is an infectious disease caused by the novel severe acute respiratory syndrome coronavirus type 2 (SARS-CoV-2), which can lead to systemic multiorgan complications.[1] In particular, the risk of both venous and arterial thromboembolism is significantly increased.[2] [3] Several vaccines have been licensed and are currently being used in the European Union to combat the COVID-19 pandemic.\n\nOn Monday, March 15, 2021, vaccinations with the COVID-19 vaccine from AstraZeneca (AZD1222) were temporarily halted by the German Ministry of Health and other European countries due to safety concerns regarding an elevated risk of thrombosis in vaccinated individuals. Following the assessment of the potential risks and benefits of the vaccine by the safety committee of the European Medicines Agency (EMA),[4] vaccinations were resumed on Friday, March 19, 2021. By that time, the Paul Ehrlich Institute (PEI) had reported on 13 cases of sinus or cerebral vein thrombosis with more than 1.6 million AstraZeneca COVID-19 vaccine doses administered. The thromboses had occurred 4 to 16 days after vaccination with the AstraZeneca COVID-19 vaccine in twelve women and one man aged 20 to 63 years. The patients also had thrombocytopenia, which suggests an immunological event as the cause of the tendency to thrombosis. However, thrombotic events may not exclusively present as intracranial thrombosis but also manifest at other locations or vascular beds.\n\nAn important pathomechanism has meanwhile been clarified within the Society of Thrombosis and Haemostasis Research (GTH) by the Greifswald Working Group under the leadership of Andreas Greinacher. The vaccination is likely to induce the formation of antibodies against platelet antigens as part of the inflammatory reaction and immune stimulation. Depending on or independently of heparin, these antibodies subsequently cause massive platelet activation via the Fc receptor in analogy to heparin-induced thrombocytopenia (HIT). This mechanism (HIT mimicry) could be demonstrated in four patients with a sinus/cerebral vein thrombosis after vaccination with the AstraZeneca COVID-19 vaccine in Andreas Greinacher's laboratory in cooperation with other GTH members. It is currently unclear, however, why this immunogenic thrombosis preferentially manifests in cerebral vessels.\n\nAs with classical HIT, these antibodies appear 4 to 16 days after vaccination. This pathomechanism does not rule out that the sinus/cerebral vein thromboses after vaccination with the AstraZeneca COVID-19 vaccine also have other causes. However, the identified mechanism forms the basis for the following statements and recommendations by the GTH:\n• On a population basis, the positive effects of vaccination with the AstraZeneca COVID-19 vaccine outweigh the negative effects; so, the resumption of vaccinations in Germany with this vaccine is to be welcomed.\n• According to the current state of knowledge, there is no evidence that thromboses at typical locations (i.e., leg vein thrombosis, pulmonary embolism) are more common after vaccination with the AstraZeneca COVID-19 vaccine than in the age-matched general population.\n• Due to the immunogenesis of thrombosis in intracranial veins or other (atypical) locations, patients with a positive history of thrombosis and/or known thrombophilia do not have an increased risk of developing this specific and very rare complication after vaccination with the AstraZeneca COVID-19 vaccine.\n• Flulike symptoms such as joint and muscle pain or headache that persist for 1 to 2 days after vaccination are a common side effect and not a cause for concern.\n• In the event of side effects that persist or recur more than 3 days after vaccination (e.g., dizziness; headache; visual disturbances; nausea/vomiting; shortness of breath; acute pain in chest, abdomen, or extremities), further medical diagnostics should be carried out to clarify a thrombosis.\n• Important examinations include, in particular, complete blood count analysis with determination of platelet count, blood smear, D-dimers, and, whenever indicated, further imaging studies (e.g., cranial magnetic resonance imaging, ultrasound, computed tomography of the chest/abdomen).\n• In the event of thrombocytopenia and/or evidence of thrombosis, testing for pathophysiologically relevant antibodies should be carried out regardless of previous exposure to heparin ([Fig. 1]). The first test in the diagnostic algorithm is a screening test for HIT, which is based on the immunological detection of antibodies against the platelet factor 4 (PF4)/heparin complex.\n• In case the screening test is negative, an HIT-like specific immunological cause of thrombosis/thrombocytopenia can be ruled out. Importantly, not all commercially available tests validated for the diagnosis of HIT are suitable for the detection of antibodies involved in the specific pathogenesis of thrombosis following vaccination with the AstraZeneca COVID-19 vaccine. Based on preliminary observations, the HYPHEN BioMed ZYMUTEST and the Immucor GTI Diagnostics enzyme immunoassays appear to have appropriate sensitivity for all pathophysiologically relevant antibodies.\n• In case the screening test for PF4/heparin antibodies is positive, a classical heparin-induced platelet activation (HIPA) assay or serotonin-release assay (SRA) should be ordered as a functional confirmatory test. These two assays detect pathophysiologically relevant antibodies, which activate platelets dependent on (typical HIT) or independent of exogenous heparin (autoimmune HIT). A positive test result in the absence of previous heparin exposure thus establishes the diagnosis of autoimmune HIT.\n• In case the classical HIPA (or SRA) does not confirm (autoimmune) HIT, a modified HIPA assay should be ordered. This assay has recently been established in Andreas Greinacher's laboratory in Greifswald and detects pathophysiologically relevant antibodies, which display a reaction pattern different from that observed in (autoimmune) HIT.[5] Thus, a positive test result establishes the diagnosis of vaccine-induced prothrombotic immune thrombocytopenia (VIPIT).\n• Until (autoimmune) HIT is ruled out as the cause of acute thrombocytopenia/thrombosis, if the clinical situation, availability, and experience permit, anticoagulation with heparins should be avoided and alternative, HIT-compatible anticoagulants should be used. These anticoagulants include danaparoid, argatroban, direct oral anticoagulants (DOACs), and possibly fondaparinux. Regarding the use of fondaparinux, treatment of acute thrombosis occurring more than 4 days following vaccination with the AstraZeneca COVID-19 vaccine must be differentiated from pharmacological thromboprophylaxis during the early phase following vaccination, which is characterized by activation of inflammatory, immunostimulatory signaling pathways and during which administration of fondaparinux may, at least theoretically, foster the production of platelet-activating antibodies (see later).\n• In patients with confirmed (autoimmune) HIT or VIPIT and critical thromboses such as sinus/cerebral or splanchnic vein thrombosis, the prothrombotic pathomechanism can very likely be interrupted by administration of high-dose intravenous immunoglobulins (IVIG), for example, at a dose of 1 g/kg of body weight daily on 2 consecutive days.[6] [7] Anticoagulation will still be necessary to treat the thrombosis. While heparins are contraindicated in (autoimmune) HIT, parenteral anticoagulation with heparins is likely possible in confirmed VIPIT.\n• Diagnostics for HIT/VIPIT should be ordered prior to the administration of IVIG, since high-dose immunoglobulins may lead to false-negative test results.\n• Routine pharmacological thromboprophylaxis with anticoagulants or antiplatelet agents to prevent (atypically located) thrombosis resulting from the specific immunological response following vaccination with the AstraZeneca COVID-19 vaccine is not indicated.\n• Patients receiving oral anticoagulation (OAC) for indications such as atrial fibrillation or venous thromboembolism (VTE) should continue OAC during and after vaccination.\n• In patients with no indication for OAC who are at significant risk of VTE based on dispositional risk factors, pharmacological thromboprophylaxis over several days may be indicated on an individual basis in case of severe flulike symptoms with fever and immobilization (AWMF S3 guideline VTE prophylaxis[8] [9]).\n• Since pathophysiologically relevant HIT-like antibodies have been described in association with the specific immunological response following vaccination with the AstraZeneca COVID-19 vaccine, the authors of this guidance document advise against the use of low-molecular-weight heparin or fondaparinux for pharmacological thromboprophylaxis. According to the current state of knowledge, it cannot be safely ruled out that such parenteral anticoagulants foster the production of platelet-activating antibodies.\n• In addition to general measures (e.g., exercise, fluid replacement, compression stockings), prophylactic dosages of DOACs, such as rivaroxaban 10 mg once daily or apixaban 2.5 mg twice daily, maybe be considered as an alternative on an off-label basis.\n• Regardless of (autoimmune) HIT and VIPIT test results, alternative causes of thrombocytopenia and/or thrombosis must be considered and further clarified accordingly. These include, for example, thrombotic microangiopathies such as immune thrombotic-thrombocytopenic purpura or atypical hemolytic uremic syndrome, antiphospholipid syndrome, paroxysmal nocturnal hemoglobinuria, and underlying malignant (hematological) diseases.\n\nThe guidance statements provided here may need an update upon availability of further evidence. Every reader is therefore advised to stay updated with the latest literature on this topic. The GTH guidance on VIPIT will be regularly updated on https://gth-online.org.\n\nJ.O. has received personal fees for lectures or consultancy and/or research support from Bayer, Biogen Idec, Biotest, Chugai, CSL Behring, Grifols, Novo Nordisk, Octapharma, Pfizer, Roche, SOBI, and Takeda, outside the submitted work.\n\nR.K. reports grants and personal fees from Bayer, grants and personal fees from LEO Pharma, personal fees from Pfizer, personal fees from Bristol-Myers Squibb, and grants and personal fees from Daiichi Sankyo, outside the submitted work.\n\nF.L. has received personal fees for lectures, advisory boards, or consultancy and/or research support from Aspen, Bayer, Boehringer Ingelheim, Bristol-Myers Squibb, Daiichi Sankyo, LEO Pharma, Pfizer, and Sanofi, outside the submitted work.\n\nM.A. has served as a member of the Paediatric Expert Working Group for Boehringer Ingelheim and Daiichi Sankyo, outside the submitted work.\n\nC.A. has received personal fees for lectures and/or advisory boards from Bayer, Bristol-Myers Squibb, Daiichi Sankyo, Pfizer, and Sanofi, outside the submitted work.\n\nW.K. has received personal fees, research grants, and/or travel support from AxonLab, Bayer, Bristol-Myers Squibb, Daiichi Sankyo, Portola, Sanofi, and SOBI, outside the submitted work.\n\nR.E.S. reports grants and personal fees from Bayer HealthCare, personal fees from Bayer Vital, personal fees from CSL Behring, grants and personal fees from Pfizer, and personal fees from Takeda, outside the submitted work.\n\nA.G. has received personal fees, grants, and/or travel support from Aspen, Bayer, Boehringer Ingelheim, Biokit, BioMarin/Prosensa, Blau Farmaceutica, Chromatec, DRK-BSD Baden-Württemberg/Hessen, DRK-BSD NSTOB, Ergomed, Gore Inc., Instrumentation Laboratory, Macopharma, ParinGenix, Portola, Roche, Rovi, Sagent, and Sanofi, outside the submitted work.\n\nC.v.A. and B.P. declare no conflicts of interest.\n• 2 Langer F, Kluge S, Klamroth R, Oldenburg J. Coagulopathy in COVID-19 and its implication for safe and efficacious thromboprophylaxis. Hamostaseologie 2020; 40 (03) 264-269\n• 3 Nopp S, Moik F, Jilma B, Pabinger I, Ay C. Risk of venous thromboembolism in patients with COVID-19: a systematic review and meta-analysis. Res Pract Thromb Haemost 2020; 4 (07) 1178-1191\n• 7 Warkentin TE. High-dose intravenous immunoglobulin for the treatment and prevention of heparin-induced thrombocytopenia: a review. Expert Rev Hematol 2019; 12 (08) 685-698\n• 8 Haas S, Encke A, Kopp I. [German S3 practice guidelines on prevention of venous thromboembolism--new and established evidence]. Dtsch Med Wochenschr 2016; 141 (07) 453-456\n• 9 Haas S, Encke A, Kopp I. German S3 guideline for the prevention of venous thromboembolism updated comment on Vasa Supplement 92. Vasa 2016; 45 (05) 347-348", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/a-1469-7481.pdf", "javascript:;", "https://doi.org//10.1055/s-0041-1729135", "#N1111C", "#N11126", "#N11234", "#top", "#top", "#JR210022-1", "#JR210022-2", "#JR210022-3", "#OR210022-4", "#FI210022-1", "#OR210022-5", "#JR210022-6", "#JR210022-7", "#JR210022-8", "#JR210022-9", "https://www.thieme-connect.de/media/10.1055-s-00034925/202103/10-1055-a-1469-7481-i210022-1.jpg", "https://gth-online.org", "#top", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-1", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-2", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-3", "https://www.ema.europa.eu/en/news/covid-19-vaccine-astrazeneca-benefits-still-outweigh-risks-despite-possible-link-rare-blood-clots", "/products/ejournals/linkout/10.1055/a-1469-7481/id/OR210022-5", "https://www.researchsquare.com/article/rs-362354/v1", "https://doi.org/10.21203/rs.3.rs-362354/v1", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-6", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-7", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-8", "/products/ejournals/linkout/10.1055/a-1469-7481/id/JR210022-9", "mailto:langer@uke.de"], "authors": ["Cihan Ay", "Manuela Albisetti", "Wolfgang Korte", "Andreas Greinacher", "Vivantes Klinikum im Friedrichshain, Klinik für Innere Medizin Angiologie und Hämostaseologie, Berlin, Germany", "Institut für Immunologie und Transfusionsmedizin, Universitätsmedizin Greifswald, Greifswald, Germany", "Bernd Pötzsch", "Johannes Oldenburg", "langer@uke.de", "Zentrum für Onkologie, II. Medizinische Klinik und Poliklinik, Universitätsklinikum Eppendorf, Hamburg, Germany", "Zentrum für Labormedizin, Hämostase- und Hämophilie-Zentrum, Hämatologisches Ambulatorium, St. Gallen, Switzerland", "Institute of Experimental Haematology and Transfusion Medicine, University Clinic Bonn, Bonn, Germany", "Universitätsmedizin Mainz, III. Medizinische Klinik/Hämatologie/CTH, Mainz, Germany", "Rüdiger E. Scharf", "Institut für Transplantationsdiagnostik und Zelltherapie/Hämostaseologie, Hämotherapie und Transfusionsmedizin, Universitätsklinikum Düsseldorf, Düsseldorf, Germany", "Universitäts-Kinderspital Zürich, Hämatologie, Zürich, Switzerland", "Charis von Auer", "Clinical Division of Haematology and Haemostaseology, Department of Medicine I, Medical University of Vienna, Vienna, Austria", "Florian Langer", "Robert Klamroth"], "publish_date": null}