{"result_id": "159041", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1755196", "timestamp": "2023-04-25 15:32:00 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1755196", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Homœopathic Links / Abstract", "cleaned_text": "The history of vaccine development has seen many accomplishments, but there are still many diseases that are difficult to target, and new technologies are being brought to bear on them. Past successes have been largely due to elicitation of protective antibodies based on predictions made from the study of animal models, natural infections and seroepidemiology. Those predictions have often been correct, as indicated by the decline of many infections for which vaccines have been made over the past 200 years. However, although vaccines have undoubtedly saved many millions of lives and are heralded as one of the greatest medical inventions of all time, this is also an era of increasing vaccine hesitancy, with surveys suggesting that a large percentage of the population are unsure whether they would opt to receive a vaccine even if one becomes available for even the most virulent pandemic situation. But as age progresses, new variants of infective agents with resistance to primitive methods of immunisations have evolved. Hence, new vaccine technologies able to achieve rapid development as well as large scale production are of pivotal importance. This review emphasises on the history of vaccines, their development through ages, new technologies of vaccination, their adverse effects and homoeopathic viewpoint in the light of vaccinations.\n\nvaccination - homoeopathy - nucleic acid-based technologies - autoimmune diseases vaccination - homoeopathy - nucleic acid-based technologies - autoimmune diseases", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/s-0042-1755196", "javascript:;", "https://www.thieme-connect.de/media/HL/202202/lookinside/10-1055-s-0042-1755196_2210525-1.jpg"], "authors": ["Sadia Kamal", "Debanjan Chowdhury", "sadiakamal206@gmail.com", "PGT Department of Practice of Medicine, The Calcutta Homoeopathic Medical College and Hospital, Kolkata, West Bengal, India", "0000-0002-3909-3094"], "publish_date": null}