{"result_id": "159018", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1850-3199", "timestamp": "2023-04-25 15:31:49 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1850-3199", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - American Journal of Perinatology / Abstract", "cleaned_text": "Objective As pediatric COVID-19 vaccine eligibility expands, understanding predictors of vaccine intent is critical to effectively address parental concerns. Objectives included: (1) Evaluate maternal COVID-19 vaccine intent for child(ren) and associated predictors of stated intent; (2) Describe attitudes related to hypothetical vaccination policies; (3) Summarize themes associated with intention to vaccinate child(ren) for COVID-19.\n\nStudy Design Mothers enrolled in Heath eMoms, a longitudinal survey project, were recruited for this electronic COVID-19 survey. Chi-square analysis was used to compare proportions of respondent characteristics based on vaccination intent. Population survey logistic regression was used for multivariable modeling to assess the independent association between vaccine intent and demographics.\n\nResults The response rate was 65.3% (n = 1884); 44.2% would choose vaccination, 20.3% would not choose vaccination, and 35.5% are unsure whether to have their child(ren) vaccinated for COVID-19. Black mothers (AOR 0.26, 95% CI 0.13, 0.54), respondents with less than high school education (AOR 0.26, 95% 0.12, 0.56) and those in rural areas (AOR 0.28, 95% CI 0.16, 0.48) were less likely to choose vaccination. Commonly cited reasons for vaccine hesitancy include the belief that the vaccine was not tested enough, is not safe, and there are concerns regarding its side effects.\n\nConclusion Over 50% of respondents do not intend or are unsure about their intent to vaccinate their child(ren) for COVID-19 with variability noted by demographics. Opportunities exist for perinatal and pediatric providers to educate pregnant people, parents, and caregivers with a focus on addressing concerns regarding vaccine safety and efficacy.\n• COVID-19 vaccination rates remain suboptimal, especially in the pediatric population, with variation across states.\n• We found that the prevalence of vaccine acceptance for young children is low.\n• We highlight opportunities for providers to educate parents, focusing on addressing vaccine safety and efficacy.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/a-1850-3199", "javascript:;", "https://www.thieme-connect.de/media/ajp/202301/lookinside/10-1055-a-1850-3199_210711-1.jpg", "https://www.thieme-connect.de/media/ajp/202301/supmat/10-1055-a-1850-3199-s210711.pdf"], "authors": ["stephanie.bourque@childrenscolorado.org", "Blair W. Weikel", "Sunah S. Hwang", "Sarah Blackwell", "Colorado Department of Public Health and Environment, Aurora, Colorado, United States", "Department of Pediatrics, Section of Infectious Diseases, University of Colorado School of Medicine, Aurora, Colorado, United States", "Stephanie L. Bourque", "Claire Palmer", "Department of Pediatrics, Section of Neonatology, University of Colorado School of Medicine, Aurora, Colorado, United States", "Adult and Child Consortium for Health Outcomes Research and Delivery Science, University of Colorado School of Medicine and Children's Hospital Colorado, Aurora, Colorado, United States", "0000-0003-4938-7296", "Jessica R. Cataldi"], "publish_date": null}