{"result_id": "159025", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-2007-976489?device=mobile&lang=de", "timestamp": "2023-04-25 15:31:53 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-2007-976489?device=mobile&lang=de", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Respiratory syncytial virus (RSV) is a common wintertime respiratory virus that affects persons of all ages and is the major cause of serious lower respiratory tract infections in young children. However, RSV is also an important pathogen in adults, particularly in the elderly, patients with chronic lung disease, or those with impaired immunity. Clinical features of RSV infections overlap with other respiratory viruses, so laboratory tests are required to establish the diagnosis. Reverse transcriptase polymerase chain reaction (RT-PCR) of samples from nasal swabs, sputum, or bronchoalveolar lavage is a sensitive test to substantiate the diagnosis. Serologies are useful in epidemiological surveys. The clinical course of RSV infections is variable. In infants, RSV presents as bronchiolitis. In adults, mild to moderate upper respiratory tract illness is characteristic. However, severe pneumonia can occur, particularly in the elderly with comorbidities or compromised immune status. Humoral antibodies confer partial immunity to RSV infection and disease severity; cellular immunity is important to eradicate RSV in established infections. Treatment of RSV infections is often supportive. Aerosolized ribavirin is approved for RSV infections in infants; its role in adults is controversial. Infection control measures are critical to limit spread of RSV. Currently, RSV vaccines are not available, but candidate vaccines are being developed.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/srccm/200702/lookinside/10.1055-s-2007-976489-1.jpg", "/products/ejournals/buyDocument/10.1055/s-2007-976489"], "authors": ["Ann R. Falsey"], "publish_date": null}