{"result_id": "159044", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0036-1586101", "timestamp": "2023-04-25 15:32:01 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0036-1586101", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - American Journal of Perinatology / Volltext", "cleaned_text": "Objective Numerous observational studies have evaluated the relationship between influenza vaccination during pregnancy and birth outcomes. The number of studies on this subject has increased, especially after the 2009 A/H1N1 pandemic (A/H1N1pdm09). This meta-analysis aims to determine the impact of maternal vaccination with either seasonal trivalent inactivated influenza vaccines (IIV) or A/H1N1pdm09 monovalent vaccines on the rates of preterm (PTB), small for gestational age (SGA), and low birth weight (LBW) births.\n\nMethods English language randomized controlled trials and observational studies assessing the proposed outcomes after administration of influenza vaccine during pregnancy were screened. Observational studies were included if they presented adjusted measures and if the total number of women evaluated reached predefined thresholds. Sensitivity analyses were performed, including all published observational studies irrespectively of the sample size.\n\nResults A total of 5 and 13 publications that assessed the impact of IIV and monovalent A/H1N1pdm09 vaccines, respectively, fulfilled the inclusion criteria for the main analyses. The rate of PTB and LBW was lower in women who received IIV during pregnancy compared with nonvaccinated women (odds ratio [OR]: 0.87; 95% confidence interval [CI]: 0.77, 0.98 for PTB and OR: 0.74; 95% CI: 0.61, 0.88 for LBW); and in women vaccinated with monovalent A/H1N1pdm09 versus nonvaccinated women (OR: 0.92; 95% CI: 0.85, 0.99 for PTB and OR: 0.88; 95% CI: 0.79, 0.98 for LBW). No significant impact of vaccination on SGA birth rates was detected in the main analyses independently of the vaccine group.\n\nConclusion Receipt of influenza vaccine during pregnancy was associated with a decreased risk of PTB and LBW.\n\nTwo recent clinical trials and several epidemiological studies have affirmed the safety of maternal influenza vaccination[1] [2] (for review[3] [4] [5]). The randomized controlled trials (RCTs) reported that maternal vaccination was associated with a reduction in influenza-confirmed illness among the women (50%) and their infants (49–63%).[1] [2] These two studies, however, differed on whether maternal vaccination improved birth outcomes. The initial analysis from the Bangladeshi trial (control group received a pneumococcal vaccine), reported no differences in birth weights and rates of small for gestational age (SGA) births between the influenza-vaccinated and control group (n = 340).[2] In a subsequent analysis, however, a reduction in SGA (adjusted odds ratio [aOR]: 0.44; 95% confidence interval [CI]: 0.19, 0.99) and a significant increase in mean birth weight (193 g increase; 95% CI: 9, 378) was detected for births occurring during the period with influenza viral activity in the influenza-vaccinated group compared with the control group, while no such effects were evident for births occurring during no influenza activity.[6] A larger randomized, placebo-controlled trial (n = 2,049) in South Africa during 2011 to 2012 did not identify any difference in birth weights between the study groups; including when stratifying births in relation to the influenza season.[1] Similarly, there are conflicting findings from epidemiological studies on the relationship of seasonal influenza vaccination of pregnant women and whether this could improve birth outcomes.[7] [8] [9] [10] [11] [12]\n\nComplications of preterm birth (PTB) were ranked the leading cause of under-five childhood mortality in 2013.[13] Hence, understanding whether maternal influenza vaccination improves birth outcomes, is critical in deciding if maternal influenza vaccination should be promoted in many low-middle income countries where it is yet to be implemented, as well as gathering evidence to improve coverage in those countries where it is already recommended. To address this, we performed a meta-analysis of selected observational studies that evaluated if influenza vaccination during pregnancy with either seasonal trivalent inactivated influenza vaccines (IIV) or monovalent vaccines containing the 2009 A/H1N1 pandemic (A/H1N1pdm09) strain impacted on the birth outcomes of PTB, SGA, and low birth weight (LBW).\n\nWe followed the standard guidelines for the systematic review of observational studies and used the reporting checklist for meta-analyses of observational studies.[14] Since this review only covers published articles, PubMed and MEDLINE were searched using the search terms “influenza vaccine pregnancy,” “preterm birth,” “preterm delivery,” “birth weight,” and “small for gestational age” to find published studies in peer-reviewed journals that assessed the association between influenza vaccination during pregnancy and PTB, SGA, and LBW. The literature search was undertaken up to June 2015 and only studies in English were considered for inclusion. For observational studies to be included in this review, the reported measures of association must have been adjusted for potential confounding variables by either multivariable adjustment, propensity-score adjustment, or subject to propensity-score matching; the studies must compared influenza vaccination with no influenza vaccination during pregnancy; studies reporting on passive surveillance were excluded. The references of all included articles were searched for additional studies.\n\nArticles selected for retrieval were assessed by two reviewers (M. C. N. and A. R. A.) for methodological validity. For each included study, information extracted included study design and research methods, subjects' characteristics, measures of association and precision, and which variables the measure was adjusted for.\n\nDefinitions reported in each study are described in [Tables 1] and [2]. Two of the studies included in the analysis reported overall rate of LBW and term-LBW; in this meta-analysis, only the overall rate of LBW was included.[8] [9] In one study vaccinated and nonvaccinated women were compared by both logistic-regression and Cox-proportional hazard models treating the exposure as a nontime-varying variable, the calculated odds ratios (OR) and hazard ratios (HR) were in general comparable we reported the HR.[15]\n\nThe analyses of PTB, SGA, and LBW were done separately and stratified by the vaccine used in the study; the two main groups analyzed were studies on seasonal IIV and monovalent A/H1N1pdm09 vaccines. Only studies that evaluated at least 1,838, 2,708, and 3,280 birth outcomes were included in the main analyses of SGA, PTB, and LBW, respectively. These total threshold values were based upon plausible effect sizes, baseline rates, and at least 80% power to detect differences for each of these outcomes. For PTB, SGA, and LBW outcomes, we hypothesized that influenza vaccine would reduce the prevalence of each outcome by 10 to 50%. Therefore, we assumed that the difference to be detected was an OR of 0.5 to 0.9 (by 0.05 increments). We determined an assumed baseline rate for PTB, SGA, and LBW outcomes based on three sources of information from three regions in the world using PubMed and study reports.[16] [17] [18] [19] Sensitivity analyses were performed, including all published studies irrespective of sample size. The main analyses only included observational studies, in separate sensitivity analyses, the RCTs were also included. Subanalyses were done for studies reporting measures by periods of influenza activity. The associations between birth outcomes and vaccination status are represented in forest plots, where each study is displayed as a square and horizontal lines representing the relative effect measure and its 95% confidence intervals (95% CI), the area of the square represents the weight that the study contributes to the meta-analysis; the combined effect measures and its 95% CI are represented by a diamond. aOR, HR, and relative risks were considered comparable. Combined effect measures and corresponding 95% CI were calculated using the Dersimonian–Laird method. Statistical heterogeneity of effect measures assessed by means of the I2-statistic and the corresponding p values were calculated by log-relative effect measures using a random-effects model. Funnel plots assessed the existence of publication bias, since statistical tests for asymmetry are low powered, funnel plots were interpreted by visual inspection. All meta-analysis procedures were performed using STATA, version14.0 (College Station, TX), NCSS Power Analysis & Sample Size (PASS) software versions 11 and 12 (Kaysville, UT) was used for power calculations.\n\nThe literature search yielded 1,041 citations, of these 107 were duplicates, 882 were removed based on title/abstracts deemed not relevant; 52 were fully reviewed. Five studies reported crude numbers and percentages and did not report adjusted measures for birth outcomes. A total of 24 studies were removed because the outcome measures or the comparison group did not meet inclusion criteria and 18 studies were included in the final main analyses ([Fig. 1]). For purposes of the analyses two groups of studies, based on vaccine type, were generated: (1) seasonal IIV (five studies selected for the main analyses), [Table 1]; (2) monovalent A/H1N1pdm09 vaccines (13 studies selected for the main analyses), [Table 2]. All the five studies that assessed the impact of IIV were retrospective cohort studies.[7] [8] [9] [11] [12] Of the 13 studies included in the A/H1N1pdm09 vaccine analyses, one was cross sectional,[20] one was a prospective-cohort[15] study, and 11 were retrospective-cohort studies.[21] [22] [23] [24] [25] [26] [27] [28] [29] [30] [31] The sensitivity analyses with smaller studies, evaluated two additional studies with seasonal IIV[32] [33] and one additional study of A/H1N1pdm09 vaccine (Table 1, Supplementary Material available in the online version only).[34] The RCTs were considered in separate sensitivity analyses (Table 2, Supplementary Material available in the online version only).[1] [6]\n\nThree studies from the United States and two from Canada fulfilled our criteria for inclusion in the analysis of the effect of IIV on PTB.[7] [8] [9] [11] [12] All the five studies reported aOR < 1, although in only one study did the 95% CI not cross the unit.[9] The heterogeneity among the studies was moderate (I2 = 48.9%, p = 0.098) and the pooled OR of the meta-analysis for PTB comparing vaccinated women with nonvaccinated was 0.87 (95% CI: 0.77, 0.98), [Fig. 2A]. Only one study was performed after the 2009A/H1N1 pandemic season, therefore including A/H1N1pdm09 strain as part of the seasonal vaccine.[9] Including in the meta-analysis solely studies reporting on the effect of seasonal vaccine without the A/H1N1pdm09 strain (i.e., excluding Legge et al) the estimated OR approached 1 (0.94 [95% CI: 0.87, 1.01]), [Fig. 2B].\n\nA sensitivity analysis, including two smaller studies that evaluated the effect of IIV containing the A/H1N1pdm09 strain on PTB resulted in a nonsignificant combined OR of 0.86 (95% CI: 0.73, 1.01), with significant heterogeneity (I2 = 61.6%, p = 0.015) (Fig. 1, Supplementary Material available in the online version only).[32] [33] The inclusion of the two RCTs did not change the pooled estimate of the sensitivity analysis (Fig. 2, Supplementary Material available in the online version only).[1] [6]\n\nTwo studies from the United States that used information on influenza circulation, besides reporting the overall effect of vaccination on PTB, also evaluated that effect on the smaller group of women who delivered during influenza seasons.[7] [12] The separate subanalysis of births that occurred during the period of widespread influenza activity resulted in a pooled OR of 0.34 (95% CI: 0.19, 0.62) (Fig. 3A, Supplementary Material available in the online version only). When the period of least local influenza activity was considered the combined OR was nonsignificant (Fig. 3C, Supplementary Material available in the online version only). Including the data from the 116 women from the Bangladeshi RCT who delivered during influenza season, the subanalysis pooled estimate was similar (Fig. 4A, B, Supplementary Material available in the online version only).[6]\n\nThe same five studies also assessed the association between receipt of seasonal IIV during pregnancy and SGA births.[7] [8] [9] [11] [12] Only one of the studies detected a significant effect, with vaccination being associated with decreased risk of SGA.[8] In the meta-analysis, there was no obvious heterogeneity among the chosen studies (I2 = 41.0%; p = 0.148) and the combined OR was nonsignificant (0.95 [95% CI: 0.86, 1.06]), [Fig. 3A]. Excluding the Legge et al study the pooled OR did not change, [Fig. 3B]. The sensitivity analysis, including the RCT from Bangladesh provided a similar pooled OR (Fig. 5, Supplementary Material available in the online version only).\n\nThe subanalysis of the two studies that stratified the results by influenza activity did not show an effect during the period of influenza circulation (Fig. 6A, C, Supplementary Material available in the online version only).[7] [12] A protective effect of IIV against SGA births occurring during the influenza season was detected when the RCT was included in the meta-analysis (OR: 0.48 [95% CI: 0.28, 0.81]), however, an approach using more conservative data from the United States studies resulted in a nonsignificant pooled OR (0.75 [95% CI: 0.50, 1.12]) (Fig. 6A, C, Supplementary Material available in the online version only).\n\nOnly two studies, both from Canada, evaluated the effect of seasonal IIV on LBW.[8] [9] Both studies found that compared with newborns of nonvaccinated women, those born to vaccinated mothers had lower odds of LBW in seasons where the IIV did not contain the A/H1N1pdm09 strain[8] and during seasons when the pandemic strain was included in the seasonal formulation.[9] The pooled OR was 0.74 (95% CI: 0.61, 0.88) with the I2-test indicating no heterogeneity (I2 = 0%, p = 0.941), [Fig. 4]. In the sensitivity analysis, including data from these two studies and the two RCTs, the combined OR increased and was nonsignificant (0.82 [95% CI: 0.64, 1.04]) (Fig. 8, Supplementary Material available in the online version only).[1] [6]\n\nEleven studies from Europe, Argentina, United States, and Canada that assessed the impact of maternal vaccination with monovalent A/H1N1pdm09 vaccines alone or in combination with seasonal IIV on PTB were included in our analysis.[15] [20] [23] [24] [25] [26] [27] [28] [29] [30] [31] Four studies reported significant relative effect measures < 1[15] [20] [25] [28] and seven studies found that there was no association between A/H1N1pdm09 vaccination and PTB.[23] [24] [26] [27] [29] [30] [31] In the pooled analysis, women in the influenza vaccine group had a lower likelihood of having PTB than nonvaccinated women with an estimate of 0.92 (95% CI: 0.85, 0.99) and the I2-test showing substantial heterogeneity for this estimate (I2 = 68.7%, p < 0.01), [Fig. 5A].\n\nThe study by Cantu et al reported results from two consecutive influenza seasons (2009/10 and 2010/11); vaccinated women during the 2009/10 (n = 666) comprised 17% who received seasonal IIV, 63% received monovalent A/H1N1pdm09 vaccine alone, and 20% were vaccinated with both vaccines. In the second season, women (n = 428) were exclusively vaccinated with a seasonal vaccine containing the A/H1N1pdm09 strain.[29] In the study by Fell et al, 8.5% of the vaccinated women included in the analysis received both monovalent A/H1N1pdm09 and 2009/10 seasonal IIV.[27] The other studies assumed that the number of women who concomitantly received monovalent and seasonal vaccines during 2009/10 was small, thus was normally not reported. A subanalysis excluding the two articles where women considered to have received monovalent A/H1N1pdm09 vaccine might have also received seasonal IIV showed a similar relationship between vaccination and PTB, [Fig. 5B].\n\nThe sensitivity analysis that included four additional smaller studies and the women vaccinated in the first trimester in Pasternak et al showed a nonsignificant pooled estimate (0.93 [95% CI: 0.85, 1.01]) (Fig. 9, Supplementary Material available in the online version only).[22] [23] [32] [33] [34]\n\nEight studies were included in the analysis of the association between A/H1N1pdm09 vaccination and SGA.[21] [22] [23] [24] [25] [27] [29] [30] Two studies reported significant effect estimates < 1,[27] [30] and 6 studies found no association.[21] [22] [23] [24] [25] [29] There was moderate heterogeneity among the eight studies (I2 = 54.8%, p = 0.03) and the summary estimate of the meta-analysis for SGA comparing vaccinated women with nonvaccinated women was 0.96 (95% CI: 0.90, 1.03), [Fig. 6A]. Restricting the meta-analysis to studies that assumed that vaccinated women only received monovalent A/H1N1pdm09 vaccine the calculated pooled effect was similar, [Fig. 6B].\n\nThe pooled effect of the sensitivity analysis, including three additional estimates was comparable to the primary analysis (Fig. 10, Supplementary Material available in the online version only).[23] [32] [34]\n\nThe meta-analysis of the effects of A/H1N1pdm09 vaccination on LBW included seven studies.[15] [20] [23] [24] [25] [26] Two of these studies reported significant effect measures < 1,[20] [25] and the other five reported nonsignificant effect measures.[15] [20] [23] [24] [26] [31] In the meta-analysis A/H1N1pdm09 monovalent vaccination had a protective effect against LBW with a pooled effect of 0.88 (95% CI: 0.79, 0.98) and substantial heterogeneity among the chosen studies (I2 = 61.6%, p = 0.016), [Fig. 7]. A similar effect was observed in the sensitivity analysis, including three additional estimates (Fig. 11, Supplementary Material available in the online version only).[22] [23] [29]\n\nOverall in the main analyses, there was a reasonable level of symmetry in the funnel plots for PTB, SGA, and LBW outcomes, indicating only a modest level of publication bias (Figs. 12 and 13, Supplementary Material available in the online version only). For the subanalyses, there were not enough studies to have a robust assessment of publication bias.\n\nNotwithstanding important methodological concerns regarding observational studies assessing the impact of maternal influenza vaccination on birth outcomes, which have been discussed extensively in recent reviews,[4] [5] [35] [36] we performed meta-analyses on the effects of maternal vaccination on the rates of PTB, SGA, and LBW births reported in large studies published to date. In the meta-analyses women who received IIV during pregnancy compared with nonvaccinated women had a 13% lower risk of delivering preterm and 26% decreased risk of having an LBW baby; and women who received A/H1N1pdm09 monovalent vaccine had 8 to 10% lower risk of PTB and their babies had a 12% decreased risk of being LBW. No significant impact of vaccination on SGA rates was detected in the main analyses, independent of the vaccine group. Relatively, few studies have examined the relation between seasonal influenza vaccination during pregnancy and birth outcomes, five studies were included in the PTB and SGA meta-analyses and only two reported effects on LBW.[7] [8] [9] [11] [12] The number of reports on pandemic A/H1N1pdm09 vaccines was greater and 11, 8, and 7 studies were evaluated regarding PTB, SGA, and LBW, respectively.[15] [20] [21] [22] [23] [24] [25] [26] [27] [28] [29] [30]\n\nIt is well known that ideally the effectiveness and safety of interventions such as vaccination should be evaluated by RCT to warrant that the only difference between treatment groups is the vaccination status. However, since only two RCTs on maternal influenza vaccination have been published, they were not included in the primary analyses. In sensitivity analyses that included the observational studies and the overall data from the two RCTs the pooled estimates were nonsignificant. Albeit, as noted in a recent publication,[36] the two RCTs were conducted in resource-limited settings, whereas the observational studies were mainly from North America and Europe. These differences in study sites may affect the impact of maternal vaccination on outcomes that are already variable depending on the study population.\n\nThe impact of seasonal influenza vaccination on PTB was significant only when the study by Legge et al that used an IIV formulation containing the A/H1N1pdm09 strain and was undertaken in the immediate years (2010–2012) after the emergence of this strain, was included in the meta-analysis.[9] The meta-analysis evaluating the effect of the monovalent A/H1N1pdm09 on PTB found a protective effect when monovalent vaccine was used either alone or together with seasonal IIV; however, this result must be interpreted with caution because of considerable heterogeneity in the estimates (I2 > 68%). An association between A/H1N1pdm09 influenza illness during pregnancy and PTB has been found especially in studies that defined exposure based on severe maternal influenza illness.[37] [38] Although no studies included in the meta-analyses adjusted for confirmed influenza infection, the pooled results suggest that prevention of A/H1N1pdm09 infection might have a protective effect on PTB. The fact that the A/H1N1pdm09 strain circulating during the years the different studies were conducted was well matched to the vaccine strain might have also contributed to the more robust effect observed in the studies that used A/H1N1pdm09-containing vaccines.\n\nA protective effect of maternal vaccination on LBW was detected in the main analyses, however, only two studies were included in the seasonal IIV meta-analysis, and the inclusion of the RCTs results produced nonsignificant pooled estimates. Nonetheless, the meta-analysis established that women who received monovalent A/H1N1pdm09 had a lower likelihood of delivering an LBW baby when only larger studies were included and when using data from all the available studies.\n\nThe studies included in this review have significant clinical and methodological heterogeneity. Clinical heterogeneity is present due to the different vaccine compositions and definitions used. To minimize this, we stratified the different analyses according to the vaccines evaluated, however, in the A/H1N1pdm09 analyses, for example, reports on adjuvant and nonadjuvant vaccines were both included in the main meta-analyses. The outcome definitions were similar for all the studies, although how gestational age was determined was not always reported and as such, may differ between studies. The observational design of the studies included in the main analyses, and the fact that most were retrospective, leads to the risk of selection bias and residual confounding. Despite the inclusion of the only studies that reported adjusted measures, we cannot rule out that the specific studies were unable to control for unmeasured confounders or eliminate potential selection and information biases that may have influenced the estimates even after adjustments; also most of the studies used vaccination status as a binary variable and did not treat pregnancy and vaccination as time-dependent variables. Only a few studies identified the precise gestational age at which vaccination occurred and applied time-dependent analyses from time of exposure to outcome.[15] [24] [26] [30] [31]\n\nAnother consideration that most of the studies did not address was the timing of pregnancy in relation to exposure to the influenza virus. The direct effect of maternal vaccination on birth outcomes is expected to be observed only in pregnancies in which the vulnerable period for the outcome of interest overlaps with the influenza season.[36] Although not exactly aligning the pregnancy vulnerable period and the timing of influenza circulation, two observational studies, and a RCT compared birth outcomes between vaccinated and nonvaccinated women stratified by delivery date with respect to the influenza season[6] [7] [12]; in the subanalyses of these studies, vaccination was associated with 62 and 51% decreased risk of PTB and SGA, respectively, for births occurring during periods of intense influenza activity. However, the magnitude of these reductions appears very large, considering that the efficacy of maternal vaccination in preventing influenza-confirmed infection is only 50% and that influenza infection is not associated with poor outcome rates to that scale. Furthermore, the control group in the Bangladesh RCT received a pneumococcal vaccine, for which there is limited safety data on pregnant women and which theoretically could have induced poorer birth outcomes itself.\n\nThis meta-analysis provides further evidence for the safety of influenza vaccination during pregnancy in relation to birth outcomes. Maternal vaccination was associated with decreased risk of PTB or LBW, especially during the 2009/10 pandemic season. Nevertheless, any obvious protective effect of vaccination observed during the pandemic does not necessarily translate to the same effect in seasonal epidemics, where lower morbidity is usually detected, different vaccine formulations are used, and poorer matches between the circulating virus and the vaccine are more likely to occur.\n\nThis work was supported in part by the Bill & Melinda Gates Foundation (contract number 26363), the South African Research Chairs Initiative of the Department of Science and Technology and National Research Foundation in Vaccine Preventable Diseases; and the Medical Research Council: Respiratory and Meningeal Pathogens Research Unit. The contents of this report are solely the responsibility of the authors and do not necessarily represent the official views of their institutions or organizations or of the sponsors.\n• 1 Madhi SA, Cutland CL, Kuwanda L. , et al; Maternal Flu Trial (Matflu) Team. Influenza vaccination of pregnant women and protection of their infants. N Engl J Med 2014; 371 (10) 918-931\n• 2 Zaman K, Roy E, Arifeen SE. , et al. Effectiveness of maternal influenza immunization in mothers and infants. N Engl J Med 2008; 359 (15) 1555-1564\n• 7 Adedinsewo DA, Noory L, Bednarczyk RA. , et al. Impact of maternal characteristics on the effect of maternal influenza vaccination on fetal outcomes. Vaccine 2013; 31 (49) 5827-5833\n• 8 Dodds L, Macdonald N, Scott J, Spencer A, Allen VM, McNeil S. The association between influenza vaccine in pregnancy and adverse neonatal outcomes. J Obstet Gynaecol Can 2012; 34 (08) 714-720\n• 9 Legge A, Dodds L, MacDonald NE, Scott J, McNeil S. Rates and determinants of seasonal influenza vaccination in pregnancy and association with neonatal outcomes. CMAJ 2014; 186 (04) E157-E164\n• 10 Munoz FM, Greisinger AJ, Wehmanen OA. , et al. Safety of influenza vaccination during pregnancy. Am J Obstet Gynecol 2005; 192 (04) 1098-1106\n• 11 Nordin JD, Kharbanda EO, Vazquez Benitez G, Lipkind H, Vellozzi C, Destefano F. ; Vaccine Safety Datalink. Maternal influenza vaccine and risks for preterm or small for gestational age birth. J Pediatr 2014; 164 (05) 1051-1057.e2\n• 12 Omer SB, Goodman D, Steinhoff MC. , et al. Maternal influenza immunization and reduced likelihood of prematurity and small for gestational age births: a retrospective cohort study. PLoS Med 2011; 8 (05) e1000441\n• 13 Liu L, Oza S, Hogan D. , et al. Global, regional, and national causes of child mortality in 2000-13, with projections to inform post-2015 priorities: an updated systematic analysis. Lancet 2015; 385 (9966): 430-440\n• 14 Stroup DF, Berlin JA, Morton SC. , et al. Meta-analysis of observational studies in epidemiology: a proposal for reporting. Meta-analysis Of Observational Studies in Epidemiology (MOOSE) group. JAMA 2000; 283 (15) 2008-2012\n• 15 Heikkinen T, Young J, van Beek E. , et al. Safety of MF59-adjuvanted A/H1N1 influenza vaccine in pregnancy: a comparative cohort study. Am J Obstet Gynecol 2012; 207 (03) 177.e1-177.e8\n• 18 United Nations Population Fund (UNFPA). The state of the World's midwifery. A universal pathway. A woman's right to health. Available at: https://www.unfpa.org/sites/default/files/pub-pdf/EN_SoWMy2014_complete.pdf . Accessed Month DD, YYYY\n• 19 Omer SB, Richards JL, Madhi SA. , et al; BMGF Supported Maternal Influenza Immunization Trials Investigators Group. Three randomized trials of maternal influenza immunization in Mali, Nepal, and South Africa: Methods and expectations. Vaccine 2015; 33 (32) 3801-3812\n• 21 Trotta F, Da Cas R, Spila Alegiani S. , et al. Evaluation of safety of A/H1N1 pandemic vaccination during pregnancy: cohort study. BMJ 2014; 348: g3361\n• 22 Richards JL, Hansen C, Bredfeldt C. , et al. Neonatal outcomes after antenatal influenza immunization during the 2009 H1N1 influenza pandemic: impact on preterm birth, birth weight, and small for gestational age birth. Clin Infect Dis 2013; 56 (09) 1216-1222\n• 23 Pasternak B, Svanström H, Mølgaard-Nielsen D. , et al. Risk of adverse fetal outcomes following administration of a pandemic influenza A(H1N1) vaccine during pregnancy. JAMA 2012; 308 (02) 165-174\n• 27 Fell DB, Sprague AE, Liu N. , et al; Better Outcomes Registry & Network (BORN) Ontario. H1N1 influenza vaccination during pregnancy and fetal and neonatal outcomes. Am J Public Health 2012; 102 (06) e33-e40\n• 30 Beau AB, Hurault-Delarue C, Vidal S. , et al. Pandemic A/H1N1 influenza vaccination during pregnancy: a comparative study using the EFEMERIS database. Vaccine 2014; 32 (11) 1254-1258\n• 31 Fabiani M, Bella A, Rota MC. , et al. A/H1N1 pandemic influenza vaccination: A retrospective evaluation of adverse maternal, fetal and neonatal outcomes in a cohort of pregnant women in Italy. Vaccine 2015; 33 (19) 2240-2247\n• 32 Chambers CD, Johnson D, Xu R. , et al; OTIS Collaborative Research Group. Risks and safety of pandemic H1N1 influenza vaccine in pregnancy: birth defects, spontaneous abortion, preterm delivery, and small for gestational age infants. Vaccine 2013; 31 (44) 5026-5032\n• 33 Louik C, Ahrens K, Kerr S. , et al. Risks and safety of pandemic H1N1 influenza vaccine in pregnancy: exposure prevalence, preterm delivery, and specific birth defects. Vaccine 2013; 31 (44) 5033-5040\n• 34 van der Maas N, Dijs-Elsinga J, Kemmeren J, van Lier A, Knol M, de Melker H. Safety of vaccination against influenza A (H1N1) during pregnancy in the Netherlands: results on pregnancy outcomes and infant's health: cross-sectional linkage study. BJOG 2016; 123 (05) 709-717", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/s-0036-1586101.pdf", "javascript:;", "#N10CE3", "#N10CE8", "#N10CF8", "#N11805", "#N11825", "#N118AB", "#N118B0", "#N11930", "#N11989", "#N119CB", "#N119D0", "#N11A83", "#N11B02", "#N11B6D", "#N11B7D", "#N11C67", "#top", "#JR16iccn17-1", "#JR16iccn17-2", "#JR16iccn17-3", "#JR16iccn17-4", "#JR16iccn17-5", "#JR16iccn17-1", "#JR16iccn17-2", "#JR16iccn17-2", "#JR16iccn17-6", "#JR16iccn17-1", "#JR16iccn17-7", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-10", "#JR16iccn17-11", "#JR16iccn17-12", "#JR16iccn17-13", "#JR16iccn17-14", "#top", "#TB16iccn17-1", "#TB16iccn17-2", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-15", "#JR16iccn17-12", "#FN16iccn17-2", "#FN16iccn17-2", "#JR16iccn17-8", "#JR16iccn17-7", "#FN16iccn17-2", "#FN16iccn17-2", "#JR16iccn17-11", "#JR16iccn17-9", "#FN16iccn17-3", "#JR16iccn17-15", "#FN16iccn17-5", "#JR16iccn17-25", "#FN16iccn17-6", "#JR16iccn17-23", "#FN16iccn17-6", "#JR16iccn17-27", "#FN16iccn17-7", "#JR16iccn17-29", "#FN16iccn17-8", "#JR16iccn17-24", "#FN16iccn17-6", "#JR16iccn17-26", "#FN16iccn17-6", "#FN16iccn17-9", "#FN16iccn17-9", "#JR16iccn17-20", "#FN16iccn17-5", "#JR16iccn17-22", "#FN16iccn17-10", "#JR16iccn17-28", "#FN16iccn17-10", "#JR16iccn17-30", "#FN16iccn17-11", "#JR16iccn17-21", "#FN16iccn17-5", "#JR16iccn17-31", "#FN16iccn17-5", "#FN16iccn17-12", "#FN16iccn17-12", "#FN16iccn17-12", "#FN16iccn17-12", "#top", "#OR16iccn17-16", "#OR16iccn17-17", "#OR16iccn17-18", "#JR16iccn17-19", "#top", "#top", "#FI16iccn17-1", "#TB16iccn17-1", "#TB16iccn17-2", "#JR16iccn17-7", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-11", "#JR16iccn17-12", "#JR16iccn17-20", "#JR16iccn17-15", "#JR16iccn17-21", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-26", "#JR16iccn17-27", "#JR16iccn17-28", "#JR16iccn17-29", "#JR16iccn17-30", "#JR16iccn17-31", "#JR16iccn17-32", "#JR16iccn17-33", "#JR16iccn17-34", "#JR16iccn17-1", "#JR16iccn17-6", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-1.jpg", "#JR16iccn17-7", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-11", "#JR16iccn17-12", "#JR16iccn17-9", "#FI16iccn17-2", "#JR16iccn17-9", "#FI16iccn17-2", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-2.jpg", "#JR16iccn17-32", "#JR16iccn17-33", "#JR16iccn17-1", "#JR16iccn17-6", "#JR16iccn17-7", "#JR16iccn17-12", "#JR16iccn17-6", "#top", "#JR16iccn17-7", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-11", "#JR16iccn17-12", "#JR16iccn17-8", "#FI16iccn17-3", "#FI16iccn17-3", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-3.jpg", "#JR16iccn17-7", "#JR16iccn17-12", "#top", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-8", "#JR16iccn17-9", "#FI16iccn17-4", "#JR16iccn17-1", "#JR16iccn17-6", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-4.jpg", "#top", "#top", "#JR16iccn17-15", "#JR16iccn17-20", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-26", "#JR16iccn17-27", "#JR16iccn17-28", "#JR16iccn17-29", "#JR16iccn17-30", "#JR16iccn17-31", "#JR16iccn17-15", "#JR16iccn17-20", "#JR16iccn17-25", "#JR16iccn17-28", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-26", "#JR16iccn17-27", "#JR16iccn17-29", "#JR16iccn17-30", "#JR16iccn17-31", "#FI16iccn17-5", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-5.jpg", "#JR16iccn17-29", "#JR16iccn17-27", "#FI16iccn17-5", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-32", "#JR16iccn17-33", "#JR16iccn17-34", "#top", "#JR16iccn17-21", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-27", "#JR16iccn17-29", "#JR16iccn17-30", "#JR16iccn17-27", "#JR16iccn17-30", "#JR16iccn17-21", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-29", "#FI16iccn17-6", "#FI16iccn17-6", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-6.jpg", "#JR16iccn17-23", "#JR16iccn17-32", "#JR16iccn17-34", "#top", "#JR16iccn17-15", "#JR16iccn17-20", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-26", "#JR16iccn17-20", "#JR16iccn17-25", "#JR16iccn17-15", "#JR16iccn17-20", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-26", "#JR16iccn17-31", "#FI16iccn17-7", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-29", "https://www.thieme-connect.de/media/ajp/201611/10-1055-s-0036-1586101-i16iccn17-7.jpg", "#top", "#top", "#top", "#top", "#JR16iccn17-4", "#JR16iccn17-5", "#JR16iccn17-35", "#JR16iccn17-36", "#JR16iccn17-7", "#JR16iccn17-8", "#JR16iccn17-9", "#JR16iccn17-11", "#JR16iccn17-12", "#JR16iccn17-15", "#JR16iccn17-20", "#JR16iccn17-21", "#JR16iccn17-22", "#JR16iccn17-23", "#JR16iccn17-24", "#JR16iccn17-25", "#JR16iccn17-26", "#JR16iccn17-27", "#JR16iccn17-28", "#JR16iccn17-29", "#JR16iccn17-30", "#JR16iccn17-36", "#JR16iccn17-9", "#JR16iccn17-37", "#JR16iccn17-38", "#JR16iccn17-15", "#JR16iccn17-24", "#JR16iccn17-26", "#JR16iccn17-30", "#JR16iccn17-31", "#JR16iccn17-36", "#JR16iccn17-6", "#JR16iccn17-7", "#JR16iccn17-12", "#top", "#top", "https://www.thieme-connect.de/media/ajp/201611/supmat/10-1055-s-0036-1586101_s16iccn17-1.pdf", "https://www.thieme-connect.de/media/ajp/201611/supmat/10-1055-s-0036-1586101_s16iccn17-2.pdf", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-1", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-2", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-3", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-4", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-5", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-6", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-7", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-8", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-9", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-10", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-11", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-12", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-13", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-14", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-15", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/OR16iccn17-16", "http://www.who.int/pmnch/media/news/2012/201204_borntoosoon-report.pdf", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/OR16iccn17-17", "http://www.unicef.org/publications/files/low_birthweight_from_EY.pdf.", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/OR16iccn17-18", "https://www.unfpa.org/sites/default/files/pub-pdf/EN_SoWMy2014_complete.pdf.", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-19", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-20", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-21", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-22", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-23", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-24", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-25", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-26", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-27", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-28", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-29", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-30", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-31", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-32", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-33", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-34", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-35", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-36", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-37", "/products/ejournals/linkout/10.1055/s-0036-1586101/id/JR16iccn17-38", "mailto:nunesm@rmpru.co.za"], "authors": ["nunesm@rmpru.co.za", "Division of National Health Laboratory Service, Centre for Vaccines and Immunology, National Institute for Communicable Diseases, Johannesburg, South Africa", "Medical Research Council: Respiratory and Meningeal Pathogens Research Unit, University of the Witwatersrand, Johannesburg, South Africa", "Department of Science and Technology/National Research Foundation: Vaccine Preventable Diseases, University of the Witwatersrand, Johannesburg, South Africa", "Anushka R. Aqil", "Marta C. Nunes", "Department of Epidemiology, Emory University Rollins School of Public Health, Atlanta, Georgia", "Emory Vaccine Center, Emory University, Atlanta, Georgia", "Shabir A. Madhi", "Saad B. Omer", "Hubert Department of Global Health, Emory University Rollins School of Public Health, Atlanta, Georgia"], "publish_date": null}