{"result_id": "159040", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1726390?device=desktop&innerWidth=412&offsetWidth=412", "timestamp": "2023-04-25 15:31:59 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0041-1726390?device=desktop&innerWidth=412&offsetWidth=412", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - American Journal of Perinatology / Abstract", "cleaned_text": "COVID-19 vaccines have been developed with unprecedented rapidity, deliver the vaccine antigen in a completely different manner than all previous vaccines in widespread use, and are made available outside of the routine Food and Drug Administration (FDA) approval process. Therefore, it is understandable that there is uncertainty about the safety of their administration during pregnancy and lactation, both among clinicians and those who are pregnant or lactating. In this commentary, we review the limited available data as well as theoretical considerations concerning safety of vaccination during pregnancy and lactation. Finally, we discuss guidance in this situation and our perspective in the context of disease severity and transmission.\n\nThere are several vaccines in development for severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), and three have been approved by the U.S. FDA (at the time of manuscript submission, March 7, 2021) under Emergency Use Authorization (EUA), with additional ones soon to follow. An EUA may be issued to make potentially life-saving medical products available when there is no available approved alternative. Evidence is required that “the product may be effective” and that “its known and potential benefits outweigh the known and potential risks[1].” Specifically to issue an EUA for a COVID-19 vaccine, the FDA requires demonstration that “the vaccine's benefits outweigh its risks based on data from at least one well-designed phase III clinical trial that demonstrates the vaccine's safety and efficacy in a clear and compelling manner,” in addition to careful evaluation of quality and consistency of the manufacturing process.[2]\n\nThe FDA issued EUAs in December 2020 for vaccines manufactured by Pfizer-BioNTech and Moderna[3] [4] and in February 2021 for Jannsen (Johnson & Johnson)[5] ([Fig. 1]). The Pfizer-BioNTech and Moderna products are lipid-nanoparticle mRNA vaccines and the Janssen product is a replication-incompetent adenovirus vector. All three vaccines encode for the SARS-CoV-2 spike protein, which serves to attach the virus to angiotensin converting enzyme 2 (ACE2) receptors as the initial infection event.[6] The lipid nanoparticle facilitates cell entry.[7] The Janssen adenovirus vector directly infects cells. Once inside dendritic cells, the mRNA is released into the cytoplasm, or for the Janssen adenovirus vaccine the viral DNA is pushed into the nucleus and then transcribed into mRNA. The spike protein mRNA code is located between start and stop signals for translation, and there is further code to increase protein translation. The mRNA is transcribed in the host cell, producing the spike protein, which is subsequently presented on the cell surface to B and T cells, resulting in an immune response to the protein, antibody production, and cell-mediated immunity, respectively ([Fig. 1]).\n\nThe Pfizer-BioNTech vaccine is recommended for use in those ≥16 years of age, while the Moderna and Janssen vaccines are recommended for those ≥18 years of age. Both the Moderna and Pfizer-BioNTech vaccines are administered in a two-dose series, with an interval of 21 days for the Pfizer-BioNTech vaccine and 28 days for the Moderna vaccine.[3] [4] Both vaccines have more than 90% efficacy in preventing symptomatic laboratory confirmed COVID-19. The Janssen vaccine is administered in a single dose, and has 66% efficacy in preventing symptomatic laboratory confirmed infection, 93% efficacy vs hospitalization, and 100% efficacy versus death.[5] All three vaccines are generally well tolerated. They may cause mild–moderate local and systemic adverse reactions within the first 1 to 2 days, which generally resolve within a few days. Severe reactions such as anaphylaxis are rare.\n\nNone of these vaccines have been studied in pregnancy, with pregnancy an exclusion criterion for study participation. In addition, women of reproductive age group had to be on some form of “effective' contraception and have negative pregnancy test before administration of each dose. Despite these restrictive eligibility criteria, several pregnancies occurred after study enrolment (or that were not detected during prevaccination screening). In the Pfizer-BioNTech study, 23 pregnancies occurred and 12 in the vaccine group.[8] One spontaneous abortion and one retained products of conception occurred in the placebo group. In the Moderna study, 13 pregnancies were reported and 6 in the vaccine group.[9] One spontaneous and one elective abortion occurred in the placebo group, and one placebo participant was lost to follow-up. Otherwise, pregnancy outcomes are not known. The FDA review of the developmental and perinatal/postnatal reproductive toxicity of the Moderna vaccine concluded that it did “not have any adverse effects on female reproduction, fetal/embryonal development, or postnatal developmental except for skeletal variations which are common and typically resolve postnatally without intervention.[9]” No long-term follow-up on these pregnant women or their children is yet available. In the Janssen study, there were 8 pregnancies, 4 each in the vaccine and placebo groups. There was one spontaneous abortion (vaccine group), 1 incomplete abortion (placebo group), 2 elective abortions (placebo group) and 1 ectopic pregnancy (vaccine group). Outcomes are not known for two ongoing pregnancies. Janssen submitted a developmental and perinatal/postnatal reproductive toxicity study in rabbits receiving two times the human vaccine dose prior to mating and during gestation periods; the FDA review of this study concluded that the vaccine “did not have any adverse effects on female reproduction, fetal/embryonal development, or postnatal development.[9] Certainly, the inclusion of pregnant and lactating women is needed for vaccine trials as described by Maykin.[10]\n\nFor the mRNA vaccines, the mRNA does not enter cell nuclei and has an estimated half-life of 8 to 10 hours.[11] The Janssen adenovirus vaccine is modified so that it can not replicate. Therefore, there will be no viremia during pregnancy, and the vaccine is not expected to infect the fetus.\n\nGiven the short half-life of vaccine mRNA, it is not likely to be transmitted to the fetus during pregnancy or an infant during breastfeeding. If the vaccine mRNA enters breastmilk, it is expected to be broken down during the digestive process and not likely to be absorbed in an intact and functional state. The Janssen adenovirus vaccine is not likely to enter breastmilk as viremia does not occur following administration. The protein expressed from the mRNA likely stays in the body for several days, similar to what is expected to occur with traditional protein-based vaccines. The expressed protein is likely to remain cell-associated and therefore also has low likelihood of transmission to the fetus during pregnancy or infant via breastmilk. The Centers for Diseases Control and Prevention (CDC) in the United States considers protein-based vaccines safe during pregnancy: “no evidence exists of risk to the fetus from vaccinating pregnant women with inactivated virus or bacterial vaccines or toxoids” and lactation: “inactivated, recombinant, subunit, polysaccharide, and conjugate vaccines, as well as toxoids, pose no risk for mothers who are breastfeeding or for their infants.[12]”\n\nDespite the gaps in knowledge regarding the clinical course of the COVID-19 among pregnant and lactating women, preliminary studies suggest a prolonged and nonspecific disease course during pregnancy and 6 weeks of postpartum.[13] Based mostly on epidemiological data, some have hypothesized that physiological changes and a shift away from cell-mediated immunity during pregnancy results in significantly higher risk of morbidity and severe outcomes among pregnant women compared with their nonpregnant counterparts.[14] The risk of intensive care unit admission, invasive mechanical ventilation, and extracorporeal membrane oxygenation are higher among pregnant compared with nonpregnant women with symptomatic COVID-19.[14] The CDC has recommended pregnant and lactating women to follow precautions for infection prevention by avoiding close contact, using standard handwashing techniques and consistent use of masks to cover over the mouth and nose when around others.[15] Given the increased risk of severe illness during pregnancy and possible adverse effects on pregnancy outcome, prevention of COVID-19 during pregnancy is a priority.\n\nThere are several vaccines against SARS-CoV-2 in various phases of clinical trials ([Fig. 1]). These vaccines overall belong to traditional adjuvant enhanced protein antigen vaccines (e.g., Novavax, Glaxo Smith Kline-Sanofi vaccines), DNA vaccines using adenoviral vectors (e.g., Sputnik V, Johnson & Johnson - Janssen and AstraZeneca/Oxford vaccine), and mRNA embedded in lipid nanoparticles (Pfizer BioNTech and Moderna vaccines).\n\nThe mRNA and adenovirus DNA vaccines are not likely to pose a risk to the pregnant person, and they are not likely to affect the fetus. Similar considerations apply during lactation. The CDC has relatively permissive language for use of these vaccines during pregnancy and lactation, for example, “if pregnant people are part of a group that is recommended to receive a COVID-19 vaccine (e.g., health care personnel), they may choose to be vaccinated” and “a lactating person who is part of a group recommended to receive a COVID-19 vaccine (e.g., health care personnel) may choose to be vaccinated.[15]” The American College of Obstetricians and Gynecologists and the Society for Maternal-Fetal Medicine similarly recommend that those who are pregnant or lactating have access to COVID-19 vaccines.[16] [17] At this time, there are no trimester-specific vaccine considerations. The Maternal Immunization Task Force states that all pregnant individuals who choose to receive the COVID-19 vaccine must be allowed to do so.[18] The Academy of Breastfeeding Medicine recommends shared decision-making when discussing immunization during breastfeeding and continued breastfeeding after COVID-19 immunization.[19]\n\nMore than 30,000 pregnant women have been reported to the CDC vaccine safety monitoring program (v-safe) as of February 16, 2021. The v-safe prenancy registry includes >1,800 participants as of February 19, 2021 and includes 275 completed pregnancies and 232 live births. Participants are being tracked for miscarriage and still birth, pregnancy complications, maternal intensive care unit admission, adverse birth outcomes, neonatal death, infant hospitalizations, and birth defects. To date, pregnancy outcomes are comparable to background rates and “no unexpected pregnancy or infant outcomes have been observed related to COVID-19 vaccination during pregnancy.” An infographic comparing obstetric and perinatal morbidity among mRNA COVID-19 vaccine recipients compared to background rates among pregnant mothers that did not receive the vaccine are shown in [Fig. 2].[20]\n\nIn the context of potential increased severity of COVID-19 during pregnancy and significant community transmission, immunization should be prioritized for pregnant women. Available evidence, theoretical considerations, FDA evaluation, CDC and professional medical society guidance all point in the same direction: the real benefits of COVID-19 immunization outweigh the scant theoretical safety concerns in pregnancy and lactation. We strongly recommend consideration of COVID-19 immunization during pregnancy and lactation. Women of childbearing age constitute a significant portion of frontline health care providers as physicians, nurses, respiratory therapists, as well other ancillary staff in clinical settings. A shared decision-making between the mother, her family, and provider is optimal pending further data ([Fig. 3]). The discussion should focus on the risks of infection, risk of morbidity and mortality, and the uncertainty regarding the safety of the vaccine in pregnancy and lactation. The latter should emphasize that we do not have biologic reasons to believe that the vaccine currently approved are harmful to the pregnancy or infant. The difficulty is likely to be what risk of infection a woman would consider significant enough to warrant the uncertainty regarding vaccine safety. As more and more pregnant and lactating women get vaccinated, the uncertainty is likely to decrease.\n\nTo address the uncertainty, we applaud the creation of a COVID-19 vaccine pregnancy exposure registry.[21] Given that the COVID vaccination campaign is unlike any other in the past, eagerly await frequent short- and long-term outcome updates. Research is ongoing regarding immunization during pregnancy and lactation, and we look forward to further safety data.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/s-0041-1726390", "javascript:;", "https://www.thieme-connect.de/media/ajp/202106/lookinside/10-1055-s-0041-1726390_201117-1.jpg", "#OR201117-1", "#OR201117-2", "#JR201117-3", "#OR201117-4", "#JR201117-5", "#FI201117-1", "#JR201117-6", "#JR201117-7", "#FI201117-1", "https://www.thieme-connect.de/media/ajp/202106/10-1055-s-0041-1726390-i201117-1.jpg", "#JR201117-3", "#OR201117-4", "#JR201117-5", "#OR201117-8", "#OR201117-9", "#OR201117-9", "#OR201117-9", "#JR201117-10", "#OR201117-11", "#OR201117-12", "#JR201117-13", "#JR201117-14", "#JR201117-14", "#OR201117-15", "#FI201117-1", "#OR201117-15", "#OR201117-16", "#OR201117-17", "#OR201117-18", "#OR201117-19", "#FI201117-2", "#OR201117-20", "https://www.thieme-connect.de/media/ajp/202106/10-1055-s-0041-1726390-i201117-2.jpg", "#FI201117-3", "https://www.thieme-connect.de/media/ajp/202106/10-1055-s-0041-1726390-i201117-3.jpg", "#OR201117-21"], "authors": ["George Saade", "Department of Obstetrics and Gynecology, UCLA Health, Los Angeles, California", "Aparna Sridhar", "slakshmi@ucdavis.edu", "Department of Obstetrics and Gynecology, University of Texas Medical Branch, Galveston, Texas", "Dean Blumberg", "Satyan Lakshminrusimha", "0000-0001-6098-2155", "Department of Global and Community Health, College of Health and Human Sciences, George Mason University, Fairfax, Virginia", "Rosemary D. Higgins", "Department of Pediatrics, UC Davis Children's Hospital, Sacramento, California"], "publish_date": null}