{"result_id": "159052", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1217-2397", "timestamp": "2023-04-25 15:32:06 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/a-1217-2397", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Drug Research / Volltext", "cleaned_text": "The current outbreak of novel Coronavirus Disease-2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a major pandemic situation and a catastrophe for humans. COVID-19 is a severe infectious disease particularly of the respiratory system characterized by fatal complications such as severe acute respiratory distress syndrome (SARS), pneumonia, cardiac arrhythmia, kidney failure/ multiple organ failure and even death. Since its discovery, the SARS-CoV-2 has spread across 213 countries or territories, causing more than 8.5 million people with a rising death toll over 5.5 million people (as of June 2020, WHO). In fact, the current looming crisis of COVID-19 has become an increasingly serious concern to public health. It has affected lives of millions of people with severe impact on health systems and economies globally. Since there are no specific drugs and/or vaccines available so far, combating COVID-19 remains to be a major challenging task. Therefore, development of potential and effective treatment regimens (prophylactic/therapeutic) is urgently required which could resolve the issue. In this review, we summarize the current knowledge about the coronavirus, disease epidemiology, clinical manifestations and risk factors, replication of the virus, pathophysiology and host immune responses of SARS-CoV-2 infection. The therapeutic interventions and prophylactic measures along with precautionary measures are the frontline approaches that could be undertaken in order to control and prevent the spread of the deadly and highly contagious COVID-19 are also detailed herein.\n\nThe current outbreak of novel Coronavirus Disease-2019 (COVID-19) has seriously impaired the lives of millions of people causing a significant public health crisis around the world. The World Health Organization (WHO) has declared “COVID-19 to be a pandemic with a public health emergency of global concern”. According to the latest estimates by WHO, it has affected more than 8.5 million people across 213 countries or territories with a rising death toll over 5.5 million people (as of June 2020) [1]. The disease was first emerged in the city of Wuhan in Hubei province of China during a pneumonia outbreak in December 2019. It was previously known as 2019 novel coronavirus (2019-nCoV) respiratory disease before the WHO declared the official name of the disease as COVID-19 in February 2020 [2]. However, it is an infectious disease of the respiratory system characterized mainly by severe respiratory distress syndrome, and is caused by a novel coronavirus (nCoV), called SARS-CoV-2 (severe acute respiratory syndrome-coronavirus-2) [3]. A novel coronavirus is a newly evolved strain or a genetic variant of existing coronaviruses (first identified in the mid-1960s) which was not reported earlier. Coronaviruses are positive-stranded RNA viruses that are characterized by a spherical shape with a typical crown-like (the word “coronam” in latin means “crown”) appearance under microscope [4]. They belong to the family of Coronaviridae and are classified into four distinct subfamilies, viz., α-, β-, γ-, and δ-coronavirus. Coronaviruses belonging to α and β subfamilies mainly infect mammals, while γ-, and δ- coronaviruses cause infections in birds. Some of them cause mild infections in the upper and lower respiratory tract, while others can cause serious respiratory infections that may consequently lead to respiratory failure [5]. To date, seven types of coronaviruses have been reported to cause infections in humans. The most common of them are hCoV-OC43 and hCoV-HKU1 (β-coronaviruses) and hCoV-229E and hCoV-NL63 (α-coronaviruses), which can cause common colds, but also severe lower respiratory tract infections [6]. Apart from these, SARS-CoV (severe acute respiratory syndrome coronavirus), MERS-CoV (Middle East respiratory syndrome coronavirus) have been identified earlier to be epidemic, which caused serious infections in humans. The SARS-CoV has been reported to cause approximately 8,000 confirmed cases worldwide and a death rate of ~10% in 2002/2003 with epicenter in Guangdong, China, and the MERS-CoV with 92 500 confirmed cases and a fatality rate of 35–36% in 2012 with epicenter in Saudi Arabia [7] The new coronavirus i. e., 2019-nCoV (SARS-CoV- 2) is the latest addition. It belongs to the β subfamily of coronaviruses, which shares about 79.5% of the genetic sequence of SARS-CoV [8]. It is an enveloped, positive-sense, single-stranded RNA virus that has a lipid envelope studded with club-shaped projections. The SARS-CoV-2 appears to be more wide spread and fatal as compared to SARS-CoV and MERS-CoV. Moreover, it appears to spread more efficiently, more transmissive and cause more fatal respiratory infections as compared to SARS-CoV or MERS-CoV. SARS-CoV-2 affects more elderly individuals than youth and more men than women [9]. The current looming pandemic of COVID-19 caused by SARS-CoV-2 has become an increasing serious concern to public health. It has severe impact on health systems and economies globally. Since there are no effective drugs or vaccines available, the prevention and control of deadly COVID-19 has become a highly challenging task worldwide.\n\nSince coronaviruses are zoonotic, they are transmitted from animals to humans. Several known coronaviruses are found in animals that have not yet been reported to infect humans. Earlier, MERS-CoV and SARS-CoV have been found to infect humans. SARS-CoV was transmitted from civet cats to humans and MERS-CoV from dromedary camels to humans [10]. SARS-CoV-2 has been reported to infect humans for the first time. In humans, it usually spreads from person-to-person through droplet transmission (respiratory droplets that people sneeze, cough or drip), aerosol transmission (when someone coughs or sneezes), contact transmission (touching a contaminated surface then touching one’s mouth, nose or eyes) and direct transmission (kissing, shaking hands etc.) [11].\n\nThough some symptoms of COVID-19 are similar to seasonal flu (or influenza), but it is much more severe and deadly than influenza. Flu appears suddenly and can cause mild to severe illness, which may even lead to death. Flu is different from a common cold. Some distinguished clinical manifestations among common cold, seasonal flu and COVID-19 are depicted in [Table 1]. Like the other coronaviruses, the SARS-CoV-2 primarily causes infections of the respiratory tract. The severity of the disease can range from mild illness to fatal complications. Infection with other pathogenic coronaviruses like MERS-CoV and SARS-CoV can cause acute respiratory distress syndrome (ARDS), which may lead to long-term failure in lung function, cardiac arrhythmia, and ultimately death. However, the most common symptoms of COVID-19 include fever, fatigue, dry cough, cough, diarrhea, conjunctivitis and respiratory symptoms like shortness of breath, breathing difficulties and dyspnea. The symptoms usually appear between 2–14 days or may even longer after exposure to the virus [11] [12]. In some cases, SARS-Cov-2 infection can be fatal and produces disease complications. In more severe cases, infection can cause pneumonia, acute respiratory distress syndrome (ARDS), severe acute respiratory syndrome (SARS), kidney failure/multiple organ failure and even death. The most serious complication is a type of pneumonia attack called 2019 novel coronavirus-infected pneumonia (NCIP). Studies have also reported that COVID-19 patients may experience with irregular heart rate (arrhythmia), cardiovascular shock, and heart damage or heart attack [10] [11] [12].\n\nThe Centre for Disease control and Prevention (CDC) suggests that the elderly (65 years or older), people with co-morbid state/pre-existing medical conditions (such as heart disease, respiratory disease including asthma and COPD or diabetes), and people who are immunocompromised including those receiving cancer treatment have a higher risk of developing the disease fatality. Research also suggests that smokers may be more susceptible to the SARS-CoV-2 infection. People with HIV may also be at higher risk of serious illness by SARS-CoV-2 [10].\n\nTo envisage possible therapeutic/ prophylactic strategies for COVID-19, it is inevitable to comprehensively understand the background of the diseases process with thorough insight into various biological/ biochemical aspects of human host and virus interaction such as the replication of SARS-CoV-2, pathophysiology of the disease, and immune responses of respiratory infections.\n\nThe structure of SARS-CoV-2 is composed of four essential structural proteins. These are namely, spike protein (S protein), envelope (E protein), membrane protein (M protein) and nucleocapsid (N protein). The spike protein (S) is a glycoprotein which helps in binding to ACE2 (angiotensin-converting enzyme 2) receptor and facilitates the entry of virus into the host cell. The crown-like appearance of the virus is due to the presence of spike protein on the outer envelope of the viral structure. The envelope protein (E) interacts with the membrane protein (M) to form the viral envelope. The membrane protein is the central organizing element of coronavirus, which determines the shape of viral envelope. The nucleocapsid (N) is bound to RNA genome of the virus. The SARS-CoV-2 contains positive-sense single-stranded RNA (ssRNA,+sense, 30kb in length) genome [13].\n\nThe SARS-CoV-2 uses a specific receptor binding domain (RBD) of membrane bound receptor called ACE2 (angiotensin-converting enzyme 2) receptor as mentioned above for its entry into the host cell. ACE2 receptor is distributed in several host organs like lungs, heart, kidneys and intestine. The modes of entry are usually nasal cavity, oral cavity and nasopharynx and the mechanism of entry is direct cell entry or endocytosis. During replication cycle, coronaviruse utilizes RNA-dependent RNA synthesis to generate mRNAs which is later transcribed by the host genome. The sRNA (+) strand is used to produce the enzyme, RNA-dependent RNA polymerase (RdRp), which helps replicate the sRNA (+) strand to sRNA (-). The sRNA (-) is used to (1) make subgenomic mRNAs by transcribing from the sRNA (-) strand from multiple start sites and in multiple start sites and in multiple open reading frames (ORFs), and (2) make more sRNA (+) via replication. New viral progeny is finally released via various secretory pathways (rough ER, golgi apparatus, and exocytosis) [13] [14]. The replication process of SARS-CoV-2 is represented in [Fig. 1].\n\nThe clinical attack of COVID-19 can be enumerated into three phases, viz., viral replication, hypersensitivity of immune system, and pulmonary destruction. Following its entry through nasal cavity, SARS-Cov-2 reaches up to lower respiratory tract (airways and lungs) where it enters into the respiratory cells by a process of endocytosis and subsequently causes respiratory infections. The pathophysiology of the respiratory disease can be described as follows. SARS-CoV-2 can invade two types of cells in the lungs: (1) mucus-producing (goblet) cells, which protect lungs from drying out and also protect from pathogens; and (2) ciliated cells, which facilitates the mucus flow towards exterior, clearing debris materials from lungs. When these cells die, they slough off into airways, filling them with debris and fluid, which ultimately results in serious inflammatory reactions, pulmonary obstruction or difficulty in breathing. Some symptoms commonly appear to be fever, cough, breathing difficulties and pneumonia. Moreover, inflammation of lungs causes more permeability of alveoli (tiny air sacs in lungs interface of gaseous exchange) resulting in leakage of fluid into the lumen of lungs which consequently decreases lung’s ability to oxygenate blood. In severe cases, it causes difficulty in breathing or shortness of breath. Furthermore, lung injury may also occur due to the downregulation of hACE2 receptor (host ACE2 receptor naturally protects against acute lung injury) by the S protein of coronavirus. As a result, there is an accumulation of excess angiotensin II which causes excessive stimulation of type1A angiotensin II receptor (AGTR1A) thereby increasing pulmonary vascular permeability. According to the latest report, a novel invasive route for the SARS-CoV-2 is via other receptors that mediate the entry of virus into T cells, such as CD147, present on the surface of T lymohocytes, which was recently reported to be a novel invasive route for SARS-CoV-2 [13] [14] [15]. [Figure 2] describes details of pathophysiological changes, inflammatory reactions, disease complications involved in SARS-CoV-2 infection.\n\nDuring normal functioning of the host immune system, the inflammatory process is highly regulated and is confined to only infected areas. The immune system sometimes over reacts, which results in damage to healthy tissues. In respiratory infections, the affected cells die and slough off into lungs, further clogging of which may ultimately lead to pneumonia. As damage to the lungs progressively increases, it potentially results in respiratory failure and may even death. Permanent lung damage occurs probably due to the over reactive immune responses with the appearance of holes in the lungs (looks like honey-comb like structure) and scars that stiffen the lungs [16].\n\nCurrent studies have investigated several potential responses of the host immune system by the SARS-CoV-2 infection as depicted in [Fig. 3]. During the respiratory infection by SARS-CoV-2, patients primarily develop an uncontrolled immune response, caused by the hyperactivation of macrophages (monokines), monocytes and neutrophils resulting in an increase in interleukin-6 (IL-6) and reactive protein C (PCR) and in a decrease in the total number of lymphocytes. In viral infections, the adaptive immune response is mainly controlled by the virus-specific T cells (cell-mediated immunity) and the B lymphocytes (humoral immunity). The activation of Th1/Th17 by helper T lymphocytes (lymphokines) can contribute to the exacerbation of the inflammatory response, while B lymphocytes produce specific circulating antibodies for neutralizing the infection. Research reveals that high levels of specialized T helper cells (Th), Natural Killer cells (NK) and B cells were found in the blood sample of COVID-19 patients usually 7–9 days after the onset of symptoms. Moreover, lymphocytopenia is a common diagnostic indicator in COVID-19 patients. Studies also indicate that lymphocytopenia might be related to mortality, especially in patients with low levels of CD3+, CD4+, and CD8+ T lymphocytes. On the other hand, the production of immunoglobulin M (IgM) provides the first line of defence during viral infection and the high affinity immunoglobulin G (IgG) provides long-term immunity to the host. The detection of IgM in the serum is an indication of an immediate exposure of patient to the infection, while the appearance of IgG suggests that the exposure is several days old. Study also reveals that the appearance of IgM and IgG progressively increase from day 7 to day 20 in the blood of SARS-CoV-2 infected patients [16] [17].\n\nThe progression of infection to acute respiratory distress syndrome (ARDS) is associated with the upregulation of pro-inflammatory mediators or proteins, called cytokines and chemokines [18] . In severe cases, patients may experience lymphopenia and interstitial pneumonia. Major cytokines include lymphokines, interleukins (IL), monokines, interferons (IFN), tumor necrosis factor (TNF) α and β. Interleukin-1β (IL-1β), IL-2, IL-6, IL-7, IL-8, IL-10, CXC-chemokine ligand 10 (CXCL 10) and CC-chemokine ligand 2 (CCL2) are increasing associated with COVID-19 infections. In addition, G-CSF, IP-10, MCP-1, MIP-1α and TNFα are also found. In patients with SARS-CoV-2 infection, early expression of interferon-α (IFNα, released by infected cells), IFNγ (released by immune cells), CXCL10, CCL2 are found. In SARS-CoV-2 infection, the massive release of cytokines results in so-called cytokine storm which, in turn, can induce acute respiratory distress syndrome (ARDS), respiratory failure, multi-organ failure and ultimately death [19] [20]. The phases of SARS-CoV-2 infections and cytokine storm induced inflammatory reactions associated multi-organ failure are represented in [Figs. 4] and [5].\n\nThe most important way to prevent the spread of infection is to avoid exposure to the virus i. e., to avoid or limit close contact with people who are showing symptoms of COVID-19 or any respiratory infection such as coughing and sneezing or who are sick. If one develops symptoms, he/ she should stay at home to prevent the spread of the disease into the community. The next best thing is to practice good hygiene to prevent viruses from spreading [2] [10]. Some standard recommendations to prevent the spread of infection include:\n• Wearing a facemask may help prevent the spread of the disease to others\n• Clean and disinfect surfaces (alcohol or bleach based) cleaning solutions work best for coronaviruses) facemasks will not protect you from COVID-19, but will help prevent the spread of the disease to others\n\nTill date, there are no FDA approved treatments currently available for the COVID-19. Since no antiviral drugs or vaccines are available, some conventional existing drugs are recommended for the management of COVID-19 patients. Most of these drugs are from the past experience of the management of SERS‑CoV and MERS‑CoV infections. Drugs are used primarily used for the prophylaxis and/or symptomatic treatment of COVID-19, without cure [21]. At present, repurposing the available therapeutics based on symptomatic conditions is the primary approach for the management of COVOD-19. Considering ARDS and pneumonia attack, followed by secondary infections of SARS-CoV-2 infections, antibacterial antibiotics, antiviral therapy, systemic corticosteroids, and anti-inflammatory drugs (including anti-arthritis drugs) are often used in the treatment regimens. Some current therapeutic interventions include antiviral or anti-retroviral medications, breathing support, such as mechanical ventilation, steroids to reduce lung swelling/inflammatory reactions in pneumonia attack, blood plasma transfusions (covalescent plasma therapy) etc. [22] [23]. The use of antiviral/anti-retroviral drugs is based upon the approach of molecular targeting (such as RNA synthesis inhibitors, neuraminidase inhibitors etc.) in SARS-CoV-2 infection. Additionally, traditional remedies and herbal medicines have also been recommended for the treatment of COVID-19 in many countries of the world [24]. There are many approved marketed and investigational drugs are under development. Clinical trials of several vaccine candidates are also underway. However, it is suggested for seeking immediate medical attention for the recommended treatment for any symptoms or complications that develop during the course of infection.\n\nSeveral host-directed drug therapies are currently under investigation for the treatment of COVID-19. Host-directed therapies include improvement of the status of the host, improvement of host immune response, or handling of host‑dependant factors associated with viral replication process. Most of the investigational therapies are being developed based on the drug-repurposing or repositioning approach. Some clinically useful and investigational antiviral as well as supportive therapies currently being employed for the management of COVID-19 are summarized as follows.\n\nThe antiviral activities of chloroquine (CQ) and hydroxychloroquine (HCQ) have been investigated against SARS-CoV-2 infection. They are often used clinically used in the treatment of systemic lupus erythematosus (SLE), rheumatoid arthritis (RA), and malaria. Studies suggest that CQ might be effective in preventing coronavirus induced pneumonia in COVID-19. CQ can inhibit the entry of SARS-CoV- 2 and prevent viral cell fusion by interfering with glycosylation of ACE2 receptor and its binding with spike protein. It suggests that chloroquine might be more effective (as prophylactic medication) in the early stage of infection, before SARS-CoV-2 reduces ACE2 expression and activity. As per recent reports from NIH (National Institutes of Health, US), the clinical trial of a combination of HCQ/azithromycin for the treatment of COVID-19 patients has already been started. In this combination, both the drugs are FDA approved, where HCQ is an antimalarial/ anti-inflammatory drug and azithromycin is an antibacterial antibiotic. However, hydroxychloroquine possesses anti-inflammatory activity in healthy individuals, and in patients with SLE and RA. Clinical evidence also suggests that CQ and HCQ can reduce cytokine storm in COVID-19 patients [2] [25].\n\nAn anti-retroviral drug, favipiravir (branded as Avigan) intended for the treatment of influenza is currently under phase-2/phase-3 clinical trials on COVID-19 patients in many countries of the world (China, Japan, US, India). Glenmark has initiated phase-3 trial on favipiravir for the treatment of COVID-19 patients in India. The clinical trial on favipiravir is also being conducted by CSIR (Council of Scientific & Industrial Research) laboratories in India. Favipiravir was originally developed by Fujifilm Toyama Chemical in 2014 in Japan for the treatment of particularly avian influenza or novel influenza resistant to neuraminidase inhibitors. It is a well-known drug used in the treatment of infectious diseases caused by RNA viruses such as influenza, Ebola, and coronavirus.The antiviral activity is brought about by selectively targeting the RNA-dependent RNA polymerase (RdRp), which interrupts the nucleotide incorporation process during viral RNA replication. Recent pre-clinical and clinical studies have investigated the positive efficacy of this repurposed drug against SARS-CoV-2 infection [2] [25] [26].\n\nAn investigational anti-retroviral drug called remdesivir is also under clinical trial for treating COVOD-19 patients in several countries like China, US, UK and India. Regulatory bodies of US and other countries like India have allowed the emergency use of this investigational drug in the treatment of COVID-19. In India, clinical trial on remdesivir is currently underway by CSIR (Council of Scientific & Industrial Research) laboratories. Remdesivir was originally developed by Gilead Sciences Inc. as an RNA polymerase inhibitor for the treatment of Ebola virus infection, but it was failed in clinical trial. Remdesivir is a potential drug for treatment of COVID-19. Remdesivir is a prodrug which is metabolized into its active form, GS-441524, that obscures viral RNA polymerase and evades proofreading by viral exonuclease, causing a decrease in viral RNA synthesis. The antiviral mechanism of remdesivir is a delayed chain cessation of nascent viral RNA [2] [25] [27].\n\nA fixed dose drug combination called lopinavir/ritonavir earlier approved to treat HIV/AIDS under the brand name Kaletra is currently being studied to treat COVID-19 patients in several countries. Lopinavir is a protease inhibitor with high specificity for HIV- 1 protease. Due to the poor oral bioavailability and more biotransformation of lopinavir, it is co-formulated with ritonavir to enhance its exposure to virus. Ritonavir is a potent inhibitor of the metabolizing enzymes in vivo that are responsible for the extensive degradation of lopinavir. The co-administration of ritonavir boosts the activity of lopinavir by enhancing its exposure to virus and improves the antiviral activity [25] [28].\n\nAn anti-flu drug, oseltamivir (Tamiflu), which was approved (neuraminidase inhibitor) for the treatment of influenza A and B, has been investigated to cure infection caused by SARS-CoV-2 in Thailand. Oseltamivir has also been investigated in clinical trials in several combinations, such as with chloroquine and favipiravir [2] [25].\n\nThe antiviral, ribavirin, a nucleoside analogue, is also under clinical trial for the treatment of COVID-19 patients. Umifenovir (an antiviral drug marketed in Russia (Arbidol) and China for the treatment of influenza) is also being studied in China and other countries as a treatment of infection caused by SARS-CoV-2. The target of action is spike glycoprotein (S protein) of SARS-CoV-2. It thus inhibits viral host cell adhesion [2] [25].\n\nAs secondary infections and inflammatory reactions including cytokine storm are some important clinical and pathophysiologic features of the SARS-CoV-2 infection, the inhibition of secondary infections and/or pro‑inflammatory cytokines might be key target to fight against COVID-19 infection. Elevated serum concentration of IL-6 is often associated with pathological features of COVID-19 [29]. Apart from immune modulators, metformin, atorvastatin, fibrates, as well as nutritional supplements like vitamin D may also be beneficial in acute respiratory distress syndrome (ARDS) by boosting immunity. Research suggests that zinc may have antiviral activity, since it inhibits RNA polymerase and thereby inhibition of viral replication occurs [23]. Along with antiviral drugs, specific adjunctive therapies are recommended to be used as supportive care for COVID-19 patients. The adjunctive therapies including antibiotics (e. g., azithromycin), ascorbic acid (vitamin C), anti-inflammatory drugs (e. g., corticosteroids), monoclonal antibodies, immunosuppressants, immunoglobulins and some other therapies as described below. Several of these therapies (i. e., tocilizumab and other interleukin-directed therapies or monoclonal antibodies) are administered to prevent cytokine storm often observed in severe attack of COVID-19 [29] [30] [31].\n\nAzithromycin is used in combination with HCQ for the treatment of SARS-CoV-2 infections. Trials are underway for testing the clinical efficacy of azithromycin in conjunction with HCQ as mentioned in the earlier section. It is an inhibitor of protein synthesis used in different types of bacterial infections such as respiratory infections. It has also been found effective in vitro against Zika and Ebola viruses and in patients with severe respiratory tract infections suffering from viral infection [25] [32].\n\nVitamin C (ascorbic acid) is under clinical trial in patients with severe COVID-19-associated pneumonia. Vitamin C is an essential nutritional element that can neutralize free radicals due to its potent antioxidant effect. Because of this property, it can enhance the host immunity. Moreover, vitamin C also possesses antiviral efficacy, especially against influenza viruses. Studies proved the inhibition of reactive oxygen species (ROS) production in oxidative stress and remodulation of the cytokine network typical of systemic inflammatory syndrome by ascorbic acid. Many studies also showed that vitamin C positively affects the development and maturation of T lymphocytes and NK (natural killer) cells involved in the immune response to viral infections [25].\n\nSteroidal anti-inflammatory drugs or corticosteroids such as methylprednisolone and dexamethasone have also been found to be effective in COVID-19 patients in some countries like China and UK, respectively. As potent anti-inflammatory and anti-fibrotic drugs, they have the potential to prevent an extended cytokine response and may also accelerate resolution of pulmonary and systemic inflammation in pneumonia. Studies have shown that corticosteroids, especially methylprednisolone, might improve dysregulated immune response caused by sepsis (possible complication of infection with COVID-19 [2] [25].\n\nBaricitinib [a Janus kinase (JAK) inhibitor marketed under the brand name Olumiant for the treatment of rheumatoid arthritis] and Bemcentinib (an AXL receptor tyrosine kinase inhibitor earlier found effective against Ebola and Zika viruses in preclinical studies) are currently under phase 3 and phase 2 clinical investigations. Leronlimab, a CCR5 (CC chemokine receptor 5) antagonist has also shown promising result in preventing cytokine storm in a study conducted among a small population of COVID019 patients in the US. Sirolimus (also known as rapamycin), is an immunosuppressant that is used to prevent organ transplant rejection and to treat lymphangioleiomyomatosis (LAM) by inhibiting mammalian target of rapamycin (mTOR) kinase. It was originally isolated from the bacterium Streptomyces hygroscopicus found on Easter Island (Rapa Nui) and is commercially available as Rapamune (Pfizer). It is also currently under investigation for the treatment of COVID-19 [2] [25] [33].\n\nOne more drug called bevacizumab (a VEGF inhibitor marketed under the brand name Avastin for certain types of cancer) being studied as a treatment for acute lung injury (ALI) and acute respiratory distress syndrome (ARDS) in critical patients with pneumonia attack in COVID-19 in China. Investigational drugs called EIDD-2801 and STC3141 have been to commence clinical trial for the treatment of acute respiratory distress syndrome (ARDS) in COVID-19 patients [2].\n\nStudies have investigated that frequently observed comorbidities, including hypertension and diabetes in COVID-19 patients, are under treatment with ACE inhibitors or angiotensin receptor blockers (ARBs). The administration of ACE inhibitors or ARBs can result in overexpression of ACE2. ACE2 receptors play a key role in the pathogenesis of COVID-19. In hypertensive patients, chronic treatment with angiotensin II type 1 receptor (AT1R) antagonists such as losartan, lisinopril, or olmesartan facilitates cardiac and renal ACE2 overexpression according to some in vivo studies [25] [31]. Therefore, researches on developing ACE2 inhibitors as anti-COVID-19 agents are ongoing irrespective of the limitation as describe as above.\n\nThiazolidinedione and its derivatives used for the treatment of type 2 diabetes mellitus possess antiviral efficacy against respiratory infections induced by respiratory syncytial virus (RSV) or H1N1 influenza infection. The clinical trial for thiazolidinedione for COVID-19 is in pipeline [2] [25].\n\nColchicine, an well-known anti-inflammatory drug used in the treatment of gout and pericarditis, is currently under clinical trial for treating COVID-19 patients. This drug has been proved to be effective in preventing massive cytokine storm induced pneumonia caused by SARS-CoV-2 (severe acute respiratory syndrome coronavirus-2 [2] [31]. In India, clinical trial on colchicine is currently underway by CSIR (Council of Scientific & Industrial Research) laboratories.\n\nThe clinical trial of an anti-parasitic drug (anthelmintic) called ivermectin (used traditionally as an approved treatment in worm infestations) for the treatment of COVID-19 is being undertaken in several parts of the world after a successful in vitro effectiveness against SARS-CoV-2 infection at Monash University in Melbourne, Australia. Ivermectin was first discovered as anti-HIV molecule. It was further studied to exhibit broad spectrum antiviral activities against viruses, including dengue virus, flavivirus, and influenza. Ivermectin was found to inhibit to inhibit interaction between integrase (IN) molecule of human immunodeficiency virus (HIV)-1 and its nuclear transport receptor importin α/β. Recently, inhibition of IMPα/β1-mediated nuclear import of viral proteins has been reported as the possible mechanism of its antiviral activity. Another anthelmintic drug called niclosemide has also been investigated in vitro to be effective against SARS-CoV-2 infection [2] [25] [33] [34] [35].\n\nNitazoxanide and its metabolite tizoxanide might be potential against COVID-19 based on the past results of inhibitory effects against MERS-CoV. Nitazoxanide has the ability to suppress pro-inflammatory cytokines and IL-6 in vivo [25].\n\nNon-steroidal anti-inflammatory drugs (NSAIDs) such as ibuprofen, indomethacin and aspirin are also being investigated in SARS-Cov-2 infections. These potential cyclooxygenase (COX) inhibitors may exhibit antiviral activity against SARS-CoV. NSAIDs are activators of ACE2 receptors, same as ACE inhibitors or ARBs. Because of this reason, their usage can lead to increased risk of COVID-19 fatality [37]. Traditionally, aspirin has antithrombotic, anti-inflammatory, analgesic, and anti-pyretic effects. In respiratory infections, aspirin has the effects of inhibiting virus replication, anti-platelet aggregation (anticoagulant action), anti-inflammatory and anti-lung injury. It has been reported that aspirin can reduce the incidence of severe and critical patients and also the incidence of cardiovascular complications including heart injury and cardiac dysfunctions. The occurrence of progressive inflammatory storm and coagulation dysfunction in severe and fatal cases of novel coronavirus pneumonia (NCP) has been reported in COVID-19 patients. However, the clinical use of aspirin in in the treatment and prevention of NCP has yet not received considerable attention [38] [39] [40] [41] [42] [43] [44].\n\nIn the absence of specific antiviral drugs, other therapeutic or prophylactic measures as depicted below could be adopted for the management of SARS-CoV-2 infections.\n\nConvalescent plasma treatment involves injecting the infected patient with convalescent sera of people who recovered from the infection recently. The serum of COVID-19 cured individuals will have virus-neutralising antibodies which will act as a passive antibody therapy. It is called convalescent plasma therapy. Several countries, including India, have recommended the use of plasma therapy as a potential treatment for Covid-19 patients [2] [25].\n\nBiological Monoclonal antibodies that are under development may provide an alternative avenue for the prevention of COVID-19. Passive infusion of monoclonal antibodies as pre-exposure or post-exposure prophylactic measure offers immediate protection against infection. The immunity achieved by monoclonal antibodies could last weeks or months. The clinical trials of toclizumab (also known as atlizumab branded as Actemra) and sarilumab (branded as Kefraza), potent IL-6 receptor antagonists used for the treatment of inflammatory illness such as RA are also underway for the treatment of acute respiratory distress syndrome (ARDS) in COVID-19 patients. Tocilizumab and Sarilumab are humanized monoclonal antibodies (mAb) developed by Roche and Chugai Pharmaceutical and Regeneron Pharmaceuticals and Sanofi, respectively for treating RA patients. Tocilizumab can also be used to treat systemic juvenile idiopathic arthritis. Tocilizumab is a novel monoclonal antibody that competitively inhibits the binding of interleukin-6 (IL-6) to its receptor (IL-6R). Inhibiting the entire receptor complex prevents IL-6 signal transduction to inflammatory mediators that direct B and T cells [39] [40].\n\nA novel phase 1 vaccine called mRNA-1273 (Moderna Inc.) is underway which has the potential to provide immunological protection against COVID-19. The developing strategy of mRNA vaccine involves the use of spike protein of SARS-CoV-2 as antigen. A vaccine found effective against avian coronavirus Infectious Bronchitis Virus (IBV) may also work as a vaccine against COVID-19 in humans as reported by Researchers in Israel. Pfizer Inc., New York and BioNTech SE, Germany are co-developing a potential mRNA-based coronavirus vaccine called BNT-162 for the successful prevention of COVID-19 infection. PiCoVacc, an inactivated novel coronavirus vaccine is currently under clinical trials [2] [10] [25]. The Covid-19 vaccine developed by the University of Queensland (UQ) in Australia has been found effective in preclinical testing stage. The University of Oxford in collaboration with AstraZeneca has started a Phase-III clinical trial. It is a chimp-adeno based viral vector vaccine (ChAdOx1-S). Serum Institute of India Pvt. Ltd (SIIPL), Pune is collaborating with Oxford University for manufacturing the ChAdOx1-S. Bharat Biotech, India has proposed the development of CORAVAX (inactivated rabies vector platform) and CoroFlu (influenza virus vector platform for combating COVID-19. Several Phase-III clinical trials of VPM1002 (recombinant BCG vaccine) are undergoing in India, Germany, Canada and Australia. Zydus is working on a plasmid DNA-based vaccine approach effective against COVID-19. AstraZeneca, Sanofi, Johnson & Johnson, Pfizer, Panacea Biotech, and GlaxoSmithKline are all at various stages of development of their vaccine candidates [45] [46].\n\nSince there are no specific drugs and/or vaccines available so far, combating COVID-19 remains to be a major challenging task around the world. Therefore, developing potential and effective treatment regimens (prophylactic/therapeutic) is an urgent requirement to resolve this issue. Researches are ongoing worldwide in many multinational pharmaceutical companies and research organizations in order to develop successful drug candidates or vaccines that can be effectively used to treat or prevent SARS-CoV-2 infections. Repurposing of FDA approved drugs with therapeutic targeting against SARS-CoV-2 remains to be a quite reliable approach for drug discovery against COVID-19. Development of effective vaccines is an indispensable strategy to combat the current pandemic situation. However, due to the unavailability of definitive and specific therapeutic/prophylactic regimens (antiviral or vaccines), strategies that could be potentially adopted to combat COVID-19 includes early diagnosis, timely reporting, isolation of patients, and supportive treatments. Additionally, current social practices including timely release of epidemic information, maintenance of social orders or government advisories and personal practices such as wearing facial coverings or masks, maintaining personal hygiene, adapting healthy life style and boosting immunity through diet, herbal remedies and regular physical exercises etc. are some frontline approaches that could be undertaken to control and prevent the spread of the deadly and highly contagious COVID-19.\n• 6 Chatterjee P, Nagi N, Agarwal A. et al. The 2019 novel coronavirus disease (COVID-19) pandemic: A review of the current evidence. Indian J Med Res 2020; 151: 147-159\n• 11 Tang X, Wu C, Li X. et al. On the origin and continuing evolution of SARS-CoV-2. Natl Sci Rev 2020; DOI: 10.1093/nsr/nwaa036.\n• 19 Iwasaki A, Yang Y. The potential danger of suboptimal antibody responses in COVID-19. Nat Rev Immunol 2020; 20: 339-341\n• 20 Zhong J, Tang J, Ye C. et al. The immunology of COVID-19: Is immune modulation an option for treatment?. Lancet Rheumatol 2020; 913: 1-9\n• 23 Sarma P, Prajapat M, Avti P. et al. Therapeutic options for the treatment of 2019-novel coronavirus : An evidence-based approach. Indian J Pharmacol 2020; 52: 1-5\n• 24 Guo Y, Cao Q, Hong Z. et al. The origin, transmission and clinical therapies on coronavirus disease 2019 (COVID-19) outbreak- an update on the status. Military Med Res 2020; 7: 11\n• 26 Ford N, Vitoria M, Rangaraj A. et al. Systematic review of the efficacy and safety of antiretroviral drugs against SARS, MERS or COVID-19: Initial assessment. J Int AIDS Soc 2020; 23: e25489\n• 28 Cherian SS, Agrawal M, Basu A. et al. Perspectives for repurposing drugs for the coronavirus disease 2019. Indian J Med Res 2020; 151: 160-171\n• 34 Caly L, Druce JD, Catton MG. et al. The FDA-approved drug ivermectin inhibits the replication of SARS-CoV-2 in vitro. Antiviral Res 2020; 178: 104787\n• 39 Barros RO, Junior FLCC, Pereira WS. et al. Interaction of drug candidates with various SARS-CoV-2 receptors: An in silico study to combat COVID-19. Chem Rxiv 2020; 1-15\n• 41 Narkhede RR, Cheke RS, Ambhore JP. et al. The Molecular Docking Study of Potential Drug Candidates Showing Anti-COVID-19 Activity by Exploring of Therapeutic Targets of SARS-CoV-2. EJMO Eurasian. J Med Oncol 2020; 4: 185-195\n• 42 Peele KA, Potla C, Srihansa T. et al. Molecular docking and dynamic simulations for antiviral compounds against SARS-CoV-2 : A computational study. Inform Med Unlocked 2020; 19: 100345; DOI: 10.1016/j.imu.2020.100345.\n• 44 Zhang L, Lin D, Sun X. et al. Crystal structure of SARS-CoV-2 main protease provides a basis for design of improved α-ketoamide inhibitors. Science 2020; 368: 409-412\n• 45 Dhama K, Khan S, Tiwari R. et al. COVID-19, an emerging coronavirus infection: Advances and prospects in designing and developing vaccines, immunotherapeutics and therapeutics. Hum Vacc Immunother 2020; DOI: 10.1080/21645515.2020.1735227.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/a-1217-2397.pdf", "javascript:;", "#N10A11", "#N10A35", "#N10A62", "#N10C50", "#N10C58", "#N10C84", "#N10CAD", "#N10D19", "#N10D5F", "#N10D77", "#N10D80", "#N10DDC", "#N10EAA", "#N10EB3", "#N10EC4", "#N10EDB", "#N10EF9", "#N10F07", "#top", "#R2020-06-2059-0001", "#R2020-06-2059-0002", "#R2020-06-2059-0003", "#R2020-06-2059-0004", "#R2020-06-2059-0005", "#R2020-06-2059-0006", "#R2020-06-2059-0007", "#R2020-06-2059-0008", "#R2020-06-2059-0009", "#top", "#R2020-06-2059-0010", "#R2020-06-2059-0011", "#TB2020-06-2059-0001", "#R2020-06-2059-0011", "#R2020-06-2059-0012", "#R2020-06-2059-0010", "#R2020-06-2059-0011", "#R2020-06-2059-0012", "#R2020-06-2059-0010", "#R2020-06-2059-0011", "#R2020-06-2059-0010", "#top", "#R2020-06-2059-0013", "#R2020-06-2059-0013", "#R2020-06-2059-0014", "#FI2020-06-2059-0001", "https://www.thieme-connect.de/media/drugres/202009/10-1055-a-1217-2397-i2020-06-2059-0001.jpg", "#top", "#R2020-06-2059-0013", "#R2020-06-2059-0014", "#R2020-06-2059-0015", "#FI2020-06-2059-0002", "https://www.thieme-connect.de/media/drugres/202009/10-1055-a-1217-2397-i2020-06-2059-0002.jpg", "#top", "#R2020-06-2059-0016", "#FI2020-06-2059-0003", "#R2020-06-2059-0016", "#R2020-06-2059-0017", "https://www.thieme-connect.de/media/drugres/202009/10-1055-a-1217-2397-i2020-06-2059-0003.jpg", "#R2020-06-2059-0018", "#R2020-06-2059-0019", "#R2020-06-2059-0020", "#FI2020-06-2059-0004", "#FI2020-06-2059-0005", "https://www.thieme-connect.de/media/drugres/202009/10-1055-a-1217-2397-i2020-06-2059-0004.jpg", "https://www.thieme-connect.de/media/drugres/202009/10-1055-a-1217-2397-i2020-06-2059-0005.jpg", "#top", "#R2020-06-2059-0002", "#R2020-06-2059-0010", "#top", "#top", "#R2020-06-2059-0021", "#R2020-06-2059-0022", "#R2020-06-2059-0023", "#R2020-06-2059-0024", "#top", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0026", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0027", "#R2020-06-2059-0025", "#R2020-06-2059-0028", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#top", "#R2020-06-2059-0029", "#R2020-06-2059-0023", "#R2020-06-2059-0029", "#R2020-06-2059-0030", "#R2020-06-2059-0031", "#R2020-06-2059-0025", "#R2020-06-2059-0032", "#R2020-06-2059-0025", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0033", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0031", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0002", "#R2020-06-2059-0031", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#R2020-06-2059-0033", "#R2020-06-2059-0034", "#R2020-06-2059-0035", "#R2020-06-2059-0025", "#R2020-06-2059-0036", "#R2020-06-2059-0037", "#R2020-06-2059-0038", "#R2020-06-2059-0039", "#R2020-06-2059-0040", "#R2020-06-2059-0041", "#R2020-06-2059-0042", "#R2020-06-2059-0043", "#R2020-06-2059-0044", "#top", "#top", "#R2020-06-2059-0002", "#R2020-06-2059-0025", "#top", "#R2020-06-2059-0039", "#R2020-06-2059-0040", "#top", "#R2020-06-2059-0002", "#R2020-06-2059-0010", "#R2020-06-2059-0025", "#R2020-06-2059-0045", "#R2020-06-2059-0046", "#top", "#top", "#top", "#top", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0003", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0004", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0005", "https://doi.org/10.1016/j.ijantimicag.2020.105948", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0006", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0007", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0008", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0009", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0011", "https://doi.org/10.1093/nsr/nwaa036", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0012", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0013", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0014", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0015", "https://doi.org/10.1111/joim.13091", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0016", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0017", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0018", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0019", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0020", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0021", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0022", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0023", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0024", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0025", "https://doi.org/10.1007/s40495-020-00216", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0026", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0027", "https://doi.org/10.1159/000507423", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0028", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0029", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0030", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0031", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0032", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0033", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0034", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0035", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0036", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0037", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0039", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0040", "https://doi.org/10.26434/chemrxiv.11860011.v2", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0041", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0042", "https://doi.org/10.1016/j.imu.2020.100345", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0043", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0044", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0045", "https://doi.org/10.1080/21645515.2020.1735227", "/products/ejournals/linkout/10.1055/a-1217-2397/id/R2020-06-2059-0046", "mailto:rsmrpal@gmail.com"], "authors": ["Sandip Institute of Pharmaceutical Sciences, Sandip Foundation, Nashik,\n                    Maharashtra, India", "Shubham J. Khairnar", "Anil G. Jadhav", "rsmrpal@gmail.com", "Mithun Rudrapal", "0000-0002-8172-6633", "Laxmikant B. Borse"], "publish_date": null}