{"result_id": "159055", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0040-1715455", "timestamp": "2023-04-25 15:32:08 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "de", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0040-1715455", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Seminars in Thrombosis and Hemostasis / Abstract", "cleaned_text": "Coronavirus disease in 2019 (COVID-19), as caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), has been associated with significant morbidity and mortality worldwide. Although SARS-CoV-2 primarily targets the respiratory system, it can cause various hematological and hemostatic derangements, most notably coagulopathies in severe cases.[1] [4] Thrombocytopenia and elevations in fibrinogen and D-dimer have been reported to be prognostic indicators of COVID-19 severity and/or mortality.[2] [4] Changes in hemostatic parameters correlate with parallel rises in inflammatory markers such as cytokines and C-reactive protein (CRP).[4] Key mechanisms for SARS-CoV-2–induced coagulopathy include severe lung injury, alterations in the renin–angiotensin–aldosterone system (RAAS), and overactivation of the immune inflammatory pathways.[3] [4]\n\nOf relevance to the current commentary, certain demographic and clinical factors, such as older age and preexisting comorbid conditions, can increase the risk of more severe infections.[5] [6] The number of COVID-19 cases is similar among males and females, as evidenced by data from over 700,000 confirmed COVID-19 cases collected by the World Health Organization (WHO).[7] However, a recent meta-analysis suggests that men are more likely to experience severe disease and mortality compared with women.[8] Yet, it is unclear whether the disparities in COVID-19 clinical outcomes are due to underlying sex-based biologic differences or gender-based behavioral differences. Exploration of the sex- and gender-based differences in SARS CoV-2 infection is vital, as these may carry potential implications for disease progression, outcome severity, vaccine response, therapeutic intervention and effectiveness, recruitment of males and/or females to clinical research studies, as well as identification of novel therapies for use in both sexes. In this report, we highlight those differences based on available evidence, attempt to explore and discuss possible underlying reasons, and provide our views for future research.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:;", "https://www.thieme-connect.de/media/sth/202104/lookinside/10-1055-s-0040-1715455_02815-1.jpg", "#JR02815-1", "#JR02815-4", "#JR02815-2", "#JR02815-4", "#JR02815-4", "#JR02815-3", "#JR02815-4", "#JR02815-5", "#JR02815-6", "#OR02815-7", "#JR02815-8"], "authors": ["School of Baccalaureate Nursing, St. Lawrence College, Kingston, Ontario, Canada", "Maha Othman", "Ariunzaya Amgalan", "Ann Kinga Malinowski", "Department of Biomedical and Molecular Sciences, School of Medicine, Queen's University, Kingston, Ontario, Canada", "Georgetown University School of Medicine, Washington, District of Columbia", "othman@queensu.ca", "Division of Maternal Fetal Medicine, Department of Obstetrics and Gynecology, Lunenfeld-Tanenbaum Research Institute, Mount Sinai Hospital, University of Toronto, Toronto, Ontario, Canada"], "publish_date": null}