{"result_id": "159027", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1469-7481", "timestamp": "2023-04-25 15:31:53 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/a-1469-7481", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "The COVID-19 pandemic is an ongoing global healthcare crisis. Based on reports of atypically located thromboses following vaccination with the AstraZeneca COVID-19 vaccine, the Society of Thrombosis and Haemostasis Research (GTH) has issued guidance statements on the recognition, diagnosis, and treatment of this rare complication. It shares pathophysiological features with heparin-induced thrombocytopenia (HIT) and is referred to as vaccine-induced prothrombotic immune thrombocytopenia (VIPIT).\n\nDie COVID-19 Pandemie stellt eine andauernde globale Gesundheitskrise dar. Basierend auf den Berichten über atypisch lokalisierte Thrombosen nach Impfung mit dem AstraZeneca COVID-19 Vakzin hat die Gesellschaft für Thrombose- und Hämostaseforschung (GTH) Handlungsempfehlungen zur Erkennung, Diagnostik und Therapie dieser seltenen Komplikation formuliert. Ihre Pathophysiologie ähnelt derjenigen der Heparin-induzierten Thrombozytopenie (HIT) und wird als Vakzin-induzierte prothrombotische Immunthrombozytopenie (VIPIT) bezeichnet.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/10.1055-s-00034925/202103/lookinside/10-1055-a-1469-7481_210022-1.jpg", "https://doi.org//10.1055/s-0041-1729135"], "authors": ["Cihan Ay", "Manuela Albisetti", "Wolfgang Korte", "Andreas Greinacher", "Vivantes Klinikum im Friedrichshain, Klinik für Innere Medizin Angiologie und Hämostaseologie, Berlin, Germany", "Institut für Immunologie und Transfusionsmedizin, Universitätsmedizin Greifswald, Greifswald, Germany", "Bernd Pötzsch", "Johannes Oldenburg", "langer@uke.de", "Zentrum für Onkologie, II. Medizinische Klinik und Poliklinik, Universitätsklinikum Eppendorf, Hamburg, Germany", "Zentrum für Labormedizin, Hämostase- und Hämophilie-Zentrum, Hämatologisches Ambulatorium, St. Gallen, Switzerland", "Institute of Experimental Haematology and Transfusion Medicine, University Clinic Bonn, Bonn, Germany", "Universitätsmedizin Mainz, III. Medizinische Klinik/Hämatologie/CTH, Mainz, Germany", "Rüdiger E. Scharf", "Institut für Transplantationsdiagnostik und Zelltherapie/Hämostaseologie, Hämotherapie und Transfusionsmedizin, Universitätsklinikum Düsseldorf, Düsseldorf, Germany", "Universitäts-Kinderspital Zürich, Hämatologie, Zürich, Switzerland", "Charis von Auer", "Clinical Division of Haematology and Haemostaseology, Department of Medicine I, Medical University of Vienna, Vienna, Austria", "Florian Langer", "Robert Klamroth"], "publish_date": null}