{"result_id": "159014", "URL": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-1761454", "timestamp": "2023-04-25 15:31:46 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/html/10.1055/s-0043-1761454", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - Journal of Laboratory Physicians / Full Text", "cleaned_text": "Introduction Vaccination has shown to be protective against severe coronavirus disease 2019 by various studies. However, the vaccine efficacy was demonstrated to be less against the emerging variants of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). Both vaccine- and infection-induced immunity against SARS-CoV-2 may prevent reinfection and severity. Our study aims to assess and compare the humoral response in heterogeneous population based on infection and vaccination status along with hybrid immunity.\n\nMethods A retrospective, observational study of 2,545 adults was conducted. The study groups comprised of group I (n = 309) naive with a single dose of vaccination, group II (n = 357) infected and unvaccinated, group III (n = 590) completely vaccinated with two doses of vaccine, group IV (n = 70) booster dose, group V (n = 602) with hybrid immunity (pre-vaccination infection), and group VI (n = 617) with breakthrough infection (post-vaccination infection). Data pertaining to demographic details, clinical presentations, reverse transcription-polymerase chain reaction, anti-SARS-CoV-2 total antibodies immunoglobulin G (IgG), neutralizing antibodies by anti SARS-CoV-2 sVNT (surrogate virus neutralization test), S1/S2IgG, S-RBD (receptor-binding domain), and ChAdOx1-nCov-19 (Covishield) vaccination were retrieved from electronic health records.\n\nResults The mean levels of neutralizing antibodies of group V were S1/S2, RBD (10.5/14.3 times), and sVNT (84.44%) and group VI had S1/S2, RBD (11.4/11.8 times), and sVNT (78.07%) when compared to group III. We also observed a statistically significant higher immune response in group V and VI than group I and II. A higher percentage (18.2%) of group II individuals had severe disease when compared to group V and VI (6.5/10.8%).\n\nConclusion A single dose of ChAdOx1 vaccine gives robust antibody responses in previously infected individuals and may confer long-term hybrid immunity following booster vaccination.\n\nA single or two doses of vector-based vaccine in conjunction with a natural infection before or after the vaccination, generated high levels of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) neutralizing antibodies and may be sufficient to provide protection against reinfection and/or severity.[1] [2]\n\nWe recommend that this concept of hybrid immunity needs to be considered and used in planning vaccination policies for protecting individuals at higher risk of post-vaccination infection like older individuals and immunocompromised individuals as it is becoming increasingly salient with emerging variants.\n\nVaccination against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) is a leading strategy to change the course of the coronavirus disease 2019 (COVID-19) pandemic worldwide. New variants of concern increased the risk of infection in all countries for people who are not yet vaccinated.[3] [4] Due to potential new waves of COVID-19 and the increasing threat of new variants,[5] [6] extensive vaccination programs should be implemented to maximize vaccine efficacy with limited vaccine resources. The World Health Organization (WHO) is working for equitable access to safe and effective vaccines in ending the COVID-19 pandemic, so it is hugely encouraging to see so many vaccines being developed and tested in India.\n\nThe efficacy of vaccines against newer variants has to be assessed in the real world to strategize the vaccination programs. Assessing vaccine efficacy periodically will facilitate efficient implementation of the global vaccination policy. For obtaining herd immunity globally all the countries had implemented vaccination strategy as a game-changing tool to reduce morbidity and mortality.[7] [8] [9] [10]\n\nMost recovered patients already have some immunity against SARS-CoV-2, although it is insufficient to protect against emerging variants. Recently, several randomized controlled trials showed a higher risk for post-vaccination (“breakthrough”) infection individuals who had lower neutralizing, spike, or receptor-binding domain (RBD) titers after vaccination with (1) mRNA-1273, (2) ChAdOx1, and (3) BNT162b2 vaccines. In addition, several studies have also reported that antibody responses begin to wane after 6 months following vaccination and such individuals are at higher risk of breakthrough infections.[11] Hence, a booster dose of COVID-19 vaccine is being administered to high-risk populations and health care workers in India. There are limited studies that have assessed the humoral response in individuals with COVID-19 with or without vaccination. Therefore, we evaluated and compared humoral immune response in (1) ChAdOx1 vaccinated with single or double dose but uninfected individuals, (2) hybrid immunity, (3) break through infection, and (4) unvaccinated individuals with only infection.\n\nA total of 2,545 patients who were admitted to the hospital between June 2020 and January 2022 at AIG Hospitals, Hyderabad, Telangana, India were retrospectively included in the study. We evaluated vaccine-induced immunity, hybrid immunity, and breakthrough along with only infection by retrieving the data pertaining to previous SARS-CoV-2 infection, vaccination status, and antibody levels from the electronic database of the hospital and laboratory. Naive individuals were those with negative SARS-CoV reverse transcription-polymerase chain reaction (RT-PCR) employing Taq path kits (Thermoscientific, United States) and negative anti-SARS-CoV-2 total antibodies. The anti-SARS-CoV-2 immunoassay (electrochemiluminescence immunoassay [ECLIA]) was performed on a Cobas e601 analyzer (Roche Diagnostics, Mannheim, Germany) and conducted according to the manufacturer's instructions. This sandwich assay uses a SARS-CoV-2 specific recombinant antigen representing the nucleocapsid protein. The electrochemiluminescent signal produced is compared to the cutoff signal value previously obtained with two calibrators. Results are expressed as cutoff index (COI) (negative COI < 1.0 or positive COI ≥ 1.0) for anti-SARS CoV-2 total antibodies. COVID-19 recovered patients had been diagnosed by RT-PCR during first, second, or third wave. Quantitative detection of immunoglobulin G (IgG) anti-S1 and IgG anti-S2 antibodies to SARS-CoV-2 were done by anti-SARS-CoV-2 S1/S2 IgG assay by chemiluminescence immunoassay performed on LIAISON XL (DiaSorin, Saluggia, Italy). According to the manufacturer, specificity is 98.5% (97.5–99.2) and sensitivity is 97.4% > 15 days after diagnosis at a cutoff of > 15 AU/mL. Anti-SARS-CoV-2 S-RBD immunoassay is an ECLIA (RBD) and measured on Cobas e601 modular analyzers (Roche Diagnostics, Rotkreuz, Switzerland). Results are reported as the analyte concentration of each sample in U/mL, with > 0.80 U/mL interpreted as positive. The manufacturer states specificity of 99.98% (99.91–100), and a sensitivity ≥ 14 days after the first positive RT-PCR of 98.8% (98.1–99.3). Neutralizing antibodies were tested by “cPass SARS-CoV-2 Surrogate Virus Neutralization Test Kit” (GenScript Biotech, USA ELISA). A surrogate virus neutralization test is a quick and simple assay that detects antibodies that inhibit the RBD-angiotensin-converting enzyme 2 interaction, which is crucial for virus entry into host cells. It was considered as positive if the inhibition was > 30%. According to the WHO classification, COVID-19 infection was categorized into mild, moderate, or severe infection. Mild COVID-19 defined as respiratory symptoms without evidence of pneumonia or hypoxia, while moderate or severe infection defined as presence of clinical and radiological evidence of pneumonia. In moderate cases, SpO2 ≥ 90% on room air while one of the following was required to define the severe cases: respiratory rate > 30 breaths/min or SpO2 < 90% on room air.[12]\n\nAll procedures were performed after acquiring necessary approvals from the institutional ethical committee of AIG Hospitals (IRB AIG/IEC-Post BH&R 57/01.2022-01). The institutional ethical committee had waived obtaining of the consent from the individuals.\n\nData was analyzed and plotted using Graph Pad Prism 8.0 software. Quantitative data with a normal distribution are reported as mean and standard deviations (SDs) and qualitative data are expressed as percentages. Two independent samples were compared using t-tests. Comparisons between two paired samples were made by the paired t-test. Multiple independent samples were compared using one-way analysis of variance for normal distribution. A p-value of < 0.05 was regarded as statistically significant.\n\nWe assessed efficacy of vaccines in previously recovered hybrid immunity, breakthrough, only vaccinated, and only infected individuals by assessing the humoral immune response. Based on the vaccination status, the study groups were divided into groups that comprised of naive individuals with a single dose of vaccination (group I; n = 309), infected individuals without vaccination (group II; n = 357), individuals who were completely vaccinated (group III; n = 590), individuals who were administered a booster dose of vaccine (group IV; n = 70), individuals with hybrid immunity (single dose vaccine after previous infection) (group V; n = 602), and individuals with breakthrough infections (infection after single or double dose vaccination) (group VI; n = 617). The mean age was 51.8 years (SD 10.1) and individual demographic characteristics of the study group across all the groups were similar as shown in [Table 1]/[Fig. 1]. The mean S1/S2 antibody titers were of significantly higher levels in group V (1284.5 ± 203.4) and VI (1091 ± 234.8) as compared to the other groups (51.82 ± 8.15 in group I; 85.7 ± 12.4 in group II; 108.4 ± 15.01 in Group III, and 382.7 ± 42.96 in group IV). Likewise, RBD antibody titers that were significantly higher were noted in group V (43610 ± 6457.5) and VI (36042 ± 3948.9) as compared to the other groups (1307.6 ± 209.6 in group I; 2556 ± 365.65 in group II; 3779.5 ± 531.45 in group III, and 19125 ± 1882.5 in group IV). Surrogate virus-neutralization test (sVNT) showed four to five times higher neutralization in group V and VI followed by group III, II, and I. Baseline seropositivity was higher in the groups V and VI as compared to groups I, II, II, and IV as shown in [Fig. 1]. We analyzed hybrid immunity and breakthrough by comparing individuals who received only a single vaccine dose and double dose by S1/S2 and RBD antibody levels and sVNT which did not show any significant difference between these two groups. Hence, we combined them into single groups, that is, group V and VI. Groups V and VI, that is, hybrid and breakthrough infection with a single or double vaccine dose pre- or postinfection have good neutralizing capability in vitro. Majority of the individuals had developed (18.2%) severe COVID-19 in group II that comprised of COVID-19 positive individuals without vaccination as compared to other groups (V and VI; 6.5/10.8%).\n\nUnderstanding vaccine immunity in individuals with and without exposure to the virus is very important and aids in planning the vaccination programs world over. Assessing neutralizing antibodies is important to assess the extent of the humoral response in individuals. Here, we evaluated immunity between unvaccinated SARS-CoV-2 recovered individuals and in those vaccinated with single or double dose of vaccine either before or after infection that is in breakthrough and hybrid immunity. Our data demonstrates that the humoral immune response in recovered SARS-CoV-2 individuals before or after vaccination elicit a significantly higher neutralizing antibody response as compared to primary, booster dose, single dose, and unvaccinated recovered individuals showing natural immunity seems to be protective and elicits robust immune response by COVID-19 vaccination in SARS-CoV-2 recovered individuals. Bates et al reported that natural infection boosts humoral response regardless of the timing of the vaccination[13] in SARS-CoV-2 recovered individuals.\n\nIn our study, we observed a subdued Response to the second dose after a previous strong immune response, but it still prevented worsening of the disease and decreased the risk of hospitalization. Krammer et al reported that individuals with previous infection with a single dose of a messenger ribonucleic acid (mRNA) vaccine mounted strong humoral response but muted response to the second dose.[14]\n\nIn particular, the seroconversion rate of the neutralizing antibodies was 84.4% in group V and 78.07% in group VI versus 17.39% in group I, 31.66% in group II, 44.10% in group III, and 65.71% in group IV with the ChAdOX1 vaccines. This data is consistent with the previous findings that the individuals who received the complete mRNA vaccine dose were all seropositive in the SARS-CoV-2 pseudovirus neutralization test, were as response was low with Ad26.CoV2.S vaccines.[15] It is well demonstrated that a higher humoral response and T cell memory is elicited with a single dose of vector-based vaccine along with previous infection.[16] Based on these multiple studies, the concept of hybrid immunity is being explored as vaccination post-natural infection.[17] [18] As immune response from natural infection alone is variable, few individuals elicit a stronger response and few may develop a relatively lesser response. Interestingly, ChAdOX1 induced a broad range of humoral immune responses in both hybrid immunity and breakthrough infection compared to COVID-19-naive or only vaccinated individuals—a similar finding was seen in the study of Jeewandara et al.[19] Therefore, vaccination might be more effective in COVID-19 recovered individuals than in infection-naive vaccinated individuals.\n\nMany other studies have shown that the T cells cellular response play an important role in the SARS-CoV-2 vaccination and infection.[12] As our study focused only on the humoral response, the major limitation of our work is that we have not looked at T cell response and follow-up studies are necessary in order to determine the longevity of protection.\n\nIn summary, our study shows hybrid immunity resulted in higher antibody response compared to vaccination alone as the primary infection will increase the potency to Prime our immune system. This data in India demonstrates significant variation in vaccine immunogenicity in infection-naive and SARS-CoV-2 recovered individuals.\n\nHybrid immunity likely provides strong protection against severe infection, provided that the antigens of the emerging variant have same phenotypes of those of the primary Wuhan wild strain. Existing vaccines have failed to provide the same level of increased protection against the newer Omicron variants. As access and equitable distribution of COVID-19 vaccine in low-income countries is still challenging, hybrid immune response in COVID-19 recovered individuals, can also be achieved by heterologous vaccine boosters, or by mucosal vaccination (intranasal vaccine), or by newer vaccines which include conserved regions of viral non-spike genomic ribonucleic acid from different emerging SARS-CoV-2 variants. Intranasal vaccines are relatively easy and quick for mass vaccination and can be updated with emerging new variants which will induce more protection by inducing mucosal immunity along with a strong T cell and B cell immune response.\n\nWe suggest vaccination policy should be according to vaccine availability, previous history of infection, and by increasing the frequency of immune testing in older and immunocompromised individuals who are at higher risk of post-vaccination infection, which is becoming increasingly salient with emerging Omicron variants.\n\nThe hybrid immunity conferred by administrating at least a single vaccine dose to as many individuals as possible with a confirmed history of SARS-CoV-2 infection will result in herd immunity, and at some point in the future SARS-CoV-2 could become an endemic infection, like a seasonal flu, instead of a pandemic.\n• 1 Voysey M, Clemens SAC, Madhi SA. et al; Oxford COVID Vaccine Trial Group. Safety and efficacy of the ChAdOx1 nCoV-19 vaccine (AZD1222) against SARS-CoV-2: an interim analysis of four randomised controlled trials in Brazil, South Africa, and the UK. Lancet 2021; 397 (10269): Erratum in: Lancet. 2021 Jan 9;397(10269):98. PMID: 33306989; PMCID: PMC7723445 99-111\n• 2 Moore JP, Offit PA. SARS-CoV-2 vaccines and the growing threat of viral variants. JAMA 2021; 325 (09) 821-822\n• 3 Rinott E, Youngster I, Lewis YE. Reduction in COVID-19 patients requiring mechanical ventilation following implementation of a national COVID-19 vaccination program—Israel, December 2020–February 2021. MMWR Morb Mortal Wkly Rep 2021; 70 (09) 326-328\n• 4 Rubin R. COVID-19 vaccines vs variants—determining how much immunity is enough. JAMA 2021; 325 (13) 1241-1243\n• 5 Gilbert PB, Montefiori DC, McDermott AB. et al; Immune Assays Team§, Moderna, Inc. Team§, Coronavirus Vaccine Prevention Network (CoVPN)/Coronavirus Efficacy (COVE) Team§, United States Government (USG)/CoVPN Biostatistics Team§. Immune correlates analysis of the mRNA-1273 COVID-19 vaccine efficacy clinical trial. Science 2022; 375 (6576): 43-50\n• 6 What You Need to Know About Variants. CDC Updates February 25, 2022\n• 7 Feng S, Phillips DJ, White T. et al; Oxford COVID Vaccine Trial Group. Correlates of protection against symptomatic and asymptomatic SARS-CoV-2 infection. Nat Med 2021; 27 (11) 2032-2040\n• 9 Kwok KO, Lai F, Wei WI, Wong SYS, Tang JWT. Herd immunity - estimating the level required to halt the COVID-19 epidemics in affected countries. J Infect 2020; 80 (06) e32-e33\n• 11 Levin EG, Lustig Y, Cohen C. et al. Waning immune humoral response to BNT162b2 Covid-19 vaccine over 6 months. N Engl J Med 2021; 385 (24) e84\n• 13 Bates TA, McBride SK, Leier HC. et al. Vaccination before or after SARS-CoV-2 infection leads to robust humoral response and antibodies that effectively neutralize variants. Sci Immunol 2022; 7 (68) eabn8014\n• 14 Krammer F, Srivastava K, Alshammary H. et al. Antibody responses in seropositive persons after a single dose of SARS-CoV-2 mRNA vaccine. N Engl J Med 2021; 384 (14) 1372-1374\n• 15 Naranbhai V, Garcia-Beltran WF, Chang CC. et al. Comparative immunogenicity and effectiveness of mRNA-1273, BNT162b2 and Ad26.COV2. S COVID-19 vaccines. J Infect Dis 2022; 225 (07) 1141-1150\n• 16 Sasikala M, Shashidhar J, Deepika G. et al. Immunological memory and neutralizing activity to a single dose of COVID-19 vaccine in previously infected individuals. Int J Infect Dis 2021; 108: 183-186\n• 18 Rydyznski Moderbacher C, Ramirez SI, Dan JM. et al. Antigen-specific adaptive immunity to SARS-CoV-2 in acute COVID-19 and associations with age and disease severity. Cell 2020; 183 (04) 996-1012.e19\n• 19 Jeewandara C, Kamaladasa A, Pushpakumara PD. et al. Immune responses to a single dose of the AZD1222/Covishield vaccine in health care workers. Nat Commun 2021; 12 (01) 4617\n\n© 2023. The Indian Association of Laboratory Physicians. This is an open access article published by Thieme under the terms of the Creative Commons Attribution-NonDerivative-NonCommercial License, permitting copying and reproduction so long as the original work is given appropriate credit. Contents may not be used for commercial purposes, or adapted, remixed, transformed or built upon. (https://creativecommons.org/licenses/by-nc-nd/4.0/)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/pdf/10.1055/s-0043-1761454.pdf", "javascript:;", "#N10662", "#N106A6", "#N106BA", "#N106ED", "#N106F9", "#N10702", "#N10715", "#N10C76", "#N10CA8", "#N10CBF", "#top", "#JR2231145-1", "#JR2231145-2", "#top", "#JR2231145-3", "#JR2231145-4", "#JR2231145-5", "#OR2231145-6", "#JR2231145-7", "#JR2231145-8", "#JR2231145-9", "#OR2231145-10", "#JR2231145-11", "#top", "#BR2231145-12", "#top", "#top", "#top", "#TB2231145-1", "#FI2231145-1", "#FI2231145-1", "https://www.thieme-connect.de/media/10.1055-s-00044881/EFirst/10-1055-s-0043-1761454-i2231145-1.jpg", "#top", "#JR2231145-13", "#JR2231145-14", "#JR2231145-15", "#JR2231145-16", "#JR2231145-17", "#JR2231145-18", "#JR2231145-19", "#BR2231145-12", "#top", "#top", "#top", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-1", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-2", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-3", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-4", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-5", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-7", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-8", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-9", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/covid-19-vaccines", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-11", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/BR2231145-12", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-13", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-14", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-15", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-16", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-17", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-18", "/products/ejournals/linkout/10.1055/s-0043-1761454/id/JR2231145-19", "mailto:drd.gujjarlapudi@aighospitals.com"], "authors": ["0000-0002-8254-3433", "Department of Critical Care Medicine, AIG Hospitals, Hyderabad, Telangana, India", "Yelamanchili Sadhana", "0000-0001-7540-0496", "Department of Gastroenterology, AIG Hospitals, Hyderabad, Telangana, India", "Duvvur Nageshwar Reddy", "Singamsetty Adarsh", "Department of Microbiology, AIG Hospitals, Hyderabad, Telangana, India", "Mahavadi Srihitha", "drd.gujjarlapudi@aighospitals.com", "0000-0002-1806-725X", "0000-0002-9818-0681", "Gujjarlapudi Deepika", "Department of Biochemistry, AIG Hospitals, Hyderabad, Telangana, India", "Namburu Veeraiah"], "publish_date": null}