{"result_id": "159028", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1761454", "timestamp": "2023-04-25 15:31:54 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/products/assets/mobile/img/h/apple-touch-icon-3cbb7a2b0635c836ae6c379dc18f83df.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0043-1761454", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Books & E-Journals", "cleaned_text": "Introduction Vaccination has shown to be protective against severe coronavirus disease 2019 by various studies. However, the vaccine efficacy was demonstrated to be less against the emerging variants of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). Both vaccine- and infection-induced immunity against SARS-CoV-2 may prevent reinfection and severity. Our study aims to assess and compare the humoral response in heterogeneous population based on infection and vaccination status along with hybrid immunity.\n\nMethods A retrospective, observational study of 2,545 adults was conducted. The study groups comprised of group I (n = 309) naive with a single dose of vaccination, group II (n = 357) infected and unvaccinated, group III (n = 590) completely vaccinated with two doses of vaccine, group IV (n = 70) booster dose, group V (n = 602) with hybrid immunity (pre-vaccination infection), and group VI (n = 617) with breakthrough infection (post-vaccination infection). Data pertaining to demographic details, clinical presentations, reverse transcription-polymerase chain reaction, anti-SARS-CoV-2 total antibodies immunoglobulin G (IgG), neutralizing antibodies by anti SARS-CoV-2 sVNT (surrogate virus neutralization test), S1/S2IgG, S-RBD (receptor-binding domain), and ChAdOx1-nCov-19 (Covishield) vaccination were retrieved from electronic health records.\n\nResults The mean levels of neutralizing antibodies of group V were S1/S2, RBD (10.5/14.3 times), and sVNT (84.44%) and group VI had S1/S2, RBD (11.4/11.8 times), and sVNT (78.07%) when compared to group III. We also observed a statistically significant higher immune response in group V and VI than group I and II. A higher percentage (18.2%) of group II individuals had severe disease when compared to group V and VI (6.5/10.8%).", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thieme-connect.de/media/10.1055-s-00044881/EFirst/lookinside/10-1055-s-0043-1761454_2231145-1.jpg"], "authors": ["0000-0002-8254-3433", "Department of Critical Care Medicine, AIG Hospitals, Hyderabad, Telangana, India", "Yelamanchili Sadhana", "0000-0001-7540-0496", "Department of Gastroenterology, AIG Hospitals, Hyderabad, Telangana, India", "Duvvur Nageshwar Reddy", "Singamsetty Adarsh", "Department of Microbiology, AIG Hospitals, Hyderabad, Telangana, India", "Mahavadi Srihitha", "drd.gujjarlapudi@aighospitals.com", "0000-0002-1806-725X", "0000-0002-9818-0681", "Gujjarlapudi Deepika", "Department of Biochemistry, AIG Hospitals, Hyderabad, Telangana, India", "Namburu Veeraiah"], "publish_date": null}