{"result_id": "159013", "URL": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1748158", "timestamp": "2023-04-25 15:31:46 CEST+0200", "meta": {"description": "Thieme E-Books & E-Journals", "lang": "en", "keywords": "", "favicon": "/products/assets/favicon-e6861aa09fc6a3a946cb99117c7bbb6d.png", "canonical": "https://www.thieme-connect.com/products/ejournals/abstract/10.1055/s-0042-1748158", "encoding": "utf-8"}, "image": null, "domain": "www.thieme-connect.com", "title": "Thieme E-Journals - American Journal of Perinatology / Abstract", "cleaned_text": "Objective The objective of this study was to describe the acute side effects experienced by pregnant women who received a coronavirus disease 2019 (COVID-19) vaccine in the United States and to compare their experience to nonpregnant women of similar age.\n\nStudy Design Adults who received a COVID-19 vaccine in the United States were invited via social media to enroll in an online, longitudinal, community-based registry ( www.helpstopCOVID19.com ). Participants self-reported pregnancy status, vaccination dates, manufacturer, acute side effects, impact on work and self-care, medical consultation, and hospitalization. This analysis was restricted to women aged 20 to 39 at the time of vaccination. Side effects reported by pregnant women were compared to those reported by nonpregnant women.\n\nResults This analysis included 946 pregnant women, with 572 (60%) receiving at least one dose of Pfizer, 321 (34%) Moderna, and 53 (6%) J&J, and 1,178 nonpregnant women. Demographic and medical history were similar across manufacturers for both cohorts.\n\nOverall, pregnant women reported similar side effects as nonpregnant women, with the most common being injection site reactions (83 vs. 87%), fatigue (72 vs.78%), and headache (45 vs. 59%). Pregnant women reported fewer side effects (median: 3 vs. 4, respectively). In both cohorts, very few reported seeking medical care (<5%) or being hospitalized (<0.3%) after vaccination. Fewer pregnant women reported working less after vaccination than nonpregnant women (32 vs. 40%) or trouble with self-care (32 vs. 46%), respectively.\n\nConclusion Pregnant women reported similar COVID-19 vaccine side effects as nonpregnant women, although fewer total side effects; pregnant women judged these side effects to have less impact on work and self-care. While these results do not address pregnancy outcomes or long-term effects, findings about acute side effects and impact offer reassurance for all three vaccines in terms of tolerability.\n• COVID vaccines were well tolerated by pregnant women.\n• Pregnant women reported less impact on work and self-care.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/products/ejournals/buyDocument/10.1055/s-0042-1748158", "javascript:;", "https://www.thieme-connect.de/media/ajp/202216/lookinside/10-1055-s-0042-1748158_210860-1.jpg", "http://www.helpstopCOVID19.com"], "authors": ["Christina DeFilippo Mack", "IQVIA Real-World Solutions, 201 Broadway, Cambridge, Massachusetts", "0000-0003-0113-8952", "Pegasus Research, Neuschwaendistrasse 6, 6390 Engelberg, Switzerland", "Emma Brinkley", "Lisa Albert", "Nancy.Dreyer@IQVIA.com", "Kendall Knuth", "Matthew W. Reynolds", "Stephen Toovey", "Nancy A. Dreyer"], "publish_date": null}