{"result_id": "161040", "URL": "https://humansarefree.com/2021/07/patients-vaccinated-covid-19-have-permanent-heart-damage.html", "timestamp": "2023-04-25 15:33:30 CEST+0200", "meta": {"description": "Canadian Doctor: 62% of Patients Vaccinated for COVID Have Permanent Heart Damage", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png", "canonical": "https://humansbefree.com/2021/07/patients-vaccinated-covid-19-have-permanent-heart-damage.html", "encoding": "UTF-8"}, "image": null, "domain": "humansarefree.com", "title": "Canadian Doctor: 62% of Patients Vaccinated for COVID Have Permanent Heart Damage", "cleaned_text": "We have previously covered the story of Dr. Charles Hoffe, the brave doctor who has been practicing medicine for 28 years in the small, rural town of Lytton in British Columbia, Canada.\n\nAfter he had administered about 900 doses of the Moderna experimental mRNA COVID-19 injections, he sounded the alarm over the severe reactions he was observing in his patients who chose to get the shot (he chose NOT to get it himself), which included death.\n\nThe result of him sounding the alarm was a gag order issued against him by the medical authorities in his community. He defied this gag order and was interviewed by Laura-Lynn Tyler Thompson on her show where he sounded the alarm.\n\nHis punishment for going public to warn others on the dangers of these experimental shots was that he was relieved from hospital duty and lost half of his income.\n\nHis punishment for going public to warn others on the dangers of these experimental shots was that he was relieved from hospital duty and lost half of his income.\n\nLast week, Dr. Hoffe was interviewed again by Laura-Lynn Tyler Thompson, and he continues to share his findings with the public regarding the experimental COVID-19 shots.\n\nDr. Hoffe is truly a hero today, risking not only his reputation, but probably his very life to bring important information regarding the COVID-19 shots that the Globalists who control the corporate media and social media are trying very hard to censor.\n\nIn this latest interview, Dr. Hoffe states that the blood clots that are being reported in the corporate media as being “rare” are anything but rare, based on his own testing of his own patients who had recently received one of the shots.\n\nThe blood clots we hear about which the media claim are very rare are the big blood clots which are the ones that cause strokes and show up on CT scans, MRI, etc..\n\nThe clots I’m talking about are microscopic and too small to find on any scan. They can thus only be detected using the D-dimer test.\n\nUsing this test with his own patients, Dr. Hoffe claims that he has found evidence of small blood clots in 62% of his patients who have been injected with an mRNA shot.\n\nHe states that these people are now permanently disabled, and they will no longer “be able to do what they used to do.”\n\nThese people have no idea they are even having these microscopic blood clots. The most alarming part of this is that there are some parts of the body like the brain, spinal cord, heart and lungs which cannot re-generate. When those tissues are damaged by blood clots they are permanently damaged.\n\nHis warning is very dire: “These shots are causing huge damage and the worst is yet to come.”\n\nThis is an 8 minute clip from the original interview, and we have posted it on our Bitchute channel and Rumble channel.\n\nIs Canada Finally Starting to Pay Attention to these Dissenting Doctors Sounding the Alarm?\n\nDr. Hoffe is not the only doctor to sound the alarm over serious side effects from the COVID-19 shots.\n\nLast month we covered the press conference given in Ontario at Parliament Hill that was arranged by MP Derek Sloan and featured four other Canadian doctors who were also being censored over what they are seeing and reporting regarding the COVID-19 shots.\n\nAre these public testimonies from doctors who dare to question the official narrative in the face of tremendous censorship, ridicule, and even threats starting to make a difference in Canada?\n\nYesterday there was a Press Release from the COVID-19 Immunity Task Force in Canada. This group is comprised of:\n\nExperts from across Canada in matters related to serologic surveillance, immunology, virology, infectious diseases, public health, and clinical medicine. It also includes ex-officio members representing agencies of the Government of Canada, including the Public Health Agency of Canada (PHAC), the Canadian Institutes of Health Research (CIHR), and the office of the Chief Scientific Advisor to the Prime Minister, as well as representatives of Provincial-Territorial Ministries of Health, and McGill University (host of the Secretariat). (Source)\n\nThis is the first time I have ever seen in any country a group with ties to government health agencies admit that there are seriously injured individuals from the COVID-19 shots, and that strategies need to be developed to deal with their injuries.\n\nSome injuries have been acknowledged in the U.S. by the FDA, but the only action they have taken is to add warnings to the shots – nothing about how to treat the victims and their injuries.\n\nTo be sure, this group in Canada keeps stating the official narrative that “the benefits of the COVID-19 vaccination continue to outweigh the risks” while supplying no underlying data or studies to prove this statement, but the fact that they are even admitting that there are people injured by the shots that need help, is huge.\n\nThe Government of Canada, through its COVID-19 Immunity Task Force (CITF) and Vaccine Surveillance Reference Group (VSRG), is investing approximately $800,000 for a study that aims to further improve Canada’s identification and response to adverse events people may experience following COVID-19 vaccination across 10 provinces. This study is an extension of an existing jjab safety program that provides important public health information about adverse events following immunization (AEFI) for all jjabs authorized for use in adults and children.\n\nLet’s hope this is not just another excuse to spend money with no results, but that something substantive could come out of such a study, that quite possibly was motivated by the honest physicians in Canada who risked their careers and lives to bring the truth to the public.", "opengraph": {"url": "https://humansbefree.com/2021/07/patients-vaccinated-covid-19-have-permanent-heart-damage.html", "site_name": "Humans Be Free", "locale": "en_US", "type": "article", "article:author": "https://www.facebook.com/PositiveNewBeginning/", "article:publisher": "https://www.facebook.com/PositiveNewBeginning/", "article:section": "Coronavirus", "title": "Canadian Doctor: 62% of Patients Vaccinated for COVID Have Permanent Heart Damage", "description": "Canadian Doctor: 62% of Patients Vaccinated for COVID Have Permanent Heart Damage", "image": "https://humansbefree.com/wp-content/uploads/2021/07/Canadian-Doctor-62-of-Patients-Vaccinated-for-COVID-Have-Permanent-Heart-Damage-e1626416122754.jpg", "image:secure_url": "https://humansbefree.com/wp-content/uploads/2021/07/Canadian-Doctor-62-of-Patients-Vaccinated-for-COVID-Have-Permanent-Heart-Damage-e1626416122754.jpg", "image:width": "905", "image:height": "510", "image:alt": "canadian doctor 62% of patients vaccinated for covid have permanent heart damage"}, "tags": [], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/?find=Charles+Hoffe", "https://humansarefree.com/?s=Moderna+jjab", "https://healthimpactnews.com/2021/canadian-doctor-removed-from-hospital-duty-after-speaking-out-about-covid-jjab-side-effects/", "https://www.bitchute.com/video/A6GbcUl6blpJ/", "https://humansarefree.com/2021/07/mrna-jjabs-will-kill-most-people-through-heart-failure.html", "https://www.bitchute.com/video/A6GbcUl6blpJ/", "https://www.bitchute.com/video/ChQwQBggc8TL/", "https://rumble.com/vjuhch-canadian-doctor-62-of-patients-vaccinated-for-covid-have-permanent-heart-da.html", "https://www.covid19immunitytaskforce.ca/canadian-researchers-to-study-best-approaches-to-possible-adverse-events-following-covid-19-vaccination/", "https://www.covid19immunitytaskforce.ca/leadership-group/", "https://www.covid19immunitytaskforce.ca/leadership-group/", "https://healthimpactnews.com/2021/canadian-doctor-62-of-patients-vaccinated-for-covid-have-permanent-heart-damage/", "https://www.bitchute.com/video/A6GbcUl6blpJ/"], "authors": ["HAF"], "publish_date": "2021-07-16T14:00:27"}