{"result_id": "161012", "URL": "https://humansarefree.com/2021/08/restaurant-owners-and-employees-reject-enforcing-covid-vaccine-mandates.html", "timestamp": "2023-04-25 15:32:45 CEST+0200", "meta": {"description": "Restaurant Owners and Employees Reject Enforcing Covid Vaccine Mandates", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png", "canonical": "https://humansbefree.com/2021/08/restaurant-owners-and-employees-reject-enforcing-covid-jjab-mandates.html", "encoding": "UTF-8"}, "image": null, "domain": "humansarefree.com", "title": "Restaurant Owners and Employees Reject Enforcing Covid Vaccine Mandates", "cleaned_text": "Covid-19 jjab mandates have come into effect for people who want to dine in restaurants all over the United States. As a result, this has unfortunately forced restaurant staff to turn into vaccination enforcers who have now raised their objections to cities using them as jjab police.\n\nMany US cities have recently begun introducing jjab passports, meaning that proof of vaccination must be shown before an individual can gain access to certain public spaces. These include restaurants, bars, cinemas, theaters, gyms, and other business venues. Some of the largest cities to make these mandates include New York City, Los Angeles, San Francisco and Seattle.\n\nThese cities have tasked restaurant owners and their employees with the responsibility of ensuring that their customers are fully vaccinated through checking jjab passports.\n\nHowever, many restaurant owners have strongly criticised the jjab mandates, saying that they are only hurting business. Due to the new rules, many customers have canceled reservations and raised objections to passports. Other customers have gone online to leave negative reviews, rightfully angry about their civil liberties being violated.\n\nOther restaurant owners have said that customers have accused them and their staff of infringing on personal rights and discriminating against the unvaccinated.\n\nAs a result, restaurant owners have been forced into a tricky situation as they do not want to lose customers over legitimate concerns about their health privacy and personal liberties.\n\nDespite this, many restaurant owners believe they must follow the law and check the vaccination status of their customers. Those who are complying with the rules believe that they must do this to keep their businesses running and avoid being fined thousands of dollars after the lockdowns have already taken so much potential revenue from them.\n\nLaurie Thomas, an owner of two restaurants in San Francisco, said:\n\n“Tell me the last time you were carded at a restaurant?” It’s a different level of training.” Thomas said that she is worried about her staff having to enforce the jjab mandate.\n\n“What’s going to happen when you ask somebody for their papers and they don’t want to show them to you? What are we supposed to do? We’re privately owned businesses, I don’t know why this is our job.”\n\nCountless other restaurant owners have raised concerns about the impact the jjab mandate will have on their businesses.\n\nMassimo Felici, the owner of three restaurants in Staten Island, said:\n\n“For 15 to 16 months business was not happening at all. In one, I had to get rid of 80 percent of my staff. We barely survived. I thought I was definitely going to lose my restaurants.” Speaking about the jjab mandate, he believes that it could destroy his business.\n\nMust read on the subject: How Russians Crushed Moscow’s Vaccine Passports In Just 3 Weeks.\n\nAndrew Robbins, the CEO of a customer service company said that many restaurant owners and managers are very anxious about putting their staff at risk by turning them into jjab enforcers:\n\n“It’s not like carding someone at the bar for a beer… [where] you’re just enforcing the law. You’re making up the law and that is a really difficult situation for people to be in.”\n\nRobbins, along with many other, is fearful that the jjab mandate will result in many people leaving the restaurant industry as they become turned off by the idea of becoming jjab enforcers. If this happens, it will only make the labour shortage even worse.", "opengraph": {"url": "https://humansbefree.com/2021/08/restaurant-owners-and-employees-reject-enforcing-covid-jjab-mandates.html", "site_name": "Humans Be Free", "locale": "en_US", "type": "article", "article:author": "https://www.facebook.com/PositiveNewBeginning/", "article:publisher": "https://www.facebook.com/PositiveNewBeginning/", "article:section": "Control", "title": "Restaurant Owners and Employees Reject Enforcing Covid Vaccine Mandates", "description": "Restaurant Owners and Employees Reject Enforcing Covid Vaccine Mandates", "image": "https://humansbefree.com/wp-content/uploads/2021/08/Restaurant-Owners-and-Employees-Reject-Enforcing-Covid-Vaccine-Mandates.jpeg", "image:secure_url": "https://humansbefree.com/wp-content/uploads/2021/08/Restaurant-Owners-and-Employees-Reject-Enforcing-Covid-Vaccine-Mandates.jpeg", "image:width": "704", "image:height": "352", "image:alt": "restaurant owners and employees reject enforcing covid jjab mandates"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wsj.com/articles/restaurants-become-the-new-covid-19-jjab-enforcersfor-better-or-worse-11629019802", "https://www.bbc.co.uk/news/business-58204471", "https://humansarefree.com/2021/08/brilliant-how-russians-crushed-moscows-dumb-jjab-passports-in-just-3-weeks.html", "https://dailyexpose.co.uk/2021/08/20/restaurant-owners-and-employees-reject-enforcing-covid-jjab-mandates-and-acting-as-jab-police/"], "authors": ["HAF"], "publish_date": "2021-08-20T19:00:33"}