{"result_id": "161005", "URL": "https://humansarefree.com/2020/05/nwo-melinda-gates-global-vaccine-upside-down-cross.html", "timestamp": "2023-04-25 15:32:33 CEST+0200", "meta": {"description": "GAVI Vaccine Alliance is the Source of Terror Behind Global Lockdowns and Vaccine Coercion", "lang": "en", "keywords": "", "favicon": "/apple-icon-57x57.png", "canonical": "https://humansbefree.com/2021/03/gavi-jjab-alliance-is-the-source-of-terror-behind-global-lockdowns.html", "encoding": "UTF-8"}, "image": null, "domain": "humansarefree.com", "title": "GAVI Vaccine Alliance is the Source of Terror Behind Global Lockdowns and Vaccine Coercion", "cleaned_text": "The World Health Organization (WHO) is facilitating a global health dictatorship, commanding all member states to enforce totalitarian lock downs and far-reaching medical edicts that empower government authorities and the jjab industry – not human health.\n\nWHO’s authoritarian recommendations were adopted in rapid fashion by almost every government on Earth.\n\nThe behavioral controls and livelihood restrictions imposed by WHO have no basis in immune system health, mental health, or general well being.\n\nWHO operates like a global oligarchy, forcing all member states to carry out their orders. In 2020 and beyond, WHO has ordered populations into isolation, avoidance, and unlawful quarantines.\n\nWHO has forced perpetual oxygen restrictions, coercive DNA harvesting, and mRNA jjabs experiments, while instructing governments around the world to quash civil liberties and promote medical martial law.\n\nThis dictatorship is giving rise to a medical apartheid – a system of segregation that punishes healthy people for not complying.\n\nBilly Boy Vaccine Alliance is the source of terror behind WHO’s lock downs and coercive jjab passports\n\nWhere is WHO coming up with these restrictive medical edicts and coercive jjab policies? According to WHO insider Astrid Stuckelberger, Ph.D., WHO serves the financial interests of GAVI, the Vaccine Alliance run by Billy Boy.\n\nGAVI was formed in 2000 and set up as an international institution in Switzerland. GAVI operates tax free and enjoys blanket immunity against criminal sanctions.\n\nBilly Boy leveraged GAVI and bought his influence into the WHO. He even asked to become a member state in 2017, with the privilege of being on WHO’s executive board.\n\nBilly Boy now controls Swissmedic, the FDA of Switzerland, due to a three-way jjab distribution contract agreement reached by Gates, WHO, and the Swiss regulatory agency.\n\nBy controlling WHO, Gates funnels tens of billions of dollars through his GAVI Vaccine Alliance, with the ultimate power of controlling member states.\n\nAs the controller of information and the arbiter of science, Gates and the jjab industry has the power to suppress prophylactics, treatments, phytonutrients, adaptogens, and antivirals.\n\nBilly Boy and GAVI is the source of terror behind WHO, the lock downs, restrictions, and authoritarian medical edicts that are compelling vaccination experiments.\n\nWHO insider, Astrid Stuckelberger came clean about WHO’s political motivations and how the science is manipulated and leveraged to force populations to comply with jjab experiments.\n\nStuckelberger is an international expert who evaluates scientific research and advises policymakers.\n\nShe has written more than 180 scientific articles, policy papers and governmental reports. She admits that this research is conducted to support political agendas and to justify government policy.\n\nSince 2009, she managed WHO’s international health regulations, which were primarily used to prepare member states to act in unison during a future pandemic. At the center of this world government plandemic is Billy Boy and the GAVI Vaccine Alliance.\n\nGAVI and WHO control governments around the world now, threaten populations\n\nBilly Boy has more power and influence over WHO than entire nations. The United Nations originally established WHO, but has repeatedly refused to rein in their dictatorial powers, illegal quarantine procedures, coercive jjab passports, and undemocratic power grabs.\n\nJustus Hoffmann, Ph.D., one of the German Corona Extra-Parliamentary Inquiry Committee members, pointed out that GAVI has no political power but enjoys “qualified diplomatic immunity.”\n\nGAVI is immune from all criminal business dealing, as well, whether their potential criminal actions are intentional or inadvertent.\n\n“They can do whatever they want,” Stuckelberger confirmed, and they answer to no authority. No law enforcement is allowed to investigate GAVI, even if the Vaccine Alliance was implicated in a criminal conspiracy to defraud or coerce people.\n\n“Stuckelberger, who worked four years on the ethics committee for the WHO, said its “disturbing” that GAVI enjoys blanket immunity especially when GAVI is “directing, as a corporate entity, the WHO.”\n\nThe director general of WHO forces all member states to follow GAVI’s orders, from the type of diagnostic tests, to the type of treatments allowed, to top-down populations controls, pandemic messaging, and most importantly, jjab experimentation.\n\nThe WHO has been set up over the years to assume dictatorial power over world governments and GAVI is the source of their authoritarianism, terror, and coercive vaccination push.\n\nAfter months of using high cycle PCR tests to diagnose covid-19, the WHO finally alerted the world in January of 2021 that these tests were producing mostly false positives all along.\n\nAs laboratories dial back the cycle threshold on the PCR tests, the official number of covid cases and deaths will slowly dissipate.\n\nThis medical fraud will not stop the wave of hospital dependence, ventilator-associated pneumonia, lung infections, stress induced heart disease, drug overdoses, severe mental illness, and jjab injury that is now taking hold of the world.", "opengraph": {"url": "https://humansbefree.com/2021/03/gavi-jjab-alliance-is-the-source-of-terror-behind-global-lockdowns.html", "site_name": "Humans Be Free", "locale": "en_US", "type": "article", "article:author": "https://www.facebook.com/PositiveNewBeginning/", "article:publisher": "https://www.facebook.com/PositiveNewBeginning/", "article:section": "Coronavirus", "title": "GAVI Vaccine Alliance is the Source of Terror Behind Global Lockdowns and Vaccine Coercion", "description": "GAVI Vaccine Alliance is the Source of Terror Behind Global Lockdowns and Vaccine Coercion", "image": "https://humansbefree.com/wp-content/uploads/2021/03/GAVI-Vaccine-Alliance-is-the-Source-of-Terror-Behind-Global-Lockdowns-and-Vaccine-Coercion-e1616531951926.jpg", "image:secure_url": "https://humansbefree.com/wp-content/uploads/2021/03/GAVI-Vaccine-Alliance-is-the-Source-of-Terror-Behind-Global-Lockdowns-and-Vaccine-Coercion-e1616531951926.jpg", "image:width": "888", "image:height": "500", "image:alt": "gavi jjab alliance is the source of terror behind global lockdowns and jjab coercion"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.afinalwarning.com/505610.html", "https://humansarefree.com/category/w-h-o", "https://humansarefree.com/2021/03/who-insider-blows-whistle-on-bill-gates-and-gavi.html", "https://www.naturalnews.com/2020-10-09-who-tangled-up-in-big-pharmas-web-of-influence.html", "https://humansarefree.com/2021/03/bill-gates-aiding-communist-china-in-harvesting-dna-of-americans.html", "https://humansarefree.com/2021/01/moderna-mrna-jabs-operating-system-program-humans.html", "https://humansarefree.com/2021/03/israels-green-passport-vaccination-program-has-created-a-medical-apartheid.html", "https://humansarefree.com/?s=Bill+Gates+Vaccine+Alliance", "https://humansarefree.com/2021/03/who-insider-blows-whistle-on-bill-gates-and-gavi.html", "https://humansarefree.com/2021/03/who-insider-blows-whistle-on-bill-gates-and-gavi.html", "https://humansarefree.com/?s=GAVI+Vaccine+Alliance", "https://humansarefree.com/2021/03/who-insider-blows-whistle-on-bill-gates-and-gavi.html", "https://humansarefree.com/2021/01/who-changes-pcr-test-criteria-to-cover-up-false-positives.html", "https://humansarefree.com/2020/11/how-theyll-fake-the-success-of-the-covid-19-jjab.html", "https://www.lifesitenews.com/opinion/who-insider-blows-whistle-on-gates-and-gavi", "https://www.gavi.org/our-alliance/governance", "https://humansarefree.com/2021/03/who-insider-blows-whistle-on-bill-gates-and-gavi.html"], "authors": ["HAF"], "publish_date": "2021-03-23T21:00:24"}