{"result_id": "162016", "URL": "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "timestamp": "2023-04-25 15:33:52 CEST+0200", "meta": {"description": "AstraZeneca study finds vector DNA in the sciatic nerve, bone marrow, liver, lungs, and spleen of vaccinated mice.", "lang": "en", "keywords": "", "favicon": "https://icandecide.org/wp-content/uploads/2022/10/cropped-favicon-32x32.png", "canonical": "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "encoding": "UTF-8"}, "image": null, "domain": "icandecide.org", "title": "ICAN Obtains Disturbing Information About AstraZeneca’s Covid-19 Vaccine from the UK Equivalent of the FDA", "cleaned_text": "AstraZeneca study finds vector DNA in the sciatic nerve, bone marrow, liver, lungs, and spleen of vaccinated mice.\n\nBecause AstraZeneca’s COVID-19 vaccine is not licensed in the United States, all documents within the FDA’s possession concerning this vaccine are exempt from disclosure. This means that anyone who received an AstraZeneca COVID-19 vaccine cannot – and might not ever be able to – access any of the data concerning the vaccine from the US government.\n\nNot satisfied by this complete lack of transparency, ICAN, through its attorneys, submitted an information request to the United Kingdom’s FDA equivalent – the Medicines and Healthcare Products Registry Agency (MHRA) — in April 2022 seeking information relating to its authorization of the AstraZeneca COVID-19 vaccine, as well as that relating to its authorization of the Janssen, Moderna, and Pfizer COVID-19 vaccines.\n\nMHRA’s initial response was to threaten to deny ICAN’s request but, after ICAN pushed back and, in the case of the AstraZeneca vaccine, narrowed the scope of the request to seven specific items related to safety testing, MHRA dropped its objection. MHRA recently provided 166 pages of records containing the studies MHRA relied on to authorize AstraZeneca’s COVID-19 vaccine.\n\nOne of these studies investigated biodistribution of the AstraZeneca vaccine, meaning where it goes in the body after injection, in mice. This study revealed that the viral vector DNA did not remain localized in the injection site but instead migrated to other organs. Disturbingly, the study found vector DNA in the sciatic nerves, bone marrow, livers, lungs, and spleens of the mice following vaccination.\n\nThe study documents further revealed that, in early 2021, AstraZeneca was forced to amend its data sheet for the vaccine after concluding that there may have been a causal association between the vaccine and serious hypersensitivity including anaphylaxis.\n\nAnother perhaps unsurprising revelation was the inclusion of disclaimer that a number of vulnerable populations, such as pregnant and lactating women and immunocompromised persons, were excluded from pre-market human safety studies. In its Marketing Authorization Application, AstraZeneca stated that because these populations were excluded from the studies, the safety of the vaccine in these groups was unknown. This also led the UK’s Joint Committee on Vaccination and Immunization (JCVI) to recommend against the AstraZeneca vaccine for pregnant women – a sentiment that was echoed in the UK’s vaccination schedule guide, commonly referred to as the “Green Book.”\n\nA final shocking revelation in the documents was the heavily redacted discussion of two individuals who developed serious immune-mediated neurological demyelinating conditions following vaccination. Although it states there was “no evidence suggesting a causal relationship” between the vaccine and these events, the UK’s clinical overview conceded that “vaccinations could be associated with immune-mediated neurological conditions” and therefore these adverse events were included as an important potential risk in the vaccine’s risk management plan.\n\nIn the coming weeks, MHRA is expected to produce additional documents regarding its authorization of the other COVID-19 vaccines.\n\nIn the meantime, you can read about other related work ICAN has done concerning COVID-19 vaccine safety data:\n• ICAN OBTAINS COURT ORDER REQUIRING CDC TO RELEASE V-SAFE DATA THAT INCLUDES OVER 137 MILLION HEALTH ENTRIES MADE AFTER COVID-19 VACCINES\n• EMAILS SHOW NIH DISMISSED POTENTIAL VACCINE RISK AND FOCUSED ON VACCINE DEVELOPMENT INSTEAD OF EARLY TREATMENT OPTIONS\n• FDA PLAYING GAMES WITH THE PUBLIC REGARDING COVID-19 VACCINES", "opengraph": {"locale": "en_US", "type": "article", "title": "ICAN Obtains Disturbing Information About AstraZeneca’s Covid-19 Vaccine from the UK Equivalent of the FDA - ICAN - Informed Consent Action Network", "description": "AstraZeneca study finds vector DNA in the sciatic nerve, bone marrow, liver, lungs, and spleen of vaccinated mice.", "url": "https://icandecide.org/press-release/ican-obtains-disturbing-information-about-astrazenecas-covid-19-vaccine-from-the-uk-equivalent-of-the-fda/", "site_name": "ICAN - Informed Consent Action Network", "article:modified_time": "2023-01-02T17:25:02+00:00", "image": "https://icandecide.org/wp-content/uploads/2023/01/LU170_THUMB.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://icandecide.org/wp-content/uploads/2022/11/IR0751D-UK-MHRA-AstraZenecas-Licensing-Data-Final.pdf", "https://icandecide.org/wp-content/uploads/2022/12/IR0751C-UK-MHRA-JJs-Licensing-Data-.pdf", "https://icandecide.org/wp-content/uploads/2022/12/IR0751B-UK-MHRA-Modernas-Licensing-Data-.pdf", "https://icandecide.org/wp-content/uploads/2022/12/IR0751A-UK-MHRA-Pfizers-Licensing-Data.pdf", "https://icandecide.org/wp-content/uploads/2022/12/FOI-22-674-reply.pdf", "https://icandecide.org/wp-content/uploads/2022/12/IR0751A-D-UK-Internal-Review-Request.pdf", "https://icandecide.org/wp-content/uploads/2022/11/2022-10-24-IR0751D_Production_MHRA_000001-000166-166-pages.pdf", "https://icandecide.org/wp-content/uploads/2022/11/2022-10-24-IR0751D_Production_MHRA_000001-000166-166-pages.pdf#page=36", "https://icandecide.org/wp-content/uploads/2022/11/2022-10-24-IR0751D_Production_MHRA_000001-000166-166-pages.pdf#page=56", "https://icandecide.org/wp-content/uploads/2022/11/2022-10-24-IR0751D_Production_MHRA_000001-000166-166-pages.pdf#page=158", "https://www.gov.uk/government/news/jcvi-issues-new-advice-on-covid-19-vaccination-for-pregnant-women", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1102459/Greenbook-chapter-14a-4September22.pdf#page=34", "https://icandecide.org/wp-content/uploads/2022/11/2022-10-24-IR0751D_Production_MHRA_000001-000166-166-pages.pdf#page=145", "https://icandecide.org/press-release/breaking-news-ican-obtains-court-order-requiring-cdc-to-release-v-safe-data-that-includes-over-137-million-health-entries-made-after-covid-19-vaccines/", "https://icandecide.org/press-release/exclusive-ican-obtains-crucial-pfizer-vaccine-lot-dose-and-distribution-information/", "https://icandecide.org/press-release/covid-19-vaccine-manufacturers-fail-to-properly-investigate-adverse-events-reports/", "https://icandecide.org/press-release/emails-show-nih-dismissed-potential-vaccine-risk-and-focused-on-vaccine-development-instead-of-early-treatment-options/", "https://icandecide.org/press-release/ican-demands-answers-about-death-discrepancies-in-pfizers-clinical-trial/", "https://icandecide.org/press-release/pfizers-years-long-cozy-relationship-with-cdc-official-revealed/", "https://icandecide.org/press-release/fda-playing-games-with-the-public-regarding-covid-19-vaccines/"], "authors": [], "publish_date": "January 2, 2023"}