{"result_id": "162037", "URL": "https://icandecide.org/press-release/attention-new-jersey-residents-automation-of-existing-vaccine-database-in-the-works/", "timestamp": "2023-04-25 15:34:18 CEST+0200", "meta": {"description": "An impending New Jersey law plans to automatically add everyone into an electronic vaccine database & tracking system. Here's how to opt out.", "lang": "en", "keywords": "", "favicon": "https://icandecide.org/wp-content/uploads/2022/10/cropped-favicon-32x32.png", "canonical": "https://icandecide.org/press-release/attention-new-jersey-residents-automation-of-existing-vaccine-database-in-the-works/", "encoding": "UTF-8"}, "image": null, "domain": "icandecide.org", "title": "Attention New Jersey Residents: Automation of Existing Vaccine Database in the Works", "cleaned_text": "An impending New Jersey law plans to automatically add everyone to an electronic vaccine database & tracking system, but the good news is you can opt out!\n\nNew Jersey Bill S3240 was recently passed by the Senate Health Committee. Alarmingly, the bill requires automatic registration of any vaccine administered with the New Jersey Immunization Information System (NJIIS), NJ’s existing statewide database of immunization records.\n\nThe purpose of NJIIS is as dystopian as it sounds:\n\nThe concern that the government might use the registry to track vaccine compliance is not a fiction, as New York State is already using its immunization registry to target those that refuse these medical products.\n\nThe good news is, if you or your child are already in the system, you can withdraw yourself or your child from enrollment in the NJIIS by providing a written request to withdraw.\n\nPlease be aware, however, that after this bill is passed, each time anyone receives a vaccine in the future, that individual will be automatically enrolled in this database and thus he or she must fill out and submit the form each time he or she receives a vaccine if the individual does not want to be enrolled.\n\nThere is a caveat to withdrawing: the Commissioner of Health may deny an individual’s request to not participate in the registry during a public health emergency or outbreak.\n\nIf you or your child were already automatically enrolled in NJIIS and would like to opt-out, you (or your guardian, if you are younger than 18) must complete the NJIIS Registrant Withdrawal Form and mail it to the address at the top of the form. This same form may be used after the bill is passed to opt out of automatic enrollment after the receipt of any future vaccinations.", "opengraph": {"locale": "en_US", "type": "article", "title": "Attention New Jersey Residents: Automation of Existing Vaccine Database in the Works - ICAN - Informed Consent Action Network", "description": "An impending New Jersey law plans to automatically add everyone into an electronic vaccine database & tracking system. Here's how to opt out.", "url": "https://icandecide.org/press-release/attention-new-jersey-residents-automation-of-existing-vaccine-database-in-the-works/", "site_name": "ICAN - Informed Consent Action Network", "article:modified_time": "2023-03-03T18:23:58+00:00", "image": "https://icandecide.org/wp-content/uploads/2023/03/LU_180_THUMB.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pub.njleg.state.nj.us/Bills/2022/S3500/3240_R1.PDF", "https://nj.gov/health/cd/documents/imm_requirements/njiis_mandate_faq.pdf", "https://icandecide.org/wp-content/uploads/2023/01/23-00027-responsive-records.pdf", "https://www.state.nj.us/health/forms/imm-47.pdf", "https://www.state.nj.us/health/forms/imm-47.pdf"], "authors": [], "publish_date": "March 3, 2023"}