{"result_id": "162033", "URL": "https://icandecide.org/press-release/pfizers-own-informed-consent-documents-undermine-fda-and-cdcs-cries-of-safe-and-effective/", "timestamp": "2023-04-25 15:34:10 CEST+0200", "meta": {"description": "Pfizer’s own informed consent documents, recently obtained by ICAN, show it discloses potential concerns, including myocarditis, original antigenic sin, and birth defects, while the FDA & CDC whitewash these concerns to declare these products are safe and effective.", "lang": "en", "keywords": "", "favicon": "https://icandecide.org/wp-content/uploads/2022/10/cropped-favicon-32x32.png", "canonical": "https://icandecide.org/press-release/pfizers-own-informed-consent-documents-undermine-fda-and-cdcs-cries-of-safe-and-effective/", "encoding": "UTF-8"}, "image": null, "domain": "icandecide.org", "title": "Pfizer’s Own Informed Consent Documents Undermine FDA and CDC’s Cries of “Safe and Effective”", "cleaned_text": "Pfizer’s own informed consent documents, recently obtained by ICAN, show it discloses potential concerns, including myocarditis, original antigenic sin, and birth defects, while the FDA & CDC whitewash these concerns to declare these products are safe and effective.\n\nICAN has now obtained the materials used by the Cincinnati’s Children’s Hospital in conducting its studies of the Pfizer booster vaccine, including in children. The documents prepared in consultation with Pfizer tell us a lot about how Pfizer understands the risks of its products.\n\nPfizer is clearly worried about the risks of myocarditis (heart inflammation) in kids. Pfizer’s own informed consent documents reveal that the risk of myocarditis may be as high as 1 in 1,000 (see page 4).\n\nBut the FDA and CDC blithely ignored this risk in approving the Pfizer mRNA shot in kids. Only after rushing this product through the approval process did the CDC begrudgingly admit that “Myocarditis and pericarditis have rarely been reported, especially in adolescents and young adult males within several days after COVID-19 vaccination.”\n\nPfizer is also aware of the possibility of original antigenic sin and pathogenic priming (unwanted immune responses that leave one worse off in response to a virus than if one had done nothing). Pfizer warns parents of clinical trial participants that “it cannot yet be ruled out that the study vaccine could make a later COVID-19 illness more severe” (emphasis added). The FDA and CDC go to great lengths to hide that information while proclaiming “safe and effective” over and over again like a mantra.\n\nPfizer appears very worried about the potential of the teratogenesis (harm to a developing fetus) and even possibly mutagenesis (harm to DNA). So even though this is a trial in children, Pfizer disclosed to the parents of these children that “the effects of the COVID-19 vaccine on sperm, a pregnancy, a fetus, or a nursing child are not known.”\n\nBut then Pfizer goes even further to state that:\n• “If your daughter is pregnant, planning to become pregnant or is breast feeding a baby, she cannot be in the study as there may be risks to the unborn baby or nursing baby.Nobody knows what these risks are right now.”\n• “If your daughter becomes pregnant, she will have to leave the study.”\n• “If your child is a boy, and he thinks he may have gotten a girl pregnant, he or you must tell your child’s study doctor immediately. The study doctor may ask for information about the pregnancy and the birth of the baby. The study doctor may share this information with others who are working on this study.”\n• “If your son is taking part in this study, he is not allowed to donate sperm for at least 28 days after his last vaccination.”\n\nLet’s just pause to acknowledge just how deeply unsettling this language is. But it just goes to show that Pfizer wanted to make sure that they had no data at all on pregnancy outcomes.\n\nGiven that, the CDC’s recommendation to pregnant women to get vaccinated is scientifically unsound to say the least.\n\n“Accumulating data provide evidence of both the safety and effectiveness of COVID-19 vaccination in pregnancy.” – CDC\n\n“Available data on COMIRNATY administered to pregnant women are insufficient to inform vaccine-associated risks in pregnancy.” – BioNTech/Pfizer\n\nThe FDA and CDC have a job to do – evaluate the evidence without bias to keep the public safe. Instead, the FDA and CDC have turned themselves into a marketing department on behalf of the pharmaceutical industry. The American people deserve better than this.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer’s Own Informed Consent Documents Undermine FDA and CDC’s Cries of “Safe and Effective” - ICAN - Informed Consent Action Network", "description": "Pfizer’s own informed consent documents, recently obtained by ICAN, show it discloses potential concerns, including myocarditis, original antigenic sin, and birth defects, while the FDA & CDC whitewash these concerns to declare these products are safe and effective.", "url": "https://icandecide.org/press-release/pfizers-own-informed-consent-documents-undermine-fda-and-cdcs-cries-of-safe-and-effective/", "site_name": "ICAN - Informed Consent Action Network", "article:modified_time": "2023-03-22T23:31:10+00:00", "image": "https://icandecide.org/wp-content/uploads/2022/03/LU115_THUMB.jpg", "image:width": "1", "image:height": "1", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.icandecide.org/wp-content/uploads/2022/02/Substudy-B-Informed-Consent-Form-002.pdf", "https://www.icandecide.org/wp-content/uploads/2022/02/Substudy-C.pdf", "https://www.icandecide.org/wp-content/uploads/2022/02/Substudy-B-Informed-Consent-Form-002.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html"], "authors": [], "publish_date": "March 22, 2022"}