{"result_id": "162013", "URL": "https://staging.icandecide.org/article/covid-19-vaccine-clinical-trials/", "timestamp": "2023-04-25 15:33:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://staging.icandecide.org/wp-content/uploads/2022/10/cropped-favicon-32x32.png", "canonical": "https://staging.icandecide.org/article/covid-19-vaccine-clinical-trials/", "encoding": "UTF-8"}, "image": null, "domain": "staging.icandecide.org", "title": "COVID-19 Vaccine Clinical Trials", "cleaned_text": "ICAN FILES NUMEROUS CITIZEN PETITIONS TO THE FDA REGARDING THE SAFETY AND EFFICACY OF THE COVID-19 VACCINES\n\nJUNE 2021 UPDATE: ICAN’s most recently filed Citizen Petition to the FDA is, perhaps, the most important one filed to date (scroll down to see previously submitted petitions). Approaching what appears to be the imminent licensure of Pfizer’s COVID-19 vaccine, ICAN’s legal team submitted a Citizen Petition demanding essential and specific data be required by the FDA before it licenses a vaccine for COVID-19. These requested data are vital to ensuring both safety and efficacy of a vaccine before it is approved and then, in all likelihood, widely mandated.\n\nDespite valid safety concerns and concerns about the durability of immunity from the COVID-19 vaccines, these vaccines have been and likely will continue to be mandated indiscriminately for groups that, for different reasons, have essentially zero or close to zero risk of serious complications from COVID-19. To date, multiple private and public employers have mandated their employees to receive a COVID-19 vaccine under threat of termination. Additionally, numerous public and private universities have mandated their students to receive the vaccination as a condition of enrollment (some of which are conditioned based on full approval by the FDA). These mandates are one size fits all and fail to take into account any critical information about the vaccine recipients age, comorbidities, risk of serious disease or death from COVID-19, and previous infection. The mandates will likely spread farther and wider once a COVID-19 vaccine is approved.\n\nBecause of the compelling need to ensure the safety and efficacy of any COVID-19 vaccine approved by the FDA, including whether or not risks do not outweigh benefits, particularly in certain age categories, and in the face of such indiscriminate mandates, ICAN has requested that the FDA require that the following data be submitted to the FDA for review before approving any vaccine for COVID-19:\n• Documentation of adverse events and reactions for at leasttwenty-four months for adults, thirty-six months for children and sixty months for infants and toddlers, or such longer duration as appropriate, and in no event ending prior to the subject reaching eight years of age;\n• Data demonstrating that safety risks do not outweigh potential benefits for any age for which the vaccine is approved;\n• Data reflecting that the vaccine does not cause DNA integration and germline transmission;\n• Data on the safety and efficacy of the vaccine in individuals who currently have or have had a SARS-CoV-2 infection;\n• Results of reproductive testing including proper immunological studies looking at potential reactivity of the vaccinated against the Syncytin 1 and 2 proteins;\n• PCR tests used to qualify an event of COVID-19 for a trials’ endpoint use a maximum of 28 amplification cycles; and\n• Accurate data reflecting actual risk reduction and number needed to vaccinate to prevent one case of COVID-19.\n\nICAN requests your support of this petition here. Please visit the FDA docket and click on the blue “Comment” button to submit supportive data or statements.\n\nNow is the time to take action and voice your demands that the FDA do its job and put the safety of the people ahead of any other interests. If too many remain silent, full approval of these novel vaccines will be imminent.\n\nMay 2020 – ICAN files a formal petition demanding the FDA include a placebo control group in all COVID-19 vaccine clinical trials and the FDA thereafter adopted this requirement.\n\nAs of May 22, 2020, there was one Phase II/III clinical trial a potential COVID-19 vaccine but the control group for this trial was not receiving a placebo – rather it was receiving a meningococcal vaccine!\n\nICAN therefore filed a forceful petition demanding that the FDA mandate that all clinical trials of COVID-19 vaccines use a placebo control.\n\nNine days later, on June 30, 2020, the FDA changed course and issued emergency guidance to industry that all COVID-19 clinical trials must use a placebo control. The FDA also required that, as requested by ICAN, the size of the placebo group must at least match the size of the vaccine group. The result has been that the Phase II/III clinical trials for COVID-19 vaccines approved by the FDA since June 30, 2020 at least began with a placebo control group.\n\nJuly 2020 – ICAN files a second petition demanding that the vaccine clinical trials track all adverse events for the duration of the trial.\n\nOn July 20, 2020, ICAN filed a forceful amended petition with the FDA thanking it for requiring a placebo control group but demanding that it also require that these clinical trials track all adverse events during the entire duration of the trial. It also demanded that adverse events be tracked for at least 1 year for adults, 3 years for children, and 6 years for toddlers and infants.\n\nOctober 2020 – ICAN files another petition regarding the viral vector vaccine made by Janssen/Johnson & Johnson.\n\nOn October 19, 2020, ICAN submitted a Petition specifically seeking actions related to the Johnson & Johnson/Janssen vaccine. This Petition was submitted more than 4 months before the FDA granted the manufacturer emergency use authorization, allowing ample time for compliance.\n\nThe Petition requested similar safety requirements that ICAN sought in prior petitions but added two specific requirements for the Johnson & Johnson vaccine due to the fact that it is a viral vector vaccine: (1) germline transmission tests to be conducted for male participants; and (2) HIV incidence to be “monitored at the end of the study and for an appropriate follow-up period.”\n\nOn February 27, 2021, the same day the FDA granted emergency use authorization for this vaccine, the FDA replied to ICAN and denied its requests. Not satisfied with the FDA’s explanations for the denial, ICAN submitted a Petition for Reconsideration on March 23, 2021 which asked that the FDA again review the concerns in the Petition and ICAN’s additional arguments.\n\nNovember 2020 – ICAN files a petition demanding valid endpoints for determining whether a COVID-19 vaccine is effective.\n\nOn November 6, 2020, ICAN filed a petition demanding that the FDA require valid endpoints for determining efficacy in the COVID-19 vaccine trials currently being run by Pfizer, Moderna, AstraZeneca, and Johnson & Johnson. ICAN’s demands include that the vaccine be shown to prevent serious cases of COVID-19 (not just mild cases) and that it can stop transmission of COVID-19.\n\nAlarming deficiencies in the vaccine clinical trials regarding efficacy endpoints and the use of unreliable PCR testing led ICAN to direct its attorneys to file a petition demanding that all four Phase III COVID-19 vaccine trials amend their efficacy endpoints. ICAN demanded, among other things, that the trials test and determine (1) whether these vaccines will prevent severe cases of COVID-19; and (2) whether they will stop the spread of the virus. ICAN further demanded improvements in the PCR testing protocol and T-cell testing pre-and-post vaccination.\n\nRecognizing the critical importance that these changes be made in a timely manner, on November 11, 2020, ICAN’s attorneys filed a Petition for a Stay of Action with the FDA which asks that the agency stay, or pause, any action related to the trials until the requested actions in the efficacy petition are implemented.\n\nFDA responds and ICAN submits replies to the FDA’s deficient responses to its COVID-19 petitions calling for more stringent safety and efficacy requirements.\n\nDespite the importance of some of ICAN’s demands to the FDA, the agency did not adopt those demands and ICAN pushed back.\n\nThirteen days after ICAN’s initial petition was filed demanding placebo-controlled trials, the FDA released a guidance document providing that the trials should include a placebo-controlled group. ICAN then requested that the FDA confirm that the placebo arm will be maintained through the conclusion of the trial in order to maintain the integrity of the trial and the validity of the safety data produced by the trial. ICAN also requested more comprehensive tracking of adverse events, larger sample sizes within the trials (especially for the pediatric population), and testing of T-cells pre- and post-vaccination. The FDA denied these requests and ICAN followed-up to let the agency know this is unacceptable given the novel nature of these mRNA vaccines and the current unknowns related to safety.\n\nThe FDA also denied ICAN’s demands with regards to efficacy and ICAN did not accept the FDA’s refusal to require the vaccine manufacturers to determine whether the vaccine prevents infection and transmission as a primary endpoint.\n\nThese alarming deficiencies that still exist in the trials are what led ICAN to direct its attorneys to submit replies to the FDA’s responses and to continue to follow through with demands that will benefit the public. Below is a listing of the Citizen Petitions, FDA’s responses, and ICAN replies:\n\nICAN is awaiting responses to additional petitions and will not stop applying the pressure until the FDA adequately does its job and takes a stand for the people of this country that are being asked, and some mandated, to roll up their sleeves.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccine Clinical Trials - ICAN - Informed Consent Action Network", "description": "ICAN FILES NUMEROUS CITIZEN PETITIONS TO THE FDA REGARDING THE SAFETY AND EFFICACY OF THE COVID-19 VACCINES JUNE 2021 UPDATE: ICAN’s most recently filed Citizen Petition to the FDA is, perhaps, the most important one filed to date (scroll down to see previously submitted petitions).  Approaching what appears to be the imminent licensure of Pfizer’s COVID-19 vaccine, ICAN’s […]", "url": "https://staging.icandecide.org/article/covid-19-vaccine-clinical-trials/", "site_name": "ICAN - Informed Consent Action Network", "article:modified_time": "2022-10-17T21:40:03+00:00", "image": "https://staging.icandecide.org/wp-content/uploads/2021/06/screenshot-citizen-petition-from-siri-glimstad.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.regulations.gov/document/FDA-2021-P-0529-0001", "https://www.regulations.gov/document/FDA-2021-P-0529-0001", "https://www.regulations.gov/document/FDA-2021-P-0529-0001", "https://beta.regulations.gov/document/FDA-2020-P-1601-0001", "https://www.fda.gov/regulatory-information/search-fda-guidance-documents/fda-guidance-conduct-clinical-trials-medical-products-during-covid-19-public-health-emergency", "https://beta.regulations.gov/document/FDA-2020-P-1601-0028", "https://www.icandecide.org/wp-content/uploads/2021/03/Final-cover-letter-and-citizen-petition-10_19_2020.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/FDA-Response-FDA-2020-P-2096.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/2021_03_23-Petition-for-Reconsideration.pdf", "https://www.icandecide.org/wp-content/uploads/2020/11/2020-11-06-Final-Cover-Letter-and-Petition.pdf", "https://www.icandecide.org/wp-content/uploads/2020/11/Stay-of-Efficacy-Petition_FINAL.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/Cover-letter-and-Citizen-Petition-and-Stay-of-Action_2020_06_17.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/FDA-Response-FDA-2020-P-1601.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/1601_Cover-letter-and-ICAN-reply-to-FDA-denial_03_03_2021.pdf", "https://www.icandecide.org/wp-content/uploads/2021/05/Citizen-Petition-Phase-III-Moderna-without-docket-number.pdf", "https://www.icandecide.org/wp-content/uploads/2021/05/FDA-Response-FDA-2020-P-1769.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/Final-cover-letter-and-citizen-petition-Pfizer_10_16_2020.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/FDA-Response-FDA-2020-P-1770.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/1770_Cover-letter-and-ICAN-reply-to-FDA-denial_03_03_2021.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/Final-cover-letter-and-citizen-petition-10_19_2020.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/FDA-Response-FDA-2020-P-2096.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/2021_03_23-Petition-for-Reconsideration.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/2020-11-06-Final-Cover-Letter-and-Petition.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/FDA-Response-FDA-2020-P-2180.pdf", "https://www.icandecide.org/wp-content/uploads/2021/03/2180_Cover-letter-and-ICAN-Reply-to-FDA-Denial_03_03_2021.pdf", "https://www.regulations.gov/document/FDA-2021-P-0529-0001", "https://www.regulations.gov/document/FDA-2021-P-0529-0001"], "authors": [], "publish_date": "June 3, 2021"}