{"result_id": "162002", "URL": "https://icandecide.org/press-release/icans-attorneys-uncover-early-pfizer-vaccine-study-revealing-alarming-systemic-reactions-in-rats/", "timestamp": "2023-04-25 15:33:39 CEST+0200", "meta": {"description": "ICAN’s attorneys reviewed a startling report from June 2020 that Pfizer submitted to the FDA concerning its mRNA COVID-19 vaccine.", "lang": "en", "keywords": "", "favicon": "https://icandecide.org/wp-content/uploads/2022/10/cropped-favicon-32x32.png", "canonical": "https://icandecide.org/press-release/icans-attorneys-uncover-early-pfizer-vaccine-study-revealing-alarming-systemic-reactions-in-rats/", "encoding": "UTF-8"}, "image": null, "domain": "icandecide.org", "title": "ICAN’s Attorneys Uncover Early Pfizer Vaccine Study Revealing Alarming Systemic Reactions in Rats", "cleaned_text": "This month, ICAN’s attorneys reviewed a startling 2,237-page report from June 2020 (amended in September 2020) that Pfizer submitted to the FDA concerning its mRNA COVID-19 vaccine.\n\nThe study looked at the toxicity of Pfizer’s vaccine using four different doses (including the one eventually authorized for emergency use, BNT162b2) and involved 255 rats (219 received vaccine, 36 received control) for a test period of 10 to 17 days with “3 additional weeks for the animals scheduled for the recovery period.”\n\nOne would imagine that, since the vaccine was authorized, approved, and injected into millions, the rats did not experience any negative health effects. Sadly, that is not the case.\n\nWhile Pfizer claims in the report that the rats tolerated the vaccines “without evidence of systemic toxicity,” its detailed findings indicate that was anything but the truth, as the following issues in major organs groups were observed:\n\nAll of these issues clearly show effects beyond the injection site. Of particular concern is the increased fibrinogen concentration; fibrinogen is made in your liver and helps your blood clot. Increased fibrinogen is associated with blood clotting, heart disease, blood vessel dysfunction, and stroke. These issues were also seen with the dose level that was eventually licensed.\n\nWith regard to deaths, the report indicated that “[n]o test item-related deaths were noted for any treatment” and that “no premature deaths occurred and no premature sacrifice was necessary.” That seems reassuring, right? It only took slightly closer reading to discover, however, that two rats did die during the study (about 1% of those injected with vaccine), but, predictably, the Pfizer paid researchers, despite being unable to determine a clear cause of death, simply assumed that the deaths were caused by stress from blood draws and therefore were not caused by the vaccines (despite the fact that one of the dead rats had an enlarged spleen, enlarged adrenal glands, and an enlarged iliac lymph node)!\n\nGiven the short six-week study duration, it’s not possible for the researchers to have ascertained the long-term effects of the vaccines. Nevertheless, throughout the report, they conclude that all adverse effects experienced by the rats were “reversed” and “resolved” by the end of the recovery period.\n\nYou can read the entire report and the rest of the recent production here.", "opengraph": {"locale": "en_US", "type": "article", "title": "ICAN’s Attorneys Uncover Early Pfizer Vaccine Study Revealing Alarming Systemic Reactions in Rats - ICAN - Informed Consent Action Network", "description": "ICAN’s attorneys reviewed a startling report from June 2020 that Pfizer submitted to the FDA concerning its mRNA COVID-19 vaccine.", "url": "https://icandecide.org/press-release/icans-attorneys-uncover-early-pfizer-vaccine-study-revealing-alarming-systemic-reactions-in-rats/", "site_name": "ICAN - Informed Consent Action Network", "article:modified_time": "2023-03-09T16:07:12+00:00", "image": "https://icandecide.org/wp-content/uploads/2023/03/LU_184_THUMB.jpg", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://icandecide.org/wp-content/uploads/2023/03/125742_S1_M4_4.2.3.2-38166.pdf", "https://my.clevelandclinic.org/health/diagnostics/22791-fibrinogen-test", "https://icandecide.org/wp-content/uploads/2023/03/125742_S1_M4_4.2.3.2-38166.pdf", "https://icandecide.org/article/pfizers-documents-public-health-and-medical-professionals-for-transparency-documents-3-23/"], "authors": [], "publish_date": "March 6, 2023"}