{"result_id": "163004", "URL": "https://www.ihealthtube.com/video/warning-years-flu-vaccine", "timestamp": "2023-04-25 15:34:39 CEST+0200", "meta": {"description": "Get more with our free email newsletter! http://www.ihealthtube.com/content/newsletter Watch this before deciding on a flu shot for this year. Will it help protect you? What are the odds? Find out what one study is suggesting. Also learn about things you might be able to do to protect against cognition issues and what you can do to keep your blood pressure in check, all naturally!", "lang": "en", "keywords": "", "favicon": "https://www.ihealthtube.com/sites/default/files/ihealthtube_logo_1.png", "canonical": "https://www.ihealthtube.com/video/warning-years-flu-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.ihealthtube.com", "title": "Warning for This Year's Flu Vaccine!", "cleaned_text": "Hi and welcome to this week’s look at headlines in natural health on iHealthTube.com…\n\nFlu season is quickly approaching and there is a new warning again this week about the effectiveness of this year’s flu vaccine.\n\nA study out of Texas uses a process to gauge the effectiveness of the coming vaccine and the results show it will be only about 19 percent effective against H3N2… the type of influenza A that infected most people in the U.S. each of the past two years. The flu vaccine was 20 percent effective in 2016… data from last season is still being compiled but it’s estimated to be around 19 percent.\n\nExperts say the reduced efficacy is due to viral mutations related to vaccine production in chicken eggs.\n\nThe search for better treatment and cures for Alzheimer’s continues… but new research is showing that exercise can certainly be a benefit.\n\nThe research was done in Massachusetts on mice with Alzheimer’s. It showed that inflammation can block beneficial benefits of neurogenesis… which is the production of new neurons which memories are encoded. But physical exercise can sort of ‘clean up’ that environment and allow new nerve cells to survive and help improve cognition. The lead author said there isn’t means for safely achieving the same effects in humans… the research has determined the protein and gene targets for developing ways to do so in the future.\n\nFinally… simple lifestyle changes can make a big difference for people with high blood pressure.\n\nA study that was recently published looked at 129 overweight or obese mean dan women between 40 and 80 years of age. All had high blood pressure but were not taking medications for it. They were divided randomly into three groups of 16 week interventions. the first changed their diet to the DASH plan plus three times weekly supervised exercise. The second group changed their diet only and the third group did not change diet or exercise habits.\n\nThe diet and exercise group lost an average of 19 pounds and 16 and 10 systolic and diastolic blood pressure points respectively. The diet only group lost 11 and 8 points.\n\nAt the end of the study… just 15 percent of those who changed diet and exercise habits needed blood pressure medication based on current guidelines. 50 percent of those who made no change meet the criteria for blood pressure medication.\n\nThat’s what’s making headlines in natural health this week… make sure to go to iHealthTube.com and sign up for our free email newsletter so you stay connected to the latest in natural health!", "opengraph": {"site_name": "iHealthTube.com", "type": "article", "url": "https://www.ihealthtube.com/video/warning-years-flu-vaccine", "title": "Warning for This Year's Flu Vaccine!", "description": "Get more with our free email newsletter! http://www.ihealthtube.com/content/newsletter Watch this before deciding on a flu shot for this year. Will it help protect you? What are the odds? Find out what one study is suggesting. Also learn about things you might be able to do to protect against cognition issues and what you can do to keep your blood pressure in check, all naturally!", "updated_time": "2023-04-16T16:00:01-05:00", "image:url": "https://i.ytimg.com/vi/vECYHDRwgXY/hqdefault.jpg", "image:secure_url": "https://i.ytimg.com/vi/vECYHDRwgXY/hqdefault.jpg", "article:published_time": "2018-09-12T02:41:53-05:00", "article:modified_time": "2023-04-16T16:00:01-05:00"}, "tags": ["brain", "medication", "nutrition", "diet", "flu", "blood pressure", "weight", "vaccine", "exercise", "prescriptions", "alzheimer's", "H3N2", "alzheimers", "flu shot", "dash"], "tweets": [], "movies": [], "links": ["http://ihealthtube.com"], "authors": [], "publish_date": "2018-09-12T02:41:53-05:00"}