{"result_id": "163041", "URL": "https://www.ihealthtube.com/video/why-flu-shot-doesnt-work-many", "timestamp": "2023-04-25 15:34:55 CEST+0200", "meta": {"description": "Support us for as little as $2 at http://www.patreon.com/ihealthtube You can find our free email newsletter at http://www.ihealthtube.com/content/newsletter Why is one strain of the flu vaccine not very effective? Researchers think they have a big reason. Find out what that is. Also learn about the benefits of exercising in a group versus by yourself!", "lang": "en", "keywords": "", "favicon": "https://www.ihealthtube.com/sites/default/files/ihealthtube_logo_1.png", "canonical": "https://www.ihealthtube.com/video/why-flu-shot-doesnt-work-many", "encoding": "utf-8"}, "image": null, "domain": "www.ihealthtube.com", "title": "Why The Flu Shot Doesn't Work for Many", "cleaned_text": "Hi and welcome to this week’s look at headlines in natural health on iHealthTube.com.\n\nThe flu shot campaign is in full force this time of year… but just how effective are they? Well… for certain strains, the vaccine is less effective and now researchers know one reason why.\n\nA study out of California looked at the common practice of growing influenza vaccine components in chicken eggs. The process is supposed to allow the virus to replicate in the eggs, then the purified virus from the eggs would be used in vaccines. However the study showed that several strains of the virus actually mutate when grown in chicken eggs… making them less effective in humans. The H3N2 strain was one used in the study… it’s become more prevalent each season and has been included in the vaccines… but recent vaccines have proven only 33 percent effective against that particular strain.\n\nReducing calories has been linked to a number of health benefits… now researchers from Brazil are finding even more beneficial effects…\n\nThe study looked at two groups of mice over six months… one group was allowed to eat as much as they wanted at all times… the other was fed a diet with 60 percent of the calories of the first group. After the six months, the calorie restricted group had a 40 percent lower body mass. But the group also found that the calorie restricted group adapted to grow more fur and have three times more blood vessels in their skin. Both changes help keep the body warm and compensated for the lack of fat that would typically do that.\n\nBy the way… the group that ate what they wanted became obese. The author said the goal of the study is to look at how calorie restriction affects different tissues and to hopefully use the information to target diseases associated with weight gain.\n\nWe all know that exercise is a big part of a healthy life… but new research is showing you might now want to do it alone!\n\nThe study out of Maine looked at 69 medical students who selected a 12 week exercise program either with a group or as individuals… every four weeks the participants completed a survey. At the end of 12 weeks… those who participated in group exercise reported improvements in mental, physical and emotional quality of life. Those who worked out alone, exercised twice as long… but saw similar benefit in mental quality of life… but no changes in either physical or emotional quality.\n\nThat’s what’s making headlines in natural health this week… make sure to stay connected by going to ihealthtube and sign up for our free email newsletter!", "opengraph": {"site_name": "iHealthTube.com", "type": "article", "url": "https://www.ihealthtube.com/video/why-flu-shot-doesnt-work-many", "title": "Why The Flu Shot Doesn't Work for Many", "description": "Support us for as little as $2 at http://www.patreon.com/ihealthtube You can find our free email newsletter at http://www.ihealthtube.com/content/newsletter Why is one strain of the flu vaccine not very effective? Researchers think they have a big reason. Find out what that is. Also learn about the benefits of exercising in a group versus by yourself!", "updated_time": "2023-04-05T00:00:01-05:00", "image:url": "https://i.ytimg.com/vi/tXWI3I1Z62U/hqdefault.jpg", "image:secure_url": "https://i.ytimg.com/vi/tXWI3I1Z62U/hqdefault.jpg", "article:published_time": "2017-11-01T04:39:11-05:00", "article:modified_time": "2023-04-05T00:00:01-05:00"}, "tags": ["flu", "weight", "vaccine", "exercise", "fat", "H3N2", "calories", "hair", "skin", "flu shot", "mutate"], "tweets": [], "movies": [], "links": ["http://ihealthtube.com"], "authors": [], "publish_date": "2017-11-01T04:39:11-05:00"}