{"result_id": "163025", "URL": "https://www.ihealthtube.com/video/vaccines-dont-address-root-cause-problem", "timestamp": "2023-04-25 15:34:48 CEST+0200", "meta": {"description": "Dr. Bob DeMaria discusses vaccines and their effectiveness. He also talks about why he says vaccines don't get to the root cause of the problem. Fine out what he thinks about the possible connection between vaccines and brain and other neurological issues. He also gives tips on what you should do before getting your child vaccinated if you choose to go down that road.", "lang": "en", "keywords": "", "favicon": "https://www.ihealthtube.com/sites/default/files/ihealthtube_logo_1.png", "canonical": "https://www.ihealthtube.com/video/vaccines-dont-address-root-cause-problem", "encoding": "utf-8"}, "image": null, "domain": "www.ihealthtube.com", "title": "Vaccines Don't Address Root Cause of Problem!", "cleaned_text": "Interviewer: Doctor Bob, in a previous discussion we talked about one of the vaccines, one of the many that kids get. There seems to be many more these days. Are those safe? Do you recommend kids get those vaccines? We always hear about the toxins that are in there and then going right into your body.\n\nDr. Bob DeMaria: It's very interesting because vaccines I know have been really promoted. 1967 is when they started doing MMRs, measles, mumps, and rubella. The mumps vaccine impacts the parotid gland which has, I know, a lot to do with digestion and with gluten sensitivity today. I know the numbers change frequently but to the best of my last knowledge about 36 vaccines, different kinds, are given to a person within the first two to three years of life. In the human body when we have vaccines or when we have antibodies that are made, it is made in our body to fight an organism and it's permanent. When they vaccinate a human being today they use particles and the real issue is what are they using as the base part of this whole; agar and all of this growing substance which is mercury and egg whites and all of that, and aluminum that can be quite toxic to the system. Then they do the booster. The booster is the one that everybody should be raising a flag. Because, see, it's not permanent. I've read different studies on this to where it's not permanent and it's not as effective as the natural immunity that's going on inside of a person's body.\n\nRecently I was doing some cooking and I actually cut my own thumb. I didn't want to but I went to the emergency room. I had to get four stitches. They were going to give me a tetanus shot, which I understand, they're thinking the cut with the knife. I just said kindly no, I just don't want to have that. I've had other patients tell me that they have also gone to the emergency room not feeling good and they wanted to give the tetanus shot for the immune system. Then we have the flu vaccine, the shingles vaccine; we literally have vaccines for everything today. I want you to know that vaccines do not get to the root cause of the problem. Most people's immune systems in America today are quite low and you throw that vaccine to them, there's this massive reaction that's going on. From what I understand right now in the United States, you can sign off from getting vaccines for our constitution, for religious purposes. We have that protection at least at this point. What also concerns me is I have normal children, not having any brain dysfunction at all from any shots one way or the other. There has to be something on with autism and some of these other challenges and other neurological problems. I don't know if when they put that vaccine into the person how much it really is doing; something. I don't believe that we've figured it out enough to know exactly what's going on, but I know that the innate ability of the body is being compromised. We don't promote vaccines but I can tell you what we do promote. We promote staying away from sugar because, see, sugar compromises the nervous system.\n\nWhat's happening in our society today is we want everybody to think that if you take a pill or a potion you can do anything you want. It's just like this vaccine for young girls with the genital issue that they're dealing with and all of the side effects and complications from it. I think it's ludicrous. First, they shouldn't be having intimacy out of wedlock anyway so that accentuates the problem of having that virus. If you really think about what I'm sharing with you, also, we're talking about viruses mostly. I had this herpes simplex on my lip. I have this right now because I was in the sun too long. I was out just too long. I didn't have enough calcium in my body. Individuals that have shingles, for example, usually elderly people, lack of calcium, lack of vitamin B6 in their body. If you stay healthy, and you say how do you stay healthy Dr. Bob? You have to minimize sugar, dairy, and wheat products. Your own immune system is going to do exactly what it needs to do to stay up there.\n\nIf you're a parent right now and if your kids do go through a chicken pox or a measle, more than likely they're not going to die, because the whole planet would have been gone by now anyways. I personally would not do that. Now, if you do, you're really forced to go on, whatever is happening in your area, family pressure, go as long as you can, but if you're going to take that child for vaccination make sure they have some calcium citrate or lactate in their body. We've talked about programs before. Kids tend to get fevers when they're teething and they're growing. Kids are very vulnerable those first three years of life because they don't have enough calcium. You want to give them calcium. They can chew that calcium before they would go in and get the vaccination. Now we use some neonatal glandular products in our office. I would also give them a thymus-based product to help their own immune system. I would make sure they're doing no sugar at all prior to that. We also have the ability to give them liquid zinc. I'd give them some zinc, calcium citrate or lactate and a neonatal glandular thymus tissue to help their own immune system just in case you go through this process. I almost have to believe that if anybody is going to get the vaccination their chances of doing what I just said are slim to none but you might be able to sneak it into that child anyways. No adult should ever get that vaccination.", "opengraph": {"site_name": "iHealthTube.com", "type": "article", "url": "https://www.ihealthtube.com/video/vaccines-dont-address-root-cause-problem", "title": "Vaccines Don't Address Root Cause of Problem!", "description": "Dr. Bob DeMaria discusses vaccines and their effectiveness. He also talks about why he says vaccines don't get to the root cause of the problem. Fine out what he thinks about the possible connection between vaccines and brain and other neurological issues. He also gives tips on what you should do before getting your child vaccinated if you choose to go down that road.", "updated_time": "2023-02-07T04:00:01-06:00", "image:url": "https://i.ytimg.com/vi/dvFsBxMrF4E/hqdefault.jpg", "image:secure_url": "https://i.ytimg.com/vi/dvFsBxMrF4E/hqdefault.jpg", "article:published_time": "2016-02-10T07:30:00-06:00", "article:modified_time": "2023-02-07T04:00:01-06:00"}, "tags": ["autism", "immune system", "zinc", "mercury", "calcium", "immune health", "digestion", "sugar", "gluten", "virus", "vaccines", "toxic", "toxins", "MMR", "flu shot", "aluminum"], "tweets": [], "movies": [], "links": ["https://www.ihealthtube.com/video/ingredient-could-be-cause-severe-vaccine-reactions", "https://www.ihealthtube.com/video/best-explanation-vaccineautism-connection-ive-ever-heard", "https://www.ihealthtube.com/video/you-need-know-real-problem-hpv-vaccine"], "authors": [], "publish_date": "2016-02-10T07:30:00-06:00"}