{"result_id": "163034", "URL": "https://www.ihealthtube.com/video/vaccines-could-be-causing-these-serious-conditions", "timestamp": "2023-04-25 15:34:52 CEST+0200", "meta": {"description": "Could vaccines be one of the causes behind two increasingly common and deadly diseases? Robert Scott Bell discusses the potential connection and what vaccines actually could be doing that might lead to serious problems. Find out just how vaccines could be causing these serious conditions!", "lang": "en", "keywords": "", "favicon": "https://www.ihealthtube.com/sites/default/files/ihealthtube_logo_1.png", "canonical": "https://www.ihealthtube.com/video/vaccines-could-be-causing-these-serious-conditions", "encoding": "utf-8"}, "image": null, "domain": "www.ihealthtube.com", "title": "Vaccines Could be Causing These Serious Conditions!", "cleaned_text": "Interviewer: You talked about, I saw recently, or maybe a little bit awhile ago, about vaccine induced cancers and heart disease. Can you explain what those are?\n\nRobert Scott Bell: Well, when you do vaccinations, you elicit very powerful immune cascades. Even in those that are weakened to some degree, there will be inflammatory responses in the body. And in young people, it's interesting because there was some controversy. I've read on my show, on the Robert Scott Bell Show, I did a story about a Minnesota girl, young girl who was very healthy, who got vaccinated for the flu, ended up in the hospital and then she died. Now this was a shocker that they reported this because they thought, \"Oh, this could be a case of someone who had the flu who wasn't vaccinated and we could report that. Oh my gosh, get your shot.\" The fact is she was vaccinated. And what you have happen are these cytokine storms or cellular storms of inflammation in response to this massive influx that bypasses your real immune system, which we talked about, starts at the skin, the throat, mucous membrane, all of these things, the lymph, before anything ever gets to the bloodstream. And of course, via direct injection they bypass all that.\n\nNow if you're largely healthy or healthy enough, you will respond and react very violently. And this is true of any naturally, if we can say that, acquired influenza, in that a child, a strong, healthy one, certain strains will elicit very powerful cytokine responses or storms in the body that are very inflammatory. Now, this is a life-surviving, let's say mechanism or adaptation, that you get beyond if, if, if your liver and excretory organs are up to speed because you have a lot of debris from the immune battle dealing with the synthetic introduction or the so-called natural introduction.\n\nAnd in these young people, they don't understand that in the medical world, so they suppress it. And in the process of suppressing the inflammation and the fever, for instance, they actually damage and weaken and impair the excretory pathways out of the body. So they create a scenario where these pathogens and metabolic waste and toxins are circulating and circulating through the body. They can't get out. And so when they give a powerful steroid hormone like prednisone, which is what happened in this girl, and they do this a lot, they actually shut down the immune system altogether and they shut down the liver. And in that way, they killed her, in my opinion. That would be an iatrogenic death, not a flu death. And so this is a big issue.\n\nNow with, obviously, heart attacks, you mentioned, and cancer. These are both inflammatory diseases. One is more of an acute response. And in a heart attack scenario, you could be set up and healthy by in large, you could live to 120, but an accident kills you. It's like you get hit by a bus one day. That's what a heart attack is. In fact, a breaching of an artery or a blockage of an artery, suddenly, oh my gosh, it's a panic, it's an acute response, and yes, you could die from it. But had you not had that blockage, which we talked a little bit about how that starts, you'd never have a problem.\n\nWhereas cancer is much different. It's more insidious and usually takes a lot longer. Although, because we're seeing a generational decline in health, from parent to child. We're seeing cancer in children on the rise, tremendously, in this case. But these inflammatory cytokines, they stick around, there's injured tissue. The tissue is damaged. The tissue itself is toxic. It can't metabolize the waste products of its own metabolism. And then there's an additional burden through vaccination of heavy metals, pesticides. Perhaps, I know there are other sources for pesticides in GMOs and things I want to get to, but in this case, more or less, you see a lot of these antibiotics and other synthetic compounds that are combined in there with these metals. And that creates permanent states of inflammatory conditions. The body is not getting rid of this poison. The cells are not getting rid of these poisons.\n\nAnd so, eventually, there's a rebellion that occurs. We call that cancer. The cells go off into a new state. The DNA tries to survive and live another day. And they look at it as evil, but I look at it as an adaptation for cellular survival. So apoptosis doesn't happen. Cellular death is off. And so these cancer cells grow.\n\nAnd so what we've got to do, again, is reverse that trend by recognizing what did we put in these kids' bodies, what did we put in these adults' bodies? How do we get it out? And let's, by all means, get that stuff out, as much as and as quickly as possible, as safely as possible, while then bringing the minerals that were robbed, robbed from the body by introduction of these toxic poisons and heavy metals. Because the minerals are used to bind out. This is part of the metallothionein process, glutathione production process. All of these minerals are critically necessary, like selenium. They all bind out the bad guys. And they're depleted with every injection, with every drug, with every synthetic exposure. And if you don't know that, you don't know to replenish through supplementation and better dietary choices. That you end up depleting yourself and cancer is a disease of abject toxicity and nutritional deficiency over time or now over generations. And believe me, it's not because kids are living longer than they used to that they're getting more cancer than ever before.", "opengraph": {"site_name": "iHealthTube.com", "type": "article", "url": "https://www.ihealthtube.com/video/vaccines-could-be-causing-these-serious-conditions", "title": "Vaccines Could be Causing These Serious Conditions!", "description": "Could vaccines be one of the causes behind two increasingly common and deadly diseases? Robert Scott Bell discusses the potential connection and what vaccines actually could be doing that might lead to serious problems. Find out just how vaccines could be causing these serious conditions!", "updated_time": "2023-04-12T12:00:01-05:00", "image:url": "https://i.ytimg.com/vi/Pv74w3FIPOc/hqdefault.jpg", "image:secure_url": "https://i.ytimg.com/vi/Pv74w3FIPOc/hqdefault.jpg", "article:published_time": "2016-04-18T06:28:40-05:00", "article:modified_time": "2023-04-12T12:00:01-05:00"}, "tags": ["diet", "heart health", "cancer", "immune health", "inflammation", "vaccines", "heart attack", "pesticides", "immune system", "supplements", "flu shot", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.ihealthtube.com/video/are-vaccines-cause-disturbing-trend", "https://www.ihealthtube.com/video/dont-understand-inflammation-will-help", "https://www.ihealthtube.com/video/best-way-detox-heavy-metals"], "authors": [], "publish_date": "2016-04-18T06:28:40-05:00"}