{"result_id": "164010", "URL": "https://iheartintelligence.com/is-coronavirus-man-made-ex-head-of-mi6-sir-richard-dearlove-says-yes/", "timestamp": "2023-04-25 15:35:06 CEST+0200", "meta": {"description": "Former MI6 chief, Sir Richard Dearlove, claims coronavirus is man-made, citing an 'important' scientific report revealing 'Covid-19 virus is engineered'.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/is-coronavirus-man-made-ex-head-of-mi6-sir-richard-dearlove-says-yes/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Is Coronavirus man-made? Ex-head of MI6 Sir Richard Dearlove says YES", "cleaned_text": "Is Coronavirus man-made? Ex-head of MI6 Sir Richard Dearlove says YES\n\nSir Richard Dearlove, MI6 boss from 1999 until 2004, believes that COVID-19 is man-made, Mail Online reveals.\n\nTo support his theory, Sir Dearlove cited an ‘important’ report from Professor Angus Dalgleish of St George’s Hospital, University of London, and Norwegian virologist Birger Sorensen. According to the report, the novel virus was manufactured in a laboratory.\n\nThe scientists involved in the research claim to have identified ‘inserted sections placed on the Sars-CoV-2 Spike surface’ which the virus uses to attach onto cells. Moreover, they have observed these sections were ‘significantly different from any Sars we have studied’.\n\nIn an interview for The Telegraph’s Planet Normal podcast, Sir Dearlove explained:\n\n“I do not think that this started as an accident. It raises the issue if China ever were to admit responsibility, does it pay reparations? I think it will make every country in the world rethink how it treats its relationship with China.”\n\nIn the report, experts claim that current efforts to find a COVID-19 vaccine would prove unsuccessful as scientists have misunderstood the true properties of the virus.\n\nThe former MI6 chief suggests that the scientists at a laboratory in Wuhan, where COVID-19 was first detected, could have secretly been carrying out experiments on bat coronaviruses. Then, somehow, the virus accidentally escaped through a lapse in biosecurity.\n\nFurthermore, Sir Dearlove claims that the paper had been rewritten several times. He adds that an earlier version apparently claimed coronavirus could accurately be called the ‘Wuhan virus’.\n\nReportedly, an earlier version of the research claimed ‘beyond all reasonable doubt that the Covid-19 virus is engineered’.\n\nAdditionally, a previous investigation by the World Health Organisation (WHO) found that coronavirus jumped from bats to humans at the Wuhan wet market, located near the Institute of Virology. In the market, wild animals are kept in cages and used for meat.\n\nLast month, Gao Fu, director of the Centre for Disease Control and Prevention, admitted no viruses were detected in animal samples. The Chinese official stated:\n\nBy June 5, according to Worldometers, there are 6,726,982 total coronavirus cases worldwide, with 3,269,790 recoveries and 393,616 deaths. In China, where the COVID-19 outbreak spiked, there are 83,027 total cases, with 78,327 recoveries and 4,634 fatalities.", "opengraph": {"locale": "en_US", "type": "article", "title": "Is Coronavirus man-made? Ex-head of MI6 Sir Richard Dearlove says YES", "description": "Former MI6 chief, Sir Richard Dearlove, claims coronavirus is man-made, citing an 'important' scientific report revealing 'Covid-19 virus is engineered'.", "url": "https://iheartintelligence.com/is-coronavirus-man-made-ex-head-of-mi6-sir-richard-dearlove-says-yes/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-06-05T11:40:27+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/06/is-coronavirus-man-made-ex-head-of-mi6-sir-richard-dearlove-says-yes.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["COVID-19 vaccine", "Coronavirus", "Ex-chief of MI6", "Wuhan virus", "Chinese lab", "prove unsuccessful"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-8386235/Coronavirus-man-says-ex-head-MI6-Sir-Richard-Dearlove.html", "https://www.telegraph.co.uk/news/2020/06/03/exclusive-coronavirus-began-accident-disease-escaped-chinese/", "https://www.worldometers.info/coronavirus/"], "authors": ["Kristina Ivanova"], "publish_date": "2020-06-05T11:40:27+00:00"}