{"result_id": "164039", "URL": "https://iheartintelligence.com/wwii-vet-turns-100-on-christmas-and-his-family-is-asking-the-public-to-send-birthday-cards/", "timestamp": "2023-04-25 15:35:35 CEST+0200", "meta": {"description": "You can make his 100th birthday extra special by sending him a card, wishing him a happy birthday, and thanking him for his service.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/wwii-vet-turns-100-on-christmas-and-his-family-is-asking-the-public-to-send-birthday-cards/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "WWII vet turns 100 on Christmas and his family is asking the public to send birthday cards", "cleaned_text": "A WWII veteran is marking his 100th birthday on Christmas.\n• Alvin “Bob” River served in WWII from 1946 to 1948.\n• He is currently living in the Harry S. Truman Memorial Veterans Hospital in Columbia, Missouri.\n• River’s family is now asking people to send him birthday cards to make his milestone extra special.\n\nRiver is a WWII veteran and the first person at his nursing home to receive the COVID vaccine. This week, he is marking his 100th birthday on Christmas and his family is asking the public to make his birthday extra special by sending him cards. According to ABC News, “River was drafted into the Army during WWII and served as a sergeant in Germany from 1946 to 1948.” After the war, he went on a blind date and met the woman who was to become his wife. Betty married River and today, they have a big and beautiful family. The couple raised two children and they now have 3 grandchildren and 3 great-grandchildren (with another on the way).\n\nRiver’s beautiful family plans on surprising him for his 100th birthday.\n\nABC News reported that Beverly River, the veteran’s daughter, spoke about her father, “He’s just one of those really good, genuine people. He’s very generous — really and truly thought of other people more than himself.” For this reason, they decided to try and make River’s 100th birthday extra special. In order to do this, they are asking people to send River birthday cards. “I just wanted it to be special. It’s a big deal … not everyone makes it to 100. I think my dad will get such a kick out of this,” Beverly added.\n\nCOVID has made this year particularly difficult for the River family.\n\nRiver is currently living in the Harry S. Truman Memorial Veterans Hospital in Columbia, Missouri. He moved into the hospital in April while his 93-year-old wife Betty stayed “in the home he built for them over 60 years ago”, ABC News reported. Beverly explained, “We’re a very tight knit family. Every time we go on a FaceTime call he couldn’t look at us because it would make him said. He would get emotional. We would too.” The family hopes that now that River has received the vaccine, things will return to normal. “I’m excited that he was the person that was chosen to do that,” Beverly shared. “It’s been a huge relief. I couldn’t count the days [until he got the vaccine] fast enough.”\n\nThankfully, the family will be able to visit River on his birthday.\n\nNow, to make the day even more special, the family is asking people from all over the US to send birthday cards. “It’ll be just be so special for someone to just say hello and for someone to notice him and thank him for his service,” Beverly said. If you would like to send a birthday card, send it to the following address:", "opengraph": {"locale": "en_US", "type": "article", "title": "WWII vet turns 100 on Christmas and his family is asking the public to send birthday cards", "description": "You can make his 100th birthday extra special by sending him a card, wishing him a happy birthday, and thanking him for his service.", "url": "https://iheartintelligence.com/wwii-vet-turns-100-on-christmas-and-his-family-is-asking-the-public-to-send-birthday-cards/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-12-21T10:14:23+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/12/wwii-vet-turns-100-on-christmas-and-his-family-is-asking-the-public-to-send-birthday-cards.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["100th birthday", "COVID", "Bob River", "birthday", "WWII veteran", "river", "Alvin"], "tweets": [], "movies": [], "links": ["https://abcnews.go.com/GMA/Living/wwii-vets-family-asks-public-send-cards-100th/story?id=74807806&fbclid=IwAR1RKMJVRIlf3PeOq3t3WKh9XZyrzEwrY5OaL4hfhQyk-bxTNW78xZv7fpA"], "authors": ["Lena Y."], "publish_date": "2020-12-21T10:14:23+00:00"}