{"result_id": "164029", "URL": "https://iheartintelligence.com/conspiracy-theorists-are-more-likely-to-be-psychopaths-according-to-experts/", "timestamp": "2023-04-25 15:35:25 CEST+0200", "meta": {"description": "According to a recent study, there is a link between conspiracy theorists and \"dark\" personality traits such as psychopathy and sadism.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/conspiracy-theorists-are-more-likely-to-be-psychopaths-according-to-experts/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Conspiracy theorists are more likely to be Psychopaths, according to experts", "cleaned_text": "Conspiracy theorists are more likely to be Psychopaths, according to experts\n\nConspiracy theorists, including Flat Earthers, are more likely to be psychopaths, a new study claims.\n\nIf you are into conspiracy theories, you might want to consider this: A recent study published in the Personality and Individual Differences journal suggests that conspiracy theorists are more likely to have “dark” personality traits such as psychopathy.\n\nAs Unilad remarks, the research conducted by Cameron S. Kay, a researcher from the University of Oregon’s Department of Psychology, examines the correlation between the “Dark Tetrad” and people prone to believe in conspiracy theories.\n\nThe Dark Tetrad refers to Machiavellianism, narcissism, psychopathy, and sadism.\n\n“Conspiracy theories may, at first glance, appear relatively benign, but they have been linked to serious real-world consequences. Exposure to and belief in conspiracy theories has been associated with holding anti-Semitic beliefs, being apprehensive of vaccines, being less motivated to vote and being less inclined to stop climate change.”\n\nAccording to the study, “at least one facet of every Dark Tetrad trait was associated with conspiracist ideation.”\n\n“To develop interventions to combat these beliefs, it will be crucial to understand, not only the types of people that are drawn to these theories, but also why they are drawn to these theories. “\n\nNearly 500 participants took part in the study. They completed scales and questionnaires that assessed their likelihood to believe in conspiracy theories, as well as their Dark Tetrad traits. Throughout the process, the examiners considered five key behavioral patterns: the tendency to entertain odd beliefs, be fatalistic, desire control, distrust others, and feel a need to be unique.\n\n“In contrast to what the previous literature would suggest, it appears that those with aversive personality traits believe in conspiracy theories for mostly the same reasons. Conspiracist ideation may, therefore, arise from some shared feature of these traits rather than a feature that is unique to each trait.”\n\nDo you believe there is a link between conspiracy theorists and the Dark Tetard? Leave a comment to let us know!", "opengraph": {"locale": "en_US", "type": "article", "title": "Conspiracy theorists are more likely to be Psychopaths, according to experts", "description": "According to a recent study, there is a link between conspiracy theorists and \"dark\" personality traits such as psychopathy and sadism.", "url": "https://iheartintelligence.com/conspiracy-theorists-are-more-likely-to-be-psychopaths-according-to-experts/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-06-11T08:39:06+00:00", "article:modified_time": "2021-06-11T08:40:35+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/06/conspiracy-theorists-are-more-likely-to-be-psychopaths-according-to-experts.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["study", "Flat Earthers", "according to experts", "Conspiracy Theorists", "Psychopaths"], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/science/article/abs/pii/S0191886920307340", "https://www.unilad.co.uk/life/conspiracy-theorists-more-likely-to-be-psychopaths-study-suggests/"], "authors": ["Kristina Ivanova"], "publish_date": "2021-06-11T08:39:06+00:00"}