{"result_id": "164005", "URL": "https://iheartintelligence.com/baby-boy-11-weeks-old-hospitalized-with-covid-19/", "timestamp": "2023-04-25 15:35:01 CEST+0200", "meta": {"description": "A newborn baby has tested positive for the killer virus and is currently in hospital at Leicester Royal Infirmary. His mother urges people to stay home", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/baby-boy-11-weeks-old-hospitalized-with-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Baby Boy, 11 Weeks-Old, Hospitalized With COVID-19", "cleaned_text": "A desperate mother, 30, is urging people to stick to the COVID-19 guidelines and remain home during the crisis after her newborn baby boy tested positive.\n\n11-week-old Ares Banister was brought to Leicester Royal Infirmary last Monday with a high fever. He tested positive for coronavirus the next day.\n\nMother of four, Jodie, said his condition had normalized but she felt immense fear and panic.\n\nIn an urgent plea to every parent, she wrote on Facebook:\n\n“So while your all still pissing about going out and about without a care in the world, going to the supermarket every day for those absolute essentials you just had to have and going out for your 3 hour long walks that you’ve never done before in your lives…. Our 11 week old BABY has just tested positive for COVID19. We haven’t been out for weeks but unfortunately Christian still has to go to work to make sure Tesco has food on the shelves ready for you all to ransack and hoard. If you aren’t a key worker please stay at home!!!!! Please please start listening because our entire world has just been tipped upside down!!!”\n\n“We just thought, no way on earth it would be Covid. (We felt) fear and panic. I just sat there and cried. It was horrendous. ‘The first thing you automatically think is that he’s going to die. I was so scared.”\n\nJohnathan Ashworth, the shadow health secretary, recently said a three-week-long extension of quarantine would be ‘reasonable’.\n\n“We would expect the lockdown to continue, we would support that, I actually called for a lockdown before the Government introduced one. But we also want more details from the Government about what happens next. I mean, last night the junior health minister Nadine Dorries was complaining on Twitter saying that people shouldn’t be asking about an exit strategy because there’s no exit strategy until we get a vaccine. Well that could be 18 months away so if the Government are saying we’re in lockdown for 18 months they probably need to tell us. And I would argue that the best way to come out of lockdown or to manage a way out of lockdown is to move to a testing and contact-tracing strategy,” Mr. Ashworth told the BBC.\n\nWhat are your thoughts on this frightening news? Let us know by joining the conversation in the comments and please share this article to spread awareness on the seriousness of the situation we are all currently facing.", "opengraph": {"locale": "en_US", "type": "article", "title": "Baby Boy, 11 Weeks-Old, Hospitalized With COVID-19", "description": "A newborn baby has tested positive for the killer virus and is currently in hospital at Leicester Royal Infirmary. His mother urges people to stay home", "url": "https://iheartintelligence.com/baby-boy-11-weeks-old-hospitalized-with-covid-19/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-04-16T08:28:55+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/04/baby-boy-11-weeks-old-hospitalized-with-covid-19.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["desperate mother", "11 Weeks-Old", "Baby Boy", "Hospitalized", "COVID 19"], "tweets": [], "movies": [], "links": ["https://www.facebook.com/jodielouise.wheadon", "https://www.facebook.com/jodielouise.wheadon/posts/10163613968675556", "https://www.bbc.com/news/uk-england-leicestershire-52298254", "https://www.bbc.com/news/uk-52304914"], "authors": ["Kris Di"], "publish_date": "2020-04-16T08:28:55+00:00"}