{"result_id": "164018", "URL": "https://iheartintelligence.com/there-is-no-getting-back-to-normal-we-need-to-accept-it/", "timestamp": "2023-04-25 15:35:14 CEST+0200", "meta": {"description": "Despite the widely-held belief that sooner or later, life will go back to normal, experts believe that COVID-19 will leave permanent changes.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/there-is-no-getting-back-to-normal-we-need-to-accept-it/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "There is no getting 'back to normal.' We need to accept it", "cleaned_text": "Will things go ‘back to normal’ or do we have to come to terms with the idea of ‘a new normal’?\n• Experts argue that our lives are unlikely to return to the ‘normal’ of January.\n• Some habits are likely to stay with us long after the pandemic.\n• Even an effective COVID-19 vaccine cannot help us go ‘back to normal’ anytime soon.\n\nWhat if the changes we were forced to make in 2020 are not temporary?\n\nIn the first weeks of lockdown, people believed that within a couple of weeks, the virus will be contained and the madness will be over. They were overwhelmed by panic and shock; however, they felt hopeful that in a matter of weeks, life would return to normal. Today, so many months after lockdown first begun, people still believe that sooner or later, things will go back to how they used to be. According to CNN, ‘the human tendency to believe change is temporary and that the future will again resemble the past is often called “normalcy bias”‘. What is more, people who are guilty of normalcy bias tend to disregard the rules put in place to contain the virus as they perceive it ‘as a passing fad they don’t need to embrace’. Speaking to CNN, Thomas Davenport, the president’s distinguished professor of information technology and management at Babson College in Wellesley, Massachusetts, explained:\n\nPoliticians who pretend that ‘normal’ is just around the corner are fooling themselves or their followers, or perhaps both […] People who suffer tragedies eventually return to their previous happiness level. But I think that COVID-19 is a little different, because we keep expecting it will end soon. So there is no need to permanently change your attitudes about it.\n\nExperts argue that our lives are unlikely to ever return to how they used to be.\n\nDespite the hopes that life will return to normal, experts believe that COVID-19 will leave permanent changes. Working from home and having ZOOM meetings is likely to continue long after the virus disappears. In addition to this, we might find that the habit of washing our hands more often will also stay with us. Moreover, even wearing face masks on buses, trams, and subways can be a habit that we retain. Sonja Lyubomirsky, distinguished professor of psychology at the University of California, Riverside, commented: “If it’s a real habit, it can actually maintain itself. Now we wash our hands more frequently without even thinking. That’s something that could definitely stay with us.”\n\nContrary to what many believe, a vaccine will not bring life back to normal within the next year.\n\nThe majority of people believe that when scientists find an effective vaccine, everything will return to how it once was. However, the BBC explains that we must be realistic about what the vaccine can achieve and how quickly it can do so; that is, Professor Nilay Shah, head of chemical engineering at Imperial College London explained that ‘even when the vaccine is available it doesn’t mean within a month everybody is going to be vaccinated, we’re talking about six months, nine months … a year […] There’s not a question of life suddenly returning to normal in March’. In addition to this, Dr Fiona Culley, from the National Heart and Lung Institute at Imperial College London, reminds us that ‘the history of vaccine development is littered with lots of failures’. For this reason, it is difficult to tell when vaccinations may begin and if they will even be effective. Furthermore, there are numerous questions that are yet to be answered: Will one shot be enough? Will boosters be required? Will the vaccine work for older or vulnerable people with weak immune systems?\n\nUltimately, what lies ahead is a long and difficult time of uncertainty. We must be courageous, strong, and patient. Above all, we must learn to accept and adapt to this ‘new normal’. It is only through accepting the changes we face that we will be able to keep moving forward.", "opengraph": {"locale": "en_US", "type": "article", "title": "There is no getting 'back to normal.' We need to accept it", "description": "Despite the widely-held belief that sooner or later, life will go back to normal, experts believe that COVID-19 will leave permanent changes.", "url": "https://iheartintelligence.com/there-is-no-getting-back-to-normal-we-need-to-accept-it/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-10-05T10:02:02+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/10/there-is-no-getting-back-to-normal-we-need-to-accept-it.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["There is no getting back", "Experts argue", "new normal", "vaccine", "temporary", "back to normal", "Professor Nilay Shah"], "tweets": [], "movies": [], "links": ["https://edition.cnn.com/2020/09/30/health/back-to-normal-bias-wellness/index.html?utm_medium=social&utm_content=2020-10-04T13%3A28%3A05&utm_term=link&utm_source=fbCNN&fbclid=IwAR3epzOTRI-sgr0jY5p-iRQjyEKhtoC3s-PnVACudS_Frc7wriAozeupK-g", "https://www.bbc.com/news/health-54371559"], "authors": ["Lena Y."], "publish_date": "2020-10-05T10:02:02+00:00"}