{"result_id": "164007", "URL": "https://iheartintelligence.com/four-trial-volunteers-who-got-pfizers-covid-19-vaccine-developed-bells-palsy-link-to-the-jab-yet-to-be-proven/", "timestamp": "2023-04-25 15:35:03 CEST+0200", "meta": {"description": "While the FDA doubts that Bell's palsy has been caused by the shot, it is advising Pfizer to closely monitor the vaccine's recipients.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/four-trial-volunteers-who-got-pfizers-covid-19-vaccine-developed-bells-palsy-link-to-the-jab-yet-to-be-proven/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Four trial volunteers who got Pfizer's COVID-19 vaccine developed Bell's palsy, link to the jab yet to be proven", "cleaned_text": "Four people who volunteered to get Pfizer’s COVID-19 vaccine have developed Bell’s palsy.\n• Bell’s palsy is a form of temporary facial paralysis which causes the face to droop.\n• The FDA explained that it is unlikely that the paralysis occurred as a direct result of the vaccine.\n• Nevertheless, the FDA has warned Pfizer to closely monitor recipients.\n\nFour volunteers who took the Pfizer vaccine in the firm’s trial allegedly developed Bell’s palsy.\n\nWhile four people claim to have developed the condition after taking the vaccine, the Food and Drug Administration (FDA) claimed that there is no clear way in which the shot could have caused Bell’s palsy. The condition is a form of temporary facial paralysis which happens suddenly and resembles a stroke. It causes the face to droop on one side as the facial muscles grow weak. For some people, the condition causes both sides of the face to become temporarily paralyzed and they may experience heightened sensitivity to sound. The Daily Mail explained that others might also ‘lose their sense of taste, get headaches or develop pain around the jaw or ear of the affected side of their heads’.\n\nDespite the FDA’s belief that Bell’s palsy was not caused by the shot, regulators have warned Pfizer to pay attention to how many recipients report the condition. To date, there have been only four reported cases and according to the Daily Mail, Bell’s palsy is the only known side effect that the FDA has seen as “imbalanced”. One of the four volunteers temporarily experienced the side effect 3 days after the shot. While the other three volunteers developed the condition 9, 37, and 48 days after the vaccination, respectively. All of the people have reportedly recovered from the facial paralysis.\n\nBell’s palsy occurs unpredictably and was only triggered by a vaccine once in 2001.\n\nScientists believe that the temporary facial paralysis is generally not triggered by vaccines. The Daily Mail writes that the condition was triggered by a shot only once by ‘a Swiss flu vaccine that was sold during the 2001-2002 flu season’. As one might expect, the vaccine was promptly taken off the market due to the serious side effect. Now, the FDA denies that Bell’s palsy is a side effect of Pfizer’s vaccine; instead, they explain that the number of Bell’s palsy cases was ‘consistent with the background frequency of reported Bell’s palsy in the vaccine group that is consistent with the expected background rate in the general population, and there is no clear basis upon which to conclude a causal relationship at this time’.\n\nUltimately, it is doubtful that Pfizer’s COVID vaccine has caused the unpredictable and common condition. However, despite these doubts, the FDA advises that recipients should be closely monitored.", "opengraph": {"locale": "en_US", "type": "article", "title": "Four trial volunteers who got Pfizer's COVID-19 vaccine developed Bell's palsy, link to the jab yet to be proven", "description": "While the FDA doubts that Bell's palsy has been caused by the shot, it is advising Pfizer to closely monitor the vaccine's recipients.", "url": "https://iheartintelligence.com/four-trial-volunteers-who-got-pfizers-covid-19-vaccine-developed-bells-palsy-link-to-the-jab-yet-to-be-proven/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-12-09T09:18:40+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/12/four-trial-volunteers-who-got-pfizers-covid-19-vaccine-developed-bells-palsy-link-to-the-jab-yet-to-be-proven.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["COVID-19 vaccine", "Pfizer's COVID-19 vaccine", "Bell's palsy", "vaccine", "volunteered", "COVID vaccine", "COVID 19", "FDA regulators"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-9030943/Four-volunteers-got-Pfizers-vaccine-developed-Bells-palsy.html"], "authors": ["Lena Y."], "publish_date": "2020-12-09T09:18:40+00:00"}