{"result_id": "164034", "URL": "https://iheartintelligence.com/pfizer-covid-vaccine-trial-volunteers-compare-side-effects-to-severe-hangover/", "timestamp": "2023-04-25 15:35:30 CEST+0200", "meta": {"description": "Of the 43,500 trial volunteers, some have explained that they experienced headaches, sore muscles, and fever.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/pfizer-covid-vaccine-trial-volunteers-compare-side-effects-to-severe-hangover/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Pfizer COVID vaccine trial volunteers compare side effects to 'severe hangover'", "cleaned_text": "After the media announced that Pfizer’s COVID-19 vaccine has shown 90% effectiveness, people all over the world felt a spark of hope.\n• 43,500 people have taken the vaccine and some volunteers compare its side effects to those of the flu vaccine.\n• They describe the side effects as a ‘severe hangover’ with painful headaches and sore muscles.\n• Despite this, volunteers claim that the symptoms quickly subside.\n\nPfizer revealed findings that suggest the COVID-19 vaccine is more than 90% effective in preventing the virus.\n\nAccording to the Sun, 43,500 people have volunteered to take Pfizer’s COVID-19 vaccine. Two of the trial volunteers, Gleen Deshields and Carrie (who has asked that her surname remain anonymous), described the side effects and symptoms they experienced. The 44-year-old man from Austin, Texas reportedly claimed that the side effects of the vaccine were similar to “a severe hangover”. Similarly, 45-year-old Carrie from Missouri explained that she experienced a headache, fever, and body aches. The Sun notes that the trial volunteer compared her symptoms to the side effects of the flu vaccine.\n\nIt is important to note that the vaccine trial was double blind.\n\nThis means that the volunteers did not know if what they were given was the real vaccine or a placebo. Due to their symptoms, Glenn Deshields and Carrie believe that they were given the real COVID-19 vaccine rather than the placebo. Moreover, Deshields had even had an antibody test which came back as positive. In other words, he confirmed that he had not been given the placebo. Sharing his experience, Deshields commented:\n\nMy grandfather, one of his first memories was of the bells ringing when World War I ended. It was a horrific war and horrible things happened and people were just happy it was over with. In my mind I felt the same way… I kind of felt it was something like that. Thank god, it’s going to be over at some point.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer COVID vaccine trial volunteers compare side effects to 'severe hangover'", "description": "Of the 43,500 trial volunteers, some have explained that they experienced headaches, sore muscles, and fever.", "url": "https://iheartintelligence.com/pfizer-covid-vaccine-trial-volunteers-compare-side-effects-to-severe-hangover/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-11-11T10:07:38+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/11/pfizer-covid-vaccine-trial-volunteers-compare-side-effects-to-severe-hangover.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["double blind", "Pfizer COVID vaccine", "vaccine trial", "COVID-19 vaccine"], "tweets": [], "movies": [], "links": ["https://www.thesun.co.uk/news/13159725/first-volunteers-pfizer-covid-vaccine-feels-severe-hangover/?utm_medium=browser_notifications&utm_source=pushly"], "authors": ["Lena Y."], "publish_date": "2020-11-11T10:07:38+00:00"}