{"result_id": "164021", "URL": "https://iheartintelligence.com/restaurant-owner-goes-on-a-souper-kindness-tour-giving-free-food-to-strangers-in-need/", "timestamp": "2023-04-25 15:35:17 CEST+0200", "meta": {"description": "Jenny Levison, the owner of the Souper Jenny restaurants in Atlanta, is on a \"Kindness Tour,\" feeding strangers in need across the U.S.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/restaurant-owner-goes-on-a-souper-kindness-tour-giving-free-food-to-strangers-in-need/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Restaurant owner goes on a \"Souper Kindness\" tour, giving free food to strangers in need", "cleaned_text": "This warmhearted restaurant owner goes on a “Souper Kindness” tour, feeding strangers all across the U.S.\n• Atlanta-based restaurant owner gives free food to strangers in need all across America.\n• Jenny Levison, aka Souper Jenny, has launched a “Kindness Tour,” in which she helps people in need and small local businesses throughout the COVID-19 pandemic.\n• The celebrity chef launched the tour in a bid to support the restaurant industry and spread kindness.\n\nJenny Levison, an Atlanta owner of a chain of restaurants called “Souper Jenny,” is spreading kindness all across the U.S. The celebrity chef is launching a “Kindness Tour,” in which she and her team are giving away free food to people in need, as Upworthy reveals.\n\nThe idea for the tour was born amid the 2020 chaos caused by the COVID-19 pandemic and the numerous restrictions enforced at the time. As the restaurant industry was grappling for survival, Levison knew she had to do something about it.\n\nMotivated by the urge to help others in need, the restaurant owner decided to go on a “Kindness Tour” from Atlanta to California.\n\nThe first “life-changing” food journey took place last October, Levison shares:\n\n“We walked the bridge in Selma, which I’ve never done before and I could feel the weight of our history. We brought a wagon filled with quarts of soup and we handed them out on the bridge. Someone told us about some low-income housing in the area. So, we headed over. This white Jewish girl showed up in their neighborhood and I was welcomed with open arms by the community.”\n\nThe kindhearted chef engaged in all kinds of charity work – from giving away soups to helping small local businesses via free weekly grocery drives.\n\nSome of the other activities Levison and her partner and best friend Meg Gillentine Morris did were setting up socially distant takeout tables, leaving quarters for people to do their laundry in laundromats, doing a free grocery drive in Lake Charles, Louisiana, after a double hurricane hit the area, and feeding firemen in Irvine, California, after the wildfires. Talking about her mission, the celebrity chef says:\n\nCurrently, Souper Jenny is on her second “Kindness Tour.”\n\nThe second Souper journey started on April 26 and will continue until May 15. Levison and Morris’s first stop was in Collierville, Tennessee, where they met an incredible 10-year-old girl, who is on her own kindness tour. Little Deontra goes to her favorite places, including a hospital, a fire station, or a local restaurant, and gives workers snacks and drinks to thank them for their service. To complete her snack bags, the Atlanta business owner made special quarts of soups.\n\nWhat’s more, while at the Tennessee town, Levison gave 50 quarts of Turkey Chili to bus drivers and anyone else she could.\n\nBesides, apart from her Souper Jenny restaurants, she has a nonprofit feeding people in need across Atlanta. The organization is called The Zadie Project, after her father, Jarvin Levison, known as Zadie (Yiddish for grandfather). She shares:\n\nLevison believes that “Kindness can be free.”\n\nWhile spreading love and warmth with their delicious soups, Levison and Morris also go on hikes and explore the locations they visit during their tour. And as they do, they often give a compliment or two to strangers, just to brighten up their day.\n\nWhen the hearty team was in Nashville, they continued spreading kindness. First, they filled up two community fridges. Then, they went to various fast-food restaurants and gave employees free gift cards to cheer them up.\n\nMoreover, when they were in Washington, they spoiled dozens of vaccine workers with an afternoon of pastries and coffee.\n\n“People ask how I’ve funded this and let me tell you the answer — I’m prepared to figure it out! I may end up using my paycheck to spread the kindness gospel, but humanity has been incredibly generous. People hear what we’ve been doing and they want to get involved. Sometimes, you don’t have the time to do the deed and we can do it for you!”\n\nIf you want to support the “Kindness Tour,” you can check out their GoFundMe page. You can track Souper Jenny’s journey on Levison’s Instagram account and Facebook page.", "opengraph": {"locale": "en_US", "type": "article", "title": "Restaurant owner goes on a \"Souper Kindness\" tour, giving free food to strangers in need", "description": "Jenny Levison, the owner of the Souper Jenny restaurants in Atlanta, is on a \"Kindness Tour,\" feeding strangers in need across the U.S.", "url": "https://iheartintelligence.com/restaurant-owner-goes-on-a-souper-kindness-tour-giving-free-food-to-strangers-in-need/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-05-12T07:25:29+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/05/restaurant-owner-goes-on-a-souper-kindness-tour-giving-free-food-to-strangers-in-need.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["strangers in need", "COVID-19 pandemic", "Kindness Tour", "Souper Kindness", "giving free food", "U.S.", "restaurant owner"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1170", "height": "658", "embed_code": "<iframe loading=\"lazy\" title=\"Souper Jenny Kindness Tour 2\" width=\"1170\" height=\"658\" src=\"https://www.youtube.com/embed/Jfi-zoxvo4Q?wmode=transparent&amp;rel=0&amp;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Jfi-zoxvo4Q?wmode=transparent&rel=0&feature=oembed"}], "links": ["https://www.souperjennyatl.com/welcome", "https://www.upworthy.com/atlanta-woman-kindness-tour", "https://www.gofundme.com/f/the-souper-jenny-kindness-tour-2-2021?utm_campaign=p_cp_url&utm_medium=os&utm_source=customer", "https://www.instagram.com/followingsouperjenny/", "https://www.facebook.com/jennifer.levison"], "authors": ["Kristina Ivanova"], "publish_date": "2021-05-12T07:25:29+00:00"}