{"result_id": "164011", "URL": "https://iheartintelligence.com/employers-could-legally-make-the-covid-19-vaccine-mandatory-for-their-staff/", "timestamp": "2023-04-25 15:35:07 CEST+0200", "meta": {"description": "\"No jab, no job\" - Bosses can legally demand their employees to get vaccinated against COVID-19 and fire those who don't comply.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/employers-could-legally-make-the-covid-19-vaccine-mandatory-for-their-staff/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Employers could legally make the COVID-19 vaccine mandatory for their staff", "cleaned_text": "Your boss can now legally make you get the COVID-19 vaccine to protect themselves and the rest of the staff.\n• UK ministers have said that employers should be able to request COVID-19 vaccines from their staff.\n• Companies are discussing the possibility to fire employees if they refuse to get vaccinated.\n• Some politicians argue that this drastic measure “would be discriminatory.”\n\nIn the UK, ministers have discussed that employers should be able to request their staff to vaccinate in relation to the country’s health and safety laws. As per UNILAD, companies can demand all their employees to get vaccinated. Although, there are serious concerns about whether people should be fired if they refuse to obey.\n\n“Health and safety laws say you have to protect other people at work, and when it becomes about protecting other people the argument gets stronger. If there is clear evidence that vaccines prevent transmission, the next stage is to make sure more and more people are taking up the vaccine.”\n\nHowever, not all ministers are supportive of the idea.\n\nAs Daily Mail reports, some of them believe that forcing employees to vaccinate and threatening to fire them if they refuse “would be discriminatory.”\n\nThough, it is thought that if the decision to obligate staff members to get the COVID-19 vaccine is taken to court, it will most likely be ruled in favor of the employers.\n\nFor instance, the company Pimlico Plumbers has already enforced a “no jab, no job” rule, as per The Guardian. Last month the firm’s founder, Charlie Mullins, began outlining new employment agreements that include the vaccine requirement. In a statement, Mullins said that the COVID-19 vaccination is “going to be standard” in the new contracts. He explained:\n\n“When we go off to Africa and Caribbean countries, we have to have a jab for malaria — we don’t think about it, we just do it. So why would we accept something within our country that’s going to kill us when we can have a vaccine to stop it?”\n\nBut not everyone agrees the measures should be so drastic. Nick Wilcox, a BDBF partner, claims that bosses should maintain a balance between keeping their staff safe and avoiding breaking their trust. According to the law specialist, mandatory vaccinations may become an issue as not everyone will be willing to undergo the procedure due to different personal reasons.\n\nDo you think COVID-19 vaccines should be obligatory? Leave a comment to let us know!", "opengraph": {"locale": "en_US", "type": "article", "title": "Employers could legally make the COVID-19 vaccine mandatory for their staff", "description": "\"No jab, no job\" - Bosses can legally demand their employees to get vaccinated against COVID-19 and fire those who don't comply.", "url": "https://iheartintelligence.com/employers-could-legally-make-the-covid-19-vaccine-mandatory-for-their-staff/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-02-09T10:29:44+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/02/employers-could-legally-make-the-covid-19-vaccine-mandatory-for-their-staff.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["staff", "employers", "COVID-19 vaccine"], "tweets": [], "movies": [], "links": ["https://www.unilad.co.uk/news/employers-can-legally-demand-staff-get-covid-vaccine-to-work/", "https://www.telegraph.co.uk/politics/2021/02/07/employers-could-insist-staff-get-vaccinated-health-safety-law/", "https://www.dailymail.co.uk/news/article-9235025/Bosses-legally-demand-staff-vaccinated-against-Covid-health-safety-laws.html", "https://www.theguardian.com/business/2021/jan/14/pimlico-plumbers-to-introduce-no-jab-no-job-work-contracts-covid", "https://www.cityam.com/exclusive-pimlico-plumbers-plots-no-jab-no-job-policy/"], "authors": ["Kristina Ivanova"], "publish_date": "2021-02-09T10:29:44+00:00"}