{"result_id": "164022", "URL": "https://iheartintelligence.com/kate-middleton-wears-jacket-and-boots-shes-had-for-17-years-as-she-makes-a-farm-trip-with-prince-william/", "timestamp": "2023-04-25 15:35:18 CEST+0200", "meta": {"description": "Kate Middleton looked gorgeous in skinny jeans, a sweater, and boots by Penelope Chilvers with Prince William on a farm in Durham", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/kate-middleton-wears-jacket-and-boots-shes-had-for-17-years-as-she-makes-a-farm-trip-with-prince-william/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Kate Middleton wears jacket and boots she's had for 17 years as she makes a farm trip with Prince William", "cleaned_text": "Kate Middleton wears jacket and boots she’s had for 17 years as she makes a farm trip with Prince William\n\nThe Duchess of Cambridge can wear anything she pleases… so it’s incredible that she has been wearing the same boots for almost two decades on numerous occasions!\n\nLast Tuesday, Kate Middleton and Prince William went on a trip to Manor Farm in Durham as part of a royal engagement. During their visit, Kate was wearing a cozy sweater and jacket, skinny jeans, and her old-school Penelope Chilvers boots.\n\nIf you thought “Haven’t I seen these boots somewhere before?”, that is likely because Kate has worn them many times over the last 17 years. The beautiful knee-high boots have a Goodyear Welted Commando rubber sole that makes them perfect for the royal’s high-energy lifestyle.\n\nA few years ago, the couple took a hike to the Tiger’s Nest Monastery in Bhutan.\n\nFor the journey, Kate wore her favorite boots with a wonderful linen shirt and a leather vest.\n\nThe Duchess and Duke made their first recorded appearance back in 2004 when Kate sat for a formal photo at the Game Fair at Blenheim Palace wearing a button-down shirt, wonderful belted green skirt and graced her cool boots with a pair of knee-high socks.\n\nDesigners over the world dream of the duchess wearing their creations even once, so what is it like to have created one of Kate’s most cherished boots?\n\nIn an email, Designer Penelope Chilvers once told TODAY:\n\n“(My) footwear is designed for travel and adventure so it makes me very happy to see them being worn how they should be, as her oldest and dearest wardrobe staples.”\n\nWhat are your thoughts on this story? Let us know by joining the conversation in the comments and please share this article if you’ve found it of value.", "opengraph": {"locale": "en_US", "type": "article", "title": "Kate Middleton wears jacket and boots she's had for 17 years as she makes a farm trip with Prince William", "description": "Kate Middleton looked gorgeous in skinny jeans, a sweater, and boots by Penelope Chilvers with Prince William on a farm in Durham", "url": "https://iheartintelligence.com/kate-middleton-wears-jacket-and-boots-shes-had-for-17-years-as-she-makes-a-farm-trip-with-prince-william/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-04-28T11:57:21+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/04/kate-middleton-wears-jacket-and-boots-shes-had-for-17-years-as-she-makes-a-farm-trip-with-prince-william.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["Kate Middleton and Prince William", "jacket and boots", "Prince William", "The Duchess of Cambridge"], "tweets": [], "movies": [], "links": ["https://www.today.com/shop/kate-middleton-brown-riding-boots-t216636"], "authors": ["Kris Di"], "publish_date": "2021-04-28T11:57:21+00:00"}