{"result_id": "164025", "URL": "https://iheartintelligence.com/mother-of-9-year-old-girl-fighting-for-her-life-pleads-with-people-to-take-covid-19-seriously/", "timestamp": "2023-04-25 15:35:21 CEST+0200", "meta": {"description": "A mother from Tennessee is begging people to take the virus seriously as her child lies in the hospital fighting for her life", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/mother-of-9-year-old-girl-fighting-for-her-life-pleads-with-people-to-take-covid-19-seriously/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Mother Of 9-Year-Old Girl Fighting For Her Life Pleads With People To Take Covid-19 Seriously", "cleaned_text": "Mother Of 9-Year-Old Girl Fighting For Her Life Pleads With People To Take Covid-19 Seriously\n\nA mother from Tennessee is pleading with the public to not play around when it comes to Covid as her child fights the virus while lying in hospital.\n\nMirsada Muric, 26, has spent the last two weeks trembling in fear for the life of her 9-year-old daughter, Blair, who is a Covid-19 patient at East Tennessee Children’s Hospital. On her Facebook page, Mirsada has been continuously posting updates about her daughter’s health, but apart from support, she has also been seeing misinformation being spread in her comments section.\n\n“I’d get on their Facebook and see them posting memes or sharing things that they saw on Twitter about how much of a joke it is about being ‘scared’ of a virus and yes, I am scared of it,” the mother said. “I’m scared for my child and I can’t wrap my head around the idea of not wanting to wear a mask or not wanting to wash your hands, when that could be the easiest helping hand that you can give to someone.”\n\nMirsada felt incredibly upset by these individuals and pleaded to people to take Covid more seriously and to wear a mask.\n\n“THIS is why people beg for you to wear a mask. Who are you hurting by wearing one? What freaking rights are you losing?! Because, while I sit here and watch a machine breathe for my baby, you are out living,” she wrote in one of her posts.\n\nThe mother also revealed that her family had been facing other problems this year.\n\nBack in February, Blair received a brain tumor diagnosis and in July, her father passed away unexpectedly.\n\nMirsada is of the mind that her daughter contracted the virus at a recent memorial service for her dad.\n\nEventually, the mother began realizing that her child was acting strangely and, two days later, Blair tested positive for RSV, or respiratory syncytial virus, which put her at extreme risk of advanced illness and in the ICU. Later on, she was placed on a ventilator and given a Covid pneumonia diagnosis.\n\nWhile the child was cared for by doctors, the mother also contracted the virus, which left her unable to visit her daughter.\n\nAfter Blair was put on a ventilator, Mirsada’s biggest worry was that her daughter would not be able to make it without its use. Thankfully, a few days later Blair finally recovered and was taken off the machine, which lifted a huge weight off her mother’s heart.\n\nBlair is still in the ICU fighting the virus, but her mom says she is expected to make a recovery.\n\nThe mother says she will have her daughters vaccinated as soon as a new vaccine for children becomes available.\n\nWhat are your thoughts on this story? Let us know by joining the conversation in the comments and please share this article if you’ve found it of value.", "opengraph": {"locale": "en_US", "type": "article", "title": "Mother Of 9-Year-Old Girl Fighting For Her Life Pleads With People To Take Covid-19 Seriously", "description": "A mother from Tennessee is begging people to take the virus seriously as her child lies in the hospital fighting for her life", "url": "https://iheartintelligence.com/mother-of-9-year-old-girl-fighting-for-her-life-pleads-with-people-to-take-covid-19-seriously/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-08-13T09:34:26+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/08/mother-of-9-year-old-girl-fighting-for-her-life-pleads-with-people-to-take-covid-19-seriously.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["fights the virus", "Covid-19 Seriously", "lying in hospital", "COVID", "Mirsada Muric", "Mother Of 9-Year-Old Girl", "take Covid more seriously", "mother from Tennessee"], "tweets": [], "movies": [], "links": [], "authors": ["Kris Di"], "publish_date": "2021-08-13T09:34:26+00:00"}