{"result_id": "164041", "URL": "https://iheartintelligence.com/to-all-the-heroes-of-the-coronavirus-crisis-we-owe-you-everything/", "timestamp": "2023-04-25 15:35:37 CEST+0200", "meta": {"description": "Thank you to all the big and small heroes who put their lives on the line every day since this madness started. We are forever indebted to you", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/to-all-the-heroes-of-the-coronavirus-crisis-we-owe-you-everything/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "To All The Heroes Of The Coronavirus Crisis: We Owe You Everything", "cleaned_text": "To All The Heroes Of The Coronavirus Crisis: We Owe You Everything\n\nThere is some positivity in all the madness that is going on in the world right now.\n\nSurely, no matter how much it may be, it cannot possibly make up for the victims of the silent killer that is the coronavirus.\n\nHowever, we need not forget to point out the good things in all this, and in this article, we will honor the undervalued heroes that help our society remain stable in these desperate times.\n\nIt is time to celebrate the people who have been putting their health on the line since this crisis began:\n• The Truck Drivers who supply us with precious goods of all sorts\n• All the Medical Workers who put their lives on the line while hardly getting any sleep\n• The Journalists who keep us up to date\n• The kind companies who donate masks and other supplies to hospitals with shortages\n• the Scientists who are tirelessly working to produce a vaccine for the virus\n\n…and of course, all the people who do the right thing by keeping good hygiene and practicing social distancing.\n\nAnd if you get annoyed when you queue for food next time, please think of the people who work inside and expose themselves to potential danger by serving us each day. They are exposed to a much higher risk than those of us who are lucky enough to stay home and keep safe.\n\nThey are underpaid, and they are being mistreated, yet they keep on doing what they have to. We owe them a lot. Let us remember that even after this madness comes to an end.\n\nWho are, in your opinion, the biggest heroes on the frontlines of the coronavirus epidemic? Let us know your thoughts by joining the conversation in the comments and please share this article if you’ve enjoyed the read.", "opengraph": {"locale": "en_US", "type": "article", "title": "To All The Heroes Of The Coronavirus Crisis: We Owe You Everything", "description": "Thank you to all the big and small heroes who put their lives on the line every day since this madness started. We are forever indebted to you", "url": "https://iheartintelligence.com/to-all-the-heroes-of-the-coronavirus-crisis-we-owe-you-everything/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-03-27T08:47:24+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/03/to-all-the-heroes-of-the-coronavirus-crisis-we-owe-you-everything.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["Heroes", "Ambulance Drivers", "Food Deliverers", "biggest heroes", "Farmers Warehouse Workers", "Firefighters", "Couriers", "Cleaners"], "tweets": [], "movies": [], "links": [], "authors": ["Kris Di"], "publish_date": "2020-03-27T08:47:24+00:00"}