{"result_id": "164002", "URL": "https://iheartintelligence.com/buffets-could-be-banned-for-good-after-coronavirus/", "timestamp": "2023-04-25 15:34:58 CEST+0200", "meta": {"description": "Buffets banned, no water jugs and plastic menus, and no standing on buses. These are some of the big changes implemented as Australia eases its lockdown", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/buffets-could-be-banned-for-good-after-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Buffets Could Be BANNED FOR GOOD After Coronavirus", "cleaned_text": "Buffets Could Be BANNED FOR GOOD After Coronavirus\n\nExtended social distancing rules will have to be put in place at bars, cinemas, public transportation, and local sporting establishments before they can start functioning normally as the lockdown restrictions begin to loosen.\n\nOwners of bars are talking about a number of rules to limit social contact – including bans on items such as buzzers, water jugs, and plastic menus.\n\nA top journalist board has urged against the reopening of hotel buffets – with customers dining in their rooms while the restrictions are easing.\n\nMedical experts and state leaders are currently developing plans to reopen sports and get people back to two work ahead of a review of social restrictions on May 11.\n\nSince a vaccine has not been created yet, according to the Australian Hotels Association, a ‘new world order’ is likely to be expected when bars reopen their doors.\n\n‘They [bar owners] are thinking about anything that people touch – water jars at the end of the bar, those laminated menus, the buzzer,’ the association’s NSW chief executive officer John Whelan explained. ‘Live music is a real difficult one. Possibly seated. A lot of hotels are giving real consideration to everything. They all accept social distancing is here to stay for a while.’\n\nAccording to Peter Collington, an Australian National University microbiologist, bars and hotels may not go back to their normal states until September – even though they are likely to reopen under strict rules in July, he told Daily Mail Australia.\n\nPrime Minister Scott Morrison is currently working on ways to reset sports and get Australians back to work, he announced at a recent national cabinet event.\n\nMr. Morrison said health experts will put out guidance on how to safely practice professional and community sports alike.\n\nThe NRL has recently announced that it hopes to resume the season on May 28, even though details are yet to be confirmed.\n\nPrime Minister Morrison said experts are working on new rules businesses can follow to make their work environments safe to go back to.\n\nThe rules will point out what employees should do if one of their co-workers is infected with the coronavirus.\n\nBrendan Murphy, the chief medical officer, said he has requested for experts to provide ‘recommendations for gently, carefully, cautiously relaxing social distancing measures’.\n\nAccording to him, this could mean easing restrictions on the number of people permitted to gather in public.\n\nMr. Murphy also announced that each state and area now has the ability to test people who have symptoms of the virus.\n\nIn addition, he praised the country’s new contact tracing app which is to start operating in a matter of days.\n\n‘We’re putting in place the world’s best testing and public health and surveillance regime before we relax any measures,’ Mr. Murphy said when asked if he was worried about a second wave of the virus exploding in Australia. ‘No Australian wants to see hundreds of people dying a day from coronavirus. ‘We are not prepared to see that, and that’s why we are being so cautious and we are putting in these extraordinary surveillance measures. ‘We want to be testing 40,000, 50,000 Australians a day if necessary.’\n\nSee the Prime Minister’s speech regarding the re-opening of the country in the video below.\n\nWhat are your thoughts on the way Australia is handling the crisis? Let us know by joining the conversation in the comments and please share this article if you’ve found it of value.", "opengraph": {"locale": "en_US", "type": "article", "title": "Buffets Could Be BANNED FOR GOOD After Coronavirus", "description": "Buffets banned, no water jugs and plastic menus, and no standing on buses. These are some of the big changes implemented as Australia eases its lockdown", "url": "https://iheartintelligence.com/buffets-could-be-banned-for-good-after-coronavirus/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-04-28T09:06:46+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/04/buffets-could-be-banned-for-good-after-coronavirus.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["bars", "BANNED FOR GOOD", "back to two work", "After Coronavirus", "buffets", "cinemas", "Australian Hotels Association", "Medical experts"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1170", "height": "658", "embed_code": "<iframe title=\"Coronavirus: Scott Morrison details plan for re-opening Australia | Nine News Australia\" width=\"1170\" height=\"658\" src=\"https://www.youtube.com/embed/hJVM5jZAdFY?wmode=transparent&amp;rel=0&amp;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/hJVM5jZAdFY?wmode=transparent&rel=0&feature=oembed"}], "links": ["https://www.dailytelegraph.com.au/subscribe/news/1/?sourceCode=DTWEB_WRE170_a&dest=https%3A%2F%2Fwww.dailytelegraph.com.au%2Fcoronavirus%2Fsay-bye-to-pub-buzzers-buffets-and-cosy-cinema-seating%2Fnews-story%2Fe5c33c03bcf9068a57a9624736381d53&memtype=anonymous&mode=premium"], "authors": ["Kris Di"], "publish_date": "2020-04-28T09:06:46+00:00"}