{"result_id": "164048", "URL": "https://iheartintelligence.com/friends-ditch-mentally-ill-woman-at-gas-station-for-ruining-their-road-trip/", "timestamp": "2023-04-25 15:35:44 CEST+0200", "meta": {"description": "Road trip gone wrong: A group of friends abandoned a mentally ill woman at a gas station after she turned their trip into a nightmare.", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/friends-ditch-mentally-ill-woman-at-gas-station-for-ruining-their-road-trip/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Friends ditch mentally ill woman at gas station for ruining their road trip", "cleaned_text": "A mentally ill woman made her friends’ road trip a nightmare, so they ditched her at a gas station.\n\nSome people do make road trips unbearable, but what happens when the person has warned that they are struggling with mental health issues?\n\nLast year, a group of four friends, aged 17 to 22, decided to hit the road and travel across the country. Understandably, they were beyond excited for the road trip. Well, maybe not all of them.\n\nOne of the friends, a 21-year-old girl, had previously warned the rest she struggles with severe mental health issues. According to the Reddit user who shares the story, she claimed she had “depression, anxiety, PTSD and borderline personality disorder despite having never gone to a therapist or psychiatrist.”\n\nSince the group was aware of her problematic behavior, they did not want to invite her to their journey. However, they also did not want to make her feel left out, so they took her anyway. And that’s where the troubles began.\n\nAlthough the woman agreed to control her “outbursts” so they can all enjoy the ride, she could not keep her promise. The writer of the story says:\n\n“2 days in and a few hundred miles from home, we had all come close to losing our minds. Our one friend was nitpicking and yelling at everyone for EVERYTHING, from the clothes we wore out in public because “we were embarrassing her”, eating or drinking water “too loudly”, all the way down to two different conversations going on at the same time because it was “too much noise” for her.”\n\nEventually, as they could not bear her behavior, the group decided to ditch her at a gas station. So, the original poster(OP) asks:\n\n“AITA for ditching my mentally ill friend at a gas station?”\n\nWhen the travelers stopped at an Arizona gas station, with a grocery store and two motels nearby, they left the woman’s luggage outside as she was inside the store buying cigarettes. They then sped off and abandoned their fourth companion. What followed was quite unpleasant for each member of the friends’ group.\n\nAs per the OP, he might be the a**hole “because she said if we had warned her she would be ditched if she didn’t calm down, she would have acted better.” However, he questions whether she could have acted appropriately all along if “extortion could have brought decency out of her.”\n\nSo, was the group wrong for abandoning their mentally ill friend?\n\nMany of the Reddit users who commented on the story claimed ESH(Everyone Sucks Here).\n\nOthers asserted that the friends were not wrong to leave the misbehaving one and continue their road trip.\n\nThe OP explained that he was 17 at the time, and he was not thinking logically, which may explain his and his friends’ behavior.\n\nWhat is your opinion about this road trip story? Was the group wrong for ditching a woman struggling with mental health issues? Was there any other way the situation could have been handled better for everyone involved? Let us know in the comment section!", "opengraph": {"locale": "en_US", "type": "article", "title": "Friends ditch mentally ill woman at gas station for ruining their road trip", "description": "Road trip gone wrong: A group of friends abandoned a mentally ill woman at a gas station after she turned their trip into a nightmare.", "url": "https://iheartintelligence.com/friends-ditch-mentally-ill-woman-at-gas-station-for-ruining-their-road-trip/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-11-12T10:28:48+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/11/friends-ditch-mentally-ill-woman-at-gas-station-for-ruining-their-road-trip.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["road trip", "friends", "mentally ill woman"], "tweets": [], "movies": [], "links": ["https://www.reddit.com/r/AmItheAsshole/comments/jrllc0/aita_for_ditching_my_mentally_ill_friend_at_a_gas/", "https://www.reddit.com/r/AmItheAsshole/comments/jrllc0/aita_for_ditching_my_mentally_ill_friend_at_a_gas/gbuf1nq/?utm_source=reddit&utm_medium=web2x&context=3", "https://www.reddit.com/r/AmItheAsshole/comments/jrllc0/aita_for_ditching_my_mentally_ill_friend_at_a_gas/gbtv5m6/?utm_source=reddit&utm_medium=web2x&context=3"], "authors": ["Kristina Ivanova"], "publish_date": "2020-11-12T10:28:48+00:00"}