{"result_id": "164023", "URL": "https://iheartintelligence.com/zika-mosquito-pandemic/", "timestamp": "2023-04-25 15:35:19 CEST+0200", "meta": {"description": "The WHO says the Zika virus is \"spreading explosively\". What do we know, how can we stop it, and what steps can we take to keep ourselves healthy?", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/zika-mosquito-pandemic/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Is Zika A Mosquito-Born Pandemic?", "cleaned_text": "Over the past month or so, the Zika virus -a virus spread by mosquitos of the Aedes family that usually causes fairly mild, flulike symptoms in those infected with it- has taken the world by storm. The World Health Organization (WHO) has deemed that it is “spreading explosively” across Central and South America. In the case of this virus, however, it’s really a matter of what we don’t know…otherwise the WHO and the American Center for Disease Control (CDC) wouldn’t be raising alarms over a virus that doesn’t seem to really do much to its victims.\n\nZika has, however, an interesting pedigree: infection from the Zika virus has been implicated in thousands of births where the infant is born with microcephaly, or a very small head. Microcephaly is a birth defect that can lead to a host of brain and developmental problems and even result in death. And in terms of what we don’t know, there’s a lot. We don’t know how it spreads to target the fetus’ development. We don’t know how long its incubation period lasts. We don’t know how long it is spreadable: that is, easily transmitted between partners.\n\nThe amount of information we don’t know is a bit terrifying compared to what we do know: we know that it can be sexually transmitted, and we know that standard prevention methods against mosquito bites is effective. As with many viruses, prevention is the best cure.\n\nThere’s no treatment or vaccine for zika; the virus presents such mild symptoms in adults that it doesn’t require treatment, and while a vaccine is being developed, it will be years before it even reaches the clinical testing phase. At present, the best treatment is prevention. Women who are pregnant or trying to get pregnant are strongly discouraged from traveling to Zika-prone areas. And with the Summer Olympics coming up in Rio de Janeiro this year, researchers are deeply concerned about the potential for the virus to turn into a global epidemic, as Brazil is one of the largest contaminated areas. Nearly 5000 cases of microcephaly have been reported in Brazil, a nation which usually reports about 150 during the same time frame.\n\nWhat do we know, then, besides the importance of avoiding mosquitos and traveling to Zika-affected places? A fair amount, actually. Scientists have recently posited -using lab modeling- that the virus infects the outer layer of the brain in developing fetuses, which makes the brain more susceptible to other viruses, underdevelopment and even death. And some cases of Zika causing cerebrospinal infections in adults and older children have now been reported, such as the cases of an 81-year old man in France who was diagnosed with meningoencephalitis and that of a 15-year old girl in Guadeloupe, in the French Caribbean, who was diagnosed with acute myelitis. Both infections involve attacks on the brain and/or spinal cord.\n\n\n\nThis all seems quite scary and it might just be the tip of the iceberg. But a vaccine is in the works and prevention methods are extremely effective.\n\nThe vaccine has already been pushed to an estimated completion within ten years to three years, which shows how seriously this virus is being taken. In the meantime, arm yourself with long sleeves, long pants and bug spray, and try to avoid traveling to Zika-prone areas. There are lots of other lovely places to explore in the world.", "opengraph": {"locale": "en_US", "type": "article", "title": "Is Zika A Mosquito-Born Pandemic?", "description": "The WHO says the Zika virus is \"spreading explosively\". What do we know, how can we stop it, and what steps can we take to keep ourselves healthy?", "url": "https://iheartintelligence.com/zika-mosquito-pandemic/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2016-03-12T17:33:12+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2016/03/zika-mosquito-pandemic.jpg", "image:width": "960", "image:height": "500", "image:type": "image/jpeg"}, "tags": ["brain", "birth defect", "birth defects", "adults", "births", "brain health", "Aedes mosquito", "Brazil"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=JUlGN5XJ5dc", "https://www.cdc.gov/zika/prevention/index.html", "https://www.nytimes.com/2016/01/30/business/vaccine-for-zika-virus-may-be-years-away-disease-experts-warn.html", "https://sputniknews.com/latam/20160310/1036043721/brazil-zika-cases.html", "https://www.theverge.com/2016/3/4/11161360/zika-virus-birth-defect-causes-fetus-brain-study", "https://www.business-standard.com/article/pti-stories/zika-virus-implicated-in-brain-infection-in-adults-study-116031100086_1.html", "https://abcnews.go.com/Health/zika-virus-outbreak-update-vaccine-safety-trials-fall/story?id=37550339"], "authors": ["Dondi Leigh"], "publish_date": "2016-03-12T17:33:12+00:00"}