{"result_id": "164038", "URL": "https://iheartintelligence.com/coronavirus-vaccine-volunteer-reveals-some-of-the-expected-side-effects/", "timestamp": "2023-04-25 15:35:34 CEST+0200", "meta": {"description": "One of the first UK volunteers to sign up for the COVID-19 vaccination program has spoken about the symptoms he's expecting as the trial started yesterday", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/coronavirus-vaccine-volunteer-reveals-some-of-the-expected-side-effects/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Coronavirus vaccine volunteer reveals some of the expected side effects", "cleaned_text": "One of the first people in the United Kingdom to volunteer for the COVID-19 vaccination program talked about the symptoms he was expecting as the trial session began on April 23.\n\n“The trials start today but my first vaccination is next Wednesday. They think it will be something along the lines of having the flu. You might just get very mild side effects, but at worst maybe a fever for a couple of days and some aches and pains. ‘It shouldn’t be too disruptive to my life,” Simon Courtie said.\n\nSimon shared that he was just one of the hundreds of people taking part in the program to test whether the University of Oxford’s trial was safe.\n\nIf everything goes to plan the vaccine could be used to cure those infected with the coronavirus.\n\nAround 500 people were screened at the Jenner Institute in Oxford and Simon referred to himself as ‘just a very small part of this thing’.\n\n‘We are the safety part of this process and then after my trial there will be an efficacy trial out in the community to see if it works and that will involve thousands of people. ‘I go on Wednesday to the Jenner Institute and then I’ve got a second vaccination a month after that and then one or two more depending on which group I’m in, because there are different groups in the trial,” he added.\n\nThe vaccine called ChAOx1 nCoV-19 will be tested on 510 people out of 1112, who are all aged between 18 and 55.\n\nTwo separate vaccines will operate by recreating the ‘spike’ proteins that can be found on the outside of the coronaviruses.\n\nBoth trials will try to mimic this process inside the human body. The difference between them is how they get to achieve the desired effect.\n\nImperial College London will attempt to provide genetic material from the COVID-19 which programs cells in the body of the patient in order to recreate the spike proteins. It will transfer the genetic material inside liquid drops injected in the bloodstream.\n\nThe Oxford team, however, will genetically create a virus similar to COVID-19 to include the same spike proteins but will be powerless when it comes to infecting people.\n\nThe one made weaker by genetic tinkering is a kind of virus called an adenovirus, the same type that causes regular colds, that has been extracted from chimpanzees.\n\nOxford’s program hopes to produce the first UK vaccine to be made available worldwide and provide the key to the nightmare we are all currently facing.\n\nScientists working on the Imperial College London program will soon begin their own recruitment process for trials starting in June.\n\n£22.5million were yesterday donated by Health Secretary Matt Hancock to a lab at Imperial College London for its vaccine program.\n\nIt plans on starting human trials in about a month’s time.\n\nSpeaking at Monday’s COVID-19 briefing at Downing Street, Mr. Hancock said:\n\n“In the long run the best way to defeat coronavirus is through a vaccine. After all, this is a new disease. This is uncertain science, but I am certain that we will throw everything we’ve got at developing a vaccine. The UK is at the forefront of a global effort. We’ve put more money than any other country into the global search for a vaccine and, for all the efforts around the world, two of the leading vaccine developments are taking place here at home at Oxford and Imperial [College London]. Both of these promising projects are making rapid progress and I’ve told the scientists leading them that we’ll do everything in our power to support.”\n\nIn total, The Health Secretary pledged £44.5million to both the Oxford and London projects in order to help scientists in their efforts to create a viable solution.\n\nWhat are your thoughts on this positive news? Let us know by joining the conversation in the comments and please share this article to spread some much needed these days positivity.", "opengraph": {"locale": "en_US", "type": "article", "title": "Coronavirus vaccine volunteer reveals some of the expected side effects", "description": "One of the first UK volunteers to sign up for the COVID-19 vaccination program has spoken about the symptoms he's expecting as the trial started yesterday", "url": "https://iheartintelligence.com/coronavirus-vaccine-volunteer-reveals-some-of-the-expected-side-effects/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2020-04-24T12:30:21+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2020/04/coronavirus-vaccine-volunteer-reveals-some-of-the-expected-side-effects.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["side effects", "Coronavirus Vaccine", "vaccine volunteer", "new disease"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-8248885/One-Britains-coronavirus-vaccine-volunteers-reveals-effects.html"], "authors": ["Kris Di"], "publish_date": "2020-04-24T12:30:21+00:00"}