{"result_id": "164020", "URL": "https://iheartintelligence.com/black-woman-reportedly-kept-as-slave-by-rich-brazilian-family-for-38-years/", "timestamp": "2023-04-25 15:35:16 CEST+0200", "meta": {"description": "A Brazilian woman enslaved as a maid when she was 8-years-old for almost 4 decades and forced into marriage has been rescued", "lang": "en", "keywords": "", "favicon": "https://iheartintelligence.com/wp-content/uploads/2019/05/cropped-IHI-square-32x32.png", "canonical": "https://iheartintelligence.com/black-woman-reportedly-kept-as-slave-by-rich-brazilian-family-for-38-years/", "encoding": "UTF-8"}, "image": null, "domain": "iheartintelligence.com", "title": "Black Woman Reportedly Kept As Slave By Rich Brazilian Family For 38 Years", "cleaned_text": "Minas Gerais, Brazil: A black woman has opened up about how she was allegedly kept as a slave by a rich family for 38 years.\n\nWhen she was 8 years of age, Madalena Gordiano supposedly knocked on the door of the home of Maria das Graças Milagres Rigueira’s begging for some food. The family was quite wealthy and had all that was needed to provide for Madalena.\n\nSo when Maria, who is a school teacher, offered Madalena to adopt her, Madalena’s mother immediately agreed because she had 8 other kids to feed, including her twin sister, Filomena. But, according to reports, Madalena was not treated well.\n\nMadalena’s new family allegedly never sent her to school and didn’t even adopt her as a daughter, according to EL Pais.\n\nAnd for the following 38 years, she is said to have worked for the family free of charge and that included all kinds of housework.\n\nMadalena was apparently never paid for her work and was also never given any days off. And by the time she became a free person, she was already 46 years of age.\n\nIn an interview with Fantástico, Madalena said:\n\nThe family is also said to have exploited Madalena for financial gains, marrying her off to an older relative when she was still young.\n\nThe 78-year-old man had a pension from the military the equivalent of about $1600 per month and Madalena, who did not even live with him, inherited his pension after he passed away.\n\nBut Madalena was stripped of the money as it was taken from her by the Rigueara family. Reportedly, the pension was used to cover the costs of their daughter’s university degree.\n\nAt one point during her time as a servant, Madalena was given to Riguera’s son, veterinary professor Dalton Milagres Rigueira.\n\nProfessor Rigueira blames his mother for Madalena’s fate. Since the story blew up, he has been fired from his position at the university where he worked as a teacher.\n\nAccording to the family’s attorney, the disclosure of the prosecutor’s case is ‘premature and irresponsible’ because there has not yet been a conviction. He urges ‘cautious reflection,’ El Pais reported.\n\nMadalena has now been given back the monthly pension, and experts are helping her in any way they can. She is also trying to get reunited with her true family, as per DailyMail.\n\nWhat are your thoughts on this story? Let us know by joining the conversation in the comments and please share this article if you’ve found it of value.", "opengraph": {"locale": "en_US", "type": "article", "title": "Black Woman Reportedly Kept As Slave By Rich Brazilian Family For 38 Years", "description": "A Brazilian woman enslaved as a maid when she was 8-years-old for almost 4 decades and forced into marriage has been rescued", "url": "https://iheartintelligence.com/black-woman-reportedly-kept-as-slave-by-rich-brazilian-family-for-38-years/", "site_name": "I Heart Intelligence.com", "article:publisher": "https://www.facebook.com/sexyintelligence", "article:published_time": "2021-02-09T12:46:49+00:00", "image": "https://iheartintelligence.com/wp-content/uploads/2021/02/black-woman-reportedly-kept-as-slave-by-rich-brazilian-family-for-38-years3.jpg", "image:width": "1200", "image:height": "628", "image:type": "image/jpeg"}, "tags": ["Minas Gerais", "38 Years", "Rich Brazilian Family", "Slave", "black woman", "Brazil"], "tweets": [], "movies": [], "links": ["https://english.elpais.com/americas/2021-01-18/the-brazilian-woman-kept-as-a-slave-for-38-years.html", "https://www.dailymail.co.uk/news/article-9076721/Brazil-investigates-rescue-maid-enslaved-nearly-40-years.html"], "authors": ["Kris Di"], "publish_date": "2021-02-09T12:46:49+00:00"}