{"result_id": "165034", "URL": "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/", "timestamp": "2023-04-25 15:36:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "The Great Reset Pt 1: Klaus Schwab Book Club & the Illuminati Globalist Agenda!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we take a critical look at The Great Reset! I’ll read to you directly from Klaus Schwab’s book on the subject and we’ll start looking at the truther movement to see if they’re simply fear mongering or if their arguments have merit! I’ll be publishing several follow-up episodes for supporters on Patreon and Rokfin so if you like what you hear and want to go deeper we’ll be making it happen over there in December 2020!! It includes: a review of Fourth Industrial Revolution (spiritualizing the material world a la Crowley), the World Economic Forum’s 8 Points to Communism, reviewing Jay Dyer and Bill Cooper (who warned us of all this in the 80s!). Two options for bonus content: Patreon.com/IlluminatiWatcher or Rokfin.com/Creator/Isaac\n• BONUS (*Patreon/VIP Section/Rokfin only): The Great Reset Pt 3: Jay Dyer, World Economic Forum’s 8 Points & the Communist Agenda 12/2020 https://www.patreon.com/posts/44929076\n• Great Reset Part 5: Generations Book from 1991 Predicts the Future, Q Anon and the Occult Fourth Turning! 2/2021 https://illuminatiwatcher.com/great-reset-part-5-generations-book-from-1991-predicts-the-future-q-anon-and-the-occult-fourth-turning/\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “The Great Reset Pt 1: Klaus Schwab Book Club & the Illuminati Globalist Agenda!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nI want to be straight with you, there will be no return to the old normal for the foreseeable future, I repeat, there will be no return to the old normal for the foreseeable future.\n\nNow is historical moments of time, not only to fight severe violence, but to shape the system, we have a unique but rapidly shrinking window of opportunity to learn lessons and reset ourselves on a more sustainable path. It is an opportunity we have never had before, or may never have a game. So we must use all the levers we have at our disposal, knowing that each and every one of us has a vital role to play.\n\nNow is the time to think what history would say about this crisis. And now is the time for all of us to define our own role. What is it that would make it so that history would look at this crisis, as the great opportunity for reset\n\nwas ready to get controversial? This is going to be the most important topic we’ve ever covered. The most important at the moment, almost the most important time actually. I always stick to occult symbolism and pop culture and the movies and the music. And the aliens like I try to have a good time. But subject at hand today goes into uncharted territory for my shows. We’re gonna talk about a little bit on the Chinese Communist globalist trying to take over the world. Because you know who’s right alex jones is right. He’s right. Oh, there’s all time he was right. I didn’t know that. But we’re going to talk about it cuz I’m not good at this. Global geopolitics. Like it’s such a futile effort following the politics and these movers and shakers and these, these groups that try laterals and the CF powers and the Rockefellers and the Rothschilds and all these people. It’s a lot. I mean, this is a lifetime of research that Alex Jones has done. That’s a you know why he gets into it so deep. But like, for me, that’s a little too much. But I haven’t deep so deep. It put my butt to sleep on these globalists on what they’re doing, and it opened up my eyes. It shocked me. I’m literally I’m shaking, you should see my hand I’m shaking right now. We’re going to talk about it though. And here’s the thing, it What follows is a show on the great reset. If you haven’t already deduce that, we’re gonna talk about the great reset. Specifically on this first episode, on the free feed here, we’re going to talk about Klaus Schwab and his book COVID-19, the great reset, they lay it all out exactly what they’re doing. And if you want to support my research and support the show, you know where to go. And those people that do support, they’re gonna get extra episodes. We’re gonna go deeper. We’re going to go into class Rob second book. Well, it was sorry, that’s a misnomer. His fourth industrial revolution book, I read that I read that book, I read the COVID-19 great reset book, I got notes. I’m gonna save you a lot of time on I’m going to go through and explain it to you. But on that second episode, like we’re going to do like maybe four or five episodes on this. I’m going to throw the first one on the free feed and I know heavy is going to be tuned out because this isn’t that fun. I’m gonna make it fun though. And it’s actually incredibly important actually the most important topic I’ve ever covered, if you can believe that. But on the second episode that’s going to go on my feeds like patreon.com slash Illuminati watcher or rockfon comm slash creators slash Isaac. I’m going to put you know that’s where I put my bonus shows for supporters on each network, whichever one you like better. The second episode, we’re going to about transhumanism five g class Schwab’s Fourth Industrial Revolution book, then part three, I believe, I’m still fleshing out the details here. We’re going to do or talk about your boy Jay Dyer. Oh, yeah. Jay Dyer. None of a kind words though. This isn’t a drama section. He actually had a great video on the great reset. On he did a he hosted Alex Jones’s show, he did the fourth hour. And he broke down the great reset over 45 minutes and I watched it and I thought, My God, what are we in for? And I fact checked everything. Because like I said, I read the books. And if you you know, if you only listen to the first episode and we part ways after this journey, go check out Jay show on that because he breaks down the great reset too. And he’s not wrong. We’re gonna in that third episode, we’ll talk about the World Economic Forum and the eight points that they talk about the eight point plan and the communist agenda. Like I said, this is gonna be the most important topics you’ve ever heard. For me, this is some of the most important research I’ve ever done. But like, Is it fun? No. For me, like the research like this is very, it makes you mad. It makes you scared. It makes everything a lot more serious. And, boy, I’d rather walk watch Katy Perry videos. Let me tell you that much. Then on the fourth episode, we’re gonna talk about Bill Cooper Behold a Pale Horse. He talked about this in the 80s and 90s By the way, he predicted all of this it’s all true. The truth is always no right? And Bill Cooper knew it he told you about it. That’s gonna be a good episode. I was gonna be fun. Because Bill Cooper is a no g that dudes Oh gee, he read pilled me first red pill via Bill Cooper then I’ll do like a part five. I think we’d like conclusion. Social dilemmas, what to do all that stuff. And I don’t know if you follow me on the Instagram. I did a nice little video. There. You can still watch it. I posted it on December 3 30 minute video me shaming people into wearing masks. I know that sounds crazy, doesn’t it? Because the truth community is adamantly against the mask. And I get it. I don’t want to wear the thing either. It feels very controlling. But there’s a reason for that. And you got to listen to all these episodes to understand why because I assure you, they the globalists, the elites are doing a chess move on us. And Boyle boy, they’re putting your own fate in your hands. You don’t want to wear the mask well. Get ready for the Chinese Communist cashless system that come your way. Because that’s what’s next. clash. Clash Royale is going to shop with his leader hosen and his big kielbasa and he’s gonna make you he’s gonna make you call him daddy. It sounds absurd. I’m telling after all of this research I’ve been doing for days and days and days. This is real, this is happening. And censorships real. That’s gonna be part of this agenda. That’s why I tell you, you got to sign up for my email newsletter. Because believe you me one day, you’re gonna look for your boy Isaac on your podcast feed are your socials and I’m no longer gonna be there. lunati watcher.com slash start. If you go to Illuminati watch.com co star here. And when you sign up for the email newsletter, I will give you a free copy of my first book a grand unified conspiracy theory, the Illuminati Ancient Aliens and pop culture. It’s a good time you get I’m gonna lose. I own the email, I pay for it every month, hundreds of dollars a pay for this thing? Join the crew. It’s mean you, buddy. Alright. Let’s talk about okay. And let me preface this thing because I got to kind of lay the foundations, this is a lot of information. You have to understand, maybe you’re new to the truth or community, I don’t know. But you have to understand there’s always been a desire to centralize control into a global one world government, the New World Order, whatever you want to call it. And they advertise globalization as the solution to problems in the world to global problems, which are, in fact, I’m not saying they’re fake the problems globally. I’m just saying that they use them to their advantage to centralize authority. Now it could be like, and it could be like when a like a company buys out another one. And they make it worse by like cutting out jobs and making people do more with less. And then the workers are pissed off and they get rid of all the expertise that has been there for 20 years, because they don’t like paying them that much. And now the company is even worse than it was before. That’s what I argue this would be like, just so you know, I’m on Team pro America here is about as patriotic as I’m ever gonna get with this show. Because I love America, and I love her for her freedom and her beauty. But they want to take that all away. Klaus Schwab wants to take it all away. And when you read his books, it’s insidious. Because when you read the books, you think, Oh, this guy seems all right. I don’t know. He’s just saying like, Hey, you know, pollution is a problem and climate change is a problem. Let’s you know, let’s have a fair world. Let’s lift people up. Which like the liberal granola sodomy is like, yeah, okay, I dig that. But as you’ll hear when we go through all this stuff, It’s an insidious plan. And they need to destroy America’s freedom first, that’s what they need. But when we talk about all these show up in the course of these episodes about the great reset, I guess it’s gonna be like five episodes on the great reset. You’re going to understand why the viruses here you’ll know why they’re orchestrating a certain response from you. They’re going to understand, you’ll even know why the aliens are going to be the final threat to courses into the New World Order. If we don’t bow down before then, you will find out why the Illuminati globalist when all this to happen, why cash has to go why America must crumble to her knees. That big beautiful bald eagle needs to be down underneath cryin. You’ll know why Ilan musk and these nerds want to send you to other planets instead of fixing our own. And you’ll be shocked. You’ll be shocked when I reveal to you that these globalists, they it’s not personal. They don’t want to kill you. They don’t care. They hate you. What do they care? You’re nothing to them. They just think you’re stupid and you need control to do the right thing. That’s that’s what it is. And ultimately, you know, it’s like, Look, I don’t disagree with all these facts, observations, the science things that these globalists are pushing. I don’t disagree with all of them. But what I don’t trust is the people pushing the agenda, these globalist elites. You know, that World Economic Forum, it’s run by like the 1000 richest capitalist corporations and and they’re gonna come in and tell us how to be more fair, nice to each other. I don’t think so. How do you think Bill Gates got rich? He goes from being nice to people. I mean, these same people, they out there Oh, yeah, GMOs are so safe. to stab ease are so safe. Christianity’s there’s a big problem. It’s in the way of real progress. I disagree with almost everything they say. Why would I trust their ideas that climate change is real? I know it’s hard, right? I have a hard time. Because I do buy into some of their arguments of population explosion via romance, explosion, natural resources being squeezed middle class being squeezed into oblivion, climate change all this stuff. I just don’t trust them to be the solution. That’s the difference. Okay. Now, there you go. That was a 10 minute preamble. For what follows if you join us on our on the long version, would it be like five hours at least? This first show might be damn five hours. I got notes in this book. So what you’re listening to now is the great reset Part One whet your appetite and see if you want to dive deep with us if you want dive deep join us patreon.com slash Illuminati watcher or rockfon.com slash creator slash Isaac, you’ve heard my spiel on both of those whichever one you like, I don’t care. pick your poison. Some people like one over the other. It doesn’t matter to me, I just appreciate your support in any way. I did read to Klaus Schwab’s books and of Behold a Pale Horse and oh my god I’ve been so I’ve been deep in the rabbit hole, folks. So anyways, let’s get onto the Klaus Schwab and the Illuminati globalist agenda, part one here. Now the sequence because I got to lay this out, right. What prompted me to get into this topic because this is a little off brand. Okay. There are so many troopers in the community talking about the great reset. And I appreciate respect the work of my man Jay Dyer. He spent so much time on it. I thought let me give it a whirl. Let me see if I agree with him. Because I don’t think me and Jay agree on everything we agree on a lot. A shocking amount of similarities is almost like he’s my long lost brother. I don’t think we have agreements and everything though. And as you heard on the I did a rock Finn Show with Jay. And we went into why he was hanging out with Alex Jones and out there, you know, screaming through the bullhorn in Georgia at the pro Trump’s stop the steel election and all that stuff. And like you know my stance like i don’t i don’t think Trump is the guy I don’t think he’s the guy to bring this all down. But I get where people are coming from where they buy into it right on some levels. I just I just haven’t seen anything to make me believe them. So I you know, I wanted to see I went into this they can Okay, the great reset. This is some conservative fearmongering of these Chinese communist globalist because the conservatives are always so scared of socialism. It’s such a dirty word. But now I see. Now I get it. I get it now. And it took a Lot of wrangling and I was intrigued to research this Believe it or not by an image of Carl Schwab that was floating around where he’s wearing this bizarre, wacky, wacky outfit looking like Dr. Evil and to defend him it was a college graduation when you go to college graduations, which I did, right. I’ve been indoctrinated. When I went for I walked at Penn State for my masters. And there were some Bizarro Harry Potter looking costumes going on. So what I saw Klaus Schwab, I was like, man, why are they picking on man like this? He didn’t. He just had a college thing. But anyway, it was intriguing photo and I thought let me see these truth is right. Why they why are they doing this? So I bought his book COVID-19 the great reset. And I read it and I thought it was pretty smart book. I don’t know. I don’t really see the fear in it. And that proves how insidious this whole thing is. You’ll see when we peel everything back. I’m gonna be Do you see birdbox? You seem to mean for birdbox I’m the old guy. ripping your eyes open. See, see the truth. Just beautiful. That’s me right now. And when you guys are smart, you guys have been doing that to me. Honestly, I get more flak from people for my belief systems. But now I get it. Right. And I’ve always I’ve always, you know, like I said, Bill Cooper and David red billed me they were always into this global octopus of control thing. So I believed it. I didn’t see how the pieces fit together. Now I see. Now I get it. Oh, let’s see. Yeah, like I said, Let me see Baba Baba. Talk about the global cabal. I talked about that. Let’s get into it. Let’s get into COVID-19 the great reset. And I’m telling you right now I got I got so many notes. So many notes. I’m going to try to bust through this. And mega fun for you. And fun for me. I’m gonna read you. Sure I read you on a German accent the whole time? Or? I mean, I seriously have at least 10 pages of notes from this book. So yeah, this is this is good. All right, page 11. I’m on page 11. I’m going to read you from the book. But the existential crisis also favored that sounds like Bora. I sent every voice it sounds like Bora. I forget it. No, no German accent for you. But deep existential crisis also favor introspection, it can harbor the potential for transformation. The Fault Lines of the world most notably social divides, lack of fairness, absence of cooperation, failure of global governance and leadership now lie exposed as never before. And people can feel the time for reinvention has come in new world will emerge the contours of which are for us to both imagine and draw. Now, what he’s saying. And this is a I might have just keep harping on it. But he’s saying the virus basically is like any other crisis that can’t let a good crisis go to waste. They’re going to use it to create the new world, right? That’s the great reset. And he’s saying, This is the time for transformation. That’s why from day one, they said all new normal coming your way, and things will never be the same again. And right from the get go. I always thought What do you mean things aren’t gonna be the same ever again. We’re gonna deal with this crap and then move on. What are you talking about? But then after reading the book, I understand now. It is true. It is very true there. This is the new normal. And we’ll explain as we go. But listen to what he says here. The Tama the the fault lines of the world. He talks about social divides lack of fairness, absence of cooperation, failure of global governance and leadership. He’s saying like, Look, the human popular mankind is run around on Earth. They don’t listen to anything. You’re telling us a deadly virus and they’re like, screw you. I’m going out. And right or wrong, we can we could argue about the death rates. We could argue about the masks, but we’re not going to. That’s all he’s saying. He’s saying look, there’s this big problem. It’s time for transformation. Okay, next quote. At the at the time of writing June 2020. The pandemic continues to worsen globally. Many of us are pondering when things will return to normal. The short response is never keep reading here. radical changes of such consequence are coming that some pundits have referred to a before Coronavirus bc and after Coronavirus ac era. We will continue to be surprised by both the rap rapidity and unexpected nature. Of these changes, as they conflate with each other, they will provoke second, third, fourth and more order consequences cascading effects, unforeseen outcomes. In doing so they will shape a new normal radically different from the one we will be progressively leaving behind. And that’s what he’s saying is to simpletons like me, I think, why does anything have to change? It’s just a virus, like many viruses before. But with the lockdowns with the economy shutting down with the ripple effects, and and here’s a good example. I went to the store to get some cilantro. And guess what, there’s no cilantro. Because COVID because of California, wildfires, fill in the blank. There’s people in these factories and they get sick, and then they spread it to other people. Now, there’s less people working. I mean, everything takes longer with COVID. Right. And what that results in is an economic void that some companies will fill through automation, Ai, ingenuity, innovations, whatever. Look at telework, right? I didn’t get to telework before now, I’m teleworking 100% of the time, and it’s beautiful. I love it. Now, let’s keep breeding. Because of their inherently disruptive nature. epidemics throughout history have proven to be a force for lasting and often radical change, sparking riots, causing population clashes, military defeats, but also triggering innovations, redrawing national boundaries, and often paving the way for revolutions. outbreaks forced empires to change course like the Byzantine Empire when struck by the plague of Justinian in 541, and some even to disappear altogether. When Aztec and Inca emperors died with most of their subjects from European germs. So rightfully so, he’s making a good point here. That when when the Europeans came over with the germs, all the mass tax they were they were probably marched around. And the smart ones were like, oh, you’re coming to white folk, it’s time for a new normal and all the dummies were like, what are you gonna we’re just gonna keep doing what we’re doing. We’re gonna keep like, you know, making chocolate and sacrificing kids to the gods. And they’re just gonna be white people here now to was a big deal. And next thing you know, boom, they’re all dead. From syphilis or whatever. Keep it moving. Here we go. Deus. There’s nothing new about the confinement and lock downs imposed upon much of the world to manage COVID-19. They have been common practice for centuries. The earliest forms of confinement came with the quarantines instituted in an effort to contain the Black Death, that between 1347 and 1351 killed about a third of all Europeans. Coming from the word corn tanah Cora, Cora anta, which means 40 in Italian, the idea of confining people for 40 days originated without the authorities really understanding what they wanted to contain. But the measures were one of the first forms of institutionalized public health that helped legitimize the accretion of power by the modern state, the period of 40 days as no Medical Foundation, it was chosen for symbolic and religious reasons. both the Old and New Testaments often refer to the number 40 in the context of purification, in particular, the 40 days of Lent, and the 40 days of the flood in Genesis. So he said, A is a sort of a power move, be the core team, there’s a spiritual implication and remember earlier, they were calling BC and AC before COVID, after COVID. How blasphemous Is that right? But that is a What do you call, like a litmus test of the bigger picture? They need to destroy Christianity, I always say it. And this is just a metaphor of that. The virus to them. Again, if you look at like gnostic conversion ideas, the virus is their savior because the virus will enable them to cause this transformation to happen. So when they talk about the 4040 days of the in the Bible, like this is this is it for them? They love it. They’re psychopaths. World Class, Rob has been watching too much shayzon porn. Let’s keep reading. None fits the region pattern of the human suffering and economic destruction caused by the current pandemic. So what he’s saying in the book, he says, He basically saying COVID is going to have a larger impact that all the events that he lists out, he lists out like 911 Spanish flu, the Great Depression. I mean, and I’m thinking is this guy lost his damn mind. The Spanish Flu killed like 50 million. People, how’s COVID gonna have a larger impact? Well, only you only understand the severity and impact of this when you research people like Bill Cooper, who break down why this is happening. And again, I know this is like I keep teasing you with the thing, but like, it’s kind of a deep idea of, I mean, the short version is they want to usher in this new totalitarian socialist economy or world global government, where they divvy out the resources fairly to save you, your neighbor and Mother Earth. That’s the short version, but I have to go through a lot of information to get there before. I mean, it just sounds like Oh, you’re being a paranoid conspiracy guy. And I’m telling you, and you know, me, right, I’m a pretty rational, honest dude. I’ll tell you when there’s levels of how much I believe something, I believe this one. Next, the pandemic will accelerate systemic changes that were already apparent prior to the crisis, the partial retreat from globalization, the growing decoupling between the US and China the acceleration of automation concerns about heightened surveillance, the growing appeal of well being policies, rising nationalism, and the subsequent fear of immigration, the growing power of tech, the necessity for firms to have an even stronger online presence among many others. It might just provoke changes that would have already seemed inconceivable before the pandemic such as new forms of monetary policy, like helicopter money, the reconsideration recalibration of some of our social priorities, and an augmented search for the common good as a policy objective, the notion of fairness and acquiring political potency, radical welfare and taxation measures and drastic geopolitical realignment, realignment, so. And you might I had to look up helicopter money, I didn’t know what that was, it’s like dropping money from helicopter like the, the stimulus checks, right? The Trump box. So you seen that he’s saying, and again, this supports the idea that there will be a new normal, that what a pandemic does is it is an accelerator, an amplifier, if you will. So, we were already retrieved from globalization here in America. Right? And then Brexit to Well, now it’s gonna be even worse. Which is a good thing, but I think it’s a good thing. I mean, I don’t know macro economics, but to the globalist, it’s not a good thing. They don’t want that. Rising nationalism, he’s saying that’s gonna get worse, which I mean, it kind of has, right. I mean, you got all these groups out there that are national list esque. Fear of immigration, like, yeah, you don’t want to start letting everyone in the growing power of tech, that was exacerbated. In fact, by the pandemic, look at zoom, I don’t think you’re gonna know what zoom was before this thing hit. Let’s keep let’s keep reading society, I’m only on page 19. Good Lord, here we go. Societies could be poised to become either more egalitarian or more authoritarian, or geared towards more solidarity or more individualism, favoring the interest of the few or the many economies when they recover could take the path of more inclusivity and be more attuned to the needs of the global commons. Or they could return to functioning as they did before you get the point, we should take advantage of this unprecedented opportunity to reimagine our world, in a bid to make it better and more resilient one as it emerges on the other side of the crisis, in an interdependent world, risks amplify each other and in doing so have cascading effects. He’s saying, look, we’re all connected globally, the risks are faced globally. You know, we get our we get our goods from other countries. I mean, somewhere in this book, he says the US gets 97% of its antibiotics from China. Did you know that I didn’t know that. It was a Global Connections. Therefore, all the risks are faced globally, which is kind of what he’s saying when he says the COVID is different. It’s different from 911, the Spanish flu, we’re all fighting it globally. And I think what he’s trying to say, that therefore makes people think, well, we’re in this fight together. Let’s join resource resources. Let’s get on the same team and fight this thing. And I argue that if we don’t give in to that and don’t give into a global government, the next thing they’re going to up the ante with an alien threat, which will be an extension of COVID right? As far as like a global risk. Quote, many Asian countries reacted quickly because they were prepared logistically and organizationally due to SARS. And thus were able to lessen the impact of the pandemic. Because by the way, like, not all these things come from China not to sound like a jerk, but I mean, I don’t Well, I don’t know what I’m talking about. I just know that like, a lot of these viruses seem to come from there. Is it because they’re mistreating the animals? Is it because of those, uh, wet markets? Is it because of labs, the wool hand lab quote, by contrast, many Western countries were unprepared and were ravaged by the pandemic. It’s no coincidence that they’re the ones in which the false notion of a black swan event circulated the most. However, we can confidently assert that the pandemic, a high probability, high consequences White Swan event, will provoke many black swan events through second, third and fourth order effects. And he’s saying the Western cultures weren’t able to foresee the impact. And on top of the initial impact, there’s going to be the side effects rippling through all these businesses that we still don’t even know about. We don’t even know what’s happening in because it’s very complex system. We’re interconnected globally. In America we don’t manufacture like we used to. Any any refers to this topic is velocity in the book. There’s like a velocity to it, right. Oh, and should you wonder about the white swan Black Swan deal. The Black Swan theory is an idea that there’s some kind of rare, unforeseen event and it comes in and then after the fact people are like, Oh, well, we should have known that was gonna happen. Whereas like, for years, these nerves like Bill Gates had been saying, like, Look, there ran a global pandemic, someday, we need to be ready. I mean, even your boy Obama handed off a folder of like, here’s the in case of pan global pandemic folder that apparently, and I don’t want to get political, but you know, Trump throwing the garbage and dismantle the CDCs global pandemic team. That Hey, that’s just what they’re saying on the news that is, in fact funded by people within the same group. So question everything. Let’s keep reading. What the history of previous epidemics shows again and again, is how pandemics exploit trade routes and the clash that exists between the interests of public health and those of economics, something that constituents Oh, that constitutes an economic aberration, as we will see in just a few pages, as the historian Simon scammer describes, in the midst of calamity economics is always at loggerheads with the interest of public health, even though until there was an understanding of germ borne diseases. The plague was mostly attributed to foul air and noxious vapors said to arise from stagnant or polluted marshes. There was nonetheless a sense that the very commercial arteries that generated prosperity were now transformed into vectors of poison. But when quarantines were proposed, and or imposed, those who stood to lose most merchants, and in some places, artisans, and workers from the stoppage of markets, fares and trade put up stiff resistance, must the economy die, so that it could be resurrected and robust good health? Yes, said the guardians of public health who became part of urban life in Europe as a bloc. Now look, what they’re saying is he said, we’ve done this before dummies, fighting against the quarantine saying all you can’t lock us down. And there’s somewhere in here where he lays out a pretty good argument. I’m sure we’re gonna get into it. Because look, and I’ve got friends who owned businesses that have the same sentiment, like, Look, you can’t just crush the economy because it’s gonna kill a few people. Well, I mean, true, right? To an extent. look old, the Schwab sister says, and I don’t know if I disagree with them, because look at the Meatpacking industry, at the factory farms there. They say his argument is like, Look, you can’t have a full open economy because there’s two reasons. One, there’s a psychological component. The news tells you there’s people dying of this disease. And you know, even though only maybe a percentage of people will be scared, you know, you take 30% of your customers away. That’s a pretty big chunk. So like on one hand, you’re not going to get everyone out there anyway because psychologically They’re not ready to keep the economy fired up. And then on the other hand, if you had everything running at full speed, everyone working as normal, pretend nothing’s wrong, the virus will spread and you’ll have, you know, half your workforce is out sick or one of them’s dead now and blah, blah, blah, and it goes on and on. It ripples around and it makes things worse. That’s the argument. That’s why they say look, just shut it down for two weeks. Even though that didn’t work, right. But this is I mean, this is what they This is what they’re saying. They’re saying merchants, artisans. At the markets and the fair back in the day, they were like, Hell no, you ain’t gonna quarantine me from the Black Death. I got together and make that money. Maybe I’ll, I’ll only live 24 years I got I can’t lock down for four months. It’s like half my life. Let’s keep y’all a seminal paper on the long term economic consequences of major pandemics throughout history shows that significant macro economic after effects can persist as long as 40 years, substantially depressing real rates of return. This is in contrast to wars that have the opposite effect, they destroy capital, while pandemics do not. Wars trigger higher real estate rates, implying greater economic activity, while pandemics trigger lower real estate rates, implying sluggish economic activity. In addition, consumers tend to react to the shock by increasing their savings either because of new precautionary concerns, or simply to replace wealth lost during the epidemic. Bah bah, bah, similar but less extreme examples of other pandemics point to the same conclusion, labor gains in power to the detriment of capital. What he’s saying is assets will decrease, but labor wages will go up. He’s saying that there’s gonna be an effect on the economy for many, many years, again, supporting the idea of a new normal, based on the research of other major pandemics. And it’s like they knew right like Bill Gates and all these guys have been saying they’ve been warning you for a long time about a pandemic, because they apparently are having a foresight to be like, this is gonna create a ripple effect and everyone’s gonna be hating life. Okay, let’s keep reading. And overwhelming consensus has emerged within the global scientific community, that Jin qui one of China’s leading scientists had a right when he said in April 2020, quote, this is very likely to be an epidemic that coexist with humans for a long time, become seasonal and is sustained within human bodies. What does that mean means get ready for more flu shots. Now you taking your flu shot, you’re taking your COVID shot, shots, shots, shots, shots shots. In the second scenario, the first wave is followed by a larger wave that takes place in the third or fourth quarter of 2020. And one or more, one or several similar smaller waves in 2021. Like during the Spanish flu pandemic, this scenario requires the reimplementation of mitigation systems around the fourth quarter of 2020 to contain the spread of infection by block. Okay, so I’m reading my notes are the reason I brought that up, they basically have done simulations that were on the money with exactly how this thing looks. And I guess the point there is like, I don’t think these guys are entirely wrong. I think, like I always say, like, I don’t think these are like all complete dumb asses. I don’t trust them. In fact, maybe that makes them less trustworthy. Can’t trust a smart, evil nerd. Okay, so they keep talking about this is Okay, here we go. Here’s where he talks about why you can’t shut down the economy. The reasons are twofold. One on the supply side, a pre if prematurely loosening the various restrictions and the rules of social distancing resulted in an acceleration of infection, which almost all scientists believe it would, more employees and workers would become infected and more businesses would just stop functioning. As I say, it’s a saving economy and just letting people die. Like that’s the that’s the one option. That’s what was that Governor Abbott in Texas was saying at the beginning, he’s like, Look, man, like people got die. Sorry. Economy is God. And I don’t and look, I get it. I get why you would have that stance. He said, there’s two reasons. One, if everyone went back to work, the businesses will eventually shut down because everyone’s either gonna be sick or dead. And this is what happened. You remember when the meat factories did this and then Trump man Did they have to stay open? But it also happened in sports ball? Yes. Back on November 29, the Denver Broncos had all of their quarterbacks out with COVID all of them. And here’s the thing, aren’t those sports ball teams, all quarantine in hotels and stuff this whole time? Well, the point is, you could try a full reopening. But not only is everyone going to get the COVID and casualties be will be way higher and the hospital will be overwhelmed. But the confidence to go out and spend and party and go to the bars and go on vacations like both the confidence won’t be there because it’s a it’s a conundrum as the deaths and hospitalizations increase. The people paying attention will lose confidence in going out and say that’s scary, I ain’t going out. Not everyone is in the position to endure the the COVID disease or at the very minimum they’re worried about getting someone close to them. It’s a real conundrum. Let’s keep reading individuals perceptions of safety drive consumer and business decisions which means that sustained economic improvement is contingent upon two things, the confidence that the pandemic is behind us without which people will not consume and invest and the proof that the virus is defeated globally. So you see that’s the second reason you can’t save the economy by just sacrificing people to COVID population won’t consume they won’t spend unless they’re save and the viruses bind us and and look I don’t know if I agree with that entirely. Because I’m here to tell you living in Utah through this pandemic health houses and car sales are through the roof through the roof I got a friend who manages a car sales lot biggest selling months ever in the history of the company. I got a friend looking for a house can’t get into one they sell the day they go up on the market now would now here’s an idea I wanted to flow this idea because I like to test the boundaries of our thought process here because I don’t want you to be a sheep a slave to what I say or anyone else critical thinking okay, here’s an exercise with the troopers be so apt to call out the governments if maybe the government was like look the virus is fine there’s no virus everything’s fine. Nobody’s dying. Because guess what the truth is would do then they’d be screaming bloody murder about oh my god they there’s a deadly virus and they just these want us to keep consuming and obeying. Right? Is that what they would do? We always take this sort of devil’s advocate stance with the government and and the authorities. The authorities are like look Hey, there’s a deadly virus coming. We need to be careful because life is gonna die. And then the truth is like hell no, you just did a scan demick What do you want to do you want them to say yeah, no, it’s fine. Everything’s fine. Meanwhile, people are dying left and right hospitals are overflowing they got the ice truck pulling up and you know that there’s a there’s a hospital I have a friend working in auto industry said they’re starting to stack the bodies in the the the trucks that’s not just some news fake news crap I’m seen on the on the TV. So like what the truth is be like oh, my God, you should protect us. You should tell us to wear masks. You should be working on a vaccine but they don’t they want us to die. They want us to just consume and fuel their fuel their their pockets with wealth. Now just a fun exercise thought exercise. I’m not saying I agree with that stance. I’m just saying that would be one that let’s keep reading. If governments fail to save lives, people afraid of the virus will not resume shopping, traveling or dining out this will hinder economic recovery locked down or no lock down. And it’s true, right? I’ve really gone out deep nearly to the extent that I had before. Quote, the simple conclusion in countries afflicted with registered COVID-19 cases that at the peak were roughly doubling every two days. Governments had no reasonable alternative but to impose rigorous lockdowns. Genting otherwise is to ignore the power of exponential growth and the considerable damage it can inflict through a pandemic, because of the extreme velocity of the COVID-19 progression. The timing and forcefulness of the intervention. Were of the essence. Any like any goes on he cites two studies proving the lock bounds save lives. Then, you know, you add in the rate of reinfection and the velocity of COVID he’s saying he’s basically like, Look, this is the only choice. Nobody wanted to lock down. But that’s the way it had to be. That’s what He says, okay, they’ll shoot the messenger. The shock that the pandemic has inflicted on the global economy has been more severe and has occurred much faster than anything else in recorded economic history. Even the Great Depression in the early 1930s, in the global financial crisis in 2008, it took several years for GDP to contract by 10% or more, and for unemployment to soar above 10%. And he’s right again. He’s right. He look at you remember, when back in late 2019, the Georgia community was all up in arms clamoring about all these CEOs stepping down, you remember that? They were dumping their stocks? Me Bill Gates did it do they all did it. And then I think in March, even like a bunch of Congress people, they were dumping their stocks. Because they’re not idiots. They knew it was coming. The assessor the economic economist Kenneth Rogoff, warned, quote, everything depends on how long it lasts. But if this goes on for a long time, it’s certainly going to be the mother of all financial crisis. Consequently, the service sector that represents by far the largest component of economic activity activity in any developed economy, about 70% of GDP, and more than 80% of employment in the US, was hit the hardest by the pandemic. It also suffered from another distinctive characteristic, contrary to manufacturing or agriculture, lost revenues and services are gone forever, they cannot be deferred because service companies don’t hold inventories or stock raw materials. Several months into the pandemic, it looks like even assemblance of a return to business as usual for most service companies, is inconceivable. As long as COVID-19 remains a threat to our health. This in turn suggests that a full return to normal cannot be envisioned envisaged in Hellboy in envisaged before a vaccine is available. This is gonna be bad, right? That’s true. I’m reading Time magazine article about how service industries are the future of America. And that’s kind of not good. So he might be right, like there might be massive deferred issues. If that’s the industry that gets hit the hardest with this kind of thing. And this will fit into the World Economic Forum’s eight point plan of this global communist re proportioning of stuff if too many people are without, well, what happens is you got too many poor people and too many desperate people, and then you got increased crime and it comes peer anarchie. The next hurdle is the political challenge of vaccinating enough people worldwide, we are as collectively as strong as the weakest link with a high enough compliance rate, despite the rise of anti vaxxer Oh, so there he goes, uh, you know, and that’s the writing’s on the wall, they’re going to force that thing. In the US a harbinger of difficulties to come elsewhere, it is estimated that the official rate of unemployment could reach a peak of 25% in 2020, a level equivalent to that of the Great Depression. That would be even higher, if hidden unemployment were to be taken into account, like workers or the law, situation of employees in the service industry will be particularly dire. So if you are going to serve as injuries, nobody’s saying get out now. services are like people that do tasks versus selling a product. You have to ask an economist, I don’t really understand how this would affect someone like an attorney or whatever, who does a service or YouTuber, I don’t know. Do a little homework on that. Two reasons account for this striking difference. One, the US labor market has higher and fire culture that doesn’t exist and is often prohibited by law in Europe. And to right from the onset of the crisis Europe put into place fiscal measures is just destined to support employment. And he’s saying that and and if you look it up, the US unemployment went up 11%, Germany went up 1%. Because immediately Germany was putting in measures to protect the workers in America, we don’t really do that. We don’t really do that. The substance of the argument goes like this automation is disruptive, but it improves productivity and increases wealth, which in turn leads to greater demand for goods and services, and dust new types of jobs to satisfy those demands. And that is a section where he talks about how automation will be part of this new normal. And he’s saying the robots are good for them. The economy is Alex Jones wrong. Alex Jones talk about the robots replacing everybody. That’s not what old trumpster says. In the pre pandemic era, new AI based technologies were gradually introduced to automate some of the tasks performed by humans. COVID-19 crisis in its accompanying measures of social distancing, has suddenly accelerated the innovation. chat bots, voice recognition software like Amazon’s Alexa and other software can replace tasks normally performed by humans. He says the labor market will become polarized between highly paid work and lots of jobs that have disappeared or aren’t well paying. Now let’s see what else he says here. I got a lot on notes. I’m gonna I’m gonna I’m gonna cut back on my readings and give you the notes. Oh, dear, dogs are losing. So he basically lays out an idea that the great reset on values will happen because previous to the COVID GDP was the big factor, right? The big metric everyone measure progress on? Well, GDP doesn’t account for the well being of the average person. This is a very communist socialist sort of idea. And New Zealand has already got a metric tracking mental health. And America you know, in America, we’ve notoriously have shit mental health. With the mass shootings, the depression, the suicides, there’s a stigma against therapy. I mean, we’re pretty weird country rap. Like, what do they say about like, as far as sexy? Were Puritans in the streets of freaks in the sheets? Okay. He lays out this idea that happiness depends on more than like, material wealth and these sorts of things. And I mean, this is written by a bunch of rich guys so make sense? Right? I think they’re just trying to sell sell you on this idea. But I mean, he’s not wrong entirely, right? He’s saying that we’re going to place more value on the environment responsible eating, empathy, generosity, and all these things, which are all great ideas, right? I’m not opposed to that. He says the green economy spans a range of possibilities from greener energy to ecotourism to the circular economy. For example, shifting from the take, make dispose approach to production and consumption to a model that is restorative and regenerative by design. To preserve resources, minimize waste, use a product before reaches the end, user or use a product again before it reaches the end of his life, creating further value that can generate economic benefits with job growth and all this stuff. Says companies have strategies that favor repairable products with longer lifespans from phones cars fashion that even offer free repairs, like Patagonia and platform platforms with trading products are expanding fast. I love this idea, right? This sounds great. I hate buying new products I reuse and repair as long as I possibly can. I Lowe’s shopping for new stuff. I load products that last five years and fill up a landfill like you know, ovens and washers and dryers. I’ve always had like Doug just charged me twice as much I don’t care make this thing last longer. I had a I had a Kodak printer. It was a great printer. And they stopped making them print cartridges and I email so what the hell, why aren’t you making the ink cartridges anymore? And I always stopped supporting that model. I’m like, this is the best printer I’ve ever had. I’ve had this thing like 10 years. And they’re like That’s nice. glad you enjoyed it. God that about a son of a gun so to go buy another printer. Yeah, I hate the I hate consuming and throwing crap in Atlanta Phil when there’s no need for it. That’s why I hate no one else I hate. You don’t really grinds my gears prelit Christmas trees. Because then the lights go out. And you got to throw this giant Christmas tree in the garbage. just sell the things without the lights and put them on or make a lights that you can fix easier. Alright, so like me in class, we agree on that one. We have five on that one. Okay. Oh, let’s see. He’s talking about growth. There’s gonna be growth. I’ll give you the short version growth opportunities in health and education. Do then there’s a C, there’s a D growth movement, embracing zero or negative GDP growth. If you believe that he’s saying that there’s a certain stigma behind being consumers. They don’t like that. Some people don’t like that. Like the some people appreciate advocating for eating less meat. Taking fewer flights and all that stuff. It says the pandemic has spurred renewed interest in this movement that wants to reverse the pace of economic growth. Leading more than 1100 experts from around the world to release a manifesto in May 20 2020. For the D growth strategy to tackle economic and human crisis caused by COVID-19. They’d ended up with all the granola things, right? Do all the good things. And this is where you start getting a taste of the the say when they say you’ll, you’ll make less, you’ll have less, you’ll be happier. None of I buy into that. I mean, it definitely goes in the face of the red blooded, capitalist free market capitalism and hoarding. But I got lots of questions on that as a bigger show. How are you going to get the elites to support this? Are they going to just buy into this? Are they going to force us to live on this standard of equitable wealth while they maintain their yachts and private jets? I mean, that’s the backbone of socialism, right? See, boop, boop boop for you. Oh, here’s Here we go. Listen to the disdain for America Klaus Schwab has. For decades, the US has enjoyed the exorbitant privilege of retaining the global currency reserve status that has long been a perk of Imperial might and economic lyxor elixir. To a considerable extent, American power and prosperity has been built and reinforced by the global trust in the dollar, and the willingness of customers abroad to hold it most often in the form of US government bonds. The fact that so many countries have foreign institutions want to hold dollars as a store of Reserve has anchored its status. This has enabled the US to borrow cheaply abroad and benefit from low interest rates at home, which in turn has allowed Americans to consume beyond their means. Consume beyond our means say this will support the argument that we’re going to put forth in the future episodes. America must crumble to her greedy knees. That’s their viewpoint. And I look I don’t know, are they right? I don’t know. America is kind of a wacky place. I don’t have the kind of worldview to know like, Oh, you know, people in Germany are much better people and happier. I don’t know, I have no idea. I’m already swimming in the fish tank. You don’t know what it’s like outside. In Plato’s proverbial cave, as it were. Here we go for quite some time, some analysts and policymakers have been considering a possible and progressive end to the dominance of the dollar. They now think the pandemic might be the catalyst that proves them right. On the one hand, managing the economy, doubters of the US dollar dominance, pointed the inevitable and sharp deterioration of the US fiscal position in their mind unsustainable levels of debt, and eventually erode confidence competence in the US dollar says prior to the pandemic, US defense spending in interest, entitlements represented 112% of the federal tax receipts versus 95%. Back in 2017. I Wonder Boy Obama was in you know, they always say the liberals want to spend but it’s, it’s both both camps. The unsustainable path will worsen in post pandemic post bailout era, this argument suggests that something major will therefore have to change and this is where, look, I’m no economist. But he’s saying we’re not collecting enough taxes. Obama had a balance down to reduce the debt with a 97 or 95%. Trump come in and cut the taxes without cutting expenditures, like you want to do the tax cuts fine. But now you got to cut expenditures. And the US dollar apparently is not in good shape because of that. And the pandemic will make it worse. I mean, you see what they’re doing when the stimulus bills are handing out money to keep things moving, there’s gonna be a price to pay for that. And he says people have been looking to knock down the dollar as a global standard, because of all this stuff. And later, he he says that we we as a country are punishing other countries with economic sanctions, which he implies is pretty immature. And not again, I don’t know, I’m not an economist. I don’t know how this works. This is what I read from this book. He says, As for a global virtual currency, there’s not in sight yet. But there are attempts to launch national digital currencies that may eventually dethrone the US dollar supremacy. Then there you go. He’s talking and then he talks about China and the euro. Those things can overtake the dollar. But digital man maybe he says China’s pushing a digital currency that worked in an effort to detach itself from the US dollar and I think he’s saying that digital currencies a way for them to do this? This is the crypto currencies This is the Bitcoin because again, the US dollar is a fiat currency, it depends on the perception as to how much it’s really worth. So again, this guy isn’t necessarily wrong. And it’s it’s funny because the truth is are out there supporting the kryptos and the bitcoins? Well, they’re supporting the detachment from the US dollar, because they think, well, it’s the Federal Reserve, and they’re the evil ones. Well, what about Klaus Schwab over here, he’s saying, like, we need to crush the US dollar. Lots of questions to be brought up from this sort of thinking. Oh, let’s see. And then I guess Kissinger was saying that like nations flourish on the belief that their governments can foresee calamity but now that COVID-19 distress will be levels higher than ever which is true everyone’s into conspiracies. Truth there’s where the new rock stars right? Everyone’s looking to the truth there’s to find the truth. My dumb but my, my alien book. Use Your Illusion one hit number one on the UFO category above big hitters real, real big names in the you ufologists community. Thank you, by the way, for reading and reviewing the books. It’s a big to do this year has been crazy. I could tell you, I’ve had all kinds of people approaching me that I’d never had before. Now, let’s keep reading says okay basically says a country’s a handled pandemic. Well, we’re the ones that trusted their leaders and cared for the common good over the individual. So he’s saying, you know, this selfish? Me I’m out to get mine attitude isn’t good. It’s what he’s saying. He says that neoliberal Neo liberalism is defined as in his definition as free market capitalism, which is confusing to me. But that’s what neoliberalism is. He says we’ll have a rich redistribution of wealth. And later he tells you because COVID exacerbates the wealth status, the poor became poor, the rich became richer, which was true, right? You saw about how Elan musk and Bezos all made all this money this year. But he says that cannot be sustained. We will need social welfare programs to redistribute wealth to the poor. Any any makes a decent point wealthier people are, you know their home telework and being safe, but the lower income people they had to get out there the essential workers get up there in the in the restaurant, the food factory in the grocery store, you take on the risk and your well being. He’s saying this is something that will need to be reckoned. He talks about African Americans getting hit harder by COVID because of all those reasons we’ve discussed including poor nutrition. Let’s keep reading and see and and this is I’m going to take a minute a soapbox minute here and let’s read is what he says we value least economically the individual society needs the most sobering truth is that the heroes of the COVID-19 crisis, those who at personal risk, took care of the sick kept the economy ticking are among the worst paid professionals, the nurses, the cleaners, the delivery drivers, the workers in food factories, care homes and warehouses among others. It is often their contribution to economic and societal welfare that is the least recognized and I agree with them again another high five for me in the swamps to hear because a lot of people they they crap on servers and restaurants, fast food workers. Like Like all they’re just simple to just make me my burger idiot. Like, these are human beings like I hear it all the time. People dangling this 20% tip over their servers, not not seeing that they’re busy or whatever. And you know, he asserts that on top of not making enough money to live these people on top of that are working these higher stress higher anxiety jobs because they’re always one bad move from being fired. And being completely screwed. That’s I thought I appreciated that statement he was making I agree with him. Let’s talk about these dumb dogs are barking all day. That’s what I get. You know, I we rescued the shelter dogs and they got bad manners. I don’t know what to do. Okay, this is this dog’s been abused his whole life. She’s She’s rude. I’m sorry. I apologize. Let’s see what else what else what else what else. Um, he compares a hedge fund manager making millions. I’ll put in the economy at danger. Well, like the 2008 housing crisis, he bumps that idea up against a nurse, a nurse other risking their lives, to protect people for low wages. And he says that societal unrest will push to equalize this, that will happen, he says, says poor people are now poor. And what happens when there’s nothing when there’s nothing left you commit crimes. And your options now are increased lawn order that gives you your military police state or your social welfare state. That’s again, playing into this whole idea that there’s a new normal things are going to change. He is predicting the future, we’ll see if he’s right. old, old Santa Claus Schwab here, Santa Claus. He says that he lays out an argument. I’ll read, you know, I’ll make I’ll decipher this for you. And it talks about the Cold War. He said governments and capitalist countries were so worried by an internal communist rebellion that they put into place a state led model to forestall it, the system in which state bureaucrats managed large chunks of the economy ranging from transportation to energy stayed in place well into the 1970s. What he’s saying, and I don’t know that he’s wrong, is that we’re already in some kind of quasi communist type of economy. And that big traumas like wars, will or pandemics, they will roll out more social programs. The Great Depression gateway to social programs from cradle to grave with the New Deal, the Cold War threaten the the full blown communist takeover the economy, so the government beat them to it. With state led management of the private sector, that’s your department of transportation and all that stuff. So in some ways, he’s saying we’re already there, it’s, this is just going to tip the scales a little bit more. He lays out how we’ve already had this massive dose of socialism to prevent these meltdowns. Yeah, that was the financial crisis with the, you know, the too big to fail stuff. And then the stimulus with the COVID-19 thing. And he argues that the reason the great reset will happen, because, inevitably, with all this calamity, the government must take a larger role in the social issues. Because of all the, you know, exacerbation of things that the pandemic causes. He’s telling you big governments coming in, he wants you in the big global government. But maybe they’ll settle for something a little bit less than that. He said, we went through this high trauma event. And now we have to manage that risk better. Because you know, what’s going to happen now that we see the okay global pandemics can happen? Well, that’s going to increase the bureaucracy, it’s going to increase the groups that monitor this stuff and the response and all that. And I don’t know that that’s bad. Now, what’s reassuring, is that I’m gonna read you from this. This is a little bit of reassurance. He says inevitably, and understandably, a good social contract for China will be different from one for the US, which in turn will not resemble that of Sweden or Nigeria. However, there could all share some common features and principles to a particular standout, a broader if not universal provision of social assistance, social insurance, health care, basic quality services, to a move towards enhanced protection for workers and those currently most vulnerable, like those employed in the gig economy. So I mean, that’s reassuring to know that like, they don’t want those glow. I mean, they want a global umbrella, but they know that we’re all gonna do this under different timelines says countries that perceived at providing subpar response to the pandemic, many citizens will start asking critical questions such as why in the midst of the pandemic, my country lacked mask respirators and ventilators. Why weren’t we prepared? Bah bah, bah. And then it talks about how COVID revealed gaps in the most welfare systems. At first glance, the nations that reacted the most inclusively were those with elaborate welfare systems, most notably the Scandinavian countries. To provide an example as early as March 2020, Norway guaranteed 80% of cellphones. employed workers average incomes based on the tax returns of the previous three years, while Denmark guaranteed 75%. At the other end of the spectrum, the market oriented economies played catch up and showed in decisiveness and how to protect the most vulnerable segments of the labor market. So on a song, because, you know, they have that people always point to the like, Oh, look at Sweden, they they didn’t shut anything down. They just went for herd immunity. Well, they also had a bit of socialism over there. So like, it’s not apples to apples, right? The guaranteed incomes over there. Okay, you can have a full open thing, but like, will pay to stay home and I bet a lot of people stay at home. Right? I don’t know. Um, let’s see. What else do you got among the rich countries only the US has a system that leaves it at the discretion of employers to decide whether to provide paid sick leave. In 2019. almost a quarter of all US workers did not benefit from it. In March 2020, when the pandemic started to rage in the US, President Trump signed into law new legislation, the temporary temporarily required employers to provide two weeks of sick leave, plus family leave at partial pay, but only for workers with childcare problems, excuse me. Two things here. sick leave in America is again part of our weird work mentality that I’m not saying hey, I’m not saying it’s wrong. And you’re talking to a guy who’s held a steady job since I was 13. So don’t take this as some softy weak thing. I’m just saying that in America like we shame people for not coming into work sick. Isn’t that stupid? That if somehow if you’re sick and or you don’t feel good, and you stay home, that somehow you’re not committed to the job. When To me, that’s always been the rudest thing ever. When people show up sick, I’m like, go the hell home. What are you doing? And they’re all me who’s gonna sack up and come into work? Like, no, you’re an asshole. You’re not thinking of anyone else. You’re gonna make us sick. We all got to deal with your poor decision. Stay home with you. I know. You don’t want to hang out with your kids stay home with them. I don’t care. I don’t want your virus. Give it to your kids. Oh, and to another point, Trump pushed us down the path of socialism, if you want to be technical about it, because this is part of the great reset, giving sick leave to people. Yeah, what about that? What do we think about that? Now, let’s keep reading. This is all made more significant by the fact that the younger generation is likely to be more radical than the older one in refashioning the social contract, the pandemic has upended their lives and a whole generation across the globe will be defined by economic and social insecurity. With millions dude enter the workforce in the midst of a profound recession, they will bear the scars forever. Also, starting off in a deficit, many students have educational debts, likely to have long term effects. Already the millennials, at least in the Western world are worse off than their parents in terms of earnings, assets and wealth, they’re less likely to own a home or have children than their parents were. Now another generation Gen Z is entering a system that sees that it sees as failing and that will be be set by long standing problems revealed. And this is another big thing, right? Another big topic. You got these boomers out there living their best lives down in Key West on their jazziz You know, they’re doing it. Well. They didn’t have to do as much college. They retired at a reasonable age with a pension. And, you know, I look I’m, I’m, I’m like on a cusp of Gen X and millennial and Gen X technically. But, you know, I got a master’s degree $50,000 in school debt. And I’m working literally, I literally took the position of a woman with no degree whatsoever. She retired and I got to take her on her spot. I was like, Oh, that’s cool. You know, it’s, uh, and you know, these jobs. They don’t offer pensions anymore. They offer 401 K’s. So I agree with old Santa Claus here, Santa Claus. Same with the housing crisis. I lost 1000s and 1000s of dollars in the housing crisis. We bought our first home and then everything tanked. I mean, if you had to quantify it, I would say maybe 80 grand and the problem is that Housing is one of the the best and only methods that a lot of people in the lower class have to move up. Right? And why did that happen? Well, it collapsed because a wall street greed, they’re messed around trying to regulate, you know, the are trying to sell off, what do you call it dividends or whatever, not dividends, you know what I’m saying my brains get mushy towards the end of the show here. But they, they actually had laws to regulate this free market, but those got lifted out. And now we all get to deal with the the, with the nonsense that ensued. Good times. So he’s saying like, on one hand, the younger generations, they don’t expect to have these things, and they don’t even care. And it’s true, like, they don’t even want a house, they’re like, I don’t want to deal with it, give me an apartment, I don’t care. And that’ll fit nicely in with the World Economic Forum’s plan for everyone. Here, he calls out social media as a catalyst for change. And it you know, to me, it’s arguable that it can be manipulated by corporations or special interest groups, as you saw on that Netflix show. This was called the social dilemma. So that’s a concern for me. He’s a he says social media is the big catalyst for change. And he’s right, that’s where people go. But you’ve got a lot of fingers in that pie. He talks about global trade. And it’s kind of boring. See, the rise of nationalism makes retreat of globalization inevitable and most of the world an impulse particularly notable in the West, the vote for Brexit and the election of Donald Trump, on a protectionist platform are two momentous markers of the Western backlash against globalization. And then, previously, he said that the pandemic will definitely cause a retreat from globalization. He said that the Brexit and Trump showed the western world’s denial of globalism. And it’s either he’s saying we’re not actually going towards globalism, which, you know, to me is like, well, that’s a good thing, right? Like he thinks is a bad thing. But like, as far as like, the truth is goes like, that’s a good thing. Right? Like, if, if Santa Claus is saying, We’re retreating from globalism, then I guess that’s good, but they are trying to figure out a way to pull us back in No, you think you’re out and they’re gonna pull you back in with aliens or COVID, or whatever. And he talks about how you can do this, or you can de globalize, it’s going to take a huge investment of money to shorten the supply chain. And COVID made this more enticing, right? Because now, it’s worth all that money to restart the manufacturing in America. Remember the masks, we couldn’t get mask. So in some ways, COVID helped America break out of this globalization scheme. If you want to put a you know, if you wanna make lemonade out of this a little bit. And here’s one you’re gonna love, because he defines global governance. Okay. So this global governance is commonly defined as the process of cooperation among transmit transnational actors aimed at providing responses to global problems, those that affect more than one state or region. It encompasses the totality of institutions policies, norms, procedures, and initiative, through which nation states try to bring more predictability and stability to their responses to transnational challenges. Then he says, sadly, we’re in talks about the problems so sadly, we’re now at this critical juncture put bluntly, we live in a world in which nobody is really in charge. Like if you dude, want control who wants that? But like, you got to understand the mindset of these folks, these globalist You know, they’re a big hammer and every every country’s a nail, and they just want to consolidate and control and they think they have noble reasons for doing it. Like I said, I think, I think they buy into the population control idea, and climate change, and they say, look, these idiots are gonna, they’re out of control. And we’re gonna go extinct, if the masses have it their way. He’s not entirely wrong. But he says, code would have been handled better if we had a global government watching over and coordinating. I mean, is he right? Okay, the World Health Organization. That tedros guy, some was he’s like some Ethiopian terrorist or something in bed with China, who told you back in January, he’s like, Oh, no, there’s no human to human transmission of the Wu Han flew, everything’s fine because the allegedly China’s paying them off to say that. And the fact is, is they knew back then what it was. So like, do we really trust that I don’t I don’t, then let’s see. Oh, yeah. And then another. You remember When, when, you know, and look, I’m not saying centralizing power is terrible. So like back when Trump was like, you know, each state is going to manage their own COVID situation federal government’s not getting involved. And the state governments, they were freaking out, they were trying to outbid each other for ventilators and PB on eBay, driving the prices way up. So sometimes you do need the adult in the room, right? I’m not saying like this is a one an either or argument, okay. And in fact, he defends old Santa Claus defends the World Health Organization says they’re underfunded. They collect info on a voluntary basis. There’s no mandate to, you know, send information through the the who. But there’s a lot of weird things with who that’s another show on its own right. Let’s see, I wrote a note here. Let’s say let me read. They will also agree with Winston Churchill who once observed that the US has an innate capability to learn from its mistakes, when he remarked that the US always did the right thing when all the alternatives have been exhausted. Old wisdom Churchill’s funny, right. He lays out an interesting article, because he’s trying to defend the idea of global governance, with global issues like climate change, and environment and all that stuff. And he talks about zoonotic diseases that spread from animals to humans. He says that most experts and conservationists agree that they have drastically increased in recent years because of deforestation, a phenomenon also linked to an increase in carbon dioxide emissions. And he says that basically makes, you know, take out the animal’s habitat, and now they’re encroaching upon human civilization. And this is an interesting idea, because that’s what you see at the end of contagion. I know if you listen to my contagion film analysis I did back in was April May, like a real psychopath in the midst of a scary pandemic unleash. But at the end of the film, you see the bat that started the whole thing. He he flies away from his habitat, because they’re, they’re busting down the forest to you know, get palm oil for the Orioles or whatever. But he makes a good point here, you you destroy the animal’s habitat, it’s a twofer. You have more carbon dioxide in the atmosphere. And now the animals encroach upon civilizations sharing their viruses that we there’s billions, apparently like millions of viruses out there in the wild that we don’t even know about. And we’re basically forcing them upon us. The bubble bowl, they talk about the land use, Okay, here we go. Since 1970, land use changes have had the largest relative negative impact on nature. And in the process caused a quarter of manmade emissions. Agriculture alone covers more than one third of the terrestrial land surface, and is the economic activity that disrupts nature the most. So what’s he saying? Well, and I’ll start investing in the plant based meat. I mean, this is a good argument for how the population growth, you know, it’s exponential, and you can’t support feeding meat to them. And if people not humanely treated appropriately raised meat. At best, you might be able to support this with factory farms, but that’s not healthy for the cows. They got, you know, these cows, they got like three stomachs and they pump them full of corn. And their stomachs are made to digest grass, not corn. So they abscess and they get infected. And instead of like, saying, oh, maybe we shouldn’t feed them corn. They feed them antibiotics. The problem with full antibiotics to keep them alive. No, it’s true. So yeah, support some of what old Santa Clauses saying over here. Here’s another shining light at the end of the tunnel for you. Because you’re being scared of all this great reset talk. He says some of the old habits will certainly return the joy and pleasure of personal contacts can’t be matched. We are social animals. After all, many of the tech behaviors that were We were forced to adopt during confinement will be more familiar. You know, good to know. He understands that and he’s not one of these. I mean, some people want to portray these globalists as like embracing this virtual reality. Let’s not talk to each other face to face ever again. Thing Even though he does cause animals like a Satanist would, let’s see. And then he says successful contact tracing proved to be a key component of a successful strategy against COVID lockdowns are effective at reducing the reproduction rate of the virus, they don’t eliminate the threat posed by the pandemic. And again, this is the your trading safety for privacy. Right? The contact tracing tool, the way I look at this is they’ve got a multi faceted approach, how can they keep the deaths down of COVID? Well, to keep the deaths down, it’s directly proportionally ratioed to the number of cases, right? So in effect, how do you keep the cases down? Well, you can lock everybody in their home, that’ll do it. You could give everyone a vaccine to make the antibodies so that it doesn’t affect them and they don’t get sick. You could put a mask on them to reduce the risk of transmission. If that works, if that works. But like to me, I’m like, that’s why I’m always like team mask, because I’m like, Look, if this works a little bit, I’ll do it. Because I don’t want the stabby I don’t want the contact tracing. I don’t want none of that. I don’t want to lock downs. I want to keep the economy fired up maybe as much as possible. Not I just don’t know why. That’s such an insane, controversial statement. I got so much hate for that. I don’t know what to tell you. Let’s see here. Oh, listen to this. Get this. From the outset. China, Hong Kong and South Korea implemented coercive and intrusive measures of digital tracing. They took the decision to track individuals without their consent through their mobile and credit card data and even employed video surveillance in South Korea. In additional, some economies required mandatory wearing of electronic bracelets to alert those individuals susceptible being affected, blah, blah. See, like, That’s what I’m saying. Like the some of those countries did really well, they kept their numbers down really well. But that’s a level of intrusion that I think is a bit overboard, myself. And again, that’s why I’m like, Okay, I’ll do the math, like, I’ll meet you guys halfway. But don’t be putting a bracelet on me and tracking my phone, you know, they’re already tracking on your phone, you already know they’re doing that, right. And he goes through a whole section on surveillance. And like, he’s actually fairly level headed with this. He kind of points out the pros and cons. And the idea that like, there’s a certain level of dystopian surveillance that people won’t like. I don’t know he, he fairly cites the drawbacks of surveillance, but he sort of concludes it’s worth it. Right. So like, it’s, it’s nefariously. Put, it’s bad. Like, he’s like, well, it’s kind of bad, but it’s worth it. So like, on one hand, at least, he’s like, not trying to like, pull the wool over your eyes and be like, no, it’s great. You’re gonna love it. Look how great this is. So on some levels, I appreciate the candid honesty there. But I don’t like it overall. He talks about a stake this thing called ESG. Right. It’s your environmental, social and governance score. And this is a you heard you heard about the Chinese social credit system, right. I was like it was that meme. You heard of Elf on the Shelf? Well, what about he, he has g it’s a it’s a social score. But for companies. That’s where this is going to start out. They’re going to start out with a social score for companies that I worry is a slippery slope to every individual having their community score. Good intended ideas. takes us down the wrong path, though. And any rightfully points out that like some of the corporations did some naughty things. He says businesses will be judged for years to come by their actions critically, not just in a narrow commercial sense, but through a broader social lens. Few will forget for example, it over the past 10 years us airlines spent 96% of their cash flow on share buybacks and that in March 2020, EasyJet paid 174 million pounds out to its shareholders. And I looked it up. Yeah, that’s true. Here’s a Forbes article I’m going to read you from Not everything can be blamed on the virus. COVID-19 may have been the last straw but Boeing made some poor decisions including CEO turnover. accusations of mis selling at 737 Mac’s jets, faulty software and spending over $11 billion to buy stock back. And, you know, the buybacks, those were illegal until your boy Reagan till the occultist Reagan showed up in the 80s. Because I had to look that up too. I didn’t know what that meant Exactly. I’ve heard the term I didn’t really know what it meant. It kind of is what it sounds like. companies, they buy their own stock to make the stock price go back up. And they save money because now they’re not paying dividends to the shareholders. Okay. Here’s some more fodder for the idea that things will never be the same. In France in the UK, several industry voices estimate that up to 75% of independent restaurants might not survive the lockdowns, the large chains of fast food giants will this gray write. This in turn suggest that big businesses will get bigger while the smallest will shrink or disappear. A large restaurant chain, for example, has a better chance of staying operational as it benefits for more resources and less competition in the wave of bankruptcies of smaller outfits. Small restaurants that survived the crisis will have to reinvent themselves entirely. In the meantime, in those cases of those have closed the doors forever. The closure will impact not only the restaurant and its immediate staff, but also all the businesses that operate in the orbit the suppliers, the farmers, the truck drivers. So again, he’s talking about your your primary effect, your secondary, your tertiary effects is ripple effect. This is going to play a part on if you noticed, anytime you like buy something, it takes a lot longer customer services a lot longer now. Because of all these ripple effects, there’s no point there’s you’ll hear a lot of truth there’s talk about how how Santa Claus wants you to not fly as much. You’ll hear that a lot. And here’s where the expert I believe they’re referring to. If many businesses decide to travel less to reduce costs, and to replace physical meetings by virtual ones whenever possible, the impact on the recovery and profitability of airlines may be dramatic and lasting. Prior to the pandemic corporate travel accounted for 30% of airline volume, but 50% of revenues, thanks to the higher price seats and last minute bookings. In the future, this is set to change, making the profitability outcome of some individual airlines highly uncertain, and forcing the entire industry to reconsider the long term structure of the global aviation market. So that’s that’s what he’s saying. Like we’re gonna fly last because like there’s a huge impact on the airlines because of this. Same boom, three industries that entirely depend on the aviation sector, airports, infrastructure and retail planes, aerospace and car rentals. So I think he’s saying like the ripple effect of all this is what’s going to make you fly less, because the prices are going to go up. Here’s some more ripple effects. He says, it could also be the case that less money will be spent in restaurants suggesting that in places where a high percentage of people’s food budget traditionally went to restaurants 60% in New York City, for example, these funds could be diverted to end benefit urban supermarkets as city dwellers rediscover the pleasure of cooking at home. And like the section is talking about people you know, doing it yourself, do you like to do it yourself? During the shutdown, he talks about how people are doing it yourself with baking bread and cutting hair and making food and buy online. And this will ripple into people buying more groceries online and smaller grocery stores. Also, damn do people in the big city really spend 60% of their food budget at restaurants. That’s crazy to me. I mean, I guess that makes sense. You don’t want to lug Costco sized grocery stuff in your little shoebox apartment. But damn, how do you not get fat eating out that much? Right. Then he talks a little bit about the digital revolution, which we’re going to get into on the next show where we’re going to go through another one of Santa Clauses books called the the fourth industrial revolution. That’s where we’re getting into more of the transhuman elements. And he kind of he glosses over it a little bit in this book. No need to get into it right now though. There’s more fodder for the idea that things will won’t be the same again. He says the micro reset will force every company in every industry to experiment new ways of doing business working in operating. Those tempted to revert to the old way of doing things will fail. Those that adapt with agility and imagination will eventually turn COVID-19 crisis into their advantage. And what he’s saying is like this was a huge like an overnight shock. To the system. I mean, overnight. It forced every person, every business to find a way to incorporate digital internet technology into their life. overnight. It’s like someone snapped a finger. And now you know you grandma’s Watson Pornhub She didn’t even know how to work an iPhone nine months ago. Now she’s out of control. But no, that’s what they’re saying is like, this is the great reset. It’s true like it forced a lot of people to play catch up real quick. They talks about the psychological impacts of this whole thing which you’ve heard about. Says psychologists tell us that cognitive closure often calls for black and white thinking and simplistic solutions. A terrain pretty boy, why God made me look stupid Santa Claus propitious for conspiracy. Okay, let me restart this. Psychological psychologists tell us that cognitive closure often calls for black and white thinking and simple solutions, a terrain for conspiracy theories and the propagation of rumors, fake news mistruths, another pernicious ideas. In such a context, we look for leadership authority, clarity, meaning the question as to whom do we trust is critical in consequence, so too, does the countervailing issue of whom we distrust or what he’s saying during stress, people want certainty. They want some cognitive closure. They want black and white answers. They want to know is COVID good for you? Is COVID bad for you? Is COVID real is COVID. Fake? They look to people for answers. Like the truth. There’s like Dr. Andrew Kaufman, who assured you this was fake. So you could be like, yeah, COVID fake, it’s not real. This is why people are doubling down. And that’s a dangerous thing to do when you just double down and don’t look at any more evidence. They’re committed to it. They don’t like the gray area, they need that closure. And this is how you get taken advantage of. They found any conspiracy theory to support the reassurance Oh, it’s a liberal hoax all its going away in Easter all it’s going away in spring all it’s gone away and summer. I mean, there’s people who refused to believe that Trump could lose the election. There’s people who refuse to believe in the virus. Because they’re mentally committed to a version of reality, their thoughts become beliefs become reality. But the problem is that reality doesn’t clash with the consensus reality sometimes. Right? You can become too attached to an idea sometimes. Sometimes your filters are a little off. Trust me, I know myself. My filters are off many times, but you got to pivot, you got to be agile. Now, he claims that during this time, a lot of people are doing a lot of reflecting on what’s important in their life. We’ve been pondering utilitarian values our lives, our human lives worth the exchange for money, the economy, the way things always were normal, normal normalcy. He talks about in the book, right? And he says as we said earlier, almost all economists have debunked the myth that sacrificing a few lives will save the economy. But irrespective of those of these experts judgment, the debate and arguments went on in the US in particular, but not exclusively. Some policymakers took the line that it was justifiable to value the economy over life endorsing a policy choice that would have been unimaginable in Asia or Europe, or such pronouncements would have been tantamount to committing political suicide. This realization probably explains UK minister Johnson’s hasty retreat from an initial policy advocating herd immunity, often portrayed by experts and the media as an example of social Darwinism. Isn’t that one of the big evils we talked about? Social Darwinism is not like a Hitler thing eugenics thing like well, you just let the week die. That’s what you do. You let him die and you keep the economy fired up, baby. But you know, Dr. Evil here, all the Santa Claus. See, he tells you that’s not the way to be. It won’t be that simple. And I know what you’re thinking you’re thinking but Isaac, locking people down a bad economy, all these things that’s going to kill people too. Well, guess what? Your boy shadow clouds. He knows that. And he wrote about it right here and I’m going to read it. To the argument put forward by some groups, like americans for prosperity is that recessions kill people. This well, undoubtedly true is a fact that is itself rooted in policy choices informed by ethical considerations. In the US recessions do indeed kill a lot of people, because the absence or limited nature of any social safety net, makes them life threatening how, when people lose their jobs with no state support, and no health insurance, they tend to die of despair through suicides, drug overdoses, alcoholism. Economic recessions also provoked deaths outside of the US policy choices in terms of health insurance, and worker protection can ensure that there are considerably fewer. This is ultimately a moral choice about whether to prioritize the qualities of individualism, or those that favor the destiny of the community. And what he’s saying is he’s like, these reflections will make it more appealing for some, to have a socialized medical insurance. Because there’s going to be a recession, there’s going to be a dip in the economy, there’s going to be unemployment. And these people need taken care of. So on one hand, that that gets us into the global communism sort of argument. That’s his point, though. He’s saying that this is giving us time to reflect on what’s important in our lives. And on top of that, he’s saying that even if you open up the economy, do you no good anyway. That’s what he’s saying. Okay, let’s read Oh, this is good. masks, the big drama, the big debate on mass. You already know where Santa Claus stands on this, but let’s read it anyway. Just one simple example to illustrate the point. The World Health Organization and most national health authorities recommend that we were masking public side note, but you were called First they said not to because they were trying to save masks, but like, that’s the problem with these people. They they they don’t they assume we’re all morons. And a lot of people are morons. So what’s a fellow to do? Okay, just one simple example, then they recommend wearing a mask in public, what what has been framed as an epidemiological necessity and an easy risk mitigating measure has turned into a political battlefield, in the US, and also, but less so. In a few other countries. The decision to wear a mask or not has become politically charged, since it is considered as an infringement of personal freedom. But behind the political declaration, refusing to wear masks in public is a moral choice, as indeed is the decision to wear one. does this tell us something about the more principles that underpin our choices and decisions? Probably yes. So Klaus, he’s on Team mask, shaming those that aren’t suggesting it’s a moral choice, which is kind of what I think. I mean, even if it only barely reduces the chance of me giving it to someone like I’ll take it, I’ll take a little bit, right. It’s not that big of a deal to me. On top of that, you know, one time I was getting out of my car. Here’s a real bleeding heart story. I was in a grocery store, getting out of my car. Didn’t have my mask on yet. I was grabbing it because I’m not like in love with the mask. Some people were like, in their car driving around, like, that’s not me. So common sense about All right, get out of my car at all my mask on yet. And across for me is an elderly woman, I mean, really elderly, like she looked like 90. As she was getting out of her car, she had her mask on. And she gave me a look in my eyes, like she was terrified. And I was more than I was more than six feet away, I was just getting out of my vehicle to walk into put my mask on, right. And I felt really badly for her. And I thought this poor frickin woman man, this might be her last year on earth, and she’s got to deal with this pandemic. And that just to me, and you know, it’s my bleeding heart. To me that’s supports the idea, like, Look, even if the thing doesn’t work, like maybe this will make this woman feel better. This poor woman is her last year on Earth, maybe. And now she’s got to be petrified of every person and walking around her.\n\nfat out there, man. That’s, uh, he’s talking about the moral choice here, right? And I’m not I’m not shaming the people that are anti masks. I don’t agree with it. Like, Hey, I had a lot of people I love and respect that are anti masters. So like, that’s not what this is. But, uh, you know, the anti masters they do have a good argument that sometimes they they, they believe it’s a slippery slope into the mandatory stabby which could be true But to me, I’d like to believe we can do one another. The other. I think that the stabbings are obviously more intrusive. It’s not the same thing. It’s two different things to me. Why am I doing that? I already got into a 30 minute debate on Instagram about this\n\nwith any rifle, he points out, do you remember when, when this kicked off, Amazon wouldn’t allow price gouging for the basic necessities? Right? Remember that? Remember, the even corporate America with the retails chains and the grocery stores. They responded to the shortages by they didn’t raise the price of the goods like supply and demand would dictate. Instead, they limited the quantity that each customer could buy. You remember when that guy went around buying up all the hand sanitizer and he was trying to sell it for to make all that money? And then, you know, the government somebody stepped in and broke that up was like, hey, dickhead. Like those are all good things, right? The See, this is the great reset. This is more evidence. It was unheard of before you know you you base our country’s ideas on the free market laws of supply and demand. Now these guys are getting publicly shamed for doing this guy bought all the hands on, they shamed the shit out of this guy that forced them to give it up. I mean, what should we defend that creep? In the name of you know, this free market capitalism thing? I mean, maybe right, you could take that stance. I don’t like that kind of world though. Myself. He talks about how mental health is going to get worse. Right. Now I agree with that. I mean, especially this year to what a what a frickin mess. You know. I was just getting ready to start hugging people for the first time in my life and then this happened now like No, never. Because I’m not a hugger, right? I’m just not a hugger. And I was like, This is my year. That was my new year’s resolution. I’m going to start hugging people more Not anymore. No All right, let’s keep it moving. We got pages we got this book is long. I did you guys a solid reading this thing. Okay, here we go. Let’s keep it moving. He’s basically talking about how the great reset is a change of attitudes and perspectives. Mental Health being a huge component of this. He suggested mental health will the state of affairs will be worse, but we will devote more resources to fixing it. This was kind of like you know, we had all the mass shootings you want. You know, you want to reduce masters, you want reduce reliance on Big Pharma. You want less crime without an increased military police state. You got to get people mentally healthy. I don’t disagree with that. He says that, basically, people are going to be more creative during the pandemic. And again, just another idea of how things will be different when we come out of the great reset here. He talks about how Isaac Newton he come up with that whole law of gravity thing after during a during a lockdown during a plague during the plague. Well, let me read it. Maybe I’m wrong with that. Let me read it. He says, illustrious past episodes corroborate that creative characters thrive in lockdown Isaac Newton for one floors during the plague. And there you go. When Cambridge University had to shut down the summer 1665 after an outbreak knew went back to his family home and Lincoln Shire where he stayed for more than a year. Blah, blah, blah. Apple falls there. You know it didn’t hit him in the head. That’s a common wrong thought on that. It fell on the ground he saw unless the textbooks lied to me, which maybe they did. Who knows? Right? What do we believe anymore? Oh, here’s another interesting idea. He talks about he says a few analysts forecast revenge consumption taking the form of a surge in spending after the lockdowns in predicting a strong revival of our animal spirits and in return to the situation that prevailed before the pandemic. And that’s curious, right? Remember, Trump was saying he’s like, the economy’s gonna be on fire with this thing. And and here’s the big thing. Here’s what I want. Maybe you can remember I’ll try to remember after you know, we’ll say summer 2021. Is it right? Will there be revenge consumerism, because cloud all the Santa Claus here? He’s saying no. He’s saying, look, the the pandemic has shut things down. People have changed their perceptions on what’s important in life. Spending time with the family, non monetary things, and that won’t happen. That’s what he says we’ll see. We will see Okay, there go. final comment, because that’s basically all he’s talking about for a while, is these different ideas of things that’ll be changed. When we come out of the great reset. I’m going to read you a bit and then we’re going to wrap it up. That said, the great reset is far from a done deal. Some may resist the necessity to engage in it fearful of the magnitude of the task and hopeful that the sense of urgency will subside, and the situation will soon get back to normal. The argument for passivity goes like this. We’ve had we’ve been through similar shocks, pandemics, harsh recessions, geopolitical divide social tensions before we’ll get through them again. As always, societies will rebuild and Sobel, our economies, life goes on. The rationale for not resetting is also predicated on the conviction of the state of the world is not that bad, and then we just need to fix a few things around the edges to make it better. It is true that the state of the world today is on average considerably better than in the past, we must acknowledge that as human beings, we never had it so good. Almost all key indicators that measure our collective welfare have been continuously improving over past centuries, progressively, so in the last few decades, but they’ve been improving on average, a statistical reality that is meaningless for those who feel and often are excluded. Therefore, the conviction that today’s world is better than it has ever been, while correct cannot serve as an excuse for taking comfort in status quo and failing to fix the many ills that continue to afflict it. As economies restart, there’s opportunity to embed greater social equality and sustainability into the recovery, accelerating rather than delaying progress towards the 2030 Sustainable Development Goals and unleashing a new era of prosperity. What could make this possible raise the probability odds in favor of such an outcome? Now to the astute listener, you’ll notice he referenced the 2030 Sustainable Development Goals document. That’s the one that if you recall, mean, me in the guest, Johnny from Patreon, there. We were talking about that on a full episode. And like when you read through it, you’re like, yeah, these are all good things, you know, to take care of each other and take care of the environment. Recall that. We were talking about how it could bring him out the End Times. And that’s the fundamental idea behind this whole book. We need to look at these documents, these books and these ideas that these globalists are presenting and discern. Is this a nefarious trans humanistic satanic plot? Or are they just trying to improve the world? I like the idea of a reassessment against this unadulterated full market, free market capitalism at all costs. I’d like to reassess that. I’m not I look, I think America’s Got the greatest economy, the greatest sort of society that ever did it right. And maybe that’s my exceptionalism is my nationalism, talking, I don’t know. But like, we already have mixed socialism inside of our system baked into it a little bit. But I like I like the idea of trying to get the air trees, water animals, taking care of a little bit better. need for better mental, mental and physical health. I think unchecked free market capitalism will slice its own throat eventually, you keep squeezing out the middle class, and it’ll definitely eat its own in due time. So that’s the whole book. That’s the great reset right? on the on the face on the surface, it doesn’t sound that bad. It really doesn’t, when you read through it, but I’m here to tell you, my friends. It’s not bad. It’s bad. I mean, you got to stick with me through the rest of the shows to fully get a handle on why that is. On the end, like I said, this is I know so this is a heavy duty stuff for some people. That’s why I’m gonna put parts 234 and five on the Patreon and the rockfon. So if you want to support the research, the ideas me as a great podcast or host you know where to go patreon.com slash Illuminati watcher or rock fin comm slash creator slash Isaac, the links are in the show notes. Each has their own perks. I don’t care which one you choose whichever one you like, that’s the one you choose. rockfon is nice because you get one you pay one subscription fee, you get access to all the creators on there. You get Sam Tripoli from zero. You get Whitney Webb from unlimited Hangout. Jamie locks is on there. Now. I’ve got an exclusive show. I do a couple shows a month called inside the mind of a conspiracy theorist. I was talking to Jay Dyer recently on that show. about him hanging out with Alex Jones. Patreon is not going anywhere either though I’m doing both Patreon you get free ebooks. And both yet no commercials that’s worth something right? Patreon you get more of a community vibe. We do live streams, all kinds of stuff. Shout outs you get on the shout outs monthly. Yeah, if you if you pick up the support on those you’ll get. We’re going to talk about on part two. We’re going deeper into Klaus Schwab, the book he wrote on the fourth industrial revolution that gets into transhumanism, 5g, the Internet of Things. How does this all fit into the great reset? Well, it does. Then part three, we’re going to go over j dyers talk, we’re gonna talk about this World Economic Forum, eight point communist agenda, which to me is really terrifying. That’s when the insidious nature of this thing starts to unfold. Then we go back in time, we’re gonna talk about Bill Cooper’s Behold a Pale Horse and how he was right all along. All the things we talked about all the things Klaus Schwab wants all the elements of the great reset all the parts of the World Economic Forum, eight points. He was telling you this 3040 years ago. Then we’ll have a conclusion wrap up show.\n\nwe’ll we’ll wrap it all up with a bow. All right. I hope you enjoyed that. And look, if you want to go deeper, you can get his book. Oh, Klaus Schwab’s book. I just read you that was all the notes from COVID-19 the great reset. And now that fits into the larger picture we’ll understand in the future episodes. Thank you for keeping an open mind my friend. And until next time, stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Great Reset Pt 1: Klaus Schwab Book Club & the Illuminati Globalist Agenda! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we take a critical look at The Great Reset! I’ll read to you directly from Klaus Schwab’s book on the subject and we’ll start looking at the truther movement to see if they’re simply fear mongering or if their arguments have merit! I’ll be publishing […]", "url": "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-12-09T23:00:23+00:00", "article:modified_time": "2022-09-07T01:33:30+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2020/12/ctauc-great-reset-pt-1.jpg", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://Patreon.com/IlluminatiWatcher", "https://Rokfin.com/Creator/Isaac", "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/", "https://www.patreon.com/posts/44771065", "https://www.patreon.com/posts/44929076", "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/", "https://illuminatiwatcher.com/great-reset-part-5-generations-book-from-1991-predicts-the-future-q-anon-and-the-occult-fourth-turning/", "https://illuminatiwatcher.com/great-reset-pt-6-housing-market-crisis-renting-is-better-than-buying/", "https://gumroad.com/isaacw", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/42406075", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/?share=twitter", "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20The%20Great%20Reset%20Pt%201%3A%20Klaus%20Schwab%20Book%20Club%20%26%20the%20Illuminati%20Globalist%20Agenda%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fthe-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Brendan", "DADA", "Isaac Weishaupt"], "publish_date": "2020-12-09T23:00:23+00:00"}