{"result_id": "165018", "URL": "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon/", "timestamp": "2023-04-25 15:35:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Q Anon and the Occult Pt 2: Pepe the Frog, Sigil Magick, Order Out of Chaos & Steve Bannon!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we continue our journey exploring the idea of Q Anon as a PsyOp! This second episode goes into the origin of Pepe the Frog, Kek, the sigil magick utilized by 4Chan users, the “Feels Good Man” documentary, Ordo ab Chao and the idea that Steve Bannon MIGHT be Q!!!\n• *Super soft podcast t-shirts and pre-order signed paperbacks of USE YOUR ILLUSION I here: https://gumroad.com/IsaacW\n• Catch the first episode if you haven’t yet: Q Anon and the Occult Pt 1: America’s Secret Destiny, Resurrection of Osiris and Symbolism of 17: https://illuminatiwatcher.com/q-anon-and-the-occult-pt-1-americas-secret-destiny-resurrection-of-osiris-and-symbolism-of-17/\n• Listen to the interview with Professor Teitelbaum; the man who hung out with Steve Bannon! “Steve Bannon: Dark Age of Kali Yuga, Chaos Magick, COVID and the Occult with Professor Ben Teitelbaum!”\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Q Anon and the Occult Pt 2: Pepe the Frog, Sigil Magick, Order Out of Chaos & Steve Bannon!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nChinese virologist called Leeming Yon is in hiding tonight after criticizing the Chinese government’s duplicitous response to the one Coronavirus. Here’s part of what she said to Fox News.\n\nreason I came to us is because I deliver the message of the truth of COVID-19. If I can aid in Hong Kong, the moment I start to tell it, I will be disappeared and the kill, no one can hear me. So for this purpose, I like to go to us and tell the truth of the origins of COVID-19 to the world to make people understand how terrible how dangerous it is. This is nothing about politics. This is the thing about visor, all the human in the world can survive.\n\nFor telling the truth, the doctor says she’ll be quote, disappeared and killed. This is the government, the NBA And so much of corporate American so many of our politicians suck up to one that murders doctors for telling the truth. This doctor says Beijing is suppressing vital information about the virus.\n\nHope you’re ready to go deep, deep into the QA non conspiracy theory My goodness. Today we’re gonna talk about frogs. Magic, chaos. Steve Bannon. Oh my goodness. You know, blot spoiler, I think Steve Bannon is queuing on? Yeah, I think that this is all my opinion. So do with it. What thou wilt previously in the first part is you’re listening to part two, right? This is que nonexposed part two of a order out of chaos, which is the big theme of 2020. Previously in part one, which I’m sure you’ve heard already, right? You heard it right. You got to listen to it. Before you listen to this. For one, we talked about the foundations of America. It’s a cult destiny. Because the elites, the Illuminati are staring us down that path. The evolution of consciousness is upon us, my friends. They’re evolving us. All the mouth breathers out there don’t even know what’s going on. That’s okay. That’s okay. Just like part one. I’m here to tell you that this is a theory, a theory I’m building a built it. We’re not saying that I’m right. And you’re wrong. I’m not saying I support one candidate over another. Because politically, I’m neutral, always. daiya unaffiliated. You look at my voter registration. That’s what it says. This is a theory that we need to take a look at, I think, see what you think though, you know, choose, choose your path. Choose Your Own Adventure. I say. I’m here for the Constitution. America, Americans and all their glory. Someone cue the Star Spangled Banner. I got my flag draped around, I got my Eagle perched on my shoulder. Seriously, though, I am concerned, you know, like we need to we need to be vigilant. We need to make sure there’s no coup de todos or overthrows of the government. And this is our duty, I’d argue. But this is all my opinions, who cares? Take from what you will enjoy your time with me listening. And in that first part, we talked about Francis Bacon. He said America was the new Atlantis because that was the whole idea of part one was to say like, Look, if we believe in an Illuminati, we have to believe that they set up camp here in the great country that is America. Because they’ve been talking about it. Thomas Jefferson, the third President of the United States wrote, quote, bacon, Locke and Newton, I consider them as the greatest men that have ever lived without any exception. And as having laid the foundation of those super structures which have been raised in the physical and moral sciences. See, he calls bacon as number one. Francis Bacon who is tied in all this stuff. All these occult concepts we’ve talked about for so long as same as Isaac Newton. Doing alchemy and stuff. Because alchemy plays a part in this too is you’ll find out today. What was curious was I actually recorded the first part, and it was in the editing stages where add like some audio clips and such. And on September 18, a guy named Bobby he slid in those dmws He sent me something shocking. And I couldn’t believe what I was reading. Basically, I’ll give you the short version of it here that some Chinese virologists released a paper on September 18 2020. It claims COVID-19 was manufactured in a Chinese lab. And these biologists have fled China for their safety and are in America right now. One of them Li Ming Yan went on Tucker Carlson and said that the Chinese government released this manmade virus on purpose, which I don’t know if you’ve heard those theories. They claim that they do this sort of thing over there to keep the population down. All them elderly folks that over there bogging down the system with their Rhino boner pills or whatever it is they do, that they keep the population down with us. That’s a theory. I’ve no idea if that’s true. I know nothing of China or the Chinese government. But that’s the that’s the claim that this virologist from China said on Tucker Carlson. Well, turns out the virologist, they work for groups called the Rule of Law Society and the rule of law Foundation, which sounds very much order out of chaos. Right? Very order. That’s where we’re being presented with is the approach of order and law and enforcement and control. authoritarianism versus pure chaos. Well, it turns out these groups were co founded by none other than Steve Bannon. He was the director of these groups until he got arrested in August. He got arrested by the way for fraud on the build the wall campaign, I guess I didn’t follow the wall thing I know. That was one of the big things when when President Trump got elected, he promised he was going to build a wall and Mexico is gonna pay for it. And then somewhere along the way, they started a fundraiser for it. I guess I don’t understand it. I don’t follow the news like that. The issue here is that the mainstream media says there’s no evidence of a lab release. This is fake news entirely. But the Trump administration was pushing a theory about this COVID lab created virus back in May apparently, it’s what what it says here on the Yahoo News. Nasty ban and he founded those rule of law groups. He co founded them right. Well, who did he co found them with? Well, it turns out a Chinese billionaire named Google wing boy wangui wink, Winky. Winky Yi. And this guy also started a site called g news that was pushing fake news, quote, unquote, and the COVID Lab conspiracy. And Google, Google Wang Yi moved to New York back in 2014. Now, is it true right? Is it true that this lab in Wu hands created this virus? Well, according to the news, the mainstream media, they say that the papers presented by these Chinese biologists are not peer reviewed, nor are they in published magazines or journals I should say. Then they cite some science nerds. Karl Bergstrom says it’s a bunch of BS. I’m paraphrasing. The official theory that they seem to be in support of is that COVID originated from bats. And one theory was that the bat was the bat with the COVID was in a lab being studied, and it got leaked. That’s another theory. But a US epidemiologist says it’s highly unlikely this was a lab accident, because and this is the funniest part. There is a stringent safety protocol there and Wu Han Oh, I’m sure. I’m so sure. It’s so stringent, so safe. What could go wrong? Like I told you back in January, these nerds are gonna kill us off. And it’s true every day. I told you, they were going to do it. Because if you looked up gain of function testing, you would know this and you don’t see that on the mainstream media. You know, they want us to believe them. They don’t tell you everything. There’s this thing called gain of function testing, where they accelerate the evolution of a virus from the animals to the humans. Instead of it taking, you know, thousands of years, they’re like, let’s do it in two months. So these nerves get in there and do whatever it is they do. And it’s very risky. It’s very dangerous. In fact, we banned it like in I don’t know 2014 or something. And then we unbanned it about I think was like 2018. You can look it up. It’s called gain of function testing. So I don’t trust these nerds. I don’t trust these labs. I don’t think anyone trust any of these stuff, right? Like these, these, these people that they put their heart and soul on this technology like it’s, it’s foolproof. No, it’s not. Technology is not foolproof. Now recall that and I’m not an anti scientist I’m just saying like you can’t hang your hat on it as the official end all be all I think your boy Oppenheimer, the guy that created the bomb the atom bomb. Did he say that to you said something to the effect of like science is beautiful but it’s not the answer to everything. Something along those lines he knew. I know, you know. Why is everyone so blindly trust the scientists like they know the answers, they change their tune every frickin year on everything. Anyhow, recall the Steve Bannon, he was behind the 2016 Trump campaign. This was also the campaign where they said Trump’s going to be the chaos candidate. And like I’ve been talking about all year 2020 is about chaos its order out of chaos. Order AB kayo is the motto for the 33rd degree Freemasons. If you look into Mackey’s Encyclopedia of Freemasonry, you will see the definition. I’ll read you from it now quote. The invention of this model is to be attributed to the Supreme Council of the ancient and accepted Scottish Rite at Charleston. And it is first met with in the patent of county de Grasse dated February 118. Oh two, when the grace afterward carry the right over to France and established a supreme council there. He changed the model and according to lenning, order ad hoc was used by him and his counsel and all the documents issued by them. If so, it was simply a blunder. Charleston, huh. That’s a curious name, right? Remember, remember when that little racist turd shot and killed the African Americans in the historic church in Charleston? In 2015, you remember it? Because that incident prompted the removal of Confederate statues, something that was going back and forth for a while but that really made it happen. Which led to the unite the right rally in Charlottesville. You know, the one where that white supremacist ran his car full speed into some counter protesters. killing one injuring 19 is the same one that Trump said, Wow, there’s some bad people on both sides there. Then the white people grab their tiki torches from suburban hell backyards marched because I wrote about this, not to sound like Nostradamus here. But back in 2015. I wrote about that Charleston church shooting. And I told you they were trying to orchestrate a race war. Based upon the symbolism. They say symbolism be their downfall. Well, I talked about it for many years. Because it was had it rise, symbolism is all over the place. It still is to this day, Rise, rise, rise. And that started back with your boy Charles Manson. If you recall, they wrote in blood on the wall rise as an order, according to the theory for the African Americans to rise up and kill the white man. Because Manson and his family according to the theory of Helter Skelter, we’re going to hide out the desert until all the white people were killed and then they were going to come out and be rain victorious over everyone remaining.\n\nCould it be?\n\nCould it be that symbols are playing a part in this? If you look at the story of Pepe the Frog, which we will it very well could be true. Now what’s curious in all of this, you go back to ancient Egypt and the Egyptology the God of chaos, who was that it was set Satan, as it were set, the one who slew who slain of Cyrus talked about that a lot. In part one. He was devious. He thrived on confusion and playing tricks on the people and of course, he was the one to become evil. And there’s a cool little podcast called mythology that has a lot of this interesting stories and reenactments of these things. I’m gonna play you a clip from Osiris and ISIS part one.\n\nAfter Osiris newt gave birth to twins, ISIS and neptis. These sisters were opposite in every way. ISIS truly cared for others. neptis thought only of herself, yet for all her selfish neptis was never truly malevolent, not like Seth. Seth was the last child born and the God of chaos and violence. From the time he was little Seth was devious and mean spirited. The foil to his virtuous brother Osiris, Seth thrived on confusion and love to play tricks on Gods and humans alike. In time, he would grow to become evil incarnate.\n\nNow Steve Bannon, let’s talk about Steve Bannon. Because I think he’s an occultist. Oh yeah, I believe that. He referred to Pepe the Frog. himself. The the Keck mean, Assemblyman helped Trump on the ethereal plane in terms of chaos magic. In Joshua Greene’s book Devil’s bargain, this is what he says your quote, man and was prepared to stick the alt right on paul ryan if he tried to steal the GOP nomination from Trump at a brokered convention. Pepe is gonna stomp their ass Bannon said, referring to the racist frog. So he’s very familiar with Pepe the Frog, right? a supporter, if you will. And some claim, I didn’t invent this idea. There’s something the Bannon is the head of the QA non movement. And I don’t know if he knows but he infamously connected into the gamer, 4chan nerd audience to get support of Trump after he was messing around with some gamers on World of Warcraft, where he was part of the scheme to mine gold and sell it to the players. So he already had hooks into this group, this crew. there’s a there’s a theorist named James true. He’s got a video and he asserts that this is all designers sign up and they’re using the Smith Montag to lie to us. Smith Monday that came up and my discussions with Charlie Robinson, he wrote a book on it as well. And you know, Steve Bannon did start a podcast, talking about these indictments that the QA non crews always talking about the indictments are coming, the Great Awakening. And the theory goes that Trump and the media are the bull as in jack keen, it’s just a spectacle left and right. galeon dialect, which is read up Steve Bannon zali like he knows all about making a spectacle of all this stuff. And on James truus video, he says that the indictments will be delayed until next election. So they can request another red wave to really get it done this time. Because that was the promise since day one. Is that this was all when we talk about the indictments, we’re talking about all the the child abuse stuff, we’re talking about Podesta we’re talking about Clinton elephanta all these pizza gate folks, which none of them have been arrested yet. So I agree with James Sure. I think that they’re, they’re they’re trying to be like, Oh, we just need a little more time. Come on everybody. It’s like Dude, you could have done it by now. Right. But David Church says that Bannon is tied into Harvard, which is the Underground Railroad for Zionism through Lex Wesner. This is the guy that had blackmail from Weiner’s laptop files. An Epstein and he had dirt on Clinton cashed in on all these things. And he asserts the ban and met Breitbart from you know, the website breitbart.com in Hollywood because Bannon is a showman on some sorts he’s tied into the entertainment industry to they created documentaries like the clinton cash documentary. And the band is tied into Cambridge Analytica, which was focused on changing population behavior through data metrics. There’s a former contractor Christopher Wiley who said that it was quote battens arsenal of weapon weaponry to wage a culture war on America using military strategies. So in Cambridge Analytica use AI and psyops to control the population and manipulate thought, which is, by the way why I think they’re programming the alien invasion because they perfected all of this kind of stuff with data mining. But anyways, this is behind the theory that Steve Bannon is part of the QA nothing, this is all part of the psyop because it all ties together you got a little bit of Hollywood, a little bit of 4chan, nerds, a little bit of data mining, a little bit of psyops It’s all here. Cambridge stole the Facebook data, we’ll bought the Facebook data ran it through AI and now the target personality traits to steer behaviors, which is what we talked about on the social dilemma episode. Now on James cerus video, he makes a statement about Bannon and Breitbart teaming up to take down the left using Hollywood tactics against them and asserts that they’re behind Citizens United. Well, that’s a curious Do you know, citizens united as well? I’m gonna tell you, it’s a conservative nonprofit group. they’ve released a ton of documentaries that are, you know, anti liberal Pro, all right. slants funded by the Koch brothers. Most notoriously, they are known as the infamous case of citizens united versus FEC, which basically ruined American politics and the elections because it allows corporations to claim that their people so they can donate to elections like people can and realize the hypocrisy here. The same corporations are saying that they’re just citizens and people can take your rights away, like how YouTube banned me. That doesn’t make sense doesn’t. If you want to take it to another level, you know, these, you know, grocery stores, can they’re owned by a corporation, they can tell you to put a mask on for all you Auntie masters out there. So like, if you think that corporations are the same as people, that’s a pretty warped view of reality, in my opinion. But nonetheless, they passed it because there’s all the money there right. Now, the Wikipedia for citizens united shows that they supported Donald Trump’s 2016 campaign, because you know, as the conservative, they’re a conservative group, right? Which makes sense. But what was curious was that they did this through a longtime friend of turning Dr. David bossy, who is the president of citizens united. Because bossy plays a role in this because he introduced Bannon to Trump way back in 2011. Because he’s buddies with Steve Bannon and Kellyanne Conway and all these folks. And David bossy might ring a bell because he was on fox news in 2018, and said that the black hole guest Joel Payne, was quote out of his cotton pickin mind. And that caused quite the stir as it should. Now, curious enough, one of the citizens united documents or documentaries called generation zero blamed the 2008 housing crisis against the boomers. Yes, the boomers. And Steve Bannon, guess what he helped create this documentary and he said, and I quote, baby boomers are the most spoiled, most self centered, most narcissistic generation this country’s ever produced. And that documentary, it describes how the 60s started to change in values that will be undone with a great crisis they refer to as the turning. They called the fourth turning and it’s a period of crisis. Every 80 years, America gets hit with a fourth turning that destroys the old order and creates the new one. Well, doesn’t that sound very familiar? Mm hmm. It’s from your boy Batman from his mind. In this generation zero documentary, Bannon, Kaiser states was quote, very familiar with Strauss and Howe’s theory of crisis, and has been thinking about how to use it to achieve particular goals for quite a while. historian David Kaiser who was consulted for the film reported the Bannon discussed with him what Strauss and Howe considers the past crisis wars, specifically the American Revolutionary War, the American Civil War and World War Two. geyser said of Bannon, he expected a new and even bigger war as part of the current crisis and did not seem at all fazed by the prospect. The 2017 reviewing the Washington Post aids ban and now seems to be trying to bring about the fourth turning folks. I’m gonna read that to you one more time. A 2017 review in the Washington Post states ban and now seems to be trying to bring about the fourth turning fourth, turning the great crisis. That because his beef, is that the 60s all these liberal hippies out here with their granola Love that change the values too much and needs to be undone. In his own words, the baby boomers the most self centered narcissistic generation, and this great fourth turning that he’s trying to bring about destroys the old order and creates the new one. Now, I interviewed Professor Ben Teitelbaum, and he talked about Steve Bannon, because he was hanging out with Steve Bannon for years. And he, he told me and it’s in his book warfare eternity, but you can I’ll put links in the show notes for the show where I interviewed him, I shouldn’t interview him for longer, I really regret that. But he talked about how abandoned subscribe to this idea of the Kali Yuga, the final cycle of mankind. And this all right, strange idea of how we become to material and we need to go back to a more authoritarian style of leadership to usher in the Golden Age. Which makes sense when you look at this generation zero documentary, and all the statements made there. What you have to understand is Steve Bannon subscribes to a thing called traditionalism. And if that doesn’t make a lot of sense to you, as it did not to me, I’m going to play you a clip from the interview that I did was Professor title bomb. Take a listen and see what you think. Wow. Okay, so a lot of ideas sort of floating through my head right now. Because, you know, originally, where I wanted this conversation to sort of touch on was with some ideas that I found. As I was reading your book, I was researching traditionalism, I was researching some of these figures you speak of like, reneging on and Eveleigh, I don’t know if I’m pronouncing that right. Julius Eveleigh. Yes, there’s all these figures, and George Giardello, all these figures that I’ve seen. I’m familiar with some of them, based on my research into the occult, and sort of this realm of conspiracy theory. And it seemed like there was there’s some kind of some kind of connection, some kind of, you know, connection between this traditionalism outlook, where you’re talking about these cycles of time, you know, we’re in this destructive Kali Yuga stuff. And then now, you’re you’re saying that, if I’m hearing you, right, that one of the ideas for people that are into this are to break down these, what do you call the masses of bodies or whatever, where you, like the EU, for example, break down to have a more localized government. And when I when I study, in your book, it makes reference to the these ideas that the traditionalist sense is thinking that we lost our way because of modernity. And really, we lost some kind of true spirituality. That was, you know, long gone. And I think of alchemy, which I believe is even referenced in the book, I could be wrong that but but, uh, you know, an alchemy, it’s all about breaking down. And, you know, rejoining sort of like, what you’re talking about here with traditionalism? So, I do want to ask if, you know, I don’t know, your background on research in the occult, but some of the figures you mentioned, have have influenced in this realm of the occult is there, you know, and this might be too vague of a question, but like, what do you What’s your take on this strange connection that Steve Bannon has with the world of the occult and the traditionalism?\n\nI mean, there are a number of ways I can take this this question. I mean, first, you’re absolutely right to notice a link here.\n\nJulius Eveleigh was very much a participant in, in what I understand to be occultism.\n\nYou know, Steve never wanted to join anything. He said that to me many times, that he never wanted to, you know, join a club.\n\nYou know, and a lot of you know, contemporary occultism is, you know, socially practiced. He did, he did associate a little bit with some circles involved in the preservation of gurdjieff legacy.\n\nBut, you know, otherwise he was he was steering clear. I mean, where, where this enters with, with Steve, if we want to talk about occultism or esotericism is in some senses a little bit more helpful. way to think about this, is that, let’s say esotericism is about recognizing celebrate getting rejected knowledge. Right and and that if that’s the general definition, the more specific one one that is usually of more value to us is to think about esotericism, as engaging with, with knowledge that was rejected by Western modernity. So by enlightenment era science,\n\nwe should recognize off the bat and of course, I don’t want to group everyone who is interested in occultism, or esotericism, into one into one basket by any means. There are a lot, there’s a lot of ideological diversity there. But one of the ways that you can go with that is to say, Well, this is this is a particular Avenue toward anti establishment practices and viewpoints, if it’s a rejection of some of the precepts of Western science, that can also be folded into a rejection of standard notions of expertise, and our society. And it might be folded thereafter into rejection of elitism. That part of the path that Steve Bannon took between traditional ism and populism as he calls it,\n\nwhich is an extremely unintuitive path, I mean, traditionalism, a lot of it is expressly elitist\n\nstrives to see the creation of an elite, but he does have his own take on it. But for him that’s looking at his history, that’s the red thread that I see is that here was a person early on was not satisfied with conventional religion has all of his zeal for being a Catholic notwithstanding, and who was not ready to endorse the expertise of scientists, actually, in other other person experts in our society, and that, that led to, you know, an interest in alternative spiritualities that led to an interest in occultism, and meditation and in practice, and as unintuitive as that may feel to us, for him. It doesn’t seem like a huge leap to have gone from that rejection of authority and modern authority to a populism that wants to see the political order destroyed. So we’ve just heard the influences on Steve Bannon with his ties to traditionalism are guys like Julius Eveleigh, George Jared F. Rene gay gnome. They buy into this idea of cycles of time and the Kali Yuga as a destructive cycle that Oh, by the way we’re currently living in and they think we need to break down the masses of Bonnie’s the big global governments for more localized governments, these are you know, he’s referring to the EU, the UN CDC, the World Health Organization. I mean, stay with them what you will but like, that’s what they subscribe to. They think that we as humanity have lost our way through modernity. And we need to get back to the true spirituality and alchemy, alchemy, of course, being solvent, coagulate, dissolve, and join together. All these ideas point to this theme of destruction, chaos unraveling, to rebuild. Now Professor Teitelbaum said that Julius evelo was into the occult. And Steve Bannon told him personally he would never join a club, which is kind of what a cults do, right? cultists. But Steve Bannon knows all this stuff. He was studying Jared F. And we talked about the idea of esotericism as a celebration of rejected knowledge that Western modernity pushed aside. And Bannon could be using it as an avenue to reject today’s society, including our experts today. But you have to understand traditionalism is elitism. It establishes the elite when he talks about the Golden Age, because that’s what they want to do. He wants to he wants the chaos, to break down the world chemically to rebuild it for the elite for the Golden Age, not for you for them says that the conventional religions and experts in science and society are flawed. And is that now what we’re witnessing? Present presented with I should say? And I’m not saying it’s entirely wrong. I questioned everything, but I’m not throwing it all away. It’s kind of like the vaccine. The stabbings. Excuse me. It’s like the stabbings okay. I don’t want them. I don’t agree with them. But my final takeaway after studying it was their kind of safe and kind of effective, kind of like how a gun loaded with just four bullets is kind of loaded. I’m still not pointing to my head. No, what I’m saying. I don’t think like all these doctors are morons, like, clearly they’ve studied this stuff. I think there’s like a middle ground of belief, right? But not according to traditionals. They think everything is so wacky and off balance, we got to burn it down to the ground. Which leaves one to embrace the occult practices. And how does all this fit? Well, there’s a term called a useful idiot. And that’s not like a derogatory as it sounds right, or inflammatory. It’s a political term. And it’s, it’s sort of using a person a leader, to push certain goals for another group without the leader even knowing what the hell’s going on. And that could fit into our scenario, right? Here’s a final quote on on this warfare eternity book by Professor title bomb. This is a good quote here the view that technocrats have put Western civilization on a downward trajectory, and that only a shock to the system can reverse its decline. I mean, I don’t know. It’s an interesting idea, right. But the question to me what do they want to replace it with? And a bigger question yet? Are you ready for it? Like as flawed as our system is like, I don’t know if I want to burn it down and let these rich psychopaths make make the cult doctrine Golden Age, the new system. Now professor, Ted Obama and I you believe this or not in the book, there’s some discussion on Pepe the Frog. So we had a discussion on chaos magic and Pepe the Frog as well. Again, I’ll put the links to that show in the show notes. But we need to talk about Pepe the Frog that’s a big part of this thing. And I wrote an article on this back in I believe, 2016. Again, I’ll put the link in the show notes for you. Who I’m going to I’m going to go through the basics of it for you right now. Pepe the Frog this was a frog cartoon that went viral. After some nerds on 4chan started obsessing over him. And those same 4chan nerds they saw Donnie t as their Savior, their representative. Because they were trolls and they had anti social behaviors. They were living in their parents basements. So if you think all those cute put downs and insults and stuff are great, maybe four chance for you. Maybe that’s your people. Yeah, these four channels are living in their parents basements, because their parents are weak too. They wanted to they wanted the world burned down through chaos from their basements. Because it’s like they were you know, they were rejected by society as losers. So they want the world to burn, which is your archetype of your you know, Joker nerds with your trench coats and whatever. Right. That’s they did a bunch of weird 4chan things to try and get their boy Donnie t in the office. That’s the gist of what Pepe is. Of course, we’re going deeper. So stand by here. Now another term Keck. This plays a role too, because Keck was another game or term these World of Warcraft nerds use instead of saying lol, they say, Keck, don’t ask me. I don’t understand it either. So when when these four chanters would use the Pepe meme the image they would also use the term Keck has like him laughing. Instead of saying lol. But to further fuel their idea of a divine cosmic Pepe Trump connection, they later found out that there was ever they’d been using this term for years. And Egyptian frog deity namecheck, known as the God of primordial darkness or chaos. Oh my goodness, there it is. We all know who the chaos candidate was. So you can see all these strange connections that are quite peculiar. I’ll give them that. But I would argue that this is the byproduct of a lot of this symbolism and stuff we talked about. Thought about elephants, lovies, magnetic change hardening of the sigils. There’s plenty of magicians and theories of the occult that support this idea that there is a tangible result of messing around with all this stuff with a symbols. Could it be the manifestation of such a thing? Because the magic is important here. The Pepe was worshipped by The 4chan nerds for their ability to influence reality based upon the usage of the Pepe meme. And the way they would do this is the users would achieve these sort of rare post number combinations on 4chan, because they would number the posts. They would call them dubs or trips. For repeating numbers that don’t ask me It’s weird stuff, right? But anytime they would talk about Pepe or Trump, like they would notice there’s dubs or trips and one of them was like, a sequence like seven sevens, which was like whoa, you know, to these people. And Time magazine in 2016, had a list of influential fictional characters and guess who was number one, your boy Pepe. So his influence was very purse, purse, very well perceived by the masses. Now unbeknownst to you, and I, these four channels were focusing their energies during the election cycle. on trying to, like I said, trying to get Trump in office, but on top of that, they were trying to like hex Hillary Clinton. They actually wanted her to fall they were focusing their energies to make her fall in public. Which actually happened. Yes, it happened on 911. No less, which, you know, we had a whole show on 911 talking about the symbolism of 911 and the magic, number of magic and all that stuff. And this is ironically, I don’t say no, this but this is the same thing. There’s a legend about Alistair Crowley walking down the street with a guy named William Seabrook. William Seabrook. Of course, he’s an infamous writer who apparently tried cannibalism. He was one of the first to write about zombies, and he invented the zombie genre. But anyways, Crowley and seeburger walk in and Seabrook say, hey, you really believe this magic nonsense and Crowley’s like, you know, hold my drink, fam. And he like starts limping, right. So there’s limping, and the person in front of him walking down the sidewalk, starts limping to afterwards. So it’s like through sympathetic or contagion magic, he was able to focus his will to create an event in reality, which is what the chanters were doing when they’re trying to make Hillary Clinton fall in public, which she did on 911. Isn’t that strange? A lot of other weird frog symbolism that lays into this concept of an occult destiny 1986 of an album called shadow lay by a band named Pepe. And on this record, they had a frog with a magic wand. And a spiral of the spiral is a symbol for chaos and the evolution of men. very fitting right. 2010 a man named last papers had a song called the frog Pepe in 2010 isn’t that strange? The election proceeded to give us nothing but chaos. including some post election interviews, there was the alt right guy Richard Spencer got punched in his dumb head while he was being interviewed by a television show. But it was happening while he was playing with a pain of Pepe the Frog on his chest. This is kind of like in my book aliens UFO isn’t a call yours illusion one now available on Amazon. I talk about the heat the What was I talking about? Sorry, I drew a blank there. Man, I totally drew it. You know, I was I was so impressed by how quick I spat that out. I lost track of what I saw. Somehow. I was playing with a pin of Pepe right. And what was curious to me is that this reminds me of jack Parsons. And l Ron Hubbard when they open that portal down in during the Babylon workings. And the idea is that they didn’t close it off properly. And now we’ve got all these UFOs flying around and aliens and interdimensional beings. And I go into detail in the book on that. That’s kind of a similar idea here with Pepe the Frog. It’s like we’ve unleashed this weird thing in this weird dimension. And now it’s wreaking havoc, like Be careful what you wish for. You just might get it. Kofi FA How does this fit into this? It does, if you google the Okay, so like how do I explain this? So, if you look at the periodic table of elements, there’s atomic numbers for co V, F, E, F, E, cobalt, man vanadium, iron, and of course iron repeated. Now the atomic number to seven to three to six to six. But what’s strange that’s the atomic number for each of those elements but What’s strange is when you Google that the results they used to be this way come back with a green toad. I did this back when it when they were talking about this a couple years back and it was true it really worked. Now, where will it be when we find out that Tom DeLonge is pieces of the UFO are made from this alloy of cofee? That would be a plot twist when it now there’s also if you want more on Pepe, you can’t get enough of that pepper. Check out this documentary called feels good man. I want to and I want to take a deeper dive into this. It’s really great. I actually, I was intrigued to watch it and shout out to whoever recommended it to me it was a Ben I don’t remember sorry. I don’t remember names that well, I should have wrote it down. I highly recommend this. It was really good. It’s now on Amazon I bought on Vimeo when the day came out. And it goes through the inception of Pepe through artist Matt fury, he drew a comic called boys club around 2007. Right. And a lot of theories are it talks about in this documentary talks about the origin of the term feels good man, which is you know, actually pretty funny refers to someone pulling their like when, you know, when a man walks up to the urinal in elementary school, like, used to pull your pants and underwear all the way down the floor like an idiot, right? And that’s what Pepe the Frog does in the cartoon. And someone’s like, why are you doing that he’s like, feels good man. Which is actually pretty funny. Whenever you should do that, as an adult in the office, go into your work restroom. And, you know, let her rip. See if people think maybe you get some time off for that. I don’t know. They’ll blame me if they fire you. But it was a dog by the origin. It feels good man, the defining meme from Richard Dawkins, which, you know, Dawkins said biology is driven by genes. But culture is driven by means. And they’re compared to like styles of clothing and whatnot. It’s an evolutionary Battle of sorts to see which mean catches on. Same as saying which fashion styles should win. But this the way Pepe caught on was through originally through the phrase feels good man. And it started meaning in forums and early YouTube videos, which they compiled very nicely in this documentary. But Pepe is about and this is how it fits into 4chan, which again, is like this anonymous forum where people have to battle to have their topic create the most replies. So that’s why they get so controversial if you’ve ever been on there, which I unfortunately have. They use a lot of like, you know, only use the hard R and word. They use a controversial language because they’re trying to get the most replies. It’s kinda like Reddit. So, you know, you have these people sitting around doing nothing with their lives. They call themselves NEET and et find out on the documentary. Oh, what does it stand for? I’m gonna have to look it up. I totally forgot what it stands for. I didn’t write it down. I just put it in my notes. I’m not employed or engaged in training or something like that. Hold on, let me find out for you. I need some like, some music. I need j A Jamie is what I need. Okay, it stands for not in education, employment or training. Oh, look at that. I was right. See, I didn’t smoke too much dope. So these people that call themselves neat. They just sit around and they say the most offensive things to trigger comments to be the king of the 4chan leaderboard. And these 4chan in cells, they looked up to guys like Elliott Rogers, who was like that the guy that did all the drive by shootings, and it was somewhere in Southern California his dad was like the producer of hunger games. If you recall, we talked about that back when that happened. And started this beta uprising idea that was coated an irony about them embodying Pepe showed them killing people being anti social. And the argument is that the violence itself becomes the meme. Which I take is saying that these insoles fighting for attention, praise the violence as a way to take the meme into reality and it blurs the line of reality. I mean, it seems pretty dangerous. Honestly, like when you watch it, you’re like, Oh, damn, I didn’t know what was going on. Right. Now you know, you know, you know the way to get rid of this right? You have to make these four People cool, yeah, get the mainstream into it. And then they’ll move on to something else. But pet Bay was now being drawn as more smug than the crude version. And at some point Trump comes out and he got support from the Pepe Chan’s. And they liked that he was a nationalist and smug, just like the mean. And then somehow this conflated into Trump being their guy, right? Now I’m gonna play a clip from feels good man, it’s a longer clip, and maybe 10 minutes or so. The video version obviously is much better, has images supporting what you’re about to hear. Again, I can highly recommend it. It’s pretty good. It’s really good. If you’re into documentaries, and, and Pepe and all this stuff, it’s pretty good. There’s a section in the middle where you’re gonna hear some keys typing like a keyboard. And what it’s showing is these 4chan forums where there’s a guy at a Clinton rally back in 2016, of course, and he’s like, Hey, I’m at the clinton rally. And the four channels are egging him on like telling him yell, Pepe. And he does. And this video clip, you know, migrates over to the mainstream media, and you’ll hear Rachel Maddow clip talking about it, and so on. So they kind of like, cross the veil into reality from the internet and means and trolls into the reality. So here we go, let’s get into this clip.\n\nI think the President Trump is a real life version of Pepe and the ability to elicit a reaction and to get attention to express and to capture people’s hopes and fears.\n\nI was formerly the director of strategy and data for the Trump campaign. So I know as much if not more about how to use voter data than anybody else in the country. During the\n\ncampaign, there was an effort by 4chan to get other people to support the president by creating memes\n\nand then sharing them to say normies to try to motivate them to support President Trump.\n\nThe inside terminology for this was sort of the great meme.\n\nIt gave people who had never really been involved in politics before, a way in\n\nthe best memes that you see, the most effective ones are just some person who has no power at all. They have no influence. They have no money, they have no connections, but they can make one good meme. And they can take off and go viral.\n\nThen when you hypercharged it by having the president retweeted, and you felt like you’re part of this rebel group, this insurgency that was completely unpredictable, and from where no one would have ever expected it. How does an image like this\n\n4chan supported Trump or a mix of reasons. Some of it I think, was this nihilistic idea that Trump was a wrecking ball, and that they wanted to embarrass people by electing him. And so when Trump retweeted himself depicted as Pepe, it’s like this watershed moment.\n\nThis is Donald Trump co opting the idea of himself sort of substitute his pet bait.\n\nIt was so transgressive, so anti PC, to most of the voters out there just seemed kind of odd. But if you are part of the community that has been spending years and years and years using pet pay, suddenly, a little antenna goes up and you pick up a signal and say, Well,\n\nmaybe the skies right for us.\n\nThere’s always magic going on in any political campaign. And so what happened when Pepe the Frog suddenly became,\n\nwas that a magical Force had entered the picture and it was a wild card. A meme can become the anchor the seed, if you will, around which a group of like minded people can gather, and toward which they can focus their energy. That’s a basic tool to be metric. And that’s one of the things we saw during the 2016 election. The way Big Magic was used on the chance was they focused on building up a series of hyper Central’s of images like Pepe the Frog, and piled into those images, all of their hopes and all of their energy, their emotional focus. We’ve seen Donald Trump in the White House. You ended up with a lot of people on the chance just going wow, I could do this.\n\nrepublicanism as we have now\n\nall right the short\n\nracist ideology known as the alt right.\n\nAnd to most people that was a totally unexplicable thing at the moment must be totally random to the white supremacist anti semitic neo nazi right in this country that was a moment of triumph.\n\nSuddenly pet day the mean the most silliest piece of meaningless culture was sort of like passing through the screen.\n\nIt was kind of like the dream of the troll making the internet real.\n\nI interviewed Matt fury in September 2016 put the Atlantic my impression of hearing was that he was very well intentioned but somewhat naive about the extent to which this symbol had been appropriated by the far right.\n\nused by white supremacy is something of a muscle or the alt right.\n\nDefining the alt right is somewhat easier these days been around 2016 it encompass a lot of people who were ideologically opposed to the left but not necessarily united on every issue. And then you had people like Richard Spencer, who were over white nationalists, it’s gonna all happen. It’s gonna involve unleashing a little chaos. For the alt right, Pepe allows them to pretend that they’re kidding. They’re not kidding. What they want is for you to be both scared by the threat and be mocked for being scared in the first place. The point is to cause that kind of psychic anguish and they draw a great deal of pleasure from that.\n\nBasically, Alt right is a big tent or rather a big rock under which creeps a diverse assortment of paleo conservatives men’s rights massage, I remember I went to a taping of Sam being later his wife and she had a segment about Pepe the Frog. And I got to meet her after the taping\n\nof neo nazis. And I was like, you know, Pepe was actually created by a friend of mine, and he’s a really sweet artist. And and it doesn’t mean this thing that it transformed into and she was just sort of like, okay,\n\nthe alt rights use of Pepe just drowned out any other visual interpretation. You know, Trump’s former campaign chair Steve Bannon said, the democrats are not the opposition party. The media is the opposition party and how do you beat the media? You flood the zone with shit? Well, these people are flooding the zone with sheds that you don’t know what’s real. What’s not.\n\nI mean, quite frankly, I’ve been to these events was even real. They’re just Jewish actors. A lot of the KKK guys with their hats off and literally, like the cast of Seinfeld.\n\nConspiracy theorists like Alex Jones appeals to Trump because one of Trumps major political tools is forcing people to reject objective reality in favor of his version of reality.\n\nWell, Donald Trump, let me say this, you are the leading presidential front runner with the republicans gaining a huge lead as you don’t back\n\ndown. But the point of it is to obliterate objective truth.\n\nin terms of winners and losers.\n\nWhat happens when that mindset is adopted by people on the bottom? Instead of thinking of society, sort of like where everyone sort of equal and we’re all lifting ourselves up together? You think the world is a hierarchy? And the only way you’re going to get to the top is by displacing someone else, then you start getting these ideas like, well, maybe I’m at the bottom because this group of people has snuck their way to the tongue. They probably cheated their way up there. And so then you get these elaborate conspiracies about like, Oh, well, the Jews run the media, immigrants, they’re the problem.\n\nSo then it started to get strange.\n\nSomebody on the chance nobody knows who found an ancient Egyptian frog God This game was kept Cuba like an anthropomorphic figure with a frog’s head rather than like epic. Obviously that had to be shared and the chance went ape. The reason why this caught on is that is a bit of gamer slang for complicated reasons where we say hahaha in certain gaming circles, you said tech\n\nHe came up with this idea of takistan of a kind of promised land for peptides. And anytime you have these ideas of ethnic homelands and tribalist blood and soil, it automatically seems to cluster in with the worst exercises in human to previous\n\nThere had been rumors flying on the chance that Hillary Clinton was actually seriously. And a great many cast magicians were focusing their magical work on one gold which was making her collapse in public. There’s a thing that people talk about in occult circles called the T SW moment. At t SW the polite version is this stuff works.\n\nThe chance went through the T SW.\n\nHillary Clinton collapsed and had to be hauled into the SUV by other people.\n\nSo again, you hear like language about how all this trolling, it’s all about burning it all down through chaos. And it started with a great meme more to get Trump Pepe memes into the normal world and cross this veil. And then it culminated when Trump actually retweeted a Trump Pepe. So to them, they clearly are like, this is the guy. And then of course, we’re here talking about the magic and stuff and unleashing chaos and the magic used to you know, make Clinton collapse on 911. I we talked about so they they believe they literally mean a president into the White House. Are they right? Are they wrong? It’s hard to say right? I mean, no one. I remember that election. No one thought Trump was gonna win. It was clearly a landslide by Clinton. That’s what we were told. Maybe they’re right, maybe there’s power to this chaos magic. So to sum up, feels good man. These nerds are gonna kill us. This time. It’s the insell 4chan nerds. they’ve embraced their nerd anger. Just like I don’t know if you follow the Elan musk and Bill Gates are battling on Twitter the other day. These angry nerds. They should make a game that Angry Birds angry nerds. Because there’s nerd anger and that’s the problem, right? I pick on the nerds. I’m a nerd myself so I can but here’s the problem. The problem is back in the day your like Isaac Newton type folks. Your Leonardo da Vinci type folks. They were renaissance man, they knew a little bit about everything. Kind of like your boy Joe Rogan. Let me Say what you will about Joe Rogan. But like, he’s a pretty smart dude. He knows a lot about a lot. And I like that like that well balanced approach. You can’t just live in one world in one world only. That’s why like, I don’t trust these, these science nerds, some of them because they just they’re so hyper focused on their little portion of the world. And they don’t know how it fits into the larger piece of humanity and spirituality and what it is to, to be a human being. Because they just get so hyper focused on this one thing. And this is kind of what Carl Sagan warned us about when he was talking about technology, becoming so specialized, that we were going to unleash some demons. And this is what the mimetic stuff is in the means. It’s, you know, Richard Dawkins, as it takes on an evolution, it’s just like a gene, which is the ideas from elephants lovies magnetic chain in the symbolism, you know, I always harp about this, like in the dark path and my book, now available on Amazon, audible. And you can get signed copies of that one on the gumroad like bubblegum gumroad.com, backslash Isaac W, where in mid October, you’ll be able to get signed copies of my aliens UFOs in the occult book, I ordered them, they’re coming. But yeah, I talk about young and Freud and Plato and they all talk about this hidden realm we can get in contact with where the archaic remnants and the collective unconscious. They’ve been talking about this for so many years and so many people just don’t know. But back to the larger picture. 2020 is all about chaos. That’s what the last four years have been. But 2020 is the you know, the final A boss of chaos and this is what they’ve always wanted. It’s what Steve Bannon wanted. It’s what Alistair Crowley wanted his gnostic mass creed, they pray for chaos for him he was referencing the Abyss Crowley wanted the Abyss to open up and swallow up all of humanity because of its religion and social constructs and roles they all needed to go and if you recall the the Clinton emails right the ones that popped out right before the election there was all these pizza gate connections to Podesta and UFOs and spirit cooking and Edgar Mitchell and they’re all tied in together and the spirit cooking of course is crawlies cakes of light part of the Gnostic mass. So like we always say, politics is like wrestling. I don’t say the left is always right or the right is always right. Because they both play their part in this here you got the left tied in with all these emails with the connected into Crowley praying for chaos. Then you got the right with Steve Bannon praying for chaos. It’s like Ron, they’re all doing the same thing. Right. Robert Anton Wilson, he talked about this in the Illuminati trilogy. I’m gonna read you from it now. Quote. Since almost everything has been tried in human history, find out what hasn’t been tried, at least not on a large scale. Now will be the condition to which the Illuminati are trying to move the rest of mankind. capitalism has been tried. Communism had been tried. Even Henri Georges single tax had been tried in Australia, fascism, feudalism and mysticism has been tried. anarchism has never been tried. anarchy, chaos, nihilism, the Joker talk to you about the Joker back in December 19. order out of chaos. There’s what that movie was about the one of the biggest selling films of all time. planting that seed you remember how it ended? There causing changes in reality through symbolism and entertainment. Robert Anton Wilson talked about the aluminized plan for the evolution of consciousness. They believe this is why they’re doing it right. We’re wrapping this all up for you here. They believe their divine responsibilities to steer humanity down this path. They believe in the law of fives which is the idea that all things happen in fives, which Oh, by the way, you hear in Episode One of raised by wolves on HBO Max, which I’m watching and I’m going to give you a whole presentation about in the future here soon. It’s crazy. I don’t know what’s going on. Like, it’s like this hyper stream of consciousness. It’s all connecting together. But you know, Robert Anton Wilson talks about the 23 Enigma, the idea that all things happen in 23, which you know, two plus three equals five. And, you know, two divided by three is point 666. And LeBron James is numbers 23. And he’s doing all this stuff, chalk and demons. But all of this stuff, the big picture, all this stuff plays into the goddess of chaos of discordian ism, which is what Robert Anton Wilson talks about is discordian ism, which is all about chaos. They feed the gods of chaos. Eris. I believe or concert is chaos, if I’m not mistaken. Now, you got to go back to your boy, Bill Cooper. He seemed like I don’t agree with everything he said. But like he had a he knew what was up in general. He talked about anarchie. Back then, when he was alive before they killed him right after September 11. By the way, right before September 11. Excuse me. It was right after Yeah, right after September 11. They killed him. Bill Cooper asserts that anarchism is an extreme right wing government. It’s not no government. He says it’s an extreme right wing government. He said the problem with anarchism is that it has no limits, which is a more conservative value, right, like hands off laissez faire hands off government. He said that the promise has no limits, and it subscribes to a lie that man can control himself. But the problem with that is that man is flawed. We all have sin. We all have greed in our hearts. But the problem is, is some men and that system will rise to power men or women don’t want to assume genders. Men or women will rise to power and they will stomp on the rights of all others and there’s no checks and balances. And you will have any latest authoritarian dictatorship of sorts. The Golden Age my friends, it’s the golden age for them. Let me leave you with this final thing we’ve been talking about queueing on. And, you know, I didn’t get into the weeds on their claims they’ve got a million claims. You can find them easy enough. I’m looking at Big Picture a cult cycles of time. I’m like 60,000 foot view here. And I think this is correct. This theory that we’ve built. If we consider the arguments from part one, the occult origins of America, the ritualistic elements of incarnating, the soul of Cyrus into every president, then you consider these ideas from part two, where we know that Steve Bannon is in the know on all these things, and connected obviously in the Donald Trump is the campaign manager. And he knows about the power of Pepe hyper sigils. It’s clear, it’s clear without doubt, there are occult forces being used here and this dare I say, battle? spiritual battle. Another strange idea to toss out there’s a movie from the 80s called cue and irreverence references a winged serpent quotes a coatl. And some cops researching some ritual murders from an Aztec cult that are attempting to resurrect their God through sacrificial murders through the blood sacrifice. Is that connected into all this? I don’t know. I thought that was an interesting time, though. But the Q movement, from my outsider perspective, not following it that intensely. They’ve been stringing the followers along promising indictments and the rest of all these big liberals. It never happened. And it never will. I’m here to tell you never will, because they’re all in this together. Back on March 28, or, no sorry, March 18 2020. I tweeted the following. If you go to my twitter at Illuminati as you can scroll back to march 18. I’m going to read you a quote I tweeted, quote, conspiracy folks are claiming the following people will be arrested for the pizza stuff but they’ll say it’s Coronavirus note that I don’t buy into all the Oprah slash QA non theories. Celine Dion Madonna, Kevin Spacey, Charles Barkley, and I’ll post that screenshot on my Instagram and Twitter and all that stuff for you. at Instagram or Instagram is at Isaac Weishaupt link in the show notes. Twitter is at Illuminati eyes. link in the show notes. Follow me for all the coolest imagery symbolism movie clips. Every now and then I go live. Tell me I look like an idiot. It doesn’t bother me. I’m here for the truth folks. I’m here for truth at America in all of our beautiful glory. They’re not gonna coup d’etat this into their psychotic Golden Age nonsense. They will not know while I’m here. But yeah, I was because the reason that came up is because when COVID first hit, if your call all these QA non people were like, Oh my god, they’re doing this so they can arrest all the adrenochrome people. And then weird stuff did happen. like Tom Hanks was the first one to have COVID ever, apparently. And then, but Donna was singing about fried fish. And then Ellen DeGeneres was getting in trouble for being mean to people or something. So there was a lot of weird stuff happening. And I thought, well, damn, maybe these QA folks are right. But they were saying according to the cue drops like they’re going to rest. This is all the people that they’ve been threatening to arrest. Hillary Clinton, john Podesta, Anthony Weiner. James, ella fantas, Madonna, Oprah, Kevin Spacey, Celine Dion. Charles Barkley, how many arrests have you seen? What are they waiting for the right time. Anyway, they said and back then they said the COVID was a cover to arrest these pedo rings. And I will acknowledge there were a couple of strange like arrests. They weren’t really covered by the mainstream media just a couple months ago. large groups of kids and they said we’re part of this like abduction ring. And I I’m with you, I’m with you guys. This is an issue this child abduction and abuse and stuff. Like that’s a real problem that they’re not really focusing on like they should. But I would argue that we need to take a look at Steve Bannon. Is he just using this is this group of folks for his own for his own gain. He’s got the disdain for the boomers. Right? We already know that. Guess who’s dying from COVID? The boomers, you think he cares what happens to the public? You think he cares? About the boomers. They’ve got higher calling folks. They’re trying to usher in the golden age for themselves. They’ve been trying for hundreds of years. It’s the occult doctrines. Consider the chaos we’ve seen this year. You ever seen anything like this? I mean, is it all just media hype making it feel chaotic? Is it really cast it doesn’t matter if it is or not, they’re creating the reality that it is chaos. Like homeboy in The Truman Show said, we accept the reality we are presented. They are manufacturing or creating or faking chaos. So that we beg for order, do not fall for it. The occultist embrace chaos as a way to shake things up, introduce a new reality. This is what you see on Alice in Wonderland. It’s the same idea you destroy the social norms. You destroy tradition, through chaos, as part of the evolution of consciousness. And the sales pitch is always safety. It’s always safety, safety in exchange for freedom, first aid, jammy full of fear, and then like, I’m here to protect you, I’ll take care of you. It’s just gonna cost you a little bit of freedom. But I’m here to tell you like, it’s rare that we’re safer. Like the, you know, the National Security Act 1947 that created all the Intel agencies, supposed to protect Americans. But then what did they do? cointelpro they’re spying on our own people. CIA’s doing MK Ultra mind control experiments on people without telling them. Operation Northwoods was plotting attacks on Americans. It’s all for the greater good. It always is. Right? So it makes it very difficult to discern the truth. I’m not saying every intelligence operation is bad for Americans, I’m sure I’m sure like most of them are, you know, good. Sure we need that, right. Like there’s bad countries out there, trying to take down the greatest over here. You need them. And that’s the problem is, the problem is they’re trying to make us all get behind this idea of burning it all down. We don’t need to burn it all down. We just need to reform which need to fix some things, that’s all. But you have to be aware of the privacy invasion and the giving up of freedoms, because that opens the door to abuse and authoritarianism. They’re, they’re making us live in chaos and fear. So we beg for the order, which gives up the freedom job opens up the door to authoritarianism tyranny, and it’s a wrap. So there you go. That’s my whole spiel on queueing on I got a guess I’m gonna try to get on here. No promises. And he’s gonna try to break down some more of this QA non stuff. But that’s my that’s my best stab at trying to understand what it is. It’s a big topic, but you got a lot of big ideas about the occult. And these fantasies of a golden age of these people are trying to create order out of chaos, order out of chaos. 33rd degree Freemason remodel? That’s where we’re living in. So what can you do now you can read some of my books, Amazon and audible Isaac Weishaupt and get signed paperbacks on the gumroad store. gumroad.com backslash Isaac W. You can get t shirts if I got them in stock. Some great podcast t shirts to say. These nerds are gonna kill us all on the back. You can follow me on Instagram at Isaac Weishaupt Follow me on twitter at Illuminati eyes. Instagrams more fun to be honest. Sometimes I post jokes on their little Instagram Live a Little bit of symbolism break down every now and then. status, subscribe to the show. And until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "Q Anon and the Occult Pt 2: Pepe the Frog, Sigil Magick, Order Out of Chaos & Steve Bannon! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we continue our journey exploring the idea of Q Anon as a PsyOp! This second episode goes into the origin of Pepe the Frog, Kek, the sigil magick utilized by 4Chan users, the “Feels Good Man” documentary, Ordo ab Chao and the idea that Steve Bannon […]", "url": "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-09-29T13:35:37+00:00", "article:modified_time": "2020-09-29T13:43:00+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/09/ctauc-q-anon-pt-2.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-1-americas-secret-destiny-resurrection-of-osiris-and-symbolism-of-17/", "https://illuminatiwatcher.com/steve-bannon-dark-age-of-kali-yuga-chaos-magick-covid-and-the-occult-with-professor-ben-teitelbaum/", "https://www.patreon.com/posts/36392972", "https://illuminatiwatcher.com/donald-trump-the-illuminati-4chan-meme-magick-and-the-occult-powers-of-sigils/", "https://www.instagram.com/isaacweishaupt/", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/41205359", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon/?share=twitter", "https://illuminatiwatcher.com/q-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Q%20Anon%20and%20the%20Occult%20Pt%202%3A%20Pepe%20the%20Frog%2C%20Sigil%20Magick%2C%20Order%20Out%20of%20Chaos%20%26%20Steve%20Bannon%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fq-anon-and-the-occult-pt-2-pepe-the-frog-sigil-magick-order-out-of-chaos-steve-bannon%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Nathan Grande (no im not related)", "Isaac Weishaupt"], "publish_date": "2020-09-29T13:35:37+00:00"}