{"result_id": "165025", "URL": "https://illuminatiwatcher.com/the-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam/", "timestamp": "2023-04-25 15:36:05 CEST+0200", "meta": {"description": "Join Charlie Robinson as we explore the octopus of global control! Today's podcast has a ton of info on the events unfolding- COVID, protests and more!", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/the-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "The Great Awakening of 2020 with Charlie Robinson! Masks, Protests, Media Manipulation & Project Blue Beam!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we are joined by special guest Charlie Robinson! We’ll get into his first book from 2017 (which basically lays out the agenda from 2020) “The Octopus of Global Control”! Then we dive right into all the controversies: Q Anon, Trusting the plan, military police, Masks, experiments on the public, mainstream media, the great awakening of 2020, what’s NEXT in 2020, Project Blue Beam “space f*ckery”, his new podcast & book and so much more! DON’T MISS THIS ONE!\n\nKeep up with Charlie (*and tell him Isaac sent ya):\n• New book coming Summer 2020: “The Controlled Demolition of the American Empire” written with Jeff Berwick from The Dollar Vigilante & Anarchapulco\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “The Great Awakening of 2020 with Charlie Robinson! Masks, Protests, Media Manipulation & Project Blue Beam!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nIf you were in a relationship with a with another person, the way you’re in a relationship with your government, it’d be your you’d be at a therapist, your therapist would be telling you, you gotta leave this. This is an abusive relationship. What are you doing? Why do you stay in this? I think that we have to acknowledge that that could be a possibility now, a fake alien invasion. We in the alternative media have been talking about it in sort of a joking sense for a long, long time. So if they went that route, we would of course, just be screaming at the top of our lungs. This is all fake. This is all fake.\n\nAll right. It’s a special day, special day with a special guest. Yes, indeed. We are joined by the specialist of guests, Charlie Robinson, you know who he is. If you don’t, you’re about to find out. We’ve been sort of on each other’s roles. Radar a few years and tried to get him on the show a while back. Some fell off because Twitter deleted his account by Twitter deleted them and we’ll cover that a little bit on the show to talk a little bit about that. We’re gonna get into his book that he wrote a few years ago that is unfolding before your eyes, the octopus of global control. We get into many conspiracy, controversies QA none. Does he trust the plan? Do you trust the plan? military police talk a little bit about masks. experimentation on the public the mainstream media of course the Great Awakening that is 2020 and what’s coming up next. Those aliens is the Project Blue Beam coming for you. A bit of the old space buggery, if you will, and will of course discuss his new podcast and a new book on the way this guy’s busy, busy. So, you know, show him love for taking time out of his busy schedule to talk to us about all of the things that he’s going to talk to you about. You can hit him up, I got all of his links in the show notes, or on Illuminati watchdog calm, you can find him on his new Twitter new and improved helping build up his account at macro aggression to three sort of like macro aggressions without the end. So at the end here at macro aggression, three, and he’s on Facebook under the octopus of global control and you can go to his website, the octopus of global control calm. So we’re going to talk to him and I do want to give you a little bit of housekeeping since I got your attention. I started a tier three on the Patreon don’t fast forward, you put that you put that button down, don’t you hit the skip. I started to tier three and every month we’re going We do a live stream chat on the YouTube. But I am going to tell you this right now don’t sign up until for and this is in general for Patreon. Don’t don’t sign up until, I don’t know a few days after the first of the month because I just found out that the way the system runs, and this is probably my fault because I went in and change some settings. But now it used to be you could go to my Patreon, check it out and say okay, I’ll sign up for your tier tier one, two or three. And then on the first of the month, they start charging the Patreon supporters. Well, now the system works that you know, you go and sign up and you pay up front and then you also get hit again on the first so if you sign up on June 29 for the $50 tier three mega mega tier. Well guess what you’re getting charged again two days later, another 50 bucks. At least that’s how I think it works from what I understand talking to one of the people on the team there. So I’m telling you right now don’t I mean unless you want to give your money away like that you can you can sign up after the first of the month there. I don’t know which day specifically that would fit into maybe the fourth or the fifth of the month. And that you get your maximum I’m talking about one month’s worth if you’re on the tier one like not a big deal right? But you know, I’m telling you right now if you’re on to tier two or three I’m just letting you know I’m giving you a heads up I care about you. Okay, I care. I know the value of $1 here so I’m trying to look out for you. So yeah, and I’m gonna kind of try to give you that warning ahead of time in case this is your month you want to switch over and get on the winning team. Then what else have been going on? Well, I watched doctor sleep the movie I posted some images on the Instagram I’ll probably talk about it on the show. But you can check it out we got the all seeing eye we got the project monarch butterfly and the playgirl to play go from the shining. Yes. showed up and Dr. sleeve you got to look for it to see it. If I didn’t have such a keen eye for these things, I don’t think I would have caught it. But check it out, go to my Instagram at Isaac wise up again link in the show notes. Then what else am I working on? I’m working on a little Trump moonchild discussion, we’re going to do a little bit of rusted root, the rusted root, send me on my way video, remember that? We’re going to talk about that. And we’re going to talk about this cover of The Economist magazine, doing a little predictive programming, how strange and then of course, I got all these other projects we’re working on. We’re gonna finish off in the month of July, we’re gonna finish off the vaccine series, get that free ebook. While you can vouch you just today said the vaccines only going to be 70% effective, and that coupled with the vaccine hesitancy of the masses means what does that mean? Well, I know what it means. He didn’t say what it means but he says they got a lot of work to do. Well, that means they’re gonna mandate So, as part of the mandating of the vaccine, they also need to get rid of all of the vaccine anti vaxxer truth or types. So it’s nice knowing you. And I hope not, they might remove the book. I don’t know. I don’t know how that works. We’ll see. But yeah, July we’re going to finish out the vaccine talks. We’re gonna do a little Gretel and Hansel film analysis that that Greer close encounters with a fifth kind analysis. That’s going to be a Patreon bonus, I think. I don’t know yet. We’ll see. We might talk about masks. I mean, that’s no fun, though. Right? That’s pretty normal stuff. And I like talking about normal stuff. And then we’re going to start prepping for August, I believe August, we’ll start the dark path book club again. Pay another Patreon perk. Okay. I’m going to walk through it right there with you hand in hand.\n\nSo there you have it,\n\nand I’m going to work on this midnight gospel analysis Sunday here, I got to do it. I got to do it. There’s so anything’s in there. You’ve been wanting it for so long and I’m going to give it to you. All right, that’s all I got for the housekeeping. I’ll let you go. Listen to the show. This is the episode check out Charlie Robertson again links in the show notes for his twitter and his Facebook and all that tell them Isaac sent you. And, you know, friend up man, friend up with with Charlie Robinson Here we go. Charlie Robinson, what’s going on, man? How are ya? Good to be here with you. We’re gonna get into this air. Let’s get into it. Let’s go deep, man. I’m ready to pick your mind. Because\n\nfinances, media, spiritual warfare, all this stuff, all the things we’re experiencing. Yeah, exactly. The octopus was not my, obviously not my son. I didn’t come up with the symbology of that. That’s been around for a while. And one of the things that I did with the book So the way he the way the book sort of came out of a busted Thanksgiving dinner years earlier, where I made the mistake of bringing up 911 and watching everybody at the table just kind of turn on me. And I didn’t really have my argument together. But you know, obviously, it was the wrong time in place. But I also didn’t have my argument together and what I kind of felt like after that was, Alright, fine. You guys don’t believe me? You don’t think I have any credibility when it comes to talking about these sorts of topics? But what if you heard the words from somebody that you do recognize, be it like, you know, somebody from the media or a politician that you respect or whatever, what if you heard them talking? If I say something like New World Order, everyone rolls their eyes and they go get out of here with that stuff? And you go hang on a second. What if you heard that george HW Bush mentioned New World Order? over 200 times during his four years in office? Would you get off my back about this being some sort of term that a crazy conspiracy theorist came up with this is Okay, well, here’s let me show you what everybody’s saying this so, so when I, when I started writing the book, I thought I have to bring in quotes from all these different people to kind of validate and backup My, my, my argument on this. So if I say something like, you know that there’s a new world order and their plan is global world government and something like that somebody that’s hearing that for the first time will be automatically dismissive of it, but if then they read the quote where the Queen of England is talking about it and Tony Blair and Al Gore and, and Barack Obama and Bill Clinton and the bushes and Cheney and all these people, finally, it’s like, Okay, can we, you know, have Do you understand where I’m coming from so, so I brought in quotes from over 500 different people that had a role and either were involved in these important events or they had some sort of take on it. So you’re gonna get quotes from like the Rockefellers and Rothschilds and Bush’s and Clinton’s as you would expect, but you’re also going to hear George Carlin and Bill Hicks and Joe Rogan and these guys that see things from a different angle and, and so when it comes to, you know, when, when it came to like the the the idea of the concept of the octopus, like I said it wasn’t my idea wasn’t my concept. But there’s a quote in there from john Francis Hyland, who is talking about this octopus with its sprawling tentacles that is that has gotten itself into the court systems and the media and the government and the banking and all of this. And he’s, he says to, you know, to move away from near generalities. I’m talking about the Rockefeller Standard Oil interests. And he goes on and on and on about this. You read this three paragraph quote, and it’s and then you get to the bottom and you see that he was the mayor of New York City in 1922. And you’re like, Oh my god, it’s been 100 years and I mean, if I had just read the quote, people would think it was from last week because everything And he was talking about has been, you know, it makes sense. Now, if we look, look back on it. So this, this concept of the octopus Danny cast alera wrote about it in a book called The octopus got wound up getting him killed for it. And he was 44 when he wrote it, I was 44 when I believe me, I was thinking about, I don’t have the sort of poll that, you know, I wasn’t sort of getting into the promised software the way he was. And you know how that’ll get you put on some lists. But you know, but that the idea of this octopus has been around for a while. And part of the reason why the symbology of it works so well is because the octopus itself is such a fascinating creature. You know, everybody knows it can change colors. It can also change textures. It’s very smart. It’s one of the smartest animals out there Can they say that it can nap if it’s been in a cave within the last three years, it can navigate its way back through there. It’ll spray ink to get away. It has a really sharp beak that you don’t see come in until it’s too late. So it’ll stay in fight or it’ll flee. It’s very easy. Interesting kind of animal, obviously, it has eight tentacles and so we broke that down into eight different categories for this book. So yeah, I wrote it in 2017. And and I got lucky with it because I my third interview I did to promote it was coast to coast. So, you know, when that happens, you you sort of get, you know, people are like, okay, there’s the book out there. Now, the funny part about it was that I didn’t tell anyone I was writing it, including my wife. And when the big the first shipment of books showed up at my house, I wasn’t home to intercept it. I don’t know what I thought I was gonna do, if I was gonna, like, keep it hidden. But anyway, my wife opened it up and found all these books and flipped it over and my face was on the back. And so she threw me out of the house for two days. Emotionally cheating on her by writing a book and secret.\n\nYikes, man, your opposition to this book going on against you.\n\nI know So, but but what’s funny is that I was a I was heavily influenced by Two people for writing the book David ickes, one of them and also john Perkins confessions of an Economic Hitman. And then I wound up in London last year with with my wife and doing a show on RT called Renegade Inc. and the host and I were talking because he knew john Perkins, he, he directed a video called the four horsemen, a great documentary on financial collapse. And so I was telling him on camera about my story. And he says, He goes, Oh, you didn’t know that john Perkins did the same thing. He wrote confessions of an Economic Hitman totally in secret didn’t tell anyone about it. So I felt a little bit better after that, like I had, you know, like, Okay, good because that that was the book that fueled me to write this because I that opened my eyes to the I knew there was governmental nonsense going on, but the financial component and how the IMF and World Bank works. Once I read that I was like, Oh my god, it’s all starting to make sense. So. So that’s how the book came about. And and it’s been so it’s been out for a couple of years now, and then people call it like a conspiracy encyclopedia or conspiracy Bible or something. I don’t know about that. But it’s just because there’s a bunch of topics to to cover. I mean, frankly, we could have written two books about it. But But 2020 is this year where like, I don’t take any pleasure in saying, I told you so. But like, there’s a lot of stuff that’s happening that it’s like, you know, I, this isn’t a surprise, this lockdown scenario that we’re living under, you know, if we’re really honest about it, if we look back, we could see a lot of these steps unfolding over the last couple of years. And so, you know, I didn’t expect it to be deployed through the use of a virus, but I don’t know why I didn’t think that\n\nwell, and that’s where I have a lot to learn from the truth or community and I, I’ve said this many times that I’m not like a great conspiracy theorist because I have these 10 tendencies to not agree with a lot of conspiracy theorists and a lot of truth there’s and I see this sort of rise of you know these these parallels between the not the alt right per se but right wing sort of politics combined with the conspiracy community and like that’s not me.\n\nThat’s not me either. And I’m gonna get to\n\nYeah, and I’m not and I don’t like the Democratic Party by any means they’re probably worse than the damn conservatives. So like, I’m trying to navigate this water of because a lot of times when I research conspiracy i’m i’m not much different than the masses where I read this stuff and I think all these people are crazy, like they’re off the deep end and then things happen. And I think Yeah, dude, these these triggers are always right. How’s this? How’s this happen? And, and you know, I don’t know how, how far down the slippery slope do we go like, am I, you know, like, I’m still not convinced that there’s this. this. I know what you The terms but laptop that the New York Police have seen with the videos with the Yeah, the gory stuff I’m not convinced that happened I mean that seems crazy but who knows at this point\n\nI’m with you on that I’m with you on that in the queue and on stuff and all that my feeling on that has always been sounds good mass arrests cleaning up the you know draining the swamp getting these people and okay i and then you know early on it was like trust the plan I’m like, I don’t love trusting the plan because I don’t trust any of these people. So I don’t know that I’m going to sit back and trust the plan. If it happens, I will gladly eat my words and say I was wrong you guys are were right and it maybe it took you know took a couple years I understand if you want to do this the right way you got to pull these people out by the roots and you know if you really want to make a difference. So I gave them I’ve been giving them the benefit of the doubt for the last couple of years it not that I’m in that camp but just sort of like Okay, it sounds good but I’m so beaten down with stuff like this that I just can’t get too enthusiastic or hitch myself to this savior that’s coming it sounds to me like a like a trap it sounds to me like convincing everybody to sit around and do nothing except wait for somebody else to fix the problems and I have a I just don’t love that strategy now if if there are mass arrests and Guantanamo Bay has been expanded, and eight george HW Bush was executed and they’ve got the laptop with Hillary Clinton doing unspeakable things that making NYPD cops cry if that if they have if all of that comes out to be true that I will say to the cube community you guys were right I couldn’t quite get there. But you guys are right and I and good good for that because it would make it would mean that the world was a better place because all these maniacs were being you know, taken care of But man, I just can’t. I just can’t trust the plant. I can’t wait for stuff like that. I just, I just feel like, that’s their niche and they can go down that path. And that’s great. And, but but I need I need more than that I need more than cryptic, you know, tweets about what queues do. I mean, it’s like a modern day Nostradamus, and frankly, I don’t have time for that stuff. That seems like busy work to me. Like, let’s get down to the arrest. Like, let’s see perp walk these people you want to you want to show me the queues real. Bring Hillary Clinton the real Hillary Clinton out in handcuffs and put her in a jail cell and let’s let’s see her, you know, get indicted for all these things at that point, if that’s if that happens. I will, I will gladly eat my hat. But until that, until that day comes I think I’m gonna focus on on other things. I think everyone has that cue stuff down. I’m not I’m not gonna went into that but but I’m with you though. So some of the conspiracy theorists and topics that come out you know, the clear there’s there’s going to like anything, there’s a certain amount of it that’s true there’s a certain amount of it that’s total disinformation. There’s some of it that people just have good intentions but get wrong. Keep in mind, we’re going up against professional liars, we’re going up against the CIA, and EMI six and Mossad and all of these intelligence agencies that are really good at like convincing people of certain things and making them believe things that are true and and walking people right into traps and things like that information traps where they send them down the wrong path. So the fact that we get anything right is a miracle because we’re going up against professional disinformation agents. But, you know, I try to be as measured as I can. I’m not going to be I’m not going to get it all right, and there’s certainly things I even put it in The book there are going to be things in this book that turn out to be absolutely wrong. And I’ll stand by that. I mean, I’ll stand by the fact that they’re wrong and they should you know, I’d like to change them but so I’m really at my core I’m interested in the truth I don’t care if I’m the one that discovered it or somebody else found it and I and if my if I get something wrong, I’m willing to correct it because I just want to get it right in the end and so so so we’re in a we’re in a weird time where we’ve got you know, like you said, You got the the alt right conspiracy faction, and then you’ve got the, you know, the people on the, you know, on the left that are talking about how, you know, we’re not going to have any elections at all there’s going to be you know, they’re going to burn the place down everything. Look, I don’t know I don’t have a crystal ball. I don’t know exactly what’s going to happen, but I know that we are being manipulated. I think that’s It goes without saying emotionally because of the virus and then all the the protesting and the riots and it’s just a fascinating time I was in I was going to USC in 1992 living in South Central Los Angeles when the LA riots happened when the Rodney King riots happened. So I was, I was there when it was like, everything was normal. And then the next day, everything was burning. And it was totally scary. I was loading my car up with stuff and sneaking out of there as fast as I could. So I saw what these riots could be I saw when they’re organic, like the Rodney King riots. But now over the last month or so, we’ve had sort of a hybrid feel like we’ve had some riots that are real, authentic, legitimate anger and some riots that are riots that seem to be a little bit more manipulated with stacks of BRICS and things like that showing up. That’s that’s obviously where do you What’s your take on that?\n\nWhat do you think about that goes on. Your your octopus idea which by the way, you talked about the octopus being a fascinating animal and I actually stopped eating octopus. For a long time, I tried to find some good octopus that was cooked properly. And I found this Greek restaurant in Salt Lake City that made phenomenal octopus. And I was like, Oh, this is great. I love it, you know, cuz I’m not a vegan or anything like that, but I’m really, you know, halfway to Charles Manson status of air trees, water animals, and I’m like, anyways, and I saw some some videos of octopuses and I was like, dude, I can’t eat these things anymore. And, you know, I come back a lot of pork because, yeah, you know?\n\nYeah, yeah. So anyway, the Yeah, as far as the protests and stuff, you know, I, I don’t like talking about them as much because it’s so divisive, but that almost proves the point that why did this happen and like coordination of it happening all over the world at the same time, especially during like this pandemic. I mean it, I’ll say this, I’ll say it supports the idea of a global octopus. Much like, you know, as on your book there. And like you said earlier, it’s like, there’s, if we believe in this Illuminati, which, you know, whatever we want to call them the Illuminati or whatever. I mean, it’s very clear, there’s, you know, you could call them the deep state, you can call whatever you want to call it, then it’s clear that these people have all the resources, they have all all the, you know, we look at the consolidation of media, it’s something like 90% of the media we consume, you know, news, movies, film, music, radio, everything is controlled by six corporations. And it’s like, if people are so naive to think that those the heads of six companies couldn’t get together and get on the same game plan of changing the world like that’s naive to me. Yeah. Now, does this somehow prove that these protests are coordinated? You know, the jury’s out just a little bit for me, but like, boy, There sure are a lot of weird things happening.\n\nI’m with the the George Floyd situation struck me as funny because while there was a legitimate reason for the black community to rise up and be angry about this situation, there were other people that had been murdered. Briana Taylor recently, Eric Garner Tamir Rice, where was the global uprising for them? You know, what, where was they? I mean, you’re talking about in some cases, a kid that who’s 12 years old running away from the police and gets shot in the back twice. I mean, there there should have been legitimate anger. There was some but there should have been legitimate anger and rising up from that.\n\nyeah. What why George Floyd? Yeah, why not? Somebody\n\nelse. We Seeing tons I mean, the Phillando Castille video like, yeah, it’s so upsetting. I mean, countless videos for, I don’t know, eight years, how long that’s been going on where they’ve been posting these videos. I mean, like you watch them in your heartbreaks, and you think, good frickin night. And then I wrote an article back in got, I think was like 2012 where I looked at the military, military effective militarization of the police departments. And because I saw this whole piece about how you know, we put all these war kind of equipment and materials and weapons over in the Middle East for those the you know, afghanistan iraq wars. And what they did with all those all that material was they they brought it back to America and sold it to police departments. So now you’ve got all these cops out here thinking the frickin Rambo. And there’s something to be said with you know, and I’m doing a lot of research into like, weird quantum consciousness causality weirdo stuff, and I love it. And because I’m tying it into, because I’m trying to hurry up, because I think the Project Blue Beam is coming, we can get your take on that here in a bit. Let me fact let me write that down. But the, but like the idea that mentally these cops and you we could talk all day about what’s really happening with the cops, but you know, they get this idea in their head of like I got the world’s most dangerous job. Black men are the most violent, scary, unpredictable people. Then you load them down with guns like Rambo. And yeah, I mean, it’s just seems like is this coordinated? Is this just by chance? Did they know is this a formula that they’re doing to try to it because I always go back to the 2020 being a mass experimentation to do order out of chaos, right?\n\nThey’ve got it right now. Yeah, that the 1033 program which recycled all that in military equipment back into the United States. For the police force, it was put together under Bill Clinton, no surprise, and then it started in 97 started recycling material back and up to 2014. So I’m not even counting the last six years but up to 2014. They had already 80,000 machine guns into the hands of police 205 grenade launchers, almost 12,000 bayonet bayonets, seriously bayonets for the police against Americans. So it’s like, you dress like a soldier, you’re trained like a soldier, you’re armed like a soldier. At some point, you’re going to act like a soldier, you’re going to start shooting people. And I don’t think that this is necessarily and I think the black community has been experiencing this for a long, long time. This is nothing new to them. But the militarization of the police the APCs that come in to serve warrants and everything. flashbang grenades, no knock rate. I mean, all of this stuff is a recipe for disaster. You take it and then you add in the drug. Which has been a disaster for the last 40 years that have disproportionately targeted the black community at in private prisons, and that that whole thing. And you have, you have every ingredient that you need for civil unrest in the black community, for sure. But it’s now spreading to the to the white community, I think the white community is is way behind the curve in terms of just recognizing what it’s like on a day to day basis to be a black person in America who gets pulled over and the cops approach the car with their hands on their gun automatically. And that is, you know, that is that’s a terrible position to be put in. So like I, I think I mean, you and I are to two of the whitest white guys in the world talking about race and everything. kind of silly. But But, but we can we can be objective and realize that there is a double standard for how white people are treated by the police and how black people are treated by the police in general, not obviously not in every Every single instance but you know, it’s it’s been it’s been building and building and building. I’m not even really sure that these protests and riots Aren’t you know, there are just about this because we’ve got the white community out there too. I think a lot of this is after you take people and put them in their homes under a virtual house arrest for 10 weeks or so. And then what they see over the last half of that is moms going to the park with their kids and getting arrested and put in handcuffs, people opening nail salons and getting arrested people opening their gyms and getting arrested and having liens put on their property by the city saying that we’re going to take all the equipment in there too. And the people see this and they’re like, hang on a second. What’s going we’re not that we’re not the enemy here. The police are starting to treat us like the enemy and then and then the whole George Floyd kick situation kicked off. And a lot of people that were out there angry about the police weren’t just black people. They’re white people do they were angry about what we’ve been seeing over the last couple months. It’s been like, you know, the police have this mentality where it’s like, it’s us versus them. It’s like, hang on a second, we’re supposed to be on the same side here. Like, you know, theoretically, you guys work to protect us. But it doesn’t seem that way. And I think it has to do with the training and the militarization and the attitude and this thin blue line concept where they’re all protect each other. I mean, that’s a gang mentality. You know, that is that is at its core, a gang mentality. I don’t say anything about you. You can’t say anything about me, we’ll protect our own. And where do we see that we see that in the high levels of government, we see that in the high levels of this Illuminati sort of system, that where they are in it, they’re in it forever, and so they have a vested interest in keeping each other protected. The police tend to have that same sort of mentality and it’s in it. It works in it. It works to make it so that the good apples in this bunch can’t ever say anything about the bad We see what happens when they speak up, they get fired, they get run out the police union throw them out. They don’t want that sort of stuff in there. So, so we have some, some problems, but I’m in agreement with you that that 2020 seems like the expect the year of experiments like let’s see what we can do. You know, you’ve got some guys at the Tavistock Institute going. Let’s see if we added in murder horn No, maybe not murder Hornets. Let’s take the murder from Intel. Let’s make race riots. And you know, I mean, we’re kind of joking about this. But But there there is a lot like we’re all kind of saying, alright, what’s next? What’s the second half of 2020? We’ve obviously got elections, are we going to get an asteroid? Are we going to get you know, or is everybody going to come down with spontaneous diarrhea? Like what is the problem? What are we all going to get? Because we know it’s come it’s turned into a bit of a joke, but unfortunately, you know, it’s really taken a psychological toll and a lot of people and I think we see, we see, you know, this live action role playing people and Chazz ins in Seattle pretending that they’re revolutionaries. Everything it’s just a it’s a fast it’d be a fascinating time to just survey all this if it wasn’t so so damn dangerous too but we’re in a we’re in a situation that’s there’s a lot of tension fueled by obviously the race situation but we’ve also got the financial people not going to work and everybody taking pay cuts and that’s if they kept their job you know, and so we’ve got a lot of uncertainty and unfortunately I think that that manifests itself in pretty negative ways as far as people acting out or going you know, like we’ve got a lot of mental illness in this country too. And this is this has not been good for for those with issues having to do I’ve been cooped up and out not being able to go outside not interact with people. I mean, I don’t even know what the social ramifications are of that but it but it can’t be good to do this. And and then of course here we are you in are talking about this the law last half of June, but we’ve got a couple more months of it, potentially. And we’ve got talked about a second wave, which, who knows? What’s that gonna do to people? So, so buckle up, buckle up for the second half.\n\nI live in Utah. And we’ve been pretty fortunate until recently, when, when things were pretty hot and heavy for the rest of the country. We had really low cases. We opened up, gosh, I don’t know, beginning of May sometime. So it was really, I was only isolated to the house. I don’t know, maybe I can’t put a timeframe on it six to eight weeks, something like that. And towards the end, I was like, Dude, this is a nightmare. I hate this, you know, like, and I’ve got enough to keep me busy. And I can telework and all that kind of stuff. And we didn’t really have those situations that some of these other states did, where the cops were coming in arresting businesses for opening up, and I was pretty sheltered. From all that, to be honest and and yeah, What a weird What a weird flip flop where they’re arresting these businesses for opening up. Yeah. And the protests are like Well, that’s cool. Go ahead.\n\nYeah, fill the streets even before that it was we’re gonna let these prisoners out because we don’t want them to get Coronavirus and then. So you let them out. And then you’re arresting like moms playing with their kids at the park and people are watching that going on in what universe? Does this make any sense? Yeah. And we’re starting to get sort of, you know, then there’s questions about you know, how many people are really dying from this and ventilators and you know, we got guys going to do you know, going with their video cameras to hospitals going there’s nothing going on in here. And then the nurses making tic Tock videos that seem like they’re mocking us\n\nand oh, it’s bonkers. You know, what’s gonna be cool though, is someone out there I hope is making like a pretty crafted documentary about all this. Whether it’s mainstream or conspiracy I know there’s a couple conspiracy type playing demick type documentaries coming but I’m in\n\none I’m in one prime for panic lockdown 2020 that Richard Willetts did he’s the director for David Ike and and and he said I want to do this video where I just do like zoom calls with all these people that are locked up and get everybody’s take he goes Do you want to be in a course I want to be in it nice so so yeah there’s there’s someone who’s gonna I want someone to make like a wacky one you know like a Benny Hill type or like the Benny Hill theme song playing in the background yeah I don’t want people rioting and falling down and getting you know run over and\n\nwear the mask don’t wear the mask you know, it’s it’s Yeah.\n\nI you know, I’ve I’ve had this conversation with some people that are like, friends or family members that are not involved in this these types of topics. And what I’ve said is that, you know, a lot of this is like the solid linsky rules for radical playbook like a lot of this this This, this behavior that’s going on right now. Is not it’s not or it’s not something that’s brand new. This is this has been, you know, they’ve talked about doing this sort of stuff for a long, long time I started seeing the first hints of that with like the Charlottesville when the Klan, if you remember that like a year or so ago with the guy that was, you know, the Klan was going through there. And I was saying to my wife, you know, there’s a there’s a story. There’s a solid linsky story where they talk about how they these guys go to them and they say we want to we want to protest against this, this guy who’s running for office, and we want to get you know, we want to hold up these signs that really embarrass him and everything and Saul Alinsky goes, No, no, no, no, don’t do it that way. What you do is you dress up like the Klan and go to his all of his events. And whenever he says something you disagree with. Remember you’re dressed as the Klan. Just Start applauding just started playing and then next thing you know, you’ve tied yourself at dressed as the Klan, which of course, you’re not to this candidate that you hate. And you’ve put the two of them together. And I was like, Oh my God, that’s such a really that’s a really Machiavellian strategy. And these guy and so I start seeing that with Charlottesville, and I was like, hang on a second. I wonder if these Klan guys there are as or organic or authentic as they’re meant to be? Like, it seems like a pretty good way to try and mix up Donald Trump and try and get him you know, and then he remember he came out and said, oh, there’s some fine people there and whatever. And they did that they managed to tie him to like supporting the clan. And I was like, well, that is literally straight out of the book. So when I see this one with one, go ahead, sorry, when I see 2020 I feel like there’s there’s a lot of that like they’re going through this playbook going, Okay, well you know, accuse your enemy that which you are guilty of, and let’s and Oh, you want to If you want to, you know the cloud and pivot strategy, Oh, you want to reform welfare will invite everybody into the system so that we can break it and then once we break it, then we can rebuild it. And so I’m seeing this sort of play out with society right now. I’m like, Oh, they want to break the police force. They want to, they want to totally destroy the police force so that they can reimagine it in their image. Where have I seen that before? You know, that’s, that’s Rules for Radicals and stuff like that. So So it’s, it’s crazy bonkers here, but it’s not as if these these incidents that are occurring are really all that authentic. They seem to be a bit contrived, like you said, when when everybody around the world is all of a sudden protesting this George Floyd thing. Like, how does that happen without a coordinated effect effort by everybody working together and My guess would be that it is coordinated that it was made to happen that way. It’s not to say that the event wasn’t real, but it but the promotion of the event as the only thing in the world, you know, you turn on your TV, and it’s 24 seven just about that. That’s the media, the media controls that because they could very easily make it 24 seven, let’s go get the cops that killed Brianna Taylor, but they’re not doing that. So what’s the agenda? And like you said, getting six guys together in the in that run these major media companies in the same room and getting them on board? Hell that’s done every year at Bilderberg. So people are they already have them there. You don’t have to people. So how can you control this whole thing? You don’t have to control everybody. You just have to control the guys at the top. And of course, we know you can do that a variety of ways they can. They can be on board with you, you know, because they’re down with the plan or they can be on board with you because you’ve got pictures of them doing something with a goat. You know what I mean? There’s a lot of ways to make these guys play ball and the media to me and indeed If somebody says, Well, what is the core? You know, if I read your octopus book and took what what would I come away with? You would, you would come away with it with a certainty that I hate the mainstream media. That is one thing that God runs through the entire but I have no respect for them at all. I think they are the most dangerous institution in our country and they are an enemy of the people. And 2020 has been a media driven year, you know, the events have, you know, we see this confusion, like you said, masks on masks off, got to wear the mass, don’t wear the mat. This is media, this is all media driven. And so\n\nwhat do you think? What do you think? Because it because I felt that too, you know, and I’m in that same camp where I’m like, it’s really difficult to trust the news, the media,\n\nI’m not sure what the solution is because I do think that like I have this sort of general you know, I don’t have support supporting evidence for the statement, but I would say that most of the journalists working in the in the media in the news are like, you know, genuine and doing the right thing. And then you’ve got maybe like a few rogue editors that maybe get the secret like, Hey, don’t push this article, like we saw with the Epstein when they shut down old girls interview with\n\nYeah. Like, I kind of think that there’s a, like, the large majority of journalists and news outlets like, I have a general trust of them. But then I think there’s certain times they suppress things. So like, I don’t know what the solution to that is, because I don’t want a state run media either. I mean, obviously, that’s not good for democracy. You know, I don’t know what the right answer is. Do you? Do you think there’s any good solution for that? Or, you know, what’s your ideas on that?\n\nI mean, the I don’t know if we could Never really go back to it. But I know that when things started to get bad in the media was when Bill Clinton deregulated everything and made it so that that these media companies could click up into bigger, bigger, you know, large multinational, not behemoth. And that really caused huge problems because like you said, you could you could have the best of intentions, you could be a real good reporter that’s trying to get to the bottom of this. And all it takes is one editor that’s not putting your stuff in or saying, well, we got to change this or we have, you know, you can’t you can’t write about this person or you can’t write about Israel or you can’t write about the you know, and all of a sudden you start to if you want to be in that industry, if you’re like a decent reporter, you’re like, Oh, my good stuff is getting airtime. But I need this job. So I’m going to keep writing about you know, whether when you look at this dress, it’s a blue dress or a gray dress, you know what I mean? Like all this stuff, so you get bogged down in the stuff because you want to keep Your job but like the real journalists that are writing about things, they don’t get a platform at the new york times they don’t get at the Washington Post. They don’t they don’t have, you know, they’ll say, Oh, well we’ve got max boot writing for us he’s gonna write about this max boot is a member of the project for a New American Century. And he’s going to be your journalist, he’s going to write about all this stuff and you go Well, I’m not trusting that guy. So some journalists that play ball get elevated and all their stories wind up magically making it onto into the newspapers or the magazines or whatever and others others get frustrated and go away so I think that the media I’d love to see the media be deregulate you know, you know, broken up all these major corporations because but even the smaller ones you have to like like wonder like where you get your money, you know, we’re going to start the intercept. Cool Glenn Greenwald. You know, he’s the Snowden guy but okay. And and Jeremy Scahill. Let’s find I mean, I like these guys. They write good books and do great work. Where’s the money coming from? It’s coming from Pierre Omidyar. Okay, well, didn’t he start eBay? Yeah, yeah. But he’s got this political slant. So then it’s like, even if you’ve got great journalists that are writing interesting things, like who’s financing them? And it’s it becomes a, you know, a shell game of like trying to figure out who’s, who’s got the money and who’s putting money in there. And what do they want? Because if, if, you know, if somebody if Jeff Bezos buys the Washington Post for 250 million dollars, but also has a $600 million contract with the CIA, like, that’s something that’s important to know because when you’re reading the Washington Post you you have to ask yourself, Am I getting like unfiltered news? Or am I getting you the news that the CIA wants you to read because after all, the guy that owns this newspaper works with them. So we as a society have to be better at discernment as far as our, what we take in, in this media landscape, it’s really tempting to sort of like when you’re super busy, turn on the nightly news, get 30 minutes of it, you know, think you’re getting a good understanding of the stories and then you go out about your life. And you think you’ve, you know what’s going on, but you You really don’t. And it’s been that’s frustrating because our parents generation, like, they trusted the news. And maybe they maybe they had a better a more of a reason to, you know, they liked, you know, I like Peter Jennings, and he’s, he seems like a good guy. And um, you know, I don’t watch abc news every night and he tells me the information and but those days are gone. And now you, you know, now we spend a 24 hour news cycle trying to figure out whether or not a noose was real or whether it was just a pole tie for somebody’s garage door. Talladega You know, you’re like, Oh, my God,\n\nwhat are we doing? Everything’s gone. Click Beatty stuff. You know, it’s like every headline is like, you’ll never guess who lost 50 pounds. And it’s like, okay, I’ll click the article, I guess like, it’s just like nonsense like that. Yeah. And what’s reassuring to me and and, you know, I don’t know if you’ve, you’ve observed this as well, you can maybe tell me if I’m wrong, but in since COVID since March 2020 I’ve found that and this could, I found that increased interest in like, my podcast, my research, my books, all that stuff. And I don’t know if that and what I’d like to think that is, is that because everyone’s either got extra time on their hands now. We’re kinda like you said where, you know, pre COVID it was, you know, you go, go, go get up, go to work, get home, catch dinner, get 20 minutes of some fake news. And then go to sleep because like you don’t have the time to dig into these topics and I don’t know if it’s, if it’s because there’s extra time now or maybe people are starting, you know, as the cube community says the Great Awakening, right people, I mean, people aren’t stupid. I mean, people are dumb, but like, people aren’t stupid, in general, right? And like, you can only fool people so, so much, you know, there’s there’s a saying like that. Yeah, you can only fool the people so much before people, you know, people can put these pieces together and and they start at least having they’re intrigued by it, or at least wondering. And there’s they’re seeing that the news and all these trusted sources like the CDC and the World Health Organization, and all these people we’ve trusted for so long, at least, the mainstream the masses have, they’re there. They’re seeing through the lies and the deception. So to me, I think there is sort of this weird Great Awakening happening in 2020.\n\nIt’s funny because there’s there’s like, if you think Give it like a like a chart, there’s one curve that that is. There’s one curve that’s on its way up like ascending and that is people waking up, there’s, there’s this, people are waking up at a rate that is ascending. But then there’s this other curve that’s dropping down. And that is the intentional dumbing down of America, and that it’s through, you know, through bad media and bad food and mis education and fluoride in the water and vaccines and all these things that impair your ability for cognitive function. So that’s going down like idiocracy. And but the awakening is going up and that you’ve got to keep the awakening ahead of the curve of the dumbing down, because if they get everybody dumbed down, then nobody will figure it out. But I put a quote in my book from Dr. Russell Blaylock, who’s a neurosurgeon, and he said that he talks about how there’s this mass of people that have all just been so dumbed down, that they’re not, they don’t have the ability for critical thinking. They’re just kind of depends And on the government for everything and then we have this small percentage of the population of high IQ that’s up above that can see the whole plan laid out and they, they’re mortified by it. So I feel like that’s that’s kind of where we are right now. I launched my podcast called macro aggressions in Jan in the first part of March, right before the pandemic, I had recorded a bunch of episodes and gotten it already starting in February. And so when I put it out, I was like, Well, I have no expectations of anybody you know, really hearing it I don’t know if people will listen to it. And then someone said Oh, you should check out after after about a month or so they said oh, you should check out chargeable because if you go in charitable then you can you can see where your podcasts ranks, and I was like, Okay, well, I’ll be 15,000 on that list right of government section of Apple podcasts. And and I was number two on the list. Okay. of Alex Jones in the BBC. And I was like, how is this possible? How is this and with someone explaining it? Well, you’re not really ahead of Alex Jones. I mean, you are on this chart. But you obviously don’t have the audience he has. And I was like, Well, what is happening here? So we looked into it, and it was like, people were just in just interested in the topics, the topics that I put out, we’re about what they weren’t even about the Coronavirus. It was about something totally different. And, and my producer and I were talking about He’s like, you know, people just have more time for this stuff right now. Yeah, he’s like, I think we might have just put this out at the perfect time where people are their list, you know, people are at home. And they’ve so they’ve got the time and now they’re starting to get antsy, and they’re starting to dig around to see if this stuff is true or not. And they’re starting to find podcasts and podcasts are already going up like this. But But it turned out to that. That just the timing of the release of the of the whole Podcast Series works. out great because just because people had the time to sit back and listen, now I would prefer that this event didn’t happen and that people were back to work and that the economy was up and running. And we were having a more normal situation. I don’t I don’t care so much about the podcast, I’d rather that the society be healthy, but but since it wasn’t and people had the downtime, I feel like there’s been a lot of exploration into, you know, is the media telling me the truth? Who is the CDC? Who’s the World Health Organization? What is the United Nations or that who’s Bill Gates? You know, what I always knew him as the Microsoft guy. Is this guy, you know, it was there more. So if there is a silver lining to this, and it might not be a very bright one. But there seems to be a lot of people that have been pushed into a situation where they no longer feel that they trust what they’re seeing on their television, and they’re trying to dig around for some better explanations for things and so that’s a good that’s a good thing because when we get people thinking Or another thing that they might not have any sort of conspiratorial instincts to them. But they do know that Fauci said, Don’t wear a mask, it’s going to be fine. You don’t need one. They’re not that they’re don’t really do that much for you. And then literally Three weeks later, he’s saying the exact opposite thing. So even that you don’t have to be a conspiracy theorist to realize that there are two different types, or two different sets of instructions that contradict each other. And then you dig into more of that. And you said, well hang on a second, you’ve asked me to close down my life because of this virus, and you can’t even give me a straight answer as to what it is or what I’m supposed to do. Hang on a second. If you can’t give me that answer, then I’m out of here. And so it’s a weird dynamic where we’ve got, you know, the frustration of being cooped up but also but the the bright side is that people are digging in to try and figure out if this information that they are that they’re consuming is actually real, and I think they answered a lot of people are getting is it’s not real. It’s not real. There’s a lot of conflicts of interest in Look, I’m not a doctor, not a, you know, I don’t pretend to be one. But you don’t need to be one to understand that there’s a lot of misinformation. And you’ve got one set of numbers coming out from this group and another set coming out from that group and you go, you know, who’s the least trustworthy sources in the world, Chinese government, Chinese media, American government, American media, CDC and the World Health Organization. And these are the six institutions that we’re taking our orders from, none of them should be trusted for anything. And yet, we have to shut down our lives because of them. Like I would be more inclined to do that. If it was just somebody that was just a regular doctor from a regular hospital. But once I start to see Bill Gates make an appearance, I’m like, Okay, I need to start letting people know that there’s more to this guy than meets the eye. So, so for everything that we’re going through in 2020, and it’s a lot If we get if we if the one good thing that comes out of it is that the mass, the masses of people are become very distrustful or skeptical of the mainstream media, that would be a good thing. One wouldn’t make up for all the horrible things that we’ve experienced, but at least that will prevent them from trying to do this over and over again. But they’re going to try. I mean, we see the setup right now for the second wave and we see it and then we’re going to get people fighting each other again, you got to wear your mask. I’m not wearing a mask, you know, and it’s like, divide and conquer, divide us into smaller groups and it it works well but but I do have this, this fantasy hope. Maybe it’ll happen that that they will have overplayed their hand with the situation and that people will go, Okay, I recognize bullshit when I hear it. And this is this is this is not making sense to me. Got a big problem with the, the the conflicts of interest with these vaccine makers? I’ve got I’ve got real questions about Bill Gates. I don’t know who Fauci is, I don’t trust that guy. The government is lying to me, the President is lying to me. You know, it’d be it’d be a great thing if we, if we came out of this, where everybody was just totally skeptical of anything that the government in the media told them, because that’s, that’s where we have to get to as a society, we got to get back to that point where we are very distrustful of them. Because, you know, they don’t deserve our trust. They haven’t earned it. They’ve been lying to us if this was a relationship, if you were in a relationship with a with another person, the way you’re in a relationship with your government. It’d be your third you know, you’d be at a therapist, your therapist would be telling you you gotta leave this this is an abusive relationship. What are you doing? Why do you stay in this? Yeah, you know, you my government hits me because he loves me. You’re liking\n\nthen. I think that’s healthy. I think that’s I think that’s the civic duty. Because you know, I love this country, I’m very patriotic for it. And I think it’s civic duty, much like the Second Amendment and owning a gun. Like it’s almost your civic duty to prevent tyranny, and to keep people in check. And it’s the, the, the public’s responsibility to be informed and to ask the tough questions and to question everything that’s being said, to make sure things don’t get into the wrong hands. And what I noticed was, I wrote, I’ve got like, a lot of anxiety and depression, which is really awesome for 2020. Yeah. And I read a book called The word cure, which I recommend to anybody. I think it’s called the word here, no shit anyway. I’m pretty sure that’s what it’s called. And it talks about one of the takeaways I had, it was like, what happens is our minds when things don’t make sense, when there’s a bit of a cognitive dissonance, or, you know, Fauci says don’t wear a mask that he says wear the mask. What it does is it induces a state of anxiety and people try to alleviate the anxiety with fact finding missions. And that is what, that’s what I think is happening with why it’s true. The community is getting this increased attention and focus and people researching. Because I think that people want the answers because they’ve induced this anxiety. And kinda like when you said, You’re curious if maybe they’re over playing their hand. You know, I think they get off a little bit on the anxiety and the fear and maybe had an unintended consequence where people are now going to question which, which leads me into my I got two more questions for you before I let you go. All right, and the second question is going to be talking about your upcoming projects here.\n\nabout the rest of 2020 and what we can expect specifically Project Blue Beam because I, I think I think that’s legit. I don’t know if it’s gonna happen this year, but they’re paving the way For Project Blue Beam, which sounded insane, I would have questioned that a while back.\n\nBut what do you think what do you think’s in store for us here?\n\nI’m 100% with you on the Project Blue Beam thing, because it sounds crazy. everybody that knows about Project Blue Beam says the same thing. That’s where we all start off with. It sounds crazy, but but you’ve got Wernher von Braun confessing on his deathbed to Carol Rawson that that’s part of the plan. Now, is that, does that mean that it’s actually going to happen? No, of course not. But, but that’s somebody that would was in the know that might know about something like this. Do they have the technology to make something like that happen? They do. I’ll tell you why. Because I put in my book. They used a technique against Abu Zubaydah. I think one of the guys that they were interrogating in Guantanamo Bay. Where they made a vision of Allah come to him in his prison cell and tell him that in order to if he wanted to be on the right side, he would have humanity he would he would. He would give the he would tell the Americans everything that he needed to know. And that you know that they wanted to know that he would do the right thing, and he would stop this insanity. And apparently, the next morning, the you know, the Americans went to him and he said, I’ll tell you, whatever you want to know. So they’ve already been using this stuff on unlimited scale. We know that the technology that we experience on a daily basis is just like the retail technology, but the real governmental stuff that’s, you know, that’s hidden and buried in deep projects or maybe deep underground bunkers and things like that is decades ahead of us that has been well established. We have you know, the reports of tr three beef you know, the triangular, Lockheed Martin built space ships and stuff like that those have been spotted for the last 20 years and things. So is it possible that the technology exists to create a project Blue Beam scenario? Well, I think it does exist, but it needs a couple things. Could five g be a part of that? Could be? Could this is the satellite system, the starlink satellite system that’s being put up be part of it? Absolutely. What about the x 37? b, that looks like a mini space shuttle that was orbiting the Earth for three years? And nobody could get a straight answer as to what that was up there for? Could that be a part of it? Of course, it can be part of it. So we don’t even know what we don’t know. I mean, we don’t know what’s going on in space. So is it possible that they could be setting this up and it could use a variety of things to make it come to life five G. chem trails, the ionization of the atmosphere. Elena Freeman talks about the space fence and things. I mean, yeah, it could it could be part of it. I don’t I’m not privy to Any sort of top secret information or anything like that, but I mean, I think that we have to acknowledge that that could be a possibility now a fake alien invasion, we in the alternative media have been talking about it in sort of a joking sense for a long, long time. So if they went that route, we would of course, just be screaming at the top of our lungs. This is all fake, this is all fake. So they know that they know that that would be our reaction to it. So could it be that they’re getting their deep platforming? All of us in advance of that could be could be a you know that that we that tends to happen right before an invasion anyway, so so you get all these truth tellers that might come out and talk about maybe we shouldn’t go into Iraq, or maybe we shouldn’t go into Afghanistan, all of a sudden, they’re, they’re no longer in the picture discussing these things. So a deep a massive deep platforming of 2020 could be in store for us. That could mean a variety of things. It could be a bunch of people that they don’t want talking about the riots or the Coronavirus but it could also be they don’t want them talking about you know the possible setup of a Blue Beam situation so take that in conjunction with Trump’s space force and the to the stars Academy CIA project that they’re running trying to make it look like Tom DeLonge is doing that himself which is not so I I would expect some space fuckery in the in in the in the near future but I don’t know if it’ll come in the form of Project Blue Beam but you know, after after the year we’ve had nothing would surprise me\n\nI am going to let you go here because we’re running out of time, but I do want to hear share with me in the audience your next project. Obviously you’ve got the podcast right? You’re working\n\nYeah, podcast called macro aggressions that can that’s on Apple Spotify I Heart Radio and on David ickes iconic platform as well. And I got a new book that should be coming out in about a month with Jeff Berwick, who is the founder of the dollar vigilante and a narco poco. This book is called the controlled demolition of the American Empire. And it talks about, we had a, we got lucky on this one, because I had my part done a long time ago, and Jeff was working on his and we should have had it out by now. But then when the corona situation happened, we just stopped and I rewrote a whole section that we wound up going, I basically rewrote a big chunk that we had to go insert throughout the book. So we got lucky that we were able to incorporate that into into it because a lot of what we were talking about the the intentional taking down of this country, it happens in stages. And unfortunately, we feel that we’re at towards the final stage of that. So that book will be out. There’ll be available for pre sale sometime in July, and hopefully it’ll be out by all August, I think\n\nif anyone wants to reach me they can do so my website is the octopus of global control calm. And you can get the book there if you want the paper, the digital version of it if you’d like the paperback that’s available on Amazon and Barnes and Noble, but the digital versions at my site.\n\nwhere can my audience link up with you on like, you know, the Twitter and stuff I know you’ve been on Twitter already wants. So\n\nTwitter kicked me off in February for jokingly suggesting that we should throw Bill Gates into a volcano. That was pre Coronavirus, by the way,\n\nwhich is funny because I bet over half of the population would\n\nagree with you on that. But go ahead,\n\nof course and it was it was a joke. I wasn’t even Yeah, whatever. It’s Twitter. They don’t they don’t get humor, but you can find me there at macro aggression. And on Facebook, I’m there for as long as I’m on Facebook today. We’ll just put it that way. We’ll see if I’m on there. I go in and out of their jail but facebook.com forward slash the octopus of global control.\n\nAwesome. And I’ll put links to all that stuff, your books, your Twitter and your Facebook in the show notes and on Illuminatiwatcher.com.\n\nThanks for your time. And let’s stay in touch because I think that when your next book drops, things are gonna be significantly different at that point of the year.\n\nI think so too. I think we’ve got a we got we there’s definitely going to be some some new events injected into this scenario, this this 20 simulation that we’re living through.\n\nAll right, man. Thanks for your time. Appreciate it.\n\nThanks so much.\n\nAll right. How’d you like the special guest I try to get you a guest every month. You can thank all the Patreon supporters for that. Trying to get that guest action going. And stay tuned. Stay stay subscribed into the podcast again. You can hit them like Instagram ad Isaac Weishaupt check out those images from Dr. Sleep with the shining and the play girl in the porno tape. It’s a no it’s a magazine, excuse me. And yeah, and then stay tuned. We have a lot of stuff recovering in July it’s gonna be a hot July baby. It’s gonna be hot. So check it out. And then if you want to support the show patreon.com backslash Illuminati watcher. Stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Great Awakening of 2020 with Charlie Robinson! Masks, Protests, Media Manipulation & Project Blue Beam! - IlluminatiWatcher", "description": "Join Charlie Robinson as we explore the octopus of global control! Today's podcast has a ton of info on the events unfolding- COVID, protests and more!", "url": "https://illuminatiwatcher.com/the-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-07-06T13:09:59+00:00", "article:modified_time": "2020-07-06T13:18:41+00:00", "image": "https://i2.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/06/ctauc-charlie-robinson.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["charlie robinson illuminati", "charlie robinson interview", "charlie robinson octopus"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://twitter.com/macroaggressio3", "https://www.facebook.com/theoctopusofglobalcontrol/", "http://TheOctopusOfGlobalControl.com", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/34623792", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/the-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam/?share=twitter", "https://illuminatiwatcher.com/the-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20The%20Great%20Awakening%20of%202020%20with%20Charlie%20Robinson%21%20Masks%2C%20Protests%2C%20Media%20Manipulation%20%26%20Project%20Blue%20Beam%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fthe-great-awakening-of-2020-with-charlie-robinson-masks-protests-media-manipulation-project-blue-beam%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2020-07-06T13:09:59+00:00"}