{"result_id": "165008", "URL": "https://illuminatiwatcher.com/inauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship/", "timestamp": "2023-04-25 15:35:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/inauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Inauguration Goddesses, UFO Black Vault, Kesha, Lana Del Rey, Azealia Banks & Naughty Truthers! AND My Response to Censorship!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we break down a TON of pop culture symbolism! We get into J Lo and Gaga’s appearance as the goddesses at the Inauguration, the unleashing of the UFO Black Vault files, Kesha and Demi Lovato’s UFO obsessions & Lana Del Rey and Azealia’s witchcraft! We also get into what all those naughty truthers did and my response to that- the official announcement of the IlluminatiWatcher VIP Section! (*with coupon code- link in show notes!).\n• Welcome to the VIP Section- get all the perks you get on Patreon for same price; go here and use code “hotgirlsummer” by May 1st, 2021 to get 20% of any tier for 3 months (*Patreon and Rokfin are STILL active; this is just a new option): https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Inauguration Goddesses, UFO Black Vault, Kesha, Lana Del Rey, Azealia Banks & Naughty Truthers! AND My Response to Censorship!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nfirst big thing that happened was we saw this really, really bright light. First of all this blue orb cat, oh my god, beautiful. It kept floating in front of us like 2030 feet away. And then when I would try to walk up to it, it would just hop another 2030 feet back, so I could never chase it or get to it. But I was trying. And one point in the night, I literally said, meet me in my dreams. Let’s, let’s hang out my dreams. We’re calling it on the contact session tonight. But you’re welcome to come hang out my dreams. And Dr. Greer calls this blue orb kindness because they had an experience with this same blue orb in the desert where it actually healed somebody hearing loss.\n\nI don’t know about you, but that great conjunction really. conjunct defied everything. We thought 2020 was bad. Well, what about 2021? I don’t know. This is crazy. I’ve got a lot of stuff to talk to you about today. Here is a top level view of what today’s show is going to look like. First, because I’ve got so many questions from you. I need to talk to you about my response to censorship and what I’m doing with all the sort of Patreon and the rock Finn. And now I’ve got the VIP section on Illuminati. watcher.com. What are you doing Isaac, if you lost your mind? I’ll tell you all about that. And I got coupons. Got coupons. So stay tuned. And know you like coupons who doesn’t love coupons? Then we’re going to briefly cover a bunch of topics we’re going to shotgun bookshop blast about the inauguration drama, but not what you think I’m not talking about politics because no, we don’t do that here. There were some naughty naughty conspiracy people that were pushing naughty, naughty politics stuff. But that’s not what we do here. So we’re gonna talk about Instead, we’re talking about the goddess energies of JLo and Gaga at the inauguration, then we’re talking about Lana Del Rey, we’re going to visit our our witchcraft friends. azealia banks as well. Yes. We’re going to talk Oh, what else that Nashville bomber Who? You know, that happened two weeks ago. So it’s the oldest news ever we already forgotten moved on to crazier things. I’m going to talk to you about yet another show that I’m doing. I’m picking up part time jobs, you know. Now we’re gonna get into alien News. I’m gonna catch you up in the laser, the alien drama. A little bit of kesho, Demi Lovato alien talk, we’re gonna talk about that black vault, Hawaiian new ovos and all kinds of stuff. Anyway. Let’s get into it. We don’t have enough time. By the time I publish this show, there’s gonna be something crazier that happens. Unfortunately, this is the turbulent time that maybe ban is traditionalism. His ideas of the Kali Yuga. The final cycle. Maybe he was right, maybe the chaos reigned supreme as he wanted back in 2016 when he was running the campaign for Trump. And he said this is the chaos candidate here to bring the chaos to bring about the end times to bring about the new golden age for me and my rich friends. And oh, by the way, I don’t know if you saw that I retweeted they confirm that Bannon was in fact talking to Trump these last couple weeks. So I told you I told you q was a psyop and I got roasted relentlessly roasted Poor me. And I was right. 100%. And then I even said Steve Bannon is like some of these ideas aren’t mine originally. Like I’m not this prophet. Okay? So let’s not let’s not go there with it. But there’s some some buggery afoot. Okay. Anyhow, but we don’t talk politics here. We don’t do that. Right. It’s a safe show a safe space. Let’s first break down what I’m doing. You’re like, Isaac, bro. For years. You said, you want to support me go to patreon.com backslash Illuminati watcher. So I did. Then months ago, you said, Hey, in fear of censorship, I set up shop over on rockfon. And you told me to sign up@rockfon.com slash creator slash Isaac. And for one subscription fee. I get access to all kinds of creators, not just your bonus content, but all kinds of other people. And I said yes, this is the way my friend But then, in light of, you know, all the, you know, some of these charters they were naughty, naughty folks. We had a historic incident in America here. Regardless of what you and I want to believe. You know, I’m lumped in here, I’m lumped in with the truth of movement, unfortunately. And the writing’s on the wall, even though I’m critical of the truth, there’s many times. But then at the same time, I also say, Well, the truth or truth is always right, because shockingly, they’re right most of the time, most of the time. They got it wrong in the queue thing, but anyway. But they want to assign blame to what happened on troopers. That’s where we’re at. And, you know, you could argue this was orchestrated at much different levels. And I’m not going to speculate on that I didn’t I don’t dig into that too much. Maybe someone on rockfon does. I know they do. There’s lots of political shows on rockfon, where they get into that stuff. Anyway, I set up showing rockfon because of the fear of Patreon booting me, okay. If you recall my story, there was a day that I actually ironically, I talked to the CEO of rockfon, about the platform, and he told me that, you know, the ideas of what they were behind, they were all about free speech. And I was like, Okay, sounds good. But I’m happy with Patreon. Thank you very much. hours later, Patreon started canceling all kinds of QA on accounts. I was like, Oh, boy. And this is before those idiots rated the capital. So when the idiots rated the capital, I thought, Oh, boy. This is it’s coming down fast, baby. Like Helter Skelter, it’s coming down fast.\n\nyou know, I joined rockfon in the fear of getting booted from Patreon because I wanted you to be able to seamlessly transition over to another network. In case this happens, they’ve never you know, Patreon but good to be in that never threaten me, boom, boom, boom, whatever. But before I sign up with Rocklin, there was a moment where I talked to my man, Greg carwood, over at higher side, I said, Dude, how do you do this man? How do you set it up on your own website? And he told me and I started doing now hop. This is a nightmare. Nope, I’m just gonna go to rockin. Because there’s a lot of work involved. When you do it on when you need to do it yourself, do you like to do it yourself. But in the back of my mind, I thought you know, someday, someday I’m gonna set up my own thing. And then given the event that transpired, I’m not taking any chances. I’m just I was like, that’s why I’ve been suspiciously quiet lately on the socials because I’ve been busy. I’m not taking any chances. The system that I built is going to be the long term solution, it will always be there. I spent hundreds of dollars and many hours setting this up. This is the way forward. Now I’m going to keep emphasizing and footstone me because I got a lot of questions about this. I do not want I’m not saying I want you to move from Patreon over to Illuminati watcher calm. I’m not saying I want you to move from rock Finn over to Illuminati watcher.com I want you to be go where you want to go be happy where your whatever because each offer different flavors right? And I give you a comparison chart on my website. If you go to Illuminati watch comm go to the VIP tab along the top, you’ll see the sales pitch. And I compare all the systems at the bottom and a little chart for you. Because I realized this is not optimal. This is very much not a smart business move to be like go here, go here, go here. So like I leave it up to you like whatever you like, like hit it. I appreciate you no matter where you’re at. I just needed to set something up in fear of massive corporate censorship and I didn’t want to be caught flat footed. So just bury this in the back of your mind so that if one day when you go to get into your favorite system to listen to your favorite podcaster the thumbnail no longer there. You know where to find me. Okay, it’s Illuminati. watcher.com get in the VIP section, baby. So anyways, I set this all up, and almost on cue, Vimeo flagged me and blocked me out of my videos. which presents a problem because some of my people on Patreon they get the coupon code video that I created. How am I supposed to give that to you? Like, I pay Vimeo to stream my content. I pay them to host them because YouTube banned me. So I was like, Well, fine, I’ll go Vimeo I’ll pay them which is stupid to blame my videos. And it gives you an ad free experience. I’m like, okay, cool, whatever. Sounds good. But now they’re flagging me and then they and we’ve been fighting and I think they’re gonna kick me out of there. I think my videos are still okay. Except for the Kubrick one. Apparently the Kubrick ones got problems. I don’t know. Which by the way, I got a way around that on the Illuminati. Watch it out. The VIP section I give you when you sign up. It’ll email you a promo code to get that coupon code video, you can download it for free from my gumroad store. I know it’s it’s messy, my friends. But here’s what Vimeo told me in the guidelines. It’s actually quite easy. It’s quite, quite simple. When you sign for the VIP section, you get like two emails, boom, easy, download things, you’re good to go. Because the VIP section is going to be almost exactly identical to Patreon. It’s almost identical, like the price structure the the little gifts you get, you get the two free books, you get the covers code video, you get all the things, the only thing you don’t get, you don’t get the discord. And there’s not as much of like the sort of community vibe of like comments and stuff like that. So if you’re, you know, like I said, each thing’s got their own flavor. But Vimeo, this is what they told me. They like, doing the same bullshit that YouTube’s doing, oh, you have to read the guidelines. And I’m like, what, what am I violating? Tell me specifically what video and what it is you don’t like. And they never tell you they won’t they won’t tell you. They say just refer to the guy that so I read the guidelines. This is what the guidelines say says videos that contain conspiracy related content where the underlying conspiracy theory makes claims that one suggests that a real tragedy did not occur or to violate other content restrictions. says we do not allow conspiracy theory related content where the underlying conspiracy theory spreads, among other things, hate speech, large scale, defamation, false or misleading vaccination or health safety content. We have banned, for example, QA non related content on this basis. So in conclusion, the truth community is getting booted off everything that’s happening, it’s a matter of time. Always been critical. The truth is, but that doesn’t matter. I’m lumped right in there with him. Because guess what the title of my show is conspiracy theories and on popular culture, I am screwed. That was that that was one of my options I was looking at I was considering was, maybe I just rebrand the show, take on like a new title show, you know, new logo, new website, new pseudonym, that’s way too messy. And then also don’t like, on some levels, how it bows down to this idea that censorship is, you know, it’s just okay. And I just got to deal with it. Because it’s not okay. It’s a problem. But I can only do what I can do. So it took me back to plan a this long delayed plan of setting a mon network. In fact, you’ll notice a lot of the troopers are doing this. We’re all scrambling to find networks to join you. You’ll notice this right, I follow him on social media. So you’ve seen it too. Everyone’s scrambling to find me over here. If I’m over here, a lot of a lot of people go into rock Finn, which is good rock sounds great. But, you know, and some of these networks, you know, they promises they say, we will not ban you. But you know, it’s too much reliance upon corporations and someone else, Greg Carr would was a man who saw the future, and he knew it. And he set up his own thing. Which, you know, there’s potential pitfalls there. But like, it’s way further down the line. There’s much more protection in this. I want a direct connection with you. So finally, I did it. And in defense of the other troopers, myself included, you know, I set up shop on the Patreon and the rock fan. In fact, I’m actually working with aftermath. You know, that’s a that’s a no hell, Clyde lewis’s network thing he’s got setting up mergo Mr. Gates, I’m gonna show over there called pair awareness. And I’ll talk to you about that in a bit. But yeah, there’s like three places right there. Anyway, the idea is like, in the truth or community, we’ve been put in this weird position where they banned us off everything you can’t monetize off of YouTube get monetize off anything. So the idea is like, you have to take on multiple part time jobs here. I’m working on the weekends, I do a show at one venue or whatever, you know, it’s kind of like, you want to see a comedian. You can do it live in one place, you could stream it online and another place. So like, I get it from your experience that sucks, but like, Don’t blame me blame corporate america and censorship. And I say all that to say this. I want you to support me whatever we desire, whichever one you like. I’ll appreciate literally everything from your free feed listens to you know, drop an overview, all the way up to like top tier three support through Patreon or VIP. I just legitimately want you to find the spot that works for you and your family. I have zero interest in like strong army money out of you. I don’t I don’t want it that bad. Like if it comes down to like you buying flowers because you’re The doghouse because you did something stupid at home, you want to keep wifey happy. If it comes down to buying flowers to keep your home marriage happy versus pay me 20 bucks for tier two. Buy the flowers, bro. You know what I’m saying? come back later. not that big of a deal. So like I’m not, I’m just saying like, I’m sure this is a real pain in your ass. And I’m very sorry. But like it’s over. Now, I’ve got the system set up. Good to go baby. And again, I’ll have the links in the show notes, Illuminati watcher.com, go to the VIP section. Now, in fact, I’m going to be just doing something very cool with the earnings from the support systems from Patreon and rock Finn. And in the VIP section, we are going to be supporting operation Underground Railroad. And, you know, they have like a 1% for the planet thing where companies they donate 1% of their earnings to charity, we’re gonna do that 1% for the kids. You know what I’m saying? operation underground railroad there, if you’re not familiar with them, they basically fight modern day slavery and child trafficking. So we’re going 1% for the kids, and I don’t even like kids, I don’t have kids. But I don’t like trafficking much more. Okay, I support that operation underground railroad 100%. But given them I’ve been donating to them for a while now. But I thought you know what, we’re just gonna want to go out officially on this. Because I think we need a little bit of damage control in this truth to community a little bit. We, you know, most of us, most of them guys are out there. Oh, we’re gonna save the kids through QA none. And and one particular guy who is the most narcissistic person to walk the planet, he’ll be the one to save them. And I’ve been saying Don’t, don’t feed this monster. This is fake fake news is a sign up. So instead of all these other truth, who’s rather peddling nonsense to you, we’re gonna do something about it, we’re gonna really do something about it, we’re gonna put our money where our mouth is already signed up. We’re in the abolitionist club to end slavery is what it’s called.\n\nyou know, the, we, as a group are now going to fight modern day slavery, child trafficking, instead of spreading theories about you know, what some people may or may not do and all these cryptic bullshit QA non drops, we’re actually going to do something. So take pride in that if you support on any of those platforms, you’re helping support this. In fact, if you want to hear more about this, if you’re unfamiliar with what I’m talking about, Tim Ballard, he’s the CEO of operation Underground Railroad. He was on Aubrey Marcus’s podcast. And ironically, at the same time, there was a an event in my CrossFit gym where they were talking about operation Underground Railroad. So yeah, check out that interview with Tim Ballard. It’s, it’s moving to say lead. I mean, it’s disturbing to on the same level. And if you’re wondering, Well, you know, what kind of impact Are we really gonna have here? Well, let me tell you, I’m reading you right from their FAQs. They say eat Scituate, how much does it cost to save a kid bottom line. Each situation is different depending on travel research, Sting setup, working with governments, aftercare, etc. But on average, one operation could cost anywhere between 50 to 75 K, and each operation can save one to 50 children. So, if I do the math, we’re gonna save, you know, a couple kids a year. Isn’t that nice? We need to feel good about ourselves again, you know, make conspiracies great again. Yeah, this is a bit of a statement against like these All right, truth tellers who pushed the queue narrative and follow for the cya about the false Savior. Which is ironic, you know, because they’re, they’re the ones telling you Oh, government’s The worst thing ever. We need anarchy. It’s the worst thing ever. And yeah, they want to double down on a particular person in the government. Makes no sense. But you know, and here’s the thing, even maybe you’re one of those All right, cruisers. I know, half of us are. And that’s okay. I love you. You’ll like what we’re doing because you apparently have a problem with child trafficking to the greatest extent. So now we’re really gonna support it. Even if you’re not an alt right, anarchist, you’ll like that. Operation underground railroad works with the law enforcement, they train them on how to handle these traffickers. They set up the raid, they work with local governments. Maybe you’re a Mormon from Utah. Well, you’ll like to Tim Ballard. Graduated from BYU in Provo. See how this all we all get a little bit. Maybe you’re an occultist, Mormon doing ritual magic. In your magic panties. Well guess what? You’re part you’re on the team to now. We’re all coming together. The left the right.\n\nI’ll have to see how we can set it up. But yeah, I got inspired by guy. You know exactly what to do something like this for a long time. And I was talking to this guy from San Diego. He’s a fellow veteran who he donates to charity through his Coffee Company. So I thought you know what, we need to do this right? Now’s the time. So shout out wind and sea coffee on the Instagram. Check them out. I’m actually gonna buy some from him because I don’t lie to you, right? I don’t lie to you. I’m gonna buy some of his coffee. I’m gonna try it out. If I like it, I will plug it on the show. Make him a sponsor. You know what I’m saying? Maybe if he wants to, I don’t know. We’ll see. And I keep all the ads on the free feed. So like you might not hear this again if you’re on the supporter feeds. Now. Before we move on, I know you’re like damn Isaac move it along, bro. The new platform go to Illuminati watch.com. Go to the VIP section. Same tier set up as Patreon you get your bonus conspiracy theories and unpopular culture episodes. No commercials, no ads, early access. When you sign up, you’ll get an email with your private custom RSS feed, you drop it into your podcast app just like Patreon. And there’s links on my website you can because it doesn’t work with every single app like Spotify. You can’t do it. They don’t have that setup. works on Apple for sure. Yeah, you got the same stuff, man, you still gonna get tier one, you’ll still get the dark path Cooper’s code book. And Cooper’s code video tier two, big granola woke, you’ll still get the monthly shout out. I got to figure out how to make that work because the payment structure is different billing cycles. But anyway, tier three still on their alkaline Oh gee granola woke, you’ll get invites for my live stream that I do once a month. So basically, it’s the same as Patreon. Okay, but I’m still rocking on rockin and Patreon. So, you know, in rock, it’s still gonna be the place the only place where you can get inside the mind of a conspiracy theorist. That’s my second show. It’s my other part time job. Just like now I’ve got another part time job over at aftermath, where I do the pair awareness show with Mr. Gates, which is the only place you’ll get that. Now Oh, yeah. And then finally, the security because I know a lot of us are like, when you’re going to sign up, you got to put your credit card in. And you’re probably like, I don’t wanna put my credit card on a website called Illuminati watcher did? Well, let me tell you, it’s not handled by me. It actually goes through member space, which already talked to them about this. And they told me to tell you, all member login and billing details are secured using modern SSL encryption. It also said they use GDPR, ccpa, and SCA compliance, you can check all the details out on their member space.com slash privacy. And I’m uploading all the past shows I’m going to have every show on there right now. I don’t because it’s a lot of work. I plan on by April, having like the full library of 200 300 shows whatever we’re at up there. And for your travel, I told you had coupons for your troubles. I’m going to give you a coupon code but it disappears on May 1 2021 at midnight. So you’ve only got till May 1 to sign up. Use code hot girl summer, all one word. You get 20% off for three months. In the VIP section, baby. hot girl summer 20% off for three months. Just get on there before May 1. Okay. Let’s move it along. Good night. But you know what, you got a taste of what the last two weeks has been in my turbulent life. So it’s been a lot of work. A lot of sleepless nights here. Okay. Let’s get into the drama, inauguration drama. Lots of folks hit me up wanting to know about the angles of the pop culture my favorite angle? Of course, not politics. Like Katie on Patreon, I’m gonna answer your question here. Because guess who’s performing at the inauguration? It’s gonna be JLo and and Lady Gaga. And these two, they’re both illuminate confirm of the highest degree, right? So what can I tell you that’s new and relevant? Like, I don’t know. They’re both performing. That’s all I got. But let’s consider what I’ve been talking about with the raising of Osiris ritual. From researcher Tom Horne. Have you heard that show? It was the QA on part one. We talked about this idea. And basically, the very short version of it is back in ancient Egypt. They did a ritual for every new Pharaoh. When the pharaoh would be put in his place of power, they would do a ritual where he would go inside the dome of ISIS which was just across from the obelisk And he would come out. And while he was in the dome of ISIS, they would do incantations and rituals, to infuse the spirit of Osiris into the Pharaoh. And he would come out, he would go in as a man and he would come out, Osiris, he would come out as a god. And allegedly, that’s what the herro dome does the 33rd degree of Scottish Rite of Freemasonry directly due north from the Washington Monument. And your boy, Ronnie Reagan, he pumped out the West, he said, You know what, every inauguration from here on out, we’re going to do out the west side of the Capitol Building, facing that big old Washington Monument novelist penis, because he was an occultist. And the, and the Capitol building is, of course, the dome, that is your dome of ISIS, that’s the womb of ISIS. So the President allegedly gets the same treatment every time they try to infuse the spirit of the god inside of Osiris into the president. So there’s that. Well, what’s the purpose of having JLo and Gaga there? Well, I noticed these are two females. These are two goddesses of the divine feminine energy. So it could be taking part of what might be the largest mass ritual event ever. Given the focus on this thing. Everyone’s gonna be watching this Well, maybe because of the potential for violence and what happened at the Capitol building, which, again, like, you want to look at that from a ritual perspective. Well, what happened at the Capitol Building, you had the the final dying grasp of male patriarchy invading the womb of ISIS violently and maybe this is a mass ritual to counter that to bring about this new age. And I hope so in summary, on some respects, right. I hope this is ushering in the Age of Aquarius and feminine goddess energy balance out all this you know, confrontational Mars, God of War, patriarchal stuff. Because that’s, you know, that’s, I hate to sound like a social justice warrior. But like, you got to understand we do live in like a patriarchal society, right? Like, that’s who sets this whole thing up. Like Congress, it’s essentially all 80 year old white guys. Your grandpa, your grandfather, great grandfather is running our country. That’s an exaggeration. But it’s something in that ballpark. Right. And my point is, and I’m not I’m not trying to shit on old white guys. Like, I’m not saying they’re evil. I’m just saying the worldview is very limited. You know, they’re not down, they’re not then on the front lines dealing with the economy and the way employers treat people now and getting squeezed middle class getting squeezed into oblivion. Like, these are rich, old white dudes. And they don’t want nothing to change because it’s been pretty good for them. That’s a generalization. So like, it’s a patriarchal society, because they set all the rules up. And there needs to be balanced. I’m sorry, there does. We need to have a bit of that feminine divine energy in there. And maybe goggan Jayla, we’re here to make that happen. God is no stranger to this. She’s no stranger to these massive dumps of Goddess energy. She’s always taking massive dumps. She loves them. She loves a massive dump of Goddess energy. So that’s all I got for that. Next Lana Del Rey, she dropped a classic chem trails over the country club. And look, you know, full disclosure. I love me some Lana Del Rey. But you know the video, it’s got these wolves and vampires and the full moon and it was pretty cool. But don’t forget, she was part of a lot of people sort of like we’re trying to say she was like pushing right wing, pro Trump ideas. And I was like, No, she was one of the first to be doing this binding spell to try to get them out of office. Remember, we talked about that years ago? I’m gonna read you. The 35 year old singer has reflected on the outgoing president’s four year tenure as she branded him a crazy person and a narcissist. Speaking of BBC One presenter Annie Mac, she said the madness of Trump as bad as it was really needed to happen. We really needed a reflection of our world’s greatest problem, which is not climate change. But sociopathy and narcissism, especially in America, it’s going to kill the world. It’s not capitalism, it’s narcissism. I was surprised we didn’t have a live television psychopath crazy person as a president A long time ago, because that’s what we see on TV. And that’s what we see on Instagram. She She opened up about the recent capital riots which were sparked by the commander in chief repeated claims of election fraud. She added if I go to the Brentwood, country Mart barefoot or whatever, I’m not insane. I’m connected to the earth. Shout out grounding mats. actually got my foot on one right now as we speak, grounding mat. She says, I think people are having to re evaluate what is strange, not strange, like watching the people storming the Capitol, everyone gets to go look at that and figure out what capitals. They’ve been storming this year in their own lives. Because everyone’s running amok. You know, half the people I know are just jerks. Like, I could picture them being like, well, we need to change. So, you know, they claim that that was like some kind of pro Trump message, which I’d argue it isn’t because she was doing binding spells. It sounds like a very rational response to it. Like she’s saying, like, Look, he’s not the devil. We just have an issue here. And we need to work on ourselves. And I agree with that. Now, the next appropriate topic is azealia. Banks. She was a rapper. I don’t know I never got into her music. But if you recall, she was beefing with Lana Del Rey back in the day. Because Lana Del Rey was doing the witchcraft binding spells and then azealia banks was like, Nah, bitch, I’m a real witch. Anyway, she moved to Miami, she did a ritual to dig up her cat and the internet lost its mind. I’m going to read you from your web.com earlier this week, the rapper on earth her dead cat Lucifer, and allegedly boiled him in a pot. She shared footage of the ritual online immediately caught the wrath of animal lovers across the globe. The Rapper posted an image of her Instagram Stories of a pink pot containing some twigs, a bottle of clico the last squirt of Chanel number five, a crucifix peacock feathers, a cigar a $100 bill and a cat skull. She said the move is booked. We’re officially out this bitch. The cat went out with a effing bang. Taking my bitch to Miami. We previously reported in a series of clips shared on Instagram bank showed herself digging up her deceased cat she then cut to scenes of her boiling the carcass, the caption read Lucifer 2009 to 2020 my dear Kitty, thank you for everything a legend an icon forever a servile serve the 212 performer assistant she did not eat the dead cats remains and blasted her critics for being racist. saying this is very on Black Lives Matter of you all. Now, you recall, we talked about the BLM thing last summer when it was a real hot girl summer.\n\nand we talked about how BLM is endorsing the yoruba religion, which is the original African religion. And I tried to very neutrally talk about this subject. Got a lot of heat for it without passing judgment, right.\n\nYoruba is a when she says it’s very on black lives matter you she’s being true. Because what people don’t understand is that BLM is a spiritual movement. That’s what they say. Their words not mine. And the spiritual moment is to endorse the yoruba religion from Africa. So when you see azealia banks doing like Voodoo esque stuff, and that’s what she’s referring to, because Voodoo is a derivative of yoruba from what I read on the internet. Both are pagan, polytheistic type religions, they worship multiple Gods for multiple reasons. like Beyonce, right, we talked about her a lot last year. She embodied ocean, the goddess of yoruba, she’s the goddess of love, sexy time, beauty, diplomacy, all those things. But Voodoo, came about from Haiti, when the Europeans colonized and migrated all these African slaves, they they mixed all the slaves up because their decks right, they want to like break people down. So they don’t want them to have like friends and family together. So they mix them all up. Keep them separated. And instead of suppressing them, they actually fused their different religious outlooks into a new one called Voodoo and the foundations of Voodoo was Yoruba, which is the religion the BLM is, you know, trying to promote Let’s Let’s finish our Azalea talk. She said Why do you think I would eat a dead cat when I can barely eat a dead cow? It’s called taxidermy. Plenty of hunters with preserved deer heads hanging off their wall darlings, you guys are being racist and this is very and Black Lives Matters of you all. The cats had a soaking and peroxide to fully clean and then I’m taken to the jewelry shop to have a gilded Lucifer was an icon he deserves to be preserved You girls are not tough like me. You may indeed kiss my witchy ass so that happened next Oh, I forgot in Instagram I posted a picture of Jessica Simpson. She was wearing this illuminate confirmed necklace and a Illuminae confirm hoodie. It looks a lot of people wear that utilize stuff right? Like it’s a it’s a cultural thing. doesn’t mean you’re in the Illuminati. But her hoodie you have to look at her hoodie. The eye was illuminated it had the rays of the sun coming out of it the rays of Sirius. This is from free Masonic lore. Next, Nashville. Have you remember? But on Christmas Day, there was a guy who bombed Nashville. I know it feels like Christmas Day was 74 years ago. It was only three weeks ago. I’m gonna read you because here’s what I mean radio. Investigators are exploring several conspiracy theories as potential motives behind the Christmas Day bombing in Nashville, including evidence that the bomber believed in lizard people in the so called reptilian conspiracy. Investigators are expected to conclude the crime scene work, blah, blah, blah. They they were examining his digital devices, which an official said includes a significant trove of pictures, videos and writings looking for any clues that drove the man to set off a powerful bomb. Specifically investigators looking into the suspects previous trips to undisclosed location in Tennessee where he could camp out in his recreational vehicle and hunt aliens. Investigators are aware of statements the suspect made about an internet conspiracy. The powerful politicians and Hollywood figures are actually lizards or other reptiles who have extraterrestrial origins and are taking over society. adherents of the unfounded conspiracy believe that politicians, including the Clintons and Bob Hope, are actually lizard like creatures sent to Earth responsible for historic tragedies. Justin Bieber and the Obamas have been named in the conspiracy theory. He also has associates whether he believes in equally unfounded conspiracies about at&t and 5g mobile devices, whether that was a motive for choosing the at&t site as the bombing of cast a wide net, blah, blah, blah, they’re looking for it. But anyway, the point being another, isn’t it on? Is it? Is it a coincidence? Or is it not? It was just some for me and Mr. Gates over on the pair awareness? Are we paranoid? Or is this just being aware? why there’s so many troopers? Doing naughty things? Is it to make us look bad? Or is it legitimately like fringy crazy people are drawn into this thing. And and by the way, I keep talking about this pair awareness show. I’ll drop a I’ll drop the full first episode, we talked about Manson for a couple episodes, I’ll drop the full first episode on the podcast feed. So stay subscribed to that. But we link up and the idea is that we dig deep into some of the strange occurrences in our world and to explore Are we being paranoid? Or are we just being aware, and we sort of debate the topics, bring some ideas to the table and come to a conclusion. It’s a good time. Let’s get into alien news. Big alien moves for 2021 as predicted, the alien Gen is going to heat up. If you heard on higher side, I was on higher side chats, right. And I got lots of great feedback. I want to address it because I’ve been I’ve been too busy to sort of respond to comments and all that stuff. And Greg forwarded one over to me about we basically this one person was talking about how my book, Use Your Illusion. One is kind of in line with john keels assessment UFOs require humans to manifest which is kind of my argument, right? That you know, and I’m standing on the shoulders of giants here, right, like a sign original idea, necessarily. It’s just the one that I’m like, yeah, this is the thing we should focus on. I think this is a better explanation for what’s happening than anything else. But anyway, the he said he or she said to read Christianity and ancient Egyptian religion by Ahmed Osman. because me and Greg, we got into a little talk about Gnosticism and all this stuff, and I looked it up this Aman azzaman an interesting character. Apparently he was saying like Moses was Akhenaten and Jews. Jesus was too common. I don’t have to look into it sounds a bit like zecharia Sitchin or who’s the guy that was on Joe Rogan given the alternate history stuff? Oh, the name escapes me. That doesn’t matter. You know who I’m talking about. Now, it’s really gonna bug me anyway. A bit of like, what do you call it revisionist history stuff. So maybe I’ll check into that. Then Jess said check out fallen angels among us by Elizabeth Claire profit. It’s apparently a middle ground between Greg and I’s differing ideas here. It looks interesting here. I’m going to read you one paragraph from the book. Description. War, religious hatred and fant fanaticism, terrorism global pandemics economic turmoil and extreme weather are the harvest of ancient songs by rebel angels and a duped humanity. book was written in 2010, by the way. Hmm. So that one looks interesting. Then, Ronan art and music said the man who used the Universe by Alan Dean foster has this idea of technology manifesting itself as part of the plot, which is a curious idea. Because I did watch as you know, I’m writing user illusion to which hit a major road bump the last couple of weeks. But the I watched contact the film with Jodie Foster and Matthew McConaughey. And it was it was alright, it was all right. All right. Oh, no, it was an hour too long is way too long. I don’t know why people love this movie. I thought it was not good. But the premise of what Jodie Foster goes through is like there’s a mental bridge to the cosmos to the aliens. And that is, you know, that’s what I’m arguing is the whole thing here. And that’s apparently maybe part of this plot for the Alan Dean foster book. Then the deep share that sent me a video to gardens and a snake that explores the Bible. I haven’t watched it yet. It’s over two hours. It’s been hectic to say the least. So yeah, I did read a bunch of the comments. I got a lot of great feedback, a lot of great ideas. People seem to really like that episode, which shocked me because the last time I went on Greg’s show, we talked about my book the Star Wars conspiracy. And you know me, I’m not a very religious guy on this show. But they roasted me for like, I’ll just Christian, how do you believe in Christianity? And I’m like, like, a I don’t know the that gave me the barely came up on the show. But I was like, this crowd is unruly.\n\nI can’t get it. I get it.\n\nI get it that like, organized religion has its problems, right?\n\nNext Door about pop culture. We’re talking about aliens. We’re talking about where the worlds merge. Because I believe according you know, you want to zoom out on the big theory about what’s happening. Entertainment and pop culture is used to influence us and create the new reality. So when Kesha starts a podcast called cash in the creepies, and she has nothing but celebrities talking about aliens and UFOs. Well, that’s by design, my friend. She’s continuing to push the occult now. She’s got Demi Lovato on there. We’ve talked about many times, Voltron of occult pop celebrities. And you know, guess what they talked about aliens.\n\nfirst big thing that happened was we saw this really, really bright light. First of all, this blue orb cat Oh my god, beautiful. It kept floating in front of us like 20 2030 feet away. And then when I would try to walk up to it, it would just hop another 2030 feet back. So I could never chase it or get to it. But I was trying. And one point in the night I literally said Meet me in my dreams. Let’s Let’s hang out my dreams. We’re calling it on the contact session tonight. But you’re welcome to come hang out my dreams. And Dr. Greer calls this blue orb kindness because they had an experience with the same blue orb in the desert where it actually healed somebody hearing loss. And so they named it kindness this evening. And so Another very I don’t know if you can see this, but there’s these like two lights look to blue. Yeah, that was caught on camera that just showed up in some of the pictures. I think,\n\nYeah. And that I watched float in front of my friend Mike. He was sitting there and it floated like right in front of his sleeve. And I was just like, I looked at Dr. Greer. And I was like, do you see that? And I was like, Yeah, I was like, that’s why\n\nI talked about aliens. The, you know, of course, a lot of talk about meditating and channeling the aliens with Steven Greer, who has been vocal about this whole alien thing about how he asserts the government, the military, the deep state, whatever, whoever is going to use the alien things as a threat. And he advises against that. Kesha said I love the conversation we had because there were a couple books you mentioned in an app she mentioned that I immediately downloaded. You know, that is right. That’s the C five app. All I want for Christmas is for us all to meditate. Try to channel extraterrestrials and they’re like, okay, I like I’m like trying to get all my friends and family into meditating the aliens to us. It’s my new hobby because of Demi Lovato. You see how this works? Yeah, this propagates. I talked about this back in like April 2020. We talked about Stephen Greer’s Close Encounters of the fifth kind and I said look, this is exactly the thing you meant this is a cult practices to channel and summon the entities no different than Alistair Crowley no different than john D. No different than jack Parsons. And jack Parsons said he was the Antichrist. So I don’t know. You tell me Is this a bad thing or not? I argue with bad, naughty naughty.\n\nI had a tier three live stream just the other day and the man Southside terror was on there. Shout out Southside Taro. And he’s very, you know, he’s kind of illuminate confirm, you know, he’s doing weird cabbalistic tree of life. No, I’m just kidding. I’m messing with him. But he, you know, like I always say, I’m not here saying the occult stuff is bad. I’m just telling you about it. Because I think it’s fascinating. It’s not my cup of tea, but you know, maybe it’s got I’m sure it’s got some merit. But he he’s been trying the sci fi thing. And he’s like, very well versed in this stuff. He’s, I don’t wanna put words in his mouth, but he’s got some shamanistic tendencies. He says so far, nothing. He’s been trying like hell. But maybe they need a massive amount of energy to focus to make this work. Next, you saw this, I saw this the 180 day countdown. It’s the final countdown to alien disclosure. They put a little clause in the COVID-19 relief and government funding bill back in late December.\n\nthere’s a requirement now to to for the intelligence agencies to reveal what they know about your voles spotted near us military bases. They push this $2.3 trillion COVID-19 relief effort and government funding bill as well. And it was signed and causing the Pentagon and spy agencies to tell everything they know about unidentified craft spotted near American military bases. They got 180 days to compile a report promises to be a treasure trove of alien stuff. The move prompted by the acting chairman of the US intelligence committee, Senator Mark Rubio, who has been in fact telling us about this stuff. Who because he revealed back in August, the mysterious craft were buzzing the military bases. Those videos were real. He said at the time, he hoped the UFOs were piloted by aliens rather than Chinese or Russian adversaries. He said that he wanted to release further details in a bid to identify them but was bound by security restrictions. He said quote, we don’t know what it is and it isn’t ours. The bottom line is there are things flying over United States military bases and you don’t know what they are because they’re not yours and they exhibit potentially technologies you don’t have at your own disposal. That to me is a national security risk. So there you go. I mean is Steven Greer right was Verner von Braun right on his deathbed. He said the final false flag will be the alien threat and it’s not true. Don’t let him do it. It’s in my book aliens UFOs and he called us illusion one out label on Amazon audible check it out. Then, almost immediately, they did it. They released all the files called the Black vault. See ya dump everything that they had going back to the 1970s on the UFOs, which to me was a curious thing. Fascinating. Oh, they only have records to the 70s. And I don’t know if like maybe there’s more different agencies that have the records that go back further. Because what I’m interested in is like the 40s and 50s the origins of the Collins elite, I want that information. There’s researcher john Greenwald, Jr. had been doing some FOIA requesting and CIA dumped a couple million pages on him on that as he made it rain made a rain the alien docks. I downloaded a bunch I searched for certain words demons, demon, but it pulls up way too many results because it’s there’s no way for me to isolate it as different from demonstrate because demonstrate kept coming up. Same with Collins, nothing comes up. So and that was a very cursory quickly done search. So I mean, there’s 1000s of documents. It’s insane. Hawaiian, UFO spotted FAA investigating and guess what they’re calling it? Shout out mark. Because they’re calling it they’re calling it the illumination investigation. Have you saw that? The whole thing. And supposedly, it even goes underwater. Which if you watch the ancient alien shows, that’s what they do sometimes. But then almost immediately on January 2, there was theories that Oh, it’s just remote control led kites. Maybe I don’t know. It’s very strange video, though. I mean, it’s very weird looking. It could just be kites, though. Then. Do you remember the Obama Mama Mama space project we talked about a few years ago? look like a big giant turd floating out in space? Well, apparently, Harvard professor Dr. avi Loeb thinks that was real alien contact? Yes, it was called the Omar Omar, Omar Omar Mama. I just call it the Obama Mama. In his book, extraterrestrial the first sign of intelligent life beyond Earth. He lays out in 240 pages exactly why he believes the object for 2017 was an intergalactic attempt to contact Earth. First off, good amount of pages sir, good job. The most exciting aspect of the possibility that Obama Obama is weird and unlike any asteroid or comet we had seen before is that it’s a product of an alien technology. Bah, bah, bah, bah, bah, exactly what the object is, is unknown. But the professor is certain it’s an object from a distant alien civilization, NASA can confirm it came from another Solar System accelerated in a non comet like way through space. And then astronomers had never seen a natural object with such extreme proportions in the solar system before. And that book drops on January 26. If you read it, let me know what it says. So there you go. We’re now we’re all caught up. Good night. There’s so much going on in the world right now. The Chaos reigns supreme. But let’s hope that like a lot of these occultists are saying, you know, like, Southside Taro was trying to explain to me it’s like, it’s like a spring you compress the spring so that it can release and unleash energy and like maybe it’s a good thing, hopefully. Right? We talked about this with the conjunction of Saturn and Jupiter and all that woowoo stuff. I hope so. I certainly hope so. Because this is a rough time. Okay, it’s a rough time. I said good vibes for 2021. And I want that, let’s try to focus our energies and intentions on positive things. So again, in summary, if you want to check out my version of my patreon type system, completely unplugged from corporate meddling, go to Illuminati watcher calm. Check out the VIP section, if you want, or you can keep going on the Patreon you can keep going on the rockfon I don’t care is whatever you like, it’s up to you. I’m just giving you an option so that if things start coming down and boarding up everywhere, you know where to find me, you know where to find your boy, stay plugged in, I’ll have all the shows that are waiting for you. It’ll be like nothing ever changed, baby. And again, we’re gonna start sponsoring operation Underground Railroad. We’re going to start donating like 1% for the kids. You know what I’m saying? Let’s save a couple kids. Right? It’s at least we can do. We’re part of the city group of truth. There’s a parent they’re supposed to be supposed to be doing something about all this child abuse stuff. Well, let’s do it then. Right. So we’re start doing that and then again, if you sign up for the VIP section if you want to do my VIP section, you got to use the promo code hot girl summer, get 20% off any tear for three months, you only got till May 1 so you only got a few months. The links will be in the show notes as always and until next time. Stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "Inauguration Goddesses, UFO Black Vault, Kesha, Lana Del Rey, Azealia Banks & Naughty Truthers! AND My Response to Censorship! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we break down a TON of pop culture symbolism! We get into J Lo and Gaga’s appearance as the goddesses at the Inauguration, the unleashing of the UFO Black Vault files, Kesha and Demi Lovato’s UFO obsessions & Lana Del Rey and Azealia’s witchcraft! We also […]", "url": "https://illuminatiwatcher.com/inauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-01-17T16:50:36+00:00", "image": "https://i2.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/01/ctauc-inauguration-.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/42968113", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/inauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship/?share=twitter", "https://illuminatiwatcher.com/inauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Inauguration%20Goddesses%2C%20UFO%20Black%20Vault%2C%20Kesha%2C%20Lana%20Del%20Rey%2C%20Azealia%20Banks%20%26%20Naughty%20Truthers%21%20AND%20My%20Response%20to%20Censorship%21&body=https%3A%2F%2Filluminatiwatcher.com%2Finauguration-goddesses-ufo-black-vault-kesha-lana-del-rey-azealia-banks-naughty-truthers-and-my-response-to-censorship%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2021-01-17T16:50:36+00:00"}