{"result_id": "165041", "URL": "https://illuminatiwatcher.com/what-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american/", "timestamp": "2023-04-25 15:36:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/what-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "What are NFTs, Conspiracy Comics and Cryptos with Paranoid American!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we are joined by an old friend to discuss the technology and basic idea behind NFTs! We catch up on our lives in the past seven years, military experiences, his conspiracy comic books, chick tracts and more! We’ll get into the ideas of what NFTs are, Etherium (ETH) based contracts, ETH Gas, minting NFTs, comparison to trading cards and more! If you were ever confused about NFTs, this show will definitely help you understand more about minting, buying, selling and the world of crypto currencies!\n• Check out ParanoidAmerican.com for much more! His Etsy store is right here also: https://www.etsy.com/il-en/market/paranoid_american You can follow him on Instagram as well: https://www.instagram.com/paranoidamerican/\n• Go ad-free with bonus content! 3 options- https://www.rokfin.com/creator/isaac (*now with 4K HD video versions of the show), or Patreon.com/IlluminatiWatcher or the VIP Section (*you can compare the three options here): https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• ALIENS, UFOS AND THE OCCULT BOOK SERIES NOW UP ON AMAZON AND AUDIBLE!: https://amzn.to/3j3UtZz\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION bundles: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by supporting the show on any of the three platforms!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “What are NFTs, Conspiracy Comics and Cryptos with Paranoid American!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons) and “Breaking Social Norms.” He has been a featured guest on Tin Foil Hat podcast, Ground Zero with Clyde Lewis, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nIsaac Weishaupt 0:04\n\n What’s up, everybody? It’s your host, Isaac Weishaupt. And today we are joined by an old friend. We’re going back in time. Maybe you were with me since the early blogging days. Maybe you were with me since 2011. I don’t know. But back in the day, I linked up with my man from paranoid American calm. He’s a comic book creator. He’s very talented. He’s amazing, honestly. And we haven’t spoken for many years. We finally caught up again, it’s very strange. So I spoke with him about NF T’s because I thought this is the thing we got to wrap our minds around next. We already covered crypto currencies in 2018. And we go to a real fundamental basic understanding of what NF T’s are on the show. The first maybe 20 minutes though, we catch up live in person to do a little bit of military war row. What do you got? War stories, right? Is, is uh, what’s been going on with his conspiracy comic book because because back when I was plugged in with him, he had time samplers. And he’s expanded way more than that since then. We talked about chick tracks for a while if you know what those are. But then we eventually we get into the ideas of what NF T’s are. We talked about Aetherium. The concepts surrounding Aetherium gas and Aetherium based contracts. minting NF T’s ne ne provides a lot of good comparisons to like baseball trading cards and such. So if you’re ever confused about what NF tees are, this show is definitely going to help you understand more about it. You won’t walk away an expert, but you will probably get enough of an idea. So you know what these these these nerds are doing on these auction blocks buying these crazy NF T’s like Post Malone spending hundreds of $1,000 of digital images, what the hell are these people doing? And we talk about, you know, minting buying, selling Kryptos everything, right? And look, here’s another thing I got to talk about real quick. Okay, you know, I had a big YouTube channel, right back in the day, YouTube kicked me off. Back in the day I was at 73,000 subs, they kicked me off. And I petitioned and fight with them for months. And of course you can’t get through to anybody. It’s aI hell over there YouTube. And I don’t know anybody. But I had started another channel called Isaac Weishaupt. Not very covert, the first channel was called Illuminati watcher one. So I started to do and I caught it either once, and it was immediately shadow banned. But for some reason, they let me get on there. So I was like, alright, so I set it up. But I’ve never devoted any time or attention into it. Because the videos are essentially shadow banned. You’re gonna it’s just a matter of time before and everything that I have on there. They the take the monetization, and they give it to someone else, or they hit me with the copyright thing. It’s a nightmare. YouTube sucks. I hate it. So that’s why I don’t mess with it. It’s there. I’ve got and I was looking the other day because when I talked with my man from paranoid American calm here, we linked up on he wanted to do a video version, which I don’t typically do, but now I’m trying to transition into video stuff, right. And the way I had to do this was through stream yard and stream yard, they need you to output the video somewhere. So I output it to the YouTube channel. And I’ve done this in the past when I interviewed Jason Alexander Britney Spears husband, ex husband, excuse me. And we as we were doing it, I’m sitting there and I’m watching it and it says it’s moving it to the private feed and I thought oh, so I dropped it down to public. And for some reason, they went live and like all of a sudden we had people in the chat room and stuff. So it was kind of crazy. So in theory, you could actually watch the video interview right now, on my YouTube channel. You can get the lovely intro or outro though you need that right cuz I’ve got all kinds of stuff going on lately. But yeah, that’s what’s going on for people that there was people in the chat room. They were like, Guys, Isaac back on YouTube, and it’s like, kind of but you got to understand everything for me on the YouTubes of complete headache. It’s just a total nightmare for me. And I don’t know if they realize who I am. And they just make it a hassle for me. I have no idea what’s going on there. So anyhow, that’s what happened. If you want to see the YouTube version, it’s on there.\n\nAt its Isaac Weishaupt was the channel name. And what the hell subscribe while you’re there, I don’t know who knows what the future holds. Maybe I’ll maybe I’ll upload more videos there. I don’t really know what I’m doing. Yeah, I’m trying to figure everything out right now. Trying to figure everything out, I’m asking my Patreon people what they like, trying to give my people what they want. And 2022 I think is going to be different right now that I’ve got this video thing going. I’m trying to figure out how to make this work. So anyhow, let’s get back to the show. Paranoid american.com I got links in the show notes for all the things he’s gonna talk about. Let’s go. What’s happening, man? I doing Thomas?\n\nIsaac Weishaupt 5:42\n\n Holy crap. We got this to work. Well, Oh, buddy. I know your time is valuable. I want to talk to you tonight. Well, there’s here’s the kind of the overview of what I thought we could do. I thought, all right, I definitely want to talk about NF T’s with you. But for the audience who doesn’t know you. I wanted to give like a little bit of a background of how I met you. And and yeah, so let’s go into that first. Many years ago, I would say it’s gotta be. It’s gotta be eight years now.\n\nIsaac Weishaupt 6:20\n\n You were one of the few truths or I don’t know, content creators the right term, but you were one of the people in the truth or community way back when, when there wasn’t a ton of us out there. And I recall, I don’t remember how we hooked up, but I remember I had a Comic Con appearance where I was selling books. And for some reason, we were already in contact and you sent me a bunch of cool stuff from your artwork from your your comic book. And I handed it out and such and so on, and that was kind of it like we didn’t really keep in touch a whole lot. And then\n\nIsaac Weishaupt 7:03\n\n Yeah, seems like the, it seems like I think it was Instagram. I think someone else might have followed you. And I said, Oh, snap. There’s my man right here. So anyway, so we’re, we’re rekindled now. Okay. What have you been doing? But I haven’t I haven’t. I haven’t caught up with you, right? We just sort of follow each other on Instagram. And it’s been like seven years? What’s new with you?\n\nUnknown Speaker 7:26\n\n Yeah, we need to put the band back together. So I’ve just been cranking away, man. When I first started talking to you, I think I was working on my first comic, which was time samplers, which is about two musicians that basically traveled through time trying to solve conspiracy theories like the Federal Reserve, and the Titanic sinking and MK Ultra, and things like that. And I think that’s what I ended up sending you a whole bunch of those to kind of maybe just give out or let people read while they were at your table. So since then, I’m still been knocking out time samplers issues, but I’m also expanded to about like, 13 or 14 other series. And actually, I’m kind of excited because I just got a huge stack of proofs in from the printer today, unexpectedly of you know, these are all different books that I’m basically publishing next year. So. So I’ve been on\n\nUnknown Speaker 8:22\n\n Yeah, I mean, they’ve all been kind of in development since we first started talking, you know, almost a decade ago. And they all just kind of got completed and coming together around the same time over the last year or two. So it’s been given me a chance to kind of buckled down and polish them all up and put the bows on them. So they’re, they’re ready to be shared with the public.\n\nIsaac Weishaupt 8:42\n\n Fantastic. Yeah. And I’ll have to get all the links from you. I went on your website. Paranoid American calm, right. Yep. They’re not American calm. And I was blown away. I was like, dude, you’ve been busy man. Yes,\n\nUnknown Speaker 8:57\n\n not just the one series anymore. But basically the I realized that the time samplers, I was trying to cover every single conspiracy theory and sort of like esoteric concept that ever come across, and it’s too much for just one book or one series. So each different book and each different sort of creation represents like one particular type of conspiracy theory or cult research that I just wanted to, you know, put absolute focus on and get illustrated and share. So each one of these books is a totally different tangent that I went down on at some point. That’s incredible,\n\nIsaac Weishaupt 9:30\n\n man. Well, would you mind sharing some of the tangents?\n\nUnknown Speaker 9:35\n\n Yeah, so the one I think that people find most approachable. I’ve got this little booklet called the paranoid pamphlet MK Ultra, and it’s designed after like check tracks. Some people know chick tracks is like this kind of a fundamentalist religious pamphlets that talk about how trick or treating is the devil and biker gangs and the devil and it kind of preaches that sort of angle. So it’s, these are not religious pain. templates this one’s actually about the entire history of MK Ultra. Starting with Project Paperclip and all sorts of, you know, actual dates, times, places that you can look up, I try to keep it as realistic as possible. So you can, you know, reference all the information on it. So this one right here is probably the best introduction example of the type of things that I’m trying to do. And then I’ll give you on the other end of the spectrum. I’ve got this children’s book here called connect the dots that confounding conspiracy of Chem trails, which is a full legit, you know, children’s book, but it kind of goes into the the reality of Chem trails and sort of the, the outlandish examples. So one of the kids thinks that it’s nanobots that are here to kind of infiltrate and control your mind. And we’ve got a New Age character that’s all about healing everyone with crystals and talks about Morgellons disease, and then you’ve always got sort of the the government stooge who always takes the official answer for everything. So it’s all about contrails. And so it’s just it’s kind of like a fun series, right? Like poke fun at that. And then I’ll pick out two other ones real quick. I’ve got one called paranoid American history 101 or volume one, and it’s a series of eight different stories and eight different writers then it’s about Iran Contra drug war. It’s about a mushroom collector that worked for JP Morgan that was also involved with the JFK assassination. I’ve got some previews inside this for my other big title that I’m really focused on called, it’s going to get here in a second, Never A Straight Answer, which stands for NASA. And this one’s about Stanley Kubrick directing the Apollo moon landings. And it sort of takes it as like a de facto like he absolutely did it. We don’t try to explain all that. We just kind of show like some of the behind the stages antics of him. So like, here’s an example. I guess I’m showing off the monolith. And in the background here, actually on the on the page after this,\n\nIsaac Weishaupt 12:04\n\n I think I’ve seen some on your\n\nUnknown Speaker 12:06\n\n surrealist dinner party that was in the Ross child mansion by Salvador Dali. So these are kind of just like some inside nods that if you’re deep into conspiracy theories, you might recognize some of it if not, that’s still like a really fun read. So that’s just that’s, that’s just like, you know, five of the 13 books right,\n\nIsaac Weishaupt 12:23\n\n and I got here I’m going through Are you still working? Last time I talked to you you had a dreaded day job. You still\n\nUnknown Speaker 12:29\n\n got a day job, although I’m liking it a whole lot more. Now. I’m with a company that doesn’t hate me. So yeah, that always helps. All right. But yeah, I sell women’s clothes. They’re in today. And then what? Conspiracy books they’re in the night. What kind\n\nIsaac Weishaupt 12:44\n\n of women’s clothes are we talking about? Like a high fashion? Nordstrom. I mean,\n\nIsaac Weishaupt 12:50\n\n Yeah, okay. I dig it. Alright, that’s cool, man. I love that dude. I love hearing because like that, that’s my roots. Also man just constantly grinding and constantly hustling and I’ve\n\nUnknown Speaker 13:05\n\n gone over to door sales or unsolicited sales? No.\n\nIsaac Weishaupt 13:09\n\n Well, kind of sort of as a kid I used to sort of do pizza deals like that. The pizza, the pizza rear I worked for used to have me go door to door and put like coupons on the door and like try to get people to buy pizza. But\n\nUnknown Speaker 13:23\n\n I’ve been there too. I’ve been I feel like that’s sort of the the extreme end of the spectrum. But people that haven’t been through that don’t really know, like that aspect of grinding, I think.\n\nIsaac Weishaupt 13:33\n\n Yeah, that’s funny, man. Yeah, it’s funny. You mentioned I have a note here. And I don’t want to go back too far in the conversation. You were talking about the pamphlets because you got that MK Ultra pamphlet. That was actually it just clicked me. And I don’t know if I’ve ever talked about or not talked to myself for 10 years now on the show. But that’s actually my first red pill I always say was Bill Cooper and David Ike. But the first red pill I had was one of those crazy religious pamphlets and tracks. Is that what they were called? You called a chick track.\n\nUnknown Speaker 14:08\n\n There were made by a guy named Jack T chick. There’s actually a amazing documentary if anyone’s interested. It’s called God’s cartoonists. And it goes through you know, the the whole origins and everything. He’s dead now, but the company continues on but you can go to I think chick track calm and read like every single one they’ve ever published back to the I want to say the 70s or something.\n\nIsaac Weishaupt 14:30\n\n No way. That’s all Yeah, cuz it was it was in the 80s. I saw it. It had something about it was talking about the mark of the beast and it was way over my head. I was just\n\nUnknown Speaker 14:38\n\n called the beast and it has like a mother, daughter and a father and they’ve all got like 666 on their forehead. Yeah, I remember the sixes Yeah, I know exactly which one you’re talking about. How\n\nIsaac Weishaupt 14:47\n\n funny is that? What a weird that yes, I remember saying I remember reading it is like everyone’s social security number has three sixes in it. And then like why does I said holy crap really?\n\nUnknown Speaker 14:59\n\n Because That was one of my kind of big red pill moments too when I was in the military going through training and Biloxi, Mississippi, and we were still using payphones in order to call back home and talk to her parents. This is late 90s early knots. And there was a chick track on top of one of the pay phones and that we were using, you know, the to call around and it was about some biker, and how the just be it, essentially, they were trying to say like just being a biker, made you kind of like Satanic in a way. And then like he came back to Jesus and stop being a biker and, you know, stop getting tattoos and stuff. But I just thought it was the coolest thing. I was like, man, and I found out that there, they weren’t like for sale or anything. It was literally just this guy would have 1000s and 1000s printed up and just leave a mountain, you know, gas stations and restrooms and stuff, just so that people you know, it was it was evangelism. So just they would understand, you know, the word of God. So, again, mine aren’t religious. I’m trying to spread the word of, you know, sort of distrusting the government, or at least looking into conspiracy theories. And MK Ultra is a great one, because it’s, it’s one of the few that has, you know, names and dates that you can sort of look up and cross reference.\n\nIsaac Weishaupt 16:10\n\n Yeah, definitely. That’s always the best sort of red pill for the normies, I think is when you go to these sort of factual events that they can go online and read for themselves. Like, yeah, this really happened. Because there’s no, there’s no refuting. I mean, I’ve talked to people that still are like, yeah, the like, they were trying to hell or whatever, you know, they always have an excuse. I’m like, come on.\n\nUnknown Speaker 16:30\n\n Yeah, that’s, I mean, that’s in a very Machiavellian sense of, you know, ends justify the means that’s fine. But there were still so like, 1000s of unwitting innocent people, especially, you know, military recruits. You join the military, you’re not expecting to become a guinea pig for some weird you know, chemical treatment that might you know, fuck you up for life. Yeah, sorry. I can curse on here. Not Oh, yeah,\n\nIsaac Weishaupt 16:57\n\n That’s funny, because you’re talking about the payphones. I remember, I was in basic training, and we had I had one phone call the entire time. I was an Air Force. Oh, same here. Air Force. Yeah. Oh, nice. Right on. Yeah, I was in some weird experimental. I think it’s experimental squadron where, you know how like the the rank structure of the basic training you had like a dorm chief? Who was kind of like, oh, yeah, man. Yeah. The guy run in 60. People? Yeah, the dorm\n\nUnknown Speaker 17:24\n\n chief and then you had the flight sheeps, which were like in charge of each row? Yeah. Within the Yeah.\n\nIsaac Weishaupt 17:30\n\n Yeah. So I’m like five, eight, and at the time, I weighed 120 pounds. And they made me the dorm chief, which of course I had no, no idea what was going on the whole time. And maybe dorm chief and like, the our brother flight. It was like a big dude, that was the dorm chief. And I remember being like, I remember having a hard time I did like March people and I didn’t know how to march and everyone wanted to beat me up. And like I had to like,\n\nUnknown Speaker 17:55\n\n if anyone fucks up it’s your fault. Yeah, yeah. First one, it gets chewed out about it. Yeah,\n\nIsaac Weishaupt 18:00\n\n yeah, you need the most shit for sure. And then I remember like, the one the one drill instructor was seeing me have a hard time and he was a short guy like me. And he he pulled me aside and he kind of like cussed me out and was like, he told me basically like, you can’t because I’m short. You can’t take no shit. So like I went that night I uncorked on this guy, I overheard him talking bad about me. And like, I remember I was yelling at them. And he like stood at attention. He was shaking, I saw his hands shaking. And that’s what I was like I got the power bitch\n\nUnknown Speaker 18:32\n\n that was one of the most kind of like life changing experiences just like the first week or two of of boot camp and seeing how just a variety of reactions you know that I remember there was this one guy that was so terrified to ask to go to the bathroom, he would pee in bottles and like in his canteen and like hide it, and then we had like an inspection so the drill instructors go through everyone’s you know, lockers and fines like this collection of P bottles and it was oh my god, it was I mean you can imagine just the crazy stuff that was said and you know,\n\nIsaac Weishaupt 19:03\n\n yeah, it’s so it’s such a bizarre environment. I remember one guy there was this the first I live in Utah now which is full of Mormons both from PA and it was the first Mormon I ever met. And he was like, he was like this big Jack dude. And he was crazy man. He would sit in the day room in the dark and punch himself in the head. I don’t it was just that yeah, you’re right.\n\nUnknown Speaker 19:26\n\n He went through 9999 Cuz cuz my one of my guys was also a jack Mormon. And I assume that there’s you know, there might there has to be just a niche of those it can’t be the majority but yeah, that’s wild, bro. Yeah, right. Oh, Captain America because he looked just like a superhero.\n\nIsaac Weishaupt 19:46\n\n Haha. Yeah, I don’t I don’t remember this dude’s name or nothing, man. I haven’t thought about basic training in years. Yeah, that’s like it’s brainwashing on a very sort of safe level right you know, basic training they strip Be down and rebuild you into their vision. So on some levels, you experienced that that sort of brainwashing it’s true man. Like, I don’t know, when you got out I did four years and I bailed. I was like, Man, fuck all this shit. And, but I still, man. I mean, when I got out, it was probably like once a month where I would be like, Damn, I’m gonna reenlist This sucks. And then like, it went down to like, once every six months where I’d have this really strong urge to reenlist. And, you know, it kind of tapered down and like, urgent five\n\nUnknown Speaker 20:31\n\n times, there’s certain aspects that it’s impossible to describe that I mess about it. But it’s also like, living with your parents for another four years where you’ve got a curfew, you’ve got to wake up and get all your chores done. No matter you know, what weekend or what holidays coming up. And the couple times to when, like you, I would at least for me, I would put into to go on leave or vacation because I’ve been working non stop for like a year, and just having it denied or just like no, you’re not going anywhere type of thing I like after that happened so many times. It’s like, man, there’s got to be like an actual free life out there somewhere. So at least for me, a lot of people fit into that groove and they can make it work for him for life.\n\nIsaac Weishaupt 21:11\n\n Yeah, I’m the same way dude, I, I value freedom over everything. And it was just too tough man, because in the four years I was in, they had me go, I went all over the place. I felt like I had an abnormal experience in the military. Because I went, you know, after tech school, I was in three different bases in three and a half years. Like that’s pretty abnormal. From what I all come in all states. No, I went overseas to South Korea to Osan and did a one year short tour there. And I was in munitions. And they I remember all the guys that had been in there a long time, we’re always saying like, yeah, you’re gonna have to come over and do at least two or three more short tours in your 20 year time. And I was like, Man, fuck all that I’m not doing this. Again. This\n\nUnknown Speaker 21:50\n\n I remember when I signed up, I was looking through the the career codes, I was a three, seal Three, two, which was like computer programmer, essentially. And that was just making sure to pick one that I kind of got to pick, you know, where I would end up and it didn’t work out though. I mean, I got reclassified as MP towards the end and how to get my anthrax shots and go through MLP training and they wanted me to just watch you know contractors fix a toilet in Afghanistan so\n\nIsaac Weishaupt 22:17\n\n Alright, man well suit you know, that’s a it’s a funny because my another sort of red pill in my formative years when I was my first year in the military there he had he was getting out and he got stationed with me. And he was he was the one wake me up make me hip to all these sorts of ideas because he was a real rebel type, you know, he was getting he still forget out, you know, he’s he was a rock in a rock band and stuff and whatever, his GI bill or whatever, and get now yeah, it was I’m just gonna go get out. I hate this show. And he was telling me about the anthrax shots. And he, I don’t remember if he refused to get them or, or he basically was telling me that, look, there’s these anthrax shots, and they’re gonna try to give them to you. Don’t take them. And I was like, okay, whatever, dude, you know. And then I got orders to go overseas, and they were going to make me take the anthrax shots. And I was like, Oh, I don’t want to take these things. And, oddly, an odd timing. Some officer in I think, like Delaware, or something, threw a fit about the anthrax vaccine. And then that was when I shouldn’t say that term on here, because this is going on YouTube. But the that, you know, of course, when the officer speaks, that’s when people listen, not when the peon enlisted folks. So the officer was like, I’m not taking this crap. So then they put us like a pause on it for x amount of months, while they sort of looked into it, and eventually they come back, and we’re like, no, everyone’s taking them.\n\nUnknown Speaker 23:45\n\n Yeah. So I was on the tail end of that there wasn’t any way to opt out. I actually, without getting too much on a tangent. I think I I earned myself in article 15 At some point because I, I kept, like, coincidentally scheduling myself to go and get like, a tooth removed, or I was going to get my dog tags rechecked, or I was going to like, you know, check this thing into my knee on on the same days and times they were trying to schedule me for that anthrax shot. I was just trying to avoid it as long as possible.\n\nIsaac Weishaupt 24:15\n\n Yeah, yeah. Yeah, I’ve heard of like, some weird experiences people doing that. And yeah, I luckily I dodged that bullet because by the time they reinstated it I was coming back home and but then, but then while I was overseas, 911 happened. And they were doing like a stop loss and thing where they wouldn’t let you leave. Go down. That was\n\nUnknown Speaker 24:36\n\n rails another huge element of me wanting to leave was was seeing all my friends getting caught up in stop loss.\n\nIsaac Weishaupt 24:42\n\n Yes. Yep. Yeah. So yeah, we I think we both had similar years that we were in there because yeah, there was a lot of stuff that I was like, man, if all this I’m going out. But uh, anyway, so Okay, so since we’ve talked, you’ve been working on the comic books, you got several of them. I follow you on in Instagram, as I advise everyone to do I’ll put links to all this stuff in my show notes. But you ventured into the realm of NF T’s. Is that right?\n\nIsaac Weishaupt 25:14\n\n Okay. And that was probably before, people started talking about them and\n\nUnknown Speaker 25:19\n\n telling people that were even beginning to crypto to look into NF T’s. And they didn’t know what the hell I was talking about. I mean, I didn’t, I didn’t know what the hell I was talking about, either. But I knew that I saw, you know, people doing really great off of them. In particular, see, I have a lot of friends that are in the VFX and post production world because I worked at Disney for about 10 years. And I keep in contact with a lot of those guys, especially through you know, making comics and whatnot. And I just noticed that a lot of these guys were able to basically start turning down client work because they were doing so well selling these NF T’s. And that was when I decided to take notice of it and try to learn a little bit more about it and kind of dabble. But\n\nIsaac Weishaupt 26:02\n\n so, so what what, okay, man, I don’t know where to start. This is like,\n\nUnknown Speaker 26:06\n\n it’s hard to approach it. Yeah. Yeah. Like,\n\nIsaac Weishaupt 26:09\n\n I mean, on some, in some ways, what I wanted to do, I have a bunch of notes on the basics of what NF T’s are that I was going to do a whole show on. And I kind of kept kicking the can down the road. This was maybe three months ago, when NF T’s were starting to hit like, you know, the news outlets and stuff. And I was like 10\n\nIsaac Weishaupt 26:30\n\n Yeah, yes. And because I got into Kryptos, in 2018. I never liked them. I’ve always had beef with Kryptos. And the whole way the whole thing is structured.\n\nUnknown Speaker 26:44\n\n I don’t like I’m very 5050 on the whole concept of crypto, like I see equal pros and cons.\n\nIsaac Weishaupt 26:51\n\n Okay. And that’s kind of that’s kind of how I am like, in principle I, I like what they’re trying to do. I like the idea of a non fiat currency, you know, backed by sort of the people, I don’t know what you would call this because not backed by banks and inflated dollars,\n\nUnknown Speaker 27:10\n\n somewhat of a name for d phi, which is decentralized finance. Okay. Yeah, I’ve heard that term. EFI. You can it’s kind of a nebulous term right\n\nIsaac Weishaupt 27:20\n\n now. Okay. Yeah. So like, I’m cool with that. But like, to me, I think that cryptos and even NF T’s for that matter, because Because NF T’s are basically sort of a flavor of crypto in a way. I feel like it’s the libertarian fantasy of free market rules supreme, no interference from the government, which,\n\nIsaac Weishaupt 27:48\n\n And my beef has always been because like, politically, I’m, I’m in no man’s land, I get some of the ideas of the liberals, I get some of the ideas of the Conservatives I get, I’m probably mostly libertarian, if I was to pick one that I had to absolutely go with. But the problem with unchecked free market capitalism is, you know, I had to move to for example, just to put in one example of many people to get into Kryptos, it’s frustrating, because I tried to buy some, I tried to list an NFT. And I needed to fill up yet another crypto wallet that I needed to create, which was fine, I did that I transfer some Aetherium in there to fund this, this process, and I got to pay 12 bucks to move this money, a couple 100 bucks. And I’m like, bro, I can literally go on my Venmo app or my bank and move money for absolutely $0 with no problem\n\nUnknown Speaker 28:42\n\n was definitely a pay to play aspect just to enter the market right now. But a huge part of that, too, is I want to say at the beginning of this year, maybe it was last year, that the years kind of been melding together lately, but but Aetherium was, I think, like $80 A piece. So at that point, you know, moving it around and minting things were not that expensive, that was you know, grabbing a cheap lunch or maybe even just like a cheap drink or something. Now, though, you know, it’s worth something upwards of like four grand or plus, well, you know, and for reference hit this down November 18 2021. So someone listen to this in six months, it could be like, triple that, but, but essentially, it’s always cost roughly the same amount of you know, ether to do a lot of these NFT transactions, but now the ethers worth so much, you know, one of the things and I got a good way to kind of introduce this in sort of plain terms, but but one of the things to to keep in mind, which makes it really expensive and, and a little bit elitist on some levels is that once you’re in this world of NF TS or just a theory on based contracts, which I’ll also get into people are used to dealing with the cost and ether and how it scales within the ether ecosystem and very rarely are people that are deep into it looking at what that means in terms of USD, you know what I mean? So, so, so to you to look at it a year ago, and then today and be like, Wow, it’s $400 more, but if you just look at it in terms of ether, it’s always been, you know, point 01 A theory or point one Aetherium or, or whatever, it’s just that now is worth so much more when you compare it to the US dollar.\n\nIsaac Weishaupt 30:25\n\n I got it, okay, because what I was looking at, and I’ll explain what I was doing, I, I was sort of bugging you about this stuff. That’s why That’s why I’m dragging you into this conversation. Cuz I think this is good for everyone to sort of get if they don’t really understand NF T’s I, I made a post saying like, Hey, I’m gonna make a podcast. And if t like, not knowing really what the hell I’m doing, or what I’m talking about, right? I just thought, from my knowledge of what an NF t is, is some some digital bits of whether it’s a picture or whatever, that you put on the blockchain and you auction it off. And I thought, well, this would be cool, because the way I understood NF T’s, if I sell this file, let’s say I sell it for 100 bucks. And the person who wants it, they buy it, they listen to it, and they’re like, Okay, cool, I’m done with that. Now, they want to sell it, so they sell it for 200 bucks, we’ll say, from what I understood, I get x amount of percentage of the sale. So\n\nUnknown Speaker 31:30\n\n you can set a certain royalties. So every time it’s ever sold in perpetuity, you always get that royalty of that sale.\n\nIsaac Weishaupt 31:38\n\n Do you know what people typically set that percentage too,\n\nUnknown Speaker 31:41\n\n it really depends on what your market is and what your intent is. But typically collectors are looking for as low as possible. So they’re, they’re probably looking for like a 10% royalty, because that means they get to you know, recoup more of whatever the resale prices later without giving us so much of a kickback. But okay, it’s up to the artist and whatever you want to set it at.\n\nIsaac Weishaupt 32:05\n\n Okay, so So if I set it to like 10%, that means if the, the the first person who bought it sells it on the blockchain for 200 bucks, I get 20 bucks. And then the second party listeners, do they sell it for 300 bucks,\n\nUnknown Speaker 32:17\n\n yeah, give or take all the different transactional fees and little taxes that are kind of built, you know, non government taxes, but just like in order to pay someone to move it from here to there and confirm it, there’s there’s always a little bit of transactional costs, it’s called gas.\n\nIsaac Weishaupt 32:33\n\n And that’s basically for is that for actual programmers that are sitting at a computer doing stuff? Or is that some kind of programming\n\nUnknown Speaker 32:42\n\n courses? Were we’re jumping into sort of the more complicated topic. So I’ll explain this. And I’ll try to rewind it back and start with a really easy analogy. But But gas is, is an incentive. Right? So let’s just I’m going to oversimplify things. Absolutely. Not an expert. So I might even get some of this wrong, I just want to, for the sake of simplicity, imagine that, you know, there’s these 100 computers out there. And every time, you know, like every day, they each get to write one different transaction. So it’s almost like the entire world all wants to write their things onto the blockchain, but there’s only 100 slots. So it’s almost like there’s this bidding of like, well, how much are you willing to pay in order to guarantee that your NFT is going to get minted in this very next transaction, again, if if I say just like once a day, so you can pay, you know, a whole lot of money to guarantee that you’re going to get minted today. Or you can pay you know, a lot less, and it might get minted in a week from now or a month from now, it’s, it all depends on whatever you bid. So if you’re like, I’m willing to pay $50 to in gas, you know, it’s almost like on the side of the road, like $50 to get me to Chicago, and it’s like, you’re just waiting for the car to roll over and be like, alright, I’ll take 50 bucks to get you to Chicago. You know, let’s kind of do that. It may be a strange analogy, but that’s kind of the the aspect of gas where you’re just trying to incentivize these programs or programmers or computers to take your NF T and process at first. So it’s, you know, whoever pays the most, it’s kind of like pay to win.\n\nIsaac Weishaupt 34:18\n\n Okay, that Well, that makes sense. That actually makes a lot of sense. Because when I created the mp3 file of the podcast episode I wanted to put on as an NF T on the blockchain through open see.io or referable. Both I tried both. And when I went to mint it, it gave me gas prices. Now, there was like three prices, and the cheapest one on the first time I attempted it was like, like 200 some dollars.\n\nUnknown Speaker 34:47\n\n And they saw that time of day so that so that means at that exact moment. There were just so many other people on the internet that were willing to mint, their NF T’s or just do anything in general with the Ethereum blockchain. They were just kind of like out prioritizing you unless you were willing to spend more than them. Now, the other reason to continue with this strain analogy, right, so that $50 to get me to Chicago, imagine that’s just one guy that wants the ride, right. And that’s almost like, if you just want to do a quick transaction, I just want to buy ether, I just want to transfer this thing that’s already on the chain, and give ownership to someone else. It’s almost just like saying, you know, I Thomas, and getting Isaac this thing, it’s this tiny little short message. So imagine that as the equivalent of you know, one person on the side road looking for something. Now you try to upload the entire podcast as an mp3 file, you’re not just trying to write this tiny little transaction that says give, you know, item from A to B, you’re saying, Okay, give item from A to B. And now here’s all this actual data that represents the mp3 itself. So without analogy, it’s not just you on the side of the road for 50 bucks. Now, it’s like you and 100 people with you, and you’re like, hey, we all want to get to Chicago in the next hour. So now it’s like, alright, well, that’s gonna be a $200, you know, Uber fee or whatever. But it’s pretty now people, you’re not just trying to write a little bit at that point. Now you’re trying to write a whole lot, and you need to prioritize all of that to get it onto the blockchain. So you’re gonna pay a lot more to do that. And that’s essentially what minting is. Even if you just want to make something small. It has to do a lot more work and write a lot more data to the blockchain. So there’s a high premium to that.\n\nIsaac Weishaupt 36:31\n\n That makes way more sense now. Okay, you’re now he’s a great man, this is good. I hope I hope other people are getting\n\nUnknown Speaker 36:37\n\n to rewind a little bit and chatted just for anyone that’s absolutely in the dark about some of this i i talked a lot of strange analogies. So\n\nIsaac Weishaupt 36:46\n\n I love analogies are for me, dude, you got it, you got to keep this. So hopefully everyone knows\n\nUnknown Speaker 36:50\n\n what bitcoin and cryptocurrency is, and essentially, so NF T’s they don’t have to, but most of the time, they live on another crypto blockchain called Aetherium. This one’s a little bit different than Bitcoin. Although if you’re just like an investor, you can almost see this one for one just worth different values, like different stocks. But one of the key things about Aetherium is that it you can actually upload code to the blockchain. And the blockchain itself can run that code. And as the output of that code can, you know, automatically write itself. So you can like upload a program, and every time someone does something, that program on the blockchain runs, and it can create new tokens and issue NF T’s and things like that. So that’s kind of what’s going on here. So um, ignore the technical part. For this, I’m going to really basic so imagine the concept of $1 Bill, right. So you’ve got 100, let’s say you’ve got, you know, five of them in your wallet, they’re all basically interchangeable, not $1 bills not worth more than the other for the most part. This is basically a fungible asset. So my $1 Bill is just as good as anyone else’s $1 bill, and we don’t really care, you know, the difference between them as long as I can go and spend it in the store the same. Now, the exception to this rule is that you’ve got $1 bill that has some unique serial number, it’s, you know, 12345678, or got, like a misprint or something like that. Well, now all of a sudden, that’s just not, that’s not $1, that’s worth the same as any other dollar that could be worth, you know, hundreds of 1000s of dollars based on the rarity of this one particular dollar bill, which makes it unique. So and as you know, every single dollar bill has a unique serial code on it. So they are all kind of unique, but but they’re not inherently worth more one or the other, unless, you know, it has this collectible value to it. So in the same kind of way, Bitcoin or Aetherium, just as cryptocurrencies, they’re fungible, and you know, one bitcoin is worth just the same as any other Bitcoin, you don’t care which Bitcoin, you’ve got just the quantity of the ones that you have. Now, where NF T’s kind of come into play as is that they are numbered, it’s almost like a good analogy for this would be like trading cards. So you know, tops comes out with their new baseball card set, or whatever. And they’re only going to meant a certain number of their VIP or their rookies, or their holograms, so there’s going to be rare. And then they’ll meant like 1000 of the commons, and you know, the basic concept of Commons and rares and things like that. So, um, so now, instead of just having crypto, you can now issue, you know, certain number of items. So if you were to mint an NFT using Aetherium, you can basically say, I just want to make 1000 of these digital trading cards or 1000, mp3 or 1000, whatever it ends up being. And that doesn’t inherently mean it’s worth anything at all. In fact, you just spend, you know, some money in order to mint that and to get it onto the blockchain. And now it’s up to you to actually convince someone that Buy or that it’s even worth anything. So it’s, it’s almost like if you took all, you know, took your dollars and you went out and bought a LeBron James rookie card. Well now like that probably has some extra value to it because there’s like a built in market. So that’s that’s kind of what an NF t is, I hope in real simple terms, like, it’s like a theorem and Bitcoin, the currencies are just like dollars. And then when we talk about NF Ts, we’re really talking about something that’s unique and serialized, and kind of individual, and even in to continue on sort of the training card aspect. Let’s say they, they meant 1000 LeBron James, hologram cards, and whatever the new set is. Now, basically, each of those 1000 cards would kind of be the same as any other, the only difference would be if something got physically damaged. Now you’ve got like the grading scale of you know, 9.8, and, and 9.7. And those are worth different values. And there’s provenance and things like that. But when it’s a digital good, there’s no such thing as physical damage early, so so it kind of eliminates that whole aspect. So again, like if you’re trading cards, you have to make sure that you keep it climate controlled, and out of you know, the sun, you’re connecting the digital version of that card, like an NFT. You know, now you don’t have to worry about any of that. Another good example of this, too, are with collectibles is the concept of provenance, where you have to kind of prove that this is the legit card. And not only is this legit card, but maybe it was like signed by the player. So now you have to actually have proof sometimes as much as like a picture of them signing it with, you know, a day and getting it certified. And so there’s this whole extra sort of like economy and extra steps and things that you have to do to kind of prove the authenticity. Now NFT eliminates all that as well, because you can’t really forge the NF T It was minted at this one time along with all of the other copies of it. Because when you meant an NF t, you can make one or you can make 1000 or as many as you want. Again, it’s just like, the prints are making trading cards, they can decide to make 10,000, holograms or 100. And that is going to highly affect you know, the rarity and therefore the value to collectors of that sort of item. So I don’t want to get too much in the weeds and keep going. So just some of that makes sense. Or open up any new ideas.\n\nIsaac Weishaupt 42:25\n\n This is great, man. I love this. The Trading Card analogy is great. And maybe this is like common understanding for people out there. Like I hope some people aren’t like rolling their eyes like you’re so stupid, but like, I’m familiar with\n\nIsaac Weishaupt 42:41\n\n we’ll go too hard in the paint on the NFB. Yeah, the trading card analogy makes a lot of sense. I used to be a collector myself of growing up, I collected baseball cards. And as a grown man, I collected action figures for a while. And the because I enjoyed the you know, the aspects of collecting those things. But I ended up selling all my action figures because of that reason, like, I would have them in these crates, and like the cardboard would start bending and I’m like, oh, geez, I really got to buy like cases and\n\nUnknown Speaker 43:14\n\n crap storage unit and class soul. And yeah, there’s there’s an overhead just to maintaining their value. Yes.\n\nIsaac Weishaupt 43:19\n\n So So NF T’s are just like kind of the next iteration of collectibles for for digital nerds. Right.\n\nUnknown Speaker 43:28\n\n Right. And, and, of course, like, it removes that physical aspect, in one sense, at least the ownership aspect. But that’s kind of the in my opinion, that’s kind of the cool part. Because the minute the next level of this is that you can also imagine this NFT as like this permanent ownership, it’s going to last forever asterik. And I’ll get into that too, but it’s going to last forever on the blockchain. So you can’t lose it unless you lose your access to it. But it’s still out there, you know, for people to see on the blockchain. But it also means that whoever currently owns it could be entitled to you know, for you know, yet to be announced sort of thing. So imagine that you got this, this rookie card or this, you know, special rare trading card as an NFT. Today, well, they could announce in a month, hey, anyone that owns this rare card can now you know is going to be invited to like a VIP appearance. So you can get into the stadium or you can do a meet and greet if you own this NFT. And now all of a sudden that’s going to raise the price of that because now there’s going to be a demand to actually own it. And that’s not just like a one time deal. You know that whoever originally minted it, or anyone can just say, hey, whoever owns this particular NFT is going to get some kind of extra benefit or whoever owns you know, all 10 Or whoever owns the most NF T’s minted by this company or this person. They’re going to get invited to go on a trip or things like that. So you can see it as this collectible that you own, but It’s also like a contract that’s also like a VIP ticket that you’ll kind of have with you. And it’s something that you can freely you know, sell to somebody else. And now they’ve got all of those exact same benefits without you having to go through and and get it you know, certified and have like an escrow service. I mean, it’s all it’s all kind of built in the all the benefits of having blockchain which is having this kind of open ledger for everyone to analyze and, and make sure that all transactions are accounted for. Well, now, you know, apply that to every trading card you’ve ever had, you could pick up that Ken Griffey Jr. Rookie card probably date myself a little bit, that was like the big one that was younger, but you pick that up, and it’s like, looking at the back of it, and being able to see every single person that had ever owned it, who they sold it to how much it was sold for, it’s almost like having a, like a zillo history on every collectible.\n\nIsaac Weishaupt 45:52\n\n Interesting is that so I guess the idea with the analogy of whoever owns this NFT will be able to get you know, backstage with some artists or whatever, would you would you have a a wallet on your phone a crypto wallet on your phone, would that NFT like baster pass to get in, you just show that to the\n\nUnknown Speaker 46:10\n\n yo so the actual mechanisms of how you verify and how you, you know, make these kinds of things work. That’s where it gets a little bit complex. And we’ll we’ll talk about that more detail. Because that’s kind of what you were trying to do with not just whoever owned it could download this mp3 But perhaps could, you know, earn the royalties or payments on, on like broadcasting or something, it kind of gets into that same thing, where now not only do you have proof of ownership, but you also have to have some kind of mechanism that, you know, make sure the right person gets paid based on who owns it at that time. That Okay, that’s probably in the more complicated aspect of\n\nIsaac Weishaupt 46:47\n\n all this. Yeah, I went, I went like in the deep, deep end of the pool on my first tee.\n\nUnknown Speaker 46:52\n\n I mean, that’s cool, because honestly, this whole format is all about experimenting, and trying to do new things that no one else has done before and find again, that’s\n\nIsaac Weishaupt 47:00\n\n what I wanted to do, like my analogy of what I wanted the mp3 podcast file to do, where I say, Okay, first person buys for 100 than 200 I didn’t want it to go that high, I want it to be like $1 for the first person then\n\nUnknown Speaker 47:13\n\n doesn’t possible at this at this moment, just just the fees in order to make that bid and have it you know, transferred from one account to another is is going to be more than $1\n\nIsaac Weishaupt 47:25\n\n Yeah, now the Okay, so, I get NF TS I get the interest with cryptocurrencies and all that stuff. My and I’m kind of from what you said earlier, I feel like I’m kind of like you were I’m 5050 on all of this. I’m kind of like I see some merit in it. I see. I’m interested in and financially from an investment standpoint, I’m really interested because this stuff’s like way outperforming the stock market all this stuff I mean, I can I should say and I’m not a financial advisor This is not financial advice. But so I’m interested in I’m trying to understand how people do this in fact i There’s a guy I I kind of know who I heard he had like tons of investments in crypto and was like killing it like millions of dollars or whatever some crazy amount and I was like man really like am I just like that late on all this stuff and I started still\n\nUnknown Speaker 48:21\n\n really early but I want to I want to definitely speak up here too that I’ve got a My fascination with all this is almost nothing and financial and I wish I were more interested financially because I’m not retiring anytime soon especially on on a conspiracy comic books, but I could see Yeah,\n\nIsaac Weishaupt 48:40\n\n yeah, good. That’s a good career advice for anyone you know, the way to go. Stick with like nutrition, fitness thought videos and shown ass and abs like There you go goes way further trust both of us.\n\nUnknown Speaker 48:56\n\n So I’ve got a couple things of advice, maybe not for people looking to invest financially, but if you want to get started into NF Ts, and find like the most approachable way to get into it. So for example, you’re you’re given some great examples of how it’s kind of a pain in the ass to get started because you almost have to like pay money to give money which is pretty much going to turn off a lot of people initially. So one of the better examples is a site called nifty gateway. And I think this is and I’m not endorsing any of these companies by any means I’ll be happy to talk shit or praise any of them whatever you want to do, but nifty gateway I believe is owned by Gemini, which is like the Winklevoss twins, they, I mean, it’s they go deep into the crypto sort of history on the sites, pretty legit. And the reason I suggest that is because you can actually buy NF T’s using US currency and you don’t have to convert it into crypto until you want to like sell it and you want to start getting more advanced but If you just have, you know, 50 bucks, and you’re like, I want to buy an NF T and see what this is all about, you can do that with with very minimal effort on nifty gateway comm almost every other option that I might mention that you’ll find on your own, they’re all going to assume that you’ve already got some kind of crypto in a wallet, and you know how to transfer it and that you know, that there’s gas prices involved, nifty gateway kind of removes all that. So, you know, if you just want to get started not have to learn about all the intricate crypto specific stuff, it’s a good way to do it. And, and specifically, they have all sorts of different drops. So I think every day they’ve they dropped now it used to be like once a week, but now every day, they’ve got like three or four different artists collections, and it’s almost like an art gallery where they go out and if the gateway and they kind of curate and find artists and work with them to kind of develop a piece that appeals to their base, and they talk to them about rarity and kind of do all that aspect of it. And they’ll they’ll post them up. And either there’ll be like an auction, or the the ones that are really popular are called packs. And it’s almost like opening a pack of trading cards and kind of their you know, it’s like a blind box NFT. So, you pay a certain amount, you know, you’re gonna get NFT, you don’t know which one until they’re all opened. And then you find out if you got the rare if you got the comment or whatever. So those ones are really approachable. And then they also just have just straight up raffles or drawings. So it might be like a really popular artists that you’d never be able to afford a million years ago, it’s a Pablo Picasso of NFT, or something. And for those, sometimes they’ll have a bids where it’s $1. And you just have to be really, really lucky. But you know, you’ll win this amazing enough t that you can hold or resell for a buck, almost every other place where you do NF Ts, you’re pretty much either paying a set price the artist has set up or you’re you’re doing some kind of an auction, neither of those are very approachable for you know, 99% of people that are just getting started.\n\nIsaac Weishaupt 52:05\n\n Now, okay, I got I got two questions one’s going to be, I just want to get these off my out of my brain before I lose them. One’s going to be the process of buying and selling NF T’s from the perspective of an investor, the other is going to be? How do you know? Like, I feel like there’s a million people out there that are men, and that could be way wrong. I feel like there’s a million people out there. Right? Yeah, every waking are and thinking like, Oh, I’m gonna post it and be a millionaire and sell my own art. So like, what makes like, Are there are most of those people just not selling the NF T’s? Or is everybody getting?\n\nUnknown Speaker 52:46\n\n So this is another good example of a different kind of marketplaces. So for example, nifty gateway, they tend to only pick artists that already have a really large following and kind of have a built in audience. The other sites that are similar to that there’s one called super rare, where they kind of they kind of have a curation process where in order to even list on their site, you have to go through an interview and submit a portfolio and you know, they kind of make sure that you’re like a really good fit. And then there’s some others that are like, known origin is another one. That’s, that’s similar to that. And I’m trying to think of the other foundation, where like, they all have this kind of approval process. And you more or less know that if you’re getting something from those guys, and they’ve got some kind of like a track record. But in addition to that, like let’s let’s just say you didn’t know, you know, the people that go out for you just open up nifty gateway, and you’re looking to see who’s currently selling, it’s almost the same as an investor standpoint. So it’s the same as looking at like new penny stocks, or you know, some kind of new IPO coming out, you’re gonna go and find out who’s on the board, you’re gonna look up their profiles, you’re gonna see what their social media is, like, you’re gonna see what, you know, their their track records, Ben, so you know, an artist comes out, you’re gonna go and see, do they have millions of followers? So they have, you know, 1200 followers? Have they sold any NF T’s before? Have they not the ones that they have sold? Is there a secondary market for them? This is, to me, this is like the most boring aspect of NF TS like when it gets into like the financial and speculation and trading but that’s, that’s essentially what you do if you’re trying to look at it as an investment. The other big thing too, is that you want to kind of jump on the train early. So if you see a new artist that’s up and coming or you just really like their artwork, or if you notice that they’re being retweeted by other artists that are much bigger than them, so maybe they’re going to get some kind of, you know, popularity boost in the near future. Those are other good ones that you might want to grab some of their NF T’s while they’re, you know, fairly unknown and cheap and bank that they might become a lot more popular in the future. Okay, so\n\nIsaac Weishaupt 54:59\n\n Okay, so Let me pause for one second. Let’s say I was okay. So let’s say I decided I want to start doing digital drawings. And you know, I’m this great artists and I just haven’t told anyone or showed anyone anything, right? I got a fantastic digital artist,\n\nUnknown Speaker 55:17\n\n you’re saying you don’t have like a following yet?\n\nIsaac Weishaupt 55:21\n\n No, no, I’ll say me, me right now with my following. Okay. Okay. Um, you know, like I like, I’m certainly not like, famous by any stretch, but like, I’ve got enough listeners on my podcast, assuming I still had my YouTube channel that was up to like 70,000 subs, you know, I get up to like, 50,000 spins on a podcast episode on really good ones. So like those, those are pretty good numbers that I could put as a selling point, if I was, I mean, assuming I could do art will assume I can do art. Like, if I was if I had a bio that was like, Hey, I got all these listeners, all these followers. And on top of that, my art was actually really good. I could potentially, like, get a lot of people interested because a lot of people be like, Well, hey, this guy, not only is the art good, but he’s got this huge following, I think he’s gonna maybe blow up and this is going to be worth a lot more than just Joe Blow, who can draw decent, that would have that looks at how investors would look at that.\n\nUnknown Speaker 56:18\n\n Yeah, and and honestly, and from your, from your point of view on that you might team up with another artist that also has their own built in audience and now it’s a, you know, Isaac vise off, you know, collaborating with artists X, and you’re both promoting it. And the cool thing about this all being like digital and these kind of smart contracts is there are ways that you could list that NFT and make it so that you get 5% royalties and the artists you collaborated with gets 5% in perpetuity forever and ever. What are we doing anything after that?\n\nIsaac Weishaupt 56:53\n\n Let’s go bro, what are we doing you and me let’s go to sanity gone. And\n\nUnknown Speaker 56:58\n\n I want to point out to another really cool aspect of that is that I’m in this in, in the case of these NF T’s. Like let’s say if this was a regular art, and you you know you were doing on a canvas, in order for you to sell that to the winning bidder, you’re still gonna have to go through like a dealer or some kind of gallery or something. Now, even though these NF T’s might be kind of sold to these curated websites, which you sort of, say, as an analog to a gallery, the cool thing is that the NFT itself is being minted by the artist and sent directly to you. So so it’s almost like, you know, having proof that you went and received that Pablo Picasso painting directly from Pablo Picasso himself. Another kind of outside of the art world. Have you ever heard of NBA Top Shot? Hmm. So NBA Top Shot is NF T’s, but basketball cards, and it’s got a couple of basketball cards. But the cool part of this is that they can make it so that when you get you know that rookie card, it didn’t come from NBA Top Shot, it came directly from LeBron James like he meant it from his personal account. So now like you own something that was sent directly to you from the player himself. Wow. Like that’s just, that’s a tiny example of like, the cool kind of stuff that you can do, or, you know, the same as an artist, you know, like your favorite musician, they could actually send you you know, their song directly from their account. And it kind of represents that it was owned by them. And now it’s owned by you, especially if it’s like a one out of one or one out of 10.\n\nIsaac Weishaupt 58:36\n\n Okay, do you think Post Malone, do you see in the news Post Malone bought, I forget what’s called like Yacht Club apes or something.\n\nUnknown Speaker 58:42\n\n I didn’t see it. I believe I’m a fan of Post Malone. He seems to be into everything.\n\nIsaac Weishaupt 58:47\n\n Yeah, he bought like a couple of NF T’s I think the groups called Yacht Club apes. And it’s like one of the most popular NFT groups. But is it possible that Post Malone bought these things? I mean, it was some obscene amount of money, half a million bucks or something crazy. I don’t remember. It was, it was more than five figures. But he bought these NF T’s and the news reports on it. And could it be that maybe Post Malone is doing this to get the publicity out that like hey, post Malone’s got these NF T’s, so that the publicity is already baked into this thing, so that when he wants to sell them three months from now, B will be like, Oh, those are the ones Post Malone himself. 100%\n\nUnknown Speaker 59:26\n\n Man, that’s it. It’s 100%. And it’s the same thing. There were some examples. I can’t remember what site it was on, it might have been relatable, but like Elon Musk just randomly bought a few people’s NF T’s. And now it’s like, even if it were just like $1, you know, or a $20 NF T. They don’t even wanted just the fact that it was in possession of Elon Musk at some point. Well, now that one particular one is worth you know, I’m making shit up here, but you know that now it’s worth like 10 grand and another thing that makes us really cool is that again, let’s say that the original art As minted 100 of these, well, the other 99 Still really aren’t going to be worth anything. It’s just that one particular one that Elon Musk happened to own. And you can absolutely prove that, you know, the one that I owe, like this pamphlet, he owned this pamphlet at one time, but I can prove it because it’s like serial number three, and anyone can go and look on the full blockchain that oh, yeah, sure enough, Elon Musk owned, you know, the third NFT. And that was owned by Isaac. So Isaac, for sure, you know, own the same thing to Elon Musk did?\n\nIsaac Weishaupt 1:00:32\n\n How are they going to know Elon Musk owned it because it doesn’t just going into like a crypto wallet. It’s just a sequence of a bunch of numbers.\n\nUnknown Speaker 1:00:40\n\n Yeah, but But you got to imagine that, um, the way that the crypto blockchain works, it’s like this, this huge kind of onion or something or onion might be a bad example. But like, it’s a building layer. So imagine, like, the very first cycle of Bitcoin or Aetherium, you know, it’s this bottom layer. And then the next cycle, it kind of writes on top of that, and then it writes on top of that, so like, it’s got this full built in history, or you can go back to the very first NFT ever minted, and it’s always there. So if you know Post Malone buys it, and then you buy it, and then Elon Musk buys it, that history and that, that, you know, full sequence is always going to be part of the blockchain forever. And that’s actually what makes the blockchain you know, so secure, so to speak. That’s why people like it so much, just because, you know, it can’t just disappear, someone can’t go into the record, and make it look like, you know, you’ve never owned it, or that, you know, you bought it from someone else. Like that’s just baked into everything and all the future transactions are built on top of that. So it’s, you know, that’s, that’s what makes it sort of so unique and so reliable.\n\nIsaac Weishaupt 1:01:46\n\n Okay, all right. Okay, last last. Well, I don’t wanna say last question, what else did you want to cover? I just looked at the time, I was like, Oh, my God, we only got like four minutes left here. Is there any other super hot ideas about NF T’s you wanted to promote or talk about real quick?\n\nUnknown Speaker 1:02:02\n\n I mean, not a more to promote just the concept of NF T’s and what they can do, but also want to Yeah, I wanted to talk a little bit about a theory on which is what NF T’s are, most NF T’s are based on NF T’s can be written in almost any blockchain language, there’s some NF T’s that are in like Solera, and other ones, but but the what I think I want to get into maybe some conspiratorial stuff towards the tail end here. Okay, I firmly believe that a theorem or something like it is going to kind of take over the role of humans interacting with computers and whatnot. So like, I’ll give a real, real kind of general example, which I hope does a little bit of justice. But, you know, right now, you you order something on Amazon, and you check out and then that goes to their kind of system, and they’ve got an algorithm decides, you know, which sort of warehouse to source it from, and how far they’re going to have to deliver it. And, you know, they do all this cost analysis to figure out if they’re gonna send you that tchotchke from North Carolina, or from, you know, Washington or wherever it comes from. But there’s still a lot of kind of human intervention and in sort of systems talking to each other, where a person might be having to actually source that and move it from the bin of Amazon has almost all robots cows. So that’s, it’s maybe not as many humans interacting with the process. But in the near future, just how gas works, right? Gas is just a representation of how much money you’re willing to put on the priority for your thing to be delivered first, on the blockchain, when the near future, almost everything could be so kind of cut and dried, transactional like that, where it’s like, well, if I’m going to buy this thing on Amazon, I’m willing to pay this amount more than anyone else, so that I get it first. And furthermore, that all of all of that pricing and all of the, if you imagine like surge pricing, and Uber, which is kind of like an automatic thing, that can all happen almost automatically, because the machines themselves and that little robot that’s moving from aisle a to iOS xe to pick up the toothpaste you ordered, there’s a quantifiable amount of energy that it’s going to take for that robot to go from point A to point Z. And that can be calculated down to you know, like a fraction of a penny. And that that sort of like, money to effort in terms of electricity is almost exactly what Aetherium could essentially mean. So in the not so far future, I think, you know, drones might be talking directly to the Amazon bots and they’re kind of negotiating amongst themselves I’ll give you this much ether No no, I’ve you know, this drones got higher priority I’ll give you this much ether and and ether is almost going to be like the communication and the currency transaction all in one thing because, you know, they can code but the code results in blockchain items which are worth tangible money. because it’s on the blockchain. So at a certain point, like, it might be cashless, just because the, you know, the phone that I own, and all the robots that are running around my house, like, they’re just constantly paying each other as they’re talking, and it’s just kind of like siphoning out of, you know, some allotment of, of digital currency that you’ve got to just kind of get through your day,\n\nIsaac Weishaupt 1:05:20\n\n bro, you’re blowing my mind that that makes a lot of sense. I get what you’re saying, dude, it’s like almost like, if you program the Amazon drone on the Amazon, warehouse bot, you program them with, you know, AI and language and\n\nUnknown Speaker 1:05:34\n\n just to be more cost efficient, how can I mostly efficient use my energy and movement and time based on you know, just purely a profit, you know, process and, and this goes into, like some really scary places too. Because imagine you’ve got some crypto bros that just happen to be, you know, Bitcoin billionaires, because they got in early in the, you know, 2009 or something. Well, technically, like, if you were to apply this in like a regular store, right, you go to Sam’s or you go to Walmart, I mean, they’re gonna, they’re gonna start acting like you’re an asshole, if you just keep checking out everything, or like buying the entire store supply of something or running the price up on a certain item. But that doesn’t really exist in this kind of automated workflow. So, I mean, that this is an extreme example, but you could have just like a Bitcoin billionaire that’s like, I’m just gonna raise the price or I’m just gonna completely take priority of all Amazon orders for the next week, just because I’ve got so much money to burn, but I can, I can absolutely guarantee that no one else is going to get anything from them because you’re kind of like, you know, doing like a run on the bank almost, but doing a run with your your crypto onto any sort of market that does that automatically. This is sort of a sci fi, you know, worst case scenario approach to it, but it removes the human element and it just makes everything you know, cost profit analysis, but from like an automated AI level where you don’t even have a person being like, way I can see that making a lot of money, but this could have some really horrible, you know, social side effects. Let me let me step in here. I mean, that could be so far removed that that decision was made you know, so many steps ahead of you that it’s it’s out of control. By the time you start seeing the ramifications. Oh my\n\nIsaac Weishaupt 1:07:21\n\n god, you’re scaring me, bro. You’re scaring me. We’re living in a science fiction worst case scenario right now. So I mean, who knows? What could happen? What do you Okay, so, a lot. One last question then. From again, this is like from a newbie perspective. I’ve bailed on the idea of selling a podcast as NFT for now. What can I do? Okay, so if i Okay, so, I started a wearable account and an open C account. And I have a meta mask wallet that is loaded with, you know, a couple 100 bucks a theory or whatever. And I’m like, You know what, me I was just buying NFT and this is all real. This is a real scenario, right? I put a couple 100 bucks in my metal mask thinking okay, that’s plenty cover everything. And it didn’t I was like, oh, eff this. I’m just gonna put the damn podcast on my feet. I don’t care. But now\n\nIsaac Weishaupt 1:08:21\n\n well, and and I got all the ass pain out of the way. I’ve got the money sitting in my Metamask Wallet. So I can buy an NFT on open see right now or wearable? What’s What’s the advice? Like? What should I What should I look for? What should I do? And then how much? Is it gonna cost me? Do I have to pay gas fees when I buy it? And then also when I relist to sell it, X amount of months later? Yes. Your advice on all that?\n\nUnknown Speaker 1:08:47\n\n Okay. Yeah, yes, the both, especially if you’re doing it on open see, um, I think, see, like, as time progresses, these sites are getting smarter and smarter. So what a lot of them will end up doing nifty gateway. Another good example of this, where they kind of have their own little built in market. So when you buy and sell things with a nifty gateway, you don’t really have to pay any of those transactional fees, because you’re not necessarily spending your Aetherium and giving it to someone else. You’re kind of just like, flagging, you know, nifty gateways. Aetherium and saying, it’s like a centralized bank, or like a fractional reserve bank, almost where, you know, they own all the Aetherium and you’re just being like, Hey, you guys owe me like 50 Ethereum, and I’m going to buy this thing. So just you know, now you owe me 49. And you owe that guy one. And that kind of gets you out of having to pay all those transactional costs. But then once you’re like, Okay, now I actually want to turn this into US currency or, or I want to you translate this from a theory of the Bitcoin or I want to send my Aetherium to someone else’s wallet. That’s when they’re like okay, well now to exit our kind of little walled garden. Now we’re going to charge you this little, you know, fee to get back out, which kind of enables them to have all those sort of like fee list transactions, there’s something similar and relatable that you saw that you can make, like a free listing, they call it and it just means that you personally don’t have to pay the minting fee, but then the first person that buys it, they have to pay that fee. So now it’s like, it’s like a cash on delivery, which barely exists anymore. But you know, now that this awesome thing showed up to your door, but they’re like, alright, sign for $200 in order to actually own it. So yeah, it’s so yeah, there’s always gonna be that transactional cost. But I think as time goes forward, a lot of these different platforms are going to have something similar where you can kind of you know, use the the Mickey Mouse dollars without having to pay all the extras.\n\nIsaac Weishaupt 1:10:48\n\n Okay, that and that makes a lot of sense. Okay. Hmm. That’s interesting, because I think Freeman fly does nifty gateway. I’m not, don’t quote me on that. But I’m pretty because I’ve seen him talking about NF T’s because I believe he sells them now. I don’t really know I’m, I’m brand brand new to NF T’s I, I kind of looked into what they were about three months ago, they had my attention for about a day of research, I got all these notes. And then, you know, I got tailed off into Britney Spears and Marilyn Manson and Travis Scott. I mean, like, it’s just like, Well, I\n\nUnknown Speaker 1:11:21\n\n wanted to touch too, because one of the things that we had mentioned, we were just discussing this off this call was like the concept of whoever owns the mp3 gets some kind of like royalty and whatnot. So there’s, there’s a lot of examples where this has actually happened already with like popular artists, I think like Kings of Leon is one of the few that I can think off top my head. But where it gets really complicated, like, okay, great, I listened this NFT, Isaac bought it, you now own this Kings of Leon song, and you can potentially sell this to me, and then I would own it. But in order for either of us to actually get those royalties, if they were sold as part of that NFT. In that case, you would actually have to go to like, some company’s website and put in your NFT information. And then now their website is sort of keeping track of it and sending you the royalties and whatnot, it’s, it’s not necessarily built in. So that just the fact that you have the NFT, you just automatically get money. And that’s it’s the same case, like for example, some artists will say like, if you buy this NFT, and you own it on the certain day, I’ll send you that physical item. I mean, you know, they could be, they could be lazy, or they could just like screw it up and not send it to you, or, you know, they dropped it, and it broke before it got to you. And now you don’t get it at all. So there’s a lot of sort of, like, you know, just doing it however it works. So in your scenario, you could just sell this NFT as a picture, and just on your word be like whoever owns it can always contact me and I’ll send you the high res version or whatever, but to actually get the royalties to work out, especially if it’s like, based on YouTube and not having a previous owner make a takedown claim on the future owner because, you know, that’s where, you know, I don’t know if you even have the power to, to sort of like mitigate and manage all of that, although it’s it’s possible if you spend a lot of money on so computer programmers to kind of like write that all into the contract itself. And at that point, it’s not just an NFT it’s an NFT and this kind of complicated smart contract, which it gets a little bit more technical than we probably need to get into here. All right,\n\nIsaac Weishaupt 1:13:35\n\n well, cool, man. I gotta let you go man, we’re out of time. But thanks for your thanks for keeping in touch man. It’s been a long time and long overdue likewise, man\n\nUnknown Speaker 1:13:43\n\n we just hammer out conspiracy theory stuff to pretty soon.\n\nIsaac Weishaupt 1:13:47\n\n Yeah, definitely. Dude, we need to link up on something here. Let me what are the links I can send my people your way to find more about you and what you do.\n\nUnknown Speaker 1:13:56\n\n So paranoid American calm the number one best way to check out what we’re doing and the only social media I’m currently using is Instagram. So at paranoid American on there, I’m on all the other mediums to Twitter’s just paranoid America without the end. And I want to point this out too that for whatever reason, the NF T crowd is much bigger on Twitter than it has on any other so yet, you would think it’d be like Instagram because it’s such a visual medium, but no, there’s you might find a lot of great artists on Instagram but almost all of the NFT related talk is going to be in Twitter. So highly recommend just you know, search around NF T tags and figuring out what artists to follow and trends the follow on Twitter more specifically.\n\nIsaac Weishaupt 1:14:43\n\n That’s bizarre I would have never expected that Oh, either. yet. Did you know The Google has shadow banned you like they shadow ban me?\n\nUnknown Speaker 1:14:52\n\n Oh, yeah. I’ve been banned for such a long time. It’s not even I can’t list the products on any of my face. Facebook or Instagram accounts because um I think it’s because of my chem trails children’s book which doesn’t surprise me too much.\n\nIsaac Weishaupt 1:15:09\n\n It’s so crazy but yeah, I mean yeah, they hit me around I don’t know 2015 Where I just didn’t appear on the first page anymore I used to be the top search result now was like my bread and butter man, I could flip all kinds of stuff to go watch my video here go check out my book here and like them that when they crushed me that was it, I was dead.\n\nUnknown Speaker 1:15:26\n\n And then another little known fact came in for a while I was like the number one seller on Amazon for a whole bunch of like SpaceForce related shirts I had like the Amazon number one suggested and everything. At some point, they just straight up banned my entire merch account and took all the money like like retro actively took all of the CIAT it was it was a rough summer when that happened. Oh, yeah. And I’m not allowed to sell on Amazon using a number of addresses anymore. So it’s getting harder and harder. Especially as like a book publisher where my my business address is kind of the same as my you know, private address. It makes it really tough. But yeah, so so paranoid American calm right now I’m linking to Etsy to actually buy like for like the MK Ultra examples. But I’m hoping that by the end of this year, and early next year, you’ll be able to find everything I’ve got on Amazon.\n\nIsaac Weishaupt 1:16:23\n\n So for now, they can go to Etsy to get your like pamphlets\n\nUnknown Speaker 1:16:26\n\n and such as that right. Pamphlets. And just a few remaining printed copies of time samplers first round that are all signed after that. Everything will be on Amazon and kind of mass produced and, and sent directly from the printers so I won’t be able to sign them anymore. Okay, so Amazon’s coming soon. And yeah, this month, next month, just whatever, whatever they they decided to give me the thumbs up. Okay.\n\nIsaac Weishaupt 1:16:51\n\n Cool, brother. All right, man. Well, that’s interesting. Do we need to stay in touch? Thanks for showing up on the show here and sharing your ideas about the NF T’s and I’ll keep trying to figure it out making sense of it. Yeah,\n\nUnknown Speaker 1:17:01\n\n thanks so much, man. Hit me up. Whatever. Alright, brother.\n\nIsaac Weishaupt 1:17:03\n\n Take it easy. There you go. That was paranoid american.com. You can check out all of his stuff. He’s got an Etsy. He’s got an Instagram. I got links in the show notes for all that stuff. Hopefully, you know a little bit more about NF T’s right? You talk about that stuff along with the Facebook Metaverse, and it’s clear. We’re riding down this tube into the digital matrix. So I hope that was of help for you. It helped me a ton. It helped clear up a lot of ideas for me, so I appreciate him coming on the show. Check out his stuff, check out his NF T’s his comic book art, all the stuff. And until next time, you know what to do, folks. Stay Woke", "opengraph": {"locale": "en_US", "type": "article", "title": "What are NFTs, Conspiracy Comics and Cryptos with Paranoid American! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we are joined by an old friend to discuss the technology and basic idea behind NFTs! We catch up on our lives in the past seven years, military experiences, his conspiracy comic books, chick tracts and more! We’ll get into the ideas of what NFTs are, […]", "url": "https://illuminatiwatcher.com/what-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-12-02T09:00:52+00:00", "article:modified_time": "2021-12-02T13:49:03+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2021/12/ctauc-NFTs-with-pa.jpg", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["NFTs", "how to NFTs", "what are NFTs"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "http://ParanoidAmerican.com", "https://www.etsy.com/il-en/market/paranoid_american", "https://www.instagram.com/paranoidamerican/", "https://www.rokfin.com/creator/isaac", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://amzn.to/3j3UtZz", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/47743624", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "http://BreakingSocialNorms.com", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/what-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american/?share=twitter", "https://illuminatiwatcher.com/what-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20What%20are%20NFTs%2C%20Conspiracy%20Comics%20and%20Cryptos%20with%20Paranoid%20American%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fwhat-are-nfts-conspiracy-comics-and-cryptos-with-paranoid-american%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2021-12-02T09:00:52+00:00"}