{"result_id": "165019", "URL": "https://illuminatiwatcher.com/decoding-illuminati-symbolism-mark-beast-x/", "timestamp": "2023-04-25 15:36:00 CEST+0200", "meta": {"description": "Can you recognize Illuminati's Mark Of The Beast? Here's a post where we reveal all hidden Illuminati signs. Click here to learn more.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/decoding-illuminati-symbolism-mark-beast-x/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Illuminati Signs: \"X\"- The Mark Of The Beast | Illuminati Watcher", "cleaned_text": "Here on IlluminatiWatcher.com I frequently reference signs and symbols that are often times given to us by the entertainment industry. Whether or not you want to believe they are done for a nefarious purpose is obviously up to you. At first I was hesitant to commit to such a stance, but the last few years of focusing on these things has led me to believe there are too many coincidences for it to be anything but coordinated. That’s not to say that I am fully ready to claim that “Lady Gaga performs black magick rituals” or “Lil Wayne worships the devil”, but I will admit that there are far too many of these symbols showing up in films and music videos for it to be easily dismissed.\n\nIn this post we will examine one such symbol, and that is the “X”. While this is merely a letter of the alphabet, it also holds much importance by the occult groups whom we collectively refer to as “the Illuminati.” I put that in quotes because there really is no proof of this secretive group, but there is a WHOLE LOT of evidence to suggest there is an organized effort to influence our decisions.\n\nLet it be known that there is a non-occult basis of the “X” symbol, and that is the symbolism of Jesus Christ overcoming death by death; through the Cross which is often times depicted with the “X”. I’m not referring to that use of the “X” in this article at all. The practitioners of the occult often times associate with mockery of Christianity, so perhaps they are trying to use the symbol against the Christians (similar to the inverted cross).\n\nI argue that the marketing and symbols are pointing towards the direction of the occult; whether or not you’re worried about the occult being choreographed by Satan is again, up to you…\n\nOne resource I used to research this first topic of the mysterious ‘X’ was Texe Marrs’ Codex Magica. In this book, he cited Freemason Jim Tresnar (who is a well-decorated member of the Garfield Lodge in Oklahoma) and an article from the Scottish Rite of Freemasonry Journal in which they detail the ‘X’ as a symbol of transformation.\n\nIn Freemasonry one must go through various initiation rituals before attaining the next rank in their journey of enlightenment. The 17th degree is conferred upon the initiate and is considered the transformation, or change of the initiate. They cite the crossing of cordons as part of the ritual as a reference of the point in the heavens where the celestial equator crosses the plane of the ecliptic, basically referring to changes made over time. This 17th degree marks the transformation of spiritual power into the Law of Love (which reminds me of occultist Aleister Crowley’s “Love is the law, love under will” saying, and it should also be noted that Crowley’s Star of Babalon serves as the logo for his Thelema system which has the X and O at the top center)\n\n\n\n The cordons used in this ‘X’ transformation ceremony are depicted with black and white- the classic symbol of duality these various groups are always referencing. They are pushing the idea of joining opposites and finding a new equilibrium. This is conveyed in various manners in conspiracy theories like the Ordo Ab Chao (Order Out of Chaos), the Hegelian Dialectic (creating the New World Order through new, cultural “norms”), the Baphomet with its aspects of dual sexuality (it’s both female and male), and the Boaz & Jachin pillars which show us the entrance to a new, mystical place of transformation.\n\nTo add a bit more on the idea of Baphomet and transformations; you’ll read further on that ancient Egypt was unified when the North and South regions were merged together. They also combined the deities of Horus and Set together and said it symbolized synthesis and integration by showing the red and white headpieces together\n\nThis is just an idea, but what if the ancient mystery schools of Egypt influenced these occult ideas of the Baphomet and its androgynous characteristics? We see some of the more extreme occult practitioners like Genesis P. Orridge (he had links to Crowley’s OTO and the Satanic Process Church) taking on these sex change transformations and it seems that they aren’t doing it for the sake of an internal gender identity disorder; but rather to convey an occult message of transformation into a superior being. This is a concept referred to as pandrogyny where they embrace both sexual roles\n\nPerhaps these ideas of transforming man into some new creature are why we see characters like the X-Men who are mutants with “super” powers. The storyline of this group are meant to sympathize with these people who are labelled as outcasts, and some theorists believe this is a way of predictively programming us to accept alterations to the creation of man and woman.\n\nAnother idea I’ll toss out is that Russell Brand has a show called Brand X. Of course this might just be a play on his last name, but I find it interesting that he’s had such a prominent voice in the media lately as a “subversive” conspiracy theorist. Perhaps he’s on the good side of the argument (or so it seems), or maybe he’s a disinformation agent for the Illuminati. This realm of conspiracy gets paranoid and convoluted the further you go down, so I won’t harp on this subject too much right now, but you get the point.\n\nAnother theory is that the ‘X’ signifies death; the journey into the ultimate unknown. Texe Marrs says it is used a symbol for the Egyptian deity Osiris because you see it in Egyptian pyramids and temples, while we find pharaohs buried with their arms and legs crossed in devotion to this sun god.\n\nNo doubt this idea has permeated pop culture with its use in sayings like “cross my heart and hope to die”, and in cartoons where we see ‘X’s placed over the eyes of dead characters.\n\nLike many other traditions, we see that we’ve heavily borrowed Egyptian themes because you sometimes see people placed in caskets with their arms crossed. We talked about how the Freemasons use the ‘X’ to symbolize transformation, but it should also be noted that the Freemasons (aka “The Illuminati”) use this for other imagery as well. For example, the Royal Arch’s Super-Excellent Master’s Degree has the first sign being that of crossing the hands over the chest, which says that the initiate will be penalized with death if they ever reveal the secrets\n\nThis talk of oaths is reminiscent of the “cross my heart and hope to die” phrase from earlier- it’s an oath taken which goes against Christian dogma of not taking any sorts of oaths. In Matthew 5:33-34 , Jesus Christ Himself warns us against swearing oaths to anyone but God, basically saying that trust cannot be secured by swearing an oath by things that aren’t in man’s possession to do so. Of course, as I always say, I’m not any sort of theologian or exemplary knowledgeable Christian, so please research these things on your own.\n\nYou’ll surely recognize this last symbol as the well-known Yale Skull and Bones secret society, which also incorporates the crossed bones with the skull as well\n\nTheorists also claim that the ‘X’ signifies important “Illuminati” events. This symbol is used for the entire “Illuminati” spider-web in order for all its members to know who and what is marked as one of the people or events that have some kind of Illuminati influence.\n\nI’ve covered MANY ‘X’s in pop culture on IlluminatiWatcher.com, so here is a small sampling of what I’m referring to (some of which have the HEAVY occult symbol of the “X” and “O” fused together; which I’ll explain later):\n\nEminem released the appropriately titled Shady XV which I’ve posted all about, but you can see the “X” and the “V”\n\nMadonna has a new album called Rebel Heart (with a song called Illuminati on it) that shows her with an “X” over her face\n\nLily Allen has a video called Sheezus (a mockery of the name Jesus) in which we see the same\n\n5 Seconds of Summer does it- much to the chagrin of all the fans who love to leave nasty comments on that post\n\nKylie Minogue is doing the Illuminati Vow of Silence on the cover to her album called X\n\nMiley Cyrus released a deranged video called Tongue Tied right before she started to really unravel\n\nBig Sean shows us the All Seeing Eye and “X” as he slowly is transforming into these occult ideas\n\nAnd that overrated bozo Ed Sheeran has an album called “X” as well\n\nHere is The Weeknd with a song called Earned It from the 50 Shades of Grey film soundtrack\n\nAriana Grande is running around a apocalyptic scene of the fiery end of our planet, but you’ll notice that they ensured the Mark of the Beast was neatly hidden in the background\n\nNickelodeon’s Kids Choice Awards also sports the fused X and O\n\nHere is Tupac in a bathtub (symbolism we find indicative of the ‘selling out’ to the Illuminati by becoming their “bathtub bitch”; which is how we found Whitney Houston and her daughter when they passed)\n\nThe jocks of our generation (Generation X; that is) are known for participating in these extreme sports. The Olympics version of these sports is called the X Games and you can guess that they’ve got the fusion of the X and the O on their medal. Again; I’ll cover the importance of the fusion of X with the O later\n\nTexe Marrs also claims this ‘X’ is used to activate subconscious programming. Psycho-analyst Carl Jung referenced a ‘collective unconscious’ which I translate as some kind of connective web in which we are all in touch with one another (kind of like the ecology of the film Avatar).\n\nPerhaps the use of ‘X’ does some kind of work on this collective unconscious level in order to influence us to behave in a manner that the Illuminati can take advantage of. I know this is some ‘woo-woo’ type stuff, but it’s one of the theories so I thought I’d include it.\n\nX: The Mark of the Beast\n\nThis final explanation of the ‘X’ could possibly be the most accurate hypothesis. To better explain this, I’ll have to go in-depth on some characters and background events to support it. So here goes…\n\nOne aspect of the ‘X’ is to use it to symbolize the entrance to the unknown. We’ve seen it used in television shows like X-Files that is devoted to exploring the unknown, the supposed Planet X of Nibiru that Ancient Astronaut theorists claim is the hidden planet that has Annunaki aliens inhabiting it, and with generic names of items like Brand X (not to be confused with the show by Russell Brand).\n\nWe also see the ‘X’ referring to the unknown by philosopher Rene Descartes and in algebra (used as the primary placeholder for the unknown variable). This is also why the X-Ray is labeled as such; they didn’t know what they were at the time of discovery.\n\nIf you’re familiar with this website than you’re familiar with the Kabbalah and its Tree of Life ideas. If you’re not, I’ve got a basic primer that explores the Kabbalah conspiracy theories in pop culture that should help make a little more sense out of it. Another disclaimer for this section is that these concepts are grossly over simplified to keep things as simple as they can. I’ve also read through a lot of the material and while it’s still confusing, I believe I am pulling out relevant material, but you’ll have to research on your own if you want to truly believe the stuff I’m talking about.\n\nIn terms of Jewish mysticism, the Kabbalah has a Tree of Life which is a depiction of ten divine emanations, or characteristics of god. Some of the occult-Kabbalah practitioners believe they can navigate through these emanations and reach the top most Sephirot- that of Kether (Heaven). They can approach this realm through one of three paths or ‘pillars’ (technically there are 22 if you consider jumping around the nodes). The three paths are up the left hand side, the right, or the center\n\nThis center path takes the practitioner from Malkuth (the Earth) and into Kether (Heaven) through the unseen realm call Da’at (or Da’ath). This path is referred to as the “G” path (or camel), which is yet another theory for why we see a “G” in the Freemason compass and square\n\nTaking the center “G” path leads the follower into the realm known as the Abyss; which is similar to the previously mentioned “unknown” realm. This path is referred to as the “pillar of consciousness” (recall that there are three distinct paths up the Tree of Life referred to as pillars). This Abyss is more or less the shortcut of reaching the top most Sephirot. In Liber 418 (The Vision and the Voice), occultist Aleister Crowley detailed his journey through the Abyss using John Dee and Edward Kelley’s Enochian magick rituals. This book would help form the foundations of his Thelema belief system, and describe the Scarlet Whore, aka the Thelema goddess, Babalon. In this book, Aleister Crowley himself even warned of entering into the Abyss because it is guarded by a demon (or a “dweller” as he calls it) named Choronzon:\n\nThis is also why we see mention of the occult belief in the ’66 fallen angels’ of the Qlippoth (a concept I heard from theorist Freeman Fly). The Qlippoth is supposed to be a realm that is the dark shadow of the Tree of Life and similar to the Abyss, anyone who traverses it would go insane because it requires the destruction of the ego and that would cause subsequent madness (as if actually believing any of this stuff would make you more rational??… but that’s just my opinion).\n\nThere also appears to be another character in this Abyss and that is Typhon: the lord of the Abyss. At some point in occult history this Typhon character gets conflated with the Celtic god Nodens, the Greek Olympian Poseidon, the Bible’s Leviathan, and the Greek Titan Atlas. There will be more on this in a few paragraphs…\n\nThe Bible says that the Beast comes from the Abyss, and I find it strange that these occult groups try to actually summon entities from the Abyss (like Crowley attempted); yet say there is nothing “evil” about these things. Granted all of this is confusing, but to me that seems a bit telling of their intentions. In Revelations Chapter 13 we read the following warning:\n\nIn the next chapter it talks about a second beast arising that controls the first beast:\n\nI find it interesting in Judaic Kabbalah the number 666 is actually used to represent the creation and perfection of the world. Why would they use that specific number when the Bible warns us against it? Since we’re ultimately trying to explore the ‘X’, it should also be noted that in Greek the letter ‘X’ (Chi) has a numeric equivalent of 600; so 666=XXX. In Roman numerals, the ‘X’ is equal to 10, which is the number of Sephirot in the Kabbalah Tree of Life.\n\nAnother usage for the Tree of Life Sephirot is to describe the beginning of God’s creation. It is believed to use attributes of each pillar of the Tree of Life to go from the Kether (Heaven) Sephirot and zig-zag down all the way to Malkuth (Earth), resulting in a change on the material level. This is the process often times referred to as “As Above So Below” which is a crucial concept magick practitioners believe in. They think that the universe can create a world for them in the material realm by conducting certain rituals and such. It’s causing change in the world through your own desires and will. The occult practitioners believe they can climb back up the Tree of Life in reverse of this zig-zag pattern to reach the Kether Sephirot; arguably becoming gods themselves (or so they seem to believe). This concept is depicted as a lightning bolt\n\n\n\nThis is a lightning bolt we see in Crowley’s Thelema Unicursal Hexagram as well\n\nThis same pattern can also be seen as tattoos on some of our beloved celebrities. For example, Lenny Kravitz celebrated his and Katy Perry’s Illuminati Super Bowl performance by getting a tattoo on his finger in honor of his daughter Zoe; but take notice of the shape of the “Z”\n\nJohnny Depp (who has connections with Marilyn Manson, Die Antwoord, and the West Memphis 3) also has the lightning bolt tattooed on his hand\n\nGoing back to the talk about the entities that exist within this Abyss; we see names like Nodens and Typhon that appear in many forms and depictions throughout pop culture. To reference the lightning bolt of the Tree of Life; we also hear theorist Freeman Fly talk about the “Spirit of Nodens” which is referenced in Kenneth Grant’s book on Aleister Crowley and the Hidden God\n\nNodens is the lightning war god, and in the book it claims that he “flashed forth as lightning from the depths and formed a throne in the celestial realm; a seat of stone where the goddess was established.” The book goes on to talk about the heart of Noden’s sigil is the same as that of the Mark of the Beast; a fusion of X and O which produced the lightning flash from the depths. It is believed that this initiates the establishment of the goddess because the union of the X and O is analogous to the union of the phallus and vagina.\n\nFreeman goes on further to explain a process which I translate as the reason why we see this X and O so often in pop culture. The reason they do it is because they believe the fusion of X and O will initiate the goddess Isis who will grant their every wish and desire as a way of saying “thanks” for evoking her. Freeman provides many examples to support this, and this includes the Madonna Super Bowl performance where we prominently see the X and O\n\nAnother example is Russell Brand’s show logo for Brand X. I’ve been talking about him a lot because it’s hard to discern which side of the ‘battle’ he’s on. For example, in a 2010 interview with Katy Perry (who was dating Brand at the time), Rolling Stone got the following statement from Katy about Brand:\n\nWe’ve seen the transformation of the female character in the 1927 occult film Metropolis when the sinister forces create the False Maria character (a robot that proceeds to deceive the people into the plans of rebuilding Babel). You’ll notice during the film (this is the Giorgio Moroder remake) that there is a fusion of the X and the O during the transformation process; effectively evoking the spirit of Isis into this new monstrosity\n\nAgain, I’ll reference you to my hip hop conspiracy book SACRIFICE: MAGIC BEHIND THE MIC where I lay out the agenda of “False Maria” through the use of various artists who are used to try and convince us they contain this spirit of Isis\n\nWatcher Fleurdamour provided a great finding with the links the fusion of the X and the O has with Alchemy; here is the comment provided:\n\nHere is the image from that same reference where you can see the visuals of what is being talked about (you’ll notice the triangles that represent the four elements in there as well; 30 Seconds to Mars fans will get all kinds of excited since their boy Jared Leto pushes these same symbols)\n\nIs the X and O symbolism used by occult practitioners who seek to evoke the 66 fallen angels of the Qlippoth in the Abyss of the Tree of Life? There are many followers of branches of Kabbalah in entertainment, but they don’t talk about their beliefs enough to know how ‘dark’ their belief systems take them. The only tell-tale sign of Kabbalah beliefs is the red string bracelet we see so many celebrities sporting\n\nFreeman ascertains that this Mark of the Beast symbolism not only belongs to the depictions of the X and O, but also the letter “F” since they are all equivalent to six if you look at them from the numerology aspect:\n\nThis means that any combination of F, O, and X, will give the number 666.\n\nThe energy drink Monster also uses the Hebrew letter of Vav, which is equal to six on their logo. It has three Vavs which signify 666 yet again\n\nV- ALSO the Mark of the Beast?…\n\nAnother of Freeman’s ideas is that the letter “V” plays a role here, and let me take a little bit of time to explain why this is so, because it seems that there is a lot out there that supports this theory as well.\n\nFirst, one must understand that the followers of this occult, left-hand path believe in a certain historical tradition that traces back to ancient Egypt (a recurring theme in conspiracy theories). They believe that the Egyptian god Set is the true “good” deity because he helped humanity by bestowing knowledge upon them (similar to the Greek tale of Prometheus).\n\nSet and his followers were always labeled as outsiders who bucked against the social norms; possibly because Set killed Horus using magick and deception (or so the story goes). They also believed he was the great god of hunting, war, destruction, and brute force, and was the true sun god.\n\nWhen Northern and Southern Egypt merged and become one territory, they embraced the followers of Set by depicting the new god of Egypt with Horus (from the North) and Set (from the South) as one single, bipolar entity. This fusion of two entities reminds me of the Baphomet/androgynous topic we covered earlier, but here is the depiction of this Egyptian mixed deity where you’ll see the white portion of the cap that represents Horus and the red represents Set\n\nOf course there is a lot more to all of that, including the Osirian cult that tried to destroy the followers of Set (which included torturing crocodiles since they were believed to embody Set). Speaking of crocodiles depicting Set; maybe that’s why we saw Rihanna portrayed with scales like a crocodile in her video for Where Have You Been…\n\nAnyhow, the Setian cult was chastised and broken up into various sects and the Greek historian Plutarch even wrote about Egyptian rituals in his compilation book Moralia:\n\nThe Setian cult was broken up into smaller groups and one of these was a branch of Gnostics who claim that the world is a creation of an evil Demiurge and used to deceive us. They thought that Set was the “good” serpent god who tried to educate us of this deception and they worshipped Seth-Typhon as their true god. The Egyptians referred to this sect of Gnosticism as the “sons of Typhon” which you’ll recognize from the earlier text.\n\nI talk a little bit about the Gnostic believers in my beginner’s guide to conspiracies: A Grand Unified Conspiracy Theory, but it should be noted that this Gnostic group spilled over into other cultures and allegedly went further underground and potentially is part of what we now refer to as the “Illuminati.”\n\nFast forwarding hundreds of years, we see Typhon (aka Nodens) appearing again in popular culture. For example, HP Lovecraft wrote an entire storyline called the Chtulhu Mythos. In it an “elder god” named Nodens- Lord of the Great Abyss appears as an elderly man with white hair and grey beard, yet is an expert hunter with incredible strength (recall the brute strength and hunting of Set).\n\nAs a side note- we’ve also seen Johnny Depp (*recall above his hand tattoo of the Crowley bolt) in Pirates of the Caribbean along side a water-based pirate who looks remarkably just like Chtulhu\n\nLovecraft apparently based Nodens on one of his favorite author’s work: Arthur Machen’s The Great God Pan, which describes Nodens as Pan. Surely you’ll recognize the satanic links of Pan; if not review my post on Decoding Illuminati Symbolism: Moloch, Owls, and the Horns of Satan.\n\nAnother pop culture example is from JRR Tolkien’s Lord of the Rings. In this familiar tale, the ring not only uses a concept of sympathetic magic (I lay out the concepts of magick in pop culture in my book SACRIFICE: MAGIC BEHIND THE MIC), but also has a curse on it from the King of Noden. Some may not know that this tale he derived had some factual basis…\n\nIn 1929, Tolkien researched the etymology of the name “Nodens” after archaeologist Sir Mortimer Wheeler found the connection of a cursed ring in an ancient Roman temple grounds in Lydney Park, England. The ring said “Among those who bear the name of Senicianus to none grant health until he bring back the ring to the temple of Nodens.” This ring; referred to as the “Vyne Ring” features the goddess Venus on it, which some can link into Isis (the goddess who grants those that evoke her desires and such; which surely comes at a cost…).\n\nThis ring was what inspired Tolkien to write Lord of the Rings, several years later- linking Nodens with Sauron (the All Seeing Eye of evil).\n\nAnother example comes from Edgar Rice Burroughs’ Barsoom novels. The protagonist of these books is Randolph Carter and he traverses strange worlds in an attempt to locate a visionary place he sees in his dreams. Towards the end of his journey he finds a quarry-land called Inganok where he finds Pan-like beings with horns on their heads. He also finds that entities are worshipping Nodens.\n\nWe saw a Disney rendition of this with the film John Carter, in which we saw reptilian beings and whatnot; and it should also be noted that Disney bought Marvel Comics which released the X-Men films (that’s another X-O fusion)\n\nMore examples come by way of the music industry with their obsession with naming albums after the “V” (often times the fifth album). This includes Maroon 5 who has the Vesica Pisces logo embedded into their name\n\nThe magazine that is simply called “V” is always on the front lines of Illuminati symbolism\n\nThe Hierophant card in the Crowley deck of Tarot cards is the fifth card; also referred to as “V”. It is supposed to represent the authority in which a person makes confessions (as in secret society confessions where initiates reveal their most inner secrets). Freeman asserts that the card depicts the Hierophant as a hermaphrodite with male and female body parts, and I’ve also read that the name comes from the combination of hermaphrodite and elephant. You’ll also notice that he is using the “V” hand sign with the index and middle fingers\n\nThis is the same “V” we saw the allied forces use to show “victory” after WWII, and Freeman says that Winston Churchill actually met with Aleister Crowley and learned that the “V” sign calls upon Typhon and was the only force that could battle the Nazi solar powers. Strangely true is the fact that Churchill had an entire campaign that boasted the “V for Victory” logo, and it’s also rumored that Crowley was a temporary member of the British MI5 program and he was the one that told Churchill the magick powers of the hand gesture, which would make sense because it was originally used as a sign of insult.\n\nIf you consider that the 60’s also saw a rise to prominence with Discordianism (a whole ‘other beast/subject that says that order is an illusion and chaos is king), you could see that they subscribe to the Law of Fives which states that the number 5 is of high significance. They cite the number 5 from the Roman numerals as the “V” and the letter “W” is the 23rd letter of alphabet (2+3=5) which makes it equivalent. This brings us back to the symbolism of the “VW” being of occult origin.\n\nThe pervasive use of the “V” peace sign and “X” is rampant throughout society- hippies used the “V” during the 60s and it flourished ever since with anybody and everybody using it with the intention of promoting peace (myself included). One has to wonder; are we spreading a message of peace? Or are we sending energy into the Abyss for Typhon to use for his own purposes? Are the occult groups taking advantage of this for their own rituals? These are all questions we might never find the answer to.\n\nSome of you may have read through this and thought, “Well, if the famous people are achieving fortunes by evoking Isis or approaching Typhon in the Abyss, what harm is there in trying that for me?” I argue that this is a deception of the Devil. Even if you don’t believe in Christianity, many religions believe in the existence of a force that is trying to deceive you and entice you with monetary gains, but in the end the evil force wins by destroying your life. Steer clear of the false teachings that will only lead you astray into believing you can become god.\n\nIn one horrific example we can see that this symbol takes its effect on people in a disturbing manner (big ups to Watcher ‘Skyrim’ for finding this). We are able to see that the horror character “Slenderman” uses the symbol of the X and O together; you’ll also notice Slenderman’s resemblance to Chtulhu/Typhon- the lord of the Abyss\n\nSlenderman is perhaps the best example we have of the “Beast” programming because a couple of 12 year old girls were obsessed with this character to the point that they stabbed another girl multiple times in an attempt to kill her as a sacrifice for Slenderman.\n\nThey found several items that proved their obsessions with him, including mutilated Barbie dolls and tons of disturbing journal entries; all of which contained the fusion of the X and the O\n\nI believe that this symbol is being placed all around us in an attempt to call upon dark forces. Becoming aware is an important strategy in the battle against evil.\n\nIf you want to see the rest of the Decoding Illuminati Symbolism series, check out my START HERE page where you’ll find more about the Watcher community and links to more articles.\n\nThe only way to make change is to share the word; feel free to share this article on Facebook, Twitter, etc. Thanks for reading and leave a comment if you have any thoughts.\n\nHere you can follow me on Facebook:\n\nAnd here’s the Isaac Weishaupt page for Pinterest as well:\n\nAgain; thanks for reading and stay connected with me by signing up for my free email newsletter!\n\nWebsite publisher of IlluminatiWatcher.com, author, and independent researcher; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac has been a featured guest on Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, VICE, SIRIUS/XM’s The All Out Show, The HigherSide Chats, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.", "opengraph": {"locale": "en_US", "type": "article", "title": "Illuminati Signs: \"X\"- The Mark Of The Beast | Illuminati Watcher", "description": "Can you recognize Illuminati's Mark Of The Beast? Here's a post where we reveal all hidden Illuminati signs. Click here to learn more.", "url": "https://illuminatiwatcher.com/decoding-illuminati-symbolism-mark-beast-x/", "site_name": "IlluminatiWatcher", "article:published_time": "2015-02-06T17:05:19+00:00", "article:modified_time": "2021-05-06T04:05:17+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2015/01/facebook-logo-300x94.jpeg"}, "tags": ["kids choice awards illuminati", "churchill illuminati", "kabbalah ariana grande", "mark of the beast nodens", "ariana grande one last time illuminati", "crowley abyss typhon", "rihanna illuminati", "kabbalah madonna illuminati", "x games illuminati", "mark of the beast crowley", "mark of the beast v", "law of fives illuminati", "kabbalah illuminati", "lenny kravitz illuminati", "madonna rebel heart conspiracy", "crowley abyss illuminati", "katy perry illuminati", "ariana grande one last time symbolism", "nickelodeon kids choice awards illuminati", "madonna rebel heart illuminati", "chris brown illuminati", "john carter illuminati", "mark of the beast katy perry", "mark of the beast typhon", "earned it illuminati", "mark of the beast 666", "mark of the beast monster energy", "slender man illuminati", "kabbalah lil mama", "kabbalah miley cyrus", "jrr tolkien illuminati", "harry styles illuminati", "michael jackson illuminati", "ariana grande illuminati", "kabbalah henry styles", "kabbalah harry styles", "lord of the rings illuminati", "ed sheeran illuminati", "50 shades of grey illuminati", "madonna illuminati", "mark of the beast russell brand", "mark of the beast symbolism", "slenderman illuminati", "the weeknd illuminati", "vyne ring illuminati", "mark of the beast illuminati", "50 shades of grey symbolism", "kabbalah michael jackson", "kabbalah ashton kutcher", "kabbalah avril lavigne", "illuminati devil worship", "mark of the beast monster", "russell brand illuminati", "henry styles illuminati", "law of fives symbolism", "earned it symbolism", "mark of the beast x"], "tweets": [], "movies": [], "links": ["https://illuminatiwatcher.com/", "https://illuminatiwatcher.com/wp-content/uploads/2015/02/IlluminatiWatcherDotCom-Crowley-OTO-Star-of-Babalon-X-Mark-of-Beast.jpg", "illuminatiwatcher.com/hidden-illuminati-symbolism-eminems-shady-xv-album/", "illuminatiwatcher.com/hidden-illuminati-symbolism-eminems-shady-xv-album/", "https://illuminatiwatcher.com/illuminati-symbolism-chris-brown-x-album-cover/", "https://illuminatiwatcher.com/illuminati-symbolism-lily-allen-sheezus-music-video/", "https://illuminatiwatcher.com/illuminati-symbolism-5-seconds-summer/", "https://illuminatiwatcher.com/illuminati-vow-of-silence-and-the-entertainment-industry/", "https://illuminatiwatcher.com/illuminati-symbolism-miley-cyrus-tongue-tied-video/", "https://illuminatiwatcher.com/illuminati-occult-transformation-rapper-big-sean/", "https://illuminatiwatcher.com/kaballah-conspiracy-theories-illuminati-symbolism-in-pop-culture/", "https://illuminatiwatcher.com/wp-content/uploads/2015/02/IlluminatiWatcherDotCom-tree-of-life-kabbalah-lightning-bolt-WO.jpg", "https://illuminatiwatcher.com/katy-perry-illuminati-goddess-2015-super-bowl-halftime-show/", "https://illuminatiwatcher.com/illuminati-occult-symbolism-die-antwoord/", "https://freemantv.com/read/mark-of-the-beast/", "https://illuminatiwatcher.com/sacrifice-magic-behind-mic-illuminati-hip-hop/", "https://illuminatiwatcher.com/jared-leto-illuminati-satanist-symbolism/", "https://illuminatiwatcher.com/illuminati-symbolism-peace-tea/", "https://illuminatiwatcher.com/illuminatiwatcher-e-book-bundle-deal-packages-now-available/", "https://illuminatiwatcher.com/decoding-illuminati-symbolism-moloch-horns-satan/", "https://illuminatiwatcher.com/sacrifice-magic-behind-mic-illuminati-hip-hop/", "https://illuminatiwatcher.com/start/", "https://www.facebook.com/Illuminatiwatcher", "https://www.facebook.com/Illuminatiwatcher", "https://www.youtube.com/user/illuminatiwatcher1", "https://www.youtube.com/user/illuminatiwatcher1", "https://twitter.com/IlluminatiEyes", "https://twitter.com/IlluminatiEyes", "https://www.pinterest.com/isaacweishaupt/", "https://www.pinterest.com/isaacweishaupt/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/decoding-illuminati-symbolism-mark-beast-x/?share=twitter", "https://illuminatiwatcher.com/decoding-illuminati-symbolism-mark-beast-x/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Decoding%20Illuminati%20Symbolism%3A%20The%20Mark%20of%20the%20Beast-%20%E2%80%9CX%E2%80%9D&body=https%3A%2F%2Filluminatiwatcher.com%2Fdecoding-illuminati-symbolism-mark-beast-x%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Allaboutthetruth", "Sherman", "Sandy", "Version", "Passerby", "Jax", "Heather", "IlluminatiWatcher", "SimmyCee", "Anon", "Thomas gabriel saul", "michael sutherland", "JIMMY L WASHINGTON", "Ted", "Anonymous", "amber", "phillip", "Boryana Pitson", "Brian carter", "DeT", "Daeg jidu", "Rick M Tipton", "futuret", "Linda", "sshnsb", "JB", "Dan", "Emma", "Anthony", "KENNY TODD", "Caller out of Douce Baggins", "Isaac Weishaupt", "mark", "Anna", "ronnie", "ace", "Linda Smith", "Ant", "銈儵銉炽儉銉冦偡銉ャ€€涓囧勾绛嗐€€銉炪儑銈ｃ偨銉矷I銆€銈炽儸銈偡銉с兂銆€YN4690-286銆€銈枫偧銉€€銉偢銈︺儬銉椼儸銉笺儓銆愰€佹枡鐒℃枡銉诲悕鍏ャ倢銈点兗銉撱", "Aimee", "Jacob Whitley", "NM278", "BillyP", "John Wright", "Psserby", "Unknown", "David", "kate", "Sean H", "Anthony Williams", "Liz", "s-man", "Maire", "Skyrim Fiend", "wheelbroken", "CAROL", "ROSIE", "Priscillah", "BK", "legion", "Truth", "mikey", "Boon", "Jesse", "Miss P.", "Phil", "Skylar", "newfie", "Sain'tSteven", "n", "Gertrude"], "publish_date": "2015-02-06T17:05:19+00:00"}