{"result_id": "165043", "URL": "https://illuminatiwatcher.com/isaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10/", "timestamp": "2023-04-25 15:36:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/isaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Isaac Weishaupt on Fringe Radio: Conspiracy Theories and Unpopular Culture Podcast E10", "cleaned_text": "For the next two podcasts I’m putting out a two-part radio show I did called The Fringe Radio Show. We talked a lot about my book A Grand Unified Conspiracy Theory: The Illuminati, Ancient Aliens, and Pop Culture. I’ll be publishing E11 in a week or two when my file size quota refreshes (UPDATE: Here is E11)\n\nHere’s the Youtube-audio from the show, there were some call-ins that were… interesting… We also chop it up about topics that include Jay-Z’s occult obsession with blue, missing Malaysian flights, reptilian shape shifting, transhumanism (and Mormons), UFOs, Kubrick, and a whole slew of other stuff. The mp3 version is below it, so keep scrolling…\n\nHere’s the player, if you like it, please share the link and comment and let me know what you think. You can download the mp3 file by right-clicking ‘Download’ and ‘Save Link As’ (or just left click that ‘Download’ link). Better yet subscribe via iTunes. You can stream/download the first podcast HERE if you haven’t heard it yet.\n\nListen to “Isaac Weishaupt on Fringe Radio: Conspiracy Theories and Unpopular Culture Podcast E10” on Spreaker.\n\nYou can also check out part two on Episode 11\n\n‘A Grand Unified Conspiracy Theory: The Illuminati, Ancient Aliens, and Pop Culture’ is a culmination project of several years of research and taking notes on taboo and fringe subjects from various theorists, philosophies, and academic walks of life. I’m a website publisher for conspiracy theories and the exposure that I’ve had to these topics gives me a fresh perspective and clarity of these sometimes confusing and offensive topics. I focus a lot of the material on the philosophy of David Icke, so if you wanted an independent third party assessment on why he thinks reptilian shape shifters control our planet (and why he could be correct); this is the book for you!\n\nI explore links between all of the Illuminati conspiracy theories, the music, film, and entertainment industry’s infiltration, and brainwashing symbolism found in all of these venues (e.g. the All Seeing Eye, pyramids, etc.). Ancient cultures, Nazis and occult worship still play a key role in today’s control system, and I provide insight into these topics, including a never before released review of the controversial and banned documentary of Princess Diana’s murder Unlawful Killing. This film has never been released and I was able to watch a copy of it and detail its findings in this book.\n\nMore original theories are presented such as Rihanna’s occult origins, red dragons and their symbolism, and the Illuminati eugenics program being deployed through a transhuman robotic agenda. I also explain how David Icke’s theories of the Moon Matrix and Saturn Worship operate to manipulate us into a false reality.\n\nI wrap the book up with a conclusion of what actually works out of all this mess. It includes an assessment of David Icke’s reptilian shape shifters explained through a legitimate cognitive style model theory in academia called ‘Adaption-Innovation’ theory.\n\nHere is a breakdown of the chapters and the topics presented:\n• Approaching book from a holistic ‘systems thinking’ and providing breadth of knowledge for all readers new and old to this world of conspiracy theories.\n• Illuminati Infiltration of Music, Television, and Hollywood , Fabian Society, Mind Control Techniques, Destruction of Empathy, Nazi Olympic Games Occult Symbolism, Illuminati Music Connections and Symbolism, Rap Music’s Illuminati Manipulation, MK ULTRA and Alter Egos, Reason for Predictive Programming and Examples\n• Food & Health, Global Centralization, One Political Party to Rule Them All, UFOs and the Phoenix Lights, Symbolism & Energy, Reptilians & A-I Theory, Paradigm Stretching, Transhuman Apocalypse, Breaking the Cycle\n• Occult Symbolism in Masters of the Universe\n• Symbolism Analysis of Prometheus film- Christianity, Transhumanism, Avatar, the occult and Ancient Astronaut theory\n• None Aleister Crowley & the Illuminati Magick Trance on the Entertainment Industry", "opengraph": {"locale": "en_US", "type": "article", "title": "Isaac Weishaupt on Fringe Radio: Conspiracy Theories and Unpopular Culture Podcast E10 - IlluminatiWatcher", "description": "For the next two podcasts I’m putting  out a two-part radio show I did called The Fringe Radio Show. We talked a lot about my book A Grand Unified Conspiracy Theory: The Illuminati, Ancient Aliens, and Pop Culture. I’ll be publishing E11 in a week or two when my file size quota refreshes (UPDATE: Here […]", "url": "https://illuminatiwatcher.com/isaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10/", "site_name": "IlluminatiWatcher", "article:published_time": "2014-08-08T05:47:44+00:00", "article:modified_time": "2020-06-21T17:51:56+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2014/08/Fringe-Radio-Show.jpeg?fit=879%2C445&ssl=1", "image:width": "879", "image:height": "445", "image:type": "image/jpeg"}, "tags": ["fringe radio slc", "isaac weishaupt interview", "fringe radio salt lake illuminati", "isaac weishaupt", "fringe radio", "illuminatiwatcher fringe radio", "fringe radio illuminati"], "tweets": [], "movies": [], "links": ["https://www.fringeradioshow.com/category/up-coming-guests/", "https://illuminatiwatcher.com/get-signed-copy-grand-unified-conspiracy-theory-book/", "https://wp.me/p2ijVF-37f", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884", "https://illuminatiwatcher.com/conspiracy-theories-and-unpopular-culture-the-illuminatiwatcher-podcast-e1-2/", "https://www.spreaker.com/episode/15929226", "https://wp.me/p2ijVF-37f", "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2014/08/Fringe-Radio-Show.jpeg?ssl=1", "https://illuminatiwatcher.com/wp-content/uploads/2014/08/Fringe-Radio-Show.jpeg", "https://illuminatiwatcher.com/isaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10/?share=twitter", "https://illuminatiwatcher.com/isaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Isaac%20Weishaupt%20on%20Fringe%20Radio%3A%20Conspiracy%20Theories%20and%20Unpopular%20Culture%20Podcast%20E10&body=https%3A%2F%2Filluminatiwatcher.com%2Fisaac-weishaupt-fringe-radio-conspiracy-theories-unpopular-culture-podcast-e10%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2014-08-08T05:47:44+00:00"}