{"result_id": "165023", "URL": "https://illuminatiwatcher.com/tmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson/", "timestamp": "2023-04-25 15:36:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/tmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "TMZ: Met Gala, Coachella Moloch, MGK Megan Fox Blood, Die Antwoord, Chappelle, DaBaby & Mike Tyson!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we get a heavy dose of celebrity-occult symbolism with our TMZ Illuminate Confirm show! We’re going to hit on all of these topics: Ghislaine Maxwell, Mike Tyson on hunting humans, Die Antwoord allegedly abusing their child, Dave Chappelle getting attacked (as well as some VERY strange symbolism from his attacker’s social media…), DaBaby’s troubles, Met Gala symbolism for 2022, Kim Kardashian’s Voodoo of Marilyn Monroe, performances in an Egyptian temple, Moloch at Coachella and Machine Gun Kelly & Megan Fox drinking each other’s blood! You really have to see some of these images I’ll be discussing, do it here on IG at Instagram.com/IsaacWeishaupt\n• The Hunt Film Analysis was in August 2020 (*relevant to the Mike Tyson hunting human section): https://illuminatiwatcher.com/the-hunt-film-analysis-cia-in-hollywood-animal-farm-and-the-liberal-conservative-dance/\n• Go ad-free with bonus content! 3 options- 1. Patreon.com/IlluminatiWatcher, 2. VIP Section https://illuminatiwatcher.com/members-section/ 3. Rokfin https://www.rokfin.com/creator/isaac (*now with 4K HD video versions of the show). Compare all three: https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• ALIENS, UFOS AND THE OCCULT BOOK SERIES NOW UP ON AMAZON AND AUDIBLE!: https://amzn.to/3j3UtZz\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION bundles: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by supporting the show on any of the three platforms!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons) and “Breaking Social Norms.” He has been a featured guest on Tin Foil Hat podcast, Ground Zero with Clyde Lewis, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nUnknown Speaker 0:00\n\n If I guess it drank each other’s blood might mislead people or like people are imagining us with like goblets. And we’re like Game of Thrones, drinking each other’s blood. It’s a just a few drops. But yes, we do consume each other’s blood on occasion for ritual purposes.\n\nIsaac Weishaupt 0:24\n\n What’s up, everybody? Boy? You know the drill. I gotta keep saying it. Do I already know. We’re just gonna move on. We’re just gonna assume you know the drill. You know who it is, you know what we’re here to do? No, that’s, that’s Sam Tripoli, dammit. He’s got that as a pervert saying, Today, we’re going to do another one of the most popular formats of my show. The TMZ. Illuminate, confirm, we basically are going to talk about a lot of celebrity news. And I gotta tell you, folks, I don’t know what the hell is going on. I do have a theory. And we’ll talk about it at the very end. Just so I can keep your attention for the full hour. Make sure you listen to the whole thing. It’s a terrifying theory. So hopefully I’m way wrong. But we’ll see today we’re gonna talk about I mean, the list goes on and on. We’re gonna talk about the Met Gala. 22 Moloch at the Coachella Machine Gun Kelly and Megan Fox drinking the blood. Dan damn word. Dave Chappelle Dube be, and Mike Tyson. I mean, I don’t even know what to say there’s so much going on. Without further ado, let’s just get into it. Oh, housekeeping. I’ve still got some shirts left. I’m running out of sizes though. You know, I got a new design up there. It’s a beautiful three quarter sleeve and ultra soft shirt, but the 70s logo gumroad.com backslash, Isaac W link in the show notes. And I’m getting another design, I should have them in tomorrow. Then I’m gonna launch that. So be sure to follow me on the Instagram so you could check it out. I’ll be thirst trapping the new shirt and you’re gonna love it. I’m telling you, I think this is gonna be the most popular one. And I’ll and also if, while you’re on the Instagram, check out the post I’ll make for this show. Lots of images to support what we’re talking about. Because there’s a lot to talk about. I’ll be hard pressed to get this thing under an hour. And look, I’m in a salty mood. I look. Two seconds, two seconds and we’ll get into today. Started out beautiful. I did a little CrossFit workout feeling good. And I want to lay down I want to take a nice little nap. I budgeted in time for a nap. And I lay down and I’d fade it off as well. I put on Children of the Corn from the 80s as Stephen King movie, you know, paid attention to the point where Malikai come in and start catching bodies. And I was like, okay, hahaha and I start falling asleep. Someone comes and knocks on my door. Can you believe it? You can hear and we got a 20 megaton warhead bomb dropping overhead. I don’t know what’s going on outside. It’s a terrible day in suburban hell for a nap. Let me tell you, people knocking on the door who knocks on the door anymore? Who does this? woke me up. So now I’m salty and you got to deal with it. So no, I’m just kidding. I’m sorry. I’m gonna try to I’m trying to get it together for you guys. Let’s get into it. Galia. Maxwell. I’ve got to mention her. She got 10 years knocked off her sentence. Shout out Dr. Annie, you’re on the drop for that. The argument apparently was that two of the charges she had were so similar that they were throwing one out or reducing it. But she’s still set to do 55 years so it doesn’t matter. And maybe right maybe she’ll be eligible for parole in like 10 years or whatever it is these people do I don’t understand how the legal system works. Like I don’t know how Bill Cosby got I still don’t understand that. You guys are raping chicks. Allegedly, I don’t know. I’m gonna say allegedly just to cover my bases. You know what I mean? Mike Tyson let’s get into it. There he was on Joe Rogan now haven’t listened to the whole show. But I did listen to one particular clip and I’m gonna play it for you right now.\n\nUnknown Speaker 4:37\n\n Whatever you think whatever you think a human did to another human being it happened Yes. Any panel fucking eight whatever. It happens somewhere\n\nUnknown Speaker 4:46\n\n in history definitely happened. It probably happened somewhere this Yes.\n\nUnknown Speaker 4:49\n\n And sometimes in these special camps and stuff that happened. These people only 1000s of acres and and nothing grows on them and just rise keep it weird. ranches\n\nUnknown Speaker 5:00\n\n where people meet and do rituals\n\nUnknown Speaker 5:02\n\n to hunt and Mother find them go outside. I know that if I’m throwing it at you, I\n\nUnknown Speaker 5:08\n\n guarantee you there’s been someone somewhere in the world who paid someone to hunt a person. I guarantee you that that’s a\n\nUnknown Speaker 5:15\n\n no this is what happened. They take these homeless people off the street, put them in there taking them on the special hospital they take them from that hospital may have been drugged up taking them on these large states. A property that’s hot. Nigga run No, really? I really I really believe that. I think well did that book The most dangerous game didn’t that come out in like the 30s so old old book about that very very thing rich people only report only mean that we hunt the fuck why the only reason we on Fox? I think there’s the for the fox is the only one that backtrack. Because it’s sneaky. You only want to backtrack like if, if if he chases if you cheat and hit Go flow and then come back with and go this trick you? Yeah, that’s. That’s why that’s the only really challenging. That’s the only challenge and chase. Everything else is too easy. Too simple minded. The fox was the only one that’s challenging. Oh, that’s interesting. So I never thought about that. So now they say well, the fox is the most reasonable animal. Let’s try a human animal. See how reasonable he is? Guaranteed? Yeah,\n\nUnknown Speaker 6:25\n\n guaranteed. Someone’s done. That’s why they\n\nUnknown Speaker 6:27\n\n want to. They want to challenge Reason. Reason ability. Yeah, let’s see how he thinks. How does he think? How does he superior than us? Why are we so they’re not gonna do anything. They think that’s inferior than No, yeah, they’re gonna they’re gonna study what they’re gonna attack. What they’re gonna make the victim.\n\nIsaac Weishaupt 6:45\n\n He told Joe Rogan, he thinks that rich people are haunting homeless people for fun. And this was also very curious, because the next I think it was the same day the Joe Rogan interview dropped was the same day or the day after that he was all over the news for punching that dude on the plane. Did you see that video? There’s a video of I don’t know the story. The guy was sitting behind him. And Mike Tyson just went off started punching this guy, just some dude. Right? I guess he was being annoying or something. So of course that dominates the headlines, and no one’s talking about what he said on Joe Rogan. And let’s dissect this for just one second. At the beginning of the clip, you hear him talk about how he said look like. He says something about how this has all been done before. He’s like, I don’t care what it is. Humans have tried everything. And he starts to say, we’ve tried eating people, which is true, right cannibalism, but he kind of cuts it off real quick. And then they get on to the talk about how they would hunt humans, the elites would hunt humans. And it’s interesting. He even talks about how some people could have 1000s or hundreds of acres with no farm land on there. What are they doing with all that acreage, implying that they would be hunting humans. But you know what it made me think of? It made me think of Bill Gates, right memory has been buying up all that farmland. Is he buying it to hunt humans? I don’t know. And here’s the thing with Mike Tyson. This guy’s hung out with very powerful people. He’s Mike Tyson. You think he’s just coming up with this stuff? He’s just playing, making it up in his head? No, I think he really knows some stuff. He doesn’t say the words. That Oh, I know. Because so and so. But he says stuff. Oh, I think they did it. I think they do this stuff. And I think they do too. Back in August of 2020, we did an episode where we analyze the film The Hunt, if you recall, I’ll put a link in the show notes. And the whole film was about how they suppress conspiracy theories about these elites hunting humans. And I made a big deal about how in this film I believe there’s a lot of evidence pointing to the idea that this is loosely based upon elements found in animal farm which was the the George Orwell story. It’s a communism scare tactic propaganda film, because it was an app run by the American CIA to use Hollywood to make this film to scare us about how bad communism was. And on that episode, I pointed out the interesting irony that this film called The Hunt had elements of Animal Farm which was a CIA op for Project Mockingbird or whatever. It was an OP run by E. Howard Hunt. So how curious the hunt Howard Hunt? You got it? You’re gonna check out that show August 2020. I’ll put a link in the show notes. Moving on. D ant word. Maybe you know who they are. Maybe you don’t. These are two What do you what’s their? What’s their? Your South African? Let me look it up for you. D N word was it was a musical group in the like early 2010s. South Africa. There you go, boom, good. It was this man and this woman. The guy goes by ninja. The girl goes by Yolandi. And they were very influential at the time. They were huge names. Very strange looking people. In back in 2014. I wrote up and analysis of these two and their band and all the occult symbolism that probably deserves a whole show on its own. But to sum it up, they use a lot of symbolism of chaos magic. They use a lot of symbols of occult rituals and witchcraft and they use even they even have sigils flashing all over the place. I’ll put some of the images on the Instagram posts you can see what I’m talking about. And carried Cara del Levine the actress model she wasn’t one of their videos. She was she was also recently topless. I don’t know if you know that at the Met Gala.\n\nAnd I know is the reason why we’re talking about them is because they recently had been accused of abuse and I am going to carefully read from n m e.com. An article called Dr Edwards adopted son accuses the band of physical and sexual abuse and slavery. The South African duel have denied the allegations made against them. Here’s what the article says Deann Ward’s adopted son has accused the ban of physical and sexual abuse, exploitation and slavery. Gabrielle Toki do praise and his sister were adopted by Yolandi and Ninja when he was nine years old. He is now 20 and no longer living with the musicians. His sister is now 14 and is still in the Paris custody although she lives full time with another family in Johannesburg. The allegations first came to light last week when du Preez shared a video interview he had made with the band’s former filmmaker Ben J Crossman. And an interview with South African news outlet news 24 published earlier this week, do Brees accused the duo of quote adopting me to be a slave. They made me feel like I was actually a slave they made me feel like I wasn’t really loved. The guy suffers from a rare skin disease called hyper hypo hydraulic ectodermal dysplasia, and he said they made me believe I was the devil. They made me swear more and made me believe that I could burn people in hell and that I am the king of hell. They told me that I could bring darkness upon the world. He also alleged that Jones in Utah is alright do trois forced him and his sister to undress in front of them anytime they were bought new clothes. If they refused to do so they would be punished to priests claim that when he was 13 Do tois asked him to spend time with her in a room at a house party while she was naked. Quote Yolandi called me into the room she was naked and vomiting all over. She was laying with her legs open like the sex doll I had in my room. The worst part was seeing my supposed to be mother or adopted mother being naked in a room drunk. Experiencing my mother being drunk naked and wanting me to spend time with her in the room while she was naked. I found that very disturbing. He continued to claim that his sister no longer wants to visit Jones and do tois because each time she does they asked her to get naked quote last December ninja and then apparently took my sister into a sauna and everyone was naked in the sauna and one of my sister to get naked to Why does ninja want to see my sister naked? She is so small. It is pretty weird. It feels like a pervy vibe to me that ninja wants to have with my sister every time when he phones the family they asked if my sister is pregnant yet. That is not going to happen. Not on my watch. A Toki this kid is a guy who’s talking about this stuff he was actually in the video for I think you freaky he’s got the, like Vampire looking teeth. Anyway, it’s pretty wild and do where they deny the whole thing. But as you could see if you could, if you could read my article I’d written with all the photos from all the videos, you would see they use a lot of satanic symbolism. I will put some of those images on the Instagram so you can see what I’m talking about. This might take a couple of posts. There’s so much to cover today. So there you go. They’re trying to tell their kid to bring evil into the world, which is what I argue a lot of these musicians are into. It’s all over the artwork. Why wouldn’t it be real? Moving on Dave Chappelle as you already know, was attacked on stage by a man who had a knife, a gun, a knife that looked like a gun. How he got in there, we don’t know. And if you haven’t seen the full clip, I’m going to play it for you now. It’s actually pretty wild. And it’s look these these are these are some good comedians. They said he’s had his life threatened and they’re cracking jokes Take a listen thank God that was clumsy he’s back there getting stuff come from Thank you, sir. It was a it was a trans man that Will Smith.\n\nDave Chappelle is like thank God, he was clumsy. And then Chris Rock acid. It’s Will Smith. It’s pretty funny, right? Pretty funny. So the dude had a replica handgun knife name was Isaiah Lee and I got some wild stuff about this guy. And he promptly got the absolute ever loving shit kicked out of him by security. Dave Chappelle joked that Jamie Foxx and Jon Stewart helped stomp this guy, then I guess that turned out to not be true. Who knows I’m recording the show Thursday, May 5, by the way, in case you’re listening, especially if you’re on that free feed, and you gotta wait till Monday, because only Lord knows what’s going to happen between now and Monday. So I’m recording this on Thursday. Now, there’s some weird connections to the LGBT Q movement with this right? If you recall, we’ve talked about Dave Chappelle in the show, poking the LGBT bear. No pun intended, on his special that he had last year. And if you recall, I don’t if you watched it, he barely. I don’t know. It’s tough, right? I am not a member of the LGBTQ community. Therefore, I do not know what it feels like. But I do try to support them as much as I can, right. But to me, I felt like it wasn’t that bad. He would talk about how his close friend was a member. And it was a sad story and all that. But it’s like, I don’t know, on some levels. I’m kind of like, Look, guys, like you gotta learn to sort of take a joke. Like we all take jokes. You know, I got attacked at the I got attacked at the Comedy Club in Salt Lake City. Just last weekend. I made a comment about it on my Instagram story. If you caught it. I’ll just tell you real quick. Me and Josie and a couple friends. We walk into this bar and they happen to have a comic up on stage sort of doing his thing. Very informal, though, right? We walk in and we’re looking to get into our seats and the guy sees me I’m not even looking at him. I’m just minding my own business like a good Christian soldier. And he looks he apparently looks at me and points me out and says look, we got Post Malone. Which I guess it’s kind of kind of funny and ironic since Post Malone apparently has a house in Salt Lake City. He says look is Paul’s Malone have Would you call me a fisher price? Drug dealer has what he called me. That’s actually a very good burn. That was very good. Now, you know, I’m vertically challenged. I’m only five, eight. I could have been very sensitive to that. But I was not just getting the thumbs up. I thought that was actually a really good burn. Now, granted, that’s a completely different situation, right? Like, guys, white guys, five foot eight don’t have a history of being like, killed and beat up and all that stuff. So like, trust me, I get it. But what I’m saying is, I stand by like Dave Chappelle is a comedian. He’s gonna make funny. That’s what happens. It’s why you don’t sit in the front row at a comedy club, you’re gonna get roasted. So I don’t come in late for a show. You’re gonna get roasted, as I did. Anyhow, after this attack, Dave Chappelle, he made a joke. He says, It was a trans man. It was a joke. It was clearly a joke. He used inflection to indicate it as such, at this comedy show, where he was performing jokes, but of course, this triggered all kinds of stuff. And now he’s in trouble again, with LGBTQ because they’re like, Oh, this is so whatever. was kind of like, I don’t know, like the guy literally just almost got killed. It’s trying to get the show back on track. It’s tough. Now there were claims that Isaiah lead the get the perpetrator here, was part of the LGBTQ Q community. And I couldn’t confirm it, but I swear I saw a tweet of him calling out Dave Chappelle. He had commented on a post back when Chris Rock got slapped by Will Smith, and he said something to the effect of Dave Chappelle your next for implying for the comments about the community. Right. Well, Rolling Stone, they’re on it. They already interviewed Isaiah Lee’s brother, Aaron Lee.\n\nI’m gonna read you from Rolling Stone. Lee’s brother Aaron Lee tells Rollingstone that Isaiah has been in and out of shelters in Hollywood, California for much of the last decade, and has lots of friends in the transgender community. Still, Aaron doesn’t believe his brother would lash out as an act of activism against Chappelle, who recently drew ire from the LGBTQ community, for jokes about trans people. I don’t have anything. I don’t have anything negative to say about Isaiah. He’s a performing artist who tries to stay as positive as possible. He does have a history of mental health issues. He does take medicine. Maybe he missed out on taking his prescription, but he’s not the type to just lash out I don’t understand. And they’re talking Isaiah Lee and they say he rapped under the name, no name trapper and posted a song online two years ago titled Dave Chappelle, misspelled his brother says Isaiah only pick that title to get search engine hits. Aaron says he never heard his brother express any ill will towards the comedian. He does have a connection with a transgender. Yeah, he does have a connection with the transgender community. Aaron tells Rolling Stone, he used to stay at a shelter that helps transgender people. He’s been homeless since 11. He came out to California after our grandmother died and basically was in the streets getting help from different programs in Hollywood. Like my friend’s place. He went to a lot of different organizations out there that helped transgender people. Yeah, it could have definitely been a factor but I really don’t know. I don’t understand how this happened. He’s a gentleman he is kind of a kind humble nice person. Maybe if he was getting picked on maybe he would defend himself but I don’t understand why he would attack anybody that doesn’t make any sense. So there you go. As usual, all roads lead to mental health right? Something our country in America here typically doesn’t give two shits about not are not a strong part of our culture. That’s why you go to better help.com backslash Illuminati watcher to get 10% off your first month. Sponsor I love my sponsors, right sponsoring the show. But I actually feel bad for this guy in some way. Right? This guy might have just been off his meds. And the dude at a very rough go at life. I mean, he was homeless at a level can you imagine? I mean, that’s terrible. That’s tragic. It’s awful and they smashed this dude so hard, his arm look completely broken in half like a like a I don’t know like a broken hanger. Now of course it does give him the right to try and kill Dave Chappelle. What are you doing? Don’t do that. Come on, bro. Not Dave Chappelle. So like, it’s tough man. It’s uh, you know, a lot of people you know, and I love Dave Chappelle. I’m happy, nothing bad happened to him. I don’t think it’s in any way acceptable for this guy to do what he did. And I think if he didn’t have this history of mental illness, that I’d feel a little bit better about him getting just I mean, if you see the photo of them, I mean, it looks like he’s grown a second head, he’s got such a big lump on his head, they kick the shit out of that guy. Which makes me sad, you know, it’s like beating up a mentally handicapped person, in some ways. And look, I’m not trying to defend I’m not saying like, Oh, you should have just, you know, subdued the guy. Like, I know. It’s tough, right? Like he did try to kill Dave Chappelle. So there’s that. But this is a microcosm of life in America. On the one hand, we have this mentally ill homeless guy, who is a danger to society almost killed one of the greatest comedians of all time. And we don’t really do as much as we could to help these people. And don’t ask me what that is. I don’t know the answer to that. And then we have Will Smith, who did a similar I mean, nowhere near the same, let’s be honest. But still, he went on stage and attacked a comedian. And there were two very different responses to these two events on, you know, Will Smith gets a standing ovation. He gets front row seats at the show. But he’s partying, the dance and afterwards. Meanwhile, as other guys catching the fade hard, he spent the few I’m sure he’s still in the emergency room. And, you know, Howard Stern said the same thing. He said the same thing.\n\nHe said, I’m going to read you from Howard Stern. He said the audience the Oscars gave Will Smith a standing ovation after the attack. That’s the truth. It’s on film. It’s not fake news. They didn’t break wills hands, they shook them, and it’s wrong. So very big moment in pop culture history again. Now let’s talk about Isaiah Lee. Let’s talk about no name Trapper this guy. There’s a video he posted on social media with a filter like I don’t know, Snapchat filter or whatever. Showing him. Then it was the same day apparently, before the show, shown him with demon horns. And like a bloody nose. And he’s wearing the same hoodie, right? So in some ways, he showed, I mean, this is being very literal. So bear with me. He showed that he’s possessed by the devil. And he’s got blood coming out of his face, almost predictive programming of what would happen and transpire that night. And was real curious is the track called Dave Chappelle from two years prior? Apparently, I couldn’t confirm this has a line in it that says walk in straight into the bowl, capital B, meaning the Hollywood Bowl, which is exactly where he attacked Dave Chappelle. And he also raps about how great Donald Trump is. And that song. If the lyrics that I found online were correct. Now, if you go to his Instagram, he’s got a couple of these videos, these stories posted. And one of them shows that he goes by this name is a trap on SoundCloud. All right. And he doctored up the photo show he has millions of listens on SoundCloud. And the video says he’s going to tattoo SoundCloud on his face. And none of that turned out to be true, because I found it. It’s a trap on SoundCloud, and there’s not millions of listens. But to be fair, he apparently has mental illness, right. So that plays a role that no one’s really talking about. Anyway, there’s a track on there, there’s several tracks called no salsa, one of them has a photo of a circular weedy board with the Baphomet goat on it. And he’s doing the Masonic triad claw, kind of like looks like the the west coast where the two middle fingers are connected. The Freemason symbol and I found that very interesting. You’ve got this guy with the devil horns showing us the devil horns in the blood. And he previously I don’t know if that’s an actual weedy board he got I don’t know if that’s him in the photo even but the only artwork he had on the is a trap. SoundCloud page, was this weedy board with the Baphomet. Is this guy channeling some kind of demonic energy? Is he attracting dark spirits? This is the same argument we had with Travis Scott Travis Scott. While I don’t necessarily believe Travis Scott wanted his fans to be murdered at his show, I don’t know that he overtly worship Satan. But he sure does employ a lot of the symbolism that suggests maybe that’s the case. Maybe dark forces came down. So yeah, really weird situation going on here with this Dave Chappelle attack. And you know, glad Dave Chappelle is okay. That’s not you know, I’m a big fan of stand up comedy. So I hate that this is happening right now. I hope. This is the last time something like that happens. And this will play into my theory we’ll talk about at the end. All right, moving on. Speaking of Dave Chappelle, we’re gonna talk about dubbed baby. That’s right, the rapper, the baby. And in Dave Chappelle sells, Netflix special, I believe. It’s called the closer from last year, where he made the LGBT comments, right. He had made a comment about how the LGBT community tried to cancel the baby because the baby made a joke. No joke. Today, he made a comment about AIDS implying that I don’t know. Gay people have AIDS or something to that effect at his concert. Not a good comment. not the worst either, right. But yeah, either way, the LGBT community apparently we’re trying to cancel the baby. And Dave Chappelle made a joke, basically implying that that’s pretty wild that they would be so upset that\n\nthey would want to cancel him for making a for making a statement like that. When the dude actually literally killed somebody a couple years prior, which is true, right? And that’ll happen, you know, a couple months ago. And so much has happened ever since with the baby sums up with this guy. He Okay, so So Dave Chappelle brings the light, a thing that a lot of people in the rap community knew about, right? The story is that the baby was at Walmart, someone came up to him, I guess, threatened his life in some way, the baby pulls out a gun shoots and kills the guy in Walmart, the baby gets, gets off the hook with a self defense plea. Since then, the video of the actual altercation leaked online of this guy, quote, unquote, attacking the baby. And if you watch the out of context, sort of video doesn’t seem too out of context. It appears that the guy goes up to the baby and is just talking to him. And the baby just kind of like tackles them. And they get into a skirmish. And I didn’t see the baby actually shoot him that I guess that happens on a different angle. I don’t know. But it really made it look like dude, like that wasn’t what he’s what was said that wasn’t self defense. And apparently, the jury saw a different version of the video because if you watch just that video, you think, wow, that didn’t look like self defense at all. But you know, judge and jury looked at it, they apparently claimed that that’s how it went down. But it was just real weird, because this is something that happened several years ago of like, maybe four years ago. Then a guy about a month ago, was trespassing on the baby’s property in North Carolina. And the baby shoots him, he shoots him he didn’t kill him, right. And he again, just got like, I guess off the hook for self defense. Okay. There was also a video released of the baby and his crew at a bowling alley beating up this guy who was his ex girlfriend, Danny Lee’s brother. And when you watch that, and again, probably out of context seemed like a pretty unfair fight. There was like eight dudes, including one massive dude, kicking the crap out of this. This one dude, Danny Lee’s brother, right? But again, no clue what the full context is. Then, because if there wasn’t enough then a video releases of a music video shoot of the baby and his crew at like a mansion with some fancy cars right there shooting music video. And the video shows this old white man coming on the set and the people in the baby’s crew kind of shoving them like pushing them around a shovel into the ground or something like that. And And you’re watching you’re like, geez, what are they doing, man? That’s an old man. What are you doing? Chill out? Well then if you wait a few days afterwards, they released another video. This old white guy was apparently I guess it was his house or something. And I don’t know if he rented it out or whatever. But he was screaming about calling these guys the N word. So you’re like, oh, okay, well, maybe you deserve that. Oh, man, and then finally, rapper call boy. He called out to baby called him an industry prostitute, implying that he had no ethics or morality of who he’d worked with criticizing how the baby worked with Tory lanes after he shot Megan the stallion and I guess making the stain the baby are supposed to be friends. I don’t know the drama there, whatever. But the sun’s going on there. And that’s all I really want to say about that. I don’t have any occult symbolism for that. I’m just saying something weird is happening with the baby. There’s forces trying to cancel them and then counter cancel them. Who knows? Moving on to welfare, your biggest topic here? Met Gala. 22. So the Met Gala, right. This is a fundraiser held at the Metropolitan Museum of Art in New York City, the world’s most prestigious fashion event. And as it’s hard to get an invite, apparently, right. Goes down the first Monday of every May. And there’s a theme every year and we’ve talked about this Met Gala ball every year. Well, 2022 theme was the Gilded Age. Now the Gilded Age\n\nis the period after the Civil War, but before the First World War, so we’re talking like 1870s and 1910s ish, which I thought we call it the Victorian era. I don’t know maybe that’s an American term for when they say the Gilded Age, not a historian. But the term Gilded Age was coined by none other than Mark Twain. Now Mark Twain was a Freemason. He was a master mason. Okay, now, there’s only three degrees in masonry. And I know if you’re new to the whole, it’s very confusing with the Masons. Because there’s different flavors of Freemasonry, there’s independent lodges all over the place, each one’s different. But in general, Freemasons have three degrees, there’s the they get initiated into enter apprentice, passed on to fellow craft, and then raised to Master Mason, that’s the highest order the third degree, that’s what Mark Twain was. And each one’s got their own little secret handshakes and all that stuff. And that’s the basic structure. And you have to distinguish at that point, which club you want to join, you’ve got the York Rite, which gets you up to 10 degrees, and then you’ve got the Scottish Rite, which goes up to 33 degrees. That’s the one you hear about the most often that’s, you know, we’re talking about speculative Freemasonry. Okay. This is where you get into all this weird, allegedly Luciferian belief systems. Now, the Gilded Age, is described as an ironic comment on the difference between the true golden age and their present time, a period of booming prosperity in the US that created a class of the super rich, as the American Museum of Natural National History says. Basically, it’s when the American capitalist took over we had the industrial age. And of course, when you talk about conspiracy theory, we’re referring to the Rockefeller family. Yes. This is the American branch of the suppose it Illuminati. You know, because Europe’s got the Rothschilds on lock when the Americans got the Rockefellers now gilding, the term itself is when you make something appear great when it really is not. All right. So you guild something by putting gold leafing on it, even though it’s not really solid gold is a full Daisy. Right. And that was the theme of the Met Gala ball this year. Now symbolizes a couple of weird things to talk about. We need to talk about Kim Kardashian. Shut up with a booth tag Pete Davidson. He looked like he was dressed up like a Blues Brother. But she was wearing Marilyn Monroe’s actual dress. Yeah, that’s right. I’m gonna read you from TMZ Kim says she passed on carbs for weeks. And you can hear in her voice how she’s been longing for a slice or to refer to pizza. Trigger warning all my QA non pizza folks out there. She’s eaten the pizza. All right. I gotta take a jab at my QA non people. I love you guys. Kim said she had to lose 16 pounds to squeeze into that dress. The same one Marilyn Monroe wore six decades ago when she sang her sexy version of Happy Birthday to JFK. So many questions. How to Dress last that long? How do you preserve and maintain a dress for that long and then decide you know, which like Kim Kardashian wear it? What? What kind of Illuminati backdoor going on here? She’s been hanging out with Jeff Bezos so connected. Kim has been hinting at wearing a dress for some time. First, she said she couldn’t tailor her outfit. Then she and Pete were spotted leaving Ripley’s Believe It or Not Museum in Orlando where the iconic dress is on display.\n\nAnd it says that she actually put the dress on for a very short time. But then had to get into a replica of the dress for the rest of the night. Like she can’t be, you know, drinking malt liquor or whatever they do at the Met Gala. I don’t know what they do with Marilyn Monroe’s dress. Oh, man, but things get really weird things. Really weird things surrounding this whole event. Shout out to Brie Luna for the drop on this the Shade Room said Kim Kardashian was actually gifted some of Marilyn Monroe’s actual hair. And you got to hear what she says about it. Take a listen.\n\nUnknown Speaker 42:01\n\n Okay, this is either really cool or a little strange, but that’s who you’re doing business with. Right? So what is this I was Maryland’s here can call on her. Oh my god, I’m literally going to do some crazy Buddhist shit.\n\nUnknown Speaker 42:23\n\n And I channel her selves. Me. Thank you so much. This is so cool. So cool. Goodbye. Wow. This is sleeping with me every night. Sorry.\n\nIsaac Weishaupt 42:39\n\n Did you hear what she said? She said, I’m going to clone her. She says I’m literally going to do some crazy voodoo shit. Now this adds a lot of fuel to the fire of the Kardashian witch theory that I wrote about in a book called conspiracy theories and unpopular culture. It’s a sort of self titled book, right based on some of the most popular episodes of this podcast. And the Kardashians. And I don’t remember if I actually did the show about the Kardashians, there’s a few bonus articles in there. There weren’t on the show. I’ll tell you about it though. The claim is that the Kardashian family the clan if you will, comes from a bloodline of witches. Because they have this weird tendency to drive all their men insane, which is very strange. I mean, they don’t really have a good track record of this. None of them, right. I mean, look at Kanye. He’s this latest in a long string of strange men involved with the Kardashian clan. Now the argument here when she says she’s gonna do some voodoo stuff. The argument I will float is that this does support the theory that the Kardashians are witches because she apparently knows something about sympathetic magic. Which is something we spoke about. Many, many years ago in a book I wrote called sacrifice magic behind the mic. We talked about this kind of magic how some celebrities and artists practice it. Allegedly maybe artists like Kashia she was keeping her fans teeth and hair. Madonna was paying someone to scrub her rooms for any of the DNA she left behind shout out Freeman fly. This is also called contagion magic. In fact, we talked about Left Eye Lopes from TLC at pretty good length in that book. And the story of Left Eye Lopes she was down in Honduras is doing all kinds of stuff. I don’t know if she was seeing Dr. SEBI, but she was practicing all kinds of weird occult stuff. She was in the van that was drove on these roads and craned this kid and killed killed a young boy while she was there, right. And she held on to the dead boys shoes. And she talked about how these dark spirits that they were coming after her not the boy she’s like I feel the Spirit coming out from this video. This is their whole documentary because they were filming this whole experience. Little did they know they would film her actual death and the belief here is that the material world object links to the ether this goes into the hermetic axiom as above so below goes into the law of correspondence. And that’s what a lot of this stuff is based on is a lot of this stuff that goes back to Thoth and and Egyptian magicians and all that stuff. So when Left Eye Lopes is holding on to the dead boy shoes, there’s a sort of energy connected to that is the argument. And it’s actually the same magic you see with voodoo in the voodoo dolls. Right, you know, the Voodoo Doll they, the witch or practitioner will put a pin in the Voodoo Doll and the person will feel the pain. That’s the idea. And these voodoo Jedi masters, they will even take a lock of hair and attach it to the Voodoo Doll. It adds power to the magic that happens there with the sympathetic or contagion magic. So Kim Kardashian said she was gonna make a voodoo doll. It’s gonna do No, she said I’m gonna do some voodoo stuff with this right? Very strange. Her mom oh, by the way, I’ve got a lot of Charles Manson hair. Fun fact. I gotta look at Charles Manson’s hair. My dad had. This is a long story. My dad was pen pals with Michael channels. Many years ago back in the 80s and 90s. And I guess they were friends on some level. I don’t know the details. I’ve actually I was in contact with Michel channels before. Seems like a nice guy. He’s the guy who suppose at the time, there was a beef over the estate of Charles Manson and Michael channels was in the running for\n\npossession of the body or something like that. Anyway, my dad had a ton of this man so so when my dad died, that was my inheritance. I got a bunch of Manson murder abelia. I know I’m a weird guy. Right. But that includes a lot of Charles Manson hair. So I couldn’t make a voodoo doll for Charles Manson if I wanted to. Now I actually was I tried to get it. I tried to send this because it’s like a framed thing with a bunch of stuff in it. Guitar Pick a bunch of his writings. He wrote like this poem. What else is in there? There’s a bunch of stuff. And I tried to see if the what’s it called? In Hollywood? The Museum of death? I think it’s called. I tried to see if they would take it on a lease. Like look, this is all I got from when my dad died. I’m not trying to sell it. I’m not trying to give it away. But I will gladly give it to you on like an indefinite lease that if I ever someday down the road. So you know what, I need that back. I can come get it. But as far as I’m concerned, you can just have it forever. And you know, whatever. They wouldn’t do that. They will only buy it which I get right. There’s some legalities there and then I tried to get Zak Bagans to take it for the Haunted Museum in Las Vegas. I guess they’re not interested. I don’t know. It’s it’s really interesting looking. Anyhow. Kim Kardashian is mom Kris Jenner. This sounds crazy. What are we talking about? Kris Jenner wore a dress that looked like Jackie Onassis. While Kim Kardashian was wearing Marilyn Monroe’s dress which obviously, you know, the connection there. And all of this is so strange, because of course, the conspiracy here is that Marilyn Monroe was killed for her relationship with the Kennedys. She was allegedly bang and JFK and his brother Bobby RFK. She did this birthday song in a very sexy dressed JFK. And Jackie Onassis. You know, JFK, his wife she’s home watching on TV like this triflin has been it’s doing an awesome job guys. I he broke up with me as I look. You are not too subtle. You got to go away. You got to be like that. But Bobby, he also was a little concerned. And he He apparently visited Marilyn at some point after this, and to ask her why she was so trifling about it. And that was the same day that she overdosed on medication because she died three months after singing the song. And look, I’m no conspiracy theorist. But I believe that all is not what it seemed with that one. And Netflix just happened to drop this series The Mystery of Marilyn Monroe the unhurt tapes. I have not watched it yet. It’s on my list. I gotta get through the John Wayne Gacy series first. And it goes into the conspiracies of like how the intelligence agencies were looking into Marilyn Monroe’s connections to Communist Cuba perhaps some think that the FBI had cleared her house before they let the police into investigate because they knew that there was all this Kennedy stuff in there. Some say that she did commit suicide Some say it was an accident and overdosed some claims you didn’t even die Some say that she didn’t die in the house she died in the ambulance sometimes you died in the hospital which would be curious right because that’s our Princess Diana allegedly died she was in the car accident the pump down the tunnel they kept her in there for like an hour and then put her in the ambulance and drove around extra long and apparently she died in the ambulance very strange say she died in the tunnel they that’s what I think David likes theory was that she actually died in the tunnel because the pond down the tunnel means passage of the moon goddess and Diana of course is the name for the moon goddess. And then years later Selena Gomez would Selena also being a name for the moon goddess would be depicting herself as Princess Diana driving in the pond down the tunnel oh my god I don’t remember which video that was covered it back in the the golden days of the Illuminati watch her.com blog back before it got the big lawsuit the Take it all down I’m gonna use that every day on my show. Big martyr Isaac wise hop really trumping it up but you know I’ve had to pay the money so and then added takedown years of work so I’m going to play it for everything it’s worth.\n\nAnyway, Bobby Kennedy he was the attorney general so he was able to control the FBI so who knows what’s true with all that? Okay, going back to the Met Gala, who else was there? There’s not a lot going on with people wearing crazy stuff. Usually there were all kinds of crazy stuff. Kid Cudi showed up looking like blue Dracula. Elon Musk tried to look like a normal human being showed up his mom may musk. And you know she’s illuminate confirm as much as they can. She’s buddies with Beyonce did tons of symbolism in the fashion industry. Oh, and by the way, Dave Chappelle, guess who was in the front row? We’re finding out in the front row was Elon Musk, Beyonce and Jay Z. What do you know? Now a lot of people on social media are sharing an image of Elon Musk wearing a coat of white coat. This is Novus Ordo Maclaurin, but if you look very closely, he’s there Rick Grimes and he doesn’t he’s not dating Grimes anymore because that photo was back in 2018. Just want to clarify for the record that was not in 2022 doesn’t take away from the argument. lugga I stand by Elon Musk is not the savior. He’s not going to buy Twitter and make it great for you. I promise you. He’s not the guy. Anthony Ramos. Spotted doing the man Oh core nudo lots of guys wearing blouses and dresses Phineas Eilish, Lenny Kravitz, Jordan Roth. Well, what I want to take a minute to examine and to do a little mini deep dive into is these performances that happened on the Egyptian stage. Lenny Kravitz, Kacey Musgraves who did an Elvis Tribute because apparently there’s a biopic about Elvis coming out this summer. That should be interesting especially because me and Josie Weishaupt are doing a account that not account down a list of all the perverted pedo musicians. And of course Elvis made the list. So interesting to see what they how they depict that. Now that’s on breaking social norms. If you haven’t listened to brain social norms, check it out. You’re gonna love it or you’re gonna hate it, not the same shelf. But it’s a good time. Now, what’s curious is that these artists at the Met Gala they performed in run because it’s a museum right? They performed in front of a an Egyptian ritual chamber, the temple of Dendur. Sounds like a game of thrones scene. If you go to the mat they talk about I’m gonna read you a bunch of nerdy stuff about it real quick. In ancient Egypt, temples were seen as residences for deities, who were thought to temporarily manifest themselves in the cult statues located in the sanctuary. The temples were also the stage for daily rituals that were ideally performed by the Pharaoh, but in practiced by priests. These cultic performances included the offering of food and beverages as well as the burning of incense, which was thought to have a purifying effect. The inner rooms of the temple were restricted to those performing the rituals. During religious festivals, called statues can be brought out of the temple at dender. They were likely carried out onto the spacious called terrace enabling the public to feel closer to their gods. Do you see the parallels here? The gods those are the pagan gods are celebrities. That’s the new pagan gods. According to ancient Egyptian mythology, mythological concepts, the creation of the world was thought to be renewed inside the temple and the building itself was regarded as an image of the natural world. In ancient Egypt, depictions were thought magically, to become real. The temples decoration, thus not only guaranteed the performance of rituals, but also the continuation of the natural world and cosmic world order. Oh boy. So we’re talking about the powers of magic through an actual Egyptian temple. And if you know anything about hallucinogens, set and setting are very important. So to have our new modern day pagan gods performing in front of an actual Egyptian temple, they thought magic could manifest the reality of a new world order. That’s what this is all about. That’s what all these celebrities are doing all the time. Now, that’s and that’s a good segue into Coachella at Coachella 2022\n\nwhich occurred over over the Christian holiday of Easter. Pick your path which one do you want? They had onstage Moloch Yes. Moloch. With the horns. I got the I’m gonna put the image on the Instagram at Isaac Weishaupt Legrand subscribe link in the show notes. Check it out. Right at the time of Beltane. The big sacrifice night. Right? That last week of April beginning of May that’s the time for the sacrifice of Beltane. The fires the ball Tane B A L which is the same as Moloch in a way, right. Shout out to swervy Cadet on Instagram tagged me in a video by Tommy truthful TV talking about this. That’s how I found out about it. I just wanted to give my proper shout out to the person that dropped it on there. Now lots of people weighing in on this saying oh, that’s Bohemian Grove. And not quite good. Bohemian Grove was an owl and the owl is Minerva or Athena the goddess of wisdom. Moloch is the deity the bull that they used to sacrifice babies to? Yes, the blood there’s the peg and God of the bowl Moloch or ball shows up right at ball chain. Down here we’re sliding into this pagan New World Order. It’s coming soon now. Finally. It’s just the last thing yeah, there’s the last thing we’re gonna talk about. And then we’re gonna wrap it up. Machine Gun Kelly and Megan Fox. Drink at each other’s blood but it’s not what you think. It’s not what you think is for ritual purposes. Come on, guys. Take it easy. I’m gonna play a clip for you. Take a listen and see what you think I heard you on the other side.\n\nUnknown Speaker 59:43\n\n My exact physical type that I’ve been manifesting since I was four also four years older than him. So I think I made him my thoughts and intentions grew him into the person that he is who knows what he would have looked like or been like if it wasn’t for me. I guess it drank each other’s blood. My mislead people are like people are imagining us with like goblets. And we’re like Game of Thrones during each other’s what? It’s a just a few drops. But yes, we do consume each other’s blood on occasion for ritual purposes. Only. It is used for a reason. And it is controlled, where it’s like, let’s shed a few drops of blood. And each drink. He’s much more haphazard and hectic and chaotic, where he’s willing to just like, cut his chest open with broken glass and be like, take my soul. Lean on you. It doesn’t not happen. Let me tell you maybe not exactly like that. But it a version of that has happened. And many times,\n\nIsaac Weishaupt 1:00:41\n\n no, I intentionally left the beginning of that clip on there. Because for bonus points, she also talks about how she gets into a bathtub on the new moon. Yes, it’s witchcraft protocol. Should I cry often every new moon usually I get in the bath and cry a lot. And we talked about the symbolism of the bathtub many times before. Ironically, Kim Kardashian was put in the bathtub when she got robbed in Paris. And that’s when, when Kanye West had the breakdown because he knew the Illuminati was after her. And oh, boy, if you go to the the Glamour magazine, photo, the cover, you see she’s doing the the hidden hand on the cover, you know, when the Masonic thing where they put their hand inside the coat, she’s actually doing the hidden hand a little bit. And we talked about, and here’s the thing, we talked about all this back in January, when Megan Fox and Machine Gun Kelly posted on Instagram, they got engaged in January and I did a whole show. And we we talked about all of it. She said, just as in every lifetime before this one and as in every lifetime that will follow it. I said yes. And then we drank each other’s blood. The interviewer says, Did you actually drink each other’s blood? She said, Yeah, I guess to drink each other’s blood might mislead people or people are imagining us with goblets. And we’re like Game of Thrones, drinking each other’s blood. And you heard the rest, right? So her post was saying that she drank blood and I did a whole show talking about all this occult stuff, and the Goddess Kali and all this stuff. And a lot of people thought I was really stretching. And I’m gonna really break my arm pat my own back, but I was not there literally drinking each other’s blood. And like we’ve talked about blood drinking at great length. In fact, just recently in April, we did it right. Two of the bonus shows, were dedicated to this whole topic. We did a film analysis of the film on Hulu called fresh. It’s all about cannibalism and drinking blood and Satanism. Then we did a book club on Kurth Barker’s book, cannibalism, blood drinking in high ATAP Satanism we cover this thing from top to bottom already. We talked about it with the most recent TMZ episode where we talked about Dua Lipa and Meg the stallions music video, this was called the sweetest pie or something like that. And strangely enough, if you look at the roots of vampire ism, this goes back to the anti vaxxers. Right? Way back when they had the, you know, smallpox vaccine, and these early anti vaxxers, they thought that the vaccines would disturb the natural balance of the blood in the body and this would create inadvertently vampires. And it goes back even further to you can go back to Elizabeth Bathory is probably the well most well known person to consume blood sacrificing, folks should take a bath in the blood. And I’d argue she was depicted in hostile to there’s a scene where a woman gets to the bathroom and they slice a woman’s throat and fills it with blood she bathed in it. I mean, this stuff isn’t necessarily hidden at all. When you consider vampire facials and blood transfusions to try to stay younger and all this stuff. They don’t necessarily hide it. It’s real stuff. Now why would they drink each other’s blood? Could be like when we talked about trying to forget which episode it was the Chris Barker episode we talked about Marilyn Manson and I’m drawing a blank see you go past an hour my brain gets mushy. The Evan Rachel Wood. Oh my god. She was in Westworld. Right? Well, she released a documentary and talked about how her Marilyn Manson would drink each other’s blood. Same thing, they’re all into this stuff. And then also one last little bonus. As she also said at the beginning of the clip that You know, I screwed up. The bathtub comment is not on the clip. This is the comments at the beginning of the clips, so you don’t think you’re going crazy. It’s me going crazy. She said, He’s literally my exact physical type that I’ve been manifesting since I was four. I’m also four years older than him. So I think I made him my thoughts and intentions grew him into the person he is. She thinks this crazy chick she thinks she manifested. She thinks she manifested Machine Gun Kelly into existence. What is happening with these folks? We, though we talked a ton about Magnavox as a call language back in January, I don’t need to be the dead horse.\n\nLet’s wrap it up. In conclusion, and we didn’t even talk about Johnny Depp and Amber Heard. That’s next. All right, I’m going to break down to you all of Johnny Depp strangeness, because I’ve got I wrote a small little book about Johnny Depp and it’s on my Gumroad store. So when you’re on there buying your shirts, you can buy a little, little, little booklet I made a little PDF about Johnny Depp and all his Illuminati symbolism, right. And, and you don’t have to do all my next show. I think I don’t know how I’m going to do this yet. It might be a bonus show might be my next show. We’re going to talk about Johnny Depp. I’m gonna talk about all this symbolism He’s given us over the years. And a lot of people they want me to talk about the Amber Heard Johnny Depp trial, and I’ll be honest with you, I haven’t followed it. That’s too damn much following of celebrities for me. I mean, I how long this has been going on how many weeks are they talking? I catch little sound bites here and there. It sounds very entertaining, very humorous. In fact, I know you’re very interested in that topic, because I made a post on my Instagram. And it became like the most controversial thing I’ve ever posted. People are really upset with me. Because Amber Heard, I guess she had to write down all the sexual partners she had or something like that. And she wrote down Elon Musk, of course, because she was with him for a while. And she called him a moron or something on the thing, and I was like, I love that because I hate him. I don’t like Elon Musk. I don’t like his ass. I don’t trust him. I think he’s part of the agenda. There’s nothing to trust about that guy. And I made it. I mean, granted, I troll a little bit so I get what I deserve. But I made a post and I was like, You know what, um, Team Amber Heard again? Because I like that. She talked so bad about Elon Musk. And a lot of people got upset, like, how dare you? I like man, like, I don’t care. Neither one of them are angels. They kind of get what they deserve on some levels. But again, I haven’t paid attention. I’ve no idea. I know. She took a dump in his bed. I’m not team Amber Heard. I’m definitely not team Johnny Depp. Although he just seemed like a pretty cool guy. I’ll give you that. He comes off. Kind of like he’s a cool, dude. I mean, it’s hard to be mad at the guy, but he’s given us so much Illuminati symbolism over the years. I think he’s illuminate confirm. But that’s next week, in conclusion of today’s show. I’ve been doing this for 10 years. All right. And I can tell you, with the Isaac Weishaupt certified stamp, without any uncertainty. This is an extremely abnormally high amount of activity for this strange realm of celebrity ism with the occult. That a term celebrity ism, what the hell is happening in our world? I can tell you, and you know, because the last few episodes of The TMZ thing. I have to tell you the day that I’m recording it. That’s not something that’s typical. I have to tell you, Look, this is the day I’m recording it because by the time you listen to this, this might be old news. There’s so much happening and I got a thing. This is my theory. It’s one of two things. One, it’s revelation of the method Halina, Bill van ski and Aleister Crowley. Were all about revelation of the method back in the Gilded Age. How ironic back in the Gilded Age. The the well, I’m trying to think of the term sciences the method religion is our aim, right? The occult sciences are being demonstrated. Megan Fox talks about drinking the blood, for example, to babies sacrificing humans left and right known stuff was happening. It could be this has always been the plan. It’s like that meme from interstellar always has been. Then the other theory this is the one I said was scary. What if This is the virus, the pandemic, not gonna say the word. It’s not snake venom. It’s a brain virus. It’s a neurological virus. That’s why everyone freaked out. It was cooked up in an LA be there, they all knew what this really was. That’s why we’re never gonna get a straight answer on what it really was or where it came from. It’s meant to attack our minds. Everyone’s losing their minds. Everyone’s resigning from their jobs. Things are wacky right now, right?\n\nI mean, why you don’t, for all the people that are just a cold that crowd right? It’s not just a cone, people are losing their sense of taste and their sense of smell. Colds don’t do that. This is attacking the brain. There’s a reason they’re doing this. I haven’t got what I got COVID in January, I just said it. Darn it. Well, it’s nice knowing you guys. Illuminati, watchdog calm, go to the VIP section. That’s the last place you’ll catch me. They can’t ban me from that. That’s my own shit. Anyway, I even when I caught the thing back in January, I sunk into a depression and I’m still not out of it. I still don’t feel like myself. In fact, I’m going to do a show about ketamine therapy, because I’ve done several sessions of it, and how to do a booster hadn’t been in there in a year. And I had to do a booster. And I talked to the lady not even putting this all together at the time. And I said, Hey, I don’t know what happened. I caught the thing in January and I just never snapped out of it. I just don’t feel good. And she’s like, oh, yeah, like we’ve seen a ton of people relapse right after they get the thing. They end up in here to get a booster. Because in ketamine, so in ketamine therapy, it’s long story short, it’s it heals pathways in the brain, if you got like depression and anxiety, you know, all that stuff. I’m not advocating for it. It helped me but you know, I’m also very skeptical of a lot of things. Very strange experience, and I’m going to talk about that on an episode. I don’t know if that’ll probably be breaking social norms. That’s more for that show. Anyway, that’s my theory. I think maybe this this virus is a Zombie Apocalypse Virus. A lot of people were connecting the Will Smith I Am Legend thing to it, which maybe explains why he lost his mind. The slap Chris Rock people are losing their minds everywhere. What if this is the beginning of the end that we just slowly devolve into like crazy. Vampire people or something? Like I said, terrifying theory. I have nothing to base that on besides observation. I hope I’m incredibly wrong with that. And that’s all have a great day. That’s all I got. I know what a way to end the show, right? What’s a better way to end the show? What can I sell you? Let me plug some stuff, you know, go to the Gumroad stored and you get the shirts. While you’re there. Get your little Johnny Depp PDF ebook. It’s not available as a real book. As you know, it’s like 50 pages or something. Mostly pictures. You could also make sure to check out the Instagram post you gotta follow me on Instagram at Isaac wise hop. Link is in the show notes or you can go to all my links.com backslash Isaac W that has links to everything, all my socials and everything, even Spotify, where you can get the Boehner jams playlist, so great. You can check out those these posts and these images on my Instagram. You won’t regret it liking subscribers. I got lots of stuff. I always post on there. I do Instagram Live sometimes you’re gonna love it. It’s great. Okay, folks, thanks for listening. Until next time, stay well.", "opengraph": {"locale": "en_US", "type": "article", "title": "TMZ: Met Gala, Coachella Moloch, MGK Megan Fox Blood, Die Antwoord, Chappelle, DaBaby & Mike Tyson! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we get a heavy dose of celebrity-occult symbolism with our TMZ Illuminate Confirm show! We’re going to hit on all of these topics: Ghislaine Maxwell, Mike Tyson on hunting humans, Die Antwoord allegedly abusing their child, Dave Chappelle getting attacked (as well as some […]", "url": "https://illuminatiwatcher.com/tmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson/", "site_name": "IlluminatiWatcher", "article:published_time": "2022-05-09T08:51:51+00:00", "article:modified_time": "2022-05-07T15:52:33+00:00", "image": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2022/05/CTAUC-tmz-May.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["Met Gala symbolism", "Chappelle attack", "Alien", "conspiracy", "Coachella Moloch", "Mike Tyson illuminati", "celebrities", "UFO", "die antwoord illuminati", "MGK Megan Fox Blood", "illuminati", "occult", "ufos", "transhumanism", "DaBaby illuminati", "symbolism", "aliens", "symbols"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.instagram.com/isaacweishaupt/", "https://illuminatiwatcher.com/the-hunt-film-analysis-cia-in-hollywood-animal-farm-and-the-liberal-conservative-dance/", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://amzn.to/3j3UtZz", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/49702882", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "http://BreakingSocialNorms.com", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/tmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson/?share=twitter", "https://illuminatiwatcher.com/tmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20TMZ%3A%20Met%20Gala%2C%20Coachella%20Moloch%2C%20MGK%20Megan%20Fox%20Blood%2C%20Die%20Antwoord%2C%20Chappelle%2C%20DaBaby%20%26%20Mike%20Tyson%21&body=https%3A%2F%2Filluminatiwatcher.com%2Ftmz-met-gala-coachella-moloch-mgk-megan-fox-blood-die-antwoord-chappelle-dababy-mike-tyson%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2022-05-09T08:51:51+00:00"}