{"result_id": "165045", "URL": "https://illuminatiwatcher.com/9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more/", "timestamp": "2023-04-25 15:36:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "9/11: Occult Ritual, Symbolism, Numerology, Predictive Programming and more!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we talk about 9/11! We’ll cover the occult symbolism, predictive programming and some ideas about 911 that may be new to you. I’ll also share where I was on 9/11, which may also surprise you.\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “9/11: Occult Ritual, Symbolism, Numerology, Predictive Programming and more!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\n911 the day the world changed the day where they told you nothing would be the same again. And boy, were they right? Boy were they on the money. How did they know? How did they know a simple attack on American soil would change the world forever? Well, today we’re gonna do something a little different. I don’t know how close you’ve been following the show. But I’ve been assembling and preparing a show a massive show on 911 which I will forewarn you That is not what you’re getting today. But I would be remiss if I didn’t give you something for 911 to celebrate the big 19th anniversary of patriot day. But I will be on the 20th anniversary on 2021 giving you a mega show. Some of this material will be rehashed. Some of it will be new, some of it will be elaborated on a little bit better. So what I’m going to give you today is more of a rough notes outline of some ideas that you’re going to have more of a teaser, if you will, for this show we’re gonna do in 2021. So that’s what we’re doing today. So we’re gonna do, yeah, so what are we gonna talk about? Today, we’re gonna talk about 911. And at this point, there may be some of you that don’t remember it. There might be a lot of you that don’t remember. We’re going to talk a little bit about it. Obviously, you know what happened. We don’t need to go through all those details. We’re gonna talk a little bit about the symbolism, the occult perspective of this whole thing. And the reason I’m doing this show this year, this is a rushed job here. This isn’t my typical work. The reason I’m doing this show is because 2020 is showing us the evolution of the agenda. And this all started on 911. We’ll talk some of the conspiracy theories about it, who was behind it and what the theories are. But then we’re gonna wrap it up with some occult perspectives, which is where that’s where more of my forte is. Alistair Crowley, numeric symbolism, Boaz, Jackie and all this stuff you know about if you’ve listened to me for some time. Now, before we do that, we are going to do some Patreon shoutouts. Yes, if you’re on the tier two for the Patreon team, you get the shout out, this is our time to do it. And let me tell you this list is huge. It’s huge, because we did the big special offer book promo for user illusion, one which I will be publishing on 911 in some form or fashion, I do have to submit this book. So let’s go through the names. We got a lot of folks on here. We’re gonna blast through this. Shout out to Eric new new to the tier two team We’re a lot of new to the new to the tier two teams. We got Eric, Vermont hip hop collective, Joe sauce, Laura. Or Suzy is it Laura? Suzy? Jorge, what may be Jessica believe Chris. Keisha. Oh and by the way, I’m gonna butcher half your name so if you got if I don’t pronounce it correctly you let me know you’re sliding them messages and let me know. Daniel What’s up? Daniel g i should say there’s a lot Daniels on the team leave Andre Renata liberation cap Dre dropbear\n\nZack so yeah, we got we got some tier three folks in this list too. You know, tier three gets all the tier two perks plus you get some cool extra stuff. Some live streams, you get some dogs barking Joshua, what’s up man? Russell dragon, shimmery fire Dane Chris. That’s Chris with Chris G will say Austin see Ramona Frankenstein. What a crazy last name that is. Elena. Beautiful chaos brand. The dogs are trying to provide a shout out to Brandon are Julian M. Jason, Lewis, Rosa, Linda, Southside Taro Sarah be Iraq. Like a Camaro Iraq, Darrell I pronounce it Darrell. Oh, you know who you are? Brandon C. Raman D if you wonder why don’t say the last name it’s cuz you know, most of you guys are smart enough to try to distance yourselves from this\n\nNatalie Trey Hey yo, what’s up Jacob? Samuel Allen C. Sammy P. Jodi Frank l Feel good rich art What up man? He’s over there surfing, painting, surfing and painting at the same time. Eric M.\n\nbuilt Well, I don’t know what the first name is. It’s a lot a B. B Derrick. Alexander Kaye sues w Christina ah on that big tear three. Jinx subjects Tyler. Tyler be on that one there. And now to move on to moose. Not a moose, not a moose francy Jennifer Betty Thomas P. Dawn P. Tour s Elizabeth. Cheryl s what’s up Cheryl aneesa be very w very web by the books, saying some books. I think if I’m not mistaken, Roxy Roxy Leslie Curtis Wild going on Kurt wild Cristal de engi Jana P. Brian Ashton. Ashley G. Kelly see Gary. Gary Gary K. Jade M. Ali, Omar renay, Brandon and Neha cc Ryan, Brandon Lord. Brian be the road cast podcast. How’s that pod guys going there? Penny Roach.\n\nalready went over that day we got a couple of ozone areas. Okay.\n\nDavid w m gib Kimmy g Gabby. Matt em on that tier three. Leslie be on that tier three signorello bolsos. Matteo will see holding it down. I will see you at home that a long time. D’Arcy D Either it doesn’t hold down long time Darryl. Hold on is it these are my holder downers down here on this list. Allison s Jeff W. So Jordan. Oh 101 I got binary code. What does it mean? I used to know that kind of stuff. Robert S. Whitney B profit seven. Heather Denali. Ji Well, you guys have been on this team a long time. He’s the Oh, these are the these are the Mego G’s Jade, pragmatic chick SPG Daniel song Taylor. Taylor’s been holding it down for a long time tier three longtime triple Oji alexandri Ah, Melissa. Big physique. still hold it down. Katie and last but not least j po in the house. Thank you for your support. That’s your tier two shout out for September. I appreciate all your support of every Patreon support. You guys are really making things happen over there. I appreciate you so much. You’re keeping the show going. And if you want to join the team patreon.com backslash Illuminati watcher. Now let’s get into the show. Let’s get into the content. I know it’s what you guys want. We’ll talk about 911 I want to talk about it too. I want to talk about it too. I got all kinds of stuff to talk about. So let’s just get into it. Right? Where were you? Where were you when the towers fell? Isn’t that what that old country boy sang? I don’t know. I wasn’t a country music but I’ve recall there being some country music making the rounds after 911 some movies. Because that’s what we do here in America. Celebrate these tragedies make some parades, maybe I don’t know. We’ll see. You know Patrice O’Neal did a great little joke about it. You can look it up on the YouTube recipes. Patrice O’Neal, one of the greatest ever do it made a great joke about it. He said and I’m gonna paraphrase and butchered at the same time. He said roughly in 10 years this is going to be a hot dog eat and parade holiday And that’s probably coming right? It’s gotta come right. When it used to be a very solemn day for at least 10 years, I would say. very solemn day. I don’t know where you were where I was, I was in South Korea defending this great country of ours. It was like three in the morning or something over there. I don’t know it was middle the night because I was sleeping. I had to get up early because I was the doing guard duty at the end the bomb dump there, right. And so I had to get up before everyone else and I don’t know, four in the morning, five in the morning, whatever time that was. And then go walk. Walk a couple miles to the bomb dove and then open it up for everyone else to come in. Right. And I remember waking up I don’t remember how I’m or my girlfriend at the time, Mrs. Weishaupt now called me I don’t remember. But I remember getting up everyone’s freaking out. Oh my god. We’re under attack and like, I remember A bunch of guys were getting crazy about it right? They’re drinking. We’re going to war. Yeah. You know, you know, and and,\n\nyou know, me being the\n\nsensitive little cook that I have. I was like, Oh my god, this is a nightmare. I don’t want this right. I’m just trying to get some GI Bill fellows. No, I don’t want this now. A joke a joke? No, but it was it was kind of scary, right? Like, I was like, because we were in South Korea, we were close to the North Korean border, which obviously there was like, you know, it’s a pretty big threat there.\n\noh, man, I’m not getting out of here because I’m supposed to go back home back to the states like for I had been there about six months at this point. No, I’m sorry, nine months. At this point. I have three months left on my little short tour, and I got to go back home. Got to go back to the states I should say. And I was ready. I was done with South Korea. I was done with South Korea two months in I was like, man, give me the hell out of here.\n\nyeah, so it was like, three in the morning and I was like, Oh damn, here we go. It’s on a bobbin and then we got recalled. And me being the gate guard I had to get down there so I I remember yet you had to kind of walk through a straw like a golf course right? All these dogs are on tonight. Very sorry. And I remember being very eerie, almost like a fog in the air and walking by myself to the the bottom of thinking, oh my god, like my head was spinning. I was like, What is happening? Right? It was so surreal. And people in America had a different experience than what I had. But like, I think we all had this really strange, surreal experience about it like this isn’t this doesn’t happen in America. This is like stuff you see in the movies like this isn’t real. And I got there and I remember that We were supposed to get our m six teens for Guardian the bomb dump there because at the time we didn’t have those right like we just checked IDs and hope for the best hope for that hand to hand combat I don’t know, just wasn’t the thing that we did right. And that was the deal was we would they moved up in what they call threat cons or, or force protection conditions or whatever they call them. And we’re supposed to get you know, you’re the body armor and you got the you got the strap. And I was like, you gotta give me this damn gun. I need this thing now, right? Because we’re the Air Force, right? We don’t walk around with the guns. I have the army they probably did if I had them in their foot lockers and stuff, but like, I can’t trust us. We’re a bunch of frat boys. We’re busy party and you know, kid, kind of I kind of get but but I remember being like, because I had a lot of anxiety. If you know who I am. I’m a very anxious person. A lot of anxiety about this. I kept calling the I don’t remember the OP center or whatever. Hey, where’s my damn gun is like now it was like, at this point like 9am or something. And a car pulls up a little SUV, a little Korean SUV. And out comes out this swarthy looking fella and I, I get off my guard shack I go over there and he’s kind of getting out and he’s kind of walking towards me and I kind of stopped him like, Hey, you know what’s going on here and he’s given me this whole spiel about how he wants to get in the bombs and take a look around and that’s very abnormal, right? Like people to bond over like ammo troops, generally. And I was like, you’re gonna have to wait here man. Like this isn’t gonna I’m not gonna let you in. And he’s like, Well, let me let me call some people or whatever. So he goes over to the phone, and I’m kind of standing out by his SUV I’m looking inside seeing who’s in there. And my my little battle buddy, there was still in the gate. Check. And I look over and homeboy is on the phone and it was like a weird looking dude wasn’t a uniform or nothing just like a civilian dude. Yeah, like a big ol bushy mustache or like Bora Bora basically Bo rad gets out and he goes over the phone and I’m looking over at him while I’m like staring at the SUV looking inside this up and and I see the when he’s wearing a windbreaker and the wind picks up and his his windbreaker picks up and his back like Bruce Willis diehard style. He’s got a piece I don’t like some kind of gun. I don’t I’m not a gun guy. I don’t know what it was. It was a handgun. It wasn’t like a frickin assault rifle or nothing crazy, right? He had a gun I see it with the wind blowing. I said, Oh my god, we’re about to die. So I heard I like double time it back to the shack and like, get in there. And I’m like, Ron, I just got a gun man. And, and we’re kind of like, what are we gonna do? We don’t have guns like this fight this guy. And next thing you know, the guy goes back to his SUV turns around and they leave on a beautiful story, but that’s the story almost became the first military Casualty. No, I don’t know. I don’t know what they were doing. They were probably legit. I mean, like, that’s pretty brazen. I mean, if he was gonna try to take us out, he could have done it. Yeah, that was my Express 911 then, you know, 911 for the military was just like 24 seven weeks and weeks and weeks of just like pandemonium exercises and planning for stuff and oh my god, it was a nightmare. You don’t get paid overtime. You know, but you do get a free pass to Disney World when you come back to the States. When I got back in 2002. I got to go to Disney World free. Shout out Walt Disney, big old occultist. Now let’s talk about The predictive programming because it plays a role here in 911, the predictive programming of course, the concept of this is the idea that it talks to the subconscious symbolism, ideas, themes, talks to the subconscious, and causes changes in you know, the collective unconscious, this whole collective, you know, mind whatever we want to call this thing, this perennial philosophy idea, or Carl Jung or Sigmund Freud, but everything’s connected, right? So they think they can saturate the mind with predictive programming. Now, you could look at this from two angles, okay. And what we’re referring to is you’ve probably seen the images like the Simpsons had a magazine that said 911 on it with a plane going into it, then Terminator two, one of the overpasses is danger 911. The Matrix NEOs license says is expired on 911 2001, which I find to be the most curious about Example of predictive programming, given the idea of what the matrix was of entering into a new world. Now, all of the phrases and the mottos used for 911, you’ll notice they constantly say it the day everything changed. They’re forcing you to go along with this programming to say, Oh, yeah, this is a new world and new things have to happen. And we can’t go back to the old ways anymore. And that’s exactly what they did with COVID. Right?\n\nThat’s what they’re doing with COVID\n\nbecause since day one, they’ve been all over the place with old nothing can go back to the way it was. And this is the new normal and the great reset, and I the whole time I’m like, Okay, you guys just unleashed this nasty Bill Gates vaccine on everyone and we just go back to the way it was. We really got to like wear masks every day in this nonsense. But it’s almost like they Want to sell the mantra. And 911 was the first step and the mantra. Now, you could look at the non occult ideas of what doesn’t make sense for 911. And we’ll briefly go over these. I’ll have the details on these and this will be on the mega show next year, so stay subscribed to the show, get next year show the like, How strange is that? That plane that hit the Pentagon, we’ve still yet to see the video of this thing. We saw five grainy frames of what they claim happened, which we won’t get into like the logistics of these pilots that at the school, they said they couldn’t fly the damn things. Much less at do a high speed maneuver like 10 feet off the ground and into the Pentagon. Like that seems a little odd So people said that was a missile. I recall hearing that the FBI the day of 911, went around to all the gas stations, all the hotels, all the businesses around the Pentagon, and collected all of their video footage. Which I get right, a little bit of national security. But it’s been 20 years, why can’t we sit? What are we waiting for? Is it because it wasn’t what they said? I don’t know the answer to that. I’m just telling you what the conspiracy Troopers say. And you’ve decided what you want to believe. I will also offer up that the politics for the New American Century in the late 90s had a document and this is a conservative political action committee, full of big name, right wingers, the orchestrators of this, arguably they were talking about how we needed another They’re sort of Pearl Harbor esque 911, or another Pearl Harbor s moment to push the New World Order, basically. And that’s what they got. They talked about how we needed to get into the Middle East, to, you know, stabilize democracy in the Middle East. And you know, what was it really about, though? Was it about the lithium veins and Afghanistan? We did. We sure did use a lot of lithium in the last 20 years in batteries for cell phones and everything else. Could it be the opiates from the poppy fields in Afghanistan? We sure did use a lot of opiates in the last 20 years. The opium epidemic. opiates, I should say. Yeah, the hijackers were from Saudi Arabia. So we were like, Oh, cool. Let’s go in Afghanistan. And then oh, yeah, let’s go into Iraq. They got weapons of mass destruction. Oh, wait, wait, no, they don’t are bad. A lot of things don’t make sense. And you were call after we went into Iraq there. And this goes this goes back to my previous point about the predictive Pro, the predictive programming the language being used. You get immediate to repeat something enough people get confused because we got busy lives and most people are just like whatever. But they kept talking about Iraq and weapons of mass destruction. And those polls that surveys they did after we invaded Iraq and the American public like half the public thought that Iraq was behind the attacks on 911, which was, which was not true. Because the mind starts blurring things together. And if you recall, Michael Moore did a film called Fahrenheit 911 which I enjoyed thoroughly me being a lib tard granola kind of guy. Michael Moore is very biased. Of course. I can’t say I support everything he says. But fair enough. Now that was a great movie. It can’t take that away. Great documentary. He talks about how the bin Laden family were basically flown out of America first class there on 911. How would that happen? He was on the FBI, his top, you know, most wanted list there. And this is what happened. And this is just like with COVID, right? Nobody, nobody knows anything. Oh, really? No one knows anything. Well, you know, look at Bob Woodward’s book he’s gonna publish about how much our you know, administration really knew\n\nEveryone acts like they have no idea. I’m telling you, these people aren’t idiots. They’re not idiots. So that begs the question of why do we do the things we do? We had warnings of this happening. With the USS Cole, and the first time they bombed the World Trade Center, which goes to my predictive programming point of all the symbolism you see in the films and such, on one hand, yes, they could be enforcing symbolism and predictive programming. But on the other hand, they could be\n\nI don’t know, how do I, how do I describe this? They could be demonstrating an idea that people had in their minds already because the Twin Towers were so large in new york city skyline that a lot of people thought the planes were going to run into them so much that I if I, if I believe I recall this, I could be wrong, that the architects planned for it to happen because they were so high up there, right. Which, again, begs the question of, did they, you know, does jet fuel melt steel beams and you can find just as many engineers and architects to say That could have never happened as you could say, as you can find that say What happened? So it’s hard to know right? I’m not an engineer of structural architecture and all that I have no idea. Now what is curious is that the passports didn’t melt. If you recall, there was a one of the hijackers on flight 11 he was found his passport was found by person just before the South Tower collapsed.\n\nguess another one on flight 93 at the same story that photos and passports found at the site of flight 93 which is very strange, right? How could that possibly be a plane accident so intense with so much fire? You had the passports made it just fine. But to play devil’s advocate again. Maybe the stuff flew out of the Somehow before it caught on fire, they did find some people’s credit cards and wallets. So I mean, it’s not impossible, right? It’s strange for sure. convenient for sure. Then you’ve got this strange development where now they’re claiming some of the terrorists that orchestrated the attacks aren’t even dead. If you refer to a BBC article I’m going to read to you from another of the men named by the FBI as a hijacker in the suicide attacks on Washington in New York has turned up a live and well, the identities of four of the 19 suspects accused of having carried out the attacks are now in doubt. Saudi Arabian pilot while lead all Shari was one of five men that the FBI said had deliberately crashed American Airlines Flight 11 into the World Trade Center on 11th September, FBI Director Robert Mueller, homeboy or boy FBI Director Robert Mueller acknowledged on Thursday that the identity of several of the suicide hijackers is in doubt. So what’s going on there? I certainly don’t know, I’m not privy to that kind of information. What I do know is that this and this is where we kind of wrap up the rational discussion of 911 move into the occult stuff, which is way more fun. It was a setup. This was a setup for the Patriot Act, regardless of whether this was organically terrorist attack or not. And like I said, there was an attack on the there’s terrorist attacks before USS Cole, the First World Trade Center bombing. So like it’s very possible that this was in fact just a terrorist attack. It’s also possible some truth or say that it was a terrorist attack that they allowed happen. They allowed it to happen to further the New World Order agenda. Because after 911 We got the Patriot Act, which is the first time that we decided we were going to use surveillance against American citizens a violation of the Fourth Amendment of search and seizures. The and then look at the history you got Operation Northwoods and operation chaos. And you know, that was the CIA’s domestic surveillance setup to disrupt the 60s hippie movement, which could have had Charles Manson MK altered in the name of defending against the enemies of the state, which is arguably just some kind of anti right wing military complex stuff and you can check it out if you want more on this kind of stuff. Oliver North did a great series. Last I checked it was on Netflix. I saw it on Showtime many years ago, about the untold Untold History of America. And I haven’t fact checked it. But it’s very interesting. And it’s full of stuff like this right. The FBI, they had to come Until Pro, you know, they’ve always wanted to spy on us. They’ve always wanted this, the intelligence agencies always wanted to spy on the American public. Legally they couldn’t do it violated the Constitution. But here comes the Patriot Act. Right? Right or wrong. And I’m not saying every intelligence person is an evil person trying to spy on America. I mean, they could just be doing it because it makes their jobs easier and they can prevent attacks or whatever. But this is a very dangerous game. This is a very slippery slope to sort of Minority Report precog spying on your email kind of stuff. In fact, they have you recall, I think it was the NSA had some people that were spying on their spouses illegally. And because they were, they were getting cheated on or whatever they’re getting cut. The bigger desire from the if you want to look at this from the New World Order perspective. Which I do. The bigger desire here is to alter and control the human mind. That’s why so many mind control programs were around back then. And it’s why they’re spying on us non stop through the Patriot Act and social media, which a lot of these, you know, Google and Facebook, they’re arguably started by our own government, and now they’re spying on us. It’s all order out of chaos. Auto ad kayo. Right. Again, we go back to the free Masonic Skull and Bones motto 33rd degree Freemasonry. They’re here to give us the order they’re here to, unfortunately also gives the chaos so that we asked for the order. This is the new world order that George Bush Senior advocated for on 911 and 9110 years to the day prior. He gave that speech talking about the New World Order. And that’s that’s the thing. That’s what 2020 is all about. They want chaos. That’s when they’ve got the chaos candidate in there. So the people beg for order. And I don’t know what the right answer is my friends. I’m just telling you how I see it happening. Because they’re smart. They play chess like this, right? And you’re out of moves. You don’t know what to do. You want to order. But I’m telling you, there’s some danger involved here. This is like, you know, like the, you know, sometimes we as Americans subscribe to this idea of this illusion of safety. Look at the TSA, right? You go through the airport, and you think, oh, man, they’re gonna catch every. Everybody come through here. And maybe they have right. They certainly don’t make that information to public. But they did a study and they found like some insane amount of weapons like 90% of people trying to get weapons through were able to do so. Because again, it’s the illusion of safety. We have these illusions of safety throughout. All these mechanisms in America and people fall for it. And I don’t know what the right answer is. I just know there’s illusions of safety all over the place the vaccines, right? For example, the stab ease. It’s the illusion of safety. I’ll just give me the thing and it will be okay.\n\nYou won’t. Maybe you will. Who knows? Nobody knows. We’re listening to these nerds. These nerds run wild. This is what you get. You get software nerds writing programs to spy on you. You get vaccine nerds jamming you full weirdo diseases. You got lab nerds making monster woo hand flu viruses in the lab. They’re trying to kill off the old population China and leaked out now. We all got to deal with it. nerves are gonna kill us all. I’ve said it for years. Elon Musk, the God of nerds, they’re gonna kill us all of them. And as I thought about an alien book with Ilan musk with the starlink satellite system that’s part of the Project Blue Beam. sounds crazy, but it might be now let’s talk about the occult symbolism of 911. William Westcott, he says that the number 10 is perfect. In the Kabbalah tree of life, there are 10 step routes. 10 mental emanations that the practitioner can use to emulate and perfect oneself to become like God. Therefore the number 11 is simple. And your boy house to Crowley said 11 is the number of magic and it is the number that represents the new a on the New Age. Because that’s what this is all about. Again, I’m going to keep hammering that home. It’s all about the new age, the New World Order the the the turnover to the new time and that’s why not only Is the day everything changed. And that’s why COVID is the new normal. They got to slowly turn up the heat on this frogs in the pot. Let’s go back to 911 9110 years prior to the day because the dates matter to these psychopaths. George Bush Senior talked about the New World Order and the thousand points of light. What is the thousand points of light you may ask? Well, I’m here to tell you what it is. It’s 1000 year reign of Lucifer, that Hitler talked about Germany. From the Bible, he talks about Lucifer and all this stuff. I’m sure there’s another explanation for it. But that’s what I’m here to tell you what the crazy say because I’m on the I’m on Team crazy for 2020 as are more people than ever before. Because we all see something’s wrong. Something doesn’t add up. Intuitively, human beings are smart. There’s mouth breathers out there all over the place. There’s idiots in the masses. They’re morons. But I’m here to tell you they’re not that dumb. People are intuitive. They are smart. They know when something’s happening. People are waking up to something going on and trying to debunk and unravel what’s going on is maddening. Don’t listen to anyone tells you they know the truth and they know what exactly is happening. They’re full of it. No one knows. These, these people orchestrating the show are not idiots. They play chess. And they and nothing is what it seems. They’re 10 moves ahead of you, I promise. I’m just trying to shed some light on it. Maybe Maybe you find the truth. And I hope you do. Godspeed my friend. Crowley said elevens, the number of magic and that of the new Ayaan and then, you know, George senior talks about it on 911 and 91, about the New World Order and the thousand points of light. And I looked it up in a book called wicked witch craft instead of Python. Who if you recall is the O g? He’s quadruple o g granola. He’s the first one to assemble a secret society Did you know that? You knew that? He was going around synthesizing all the religions and mystery teachings from Greece and Egypt and Rome and Babylonia there, Babylon gate of the gods. Mesopotamia. Carthage, Phoenicians and all these ancient alien names, and he went back started his own secret society. If you join you had to keep your mouth shut for like five years. What a nightmare because back then you probably lived 20 years. But he would teach you the secrets of the secret Mystery Schools with Pythagoras labeled the number if you look up numerology for the number nine it’s the number of service and is the archetype of the mystic or healer And then if you look up 11, that is illumination, and the archetype of a spiritual messenger. So you’ve see you’ve got the archetype of the mystic or healer, connected to the archetype of spiritual messenger. I would argue that we are demonstrating the 911 as the transition into the magical age of the spiritual messengers, the aliens if, if I dare say so myself. And that’s a power number 11 because in that book, they go from what they describe all the numbers one through nine, and then it goes to 1120 to 33 as the what I call Angel numbers. So 11 is the illumination and the archetype of the spiritual messenger. All this, I would argue is to set up the alien God network. Be scared, be afraid they’re coming. KENNETH grant, you know, he was hanging out with your boy crawl Lee use a lot of his teachings thought he was the next Alistair Crowley everyone thought they were the next Alistair Crowley Well, he’s no exception, started his own little iPhone Ian Ordo templi orientis, where he was trying to channel demons and entities into our dimension. He wrote a book called Alister Crowley and the hidden God and he talks about nine and 11. I’m going to read you some passages. It gets a little weird, it gets a little crazy. But here we go. And this is kind of this is kind of the most interesting element of all this. Because I get into I’m a I’m a what we call my magic nerd. Maybe now I like reading this stuff. I think it’s bizarre stuff going on. Quote, because the number 10 was regarded by catalyst as the stable number of the system of divine emanations or the sefer off Number 11, which was considered a cursed because it was outside the system. So here we see him set it up such that 11 the a curse number is the number of the outsider. And earlier we heard that it was the number of illumination and the spiritual messenger. It’s the Lucifer of illumination as the outsider, you follow it picking it up. Here we go. Let’s keep going. theory on therefore adopted 11 as his formula that’s currently in the book of the law, the goddess nooit exclaimed My number is 11 as all their numbers who are of us, which is direct allusion to the A or the order of the Silver Star, and it is the system of grades. There’s another passage, the image of the beast dragon or seven headed serpent, formed the bazel design on the floor of the vault of the eight elves in the Golden Dawn. To each head was assigned a name of the club apothic or demonic force, the number of which is 11. Now in my alien book what you’re going to read and hell maybe by the time you’re listening to this, it’s already out there on Amazon aliens UFOs Nia call yours your illusion one. We talked about this. They’re talking to these clip Pathak demonic forces and the number is 11. As we are finding out today here on this little 911 show, quote, another affinity between al and the tantras is that the tantras are accepted not because of their antiquity alone, but because of the proven superhuman authority of their origin. There are other similarities to the tantras but also one great dissimilarity in that the tantrics, especially of the sock to division, avoid the use of the number 11 because it’s because it is considered in a suspicious this number which plays a major role in Crowley’s company has been adversely commented on by Dion fortune. Alright, let me back up. I know some of us are like Who the hell and what the hell are you saying Isaac? Well, you got to understand Kenneth grant was studying these ancient left hand path cultures. And he was into Tantra, which I’ve explained that in the past this is like some occult sex magic stuff. You sort of channel your energy a certain way and whatever. And there’s a you know, the goods and Bad’s to Tantra. There’s a left hand path to Tantra though. You use the energy through sex magic to cause changes in the world is the gist of it. And sting also uses it to hold back them nuts because you use that energy. Dion fortune, who he’s about we’re about to read a quote from the unfortunate wrote a book called the mystical Kabbalah. You can try reading it Good luck. Like most of the stuff, it’s like pure gibberish. Okay, so here’s what Okay, let’s rewind just a touch the number 11 Okay, so the tantras didn’t like the number 11 they thought it was bad Debbie bad Dingo do that. And but number 11 plays a role in crawlies called and has been adversely commented on by Dion fortune she was very famous author for mystical Kabbalah and she said quote, Crowley’s magic is valuable to the student, but only the advanced student could use it with profit. The Formula Two on which he works would be considered a verse in evil by a cultist, accustomed to the capitalistic tradition, for he uses 11 instead of 10 as the basis of his battery of knocks, and the magical ceremonies and 11 is the number of the clip off. No hint of this is given in the text and it is an ugly trap for the unwary students. He continues, it is true that 11 is the number of the clip off the unbalanced residue cast off by and therefore outside the 10 Sephora But man has to triumph over these unbalanced forces in his own nature before he can become a master magician. In order to do this, he first has to evoke the clip off, which he does by formulating the averse pentagram the starve set and said of course is the one of the archetypes of Luciferian outsider rebel, he was the southern Egyptian god he was the guy who killed Oh Cyrus represents the bad boy. Okay, so what are we talking about are formulating the reverse pentagram after he has established his magical supremacy by balancing within himself the five elements represented by the upright pentagram, the star knew it. The Magician is himself the 11th because he’s forever outside and beyond the operation of the 10 the two pentagrams so here are the magician is the outside And basically he’s saying that it’s okay you can be the outsider you can be the bad boy you got to get the job done you’re the magician make it happen it’s the ends justify the means, which is you know a lot of people have a hard time believing that any of this stuff could be rigged COVID 911 they have a hard time believing that but to people that have a higher calling, they say the ends justifies the means. So yes, we’re gonna do these horrific things. Let’s keep reading in him and if you like my reading, by the way, usually losing one will be on Audible here probably in October. Along with all my other self marriage audiobooks, check it out. audible.com Isaac Weishaupt is the name reading books is the game. in human form, this is the formula of sexual magic based on atavistic resurgence croley he always maintain a positive attitude considered also the equilibrium In fact that 11 is the number of the path of lF on the tree of life, the path of transmit the light of kether. The father to tipper f the sun. This path symbolizes the transmission of the supernal light to the mages Chuck Ma. By the formula of divine madness. He left the the fool of the Tarot is also the Mad one. The path of the left is the path of wisdom or folly, a left spelt in a fool totals 111 on the grand scale, and you know, he’s getting wacky, but we’re almost done. In the book, though, the book of both the letter A is ascribed to the first key the fool the Mad one and the serial number, this key is zero. We here reached the root of Crowley’s key formula zero equals two which is also an ancient Chinese formula, the sum of unity and its reflection, symbolized by the number one 111. So saying the sum of unity is one and the reflection also one is symbolized by 11 So that’s another explanation for the number 11. Basically, based off an old Chinese formula. Now the let’s see what else they got here, the dyad, the mystic number of the woman the divider is two as mother and child. That’s what they’re talking about with the 11. Two woman as a scribe the letter Beth which means the house or womb two is its number, hence 11. The dynamic form of two which I believe is the binary is that the binary code for two is one one. I don’t remember this stuff. I used to code back in college and I knew that stuff off top my head I think is 01. It doesn’t matter. It’s fine. I think it’s actually zero I think 113. Anyhow, hands 11 to dynamic form two is the number of magic. Here we go. Here’s where we’re getting to stuff so you got to read all this gobbly goo to get to the what they’re talking about. He says hence 11. The dynamic form of two is the number of that magic which uses the sexual forces in the woman to recreate the illusion of the universe. One beyond 10 the word of the law announced by a wasp is the demon whispering and curlies. Here is the Lima and it is expressed in Al in the 11 word precept, do what thou wilt shall be the whole the law. There are 11 lines on the reverse side of the steel of revealing which is the magical talisman. Boy, I’m going to skip a lot of this is your I already tell your eyes are rolling in the back of your head, like I’m like, What are you talking about? Because I barely know what he’s talking about. He’s basically talking about the new age and all these gods that you’re talking to. The magical formula of the great work, which is the process of uniting these two in consciousness is Abracadabra, Abracadabra, the 11th 11 lettered word of power. So the talking about creating the New World Through magic, that’s the short version and shout out to Freeman fly. He, he claims he predicted 911 I believe him. He’s been deep in this world of the occult long before me. I learned a lot of this stuff from him, or at least he planted the seeds should say. But through these sort of teachings, he was able to say that 911 was coming. A big event. A false flag perhaps. And look, false flags are possible to write. People don’t want war, normal human beings don’t want it. So you have to, you have to sometimes manufacture the attack, and condemn the pacifist as the anti patriots. There’s always quotes from Caesar and Herman Goering talking about this stuff. And the population over time becomes confused as to who orchestrated just like how they thought Saddam Hussein did 911 But all of this and it’s like a psyop right? It’s an event. It has to be like a movie has to be traumatic has to shake up things that the world has to change. It’s like a ritual. Where if you know anything about the the Freemasons in the Egyptian Mystery Schools were the initiates for going underground. The initiates have to face death you have to shake things out traumatically to come out the other side, a changed person. There’s also a book if you want more on this, and this is I haven’t finished reading it yet. This is going to be part of the mega show analysis. It’s called 911 as a math ritual, and the author SK Bane, which I assume is a pseudonym is an expert in Kabbalah conspiracy guy. It’s very good so far. The foreword is written by Peter venda who definitely knows what’s going on. It’s got contributions from William Ramsay guest on the show here in the past Michael Hoffman. who also wrote a good book about the was the Secret Service and mind control or something like that. But it’s it’s a it’s got a lot of interesting stuff and at the beginning you can read it talks about the initiation rituals were that require us to face death to come out the other side review from it, then they want more reading from me. More importantly set premature burial is an essential part of the Masonic initiation ceremony of the third degree to be ritually and symbolically slain, buried and raised again is a feature of many initiatory programs around the world, from Siberian shamanism to quaint 19th century English secret societies. It is a liminal event, which means like, kind of surreal, right? You’re in between worlds. You’re on the threshold of living and dying. And in that sacred spot you can see in both directions. Conspiracy theorists are kind of like that. They have one foot in the world of mainstream history and culture. with Robert Anton Wilson used to call consensus reality. And that’s the world where most of us live. Great little quote there. But they do, you know, in the first section they they started out with the invocation of those by Crowley, and he talks about Lords of the gates of the universe. And it’s like, is this what this is all about? Like, Is this about cracking open the portal a little bit further to what the aliens through?\n\nIt could be,\n\ncould be the num, then the numerology of this doesn’t make sense. You know, the 11 is when Wescott called the essence of all that is simple, harmful and imperfect, you know, versus 10, which is the perfect number. And croley you know, back in the day he died and 47 said that 11 is the number of magic and the sacred number par excellence of the new Ayaan. And then finally, you’ve got the symbology of the Twin Towers. You’ve got Boaz ninja keen, which were the entrance to the mystical place, kind of like the pillar of Hermes. It’s a symbolic boundary between this realm and the next which is why they need to have this sort of confrontation with death ritual. You got to scare people and have them face death. To create the to prepare the mind to accept the New World, the new the past the symbolic boundary, the veil. They they open up a doorway, a gateway is symbolic tearing of the veil of ISIS. It’s a portal revealing the Holy of Holies. And that’s what the boas and jack Keane they represent. They were at the Solomon’s temple. And it represents the entrance to the mystical place. So when you’ve got the two towers, those are the two pillars, right? And then they bring them down and then what do they do? They rebuild a single pillar out of that. Because in the occult doctrine there, it’s all about the reconciliation of opposites. And if you look at the capitalistic tree of life,\n\na pillar that runs on each side. But the another path is the center pillar. That’s the pillar of consciousness. It’s a third round. So when you boil it down, these occult magicians use symbology symbolism, predictive programming, numerology, the different initiation ritual kind of things like facing death, fear on a grand scale. And a lot of this stuff is kind of like what 2020 is looking like. Could it be a combination for 2021 the Patriot Act dropped out of 911. The world changed. Everything changed that day. And now 19 years later, they’re talking we’ve got another new normal. The two tat the twin pillars come down on the single pillar goes up the One World Tower, the New World Tower. And then in the memorial, what do they put basically black cubes, underground there to represent the old footprints of the Twin Towers. So that’s my short version of the analysis. I’m gonna study this a little bit over the next year and in 2021, we’re gonna hit it again, barring an alien invasion, because I’m actually going to be writing my second alien book using religion to here soon, where we’re going through all the films and pulling out examples to prove my great theories and points from the first book. Again, you can pick up aliens UFOs Nia, call us allusion. One you’ll be able to pick it up on Amazon Audible, I’ll have signed paperbacks gumroad.com backslash Isaac W. Gum like bubble I’m not like scary guns gumroad.com backslash Isaac w get all my books signed for my handy years. So hope you enjoyed it. Have a great patriots day or whatever we’re calling this thing and until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "9/11: Occult Ritual, Symbolism, Numerology, Predictive Programming and more! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we talk about 9/11! We’ll cover the occult symbolism, predictive programming and some ideas about 911 that may be new to you. I’ll also share where I was on 9/11, which may also surprise you. Support the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join […]", "url": "https://illuminatiwatcher.com/9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-09-14T13:44:28+00:00", "article:modified_time": "2020-09-14T14:20:31+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/09/ctauc-911.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["9/11", "911 symbolism", "911 occult"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/40896579", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more/?share=twitter", "https://illuminatiwatcher.com/9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%209%2F11%3A%20Occult%20Ritual%2C%20Symbolism%2C%20Numerology%2C%20Predictive%20Programming%20and%20more%21&body=https%3A%2F%2Filluminatiwatcher.com%2F9-11-occult-ritual-symbolism-numerology-predictive-programming-and-more%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt", "Barb"], "publish_date": "2020-09-14T13:44:28+00:00"}