{"result_id": "165016", "URL": "https://illuminatiwatcher.com/12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda/", "timestamp": "2023-04-25 15:35:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "12 Monkeys Film Analysis: As Above So Below, Technopaths and the Globalist Agenda!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we analyze the 90s classic “12 Monkeys!” We’ll learn about the 2035 virus, science nerds, questioning who’s really “insane”, mental divergence, and some As Above So Below symbolism! There are some tie-ins with The Sixth Sense, Prometheus, and the globalist agenda! We’ll turn the argument on its head and see if Bruce Willis (the Christ figure of the tale) is trying to save humanity from the technopaths or if this is a Gnostic prison!\n• SCREENSHOTS: Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “12 Monkeys Film Analysis: As Above So Below, Technopaths and the Globalist Agenda!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nWe have a very advanced program\n\nsomething very different an opportunity to reduce your sentence considerably and possibly\n\nplay an important role in returning the human race\n\nthe surface of the earth.\n\nDo you think you’re living in the future?\n\nI’m simply trying to gather information to help the people in the present trace the path to the buyers are not in the present now.\n\nThis is a place for crazy people. I’m not saying you’re not mentally ill on the roll. I know you’re encouraging.\n\nThe army the 12 monkeys are the ones who spread the virus\n\nmonkeys. Living in a meticulously constructed fantasy world that world is starting to disintegrate and become\n\nNo, sir. He needs our thinking crazy when people start dying next month.\n\nI don’t belong here here because I know some things that you don’t know. Yes, my son sent me to the wrong year. You’re certain of that science as an exact science. You had a bullet from\n\nWorld War One in your leg. James, how\n\ndid you get there?\n\nYou know the difference between what’s real and what’s not said? delusions. He\n\nsaid you can explain trying to feature\n\nto go try your monkey. They mutate. We live underground.\n\nsort of do my part to get us back on top in charge of the planet.\n\nYou know what time it is? movie? Yes, we’re gonna talk about 12 monkeys. You know, you’ve probably seen it already. It’s from the 90s. And we’re gonna go through the whole movie plot spoilers right. Now we’re gonna wait, we’re just gonna get into it. What’s this movie about? Well, let me tell you what it’s all about. The nerds killing us. That’s what it’s about. Is it worth it? Have you seen it yet? Well, I advise you highly to see it. This is a great movie top is a top 50 movie. Top 50. About top 10 the top 50 Sure. It’s over two hours. There’s a caveat there. You know, I don’t like that. But that doesn’t mean that should have been shaved down shorter. But yeah, two hours, would you should you pay for it? If you’ve never seen it? Yes. pay for it. It’s good. Great movie. It’s worth watching a few times my opinion. I’ve seen it maybe five to 10 times over my lifetime. Now from the red pill perspective, though, which is what we got today. And by the way, the movie poster itself, if you’ll notice, has Bruce Willis with the all seeing eye highlighted with a sigil of the 12 monkeys. We will get into that because it is an initiatory tale of sorts, as you’ll find out in the conclusion. All right. So what’s the movie about if you if you decided, you just want to listen to my humble analysis and let’s get into it. It’s about well, okay, so let’s let’s see. It’s 2035. And a virus has been released by an animal activist group called the 12 monkeys, that’s sort of like the setup for this. And this virus forces mankind underground. The animals are the only thing left to live above ground. The animals and Mother Nature take back over take their rightful place, mankind the disgusting these that he is, must go underground. And underground, these scientists are trying to figure out how to combat this virus above ground. So they’re sending prisoners above ground to collect samples and sort of study the origins of the virus. And they dangle the idea of a full pardon over over their heads and exchange. Some echoes of slavery there. Will your boy Bruce Willis, he’s in this. And he plays guy named James Cole. A prisoner region for that, that big old dangling carrot. And he goes above ground against samples. That’s kind of the gist of what this movies about. Oh, and by the way they can they can travel through time. Any perfect, but they’re doing their best, right. So that’s it. That’s the setup. Now the film starts out and you see, you see James Cole, Bruce Willis, going back and forth, above ground below ground. You know where we’re going with this as above so below hermetic axiom, as dictated by the God of magic, both the Hermes trismegistus to all the followers of the chemical process, rich will magic, Kabbalah, all these occult sciences believe in the concept, the macro connected to the micro, the practitioner on Earth, changing reality through the cosmos, you know, my schpeel, you’ve been here before. So they’re showing, I believe, figuratively, literal, sort of As above, so below connection here, which again, we’ll get into that in the conclusion. But they send James cold back back in time to 1996. Right, because, again, we’re in 2035. And they send James Cole Bruce Willis back to 1996. Because they’re like, Look, you want your full part and you need to find this get more info on the 12 monkeys group that’s going to unleash this virus. Or they screw up, they send them back to 1990. like God, Tupac still alive. What, what a time to be alive. And he ends up ends up in a mental hospital. Right, because he’s in there talking about how he’s telling people how he’s from the future. And there’s a virus unleashing and they’re like, okay, buddy, here we go. We’ll put you in this little van right here. Don’t worry, it’s padded, you’re gonna hurt yourself. So they put him in this mental hospital. And here he needs Brad Pitt, aka Jeffrey Jones. Now, fun fact. They filmed this movie in at the Eastern State Penitentiary, right out there by Philly. And, you know, Ghost Adventures have been there. I think it was, who was in the prisoner. Al Capone was in there. You can do your ghost tours there. Your ghost hunting tours there. It’s good time. But now you got to listen to what Brad Pitt’s character. And by the way, one of Brad Pitt’s greatest performances in this film. I mean, that’s worth the price of admission, this guy can act his ass off. Anyways, you hear Jeffrey Jones, Brad Pitt, and I try to give you the names, right? So you can picture this. We’re not that’s my training wheels. We’ll do that a little bit. Jeffrey Jones, Brad Pitt, he’s talking to James Cole, Bruce Willis, about the games inside the you know, because they’re in a little sort of like a mental nursing home sort of environment. And he’s like, Hey, you know, we got some games over here. They got drugs to tranquilize you. He starts questioning who’s the prison? Who’s the prisoner? And who’s the guard? Right. This is the Gnostic spin talks about the TV consumerism. And I’m gonna play the clip for you here in a second. But it’s it’s kind of like the idea of social media, right? You’re not paying for it. Therefore you are the product. And yeah, by the way, this is classic cinema history. This is one of the greatest cinematic moments and all of history, in my opinion, in my humble opinion.\n\ndo me a favor. Just show them around. Tell me TV rules. Show\n\nHow much you gonna pay me how much I’d be doing your job\n\n$5,000 my man that enough? 5000 a wire check your counter as usual.\n\n$5,000 $5,000 $1,000 I’ll give him the deluxe mental hospital. may get around get around. Let’s see. Feel good. prisoners. No, you’re the\n\ngods now. You got it. Okay, okay.\n\nGames want to get out. See more games, games, the vegetation. If you play the games voluntarily taking a train I guess they give some chemicals drinks or drugs what they give you how how much how much only George know your dose elementary telephone communication with the outside world back dispatch all of these nuts could just make phone calls it could spread insanity using through telephone cables losing two liters of oil these two are sane people infecting them. wackos everywhere plague a man’s Come on. In fact, very cheap. And fuel this interaction actually mentally I’m not saying you’re not mentally along for all I know you’re\n\nhere that’s not why you’re here.\n\nYou’re here because system. Television. All right. They’re all right there. Look, let’s kneel pray. anymore at least to make things anymore. It’s all automated. What are we for then? We’re consumers. Okay, okay. Buy a lot of stuff. You’re a good citizen. But if you don’t buy a lot of stuff, if you don’t, what are you then I asked you what? l back Jim back if you don’t buy things, toilet paper, new cards, computerized under electrically operated sexual devices, serial systems, your brain and planet headphones, screwdrivers miniature built in radar devices. voice activated computers. Take\n\nSo for one particular television programs, it’s almost something new. You go to the charts and stuff date time. So you want to see us on but you have to tell them before the show is scheduled. Beyond there’s this guy, and he’s always requesting shows that already played? Yes. No. You have to tell her before. He couldn’t quite grasp the idea that the charge nurse couldn’t make it be yesterday. couldn’t turn back time. Thank you Weinstein. Now he he was nuts. He was a fruitcake, Jim. Want to get\n\nRight. Right. Right. Right. I got a little carried away, explaining the inner workings of the institution to Jim.\n\nNow what’s what’s curious? Is that and we’re not going to unpack that whole thing. You’re intelligent enough? You know what we’re saying about all this? All these curious elements like questioning Who? Who’s in the prison? Who’s the guard? Well, like this is a gnostic spin. This is inverted reality. We’re on this prison planet, right? It’s basically you know, questioning authority questioning everything you’ve been told. Is everything a distraction? Are they trying to tranquilize you? Are you just being the consumer you’re used as livestock? And what’s curious is that Brad Pitt actually spent some time at a psych ward in Philly preparing for this role. You know, we’re, we’re bad things happen in Philadelphia. But he wasn’t actually paid much for this film. Because this was 1985. And his his big. His big films hadn’t dropped yet. Interview with a vampire was in the can still seven was in the can still, when he was working on this movie. This this guy was crushing it Oh, my God, how busy was this guy? And I would argue that this speech that he gives, fits into David Fincher Fight Club, which, you know, obviously Brad Pitt was, uh, was playing the role of Tyler Durden. In this speech, he’s dropping massive ideas about you know, how the games they sort of put us in a vegetative state, which you’ve seen, you know, what we’re talking about, when you see people getting absorbed into like tik tok or the Facebook or the Instagram, the phones, they’re programming us. I remember. I remember back before I had an iPhone back in the BlackBerry days, when you just use the phone for the utility of what you needed it for. I had a friend with an iPhone. He was consumed with it. He was always on and I thought what could possibly be that interesting. But I get it right. It’s not a condemnation of it. I’m just as guilty. I spend hours on that thing. But but it’s by design. They know how to do this to us. That’s what Brad Pitt knew back in 1995. Who’s the prisoner who’s the guard the prisoner is firmly planted inside the system and perpetuates the system is like some real Charles Charles Manson stuff here, right? Which Oh, by the way, before I forget, there is a connection here. If you consider Charles Manzo started the air trees, water animals stuff, the hippie environmental stuff. And there’s some arguments that that’s what this film could be about is like, how we’re treating Mother Nature and eventually Mother Nature is going to fight back. And that’s kind of what the the modus operandi of the 12 monkeys animal activist group is right. But the idea is or if you don’t conform, you, therefore are the deranged one. And they have to keep you outside the system. You are the outlier, because you have not conformed and fit into what the the masses Dean normal. Hence, censorship. That’s why they censor the truth is because we don’t fit into the mass consensus of reality, too dangerous for the masses. They refer to as mental diversions in the film. And what we’re curious is that Brad Pitt’s character even is talking about Siri, he talks about voice activated commercials. Did you catch that? And listen to it again? Let’s do it. 100 times all you want. Anyways, great clip there. One of my favorite moments in cinematic history. Was Brad Pitt on my list. Leo’s number one, Tom Cruise number two Brad Pitt’s probably number three. Now look, just because they’re all incredibly handsome. That does not mean I’m gay. They they’re all just phenomenal actors. I can’t explain it. Okay, James Cole, Bruce Willis. He is at the so he’s at the mental hospital, and they bring him into the board to review them. So you can like plead his case, why he’s not crazy anymore. And we notice because we’re all very well care. That this is more symbolism of as above so below, because the board of the board of doctors, they’re above ground at the mental hospital. They’re talking to him. And just previous to this, he was talking to the Board of scientists belowground I’ll put the photos on the Instagram at Isaac Weishaupt you’ve already liked and you’ve already subscribed the link was in the show notes Remember that? But that is again more symbolism as above so below, the scientist underground coal has to petition with them and be like, Look, you need to send me above ground and give me a shot blah, blah, blah. He does same thing in the mental hospital. Hey, you need to let me out. Give me a shot blah, blah, blah. But But coals dumb as these they’re telling him how he’s from the future. So you can guess how far how well that served him. And they’re like, okay, bro. You got it, buddy. So it’s nighttime and they’re in the hospital. Still. He doesn’t get out. Plot spoiler. And James Cole Bruce Willis is talking to Brad Pitt, Jeff goans goans spelled coins, but they pronounce it guns. Guns, I don’t know. And then when he’s talking and we hear a little bit of like, almost a bit of like on the terrain theory, germ theory stuff. Remember, shout out Greg Carr wood from the higher side chats he he appeared on our show, just a few weeks back talking about this stuff about germ theory and terrain theory. And here’s here’s your boy Brad Pitt talking to Bruce Willis about it. This is similar to how how James Cole is trying to explain how I turn the future like people just don’t. They can’t understand and grasp this reality.\n\nDo you know what crazy is craziest majority rules? Yeah. Take germs for example. Germs in 18th century, no such thing. Not nothing would ever imagine such a thing. No sane person and welcome to stuck some ways, some ways. Some ways someone is trying to convince people while other doctors mainly that there are these teeny tiny invisible bad things called germs again to your body make you sick. He’s trying to get doctors to wash their hands. What is this guy crazy, teeny tiny invisible what he called germs. Now, at the 20th century, last week is broken right into the shell. When I order a burger in this fast food joint, a guy dropped it on the floor. Jim, he picks it up, he wipes it off. He hands it to me like it was all okay. What about the germs? I say he says, I don’t believe in germs, germs, just apply a made up thing. So you just packed it and soaked. Now, he’s crazy, right? There’s no right. There’s no wrong there’s only popular if you believe in germs, right?\n\nI’m not crazy. Of course.\n\nOf course not. You want to escape? Right? That’s Barry saying that I can help you. You want me to get you out?\n\nNow again, it’s the same concept reinforced from the previous speech that Jeffrey guns gave to James Cole. The, you know, crazy is majority rule, sometimes consensus reality, which is why you see the mainstream media pushing one narrative generally are trying to write. I mean, there’s there’s bounds and limits within this consensus reality. But that’s the idea. Now, and this is why censorship happens, right? Because you have these people out here pushing alternative views of the world. And that’s not good for business, right? It’s not good for the manipulation. goans he wants to help Cole get out. So what he does is he creates chaos in the hospital and the staff is distracted. And he he physically gives key cold the key to get out. So cold, he’s trying to get out. But he’s all doped up. He’s all Thorazine dealt. And what’s curious is that they do this during a commercial that is playing on the day room TV about financial investments and financial opportunities, because again, this is another, you know, American capitalist culture critique. So that the returns fast. American capital, yeah. Another patient, he repeats the commercial, right? So they’re showing us how the masses are like, they just repeat what the Devi tells them. And also, they talked about how the Florida Keys are beautiful this time of year, which is a theme you’ll see in the movie. Basically, it’s the eye, they’re showing us much like they live the repeated messages, talking to us, manipulating us controlling us. Now, he tries to get out. James Cole’s trying to get out but he’s all doped up the catch them, they throw them on a pad itself and boom, he’s gone. disappears. Because the scientist from 2035, they zap him back underground to 2035 to report on what happened. He’s like, hey, dummy, you sent me the 1990 and 1996. Because again, they haven’t perfected time travel yet. So they are like, okay, we’ll send you back. This time, we’re going to send you right to the right spot. 1996 Baltimore is the exact moment when the virus is supposed to be unleashed. Get that Intel report back, full bharden. Boom. And then here we get to learn more about the other main character of the show. Dr. Catherine railly. She is the doctor of the sick. She was at the mental hospital. And she kind of is curious about James Cole. She’s like, something resonates true with this guy. It’s kind of sympathy for him back in 1990. So boom, James calls back in 1986. And we hear Dr. Catherine railly, giving a a lecture about apocalypse apocalyptic diseases.\n\nIn a season of great pestilence, there are omens and divinations and one of the four beasts into the seven angels seven golden vials of the wrath of God, who live forever and ever.\n\nin the 14th century, or the accounts of local officials of that time, this man appeared suddenly in the village of wild near Stonehenge in April of 1362. Using unfamiliar words and speaking in a strange accent, the mandate dire prognostications about a pestilence, which he said would wipe out humanity approximately 600 years. Obviously, this plague doomsday scenario is considerably more compelling when reality supports it with a virulent disease whether it’s the bubonic plague, smallpox or AIDS, and now we have technological powers as well, such as chemical warfare, which first reared its ugly head during the deadly mustard gas attacks of World War One during that attack in the French trenches in October of 1917. We have an account of this soldier who during the assault was wounded by shrapnel and hospitalized apparently in the state of asteria. doctors found that he had lost all comprehension of French, but that he spoke English fluently. I’ll be a regional dialect they didn’t recognize. The man though, physically unaffected by the gas was beside himself. He claimed that he had come from the future that he was looking for pure germ that would ultimately wipe mankind off the face of the earth starting in the year 1996.\n\nAbout the seven golden vials that man needs to live forever, oh my god, these nerds are creating the mortality juice, the juice, baby. So that was curious. And we’re gonna play this clip right now. She is signing books after the lecture. And you hear some curious stuff happened with this interchange with some of the the the attendees trying to get their book signed.\n\nReady to get vaccinated? Hi,\n\nI think Dr. railly is giving alarmist a bad name? Surely,\n\nthere’s very real and very convincing data, the planet cannot survive the excesses of the human race. This is true proliferation of atomic devices by uncontrolled breeding habits, promotion of land, sea and air, the rape of the environment. In this context, Isn’t that obvious? The chicken middle represents the same vision. And that Homo sapiens model. Let’s go shopping. It’s the cry of the true lunatic.\n\nI wonder if you’re aware of my\n\nThe first guy you hear briefly, he’s like, oh, boy, he’s scared. And he’s like, I’m gonna get my vaccines, right. Which has its own implications. We won’t get into that we hear the this sort of technocrat type character, another main character in the show, but like, we don’t know much about him at this point, called ponytail. I don’t know what his name is, doesn’t really matter. We’ll call him ponytail. Because he’s got a beautiful one beautiful, 90s ponytail. He’s talking about, he reveals the true justification these these psychopaths have for creating creating a new reality. And he’s like, Oh, you know, viruses are so bad mankind needs put in his place. Because all we do is shop and destroy the Earth. Cap consumerism, capitalism. I mean, the real question is like, Is he right? Is he right? Is he wrong? Leave for that for you to decide. But then James Cole. He forces he forces the doctor to drive into Philly again, because he wants to go with the bad things happen. And by the way, was Trump alleged to be a time traveler or Baron Trump, his son. Just a fun little fun little play there on ideas. It was a book, a book by Ingersoll Lockwood called mysterious. What was it called some about Baron Trump in his mysterious travels underground or something? Very curious. Other than that, I think there’s a lot of similarities. I didn’t read the book. But if you see any, let me know. Hit me up. Now. James Cole, he’s in the car. Dr. So and so she’s driving him around. And he’s reflecting on how much he misses humanity, because you got to understand he’s been living underground in this prison for decades. And he misses simple things like the music on the radio. It’s very soothing to him. And look, I a personal story, personal side note, I remember when I was in basic training, non hearing music for I mean, it was it was like a month at least. And then one day, I overheard music and I think it was one of the drill instructors was playing. I don’t remember. It doesn’t matter. I heard music and it was like this profound experience. It was so beautiful. I was like remember the song that’d be a funny story. But yeah, when you get to prime to those things, I couldn’t imagine for years. There’s a legitimate response and a pleasing factor in your brain. So that was interesting. Cool story, bro. James Cole. He wants to go to Philly to find the virus. He wants to find the 12 monkeys. And oh, by the way, he’s got this voice in his head throughout the whole film, Bob, and Bob’s talking to him. And we don’t really know we don’t get closure on what this is. We don’t know if it’s him being legitimately crazy. Or, I would argue that the scientists programmed and unknown because you find now that there’s supposed to be spying devices hidden, embedded in the, in their, in their teeth in the future. You remember Margot Kidder, who was a star of the film, Superman. She smashed her teeth out in the woods, talking about how the Illuminati or whoever was putting implants in her teeth. Remember that? What’s up with that? their connection there. I didn’t see any but that was very curious that they put the spy devices in the tooth. So so it’s argued to Bob the voice in his head comes from his own teeth. Now, Bruce, or I’m sorry, James Cole. And Dr. So and so they’re looking for the 12 monkeys group, because again, they according to the history, they had the original virus before mutated and got out of control. And the scientists 2035 need to understand it. So then get humanity back above ground. And along the way, James Cole, he’s got to kill some thugs to protect the doctor. And, you know, she doesn’t know whether to she’s scared of him or not, because right now she’s sort of kidnapped. But she comments how like, yo, he’s gonna have to kill those people. And then James Cole says, All I see are dead people, meaning he lived through the apocalypse already. Like he’s from the future. It doesn’t matter. It was dead anyway. curious enough though. Hailey Joe Osmond character in the sixth sense. also said something very similar, right? You remember that? And he said, I see dead people. And this was in 1999. The Sixth Sense was released. So this was after right. Also, by the way, filmed in Philly, sent in Philly. Also, by the way, Joe, Hailey Joe Osmonds character and Sixth Sense guess what his name was? Cole Cole sear again strange echoes and reverberations in the you know, I don’t know Mandela Effect whatever you want to call this in the consciousness So James Coleman director sounds Oh, they’re looking for I didn’t catch her name by the way. That’s why I keep calling her Dr. So and so they locate the the animal rights group it’s called FHA at the time before it turns into the 12 monkeys and of course they find out it’s run by Guess who Jeffrey Jones because apparently he got out at some point of the mental hospital and he was saying that he had a wealthy virologist father while in the mental hospital right he said my father’s famous I’m getting out of here turns out he was right and now curious idea here there’s also the we talked about Manson in the air tree waters animal group there’s also the Best Friends Animal Sanctuary down in southern Utah very famous place. Well look who started that process church church that believe that Satan was God and all this wacky stuff that allegedly also Charles Manson was a member of or familiar with. They did. They did publish a magazine with an article written by Charles Manson. Now, now, this is so curious to me, because like, I’ve got these granola ways, and it’s like, Okay, do I support these? These dannic ideas? Can I have it both ways? Can I love animals in the environment and earth? And also love Jesus? Why are these two things incompatible? Now, these are big questions. Big Questions, big problems. Yeah, anyway, so the viral ologists doctor father. turns out he’s buddies with old ponytail, the technocrat guy who was asking for the booksigning who suggested the man deserve to die for the way he treats Eritrea waters and animals. And one of the animal rights people, ironically, who was in this FAA animal rights group, was played by a guy named Matt Ross. Do you? Do you know who Matt Ross is? I’m about to tell you he was in American Psycho. Another great film. Easily a top 50 film. He plays this dude, that’s kind of gay. And he was also and guess what else? Guess what else Matt out my rossell face off. Yes. He couldn’t eat a peach for hours. I’m so terrible. I was terrible, the Nick Cage voice. But there it is. He was in face off and Silicon Valley as the Steve Jobs type CEO granola guy. So yeah, I thought that was curious. This must be one of his first roles. He barely had any lines in it. So James Cole Dr. So and so they get back in the car. And Tom Mahal, Jeffrey Jones said that his father was God. But he’s just a scientist. You see how they’re conflating the two? Much like, Matt Ross has character in Silicon Valley, the show was playing portraying Steve Jobs. There’s this. There’s this sort of God plot Cobb, God complex with these technical paths that\n\npeople who feel unaccessible You can’t just barge in on him. It’s not how the world works required. No, you\n\ncar is stolen. We are in big trouble. Big trouble. You don’t turn yourself over to the police. They’re going to kill you and you’re going to shoot me an accessory to murder. Nobody is going to die.\n\nYou’re not going to save the world. Okay,\n\nbits and pieces in your head? No.\n\nLet me give you an example. Jeffrey Goins, the book patient mechanicals\n\nhe told you then his father was a famous scientist who work with viruses corporated that good information to this\n\nchange. Father was a scientist. He said his father was\n\na prominent psychiatrist and author. And you see how things how things intermix and intermingle and, and it gets very confusing because you’ve got these people like Elon Musk, and all these types that are making technology that makes our lives better yet it also marches down the path of transhumanism. Much like my conflict between liking to protect animals in the environment, but somehow that marches me down the path of Satanism. Now the virologist doctor, biologists father go Doctor goans, the doctor dad who thought he was God. He is at a dinner an elitist dinner, given a speech, and you’re gonna hear some curious elements here. He’s talking about how these elites, they’re responsible for the masses, they’ve been chosen, right? That’s kind of their attitude. And then you’ll also if you listen very closely, here, reference to the archetype of Lucifer himself.\n\nEnjoy this opulent dinner, this most\n\nstimulating and exciting company, for itself with no sense of\n\nWith all his excess of public attention and cacophony of praise, comes great responsibility.\n\nNow, I don’t have to tell you all that the dangers of science, Tom Warren threat from from atheists stealing\n\nfire from the Gulf and\n\nDr. Strangelove terror, but never before.\n\nYou heard it, he compares promethease taking the fire from the gods to himself. That’s what these guys think. They talk about Dr. Strangelove a bit and fear and power and what’s going on and how they need to be the adults in the room. And again, maybe they’re right. Humans on a massive scale. Sometimes can’t get things right. I prefer my freedom personally, over a nanny state. But I’m not saying they’re entirely wrong, like, people do dumb things. People do selfish things. Sometimes when they’re up against the wall. Not everyone’s perfect. you extrapolate that to billions of people. You can see why it’s so enticing for these people that are in these positions of power to want to control us. I’m not defending it. I’m not advocating for it. I’m just saying this is their viewpoint. They think they’re not wrong. They think they’re right. And that’s why James Cole, he meets up with Jeffrey Jones, talk about these monkeys 12 monkeys just get the info and Bomi exam back to 2035. And at this point Dr. railly she that’s her name. I just found Dr. So and so there Dr. railly. Dennis, I said I didn’t have a name I had a written down earlier. Anyway, Dr. railly she starts to realize like, Oh my god, James Cole. He really is a time traveler. Now Now she’s on Team Cole. She thinks he’s like the deuce Ex Machina, however you pronounce that. The God from the machine right coming to save mankind. Meanwhile, coals back underground. Well, meanwhile, he’s in the 2035. He’s back on the ground. And they’re calling him a hero because he actually made contact with the 12 monkeys, he won victory. He gave them what they wanted. He’s gonna get the full part. But James Cole being the hero that he is. He obstacle back in time back above ground To get more info. Meanwhile, the viral ologists he’s talking to ponytail. And you confirm they’re linked together as harbingers of this revolution. Right? Because this whole time you’re thinking it’s Brad Pitt’s crazy character. You’re thinking Jeffrey guns is the guy to unleash the virus. But no, no, no. It’s his father, the virologist, the wealthy elitist, and the other techno path, old ponytail. who think that mankind’s virus needs to be checked that mankind is checked. And the other ones do it. And Dr. Cells Oh, she is older damn name, I got to take better notes, guys. I’m very sorry. Anyway, Dr. Stone, so she’s, she’s spray paint the outside of the building, you know, why do 5 billion people have to die. And if you recall, I thought of the Georgia guidestones, which had these ominous messages about the future. And I looked it up, I thought, wow, then that some 5 billion note didn’t, it says the population needs to be reduced to less than 500 million, which is a that’s a very low number. But it does make me think of this movie. Maybe that’s what the unleashing of the virus is meant to do. Maybe that’s what they want. They we always hear about that population reduction. Right. And you’ve heard Bill Gates talk about the vaccine for population reduction, which many people get wrong, they think that he’s saying like the vaccine is gonna kill people. That’s not as his his justification, his version of why he said that. He’s saying that other cultures that have many, many kids will have less kids, because those kids are going to be healthier in their because apparently, in some of these cultures, they’ll have like 10 kids, knowing that like two of them were gonna die from some disease. With the idea that eventually they’ll say all these kids aren’t going to die of the disease. Let’s only have the kids or whatever. Kind of it’s all very suspect. Yeah, there’s Georgia guidestones. Everyone’s talking about the universal language, the world core, being imbalanced with nature and all this stuff. And I’ll put the photo on the Instagram of the spray paint thing of her spray painting 5 billion. Not that you need that. Who cares, right. Jeffrey guns he talks about, about his mind being put into a probability matrix. This guy sees the future right? He knows. He talks about how they’re going to predict thoughts and behaviors which is essentially what social media is doing. They’re harvesting data. They’re essentially putting your mind into a digital matrix already.\n\nseen that before?\n\nNine a Ford is chasing her\n\nwacko irresponsible schemes. And now God knows what she’s written out there. And that was\n\nlast week I told her about the army of the 12 monkeys and possible Do you know why do you know why? Because you pathetically effectual and pusillanimous pretend friend to animals. I’ll tell you why. Because when I had anything to do with their six years ago, there was no such thing. I hadn’t even thought of it. Then how come she knows what’s going on? But here’s my theory on that. When I was institutionalized, my brain was studied exhaustively in the guise of mental health. I was interrogated, I was X ray. I was examined thoroughly. Then They took everything about me and put it into computer where they created this model of my mind. Yes, use that model, they managed to generate every thought I could possibly have in the next, say 10 years, which they then filtered through a probability matrix of some kind to determine everything I was going to do in that period. So you see, she knew I was gonna leave the army, the 12 monkeys into the pages of history before ever even occurred to me. She knows everything I’m ever going to do before I know it myself. That question, you finish here, I’ll meet you there. And if you forget one thing, I will have you shaved, sterilized and destroy what your great man\n\nJeffrey guns, he knows the script. They’re using our data to predict our actions and therefore control us. And in their defense, they claim it’s for our own protection, because we’re just untrustworthy. So James Cole, he comes back again, to 1996. He’s fully red pill, the doctor she believes in him. But now he doubts himself. He doesn’t believe his own self. And at this point, we really confirm that the movie has a hard on for keywest we see a couple commercials in the movie. At this point, we see a travel poster, and that is where they are attempting to flee. James Coleman Dr. So and so they’re going to go down to the key west to write it out and see what happens. Old nano Boomer Ville I’ve been there was a good time. Boomer Ville was Boomer Central. We find out it wasn’t I’m speaking another side note. Remember that there’s a thing called salt life that’s like every Key West boomers wearing assault life t shirt. When you get out of the game one of the founders of salt life a boomer Of course, right in his 50s apparently there’s allegations that he shot his 18 year old girlfriend or his girlfriend shot an 18 year old girl he was having an affair with a son like that. It boomers man they they’re living their best lives out here. That’s around 18 year old girls are talking about Salt Lake. Oh, yeah. Key West, right. So they’re going to Key West. So in 2035, apparently they don’t have any more salt life shirts in Key West, but in 1996 they do. They do. So they’re going down to Key West. And we find out as they’re traveling down there. They hear on the radio that the 12 monkeys, they weren’t releasing the virus. They were just living animals out of the zoo. Right? They were just a bunch of activist punks. So Brad Pitt this whole time has been a good guy. Or not that bad of a bad guy who should say they’re just trying to release the animals man. Now the real virus super spreader. The real psychopaths are the techno past the old pony tail and the biologist, elitist father is your Jonas Salk type folks, Bill Gates, all these guys. So they’re the ones really that are going to make this happen. And James Cole, he starts hearing the voices of Bob in his hand. And he’s yelling at some guy in the toilet in the bathroom and the guy. He’s, he’s dropping a dose and he’s so scared. He doesn’t even wash his hands. I’m like God, filthy human animals. Maybe they deserve it. He just runs out of the bathroom. But he hears these voices of Bob and we think of Project Blue Beam and then Elan musk neuro link I talked about Blue Beam in my alien book. how that fits into voices in your head and all that stuff. That’s in aliens. UFOs near call us illusion one if you’re curious. Now, James Cole he’s supposed to be he’s supposed to shoot and kill old ponytail at the airport because he’s having these flashbacks from childhood memories, right? This whole time. And another time traveler comes back and he gives him the gun because he’s at the airport trying to go to Key West remember? And the other guy’s like, row kill ponytail. From the future. You got to do this. Get your pardon. And James goes trying to catch up the point I was gonna shoot him he’s gonna do it. save humanity. But then foam security guards see all this go down and they shoot and kill James Cole. Cops, right. Good for killing now. Now the final scene is very revealing. We’re gonna play the clip here. And what you’re about to hear is 1996 James Cole just been shot and killed by the cops ponytail successfully got onto his flight with his suitcase with the virus because he’s about to spread it all over the world. And he sits next to a woman and she She turns out to share his same disdain for the human population.\n\nshootings even at airports Now, you\n\nmight say that we’re the next endangered species. Human beings.\n\nI think you hit the nail on the head.\n\nJohn’s is my name.\n\nThat was curious as this lady looks identical to one of the scientists on the panel and 2035 underground, put on the show, like subtitles and such. Like it, uh, you know, it shows her in the future as a botanist or something like that, right? But on the movie clip, in 1996, she says she’s into insurance, which I found curious. But you you hear the disdain for the human population, and therefore the virus is about to spread. This is every techno past fantasy. And then we’re going underground forever. Okay. Now, in conclusion, let’s wrap up with this, what you just watched. I watched this movie when I was like 18 or something like that. I remember being very bizarre, very hard to follow. And I don’t know maybe I’m a genius now, but I was. I was perplexed at how confusing the storyline was with the first time I watched it the first couple of times when it came out. Maybe it was because they were talking about viruses and quarantines, and it seemed like Bizarro science fiction. But we see how all that is not so much the case, right? It’s not so much Bizarro sci fi anymore. But the big idea here, it shows what appears to be a mentally disturbed person who’s actually the purveyor of truth. It’s talking about perspective and consensus reality. And you’ll notice how in the movie James calls memories, because it’s kind of weird. If you haven’t seen the movie, when he’s a child, he’s at the airport in Key West, and he witnesses himself from the future, trying to shoot all ponytail. But you’ll see how these memories sort of keeps replaying throughout the movie, and it morphs over time. And this is just like what I talked about in user illusion. One, when I talked about how Brian Williams, the journalist, had that false memory of the helicopter shootings. He swore he was in a helicopter, they got shot down in Iraq or whatever. But it was just because he had reported on it so much and heard so much about it that over time, his brain gave him this false memory syndrome. Now, ironically, in the same book I wrote, I cite Dr. Diana pusaka, who talked about the 100th monkey. In her book American cosmic I’m going to read you. The hundreds monkey was part of a backlash against the alien abduction cultural narrative, but hypnotic regression has persisted as a convention of alien abduction investigations. as scholars of film studies have begun to work with scholars have memory, the results may shed light on hypnotic regression and alien abduction. A recent edition of the journal memory studies was devoted to scholarship on memory and film, The editors write, quote, over the past two decades, the relationship between cinema and memory has been the object of increasing academic attention. The growing interest of film cinema repositories for representing shaping, creating, recreating, or indexing forms of individual and collective memories. So we kind of get a taste of this. And that’s what my argument is in user illusion. One, we won’t get into that now. But like the argument is that entertainment is indoctrinating us with thoughts beliefs, which will become reality of aliens and UFOs. Now, these tech Topaz, are they entirely wrong in their belief that humans are dreadful animals? I don’t think they’re entirely wrong. I know that’s controversial. I’m very sorry. I don’t think they’re entirely wrong. We do horrific things. Sometimes we do our best but men flawed, okay. We just are. My problem with them is how they try to handle it and how they try to control us. Like it’s just is what it is like people were as human beings were a mess, right? And that’s okay. And I love it. I think that’s great. We’re all just trying to do our best. But they want perfection. They want control. troll. They sell it to you with the illusion of safety, because it is an illusion, my friends. Now what’s funny is that James Cole, who, I’d argue is the Jesus Christ character, which we’re going to discuss next. On my final talking point, he’s trying to save humanity from itself. Well, guess what, so are the techno paths, they’re doing the same thing. They both think they’re doing the right thing. The techno paths, they’re on the satanic path. They’re destroying God’s creation to rebuild it because God’s creation is such a mess. Mankind has the worst. They want to scorch the earth and remove this material limitation of the human body on this prison planet. They bind to that Gnosticism argument you got to release the spirit trapped from the confines of the flesh Where’s James Cole he’s more the Christ figure. He’s trying to save humanity from itself as well just in a different fashion. Finally, last point, the religious element here we have as above so below many times in this right and I’ll give you another photo on the Instagram as it was on the the imagery we see of James Cole above ground and below ground you’ll notice when he enters both dimensions there they’re washing them down the scrubbing them down at the hospital above ground there Washington scrubbing them down underground and 2035 with them sweet buttcheeks Bruce Willis must have been hitting him squats hard in the 90s right? He didn’t skip leg day. Got them glutes. Now you guys are gonna think I’m gay? For sure. Now, forget it. Now this is all about the initiatory tale of verse wills. Okay, verse one says the Christ figure. You’ve seen it on the movie poster with the all seeing I’m walking up is the monkey sigil from the 12 monkeys logo. But you’ll notice it was called 1212 monkeys and you know that’s got significance. Because represents 12 disciples now in the mystery religion. They look to the number 13 and as the representation of the persecution of the Mystery Schools because Christ plus his 12 disciples is 13. Because the mystery religion, it’s all about the heavens, again, there’s your as above stuff, and the 12 houses of the zodiac and how each sign influences different areas of the sky. And all this new age Aquarius stuff. But James Cole, JC is your Jesus Christ character, okay? Because he plays the transcendent figure, beyond our limited understanding of space and time. And much like Jesus Christ himself when he died, he went underground to hell, to, to redeem, Adam and Eve the original centers from hell and redeem all of mankind, give them path to salvation, so that you can go to heaven when you die, when you repent of your sins. And notice the God in Jesus. They weren’t like they weren’t saying, hey, shame on you for being bad. They’re just saying, you have to acknowledge that man is born short of the glory of God, full sin. And you just do your best and you ask for repentance. That’s it. That’s all you gotta do. We’re only on this earth for a limited time before we slip into the next dimension. He’s not asking perfection. Right? I’m gonna put on my preschooler Hang on a minute. Let me grab it real quick. It was the 12 monkeys they are there. There’s kind of like a reference right? You got James called JC Jesus Christ. And then you got the 12 monkeys 12 disciples. And they’re following the seat of knowledge that James Cole dropped on Jeffrey Jones at the mental hospital way back in 1990. Right this further proves my point that James calls Jesus Christ character. Because we’re call and I’m gonna play I’ll play the clip for you. Jeffrey guns. He says at this party in 1996 because you know, Jeffrey guns gets out of the mental hospital. And in 1986 when James Cole gets sent back to find the 12 monkeys and Jeffrey guns. Jeffrey Jones confirms this at a house party and basically says, Hey, James Cole, you’re the one that dropped the seed of knowledge upon me way back in 1990 in the mental hospital\n\nGiannis black tie I mean I said drop by but it’s like that big do that senators Secret Service Yeah, hungry on we’ll killer feast we’re putting on tonight lots of dead lamb dead counted pig.\n\nHi, how are you?\n\non the hospital, yeah. Am I right? Anything about what you’re going to do? I can’t change anything. I won’t stop you. I can’t stop you. I just want the information. Ladies, so nice to see you again. Remember to watch your step on the way down. All right? Well, I just want access to the pure virus virus. Yes. For the future. I need to know where it isn’t exactly what it is. I didn’t get it. I see what you’re up to. It’s your old plan, isn’t it? Yes, you do. We were in the day room watching television. And you were all upset about the desecration of the planet which I understand. But then you said to me, wouldn’t it be great if there was a germ or a virus and wipe all of mankind, like the animals on the trees, just trying to confuse me?\n\nI told you my poem was this famous biologist and he said, Hey, he can make it and we can steal it.\n\nworld belongs to the dogs and cats. Just like worms.\n\nSo there you go. Confirmation. James Cole’s Jesus Christ. 12 monkeys are the 12 disciples. James Cole transcends the limitations of space and time to show man the path of salvation and the techno paths. They’re the worst. Right? So there you go. That’s the whole movie. What a trip. What a trip yet time travel. You got ponytail tech, no pants. We got the idea of creating a new world A new reality. based upon what these techno past thinks is best for us, because we’re such a mess. Which is very fitting if you give into the ideas of the New World Order the pursuits of the elite, globalist new goals, want to pursue a communist Marxist agenda, no trashing the future, through the Davos through the World Economic Forum, Klaus Schwab. And the great reset and all this stuff. That’s the argument. Right? Which reality Do you believe in? Which one do you subscribe to? That’s up to you to decide what you think about these things? What do you think long hard about these things? these are these are big concepts in this film, so I highly recommend it. That’s why it’s definitely on the top 50.\n\nI hope you enjoyed the show. If you do\n\ndrop a review on a rating for the podcast, I’m I’m thumbing through them again. It’s a good time, I guess. You can drop that on iTunes or wherever you’re listening to the show. stay subscribed and until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "12 Monkeys Film Analysis: As Above So Below, Technopaths and the Globalist Agenda! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we analyze the 90s classic “12 Monkeys!” We’ll learn about the 2035 virus, science nerds, questioning who’s really “insane”, mental divergence, and some As Above So Below symbolism! There are some tie-ins with The Sixth Sense, Prometheus, and the globalist agenda! We’ll turn the argument on […]", "url": "https://illuminatiwatcher.com/12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-01-11T13:58:06+00:00", "image": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/12/ctauc-12-monkeys.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["12 monkeys film", "12 monkeys movie", "12 monkeys film analysis", "12 monkeys movie analysis", "12 monkeys", "12 monkeys symbolism"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.instagram.com/isaacweishaupt/", "https://gumroad.com/isaacw", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/42845008", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda/?share=twitter", "https://illuminatiwatcher.com/12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%2012%20Monkeys%20Film%20Analysis%3A%20As%20Above%20So%20Below%2C%20Technopaths%20and%20the%20Globalist%20Agenda%21&body=https%3A%2F%2Filluminatiwatcher.com%2F12-monkeys-film-analysis-as-above-so-below-technopaths-and-the-globalist-agenda%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Pranav", "Isaac Weishaupt", "Theguru"], "publish_date": "2021-01-11T13:58:06+00:00"}