{"result_id": "165010", "URL": "https://illuminatiwatcher.com/ohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton/", "timestamp": "2023-04-25 15:35:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/ohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Ohio Train, UFOs & Movies: Predictive Programming in \"White Noise\" and the Matrix Plans with Nick Hinton!", "cleaned_text": "On today’s episode of the Occult Symbolism and Pop Culture with Isaac Weishaupt podcast (formerly known as CTAUC Podcast) we’re joined by a very special *RETURNING* champ- Nick Hinton! He’ll break down some philosophy on what is happening right now with the mix of UFOs, movies and toxic train crashes! We’ll chop it up on topics like Netflix’s predictive programming from “White Noise”, “Super 8”, Jordan Peele’s “US” and “NOPE” and how all this fits into the Sentient World Simulation ‘they’ are building for us! We’ll talk about the spiritual level and how the occultists are paving a gnostic path and MAYBE us truthers are HELPING them?!… We were only supposed to hit 15 minutes but ended up cramming 30 minutes to bangerville so strap in!\n\nFirst we’ll talk about the toxic chemicals unleashed in East Palestine, Ohio, the journalist arrest, then we’ll be joined by Nick Hinton to talk about some predictive programming in films and the global occult connection; then Isaac gets on the political soapbox!\n• Be sure to follow Nick Hinton on Twitter or Instagram (his handle has two ‘N’s, so look for Nick Hintonn)! His Twitter is https://twitter.com/NickHintonn and his Instagram is https://www.instagram.com/nickhintonn/\n• CHECK OUT the Aug 2022 show w/ Nick: “Conspiracy Black Pills, Male vs Female, AI Manifestation with Nick Hinton!” https://wp.me/p2ijVF-bkt\n• Go ad-free with 160+ bonus episodes, early access and books!\n• VIP Section (*with comparsion of VIP vs Patreon vs Rokfin): https://illuminatiwatcher.com/members-section/\n• Index of EVERY episode going back to 2014: https://illuminatiwatcher.com/index-of-every-podcast-episode-of-occult-symbolism-and-pop-culture/\n• Isaac’s books are all on Amazon and narrated for Audible: https://www.amazon.com/author/isaacweishaupt\n• Get your mega soft podcast shirts AND author-signed paperbacks: https://gumroad.com/isaacw\n• ONE STOP SHOP FOR ALL SOCIAL MEDIA AND OTHER LINKS: AllMyLinks.com/IsaacW\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by supporting the show on any of the three platforms!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Ohio Train, UFOs & Movies: Predictive Programming in White Noise & the Matrix Plans w/ Nick Hinton!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nHow to Support the show:\n• Go commercial free with bonus content by getting in the VIP Section!\n\nYou can search through to the ENTIRE catalog going back to 2014 at this convenient post I created:\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\n*When you sign up for my email updates you’ll get a FREE copy of my first full length book: A Grand Unified Conspiracy Theory: The Illuminati, Ancient Aliens and Pop Culture! Sign up here:\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the Occult Symbolism and Pop Culture podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons) and “Breaking Social Norms.” He has been a featured guest on Tin Foil Hat podcast (honorary member of Mount Crushmore), Eddie Bravo’s “Look Into It,” Ground Zero with Clyde Lewis, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter! Signed paperbacks available at Gumroad.com/IsaacW!\n\nONE STOP SHOP FOR ALL LINKS: AllMyLinks.com/IsaacW\n\n*STATEMENT: This show is full of Isaac’s useless opinions and presented for entertainment purposes.\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nIsaac Weishaupt 0:04\n\n You’re listening to occult symbolism and pop culture. I’m your host, Isaac wise up. Today we’re calling the boys run on a train. The train got derailed in East Palestine, Ohio, and we’re here to talk about it today. That’s right. Today’s show is going to be a very special episode. First, we’re going to talk about this incident, if you haven’t heard about it, because the mainstream media seems to be a little quiet about it. We’re gonna talk about the toxic chemicals unleashed in Ohio, the arrest of a journalist, then we’re going to bring in a very special guest. He’s the returning champ. I had him on just a couple of months ago. But he’s back. And his name is Nick Hinton, you know Him, you love him. And he’s going to join us to talk about predictive programming and films. And the global occult connection, we’re going to talk about why this matters on a higher cosmological spiritual level. And, and we get into all kinds of stuff. We’re going to talk about this mix of what’s happening in the world right now. Because it’s crazy. We got UFOs crashing, no, you know, we got UFOs getting blasted from the skies. We got movies, showing us predictive programming of train crashes. And he and I, we’re gonna, we’re gonna chop it up, we’re gonna talk predictive programming from films such as white noise, which he’s got some crazy information about that. Because you’re not gonna believe, you know, plot spoiler, but when Nick gets on, he’s gonna tell us about how this film, white noise on Netflix was actually filmed in East Palestine, Ohio, with people from the town. So they already experienced it in the movie, now they’re living it out. And we’ll talk about how that fits into the UFO agenda. To talk about Super Eight, we’ll talk about Jordan peels filmed us and Nope. And this and, you know, this kind of discussion leads into the digital matrix, which is what he’s gonna tell talk to us about the actual real one they’re building. Then at the end of the conversation, you know, I like to play devil’s advocate, I’m not just a blind truther sometimes I question the truth or perspective. And we take a look at maybe just maybe, US truthers are assisting in these occult psychopaths creating this digital matrix and shoving us all in it like a like a bunch of sheep. Are we participating in revelation of the method? And if we are should we want to talk about it? So without and you know, things are nuts, right? A testament to how nuts things are. I had planned I have been researching and reading and compiling notes on the Wizard of Oz I got three episodes it’s a mega deep dive on Wizard of Oz. Of course I wanted to drop it as part one two and three week to week week. But as you can tell that’s not happening right now. We’ve got devil worshipping at the Grammys and Rihanna illuminate confirming at the Super Bowl. And we’re gonna look we’re gonna come back to the Super Bowl because I got to also got a big mega TMZ show we’re gonna do we’re gonna talk about how the video cameras at the Super Bowl on the TV cutaway precisely at the only moment in which Rihanna threw up the triangle A manifestation if you saw it on my Instagram, I posted it unbelievable. Unbelievable. They knew what they were doing. But anyway part three of Wizard of Oz is going to be out next week barring any other insane all things that could possibly happen knock on wood I promise you it’s happening. Oh man so Anyway, without further ado, let’s get into it. What happened in Ohio you know a lot of people hate Ohio I love Ohio. I think it’s a great place. I went up to me and some friends and and my, my life went there years ago to Sandusky and Columbus great little town got kicked out of a bar because I’m so cool. I was I was dancing on top of a table like I was a chicken coyote ugly and I thought it was adorable and they did not all right because that was back when for logos had the lethal combination of alcohol and caffeine. All right. Anyway, Okay, moving on. I’m now a Christian soldier though I don’t drink like that. I don’t drink like that. Not the to be a Christian soldier do not drink for local I still drink them now. This train derails in East Palestine Ohio, which let’s talk about how bizarre the the naming of this like for instance, a month ago we talked about the serial killer up in Moscow, oh, Idaho, Moscow, Idaho hoody knew these towns existed. And now it’s Palestine, Ohio. Bizarre, bizarre. And Nick’s going to talk a little bit about the Palestinian connection there when we get him in here. Blue is this train crashes, as you probably already know, unleashes toxic chemicals. The main culprit that they always talk about is the vinyl chloride. What is that? It’s what they used to make a bunch of plastic tchotchkes which is the bane of my existence. I hate this. I hate it so much. If you listen to this is where I get OG granola walks around you’re right you’re gonna get super OG granola woke today, my friends if you listen to my other show I do called breaking social norms with with my wife, Josie. We did I believe it was a Christmas episode. I don’t remember we talked about how stockings are such a waste because you filled with all this plastic candy crap like m&ms makes this candy cane there’s like five m&m minis in it and it’s like, cool. That’s gonna just be here forever. It’s never going to biodegrade I hope that was worth it for nothing. Nobody cares. Go back to Chevron and orange and the sock in the stocking. Hit these spoiled brats over the head with it I don’t know. No don’t do that. Sorry, is you’re on look I’m gonna still on altra High Tea Isaac mode. I don’t know if you know that. The last couple of episodes have been very aggressive. Anyway, Vana. So I think Dahmer that could happen to this country. But yes, the crap they used to make. And I’m just using this as an example, I have no idea what the actual destination was for this, this chemical. But it was probably on its way to the m&m factory for Christmas tchotchkes. And now a bunch of animals have to die and people can drink the water. And people probably got cancer now. There is some people that are calling it the Ohio, Chernobyl. Are they being excessive other being extra? I don’t know. I don’t know. But on February 3, this happened, which as of this recording, which is on February 16. That’s damn two weeks ago. And the officials in the town did an evacuation order for everyone within one or two miles of it. Then the company that owned the trained Norfolk Southern on February 6, they did this controlled burn to release the vinyl chloride into the air because I guess there was some worries that it was going to explode which would have been even worse. So now you can see photos of this plume of black smoke going up and up in the skies, a massive black cloud. And now we they got a bunch of acid rain. And the air quality is garbage. people’s throats are screwed up and animals and chickens are dying out 100 miles away 100 miles away. Animals are dying 1000s of fish dead. But the officials in Ohio assert there’s no proof. There’s no causality. This is from this insane, toxic chemical blown up. Okay. It’s it’s gaslighting at its finest. I think. I believe if you’ve ever seen the Erin Brockovich movie, this is kind of what it’s about. It’s about these company. I mean, the and I’m gonna get on my soapbox after Nick joins us. And, and Nick does not endorse any of my opinions on this show. I don’t know what he believes on this type of matters. So he he is not endorsing any of Isaac’s opinions today. All right. Now, a journalist and this is where I first started this on February 4, or fifth or something like that. I saw tick tock of a journalist getting arrested. And Josie you know, she says be tick tock and she’s like, is this real? I don’t know. I never heard of it. What happened to train wreck? I don’t know. And I looked and I watched the video sure it looks like they’re just arresting this journalist guy. And if you look it up Newsweek says it’s misleading video. Really? Well. I’m gonna read you from Newsweek. It says the claim that he was arrested for reporting the truth, viewed on its own is misleading. While Lambert was removed from the venue and arrested the clips shared by green viewed alone does not provide all the facts. Oh, tell me more.\n\nAs noted by news nation, Lambert was in a room full of other journalists doing their job. So there is little likelihood that police or officials were trying to prevent the truth from being reported. They’re claiming There was a lot of journalists reporting on this, but I’m here to tell you folks, this train thing was not a hot topic on the news. Regardless of one’s views of the incident, the footage shared by green editorialize as the facts fit it in, among other claims about underreporting of the Ohio derailment story and may create the impression of a more conspiratorial plot. News nation has defended its reporter with its Washington Bureau Chief Mike Vokera, telling the channels on balance host Leland vidit on Wednesday, that Lambert behave professionally while being manhandled. He added that Lambert was taking very talking very quietly to the camera and reporting on a very critical story of interest to the public. All right. So this journalist gets arrested. And the claim is that he was like trespassing or doing some stuff he shouldn’t have done. Do you believe that? Or do you think there’s a scramble to cover up Chernobyl just like you saw if you if you? Look, I didn’t read no books about Chernobyl, but I did watch a whole show on HBO. And this is exactly what happens, man, you get scientists and politicians and corporations. And you get all these financial motives in meshed with things and power hungry people. And bad things happen. They want to cover things up. They want to downplay events. Then later when it gets out and people find out how horrific things are then it’s like, the blame game of well, it wasn’t me, Lou, you know, and that’s what was probably going to happen here. Then, yesterday, I’m going to read you from Newsweek. Speaking to a local news channel, Wk bn silky haggin Cassiano. Caggiano is a former Fire Department battalion chief in Youngstown, Ohio, and hazmat technician for 21 years. And he said, we basically nuked a town with chemicals so we could get a railroad open. I was surprised when they quickly told the people they can go back home, but then said if they feel like they want their homes tested, they can have them tested. I would have far rather they did all the testing. And the idea here is that between the government on different levels, and the train Corporation, they’re rushing people back into their homes and saying, hey, everything’s fine. It’s good. Get back in there, because they’re trying to minimize the damage and collateral damage is going to happen from this. And I read that they treated the chemical with some other chemical. I’m going to talk to you about it later on. Some people talk about like chemtrails, they’re using Kentrell clouds to sort of do this stuff. And I mean, these people are living in a chemical warfare zone basically. And anyway, let’s talk about the predictive program. I’m gonna set you up for a longer conversation I have with Nick All right. And he goes into more detail on all these things. The predictive programming is odd. All right, and I’ll have a rational sort of reason for that after Nick You know, yeah, this net Netflix film white noise I tried. I tried so hard to watch this. I really wanted to. I liked the trailer a lot. I think Adam drivers are pretty interesting actor. And I hate it so much. It reminded me of a Wes Anderson film and then I I researched it just for this show that I’m doing right now, and found out that the director Noah Baumbach, actually collaborates with Wes Anderson, so there you go. It’s like a Wes Anderson movie is pretentious. And I don’t know. Just not my cup of tea, right? I know some people love Wes Anderson movies. That is not me. And look, I love David Bowie. And I love Bill Murray. I still can’t take it. I can’t do it. Then, let’s see here. But yeah, and that in the movie white noise this happens a train accident in Ohio happens and unleashes deadly toxins and forces evacuations just like in real life. Some other toxic, toxic Avenger. Remember that is a janitor who turns into a monster after being exposed to toxins returned to the living dead in the 80s was about this toxic gas getting released and turning people into zombies. I believe Resident Evil is on par with these kinds of things. And Super Eight of course, which I believe is Spielberg is it not? And shout out to Nick he’s the one who Hit me up about this. And that’s what started our conversation. I said, Man, why don’t you just get on the show and explain it to me? Explain it to me like I’m five. But actually forgot about this movie. It’s been so long since I’ve seen it. And I’m gonna read you the plot. It’s about a group of young teenagers in 1979, who are filming their own Super Eight movie when a train derails, releasing a dangerous presence into their town. The film was shot in West Virginia and surrounding areas portraying the fictional town of Lillian Ohio. Man these these illuminate confirms hate Ohio so hard. So they could even change the fictional location. They’re like, Nah, it’s going to be Ohio. So there you go. Ohio is destined to have train wrecks and aliens, I guess. And is that where they took the Roswell crash stuff? They took it to Wright Patterson in Ohio. Something going on there. If you read Peter vendus sinister forces books. He talks about different areas around there, West Virginia, Kentucky, and I think Ohio is included in there. If I’m not mistaken. It’s been a while since I read it as being sinister places. Places that the Native Americans and other folks thought there was how no vortex is portals, what have you. But in the film Super eight it says the film tape recorder revealed that in 1958, the Air Force captured an alien when it had crashed landed. They experimented on the alien, while withholding its spacecraft composed of strange white cubes, which allowed the craft to shape shift. The alien had established a psychic connection with Woodward, convincing him to help it escape Earth. But Nelleke sabotage, discredit it and discharge Woodward. I do remember that because I covered this film on my blog back when I watched it. I couldn’t find the posting, I must have deleted it. But I believe that the white cubes were shaped into a larger white cube, which is interesting because Tracy Twyman talked about how the end of the world happens when a white cube and a black cube meet on a vertical axis pole, right? The dual polarities meet up. And this is kind of similar to what we’re going to talk about and Wizard of Oz, part three, with the you know, the good, the good, which is being on the north south vertical axis, as opposed to the evil which is being on the east west axis, the horizontal axis. Because the material world is considered evil to these folks. And ascension and dissension of consciousness is the good part. We’re gonna talk about it and Wizard of Oz part three. But for now, let’s switch gears. Let’s bring out the man the myth, the legend. Nikken. Take a listen. All right, we are humbled to have the great Niken returning to the show, returning to provide some interesting insight into what’s going on in the world today. A little mix of UFOs with the train wreck, the train wreck, yeah. And and so on. Nick, what’s up, man?\n\nUnknown Speaker 18:20\n\n What’s up, man? Thanks for having me back.\n\nIsaac Weishaupt 18:22\n\n Yeah, definitely. You were you were a big hit on the last one. And we definitely crossed similar research path. So I wanted to get your take. Because you always have these hot, interesting takes. I’m not sure where you want to start. But when we were talking about this stuff offline, we were talking about the toxic spills. And you know, there’s this movie Super Eight. Have you seen it?\n\nUnknown Speaker 18:47\n\n I have not seen it, but someone sent it to me. And yeah, it just seems to be very synchronistically tied with the events that are going on right now. Yeah, that movie and white noise. So white noise is basically about a train crash in East Palestine, Ohio. That causes a chemical spill and explosion and all these things, people are put in quarantine camps, forced to leave home. And one of the interesting things about that movie is one of the themes in it is simulacrum, which are it’s basically a more fancy philosophical version of simulation theory. That’s the best way I’ve learned to explain it all. But anyways, yeah, so someone sent me this movie. White Noise another person sent me this movie, Super Eight super eights kind of about the same thing. It’s about a train crash and Ohio chemical spill explosion but an alien escapes from this train. And interestingly enough in white noise there’s also UFO references but not like super obviously it’s like there’s a song in There are things about UFOs. And the government knowing more than they’re telling people and just some weird stuff.\n\nIsaac Weishaupt 20:06\n\n Have you seen the movie? Wait,\n\nUnknown Speaker 20:09\n\n I haven’t seen any of these movies.\n\nIsaac Weishaupt 20:13\n\n I tried to watch white noise because I actually saw the trailer when they first debuted it. I thought it looked interesting. And I made it about a half hour and just gave up because it’s, it’s kind of like Wes Anderson movies, which some people love them. It’s just not for me, my best friend loves Wes Anderson. I think it’s pretentious. Crap. I just couldn’t, I couldn’t do it. And then now we got this train thing. So I’m like, Okay, let me I’m gonna give it a second shot. But yeah, it is interesting how it has this toxic train spill, and it, it initiates a sequence of events and so on.\n\nUnknown Speaker 20:48\n\n Yeah. And so the interesting thing, you know, like I said, it’s about, there’s this theme in there of like simulacra, and simulation.\n\nUnknown Speaker 21:00\n\n that’s in white noise. So sorry, we shouldn’t we shouldn’t have talked about both movies at the same time. But in white noise. Yeah, there’s like this barn that plays an important role. And it’s like the most photographed barn in the world or something like that. And so everyone wants to go to this barn. And this deals with the theory of similar like, this is like the original book, white noise was a kind of like a postmodern work. And so it dealt with a lot of these themes. And the barn because it is the most photographed barn in the world, that becomes like something more than it actually is, it becomes like this theme park almost like, there’s this aura of mystery around it. And there’s all these signs leading up to it. And you know, to imagine what a simulacrum is like, kind of imagined, like Disney World or something like that, where it’s like this fake world. That’s kind of based on unreality to begin with, like, there’s all these fake representations of Mickey Mouse and Magic Mountain and stuff like that, like those are representations, but they don’t represent anything real, right. And so some philosophers have compared all of society to a simulacrum, or a spectacle, postmodern philosophers. But anyways, this idea is super interesting to me because the film was shot in East Palestine, Ohio, it’s about East Palestine, Ohio. And there’s a CNN article floating around right now that’s like, Oh, these locals are now living inside of a movie they helped create. So, so literally, it’s like these layers of inception. And you know, it’s a, it’s a fiction, it’s a true fiction. It’s a hyper reality, you get what I’m saying? Like, yes, they’re living in the simulacrum, that they made a movie about?\n\nIsaac Weishaupt 22:36\n\n Yeah, it’s, it’s just so the Jordan Peele film nope, about you of Oz. I’m not gonna spoil the plot or nothing. But that seemed to me when I watched it. Because I’ve been, I’ve been looking at the UFO phenomenon from this angle of film, entertainment, predictive programming, and, you know, similar stuff to what you’re always researching and talking about, it’s the powers of the mind and how the powers that be through MK Ultra and so on, have tried to find a way of through occult practices, I believe, to bridge Yeah, through chaos, magic, cross making hermetic action type stuff, right. And in Nope. I think Jordan Peele was trying to present this idea of through focused thought patterns, basically, they can manifest whatever they want, they can create their own reality. And that’s interesting. That East Palestine where the train wreck happened, you said it was filmed, either there or with some, some supporting actors. From there,\n\nUnknown Speaker 23:42\n\n it was literally filmed in the same place that the movie takes place. And yeah, and the locals were used as backdrop actors. That’s bizarre. Yeah. And so this idea of like, simulacrum, or, you know, simulations and mirror worlds, and inception, things like that reminded me of the sentient world simulation, which is a quantum mirror model of the world that the DoD is working on with the with a Purdue University. And they’re also trying to create like 7 billion digital doppelgangers of everyone on this planet, like, like, everyone has their own virtual voodoo doll or, you know, Avatar, basically, that is created using all the data that we are mining on a daily basis through the internet of things and like your preferences, your likes on Instagram, all these things that we’ve downloaded for free, right, Google Maps, whatever.\n\nIsaac Weishaupt 24:36\n\n That’s fascinating, because I remember reading about this sentient I think it wasn’t 2020 it was. I don’t know how old this is. Right. But I recall maybe reading about this in 2020. This idea?\n\nUnknown Speaker 24:47\n\n Yeah. So the 2021 was when the World Economic Forum actually, like, started talking about it. Okay, and made it not so secret, but it’s been around since like 2008 or 2009. Ain’t\n\nIsaac Weishaupt 25:00\n\n Interesting. Okay, so So I got something to bounce off of here. Have you seen Jordan peels? What’s the other filming? He did? He did three film three big films get out. I guess get out would fit into two didn’t know but us the other one with the doppelgangers. I haven’t seen it. Okay, so that plotline is basically and as above so below sort of thing where underground, they have people, these doppelgangers living more or less parallel lives or something to that effect. It’s been a while since I’ve seen it. So that sounds very, eerily similar to the sentient world simulation where maybe they’re trying to do a soul below kind of version of reality. And then, simultaneously, just today, I was reading I live in Utah, right. So the local news here, the the politicians are trying to pass legislation that would require anyone who uses social media to have some kind of identity verification, and the digital ID. And that would fit into this because that and that was what I was complaining to my wife about. I said, this is BS, because, you know, this is as the same BS I call out on when they required the ID check in for Pornhub in Kentucky or wherever they did that. It’s it’s them profiling and sort of refining this data set to, you know, more or less try to create this maybe sentient world simulation version of us these these more accurate avatars that, to me, this digital matrix thing is definitely one of the End Games. Now, do you think that do you think that there’s a something related to white noise? The sentient world simulation? Yeah, train wrecks going on?\n\nUnknown Speaker 26:44\n\n Yeah. So my mind was brought to the sentient world simulation, because you know, the white noise movie had the theme of simulacra minute, you know, hints about UFOs. And then, you know, it’s kind of synchronistically tied to Super Eight because again, it’s about this train derailment chemical explosion in Ohio. Alien escapes from the train it you know, it’s interesting, you brought up just a US was the one about the parallel lives underground. Yes. Yeah. So this alien escapes the train. And sorry, this is kind of a spoiler, I’m not gonna give too too much away. But it’s more about the symbolism. This alien escaped underground into this tunnel system. And it steals all of these electronic devices from the town and it starts kidnapping people as well. And so when they go underground, they see all these people and cocoons hanging from the cave. And it’s also creating this like aI hive mind thing with all the electronics that it’s stolen, though.\n\nIsaac Weishaupt 27:35\n\n Are you talking to the film? Super Eight?\n\nUnknown Speaker 27:37\n\n Yes, yes, this is great.\n\nIsaac Weishaupt 27:39\n\n I actually watched it in the theaters when it came out. But this was, you know, early stage Red Pill Isaac. So I mean, this was probably, like, 2011 or 2012 or something?\n\nUnknown Speaker 27:49\n\n Yeah, yeah. It’s pretty old. But um, yeah, so that also, you know, that imagery reminded me of the AI hive mind because what people think that the sentient simulation is trying to do is actually quantumly. entangle the avatar with the real person kind of link you up with a digital doppelganger. So it’s kind of like the Invasion of the Body Snatchers, right? Where people won’t be actual clones are actually replaced with a new person, but their minds will be replaced with the mind of the AI controlled consciousness within the simulation. There’s technology now that we’re aware of where they can deliver paramagnetic nanoparticles through mRNA vaccines that can control neurons through magnetic fields,\n\nUnknown Speaker 28:36\n\n being emitted from even cell phone towers. And this is all document this is all real. There’s\n\nUnknown Speaker 28:43\n\n lots of ways they can do this actually, through blue light, even they can stimulate neuronal control. And so like I said, the theory is that what they’re trying to do is literally create an AI hive mind by merging people with their avatar within the sentient world simulation.\n\nIsaac Weishaupt 29:01\n\n Have you seen the Ray Kurzweil nanobots that they’re talking about putting into people’s bodies to\n\nUnknown Speaker 29:08\n\n Yeah, to create an augmented reality? Yeah. Beaming radio waves at neurons?\n\nIsaac Weishaupt 29:13\n\n Is that kind of similar to the idea that you’re talking about here with the mRNA stuff?\n\nUnknown Speaker 29:17\n\n Yeah, yeah. So these nanoparticles, there’s a whole bunch of different ways. They figured out how to do this, like Yeah, so Ray Kurzweil was talking about people just breathing them that breathing them in the air, because you know, it’s in. Supposedly, it’s in chemtrails. That’s kind of a conspiracy. But what we do know for a fact is that scientists are saying, Hey, we created smart dust, which is like these super tiny supercomputers that emit radio waves. So, I mean, it’s kind of like the groundwork for something like Skynet. But also, it’s a transhumanist technology, like they’re, you know, this is the kingdom of iron and clay that the Bible talks about right at the end of time where I’m It’s an unstable kingdom because iron and clay do not mix correctly. But a lot of you know endtime scholars say that this is representative of a transhumanist society, which is interesting because in white noise after everyone’s quarantined, they relocated to a city called Iron City. And it’s also interesting that this happened in East Palestine because Palestine is the Holy Land. Well, what is the Holy Land, it’s the temple of God, the temple of God is the is the body. And people’s bodies are being invaded right now. Not only through toxins, but through this push for transhumanist technology.\n\nIsaac Weishaupt 30:31\n\n That’s interesting. And even in the The Epic of Gilgamesh, the Mesopotamian creation myth, they talk about trans humanistic ideas, too. So there’s, there’s something to that, you know, I can’t help but think there’s some kind of spiritual battle happening and and I thought I had a realization the other day, about about this, this idea, because I’m oftentimes when I read about the occult philosophies and ideas, sometimes I’m I sit here and I think, man, I don’t know that that’s wrong, necessarily, like I kind of, I kind of have this role of, more or less, exposing these occult teachings in entertainment, or whatever. And I’ve got a background as an Orthodox Christian. So there, I’ve got a bias there, right. But sometimes when I read these occult practices, I think, man, I don’t think it’s all that much different than some of our Christian practices. And I also don’t think some of this is necessarily evil or wrong. So I had a thought about that hermetic axiom as above so below, which basically says things out there in the cosmos in the macro, kind of reflect mirror and resonate with things down here in the micro meaning, and you already know the stuff and tell it for the audience. But the idea that I as an, if I’m an occultist magician, I can sort of focus my energies to have the universe rearrange itself and provide a path towards what I want to happen is kind of the idea. And I think using that same logic, we could argue that we are in fact, having a spiritual battle on some level. When you think about the concept on the micro have a person I think I have some good and some evil in me, I could, I could easily do either thing, depending on my mood, or my influence, or whatever. And I think that same concept, if you want to take it to, as above, so below, would go out to the cosmos out to the universe where there’s a struggle there between good and evil, and I think we’re seeing manifestations of it. You know, I don’t want to get to end times, but it sure seems like there’s manifestations of a battle between good and evil and sort of letting humanity decide how they want to move forward with things.\n\nUnknown Speaker 32:41\n\n Yeah. 100%. Um, but part of me wonders if, you know, there’s very obvious examples of how as above, so below, like works in nature and stuff. But I sometimes think that maybe the occult worldview is kind of being forced on us. And they’re trying to actually create it and make it true through their hyper reality, simulacra rooms, chaos, magic, things like that, like this sentient world simulation, this mirror world that literally is like, the Samskaara that they believe in, right? And so they are kind of initiating.\n\nIsaac Weishaupt 33:18\n\n Samsara. Is that like, the Buddha’s word for heaven or something like that?\n\nUnknown Speaker 33:21\n\n Yeah, that’s like the dream, like around the wheel of reincarnation, or the illusion of reality.\n\nIsaac Weishaupt 33:28\n\n Okay. Oh, yeah. I’ve heard like Maya in Yeah.\n\nUnknown Speaker 33:31\n\n Okay. Yeah, so it seems like they’re initiating us into that fake world. And, like a lot of these events, you know, even the train derailments in the UFO is like, it seems like, mostly everyone. You know, it doesn’t take a genius to see that these things are suspect, right? It’s almost as if they’re being presented to us in such a way that they’re obviously fake, obviously orchestrated, like the real events. But there, there’s a layer of fakeness to it. Like there’s that inception. And so the sentient world simulation is up and running, and it’s studying us. It’s almost as if we’re kind of like rats in a maze, being studied and playing this, you know, conspiracy themed alternate reality game. And to explain what an alternate reality game is just real quick, it’s kind of like, my favorite way of explaining it is Imagine you’re walking down the street and you find this poster, the strange poster on the ground. And it says, like, are you having strange dreams? Or do you think you’re special? Bla bla bla, do you have some kind of Destiny like this has actually happened before? But now imagine you call the number on the strange poster and some kind of, you know, crazy Easter egg hunt and Seuss, right? Except, what you don’t know is that the whole thing was an elaborate prank played on you by social scientists and some rich guy. So it was real to you. But fake in a way. Right? Interesting. Okay. And so I think that’s what’s kind of happening right now through the metaverse, right? Like we’re all living vicariously through these events that are presented in a way that’s very obviously suspect. In the internet. We’re watching these events take place we’re going down On the rabbit hole being initiated into that lab that psychological labyrinth, right that is created through conspiracy theories. And we’re all trying to uncover the truth of these things. While at the same time we are just mining data in that digital cave for our digital avatars are digital doppelgangers, whatever.\n\nIsaac Weishaupt 35:21\n\n Does that you? Are you thinking that? This is\n\nUnknown Speaker 35:24\n\n like a social experiment in my opinion?\n\nIsaac Weishaupt 35:27\n\n as, like, if I if I were to put on my conspiracy theorist truther hat, you think that I’m sort of people like me or whatever are contributing to their plans in some way by talking about these things? You think?\n\nUnknown Speaker 35:40\n\n Um, yeah, I think we all kind of are in and it’s not on purpose. Like we all have good intentions. Right? Right. Right. But the fact that this is all becoming so mainstream is very suspect to me. And it seems almost like it’s right out of the movie divergent or Maze Runner, right? Where they take like, the smartest people, and they put them through these tests and trials. And, you know, to create their enlightened utopia, like the the vision for Crowley’s like, like his angle was not like this dystopian fascist, dark satanic world. It was like an enlightened Utopia ruled by Ascended Masters. Yes. And it feels like we’re going through the deep dark lab. And so we can find the light at the end of the tunnel. But that’s by design, in my opinion. Oh,\n\nIsaac Weishaupt 36:24\n\n interesting. Yeah. I’ve often wondered if we’re participating in the revelation of the method where yeah, they, they know that the authority figures can’t come out and say, Hey, here’s what you should believe. It’s may be that they’re sprinkling these ideas and entertainment and having people like me be like, Hey, look at this, you know?\n\nUnknown Speaker 36:45\n\n Yeah. So what happens when you decrypt something, you activate the code, we are almost becoming agents of revelation itself, right? Like, we are the people that are kind of tearing down the veil, in a way for\n\nIsaac Weishaupt 36:57\n\n saying, okay, like, like, maybe for years, they’ve been pushing these messages and these symbols and these ideas, but now with the internet, and the different, I don’t know, information age, we can. Now we’re actually more or less participating by explaining how all of these systems work. And they could be using this to somehow fuel they’re, like you said, you know, all those occultus Croley, and Francis Bacon, and all these folks, they all wrote about this fantasy world that they wanted to create of, you know, the technocratic society or science and like you said, the Ascended Masters and things. So I do think there’s some there’s something to that. I don’t know how to sort of move forward with that. I don’t know that it necessarily changes anything for me. But have\n\nUnknown Speaker 37:48\n\n you read to lon, by Jorge Luis Borges, no. So it’s literally about a group of writers within the Illuminati. And at first, they are like, hey, you know, they’re all having a meeting. And they’re like, Hey, we should create our own country. And eventually, they’re like, Nah, that’s too humble. Like we should create our own universe. And so the way they create their own universe is by writing the series of encyclopedias with totally fake histories, but they present them as real to people. And then that imaginary reality begins to leak into the real world and overtake it slowly, kind of like a virus right?\n\nIsaac Weishaupt 38:25\n\n Oh, interesting. Yeah. Isn’t that the guy did morning of the magicians that the Ancient Alien theory was based on? You ever heard of that?\n\nUnknown Speaker 38:34\n\n I’m not sure. No, I haven’t heard that. I know he did Library of Babel.\n\nIsaac Weishaupt 38:38\n\n What’s the what’s the guy’s name? Again? I’ll type it up what you’re looking for. You’re talking\n\nIsaac Weishaupt 38:46\n\n Oh, maybe that’s a different name.\n\nUnknown Speaker 38:47\n\n Anyway. Okay. Yeah. So like back. So just to finish my thought on like, the whole decrypting thing. decrypting thing and like activating the code activating revelation. It’s like, it just reminds me of like the the seeker in many movies, who goes looking for some lost hidden treasure, and then accidentally opens a sarcophagus and releases a curse, right? Like that seems we’re kind of opening we’re being prodded into opening Pandora’s box in a sense.\n\nIsaac Weishaupt 39:14\n\n Oh, wow. You mentioned on there on our text messages, something about Babylon working like you know, the Jack Parsons\n\nUnknown Speaker 39:27\n\n did. Yeah. So I feel like a lot of what’s going on right now it’s kind of a version of that the initiation into the into the mystery Babylon religion spoken of in Book of Revelation. Because like I said, I think that what’s going on right now, like the reason for these limited Hangouts, these, this dripped information, you know, the, the powers that be exposing themselves. I think it’s all being done on purpose. It’s kind of being orchestrated. It’s like a Like a controlled demolition right of the old system. So like they’re exposing their scapegoats, right? So they can sacrifice them and bring in the actual New World Order, right. So they’re showing us the World Economic Forum, they’re showing us, Klaus Schwab dressed up like a supervillain, because it’s all meant to be obvious. They want there to be these Gnostic revolutionaries who are pissed off and want to take down the old system. So when the real thing comes, they’ll think, Oh, the good guys one, you know. And so like, in a sense, this is a Babylon working like what’s going on right now with the black cube cell phone, right? Like it’s a, it’s a direct portal into the worldwide web Well, that was created at CERN, which many people will on your show probably already know, that’s a portal into the abyss, whether that’s literal and metaphorical, I don’t know. But if we are literally going down the rabbit hole or going into the abyss, every time we enter that psychological labyrinth of research and conspiracy theory, in these rituals of initiation, what happens at the very bottom of the abyss is that they is that the adduct unites with the divine feminine and become spiritually reborn. Well, the divine feminine is represented by you know, Babylon and all these other goddesses, such as Artemis Artemis, you could kind of compare her to a goddess of cloning. She’s covered in execs, right? And so I wonder if by going into the abyss, that we are actually being spiritually reborn in a false way, because we are actually merging with our digital clone or feeding it in some way.\n\nIsaac Weishaupt 41:29\n\n Oh, wow, man. Yeah, that’s very much like the, the Joseph Campbell’s hero’s journey, right? When\n\nUnknown Speaker 41:35\n\n exactly, which is based off the orphic mysteries. Wow, okay. That’s, yeah. And that’s what conspiracy culture is, you go into the abyss, you kind of lose your mind a little bit, you come back with the mystery of the gods. And then when you come back up to the realm of the mortals, you reveal the mysteries of the gods. And at least in the myths, you know, Morpheus gets his head cut off. Well, what happened to JFK the person who basically facilitated the term conspiracy theory, right, he talked about conspiracies, guys had blown off. And then he became a kind of white rabbit to follow into that realm. Right? He became another gatekeeper. It you know, so like, the, the whole point of like, seeking the mystery is to become mortal, right? Like, that’s what the alchemists are looking for, you know, the elixir of life. Well, in a sense, you do become immortal when you figure out the mystery, right? Like JFK was immortalized. And many famous researchers who have gone too deep, they’ve also become immortalized in the sense that the conspiracy theorists became the conspiracy. And because they became the conspiracy, they’re another white rabbit to chase into the abyss and try and figure out their death, figure out what happened to them. And then you end up exactly where they were. The Fool’s Journey always ends on the altar if you take it too far.\n\nIsaac Weishaupt 42:53\n\n What do you mean like the altar of sacrifice?\n\nIsaac Weishaupt 42:59\n\n Because because I think, when I’m what we’re talking about, if you want to go to the orphaned mystery, Hero’s Journey sort of aspect, if I’m the conspiracy theorist, and I go searching in the dark, which is actually an interesting metaphor, because I’ve heard that almost identical phrase, a lot of people who, in my personal life, I tell them about this stuff. And I always get this reaction of like, how do you do that all day? Like, how do you how’s it you’re always looking at this dark stuff? And I’m like, I don’t know. It doesn’t feel dark to me just just seems like but I watch a lot of horror movies and craps on desensitized, but a lot of people view it as a really dark realm. And I get it right like, there are some dark aspects. But in the hero’s journey, the the conspiracy theorist slash hero would go into the abyss, face the darkness, and come back with the boons and that’s, you know, the conspiracy theorists, we say, hey, we found these symbols or whatever, then we come back to the real world and tell tell everyone, hey, I’ve got this knowledge to bestow upon you. And in the hero’s journey, it creates a new world. And it does seem like maybe, maybe this could be all part of the plan.\n\nUnknown Speaker 44:08\n\n Well, that’s the point of initiation is to change your perception of the world once you’re initiated. The world no longer is that it’s not the same place anymore is The Truman Show. It’s the matrix. It’s Westworld. Right? Like you become open to their language. You speak their language now. And now you’re living in Wonderland, the synchronistic you know, Labyrinth? Chapel perilous,\n\nIsaac Weishaupt 44:29\n\n fascinating, man, you’re always bringing some kind of interesting philosophy into this. You’re always making me think dude, I do want to I do know you got to get going. So man, there’s a lot to think about. I’m gonna have to kick this around on the weekend in my brain what you’re saying here. Is there is there any I know the audience last time I had you on a lot of people were like, Man, where can I find Nick? You know, where’s the best place they can make contact with you and where I know you’re working on a new book and you give us an update on the book or where people can maybe preorder it\n\nUnknown Speaker 44:59\n\n you Yeah, so I am going to update my co filing today before this is out. I’ll have a pre order link on there. And that’s in the bio of my Twitter and Instagram which are both NIC K h i n t o n.\n\nIsaac Weishaupt 45:15\n\n So, Nick Hinton with two ends on Instagram and Twitter, I’ll put this stuff in the show notes. And then you said a ko fi link. I’m too stupid. What’s ko fi mean?\n\nUnknown Speaker 45:25\n\n A ko Fi is just like a website that automates selling stuff for you. I guess I was doing it through DMS before but it’s just become kind of too difficult to do.\n\nIsaac Weishaupt 45:39\n\n Yeah, I couldn’t imagine that. All right. Well, okay. I’ll get links from you. And I’ll post your socials on the show notes so everyone can find it and check out your you know, all your work, man. He’s done a lot of good stuff you read? I got I got all your books so far. So keep keep it coming, man. Yeah, thank\n\nUnknown Speaker 45:55\n\n you, man. I appreciate it.\n\nIsaac Weishaupt 45:56\n\n Thanks for joining us appreciate it. All right, there you go. And again, links are gonna be in the show notes for all of Nick’s stuff, check him out, support him. Now back to me back to me. All right. Let’s do let’s go back to rational world. Now that I’m not saying like all this a call talk is irrational. I’m just saying. mundane, there you go has a better term. Let’s come back to the mundane world. If you go to the letter.com, which is a website for train nerds, they have this article about how Norfolk Southern the trading company that got derailed, basically was part of a train lobbyist group. And they worked with Republicans to fight against the federal safety mandating of brake safety system that President Obama was trying to implement way back when. And the claim, of course, these industrial lobbyists always say is, well, you know, the big, bad government, if you mandate the safety systems, who’s going to pay for it? It’s going to be so expensive. And that’s big brother telling me what to do, and that’s bad for business. Well, the claim being made, and this isn’t by me this is by trainers is that if those safety systems, the braking systems that they wanted to mandate would have went through this incident wouldn’t have happened. That’s the claim. Because over 10 years ago, there was actually a trend of derailments. And they were hauling toxic chemicals back then to in fact, this exact crash happened in New Jersey in 2012. Look it up near Ramanuja Creek near Philly. So the lobbyists fight to watered down this requirement back in 2014. And then Trump gets in and they abolish it completely. All right. I’m gonna read you from lever news.com. Then came 2017. After rail industry donors delivered more than $6 million to GOP campaigns. The Trump administration backed by rail lobbyists and Senate Republicans rescinded part of that rule aimed at making better braking systems widespread on the nation’s rails. Specifically, regulators killed provisions requiring rail cars carrying hazardous flammable materials to be equipped with electronic braking systems to stop trains more quickly than conventional air brakes. Norfolk Southern had previously touted the new technology ironic, isn’t it? Known as electronically controlled pneumatic ECP brakes for its potential to reduce train stopping distances by as much as 60% over conventional air brakes. But the company’s lobby group nonetheless press for the rules repealed telling regulators, they would it would impose tremendous cost without providing offsetting safety benefits. Now the problem they had with it was they didn’t want it federally mandated for all trains. Now, this is my speculation. I think they invented it. And they wanted to boast that, hey, we’re the best train because we have this brake system. But then if you make everybody have it, then all that research and, you know, r&d that went into it is kind of like well, that’s nothing to brag about now. Right? So in a way, like I get it, right, you spent all this money to develop the system, and then the government just says, Okay, everyone should do that. Well, like financially, they’re probably like, Well, no, but that’s the same argument you apply to Big Pharma. Right. So they’re the ultimate evil do then anyway. Well, I’ll get on my soapbox here in about one second, hang on. But the claim they posted on the website was that it costs too much for the company there to outfit all the trains with this brake system. They didn’t like that. Meal and the article points out that meanwhile norfork was paying Millions of dollars to executives and billions on stock buybacks. And all the while laying off 1000s of employees. And if you recall, several months ago, there was this strike by rail workers because I guess they weren’t given enough sick leave or something like that. A whole mess, right? And here’s where we get into my political soapbox. Because what’s wild to me is that there’s several articles online about Republican right wing outfits blaming the left wing Democrats, Biden, Buddha, Chet. They’re now blaming them for not having pushed for the safety reform. Because you know, the Democrats have been in the office the last couple of years. And they’re like, Well, why didn’t you? You knew this was a problem. Why didn’t you make it happen? When the truth is that Obama and Biden back then were trying to make it happen. And the same Republicans were fighting against it. So it’ll probably just more divisive talk. But I’ve read through several articles, like Harvard and Columbia Law Schools reported via New York Times that Trump rolled back over 100 environmental protections while he was in office. And this is no surprise, right? Like Republicans say this all the time, they say they’re gonna do it. And he did it. And, you know, the President has the power to install the administrative offices for places and offices, like the EPA, Environmental Protection Agency. And Trump’s guy, Trump’s people in the EPA stripped tons of Obama era environmental rules. You know, try and do it with goals like reducing carbon dioxide, protecting wetlands, mercury emissions from power plants, train brake, safety requirements, and so on, right. And Trump’s people in the Interior Department opened up oil and gas leasing by limiting, which is probably why gas was so cheap, I guess I don’t know. But the Trump’s Interior Department opened up oil and gas leasing. And to do that they limited wildlife protections and environmental requirements. And I was a program manager for several years. So I know exactly what they’re talking about. When you have a project. You need to conduct these environmental impact studies. Right? So if that local area where you’re trying to I don’t know, I’m trying to give a good example, off the top my head, you want to build a taco bell in the middle of the desert? I don’t know. There’s an environmental impact study, it says, Well, you know, other native species there that are endangered, and you’re going to displace them from their home of animals or you know, what happens to all your wastewater, where does that go? Things like that. Right? Which I mean, should happen. But the claim that the right wing and the Republicans will say is that these are these are cumbersome rules to business. And, you know, to be fair, the, if you watch Bill Maher, he talked about how in California, they have the they sort of embody what it looks like when there’s too many regulations and read bureaucratic red tape, according to Bill Maher, because he was saying he’s trying to build a solar panel, energy generation station in his backyard or something, and it took an obscene amount, 10 years or something nuts to get all these permits and requirements. So I mean, there’s a rational balance to be had here, I would argue, but you know, all these things, you know, trying to protect animals and the environment. I’m sorry, but those are good things. We should try to do that. I mean, based upon even if you want to base it upon every, every villain you’ve seen in every movie, right? But the result of letting free market capitalism go unchecked, because it’s too cumbersome to see what the results of this business are going to be. Regardless whether you believe in it or not, are going to result in more pollution, dirtier air, which you know, I live in Utah, and this is a right wing heaven out here. And we’ve got some of the dirtiest air on the planet. Some days, it’s a nightmare. But the government tells tells the commuters like hey, you should try to carpool today. Meanwhile, at I don’t know, at least 60% of the pollution is done by businesses by there’s a massive oil refinery in Salt Lake just spewing out stuff they and the government will not check that they’re like No, no, no, we can’t prohibit business, but we can tell the taxpayers who live here to limit their production of, you know, them driving their vehicles or the wood burning stoves and that kind of thing. So, you know, it’s just funny to me how people are okay with government overreach, when it applies to things that they support, right. But yeah, I mean, when you when you strip out any consideration for the environment, you’re gonna get dirtier air, you’re gonna get dead animals, endangered species, that kind of thing. More toxic train wrecks. It reminds me, I just actually watched Idiocracy again, because I’m doing a film analysis for Idiocracy. That, uh, I don’t know how I’m gonna release that bonus episode in March. I’m not sure yet. But you see garbage heaps and cars wrecked everywhere. And I mean, it’s arguable that that’s where we’re headed. Right?\n\nYou know, look at Flint, Michigan, Flint, Michigan, and now, Palestine, Ohio. They’re, they can’t drink the water. They gotta drink bottled water. Like, that’s wild. That’s wild that we are okay with that kind of behavior. And it’s more dangerous. Trump had apparently allowed this transportation via railroad of this highly explosive, liquid natural gas. That was apparently a big to do while he was in who know, right? I didn’t follow this. Biden gets an office and he immediately halts that. Well, I mean, apply this derailment thing to this highly explosive, liquid natural gas. And I mean, I don’t know. But what’s what’s curious is that the Republican governor of Ohio, Mike DeWine, is that they’re saying, oh, there’s no problems at all fake news left and right. Everything’s cool. And then President Biden apparently offered some kind of assistance. But dewine Governor dewine is like, Nah, man. There’s no problems here. Everything’s great. This is great. And at the same time, the senator from Ohio, JD Vance, was whining about how there’s no federal assistance to deal with the wreck. And that’s my beef. Right? Republicans are like, hey, we need limited small government. And whenever a Republican president, like Trump gets in, they, they just got the shit out of every government, bureaucracy and program, just cut it to nothing. Because they’re like, No, we need a small limited government. And I’m not saying there’s not an argument to be had for that. I agree. Right? On some levels. But then when something like this happens, and they’re like, give me some federal assistance, it’s like, well, then they’re they got their hands waiting for the socialism, then it’s okay, then the socialism is okay. And you could apply this argument to many national disasters in, you know, anyway, the irony here is that the county where Palestine in Ohio is in is when you look at others. categorises is a very Republican county, they voted for Trump and all that stuff, right. And now they’re filing lawsuits against the railway Norfolk Southern. And the irony is that the guy that they voted in was arguably responsible for this whole thing. And now they want to blame the railroads, when really, they could have apparently had some legislation that would have helped them. And I don’t know, this is the type of stuff that just pisses me off. Because I watch, I watch the foods that I put in my body because you constantly have to be up to date on the chemicals they’re using and what the definition of the labels are. And what’s the difference between organic and certified organic and free range and pasture raised. Like you got to constantly stay ahead of these insane Oh, corporations that constantly are trying to manipulate you, right? I don’t know if you’ve ever heard of how there’s countries. There’s other countries out there that ban a lot of the chemicals they put in our food in America. And it’s insane to me, like the nonstick, pee fast on the pans. Right? I specifically go out of my way to cook with non PFS and various other chemicals that nonstick stuff right? Well, that pee fast now they’re apparently spraying and all over this town in Ohio to suppress the other chemical problems or whatever. So if I lived there, I’d be pretty upset about it. Because you only you trying to stay healthy is difficult when you live in a toxic environment. Anyway, that’s my soapbox. Thank you for listening to my soapbox and look, I’m not saying like all Joe Biden’s gray communism is great. I’m just saying you can’t have unchecked free market capitalism. And you got to protect the environment. You got to care. You got to care like Charles Manson said like Charles Manson is the animal trees water there. You got to, you just have to. And you can’t trust corporations to do the right thing you just can’t. And that’s what’s funny. It’s like, people say that the free market capitalist Western democracy system here that we have is the greatest thing ever. And there’s a good argument for that, you know, I’m not saying communist Soviet Union was great, that looks pretty bad. But you got to have a balance there is all I’m saying. And you just the Free Market Capitalist system. Because here’s the facts of the matter. Human beings are selfish. And that’s why capitalism is actually really good because it it, it best fits our behavior as a species. But you have to check the corporation because the corporation has no consciousness. Right? They call incorporated the corporation to corporeal to create a sort of entity. It’s an entity without a conscious. And it requires us taxpaying citizens to pay attention and to try to keep these people in check. But that’s why the mainstream media is quiet about this. All these conspiracy theorists are going nuts about uh, why are they talking about it? It’s because left wing and right wing news media, they have their hands in the pockets of these lobbyists and crap, they all get paid. They’re all getting paid by big pharma. You know, these lobbyists are a real mess. And that’s actually when President Obama ran I actually liked what he was saying, because he was up to lobbyists as talking about all we’re not gonna have any lobbyists here and I was like, good. And then he immediately did not do that. So whatever. So USA Today. They published an article on February 9, six days after the wreck, talking about how these trains get wrecked sometimes. Listen to this. This isn’t confusing. I don’t know what it is. It says the Association of American railroads and industry trade group noted in an email statement at USA Today that 99.9% of all hazmat shipments reach their destination without incident, and that the hazmat accident rate has actually declined 55% since 2012. Hey, that’s a pretty good number 99.9%. without incident sounds good, right? But then, in the same article, not a sentence later it says in the last decade, however, right? Hazardous materials have spilled or leaked from trains more than 5000 times in the United States. According to a USA Today study analysis of federal incident reports. That doesn’t sound like 99.9%? Or maybe that is, maybe that’s point 1% of the total? I mean, what’s the math on that? I don’t even know 5 million train. Routes a year? I don’t know. Maybe that’s accurate. But that’s a lot 5000 times if you do the math on that that’s about 500 hazardous materials leaked a year. That’s 41 a month. That’s about one a day. Right? And one a day would make sense, because you’ll notice ever since this incident, now there’s constant breaking news alert, new toxic chemical spill from the train, and everyone is like, whoa, wait a minute, what is because the news is good at focusing the attention on matters? Like, for instance, in 2020, we had the Black Lives Matter movement, right? Seemed like every day, we’re getting another video of a cop killing an unarmed black person. Do you think that went away? Probably not. It’s probably still happening at the same rate, they just decided to change the narrative on what’s going on in the world. And to be fair, maybe there’s like not enough time in the day to report all this stuff. Who knows? Let me keep reading here. It says However, other forms of transit notched even further, far more spills. For every rail leak reported last year, they were two involving planes, and 67 on the highways. So they’re saying that the rails are actually kind of the safest transport method? Because I get it right. I know I’m talking there. I’m just saying there’s problems with free market capitalism. I’m not saying it’s the worst thing ever, by any stretch. Same goes for the argument on opening when Trump opened up the oil, gas and oil leases. Like, look, I drive a car with gas. So there’s blood on my hands too. I get it right. I’m not like that’s the problem with a lot of the modern day liberals. I’m more of a classical 90s liberal or whatever. I was too young to know politics. Were back then. But I don’t think I’m holier than now. Right? I do recognize that we have to figure something out. But I’m not the type just bury my head in the stand and be like, No, it’s totally fine. Let’s just Let’s just let the companies do whatever they want to do. Like, I don’t know what the answer is. But I don’t know how you’re supposed to believe these corporations do the right thing. Like they always lie. That’s my beef. That’s my beef with corporate America. That’s my beef with this idea of unchecked free market capitalism. I like free market capitalism. But I’d like it checked. That’s all I’m saying. So in conclusion, before I get back on my soapbox, in conclusion, two ideas to sum up what’s going on here? We’ve got this mundane, worldly political angle. That’s frustrating, and it’s irritating.\n\nAnd, to me, I think this is why you can’t go black pill. This is why you have to stay politically engaged on some level. You know what I mean? I’m not ready to give up on America yet. I’m not ready yet. Even though I look, I’m the first one to say it, it feels like Coke and Pepsi. They say two things are the same burden. That’s what it feels like. Sometimes it’s like, man, they the one of these guys are doing us any favors. They’re just getting the rich richer, and destroying our whole planet in the process, and bankrupting the morality of the world, why they do it. And there’s not a real choice. That’s what it feels like a lot of the times, and I’m not ready to give up completely, because apathy is what they want. They want you to just That’s why, look, that’s why you’ll you’ll notice, and I haven’t done a formal analysis on this. I don’t know. But there’s a lot of if you look at from the idea of political enemies or whatever, you got America, then you got everyone else trying to take down America. The big ones are Russia and China. Right? Those are the enemies of America. And of course, I’m not talking about the people. People are probably cool, right? Like no one cares. Like people in Russia and China probably look up to America pop culture, whatever, they probably love us. But the government’s do not right. You got these autocratic fascist dictator types. And they would love nothing more than to infiltrate movements within America. And they see that the conspiracy theorists community are the ones talking about about the government and talking about how bankrupt the morals of America are, right? I’m part again. I’m guilty, too. Right. I do that too. So in a way, they probably love it. That’s why RT the Russia times. What do you call propaganda news outlet, the state run media. The state run media of Russia, like they’re peddling conspiracy theories sometimes. And we did the two shows on the Russia dark arts, like six months ago. And in the summer 2020. I interviewed Professor Ben Teitelbaum about traditionalism and how Steve Bannon and Russia were in bed together with this fantasy of this going back to going back to this like nonsensical world they believed exists. But anyway, I think that you have to be careful as I’m trying to say, there’s the psychopaths out there. They want this fascist, theocracy, autocratic, free market, sort of cesspool where the elites destroy all of our lives, and the environment, to fuel their greed and power. That’s one thing right? Then on the other, you have the spirit triangle, which, you know, thank you, Nick Hinton for coming on the show and sharing your perspective on it. And the question is, are we as conspiracy theorist or truthers, somehow assisting in this revelation of the method process? And do the powers that be want that are people like Elon Musk, telling us hey, there’s simulation theory. And we live in a simulation. Which is a Gnostic idea. We’ve talked about this many times. When in reality, the truth is, they’re trying to create a digital matrix. They’re trying to create an actual simulation world. And maybe the revelation of the method of this ancient gnostic, or called Idea belief system. They want us to perpetuate that or plant the seed or to make people aware of this, so that they can, I don’t know in one way or another manipulate us into their digital matrix, they say, look, see, you’re already living in a simulation. Come join this one because this one’s better. Right? They want to take you from God’s creation and into their creation and that’s what Satanism is all about the worship of the self. The Luciferian ism is about the worship of the intellect, the wisdom of man. This is the age old story like the Tower of Babel, right man trying to reach the height of God through focus of the self, the will of the self do what thou wilt with Aleister Crowley said. So there you go. We went all over the place to this one today. But some different perspectives on this, this train derailment. And again, thanks to Nick Hinton, for joining us again, I’ve got links to his stuff in the show notes, follow him on the social medias, preorder his book already did already pre ordered mine. And, you know, be sure to look, I already know that a lot of people listening probably don’t share similar political views and that’s okay. It’s fine. We don’t have to agree on that. That’s the beauty of this country. That’s the beauty of it. We disagree. And we do it in a peaceful manner. And we respect each other. That’s the way it’s supposed to be. It seems like in the last 10 years, things are going off the rails the other way. But, you know, let’s try to keep loving hearts for one another. I’m just saying like, let’s just try to protect the environment. That’s all I’m trying to say. Protect the animals protect the environment. Try not to let this kind of stuff happen as much as we can. Alright everybody, thanks for listening. Until next time, stay well.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ohio Train, UFOs & Movies: Predictive Programming in \"White Noise\" and the Matrix Plans with Nick Hinton! - IlluminatiWatcher", "description": "On today’s episode of the Occult Symbolism and Pop Culture with Isaac Weishaupt podcast (formerly known as CTAUC Podcast) we’re joined by a very special *RETURNING* champ- Nick Hinton! He’ll break down some philosophy on what is happening right now with the mix of UFOs, movies and toxic train crashes! We’ll chop it up on […]", "url": "https://illuminatiwatcher.com/ohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton/", "site_name": "IlluminatiWatcher", "article:published_time": "2023-02-17T15:13:16+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2023/02/OSAPC-Ohio-Train.jpg", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["ohio train conspiracy", "ohio train film", "ohio train symbolism", "UFO", "illuminati", "ohio train podcast", "symbolism", "aliens", "ohio train white noise", "Alien", "ohio train predictive programming", "occult", "ohio train symbols", "ohio train", "paranormal", "symbols", "ufos", "transhumanism", "ohio train occult"], "tweets": [], "movies": [], "links": ["https://wp.me/p2ijVF-bmc", "https://twitter.com/NickHintonn", "https://www.instagram.com/nickhintonn/", "https://wp.me/p2ijVF-bkt", "https://ko-fi.com/nickhintonn", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/index-of-every-podcast-episode-of-occult-symbolism-and-pop-culture/", "https://www.amazon.com/author/isaacweishaupt", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "http://AllMyLinks.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/52767429", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/index-of-every-podcast-episode-of-occult-symbolism-and-pop-culture/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "http://BreakingSocialNorms.com", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "http://AllMyLinks.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/ohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton/?share=twitter", "https://illuminatiwatcher.com/ohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Ohio%20Train%2C%20UFOs%20%26%20Movies%3A%20Predictive%20Programming%20in%20%22White%20Noise%22%20and%20the%20Matrix%20Plans%20with%20Nick%20Hinton%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fohio-train-ufos-movies-predictive-programming-in-white-noise-and-the-matrix-plans-with-nick-hinton%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2023-02-17T15:13:16+00:00"}