{"result_id": "165017", "URL": "https://illuminatiwatcher.com/transhumanism-adrenochrome-blood-and-the-elites-quest-for-immortality/", "timestamp": "2023-04-25 15:35:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/transhumanism-adrenochrome-blood-and-the-elites-quest-for-immortality/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Transhumanism, Adrenochrome Blood and the Elite's Quest for Immortality!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we go over a recent article in Newsweek that basically reveals the truth about elites pursuing the blood of children for anti-aging treatments in their quest for immortality! Sounds crazy but wait until you hear what they say in the article! We’ll talk about the Frankenstein experiments the scientists have been doing on rats, evolution, transhumanism and even a detour into philosophy with Kant and the Matrix!\n\nWe’re hitting those Tier 2 and Tier 3 shoutouts today also!\n• *LIMITED TIME OFFER to first 1,000 supporters: Use promo code “HOTGIRLSUMMER” to get 20% off the VIP Section for 3 months!: https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by getting in the VIP Section!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Transhumanism, Adrenochrome Blood and the Elite’s Quest for Immortality!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nA new medical studies out this morning show young blood can improve lives, researchers took old mice and gave them blood and blood proteins from young mice. They found the old mice showed improved muscle and brain function.\n\nSo I just hope these mouse studies will lead to anti aging treatments for humans. CBS News medical contributor Dr. David\n\nSo tell us about these studies. And what they mean, you know, was something a cross between vampire and Frankenstein, where they took two animals and they hooked their blood supply together for four weeks called parabiosis. And it was experiments that were originally done in the 50s that showed mice seem to reverse aging. Now we know the mechanism. So three separate groups showed this, when you hook the blood together, after four weeks, the stem cells in the brain and the muscle and the heart, they get activated and turned back on. And in fact, the the young mice age, and the old mice reverse age and very powerful brain works better than we’re able to get through a maze better, their muscles work better. So certainly very exciting findings. And what does it mean for humans? Well, the human clinical trials, the researchers say will begin later this year. And the hope is, is that in these studies, they identified a particular protein. So you don’t need all of the blood from the young person, you need that protein that may be able to reverse some of the effects of aging. So the dream is instead of treating a disease, we actually change you. So you’re not aging and you can actually, hopefully even reverse it has enormous implications for people with disease and people as they grow older. You know,\n\nDavid, my understanding is that this was done on a particular strain of a mouse that was inbred. Do you think this could eventually be the fountain of youth or at least help people with Alzheimer’s and others delete diseases?\n\nWell, the mice are the lucky ones, right? When you look at all these dramatic cancer treatments, they always help the mice these experiments, as you say, were done in mice that were genetically identical. And so will it translate to humans? The true answer is we just don’t know. And so the experiments will be done. But it really is hope that not slowing aging, which a lot of studies have shown with various drugs, but this actually reverse the changes. So there clearly is something here these are the best science journals with really well done science, but it will take a while before we understand how to control it, and use it appropriately and safely in humans.\n\nI want to get your pen and your little pad out. Because we’re going to go real hard in the paint on transhumanism. immortality. And we’re basically going to, I don’t know prove the ideas and the theories of adrenochrome without implicating Tom Hanks, I guess you know you love the Tom Hanks. You know he would do that woody? vac someone on the Igy hit me up and said that he’s in a new movie. Tom balda? I don’t know. abducting kids or something. I don’t know. I gotta look into it. Now, listen, Newsweek, they published this article called is entitled, can blood from young people slow aging? Silicon Valley has bet billions it will. And I read it for you. Because it’s really boring. And I read the whole thing. And I took notes, and I’m going to explain all thing to you. Because I care. We’re going to break down. I mean, I’m basically going to explain to you how the transhuman agenda is at play here. You could take this and run with it and say, Yep, this is the adrenochrome thing. You’re going to hear about how these nerds are going to kill us. With some wild experiments are doing on these animals, they’re like, they’re, they’re cutting animals and having sewing them together. I don’t know seems a little, like a bad idea to me. And what else we got talking about, oh, then we’re going to go in the conclusion. You got to stick around for the conclusion cuz I did a lot of homework for you now. We’re gonna get real smart. We’re gonna use big words. And we’re gonna talk about philosophy of Emmanuel Kant. Kant, I want to say I took one semester of philosophy in college, it was very cool. We didn’t talk about can’t or can’t, or you know how to pronounce it. But I’m going to talk to you about it. And it’s all gonna make sense. And you’re gonna say, you know what, Isaac, these nerds are gonna kill us. And before they do that, they’re going to not kill the elites. And if we have time, maybe I’ll segue into this Yuval Harare book species that or I’m sorry, Sapiens that I keep talking about. I got I’m tweeting notes from the book because it’s like blowing my mind. I’m like, Okay, this all makes sense. Now I get it. Now I get it. It all makes sense. This is what they what they wanted to do, has been in place since the agricultural revolution. Myth building before control is essentially it. Now real quickly, we do this fun thing, once a month, I do the shout outs from a people on the supporter systems, I got three supporter platforms. And if you sign up on the Patreon or the VIP section and Illuminati watch comm link in the show notes. You could sign up a tier two and three and four, get the shout outs once a month we do it and it’s my way of saying thank you for the support that these folks give. I mean, there’s a lot of good supporters, there’s a tier one, but try to throw some perks at tier two and three for the upper perk upper tiers. And this is what we do. So let’s get into it. So first, we’re going to go and set the VIP section on Illuminati. watch.com. tier three, tier three folks, the alkaline Oji granola woks. There’s Cheryl always holding it down. Jason and Brandon. always hold it down. Thank you. VIP section, tier two, tier two, the Oji granola worked on and yeah, we’ll get that later. Let’s go down the list here we got Leslie we got cosmic blues 27, Winston, Bob poppadom. Leslie, Matthew Allen, David, Felix, Chris and hunter going in on a twofer. Timothy, Larry Trina crystal and the great Marisa gray Marissa, she knows who she is. Then Maurice has been on the show. If you know if you know we’re talking about her, she wrote a great book called The Big shebang if you haven’t heard that, it’s very important. In fact, it’ll get into a little bit of what we talked about today with a narcissism kind of elements. If you want to take it there, you know, totally up to you. Now we head over to Patreon where I got tier twos and threes all intermingled the Oji granola works and the alkaline Oji granola woks. There’s an old before I forget, if you’re on tier three, on either the VIP section or Patreon. Hit me up for a book that I had, I had to switch things around because Vimeo kicked me off the platform, I could no longer get the videos. Now all the videos are going on rockfon Yes, I know. This is also very confusing. But if you go to Illuminati watching, go to the VIP link there at top, you’ll see the differences of the three platforms, but I had to kind of shift things around. So now tier two and three, get the monthly live stream which I got to schedule with you guys. Then tier three now gets a signed copy of my first alien book. So hit me on the email. If you’re on tier three, and you haven’t heard from me yet. Hit me up. Hit me on the email, you know where to find me. And we only have messages on Patreon. I read all those messages. And tell me you want your damn book. If you already bought us you’re losing one. I’ll send you a different one. We’ll hash it out on email. Okay, let’s get into it. Jason murder. Candace Luke, Sara Beck bordas sa Jessica. Marissa. Now we have double dippers. He has to kind of double dip like this, you know, you don’t have to do that. Right. I appreciate you for doing it. But I appreciate that’s like next level support that’s like I don’t even know how to repay that. That’s very nice. You Aubrey and I, here’s an interesting one from from Scotland. I’m told this this person reached out to me and said that the M h in the name is pronounced with a V. So I’m still gonna butcher it very, very. Oh god. Very. Alright, let me know what I did wrong there. Robbie, jiggy Mama. Stephanie. James, the jimsy winner of the job contest. Amy. Eddie Taryn, g man Jacko. Tyler, Liz. Cheryl Marjorie premier. 65 Christy, Vermont hip hop collective Joe sauce. Charles, Daniel Zak. Tyler Durden from Fight Club. Is he on the list? Yes, he’s on the list. Joshua. Now the tier three there you know again, if you’re on the tier three, and I haven’t given you a free signed paperback hit me up. Russell Russell dragon that is, excuse me. Chris Austin, Ramona Frankenstein. Sarah Tanya, Brandon Raman Jacob Allen Sam. I am feelgood rechart still surfing? Or stuck in quarantine wherever you are. Brooke, Jason Sue’s w sorcha. Jennifer Betty Thomas. Cheryl double dipping. Thanks. You might think she’s true. Devin if I’m not mistaken on the rockfon tos a shout out special shout out to Cheryl Berry. Roxy Roxy Crystal engi Brian Ashton Heather alley Renee. cc. Spry you Joe nips in the house. Brandon, Brian yac still hold it down. David M gib Darcy. Jeff al Mack profit seven. Denali, Jade pragmatic chick Taylor Blake’s to hold it down. Taylor I think your book hit me up, William. Alexandria jaybo bhogi. The one of the first oh geez from the Patreon, Katie, Kara and and big physics to hold it up big physics still the reigning champ. So shout out everyone, thank you for the support. If you want to support the show, you know where to go, hit the link in the show notes and check it out. Alright, let’s get into the show. Let’s get into the stuff. What you came here for. I’m gonna break down this article for you read the whole thing, took notes. And Newsweek only gives you like five free articles a month or something like that. So if you go to, if you want to read it very leave that little tab in your browser open unless you want to give Newsweek money every month. What they’re talking about is this international global bio company grifols, they bought this other company called Alka hessed. Doesn’t really matter. But this alcohol test is a company founded by Stanford neuroscientist Tony whisk koray and Sol vileda VEDA. And what they did basically is that they were publishing these papers showing that blood from young mice was able to restore the brains. Another really nice. And the idea here is that, due to the experiments in the lab, they think that they can treat all timers, and Parkinson’s. And they call this sort of science, they call it zero science, okay. And if you look that up, it’s like this combination of biology and chronic disease and Health and Aging. But it’s it’s looking at it from this cellular level and trying to understand on the sort of microscopic frame of reference what’s going on. And they they already know that aging is a risk factor, right? aging drives the chronic diseases. And this geroscience is how another angle on which to fix it. And it’s not like it’s not like just studying one disease. Because I’ve got lots of places that study just Alzheimer’s or just Parkinson’s, this is a different, it’s a shift in, in viewing this, it’s looking at the body, and the aging process as the disease. And this is why you’ve got all these, like 23andme and ancestry like they collect the DNA. And the conspiracy is that 1020 years down the road, when they master all this kind of wacky Frankenstein stuff. They can be like, Hey, you know, we had your DNA sample from 2005 2010, whatever, back when you were healthy. And for the right price, we can make you whole again. That’s the idea. That’s the conspiracy. I’m gonna read you I got little quotes from the article here, I want to review that are very important. The idea that aging and illness go hand in hand is of course nothing new. What’s new is the newfound confidence of scientists that aging can be measured, reverse engineered and controlled. Now this is the attitude of the elites, the techno paths, as we call them. If you listen to my shows about oh, I don’t remember which one it was the eight part vaccine controversy series that I had to rename back in early 2020. I had a show about Bill Gates. And there’s a clip from his from some documentary that was on Netflix about him. And he’s talking about how he thinks technology can fix absolutely everything. Okay, I’m not you know, I’m, there’s good and bad with technology, right. But the end, and I’m trying to think when to introduce the topic from the Sapiens book, but basically in the Sapiens book that I’m reading from Yuval Harare, he talks about how technology is in theory supposed to make our lives easier and faster. But it’s having A negative effect. For example, he’s like, you know, back in the day we used to communicate, we’d write a letter and put on a horse. And four days later, you get a letter in the mail back and you know, things slow down. Nowadays, like you just text message someone, you get an instantaneous communication, which you would think would save us a lot of time, we would have more time to do the things that matter. But that’s not what we do. We try to jam more into our day because of the concept of time introduced through the agricultural revolution, or if you want to go to the occult route, the Saturnian influence of measurements and constraints. Because when you introduce the concept of time, and you start focusing on days, months and years, when you get anxiety, because anxiety is of course, worrying about the future. Whereas depression is worrying about the past. So the point the takeaway here, technology, while it does make some things easier, doesn’t always make them better. And in the book, Sapiens even argues that the elites, the leaders, the kings, the royalty, were the only ones that actually got benefit from the agricultural revolution. Now let’s So basically, they’re talking about how the scientists think, well, what’s your technology, we can reverse aging. Okay. And apparently, they’ve been investing just tons of cash into these biotech companies. It was a huge thing, just prior to the pandemic, and I assume it still is. And here’s what they’re doing says here, some biotech firms are developing drugs and infusions designed to clean up zombie like cells and metabolic junk that accumulate with age. Others hope to infuse new vigor into flagging cellular components, such as stem cells, or spur the body and the beneficial actions by adding obscure hormones or proteins that decrease as we get older. Right, and we’ll go into that in a little bit more. Now, you might be thinking, Okay, they have all the science and ideas like when are we gonna see it? Well, here’s the thing. The leads already have, okay. But here’s the official sort of timeline it says here. Although the vast majority of these efforts remain in preclinical development, several have recently entered FDA trials, and could potentially hit the market in a few years. Some are already appearing on the gray market raising concerns that hucksters are peddling anti aging snake oil. Others Meanwhile, worry what might happen if these drugs actually do deliver on the promise? Will poor young people be coerced into selling their blood to elderly billionaires? The answer is yes. You could argue if you want to subscribe to the adrenochrome then that’s already happening through abduction. Will magical anti aging pills become the province of the Park Avenue and Hollywood rich like face, facelifts, hair plugs and Botox injections? Will the rest of us senile peasants be forced to watch them aged backwards as we are left to wither and die? Oh, no. Oh, no. saying so. So, and we’re going to talk about the scientific details of how this happens. We’re just kind of planning the the general foundation what this whole is all shown with this whole article is trying to get across. Now, if you look at they give an example of back in 1993, they were manipulating genes successfully to increase age talks about in 1983. Some biologists double the lifespan of a worm from three weeks to six weeks by mutating one single gene. And then that sparked a bunch of ideas about using drugs to increase longevity by targeting specific genes and diseases. And that’s when they first thought you know what we might be able to control the process of aging. So they’ve been looking at this for what is that 30 years. And people and that’s the argument from the tutors, right is that these elitist behind closed doors are doing this kind of stuff. Doing the adrenochrome taking the blood of the young vampires, vampire face, facelifts or whatever they call it. Then it goes through this explanation of how evolution shows that mankind went through periods of starvation. Okay. Like when we’re talking about like the hunter gatherer type thing before the agricultural revolution. And that hunter gatherer period of starvation messed with the insulin levels of our body, right? And the body would more or less, see the starvation mode kicking in? And it would, it would mess with the insulin levels in order to protect itself to reduce inflammation. Some guy, he wrote some book about how, if you restrict your calories, you’ll live longer. And that was one of the ideas I guess. But nowadays, that there’s a drug called Metformin, that the thing could be part of this process of anti aging. It was on 60 minutes, like two years ago, if you saw that. But basically, they’re they’re doing tons of studies in the lab on different animals and worms, to see if they can really extend life by basically stopping the aging process down at the cellular level. Now, they they seek to do this, down the cellular level, how they’re going to do that, how they’re gonna tweak this well through hormone therapy through injection of proteins that start to fade as we get older. But what about these two nerds from outcasts that we talked about the beginning? Well, the article describes their lab. And it’s quite disturbing. They say the labs full of mice with two heads and two sets of legs and two torsos. And the reason they do is because there’s this thing in science called pero, pero biosis. And what they’ll do is they’ll cut two different mice in half, and sew them together, and it heals as a new mouse would do EDS or whatever, called a twofer. They make a twofer. And then they study that twofer. And they think that what they think is that the stem cells stop receiving the signals needed to activate them as you get older. So the stem cells slowly sort of die off because they’re not getting the signals that keep them alive and activated. And that’s, that’s the million dollar question. What are those signals? They don’t know. They know that they exist in younger animals, and they die off as the animal gets older. So when you saw the two mice together, you so an old one with a young one. And the idea is that they want to know like, what is this signal? Well, let’s just mash these two rats together. And that signal we’ll get over to the old one. And sure enough, it worked. And to make things even worse, they actually like wound does it how they wound this, this crazy sewn together might wrap to see how it heals. And it’s pretty wild, they take the blood of the young mouse and put it into an old body. And sure enough, those stem cells get activated. Took a very crude solution, but they got it to work. And then they thought, Well, how do we fix the brain? We got to fix the brain, the Alzheimer’s, the the Parkinson’s. And listen to us. I’m going to read you again from the article. After conjoining elderly and young mice vileda sacrificed the elderly mice curious term their sacrifice sacrifices elderly mice cut their brain brains into tiny slices and stain them with a special dye that bound baby neurons then you count up the number of new neurons compare them to normal levels of neuronal growth in similarly aged mice. The results when he posted in 2014 shocked the scientific world. The infusion of new blood led to a three fold increase in the number of new nerve cells generated in the brains of the elderly mice. But that wasn’t the only revelation had already shown that the young members of the conjoined old young mouse pairs generated far fewer new nerve cells than young mice left to roam free, untethered to their elderly cousins. And while the old mice grew more energetic, the younger mice suddenly behaved as if they were middle age. So they’re basically saying like, they can prove this right? By selling these rats together, they can kind of like prove that this, this idea of something kicking on those stem cells works. And that’s one way to reverse the aging process. Then they tried. They thought okay, let’s maybe we just stop sewing so many minds together. Let’s inject blood, blood plasma into the old mice. without, you know, doing all this nasty Frankenstein sewn stuff together because the problem is they’re like well, we can’t experimental humans this way so we got to figure out another way. But I don’t know that you get I’ve seen Human Centipede to seem like it worked out just fine. Just fine in that movie. But sure enough, they pump in the blood plasma of the young mice into the old mice, and boom, old mice now smarter, younger, more handsome. benchpress and more the gym. And then they did a vice versa, they put the old blood into the young mice. And the old mice is just got dumber. Or just got dumber. And they started settling down and watching Fox News and going to bed at 730 Oh, it’s terrible, terrible life. Now listen to this. Should you not be wondering about all this? And how it fits into the truth or stuff. The results generated worldwide headlines and soon Weiss call Ray in his protege. valina began receiving many bizarre and at times mccobb emails. One chilling missive came from a man who offered to provide all the blood that whisk koray might need for such an experiment. He claimed he could obtain it from human children of any age. Hmm. So with that, what do you think that’s all about? You think that’s what it was always missing kids? I don’t know that it’d be all those missing kids, but it’s gonna be some of those missing kids. Right? Well, then it talks about the the how alcohol alcohol test started the company. And turns out it was started by this billionaire in Hong Kong who died and his family basically funded the startup because the Dan, who the patriarch, I should say, got this blood plasma infusion on his deathbed in 2012. He died from Alzheimer’s. And he had this like, sort of rejuvenation period of a few days, and the family was convinced there was something to that. Right. And, you know, again, the idea is like the blood loses its proteins or hormones, and some kind of magic as it gets older. Now, there are some fringy places popping up. Like if you’re like, Well, that doesn’t mean people are doing this. Well. There are. An article that talks about says in 2016, a former Stanford medical student named Jesse camosun opened up Ambrosia a clinic in Monterey California wasn’t Ambrosia like the the the food of the gods or something intoxicating food of the gods. They were this clinic opened up in California, offering to infuse clients with the blood of donors between the ages of 16 and 25. For $8,000, a leader. In December 2018, Huffington Post published an investigation claiming that the only patient who spoke publicly about Ambrose’s transfusions, treatments he hoped would help him live healthier into an old age, died at 65 after going into cardiac arrest. I don’t know what they’re trying to say there translate case clothes. I mean, clearly, this is working. But then the article even talks about this ethical dilemmas. And curiously enough, entertainment, which is where our worlds collide. They talk about that show on HBO, Silicon Valley, says scientists are ultimately successful. Hacking aging will raise troubling ethical questions, particularly when it comes to young blood. In the wake of those early papers, the popular television series Silicon Valley, featured an episode in which a well heeled.com billionaire had his own blood boy follow him around to provided transfusions. The idea that only old rich people can afford Young Blood is just uncomfortable. barzilay says. Now if you followed me since way back when when I was making videos on the YouTube, you’ve seen the Silicon Valley Satanists video I had up there because the one character from the show is an openly admitted laveyan Satanism. Like that’s his whole shtick. In fact, I think he the guy, okay, the guy who plays the characters names Guilfoyle, right. I think he’s now doing like commercials for insurance or something. But it’s curious because this plotline is also on Mad Max Fury Road if you’ve ever seen that using using the people as the blood bag. So Hollywood has shown this to us more than once. Now let’s let’s, let’s take a high level view, let’s go to the conclusion and conclusion. Got a lot to talk about here. First off, let’s talk about the mainstream media. I would like to point out, just to play devil’s advocate here, because like truth is are always dogging on the mainstream media. They’re always lying. Everything’s fake news. And I’m always the one to be like, well, they lie, I get it, like true, but not 100% of the time. Like, they’re, they’re also we’re responsible for exposing, you know, people abusing people, stuff like this, right? Like, they’re, they’re telling you what’s going on. And without them, like who would tell us? We don’t know. I’m not studying the biotech firms in Silicon Valley. So anyway, I just wanted to point out like, they’re not all bad, right? Not all not they’re not all bad all the time. Now, are they part of the problem? Sometimes, yes. But you got to kind of like take a common sense approach sometimes. Now adrenochrome, that’s a theory, right? Do you get the theory of the frazzle drip video that supposedly like Hillary cleanse, like cutting off children’s faces and then stable into her face? So she can absorb the blood? I don’t know if it’s true. Sounds crazy. But that’s the theory of the adrenochrome. We’ve talked about during the chrome ad nauseum go to the summer 2020. We’d like at the wayfair show, we did over talked about it. We talked about it a million times. Surely you know about it. But my thing is, you know how like, technology and gadgets. They’re always like, 20 years ahead of what the public realizes. And to me, I feel like, you know, back in 93, this article says they first started learning about this. So I’d argue like the people with the fat pockets. I’ve been, you know, taking advantage of this. Where do they get the blood from the young people? I don’t know. Sounds like there’s a market for it already built up the gray market. Now, let’s get into real quick, let’s get into the philosophies here. Why are they doing this? Why do I always talk about transhumanism and the quest for immortality? Why do they want it? They think it’s the moral thing to do. It’s the ultimate sign of superiority. It’s like the highest level virtue signal that could ever exist. And talk about this, I dug through a book, let me get my book out. It’s called the matrix and philosophy. Welcome to the desert of the real. It’s just a bunch of philosophy types talking about the film. And there’s a section in there, and I’m gonna paraphrase this to keep it from because it’s kind of a hard read, if you’re not into philosophy, if you’re not into philosophy, if you’ve ever tried to read a philosophy book, it’s kind of tough. But basically, it’s saying there’s, you know, philosophers from Plato to Buddha, who’ve been talking about how the quote unquote real world is the shadow to the true reality. And the philosopher Emmanuel Kant, structured an argument about this, he says that, look, even even physics and the laws of science, these are all built around man’s observations. And these are very subjective. We don’t know what the ultimate truth is, is what Rene Descartes was trying to dig into. And if you read Yuval Harare Sapiens book, that’s what he says. He says, man’s greatest strength is our ability to create myths and create this consensus reality because it’s good for communities and building tribes. And creating the social construct and keeping people in line. You need this consensus reality where everyone believes it. And Kant says that the real reality is not to be found in the appearances of reality, because the appearances of reality are given to us through the filtering of the senses. The the super ego and the ego make this reality. And it’s just a filter. And what we believe to be reality is just a projection of human consciousness. There’s no such thing as an independent reality. There’s no there’s no other objective reality. It’s more like a mutual consensus, subjective belief or myth. It’s a myth that we all agree upon. Which is exactly if you followed my my book talking about Bitcoin and kryptos. We talked about fiat currencies. The American dollar is a myth that we all agree upon. And there’s, there’s, you know, 70 billion people in the world that agree upon this myth. And there’s people who don’t believe that it’s worth a damn and they want to, you know, put Bitcoin up. Like, look, people are like, Look, I don’t trust the American dollar because of the Illuminati and the Federal Reserve’s it’s all a ruse, I’m going to invest in Bitcoin. Well, if you read Harare, his book, he says, like your imagined reality, to shift from one imagined reality requires basically you’re just shifting to a different one. And each one has their own sort of like pitfalls, which is what I argue about Bitcoin is like, sure, like, you don’t have to trust them the banks anymore, which is cool. But now, like, it’s the most traceable thing, the blockchain is there, and there’s no you know, cash is ultimately more anonymous than a Bitcoin. Basically, that’s my take on it. But to stick to this argument here, Kant says that we buy by believing in this objective reality and just being like, nope, this is what I see. This is the world and is black and white. You know, basically, Republicans, and just kidding, I’m kidding. I kid, take it easy. But like, you know, law and order and like, good, bad, and like, everything’s black and white. If you do that, if you subscribe to that, and die on that hill, you’re abdicating. meaning you’re not meaning you’re not taking responsibility for your human experience. This is kind of a crazy, this is deep stuff. This was philosophy, right? So let me let me sort of say it again, by putting your stock in this objective reality, and the social construct, and the social norms, and good and evil and right and wrong, law and order, by dying on the hill and saying, that’s what that’s it. And that’s all there is. You are not taking responsibility for the human experience, and the true freedom that you’re supposed to have. You are limiting yourself. You’re limiting yourself to the social consensus myth, the fake reality and guess who creates that fake reality? the entertainment industry, the elites, the people in power, this is how the agricultural revolution happened. They convinced people to be farmers, and their lives got worse. In fact, he talked about it in the book, he, in his book, he says, we subscribe to the socio economic and political world in which most people are slaves to other people. You’re abdicating you’re not taking responsibility for your freedom. Because it’s easier this way or so you think. If you recall, in the matrix, Agent Smith, he says that, look, there was this first matrix, and it was a perfect world. The mankind rejected it. And that humans define their reality through suffering and misery. And that’s what Kant was saying. Kant, I don’t know how to say his name. There’s only one way out. And that’s personal self liberation. And Jesus showed us the model of the inner godlike potential for us to save ourselves. We have the free will to follow the path of freedom. But we’re trapped in believing in the perceived world, which can’t and all these people are saying is a self imposed illusion, not necessarily the Gnostic prison planet of an evil genius, but done, because of human nature or whatever. Now why are we talking about all this because it has to do with immortality and transhumanism? Because immortality these folks believe is necessary. Because they want to be moral, they want to elevate in consciousness. And to do so one lifetime is not enough to learn all the lessons to learn traverse the cabbalistic tree of life, to master everything. So to achieve this ascended state of perfected being, they need to extend life preferably to becoming immortal. And the Christian idea to compare this to do is like, Look, it doesn’t really matter what we do in this world because we die and our souls are immortal in another sort of world after we die. But there’s lots of folks who don’t buy into that the Hindus, the Buddhists, anyone who subscribes to reincarnation, they think that we keep getting reborn until we hit this perfected state in this world. Bill of ASCII called them the integrated Ascended Masters of Theosophy. And the idea is that the soul is forced to be reborn over and over until it achieves perfection. So that’s what these people want. They, they’re like, Look, we don’t wanna have to start from scratch at each birth. Think about all the wisdom you’ve accumulated. They want the time advantage if you could stretch your life to another 50 or 100 years. All the all the bad decisions you made when you were a teenager or in your 20s was more time to sort of counter your bad decisions. It’s like, it’s like financial investments and compounding interest if you just would have started 20 years earlier. And this transhumanism is about defeating this prison of the human body. In fact, I’m going to read you from the article one more time. Aging is an invention of mankind, no animal species has successfully cheated its own body cheated nature, except mankind. Elephants may live for 100 years, but they lived for 100 years, a million years ago. Humans have outsmarted their own body. And that’s what this is all about. The body is the prison. They got to figure out a way around it. Now one way they’re going to do this is of course, with the technology, the digital consciousness, which we’re not going to get into today. But this is the step they need. They need the blood of the youth to extend their lives. They got to get to 2045. That’s when Ray Kurzweil says the Singularity is going to hit. That’s when the computers take over. And we’ll be in the digital matrix will be digital avatars, the digital consciousness. And that’s pretty close. That’s almost that’s like basically as far away as 911 is, so get ready because that’s common. But ultimately, what this article and what this idea is all about, the nerds are going to kill us. But before they do, they’re going to we’re going to be given up more blood, sweat and tears to the elites. So they can get ahead, just like they’ve always done. Just like Harare says, and Sapiens is like the agricultural revolution all over the dubis into into sacrificing our lives to make theirs better. And they’re gonna kill us eventually. So there you go. Hope you enjoyed that that was a big article big to do. And I wanted to break that down because I thought it was very important and I thought you would enjoy it. And I’m glad you did. If you want to get on the shout outs next month, you know where to go hit the link in the show notes go to Illuminati watcher.com go to the VIP section check out the three supporter platform options. Only two of them get the shout out. So that’s Patreon and the VIP section and the capabilities to do it on rockfon but I don’t care whichever one you like the most. You’ll get ad free content you get bonus shows. Doing all these bonus Eyes Wide Shut episodes in April you’re going to love gonna love them. Alright my friends, you know what to do. Until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "Transhumanism, Adrenochrome Blood and the Elite's Quest for Immortality! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we go over a recent article in Newsweek that basically reveals the truth about elites pursuing the blood of children for anti-aging treatments in their quest for immortality! Sounds crazy but wait until you hear what they say in the article! We’ll talk about the Frankenstein […]", "url": "https://illuminatiwatcher.com/transhumanism-adrenochrome-blood-and-the-elites-quest-for-immortality/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-04-12T11:38:43+00:00", "image": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/04/ctauc-transhumanism.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/44284779", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/transhumanism-adrenochrome-blood-and-the-elites-quest-for-immortality/?share=twitter", "https://illuminatiwatcher.com/transhumanism-adrenochrome-blood-and-the-elites-quest-for-immortality/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Transhumanism%2C%20Adrenochrome%20Blood%20and%20the%20Elite%27s%20Quest%20for%20Immortality%21&body=https%3A%2F%2Filluminatiwatcher.com%2Ftranshumanism-adrenochrome-blood-and-the-elites-quest-for-immortality%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2021-04-12T11:38:43+00:00"}