{"result_id": "165021", "URL": "https://illuminatiwatcher.com/war-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending/", "timestamp": "2023-04-25 15:36:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/war-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "War of the Worlds 2019: Occult Revolution of Man and the Meaning of Ending!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we go through the entire 8-part series of the War of the Worlds 2019 reboot! I’ll explain that INSANE ending, the symbolism of the tattoos, alchemy, alien dogs, the Freemason lost word, THEO/SOPHIA, the fallen angel, evolution of man, ADRENOCHROME, all this connects into what I wrote about in Use Your Illusion I!! WILD SHOW! If you haven’t seen the 8-part series, don’t worry, I’ll coach you along the story (*PLOT SPOILERS).\n\nCheck out the images on Instagram.com/IsaacWeishaupt! I’ll also post below if you don’t have IG.\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “War of the Worlds 2019: Occult Revolution of Man and the Meaning of Ending!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nThis is what if we’re wrong? Ridiculous. Wrong.\n\nHi. This is Kathleen Johor from the Istituto US economy mistake.\n\nI believe we have detected evidence\n\nI’m done. Playing with you guys. I’m done messing around. It’s time to get serious. We’re gonna talk about a show called War of the Worlds from 2019. And I watched it on a on a on the old cable box like an old man. still paying for this cable that runs into the wall. I watched it on a channel called epics. I believe it was previously on mainstream TV. I don’t really know. It doesn’t matter. Who cares? If you haven’t seen it. Now, here’s where we’re gonna Before we go further. I’m gonna tell you I got plot spoilers in this whole thing. I’m gonna be spoiling the plot near the front of it too. So should you watch it? Well, here’s the thing. If you like war, the worlds the you know the story. You would probably enjoy it. I’ll give you that. I thought it was good. I liked it. It was eight episodes. almost an hour piece that stuck in it, I stuck in there and watched the whole thing and it was actually pretty good. I had seen the trailer and wanted to see it. So you know, I kind of wanted to see this it was coincided with the wrapping up of my first alien book, Use Your Illusion one. And I thought, why not and what I was actually going to do, here’s what I was going to do, but knowing things I know, I decided to go this route. I was originally going to do a big mega War of the Worlds analysis where I read the book. Listen to the Orson Welles audio broadcast, you know, the fake news one everyone was like, Oh my god, everyone’s there committing suicide and people were crashing their cars because everyone’s hearing the Orson Welles alien thing and they didn’t know if it was real or not, which is all fake news. None of that was real. That’s all part of the propaganda machine. which you will learn about in my first alien book when it drops here soon, September, October. Oh, and by the way, while we’re talking about it in case I forgot, if you’re on the Patreon team, which you should be patreon.com backslash Illuminati watcher, you will of course get your name in the book. But if you didn’t catch it yet, you have to do a post I made a post where you have to like vote on a poll yes or no, you have to tell me you want your name in the book and a special thanks. Doing that as a little perk, a little bonus for all my patreon folks out there, but you have to do that because if you do not fill in that poll, I will not put your name in it due to privacy laws. Shout out my Patreon person I’m not gonna Don’t worry, I know you’re all panties are in a bunch. You don’t want me to name your name. I’m just kidding. Someone was very kind and anonymously sent me a message through the Patreon say, legally, you can’t do this. So and I don’t want to break a law. You don’t want to give these people a reason to hem you up because they’ll do it. trust you, me. So you need to vote for that policy. Yes. You want your name in the book and I will put your first name and the first letter of your last name. To keep it somewhat vague and somewhat anonymous. Unless you specify directly to me, you want the full name. So anyway, make sure you do that anyway. Okay. I got roasted for having my interest too long. I’m very sorry. Very sorry. That’s the problem with this as we build a community you are now my friends. Now that you’re my friends. You have to listen to me ramble and talk about things. And I’ll try to minimize this in case you’re new to the show. And you’re like, bro, you’re four minutes in Shut up. Okay, so let’s move it along. So we’re talking about war the worlds for 2019 I think it’s good. It’s kind of long course I don’t love eight hours, but I thought was good. Those very good. And originally I was going to do this war the world’s gonna read the book. Do the Orson Welles radio show, then do Tom Cruise the greatest actor to ever live the greatest actor to ever do this thing? Tom Cruise? Prove me wrong. Over 20 great films, knock them out of the park films 20 of them plus. We’ll talk about that later. But I was gonna do that and then I was going to do this epic series. But as whatever happened, I decided to watch the epic series first and it blew me away. And I got so much to talk to you about it so much that I thought this is gonna be like a two hour show in itself. So and let me tell you, I am shocked at what I saw. I am absolutely flabbergasted if you if you watch the show, you’ll know what I’m saying. And here’s where we get into plot spoilers territory. So I’d advise you break now go watch it and come back because when you get to the end of this show at the end of this series, On epics, you will see the whole agenda unfold. It’s all right there, my friends, all of it. You were talking, we’re talking to dream Chrome. We’re talking babies. We’re talking, illuminate, confirm, we’re talking occult symbolism. It’s all in here. It’s unbelievable. It’s the alchemical process right before your eyes. And I comb through some forums because I saw the ending and I thought, holy crap, is that what I thought? Is that? No, I can’t be. And I comb through some forums. Just a few. And no one seems to know. There’s just a few mouth breathers out there that think it’s something completely off base. They’ve No idea. They don’t know the truth about the occult symbolism as you and I do. I’m really excited to talk to you about this. So let’s get into it.\n\nWhat is it?\n\nThere’s no naturally occurring phenomenon it can produce a signal like this. I believe we have detected evidence of extraterrestrial life.\n\nWhat are you doing with me right now?\n\nHow would you know man, there’s no phone or internet. Have some way to go. I have to find my family.\n\nSome people made it out.\n\nWhen I think back to that day, small details stick in my mind.\n\nthe look on people’s faces. Do you really believe\n\nmaybe we shouldn’t have been surprised.\n\nThe characters in this so there’s obviously a lot of characters, we’re not going to give you the nuts and bolts of this in case you don’t want to spend eight hours watching it. And I’m gonna play clips from the show for you. I’m trying to save you time here. As long as I keep my show below eight hours, I will save you time. I’m gonna play clips, I’m going to put photos on the Instagram at Isaac Weishaupt you can take a look at the images. My mind’s blown anyway, okay, so, and I just finished it. That’s why I’m like, my brain is rattled. Okay. So the characters in this movie are the show where you got the professor, you know, because the storyline has the the smart science guy, of course. So you got Professor bill and and Helen who’s his ex wife. Bill Bill’s the nerd that’s trying to figure out how these things tick because you know in the storyline The War of the Worlds it’s like they catch a cold, you know and aliens die or whatever. Something like that. Which I’ll tell you right ahead. Like I said, we’re in plot spoiler territory. So you’ve been warned. That’s not how this thing ends my friends home. No, no, no, no, no, no. The other main character, Emily, she’s the blind girl. And she’s hanging out with her mom and her brother Tom. Then you’ve got this nerd from SETI. She’s actually I think they’re called Mehdi. meti, I’m gonna I’m gonna use the phrase Seti I don’t care is or is it accurate? No, I’m calling it SETI, but it’s like the London metti or whatever. And she’s the one who finds the signal. Okay, and she’s gonna play a big role in this tale. Then you’ve got this kid named Sasha Sasha. he’s a he’s an inbred kid. He’s the inbred every good story, or good stories, got an inbred child and that’s what the that’s what the porn hubs pushing right? All this family stuff and then weird in the bizarre that’s another that’s a topic for another show. Alright, so then I’m going to answer the question right up front what do the aliens look like? That’s what I think every time. I’m sorry I keep moving away from the mic I thrash around. I’m just excited to talk to you. What did the aliens look like? That’s always my number one with these movies and these shows because that’s what I want to know. I know some weird thing right? I gotta know what they look like. They were disappointing in this thing. They look like scary robot dogs. And, you know, and they kill humans by like, they’re like, able to shoot projectiles that you don’t really see and then they got a piston that comes out of their head like a how to kill Catalina with that gun with a piston. Which again, is analogous here because the humans are the cattle. Because as we know the Illuminati philosophy is that the slave shall serve as our as our old old timer. There. Aster Crowley said, I was called an old friend, an old friend. He’s a creep. I think he was a creep. But it’s funny because when this show starts out with Episode One, the first thing you see is a Emily, the blind girl getting a tattoo and you see the needle pumping in and out, much like the piston from the head of these dogs. Okay. I don’t know if anyone’s done a recap on this show. Like I like I will be providing you by the way. I did a casual research and I couldn’t find anything worth a damn. So the first episode, let me tell you, I’m gonna tell you what the whole episodes about. Basically, this SETI nerd she’s out there trying to find aliens, you know? And she find it’s like every other alien movie. It starts out they find the repeating signal. It’s from a habitable planet. And she phones it ends like hey, we got aliens. And then the government tells everyone all the states calm, stay calm. Meanwhile, there’s like these meteors flying through the air. These giant alien balls are crashing into the ground all over the planet. And they’re emitting this strange electromagnetic frequency. And the news is tweeting this, they say, Oh my god, there’s an attack imminent. And then this weird sort of EMP bomb sort of thing starts blasting out the earth. And people start to rip it out. And it’s pure chaos. Almost everybody on earth dies. Right off the bat, right on episode one. Now, when it starts out, you’ve got the blind girl Emily, and I’m sorry if I’m being repetitive but if you’re a simpleton like me, you’re not good with the names and the characters, especially if you haven’t seen it. So I’m gonna I know I’m going to say the Emily the blind girl every time but like, that’s what it is. Okay, very sorry. We all have to help each other along this journey. Okay, so if you’re a smart person, and you’re like, Yeah, get it, Isaac, chill. Sorry, we have to, you know, we got to get to keep everyone with us here. So it starts out Emily Longo is getting a tattoo. And right away I’m looking at this thing and I think that’s the Black Sun. That’s the black solar tattoo, but I couldn’t really confirm it. It was just a very small glimpse of it that you get its opening sequence of the film, the first thing you see, it must be important and it must come up later. And oh, my friends, does it come up later. It comes up in the last you know, the first two minutes of the film we see the tattoo. Well guess what the last two minutes, guess what you see the tattoo? So bounces from her over to the SETI nerds. And they’re like, hey, we’ve seen this alien signal. I guess we got to phone it in. So they they call in the powers that be and say, Well, guess what? Aliens are here. I\n\ncan be pasa. I already checked. This is real. What if we’re wrong criticalness wrong\n\nHi, this is Kathleen Hall from the Istituto us Konami metric.\n\nI believe we have detected evidence\n\nNow of course everyone starts panicking, right? Regardless, like no stay calm, stay calm. It’s cool. We got this and you hear some dialogue and the the dad there’s like, hey, when You know, when the government does you just stay calm, you need to run for the hills and the sun’s like, Yeah, but you know what that evil government is going to come save you if you shoot yourself in the foot, a little bit of a dialogue, which is kind of what we experienced with this whole 2020 COVID thing, ironically, you know, in the show was again released in 2019. On the first iteration, and then on epics, it was released in February, I believe. I was late to the party on this one. So, yeah, so there’s a little bit of debate about, you know, should we trust the government? What are we What should we do and government doesn’t really know anything? And, well, you know, this is all very familiar territory. Now, what’s curious is that our SETI nerd lady, she has a daughter and her daughter is a drug addict and she’s trying to get ahold of her she’s like, Oh, my God, these aliens are coming. And we find out her name is Sophia. Curious name. My ears rang up for that. Because Sophie of course is wisdom which knows The Orthodox faith we say, during the service during the liturgy, Sophia, the wisdom. So it doesn’t always mean luminate confirm satanist stuff, but we’ll re address that. We’ll come back to that. Then there’s, of course, all this talk about there’s a state of emergency and they’re closing those schools. And then there’s the writing and the loaning, which is exactly how COVID looked. Then the alien balls, they started meeting the EMF. And these electromagnetic frequencies, they hijack mankind’s brains, their neural networks. It’s much like we saw Did you watch my man jesse ventura show back in the day, he investigated HAARP. And in that episode, I believe I’m going off a memory here, which isn’t the best. I believe that was the same episode where he investigated the idea that someone could implant thoughts. Through this sort of technology, and I studied a little bit of this in engineering, there’s a thing called the frequency factor. effect. There’s something similar to that. I mean, it’s a far stretch from planting thoughts in people’s brains. But there’s kind of this idea that things sort of harmonize and synchronize in the world of frequencies. But the alien balls, they’re there. They’re hijacking the neural networks, and they’re trying to shut the bodies down. So what happens is the only way people can live through this safely, is they have to go inside of an elevator or a tunnel or some kind of form of what they call a Faraday cage. Which is ironic here, because you’ll see Professor bill and Helen, I see I gotta look their names up to bill and Helen. They, they go into an elevator to be saved. The Savior is through the elevator. What does that mean? Well think about the symbolism here. Most of us already know where we’re going with this, but we got the elevator and you’ve seen the M Night Shyamalan alum Salalah Mon movie, and it’s called devil and it’s about some the devil in an elevator prints his song we ain’t gonna let the elevator bring us down that’s referencing the devil. Don’t believe me? That’s what la Reid said. Then Prince of course infamously died in front of an elevator in his home so for some reason that’s associated with imagery of the devil so this story will make sense at the end when we see that the Savior for old Professor nerdy pants there and his, uh, his uh, his baby mama, they’re there in the the devil is the Savior the elevator saves them. And if you weren’t inside of some kind of Faraday cage you die. That’s how the almost everyone dies on earth immediately. That’s episode one. Now, Episode Two. You know everyone’s coming out of the hiding. There’s Carnage in the streets. Dead bodies everywhere. And that’s, you know, this is your typical sort of end of the world dystopian apocalyptic movie. And at this point, we confirm that there is in fact, the symbol of the solar the Black Sun on Emily, the blind girl, she got it tattooed on her wrist, we confirm it at this point. So now my, my mind is prepped for understanding, we are about to take a journey of an alchemical transformation. Okay? And I’m not going to give you the big reveal, because we got to get to the end, you’re going to sit here and suffer like I did. That is ever but you know what I’m saying? It took me seven hours and 55 minutes until my mind was blown. I was like, holy crap, what is this? What is this? They are programming us. I’ll give you a high level view. They’re programming us for the alien religion. And this is exactly what I wrote in my book. I have a whole section on adrenochrome and death cults. And I sort of postulated as safely as I could the idea that maybe just maybe these weirdos that are into this child sacrifice and mlok and sacrificing babies for the adrenochrome maybe just maybe they want to do that again. And they have been doing that they’ve been feeding babies to the devil to the demons. I know that’s a wild stance to take, but that’s kind of what I alluded to in the book without going too crazy on Yeah. And that’s what you see in this movie. Don’t blame me well hang in there. you’ll believe me by the end of this. So we see you know, again, this is your apocalypse kind of movie. You see all the looting You see? All this Doomsday prepper zombie apocalypse fantasy. Store free for all people going in and taking all the balls they’re shopping for no They want their toes in the guns. You know people get a real hard on for that kind of stuff. And I blame commando from the 80s on Swartz Nagar because I watched that as a kid. And if I recall again going off memory if I recall there’s a part where he busts into the store and he strapping up with every comes out Rambo guns with every grenade and, you know, weapon out of the store. And I was like, Wow, that’s cool, man. I can’t wait till I can do that. Turns out just need the aliens to come and I can do that. Now the EMF pulse it didn’t kill the dogs we find out which at the time I took a note on that but I didn’t understand how that would play. I just found it curious because they make a point of it right? They don’t allow the pulse didn’t kill the dogs. Why was that? Well, you’ll see a lot of dogs symbolism in this whole movie, whole show series. And this doctor, you know, typical science nerd Professor nerdy pants here, he that him and Helen are like they’re you know, they’re hiking out to safety or whatever. And he’s uh huh didn’t kill the dog proceeds to just leave the dog just leave them behind didn’t even care. It’s like Well, you could take them with you Good God, psychopath 2020 is the year of the dog by the way. You know everyone’s telework and hanging out with their dogs all day nothing to do so you walk the dogs. Dogs are loving this they’re loving life\n\nBut anyways, this is all foreshadowing that the didn’t kill the dog because the aliens are dog shaped. And you’ll find out why again, I hate to keep teasing you but at the end of the show, you’ll find out what all this means Why? Why the dogs so this whole episode, Episode Two the whole thing is about the people still left alive they start finding each other and thinking you know, assemble your crew. Now the prints reference for you there. And then we, you know, Professor nerdy pants here, he’s he’s so obsessed. He has to know what these aliens are thinking and what they’re doing. And he’s like, Oh, I just don’t know. How can they know so much about us? It’s like they know exactly what we are.\n\nWhat are you doing?\n\nHow the hell do they know so much about us?\n\nLike they know more about us than we know\n\nourselves. Shouldn’t you be asking why they want to do this to us?\n\nIf I figure out the hell, maybe I can understand why.\n\nMaybe there’s a connection between the means and the motive.\n\nThis is not a science experiment. Feel Let’s go.\n\nAnd Helens like, okay, Bill, cool, cool story, bro. Let’s go. And you know he’s wondering how can they know so much about us? Well we find out we find out in Episode Three that the we’ve been beaming music out to the universe we’ve been trying to talk to these things we’ve been telling them all the stuff about us that’s how they know so much about us. We’ve been blasting what as publicity out there to the universe to the aliens. And guess what they do? They they’re like, you know what? You guys gotta go. Now they’re going to kill us. Because the weather has, you know, you know, that’s just what we get, I suppose. Now, Episode Three. What happens is Episode Three when the aliens they start to hunt down all the remaining humans that weren’t killed with the EMP blast and We finally answered my question, what do they look like? Well, they look like the robo dogs, the the alien robot dogs that that those nerds have at MIT are always building that you see, you know, they’re supposed to be the cops of the future and they’re walking around on all fours. You know, these nerves I told you back in February, maybe it was even January, then I tell you this Didn’t I say the nerves are gonna kill us all. I hate to sound like a prophet here. Because I’ve been saying that for years, but I pushed it again in January. So these nerves gonna kill us all. First they decide they’re going to cook up some wool hand flew, and now they’re making alien dogs. They’re gonna come back and kill us. So the aliens there. They start to play back a song to us, to the humans, and it’s the creepiest song I’ve ever heard. And we find out that the song brought them here. The entertainment man infested aliens again, a theme from my alien book.\n\nis to go\n\nNo darlin, Dad You do\n\nwill not touch it here and you\n\nthe filter you had to die. And\n\nthat song is called into my arms by Nick Cave. We find out that the SETI nerd lady she chose it as the song they were blasting out to the university actually wasn’t one last post Yeah, I was wrong. She chose that as a song to blast out of the universe and the aliens are now playing it back to us. Who’s this guy cuz I was like this song is too creepy. Is this real? And sure enough, it’s real. He’s an Australian singer. Ironically, the Godfather to Michael Hutchinson’s daughter, the guy from an excess that that died. He killed himself didn’t he? But his daughter’s name is heavenly herati Tiger Lily\n\nAnd, you know, Michael has insight into Peaches Geldof is a member of the Oto and I believe her father’s tied into the music industry as well. Anyhow, the the lyrics he says I don’t believe in an intervention is God but I know darling that you do. But if I did, I would kneel down and ask him not to intervene when it came to you. Oh, not to touch a hair on your head. Leave you as you are. If he felt he had to direct you, then direct you into my arms. Oh Lord into my arms. Repeat, repeat you’re here. And I don’t I don’t believe in the existence of angels but looking at you, I wonder if that’s true. But if I did, I would summon them together and ask them to watch over you. So you know, it’s not it’s not a creepy song per se but in the context of this movie, it is the we’re planning to the aliens, saying we don’t believe in aliens or angels, excuse me. And then it’s almost like they’re like, you know what, maybe you should Here we are. And now you have to die. And they start playing it back to us. Now, in this episode, I noticed something. Professor bill and Helen everywhere they go, they are in a room that begins with the number three and here they go in the bunker to room 305. And I grabbed To photo again, I’ll put that on Instagram at Isaac Weishaupt like and subscribe. And in episode one and two, you’ll see it occur twice. And it wasn’t until the third time that I finally took note and was like, Okay, this is a thing. Because I believe in it’s epic, I believe in episode one in the apartment or in room 302. And then in Episode Three, they’re in 305. So the three of course is symbolic of the Trinity, the Holy Trinity, which the illuminate confirm types the occultist, they believe in the unholy trinity manifesting mankind which we will get into manifesting the New World Order, my friends. So Bill and Helen, they’re in this bunker. And here comes a woman named Rachel. She’s a mom. And she’s asked bill and Helen she’s like, hey, do you believe in God? And Helen’s? like, No, I don’t. Rachel’s like maybe it’s easier if you believe in something.\n\nMaybe it’s easier to believe in something.\n\nCan I ask you to do something? Yes, of course anything.\n\nWill you bury me with my children\n\nput the gun down like this.\n\nWhat would you do?\n\nI always like to\n\nSo then this woman Rachel, she kills herself so she can be buried with her kids, but for before she does, she has these flashbacks where she’s reading to her children some books. And guess what books she’s reading. She’s reading Alice in Wonderland, talking about falling down a rabbit hole. And as you know, from reading my book, about Alice in Wonderland, which you can get on gumroad gumroad.com backslash Isaac W. I think it’s free on there, isn’t it? Anyhow, you can read about Alice in Wonderland and it’s so illuminate confirm the whole story. It’s about questioning the nature of reality. And it’s almost like she is indoctrinate indoctrinating her own kids with this idea. But that’s about it for her not a big part of the story. So Bill, Professor bill, he starts dissecting and dead alien and finds out the inner guts. works there organic milk because they’re like metal robot dogs are made of metal except the inside has real guts. And it doesn’t know how it’s more primitive than it is advanced. And then Emily, the blind girl, she gets her sight back and then like loses it again. Everyone starts getting strapped up. And this is in London by the way. I don’t think I told you that yet. The whole the whole story takes place in Europe, in London. I didn’t know London had guns like that. But everyone’s loading up. And then bill and Helen. They are again in the bunker and then they’re in room 303 of course. And Helen comes out and she tells bill you know, you should do their nerdy pants. You shouldn’t make a biological weapon of virus I will hand flew maybe to kill the aliens since they have these organic guts he works. So again, curious connection Since this was filmed before COVID are they saying to cook up a virus in a lab to kill things? Hmm, sounds like population control to me. Episode Four. We’re already halfway through folks. Come on. Let’s go. Episode Four. This is an episode about personal development. The most boring episode then we refine the characters a bit, we find out Helen and Helen and Chloe son Daniel is dead. waiting. Does that make sense? Who’s Chloe? That might have been a typo. I was typing in notes on my phone. I’m very sorry. It doesn’t matter. It doesn’t matter. There’s all episodes about personal development doesn’t really pertain to what I want to talk about. So we want to get all mushy on the characters watch the show. So the SETI nerd she’s like, Hey, I think I know the source of the signal. I’ve been triangulating the signal and know where it’s coming from. And I thought in my head, I thought I’ll hear Go Saturn, it’s coming from Saturn. But no, that’s not what it was. They find out that it’s actually moving and it’s near them. Then things get weird. We find out that one of the characters, okay, this is Chloe, one of the characters in Chloe was raped by her own brother. And she had a child with him. And the kid doesn’t even know about any of this. He doesn’t know his real dad is that Sasha By the way, Sasha is the inbred boy in the story. Meanwhile, that kid, he’s, uh, he’s in the bathroom, taking a boom boom. And he overhears his mother talking to her brother that raped her, and many years ago that he wanted to, or that she wanted to give up the kid for adoption. Because, you know, now every time she sees her son, she thinks of her brother who raped her. What a What a terrible compliment. of events we have here we’ve got, I mean, not only that it happened like that’s bad enough. Then somehow all three of these people managed to stay alive in there like 99% of the world’s dead. Then, you know, the Sasha kitties is trying to go boom, boom in age without a cell phone, by the way, because the cell phones are gone. And on top of all of that, he is in hearing distance that his mom wanted to. Not only did not only did is he the product of a rape, but he also was supposed to go for adoption. So this kid’s having a rough day. But we find out that Sasha was actually outside he wasn’t in a Faraday cage. When that EMP blast killed all the humans, it didn’t affect him. Why was that? Again, we’re gonna find out later has a very childhoods and sort of vibe to it if you know what I’m saying. Then we find out that the that right at the end of the episode, you know, it was a pretty boring episode but then right at the end, we find out that the aliens are taking the babies from the hospital. Yes, this fits into all my adrenochrome talk. Here’s the first example of when they allude to this idea.\n\nso yeah, it And there’s not a lot to that clip that audio clip of the video clip of the clip. It’s the they’re in a nursery in the hospital. And there’s all the, you know, what do you call liked in the nursery with the baby cages or whenever you call it the basket things, the clear glass baskets, they’re all empty. The aliens came in snagged all the babies who still don’t know why. We’ll find out later, I got my theories to Episode Five. This is the episode where the alien dogs are going hard in the paint. They’re catching bodies left and right. Professor bill old nerdy pants there he heads to the lab because he’s gonna cook up that will hand flew. And most of the episode is basically people run from alien dogs. There’s a couple clues in here. Like Professor bill, he’s talking about how these dissecting the alien dog and he’s like, you know what, these neurons they’re not dense enough for these things to be intelligent. And he says these are the monkeys not the organ grinders. Which is a curious statement, because if you listen to my whole vaccine series, that’s how they made the vaccines for polio, they grind up monkey guts. And you better hope that monkey doesn’t have any weird diseases, because now it’s going in your body as a curious statement by Professor bill, but I think what he’s trying to say is that the mothership is where the brains are at. And these alien dogs are kind of just drones, which would make sense that seems to be how it would work. If all of a sudden we have these visitors they would probably be drones from the higher advanced civilization. Just checking things out, and then we there’s a whole whole section on there talking about the eyeball Professor building with the eyeball, it says not connected to the brain. What is that? Is that the all seeing eye is that the pineal gland\n\nYou see how totally belly neural packages are very high correlation between neuron density and intelligence. What does that mean? A larger animal like a, like an elephant they have they have a bigger brain but lower neuron density, whereas a bird with a smaller brain has greater neuron density. I guess it means that you’re more likely to be intelligent. If you didn’t, is that a joke? Kind of. So they have brains like birds. No, it’s completely different your instruction. I think it’s a simple killing machine. I don’t think it’s capable of developing sophisticated technology. So what does that mean? That means this is the monkey Got the organ grinder?\n\nCookie scanner? Is it an eye? Snow optic nerve? It was not connected to the brain outta hell does it See? Is it blind?\n\nefficency attached shot to see again.\n\nWhat do you mean?\n\nShe can see? But my before she says it’s different\n\nYou have to ask\n\nwhat if it uses some kind of sonar? Like a bat?\n\nMaybe? That’s a good question. You know what the most important scientific discoveries ignorant and we discovered a little we knew we had to look for answers.\n\nI didn’t mean to interrupt. I’ll let you get on with it.\n\nlittle bit older than you. Did\n\nSo Emily, the blind girl, she is emphatically connected to these alien dogs we find out. She could sort of feel the energies from these these alien dogs. She felt like a dead one. She’s also able to hear these pulsating sounds with her ear that other people can’t. Because I believe she is quantumly entangled with the aliens. Now her brother, I’m sorry, not Emily’s brother Chloe’s brother, the you know, town rapist, he his name is Noah by the way. The sun Sasha who overheard everything while taking the boomboom he lets he lets oh boy get killed by an alien dog. murda so he got his curious His name is Noah. Right? Because there’s a lot of religious themes in this whole story. You had Sophia. Now you got Noah and Before it’s over, we’re going to see the sale telcos, the Virgin Mary herself. Now, and at this point, I understood why they made these things look like dogs because there’s a scene where the soldiers catch an alien dog and they start torturing it. It’s injured and they’re kind of kicking it around and messing with it before they kill it which makes you very sad because you’re watching like, oh man, like put it out of its misery, even though these alien dogs came to kill. Damaged 7 billion people. You it’s drawing sympathy, and it’s connecting the idea of the aliens to dogs. man’s best friend. Now the again we’re revisited by the ghosts of adrenochrome passed and the guy talks about how the aliens killed everyone but guess what they they didn’t kill the babies. They took them with them.\n\nWay out with that.\n\nI’m just really getting started.\n\nYeah, they took some babies from the hospital.\n\nWhat do you mean?\n\nThey killed everyone else but the babies were gone\n\nwhile they do that,\n\nso they’re laying it on thick. There’s a reason for this. It comes up multiple times. This baby thing is a huge part of this plot. Okay. The episode ends and there’s a female cop. Basically, she gets drugged out by an alien dog and left disemboweled floating in she is in the her arms and legs are in the position of Christ on the cross. And is that not a sort of blast a heretical blast at Christianity? I’ll put the image on my Instagram you can shout off in the comments. Let me know what you think. Instagram at Isaac Weishaupt I think it was They’re playing that creepy song while she’s floating around, too, by the way, then at the very very end of the episode, blind Emily and Kareem that’s like her her little boomerang. They get it in and he asked her what her little solar tattoo means. And you won’t believe what she says.\n\ncase you didn’t catch that. She said she doesn’t know her friend chose it for her which we don’t find out anything about that. mean you kind of do kind of at the end, and he tells her, it’s your tribe. Okay. They’re planting these things in the story. And by the time you get to the end, it all comes together. Now. Episode Six, only got three to go six, seven and eight. Here we go. Episode Six. And this one goes hard in the paint. Blind, Emily, her superpowers. They’re now saving the crew from the alien dogs. She’s not sure why. But for whatever reason, she’s around and they don’t attack her or the people she’s around. And by the way, she can now see again, I don’t you know, and it lost me as to where that happened. Because she could see and then it went away as far as I knew. And now it’s back so she can see. I shouldn’t call her blind Emily anymore. But, yeah, so that’s kind of what happens in this episode. So it starts out in the guy and they’re out in the woods. All the military folks are out there with the SETI nerd and they find they find I’m about this electromagnetic stuff, kick it out from the alien ships and alien balls. And they find a monopole it’s a magnetic field will only pull exist. It’s just a theoretical thing. And this points is to the world of the quantum physics and all this wacky stuff and questioning the nature of the Newtonian mechanics and the classical physics that we’ve subscribed to for so long. Right or wrong, that’s what’s happening. Then Sasha the inbred child he comes up on a dead alien dog and touches it and he also much like blind Emily can feel how it died. This is kind of what happened if you listen to my episode on doctor sleep. You will recall that the girl Abra in the story abracadabra because magic is part of this thing. Yes, indeed it is. And doctor sleep the girl touches the glove of a boy that gets murdered for his adrenochrome for the steam and if freaks her out. She hates it because she can feel the energy, right? And she says that there lizardy things that’s in the book, you’re not gonna get that in the movie, the doctor sleep. You gotta, you gotta go. You gotta go hard in the paint like I doing on this stuff. You’re gonna read the book too. So anyways, as this whole idea of like, the connection of certain people got this thing, right, they got this sort of paranormal thing they do, okay. Then you’ll hear a professor bill. He’s talking about Darwinism. And he’s like, What? Why? You know, that why the aliens did this. This is Darwinism, survival of the fittest. But then he says, No, probably not that simple. Then Emily comes in, oh, blind. Emily comes in. And you know, she’s connected. She’s in tune with these things now. And she says, You know what, they’re just they’re afraid of dying. They’re afraid of dying. That’s why they’re here and killing us. Hashtag sad.\n\nis that why they’re killing us? I think it’s as simple as that.\n\nMaybe they’re just evil. They get off on it.\n\nThey want to live.\n\nWhere do you say that?\n\nSo Emily’s booth and Kareem, he tells her that, you know, growing up, he was in the sort of Sudanese gang. And there was like two different gangs fighting the government. And this is basically the analogy of the humans versus aliens, which is where the War of the Worlds story arts is where it originated from, from HG Wells his writing it was observations of what he call colonial imperialism and all this stuff. So is the film conditioning us is this store condition has to accept the idea of alien overlords that maybe we should be in fear that they will kill us or maybe we should have sympathy because they’re like dogs? Sure, not sure. Time will tell. Because as you know, they are releasing UFO disclosure. They said they’re going to and it’s coming. And it’s a slippery slope by friends to the alien religion. Well, then professor, old bill nerdy pants here he’s talking about blind people have enhanced consciousness because he’s again looking at this alien dog. It’s called blind sight and it’s filling in the gaps that people with functioning eyes are able to do. Do with their eyeballs in their brains?\n\nThat was making Emily see again,\n\nshe seems to fish\n\nMaybe subprocesses to not buying you know, there’s a phenomenon called blind so a blind person can know what an object is without physically seeing it. They can take up a cup without thinking. She can remember where it is not always. You know, when you and I process the world, we fill in the gaps. So it’s called consciousness. And although a blind person has less information because their eyes are fucked, I wouldn’t. I wouldn’t put on quite like that. But they do have and enhanced consciousness. This\n\nNow what’s curious is he finds he’s dismantling this alien dog and sees it in the AI binary code. Okay. This again will come up later. These are all clues. Then old SETI nerd she starts lamenting over her daughter Sophia, because, you know, she was a drug addict. She couldn’t get ahold of her. In the end. She’s like, I don’t know she’s dead or what? She’s lost. And very sad about that. Because, you know, they fell apart because of the addiction. Now, she feels bad, because she doesn’t even know is Sophia alive. She’s out there somewhere. She’s wandering she lost. Who knows? Well, you have to look deeper into this, my friends. What this is saying is the wisdom Sophia is the wisdom Is the wisdom lost? Is the word lost? Is she what they call a wandering brother? This is all free Masonic stuff, all these terms, all these phrases, goes back to Cain with the mark of Cain wandering around. He is the wandering brother, which is why the Freemasons greet each other as such. And they say is the word lost. And the the real meaning is that when the word is reestablished, that means Lucifer and his kingdom reign again. Because that’s what they claim is that’s what Bill Cooper talks about, and I haven’t seen anything to disprove it. He says all this Freemason talk about worshipping wisdom and the sun. It’s ultimately about Lucifer and reinstalling the Luciferian New World Order religion. prove them wrong. And I pulled a quote from you from text Mark As Codex Magica it’s an oldie but a goodie. Quote, moreover, the three messengers from Babylon inform the candidate, that the true name of God the name that has been lost for so long is not Jesus. But his JOB, JOB bulan they conveniently omit mention of the fact that this is in fact the name of a monstrous devil God, that the name is an unholy and blast from it compositive jaw yawei ball and oh Cyrus or own own is a spelled o n on on is a city in Egypt where the worship of the Sun goddess Cyrus is alleged to have begun. Somehow many in masonry today honor and revere Oh Cyrus under the name of on the name of his city curiously spelled Boone in the name jab bulunan jubbaland. No wonder must Sonic authority wl wilmshurst in his highly in yeah in is highly thought of by the Masons. The meaning of masonry proclaims this degree so vital to the transformation of the candidates life even suggests that in attaining this degree one exhibits the attainment of a new order of life. So yeah, that’s a that’s a whole thing here. That’s what the Sophie is about. She’s the last word. And she’s still lost. She’s wandering around. She’s the wandering brother like cane out in the wild. At least in this episode it is. But that’ll change. Now, this point in the show, I notice old Professor bill Professor nerdy pants. Every episode he’s wear every day he’s wearing a blazer and slacks and a button up shirt with a V neck sweater.\n\nAnd let me tell you this\n\nin an alien Apocalypse, I’m taking sweatpants all day every day. all day every day. I’m on I’m wearing a shirt. If I’m wearing a shirt, it ain’t got no sleeves. I can tell you that much. I mean, all we have is a tiny little fake pandemic. And I barely wear clothes at all. laundry day rolls right now. Okay. 2020 is great for dogs and laundry. All right. Yeah, you unleash the demonic alien dogs on me. No way. I’m buttoning up a shirt. I’m buttoning up a shirt and tucking it in. Are you mad? or running from these alien dogs? That was the most unbelievable part of this whole story if you could believe that or not. So blind Emily. She’s getting it in again with Kareem. And here comes mom. Here comes mom with the block. The C block, you know what I’m saying? And they have a little dialogue Okay, and we find out Emily can see again at this point. And again, I must have lost That part of the story, but she can for sure See? Then\n\nI guess that was all I had to say about that.\n\nBut Professor bill he finds out the aliens are scanning human DNA by doing a little reverse engineering these alien dogs. Why are they scanning our DNA? What do they want to know? What do they want to find? We’ll get back to that. Then they have a birthday party for Tom one of the kids. They wanted to feel normal, but then it gets spoiled a little bit because they give them a soccer ball and he finds blood on it. Then, Professor, Professor bill he says that hey, you know what, they’re scanning their DNA. The they’re stealing the babies. And, you know, the wife really she’s like all we tried to save a pregnant woman that was getting dragged away by an alien dog. What were they gonna do with that baby? They’re dragging her away cuz she had the baby\n\nGot to eat these things.\n\nThey seem to know much more about us than we do about them.\n\nshould the baby’s not\n\nWhat is it? The woman we tried to save one of these things was dragging her away. She was pregnant. Why are they interested in babies?\n\nYou have to keep watch. Would\n\nyou like me to keep your company\n\nAnd again we’ll we’ll figure out all of this before it’s over. Then right at the end of the episode right at the end of the episode, Sophia the wisdom, the last word the wandering brother. she catches up with the crew at SETI and she finds her mom the wisdom has been found. The Wisdom has been found the word is no longer lost the word of the reign of Lucifer shall begin. And we also see Sasha he starts obsessing over this photo he finds with blind Emily on it, and it says if they’re connected, okay. They’re trying to get you ready for this. Okay, and then we got episode seven. What happens in episode seven or second to last episode, we catch up with Sofia’s whole story. You know how she basically got out, and how she hooked up with a boy and not like, romantically like she found a young Like at a ski resort full of people, and then it switches over to, you know, hanging over their mom, who again as the SETI nerd, we find out everything is quantumly entangled in this episode and major characters start dying off preparing us for the final episode. Now again, the show start this episode starts out in Sofia is you know she she was in a tunnel during the EMP blast. That’s how she made it out. She snooped around she finds an RV inside of the is a boy young boy and she asked his name and he says Thiele, I said, Wait a minute. Wait one minute, how perfect is this? Because they team up right they team up right here. This is where where you gotta, you gotta again you gotta like get into this weird occult stuff. So you got Thiel and Sophia. feelings. Thielen Sophia Theo and Sophia Theo Sophia Theosophy Theosophy it’s the, the conjunction here to create Theosophy. And what does that mean? Well, again, this is a religion for the occultist, the Theosophy, and it refers to how cleanable vast he started this. She was just continuing the tradition really, as Crowley did. And she said it herself it refers to an ancient universal religion. And she also had said the religion of the ancients is the religion of the future. To talk about in the dark path in my other one of my many great books you can get on Amazon or Audible, or you can get some signed paperbacks, gumroad.com, backslash Isaac, W. All for you, my friends. I aim to please. I self narrated that book too. Like I did all my books on Audible. They’re almost all of them. The she said that Theosophy was a modern transmission of the underlying current of truth behind science. And religion, which is why her book ISIS unveiled has two parts. Do you know what those two parts are called? Of course you do. First part of science and the second part is religion because you see, they’re all tied together. This is the new alien religion. They had to make you believe science is the dogma, the unadulterated truth for many years. They needed you to shift your focus from preposterous ideas such as religion and Christianity, to make you believe in science as the new religion as the undying truth, but we all know from COVID from this experience that science can’t figure out its head from a hole in the ground. It’s not the right thing. You know what I’m saying? You know what I’m saying this is the new religion, though. They want you to believe that science is 100% the truth they’re never wrong. I’m here to tell you, my friends. I’ve got a master’s in science. And I’m here to tell you my friend science is wrong, many, many times is is a good it’s a great tool, you can learn a lot about our world. Hell, that’s how I’m talking to you right now, guess what, through science. But I’m here to tell you it’s there’s spirituality, and religion, and the unseen. And then there’s science, which is basically a measurement through the five senses, which can be deceit. But this is the new alien religion, Theosophy or whether you call it the perennial philosophy, or ecumenical ism or pan psychism. All this stuff again, will be in my alien book user illusion, one. Because it’s the new religion. It’s the same reason you’ve heard so many people tell you, I’m not religious, I’m spiritual. I think that all the religions are pointing to the same thing. I think Jesus and Buddha Muhammad are The same thing. It’s all the same source. That’s what they want you to believe. Now, should you believe it? I don’t know. How would I know? Don’t look to me for that. I’m just here to tell you that that’s what they believe. And that’s what they’ve been pushing and people are going to fall for it. It sounds crazy. Now I know you don’t believe me. You don’t believe me? Do you? You think I’m nuts? We’ll see who’s nuts. Once I have Dutch give it 10 years when I’ve been long wiped from the internet because we’ve been censored into oblivion. And they say all don’t listen to that guy. He’s fake news. which is again, why you got to sign up for my email newsletter at Illuminati watcher comm backslash start. Sign up for that free email. That’s the only way I stay connected to you. Because I assure you, I’ve been censored many times you think this is new to me? You think? You think this whole podcast this whole game of exploring and exposing the Illuminati agenda and the occult symbolism is new. No my friends I’ve been doing this for 10 years 10 years and I know a lot I talked a lot he is I know a lot he is I think this is new new thing for me. I Oh, I just came out of nowhere. Look at me when all these podcasts Nope. I’ve been banned and kicked off and shadow banned and silenced. So many ways. I assure you, it will happen again. That’s why I want you on my email newsletter. So that I can stay in touch with you cuz I pay for that. They can’t take that away from me. I pay for that. So, anyhow. So yeah, Theo, Sophia, they’re teaming up Theosophy. Again, another hidden symbol, another little hidden gem there. Then we see and I’ll put this there’s another image for the old Instagram at Isaac Weishaupt Theotokos. There’s the Virgin Mary. She shows up in the she’s on the background on the wall. But I assure you, it’s like all these other symbols. They’re putting it in there on purpose. That’s why Why the woman is floating like the crucifix. It’s juxtaposing the Christian faith because that is what the occultist said the problem was, they of course that all religion is a problem. All religions have to go. But there’s a certain problem with Christianity. And this isn’t me just saying that because that’s my team. I’m saying that because that’s what they said. JACK Parsons, Alistair Crowley, Elena blavatsky, Alice Bailey, all these new agers, you know that New Age stuff? Well, it seems very innocuous and nice on the surface. I mean, I subscribe to some of these new age weirdo meditation things. But you got to understand their roots. goes back to all that stuff, making contact with deities and entities and all that crazy stuff. Let’s keep moving. Let’s go. We hear alien dogs on the show. We’re back on the show. Now we hear the alien dogs. They have deep scanners are scanning the babies. And the aliens we find out are not just the dogs. And blind Emily she says that, you know Kareem knows how this works. He was from a gang in Sudan. So most people kill other people for no good reason. And this might be why the aliens are killing humans. That’s one of the theories floated here. Okay. Then Sophia, she is reading a story to Theo. They also FIA teamed up again and it’s about a dog and this dog talks and she says the dog has the best vocabulary in town. What does that mean that I didn’t really have a clear answer for but there’s a lot of dog references in the show clearly means something. And then here was a clip I wanted to get you but it’s in French. I don’t have any is there’s no speak French. So I’m just going to read you what what they what happens in the scene. The SETI nerds, she suggests that they had moved an array of antennas and it caused the alien ship to crash into a mountain. And the aliens are like birds, okay? Aliens are like birds and that they have these quantum properties in their cells that allow them to navigate and fly in formation. So when they blasted them with different antenna arrays, it messed that up, nested with their quantum antennas. And the ship is made of organic matter we find out and all the alien dollars are somehow connected to the ship. They’re all connected together as one big quantum entanglement mess. They all feel the same things. They’re all able to hear the low frequency pulsating. And that is why Emily and Sasha are connected as well. Then, then, then then well let me see here I got something else I wanted to share with you here. Okay, so the Birds, right. So have you remember when 5g first kicked off? There was all these reports of these birds getting all screwed up from the 5g signals? Do you remember that? And I don’t know if that’s in my book, I wrote a book called conspiracy theories and unpopular culture again, get them all those places in the show notes. We have a section on 5g and I believe it might be in there. But it messes the 5g signals. We’re messing with the bird quantum antenna. So this is true, right? Some true stuff in this story. But we’ll come back to that in a minute too. There’s a lot we’re gonna come back to a lot here in the next little bit. So things come near ahead at the end of Episode Seven. Emily fields the alien dog’s head, she can now sense the Sasha the inbred boy. And, you know, he’s and he’s, of course somewhere completely else. They’re quantumly entangled, right? That’s what I’m inferring from this clip. Just because I’ve been researching that a lot lately, then. You know, and Helen She she sees an alien dog and she she goes crazy. Even though Emily’s like kind of like feeling this alien dog’s head like everything’s cool because the dogs you know they’re aliens and Emily’s part alien apparently or something. But here comes Elon now all Karen style comes out blasting. But she gets body she gets taken out the alien dog takes her out. She was no match for the alien dog. Professor bill he was in the lab doing nerd things he shows up late. Everyone’s crying. Everyone’s upset. Now last episode episode eight. And let me tell you I was stoked to finish it. Because the beginning of each episode they played teaser for another show they have on epics about the Manson family and I really wanted to see that. But I was like, You know what, I’m gonna push through from a people. I’m not gonna get distracted. And here we are episode eight. What happens in episode eight. Well, everything. Everything happens. starts out Sophia. The army they’re gonna go save the people at the ski resort okay? Meanwhile, the people in the one camp they’re starting to think blind Emily’s a weirdo because the aliens aren’t trying to kill her. Then Sasha the inbred guy and Emily, the blind girl, they have some weird premonition of being together. It’s almost assumed it’s romantically but in they’re not kissing or nothing. But she’s laying down she’s pregnant he kind of caresses the baby bump. So it kind of implies they made sexy time but we can’t prove this. We don’t know this. And my notes literally as I was writing this, I said, I bet this thing’s a star seed alien hybrid baby.\n\nOkay, which I could have been right.\n\nThey see the full vision when they make contact with the alien dogs, okay. When he touches an alien dog, and she touches an alien dog, they both see the same image together About spooky action at a distance. waka waka waka that’s nerd humor for you quantum nerd humor. Then Emily, she blind Emily she realizes she has to go to the aliens. Because they want her help because she’s like, you know, they just want to live and she feels her pain and she’s empathetic to them. And again, Sasha, the inbred boy he’s now connecting to Emily through the air. No dogs needed at this point. And we hear a bird chirp. And at the same time, you hear the bird chirp. He you see a plane behind Sasha and it says Robin on the tail. Now what’s curious here, quick side story. And I’ll put that picture on the Instagram too at Isaac Weishaupt link in the show notes so you can see what I’m talking about what that says Robin on the tail this plane at the same time of birds chirping in the story. was curious was like at this point, I googled on my Phone, I googled quantum birds. The first link was a YouTube video about how Robin’s use quantum for flight. So I mean, maybe the producers of the movie The director, maybe that’s something for him. He was like, I know, put Robin on the tail of that plane. Maybe. I thought that was odd. Especially because we’re talking about all this weird quantum entanglement stuff, right? And I’m reading this other book, what’s it called? Breaking the habit of being yourself. I read it before it’s an older book. But it’s very good. It talks about quantum entanglement kind of ideas and law of attraction kind of stuff and you make your own you make you make your own reality basically. Now, here’s where it gets really weird. Okay, the same day I did all that. I went to the CrossFit gym as I do every day, get my adrenal fatigue, all pumped up. And I was in the gym and there was a burden there, which wasn’t very normal. But as I have that bird then I went out and did my little laps running outside the building. And I came in and I get on the assault bike and I look over and right and the gyms huge right? It’s a massive You know, you’re in a CrossFit gym it’s like one of those massive sort of deals, warehouse sort of things. Right literally within three inches of my little Blender Bottle cup thing. Stainless Steel By the way, don’t buy the plastic plastics full of chemicals. You want to get Oh gee granola, that’s what you do you drink out of stainless. Um, where was I? Oh, yeah. So this bird was dead next to my drink within three inches. Had a hole. I don’t know how many square feet this thing is 10,000 square feet. Massive. And it was dead. I mean, I was gone. Three minutes, I don’t know. And I was like, and First off, I’m a bleeding heart. Pet guy, animal guy. So Immediately, I’m sad eyed next to my drink and I was like, Oh my god, kind of make sure he’s dead. I poked him with my little sunglasses. He was dead. And then afterwards, I took him home and dug a hole in my yard like a real psychopath. And, and I want to put him in there, but like you, like I said, I’m bleeding higher. I’m a softy. And I was like, Okay, let me do a little prayer for this bird. makes me sad. So I typed it on my phone, and I and let me and I spelled it all wrong. And I was hoping Google would like, you know, translate it out properly. I typed in orthodox prayer. And the first result was it filled an orthodox prayer for a pet. Okay, now, one might think these are all just random things that seem to line up. I have my doubts in that I’m starting to buy into some of those weirdo quantum law of attraction stuff I kind of buy into some of this, which is what my theory on the aliens are as you will read And Use Your Illusion one when it drops any day now any week now. Now Okay, back to the story they scrambled a signal because they’re like I know how we kill these alien dogs. It’s not the virus by the way that’s part of the storyline just disappears. Is scrambled the signal and all the alien dogs die. Emily go blind Emily. She’s like I gotta go talk to the aliens. I got to talk to the mothership. Because right now like everything’s hunky dory, like it’s cool. All the alien dogs are dead. And then he’s like, you know what, I gotta go. I got to go to the it’s like a submarine kind of thing. And she goes into the ship and this is the end of the movie mind is like, one minute left. And I’m like, I’m looking at the clock and I’m like, dude, some crazies about the habit. There’s only a minute left and when you know, there’s only a minute left in the movies. And there’s big giant gaps of information you’re like something insane Oh is about to happen and sure enough about What happens she goes on with a ship. And she finds a bunch of babies and little, you know, fish tanks or whatever. And she gives this look like, Oh my God. And then she goes into the main room. And what she sees is kind of like the alien Prometheus engineer chair, if you remember that from Prometheus, and there’s a man strapped in a human looking man. And he’s got tubes plugged into him, but he looks kind of weird. Like he’s on breathing tubes. So sort of is what it looks like. They’re all hooked into his chest and his heart. And he reaches out to blind Emily, who can see and he’s got the same black son tattoo on his wrist on his hand, excuse me.\n\nIsn’t that so that’s how it ends.\n\nThat’s how it ends. And I thought this was a pretty good Show until the last two minutes. And it turns out is a great show. Great ending. You couldn’t ask for anything more. I love that kind of stuff. I live for that kind of stuff. So, you know, now that now that we’ve talked about this for an hour and now more hyped on I’m like, you know, this is a good show. I don’t think I gave it enough credit the beginning. I didn’t. Sometimes you got to like process so and you’re like, yeah, that was great. That’s good stuff. So when you watch the credits, you’ll see that that in fact was an alien. It looked like a human kind of but it says alien as the character and is played by Jonathan gunning. So we know he’s an alien. Which, by the way, if you didn’t listen to my episode, I did a podcast episode on Gretel and Hansel the movie, another great movie, by the way. It’s got hot witches in it. And hot whistle tattoos. Oh, baby. Then it has the he’s the he plays a character called the emaciated man. This guy must be a real freak. He must be a real freak in real life. To play all these weird characters, shout out, Johnson gunning. So let’s talk about what I think happened because that’s what you’re here for. Show’s over. That’s it. Okay. Now you hear my speculation, I think. And again, I haven’t read this anywhere. I think people online I have no clue what’s going on there. I’m talking about there’s no stupid, stupid ending. I think she gave birth to an alien hybrid child, probably with inbred Sasha. Because they were quantumly entangled, remember? And, and they made the alien guy. The alien guy was her son. That’s one theory, right? That doesn’t make sense because she was shagging cream, the whole movie so I don’t really get that fits in. But remember at the very beginning They made a big deal out of the whole thing. They said, How can they know so much about us? It’s because they are us. They are the alien gods that sort of created us. Only it’s like we created them kind of, it’s like we’re the same thing. Okay? Now, now the alien guy he grew up. And because it like you think about the timelines here, okay. You say, Well, how can Emily and Sasha have a son they haven’t even met yet. And that son is a full adult. Well, it’s because after this story, they hook up, they have a kid, maybe this is all theory, right? They have a kid, and that kid comes from the future. Back to the past with his quantum entangled alien dogs to find his mom because he was dying. He was dying. She said it the whole time. She had sympathy. She says they’re dying. They just want help. And it was all about the son finding the mom, because he was scared he was going to die and the cover art for the show depicts the earth being destroyed. With a newborn child emerging from the star child, which is again 2001 A Space Odyssey, which is again, this occult, chemical re engineering of man. And the reason that this is the reason why Professor nerdy pants bill, he sees binary on the eyeball of the alien dog because it was designed from a guy who came from our world and he understood binary. And he came from the future, which is what all these alien things talk about is like the timelines and space time continuum and all this weird stuff. And the reason the aliens look like dogs because again, this guy came from our world and must have left the planet for some reason and made his own dogs. Now what’s up with the babies while the babies are being harvested for the eight And guide to keep them alive. It’s the adrenochrome and they’re feeding it to them through the tubes. That’s why blind Emily sees the babies. And she’s like, appalled. She’s like what is happening? And he’s afraid of dying without the adrenochrome. So we send, so he’s like, I’m going back to Earth. And I’m gonna send these alien dogs out. We’re gonna kill all the adults and I’m gonna bring back these babies to feed me to keep me alive. Which explains the black son tattoo that you see from the very beginning. The first shot of the film is blind Emily getting a tattoo of the Black Sun. And I talked about this on that mega show I did with Sam Tripoli, J. Dyer, Chrissy mayor, x G. Jamie Hanshaw. We were all on there. And we talked about Christina Aguilera. And in fact, I posted this to my Instagram too. I don’t know why you haven’t liked and subscribed yet. And Isaac Weishaupt but I did. We Thought about Christina Aguilera and I made mention that Christina Aguilera was in a target commercial. And that targets and will the circle with a.in The center is a symbol for the sun. And in this commercial she was on Mars and it was black. It was the Black Sun, which is the tattoo, the blind Emily gets who she reveals. Kareem says this is your tribe. It’s their thing. This is what they’re doing. It’s the alchemical rebirth of man into alien going out to space the alien gods that need the baby blood. sounds crazy, but here it is. And like I said, I wrote the book. Before I watched this thing. Let’s understand what we’re dealing with here. Let’s look to a book called real alchemy by Robert Bartlett. You can also find the same information another book by Raymond Buckland called signs symbols and omens. He wrote a book about witchcraft to the heat basically, this is lays it out as such. Okay, if you don’t know what I’m talking about with any of this, you got to go back to the ancient Greeks. They called Egypt back then Ken k e or KHM or Kemet, which means the black land because they had all this fertile soil from the Nile River back then, okay. Now, Pythagoras from Greece, he was out there synthesizing all these mystery teachings from Mesopotamia and in Egypt and Greece and all this stuff and teaching it to his initiates. And these were the mystery school teachings that the public couldn’t know about. Why? Because I think that there was some idea of human sacrifice, sacrificing the babies to the deities to Moloch prove me wrong, Bohemian Grove same thing. Why they can’t talk about this stuff, because it’s very unacceptable, but to them, it might be. So he’s out there quite dire. So they’re synthesised In the teachings, he goes to the chem the Kemet, the black land of Egypt, brings it all back to Greece. And they call this sort of teachings, the black arts, the Dark Arts Kamiya the black art from the black land. And this is where the birth of the our chemists, initiates started out, of course, coming from the, you know, people fled Rome when it was christianized in 325 ad. And some of them fled into the Arab lands and the Arabic teachings, you know, they tie in with all this, you know, like, like algebra comes from Al Jabbar. And you’ll and you’ll find when you research all this occult history, the assassins and Aladdin and all this Arabic connections happen because these mystery teachings were centralized to this area. Before you know modern day stuff we call that like Western esotericism with Boivin ski and all that stuff. This was the original teachings here. So owl chemist, our course when it was in Arabic, and then chemists coming from the black land. This is the black teachings. The dark arts is where alchemy comes from. And when you’ve got the symbol of the black son of alchemy, tattooed on your wrist, it means you’re illuminate confirm. It means that she is the Negredo she is the first stage in the rebirth of man. The magnum opus, the great work, whatever you want to call this, it’s man ascending into something greater and different man becoming God, deification, apotheosis, whatever you want to call this, it’s all the same thing. This is the symbol and that’s why she gets it. tattooed the beginning and that’s why it’s a big deal and that’s why it’s honor alien, possibly son at the end of the movie. So in conclusion, let’s wrap it up. This, the world of worlds for on the epic show from 2019. It’s showing us this blend of occult alchemy, Freemasonry with the last word. They Oh, Sophia, with coded names and symbols. And we have the last word. The last Sophia is found. When you embrace the Fallen Angel, the alien who fell from the skies. And oh, by the way, we’re quantumly entangled with these beings from another dimension because they are partially us, they have our DNA inside of them. Or we could take it to, they’ve manipulated our DNA, which is why Professor bill makes such a big deal out of how they scan our DNA. They are checking in on Us, or modifying us or using us. And oh, by the way, they need the baby blood they need the adrenochrome which I would argue I would go out on a limb and say that is where we are headed. It sounds preposterous now. And I’m right there with you. I don’t know if I believe that. That sounds crazy. That sounds like crazy talk. But I’m telling you, when I look at all this, it makes sense that this is something that’s headed our way. So there you go. Hope you enjoy this analysis. Hope I saved you some hours watching the show or hope I gave you some understanding some clarification. Well, thank you for your time. If you want more if you want to learn more, you can get all my books on Amazon or audible Isaac Weishaupt or get the signed paperbacks right from my handy yours gumroad.com backslash Isaac W. Learn all about this fascinating stuff. And once you see the code Once you see the matrix, you’ll know what they’re doing. And you could see it coming. Coming Your Way before it’s too late. And again, my alien book user illusion, one will be available September, October, somewhere in there. You can get your name in the Special Thanks. If you get on the Patreon Team patreon.com backslash Illuminati watcher, that special offer expires September 8. You had to do it before then. I don’t know when you’re listening to the show. Maybe you missed it. missed it. I don’t know. But you got to put your name on that poll. If you sign up, you have to do that. Otherwise, you’re gonna miss it. You’re not going to be in this special thanks. Alright, thank you for your time. I appreciate your time, your support your energy, and until next time, my friends stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "War of the Worlds 2019: Occult Revolution of Man and the Meaning of Ending! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we go through the entire 8-part series of the War of the Worlds 2019 reboot! I’ll explain that INSANE ending, the symbolism of the tattoos, alchemy, alien dogs, the Freemason lost word, THEO/SOPHIA, the fallen angel, evolution of man, ADRENOCHROME, all this connects into what I […]", "url": "https://illuminatiwatcher.com/war-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-09-07T10:32:06+00:00", "article:modified_time": "2020-09-04T18:32:31+00:00", "image": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/09/ctauc-war-of-the-worlds-2019.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.instagram.com/isaacweishaupt/", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/40705169", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/war-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending/?share=twitter", "https://illuminatiwatcher.com/war-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20War%20of%20the%20Worlds%202019%3A%20Occult%20Revolution%20of%20Man%20and%20the%20Meaning%20of%20Ending%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fwar-of-the-worlds-2019-occult-revolution-of-man-and-the-meaning-of-ending%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Jacob", "Isaac Weishaupt", "Robin J Stephenson", "Zion", "Misty"], "publish_date": "2020-09-07T10:32:06+00:00"}