{"result_id": "165029", "URL": "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/", "timestamp": "2023-04-25 15:36:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Great Reset Pt 4: Bill Cooper's Behold a Pale Horse Predicts the Future! Globalist Silent Weapons for Quiet Wars!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we dig in the crates and look at Bill Cooper’s 1991 Behold a Pale Horse to see how it predicted the Global Great Reset of 2020! We’ll look at the Silent Weapons for Quiet Wars and play clips from a presentation he put on where he discussed the alien agenda, tracking systems, population growth, moving to outer space and more!\n• BONUS (*Patreon/VIP Section/Rokfin only): The Great Reset Pt 3: Jay Dyer, World Economic Forum’s 8 Points & the Communist Agenda 12/2020 https://www.patreon.com/posts/44929076\n• Great Reset Part 5: Generations Book from 1991 Predicts the Future, Q Anon and the Occult Fourth Turning! 2/2021 https://illuminatiwatcher.com/great-reset-part-5-generations-book-from-1991-predicts-the-future-q-anon-and-the-occult-fourth-turning/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Great Reset Pt 4: Bill Cooper’s Behold a Pale Horse Predicts the Future! Globalist Silent Weapons for Quiet Wars!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nSilent Weapons for Quiet Wars is the first chapter in my book. Once you read that you will have a complete understanding of what’s happening and one, one very important area that you will get an understanding what the elite think of us the common man the mass of ordinary everyday people, which is what most of us really are. We’re all special in our own way, but we are masses of people. They believe that we are cattle that we do not use our intellect that we are easily manipulated that we will not solve the problems of the world because we are greedy scumbags. And because of that we are nothing but steaks on the table for those who will use their intellect. And until we change that, they’re gonna treat us like cattle. And I’ve got to tell you right now, on a daily basis, we\n\nToday we’re going to talk about the great reset. Again, some more going a little deeper. Today’s part four for keeping track. We’re gonna talk about Bill Cooper, now deceased triple ojio conspiracy theorist, author of Behold a Pale Horse. My personal red pill, and I don’t agree with everything Bill Cooper says. But you know, here’s one of the originals, one of the legends and a lot of the stuff he said turned out to be true, as you will find out today. Now, if you are new to the show, you got to go back and listen to the great reset Part One two hour show I did it was a little book club. globalists Klaus Schwab from the World Economic Forum in Davos, Switzerland. He did and my German a German accent is being perfected each time I use these terms get a little better. Apart one we went through his book COVID-19 the great reset because what I saw on the truth or community was the repeated mantra about the great reset is the globalist you know, communist Marxist agenda. And I wanted to fact check that because that’s a big statement to make. And I usually don’t get into the political stuff, and I won’t after this, like this isn’t a regular thing for me, trust me, I already saw some folks on the Patreon comment threads showing their dislike of the political stuff and I agree, I’m right there with you. But this is a big deal. The big deal so in part one, we we covered the whole book and the ideas presented about why there’s going to be a new normal and then in part two, which I had a part two and a part three they were both premium contents, if you will, they only be able to get if you’re on patreon.com slash Illuminati watcher or rock fin comm slash creator slash Isaac links in the show notes. Our friends when the new network I just put my stuff on if you’re if you’re unfamiliar, I also have a second podcast I do called inside the mind of a conspiracy theorist on there, you can check out part two, we talked about another one a collage Schwab’s books called the fourth industrial revolution. And a very short version of that is that basically we are creating the magical age, the Aeon of Horus Alistair Crowley spoke of manifesting the physical reality from the mind. We are, in fact, materializing the spiritual world. Whereas the third Industrial Revolution, we went from making the material go to the spiritual realm when we put your, your compact disc into mp3 format, and you stole it from Napster, on your mom’s computer, or whatever. Then the great reason part three, again, only on the supporter feeds. We went over the World Economic Forum’s eight points and reviewed a one hour analysis of this idea from Jay Dyer that he posted on Alex Jones’s info wars. And I said, Could this be come on? You’re pulling my leg, Jay. You’re being extreme. You’re fearmongering Jay Dyer. And he wasn’t turns out. Turns out it’s all true. So what does that leave us with Well, it leaves me with one more point to make and that’s to go to Bill Cooper. To submit this idea because I’m a very skeptical guy. In fact, I barely call myself a truth or I don’t like the truth is to be honest but crybabies just snowflake crybabies very sensitive, you can’t talk about ideas with them anymore. They lose their mind. They don’t you know, they talked about Trump derangement syndrome. Well, there’s COVID derangement syndrome and globalist derangement syndrome. Like there’s no conversations to be had anymore. So I’m officially no longer truth or FM guys to cry babies. Go home. The sorry, I just you know, and this is stuff I talk about on inside the mind of a conspiracy theorist, because when I make post online, everyone gets their panties in a bunch. And that’s okay. It’s fine. I like a little lively debate. But good lord, apart for us today, that’s what we’re here to talk about. Bill Cooper, who’s Bill Cooper, you know, Bill Cooper is this guy’s been around forever. The extremely short version of Bill Cooper is that here’s a guy who was a he was in the Air Force, I believe, and then Naval Intelligence. He was in Vietnam. He said he saw some UFOs. He saw some documentation suggesting that there was this basically a globalist agenda, basically. And he was always questioning whether or not UFOs were real, or if that was a disinformation psyop. But you know, when I heard talk about UFOs, today, but in his book, behold, a pale horse, you will read, and I read this book back in 2002, I believe 2001 when one of my homies turned me on to this, and it’s like the first half is, is it later lays out this idea of a new world order. And the second half is kind of documentation supporting the idea. When you read that first half, you will see he lays out you know, it’s all your sort of usual suspects, right? You got the Council on Foreign Relations, Trilateral Commission, Bilderberg spends a fair amount of energy talking about this Jason advisory group that seems to have reduced in in prevalence over the years maybe. But he basically it’s this, this idea you’ve seen so many times, the umbrella group, the octopus is Charlie Robinson called it on our show, we talked a few months back, if you recall, David talks about it as the spider spider web. The global cabal secretly hatching a plan for world domination, a new world order a one world government, all these things. And he, in fact, in the book, he I didn’t realize it because I haven’t read the full book cover to cover in a long time. But I kind of thumb through it. And I reviewed one of his presentations, like a five hour presentation you can find on YouTube. And the, in the book, he goes into a little bit of the idea that this is all to worship Lucifer, Freemasons are in on it, all that stuff, which I found very interesting, because over the years, I’ve learned a lot about the occult. And that’s seems to be a very, I don’t know, that seems to be an accurate idea. I’m behind that I believe that I believe in the Luciferian agenda. Now in the book in Behold a Pale Horse. There’s a giant section called Silent Weapons for Quiet Wars. Supposedly, this document found on a Xerox printer for young people out there that was a call to Xerox is the copy machine right. Now, I’ll read to you from it. Because this is this is important. And is the document true and legitimate? Maybe I don’t know it. When you read it. It kind of doesn’t seem like Israel, because the way they talk like these are like the globalist and the elites and the smartest people. They would, I would argue their documents would sound more like the World Economic Forum’s documents very neutral. Very disarming whereas like in the Cylons are quiet wars and stuff like that people are dumb sheep, you know, and it’s like, would they talk like that? I don’t know. Anyway, let’s read. In the interest of future world order, peace and tranquility, it was decided to privately wage a quiet war against the American public with an online ultimate objective of permanently shifting the natural and social energy, the wealth of the undisciplined and irresponsible many into the hands of the self discipline responsible and worthy few. Now I believe that I believe the elites look at the lower classes with disdain and think that their cattle to be used and abused. And if they were good people, and they if they didn’t deserve this kind of treatment, they would work their way up, they would, they would bootstrap themselves up, which we all know is the big lie. Then in the book is a quote from Meyer am shell Rothschild from 1800s. They’re giving me control over a nation’s currency and I care not who makes its laws. This I would argue is part of the cryptocurrency push. If you checked out my show from a couple years ago, we talked about Bitcoin and cryptocurrencies. It’s also in my book, conspiracy theories and on popular culture, Amazon Audible, pick your poison. But that’s what this is all about. I argue, because I think kryptos are very much more traceable than US dollar. Now, the US dollar is a fiat currency. We all pretend it’s worth X amount. Since they deviated from the gold standard, which is again, you go to these old schoolers, like Bill Cooper, because he ran a show. Here, he ran a radio show in the 90s. And it was called hour of the time. And if you listen to some of those, it’s like, what do you call a shortwave broadcast radio stuff, you know, selling gold and all that stuff? Okay, so let me finish my story about who Bill Cooper is he there’s a there’s a documentary you can find, I believe it’s called our of our time. And he died in 2001 in November, right now, here’s the sequence That’s crazy. In like june of 2001, he said on his radio show, and you can find clips of this. I posted it on my Instagram, like two years ago. If you find it. He said on the radio that’ll in June, or July 2001. That’ll sama bin Laden was going to be part of this big sign off against the American public. And don’t believe it. Then 911 happened obviously. Then next thing, you know, boom. Please kill him. Now the story they relay the whole story on that little documentary, which you can find on Dailymotion. It’s hard to find anywhere really but on Dailymotion. Direct from one of his closest sort of friends and advisors and co workers there in that little town of eager Arizona. They claim that mean sounded to me like it was a bit of entrapment. They had some undercover cops pretending like they were partying down his road, Bill Cooper went down there with a gun does scare them off. And apparently he shot one in the head at some point. And then they shot and killed Bill Cooper. Now Bill Cooper was controversial, because was it terry nichols and Timothy McVeigh, the Oklahoma City bombers, they listened to his show. And the media glommed on to this and said, Oh, my God, Bill Cooper is part of a militia because Bill Cooper is always talking about Second Amendment rights. And he wasn’t really that kind of guy. I don’t think I mean, I I don’t I’m not an expert on Bill Cooper. But in that little documentary, our of our time is is a friend there a search that Timothy McVeigh and a friend who might have been Terry Nichols, showed up at bill Cooper’s house before the Oklahoma City bombing. And I don’t know there was there’s nothing of significance from the conversation from what I recall. Fact I don’t think he even liked those two guys. Anyhow, it doesn’t matter. He knew something was going down. Before went down. You know what I’m saying baby in 911 went down. That pushed us into the New World Order stuff, they took them out. And, and there’s a longer story, right? They did have an arrest warrant. They but the Marshals Service, went on record and said that he would not be taken alive when they showed up. Because they were they were charging with tax evasion, tax evasion, like come on. Anyhow, we’re here to talk about the whole pale horse. Like I said, there’s a Four or five, I’ll put the link in the show notes for five hour presentation he did. And I have a gang, I got a stack of DVDs that I bought from out of the time. fun story. I told this one before, but you’re going to get to hear it again. back. So my red pill sequence in 2000, like one or two, no 2002 it was after 911. My buddy was like, you got to read this book. And I said, Okay, and I found the book, pre internet era. And by pre internet era, I mean, we didn’t have the phones. And it wasn’t a, it wasn’t very useful for those kinds of things. So I found it at a bookstore bought it was like, Yes, this is great. I love it. I don’t know if I believe it, but I love it. It’s great. Then, like two years later, I met a guy who also knew who Bill Cooper was, you know, and this is really cool back then this is a very Fight Club ish. Because we didn’t you know, you didn’t hook into people that knew this stuff too much. And made him want to have these on, like a 12 disc set on. I think we bought it from our of the time.com and has like all these lectures from Bill Cooper. It’s, it’s outstanding. Now if I was if I had a better computer setup, I would I would rip them to digital, find a place to publish them. But I don’t want to screw with. I will screw up bill Cooper’s money. family’s money, because because you know, he was married. And I think they had a kid. Yeah, like they have a daughter, if I’m not mistaken. So I wouldn’t do that anyway. But it’s important information. But you can find this four or five hour lecture on YouTube for now. And I’ll put the link in the show notes. Now let and let’s just go through it right. And what I’m trying to convey here on this episode, is that Bill Cooper was warning us of all this stuff in the 80s and 90s. Now he could be I mean, I mean, it wasn’t. And Bill Cooper wasn’t like the only guy who ever said this kind of stuff. But it just shows that he was on the pulse of something that turned out to be true. 2030 years later, 30 years later, crazy. The first, the first clip, we’ll just for fun. You know, we talked about talks about the microchips getting implanted from the alien abductions, which I found curious because we now know through documentaries, a mirage Minh with Richard doty, who is a OSI agent. That they in fact, did these fake abductions, fake UFO abductions of people. And, you know, where these microchips used to track and trace which, again, those are terms that you’ll see with Klaus Schwab’s books about tracking and tracing through the blockchain with the maybe the vaccine, right. It was research and all this back with that event to a one stuff.\n\nYeah, this is very strange, because just before these began happening, and after we began buying these implants, we began noticing newspaper articles like this. computer chip implants can help fight loss pets. And it goes to outline how this happens. And it tells us that the Sheriff’s Department of the police department in the cities are given electronic equipment to communicate with a satellite that the government has put up. And if you put an implant in your pets, the satellite could find your pet wherever it is, when it’s lost, and your local law enforcement people tuning in to the satellite with their electronic equipment, and tell you where your pet is and go get it.\n\nThen next slide, please.\n\nThen you hear Dan Rather on the six o’clock news say that the pet implant program has worked so well. That 97% of all those pets that have been implanted are being found and returned to their owners that you should have your children implanted. You said this 1989 then you see, and the Los Angeles Times, not the National Enquirer, ladies and gentlemen, the Los Angeles Times on 12 1289 forecasts 10 changes for the coming decade. And one of those 10 changes number four, in fact, moving become necessary in the future with the availability and widespread use of electrical and chemical implants that will allow a 24 hour day control of individuals behavior. Now, Are you beginning to get interested in the abductee experience?\n\nYou’ll recall that because surely you were with me when we talked about the stabbings right and vaccine controversy shows parts one through eight if you haven’t listened to him You can get the PDF book of that for free go to the show notes. I got a I got a link in there you can get four books for five bucks. That’s a deal I got going for you. But the we talked about how Bill Gates was researching how to place quantum ink dots under the skin to prove to certify someone received an injection of vaccine Well, that sounds very similar they’re not embedding a microchip per se. But we’re getting there. Now the Michael Bloomberg his little media outlet, aka Mr. Misra himself. He’s already laying the the foundations. And notice how these, one of these globalist elites insist on owning the media outlets. Don’t people question everything at this point? Everything’s got to get filtered through this big money machine. Why? Why do they want to own the news? wanted to save you. And I’m always an advocate of I don’t throw the baby out with the bathwater. I don’t think every single thing that’s on the news is fake. Not every single thing is fake news. You just got to be cognizant, I would say it’s more at 20. I’m gonna read you from bloomberg.com. of the 1.1 billion people who lack formal proof of identity most live in Asia and Africa. And a third of them are children. According to World Bank data. The invisibility isolates them from systems of democracy and social welfare. Men and women failed to find themselves on voter rolls. Boys and girls can’t get into schools, welfare benefits are misdirected. And as Norman realized health care delivery goes awry. It doesn’t matter if it’s tuberculosis, HIV or immunizations. He says, in every single case, the fundamental challenges can you know who’s in front of you and give them the right treatment? So you can see how they justify this, because they’re, they’re saying, look, we’re going to everyone’s going to get the vaccine and the promise, you know, people lose their medical records. How do you prove you got a vaccine unless we put the quantum mink dots in your skin? lets you get the tattoo is it’s turning into idiocracy. Right? Why come you don’t have a tattoo. But you see how and this was my beef with with vaccines. They apply Third World logic, first world countries to the masses. Just like in the vaccines, they want to pretend that like that cultures that are quite literally playing in the same rivers that they dump their buckets of feces in need the same level of health care and vaccine protection, as we do here in the modern world. Right. Oh, I don’t know how can we possibly track if someone gets a vaccine in America unless we permanently mark them with quantum dots? Gee, I don’t know. Maybe send me an email about a piece of paper, a folder of actual paper. And by the way, those ink dots the I think they claim they dissipate over time, which adds more question as to why even bother? Right next, he talks about again, this is like 8090 stuff, talks about how the Soviets found UFO materials and this material. It was constructed on the micro nanoscale level, which is part of what to the stars Academy and the big alien psyop agenda is claiming today.\n\nBroadcast information service on presto foreign broadcast Information Services a division of the Central Intelligence Agency, which monitors our broadcasts on radio, television, military civilian, broadcast waves, and please information. This entire report, each paragraph is a separate report of flying saucer or UFO reports in the Soviet Union during the period covered by this report, and this report was issued 22 November 1989. You never heard of any every paragraph. One of these paragraphs refers to a crashed craft on a hill from which they recovered\n\npieces of technology that were not capable of manufacturing. Next Page please. All links now you’ll see at the top is what they found.\n\nUp here, you look closest like read it Some of the scientists have concluded that the object that crashed into Hill 611 was an extraterrestrial space vehicle constructed by highly intelligent beings. Dr. chemical sciences v Vysotsky. It’s good thing I’m airbrushing when I couldn’t talk stated that without doubt this is evidence of a high technology and it is not anything of a natural or terrestrial origin. He cited the fact that the remnants of fine mesh included bits of thin threads with a diameter of only 17 microns. And that these threads in turn were composed of even thinner strands twisted into braids. extremely thin gold wires were discovered intertwined in the finest threads evidence of an intricate technology beyond the present capabilities of terrestrial science according to this man that I can’t pronounce his name.\n\nRight What he’s what he’s saying is that the materials and this is what they’re saying for the to the stars Academy stuff, they found these UFO materials. And there’s no way on earth to construct something at that level of deep, like on that subatomic sort of level. He’s saying they they were doing this in the 80s and 90s. Okay, very strange, right? I’m just saying he, this guy was talking about stuff that you know, like I say the churches are always right. Sometimes they are. Sometimes they’re always right. This guy was right. Fun part he, at one point, he says that he doesn’t think we’d be in this whole mess if women ran the world. Who would have thought an old school Boomer conspiracy guy would be so woke. I don’t know if I disagree with him. I think I think men and women run different motivations, right? I think women are more empathic, more emotionally in tune with one another. I’m sure there would be problems if women ran the world to just have a different level different kind. Right? Right, different kinds. Now, I’m not gonna walk into that landmine. I just found it interesting that he said that. I was like, oh, who would have thought, you know, you take a look at Bill Cooper. And you wouldn’t think he would say such a thing. But they wanted to the media wanted to portray him as this, you know, right wing militia kind of guy. And he wasn’t necessarily that way more complex than that. But you know, America is we want things black and white, very simple. Move on. Now, next thing he talks about, Okay, here we go. Here’s where we get into the globalist agenda stuff. He claims that corporate America is in fact, the Council on Foreign Relations, and they’re the ones helping cover up the UFOs. The point I’m trying to make here is that he’s saying that the CFR is in fact tied into these globalist, and I, I agree with that, right, because Klaus Schwab says the World Economic Forum is run by the 1000. But, you know, the 1000 biggest corporations in the world or whatever,\n\nexperts idea of what the corrupt structure looks like, he believes wholeheartedly that to have a cover of this kind involving this kind of technology, you’d have to have full support from call corporate America. Now this would be very easy in this country, because who is corporate America?\n\nIt’s literally the Council on Foreign Relations. I’m gonna show you later that not only is this possible, it’s probably absolutely right on next.\n\nAnd much like, much like we’re gonna see with in the in 2021. It’s going to be the corporate the corporations that decide if you need this, the stabby or not. It’s not gonna be the government. I mean, even though President Trump sign HR Bill 6666, talking about how the US military was going to be injecting you with Operation warp speed, keeping you quarantine inside your home till you did it. It’s not going to look like that it’s going to look like corporations and corporate america saying, well, you cannot have the stabby you just can’t do anything. Because that’s who really runs this pace. You know what I’m saying? That’s the oligarchy. That’s what your boy Bernie Sanders was saying. He he talks about the UFO agenda on this thing. And he rightfully asserts that there’s a map. If you go out to area 51 as I did, me and Jimmy the jackhammer went out there many moons ago. And you find I’ve got the full video, I believe it’s on the YouTube channel. Still, I don’t really mess with YouTube like that anymore. They’re just such a hassle. If you go to my YouTube channel, Isaac Weishaupt is the user is the channel name. link in the show notes. You can find that video. It’s a fun time, we went out to Rachel Nevada. And in fact, when you look in the map, it does say saucer Mesa and I, I noticed that too. And I thought, wow, that really is weird. But he has searched that he talks about how project redlight was flying real UFOs it was actual pilots flying real crashed UFOs and they eventually confirmed this with Project oxcart which was strange. There’s a hole and then that DVD said that I’ve got there was a hole. I think there was two discs on project redlight added to rewatch them it was many years ago. But to stick with the subject at hand, he goes into this, this is a great clip, and it’s gonna be like 10 minutes long. Okay. 10 minutes long. So, hang in there, grab yourself a little coffee, right? Keep it black. Don’t be putting that sugar poison in there. But why do we need a one world government? This is this do not skip this. Do not skip this. If you skip this. You’re gonna break my heart. It gets better as it goes. Okay, so I’m trying to tell you it’s 10 minutes long. It’s going to get better as it goes, you got to stick through it, because this is a very important point to make. And I’ve been laying this out so far as like, Look, Bill Cooper’s legend, Bill Cooper was right about a whole lot of stuff that people thought he was an insane Oh, militia guy. And that wasn’t the case. He was right about a lot. But this is what this is what we’re getting into. Why do we need a one world government? Let’s go. Now,\n\neverybody wants to know, why do we have to have a one world government? Why is it that they won’t let us have these things that we know will cure disease?\n\nWhy are they so hard and homeopathic medicine? Why this Why that? Why this why that is simple. Folks, once you really get into it, there is no doubt about it, there is a serious population problem. At the end of World War Two, or actually during the war, they did a study to try to determine the effect of the returning soldiers from the war upon the economy. What the people who made the study projected was that there was going to be a whole bunch of babies born. They did a study again in 1957, which stated that the exponential increase of the population would ensure that the population would double between 1937 and 1990. And they did. They said that if something wasn’t done, the increase in the use of insecticides, toxic chemical ways. effluent sewage, the pollution, the air, the use of fossil fuels, the use of timber, the increased need for raw materials was going to put us in a crisis. Because they said that if something wasn’t done to stop the growth of the population, the population would double like in 28 years from 1990. And it will, and then we will need twice as many trees twice as many homes twice as many cars twice as much oil twice as much food twice as much everything, we will be putting twice as much sewage into the earth twice as much pollution into the atmosphere twice as much toxic waste material. And the study said if we don’t stop this, if something isn’t done, the human race will cause itself to become extinct. Certainly by our after the year of 2000. Some people still didn’t believe it. So the Club of Rome was formed secretly by Dr. are really up the chain in Rome, Italy. He got together a group of elite men and scientists and they did another study and came up with exactly the same answers. They then commissioned a group of people in the United States at MIT they put together a team to establish a computer model to determine what can be done to stop this what can be done to ensure that it doesn’t happen again, what can be done to ensure that the human race survives? And the answer is some of the things that I’m going to show you. All of this is in my book is thoroughly documented and it’s going to really upset some of you but it’s true. The first indication publicly was this book written by Dr. Paul r early. Now y’all wonder why, why is Dr. Paul Ehrlich writing these books? It’s because his wife, ladies and gentlemen is a member of The Club of Rome.\n\nThis was copyrighted first in 1968. It was the first indication of the results of the secret studies. This was published by Paul Ehrlich next. It says here probably accurate to say that all the food produced in the world today were in some sense equally distributed that everyone would have an adequate diet. Does that mean that those who claim that there is no population problem only a problem of distribution are correct? Absolutely not. Population pressures are a product of animals as they exist, none as they might be. If lions ate grass and still have antelopes, the plains of Africa could support many more than before the plains would be overpopulated. Similarly, the carrying capacity of earth for saints is considerably higher than the carrying capacity for Homo sapiens. And theory, the problem was human overpopulation could be solved by a reduction in population size or by change towards more saintly behavior.\n\nThe current situation of global overpopulation is so serious and the built in potential for further population increases. so great that the only sensible strategy for humanity today is to end the population growth and start a population decline as rapidly as is humanly possible, simultaneously striving to achieve a more equitable distribution of the food and other goods of this planet. Limiting births and increasing social justice are not alternative strategies to preserving society. They are lead to new and necessary complements. Excellent. Now, here is the key in this book, Paul Ehrlich told us that they had already decided on the solution, because they had tried zero population growth, and we didn’t buy it. We didn’t buy it worked in some small areas, but it didn’t work in many, and it certainly didn’t work worldwide. This paragraph tells you everything that you ever need to know about what is happening today and will answer a lot of your questions. Basically, then there are only two kinds of solutions to the population problem. One is the birth rate solution in which we find ways to lower the birth rate didn’t work. Didn’t work. The other is a death rate solution, and which ways to raise the death rate war. asked me about the Middle East. You asked me about what happened to Iran. You asked me about El Salvador, you asked me about Nicaragua. You asked me what’s going to happen in the future. This paragraph tells you what’s going to happen. And pestilence find us they have just shut off the water to all the farmers in the San Joaquin Valley. They produce 50% of all the vegetables that are consumed in this country. Do you believe that’s an accident intravenous.\n\nlarge corporations and banks have been forcing the small farmer out of existence and buying up land which sits follow. You think that’s an accident? We have sold all of our greens Soviet Union, do you think that’s an accident?\n\n20 days supply of grain in this country. If we needed it in an emergency. Now, listen to this the problem could have been avoided by population control in which mankind consciously adjusted the birth rate suddenly a death rate solution did not have to occur\n\nis telling us Ladies and gentlemen, that they have already decided upon it and it isn’t effect. Next.\n\nmorning was the limits to growth. This was published by the global growth next. That concludes conclusions are and this is only what they reveal to the public. What they told to the power elite of the world is entirely different story and is much more radical. If the present world trends and world population industrialization, pollution, food production and resource depletion continue unchanged, the limits to growth on this planet will be reached sometime within the next 100 years. The most probable result will be a rather sudden and uncontrollable decline and hold population and industrial capacity. And what they don’t say here that they said in the in the secret report is that the masses of people in the world will result to the overthrow of their government and anarchie will reign. As they tried to feed themselves and their families and finding jobs. It is possible to alter these growth trends and to establish a condition of ecological and economic stability that is sustainable, far into the future. The state of global equilibrium couldn’t be designed so that the basic material needs of each person on earth are satisfied, and each person has an equal opportunity to realize his individual human potential. Who would suffer the most under such a plan. Not directly to know they are in control.\n\nIt’s going to be us Americans consume most of the raw materials in the world 50% of the energy supply is consumed in this country. We pollute the earth more than any other nation, it is us we’re gonna have to go back and live like our ancestors did, and they’re gonna make us if we don’t learn how to do it on our own. I’d rather be a volunteer than a slave, I don’t know that you. If the world’s people decide to strive for the second outcome, rather than the first, the sooner they begin working to attain it, the greater will be their chances of success. And now, in the last paragraph, something really important, these conclusions are so far reaching and raise so many questions for further study that we are quite frankly, overwhelmed by the enormity of the job that must be done, we hope that this book will serve to interest other people in many fields of study, and in many countries of the world, to raise the space and time horizons of their concerns and to join us in an outside in an understanding and preparing for a period. Listen to this, because they’re not kidding, it’s coming very soon, or a period of great transition, the transition from global to global equilibrium.\n\nNow we’re gonna break that down, we’re gonna break that 10 minutes down. Almost point by point. He says the population growth is the reason he says, and this is back in the 80s and 90s. Okay. And that’s probably what the data was pointing to. Because from what I’m reading today, there’s some places I retweeted the other day, Japan, they have a they’re not, they’re not making enough babies, which I think is part of the whole infertility stuff, I think they’ve genetically modified the food for increased infertility. Because they were worried about population growth, getting out of control. Anyhow, that’s what this is all about. Because after the baby boom, they were studying and confirming exponential increases and doubling the population. And if something wasn’t done to stop us, us animals from recreating, we’d be out of option, you know, you’d have too much pollution, there’s none of fossil fuels or none of raw materials. And this would be a massive crisis. You know, you’re doubling, you’re doubling the population, therefore, you’re doubling the burden and the resources required and mankind would become extinct. A truly global issue, a global issue, to be tackled by the globalist by the elitist by the finest of mankind to save mankind. Because we’re not doing that, right. We’re just out here mouth breathing, listening to podcasts, watching movies. What are we going to solve? How to save mankind? No. Are the superheroes coming now? The elitist see this and they say, well, we got to be the ones to step in. We got to be the adults in the room. And like I try, like I try saying and I keep getting burned every time I do. I don’t know that they’re wrong. Okay. I don’t agree with them. I would like the decency to be spoken the truth too. But not everyone can handle it. So what’s a fella to do? I’m not. Okay, anyway. See how sticky this gets real quick. Now. So is population growth getting out of control today? Maybe not. Because you can see countries like Japan that are having problems with people not have enough kids, China, they used to have that one child policy and from what I recall off top my head that they lifted, that people are not having kids like they used to. So it’s not so much of a problem, but they’re still presenting it as a problem. And I don’t know the right answer. I’m not combing through this data like they are. And here’s what it comes down to. Do I trust them? Hell, no. Hell no. So no matter what they’re saying, like I don’t trust them. I don’t know that they’re wrong, though. The Club of Rome. This is again, one of these globalist groups full of the elitist, the elite scientists. And they have the same answer. They they were commissioning teams of computer model computer science nerds at MIT to figure out how do we stop this from happening, we cannot go extinct. He cites a book of population bomb. as support for that. And from the book, talks about if humans had more saintly behavior, we could solve the issues. We need rapid population decline while pursuing a more equitable distribution of food, social justice, etc. They tried population growth, but we rejected it. That’s your birth control your abortions, all that stuff. They could do it through death, they could have wars, that’ll keep the population down. There’s death rate via reduction through pestilence famine, was one option to keep the population growth down. The problem could have been avoided by population control in which mankind was responsible enough to constantly adjust their own birth rate, so that the death rate solution didn’t have to happen. That’s what this book is saying. Because you can’t get the public to do nothing. Right? So like, on one level, I sympathize with these globalists that I’m like, Yeah, I get it. Mankind sucks. I would prefer to think that I’m not part of that problem. And I would want the facts, give me the facts, I’ll figure out what I need to do that and now when this goes back, this goes back to my extremely controversial stance about the masks. Because here in Utah, they did not mandate it for months and months and months. Governor sherbert was out here saying, Please, please do it. And you know, and since then, I’ve been more anti mask, like I wear the thing. But I also I see enough information now and studies and evidence that I’m like, okay, I don’t think they really do anything. I think this is a full gaze, he is their full gaze, he made people feel safe to go out and shop, I think is what it is because of a false illusion of safety. Because that’s what we do in America, false illusions of safety, TSA, foam 911. Created TSA doesn’t do nothing. Well, if it doesn’t do nothing, I just remember seeing a study where they said like 90% of weapons got through still or something. Anyway. We’re with all the math. Yeah. So that’s what I was saying was I was like, Look, don’t make don’t make government be big brother. Don’t make them force our hand. You know, it’s like work, right? It’s like when you go to work at the office, you try to stay on top of your project so that the boss man doesn’t have to come down and tell you what to do. Right, stay ahead of it. And that was my argument for is like, Look, maybe it works. Maybe it doesn’t, they’re asking us to do it. I know. It’s the government. Everyone hates the government so much. I get it. Why would we trust people to screw us over so hard sometimes. But this is kind of what Bill Cooper sentiment was, ironically, maybe he maybe his red pill went deeper into me than I thought. But he’s saying that the globalist look at this as look, you can’t help these people. You can tell them what’s best for them and they won’t even listen. They’re out of control. We need to be the ones to step into the room that he needs to come home. And I’m in the camp of like, I don’t want daddy to come home and Don’t Give Daddy a reason to come home. Now publicly, they said that food pollution, natural resources, they’re all going to be maxed out in the next 100 years. And that is when the sudden uncontrollable class will happen. The masses will overthrow the governments there’ll be anarchy. People are going to be fighting for the food and the resources. So that’s what they want. That’s why they want global control. They want a global equilibrium, distributing what is necessary to each person. That’s the communist, Marxist agenda. socialism. divvying out only what you need exactly what the World Economic Forum eight point says exactly what the great reset says. All of this. But I agree with all the truth, there’s that say, here’s the problem with that the rich won’t be suffering. The elites are coming up with this plan. They’re not going to suffer, it’ll be us. Bill Cooper says we either volunteer or we become slaves, which was ironically my stance with the masks. You either volunteer to do it. Or you get directed a mandated to do it. The writing was on the wall, right? They think it helps. I don’t know that it helps. I don’t think it does anymore. But it’s it’s too late for that. And that and look, there’s lots of moral quandaries with that, like, Oh, do we just jump off the cliff? Because the government’s just Oh, right. I get it. Like they just seem to put the mask on. They’re not saying jump off a cliff. But it is a slippery slope. Right? How far do you take this? Again, a moral quandary we could go on all day. We could wax philosophically about this all day, but we won’t. But Bill Cooper, he says that we have to be the the force to push all of these things, or the Masters will force it upon us. Another idea, the globalist elitist they want to live forever, but they want you to die. You hear I think Jay Dyer says that all the time is like is like, No, Mr. Bond, I want you to die. And that’s what Alex Jones says. Yes, they do. They want you to die because of the population growth. It’s not a personal thing. Like they’re like, Oh, I hate you, you have to die. It’s the facts of the matter to these people. They believe this. Like you can believe it or not all you want, it doesn’t matter. You’re not in the position. You’re not in those offices, you’re not in the in the boardroom of the globalist elites. If they want to believe something works, you better believe that you got to play the game. That’s just the nature of how this went down. There’s also a little bit of exoneration for the elites, you know, like they’re honestly giving you a chance, but you’re messing it up.\n\nthe, you know, they and here’s what it sucks, right? This is human nature. It’s like these guys are hypocrites too. They say oh, you should share and not use more than you need. Meanwhile, they’ve been hoarding all the wealth and all the resources playing in the private jets and unnecessary amounts of wealth and houses. So that’s where they’re like they’re wrong at the same time. And it’s a messed up deal. They’ve manipulated the masses to increase their wealth, then they tell you that your greed is ruining the planet. But on some level, we have to own our individual rights and make the right choices and see through the lies of the corporations, big oil, Big Pharma. They’re all lying to us. While the world burns people are getting sicker. I feel like I feel like they live the film. And it’s like you and I, you know the listener and me Here we are, we’re hot rod and Frank from they live, or watching the elites abuse the masses, while also seeing the masses allowing it to happen and going right along with it. I suppose this is why there’s a there’s truth. There’s they’re so passionate about this stuff, right? So maybe I should take back my my COVID derangement syndrome, you know, maybe you know cuz sometimes you dig into this stuff and you do get mad. So I get it, right, I get it. So I suppose this is, you know, maybe I should change the my, my T shirt logos of shirts I sell. Instead of saying these nerds are gonna kill us say these nerds and mouth breathers are gonna kill us. Because the masses are compliant. And this is well that Cooper, he proceeds to lay out all these models that the elites have been analyzing, suggesting they need to do this to us and all this stuff. There’s an interesting one where he talks about alternative three and a base on the moon and colonizing space and all this stuff.\n\nWhat’s one of the answers? alternative three. I also saw documentation of already showing you documentation on slides that there may have been somebody in the moon and I think 58. And I can tell you right now, there is a base on the moon. We are attempting to colonize space because of their attempts to control our greed and our wastefulness and our destruction of this earth do not work. The only hope for the survival of the human race is colonization of other planets.\n\nthis is verification, I can’t tell you who wrote this letter, but it is a letter that was delivered into our hands\n\nWell, I can’t tell you that. But this confirms that as far back as 1962, working for the Jet Propulsion labs in Pasadena, she was working on photography taken of the Moon and Mars from objects that went there. I can tell you that the first landing on Mars of the probe occurred on May the 22nd 1962, sent back photographs and verify the existence of an atmosphere that could support life. This one was married to a man she says this letter his function was to design don’t monitor living facilities. Next slide please. For colonies of Earth, scientist to be stationed on the moon, and then Mars was called Project Adam and he, we didn’t get this letter, ladies and gentlemen, until August of 1989, I had already revealed the presence of a colony on the Moon and Mars on July the second 1989.\n\nreport from Iron Mountain in the possibility and desirability of peace.\n\nthis is really important,\n\nthough not yet expressed, the put forth is the development of a long range sequence of space research projects with largely unattainable goals. This kind of program offers several advantages lacking in the social welfare model. First, it is unlikely to phase itself out regardless of the predictable surprises science has in store for us, the universe is too big. In the event, some individual projects unexpectedly succeeds, there would be no dearth of substitute problems. For example, if colonization of the moon proceeds on schedule, it could then become necessary to establish a beachhead on Mars, or Jupiter, and so on.\n\nSo how curious is that he’s talking about this in the 80s and 90s, about how we’re trying to go out to space and find another option for survival of human race. And as you know, this is where, you know, Elon Musk is out there promoting this kind of stuff. They’re even in Bezos, like they’re all trying to get out in the space. Well, does that make sense as to why they’re doing that now? It’s not like they’re just only fulfilling some nerd sci fi fantasy. They believe this stuff. The same when we talk about water on the moon. Hey, he was talking about water on the moon way back then. And if you recall, NASA proved this in some massive announcement in 2020.\n\nOur official NASA photographs, and right out of the national publication, I didn’t fake them, you can go get the same book and walk look at them yourself.\n\nThey told us there’s no water on the moon. I guess that is offering a comment as a next. Yeah. And\n\nin October 26 2020. We’re reading from the article. For the first time water has been confirmed to be present on the sunlit surface of the moon said Paul hertz, Director of astrophysics, blah, blah, NASA. He said we had indications that h2o, the familiar water, we know might be present on the sunlit Side of the Moon. Now we know it’s there. This, this discovery challenges our understanding of the lunar surface and raises intriguing questions about resources relevant for deep space exploration. You see, they’re looking into this stuff, right. Soon as the writing’s on the wall that and maybe look and maybe they’ve got data that we don’t maybe they know something we don’t, or maybe they’re wrong, who knows. last clip, and this is very apropos to Bill Cooper. This is a good sentence. He sums up very well about how we’re cattle to them. And they think we’re greedy. They think we’re selfish, and maybe they’re right.\n\nSilent Weapons for Quiet Wars is the first chapter in my book. Once you read that, you will have a complete understanding of what’s happening and one in one very important area. And you will get an understanding what the elite think of us the common man, the mass of ordinary, everyday people, which is what most of us really are. We’re all special in our own way. But we are part of the masses of people. They believe that we are cattle that we do not use our intellect that we are easily manipulated, that we will not solve the problems of the world because we are greedy scumbags. And because of that, we are nothing but steaks on the table for those who will use their intellect. And until we change that, they’re going to treat us like cattle. And I’ve got to tell you right now, on a daily basis, we prove them right.\n\nSo Bill Cooper, one of the greatest truth of all time, is telling us that a one world government is inevitable. And the biggest problem he has with it is that they’re going to force and manipulate us into it. And that he would rather have a seat at the table than to be forced into this thing. It’s almost like he doesn’t disagree with them on some levels. Which is funny, because that’s the stance I come up with. Sometimes it just depends on which mood you catch me in. He says that the best government ever created was the American government and has to be destroyed. And that’s a big problem for the globalist and that he doesn’t necessarily disagree with a new world order. But he would prefer to have some buy in and know what the plan is and why. Fascinating ideas. Fascinating ideas. And I and look, again, prophetically, he’s saying what old Santa Claus is saying about how America needs to be brought down. It’s on the eight points. You heard that on great reset part three, but the eight points about how America will no longer be a global superpower, which sounds like that couldn’t possibly be true. They wouldn’t possibly advertise that but that’s what it said. So there you go. That’s a that’s a very short look at Bill Cooper and his ideas on the One World Government the globalist agenda. The rest of that that four or five hour presentation. He’s talking about prophecies of the End Times. The Book of Revelation, getting people to give stuff up. talks about Richard doty Baba czar really streaky. They’re all intelligence agents. fascinating stuff, right. And then he also he actually one more interesting idea floats his private property needs to be abolished, and they want the socialist utopia government everywhere globally, right? You already know this. He says that we’re gonna have these cashless systems with a card or chip in the hand, and they’re gonna remove large bills from circulation and then smaller bills. And look, that’s what that’s what happened with 2020. So I don’t COVID but they did. And they’re already talking about trying to introduce a cryptocurrency. So again, this guy was ahead of his time. I agree with a lot of stuff. He says, I think he’s, I think he’s definitely on playing with a lot of this stuff. Alright, thanks for listening. You’ve made it through your now if you if you’re a supporter on Patreon or rockfon, again, link in the show notes, check it out. I think that’ll be worth the price of admission for either of those options. And they each have different flavors as to what you want. rockfon you get access to my second podcast and all the other creators as well. For one fee, Patreon. You get access to a community gets free ebooks, you know, the choice is yours, my friend. But yeah, check them out. You can sign up so you can get part two and three, where we discussed the fourth industrial revolution with the transhuman movement, how croley fits into all that. And then we talked about your boy Jay Dyer with the eight economic world economic forum points and how he was right. It turns out it sounds crazy, but he was right. Thanks for your time. Check out those support systems. And until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "Great Reset Pt 4: Bill Cooper's Behold a Pale Horse Predicts the Future! Globalist Silent Weapons for Quiet Wars! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we dig in the crates and look at Bill Cooper’s 1991 Behold a Pale Horse to see how it predicted the Global Great Reset of 2020! We’ll look at the Silent Weapons for Quiet Wars and play clips from a presentation he put on where he […]", "url": "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-12-22T13:28:46+00:00", "article:modified_time": "2022-09-07T01:34:11+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2020/12/ctauc-great-reset-4.jpg", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["great reset", "great reset bill cooper"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/the-great-reset-pt-1-klaus-schwab-book-club-the-illuminati-globalist-agenda/", "https://www.patreon.com/posts/44771065", "https://www.patreon.com/posts/44929076", "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/", "https://illuminatiwatcher.com/great-reset-part-5-generations-book-from-1991-predicts-the-future-q-anon-and-the-occult-fourth-turning/", "https://illuminatiwatcher.com/great-reset-pt-6-housing-market-crisis-renting-is-better-than-buying/", "https://www.youtube.com/watch?v=AIXxiLcuDK4", "https://www.instagram.com/isaacweishaupt/", "https://gumroad.com/isaacw", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/42611454", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/?share=twitter", "https://illuminatiwatcher.com/great-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Great%20Reset%20Pt%204%3A%20Bill%20Cooper%27s%20Behold%20a%20Pale%20Horse%20Predicts%20the%20Future%21%20Globalist%20Silent%20Weapons%20for%20Quiet%20Wars%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fgreat-reset-pt-4-bill-coopers-behold-a-pale-horse-predicts-the-future-globalist-silent-weapons-for-quiet-wars%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt", "Krys"], "publish_date": "2020-12-22T13:28:46+00:00"}