{"result_id": "165004", "URL": "https://illuminatiwatcher.com/ghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions/", "timestamp": "2023-04-25 15:35:47 CEST+0200", "meta": {"description": "Ghislaine Maxwell podcast! Learn how she connects to Epstein conspiracy theory and a whole lot of wild connections like Jack Parsons!", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/ghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Ghislaine Maxwell Arrested: News, History, Conspiracy Theories and YOUR Predictions!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we break down the hot news of Ghislaine Maxwell getting arrested! This was a late breaking event and we go over the arrest, her history with Epstein, the various conspiracy theories about her involvement, and YOUR predictions of what’s gonna happen next! Predictions taken right from my Twitter @IlluminatiEyes!\n\nWhat you can do next:\n• Don’t miss out next time- stay current for future polls, feedback and more! Follow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n• Sign up for Patreon.com/IlluminatiWatcher and check out the INSANE show about Kubrick’s Lolita and the Pizza-Epstein connections: https://www.patreon.com/posts/38023728\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Ghislaine Maxwell Arrested: News, History, Conspiracy Theories and YOUR Predictions!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nGood morning. My name is Audrey Straus, I’m the acting United States Attorney for the Southern District of New York. Today we announced charges against Ghislaine Maxwell, for helping Jeffrey Epstein sexually exploited and abused multiple minor girls from the period of 1994 to 1997. Maxwell has been taken into custody early this morning in New Hampshire, and will be presented this afternoon before a magistrate judge in the District of New Hampshire. You will recall that the indictment against Jeffrey Epstein that we filed in July of 2019 charged Epstein with sexual abuse of young girls from 2002 through 2005 This case against Ghislaine Maxwell is the prequel to the earlier case that we brought against Jeffrey Epstein.\n\nHere we go. This is a big one big show. Big last minute show no preparation, minimal notes. We’re, of course talking about the arrest of Ghislaine Maxwell, from the mega Epstein conspiracy. I was ready to take a nice little Fourth of July weekend break. But then pulled me back in. You know, I’m deep in the alien stuff right now. Which actually relates to all of this, believe it or not, believe it or not. Yes. Now, we’re going to talk today about Ghislaine Maxwell. We’re gonna talk about the news of her rest. We’ll get into her history and why she’s important which may be information you’ve heard already, especially if you followed my content for some time now. And then we’ll get into some theories and some predictions, including your dumb predictions you gave me. You’re smarter than me. I am going to read off of your predictions from Twitter. I asked you on Twitter and you blew it up. You blow it up. So we’re going to go through them. Yes. Go through all of them. It’s hot. It’s a hot summer day. I got the windows open. I don’t have the air conditioner running. We’re trying to save that money. We’re getting Gazelle focus for 2020 because you know what, out of all these crazy wacky conspiracies of eight aliens and pizza stuff and sacrifice. There’s a conspiracy that we never talked about. And that’s the banks taking all your money. You got to pay them credit cards off. Pay them credit cards off, pay them debts off. I read I did audible book of what’s his name Dave Ramsey. And he’s right. You know, he’s kind of a winner, but he’s right. So yeah, that’s a long way of saying it’s hot in here. So trying to save that air conditioner money, you know what’s up? Now let’s talk about this Ghislaine Maxwell and I don’t know how long the show is gonna be, it might be 20 minutes might be 40 minutes. We’ll see. We’ll see how the stream consciousness hits. Let’s get into it going Maxwell, from the New York Times. Ghislaine Maxwell, which previously I used to when we did Epstein A while ago. I pronounced her name geez lane. Maxwell, kind of as a joke, but I also didn’t understand how to pronounce it, because I’m an idiot. And then I watched the Netflix show and apparently it’s pronounced gi lane. Ghislaine Maxwell, the former girlfriend and longtime associate of the disgraced financier Jeffrey Epstein was arrested Thursday and charged with playing a key role in his alleged sex trafficking operation. I don’t know how legit that is. By the way, pretty well cemented in, by the way, like, you know, Epstein worked for Bear Stearns. It’s these big time hedge fund managers, the top point 1%. They’re the enemy. And I’m not saying go do violence. I’m just saying you got to keep in mind that like, out of all these, these divisive things going on, especially today, more than ever COVID protest, race, all that stuff. It’s always trying to keep us like the great Monica Perez said. It’s about us versus us, not us versus them. That’s the way they want it. They’re very comfortable in that. Which is why again, why I say you know, we got to get out of debt, folks. Let’s pay these bills off, turn that AC off. I know it’s hot. Let’s turn it off. So you get in a fight with your family about how hot it is. Now, let’s keep reading in an indictment Miss Maxwell was accused of helping Mr. Epstein recruit groom and ultimately abused multiple girls including one as as young as 14 the arrest came nearly a year after Mr. Epstein was charged in a federal indictment with sexually exploiting and abusing dozens of underage girls at his mansion in Manhattan, his estate in Palm Beach, Florida and other locations. nearly a year indeed July 8 of 2019 when old OOP Steen got arrested. And he got bodied in prison or jail or whatever that was, I guess is a jail shortly thereafter. So that’s why we’re talking about it right now. I was going to prepare a whole show. I was going to kind of casually work through the notes over the weekend and then hit you on Monday with it, but I was like, You know what? She’s making it to Mond\n• She ain’t gonna make it. Now, what am I drinking? Sorry, I don’t mean to slurp on the show here. very unprofessional. I told you I’m not ready for this. I’m drinking coffee, hot coffee. Because I’m a complete psychopath. Now, the history is sweating that bad for you. I feel like you’re sweating the toxins out you’re kind of re refreshing the body maybe I don’t know, maybe that’s stupid history of going maximalism so like you know, okay, so she got arrested. We know that right? You can read a million news stories about it. Now let’s talk about the history. Bah bah bah, bah bah. Why is she in trouble? Let’s talk about why that. Mr. Epstein pled guilty in 2008, Florida to state charges of soliciting prostitution and a 2009 lawsuit against Mr. Epstein. claim that he and Miss Maxwell sexually abused one woman when she was 16. Miss Maxwell has denied the claims. For years, Miss Maxwell social standing had appeared unscathed. In 2013. She stood with Lloyd Blankfein Blankfein, then the CEO of Goldman Sachs and other bank sees banksters there They’re run at an event supporting marriage equality. Isn’t that curious? An event supporting marriage equality? What does that mean even? Anyway, and was pictured alongside Michael Bloomberg, then the mayor of New York at a book party, but after Virginia boy Jeffrey, I forget how you pronounce your last name. I should know that my apologies. But after Virginia Jaffray, who had accused Mr. Epstein Miss Maxwell in the 2009 lawsuit of abusing her as a teenager filed a defamation suit against Miss Maxwell in 2015. She disappeared from the party circuit and was rarely spotted in public. So that’s the that’s the latest she got arrested for all of this stuff. And the reason they only talked about one case is because that’s like, sort of what they can prove, right? Like there’s a billion other allegations going on, but they just got to get you on the one thing right Now let’s talk about the history here. And this is going to be repeated information from previous shows. Just in case you need a refresher because you’re new to the show that case welcome like and subscribe. So Epstein, right he was this guy, let’s give you a brief free primer off the top of the dome Epstein’s this guy who dropped out of college. A Attorney General bars father gave him a job being a professor at some college. Then while that same guy bars dad was writing books about aliens that were from another planet that were enslaving children and sexually abusing them. Okay. Then he was a professor for a minute then he was like, No, I’m gonna do the Bear Stearns thing and make all those monies and he did that for A very short period of time and all of a sudden was like a bazillionaire. And then you get into all the conspiracy theories that he was basically arranging for high profile fellas out there to make the sexy time with young girls. And then he would use that as blackmail. There’s there is that he’s connected into Intel agencies. Right? Which is why he was sort of untouchable. Then it doesn’t help anything because Ghislaine Maxwell who was the handler for him, she would like kind of set up the appointments and recruit the girls and all that stuff. I’m gonna put a big old allegedly in front of everything plug fact check everything you do all those things. This is me going off of research off the top of the dome here. But Gilliam Maxwell, you know, much like in Nexium, right? Nexium had the same thing going it was like a pyramid scheme for for recruiting young girls, they just can’t stop these these guys then they just can’t stop. I don’t get it. Don’t ask me why. Now, the so Ghislaine was she’d find all these girls and prep them to take care of Epstein and all of his buddies, which was a long laundry list of folks. And again, a lot of allegations going on. But like, if you look at the little plane he used to give people rides on he’s to give people flights on this Lolita Express where supposedly there was like a mattress on there and they, you know, bang these gir s. long list of people who were on that plane doesn’t necessarily mean they were all doing things, but they were certainly comfortable hanging out with this kind of creep, even after he was arrested in the early 2000s when she was arrested, and then he was given a sweetheart deal by Acosta. Another one of Trumps appointees, which is what brings us into this whole theory because a lot of the QA and honors think Trump’s here to drain the swamp and he’s here to get rid of all these people. That’s why or Epstein got arrested. That’s why now Ghislaine Maxwell got arrested. Maybe right. He keeps some strange company though. I mean, he got Attorney General Barr, whose dad was buddies with Epstein. He’s got Alex Acosta, who was who helped Epstein get the sweetheart deal where he had, like, I don’t know, a year of probation for all these sexual misconduct stuff. Then, let’s see. And then of course, Prince Andrew plays into this whole thing. And look, I’m not the guy for geopolitics and all that. You can feel free to dig into that. There’s a lot to it. All these sorts of powerful friends that Epstein had. But Maxwell her. Her dad was Robert Maxwell, a British media mogul and he was found on floating in the Atlantic Ocean by his yacht, wrote a suicide. But then Darnell they believe he was a double triple agent financed by Russia linked into EMI six KGB Mossad. So clearly, I would say there’s strong suspicion that Mr. Epstein himself might have been connected into these same you know, circuits. Allegedly, I don’t know. So, okay, so we’re not gonna get too deep into Robert Maxwell. But he basically was a coordinating like an editor, working with agents from different intelligence. Things are like project Mockingbird, where the CIA was planting agents into media groups to push stories of how bad communism is. I know the dogs are barking. They’re stupid. They don’t know what’s going on. The Okay then, you know, her sister Christine, she founded Magellan when the internet’s first search engines, because you know, big data is a part of this. Yes, they want your data. They want your secrets. Because that’s power. And that’s leverage, which I believe is what the big deal was with Epstein right. Supposedly FC had video cameras wired up and it was all black, a big blackmail system. Quote, Maxwell also said the island had been completely wired for video, the friend thought that she and Epstein were videotaping everyone on the island as an insurance policy as blackmail, referring, of course, to Lolita Island, which is where a lot of people were flown into, to do the things. Then a strange thing happened after Epstein got arrested in July. Ghislaine Maxwell A month later in August, there was a photo released of her I’m gonna read You the newer post captured photos of Ghislaine Maxwell casually eating a burger and fries with her dog while reading the book of her the secret lives and deaths of CIA operatives. Now, was that some kind of weird flex on the Intel agency saying pretty sure you don’t want to come after me? Cash me outside. How about that? And what was even more curious was that she was photoshopped in this this this photo. I’m gonna read you from Daily Mail when Jeffrey Epstein’s ex girlfriend, and allegedly co conspirator Julian Maxwell was snapped for the first time in three years last week it was claimed a fellow diner had chance to partner at a Los Angeles burger bar. Like everything connected with the extraordinary case. Conspiracy theorists have left on apparent discrepancies in the images of the 57 year old eating it in and out burger and Hollywood, which is trashed by the way. You know In and Out Burger always gets voted like the best fast food as garbage I’m not afraid to say it either. It’s terrible. You know what’s a better burger than In and Out Burger? Trash at McDonald’s? I’ll take it McDonald’s burger over In and Out Burger any day of the week. And it’s all garbage. None of its real meat. And maybe In and Out Burger has real meat. Maybe that’s what their claim is. I don’t really know. I’ve tried it three times. And every time I’m like, ah, in fact, I was in Vegas one time. And for the first time, I tried to In and Out Burger. And there was a pubic hair in my french fries. I don’t think that’s company standard policy, but sort of set a ba tone. Now, where were we? Yes. So the discrepancies in the photo Why? For example, does Miss Maxwell remove her reading glasses before posing with an open book? And if she was dining alone, as claimed, Why are there two drinking cups on the table in two mobile phones? The mystery deepen last night when an app Advertising Agency claimed a poster on the bus shelter behind this Maxwell had been photoshopped in. You can see she’s in front of a poster for good boys a film that opened in the US on Friday. But when the Mail on Sunday visited the area on Friday the bus stop was displaying an advert for a local hospital and yes, I’ve seen those photos seems to be true. Then they sort of support it with some facts about it. Now what else we got here? There’s an article on The Daily Beast going Maxwell’s more skeletons in her family closet in the House of Horrors found connections to the occult. Yes, indeed. Which is what we’re going to get into here in a minute. The let me forget now, because we got the Epstein if you are on the Patreon team, which I pray you are patreon.com backslash Illuminati watcher, we’re almost to 1000 I wanted 1000 that was the goal. And we’re we’re approaching it. It might happen this year. Now what happens when we hit 1000 I don’t know. I didn’t think it was gonna go that far. To be honest, you’ll just make me very happy and very proud. And I’ll cry. I don’t know why I didn’t think it was gonna get that big but you guys really do like it? I appreciate it. Well, yeah because I did a show on Lolita, the Coover film. And as you heard on the show, or maybe saw on my Instagram because I put the clip on Instagram at Isaac Weishaupt Logan’s crew and they talked about Zorro ranch basically talk about a ranch out in Santa Fe with a bunch of weirdos hanging out and the girl wanted to be an actress and they go out she goes out there. And near Santa Fe, which is exactly where your ranch was. I’ve seen Zorro Ranch, which I don’t know if it’s ever been rated by the way. The land was given to Epstein in some kind of little deal that the governor of New Mexico arranged for him. It’s also very odd, but that whole area is rife with alien UFO. activity. New Mexico. Yes. Now I don’t want to say her name but I’ve got a one of the greatest books I’ve ever read. You hear me? Many times mention it. She’s going to come to the show, when I don’t know she’s a busy woman. And we’re going to talk about all this stuff. So stay tuned to the show. stay subscribed. She wrote a whole book about these secret societies down in New Mexico. Finding the alien artifacts. It’s it’s bonkers. I talked to her about some of the things in the book. And she confirmed some some wild ideas we’re going to get into this one is going to be insane. Now back to this article. Turns out to her brother in law, Al Sacco. He gave TED talks on optical illusions stage magic, you know, without the K at the end of magic. Her older, her other brother in law. His father was Frank Molina, who worked at JPL with jack Parsons before it became NASA. Yes. Referring to Christine Maxwell, who is Julian sister, the one who founded the search engine Magellan, because Silicon Valley and harvesting all the data is part of this. Okay. And Silicon Valley, by the way, is part of funding this big Alien Agenda. So she, she married Roger Molina, who serves on the who’s the son of Frank Molina, and he serves on the advisory council of meti messaging extraterrestrial intelligence. So you can see, through less than six degrees of separation you’ve got this obsession with the aliens because Roger Williams father Frank Molina, not only did he work with Parsons, he was in what they call the Suicide Squad was six others with jack Parsons, the Antichrist himself and all these guys want to make contact And then finally her American in law routes. We already talked about that we’r good. The I pulled this from the article says there are routes involved the Pioneer is done with a suicide squad. There are routes involved the pioneering, often reckless rocket scientists of the 1930s who were called the Suicide Squad for their risky work at the Jet Propulsion Lab. Among their circle l Ron Hubbard of Scientology fame, the UFO religion By the way, the Nobel Prize winning physicist Richard Fineman in Britain, Alistair Crowley, known for black magic and a sex cult. What they didn’t tell you is also known for channeling aliens through the elemental workings lamb the first Grey Alien so that’s, I think that’s all I got on glean. You know, I mean, as far as like, I don’t have all the mainstream ins and outs of who she was hanging out with. Like I said, I’m not I don’t get too deep into politics. In fact, I have no interest in following it. You know, my steez I’m into occult symbolism. In fact, I’ll try to watch virtuosity when this all kicked off us. Oh, great. Here we go. virtuosity with Denzel Washington. It’s trashy movie, but I like it so far. That’s not i’m not not advocating you watch it or buy it though. It’s pretty bad. But it sure is fun. Now, okay, the theories just move into the theories. I don’t follow the politics of all this. So again, if you want to follow some of these other folks talking about it, my man Sam Tripoli over there, the tinfoil hat. He’s been talking about it. He already released an episode called the daily dose. But you got to be on this Patreon team as I am not also a client. I’m also the president. So yeah, the man’s connections here with Clinton and Barr and Podesta on all these folks are in the aliens by the way. But the arrest it happened on July 2. 2020 of course, right before the big holiday, this is what they seem to always do. Right? Right before July 4, because everyone’s going out of town I was leaving to do whatever they’re gonna do. It’s like, it’s like when they pass legislation right before Christmas, because they know no one’s gonna talk about it. And it wasn’t really like a big conference on this thing. I just, you know, to me, it seems like there’s, you know, it’s blowing up on Twitter. But like, you go to CNN and it’s barely a blip on there. Go to Fox News, and it’s barely on there. I mean, there’s articles on it, but they’re more along the lines of your fringy sort of tabloid websites. Well, disregard I lied to you. I checked Fox News. Now. It’s the main story. So disregard so fox news is the main story as of this recording. Let’s go to CNN for good time. Man, I don’t even see it on CNN. Still. They’re doing their code fear mongering. Which by the way, I’m working on a show exploring the idea of the masks. Because as you know, I’m not I’m not really in the camp of being a sign of submission. I mean, call me a socialist hippie, but I’m kind of more in the camp of like, let’s try to help each other out here, right? Sure, there’s some conflicting information about whether they work or not, but like, when basic sort of physics make you feel like it does work. I mean, you spit when you talk. So it’s like blocking some of the Spirit both ways. It’s gotta help right? Is that what Japan did? Know what China did their numbers dropped while China we don’t know about them. And look, I don’t know. And I get the I get the sentiment behind it where it’s like, you know, it starts with you got to wear the mask to come in then it’s you got to have the vaccine to come in and it’s you got to have the chip in your hand. I get that. I’m cautious about that. But like I don’t know to me I’d rather wear masks than get the Frankenstein vaccine there coconut yellow things may not it’s like a different kind of vaccine like the previous vaccines were clearly not safe and effective. Now they’re like let’s try this new kinds of DNA vaccine. I don’t want the thing keep it away from me I’ll wear a full suit of armor outside of a hat to to avoid that Bill Gates psycho vaccine. And I’m dropping my vaccine shows still By the way, I still got a couple more to go get that free ebook gumroad comm backslash Isaac w links are in the show notes as always. Our Tama mask sound sale distracting COVID is predictions. That’s right. We’re here to talk about predictions and then I’m gonna let you go. Of course, of course she’s going to get suicided we all know this. She is Not gonna be around long enough to spill the beans. There’s too many people plugged into thi thing for that to happen and to make things worse New York Post I just read said she’s going to cooperate. I’ll read you from their article. Prosecutors on Thursday left open the possibility that Ghislaine Maxwell could cooperate in their investigation despite inviting her on charges including perjury. Audrey Strauss, the acting US Attorney for the Southern District of New York, said she wasn’t worried that the perjury charges would undermine Maxwell’s ability to potentially testify against others. This sometimes happens where there are perjury charges and people can go on from there and become cooperators. Straus said at a press conference, and I’m not concerned about that, in the event that if she even were to become a cooperator, I think we could deal with that. So yeah, there’s that. Then Okay, let me see here. Let me see here. Let me get my notes together for you. We’re going to go to my Twitter right now, at Illuminati eyes. You can join the conversation every now and then I sort of throw you a curveball. A lot of predictions on here. This is a hot post. Two hours we got 28 comments a lot for typical Twitter. Okay, let’s get into it. And I’m sorry if you didn’t make the cut off. I didn’t give you a date. I didn’t promise you I was gonna talk about it. Anyway. I just wanted your predictions. Danielle says suicide red scarf. Yes, I agree suicide. Read between the lie lies said she will transform into her true form a snake and slither out of herself. Which by the way, let me read you from the Daily Beast. An article called villain Galanes. Maxwell lived a life of privilege as an FBI Hunter. Here’s what they said. New York authorities announced criminal charges against Epstein’s right here. Woman Ghislaine Maxwell saying the British air slithered away to a beautiful new hampshire home. It continued to live a life of privilege. So curious they would use that term and I don’t want to speak for read between the lines but maybe there’s a little bit of shape shifting little Arakan reptilian theory and embedded in that statement. drunken Yogi abducted by aliens would be the best yes it would. That’d be the perfect one to punch when the Project Blue Beam the aliens come down there she goes. Approach cast shout out road cast shanked in the shower less than 48 hours who man be some real fireworks for the Fourth of July there maybe right? Will they you know will they have enough prison guards watching her this time? I mean, the first time when Epstein got killed you know it was just like a episode of three stooges on there. Whoo. I fell asleep at work. And do we forget to turn on the cameras? And oh, wait, no, the cameras returned to the wrong. So the most high profile inmate to ever walk through there, arguably, and they dropped the ball. could it happen again? Absolutely. Anything can happen this year. Nardo says she flees via private jet smile and never to be found hurt again. Yes. And I’m kind of in that camp too. I’m 5050 on what happened to Epstein. On one hand, I could see how he’s alive in the sense that he’s super connected and into the transhumanism stuff, and you know, he will want it his penis cryogenically frozen, by the way. But But on the other side, I do believe that they could have killed him because dead men tell no secrets, right? which actually makes a little more sense. I’m more like 6040 on that. So could you go to the private island maybe but I think she’s getting I think she’s getting at El Capitan. What if they feeder to the Mother Russia wolves, dear? Sounds like some geopolitics. I don’t I can’t comment on that. I’m too stupid. And I’m reading these for the first time by the way. You’re getting a live live reading here. Anderson said she gonna pull it chop. Oh, yeah, that’d be a good one. Again, I don’t think they’re gonna let her escape. I think they’re gonna kill her. Borealis glass stirred died from COVID-19 Yes, I’ve heard this story before. My man on the side hit me up said dude. She’s gonna get the COVID maybe. Sean Oh, and it looks like Ilan is trending because I saw I tweeted a photo this morning. Someone had a photo of Elon Musk hanging out with Ghislaine Maxwell Who would have thought these nerds are gonna kill us all. Sean arkans side Arkansas. So like our cam comic book reference. do stupid I don’t know. Reluctantly awake her neck may hurt though ever so, ever so briefl . Yes. Keith grant, untimely heart attack prison was just too much for her to her little heart can’t take it. Robin masters, there’s a funny little phonies, suicide hotline. How can I help you and it’s Clinton. I’d like to place an order. Yes, indeed. Timo, shoot Timo. She’ll plead victim and mind control. Maybe she’ll sing like a bird for a deal. I’m sure Epstein left her info on what to do. That’s probably that’s probably true. I’ve seen probably did have some kind of what are they called the Deadman switch? Surely they’ve talked about this. Andy Bonner said somehow managed to eat food. She was dead. allergic to Oh, that’d be a good one. That’d be very creative. Maybe someone plants the poison in the food walks it. I live in New Hampshire and heard a rumor that she was going to court today Not sure if it’s true or not just something I heard and some guy said so random she was in Bradford you would think she would try to hide way further north lol I don’t know. I’m not hip to New Hampshire. Geography. Colin said dies. Go FIFA 19. Here’s another another that’s three votes for COVID Mark Baker Clinton body count. two votes for the clinton connection. Some guy said she gets killed by a random killed in quotes. Of course, she gets killed by a random cellmate camera stop working mysteriously then that person ends up mysteriously dead A week later. Seems to be the way it goes. Liam said plot twist she makes it to trial and says she doesn’t know shit. Well, that would be boring. Chaos fractal. All the guards fell asleep cameras stopped working and she somehow managed to hang herself using a sheet on suicide watch breaking her hyoid bone. What are the odds? Yes. Which is of course what happened with Epstein because the independent autopsy said that the guy was like No, this guy did not hang himself. You don’t break your hyoid bone, hang yourself with a sheet and if he’s on suicide watch Did you see the photos of the cell? I mean, there’s like miles of cloth and material in there. I don’t understand that he was taken off suicide watch but like why was he taken off suicide watch anyway, dirt rock said Kung Fu. It’s like four votes for COVID Bartholomew Rona five, fk the left. Africa the left COVID Waldo either another suicide or Coronavirus. These elites aren’t too creative Yes, you’re right. Well, no they are not creative. David like says that the Archons shapeshifters have no creative abilities, that is something exclusive to the human race. They can only take and adapt and invert. Hence the Gnostic inversion stuff. Jeff had said suicide mean he will claim it. It was a suicide if caught packed with Epstein, interesting. Finally Bartholomew said toxic toxic shock syndrome from that cheap federal tampon. Well, I mean, that’s a fitting way to end our predictions here. And again, if you laughter prediction, I’m sorry, you missed the cutoff. I’d heard him get this out, which is again, you know, on Patreon, you get early access, and I’m going to do that but it won’t be usually I wait a day or two or three just to just to mess with the free feed folks. You know what I mean? Because I try to make my patreon people get hooked up with this one I’m probably gonna drop instant instantly because time is of the essence on this one folks. And we need to get the get the info out there. We need to do make sure there is stream of consciousness saying that, hey, we’re not letting this one go, this one’s talking. But you know how this goes the powers that be will make sure that something happens. So yeah, I think I think the most popular ideas that she’ll get suicided through the COVID-19 do I agree with that? I think so. I think I agree with I think I’m behind that I’m with you on the COVID-19 cotton prison, because for months they’ve been plant I mean, since this began, you remember when COVID first kicked off the almost the first thing they started talking about was like, outbreaks in prison and we need to let prisoners out. Remember that it’s almost like they predictively plan this sort of into the mass consciousness that like, prisons equal COVID then they arrest all old, old a pyramid scheme handler here. Put her in the prison. She’s gonna get the COVID she’s gonna get the ventilator treatment. hasta lavista baby, and then all the problems are solved for these people that were messing around with all these eople. And I don’t know if I finished my thought but on Lolita, they talked about the ranch. But what I was getting to was like Epstein was into the transhumanism stuff. As as Bill Gates, arguably, and Bill Gates was hanging out with Epstein and Epstein was hanging out with Miss Sweden and one of the Stoker daughter and Bill Gates was kind of like hanging out with them. I don’t know. We’re not gonna make any allegations there. But he was hanging out with them. And Bill Gates, of course, Mr. vaccine himself once everybody he thinks that’s the way out which, you know, and and, you know, shout out God had a great idea. It’s like, and this is, you know, it’s so basic. I don’t know why I never thought of it or why don’t see it anywhere. It’s like, Why don’t they focused on on the treatment aspect of this I’ve talked about Before boosting the immune system now one of the psychopaths is out there saying like, Hey, we need to clean up the American diet as fast food isn’t healthy for you the the GMOs aren’t healthy for you know, instead they’re like, No, we want to shoot you up with some crazy DNA manipulation stuff like turn you into Frankenstein or something. Isn’t that curious? Isn’t that curious? They don’t want you healthy. Everything’s got to be a magic pill or a magic shot. Full of weird stuff. They don’t really know what it does. So call to action here go get my free ebook on gumroad comm backslash Isaac w on vaccinations. Get a while you can punch into zero dollars. A lot of people have been tipping me and I love it. Thank you very much. Joe has to just get it for zero dollars. I rarely have the info but I want you to hurry up and get it before it’s no longer there. If you know what I’m saying. I had to rename it and call The vaccine controversy and put a bunch of weird symbols in it. Trying to stay off the radar, you know what I’m saying? So check that out. And then follow me on Instagram. Go check out that Lolita clip I put on there if it’s still there, hopefully it’s still there. A couple weeks back Instagram at Isaac Weishaupt. And let’s stay plugged in. Let’s see what happens as the weekend unfolds. The real fireworks that is delaying Maxwell Stay tuned my friends and I’ll probably talk about this again. I’m sure after the big you know, missed the big accident happens or whatever or maybe not maybe she’ll confess and the lock everyone up in the swamp will be drained and hey, I’ve been wrong the whole time. Could be that’d be great. So until next time, my friends, Stay Woke!", "opengraph": {"locale": "en_US", "type": "article", "title": "Ghislaine Maxwell Arrested: News, History, Conspiracy Theories and YOUR Predictions! - IlluminatiWatcher", "description": "Ghislaine Maxwell podcast! Learn how she connects to Epstein conspiracy theory and a whole lot of wild connections like Jack Parsons!", "url": "https://illuminatiwatcher.com/ghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-07-02T20:42:14+00:00", "article:modified_time": "2020-07-02T21:03:44+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/07/ctauc-ghislaine.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["ghislaine maxwell epstein", "ghislaine maxwell", "ghislaine maxwell illuminati", "ghislaine maxwell podcast", "ghislaine maxwell conspiracy"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://www.patreon.com/posts/38023728", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/35505822", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/ghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions/?share=twitter", "https://illuminatiwatcher.com/ghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Ghislaine%20Maxwell%20Arrested%3A%20News%2C%20History%2C%20Conspiracy%20Theories%20and%20YOUR%20Predictions%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fghislaine-maxwell-arrested-news-history-conspiracy-theories-and-your-predictions%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Damien", "Russ Hook", "Days", "Isaac Weishaupt"], "publish_date": "2020-07-02T20:42:14+00:00"}