{"result_id": "165009", "URL": "https://illuminatiwatcher.com/how-to-get-free-books/", "timestamp": "2023-04-25 15:35:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/how-to-get-free-books/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "How to get 3 books for $5", "cleaned_text": "…you can get by signing up for my email newsletter. I manage the list, it will NEVER be sold or shared and it’s the lifeline between you and I if/when I get censored (again). The book you’ll get is my very first book “A GRAND UNIFIED CONSPIRACY THEORY: THE ILLUMINATI, ANCIENT ALIENS AND POP CULTURE”.\n\nIt was my first book but it’s still good!\n\nGet it here by signing up for the email list:\n\n***SIGN UP FOR THE FREE EMAIL NEWSLETTER and you’ll get my first book FREE! I’ll email you the instructions***\n\nTWO MORE BOOKS for just $5: THE DARK PATH and KUBRICK’S CODE\n\nIf you sign up for the Tier 1 VIP on IlluminatiWatcher.com or Tier 1 Patreon support system at Patreon.com/IlluminatiWatcher, then you’ll get THE DARK PATH and KUBRICK’S CODE also! It will include a 2.5 hour video I created for Kubrick’s Code as well.\n\nTHE DARK PATH is my most popular and well received book- it’s a best seller on Amazon and Audible with HUNDREDS of positive reviews!\n\nConspiracy Theories of Illuminati and Occult Symbolism in Pop Culture, the New Age Alien Agenda & Satanic Transhumanism\n\nTHE DARK PATH is considered Isaac Weishaupt’s magnum opus; a result of many years delving into the recesses of occult dogma from the approach of open-minded rationalism. Isaac’s journey started with an attempt to separate religion from conspiracy theories, but the agenda clearly showed a connection. The question to be considered is if the agenda of the “Illuminati” overlaps with the tenets of the “occult,” and whether or not there is an “evil” influence at play…\n\nUsing cited references to occult literature from the likes of Aleister Crowley, Helena Blavatsky, Kenneth Grant, Jack Parsons and Alice Bailey; Isaac provides a fundamental exploration of the occult belief system and alternate version of history.\n\nUtilizing familiar examples from pop culture, film, music, and television; Isaac proves the “Illuminati” agenda to steer humanity down a path of Luciferianism by inserting symbolism that speaks to, and manipulates, our subconscious minds. Demonstrations of occult symbols, predictive programming, and ritual magick concepts will be evident as the reader sees the connections made between Disney, The Beatles, Star Wars, Rihanna, Led Zeppelin, Jay-Z, Katy Perry, HBO’s Westworld, Harry Potter, The Rocky Horror Picture Show, the Alien films, Batman, Ancient Aliens, comic book super heroes, and many more!\n\nThis work carves out a distinction between witches, satanists, magicians, occultists and the New Age, while proving the connected desires to usher in Crowley’s Aeon of Horus as the New World Order. Using concepts from Gnosticism, Freemasonry, Alchemy, Kabbalah, and ceremonial magick; Isaac explains Hermetic axioms such as “As above, so below” from which many occultists subscribe to mental emanations that can be used to create reality.\n\nThey are all part of the Evolution of Consciousness that is being used to push mankind down the path of obliteration through transhumanism, which promises the alchemical pursuit of immortality. NASA, Adolf Hitler’s Nazis, and Ancient Alien theorists are using Darwin’s theory of evolution to assert the superiority of alien life forms. A coordinated effort of science-fiction beliefs is being conducted to put us in direct contact with these demonic deceptions.\n\nThe unsuspecting masses will be shocked to find out the “Illuminati” savior of Lucifer and his desire to put us into the transhuman digital matrix; ultimately destroying God’s creation by “evolving” us into the next entity: a globally connected digital form of consciousness.\n\nIsaac shares personal tales of Faustian bargains as well as experiences with radio shows that helped confirm his world view of the frequency battle for our souls; and this book is a testament to those observations.\n\n“The religion of the ancients is the religion of the future.” -Helena Blavatsky\n\nI’ve studied director Stanley Kubrick’s films for years now, and as you know, I’ve provided analysis on several of his films made available on IlluminatiWatcher.com: A Clockwork Orange, The Shining, and Eyes Wide Shut.\n\nI’m excited to announce an e-book that compiled all of these film analysis’ (AND 2001: A Space Odyssey) into a downloadable PDF and video project I called Kubrick’s Code.\n\nIn this e-book I present all of the images and analysis you saw on the website, but I’ve cleaned up the text, added even MORE images and theories, and included a never-before-seen analysis on Kubrick’s 2001: A Space Odyssey. This 2001 film analysis is not available anywhere else.\n\nYou’ll also get the two hour companion video that provides more images and clips from A Clockwork Orange, The Shining, and Eyes Wide Shut (these are extended versions NOT available on YouTube)\n\nIf you’re keeping track you’ve now got 3 books for $5; that’s over 600 pages of research!\n\nThe VIP Section and Patreon support systems are going to get you the two other books but you’ll REALLY get hundreds of dollars of content because you’ll unlock ALL the features of the ‘Occult Symbolism and Pop Culture’ podcast with Isaac Weishaupt:\n• Over 150+ bonus episodes the free feed doesn’t get\n• Ad-free feed of the podcast- ZERO ads\n• and more- check out all the options on the VIP tab by clicking HERE\n\nSign up today for the Tier 1 VIP on IlluminatiWatcher.com or Tier 1 Patreon support system at Patreon.com/IlluminatiWatcher, then you’ll get THE DARK PATH and KUBRICK’S CODE for free! It will include a 2.5 hour video I created for Kubrick’s Code as well.\n\nWhat else you can do\n\nThat’s it! If you like the books be sure to leave reviews on Amazon or check out the author narrated audiobook versions on Audible!\n\nAll thanks goes to the supporters in:\n\nIf you like the books you can get the signed paperbacks on Gumroad.com/IsaacW or check out my full catalog of books on my Amazon page (*with author narrated audiobooks on Audible)", "opengraph": {"locale": "en_US", "type": "article", "title": "How to get 3 books for $5 - IlluminatiWatcher", "description": "The first book …you can get by signing up for my email newsletter. I manage the list, it will NEVER be sold or shared and it’s the lifeline between you and I if/when I get censored (again). The book you’ll get is my very first book “A GRAND UNIFIED CONSPIRACY THEORY: THE ILLUMINATI, ANCIENT ALIENS […]", "url": "https://illuminatiwatcher.com/how-to-get-free-books/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-12-14T14:23:58+00:00", "article:modified_time": "2022-10-20T15:30:09+00:00", "image": "https://illuminatiwatcher.com/wp-content/uploads/2015/08/AGUCT-Cover-Gumroad.jpg", "image:width": "389", "image:height": "584", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://illuminatiwatcher.com/members-section/", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/members-section/", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://Patreon.com/IlluminatiWatcher", "https://www.rokfin.com/creator/isaac", "https://Gumroad.com/IsaacW", "https://www.amazon.com/~/e/B00CWH6PHQ", "https://illuminatiwatcher.com/how-to-get-free-books/?share=twitter", "https://illuminatiwatcher.com/how-to-get-free-books/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20How%20to%20get%203%20books%20for%20%245&body=https%3A%2F%2Filluminatiwatcher.com%2Fhow-to-get-free-books%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["kelley landaker", "Isaac Weishaupt", "Minque Paw", "JTR", "Jesse", "Greg Wilson", "E"], "publish_date": "2020-12-14T14:23:58+00:00"}