{"result_id": "165030", "URL": "https://illuminatiwatcher.com/bill-gates-divorce-conspiracies-epstein-and-microchips/", "timestamp": "2023-04-25 15:36:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/bill-gates-divorce-conspiracies-epstein-and-microchips/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Bill Gates Divorce Conspiracies: Epstein and Microchips!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we get into the Bill and Melinda Gates divorce! We’ll go over the monies, the Foundation, its connection to the virus, and some conspiracies about why they REALLY are getting divorced! Microchips, viruses, Epstein and even Marina Abramovich are part of the fun!\n• Get that free jabbie-stabbie book here: https://gumroad.com/isaacw\n• Go ad-free with bonus content in the VIP Section: https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by getting in the VIP Section!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Bill Gates Divorce Conspiracies: Epstein and Microchips!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nThey’ve been a power couple for decades their global work carrying the stamp of their union. They fought poverty, disease and inequity together as a team with their Bill and Melinda Gates Foundation.\n\nIt’s fun work that we we’ve dedicated ourselves to.\n\nBut late today, the stunning news the couple who had been married 27 years announcing in identical posts on Twitter, after a great deal of thought and work on our relationship. We’ve made the decision to end our marriage, that to say they will continue their work together at the foundation. But quote, We no longer believe we can grow together as a couple in this next phase of our lives. Bill Gates announced last year he would focus on philanthropy stepping down from Microsoft’s board. Two years ago, Melinda Gates wrote a book about gender equality. The hardest pieces for me to write were the most private\n\nparts of the book, moments in our marriage where I was asking bill for more equality\n\nand back in January on today, she joked about how she and Bill were splitting cooking chores during the pandemic, what people could set the table and\n\nboth people can do that microwaving in the cleaning up and so we’re trying to again continue to role model that in our house for our children\n\nwith three children now in their teens and early 20s. The gates asked for space and privacy for their family as we begin to navigate this new life\n\nmy excited to talk to you guys I already saw the news. Bill and Melinda Gates are getting divorced. Yes the timing of this is incredibly suspect. We’re gonna get to the bottom of why this is happening. I’m just kidding. We won’t we’re going to talk about some dickhead conspiracies about why this could have happened. I’m going to end and I’ll give you my hot take on what could which conspiracy could have the most traction to explain what happened here we’re gonna go through this because surely you already know who Bill Gates is you know Melinda Gates is yes. On on May Fourth, no less on the nerd holiday. They announced publicly they were getting divorced. The jet Hanks he called it he said it’s gonna be a hot boys summer. Well, no hot white boy summers that was white boys summer that was what he said. there and it’s gonna be a white boy. Summer for Billy. About a lap down for the world’s richest man. Except No, not quite. It’s gonna be a hot girl summer for Melinda. Because they did not have a prenup. We’re gonna talk about all these things right up all these things we’re gonna talk about, I don’t know some of these elites. We’re gonna talk about some of the conspiracies about Bill Gates. Why is he always on the conspiracy radar? We’ve covered them pretty in depth in the past. So I’m I rehash over a couple of ideas that you may already be familiar with. We’re about the microchips in the Jambi. stubbies. Oh, boy. Yeah, this is uh, this is hot news. So this is kind of a last minute exclusive. It’s gonna be kind of short. Because I couldn’t because all the hot hot conspiracies haven’t dropped yet. People are still trying to make sense of things. I’ve got one and I’m throwing my two cents into the ring here. And I’ll fittingly put it at the end. I like to entertain like to keep you in suspense the whole show. And I’m gonna wait till the end. To tell you what I think. But yeah, it looks like it’s gonna be a hot girl summer from London. She’s gonna be you’re gonna wait call surges. Oh, baby. No prenup. But instead, they’ve got what they call a separation contract, which was a privately agreed upon document. And they’re gonna file it in the court. Which, by the way, you got to wait for that April 4 2022. That goes down. So we got another year to find out more details. But this, they’re already saying this could be the largest divorce settlement ever. And if you recall, the other alpha nerd Jeff Bezos, his wife, he got a 38 billion with a B. And she became the third richest woman in the world instantly. And people were always played. Oh, She didn’t do anything. She didn’t deserve $38 billion. Well, guess what, Jeff Bezos didn’t really do anything, either. I know, I know. He gave us Amazon and I love Amazon. Because I love the way they treat their employees from what I hear on the news could be wrong. Maybe the employees love it. I don’t know. No clue. All I know. And this is coming from a very pessimistic, snarky place. I would argue that Jeff basis probably didn’t do much either. Because you can’t really work your way up to them much money. Takes a little bit of luck, a little bit of connections. Some of these people come from wealth, some of them sell their soul. I mean, some folks work their way up. But I would guess the large majority 95% of them are just Ron as jerks that slice a million throats on the way up. And he probably deserves he’s bright deck. Probably, what do I know? Maybe he’s great. I know that he lets me publish my books through his website. And I love that I know that I shop on the website all the time. He definitely changed the book game, that’s for sure. So you know, hats off to that. Ironically, he, his Amazon did not let me publish one book. There was only one book that would they wouldn’t let me punish. And it was the Oh, not only want to say the term, it’s the stabby jabby conspiracy, that I’ve renamed a couple of times. Now. It’s the stabby jabby controversy, which you can still get on my gumroad store for free, since they wouldn’t let me publish it. gumroad.com slash Isaac W. And it’s gonna come up later in this analysis. So yeah, if you haven’t got it yet, go get it. I’ll put the link in the show notes. You can get it for free. It’s, it’s this, it’s gonna prompt you to put $1 amount in. I’m assuring you you can put zero in there and just get it for free. Read it. Because back last year, I thought, Oh, dear, we have to do a deep dive on these stabby jobbies. Because that’s the next move. Right? Clearly, that’s the next move after all these studies and all these event tool ones and the UN roadmap like this is their thing. They love them. And I was always kind of lukewarm about him. I was like, I don’t know. It’s not my thing. I don’t take the flu shot. I’ll do none of that crap. Like I take a tetanus shot. That’s a stabby jabby No, you know, and I’ve had a million of them growing up and I was in the military, they pumped 1000 of these things in me. So like, again, this is always the hot debate in the truth or world is taking the coat the call the virus because you know what I’m talking about the virus, the new one stabby jabby. Like, I don’t care, no matter me, like, Is it safe? Probably not. Is it effective? Maybe? do I care? No. You got to make that call. Some people got issues that they’ve got concerns about the virus that I do believe was cooked up in a lab and I do believe the virus is? It’s not, it’s a different one. Right? I think it’s different. But we don’t want to go down that sidetrack. I’m just telling you, you can read my analysis on there for free. Because after looking at it, I thought, well, these things really aren’t as safe as they want you to believe. And I think that’s what all the anti folks see. And I wanted to sort of, you know, throw my support their way like yeah, you know, I agree with you guys. Like I’m not hell bent on it. Like I’m not a medical expert. I don’t I mean, who knows how the human body works. I don’t think these these doctors and nerds even know the answer to that. Anyhow, let’s not get into that too deep right now. That’s a such a such a tangential rabbit hole. Where we’re talking about Jeff Bezos look like Lex Luthor with a bald head. His wife was a third richest overnight. Well, Melinda is about to have a hot girl summer B. I don’t know first number one, I guess. And Bill, old ball gates. They’re the gates of ball. He hired a law firm. And guess which one he hired is Warren Buffett’s right hand man Charles Munger for Munger, tolles. And Olson and Munger himself is going to be one of the lawyers. Guess old old Charles Munger is? He’s 97 my god. 97 still being a lawyer. You’re telling me they’re not drinking adrenochrome out there. Speaking of adrenochrome we’re going to talk about briefly I mean barely. Bill Gates connection to Marina Abramovich Kind of building an overarching sort of support for my idea of why if there’s a conspiracy related to this F and that’s a big if I’m Mr. Boring rational over here I’ve got an argument for what it could be if we if it goes to the conspiracy route which I don’t think they’ll publicly spill the beans like that. I’m gonna guess Melinda had to take a little bit of a vow of silence on all of this right and it says that this is there’s so much money involved that if they split the monies halfway here we’ll go from the fourth richest man to number 17 Oh, that’s gotta sting 17 By the way, the number for cue trick I’m triggering up all the QA non votes take a listen. Maybe this is symbolic of them taking them down. Now run with that cue folks run with it. screaming from the top of the mountains and share this podcast with all your cue. rabid fan base. Now the Bloomberg they dropped the this is the top 10 richest folks in which appears to all be men. Say and this is as of May 4 2021. Jeff Bezos is number one. Ilan musk number two nerd both of them nerds. Bernard arnauld. no glue that is probably a nerd probably in the Illuminati. When you have that much money and you don’t know who that person is. illuminate confirm. Says he’s French. Maybe he’s famous in France. I don’t know. Number four. Bill Gates nerd. Number five Mark Zuckerberg nerd and alien and robot. Number six Larry Page nerd. Number seven Warren Buffett. I don’t know if he’s a nerd. He’s just a financial guy. Sure. He’s a nerd, sir. Hey, Brian, nerd. And the list goes on and on. Some other notables on the list, the Koch brothers, the Koch family, which is where all your conservative psyops come from. Because I log I always got to point it out. Like I don’t I think both parties are untrustworthy. But for some reason, the truth is never want to point out that the conservatives are sketchy. Well, the Koch family that’s the Illuminati money that pays for all the conservative psyops. The Walton families on there, there’s your Walmart, your Walmart psyops. Now Walmart they do drugs employees I grab, I’ve confirmed that talking to one of them. That tell the story. I’m gonna tell you the quick story. I was in there. I went to the automotive department. I don’t remember what I bought. This is many, many years ago. I had to sign I think the receipt or something. The lady hands me the pen. She was make sure I get that pen back. I went to mine. And I signed I said, Walmart doesn’t have pens. She said no. They made me bring my own. And I can’t lose as my last one. I’m like damn, they don’t pay much. You can tell they’re certainly as attitudes. And then they don’t even give them pens. Ain’t that about a bitch? jack Ma. We talked about jack ma Chinese billionaire. We talked about him about a year ago after Kobe Bryant died with my I did like three or four shows on Kobe Bryant is a massive event and then here comes the virus and boom. Smile later Coby virus time. JACK Ma, if you recall in how he connects to Coby. He had invested in a thing called VIP kids in China and fund 88. He’s the guy who founded Alibaba, which is like your sweatshop plug. You know, because in America here it’s like everyone wants to be an entrepreneur so they immediately try to support sweatshops and child labor abuse. Well, Alibaba is a place where you can buy stuff full of sweatshop goods. And I had confirmed on the show where I did dug into this whole thing that he invested in VIP kids in 2018, which is connecting them to Coby then 2019 Coby signed as a brand ambassador for fun 88 because Kobe was huge in China. They were pimping his ass out and all kinds of stuff in China and fun and he was like this online, sports betting casino kind of thing. So he was definitely on the radar for jack Ma. Okay. Because there’s arguments there’s conspiracies that Colby was taken on by the Chinese. I mean, there’s a lot of weird things going on. is definitely too much for my my little brain to handle between The virus, no one really kind of talking about where it came from. I mean, ironically, on 60 minutes and CNN a couple weeks ago, on the same day, they both had specials about the virus. And they both floated the, the idea that it came from the lab in Wuhan, and they threw some pretty good arguments for it. And I thought I knew it. I knew this came from the lab. And they basically said it right on TV. And then another really came with it. I thought, well, that’s kind of bizarre. Very on that list. Tons of Chinese billionaires, tons of Russian billionaires. But, you know, nerds rounding out the top 10 though easily, easily, including your boy, ball gates. Now why let’s Okay, now why did they get divorced, let’s look at the official message they sent out to the public. I’m gonna redo I’m going to redo word for word of their boring little message. Nothing fun in there to be found. But it’s definitely worth taking a look at. He says they both tweeted the same thing. And then Melinda puts a power flex move at the end. I’ll tell you about it hang on. After a great deal of thought and a lot of work on our relationship, we’ve made the decision to end our marriage. Over the last 27 years we’ve raised three incredible children have built a foundation that works all over the world to enable all people to lead healthy, productive lives. We continue to share belief in that mission. And we’ll continue our work together at that foundation, but we no longer believe we can grow together as a couple in this next phase of our lives. We ask for space and privacy for our family know as we begin to navigate this new life love melinda gates and Bill Gates Oh my god. Even Bill Gates tweeted that he put his he put his lady’s name before his power moved by Melinda. She’s running the show. She’s been Dr. Evil the whole time. We thought it was Bill and Melinda on Bill Gates, his Instagram. I don’t know if you were ever on there where you every single post he had every single post he had almost every single comment was completely negative telling him to go kill himself. It was classic, it was humorous. If you like that troll sort of entertainment. Like a real jerk. Like I am. It was comedy to read through the comments. And I thought oh, this one’s gonna be good. So I went over there and turned them off. really turned them off. turned off the comments. sad day on Instagram. Now let’s get into these conspiracies. First off, Bill Gates is probably a robot. There’s that he’s definitely a nerd. He’s definitely gonna kill us all. He’s because he’s the most dangerous kind of nerd. He’s the extrovert alpha nerd. The most dangerous nerd there is. He can read 150 pages a minute with a 90% retention rate. Oh my God, he’s Johnny fire from short circuit. Before he had proposed to Melinda, he actually wrote out on a whiteboard. The pros and cons of marrying her. There’s something wrong with a guy okay. Like I’m not saying anything wrong with making a pros and cons list to marry somebody like you need to do that. Don’t write it on a whiteboard and shallower dude. You wonder why this didn’t work out. He infamously said technology could fix everything literally. Everything. No. What do you call it? No hyperbole. He means it can fix everything. And so it will. That’s why he’s obsessed with eradicating diseases. technical problems can be solved with technical strategies and technical products and technology to these folks. And I’m not saying technology is not great it is it enables a lot of things. But you got to be careful. It’s not the end all be all. He’s the guy who Bill Gates he made those CRISPR mosquitoes remember the CRISPR technology the gene editing stuff for the the immune human hybrid clones or whatever. We made a bunch of fake mosquitoes with CRISPR for the target malaria kill campaign, basically eugenics program for the mosquitoes. And it should be pointed out that at that Wu Han lab, they also did CRISPR gene splicing.\n\nWhat do you think of that?\n\nBecause my whole thing this whole time has been, man, we’re in a bad way. Everyone freaked out right at the beginning and shut everything down. I think is because there’s a true story that we’re not being told of some really dangerous, crazy stuff that could be the outcome of all this was while I say like, Hey, your medical decision is your decision because I don’t know what the right answer is here. I mean, you’re you’re looking down the barrel of a CRISPR gene editing, mutating crazy weirdo, bio weapon virus maybe. Or the same thing by way of jabby stabby. Well, choose your own adventure, I say. And I am going to cover spars by the way there’s a lot of spars talk in the conspiracy community. I’m digging in on the research. I’m hoping to have that out soon. So standby for that. states they liked and subscribed. Okay. Oh, and if you don’t, if you haven’t been on the Illuminati, watcher.com website, go there. Sign up for that email newsletter for books, five bucks. Case closed. That includes the the stabby jabby controversy book. What do these nerd got? They think that technology is the master given to them from Lucifer, if you want to take it to a spiritual route, and then they can be the nerd Gods by tweaking the entire global population, according to the knowledge bestowed to them, because they know best. A lot of these elitists they’ve been talking about this, Jonas Salk talked about it. And we’re going to cover a little bit of this. I talked about this already in my stabby jabby controversy book. But Jay Dyer covered it on Infowars on the spars talk. And we’ll cover that on my spar show. If you haven’t seen all that. And here’s the juicy part. Here’s the part that I think is well how should we do this? All right, yeah, we’ll do that. Okay. I want to say the juicy the part that I think is the is the real deal till the end, okay. Now, we’re talking about odo dupa, dupa, dupa, dupa. Okay. People think that Bill Gates is the architect of the virus. Because it’s true. He’s been obsessed with this for many, many years, this whole idea of viruses and how to how to run pandemic scenarios and how to get the jabby stabbings rolled out. And now they’re going to save everyone. And you know, he’s been wanting to eradicate polio, and malaria and all these things, like he’s definitely interested in these things, right. So naturally, people think, well, he made this whole thing happen. Maybe, or maybe he just said, I mean, it’s like he kind of predicted the future in some ways where, for 20 3040 years, people have been saying, we’re waiting for the next big pandemic. I mean, went how far down the rabbit hole you want to go, some people think germs and viruses aren’t real? I certainly don’t know. But I do know that his father is on the board of Planned Parenthood, which, which was alleged to be part of a Rockefeller eugenics program. Again, not throwing judgment either way, I’m just telling you what the conspiracy group thinks. Because some people like Planned Parenthood, because you know, what plant in defense of Planned Parenthood, this gives women a right to, well, you know, what do you want to call their reproductive rights? They want to get on the pill, and they’re in a position where they can afford to boom, here we go. But other people that goes bears would be like, Oh, my god, they’re there. They’re promoting abortions and this eugenics program to keep, you know, poor inner city people from reproducing and I don’t know. I mean, there’s some weird ties to Rockefellers and eugenics that cannot be denied but you know what? no judgment assigned is all I’m trying to say from from from your boy Isaac. But the foundation, the bill and gates Melinda Foundation, this is sound a little bit like Donald Trump. The Bill and Melinda Gates Foundation is all about the public health. They’re about public health, education and climate change. And they’ve been involved with this virus since the beginning. They they gave almost 2 billion with a B. do research for the jabby stabby for the virus, because they’ve got like 43 billion in their in their bank account. And the foundation they’re making the foundation like one of the richest people in the world, right? like Bill Gates, I don’t have it in my notes here. I want to say he’s he’s only worth like 150 billion himself. Which is why they say like Gates is a major donor to the World Health Organization who’s always behind this whole thing because they, yeah, look like I don’t trust those suckers either. Man. They’ve been covering up for the Chinese his whole time. Can’t trust those people. And the foundation is fifth on the list of donors. There. It was last year when I was researching this. When you look at the World Health Organization, they survive off donations. And the Bill Gates Melinda foundation is fifth on the list. GAVI is seventh, that’s another one of these like Bill Gates, jabby stabby groups, which takes us into the microchip theory. On TV, Linda said, that bill never had plans to put a microchip in the stabby, which, ironically, just on Sunday, john oliver on HBO, played this clip. The day before all this was announced the day before went down,\n\nthrow up their hands and say, I just don’t know enough to get the shot. They have already seriously fucked things up for all of us. And to be clear, most people who are hesitant are not fanatics, or conspiracy theorists, many are just trying to make the best decision for themselves and their family like that pediatrician that we saw earlier. You definitely know people like that in your life. So I’m actually going to spend the rest of this piece trying to clear up some of the biggest myths flying around and some are pretty easy to debunk quickly, like the claims that Bill Gates is using the vaccine to put a microchip in all of us something his wife had this response to,\n\nI know my husband is not vaccinating people and putting a microchip in our arm because that technology doesn’t even exist, and he’s never uttered the words out of his mouth. So\n\nokay, thought wasn’t the reassuring pushback to a batshit conspiracy theory that I had hoped for. To be honest. We’re not microchipping people because the technology doesn’t exist yet. And my husband hasn’t said it out loud to me. Why would you put it like that? They’re the\n\nthe queue folks, they think that Melinda is not even real, right? They think she’s fake. She’s an actor. And Bill’s about to get arrested. That’s what this is all cover up for bill to get arrested. He says give me some private time. The truth is that he wants private time so that he can go to jail. Some folks think that Melinda is going to turn his ass in for crimes against humanity because of all this through because she just found out the truth about the microchip apparently, is what they claim. As she wants to save herself, she’s like, Look, I’m a millionaire, I would not look good in orange. Some say Bill Gates is already dead. This is a cover up. I don’t believe that one at all homes stupid. Some think that bill Melinda couldn’t come to an agreement on what they’ll do now that they’re able to track the global population with the microchips. Now that everyone’s got the microchips, and they can track their movements? How can they best control the world? And they couldn’t come to agreement? on that. I don’t know what’s going to be in the settlement agreement. Like, I’ll control US and China and you control Russia and India? I don’t know. Again, hard to believe some of these ideas. And just to clarify about the microchips, I don’t know that it’s quite factual. Is it impossible? No, but like, that’s not really the truth. There’s kind of got they lost their way with that one, because, and we covered this last year. What happened was that there was you know, Bill Gates funds a ton of research projects through MIT and all these things. Well, he was looking to come up with a way to prove like he was like, if you look at, like some of these poor countries, these third world countries, okay, so they give them the jammy stabby and then want to give them a piece of paper and say, here, keep this or why they got a computer system there. All of a sudden, they want to like type in Okay, you know, so and so got the stabby jabby. No, they can’t. So he said, Well, how can we make it so that we can Tell the jammies Debbie’s in there. And they research quantum ink dots. So that used an app on your phone. And you would go over the spot where they got the stabby jabby. And it would leave behind a basically a little tattoo, an invisible tattoo. Which, of course, I mean, that’s like your mark of the beast talk, right? And somehow this this, because there was also ideas about a microchip but like the thing Bill Gates had funded was that the quantum ink dots and it got to you know, one thing led to another. Now it’s a microchip, but like, Look, what Okay, smart asses. What about your cell phone? You don’t think it’s tracking you? I was talking about something the other day I got ads on my phone for it. I was like, Cool. Thanks. Appreciate that. The tracking is too late right? Now Now we’re gonna get into the part that I think is the most if there’s a conspiracy behind all this, this is the most likely and by the way, most interesting conspiracy. And again, I talked about this in the stabby jab controversy book, link in the show notes. Get it for FREE $0 or you go to Illuminati watch comm sign up for you’ll see the link at the top for books for five bucks. And it has links and it’s on there too many ways to get this thing. But Billy was friends with Jeffrey Yes, that Jeffrey, Jeffrey Epstein and Bill once said and I quote, his lifestyle is very different and kind of intriguing, although it would not work for me. Why wouldn’t it work for you bill? Because Melinda is gonna cock block you. When I’m Linda’s out of the picture. Maybe that lifestyle will work for him now. And of course he was like, No, I’m talking about his artwork. Yeah, I collected art and stuff. Oh, really? document. Okay. Bill flew on the Lolita express the one that shuttled miners between New York and Palm Beach. He donated money to MIT through Epstein, because, you know, Epstein was tied into these MIT nerds and he was also interested in transhumanism. They had a lot in common needs to and in speaking of nerds with transhuman fantasies, Ilan Musk, you know, that knurling cap. These guys all think they’re gonna make things happen. Epstein’s last legal activity before he, quote unquote, killed himself by wrapping toilet paper around his neck and jumping off the two foot bunk and breaking his neck or whatever, that the cameras just happen to not be working. The guards just happened to be asleep. His last legal activity he did before that happened, he amended his will and added a backup executor named Mr. Nico Luke. Who’s Mr. Nico Luke, you may ask? Well, this is a guy who runs a venture capital firm with none other than Bill Gates. He is also the science advisor for the Bill and Melinda Gates Foundation. So Melinda knows who Mr. Niko leak is. Maybe some secrets got leaked to Melinda and she was like, Oh, hell no bill. What you’re doing over there bill. And if you’re thinking well, Isaac, like what what allegations are there? Well, I’m gonna tell you. There are claims that he was real friendly with the former Miss Sweden. Dr. Eva Anderson Dubin. Not only Miss former Miss Sweden, but her 15 year old daughter at the time. He met he hung out with Epstein and the Miss Sweden entered 15 year old daughter and wrote to a colleague the next day he wrote, quote, a very attractive Swedish woman and her daughter dropped by and I ended up staying there quite late. Now that Miss Sweden she married this billionaire hedge fund manager named Glenn Dubin. This was after Epstein paid her way through medical school. Why did he pay her way through medical school? Was he just a real nice guy has ever seen a real nice guy Yes or no? and her husband Glenn Dubin. Now, since Epstein killed himself is alleged to be part of this ring of improprieties against the children. I’m gonna read you from Wikipedia, because it sums it up pretty good. In August 2019 unsealed documents reveal connections between Dubin and Jeffrey Epstein. Including allegations of involvement in his sexual abuse ring. Former house manager for the Durbin’s Rinaldo Rizal is not a you guys remember the jerky boys? was not a character on the jerky boys that the tapes were they were prank call people. Anyway Ronaldo results describe a 2005 encounter at the demons home with a 15 year old girl employed as a nanny. Rizzo said the girl who was shaking and crying, told him that she was pressured by Gilliam Maxwell to have sex with Epstein, with Maxwell taking her passport when she refused a month into her employ. According to the Daily Beast, the Durbin’s took the girl with them to Sweden, where she was dropped off in an airport. The unsealed court documents were from a lawsuit filed in 2015 against Maxwell by Virginia Roberts Jaffray, who named several individuals as participants in Epstein sex trafficking scheme that included Glenn Dubin as one of the men with which Epstein and Maxwell forced her to have sex in September 2020, that’s not that long ago, the Attorney General of the British Virgin Virgin Islands subpoena the Durbin’s as part of their probe into the dealings of Jeffrey Epstein. Now, is that 15 year old girl the same 15 year old girl that Bill Gates has, I don’t know, because the timelines don’t match up. But you’ve got these connections of Dubin and Sweden and Epstein and Bill Gates. Now, what’s the dirty dark secret? I don’t know clearly, I don’t know. was built doing this stuff. I have no clue. If there’s smoke, is there fire maybe. You know, like, in conclusion, what’s the most likely scenario if this goes the route of conspiracy theory? And that, to me is like the most factually based idea for conspiracy here is that Bill Gates has these connections to Epstein. And maybe Melinda found out a bill is messing around with these sweetest girls. I don’t know. Are we ever gonna find out? Probably not. I mean, Bill’s been on my radar because of his transhuman fantasies. If you recall, he was hooked up with Marina Abramovich. They did this thing called the life. There’s this transhuman thing. And again, just like how he disabled the comments on his Instagram, they took down the video from the YouTube, this ad promoting it. I want to read you from the the Life Project says for Abramovic technology presents an opportunity to immortalize her spirit, something she has been trying to achieve through her work, quote, the fact that the project can be repeated anywhere in the world, while I am not there is mind blowing, I can be present in any spot on the planet. Because they were going to project her her likeness, sort of like a hologram, I guess, through this VR thing. And that’s the ultimate plan is the uploading of digital consciousness. And the problem is, here’s the problem. that technology is advancing so fast, the computational speed is advancing so fast. Normal folks like us have no idea what’s coming. But these elites with all the time and the money in the world do and they’re trying to sort of play chess to set themselves up to be the new gods. And along the way, maybe maybe Bill’s messing around with the same. I mean, he was friends with Epstein, right. He was on Lolita Express, and these are all the mainstream media sources telling you this stuff. I’m not making any of that up. And maybe Melinda found something out. Maybe. Now, if you want to check out I’ve been talking about the jabby stabby controversy book. You can find a link in the show notes you can get it on gumroad comm backslash, W, go ahead and pick up some sign paperbacks. While you’re there, I wrote a lot of books. I got some really soft t shirts left in inventory, just a few sizes left. I got coffee mugs. You can get all those great things on my gumroad store and get your free copy of the stabby jabby controversy. Or you can go to Illuminati watch calm and get the four books for five bucks. I think you can get that as a banner along the top or you’re the start here page. However you want to stay connected, just stay connected. I’m going to keep my eye on these things. And by all means you can hit me on social learning interesting, juicy tidbits you find about this and we’ll maybe revisit This in the future, right? Oh my friends. Thanks for listening. Thanks for your support. Thanks for your reviews. mostly good reviews on the apple podcast. Some people hate me and that’s okay. That’s okay. I still love you for keeping an open mind and listening. My friends thanks for listening. Stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates Divorce Conspiracies: Epstein and Microchips! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we get into the Bill and Melinda Gates divorce! We’ll go over the monies, the Foundation, its connection to the virus, and some conspiracies about why they REALLY are getting divorced! Microchips, viruses, Epstein and even Marina Abramovich are part of the fun! Links: Get that […]", "url": "https://illuminatiwatcher.com/bill-gates-divorce-conspiracies-epstein-and-microchips/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-05-04T14:47:11+00:00", "article:modified_time": "2021-05-04T15:02:44+00:00", "image": "https://i2.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/05/ctauc-gates-divorce.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/44625113", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/bill-gates-divorce-conspiracies-epstein-and-microchips/?share=twitter", "https://illuminatiwatcher.com/bill-gates-divorce-conspiracies-epstein-and-microchips/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Bill%20Gates%20Divorce%20Conspiracies%3A%20Epstein%20and%20Microchips%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fbill-gates-divorce-conspiracies-epstein-and-microchips%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Leah", "Adam Wilson", "NapaRiverDog", "Isaac Weishaupt"], "publish_date": "2021-05-04T14:47:11+00:00"}