{"result_id": "165044", "URL": "https://illuminatiwatcher.com/gnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella/", "timestamp": "2023-04-25 15:36:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/gnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Gnostic Goddess of Wisdom and the Great Reset Awakening with Marisa Acocella!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we are joined by a woman who brings us the granola vibes of optimism for 2021! Marisa Acocella is a cartoonist that has New York Times bestsellers like Ann Tenna and Cancer Vixen. She’s also been a cartoonist for the New Yorker and Oprah’s W magazine. Her works have been in New York Times, Glamour, and Oprah’s O Magazine. She shares her perspective of the world through her latest graphic novel called “The Big She-Bang: The Herstery of the Universe According to God the Mother! (*a beautiful graphic novel that you can win from me- it’s a signed copy that I’ll put into a big old package with one of my signed books and one of my ultra soft tshirts!). We’ll talk about the clashing of Great Reset and Great Awakening timelines, Gnosticism, Mary Magdalene’s royal bloodlines, Santa Klaus Schwab, the Archons, COVID treatments (*her father is a nutritionist doctor so listen up to his recommendation of how to combat the virus with some over the counter supplements) and more!\n\nI also finish my February shout outs that I missed on the last show!\n• THE GIVEAWAY WILL BE HELD ON MARCH 1st 2021!!!! You could win: A signed hardcover of THE BIG SHE-BANG, a signed copy of THE DARK PATH and a Conspiracy Theories & Unpopular Culture t-shirt! Over $100 value and I’ll ship it right to you! All you have to do to enter is be a member of one of my supporter platforms and I’ll randomly choose one winner from each platform (e.g. one winner from Rokfin, one from Patreon and one from the VIP Section). Currently VIP Section has by far the least amount of people in it and the greatest chance of winning. Odds of winning (as of Feb 16, 2021): Rokfin is 1:204, Patreon is 1:1,134 and VIP Section is 1:57.\n• Be a supporter on the VIP Section (this page compares the three support systems- choose whichever you like most: https://illuminatiwatcher.com/members-section/)\n• Be a supporter on Patreon.com/IlluminatiWatcher AND you have to leave the funniest comment on the post for the Marisa Acocella show- whoever makes me LOL the most wins! (*Patreon doesn’t allow random raffles cuz they hate making my laugh easy)\n• Be a supporter on Rokfin.com/Creator/Isaac **For the Rokfin platform you have to subscribe through my link Rokfin.com/Creator/Isaac.\n• Get Marisa’s books from her bookstore: https://bookshop.org/books/the-big-she-bang-the-herstory-of-the-universe-according-to-god-the-mother/9780062905666\n• The recipe for helping fight the virus: Quercetin, Zinc, Vitamin D and Vitamin C\n• *LIMITED TIME OFFER to first 1,000 supporters: Use promo code “HOTGIRLSUMMER” to get 20% off the VIP Section for 3 months!: https://illuminatiwatcher.com/members-section/\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION I: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by getting in the VIP Section!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Gnostic Goddess of Wisdom and the Great Reset Awakening with Marisa Acocella!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nActually, I wanted to say that I wrote this book about basically the great reset and the Great Awakening. And really, yeah, because it starts off with Mother Earth, right? Saying, it’s like sometime in the near future as well. I wrote this book, you know, came out in November, but it was it’s about right now. It’s about the Great War, the final war we’re in. And I think this is a war on humanity, a war of consciousness.\n\nToday, we’re joined by a very special guest, a woman who brings in the good vibes and the granola vibes of optimism for the year 2021 arisaka Chela, she is a cartoonist. She’s got some New York Times bestsellers, like antenna, cancer vixen. She’s been a cartoonist for The New Yorker and Oprah’s w magazine. Her works have been all over the place New York Times glamour, Oprah’s o magazine, as she joins us to share her perspective of the world through her latest graphic novel called the big shebang, the history of the universe, according to God, the mother, my God, we’re going down the, the feminine divine rabbit hole, folks. Yes. And it’s actually a beautifully crafted graphic novel. I’ve got the hardback here in my office, she was kind enough to send me a signed copy. And guess what, I’ve got a giveaway, where you could also get a signed copy. And I’m putting it into a big old care package. I’m putting one of my ultra soft t shirts and one of my sign books in there. Now that I can hold a candle to Maurice, aka Chela. Oh, my God. She’s been all over the place, New York Times, come on. Anyway, we will we talk about the day. And I’ll get back to that giveaway. But what we talked about is very important, because we’re talking about this clashing of the great reset against the Great Awakening timeline. We’re gonna get into Gnosticism, which is a heavy theme over the next week or two, because I’m building this mind blowing analysis of the Amazon film bliss with Owen Wilson and some hyak. So Gnosticism is a big theme right now simulation universe, it’s all connected, man. But in our discussion, we talked about the the Royal bloodlines of Mary Magdalene, we get into a little on center, Klaus Schwab. Talk about the our cons and even, she even gives us a little little tip on treating the treatment of COVID How to sort of minimize the effects perhaps maybe, right? Her father, he’s a doctor, he’s a nutritionist. So listen up. He’s got a recommendation of what you can do to prepare for this, you know, the whoo hand flu. And there’s just like some over the counter supplements, and we’ll get into that. But yeah, so let’s get into the show. Real quick, though, I got two pieces of work I got to catch up on. We’re gonna talk about that giveaway. We’re gonna talk about the giveaway. And I have to finish up some tier two shout outs that I missed on the last episode. Accidentally didn’t long story short, I looked at I didn’t I missed my annual subscribers a limited thing I was doing where I was having annual subscriptions. So shout out and apologies to Charles, Brandon, Brooke, and sorcha. And then also, I got a new tier two via from the VIP section Leslie, who I believe I recognize from the Patreon team at one point, as well as Mitch, whom I mailed a signed copy of the dark path to So yeah, those are a couple of missed my apologies. And then the giveaway this big giveaway I’m doing March 1 2021. You got to be there be square, you could win. I’m gonna get I’m gonna send you a signed hardcover, hard copy of the big shebang. It’s a hardcover book. I got a picture on my Instagram at Isaac Weishaupt. Check it out. You’re gonna get a signed copy of that from our esteemed guests from today. I will also send you a signed copy of the dark path. And I will send you one of my conspiracy theories and unpopular culture t shirts, the ultra soft shirt that says these nerves are going to kill us. I’m going to send all that it’s over $100 value, I’ll ship it to you. I’ll pay for the shipping to what I want from you in return. All you have to do to enter is be a supporting member of one of my supporter platforms. That’s it. I got to on March 1, you got to be a paying subscriber supporter. And I will randomly I will export the list of supporters on each system and I will randomly choose one and then I will contact you And then you will get your care package. So what I’m saying is I’ve got you know, I’ve got three supportive platforms I got rockfon I got Patreon and then I got the VIP section. Just beyond you know, be on all three of them. Hell, I got a couple people that are on through all three shout out Sheryl. So she’s now got three chances to win. And currently, you know, pro tip the VIP section has the least amount of people in it by far and I’ve got your odds of winning right here as of today. As of February 16 2021 rockfon, you got about a one in 204 chance Patreon got one in 1134 chance and then the Illuminati watch calm VIP section got a one and 57 chance so there you go. Do without without wilt. And by the way for the rock Finn platform you have to subscribe through my link rockfon.com slash creator slash Isaac and all the links are in the show notes. I won’t belabor the point but if you want to get in on the giveaway, over $100 value, be on one of those systems. He’ll be on all three of them. On March 1, I will randomly select one from each email you and we’ll get it on and poppin Okay, let’s get into the show with Marissa aka Chela. Everyone this is Isaac with an update to the update here. I had a giveaway and originally I said you just got to be a supporter on rockfon Patreon or VIP but Patreon and true buzzkill fashion gave me a notice that I can’t just do that so I have to make it a contest of some sort a little differently. So if you’re on Patreon The rules are gonna be a little different. And the rules for the Patreon contest are gonna be you have to make a comment on my on the on the relevant posts. You know the post for this show, then the Gnostic goddess of wisdom and the great reset awakening with Marisa aka Chela. Go to that post and leave a comment and the funniest comment the one that makes me lol the most you’re going to be the winner. I’m sorry, I wanted to just pick at random to make it easy for you but old buzzkill Patreon as always coming in with the with the fatality at the end. So yeah, that’s the new rule for the Patreon version. The other two again, just be a member. I’ll sort of Matt random and find one. Patreon. You got to leave a funny comment the funniest of comments. So maybe Ma’am, you know what, maybe they’re right. Maybe this will be fun. So if you’re on Patreon, that’s how you gotta do it. I’m very sorry. Leave a comment made me laugh. The biggest lol wins. Thanks. All right, I’m joined by a very special guest, Marisa, aka Chela. Did I pronounce it right?\n\nOh, my god, you’re like the first person who pronounce my name correctly? Well, okay. Let’s see the jersey boy. And\n\nWell, you know, full disclosure, I listened to your, your show with Laura Eisenhower.\n\nSo that’s where I got the pronunciation from. So,\n\nI’m not that good. But anyway. Yeah. Are you good? I’m humbled to have you on here. You, you’ve done a lot. You’ve been a lot of places. And you wrote this book that at first I didn’t know how to take. It’s called The Big shebang. And at first, I thought, well, I don’t know if this is a good fit for the audience. But then I read it. And I said, Okay, all right. We need to do this. We need to we need to hear hear out your perspective. Because we always talk about like the goddesses, and we talk about archetypes. And we talk about mystery religions. And I think you kind of do well to tie all this together with like, all these illustrations that God knows how long that took you.\n\nOh, my gosh, it took so long. And then I, when I was drawing God, the mother, I actually had to go back and redo her because like, basically, she was like, in my ear telling me I don’t like the way I look. Oh, really? Okay.\n\nSo let’s get into that. Well, there’s so much I want to talk to you about let’s start out with the star with a little background on what got you down this path of understanding the world as you see it. What’s your background, because I think this is important because like, a lot of a lot of times when I talk to people about this kind of stuff. I feel like a lot of people start with very sort of normal routes, and then some events happen and they eventually go down this path of looking for alternate solutions to the world and interpreting it and I’d like you to share your journey. How did you get here?\n\nOkay, so first of all, um, I was raised as a cat, you know, I was raised Catholic, right? And even when I was younger, and I was at my grandmother’s house, let’s say and I saw Jesus on the cross, and you know, that’s like a really traumatic image. And I remember my grandmother saying, you know, Christ died for your sins, and when you’re like four years old, you’re told that you know Here’s this man died who died for your sins and you’re like, well, what did I do? Maybe like step on a crack and broke my mother’s back. Like I can remember back then thinking, well, there’s gotta be more to the story. I always questioned everything. And then when you hear like there’s a male God and like, well wait a minute women give birth. So how could that possibly be? I always question what happened to like, you know, God the Father, well, where’s God? The mother, right. So I always question I’ve always been a question. I’ve always like, you know, like Columbo. I was kind of like the female Columbo. Remember that TV show vaguely?\n\nI’ve never seen an episode, but I know what you’re talking about.\n\nYeah. So there’s like Peter Falk and this rumpled raincoat. always asking questions, like, you know, on a crime scene, well, wait a minute, what about this when everybody’s like, trying to get him off topic and, you know, out of the way? So I mean, I’ve always been that girl who’s asked the questions. And so I used to be in advertising and I ever since I was like, young, I always have drawn this woman lists like, female and I, you know, my mother was a shoe designer. This is like a very roundabout answer, right. But my mom was a shoe designer. She designed shoes, actually, for Jackie Kennedy. She designed her inauguration shoe. Yeah, there was like a whole story when Jackie called her up and said, I need somebody to design my shoes. Right? My mother nearly hung up on her. And she said, Now this is really Jackie, and I have a size 11 and a half shoe and my mother and her jersey accent said, Well, on the size 11 and a half, we can commiserate. My mother designed her shoe for the inauguration. Right? That’s why Yeah, so my mother would do these trend reports. And she drove these great looking women wearing her fabulous shoes. And I would imitate her and I would. And then when I was about eight years old, I got totally bored with these women her weren’t talking. And instead of like having our usual vacation, down the Jersey Shore, my father took us to Bermuda. And we were seeing this pink elephant of a house. And there are these drawings and drawings on the wall. And these drawings had captions. And it turns out it was James Thurber cells, so legendary New Yorker cartoonist. So I immediately I thought, well, these women that I were, I was drawing could actually talk. So that’s when I started thinking about, you know, drawing these women I’ve totally forgot about. And then when I turned 30, I started drawing this same woman with a gun in her mouth with the line, she was a little upset during the meeting. And that’s when my comic strip she was born. And while I was doing she, and this was like in the 90s, I had this title for the big shebang. And again, question Where to God the mother come from? And I’ve had this idea and I’ve done this, I’ve started doing the research, back then asking questions about God asking questions about our history. And I just grew into this concept and did all this research. And then that’s where the big shebang came from. So that’s a very long winded answer to your very simple question.\n\nNo, I like us. Between the shoes and the female empowerment and questioning the patriarchy you and my wife would get along like, perfect.\n\nCome on over.\n\nYeah, we, we we have a lot of good spirited debates at our house about you know, different ways of looking at the world. So like, I understand, I understand the ideas behind questioning the patriarchy questioning the Christian faith organized religion. And in your book, you know, I immediately because I’m familiar with these ideas, I immediately saw like, elements of Gnosticism, right? Am I right or wrong? Like there’s\n\n100%, right. I mean, I’ve been reading apocrypha, I started reading apocrypha in my 20s. And I’ve always, like I said, I’ve always questioned So, you know, the stories of Jesus the stories of Mary Magdalene and, and Eve, for instance, right? Like, the story of Eve, and Nag Hammadi is way different than the way we were told. But I mean, it makes sense because our whole history has been inverted. Right? Our whole history has been withheld from us, and especially women’s history. I mean, if you take a look at a right she basically is like the anthropo. She’s a divine spark, right. And here’s Adam. Okay. He was formed by let’s say, yelled about. That’s what the legend says and I comedy. And Eve comes in, and she’s like, the divine spark. She’s like the droplet of water who comes out of the water and sees Adam and she forms herself and sees Adam like who’s like basically like on the ground who’s like a formed lump of clay and she breathes life into it. And he says, You have given me life. You’re the mother of a living. And she’s like, I’m the mother of basically all of humanity when it comes down to it, but she was like, you know, she was a spark. She was a startup, she was a star. And it it, it’s we were told that she was a scapegoat, but she really wasn’t she was. She’s like your best player on. You know, like the Yankees when the Boston Red Sox wanted to take down the Yankees. When a rod became a Yankee. They were like, they totally went after him to take down the team. It’s like, that’s what happened to Eve. Basically, she was scapegoated. And when you look at our divine history, it’s like we’re not just made of dust. We’re made of stardust, we’re thrust shrill and extraterrestrial. We’re a celestial. So like, you talk about that a lot. Our our Hidden History, I heard you on higher side chats, I mean, staying right.\n\nI’m with you. Like I don’t, you know, obviously, I don’t profess to understand everything about our reality and our experience. But to me, like the one thing that I straw that I feel very strongly about, is like, I’m not I know, I’m not atheist. Like, I know that for sure. Right, Christian, I have tons of doubts. I see tons of problems with organized religion. And you make a list. There’s several times and I gotta give trigger warning, because like, I know a lot of my audience is like, heavily Christian slanted, not a lot. I shouldn’t say that. a fair amount. Right. In the book, there’s a lot of talk about how the Bible was written by man, for man, you know, me with the idea that, I think and you can correct me what you’re suggesting is that the the Christian narrative, the official sort of Christian as an organized religion, has purposefully subjugated women to the side.\n\nWell, I do think women have been marginalized, minimized, maligned, sidelined, unnamed, like Nuria aids daughter, Noah’s wife, which is like a total crazy thing when you think about it. Like she doesn’t she’s mentioned in the bible five times, but she’s unnamed. That’s crazy. Right? So yeah, so women have been I mean, the Council of Nicea. Right. Constantine, who Some say was Luciferian Have you ever heard that?\n\nNo, no, tell me more what\n\nI missed, like, Where was I listening to something where they said Constantine was like a complete Luciferian, who His goal was to basically edit out the real crux of the Bible. And he took he pulled out like some really great stories like Thekla and he rolled back women as deacons and priestesses he took any mention of a female God God the mother out\n\nof those, those terms show up in the the Nag Hammadi Kota sees and all that stuff.\n\nWell, God, the mother, God, the Father is like, far below is God, the mother and comedy. So she does show up, right, and Sophia, which I think is the greatest suppress story of humanity. That’s totally taken out. But the whole night comedy thing, I mean, that was a great travesty, you know, just totally suppressing our history. Um, and I mean, nicea.\n\nWhat, I’ve heard this before. So like, like I said, like, when I started this journey of looking at all these ideas, I didn’t, I didn’t intend to go down the path of spirituality or religion. Right? Ultimately, that’s where it’s ending up. And there’s, I mean, this is a massive topic. So like, I avoid sort of going down the idea sort of, like politics, I sort of avoid going down the idea of religion too deep because, like, there’s so much for me to learn, like, I, I’ve gone to church my whole life, and I have always questioned like, okay, have I been indoctrinated by this? And like, it just feels right, because this is the way my reality was formed. But, you know, there’s one when I look at so like, when I read David Ikan stuff, you know, he I love him right into the Gnosticism stuff. And yeah, and then I read Bill Cooper and Bill Cooper says, Well, you know, the Freemasons and the luciferians they’re all sort of in bed with the Gnostics and they think that you know, the Christian God from the Bible isn’t the real God. He’s you know, yada both this fake phony mean ask God and the real and they they and you see this in the free Masonic literature and stuff they always talk about, so Fear and wisdom. And and that’s supposedly according to like Bill Cooper and other theorists, that’s supposedly the sort of secret term for Lucifer and luciferianism. But when I read your book, I kind of get the vibe that perhaps maybe you would think that when we’re talking about wisdom and Sophia, are they you think they’re referring more to one of these? What they call aeons of the divine spark of God? Yeah. So could you explain that for much more knowledgeable in the book about it than I could be? So\n\nokay, so the whole thing about, let’s say, God, the mother first, you know, it’s like God as a female, male, female and male and today, right is\n\nbecause you make because you and you explain all this in the book, but right, you don’t know how they’re they’re paired up. Would you call it CG? CG?\n\nWell, yeah, so basically, you have the male and the female God, the mother, God the Father, right. And then basically, I say, the creation of the universe was one big shebang, one big orgasm, right? And she gives birth to the universe. And then she gives birth, she has the cities which are like the twin flames like Christ and Sophia. Right. That’s one theory. And that’s what I chose to run with. And Sophia, she, she was one of the aliens, right? And she got the mother gave birth to the angels, the luminaries, the aliens and Sophia, the seducer, the Twin Twin Flame of Christ. And basically, like my theory, and this is where I called from the neck cavity, and also like john lash lamb and other people like Laura Eisenhower talks about this as well, where, you know, she was tasked with creating the divine human anthropos from God, the mother, God the Father, right, okay. And she wanted to, she was she was her mother’s daughter, and she wanted to go off and create on her own. Right, and she was living in the pleroma, which was heaven. And she goes off and she takes a leap from the void from the pleroma into the void. And because she’s so creative, what happens is, and I’ll read this to you, because I really, this is a really great way I think, explaining it is now from now avail separated the pleroma, the divine realm from the world below. When Sophia fell into the realm of darkness. For the first time in her existence, she felt fear. Because of the great creative power within her Sofia’s thoughts were not idle, here’s the thing about thoughts to think is to conceive. conception isn’t just mental. And then you see her and out of her mind, she creates yelled about, he was like an abortion, he was created out of fear. And that’s the demon God, that’s a demigod. So that’s what’s in comedy. That’s, you know, a lot of people have that theory. So that’s my theory. I mean, you could interpret everything 50 million different ways, right?\n\nThis is my way of Gnosticism. It’s, it’s using it first.\n\nIt’s so confusing. I mean, it took me a long time to wade through this and figure out what story I wanted to tell. But to me that story of Sophia, the wisdom goddess as an archetype, right? As somebody, a female, who is so creative and gives, has this wants to give birth, and then through her fear manifests a demigod, right? And then what happens to her? Like, that’s the great mystery in the book. And it’s also one of our great mysteries, because we don’t know really what happens to her. I mean, we do know, I tell you in the book, but she’s suppressed and I think the rise of the Divine Feminine also has to do with like the ark, the ark of Sophia herself. Okay,\n\nso right, so the big question, and you do address this in the book, to be fair, the question I have, is like, and just to sort of, you know, re re bring this home for people listening, trying to make sense of all this. The idea that the Gnostics have is that outside of this world in the heavens or whatever, this other dimension, you have got the real God, not the Christian God, you got the real God. And the real God had all these different sort of, I don’t know if archetypes is the right word, but all these sort of different versions of him or her their self and one of these. They’re called aliens. right and right, these is Sophia. It’s, it’s this female Sophia wisdom, right? He’s paired with a male concert, right? Because I guess like, every one of the sort of different embodiments of the real God. They’re they’re perfect people. unionized pairs of male and female\n\nlike the cyj. The twin flame,\n\nright? The city? Yes, yes. Yeah. And, and, and this is where it gets confusing. So like this God is the perfect God, and therefore the Ayaan should also be perfect, right? Because they’re creations of this God. But somehow something goes wrong and Sophia, who’s tasked to sort of create something,\n\nright? Create the divine human anthropos. Right. Okay, which is, and when she did create the she did and that was Eve who came down and gave birth to Adam, right? So I know this is confusing, but so yeah, so God, the mother, God, the Father, they create the aliens, they create the cities and the cities of those cities. There’s Christ and so the Christos, right, I’m not gonna say Christ, but Christos interpret that however you will. But yes, so, I mean, some people can say Christ, and there, we could have a whole discussion on that for an hour, right? Like who they are. I mean, I my theory is like, another incarnation of those two is Mary Magdalene and Christ. I mean, they both embody the same energy.\n\nRight? Oh, that gets us into sort of Da Vinci Code territory, right. Right. Yeah.\n\nA lot of lines. Yeah, blood lines. And, I mean, I find that really fascinating.\n\nBut but just Sofia, so just, I don’t want to get lost because this is a big, this was a big sticking point. Right? I had. So with the Nasik. So Sophia, is she she creates the human race or whatever. She\n\nwas right with Christos like that was Yeah,\n\nbut but didn’t she create yalda bolus?\n\nYes, she did. Who\n\nis who is the mean imperfect is a God that the Christians, right,\n\nright. So here, here’s a, here’s how it starts. Right? And this is how like I interpreted in a comedy and this is what I wrote through all these other references, because I read like 200 books.\n\nOh, wow. I believe. I’ve read a few about Gnosticism. And it’s, it’s very confusing.\n\nIt’s very confusing. So I broke it down this way. God the Father, God, the mother, right. They create the, you know, the big shebang, create the stars, the universe, etc. Then they go off and create the aliens of those aliens. There is the city’s right. That’s Christos, and Sophia.\n\nAlthough in the name of the Peridot. Those are the Peridot Sophia. Okay.\n\nYeah. Okay. Right. They’re tasked with creating the divine human and propose, right. They’re kind of like genius lab. Scientists. Okay. That’s their thing. Right? Sophia wants to go off on her own. She’s her mother’s daughter and create on her own. She’s like, I’m sick of this lab. Right? I’m tired of, you know, just being here. I want to go off and create what’s beyond me. So she takes this flying leap into the void. And she breaks the law of creation, basically, which is there needs to be a male and female element creation. Okay, yeah. Right. Right. So she does it on her own and creates on her own and she takes the flying leap into the void. She becomes fearful and her fears give birth to yelled about. Okay, so, so, so yelled about is like, say he’s, I mean, here is the image in the book. Right? She’d like to sense into fear.\n\nSo, it was a circumstance it wasn’t really that Sophia isn’t perfect. It’s that she rebelled is like she she like\n\nshe was rebellious. Right. She was like this young girl who wanted to be like her mother. She wanted to be independent and Christo’s was like No, I’m not going to defy God. And she’s like, you know, well, I’m going to see what happens I’m going to go off on my own she wanted to have the experience of creation she wanted to see what it was like so she she had this incredible what I call the need to know okay, I’m with you now. So the need to know just to find out what else was out there to create for herself so she broke the rule of creation and when she did that she gave birth to the demigod yell debelle.\n\nOkay, and to, to sort of reproach that yell devolve is the is the Christian God that all us Christians are, are worshipping the wrong one. He’s the imperfect god,\n\nhe’s the imperfect God you should be\n\nfocusing. And, and the Gnostics would say that this is more of a prison planet, maybe kinda like the matrix and yes, the real God is out there. It’s Some of them called the sun behind the sun. The real Gods up there. We’re just kind of being duped a little bit. We’re\n\nkind of Well, I mean, when you think about it, right? we’ve all talked about how we live in a world of inversion. Right? matrix, right?\n\nYeah. David ickes argument for that is is, it’s pretty good. Like, that’s where I that’s where I come to with some of the Gnostic stuff I resigned to like, well, I don’t know if they’re entirely wrong, like some of this stuff. Makes sense.\n\nOkay, so what is David ickes say about this? Just, I mean, I love him and I, but\n\nyeah, the thing that sticks in my mind from him is how he says, like, you know, the hospital system makes people sicker. The education system makes people dumber. It’s like, everything’s inverted. You know, everything’s\n\ninverted. Yeah. I mean, television is programming to life. I mean, you know, this television broadcasting programming blog. I mean, we talk about that. I mean, you do a whole thing on like, what TV shows me and what films me and I love that whole how you dissect everything. Yeah,\n\nyeah, I feel like entertainments like the big, the big the big show. It’s like the big ritual. And\n\nI mean, the holly, you know, it’s like the wand, right? Yeah.\n\nAnd you get I guess what I’m, I guess what, what? To be more specific about it. Because in the book, you talk about how Sophia created this lion had a reptile yada, both. And I assume that y’all are both in turn, creates the demiurge, which is basically the demiurge Oh, he’s entirely the demiurge\n\nYeah, he’s the demiurge. Okay, he is the demigod demiurge. He says, you know, I’m God. There was no other God. But me basically, because Sophia was so ashamed of what she created. She tried to hide yelled about, she created a cloud and put a throne in the middle of the cloud to just hide shield him, shield her. Her creation, her abortion from God. But, of course, her mother knew what was going on. And so when shielded yelled about, he didn’t know that there was another God above him because he couldn’t see anything from the cloud.\n\nRight. Okay. And so well, you said he’s born of chaos,\n\nborn of chaos, right? chaos, the fear of the chaos of fear.\n\nAnd well, that that makes me it makes me think of obviously, like Trump was the chaos candidate. They told us that ritualistically for many years, right. And then obviously, in his final, you know, year in office, like things couldn’t possibly have been more chaotic. I mean, this was completely unprecedented stuff that happened. Then we also get into ideas of the great reset, which I don’t I don’t know how familiar you are with the ideas of the World Economic drain.\n\nYeah, I’m way familiar with it. Okay, good.\n\nI mean, like, whole great. Reset versus the Great Awakening. I mean, yes.\n\nTell me more. Tell me your your take on this. Because this is one of the big I mean, this is arguably the biggest, to me that like the biggest topic, the biggest theory in our time in modern times. So what what’s your what’s your take on how all this fits?\n\nWell, I’m glad you brought that up. Because, actually, I wanted to say that I wrote this book about basically the great reset and the Great Awakening it really, yeah, because it starts off with Mother Earth. Right? saying, okay, gotta go back here. It’s like sometime in the near future, as well. I wrote this book, you know, came out in November, but it was, it’s about right now. It’s about the Great War, the final war we’re in, in. I think this is a war on humanity, a war of consciousness. I mean, you’ve, you’ve heard this, you know, this. So I mean, here’s like Mother Earth, saying, Earth will either ascend into an unforeseen Golden Age, where you man where the planet and humanity evolve into what I originally intended, or to evolve and go the other direction. Right? That’s God, the mother saying this to Mother Earth. And Mother Earth says these people are killing me, these two opposing timelines. That’s right now the great awakening the great reset. There are the repercussions of the original power struggle that started with Sophia and yelled about, so I tie it right back into the actual crux of the situation. Okay, I like starting to the Gnostics, right. But then you could also go back to the Sumerians and you could go back to Atlantis and you could go back I mean, There’s so much of our history that we don’t know.\n\nRight, right. And, and I’ll be honest with you, when I read the book, first got into it, I thought, okay, it’s like got gnostic vibes cool, whatever. not my thing, but like, hey, whatever. And and I got done with the book and I thought, hmm, there’s some curious ideas in here. Let me do a little more research and I was, I was digging around and I started watching, man, what’s it some lecturer talking about Gnosticism and, and he talks about the history of Christianity, and it’s sort of like, sort of stunned me a little bit. And I don’t know that this like, shakes me from my foundation of faith, but it certainly changed my perspective on the history of Christianity, because I’m Orthodox Christian, we always say like, we’re the true lineage, like we go back to the Apostle Paul and the first church, you know, and all that stuff.\n\nThe Gnostics have an affinity for a lot of a lot of the disciples. Even Judas, you know?\n\nBut like, to me this the the part that I didn’t know, and again, I don’t know how much this changes things, but it certainly makes me think twice is when the early days after Christ’s ascension, that there was a lot of disagreements about what the Christian faith should look like, because Jesus didn’t provide that information. And there was different factions of Christianity that lasted a couple 100 years.\n\nRight. I mean, yes. And I know what the right\n\nthe right one, one we don’t know.\n\nI know. I mean, to me, like, the closest thing to Christianity comes from Jesus and Mary Magdalene. Right, okay. Which was the, the balance of the male and the female, the divine male and the divine female, right, which goes back to God, the mother God, the Father goes back to the CG, Sophia and Christos, they tried it again with Ashura, who was yawei his wife, but she got squelch because she got too powerful.\n\nI mean, to me, I never heard of Ash Ash or Eva Petra.\n\nOh, yeah. Ask her she was the she was the female counterpart to yawei. Right. And yawei apparently was jealous. Little Legend says she had priestesses. She had her own temples, and they, and they killed the women who are worshipping her and the men and they burned down the temples, and it wasn’t enough to burn down the temples, they peed on the temples on top of it. And there are all these like excerpts in the Bible about like burning down your Astra trees, and you know, anybody who works absurd, they’re going to kill you, we’re going to kill your towns, we’re going to kill your burn down your temples like so that balance you know, the male female balance was destroyed there. It was destroyed with Adam and Eve again, when yelled about wanted to say that Eve was like, came out of Adam’s Rib when she was really the power. She was the one who gave them life. Right. And then again, with I mean, even the story of Mary Macklin. do a deep dive into her right? Yeah, like, I didn’t know that. Just like Mary had a visitation from Gabriel, that Mary Magdalene mother had a visitation from Gabriel, like same Angel, saying you’re gonna be telling her mother that she’s giving birth to like, a very special entity being right so and her mother had, and her mother was a queen. She was queen. What’s her name? Eustace and her father was one of the kings of the 12 tribes of Israel. So I mean, who knew that I didn’t know that interesting. It was really interesting. And I mean, Christ had the David lineage, right? So here’s Mary Magdalene. She’s also she also has this lineage, her Queen Eucharist, right? That was Mary Magdalene mother. And the thing is, like Christ had this had the protection of the Virgin Mary and Joseph But Mary Magdalene really didn’t have that she was stopped by by Satan. Right? She was protected by angels. And then she was sent to school in Egypt, which was a mystery school was ISIS as mystery school. Right? And she comes back on her father’s like, well, I’m going to make money off you. I never really wanted you. Anyway, I wanted to son and sends her off. She’s a princess right? And he sends her off with her dowry. Her her dowry which was a shit ton of money, her entourage of handmade bodyguards in a caravan and on the treacherous road to Babylon. What could possibly go wrong? Well, gang of thieves stole a dowry, murdered her bodyguards and mermaids, and then she was abducted in sex trafficked into and sold into prostitution. I mean, who even knew that right? Right? Like, I mean, there’s so much for Mary Magdalene that we don’t even know about her. But she comes back and meets Christ and has this great big love story. And well, I becomes like the,\n\nyeah, I see I, and that’s what sort of like piques my interest with your book is, like, I do see how obviously, we’re sort of a patriarchal society, and it’s very war focused and stuff like that. And even Bill Cooper made mentioned one time and one of his lectures about how he thinks that women ran the world wouldn’t look this way, things would be much different. And I don’t know, like, it makes me wonder about all these things, like, all these traditional sort of roles. But I but I am curious, because of the great reset talk, like like, in the book, you talk about the like you’re talking about Mother Earth, it was like saying, hey, they’re killing me. Right? Like the great reset. According to Klaus Schwab, in his book, he’s saying like, he sort of CO ops that idea. He sort of says, like, we need to do something about climate change. We’re killing the globe. We’re killing Earth.\n\nHow do you reconcile that a little bit?\n\nFirst of all, clap Klaus Schwab looks like a character in a James Bond. Right when you say I mean, it’s like Dr. Evil, like, but worse. Okay.\n\nHe’s got that multinational corporate conglomerate. So like, Yeah, of course.\n\nI mean, like, so first of all, they take a truth, and they distort it, and they invert it. That’s exactly what they do. Right? Oh, yes. Like, well, you know, the planets in trouble. So we need to like, save it. And we’re going to do it our way. Basically, the thing is global warming. It’s really, like the whole universe is getting warmer. It’s not just the globe, that’s warming, according to our Great Awakening poster and all the different people who are in the truth movement, who will actually say that, so the whole thing about, you know, the Cabal, they will take something and twist it. And so they’ll put like, a little element of truth in it. So they hook you, and then it’s like the frog in boiling water, and then they’ll tell you like, you know, you get acclimated, and then you don’t even realize that the water’s boiling, and you’re stuck there. And you’re, and you’re like dying before, and it’s too late for you to do anything about it. Well, that’s, that’s, I think, where we’re at right now, will we do something about or why not do something about it? Right? They say that the only way out is through, I say the only way out is us is through? Like we’re the ones that we have to we can’t rely on like the government to help us. It’s got we’re the ones who have to collectively get it together and stop this from happening.\n\nDefinitely. Yeah, it seems like every, every real radical change happens. from the bottom up, you know, from the people up the and I’m with you in the sense that when you read the great reset stuff, it it does have a lot of good ideas. And then I’m like, oh, okay, that’s cool. Yeah, let’s start taking care of people a little bit better. But ultimately, I distrust it and reject it, because of the people who say they’re going to solve the problem are the people that created the problem?\n\nRight. That’s why they do it. I mean, look at look at Bill Gates. Oh my gosh, like to populating the planet. Yeah. And then I have friends who are like, oh, but here’s the philanthropist. I’m like, You’re kidding me? Like, you don’t know that. He’s trying to get rid of all of us. I mean, to me, like the big issue is the you know,\n\nOh, right. Yeah. Yeah, the the staties.\n\nThis tab is right. I don’t know, like, I don’t want you to get the platform or anything if I use their watch. I know. It doesn’t take much. I’m just saying, you know,\n\nwhat, wait, what’s your? What’s your take on that? Because that’s a big topic. And I’ve delved into it. And, you know, in the past, I was always indifferent. Like, I never took flu shots, good for you. And I just, it wasn’t like, I just was calling on whatever, it’s a thing. And then I deep dived into it. And I saw what the anti stabby folks were saying and i and i I basically came out the other end and thought, you know, I, I get how they’re so against these things because they’re clearly not as safe and as effective as they portray them to be. However, I do think they work on some levels. I don’t know what the right answer is here. And I’m clearly not a doctor. So what the hell do I know? But yeah, but a lot, a lot of wacky doctors out there too. So\n\nI know like, there’s like these doctors who haven’t really met with a patient for like, 15 years and are part of like the whole Bill Gates agenda.\n\nYeah. And there’s, there’s, there’s, there’s big bucks behind this. These doctors are on the payroll. Yeah, they are. So it’s really hard to know the truth. And it’s like, I also also sorted like, I try to keep a foot in both worlds, you know, I got this truth or world which is ultra paranoid, and like, over the top with a lot of things, and then you’ve got this sort of rational world and I try to maintain a balance of the two because I feel like, that’s where the truth is, you know,\n\nthat’s what I try to do. I mean, like, I, I am, my dad is a has a doctorate in nutrition. He’s a pharmacist, right. Okay. So he’s, so he’s both, right. And I’ve always grown up with taking a lot of vitamins, and you know, medicine. I’ve taken it, but it’s always been like, built up your immune system first. Okay. I did have about eight or nine years ago, I had a vaccine injury. I literally had two vaccines, I could have like an indentation in my arm, right? Like the muscle totally. Like, I’ve got a hole in my arm from it. What happened was I had a flu shot and a pneumonia shot. Because I’ve had like, issues with my lungs ever since I was a child. And I had like 105 fever. And my mother called me. And first I thought the thermometer broke. And then I went and got another one. And by the time my mother called me, I was like delirious and not making sense. And then next thing I know, my brother’s banging on my door, dragging me to the hospital. Thank God he did, who knows what would have happened? I was totally out of it. But, you know, to have 105 fever and not be able to do something about it. I mean, that’s a very scary thing. So, yeah, so I don’t really, and then I have done research on the Pfizer vaccine.\n\nAnd yeah, you’re good. You’re good. Okay, no, I, I there was a day where I used to not say terms like this. Because I’ve got a Patreon thing set up and I’ve got all these roles. They can kick me off when I started my own thing. So like, okay, for any platform, you and everything, that’s fine. People know where to find me now. So\n\nappreciate it. Thank you, Joe. Let’s hear it. Let’s This is important information. What do you find about the Pfizer? So\n\nokay, so the whole thing about Madonna, how it modifies, you know, modifies RNA. So basically, it’ll, you’ll be genetically modified, that is an irrevocable, you cannot once you have that vaccine in your system, you can’t get it out. And then they also heard,\n\nwell, they said that to be fair, let because I’ve researched this too. And the answer is like, clearly, and this isn’t medical advice. But what I read what they claim is that they they shoot the, the I don’t know the proteins or whatever to do that RNA stuff. And your body it dissolves and dies within a day or something like after it does the thing it needs to do. I don’t trust scientists too much. I don’t know how accurate that is. But that’s what they officially officially they say, well, it doesn’t stay in your body. It’s not in there, continuously doing things. But that’s right. Their response to that would be so\n\nyeah, well, okay. Here’s the thing, right. I also heard about the Magellan. So did you hear about that, like this smart dust? rainchecks?\n\nI’ve heard of this thing? No, no. What is it related to the COVID vaccine? Oh, no, I haven’t heard this. I\n\nheard that that’s also in the vaccine. And that goes, those metals could go into your brain and they said that you could be put on remote. Like, there are people that actually say, I’ll never have another free thought in your life. Right? That’s one theory. This is my theory, right? I mean, I’ve heard from scientists who have had more gel ins in their brain and it’s impossible to get at once they’re in there. You can never get them out. Right? I mean, so whether or not this is true, I would prefer to have my body build my immune system and That way, which means taking vitamins like for second, right? Which is an antioxidant. And that will open up. No, I can’t give you the whole formula. Oh my God, is it? My dad gave me this formula like in March. Right? And I have, um, usually the girl who goes down like gets the flu like first. I’ll always want to get to first. I’ve not been sick one day. Really? Yeah.\n\nIs it a long list of things?\n\nThat’s wrong. Okay. Okay, well, we’re gonna write, okay, it’s Chris satin. 500 milligrams, right. And then it’s a sink. I think it’s 25 milligrams, right. But the cross section opens up the cell, the sink goes in and it blocks the COVID. Right? Then it’s vitamin D, I take 6000 units because I’m a cancer survivor of that’s the other thing I wanted to talk about the whole victim consciousness.\n\nRight, and consciousness. Yeah. Okay. All right. Yeah.\n\nOkay, we’ll have that next. But okay, vitamin D, 6000 units. And then vitamin C, I take two to 3000 milligrams a day. Vitamin C’s super important. I mean, all these work together. Then there’s this doctors of ceylinco. He’s the one who was talking about hydrochloric when and got told he was like the first person to get thrown off Twitter. This was his protocol to and the medical protocol, the same version was with hydrochloric when instead of quercetin, but both of them have a quinine base. And it’s the quinine, the quinine, and quercetin, and hydrochloric when that block the COVID. And that opened up the sell. And then the same goes and that goes in both protocols. The hydrochloric one goes in with the zinc, and the C pack, but the protocol that I just gave you is all vitamins. So I prefer to fight, let my immune system fight and have like a strong offense.\n\nThat’s interesting. Now, though, because I’ve been on I do, I do way too many supplements and over the counters every day, I’ve got handfuls I do once in the morning, once in the evening, I take everything except for the cassette. And I got to look that up. But my, my, where I go with this whole thing with Should I take the vaccine or not, is because I’ve got medical people in my family too. And they’ve given me the firsthand testimony of like, here’s the problem. The problem is they simply don’t know why this virus, wreck some people and doesn’t wreck other people. And it’s like somewhere in the ballpark or like 10% of people have these long term effects where they’re their lungs are jacked up. And, you know, they got all these problems, their heart rate goes up really quick. And, you know, I’m trying to I’m trying to flip this podcasting career into being a crossfitter. So that doesn’t do good for me. So now I got to really make the choice. Do I want more gallons in my brain? Or do I want the 10%? Roll the dice thing? You know what I mean? So, so like, that’s because because when we look at the numbers, like everyone’s always quick to be like, Well, you know, you got a 99.5% chance of especially because I’m only I’m 41 you know, you got a nice, you know, you’re fine. And I was like cool, like we’re counting the deaths. That’s one thing, but like, I’m worried about, like, I don’t want to be one of these long haulers. That’s like, unable to breathe for four months, six months, whatever it is. So like, it’s a tough call. But yeah. And this goes into our good to bring it back to Gnosticism. And the yalda. Both the imperfect God, that’s kind of what our medicine system told us from day one is to just wash your hands and wait for the vaccine and like, is there things we could do to be healthier? I mean, like, they don’t talk about those things. Which, which is what brings me over to the sort of granola truth or side where I’m like, maybe they’re right, because I certainly don’t trust what Big Pharma is telling me on TV. And no,\n\nI don’t trust Big Pharma. I don’t trust deep state. Oh, no trust deep stir. Deep church, the church\n\nand the new one. Okay.\n\nI mean, look, I’m a I’m a devout Catholic, right.\n\nI like you are right now still.\n\nHow does that reconcile with the non gnostic ideas? Can well subscribe, I love Yes,\n\nabsolutely. I love the Virgin Mary. I love like, I have like, I wear amulets and you know, Saint, Archangel Michael, I have all the saints behind me. I pray the rosary every day. Okay. All right.\n\nYeah. abandon my orthodox background. Give way a little bit, because I know I want to talk to my priest about this. I know he’s gonna roll his eyes. And be like quit watching videos or whatever.\n\nRight, right, right? No, I mean, my dad was in the seminary. Okay, crazy, right?\n\nthat’s a busy family you guys got there.\n\nI know they are like they do a lot of stuff. Now. They’re just like my mom’s making cookies and my dad’s like, What the hell’s going on right now?\n\nWell, but I don’t want to get lost. What? Okay, we talked about victim consciousness. What is that?\n\nOkay. So, again, okay, this goes back to the great reset and the Great Awakening. How about that?\n\nYep. Yeah, that’s, that’s kind of my main topics I wanted to hit with you was obviously surrounding your book, the ideas of Gnosticism and the great reset and, you know, applicable things. What’s going on today? What can we do? What’s the right path?\n\nOkay, so victim consciousness that is poor little me, you know, I need I have no power. I need government to save me. I’m going to do whatever government says. If they tell me that I need to stay home for the rest of my life and shut my business. I’m going to do that. As opposed to well, wait a minute, let’s like question things here. What does this exactly mean? And, you know, I did not comply, like I am going to stand strong and really think about this. Think about what’s going on here. So I came to this. Well, I was diagnosed with breast cancer, right? This was in 2004. Right before I was about to get married, I’m divorced now. But anyway, so I was when I was diagnosed, I was asked by Glamour magazine at the time who I had a monthly cartoon with. Do you want to write about it and I didn’t know what so a friend of mine suggested the title cancer vixen instead of victim because I hate the whole victim thing. I don’t like crying or feeling sorry for myself. So I totally embraced the whole vixen embodiment and I drew myself as a cancer kicking vixen. And I wore shoes. My mother’s a shoe designer to me like she was for comfort food to every single chemo session and lipstick and really imagined myself like kicking cancers ass right. So I everything that I do is about empowerment. And it’s not just about female empowerment. It’s about human empowerment. Because when I was writing the big shebang, I realized that we are divine, right? That’s the other thing that we’re not told. We have so much power. And that’s like what the Gnostics talk about. Like with Eve, when he was read life into Adam, she she was the anthropos and that’s who we truly are. We are the divine human anthropos. We have so much divinity, and our bodies, right that we have an access. And I think that’s what, that’s what the Great Awakening is about.\n\nOkay, yeah. Because Because we are created in God’s image, right. So there’s right now.\n\nGod, the God, yes, the divine spark that God the Father, God, the mother, because this book is the big shebang is about the balance of the male and the female, and empowering both right, which is where Jesus and Mary Magdalene come back in and everybody and it’s about really accessing our power and our divine within and realizing that we’ve been squelched. We’ve been held down by the Cabal for so long, and it’s now time for us to rise up and stand up to them and reclaim our planet and reclaim our divinity. So\n\nthat’s a that’s a great thought. How do we do it?\n\nHow do we do it?\n\nAll right, we need a plan. So plan not a plan. So\n\nhere’s and here’s where I saw, like, I watched the inauguration right? Yeah. And politically, I’m pretty well, like, I don’t buy into the two party system. I don’t like it. I don’t like either party. But socially, I I lean, extremely liberal. Right. I’m more of like, I don’t want the government in my life. But I want them to be there to help some people because there’s not enough you know, corporate help or fundraising charity stuff for that to happen. So I feel like there’s a role there to be played. Right now gets out of hand. Sometimes I get help people say oh my god, you’re socialist, and you’re going down the communism path. Like I get that I also don’t like communism. So like, I think in general, like for me to live my life, I want to be self sufficient, independent. Don’t want to rely on the government because the more you rely on them, the more they get to interfere with your life and tell you what to do. Same. So like but but I’m but it’s and it’s kind of weird because I’m kind of okay with. There’s some people in situations that need that. And like, I want them to get the help they need. I don’t want nothing to deal with. Yeah, yeah,\n\nbut I think we all we all have a choice. Like I say, you know that song clowns to the left of me Joker’s to the right here I am. I mean, I could be I was actually thinking like, that could be another book or something. That’s funny.\n\nI can a middle right. That’s me.\n\nOkay, so so I’m talking\n\nabout chakras as the corrupt politicians and the clowns. The corruption on both sides.\n\nRight, right. And, well, okay, so here’s, here’s what I noticed during the inauguration. We have this sort of, because I look at everything from like a ritualistic perspective, and the takeaway I had was kind of like, Okay, this is a big show of optimism for the future America united. We’re, we’re reflecting upon the depths, and that’s going to be behind us soon from the virus. You know, and they’re kind of selling us this optimistic vision for the future, which I love. Thank God, let’s do something good. I want that. And unity, you know, they’re heavy on unity. That’s like the buzz word, unity, unity, unity. And I think okay, ritualistically? Like, are they preparing us for better times? Or do I get paranoid and say, Oh, no, they’re preparing us to embrace the great reset. And that’s really where things get bad for everyone.\n\nSee, I, I thought a lot about this, too. And I really wanted to talk to you about this. Actually, that was one of the things I wanted to talk to you about.\n\nI saw it as well, first of all, I was thinking, there’s no people here. Were the people. Right? Because it’s like, the government serves the people. They work for us. Right. Right. And instead, it’s like this big, like, show of elite. It was all about the elites. Trump whether you like him or not, there was like a Chilean people there. Right. I mean, so that was the whole elite parade disturbed me.\n\nYeah, right. Okay. All right. I can, I could see that, you know, because like, naturally, I think, Well, I mean, the reasons no one there is because of the virus, right? Like, they don’t want gatherings.\n\nBut I mean, still, do\n\nyou look at it as because you’re right. I watched it. Like they pan into the audience. It’s like every big name of you know, politicians. I got some celebrities. You know,\n\nit was so exclusionary, it was so like, you know, we’re above this. We’re like, you know, this is us. We’re here and you’re down here. That’s how I felt anyway. And then and then Hunger Games symbolism. That’s right. That’s the other thing I wanted to talk to you about. It was like the human hunting speaking of the church, or the Vatican, or the Pope. I mean, you’ve heard those stories about the human hunting, right?\n\nOh, my gosh, that’s like one thing that’s been floated around about the human hunting that goes on in the forest and, like, children, yeah, in America, or over in Europe, like, okay, like the last Pope, what’s his name? Did and Francis has got a whole plethora of stuff going on with him. Yeah,\n\nYeah, yeah. I mean, the human punching nuts, a rabbit hole to go down. Just check it out. I mean, there’s like, human hunting parties and like the pokes and the British royal family, and the Royal like, European royalty. Hunt children, and God knows what they do to them. Oh,\n\nno, you’re gonna get me deep. platformed\n\nam I gonna get you?\n\nI just kidding. I’m just joking. I’m like, Oh, my God. That’s curious. Yeah. Because, you know, that movie, The Hunt was kind of long. You know, they show us this idea in movies and stuff sometimes. So I mean, maybe\n\nto get to desensitize us, right.\n\nInteresting. Well, because we only got a couple minutes left. The we’re talking about the great reset, and we’re talking about the inauguration and there was like a Hunger Games vibe to it. You know, Lady Gaga was wearing the what looks like a little bit.\n\nYeah. So I I want to remain optimistic because like sometimes that’s all we got left is to try to stay positive. I get where a lot of the you know, all right type folks are. They don’t like the idea of of, of Biden and such because he’s definitely more On the globalist side of the fence than Trump, which is true? Well, it’s true. We’re already rejoining the World Health Organization, which, you know, there’s, there’s issues that I have with\n\nI have issues with them, too.\n\nI, I observe everything and I read everything. I always read both sides. I read the Epoch Times, I read the New York Times, I get aggravated with one of them more than the other. Let’s just say that I’m interesting.\n\nWell, yeah, the Epoch Times that’s run by like, some Chinese billionaire guy, right? Like, yes, that can we trust the Chinese that much? I don’t,\n\nYeah, yeah, that’s, that’s kind of where it gets to sometimes where it’s like, you just got to find what what helps you get through your day, what helps you set up long term goals, and it’s really tough. This this great reset thing that coupled with the aliens is going to be that the real struggles of the next, you know, yeah, five years.\n\nI mean, are we gonna, let’s say, when disclosure happens, I mean, there’s, it’s happening now. People are really talking about it. There was an article in one of the big magazines, they totally got the story wrong. They’re like, well, if it happens, you know, if there are aliens out there, I’m like, Oh, my God, I can’t believe you’re asking if really, yeah,\n\nyeah. I mean, everyone’s everyone’s basically proving that there’s something happening. And I think the problem is that they can’t explain it, which is why there’s still debate about this whole thing. And you know, anyway, that’s it. That’s a long talk to talk about the mental there, but okay, we do have to wrap things up. Okay. What working work in the audience get more from you? Where can they learn more about your ideas? Where can they pick up the book, The Big shake,\n\nthey can pick it up at? I could give you the link to order it word bookstores and because I love indie, so yeah,\n\na lot of people listening do too I get that a lot. So\n\nyeah, so I could give you a link to word bookstores in Jersey City. I’ll sign it if you want and they could ship it out to you. We’ve got like this little, you know, arrangement there. On Instagram, resaca Chela, Twitter Marie Sacca Chela, Facebook Marina, Coachella. And, yeah, find me there. Follow me. And I think I’m going to start my own channel too. So you know, when I do I hope to have you want to say, Yeah,\n\nI’d love to keep talking to you. This is by her.\n\nI know, this is so much fun. I really want You’re the one person I really, really wanted to talk to. But oh, you too kind. Thank\n\nyou. Yeah, though, this is this has been a great talk. I’ll be honest, the the book really blew me away. It’s, it’s got me digging deep, deep into the Gnostic stuff. Whereas before I really dismissed it, and just thought, wow, I don’t know, seems like some occultist Luciferian stuff. But it’s got me a little twisted and turned on my head after reading the book. So good job on the book. I hang. I draw I doodle cartoons. Sometimes I’m not that I’m not as good as you are. But I can’t imagine how much work you put into this book as beautiful as illustrated. So yeah, I’ll put the links in the show notes. People can get your books from your indie bookstore, your Instagram, your Twitter, your Facebook. And yeah, let it let me know stay in touch when you get when you get more projects go on and will link up again.\n\nAbsolutely. And thanks so much for having me. It was really a blast talking to you. Yeah, The\n\npleasure is all mine. Thank you.\n\nAll right. What do you think of that? If you want an entertaining guide into some of the ideas of Gnosticism, the female goddesses. The suppression of the female divinity. You gotta check out Maurice Arkansas, his book, The Big shebang, it’s up on Amazon. You could win that copy on my giveaway. But check out the links in the show notes you can catch up with Marissa on the social media. She’s on the Instagram, she’s on the Facebook. She’s on the Twitter’s even on the YouTube, Marissa arcotel on most of those, but I’ll have the links in the show notes. And also have a link to her actual bookstore where you can buy a signed copy from her or you can support her and check out her books. bookstore, I got the link in the show notes there. Yeah, check out the details of my giveaway and be a supporter on one of my feeds rockfon Patreon or the VIP. And I’ll March 1 2021. I will select one from each platform at random. You will get a copy of the big shebang signed by Maurice arcotel you’ll get a copy of the dark path signed by me Isaac and one of my ultra soft t shirts that say these nerds are going to kill us because you know they will. You know they’re going to write you know, that’s where we’re headed. Anyway, you know the deal. Check out the different platforms you can go to Illuminati watch.com. Click on the VIP section, and you can learn about what you get on each support plan. form and until next time, stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gnostic Goddess of Wisdom and the Great Reset Awakening with Marisa Acocella! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we are joined by a woman who brings us the granola vibes of optimism for 2021! Marisa Acocella is a cartoonist that has New York Times bestsellers like Ann Tenna and Cancer Vixen. She’s also been a cartoonist for the New Yorker and Oprah’s W magazine. Her […]", "url": "https://illuminatiwatcher.com/gnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-02-17T13:55:39+00:00", "article:modified_time": "2021-02-17T14:04:02+00:00", "image": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/02/ctauc-marisa.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["gnosticism", "gnostic"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/members-section/", "https://Patreon.com/IlluminatiWatcher", "https://Rokfin.com/Creator/Isaac", "https://Rokfin.com/Creator/Isaac", "https://bookshop.org/books/the-big-she-bang-the-herstory-of-the-universe-according-to-god-the-mother/9780062905666", "https://www.instagram.com/marisaacocella/", "https://www.facebook.com/Author.MarisaAcocellaMarchetto", "https://twitter.com/MarisaAcocella", "https://www.youtube.com/channel/UC2ssDp0xnXxZax1c9vJcIHA", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/43494313", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/gnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella/?share=twitter", "https://illuminatiwatcher.com/gnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Gnostic%20Goddess%20of%20Wisdom%20and%20the%20Great%20Reset%20Awakening%20with%20Marisa%20Acocella%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fgnostic-goddess-of-wisdom-and-the-great-reset-awakening-with-marisa-acocella%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Berndog", "bran", "Isaac Weishaupt"], "publish_date": "2021-02-17T13:55:39+00:00"}