{"result_id": "165027", "URL": "https://illuminatiwatcher.com/9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1/", "timestamp": "2023-04-25 15:36:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "9/11 Conspiracy Theories Part 3: Most Dangerous Book in the World- 9/11 as a Mass Ritual Book Club Week 1", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we continue our journey of decoding the occult symbolism and conspiracy theories around 9/11! On this special series of four shows, we’ll commemorate the 20th anniversary of the biggest PsyOp of occult symbolism EVER! Part 3 begins our book club deep dive into SK Bain’s book “The World’s Most Dangerous Book: 9/11 as a Mass Ritual!” We’ll cover the first half, Section 1: The Production opening the gates of the universe, 11 symbolism, Crowley, Liber 175, Flight 11, The Pet Goat, Flight 77, Liber 77 (the “Book of the Goat”), Pentagon, Flight 93 (the number of Thelema), WTC7 symbolism and more! PHEW!!!!\n• If you need to start at Part 1 of the 9/11 Conspiracy Theories series you can start here: https://wp.me/p2ijVF-b8H\n• Go ad-free with bonus content! 3 options- Rokfin.com/Creator/Isaac, or Patreon.com/IlluminatiWatcher or the VIP Section (*you can compare the three options here): https://illuminatiwatcher.com/members-section/\n• Peep all the images discussed on the show at Instagram.com/IsaacWeishaupt\n• ALIENS, UFOS AND THE OCCULT BOOK SERIES NOW UP ON AMAZON AND AUDIBLE!: https://amzn.to/3j3UtZz\n• Get your mega soft podcast t-shirts (the 2020 ‘Nerds are gonna kill us’ version) AND your signed paperbacks of ALIENS, UFOS & THE OCCULT USE YOUR ILLUSION bundles: https://gumroad.com/isaacw\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Go commercial free with bonus content by supporting the show on any of the three platforms!\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “9/11 Conspiracy Theories Part 3: Most Dangerous Book in the World- 9/11 as a Mass Ritual Book Club Week 1” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\n3. Go commercial free with bonus content by getting in the VIP Section!\n\nThanks again for all your support! If you want to stay connected please sign up for my free email newsletter which will get you updates on all groundbreaking revelations of occultism in entertainment (as well as occasional free giveaways)!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the premium feeds on VIP Section, Rokfin, and IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Chris Jericho’s “Talk is Jericho” podcast, “Those Conspiracy Guys,” Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is available for Patreon supporters- check out the options by getting in the VIP Section!\n\nUnknown Speaker 0:04\n\n As the attack took place, Mr. Bush was on his way to an elementary school in Florida. When informed of the first plane hitting the World Trade Center, where terrorists had struck just eight years prior, Mr. Bush decided to go ahead with his photo opportunity.\n\nUnknown Speaker 0:26\n\n Read this word the best way to get ready. Get ready.\n\nUnknown Speaker 0:34\n\n Get ready to read the words on this page without making a mistake.\n\nUnknown Speaker 0:37\n\n When the second plane hit the tower, his chief of staff entered the classroom and told Mr. Bush, the nation is under attack. Not knowing what to do with no one telling him what to do. And no secret service rushing in to take him to safety. Mr. Bush just sat there and continued to read my pet goat with the children.\n\nIsaac Weishaupt 1:13\n\n You’re listening to part three of our 911 deep dive, not level conspiracies. 911 conspiracy theories. Part Three. 911 is a mass ritual book club, the world’s most dangerous book written by SK Bane. Now, previously, because I already know you’ve been on this journey, you will listen to part one, where we talked about the false flags, the pop culture, predictive programming, kind of mainstream stuff, right. And then in part two, we talked about the occult symbolism and the twin pillars and the numbers nine and 11. And in the final two parts of our 911, deep dive part three and Part Four, we’re going to go through this book written by SK Bay 911 as a mass ritual. Very good book, I highly recommend it. Will I get SK Bane on here? I think so. I think so. Sam Tripoli and crew had SK Bane on tinfoil hat a few weeks ago. I didn’t know that he was doing interviews. I thought this was sort of anonymous, one time kind of dude. But he wrote this book, and I read it, and we’re going to talk about it. Again, highly recommend it. Over the next two shows, I’ll go through some ideas from the book. And believe it or not, there’s gonna be a lot more in the book that I’m not even going to touch on. Because as you know, my purpose and my intent of going through the 911 deep dive shows here would be to explore the occult symbolism, the occult elements here. I don’t get into geopolitical things, really. Not my cup of tea, not my forte, there’s lots of people that cover that kind of stuff. If you’re into it. You know, my feelings. I feel like politics is just another element of theater. But hey, you know, regardless, I don’t stay abreast on things as well as I should for me to comment on those things. So I don’t so there you go. The, I mean, if you want more opinionated stances, you can listen to the show I do with Josie wise up. That’s my lovely wife called breaking social norms. It’s got their own free feed. And if you’re already on my rockfon team, you get the uncensored version. It’s got its own Patreon and everything. So anyway, there’s a whole world to explore if you want to get into more of the opinion, political ideas. That’s kind of where we talk about it over there. And it’s just for fun, just for fun. Now, in today’s book club, I’m going to read you again, I can’t emphasize No, this is one of the best conspiracy books I’ve ever read. For me personally, it hit all the spots, right? It almost bots. That sounds bad, but hit all my spots. And I’m going to read to you a quick excerpt from page 144. And then we’re going to deep dive into the whole book. But this excerpt kind of explains the setup and the attitude and the ideas that you’re going to hear about for the next two shows. Let’s go. This ceremony officially commences as American Airlines Flight 11, ritually marked consecrated with a number of magic itself slams into the north tower of the World Trade Center declaring the initiation of a magical operation. President in Bozeman, George W. Bush arrives at Booker Elementary School in Sarasota, Florida, the state which had given him the presidency in 2000. And where his brother Jeb is governor and where the 911 ringleader and hijacker pilot of American Airlines 11 Mohammed Atal had received Part of this flight training. The commander in chief is high priest is in Paradise, presiding over a black mass, complete with little black children chanting out the words of the pet goat, about which a sama bin londonwill. Later crack jokes on Al Jazeera, saying that bush was more occupied with the goat and it’s budding. Then the plains and their budding of the skyscrapers invoking bathmat, even as United Airlines Flight 175 slams into the South Tower and act designed to invoke Alister Crowley’s LIBOR 175 The Book of uniting to a particular deity by devotion. You can see why like this book right.\n\nHe written they are stating their intentions and declaring their devotion not simply to Satan but also to Crowley. As has been made evidence the entire day’s proceedings constitute no less than an ode to Alistair Crowley Not to be confused with Ozzy Osborne’s literal Ode to croley. Thus, the two concrete and steel Reek recreations of the fabled pillar of Hermes, the God of commerce and trade, and also thieves and robbers stand mortally wounded, as Hermes himself prepares to undertake his traditional role as psycho pomp escort of the souls of the dead to the underworld. And the Tarot the tower card has been known as the house of the Damned, and the twin towers have become enormous, sacrificial altars. Very soon the doorway between the two pillars will be opened, and the veil of ISIS will be symbolically torn asunder as the towers come crashing to the ground and a gateway to hell esoterically created so, yeah, that’s what we’re talking about opening up the gates, the twin pillars and all these things. The gateway to hell. reminiscent of the Italian horror movies, the What was it? No. Yeah, good one, Isaac. This is a trilogy Lucio fulci. The, the city of the Living Dead, right? With the house by the cemetery and all those things, right. Anyway, the idea is that channeling entities channeling spirits doing magical operations, they are trying to spiritually open the gates to hell. Now the author, sk Bane. He’s an expert on Kabbalah. He’s a conspiracy guy. In the book, you’ll notice there’s a foreword by Peter lavanda. Yeah, talking about Peter many times. tried to get him on my show. I don’t get a lot of guests on the show. Because, uh, you know, scheduling is such a nightmare. For me, personally, it’s not my guests fault. It’s my fault. But beautiful vendors, a guy that I would drop everything if I could get him on here. So if you know Peter, the vendor, you tell him to get a hold of me. I’ve been trying attempting to get a hold of him because he knows. Here’s a guy who knows the whole script from start to finish. I know he does. Because I read his books. Not all of them, most of them. There’s also contributions in the book from William Ramsay who I have had on the show. And Michael Hoffman, who wrote a great book about secret society, secret societies and the psychological operations coming from a similar viewpoint as well, that I also have viewing this world as one big real ritualistic theater, we’re all pawns watching, being duped being led down the path that they want to carve. But not me. I’m trying to expose the path. Anyway, the book is divided into sections. You’ve got the production, the producers, and the book and the score. And they talk a lot about what I like about this book is they talk about initiation rituals. And he describes as requiring one foot in life and one foot in death. Because again, like we’ve talked about so many times on the show, it’s all about facing death facing one’s own death. I’m going to read you from the book, and then we’re going to get into the section one and actually start. More importantly, such premature burial is an essential part of the Masonic initiation ceremony of the third degree, to be ritually and symbolically slain, buried and raised again as a feature of many initiatory programs around the world. From Siberian shamanism to quaint 19th century English secret societies. It is a liminal event, you are on the threshold of living and dying. And in that sacred spot, you can see in both directions. Conspiracy theorists are kind of like that. They have one In the world of mainstream history and culture, what Robert Anton Wilson used to call consensus reality. That’s the world where most of us live. So that’s the dilemma we’re in, right. And a lot of people live their whole lives not realizing there’s these two worlds. About the real world, the social construct the matrix, whatever you want to call it, Robert Anton Wilson call it the consensus reality. And then you have this sort of, I don’t know, conspiracy reality, put on the glasses from the live\n\nsound like that. And that’s what we talk about all the time here. And I would argue that the events of 2020 save them what you will, they made a lot of people aware that there are these two realities, and they’re colliding. It could be a lot of good that comes from it, or bad, or direct tyrannical authoritarian ism. There are so so let’s get into the book, section one, the production. And I’m just going to go through the notes, I’m pulling out some ideas that I found interesting, I’ll sort of just go through them as the book proceeds, talks about the the beginning the invocation of thoughts by Crowley published in the opening of this first section. And what he’s trying to say, because in the, in the invocation of cells, it starts out, Lord of the gates of the universe, the the I invoke the, because they’re, they’re trying to what I think SK Bane is trying to do is convey that these Illuminati people, the umbrella, whatever you want to call these people working behind the scenes working occult magic, they’re trying to open the gates to hell, which Crowley was trying to do sort of workings like that jack Parsons, all that they had no problems with dabbling with the dark side. And like I talked about earlier, it’s like Lucio fulci, his movies. HP Lovecraft talked about this, how mankind did magic rituals, to summon Cthulhu from the depths of the swamps. There’s talk about the this book in 2006, written by the CO chairs of the 911 Commission, keen in Hamilton. And they said that the 911 Commission was set up to fail, because there were obstructions to the truth via the Pentagon and the FAA. Now, a lot of this stuff is more of the geopolitical spectrum. But as I talked about in the first part, 911 conspiracy theories, part one. We talked about how there were a lot of weird anomalies that point to something else going on. And that’s what this supports. FBI, Osama bin Laden tracker Robert Wright told the National Press Club quote, the FBI allowed 911 to happen. Again, support for part one. Herman Goering, the one of those Nazis, he talked about, at Nuremberg, that it’s easy to lead people to war, even though they don’t want it, which I talked about in part one with the false flags of Pearl Harbor. I think they got to dupe the people into going to war because nobody wants it. Nobody wants to be involved with any of this stuff. They want to live their life. Yeah, Herman Goering said, just tell them they’re being attacked, and denounce the pacifists for their lack of patriotism, which is exactly what happened. And the same warning was given by Julius Caesar. And there’s this whole history of manipulating the public for the desires of those in power. In fact, George Bush said, that’s one terrible pilot when seeing the first crash. Yeah, either he never read any of these memos. I mean, they were talking about they gave him briefings about this stuff leading up to 911. Osama bin Laden was on the FBI, his top 10 futures list. They bombed the USS Cole 98. They were bombing multiple us embassies. He knew that this was a threat. Fact. There were FBI warning memos, security briefings. So a plane runs into the tower and he says that’s one terrible pilot Because he’s a sociopath, which is the attitude of these people of the Boltzmann’s, it’s always the end justifies the means of these people. In the book, we revisit William when Wescott, who I talked about earlier, you know, great minds think alike. I argue here, okay. And some of this stuff is going to be re visiting the ideas I’ve already presented. And hey, this is how the cookie crumbles, right? We’re both looking at the same things. That’s why this guy’s such a great writer.\n\nCuz he’s researching and saying the things that I’m saying, no self serving opinions. So when when Wescott, this Freemason guy, right, he said that 11 is the essence of all that is sinful, harmful and imperfect. As opposed to the deck deck, which is perfect. That’s the number 10. The end quote, and he talks about Crowley said 11, is the number of magic itself, the sacred number par excellence of the new Ayaan, we talked about this at length already. The he also finds the same point of the Twin Towers being the pillar of Hermes. I talked about the twin towers in terms of the capitalistic tree of life and the pillars of Hercules, he talks about the pillar of Hermes. Now, one thing here that I don’t recall reading in this book, I read it in a different book about the foundation of alchemy. The gist of what we’re talking about, you go back to Zep, tapi, the time of the first Egyptian gods. The idea that these pagan gods were walking amongst men and women, and they say Thoth, aka Hermes, like same name, right? Or same person, two different names, Greeks in the Egyptians and stuff. We’re sharing the same thoughts and histories will vote or Hermes, whatever, there’s this, this God was teaching man about magic and conjurations, and black arts. And that’s where alchemy comes from alkem meaning the fertile black soil around the Nile. And the idea was that there was a great flood because God was like, Hey, don’t be teaching these people are called dark arts. And they knew what the blood. So in the pillar of Hermes, supposedly were the secrets of filth or Hermes. And the idea is that these were then transcribed on the Emerald Tablets, found in the Library of Alexandria. Then when that got raided, it got handed down through oral tradition through the secret societies and all that stuff. But in the book, sk been talks about how the Twin Towers were the pillar of Hermes, the symbolic boundary between this realm and the next. Hermes, is the deified trickster, pointing to the writings of Homer and Hesiod to confirm such says it opened up a doorway opened up a gateway, it’s this symbolic tearing of the veil of ISIS, a portal revealing the Holy of Holies. This is the tearing of the fabric, when you look at the hermetic axiom as above so below, which of course, I always talk about this talks about how the cosmos are connected to the cosmos, or the macro is always connected to the earth or the micro, meaning the magician has a connection to the stars. And the magician with the right tools with the dark arts can cause changes in reality. So they’re saying they’re tearing this portal open so that they can continue to carve out the reality they want, which is a Luciferian New World Order. They talks about Crowley’s vision of the New Age. And he says how this is the same as the goals of the Bavarian Illuminati, a secular global order with the elite ruling over the week, embracing Darwinism Crowley said and I quote, you will observe that I am advocating in eristic aristocratic revolution. And so I am and that’s what I’ve been talking about with this great reset stuff. If you listen to my what I got six episodes on the great reset. Klaus Schwab and company from the World Economic Forum, the top richest 1000 corporations around here trying to convince you that they’re looking out for your best interest. And I don’t know if you’re like me, but I’m very skeptical of corporate America, corporate takeovers, the greed and clearly with the wealth, the wealth gap And the fact that CEOs or for most companies are making an exorbitant amount more than their workers. It’s clear that I don’t want them redistributing the wealth because they will just take more because they have a mental illness. And that’s what Crowley wanted. And that’s what the Illuminati wanted. They think you’re dumb. They think the sheep need to be led to slaughter. They’re the chosen the lead. And this isn’t much different than that prosperity gospel nonsense that Joel olsteen teaches\n\nto throw bone to my non Christians out there. And the book goes into detail about why Crowley was such a bad game. Most importantly, it discusses how the world’s elite are obsessed with these Illuminati values, which are in perfect accord with crawleys. Religion, the Lima and if you if you don’t know much about Crowley, because we don’t want to hijack the conversation, no pun intended there. Excuse me. We don’t want to we don’t want to hijack the conversation. I actually did. And this was I probably should have done this on the conspiracy theories and unpopular culture podcast. But no, I’m doing I’m breaking social norms. Because on that show, again, to plug that show again, on breaking social norms. It’s me and my wife, Josie wise up. And we talk about a variety of subjects. And every now and then every couple shows or so we break down conspiracies for the normies because that’s my wife. She’s a normie she doesn’t get it. She thinks we’re crazy. But when I explain things to her, she comes to my side, she’s getting red pilled. And anyway, I did a whole show. I did two shows on Alistair Crowley explaining who he was, why is the bad guy. I mean, we’re talking like, what four hours and you can find that on the brain social norms podcast feed everywhere, it was back in March of 2021. But long version short, crow is a bad guy. Turns out neither elitist born into money who thinks that people are dumb and he should be able to do whatever he wants do without wealth, right? Well, Crowley plays a big role in 911 because of all the numerology and the books that Crowley wrote one book and they call them lever, right Li B er, it’s like the Latin word for book or library or something. I don’t know. I didn’t look it up belieber 175 and uses Roman numerals often but Lieber 175, is one of the books he wrote. And in that book, he says there’s three methods to invoke or unite one with a day the The first method is devotion to the deity through a ceremonial invocation. reading from the the spells cookbook, if you will, from the grim wire to call the spirit flight 11. Was I’m sorry, flight 175. The argument here the SK Bane is presenting that flight 175 invoked the day the based upon the ideas of Lieber 175, uniting man to a deity. And flight 11 was the number of magic right because remember leavens the number of magic. And that was used to start this ceremony when flight 11 smashed into the tower that started this whole ceremony in play 175 was the the yoking to the day. Now besides the numbers coinciding, there’s not a lot else there. But you got to look at this from you got to make it through the next two shows. And you’re gonna see so much stuff that you’re gonna say, My God, did they do this thing? Is this real? Seems like it. I clearly don’t know. But this makes more sense to me than what the news is telling me. Maybe I’m crazy. And this is the idea overall, is the same as like the Church of Satan, psychodrama rituals do you get your mind conditioned and prepared for contact with the divine with the gods using symbolism and theatre pageantry and Libra 175 I found a copy here. And I’m going to read you from it to it because I wanted to know more like how does Libra wants me five connect with flight 175 besides the numbers, right. It talks about listen to this I’m going to read you first says this is the heart of the devotee. should be symbolically represented by that room or spot which he loves best. And the deer spot they’re in shall be the shrine of his temple is most convenient as this shrine and altar should be sequestered in woods or in a private Grove or garden, let it be protected from the profane. Now talking about the because a space in a ritual sense, the set the setting\n\nis very important. And he says it has to be a place where man loves best, and the location love best, I can leave a place more fitting than New York City, the heart of New York City at that Manhattan with the largest building in it. And like we talked about earlier, I don’t think it’s a coincidence that most movies are filmed in New York City, most of the big movies. The setting is in New York City. It also talks about how in the book talks about bush being quiet. And then the sacrifice happening in a very cryptic man. I’ll read to you and then we’ll talk in verse 44, of lever. 175 says during this practice, it is most wise that the philosophers utter no word concerning his working as if it were forbidden love that consume him. But let him answer fools according to their folly. For since he cannot conceal his love from his fellows, he was speak to them, as they may understand. And as many day these demands, sacrifice one of men, another of cattle, a third of doves, let these sacrifices be replaced by the true sacrifices in nine own heart. Yet if thou must symbolize them outwardly, for the hardness of thine heart, let thine own blood and not another’s be spilt before the altar. The exception to this rule again, I don’t care about all that much magic nerd stuff. Nevertheless, forget not that this practice is dangerous, and may cause the manifestation of evil things hostile and malicious to the great hurt. of this, it shall be understood that nothing is to be spoken, nor need anything to be spoken to him that hath wisdom to comprehend the number of this paragraph. And this sacrifice is fatal beyond all unless it be a sacrifice indeed, yet there are those who have dared and achieved their by here it is spoken of actual mutilation. such acts are abominable, and while they may bring success to his method, form an absolute bar to all for the progress and they are in any case more likely to lead into madness than to Samadhi. He indeed who purposed them is already mad. So what’s all that nonsense saying? It says the magician should utter no word about the ritual. Okay, that’s bush when he sat there quiet for eight minutes or whatever it was. Then it says that the deities demand sacrifice one of men. Let thine own blood and not another’s be spilt before the altar. Which I don’t know how that fits in. I would I read that as like, that’s like saying, you know, you would slice yourself instead of another person’s I don’t really get that. But I’m not a magician. And it says, forget not this Dain this practice is dangerous and may cause the manifestation of evil things. So there you go. They’re evoking these deities, these evil deities through that ritual. Flight 175. Flight 11. That’s the argument. Which I wish. And that’s what I want to get into with SK Bane. If I get them on the show. I don’t want to. I don’t want to commit to that yet. But I’ve got a busy month ahead of me. But that’s what I wish on tinfoil hat. We could have gone deeper into those ideas. Because I think it’s very fascinating. But I don’t really understand Crowley’s writings, as you can tell by the flowery language, it’s like, Dude, what is he saying? Is he just speaking nonsense? I don’t think so. me for having the following that he did. I can’t imagine it being pure nonsense. In the book, moving on, chapter four talks about the pet goat. And the claim is that the date he invoked is, in fact, the devil. The data from Libra 177 is the devil. So they’re evoking evil. They’re evoking the devil, whatever, right. We’ll go back to Sarasota, Florida, which has the nickname of Paradise, which SK bang goes through in the book, but he was reading the pet goat to the children, and he read it for seven full minutes after hearing that America was under attack. Remember that remember when the guy came in and whispered into his ear like America is under attack and I sat there for seven minutes. Michael Moore did a good job of critiquing that decision. seems crazy to me too. I mean, Bush says, Wow, I didn’t want to alarm the kids like, bro. Alarm the kids, what are you talking about? I mean, 20 years later, they’re traumatizing the hell out of these kids with another thing. So\n\nthat doesn’t seem like it’s a good strategy. But anyway, in the book, he’s talking about how the goat is symbolic of pan the dadey representing the devil, aka the goat of Mandy’s, aka the Baphomet. The Baphomet, of course, symbolizes the alchemical idea of nature as God. With nature’s natural duality and opposing concepts like male, female, light, dark, you get the picture. I’ve talked about the mathematics so many times on the show. But if you look them up, you’ll notice all those symbols like a male go with female brass, right? It’s symbolic of embracing the opposites. It’s kind of like when I talked about on part was a part to cocoon lini, serpent and the energy channel. The Shiva and Shakti meeting in the mind, the alchemical wedding, the sacred marriage, all these terms are suggesting the same thing. And that’s what the bath mat represents. But the story of the pet goat is a very interesting idea here. If you look at the story, it’s supposedly about an overbearing authoritarian father, with a misbehaving goat who actually saves the day. sk Bane explains the story that way, and it made me laugh he wrote, he wrote, praise the goat. Because that’s the idea here is that the rebel Angel, the rebel goat is actually the good guy here. And the father is overbearing and is a real dick. Now speaking of being a real dick, you know, I don’t trust any of these truths, right? trust but verify, I guess, is a better attitude I should have. I actually bought a copy of what is supposed to be the book that contains the pet goat. I haven’t got it in the mail yet. It’s taken the frickin slow bow. I don’t know why it’s taken so long. The book I ordered, which supposedly has the pet goat story is called storybook one reading mastery two by Elaine Bruner. sinquefield angleman. And I’m waiting for it to show up in my mailbox. So I can tell you if what SK Bane says here is true. Because I’m fact checking it. And so far everything I read in the book was like, pretty accurate. So I don’t have a reason to not believe them. But I find that curious. And I think just just out of sheer curiosity I want to know. So we’ll talk about that when I get the book in. Maybe I’ll get it before Part Four, we’ll see. But the idea here is that in the book, the tail. Now this is much like Janet Jackson, Janet Jackson, exposing her nipple at the Super Bowl, became like the most googled term in history. ever want to take a look? What was around that nipple, it was a rain of the sun. So in effect, the energy sent her way by millions or billions of people was focused on the sun. Kind of like this book, the pet goat. Everyone knows as the book bush was reading billions of minds focused on the same idea. And this idea ultimately is that the goat Lucifer sets men free from the authoritarian God which is the Gnostic fantasy. Now the Illuminati or the Freemasons, whatever you want to call them, they want to build paradise on earth. In their, their fantasy of perfecting God’s imperfect design, and in their history, Kronos or Saturn, destroyed Eden by introducing time and constraints and measurements, the second law of thermodynamics, entropy and all that time decay. And then the occultist man, through the guidance of Lucifer through the wisdom of Gnostics Gnosticism will recreate a better Eden, a real Garden of Eden through science, because science is so great. No, thank you. Thank you very much science. You play your role. That’s cool, but I don’t want to live in the world you’re creating. I mean, I don’t want to be Amish either. But you know, you know what I’m saying? Not everything they do is perfect. In fact, when I say these nerds are gonna kill us, I really mean that it’s a matter of time they’re gonna do something horrific. And we’re not going to know about it because they don’t want to tell us\n\nthe okay and then oh, then the coincidence is here, Pentagon. the Pentagon’s groundbreaking ceremony guess when that was? It was 60 years to the day of 911. It happened September 11 1941. Sure, there was Freemasons, Cornerstone setting ceremonies. Flight 77 hit the Pentagon. And the Pentagon is on the 77th meridian West it’s 77 feet tall. Anton lay lists 77 in frome names of the gods in the Royal Palace of hell. 77 is the Masonic signal for the revenge of Lamech. That’s an ancestor to hire a Biff LIBOR 77 aka LIBOR oz is called the book of the goat. And it describes the thelema manifesto where Crowley describes 77 as seven times 11, which equals 77. The magical power in perfection because the number seven represents perfected deity, God, new times that by 11, the number of magic of evil and magic and you get the number 77 which is all over his star of Babylon if you look at that logo, holy vais so much. Best quote ever that I’ve ever read is in this book says symbols don’t kill people, people with symbols, kill people love it. The Pentagon, he describes as the lock and key for the pentagram. I’m going to read your the Pentagon and the 77 go together like a lock and key. And actually this is more than a simile. A number of power combined with a symbol of power, a ceremonial vessel, numerically consecrated and filled with living sacrifices, violently penetrates into the inner sanctum of a five ring, Jumbo sized heart of a pentagram in a spewing eruption of flame glass, steel, flesh and blood. This diabolical ceremonial act was designed as a key to unlock the powers of hell, symbolically or perhaps more literally than we care to imagine, unleashing them on the denizens of Earth. So he’s arguing that much like the Twin Towers were opening up the veil. So was the attack on the Pentagon, the pentagram, the number 77. Now he rightfully so, describes flight 77 as an almost impossible maneuver. I mean, especially for the terrorist who was on record of being too stupid to fly. He did this 330 degrees downward spiral in three minutes and still hit the target dead on right. You know, I mean, he flew in, what 50 ground above 50 feet above the ground. I’ve never flown a plane. Seems like that wouldn’t be an easy thing to do without some practice, though. But yeah, that’s what we’re told to believe in. Even when they have the feds took all those surveillance videos from around the Pentagon, we still haven’t seen them. We got five frames of what they claim to be a plane could be a vessel, we don’t know. You think they would want to clear that up by now but they don’t. Makes no sense. He rightfully points out the Pentagon airspace is the most heavily monitored airspace in the entire world. Yet, they didn’t invent they didn’t evacuate this building. Even after the Twin Towers attack. They said they didn’t know it was headed that way. Really? What’s the point of all this then? What’s the point of all these systems used to monitor and survey to protect the most heavily guarded building in the entire world? How would they avoid a nuclear missile? There was an E four B surveillance plane allegedly in the skies the whole time with the call sign of you’re ready for this Venus 77 you can’t make it up. So I wonder if the number 77 was like a secret code term for the building of the Pentagon maybe. But aside from that Venus is the goddess which symbolizes the pentagram. When you look at the movement of Venus\n\nalso represented as Lucifer the morning star. can’t make this stuff up. Now chapter six, moving on. They talk about Michael Hoffman’s book, secret societies and psychological warfare, which is another good book. I haven’t finished it yet, so I can’t give him my seal of approval. I started it actually bought it on. I think I talked about this already. I bought it on Kindle. And then I got paranoid. bought the paperback also. And I talked underwear, why did I talk? I talk to you guys so much in so many different places. The people would buy my paperbacks because I sell the signed books, right? You know, I sell them on gumroad.com backslash, Isaac W. Anyway, I sell those books. And I often hear people say, I gotta have a backup copy. I already have it on Kindle. If they ever censor you, and I always thought like, whatever, you know, sounds good to me, buddy. And I always took the normie point of view of like that we’re gonna happen. But in the last year and I have my eyes have been opened. And now here I am buying the paperbacks because it’s true, like, obey those can just shut down the Kindle version. Send out the update, boom, there goes your content. paperback, you know, when they talk about burning the books and was a brave new world. or Fahrenheit 451 Fahrenheit 451 temperature which books burn I think they’re they, they knew what was coming. The matter of die. Sounds preposterous now. Anyway, we talked about Michael Hoffman’s book, written in 1989. It pretty much predicted 911 and the power of numbers. I’m going to read you from the book. from Michael Hoffman, secret societies and psychological warfare says the issue of controlling humanity with esoteric words and symbols encoded within a play. A media spectacular or a ritual is one of the most difficult for people to comprehend. Even his modern man dances to the tune of the elite managers of human behavior. He skosh with great derision at the idea the existence and operation of a technology of mass mind control emanating from the media and government. Sounds about right. And that’s what we’ve been talking about for 10 years now on this Illuminati watcher project, about mass media and entertainment. Showing us their hand in so many ways. People doubting it, thinking it’s crazy. In fact, if you if you’re on my Patreon or my rock fan, or my VIP Team, my supporter teams, I released a show in August where I went to Sirius XM studios in LA to go on the all out show with rude dude to hip hop show on shade 45 back in 2015 and they had callers calling in it’s it’s a show full of haters are mean as hell. And I was talking about my hip hop conspiracy book, which was featured in complex magazine a couple years later, right. They interviewed me and prodigy for Mobb Deep, big honor rest in peace prodigy. But anyway, the the callers thought I was crazy. And maybe they just wanted to be funny. I mean, they it’s an entertainment show. So they let the craziest people in. And dude even said it afterwards. He was like you actually had a lot of people supporting your ideas. I’m like, Yeah, I know. Soccer know what I’m saying? And but they didn’t know them and they wanted the fighters and and I would argue that if you talk to those same people today, I guarantee they’ve got a totally different change of heart. These people that thought Oh, it’s crazy the illumine Hi, you’re not? Well, we’ll see about that. But in SK enough about me SK Baynes book, Hoffman he talks about how hoffen further observes that ritual murder is mind control. Think about that. That’s a very powerful statement. ritual murder is mind control and refers to the machinery of manipulation as a Technological tyranny. So immense it is difficult to grasp is both a sight are both a physical, technological tyranny as well as a tyranny of the mind. It’s hard to, it’s hard to put your arms around this thing. That’s one thing I have learned over the years.\n\nNow, Hoffman little background is poor what he’s saying he was a reporter for The Associated Press, which I have in my notes, or it’s kinda like David Knight, he was a journalist to like allow these guys to get in the news, they see how the pieces fit together, and then they say, holy crap. In fact, I’ve had, I’m not going to name names, but there’s a person who works in the news arena, who follows me and hits me up some times. And I would argue that this person, obviously must see something too. I don’t have any good inside scopes. If this person listening is listening, I would like to get the inside scoops. If there’s a reason why this person is into this stuff. Maybe they’ve seen some we’ve all seen that clip of all the different news stations around the country repeating the same verbatim script, right? from like, what Sinclair communications or whoever owns the news. Sinclair, a name of the Knights Templar bloodlines? It’s all connected. Now curious is this ritual murder idea? ritual murder is mind control. Think about that. Think about the thing from 2020 that will never go away. Right, and like six was 6 million dead. 5 million dead. It’s a lot of dead bodies. From one thing, he’s all 3000 people dead was bad. Those rookie numbers, you got to pump those numbers up. Massive mind control. And like I always say, you know, you got to watch out for yourself here. I don’t know that. It’s a hoax, that it’s fake. That they’re inflating the numbers? I clearly don’t know. It seems to me it’s very real. So like, but either way regardless, you know, they’re using it for their ends. They will use whatever they can to get what they want. Like how the TSA still name airports 20 years later, they didn’t go away. Is the threat the same as it was in 2001 and two? Probably not. Still there though. You know, big brother takes a little bit of your privacy and security and freedom. The brother never gives it back. But when you talk about ritual murders, mind control the target is always the subconscious mind in terms of occult rituals. This is what James Selby downer was talking about another one of these oh geez in the conspiracy world. Shout out Ryan page. Who’s teach me about James Selby down and I got a couple of his books. I’m gonna read through them here. I just, it’s on the stack. And then chapter seven, moving along. Flight 93. The Lima geometria is the game here for number 93. If you think of the term do with a will so be the whole of the law. Love is the law love under will. Those are represented by the number 93. It’s shorthand for all of that. And if you read Crowley’s confessions, he says 93 is also the number of the secret word of the neophyte of AIA. That’s the Silver Star secret little society he made it a word indicating symbolically the whole course of existence. So they’re just another fun play on numbers. 93 shows up in 911 and crawleys world significantly. The number of the secret word of the initiate for his Silver Star group Silver Star we talked about a while ago. As a reference to Sirius, the sun behind the sun the real God the Gnostic God that they worship, who wants death and destruction to destroy God’s Earth and God’s creatures. That was also the flight allegedly dick cheney was going to said allegedly dick cheney approved shooting that plane down and again, so many weird anomalies with this thing. It’s crazy, but we’re not going through that. We’re gonna do a cult stuff. Okay. And then he, you know, he he talks about it. Like I said, there’s a lot we’re not going to cover it on this show. White Horse flight 85 some more croley connections, World Trade Center seven, which, you know, I guess we should talk about that. Yeah, let’s talk about that and we’re going to wrap it up. I’ll come at you and we’ll finish the book on the next show.\n\nThe footage shows building seven imploding, like a controlled demolition, just like the Twin Towers. If you remember I remember there being people panic that every building in New York was going to crumble. You remember that like it was gonna be a ripple effect when the set when building seven dropped. Now what, what SK Bane claims in here and I didn’t fact check this. But it sounds reasonable enough. Rudy Giuliani, Rudy, Rudy Giuliani, America’s mayor. He had an emergency operation center in building seven on the 23rd floor, no less the number four. Robert Anton Wilson’s idea of the law of fives. Everything is in the law of fives. And you know, the Jim Carrey movie, the number 23. Same idea, patterns. Anyway, on the 23rd floor of building seven, was the Emergency Operations Center for New York City. Even though everyone warned Giuliani not to set up that center that close to the World Trade Center. Now, on top of that, turns out there was a whole gang of diesel for diesel fuel for backup generators underneath it. And they claim that the fuel a fire started and ignited all this fuel, which I don’t know, I’m not. I’m not the guy for that. But that’s what the claim is. And it melted the trusses. Just like the jet fuel melted the steel beams, and now everything’s falling apart. And the theory is that building seven wasn’t the Emergency Operations Center to respond to 911. But instead, it was to control the events of 911. And they needed to take it down and get rid of the evidence. Because building seven is the optimal place to control all the events. If you look at Larry Silverstein, the guy that bought the the twin towers in July 2001, who got the big payout on the insurance policy? He said this, quote, ironically, weighing in apparent support of the latter notion was none other than the owner of the building. Larry Silverstein, who stated in a 2002 PBS documentary entitled America rebuilds. I remember getting a call from the or fire department commander telling me that they were not sure they were going to be able to contain the fire. And I said, we’ve had such terrible loss of life, maybe the smartest thing to do is pull it and they made that decision to pull and we want the building collapse. After two years of stonewalling, Silverstein properties finally responded to numerous questions concerning what Mr. Silverstein meant when he used the phrase pullet, which most people would assume to mean, bring down by controlled demolition. Their explanation? He meant pull the firefighters from the building. And exactly which firefighters would those be the ones that had withdrawn at 11:30am over five hours earlier. So they’re saying there were no firefighters in there. And Silverstein’s like when I said pull it, I didn’t mean a control demo, I talked about pulling the firefighters and they’re like, well, there were no firefighters First off, second off, no one uses that phrase pull it You mean pulled them because none of it makes sense. None of it makes sense. And then Banes book dogs about how building seven was also called you’re not gonna believe this. The Solomon brothers building isn’t that appropriate? right across the street from the Twin Towers, the Solomon brothers building. So think about this symbolically from the perspective of the occultist. The twin pillars, the Twin Towers, Boaz in joking word at the entrance to Solomon’s temple, the Solomon brothers building how perfect The higher Macbeth was the architect of Solomon’s temple, right in free Masonic lore, which you know, the temple was built by divine influenced and Solomon had this ring to control the spirits and black magic and all this stuff.\n\nThe Bible says Solomon temples Solomon’s temple was designed by God, but heimer Biff is referenced in occult teaching as part of the Syrian mysteries of the death and resurrection calls. So I don’t know what the truth is, I wasn’t around back then. But the idea of towers or building seven, it was built in the shape of a trapezoid with 47 floors. And in the book, he relates that to Anton lovies, order of the trapezoid, and Pythagoras theorem, the 47th problem of Euclid is really the 47th problem of Euclid. It’s the you’ve seen the symbol before this Masonic symbol of the three squares and that 345 ratio, you could it was known as the father of geometry. And it goes back to laying out foundations of buildings based on stars and finding the right angles to make a perfect square. and creating the perfect foundation to build upon the perfect creation of man using art and science, which is what they want to do, they want to lay down the perfect foundation to create the perfect society for the perfect man. And that’s what we’ll go through and the final part of our four shows on 911, where we’ll will conclude our book club of the most dangerous book 911 as a mass ritual by SK vein. We’re going to talk more about Crawley and astrology and the Statue of Liberty, I’m gonna talk some smack about Brad Meltzer. We’re gonna go into serious, pretty deep dive into serious, you’re gonna hear about how you’re not gonna believe this. But 911 in Egypt, is New Year’s Day sounds crazy. But you got to hang in there. We’re gonna talk about the monolith because that plays a role in all this Yes, the monolith from 2001 A Space Odyssey, revelation of the method, and what this whole thing is all about from the perspective of cult of occult rituals. Thank you for joining me thus far. Look, if you’d like to show, here’s what you can do. I always ask you to do things, leave a review. It’s free. And it helps the show out. What better, what better thing we can do for each other. Drop a review. And in fact, on top of that, I’m gonna read them not on air, but I’m going to read all of them on October 31. And then I’m not reading them again. I just got to stay fresh in the algorithm. Because they’re putting out Have you ever seen there’s like other shows? Like there’s a show called conspiracy theories. And the host or shells? Okay, I’ll say it. I’ll start a little truth or drama. Like every they talk about every conspiracy, but they won’t commit to any of them. And I get it like I don’t commit to every conspiracy either. But like they don’t believe in nothing. They just tell the mainstream narrative and like, Well, you see, Snopes says that this couldn’t have happened like Oh, really. They’re just they’re just and that’s why they get to the top of the algorithm. That’s why they show first when you search for conspiracy theories podcast. But there’s one way we can fight that. That’s what’s good reviews, if you leave it if you drop a five so don’t drop a one star, okay, you’re just gonna hurt the cause. If you have a five star, you can say mean things about me. I’ll read it. But negative five star okay. That’s what you can do for me. Until next time Till we meet again. Well, we’ll hit it with part four of our deep dive. 911 So until then, stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "9/11 Conspiracy Theories Part 3: Most Dangerous Book in the World- 9/11 as a Mass Ritual Book Club Week 1 - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we continue our journey of decoding the occult symbolism and conspiracy theories around 9/11! On this special series of four shows, we’ll commemorate the 20th anniversary of the biggest PsyOp of occult symbolism EVER! Part 3 begins our book club deep dive into SK Bain’s book […]", "url": "https://illuminatiwatcher.com/9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1/", "site_name": "IlluminatiWatcher", "article:published_time": "2021-09-20T13:39:28+00:00", "article:modified_time": "2021-09-03T13:42:24+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/09/CTAUC-911-Part-3.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["9/11 symbolism", "911 meaning", "9/11 meaning", "911 conspiracy podcast", "9/11 conspiracy theory", "9/11 conspiracy podcast", "911 symbolism", "9/11 illuminati"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://wp.me/p2ijVF-b8H", "https://Rokfin.com/Creator/Isaac", "https://Patreon.com/IlluminatiWatcher", "https://illuminatiwatcher.com/members-section/", "https://www.instagram.com/isaacweishaupt/", "https://amzn.to/3j3UtZz", "https://illuminatiwatcher.com/how-to-get-free-books/", "https://gumroad.com/isaacw", "https://illuminatiwatcher.com/members-section/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/46361373", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/start/", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://illuminatiwatcher.com/members-section/", "https://www.rokfin.com/creator/isaac", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://illuminatiwatcher.com/members-section/", "https://illuminatiwatcher.com/9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1/?share=twitter", "https://illuminatiwatcher.com/9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%209%2F11%20Conspiracy%20Theories%20Part%203%3A%20Most%20Dangerous%20Book%20in%20the%20World-%209%2F11%20as%20a%20Mass%20Ritual%20Book%20Club%20Week%201&body=https%3A%2F%2Filluminatiwatcher.com%2F9-11-conspiracy-theories-part-3-most-dangerous-book-in-the-world-9-11-as-a-mass-ritual-book-club-week-1%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Anthony", "Isaac Weishaupt"], "publish_date": "2021-09-20T13:39:28+00:00"}