{"result_id": "165036", "URL": "https://illuminatiwatcher.com/the-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more/", "timestamp": "2023-04-25 15:36:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/the-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "The Great Mask Debate of 2020: Occult Ritual Symbolism, Health Pros and Cons & More!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we’ll explore the sides of the great mask debate of 2020! I’ll ramble on about the occult ritual elements, the health studies, review the claims made by both sides and give you my opinion (*I’m not a medical expert and this is not medical advice)!\n• Don’t forget that I love you- no matter what choice you make on this one\n• Truthstream Media’s mask video (*good review of occult symbolism of the ritual):\n• CDC Study from May 2020 says masks are ineffective against influenza (but also COULD be effective against other diseases?…): §\n\nThis show is brought to you by our sponsors:\n• CONNECT WITH YOUR HAPPINESS AGAIN! Get 10% off your first month: BetterHelp.com/IlluminatiWatcher\n\nWant to advertise/sponsor our show?\n\n We have partnered with AdvertiseCast to handle our advertising/sponsorship requests. They’re great to work with and will help you advertise on our show. Please email sales@advertisecast.com or click the link below to get started. https://www.advertisecast.com/ConspiracyTheoriesandUnpopularCulture\n\n\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “The Great Mask Debate of 2020: Occult Ritual Symbolism, Health Pros and Cons & More!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nI don’t wear a mask for the same reason I don’t underwear, underwear, things got to breathe.\n\nThank you for your comments, man. And they went to\n\nwonderful breeding system out the door. You’re all\n\nturning your backs on it In the beginning, God for man out of the earth and breathed His breath in him, and he became a living\n\nWhere do you derive the authority to regulate human breathing? What you say is the political dogma that they’re trying to shove down our throats on every commercial and every store and it’s disgusting.\n\nEvery single one of you that are obeying the devil’s laws are going to be arrested and you doctor are going to be arrested for crimes against humanity.\n\nLet me ask you all do you believe your God? Do you believe you can override God’s divine plan for our lives, you’re removing our freedoms and stomping on our constitutional rights by these communist dictatorship borders or laws you want to mandate.\n\nWe will get together and do a citizen’s arrest on every single human being, that goes against the freedom of choice. Okay? You cannot mandate you literally cannot mandate somebody to wear a mask knowing that that mask is killing people. It literally is killing people.\n\nEvery single one of you have a smirk behind that little mask, but every single one of you are going to get punished by God. You cannot you cannot escape God. You cannot Escape god, I’m gonna say that again. You cannot escape God not even with the math or six feet. Okay? Six feet, like I said before is military protocol you’re trying to get people to train them. So when the cameras The 5g comes out what they’re gonna they’re gonna scan everybody we got to get scammed. We got to get temperature the kids have to go to school with masks. Are you insane? Are you crazy? I think all of you should be in a psych ward right the heck now\n\nmuch of our communication is nonverbal, which includes facial expressions, gestures displayed and the physical distance between the communicators. How will young children be able to know who the dangerous deviants are like pedophiles and people in the human sex trafficking,\n\nyou did not listen to we the people. I would die for that country I would die for the Constitution in your wife. You displace me. You know why you’ve been nervous, the way the people you make a decision.\n\nI haven’t worn a mask yet? I’m not wearing it today. Besides, despite what you guys do up here today, I’m not wearing one tomorrow. I was born free, I will stay free. My rights come from God, not from you I’m not wearing, you’re gonna have to hold me down and put it on me. We are a nation of shared values of freedom, liberty, equality, we are home of the free land of the brave. This is America as someone else spoke, this is not Cuba. We are not in a communist nation.\n\nBut our masks really effective. Because one of the things that the CDC was saying was that you should really only wear a mask if you’re treating a person with COVID. Yes, except that we can effectively know that what they were really, I don’t even want to give them credit for really saying the motivation for saying that nonsense was that they were trying to preserve masks for people who needed it most. That was what Fauci said. So they basically lied, they lied to us flat out which some some of us were not some of us were shouting and saying this is garbage. Advice. Yeah. And you know, your question is do masks really work? masks work. When both parties wear them. They work really well. So, you know, and I don’t know why we are pushing this madness of masks that scream medical. Right. So one of the things you know, bank robber, yeah, man, you’re an old school banker.\n\nOh, my apologies. I was wearing my mask because I just got back from a full day of being a good person. I love my mask, because it’s a simple yet effective way to display my righteousness. Am I concerned that two children in China drop dead because they were forced to wear masks in gym class? Nope. Am I concerned that we’re creating a generation of children who will be socially awkward and conditioned to fear their fellow man? No. Am I concerned that I’m contributing to an impending socialist technocracy that will enslave the global population out even a little bit? Am I concerned that my mask is symbolic of my compliance of social conditioning that will affect lead to the forced vaccination of every man, woman and child on planet Earth. Not a chance and why am I not concerned? You asked. I’m not concerned because I decided a long time ago that shallow, insignificant gestures are a much easier way to showcase my morality than actually being moral. Because in order to be a real good person, I got to stand up to a real bad person and I don’t like standing up to or for anything, I decided that it’s much easier to trick my own mind into thinking compliance is a virtue instead of what compliance actually is cowardice. I prefer to float through life completely ignorant to the fact that every socialist takeover has always begun in the exact same way with government overreach, public shaming, censorship and a toilet paper shortage. Don’t believe me? Google toilet paper shortage and communist Russia did you think you’re having a unique experience? I prefer to pretend history never repeats itself so that I can stand by and turn a blind eye every time history repeats itself. I prefer to call anyone who speaks up fights back or stands their ground a lunatic or a conspiracy theorist, so that I don’t feel obligated to do my own research research takes away from me time. And lastly, I prefer to put on my mask and sand among a sea of masks so that I never have to be seen the free or reveal the deep dark shadows that lurk within me.\n\nHere we are going back to that same old well go with conspiracies part 1 billion here. I think the last time I did a show, where we talked about COVID conspiracies was back in June, back in June, talked about the COVID spiritual war and the ritual of the bath omae the bathroom it with the letter written from the Vatican to President Trump with the coded language of solve at coagula because that my friends seems to be what this plan demick is about. The previous episode We went and I went through, there’s a whole slew of COVID conspiracies, because I knew back when this thing launched back in Olympia looked at my notes. Let me look through my notes. Back in the day, I don’t know back in March, right back in March is when it really fired up. That this was going to be a long standing sequence of shows. So this is technically code conspiracies Part Eight. And we’re going to talk about the great mask debate. Don’t say that too fast. You’ll get censored. The great masturbate? Yes. Yes. We’re going to talk about the pros, the cons, the cult, ritual elements of this whole thing. And we’ll talk about my dumb opinion as if it mattered, because you know, I’m not a doctor. I’m not a medical expert. Therefore, this is not medical advice. Don’t listen to me. I’m telling you right now. Don’t listen to me. Same thing I told you on the vaccine shows. If you haven’t listened to my vaccine shows you better go do that. You gotta hurry. still get the free ebook version of it available. gumroad.com like bubblegum gumroad.com backslash Isaac W. Get the free book banned from Amazon, by the way. Because they see I’m not a medical expert. But somehow Bill Gates is allowed to go on every channel and talk about it. Hmm. He’s not a medical expert, either the last I checked, which is why everyone’s coming over to the truth or community because it’s clear to everyone that none of these institutions, these sacred cows are telling us the truth. That’s what we do know. Yeah, we’re gonna we’re gonna go through the whole thing from the top to the bottom, looking at all of the points and counter points, and I mean, not all of them. This is just a handful of them. In fact, I’ve been preparing for this show for a while. In weeks and weeks, waiting for a complete understanding and a firm position for me to say, this is what I believe you should do. But to me, it’s clear that’s not going to happen. I’m very sorry. But I just said, You know why we just got to publish this thing. Before you know it, everyone’s gonna get injected with the RNA mutant vaccine, and this will be over. But I don’t think it’s going to be over. They keep telling you, it’s going to be the new normal. And they’re full of it. I’m telling you right now they’re full of it. They want to say, Oh, this is the new normal, never shake hands will never be within six feet of each other. They’re showing it to you on commercials and the VMAs. They got people, you know, social distancing from each other. And they want to pretend like this is the new normal like this is gonna last forever. And human beings are not that way. We are social creatures. I tell you right now, I’ve not been doing any of that stuff and hanging out Hang out with the friends hanging out at the CrossFit. Hang with the road dogs. And, you know, but before we start, before we start, let me let me talk to you one on one here. Listen up, look in my eyes. I love you. And we might disagree here on some levels. And that’s okay because that’s what this is about. This is what America is about. So democracy is about we have to debate disagree and respect each other’s opinions. And I know my truth or people already know where you stand. I know a large large chunk you are super anti mask, and that’s okay. debate and disagreement, these are all fine. They want you to believe they’re not fine. The liberals want to tell you it’s problematic to say things and do things. And, you know, anyways, you’re obviously able to hear tough things. That’s why you’re listening to the show. You are Tell you Beyonce is in the Illuminati doing the sacrifice to the, to the gods, you’re able to listen to some crazy stuff. I don’t want anyone to feel triggered during any part of this. This is just me exploring. I’m going to talk mostly about the facts behind it. And then I’ll tell you, I’ll sprinkle my opinion in there. Let’s go. And 90% of this analysis was written before August 5 2020. And then something happened on the Twitter, which you can follow me at Illuminati eyes. On the Twitter, my man Jay Dyer, he retweeted a CDC webpage and it blew my mind. I didn’t believe it was real. I thought it was fake. Because again, hats off to the truth. There’s the truth or they’re always right. I’ve said this in the past for many years. I’ve also said that the nerds are going to kill us for many years and both statements more prophetic than ever this year. So let’s just go through this on a sort of chronological basis here. I don’t want to jump to any conclusions. So why Let’s go. So I went on the socials, many, many moons ago, this point, did like a six minute video post on the Instagram. And here’s the thing. here’s the here’s kind of one of the bottom line takeaways. One of the themes I see from this, these nerds don’t know, the politicians, the scientist, they don’t know they’ve been and here’s the problem with that for years and forever. They’ve been trying to tell you look, you need to believe in us, we know the truth and we know what’s good for you. And this year, we found out none of that is true. They don’t frickin know. And it’s this weird power thing. And I know this from working in jobs where I’ve had to manage programs and you know, provide presentations about statuses of stuff. When you’re in a position of leadership, it’s unacceptable to say you don’t know. I’ve literally been chastised for saying those words for saying, I’m not really sure, let me get back to you on that. That’s unacceptable. You can’t say that you lose power right or wrong. That’s the way it is. I know this from firsthand experience, I’ve seen it I’ve been directed. I’ve been told about this. And to me, that’s unacceptable. do say you don’t know something. I think you should be able to say that. And science and the politicians, they want you to believe in this power dynamic. They want you to put your trust and then like they know what’s best for you. Look at the look at the status of our country. mentally, physically, we’re the sickest people in the whole world. That’s why everyone’s dying from this. Whatever you want to believe about this, the Wu Han flew the wounded flew, cooked up in the lab, by the nerds, through gain of function testing. If you haven’t listened to my COVID conspiracy shows, I’d advise you to do that as well. They’re going to take those down eventually. Because we talked about how they were studying gain of function testing, where they accelerate the evolution of viruses in the labs, from animals to humans, which is what this probably was, we don’t know because they stopped looking into it, apparently. And we banned it and then we reverse that ban just a couple years ago. Because why not? Right? Because these nerds want to do this stuff. How about you just leave it alone, buddy? Yeah, this and that’s the bottom sort of foundation of this argument is there’s this idea that science is the hundred percent truth, and they can never be wrong. And I’m telling you, I’m here to tell you I’ve got a Masters of Science. It they can be wrong. They can be Wrong. It’s a bill of goods, they’re they’re selling us. But everyone sees the reality of it. And that’s because here’s the problem they’re not willing to admit it’s an art. Science is an art. Right? It’s true. Which means there’s a little bit of leeway. There’s only a couple of real universal laws so everything else is a theory because they can’t prove it definitively on you know, every planet and every Solar System nothing’s 100% they want you to believe that I mean, look, I got this look at the history of stuff like I use this example sometimes the guy the sports medicine doctor that came up with rest ice compression elevation rice, you know if you ever been injured, Dr. been told to go home and rice, rest, ice compression elevation. Well, guess what? He came out just a couple years ago. I was like, You know what, I’m Totally wrong. It should be heat. They don’t know they don’t know. And you could go on and on with studies and nutrition science and everything that’s flip flopped entirely. And but they want to so desperately to believe, to put our trust and faith in them and give them power. When you my friend should be the one empowered. You need to and you’re doing this. I’m not here to chastise you. You should be doing the research and understanding of how to take care of yourself. You know, this is very, this is where I get put on my Republican hand, which doesn’t happen too often. self sufficiency, right? Protect your home, protect your body, protect your family. You got to you got to do that. Because the fantasy is that you want to give up all this power to people who are the experts and they’ve the time to study these things, and they know what’s best for you. That’s the fantasy. They don’t. They’re drawn into money and the oligarchy In the corporations and the corporate interests they do not have your best interests at heart you want to believe that because you’re like, well Damn, I don’t have the time to research this stuff. I’m just going to trust this doctor. He knows what’s going on. Yeah, well look at the fines GlaxoSmithKline had to pay like five bazillion dollars because they were taking these doctors on stripper cruise ships and stuff, getting their torque on don’t trust the torque and doctor right? They don’t know what’s good for you. They wants to believe in science and you know, because that’s part of the last part of the new religion my friends that’s why I talk about in Use Your Illusion one. That’s the new religion, aliens and science is the end all be all because they want to destroy religion. They want to implement this perennialism this universal consciousness stuff which has elements of truth and I’m not here to say every new age element is wrong or quantum studies are wrong. There’s some good ideas that fall out from that. You read you surely you’re reading usually illusion one and where we talk about quantum entanglement that’s how the aliens get here. Now, here’s and here’s another kicker. Here’s another foundational element of this whole thing. We’re supposed to believe that the scientists and these nerds and these doctors and these think tanks, never studied masks. We did a show back in January, about event two one if you remember. Because I’ve been I’ve been your I’ve been your guiding force this whole time. You’re getting hand back in January. What were you doing? Were you thinking about COVID? I was thinking about COVID and Bill Gates back in January. Because the truth community we see the writing on the wall and that’s why you got to stick with us. That’s why we’re the winners here. We’re winning so you know what Trump was right. You know, also tired of winning this year. No, that sounds conceited. I’m very sorry. But the truth is back in January, I was talking about event tool one, which was this giant study. where, you know, they coordinate lots of people with lots of resources. They study all these hypotheticals about what would happen if a pandemic hit. And almost to the tee there, you know, they’ll say like, well, this, this bad virus jumps to a pig and then jumps to human and crosses the world because we’re a globally connected society now. And, and they went through this whole simulation. And we’re led to believe that at all that and in their study the supply chains and what happens to this and that and that mass casualties in the hospital systems and all this ins and outs. And we’re led to believe they never studied what to do with the mask situation as the most basic fundamental thing we can all do, should a pandemic strike. They didn’t bother to see what the average person Could do when a pandemic hits. We’ve had movies on the subject, they’ve done studies and all this crap. They never bothered to say, Well, if a virus hits for respiratory virus hits, why don’t we just tell people to wear bandanas? Everyone’s got, you know, a shirt or something at their house. That’s insane. And that’s what and that’s what this is all about this year is all about chaos. They want you to feel the chaos because they want you on some levels to burn it all down. And there’s some competing ideas here, right. And I’ll probably cover that in a different show. When you look at traditionalism, listen to my episode I did with I interviewed Professor Ben Tito bomb. Talk about Steve Bannon, who ran the 2016 campaign for president Trump where they were calling him the chaos candidate because that’s what this is all about. It’s all about massive amounts of chaos. And I and I see the hypocritical element Here I’m telling you the beginning Hey, you shouldn’t trust them without doing your own research. I’m not saying let’s burn it all down though that’s what they want. They want you to burn it all down say You know what? I’m trust none of these suckers we need anarchie you know what better yet we need authoritarianism we need the one man who knows how to handle all these creeps and thief’s? These three more thieves anyway. But we’re not going to get on that tangent today. We don’t have for that. Dr. Stephen ham was asked why the health officials change their tune on the mask since this started because you were called that’s where this started out. They said back in March. No, no don’t wear any masks. Don’t do it. Don’t don’t wear the mask. And then fast forward to like may and then totally flip flop 280 degrees. Even the US Attorney General Rola What do you call it? Surgeon General said the same thing. So there’s this other doctor has asked why they change their tune. He said, Well, our knowledge of the virus is only six months old. I mean, bull crap, right? Who believes this? It’s the current. It’s a coronavirus, a class of viruses we’ve had before. They know already. They act like they don’t know anything. And it’s like, well, and here’s my argument to begin with. Because I traveled back in March, the first week of March I traveled and I was looking around online I was like, should I wear a mask? Because I had masks for promoting the art I got like allergies, right? Like a real nerd. The evolutionary mother guy is trying to kill me. So I wear a mask right and I had them had a 95 mask. Can you believe that and that crazy. And I thought, well, if I’m flying on this plane, and there’s this monster will have flu going around and also put a mask on right? And I was looking it up and they were like, No, no, no, don’t wear the mask. Like, if you guys I’m taking a mask. I wore a mask on the plane, and people thought I was a weirdo. I thought I was a weirdo too. That was the first week of March. And then I came back and guess what happened? Guess what happened? I got sick. You remember the story? You heard me on the COVID conspiracies, shows? Yeah, I got sick. watching the news. President saying you want testing you can get a test. Anyone wants to test gets test. Well guess what I wanted to test I called. And they were like waiting. I know test, buddy. And I’m like, but but the corporate corporate America is coming to save us. I thought. I’m watching the CEOs of target and Walmart and Walgreens. And they’re on the TV and they’re saying that they are going to appeal. I could drive up and no test me. Lies. They’re all lies. No one’s here to save you. In fact, all through all the gain of function and the funding we sent over to that bio lab in China. I would argue the opposite. They’re here to kill us. My apologies is more of a rant show. Yet got that yet. I got a lot of points written down and there’s no coherent flow to it. Very sorry, I usually do better at putting a flow together. But this is literally you’re watching my thoughts over a chronological time period here. So, this doctor is like, well, this is a new virus. I don’t know. And I’m like, Dude, this a coronavirus? What are you talking about? This isn’t new. Not to mention if we were taking precautions of shutting down the economy, why didn’t we start with the masks? Why don’t we start with the mask first? Right. When I was in Aisle station in South Korea, I remember back in 2001 I seen Koreans walking around with these masks all the time. And I remember asking someone you know, this is back in 2001. You just asked your old battle buddy there Hey, why do you wear the mask and they were like daughter or her they all got tuberculosis. That’s what I was. That’s what I recall. They were wearing the mask back then. And I was like, Oh, it’s kind of weird. really stood out was strange to me. But that’s a very compliant society over there in the in what’s the right what’s the politically correct term here in the Asian countries that’s why arguably why Japan did so great because they are very compliant and they messed up immediately it’s part of their culture. Oh, and by the way, and not to mention when the math when they first put out the requirement to wear the mask in public I remember reading all the truth is not everybody complaining, talking about all man people are going to pass out in their cars, and you’re not going to get enough oxygen and people running the co2 test with their mask on about God, you’re gonna die. You’re gonna die. And like I’m here today that was bullshit, okay? Because in that same country in South Korea, we did a bunch of we did Like with a call exercises every like two months, and you basically you prepare for war because like the North Koreans aren’t playing around over there like they’re ready to do it. So you would have to wear what they call mopp gear mission oriented protective. Something I don’t remember. It’s called mopp gear and you would wear basically, you’d cover everything head to toe sealed off for because they dropped like nerve gas or something right. And this include a big old, gnarly gas mask. fully sealed, fully sealed, there’s no air coming into your body whatsoever. And I wear these for hours and hours and hours. I work a 21 hour shift once. Okay. And I’m here to tell ya, even in the high heat of summer and the humidity, even run around moving bombs with all this crap on covered head to toe as the anybody pass out. Okay. You can’t wear a little paper mask or bandana without passing out, maybe you should die. I’m just kidding. Just kidding. Some people have real issues. And that’s something we’re gonna talk about a little bit later. Some people have real issues wearing the mask. So people have genuine respiratory issues, which is, you know, in the military, the, the we those kinds of people out you’re not allowed to enlisted, you got medical problems. And that’s probably why right. So I’m not saying everyone should be able to wear a mask, but I’m saying the, if the regular average person is worried off, I put this, this paper mask on, I’m gonna pass out. Standing up, I’m not going to get enough oxygen. I’m not really okay, that’s a bit of hype, hyperbolic truth or stuff going on. So that doesn’t really fit either. Right. You’re fine to walk into a grocery store for 20 minutes with a frickin mask on right. And we’re more concerned about our rights being trampled on. Here in America, that’s what they’re that’s what the big fight back is on the masks. But there’s a principle called the other regarding, basically, if you want to talk about protecting rights, there’s this idea that your actions affect me and my health. So if you don’t want to wear a mask, you might get me sick. You’ve now infringed upon my freedoms. Well that saw these right fighters out there talking about their freedom. Well, and and there’s arguments of like, well, how far do we take this? Do we say, Well, I shouldn’t wear seatbelt either. There’s no requirement I should have to do this is my my own body my choice. I mean, you can go back and forth on these topics all day long. And it’s been about going back and forth. Look at our look at our leaders. Look, old Fauci. He lied to us. They all said that it doesn’t help the mass don’t help and they always And then now they’re saying, well, we were just trying to prevent hoarding of mask. It’s like, Well, why don’t you just tell us the truth then dude? Because guess what, I had some in 95 in my garage. I wasn’t buying them on Amazon and hoarding them. You could have told me the truth and said, Yeah, you should wear masks if you have them. Please don’t buy any because the medical professionals need it. coulda said that he couldn’t tell us the truth. In their defense, and then their defense. We in America here we’re not to rational people will be hoarding so I don’t know what the right answer is there. I prefer the truth. But the masses are pretty stupid. So I don’t know what the right answer is. They’re the the Surgeon General lied to us. The CDC, they lied to us, the World Health Organization, they lied to us by the masks. All of them did. Which is why everyone comes over to the truth or community because they’re like, well, these suckers are lying to us. And the truth is here we’re missing the clear guidance. All these people we trust, they’re letting us down. And it’s either because they’re incompetent, which I don’t know if I believe that I mean, look at Dr. Fauci This guy’s a doctor, right? He’s been around a while? Or is it done on purpose maybe? Is it consciousness, manifesting fields of energy, creating the path to the new world order? That’s what I think this all is. And I go, I go back and forth on that whole idea of Oh, this is a plan demick or not. And I’ll tell you right now, currently, my stance today This was a plan demmick I think the virus is real. However, I think they are using this to create the new world order. I believe that I believe they’re going to push us into the alien religion too. But we’ll talk a bit about that and the conclusion now 2009 cnn wrote a piece About the h1 n one swine flu if you remember that one that was the big scary world killer back then. And we didn’t do nothing about that. We didn’t mask up. We didn’t quarantine. I don’t remember them talking about washing hands. I do remember being concerned about it though. When I read you from their 2009 cnn article, print quote, a preliminary report suggesting that in 95 respirators filtering devices worn over the mouth and nose, protect against swine flu better than surgical facemasks, seems to be incorrect. In fact, surgical face masks which are cheaper and easier to wear, maybe just as good as and 95 respirators. At the very least, researchers can’t prove that one is better than the other. It’s the latest wrinkle in the continuing debate over how to protect healthcare workers from the h1 and one virus also known as swine flu. So here’s the thing again, going back to the earlier point, we’ve been sending these nerds millions and millions of dollars in all these labs and they’re like, I know what we’ll do. We’ll we’ll speed up the evolution of viruses and make a jump and see what happens if the deadly virus gets unleashed in the public. And it’s like, how about you just maybe do a mass study to see if this stuff works? They’re idiots. These nerds are gonna kill us. Every one of us. Hopefully the light gets them first. Hopefully they pass out in our little lab coats. Have you seen the more the mural from the Denver International Airport. There’s kids around the whole world and they’re wearing masks by hand. But the it was supposedly because this is going around a while ago. Supposedly a 1985 painting about coronaviruses because again, I support the idea Did viruses exist? This is real. I believe it’s real. I believe viruses exist. I guess I believe in germ theory. I don’t know, I’m not a doctor, I’m not a medical. I haven’t combed through this literature to that level. I mean, I guess you could go into like this whole Flat Earth kind of, well, I don’t think germs exist mode. Good, I guess I don’t know. And I posted it on Twitter. But yeah, there was this painting, and it shows the case with the masses by coronaviruses. Now, those n 95 masks, that there’s an argument that they don’t work, and it says that, and here’s why did I did a little research on the product page, it says that they filter down to 300 nanometers particles, right? But the COVID is only 125 nanometers. So reading that you would say well, it doesn’t do anything and then 95 is that uncomfortable in that you strap around real tight you get fitted for it’s a paper mask and little square on the front. But the deal is that the COVID particles and this is why it’s tricky when you’re listening to truth is because we’re not we don’t understand what we’re reading necessarily because we’re not in the medical field. But when I read that, I thought, Oh, well Illuminae confirm 125 nanometers is smaller than 300 nanometers. So these mass do nothing. But the truth is, you got to you got to dig deeper, you got to understand, you got to let the listener on the nerves a little bit. But the deal is that the covid particles, they attach themselves to larger particles like a booger COVID COVID attaches up to a booger, which is larger than 300 nanometers. So then 95 would filter out many of the particles. So that’s another theory you will see when you research this is that the particle size but that’s not necessarily truth. Another argument people say, Well, these mass these are all politicized. This is communism. And, you know, this is why the democrats suck. They’re the worst. It feels like because it because look what they did to Bernie, right? Because they did to Bernie in 2016. And then again in 2020. They’re manipulating everything for Old Joe Biden to get in there. Which is what people think this whole thing is cooked up by the Democrats, the whole thing, the virus everything. And Joe Rogan, if you recall, he was threatened to get canceled because he was he released the show with Brett Weinstein. And they played some clip where they were laughing at some crude sexual comments by Joey Diaz, like 10 years ago. But anyway, the problem was is that he was talking bad about Biden and they were trying to get them cancelled through some old clips like they got blackmail on everybody, you know. In fact, in that episode, he talks about that game of function testing. And it seems to be where the COVID originated in the lab. And that there was a strong possibility that the virus was enhanced in the lab and when and you’ll notice they don’t really talk about that kind of stuff much. Now, let’s see, what else do we got here? Okay, I got some pros and cons. So the pros, these are like generalities. Okay, so the pros, and we’re going to get to the occult symbolism behind all this. That’s the fun part. I’m just saving the best for the last year. The pros, well, you know, ideally wearing the mask and minimizes your disease transfer. Because the idea is that people are asymptomatic. They have no symptoms. They don’t realize they have it and they’re exhaling the virus, okay. And they’ve been subscribed to this theory in the Asian countries for many years. But our Western culture is not used to this. We think it’s bizarre, and it’s hard for us to Get behind. But then some people say that well, the asymptomatic they’re not shedding the virus that hard and it doesn’t really transfer doesn’t really matter. But, you know, I would argue that people who are sick, even people that are actually sick, they still go out. It sounds crazy, right? You’re like who could be that rude? I’m telling you. The masses are stupid. their mouth breathers and they’ll go out. You got to give them a cover up that breathe and mouth. And I’ll point to a friend of mine. She works in the medical field. She says that they do COVID testing. They’ll find they’ll give someone the results and tell them they’re positive. And they will literally all the time. See those same people drive right across the street to the grocery store to stock up before they go home and quarantine. So the asymptomatic argument I’m telling is the symptomatic idiots to So, and and to, you know, right out of the words of the President, what do you got to lose? What have you got to lose put the mask on\n\nif you believe in COVID\n\nI mean, another option is we could sit here and try to study hydrochloric wind studies and decipher if studies are fraudulent, which requires a PhD to understand what you’re reading on these studies. Or another option do we just sit at home we can quarantine for 10 months, become depressed, destroy the economy, wait for this ball gates mega weird vaccine. Or we could just put the mask on and try to prevent ourselves from getting it. That’s the pros, right? That’s like that. And that’s kind of what I hang my hat on. Like I believe that the mask could provide more freedom. Ultimately, in the end, that’s why I’m like, ultimately, like I’m more on teen mask than non, the non will we’ll come back to that. And the cons are a long list of supposedly ideas. They say, well, these masshole germs and these masks, they make people sick because of low oxygen and they’ll cite, you know, hypoxia hypercapnia. You know, people re breathing their co2 and, and maybe, right, I don’t know, maybe, maybe there’s some dangers there. But I’m telling you, I wore this frickin gas mask for hours and hours and hours. And I never had problems. And in some of those videos, you’ll see people like with the co2 device up to their face, and they’re like CC. Well, they’re directly exhaling onto the sensor. And yes, there’s co2 pumping out of your mouth. And those man all these masks, they don’t hold they don’t seal in 100% right. They’re letting out some particles but the idea is that you block the spit you block the spit everyone spits out have you know this I’ve noticed it because I’ve seen at the gym I’ve seen the the sun comes through and like it blows up if you can see when people talk their spit coming out of their mouth all the time like damn, spin this mug is mF or spin in fact funny story I was at the bar because I live in Utah right we don’t the mass thing isn’t I people wire on but like I think in general people new dawn too scared of COVID not to say that like you shouldn’t be scared of COVID I mean, that sounds like some bravado toxic masculinity dog. But I’m just saying in general, like things are fairly normal out here in Utah. And I was at the bar, no mask, right. So next time Buddy, he’s drunk. I was designated driver, like a good boy. And he’s, he’s talking to me about I don’t know what you know, drunk talk. And he’s, he’s spitting. He’s spitting on my face and spit lands on my lip and I said, Well, I hope he doesn’t have COVID because now I just got it turns out, he didn’t have, I guess I don’t know. Or maybe I’m asymptomatic. Who knows? Who knows? You don’t know where I’ve been Lou. Okay, so and then the cons. Oh, yeah. So they’re talking about all these masks. They’re gonna make people rebury their co2 and then die standing up, I guess and people are going to wreck cars. We’re going to have a society full of crash perverts from like the movie crash people or people are crashing and having sex. Have you seen that movie? generate the book here so I can do a film analysis on it. Like there was some guy in New Jersey the war the end 95 for hours on passed out drive and it was like dude, why are people wearing the mask when they’re driving? Why aren’t people in the mass when are walking by themselves? I don’t I don’t get this Okay. And then there’s all these weird sort of I can’t breathe connections with the George Floyd thing. People saying all you get nausea, people complaining they’re getting lightheaded and nausea I mean maybe right I think some people have breathing problems some people have legitimate problems with a mask so like no I don’t think you should do 100% mandate you know the Utah government they have there’s a couple ways you can look at this right Utah government they’re generally like that’s up to the city’s it’s up to the corporation’s to decide whether or not they should have mast on because I don’t know if it really helps to, like mandate it. Because I feel like maybe that makes people more mad because in our country, like our freedoms are so important to us. Like and I’ll come back to The conclusion I don’t want to keep rambling about my stance on it, like I get it, I get how like, they kind of don’t don’t really work. Some levels of mass don’t work. They kind of work, right? They kind of work a little bit, they have to work a little bit. They keep the spit off your face, right? It keeps you from spin on someone else. That’s the level that I subscribed to the mask. And you know what? I want to be respectful of other human beings. I love my people. I love my human beings, even the mouth breathers and like, I want to look respectful. I want to you know, I’m very based here. I’m trying to, I’m trying to show that I care, right? Because I feel like now when you don’t wear the mask, that’s a lot and they’re trying to do gang warfare on us. Right? You got the people that wear the mask and people that don’t and that the the never maskers that’s like your Trump love in selfish kind of auto travel on my freedoms guy. And that’s what that whether or not that’s you. That’s what people think. And then you got the mass people and those are, you know, I view the master was like, Well, you know, they’re just concerned and they just want to get through this and we don’t want to we don’t want to shut the economy down again and we’re just trying to be careful. But the the truck the never masters look at the people with the mask and say well look at these hkex these cogs bound down to the New World Order. And that’s the truth of community. That’s probably you. That’s probably you, statistically, my listeners, my dear friends that I said earlier that I love you, it’s probably you. You probably think I’m a cook, because I a beta cook because I wear my mask. And I get that I get that opinion, but like I’d rather be a beta cook and show that I love my fellow man and not force the hand of my oppressor to mandate it as a law for me to wear the mask. Because you know what our governor did, he said I want you guys to wear the masks. And that’s kind of a weak leadership thing, but I prefer weak Leadership over strong authoritarian leadership. So I like that, because he’s like, Look, I want you to wear the mask, I’m not gonna mandate it just do the right thing. And like, as long as most of us wear the mask and don’t make a big deal out of it, he’s not going to come down with the iron fist. Like some of these more liberal states are experiencing nanny state stuff, telling you what’s best for you when they don’t even know. See as a complex, it’s a complicated response. But yeah, that’s in general, I’d put the mask on out of respect for other human beings and to prevent the, the Iron Fist from dropping to mandate it. And that’s, you know, my experience is different from everyone else’s. And I understand both viewpoints I get it. So we do have to be careful about our rights and freedoms because they are stripping them away. And I do think this was all sort of planned out to take us down the path of New World Order which takes us to the other country. On submission oppression. They’re saying this is a sign of submissiveness you’re bowing down to the oppression if you wear the mask. Which is ironic, because isn’t the same? Is this the same truth the community wearing the guy Fox masses? Right? The anonymous masks? Didn’t they voluntarily wear masks for many, many years? It’d be careful with the truth or community because it’s a lot of sort of jaded, anti conformist types, which is me, right? I’m right there with you. I’m an anti conformist. Just saying you gotta be careful because that’s, that’s what they it’s like, whatever they’re told to do. Like, that’s a conspiracy. I’m not doing it. The Bible bond and you got a little bit on communism. I don’t need to go into that. You know what I’m saying that it’s like, how far do we take this? How far do we take this idea of freedom? Like you know, because if I have COVID It’s my god given right? To do what I want with my body. Like, should I be allowed to walk into a nursing home is our coffin on everybody? Because it’s my right. I mean, that’s one extreme. What about AIDS? Can I have sex with people not tell them? No, it’s my body, my right motorcycle helmets, guns, seat belts, so many examples you could pick apart with differing views. But in America here our system is a mixture of capitalism and socialism, whether you want to believe that or not. That’s what it is. It’s this blend of all these things. fascism, authoritarianism, communism, socialism. It’s all in there. Don’t blame me. Well, if you’re a an adult out there, if you’re a parent, and every year during tax time, you get that big, extra bonus check for having kids. Why do you get that? Why do you get that extra money? I don’t kids. I don’t get that in money. I pay my property. Taxes. I paid for the schools. I got no kids, half of my property taxes go to schools. I ain’t got no damn kids. Why should I pay for any of that stuff? Why do we do it? Well, it’s it’s redistribution of wealth. It really is. And why do we do it? It’s for the greater good. Okay. I pay the property taxes for your kid again, education. And right or wrong, we’re not going to get into like, oh, stay around education. Well, I’m just saying that we do this for the greater good for the good society. I need you to pump out the kids. I need to pay you money to pump out the kids. So that when I get older, there’s a basis of community to pay the taxes to help take care of me. So we do live in this weird blend of socialism in our country. Now that would be a real controversial show if I talked about the conspiracies of having children It’s a, it’s good for the economy. Its future slave labor. It’s what they want. Okay, that’s the truth about it. Now, and then, of course, the other con, the nonverbals, right are us as human beings, we’re a communicative bunch. We’re social creatures, we need to talk to each other. And nonverbals are what like 80% of the conversation. You’ve experienced that you’ve been out there trying to talk to people with mascot sucks. Now, let’s talk about the occult rituals, elements of this thing. Look at my man, Robert Solomon, cinema symbolism too. He cites the Encyclopedia of magic and superstition. I’m going to read you from it quote, masks are used mainly for ritual purposes. The dawning of a mask is believed to change a man’s identity and faculties for the assumed appearances held to affect inner nature and to assimilate it to the of the being represented by the mask. Thus, a masked person is not simply a man or woman whose real identity is hidden. But he is an enigmatic entity standing outside the sphere of ordinary conduct and enjoying a freedom of movement and expression denied to the ordinary man. See, they’re they’re giving you a gift by making you wear the mask. They’re, they’re helping you look at the world in a new reality. And you’ll see this there was a show, I was been watching the show called last resort where they take some people out to the middle of the Costa Rican jungle with some granola, hippie types. And they’re doing all these sort of ritualistic things and to get him to change their perspective to rewire the stories in their mind. Because that’s what all this is about. I’ve read a lot of like Buddhism stuff. Right? Read Byron. Katie, you read Dr. Joe dispenza. It’s all about the power of the mind and reframing the mind and the neural networks and stuff, right. So one of the things they do is this ritual album by the fire and they make them all wear a mask to cover their eyes up, because you have to break out of that programming in order to see the programming. Isn’t that something? Let’s keep reading from Robert Solomon, as he has submerged his own identity by wearing a mask. other beings such as an ancestor of spirit or Totem animal are unable to manifest themselves in his body and voice. Mass have also the function of concentrating power in the hands of those who are in charge of the sacred objects. Oh, wait a minute, this took a turn for the worse. So whereas in one hand, it gives man the freedom to understand their own mind and get outside of their body for a minute. This is saying that you’re gonna have an entity come India, in a ritualistic element. Sort of like Halloween three. Have you seen that you seen Halloween three back in the day. They put the pieces of the Stonehenge in the mass and kill all the kids on Halloween on Salween sacrifice holiday, which is coming up by the way, is three m making mass to use your lifeforce energy because they’re the the power is in the hands of those in charge of the masks? Probably not. Let’s finish up this citation here. Thus they are linked not only with the representation of power but also with its exercise. The human guardian and wear of the mask partakes of the power of divinity or spirit, which the mass symbolizes and is thereby elevated above the common mass of the uninitiated. Thus, mass are and always were primarily means of transformation and identification with the entities of a non material sphere to which man has access only if he sheds his own identity. And there’s that beings existing on a superior plane so there you go they’re saying that the mask is an element of what they call like the Apollonian or die Nicene rituals making contact with the divine want to read one sense again Deus mass or R and always were primarily means of transformation blah blah blah, blah blah and basically a way of breaking out of the ego destruction of the ego is that what’s happening is that happening on a massive scale maybe right like I can get behind that element of this that this is a mass transformation ritual they keep saying and then they they reveal their hand too easily right off the bat they’re like all this is the new normal, the great reset everything that must change. And and that was back in like March and I was like, What do you mean it’s got to change? Why does anything have to change? Because they want it they want to usher in the New World Order. order out of chaos, my friends. no future. The rapper, he’s on my top 50 if you’re the top 50 show for the Patreon folks out there. The top 50 rapper show in future was on that list. He had a video called mask off. In the video you see Amber Rose, wearing a barbed wire mask. This is before COVID by the way for all of you non hip hop fans. Measure Bowman wants to mow once a mole masks he’s wearing a mask in the video dystopia is prevalent in the video they got chaos and fires. This just like the movie The Joker, which when I did my analysis of that, right before COVID By the way, it became clear that the agent of chaos because the Joker is the age of chaos, the nihilistic feller and this is what it’s all about. That Joker movie makes it A lot of sense now, like I should rewatch that the new eyes because he brings about the chaos so that he can create the new world order in the movie sort of. Also in that video, and I think I posted the images on Instagram, I’ll re republish them. Make a note, publish photos for all the great followers Instagram at Isaac Weishaupt. Okay. Also in that song, he says Rick James 33 chains. 33 is of course the highest level of free Masonic steps in the Scottish Rite of Freemasonry. invitation only, only when you contribute to the great work. Can you reach that level? But what’s even more curious, there’s a motto for that 33rd degree, what is it? What is it? order out of chaos, which is what this is all about. And for bonus points, Listen to dirty sprite two DS to the album. I don’t know what track it is. He talks about mask on. Okay. So mask off mask on. Okay, then let’s look, we got some more here Truthstream media, they made a great video on this. And I usually am the most paranoid in the first to see the occult ritual elements of the of the things going on. And I was always doubtful about this with the mask. It’s like, I don’t know, man, maybe I mean, it’s just viral. First off, viruses exist. Second off the mass help, right? See medical people wearing them forever. But they converted me a little bit. And I’ll post a link to that in the show notes. And I’ll give you I’ll give you the notes from us. You don’t have to watch it if you don’t want to Julian Huxley. He once wrote that the basic element in cultural transmission and transformation is a psychological one. Psychological meaning I go out and see all these people would mask is a psychological element to that of reminding me that, oh my god, everything’s a nightmare right now. Everything’s terrible. And rituals are psychodramas that change the world and alter minds. You’re the audience and you’re the participant at the same time, you’re activating parts of your mind that aren’t normally activated in psychodrama. This is what Anton they talked about the Church of Satan. If you watch his D things called DESE, tennis, think it’s like a 70s documentary about the Church of Satan. He talks about it talks about how the reason they’re like calling upon these entities even though they’re atheist, he claims is because well it says psychodrama we’re trying to create a certain vibe A rhythm. People are sinking to a rhythm. There’s a magnetic draw towards transmutation and the ritual and the symbols the transmitted they’re creating a language the society uses to speak with a quote here. rituals are vehicles driving home those ideas, rituals or vehicles driving home those ideas, the information the data, the symbols, the mask right, which upon transmission create the language by which new society members communicate after they are initiated. That’s where these terms social distancing could could be talking about this new language and parts of new understanding through definitions that the ritual generates. ritual initiation introduces and then ducks one into the way the new way of life or worldview program to guide beliefs and actions enabling the initiator to become a full and true member of the new society. Ironically, the way is also what lamb the alien channeled by Alistair Crowley in 1918, the amelanchier workings. That’s what lamb means. I mean the way because that’s what this is all about. They’re ushering in the New Age of alien gods. That’s happening. As you’ll read about and Use Your Illusion, one will be on Amazon, Audible, all that stuff, all the great places, depending on when you listen to the show, maybe it’s out already knows that the people they’re not aware of they’re participating in the ritual. There’s three stages that the video talks about, and this is all true. First one is isolation for purification. You remove one from the mundane which means of the world right you move them from the regular world and the person will be is a will be purified right? The COVID gave us the social distancing. This is the new normal, right? This is removing one from the mundane. The senses are overwhelmed or deprived. That’s the avalonian di Nicene talk. I’ve talked about many times, senses are overwhelmed or deprived for ritualistic experience by the priest which allows new light to crack in for the new thought. And the isolation forces one to face their own shadow. This is why the initiates go solo. They go underground, they go solo in the dirt, which was in Black Panther By the way, which we’ll talk about that at some point. Sacrifice is needed. Nothing is given without something taken. a pound of clays to be remoulded is the same. And the ritual reinterprets and gives new training, knowledge and understanding of the world. world, the new society or the great reset the new normal. The new society requires new language and new attitudes. A mask is used for rituals. And yeah, this is the the hoodwink of Freemasonry. This is the Eyes Wide Shut thing. It helps suppress the ego so that a new one can come to the surface, the initiate can go deeper into the self. While if you also simultaneously instill trauma, the fear of death, which is obviously what we’re looking at here with COVID, right, and asteroids and murder Hornets and all this stuff. Because confronting death needs to happen for one to be reborn. This is a call initiation one on one I’ve talked about this many times. You give the initiate a sense of disorientation and uncertainty, and it induces anxiety and removes the initial from reality from the mundane and weakens the defenses, so one can be broken down and reprogram. This is kinda like a bit of MK Ultra stuff too. If you look at some of those, some of those wellness clinics like parasail is blown out that one in Provo, Utah, she said she was a kid, they would like to tear you down and rebuild you. There’s lots of those around. It’s kind of how they do it. Now the second step is transition. The liminal means threshold of the new view. The old self symbolically dies, goes into the void in the middle. The initiate gets purified, reprogrammed, and transitions to the new environment. COVID was supposed to transform the entire world. They keep saying we’ll never be the same again. And finally integration after the transition phase is complete. And I don’t know how long this takes a year to ball gates gets his vaccine out. The integration the COVID is going to be the new normal, the great reset. Now we’re getting close to the conclusion here, folks. And in fact, I’m just gonna read you chronologically how this went down. I wrote this up, wrote my conclusion. I haven’t gone back and forth on this mass thing in my head for many, many weeks. Is it order out of chaos? How else do you explain all the lies and deception? The flip flopping than acting like they’ve never considered the idea. They’ve never looked at it. They don’t know. How do you consider that? You got these doctors, like the ones in Bakersfield that are out there saying, Oh, we should. We should you know, this is natural. We should just jump into exposing ourselves to the virus. You know, our bodies have great immune systems like Well, some people do. There’s a lot of unhealthy people in this country, buddy. But I don’t know about you but I don’t want to expose myself to this virus cooked up in a Chinese nerd lab is the body’s best way to find out the virus. What you want to you want to go expose yourself to bubonic plague too. I think that’s a silly way of looking at it. Oh, hurry up, give me the virus so I can get my immune system fired up and defeated. What about AIDS? How about AIDS? I bet you fucking I bet you will start cussing here. Got me all fired up. What about AIDS once you go get yourself aids so your body’s immune system can beat it? Because I’m bigger field doctor. I think there was a financial incentive for them. I think they were losing their money. The guy loves to pull lay or whatever you get kept on chipola or something. Well, I mean, you know, because it’s like, you got to keep an open mind. But don’t let your brains fall out. Like if I got a cut, right? If I cut my body, you know, my body’s wonderful enough it’s going to create a scab. The body responds and does it well. No fest to hemophiliacs or whatever. But that doesn’t mean I wouldn’t cover with a band aid. Like according to that logic, it’s like well, you gas yourself wide open. You know you’re supposed to let your body naturally scab it over that’s what the body does. let it do its thing. And oh, okay, so don’t do it. Don’t stitches. No, no band aids, nothing. Don’t do anything. I guess. That’s what those bakersville doctors arguing is nonsense. Is it a cult ritual? Is that what this whole thing is with the mass like Eyes Wide Shut up. Hellfire Club was doing it to old Francis Dashwood. What else do I got on here on that? Well, I’m doing a show on Eyes Wide Shut here in the future. I don’t want to I don’t want to go into that. But yeah, we’ll save that for the Eyes Wide Shut show. Yeah, that’s the idea. Is this a cult ritual? Is that why they’re doing this? What about freedom versus canning? capitalism, Say what you will about the system, I’m certainly critical of it. But to me the masks if they work provides a maximum amount of freedom for the most people. You don’t have to quarantine. And if they work, which again, they should have studied this, I don’t know why they act like they haven’t I’m sure they have and they’re just not telling us the truth because they’re instilling the chaos, which leads me to the occult ritual element, which is where, you know, I could see that if the mask, keep the numbers low enough, guess what, maybe you don’t have to take that ball gates vaccine, the RNA vaccine. I tell you, I’m taking it. But I’m not a medical expert. This is not medical advice. I don’t want that stuff. Like if it was some mega deadly virus that was like, kill and tons of people in my demographic like okay, maybe I would. Because again, if you listen I’ll encapsulate eight hours of vaccine talk for you. It’s a little bit more of a Russian Roulette, like what’s going to be worse the virus or the side effects from the vaccine cuz there’s gonna be side effects. There as much as they want you to believe in that mantra safe and effective. I’m here to tell you, their definition of safe is not my definition of safe. We have to know that the you know, the public will take this and if they take it, maybe we’ll get out of this. So like, that’s why I just wear the mask. I’m like, man, if I could just avoid getting the vaccine getting the virus, that would be ideal for me, being you know, personally vested in this you know, and some folks they get a, like I said, they get the positive covid test, they walk right out into the grocery store. So I mean, these are the people that are going to take the vaccine without thinking about it. You want to trust Everyone in America because I don’t, I don’t. Also, there’s some ideas that COVID can have long term lung and faxes, but some people are saying this acute respiratory distress syndrome messes up the oxygen and carbon dioxide exchange in the lungs. So again, that’s why I wear the mask cuz I’m like, Look, if this helps a little bit, I’m wearing it because I don’t want this. I want this rule my CrossFit career. It will mess up your wad times. In fact, one of my friends at the old CrossFit gym, his wife’s got COVID and, you know, it’s been weeks and weeks and weeks, and she’s still having a hard time just going on a walk. I don’t think that’s typical, but I think like some people for whatever reason, they don’t seem to know yet. react to this COVID virus and it wreaks havoc. I’m not trying to deal with that. So again, that’s why I support the idea of like, Whoa, you know, maybe the mass work, maybe they don’t maybe this is a cult ritual. Either way. Don’t want it I know the biggest feels doctors want to shoot me with the COVID virus because my body’s immune system so great it’s gonna defeat it like what if it doesn’t? Okay? What if I’m one of these that since they don’t know what if I’m one of these types where wrecks my lungs Dude, I don’t want that and then we’re gonna wrap up with something I found out on August 5 from your boy Jay Dyer friend of the show here a may 2020 study from the CDC and I always say like we can’t trust the CDC the who entirely but if they post something that is condemning against their own statements, like you can’t deny that right? That’s why we look to the mainstream sources because it’s like if they’re going to tell you something that counters their own point. Like, isn’t that CASE CLOSED? Right? I can’t, I can’t reference truth or websites to you. They have their own agenda too. They’re not always fact check. They don’t know what they’re doing sometimes. Now, this is a lot of reading here, the CDC article from May 2020. I’ll put the link let me make a note. Publish link in the show notes in the show notes they go for you. Now, there’s a lot here. So whether we’re doing already this kind of explains it. In our systematic review, we identify 10 RCTs, which means random controlled trials, which actually calms down a lot of my rambling about how they’ve never studied this. Okay? Because apparently they did. And again, I wrote most of that analysis you heard already before this before reading this. In our systematic review, we identified 10 random controlled trials that reported estimates of the effectiveness of face masks in reducing laboratory confirmed influenza virus infections in the community. From literature published 1946 to 2018. In pooled analysis, we found no significant reduction in influenza transmission with the use of face masks. Yeah, that’s right. studies from what is that 50 6070 years we found no significant reduction in influenza transmission with the use of facemask Now, here’s where I’ll, I’ll play devil’s advocate is influenza like the same transmission and particle sizes? covid and coronaviruses. I don’t know if you’ll look that up for yourself, but I would assume they’re pretty close. That’s an assumption and I’m not a medical expert. One study evaluated the use of mass among pilgrims from Australia during the Hajj pilgrimage, and that’s the one where they go to Mecca and they go in big circles around the Cabal that big black cube. You’ve seen those pictures, met tons of people, right. So there was a study that about The use of mass from pilgrims from Australia in the Hodge pilgrimage and reported no major difference in the risk for laboratory confirmed influenza virus infection in the control or mass group. To studies in university settings assess the effectiveness of face masks for primary protection. By monitoring the incidence of laboratory confirmed influenza among student Hall residents for five months. The overall reduction in influenza in the facemask group was not significant in either study. And it goes on and on and I’m going to paraphrase and pull out stuffs you know, listening to leet mumbled study mumbo jumbo to longer just goes through different studies. And then it says none of the household studies reported a significant reduction in secondary laboratory confirmed influenza virus infections in the face mask groups. Most studies were underpowered because of the limited sample size and some studies reported sub optimal adherence in the face and Mass group. Then it talks about the different mask, disposable medical masks known as surgical mask, blah, blah blah. There is limited evidence for their effectiveness in preventing influenza virus transmission either when worn by the infected person for source control, or when worn by uninfected persons to reduce exposure. Our systematic review found no significant effect of facemask on transmission of influenza. We did not consider the use of respirators in the community. So the term of the N 95 right? Which is that miserable mass that straps around has the little vent on the front. f that I’m not wearing it and 95 around I’d rather get hit by the alien meteors and have to wear that when everywhere because we’re our comfortable facemask for my Oh presser but the anyways yeah so what they’re saying here And this is what’s confusing. It’s like so why did the doctors in the hospital wear these masks? Is that just the illusion of safety? Do they know that this doesn’t do anything? Or does it do something? It’s just because this again this, this is study talking about influenza virus only. So, like is influenza transmitted differently from some other disease, maybe tuberculosis, right, maybe tuberculosis. This is where you got to talk to medical people, not me. Okay, here we go. And we keep going and a bar in lower income setting, it’s more likely that reusable cloth mask will be used rather than disposable medical mask. There are still few uncertainties in this practice of face masks use such as who should wear the mask and how long it should be used for. And then here we go. Here’s the big reveal at the end of this section, listen up. In theory, transmission should be reduced the most Both infected members and other contacts wear masks. for compliance and uninfected close contacts could be a problem. proper use of face mask is essential because improper use might increase the risk for transmission. Thus education on the proper use and disposal of used facemask including hand hygiene is also needed. So they’re kind of conflicting what they’re saying already says in theory transmission should be reduced. If both infected members and other contacts where the mask then there’s a bit like people don’t aren’t aware and properly which you’ve seen that with your own eyes to people the stores walk they wear the mask and they need to talk to the customer service. No, pull it down. Hey, you know, I promise I supposed to do it. In this review, we did not find evidence to support a protective effect of personal protective measures or environmental measures in reducing influenza transmission. A little bit later and this is the end of it. Here’s the last and we’re done. We did not find evidence that surgical type face masks are effective in reducing laboratory confirmed influenza transmission, either when worn by infected persons the source control or by persons in the general community to reduce their susceptibility whoever has with hantai genes face mask might be able to reduce the transmission of other infections and therefore have value in an influenza pandemic when healthcare resources are stretched. So they’re saying at the facemask don’t really prevent transmission of influenza, which is a lot different than COVID or is it very similar? I don’t know. But it says it can prevent other diseases. Does that include Coronavirus? Aren’t these all great questions? You wish they would answer for you? Do you feel like they’re trying to keep you in the dark a little bit? Because I think they are. I think they want confusion and chaos. And they want us to beg for order. But who gives us the order the same people that have been lying to you? Same people, they’ve been deceiving you. That’s why you need a little bit of self reliance. And I’m not saying I’m not trying to spell some libertarian point of view on this thing. I’m just saying you got to balance everything out. You got to kind of check things for your own. Check it out for yourself. And make your own call. Don’t listen to the truth or don’t listen to me. You want to wear a mask on what the truth is Bollea. I wear the mask. I wear the damn thing. I don’t like it. I do see the occult initiation elements of this thing. But I’m worried about myself. I’m trying to not get it. I don’t want the COVID I don’t want them. vaccine? I don’t want none of it. Will the mass help? I don’t know. Nobody knows apparently. I do know it keeps people from spitting on your face keeps you from spitting on other people’s face. So like, ultimately that’s the side I land on with. I wear the mask. Is this all part of the big plan demo? 2020? Probably, I see the called elements. I see the initiation elements of this thing, especially when you watch the VMAs the 2020 VMAs. They were over the top of the dome mass. Did you know the VMAs they had a virtual crowd. And the virtual crowd they were wearing masks. Isn’t that ridiculous? Lady Gaga has got all these fashion mask coming out with like, Can we just pretend to be normal for a little bit like no, that’s the thing. They don’t want you to pretend to be normal. I’m here to tell you I’ve been to a lot of get togethers with people want nobody wearing masks. We’re fist bump and we’re dapping up or hugging. It’s very normal. So like they want you to pretend, because you know Lady Gaga is not wearing a mask runner friends Give me a break. They want you they want they’re, they’re pushing this narrative, right? So I see that. But ultimately, I love my fellow man and I want to look respectful to them. I know that’s like a virtue signaling idea. So like, there’s a few reasons right? reasonable wear the mask one respect for my fellow human beings. You know, I saw I saw an old lady, like 90 years old, and I was pulling in, I was bumping and she was getting out of her vehicle and this parking spot next to me and she looked terrified. She was wearing a mask. And I felt bad for her and I thought, Man, about these old people are terrified to go out in public. It’s sad. So I got word of mouth and make her feel good. You know? I’m looking out for my fellow man. I’m not doing this because the griddle press ORS are deceiving me. Don’t infer that and I’m doing it because I think it could help. And I will take I think it could help over nothing. I’ll definitely take it over the ball gates vaccine. And I’ll definitely take it over the Bakersfield doctors they want to tell you like oh but your immune system should be good and fired up and you know that’s the way things are you’d expose yourself to every virus. Oh really cool. Let me give you aids and see how well you do with that. There’s like a limitation on the immune system you know what I’m saying? So that’s but that’s my viewpoint. I understand if you’re on the other camp, which you probably are statistically speaking my beautiful audience by very anti mask and you’re going to blow me up in the comments. Eyes it Come on, bro. You’re such a shill. Yeah, I’m sure I guess I don’t know. Because I don’t want this weird disease that they cooked up in a lab. They won’t tell you that. Truth about, you know, there’s something behind this disease that they’re telling us, right? You do know that right? You do know that they immediately shut everything down, they destroy the economy. preemptively Why? Because there’s something we aren’t being told about it. Either a it’s not really a virus, but I don’t believe that there’s lots of people getting tested for it, right? That’s pretty elaborate hoax. Or B, you know, because Part A is like maybe there’s not really a covid virus and this is all an initiation ritual to bring about the New World Order. Or be there is a virus. And oh, by the way, at the same time, they’re going to use this to their advantage to create the new world order, which I could see that one or see something real bad happened over there and the Chinese labs and they told everyone the world like, Hey, we made this Frankenstein Resident Evil virus and it’s out and everyone was like, oh, shoot, you know? That they’re not telling you the truth. You got to look out for You and your own, okay, you make the call for what’s best for you. I definitely have lots of friends that are on the mega anti mask side of things and I get that I get that. I don’t judge you for that. Same as you shouldn’t judge me, because I’m just trying to protect myself and protect my fellow man, because I almost spit in their face. In case I’m asymptomatic because I do have a superior immune system from CrossFit and macro counting and vegetables and all my you see my yummy drink I drink every day I did a video on Instagram, singing about Justin Bieber, yummy, yummy song with the spinach and ashwaganda and the beet juice and all that. You know, drink that every day. I’m fired up, man. Anyway, as you can tell, I flip flopped on this in my own head many times this is a difficult decision. I respect whatever decision you make with it. I get all sides of the story here. And I kept delaying the show, waiting for my final revelation, my final truth What I believe, and I’m here to tell you like, it ain’t half there yet. It ain’t out there yet. They don’t know. You can’t believe them. But I’m also telling you to be careful. You don’t want the virus from the root hand flow from the bio level for lab. I’m not a medical expert, though you do what you want. I got a cross recruiter to attend to here. Anyway, hope you hope you enjoyed that show. I’ve been teasing you with this show for many weeks. And the delay has been because I simply don’t know what the right answer is. And that’s the truth of the matter. Feel free to blow me up in the comments. I appreciate your time. Be sure to follow me on Instagram at Isaac Weishaupt link in the show notes. And check out my alien book The first book user illusion one out this fall as you’ll be dropping like it’s hot. I’m revealing the big Alien Agenda. They’re pushing the Alien Agenda next folks. I promise you that promise you the alien religion is coming. know the truth behind it before it happens before it’s too late and until next time, stay woke", "opengraph": {"locale": "en_US", "type": "article", "title": "The Great Mask Debate of 2020: Occult Ritual Symbolism, Health Pros and Cons & More! - IlluminatiWatcher", "description": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we’ll explore the sides of the great mask debate of 2020! I’ll ramble on about the occult ritual elements, the health studies, review the claims made by both sides and give you my opinion (*I’m not a medical expert and this is not medical advice)! Links […]", "url": "https://illuminatiwatcher.com/the-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-09-18T14:43:22+00:00", "article:modified_time": "2020-09-18T19:47:43+00:00", "image": "https://i2.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/08/CTAUC-Mask-Debate.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["mask conspiracy", "masks", "mask podcast"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/posts/33527973", "https://illuminatiwatcher.com/kobe-pt-2-epstein-coronavirus-event-201/", "https://edition.cnn.com/2009/HEALTH/11/06/face.mask.swine.flu/index.html", "https://www.japantimes.co.jp/news/2020/05/28/national/science-health/masks-helped-fight-coronavirus/#.X00Y5i2ZOqQ", "https://therayfield.com/why-youre-wearing-a-mask-the-pagan-ritual-of-transformation", "https://www.patreon.com/posts/33148917", "https://illuminatiwatcher.com/joker-film-analysis-occult-symbolism-and-hidden-messages/", "https://wwwnc.cdc.gov/eid/article/26/5/19-0994_article", "mailto:sales@advertisecast.com", "https://www.advertisecast.com/ConspiracyTheoriesandUnpopularCulture", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/40974507", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/the-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more/?share=twitter", "https://illuminatiwatcher.com/the-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20The%20Great%20Mask%20Debate%20of%202020%3A%20Occult%20Ritual%20Symbolism%2C%20Health%20Pros%20and%20Cons%20%26%20More%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fthe-great-mask-debate-of-2020-occult-ritual-symbolism-health-pros-and-cons-more%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Brendan", "Jacob", "Isaac Weishaupt"], "publish_date": "2020-09-18T14:43:22+00:00"}