{"result_id": "165020", "URL": "https://illuminatiwatcher.com/gretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles/", "timestamp": "2023-04-25 15:36:01 CEST+0200", "meta": {"description": "Gretel and Hansel Film Analysis: Occult Magick, Demon Food, Witchcraft & Triangles! Listen to the podcast to learn the symbolism of this film!", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/illuminatiwatcher.com/wp-content/uploads/2021/08/cropped-Isaac-Weishaupt-Headshot-LoRes-2020-09-02-at-7.45.41-PM.jpg?fit=32%2C32&ssl=1", "canonical": "https://illuminatiwatcher.com/gretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles/", "encoding": "UTF-8"}, "image": null, "domain": "illuminatiwatcher.com", "title": "Gretel and Hansel Film Analysis: Occult Magick, Demon Food, Witchcraft & Triangles!", "cleaned_text": "On today’s episode of the Conspiracy Theories and Unpopular Culture podcast we do a film analysis of Gretel and Hansel! We break down the triangle symbolism, all seeing eyes, inverted crosses, contagion magick, pentagrams, goats with boobs, Stephen King’s demonic visions of adrenochrome at the fear buffet, the underground ritual, enlightenment of Gretel and the not so hidden meaning of the film!!\n\nSupport the show: 1. SUBSCRIBE! 2. Leave a review! 3. Join the IW Patreon team at Patreon.com/IlluminatiWatcher! (*Full transcript of the show will be at bottom of this post, scroll all the way down!!!)\n\nLISTEN TO THE SHOW HERE:\n\nListen to the show on the iTunes or Stitcher feeds (**and don’t forget to leave your reviews there as well!!**); or right here on the embed:\n\nListen to “Gretel and Hansel Film Analysis: Occult Magick, Demon Food, Witchcraft & Triangles!” on Spreaker.\n\nToday’s show is brought to you by my books on Audible! If you want to support the show search for “Isaac Weishaupt” on Audible or hit this link to get my most popular book- THE DARK PATH!\n\nDON’T FORGET TO SUBSCRIBE TO THE SHOW!!\n\nIf you like the show and want to give your support (*as well as that free download of my latest book that explains the entire scope of the “Illuminati” agenda with citations from occult literature; THE DARK PATH) become a Patreon Supporter! (**Tier 1 and up get access to the bonus content and full episodes through that private RSS feed)\n\nThanks again for listening! If you want to support the show you can leave a review for the show on the iTunes or Stitcher feeds; this helps A TON and I’ve enjoyed reading all of them!\n\nWebsite publisher of IlluminatiWatcher.com and top 5% Amazon author of THE DARK PATH; Isaac Weishaupt has been on the leading edge of conspiracy theories surrounding the elusive “Illuminati” and its infiltration of the entertainment industry. Using examples of familiar pop culture and works of entertainment, Isaac has been speaking and writing about the occult from a unique perspective that seeks to understand the big agenda while helping others along the way.\n\nIsaac hosts the “Conspiracy Theories and Unpopular Culture” podcast (supported by the IW Patreons). He has been a featured guest on Tin Foil Hat podcast, Dave Navarro’s “Dark Matter Radio,” Richard C. Hoagland’s “Other Side of Midnight”, SIRIUS/XM’s The All Out Show, The HigherSide Chats, BLACKOUT Radio, Freeman Fly’s “The Free Zone”, Mark Devlin’s “Good Vibrations”, VICE, COMPLEX magazine, Esquire, The Atlantic and many more radio shows and podcasts. His fresh perspective and openly admitted imperfections promotes the rational approach to exploring these taboo subjects and conspiracy theories.\n\nFollow Isaac on Instagram: @IsaacWeishaupt, Twitter: @IlluminatiEyes, Facebook: @IlluminatiWatcher, or sign up for the free email newsletter!\n\n*Note that this is pretty accurate- not 100% though. It’s run through software that is generally very accurate and then I give it a quick once over but there are most likely some errors.\n\n**A PDF copy of the transcript is given to all Patreon supporters- join the IW Patreon team at Patreon.com/IlluminatiWatcher!\n\nTell me the fairy tale again. It’s too scary and you start seeing things that aren’t fair.\n\nYou’ve been turned down with your\n\ncell phone for yourselves with only your clothes and your hives.\n\nI’m hungry. I’m hungrier than you are.\n\nI’d hate for you to Start something can’t stop\n\nuncle’s glad Oh, my brother wants\n\nsomething wrong here. It’s so pleasant\n\nwhere all the animals milk\n\nto see what has to kick\n\nLet’s talk about films. Today we’re going to talk about a film. And its title is Gretel and Hansel. Whereas it Hansel and Gretel. No it is Gretel and Hansel indeed. We’re going to talk about all the symbolism you’ve been clamoring for. You’ve been, you’ve been telling me all about it. You’ve been sliding into DMS. You’ve been sending me messages, comments, tweets, all the things you’ve been sending in. I watched it. And I loved it. I thought it was great. I loved that movie, because I like me a good culty horror movie. And that’s what you get with this one. The we’re going to talk about the film plot spoilers. Suck it out. We’re gonna do some plot spoilers. If you don’t like it, go watch the movie and come back. This one’s one. I recommend I liked it. And I tried to give you a scale on what I think it’s worth. I actually wanted to see this in the theaters but not make it. Because, you know, I’m a busy guy, a busy guy. I bought it on Amazon. I think it was like on sale for like 10 bucks, and I think it was well worth it. Would I pay 20 bucks to own it? Hmm. I mean, if you’re into this sort of thing, then it’s a solid maybe. But that’s kind of, you know, kind of where I put it. The, you know, and here’s some I can give me some comparisons here. If, if you took the dari Argento toes color schemes, like you saw in the 70s version of suspiria if you took a touch of the witch with a little bit of the full core of midsummer and Wicker Man Put it all together. That’s kind of what you get here. So basically, it’s great. It’s great movie. And the words are about all the symbolism in it. illuminate, confirm all over the place, red dragons grimoires, the the witch, the hot witch, the hot witch, and sort of like the social consciousness movement here hidden in there. And I’ll explain to that. I’ll explain that. And of course she’s initiate going through the ritual to be illuminate confirm. Now the name of the film Gretel, and Hansel is of course an inversion. Supposed to be Hansel and Gretel, right. Which was one of my favorite tales as a child. I’ve been into this mccobb darkness since I was a kid. But the director I listened to some interviews he said that because the story is supposed to be focused on Gretel a female As opposed to Hansel, the male he’s so hot right now that Hansel so hot right now, but we don’t care about Hansel and Gretel and you could take this a few ways because I know you I know my demographic. I’ll entertain the idea that maybe this is just another one of these virtue signaling power to the feminine sort of focus. You know, take it from the patriarchy and you know, girl power. Good baby, but that’s not really what the director said. Exactly. Well, you might have I you know, I didn’t read every single interview did I’m sure there’s elements of that here. But like I always say like, I’m okay with that. I’m okay with that. Doesn’t bother me any. You know, entertainment is very influential entertainment dictates our world which is what We’re learning looking at the Alien Agenda, writing the book, writing that book on the aliens, and it’s gonna blow your mind trying to figure out a way to do this book that and we’ll talk about that another time. And don’t Don’t hold me to it but what I’m looking at doing my vision, and I’ll share it with you because you’re the audience, and I trust you. My vision is to do two books. Okay, this is going to be because I’m an old fart. This is going to be like Guns and Roses user illusions, one and two. You got you had to have both cassette tapes, you had to have both sort of mirror images of each other. The blue and the red as someone was telling me to look into the symbolism of that. It’s actually kind of more of an orange for us your illusions one anyway, I’m doing that. The first books going to explain the Alien Agenda from the perspective of the occult because I’m not doing not doing This alien, deep dive into all the projects from the 50s in Roswell, you know that already, this isn’t, this isn’t going to be for that crowd. Okay? We’re leaving those people in the dust. We’re moving on. We’re taking this a step further into the occult, spiritual religious elements here, they’re trying to create a new religion, and I’m going to expose them. Okay, that’s book one. And then Book Two. That’s sort of like the nuts and bolts of the science of that how it’s working and examples. Book Two will be film analysis, or how many yet five to 10 film analysis with some photos, which is going to drive the printing cost way up. So I did make the choice of whether to do it in color or black and white, you know, my qubix code. I’ve got some images in there, but they’re in color which drove the price through the roof. Anyhow, just just sharing that with you. Let’s move on. You want to talk with the film on my stupid book now. We’re where we were talking about this movie versions. Girl Power. Beginning with the Okay, yeah, so the movie starts out. And it’s telling it’s retelling this tale of a of the witch basically. And you see the triangle on top of a mountain and I’m going to put all these photos, I’m going to put them together and put them on Instagram as I always do. So like and subscribe at Instagram, or I’m sorry instagram.com Isaac Weishaupt and Isaac Weishaupt. That’s the name the the triangle that the which is a sort of like this witch doctor spiritual, sort of Oracle of Delphi chick is sitting on who makes the witch she’s on top of a mountain inside of a triangle which Clearly that’s the symbol right? The triangle. What’s the triangle mean? though? Let’s go a step further. Those of you that just see triangles and think Illuminati nonsense, it’s a symbol of creation. Okay? Now if you take it even further, you’ve got up right triangles are for the creation of the male essence and the inversion of the female essence. But this is an upright triangle on top of the mountain. And what does that remind us of a reminds us of Allah handwrote around sees holy mountain. Because this triangle is on top of a mountain, not a coincidence. Because as you heard in my analysis of Truman Show, which by the way, if you want to support me for the show, go go my book conspiracy theories and on popular culture. The book now available on Amazon, audible self narrated it for you, so you don’t have to do the labor of reading. And it’s got many the most popular podcast topic. One of them being The Truman Show. And that’s what Truman says at the beginning of the show. He’s the initiate about to go undergo the ceremonial transition, the alchemical process, the awakening. And he talks about climbing the mountain because that is this the symbolic representation and it’s sort of nature’s triangle, right? It’s nature’s pyramid. And then we watch the movie. So they tell the tale. And basically, there’s this witch, boom, seeing the set. Then we pick up the story, and a young boy and a young girl Gretel and Hansel and Gretel played by, what’s her name? I don’t know her name. She was in it, okay. Which they’ll compare in a second. But they’re they’re basically walking around. They’re kind of on their own right and this is very standard for these tales of parents being absent in the child’s life or parents even being dangerous, something Disney has perfected, because it’s about destruction of the family unit. And look, I don’t support all that like, homophobic trains of thought behind that. I know I got a lot of heat. I got a lot of heat. I’m catching all the smoke about some people I’ve had on my show that you could interpret what they were saying is homophobic but I don’t think they were I kind of pressed on it and whenever I don’t support that, if you’re homophobic if you’re one of those types. I’m here to tell you that’s not me. Don’t use my platform to support your agenda. Now, Gretel and Hansel there. Why are we talking about homosexuals here? What happened? What happened? Okay, so, oh, yeah, destruction of the family unit. They’re out walking around, and basically Gretel. She’s going to the house of this sort of You know, wealthy aristocrat type. And when she walks up on the property, you see, again, symbolically used with a camera lens, a triangle created out of logs of wood firewood. Okay. And again, I’ll put the image of. Then she walks through the hallways and you see the, the the colors of suspiria, as I’ve mentioned earlier, and she talks to the Lord and he’s basically like, are you still intact? Meaning Is she still a virgin? Because he is a gross human being, you know, and he wants to do gross things, but she’s like, now I’m out of here. She’s a strong, powerful woman, young lady. She’s out of there. And then she goes home. She’s like, I’m not working for that guy. He’s a molester. And my mom’s like, again, you got to make that money girl. What are you talking about? And then she’s like, you know, like, I don’t want to be here anymore either. And her and Greg and Hansel are, they’re out on their own now. Because again, you can’t rely on the parents. They’re useless. So they’re they’re kind of roaming around and they find this house and they go and stay inside of a sort of like, room. And when what was curious, I noticed when they walk in the room, there’s an inverted cross in the wall, you wouldn’t notice it if you didn’t look for it. And I’ll post that image again on Instagram at Isaac Weishaupt login subscribe. Because I’m going to flip this podcasting into Instagram influencing thought now one day and in this house, or this room, it’s almost like the it’s almost like they were staying in the in the stables, sort of like a mockery of the story of Christ. This is something I thought of just now I just fell out of this conversation, the stream of consciousness, it’s kind of what it was almost. So anyway, they go in there and there’s an inverted cross kind of telling you this is an anti Christ tale sorts, and then they wake up some hideous monster chases them out of there. And then the guy who actually like owns this house, don’t ask me why he saves them. He shoots the arrow right through the all seeing eye of the monster. Okay? Then they go in, they go into the house, because he’s like, Come on, let me let me feed you guys or whatever. And talking to him, and he’s like, he’s got this meal. He’s feeding them. And Gretel. She’s like the older one of the bunch. He’s the older sister and has just a dumb, like, kid, I don’t know where the five years old six years old. She’s like, maybe 1516. I can’t really tell. And she’s kind of like talking to the land owner there and is like, what do I need to do to pay back this debt? Because she’s very focused on that she’s very aware of the world and the idea of repaying debts which is something we We’ll get into so he’s like, no, it’s fine. And then he’s like, here’s where you need to go. I’m gonna send you on your way you can find a place where they can find good work for you so you’re not having to deal with you know, molesters and all that stuff. And he’s like, go through these woods and don’t don’t go off track because he knows right there foreshadowing what’s going to happen to them? And she’s like, I bet let’s do it. So off they go. And what do you know they come upon the witch house, right cool looking little house. It’s a triangle, of course it’s a triangle. The house is a big triangle, they walk upon it and she’s Gretel kind of looks to the people which is a triangle with the all seeing eye is what we see. Again, I’ll you probably seen the image it was on the trailer and I’ll also put it on the post the photos. And it might be too close by the way, I got a lot of photos. While I’m thinking of that, so she looks inside the house of the witch. And the witch is like, come on in. I’m gonna feed you guys but like the whole time Gretel is a little bit weary of this but Hansel, he’s so stupid. He’s just like, yeah, you know, keep feeding me and this is great. I never want to leave. The whole time. Greg was a little bit like, I don’t know, because again, she’s very educated in the worldview and she knows like, nothing is free. There’s a cost to everything. Okay. Then there’s a part where the, the witch, she sort of like snags a lock of hair, and she puts it inside of a box. Now, what is she doing here? Well, if you’re familiar with my work, my my hip hop conspiracy book we talked about contagion magic, with Kesha Madonna’s DNA and Kesha Gaynor Teeth from the fans and all that stuff. Well, it’s contagion magic. Okay. I mean, she’s a witch, what do you what do you think she’s gonna do with it? And it’s basically you use the energy, the essence of a person to manipulate a larger field of energy with a little bit of As above, so below straight from the Emerald Tablets of Hermes. And that’s what she’s doing. When she gets there. Then Gretel is she’s warming up to this whole thing. And she’s like, Well, let me look through this book. You got hair and, and the witch hands of this book, and you’ve got it’s a spell book, right? It’s a spell book with all kinds of herbs and healings and all this stuff and you see a pentagram on there if you know how to look carefully in the center, down the center of the page there. Which later you see the inverted pentagram carved into the tree because inverted pentagram is the symbol of the bathmat, that’s the goat with the boobs. It’s a symbol for the Church of Satan, the one created by Elvis lovey and it represents the reconciliation of opposites it represents the chemical breakdown and rebuilding, particularly in the initiatory process. Now, which is of course, what this whole show is about, now Gretel. She has this ability to commune with the dead sort of a necromancer and she sees the spirits of all these dead kids which as you already know, the the tail, these dead kids souls are all around because they got eaten by the witch.\n\npawns on pawns on pawns. It’s not so ironic considering how this actress let me get her name. Let me get her name for you. Get to Get her name. And you’re going to love it. Gretel and Hansel Hansel he’s so hot right now. This is me delaying your boy How long is this gonna take me Sophia, Lilith is her name and she was in the film it and as you know because you’ve surely listened to my shows on Stephen King’s it she was on it chapter one and chapter two\n\nthat’s what that film was about because Stephen King is very in tune with this as well Stephen King’s tapped into the darkness okay. And on the stories for it the dead the kids getting eaten, is what the the sort of devil character always wants is what the dark forces one the the Archons whatever you want to call it. The fear sustenance adrenochrome maybe for all you pizza folks out there. That’s what it’s all about. And by the way, it should be known that in my alien book we’re talking about Diane PASOK, his book American cosmic where she’s hanging out with a bunch of UFO nerds a secret society of UFO nerds that believe in this stuff is the new religion which they will instill which is coming, I promise you this, I promise you, these things are going to happen. That’s why you got to read this book when I’m done with it in never, I’m actually making pretty good progress here. I got had a writer’s block for about a year on it. Now it was a there’s a very curious part of the book. If you read the book, where one of these guys who’s into aliens and all this crap. And his name is Tyler. By the way, Tyler is the guy and it’s a pseudonym. Tyler’s a very curious pseudonym, because that’s a free Masonic term. Anyhow, I’m going to read you from it. He’s talking to her about some stuff. He says, I had a dream about the contents of your backpack, I dreamt that there was a separate universe that you carried in a universe that was created within this universe. That who knows where this universe was created, had very much the essence of turtles all the way down. Ha. Now, why does that matter? Well, this guy’s talking to aliens, which are demons. We all know that. We don’t know that. I don’t know that. That’s one of the ideas we’ll explore. But Stephen King who’s also been talking to the demons in the story, if you read the books, it has. The God the Creator of the world is the turtle, who who pukes up the world is this turtle and you see it in the films if you know what to look for, because it’s kind of buried in little Hidden, you know, little stuffed turtle here or whatever. They don’t really go into it in the films but I’ve read the book, which is incredibly long and it’s actually very good, I recommend it. But you’ve got the summit up you got this idea of turtles and demons and demons eaten the adrenochrome eat the kids, and it’s kind of all in this movie, basically. Now, she’s making anointment the witch, right, she’s making this ointment. And you can see it looks like fat very clearly. And she’s talking about super powers. And this is where I believe she gets these black fingers from because she’s dipping her fingers into this concoction this ointment that she’s making.\n\nOn some nights I don’t see people\n\nlistening to the ones good\n\nby net only reach out pocket.\n\nThis is my power to see what is hidden into take.\n\nSmall mind, please tell me what it can see.\n\ncarves out just square waits to be taken.\n\nIf we’re wondering what governs its fate\n\nwe know that we are affects our masters Don’t worry.\n\nThose like me and those like you, we commune with the Queen provide.\n\nShe gives us the seeds of abundance and we grow them in our garden.\n\nWe harvest it and with it.\n\nyou see we have not agreed to anything Nothing is going to be a disagreement.\n\nIt’s already inside of you.\n\nYou can either stay Sleep tight\n\nNow why does this matter? Well, we talked about this I did a great two part show on the witch and the lighthouse, which are you know dual elements of the male female essence. And in the the witch you see the witch, the witch and they’re grinding up the baby guts. For a flying ointment annoy me that lets her levitate and Francis Bacon, the Freemason new Atlanta’s guy. He talked about this only man said you needed the fat of children wolfsbane fine wheat juices of smallish sink foil, Bella Donna, etc. And that’s kind of what we see in this movie as well. That’s why I think the wizard Has the black fingers in Gretel and Hansel. Oh, and I’m missing a big part here. I’ve skipped paths apart before they go to the witch’s house. Gretel and Hansel stumble across these super mario mushrooms the red with the white dots and they start tripping balls and not much happens but what we could infer from that is that their view of reality has changed. This is much like Alice in Wonderland right it says similar tale their perceptions on reality are changing is what that is. That was before they got to the witch house. I missed that part. I’m just just hit me when I was talking about the Bella Donna which is a flower not a mushroom but you know, same thing. hallucinogens psychedelics, which again are tied in the aliens. You can be a psycho not, they call them anyway. Now we see in the movie The witch holds up a rune stick. It’s just a stick but it’s actually a rune and shout out ROM Solomon. He posted this on Twitter all the credit goes there. I actually didn’t know this at all. I posted this a little while ago. And the stick the rune stick is based on a book that summons Lucifer. Just like in the ninth gate. Yes. Which I have a an analysis for as well. The ninth gate Johnny Depp, Roman Polanski doesn’t get any more luminate confirm than that. Now what and I looked this book up, start to learn a little bit more for you and the grant. It’s called the grand gloom grim wire, aka grim wha, aka the red dragon. And this uses Solomon’s lesser keys of magic which is basically controlling demons and black magic. And it’s supposed to summon Lucifer for the purposes of making the Faust dn pact, the founder bargain. And lfls Louis, he had a fascination with this book again, there’s the bathmat stuff. He’s the guy who drew the Batman. And that’s the sigil in the spell book. In the movie, it’s all connected. But if you look in this grand Grimoire of the Red Dragon here in chapter two, it discusses a tool used in the groom wire. And it’s the true composition of the mysterious one, the destroying or blasting rod, which does in fact fulfill its destructive properties in the movie. I’ll read you from it. On the eve of the great undertaking, you will search for a rod or one of wild Hazel tree that has not yet borne fruit at the highest point of the sought after branch there should be a second little branch in the form of a fork with two ends, its length should be 19 and a half inches of my goodness. That’s a big one. And that’s what you see. The movie there was a little bit of homework done for this movie basically Okay. Then if we read that red dragon room or book a little bit more says after having found a branch of the shape, only look at it but abstain from touching it waiting for the following day a day a day destined for action in which you will go out cut it precisely at sunrise and denuded of its leaves and small twigs if there are any of these and with the same blade that was used to skin the sacrifice, which will still be tainted with its blood, you will cut it when the sun starts to Hellboy and then I cut off anyways, that’s the that’s the page that I cut out and I’ll put that on the images on the Instagram, so you can check it out for yourself. Now, we talked about some parallels with the witch again, the girl in this tale, just like in the witch is shunned. She’s shunned just like Thomasson. From the witch. She teaches Gretel enhance the she, the witch is teaching Gretel and Hansel. And she’s like, Hey, I’m not your mom. Just so you know that. And this is kind of how it works, right? You got to get rid of the parents. That’s why. That’s why a mom looks so bad at the beginning of the movie, it’s all about independence and breaking free from the social construct. Now Gretel. She finds she loses Hansel and she’s like, Where is he? Well, he’s stuck in a hidden basement room, which is again another parallel with the film suspiria with the dance school, the hidden rooms and all that. So Gretel goes down these stairs. You know, no, that means she goes down the stairs and then All of a sudden Here comes the hot witch. It’s the witch but now she’s, she’s young and she’s hot. She’s covered in tattoos. Which includes one of the tattoos is a solar symbol on her right shoulder. It’s the symbol for target. Right? It’s a circle with the.in the center that’s actually a solar symbol. And she’s got the Seal of Solomon, honor tattooed on her and you know, when you read that grand Grimoire of the Red Dragon, you find out that it’s about Solomon. That’s an opening of the book. So the wit So okay, so hot which comes down and well turns out she’s basically taking fat and guts and organs of of kids and transforming you out chemically transforming it into the food that Gretel and Hansel are eating. So, again, the next day and the world Witch she’s talking to Gretel about tasting poison to see what’s actually sweet. And to me that is more indicative of what’s going on here. It’s dabbling to embrace evil. And this is in fact the scene on the sort of trailer and cover of the movie where the witch is pulling out the hair.\n\nI’ve been to pacify the best hunter isn’t with us.\n\nIs it? He’ll soon come to you. As all men showed, it’s a smart I’m just here so easily turns to hate it\n\nbetter to remember you as you were,\n\nrather than as you’re meant to be.\n\nIt’s all like you’re showing me like one day Be very powerful\n\nhave mastery and dominion over everything\n\nHave you one of vulnerability\n\nwhich is taken apart and\n\nonly that which has taken a part of you\n\nuntil they have hired\n\nuntil you must consume it lasted consume you first consumed poison. How else can one developer know\n\nis that half of everything bad while nothing tastes\n\nThen we sort of learn more about the witch witch witch Is the pink cap girl in the story the beginning and we find out that the pink cap girl she followed her mom like her shadow. Again, an analogy for call young, embracing the dark side looking for the shadow. Much like Kobe Bryant tells you to do when his kids books when he’s telling your kids to embrace the shadow to worship the Fallen Angel and embrace the shadow and we find out that she ate her children for the superpowers.\n\nI know that your favorite story but you have been telling it raw. It’s true. She was a most beautiful child. And everyone could see that. On the inside. She was rotten to her core, under sweet as vinegar Even I hated her. No, I was her mother.\n\nBecause for me, she took everything.\n\nAnd he would have destroyed me too if I didn’t get rid of her first. So I gave her back to the darkness for her made her and thought that would be the end of it. Behind this law, she stayed with me in my thoughts in my dreams attached to me like my shadow,\n\nof the powers to be hot. Are the first required was for me to be bullied and to trust the darkness. And I was and I did have Like she had gotten I rid myself of all other attachments. It cleared my place. I ate my tail.\n\nSo now Gretel is supposed to eat Hansel. That’s what they want. That’s what the witch wants to eat her own. And they go underground again back into that basement room. Because she has to go underground. That’s what the initiates do. It symbolizes death by going underground six feet under. This case is down a stairwell into the basement room into this ritualistic chamber. And she realist ritualistically wants to initiate Gretel. But then, but then Gretel. She’s got the CDs because, you know she was able to talk to the dead people remember the dead kids and she uses the force for her own good And she, what’s it called? ESP? Boy, ESP. No telekinesis, telekinesis. Through telekinesis. She grabs this, Solomon Red Dragon, wooden staff Rod 19, enter, which is actually much longer in the movie. It’s like four feet five feet long. And she uses the kill the hot witch. And then she’s the Master of the Universe. She’s the new witch. It’s sort of it’s just like the other movie The witch, right. So what’s going on in this story? Well, like I said before, like I alluded to, the moral of the story is that she keeps saying throughout the whole movie, nothing’s free. But the boy you know, Hansel, he’s so hot right now. The boys like hey man, she takes care of And this is great foods grades delicious, but it’s all an illusion. Hot, which is pumping GMOs, and you know, adrenochrome into these kids. They don’t even know it. It’s very much like our American Western diet here of fast food. Yeah, I gave you I gave you that. The McDonald’s burger tastes great. any real food, it’s GMOs and fake stuff. It’s all an illusion. It’s kind of like cipher in the matrix. You know, he’s like, ignorance is bliss. Pull me back in. I don’t want to know. I just want to live in bliss, which Hey, you know, that’s okay, too. I get that. Well, which is pumping GMOs and the 5g kill grid into these kids while distracting them the whole time and saying it’s fine, it’s fine. But Gretel knows she knows nothing is free from her life experience. There’s a cost to everything. The witch wants them to get fat and sick. For her own ends. What does that sound like? Sounds like Big Pharma. Sounds like all the fast food restaurants. And this is the same thing in America with COVID-19. Everyone’s all confused. Nobody knows how to help. And the problem is the illusion is cracking. And everyone’s scrambling and distracting. Fighting masks, no mask. Trump says eat to bleach and the truth is are fighting. But you never hear, you know, Dr. Fauci or President Trump you never hear any of these people say, here’s something you can do. You can quit eating sugar. You can quit eating GMOs, you can quit eating processed foods and fast food Because you need to get your immune system up, they never say you should get some more sleep you should work out. They don’t tell you any of that. Because the mainstream media is here to pump up the fear and the stress, because that’s the system they’ve built. Much like the Archons and demons are trying to feed off of the fear. That’s what the the power structures here in our world are doing to us. We’re told Hey, just, you know, wait till the vaccine comes through. We’ll get it. We got this, which I don’t know if you read my book, the vaccine conspiracy secretly coded as the vaccine controversy because you know, not trying to get banned everywhere. You can get it for free. Go to my gumroad store gumroad.com backslash Isaac w GM is in like bubble gum. Gum road duck comm backslash Isaac w go get it for free. puncheons zero dollars. You throw me a couple bucks, throw me a cup of coffee, if you want. I don’t care though, just take it. Because there are a lot of questions about the vaccines. Amazon blocked my book. Just saying, Why do they not want you to talk about it? Hmm, why are they okay with Bill Gates telling you what kind of vaccine you should take. He doesn’t know. He’s not a doctor. He didn’t even graduate college is barely a nerd. But yeah, you know, instead of instead of anyone helping us out and saying you need to get your immune system beefed up, you need to lose weight. You need to stop eating sugar stopping GMOs. You need to get out to 5g kill grid. We’re going to shut down 5g which is inducing stress on your organs. They just say, hold on tight. We got a vaccine operation warp speed run by the guy that runs GlaxoSmithKline To make billions of dollars off of vaccines, he’ll take carrier. And that’s what this whole movies about will protect you. Everything’s gonna be great. It’s an illusion. It’s an illusion to fatten you up. To feed Big Pharma CEOs, corporate America, all these rich assholes and the illusory system that they’re building full of false safety, trading in your freedom, for the illusion of safety. trading in real food for the illusion of food through genetically modified organisms. Stress, Stress everywhere, trying to keep you in debt. It’s bad, all that stuff is bad, trying to keep you busy so you don’t get enough sleep. So again, in summary, Gretel knows what’s up. She knows there’s a cost for everything she knows there’s a bit of a foul steam packed to be made. And that’s why, you know, you’ve got all these occult symbols as you as you would expect in a story about a witch, right? Like that’s not so hidden. I just thought I’d discuss some of the symbols in here for you. shed a little light on the, the Red Dragon rod there, that 19 inch or the Red Dragon the devil has there. And it, it the tale of feeding off of the fear of the young ones of the adrenochrome. To me, all of these elements come together in this film, which again, I actually enjoyed thoroughly. It’s actually very good. So there you go. I hope you enjoyed it. I hope that my analysis fits. watch the movie. Tell me what you think. Hit me on the socials. And again, go to my Instagram at Isaac Weishaupt sign up like and subscribe. I got I got a lot of photos it’s probably gonna be two different posts. I’m thinking because it’s probably too many to fit on one for Gretel and Hansel and until next time, stay woke.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gretel and Hansel Film Analysis: Occult Magick, Demon Food, Witchcraft & Triangles! - IlluminatiWatcher", "description": "Gretel and Hansel Film Analysis: Occult Magick, Demon Food, Witchcraft & Triangles! Listen to the podcast to learn the symbolism of this film!", "url": "https://illuminatiwatcher.com/gretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles/", "site_name": "IlluminatiWatcher", "article:published_time": "2020-07-21T12:44:36+00:00", "article:modified_time": "2020-07-21T12:45:28+00:00", "image": "https://i1.wp.com/illuminatiwatcher.com/wp-content/uploads/2020/07/CTAUC-Gretel-and-Hansel.jpg?fit=800%2C800&ssl=1", "image:width": "800", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["gretel and hansel film review", "gretel and hansel symbols", "gretel and hansel grimoire", "gretel and hansel occult", "gretel and hansel podcast", "gretel and hansel symbolism", "gretel and hansel witchcraft", "gretel and hansel", "gretel and hansel analysis", "gretel and hansel film analysis"], "tweets": [], "movies": [], "links": ["https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.instagram.com/isaacweishaupt/", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://www.spreaker.com/episode/39863395", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://www.audible.com/pd/B0759MN23F/?source_code=AUDFPWS0223189MWT-BK-ACX0-095441&ref=acx_bty_BK_ACX0_095441_rh_us", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://www.patreon.com/illuminatiwatcher", "https://www.patreon.com/posts/how-to-add-rss-15039514", "https://www.patreon.com/illuminatiwatcher", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.stitcher.com/podcast/illuminatiwatcher/conspiracy-theories-and-unpopular-culture", "https://illuminatiwatcher.com/the-dark-path-conspiracy-theories-of-illuminati-and-occult-symbolism-in-pop-culture-the-new-age-alien-agenda-satanic-transhumanism/", "https://itunes.apple.com/us/podcast/conspiracy-theories-unpopular/id792508884?mt=2", "https://www.patreon.com/illuminatiwatcher", "https://www.instagram.com/isaacweishaupt/", "https://twitter.com/IlluminatiEyes", "https://www.facebook.com/Illuminatiwatcher/", "https://illuminatiwatcher.com/start/", "https://Gumroad.com/IsaacW", "https://gumroad.com/IsaacW", "https://www.patreon.com/illuminatiwatcher", "https://illuminatiwatcher.com/gretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles/?share=twitter", "https://illuminatiwatcher.com/gretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles/?share=facebook", "mailto:?subject=%5BShared%20Post%5D%20Gretel%20and%20Hansel%20Film%20Analysis%3A%20Occult%20Magick%2C%20Demon%20Food%2C%20Witchcraft%20%26%20Triangles%21&body=https%3A%2F%2Filluminatiwatcher.com%2Fgretel-and-hansel-film-analysis-occult-magick-demon-food-witchcraft-triangles%2F&share=email", "https://www.patreon.com/illuminatiwatcher", "https://www.audible.com/t2/title?asin=B0759MN23F"], "authors": ["Isaac Weishaupt"], "publish_date": "2020-07-21T12:44:36+00:00"}