{"result_id": "166024", "URL": "https://www.independentsciencenews.org/health/the-long-history-of-accidental-laboratory-releases-of-potential-pandemic-pathogens/", "timestamp": "2023-04-25 15:36:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/the-long-history-of-accidental-laboratory-releases-of-potential-pandemic-pathogens/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Long History of Accidental Laboratory Releases of Potential Pandemic Pathogens Is Being Ignored In the COVID-19 Media Coverage", "cleaned_text": "Many people are dismissing the possibility that the COVID-19 pandemic might have come from a lab. It is possible that they are unaware of the frequency of biohazards escaping from laboratories.\n\nOn Feb. 11, I asked Anne Schuchat, the CDC’s Principal Deputy Director, at the National Press Club if it were a “complete coincidence” that the outbreak of the novel coronavirus happened in Wuhan, a center of China’s declared biowarfare/biodefence capacity. I got an answer that was remarkably evasive. She wouldn’t answer my followup question about whether the claimed “zoonotic origin” precluded the outbreak from being caused by pathogens from nature that then could be accidentally leaked from the labs.\n\nBut neither are the facts always being provided to the public. A search on “Democracy Now” shows that the first time the program mentioned “Wuhan” and “lab” or “laboratory” was on April 6 — to credit “the Wuhan lab that identified the coronavirus that causes COVID-19.” Mainstream outlets at least reported the existence of the lab to their audiences in a somewhat timely manner, even if they distorted the information.\n\nAnd skew the information they did.\n\nForbes (3/17/20) published the piece “No, COVID-19 Coronavirus Was Not Bioengineered. Here’s The Research That Debunks That Idea,” which depends on a misreading of a strange and misleading Nature Medicine article to dismiss the notion that it came out of a lab. The Forbes senior contributor on health, Bruce Y. Lee wrote: “it’s a lot easier to leak a pocket of air though your butt than a virus from a BSL-4 facility.” Apparently this was supposed to be reassuring.\n\nSimilarly CNN (4/6/20) mocked the notion of a lab leak when re-assessing the source of the pandemic, describing one possibility being that: “It leaked — like a genie out of a bottle — from a lab in an accident.”\n\nBut even a cursory look at the record shows that these labs, where ever they exist, have a lot of accidents — just from 2019, the New York Times (8/5/19) reported: “Deadly Germ Research Is Shut Down at Army Lab Over Safety Concerns”, an article about Fort Detrick in Maryland: “Problems with disposal of dangerous materials led the government to suspend research at the military’s leading biodefense center.” (The local paper, the Frederick News-Post has provided some coverage, including publishing letters by local activist Barry Kissin.)\n\nUSA Today had a reporter on this beat, Alison Young, but she left the paper. A sampling of her work:\n\n“CDC failed to disclose lab incidents with bioterror pathogens to Congress” (6/23/16):\n\n“GAO finds more gaps in oversight of bioterror germs studied in U.S.”:\n\n“Government regulators have no idea how often laboratories working with some of the world’s most dangerous viruses and bacteria are failing to fully kill vials of specimens before sending them to other researchers who lack critical gear to protect them against infection, according to a new report by the Government Accountability Office.” (9/21/16)\n\nEven since the start of the COVID-19 outbreak, Nature reported: “Chinese institutes investigate pathogen outbreaks in lab workers.” (12/17/19)\n\nThen, on April 16, “Democracy Now” interviewed Peter Daszak of the EcoHealth Alliance. Daszak is an interested party. He has worked with and helped fund the coronavirus experiments at the Wuhan Institute of Virology. He dismissed the prospect of lab release outright. The episode was headlined: “’Pure Baloney’: Zoologist Debunks Trump’s COVID-19 Origin Theory, Explains Animal-Human Transmission.”\n\nListeners to “Democracy Now” were not given elementary facts about the history of lab accidents. They were also not told that among the policy advisors for EcoHealth Alliance are David Franz, a former commander at Fort Detrick, the principle U.S. government biowarfare/biodefence facility and Thomas Geisbert, who is doing biodefence/biowarfare work at Galveston National Laboratory. EcoHealth Alliance partners include universities but also major corporations like Johnson & Johnson and Colgate Palmolive. Most importantly the EcoHealth Alliance has worked with USAID to fund dangerous collaborative work between scientists in the U.S. and in Wuhan.\n\nAccording to Daszak they are simply trying to defend against pandemics. This requires collecting and even creating dangerous pathogens for the stated purpose of defending against them.\n\nBut, to Richard Ebright of Rutgers University, an eminent scientist and one of the few who scrutinize the well-funded biodefense/biowarfare networks, this is all incredibly dangerous:. Ebright calls it “Not ‘vaccine research.’ Not research that provides information useful for preventing or combatting outbreaks. Just reckless pseudo-scientific Indiana-Jones adventurism with high risk of infection of collector, and from there, infection of public.” He also charges that collecting thousands of such viruses is the “Definition of insanity.”\n\nInterestingly, even the researcher who Daszak’s group supports at the Wuhan Institute of Virology says that she was initially quite concerned that the lab was the source. Shi Zhengli was profiled by Scientific American, (March 11, 2020) “How China’s ‘Bat Woman’ Hunted Down Viruses from SARS to the New Coronavirus“: “If coronaviruses were the culprit, she remembers thinking, ‘could they have come from our lab?’ … Shi breathed a sigh of relief when the results came back: none of the sequences matched those of the viruses her team had sampled from bat caves. ‘That really took a load off my mind,’ she says. ‘I had not slept a wink for days.'”\n\nShe seems more self reflective than Daszak, but why should the world take her word? As Ebright at Rutgers states: “A denial is not a refutation.”\n\nIn fact, there is no doubt that Fox News Channel, Senator Tom Cotton, and others are clearly trying to demonize China and portray Chinese labs as uniquely dangerous. The liberal counter to this is that Chinese labs are great, like U.S. labs. Excluded from this “discussion” is the obvious truth: These labs are all dangerous and there is no meaningful distinction between biowarfare and biodefence. The U.S. has effectively spurred a bioweapons arms race, as documented by Francis Boyle in his Biowarfare and Terrorism (2005).\n\nBy not taking on the issue of biowarfare, the left is effectively turning it over to the prowar right which is weaponizing it against China. The better tack, surely, is to take a comprehensive approach to ensure a bioweapons arms race doesn’t continue to threaten humanity.\n\nOn Fox, Sen. Cotton stated that U.S. labs do work that is “in large part done for preventative purposes,” like “trying to discover vaccines.” In contrast, “China is obviously very secretive about what happens at the Wuhan laboratory.” (FNC 2/16/20) In fact, all countries who do this work are secretive. Much of the rightwing coverage in the U.S. on this issue has been led by the reporting of Bill Gertz in the Washington Times whose books include The China Threat: How the People’s Republic Targets America and, from 2019: Deceiving the Sky: Inside Communist China’s Drive for Global Supremacy.\n\nSimilarly, Josh Rogin’s reporting in the Washington Post, “State Department cables warned of safety issues at Wuhan lab studying bat coronaviruses” emanates from self serving elements of the U.S. government.\n\nIf current dynamics continue, the rightwing will use the issue of biolabs to demonize China, and perhaps other states, without there being any serious scrutiny applied to bioweapons work by the U.S. and its allies (Israel has not even signed the Biological Weapons Convention).\n\nWhile some seek to demonize China, others, like David Ignatius of the Washington Post are calling for the U.S. and Chinese governments to work together. As are some Chinese officials. That can be a very dangerous proposition as well. Consider the dynamics of the other major weapon threatening humanity: nuclear weapons. The U.S. and Russia are effectively colluding to maintain their geopolitical power by maintaining their nuclear weapons stockpiles. They have blocked moves toward a nuclear weapons ban — an effort backed at the UN by 122 countries. There has been precious little discussion about this issue even though the group behind the effort, the International Campaign to Abolish Nuclear Weapons, once won the Nobel Peace Prize. I challenged this collusion by asking about it at the Trump-Putin summit in Helsinki but was dragged out of the hall, shackled, thrown in the back of a police vehicle and detained for six hours.\n\nFollowing the 9/11 anthrax attacks, which likely originated in U.S. government labs — the U.S. government perversely and dramatically escalated spending on “biodefence” — building more labs all over the country, training hundreds if not thousands of more scientists to work on the planet’s most dangerous pathogens. This spending approximates to about five billion dollars each year since the anthrax attacks.\n\nOn April 21, the Times published the piece “How Scientists Could Stop the Next Pandemic Before It Starts,” about Daszak and friends, complete with fancy graphic, in which the Times states: “Researchers believe they could pre-emptively create vaccines and drugs to fight a wide range of viral threats — if they can get sufficient funding.”\n\nSo, while we still don’t know if the cause of the pandemic wasn’t this dangerous lab work, the people doing it — who are well funded already — are getting pieces into the New York Times effectively beating down the door for even more money.\n\nAnd Ft. Detrick is about to get what appears to be the biggest and expensive “biodefense” lab ever built.\n\nStill sanguine about the labs? In 2018, the Federal Select Agent Program “received eight reports of loss and 193 reports of a release of a biological select agent or toxin.”\n\nOr try reading this excellent 2014 paper — “Laboratory Escapes and ‘Self-fulfilling prophecy’ Epidemics” — by Martin Furmanski of the Scientist’s Working Group on Chemical and Biologic Weapons and the Center for Arms Control and Nonproliferation (versions of it were published in the Bulletin of the Atomic Scientists and Slate):\n\nHe warned of “The danger to world or regional public health from the escape from microbiology laboratories of pathogens capable of causing pandemics, or Potentially Pandemic Pathogens (PPPs).”\n\nFurmanski documented smallpox accidental releases in Britain in the 1970s, which eventually led to the head of the lab committing suicide, Venezuelan equine encephalitis in 1995, foot-and-mouth disease in Britain in 2007 which began “4 kilometers from a biosafety level 4 laboratory.”\n\nMore recently, he notes: “SARS has not naturally recurred, but there have been six separate ‘escapes’ from virology labs studying it: one each in Singapore and Taiwan, and in four distinct events at the same laboratory in Beijing. …\n\n“It should be emphasized that these examples are only the ‘tip of the iceberg’ because they represent laboratory accidents that have actually caused illness outside of the laboratory in the general public environment. …\n\n“Public awareness of the 1977 H1N1 pandemic and its likely laboratory origins has been virtually absent. Virologists and public health officials with the appropriate sophistication were quickly aware that a laboratory release was the most likely origin, but they were content not to publicize this, aware that such embarrassing allegations would likely end the then nascent cooperation of Russian and Chinese virologists, which was vital to worldwide influenza surveillance. …\n\n“It is hardly reassuring that despite stepwise technical improvements in containment facilities and increased policy demands for biosecurity procedures in the handling of dangerous pathogens, that escapes of these pathogens regularly occur and cause outbreaks in the general environment. Looking at the problem pragmatically, question is not such escapes will happen in the future, but rather what the pathogen may be and how such an escape will be contained, if indeed it can be contained at all.\n\n“Advances in genetic manipulation now allow the augmentation of virulence and transmissibility in dangerous pathogens, and such experiments have been funded and performed, notably in the H5N1 avian influenza virus. The advisability of performing such experiments at all, and particularly in laboratories placed at universities in heavily populated urban areas, where laboratory personnel who are potentially exposed are in daily contact with a multitude of susceptible and unaware citizens is clearly in question. If such manipulations should be allowed at all, it would seem prudent to conduct them in isolated laboratories where personnel are sequestered from the general public and must undergo a period of ‘exit quarantine’ before re-entering civilian life.”\n\nSam Husseini is an independent journalist and founder of VotePact.org, which encourages principled progressives and conscientious conservatives to work together.\n\nThis article first appeared on his website.\n\nEditor’s note. We welcome comments and information about the subject of this article. However, please note that the “reply” function in the comments section is not working for people without high level access to the website. There are two possible solutions for readers wanting to reply to specific comments:\n\n 1) Enter your comment but name the commenter you are responding to (if necessary with the date of their comment). Or,\n\n 2) Mail your comment to the editor: [email protected] and they will post it as a reply. Please be sure to say who/what you are replying to.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Long History of Accidental Laboratory Releases of Potential Pandemic Pathogens Is Being Ignored In the COVID-19 Media Coverage - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "Even a cursory look at the record shows that these labs, where ever they exist, have a lot of accidents.", "url": "https://www.independentsciencenews.org/health/the-long-history-of-accidental-laboratory-releases-of-potential-pandemic-pathogens/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-05-05T00:39:00+00:00", "article:modified_time": "2021-02-20T00:59:23+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/05/usamriid-high-containment-lab-outside.jpg", "image:width": "1440", "image:height": "710", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://husseini.posthaven.com/did-this-virus-come-from-a-lab-maybe-not-but-it-exposes-the-threat-of-a-biowarfare-arms-race", "https://husseini.posthaven.com/questioning-the-cdc-is-it-a-complete-coincidence-that-chinas-only-bsl4-is-in-wuhan", "https://www.google.com/search?q=site%3Ademocracynow.org+wuhan+%22lab%22&oq=site%3Ademocracynow.org+wuhan+%22lab%22&aqs=chrome.0.69i59j69i58.76461j0j4&sourceid=chrome&ie=UTF-8", "https://www.google.com/search?sxsrf=ALeKk03LiNp6Kld0Yyehi2TLfAzcd8ir4A%3A1586447939639&ei=Q0aPXsfGJqytytMPwIyE8A4&q=site%3Ademocracynow.org+wuhan+%22laboratory%22&oq=site%3Ademocracynow.org+wuhan+%22laboratory%22&gs_lcp=CgZwc3ktYWIQA0oJCBcSBTEyLTk0SggIGBIEMTItNFDHrwFYx68BYPSxAWgAcAB4AIABogGIAfACkgEDMy4xmAEAoAECoAEBqgEHZ3dzLXdpeg&sclient=psy-ab&ved=0ahUKEwiH9JWP29voAhWslnIEHUAGAe4Q4dUDCAw&uact=5", "https://www.democracynow.org/2020/4/6/headlines/trump_ignores_his_govts_recommendations_says_he_wont_wear_face_mask_and_touts_anti_malarial_drug", "https://www.forbes.com/sites/brucelee/2020/03/17/covid-19-coronavirus-did-not-come-from-a-lab-study-shows-natural-origins/", "http://anthraxvaccine.blogspot.com/2020/03/there-are-many-ways-novel-coronavirus.html", "https://www.tabletmag.com/sections/science/articles/origin-covid-outbreak-wuhan", "http://anthraxvaccine.blogspot.com/2020/04/why-are-some-of-us-top-scientists.html", "https://www.cnn.com/2020/04/06/us/coronavirus-scientists-debate-origin-theories-invs/index.html", "https://www.nytimes.com/2019/08/05/health/germs-fort-detrick-biohazard.html", "https://www.fredericknewspost.com/opinion/letter_to_editor/safety-at-fort-detrick/article_c8b43aa6-934e-527c-9866-5477bf9d0b84.html", "https://www.usatoday.com/story/news/nation/2014/08/17/reports-of-incidents-at-bioterror-select-agent-labs/14140483/", "https://www.usatoday.com/story/news/2015/03/11/tulane-employee-bacteria-exposure/70181372/ 3/11/15", "https://www.usatoday.com/story/news/2016/06/23/undisclosed-cdc-lab-incidents/86305700/ 6/23/16", "https://www.usatoday.com/story/news/2016/09/21/gao-inactivation-failures-high-containment-labs/90776218/", "https://www.usatoday.com/story/news/2017/01/17/congress-wants-details-of-cdc-lab-accidents/96551636/", "https://www.nature.com/articles/d41586-019-03863-z", "https://www.democracynow.org/2020/4/16/peter_daszak_coronavirus", "https://www.utmb.edu/newsroom/article9738.aspx", "https://www.utmb.edu/gnl/about/about-the-gnl", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4797993/", "https://chem.rutgers.edu/people/faculty-bio/140-ebright-richard", "https://twitter.com/R_H_Ebright/status/1230764157198196736", "https://twitter.com/r_h_ebright/status/1238008108485619712?s=11", "https://www.scientificamerican.com/article/how-chinas-bat-woman-hunted-down-viruses-from-sars-to-the-new-coronavirus1/", "https://www.claritypress.com/files/BoyleIV.html", "https://www.youtube.com/watch?time_continue=1&v=ytGIkcCh7T8&feature=emb_title", "https://www.washingtontimes.com/staff/bill-gertz/", "https://www.washingtonpost.com/opinions/2020/04/14/state-department-cables-warned-safety-issues-wuhan-lab-studying-bat-coronaviruses/", "http://accuracy.org/release/122-nations-vote-to-outlaw-nuclear-weapons-u-s-russia-collude-against-effort/", "https://www.thenation.com/article/archive/came-journalist-ask-important-questions/", "https://www.nytimes.com/2008/09/18/washington/18anthrax.html", "https://www.ncbi.nlm.nih.gov/pubmed/19772453", "https://www.nytimes.com/2020/04/21/magazine/pandemic-vaccine.html?referringSource=articleShare", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4028196/", "https://www.wsp.com/en-US/insights/usamriid-high-containment-research-lab", "https://anthraxvaccine.blogspot.com/2020/04/select-agents-like-sars-cov-2-are.html", "https://www.selectagents.gov/resources/FSAP_Annual_Report_2018_508.pdf", "https://armscontrolcenter.org/wp-content/uploads/2016/02/Escaped-Viruses-final-2-17-14-copy.pdf", "https://thebulletin.org/2014/03/threatened-pandemics-and-laboratory-escapes-self-fulfilling-prophecies/", "https://slate.com/technology/2014/04/how-dangerous-viruses-could-escape-from-laboratories.html", "http://www.fao.org/ag/againfo/commissions/docs/training/material/UK2007_perspectives.pdf", "https://thebulletin.org/2014/03/threatened-pandemics-and-laboratory-escapes-self-fulfilling-prophecies/", "https://husseini.posthaven.com/", "http://votepact.org/", "/cdn-cgi/l/email-protection", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-05-05T00:39:00+00:00"}