{"result_id": "166023", "URL": "https://www.independentsciencenews.org/health/the-case-is-building-that-covid-19-had-a-lab-origin/", "timestamp": "2023-04-25 15:36:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/the-case-is-building-that-covid-19-had-a-lab-origin/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Case Is Building That COVID-19 Had a Lab Origin", "cleaned_text": "If the public has learned a lesson from the COVID-19 pandemic it is that science does not generate certainty. Do homemade face masks work? What is the death rate of COVID-19? How accurate are the tests? How many people have no symptoms? And so on. Practically the lone undisputed assertion made so far is that all the nearest known genetic relatives of its cause, the Sars-CoV-2 virus, are found in horseshoe bats (Zhou et al., 2020). Therefore, the likely viral reservoir was a bat.\n\nHowever, most of these ancestor-like bat coronaviruses cannot infect humans (Ge et al., 2013). In consequence, from its beginning, a key question hanging over the pandemic has been: How did a bat RNA virus evolve into a human pathogen that is both virulent and deadly?\n\nThe answer almost universally seized upon is that there was an intermediate species. Some animal, perhaps a snake, perhaps a palm civet, perhaps a pangolin, served as a temporary host. This bridging animal would probably have had an ACE2 cellular receptor (the molecule which allows cellular entry of the virus) intermediate in protein sequence (or at least structure) between the bat and the human one (Wan et al., 2020).\n\nIn the press and in the scientific literature, scenarios by which this natural zoonotic transfer might have occurred have been endlessly mulled. Most were fuelled by early findings that many of the earliest COVID-19 cases seem to have occurred in and around Wuhan’s Huanan live animal market. [The latest data are that 14 of the 41 earliest cases, including the first, had no connection to the animal market (Huang et al. 2020)].\n\nSince the two previous coronavirus near-pandemics of SARS (2002-3) and MERS (2012) both probably came from bats and both are thought (but not proven) to have transitioned to humans via intermediate animals (civets and dromedaries respectively), a natural zoonotic pathway is a reasonable first assumption (Andersen et al., 2020).\n\nThe idea, as it applied to the original (2002) SARS outbreak, is that the original bat virus infected a civet. The virus then evolved briefly in this animal species, but not enough to cause a civet pandemic, and then was picked up by a human before it died out in civets. In this first human (patient zero) the virus survived, perhaps only barely, but was passed on, marking the first case of human to human transmission. As it was successively passed on in its first few human hosts the virus rapidly evolved, adapting to better infect its new hosts. After a few such tentative transmissions the pandemic proper began.\n\nPerhaps this scenario is approximately how the current COVID-19 pandemic began.\n\nBut one other troubling possibility must be dispensed with. It follows from the fact that the epicentre city, Wuhan (pop. 11 million), happens to be the global epicentre of bat coronavirus research (e.g. Hu et al., 2017).\n\nPrompted by this proximity, various researchers and news media, prominently the Washington Post, and with much more data Newsweek, have drawn up a prima facie case that a laboratory origin is a strong possibility (Zhan et al., 2020; Piplani et al., 2020). That is, one of the two labs in Wuhan that has worked on coronaviruses accidentally let a natural virus escape; or, the lab was genetically engineering (or otherwise manipulating) a Sars-CoV-2-like virus which then escaped.\n\nUnfortunately, in the US at least, the question of the pandemic’s origin has become a political football; either an opportunity for Sinophobia or a partisan “blame game“.\n\nBut the potential of a catastrophic lab release is not a game and systemic problems of competence and opacity are certainly not limited to China (Lipsitch, 2018). The US Department of Homeland Security (DHS) is currently constructing a new and expanded national Bio and Agro-defense facility in Manhattan, Kansas. DHS has estimated that the 50-year risk (defined as having an economic impact of $9-50 billion) of a release from its lab at 70%.\n\nWhen a National Research Council committee inspected these DHS estimates they concluded “The committee finds that the risks and costs could well be significantly higher than that“.\n\n“the committee was instructed to judge the adequacy and validity of the uSSRA [updated Site-Specific Risk Assessment]. The committee has identified serious concerns about (1) the misapplication of methods used to assess risk, (2) the failure to make clear whether and how the evidence used to support risk assessment assumptions had been thoroughly reviewed and adequately evaluated, (3) the limited breadth of literature cited and the misinterpretation of some of the significant supporting literature, (4) the failure to explain the criteria used to select assumptions when supporting literature is conflicting, (5) the failure to consider important risk pathways, and (6) the inadequate treatment of uncertainty. Those deficiencies are not equally problematic, but they occur with sufficient frequency to raise doubts about the adequacy and validity of the risk results presented. In most instances (e.g., operational activities at the NBAF), the identified problems lead to an underestimation of risk; in other instances (e.g., catastrophic natural hazards), the risks may be overestimated. As a result, the committee concludes that the uSSRA is technically inadequate in critical respects and is an insufficient basis on which to judge the risks associated with the proposed NBAF in Manhattan, Kansas.”\n\nChina, meanwhile, having opened its first in Wuhan in 2018, is planning to roll out a national network of BSL-4 labs (Yuan, 2019). Like many other countries, it is investing significantly in disease surveillance and collection of viruses from wild animal populations and in high-risk recombinant virus research with Potential Pandemic Pathogens (PPPs).\n\nOn May 4th, nations and global philanthropies, meeting in Brussels, committed $7.4 billion to future pandemic preparedness. But the question hanging over all such investments is this: the remit of the Wuhan lab at the centre of the accidental release claims is pandemic preparedness. If the COVID-19 pandemic began there then we need to radically rethink current ideas for pandemic preparation globally. Many researchers already believe we should, for the sake of both safety and effectiveness (Lipsitch and Galvani, 2014; Weiss et al., 2015; Lipsitch, 2018). The worst possible outcome would be for those donated billions to accelerate the arrival of the next pandemic.\n\nAn accidental lab release is not merely a theoretical possibility. In 1977 a laboratory in Russia (or possibly China), most likely while developing a flu vaccine, accidentally released the extinct H1N1 influenza virus (Nakajima et al., 1978). H1N1 went on to become a global pandemic virus. A large proportion of the global population became infected. In this case, deaths were few because the population aged over 20 yrs old had historic immunity to the virus. This episode is not widely known because only recently has this conclusion been formally acknowledged in the scientific literature and the virology community has been reluctant to discuss such incidents (Zimmer and Burke, 2009; Wertheim, 2010). Still, laboratory pathogen escapes leading to human and animal deaths (e.g. smallpox in Britain; equine encephalitis in South America) are common enough that they ought to be much better known (summarised in Furmanski, 2014). Only rarely have these broken out into actual pandemics on the scale of H1N1, which, incidentally, broke out again in 2009/2010 as “Swine flu” causing deaths estimated variously at 3,000 to 200,000 on that occasion (Duggal et al., 2016; Simonsen et al. 2013).\n\nMany scientists have warned that experiments with PPPs, like the smallpox and Ebola and influenza viruses, are inherently dangerous and should be subject to strict limits and oversight (Lipsitch and Galvani, 2014; Klotz and Sylvester, 2014). Even in the limited case of SARS-like coronaviruses, since the quelling of the original SARS outbreak in 2003, there have been six documented SARS disease outbreaks originating from research laboratories, including four in China. These outbreaks caused 13 individual infections and one death (Furmanski, 2014). In response to such concerns the US banned certain classes of experiments, called ain f unction (GOF) experiments, with PPPs in 2014, but the ban (actually a funding moratorium) was lifted in 2017.\n\nFor these reasons, and also to ensure the effectiveness of future pandemic preparedness efforts­, it is a matter of vital international importance to establish whether the laboratory escape hypothesis has credible evidence to support it. This must be done regardless of the problem–in the US–of toxic partisan politics and nationalism.\n\nThe essence of the lab escape theory is that Wuhan is the site of the Wuhan Institute of Virology (WIV), China’s first and only Biosafety Level 4 (BSL-4) facility. (BSL-4 is the highest pathogen security level). The WIV, which added a BSL-4 lab only in 2018, has been collecting large numbers of coronaviruses from bat samples ever since the original SARS outbreak of 2002-2003; including collecting more in 2016 (Hu, et al., 2017; Zhou et al., 2018).\n\nLed by researcher Zheng-Li Shi, WIV scientists have also published experiments in which live bat coronaviruses were introduced into human cells (Hu et al., 2017). Moreover, according to an April 14 article in the Washington Post, US Embassy staff visited the WIV in 2018 and “had grave safety concerns” about biosecurity there. The WIV is just eight miles from the Huanan live animal market that was initially thought to be the site of origin of the COVID-19 pandemic.\n\nWuhan is also home to a lab called the Wuhan Centers for Disease Prevention and Control (WCDPC). It is a BSL-2 lab that is just 250 metres away from the Huanan market. Bat coronaviruses have in the past been kept at the Wuhan WCDPC lab.\n\nThus the lab escape theory is that researchers from one or both of these labs may have picked up a Sars-CoV-2-like bat coronavirus on one of their many collecting (aka ‘”virus surveillance”) trips. Or, alternatively, a virus they were studying, passaging, engineering, or otherwise manipulating, escaped.\n\nOn April 17 the Australian Science Media Centre asked four Australian virologists: “Did COVID-19 come from a lab in Wuhan?“\n\nThree (Edward Holmes, Nigel McMillan and Hassan Vally) dismissed the lab escape suggestion and Vally simply labeled it, without elaboration, a “conspiracy”.\n\nThe fourth virologist interviewed was Nikolai Petrovsky of Flinders University. Petrovsky first addressed the question of whether the natural zoonosis pathway was viable. He told the Media Centre:\n\n“no natural virus matching to COVID-19 has been found in nature despite an intensive search to find its origins.”\n\nThat is to say, the idea of an animal intermediate is speculation. Indeed, no credible viral or animal host intermediaries, either in the form of a confirmed animal host or a plausible virus intermediate, has to-date emerged to explain the natural zoonotic transfer of Sars-CoV-2 to humans (e.g. Zhan et al., 2020).\n\nIn addition to Petrovsky’s point, there are two further difficulties with the natural zoonotic transfer thesis (apart from the weak epidemiological association between early cases and the Huanan “wet” market).\n\nThe first is that researchers from the Wuhan lab travelled to caves in Yunnan (1,500 Km away) to find horseshoe bats containing SARS-like coronaviruses. To-date, the closest living relative of Sars-CoV-2 yet found comes from Yunnan (Ge et al., 2016). Why would an outbreak of a bat virus therefore occur in Wuhan?\n\nMoreover, China has a population of 1.3 billion. If spillover from the wildlife trade was the explanation, then, other things being equal, the probability of a pandemic starting in Wuhan (pop. 11 million) is less than 1%.\n\nZheng-Li Shi, the head of bat coronavirus research at WIV, told Scientific American as much:\n\n“I had never expected this kind of thing to happen in Wuhan, in central China.” Her studies had shown that the southern, subtropical provinces of Guangdong, Guangxi and Yunnan have the greatest risk of coronaviruses jumping to humans from animals—particularly bats, a known reservoir. If coronaviruses were the culprit, she remembers thinking, “Could they have come from our lab?”\n\nWuhan, in short, is a rather unlikely epicentre for a natural zoonotic transfer. In contrast, to suspect that Sars-CoV-2 might have come from the WIV is both reasonable and obvious.\n\nIn his statement, Petrovsky goes on to describe the kind of experiment that, in principle, if done in a lab, would obtain the same result as the hypothesised natural zoonotic transfer–rapid adaptation of a bat coronavirus to a human host.\n\n“Take a bat coronavirus that is not infectious to humans, and force its selection by culturing it with cells that express human ACE2 receptor, such cells having been created many years ago to culture SARS coronaviruses and you can force the bat virus to adapt to infect human cells via mutations in its spike protein, which would have the effect of increasing the strength of its binding to human ACE2, and inevitably reducing the strength of its binding to bat ACE2.\n\nViruses in prolonged culture will also develop other random mutations that do not affect its function. The result of these experiments is a virus that is highly virulent in humans but is sufficiently different that it no longer resembles the original bat virus. Because the mutations are acquired randomly by selection there is no signature of a human gene jockey, but this is clearly a virus still created by human intervention.”\n\nIn other words, Petrovsky believes that current experimental methods could have led to an altered virus that escaped.\n\nThe experiment mentioned by Petrovsky represents a class of experiments called passaging. Passaging is the placing of a live virus into an animal or cell culture to which it is not adapted and then, before the virus dies out, transferring it to another animal or cell of the same type. Passaging is often done iteratively. The theory is that the virus will rapidly evolve (since viruses have high mutation rates) and become adapted to the new animal or cell type. Passaging a virus, by allowing it to become adapted to its new situation, creates a new pathogen.\n\nThe most famous such experiment was conducted in the lab of Dutch researcher Ron Fouchier. Fouchier took an avian influenza virus (H5N1) that did not infect ferrets (or other mammals) and serially passaged it in ferrets. The intention of the experiment was specifically to evolve a PPP. After ten passages the researchers found that the virus had indeed evolved, to not only infect ferrets but to transmit to others in neighbouring cages (Herfst et al., 2012). They had created an airborne ferret virus, a Potential Pandemic Pathogen, and a storm in the international scientific community.\n\nThe second class of experiments that have frequently been the recipients of criticism are GOF experiments. In GOF research, a novel virus is deliberately created, either by in vitro mutation or by cutting and pasting together two (or more) viruses. The intention of such reconfigurations is to make viruses more infectious by adding new functions such as increased infectivity or pathogenicity. These novel viruses are then experimented on, either in cell cultures or in whole animals. These are the class of experiments banned in the US from 2014 to 2017.\n\nSome researchers have even combined GOF and passaging experiments by using recombinant viruses in passaging experiments (e.g. Sheahan et al., 2008).\n\nSuch experiments all require recombinant DNA techniques and animal or cell culture experiments. But the very simplest hypothesis of how Sars-CoV-2 might have been caused by research is simply to suppose that a researcher from the WIV or the WCDCP became infected during a collecting expedition and passed their bat virus on to their colleagues or family. The natural virus then evolved, in these early cases, into Sars-CoV-2. For this reason, even collecting trips have their critics. Epidemiologist Richard Ebright called them “the definition of insanity“. Handling animals and samples exposes collectors to multiple pathogens and returning to their labs then brings those pathogens back to densely crowded locations.\n\nWas the WIV doing experiments that might release PPPs?\n\nSince 2004, shortly after the original SARS outbreak, researchers from the WIV have been collecting bat coronaviruses in an intensive search for SARS-like pathogens (Li et al., 2005). Since the original collecting trip, many more have been conducted (Ge et al., 2013; Ge et al., 2016; Hu et al., 2017; Zhou et al., 2018).\n\nPetrovsky does not mention it but Zheng-Li Shi’s group at the WIV has already performed experiments very similar to those he describes, using those collected viruses. In 2013 the Shi lab reported isolating an infectious clone of a bat coronavirus that they called WIV-1 (Ge et al., 2013). WIV-1 was obtained by introducing a bat coronavirus into monkey cells, passaging it, and then testing its infectivity in human (HeLa) cell lines engineered to express the human ACE2 receptor (Ge et al., 2013).\n\nIn 2014, just before the US GOF research ban went into effect, Zheng-Li Shi of WIV co-authored a paper with the lab of Ralph Baric in North Carolina that performed GOF research on bat coronaviruses (Menachery et al., 2015).\n\nIn this particular set of experiments the researchers combined “the spike of bat coronavirus SHC014 in a mouse-adapted SARS-CoV backbone” into a single engineered live virus. The spike was supplied by the Shi lab. They put this bat/human/mouse virus into cultured human airway cells and also into live mice. The researchers observed “notable pathogenesis” in the infected mice (Menachery et al. 2015). The mouse-adapted part of this virus comes from a 2007 experiment in which the Baric lab created a virus called rMA15 through passaging (Roberts et al., 2007). This rMA15 was “highly virulent and lethal” to the mice. According to this paper, mice succumbed to “overwhelming viral infection”.\n\nIn 2017, again with the intent of identifying bat viruses with ACE2 binding capabilities, the Shi lab at WIV reported successfully infecting human (HeLa) cell lines engineered to express the human ACE2 receptor with four different bat coronaviruses. Two of these were lab-made recombinant (chimaeric) bat viruses. Both the wild and the recombinant viruses were briefly passaged in monkey cells (Hu et al., 2017).\n\nTogether, what these papers show is that: 1) The Shi lab collected numerous bat samples with an emphasis on collecting SARS-like coronavirus strains, 2) they cultured live viruses and conducted passaging experiments on them, 3) members of Zheng-Li Shi’s laboratory participated in GOF experiments carried out in North Carolina on bat coronaviruses, 4) the Shi laboratory produced recombinant bat coronaviruses and placed these in human cells and monkey cells. All these experiments were conducted in cells containing human or monkey ACE2 receptors.\n\nThe overarching purpose of such work was to see whether an enhanced pathogen could emerge from the wild by creating one in the lab. (For a very informative technical summary of WIV research into bat coronaviruses and that of their collaborators we recommend this post, written by biotech entrepreneur Yuri Deigin).\n\nIt also seems that the Shi lab at WIV intended to do more of such research. In 2013 and again in 2017 Zheng-Li Shi (with the assistance of a non-profit called the EcoHealth Alliance) obtained a grant from the US National Institutes of Health (NIH). The most recent such grant proposed that:\n\n“host range (i.e. emergence potential) will be tested experimentally using reverse genetics, pseudovirus and receptor binding assays, and virus infection experiments across a range of cell cultures from different species and humanized mice” (NIH project #5R01Al110964-04).\n\nIt is hard to overemphasize that the central logic of this grant was to test the pandemic potential of SARS-related bat coronaviruses by making ones with pandemic potential, either through genetic engineering or passaging, or both.\n\nApart from descriptions in their publications we do not yet know exactly which viruses the WIV was experimenting with but it is certainly intriguing that numerous publications since Sars-CoV-2 first appeared have puzzled over the fact that the SARS-CoV-2 spike protein binds with exceptionally high affinity to the human ACE2 receptor “at least ten times more tightly” than the original SARS (Zhou et al., 2020; Wrapp et al., 2020; Wan et al., 2020; Walls et al., 2020; Letko et al., 2020).\n\nThis affinity is all the more remarkable because of the relative lack of fit in modelling studies of the SARS-CoV-2 spike to other species, including the postulated intermediates like snakes, civets and pangolins (Piplani et al., 2020). In this preprint these modellers concluded “This indicates that SARS-CoV-2 is a highly adapted human pathogen”.\n\nGiven the research and collection history of the Shi lab at WIV it is therefore entirely plausible that a bat SARS-like cornavirus ancestor of Sars-CoV-2 was trained up on the human ACE2 receptor by passaging it in cells expressing that receptor.\n\n[On June 4 an excellent article in the Bulletin of the Atomic Scientists went further. Pointing out what we had overlooked, that the Shi lab also amplified spike proteins of collected coronaviruses, which would make them available for GOF experimentation (Ge et al., 2016).]\n\nHow do viruses escape from high security laboratories?\n\nPathogen lab escapes take various forms. According to the US Government Accountability Office, a US defense Department laboratory once “inadvertently sent live Bacillus anthracis, the bacterium that causes anthrax, to almost 200 laboratories worldwide over the course of 12 years. The laboratory believed that the samples had been inactivated.” In 2007, Britain experienced a foot and mouth disease outbreak. Its’ origin was a malfunctioning waste disposal system of a BSL-4 laboratory leaking into a stream from which neighbouring cows drank. The disposal system had not been properly maintained (Furmanski, 2014). In 2004 an outbreak of SARS originating from the National Institute of Virology (NIV) in Beijing, China, began, again, with the inadequate inactivation of a viral sample that was then distributed to non-secure parts of the building (Weiss et al., 2015).\n\nWriting for the Bulletin of The Atomic Scientists in February 2019, Lynn Klotz concluded that human error was behind most laboratory incidents causing exposures to pathogens in US high security laboratories. While equipment failure was also a factor, of the 749 incidents reported to the US Federal Select Agent Programme between 2009-2015, Klotz concluded that 79% resulted from human error.\n\nBut arguably the biggest worry is incidents that go entirely unreported because escape of the pathogen goes undetected. It is truly alarming that a significant number of pathogen escape events were uncovered only because investigators were in the process of examining a completely different incident (Furmanski, 2014). Such discoveries represent strong evidence that pathogen escapes are under-reported and that important lessons still need to be learned (Weiss et al., 2015).\n\nThe safety record of the WIV\n\nThe final important data point is the biosafety history of the WIV. The WIV was built in 2015 and became a commissioned BSL-4 lab in 2018. According to Josh Rogin of the Washington Post, US embassy officials visited the WIV in 2018. They subsequently warned their superiors in Washington of a “serious shortage of appropriately trained technicians and investigators needed to safely operate this high-containment laboratory”.\n\nAnd according to VOA News, a year before the outbreak, “a security review conducted by a Chinese national team found the lab did not meet national standards in five categories.”\n\nCredible reports from within China also question lab biosafety and its management. In 2019, Yuan Zhiming, biosecurity specialist at the WIV, cited the “challenges” of biosafety in China. According to Yuan: “several high-level BSLs have insufficient operational funds for routine yet vital processes” and “Currently, most laboratories lack specialized biosafety managers and engineers.” He recommends that “We should promptly revise the existing regulations, guidelines, norms, and standards of biosafety and biosecurity”. Nevertheless, he also notes that China intends to build “5-7” more BSL-4 laboratories (Yuan, 2019).\n\nAnd in February 2020, Scientific American interviewed Zheng-Li Shi. Accompanying the interview was a photograph of her releasing a captured bat. In the photo she is wearing a casual pink unzipped top layer, thin gloves, and no face mask or other protection. Yet this is the same researcher whose talks give “chilling” warnings about the dire risks of human contact with bats.\n\nAll of which tends to confirm the original State Department assessment. As one anonymous “senior administration official” told Rogin:\n\n“The idea that it was just a totally natural occurrence is circumstantial. The evidence it leaked from a lab is circumstantial. Right now, the ledger on the side of it leaking from the lab is packed with bullet points and there’s almost nothing on the other side.”\n\nFor all these reasons, a lab escape is by far the leading hypothesis to explain the origins of Sars-CoV-2 and the COVID-19 pandemic. The sheer proximity of the WIV and WCDCP labs to the outbreak and the nature of their work represents evidence that can hardly be ignored. The long international history of lab escapes and the biosafety concerns from all directions about the labs in Wuhan greatly strengthen the case. Especially since evidence for the alternative hypothesis, in the form of a link to wild animal exposure or the wildlife trade, remains extremely weak, being based primarily on analogy with SARS one (Bell et al,. 2004; Andersen et al., 2020).\n\nNevertheless, on April 16th Peter Daszak, who is the President of the EcoHealth Alliance, told Democracy Now! in a lengthy interview that the lab escape thesis was “Pure baloney”. He told listeners:\n\n“There was no viral isolate in the lab. There was no cultured virus that’s anything related to SARS coronavirus 2. So it’s just not possible.”\n\nDaszak made very similar claims on CBS’s Sixty Minutes: “There is zero evidence that this virus came out of a lab in China.” Instead, Daszak encouraged viewers to blame “hunting and eating wildlife”.\n\nDaszak’s certainty is highly problematic on several counts. The closest related known coronaviruses to Sars-CoV-2 are to be found at the WIV so a lot depends on what he means by “related to”. But it is also dishonest in the sense that Daszak must know that culturing in the lab is not the only way that WIV researchers could have caused an outbreak. Third, and this is not Daszak’s fault, the media are asking the right question to the wrong person.\n\nAs alluded to above, Daszak is the named principal investigator on multiple US grants that went to the Shi lab at WIV. He is also a co-author on numerous papers with Zheng-Li Shi, including the 2013 Nature paper announcing the isolation of coronavirus WIV-1 through passaging (Ge et al., 2013). One of his co-authorships is on the collecting paper in which his WIV colleagues placed the four fully functional bat coronaviruses into human cells containing the ACE2 receptor (Hu et al. 2017). That is, Daszak and Shi together are collaborators and co-responsible for most of the published high-risk collecting and experimentation at the WIV.\n\nAn investigation is needed, but who will do it?\n\nIf the Shi lab has anything to hide, it is not only the Chinese Government that will be reluctant to see an impartial investigation proceed. Much of the work was funded by the US taxpayer, channeled there by Peter Daszak and the EcoHealth Alliance. Virtually every credible international organisation that might in principle carry out such an investigation, the WHO, the US CDC, the FAO, the US NIH, including the Gates Foundation, is either an advisor to, or a partner of, the EcoHealth Alliance. If the Sars-CoV-2 outbreak originated from the bat coronavirus work at the WIV then just about every major institution in the global public health community is implicated.\n\nBut to solve many of these questions does not necessarily require an expensive investigation. It would probably be enough to inspect the lab notebooks of WIV researchers. All research scientists keep detailed notes, for intellectual property and other reasons, but especially in BSL-4 labs. As Yuan Zhiming told Nature magazine in an article marking the opening of the facility in Wuhan: “We tell them [staff] the most important thing is that they report what they have or haven’t done.”\n\nMeticulous lab records plus staff health records and incident reports of accidents and near-accidents are all essential components (or should be) of BSL work. Their main purpose is to enable the tracking of actual incidents. Much speculation could be ended with the public release of that information. But the WIV has not provided it.\n\nThis is puzzling since the Chinese government has a very strong incentive to produce those records. Complete transparency would potentially dispel the gales of blame coming its way; especially on the question of whether Sars-CoV-2 has an engineered or passaged origin. If Zheng-Li Shi and Peter Daszak are correct that nothing similar to Sars-CoV-2 was being studied there, then those notebooks should definitively exonerate the lab from having knowingly made an Actual Pandemic Pathogen.\n\nGiven the simplicity and utility of this step this lack of transparency suggests that there is something to hide. If so, it must be important. But then the question is: What?\n\nA thorough investigation of the WIV and its bat coronavirus research is an important first step. But the true questions are not the specific mishaps and dissemblings of Drs Shi or Daszak, nor of the WIV, nor even of the Chinese government.\n\nRather, the bigger question concerns the current philosophy of pandemic prediction and prevention. Deep enquiries should be made about the overarching wisdom of plucking and counting viruses from the wild and then performing dangerous ‘what if’ recombinant research in high tech but fallible biosafety labs. This is a reductionistic approach, we also note, that has so far failed to predict or protect us from pandemics and may never do so.\n\nFootnote: This article was updated on June 3rd to broaden the estimates of “Swine Flu” deaths, from 3,000 to 3- to 200,000.\n\nNote: On July 15th we published a follow-up to this article: “A Proposed Origin for SARS-CoV-2 and the COVID-19 Pandemic” which carries the analysis above much further and proposes exactly how Sars-CoV-2 might have escaped from the WIV.\n\nAndersen, K. G., Rambaut, A., Lipkin, W. I., Holmes, E. C., & Garry, R. F. (2020). The proximal origin of SARS-CoV-2. Nature medicine, 26(4), 450-452.\n\nBell, D., Roberton, S., & Hunter, P. R. (2004). Animal origins of SARS coronavirus: possible links with the international trade in small carnivores. Philosophical Transactions of the Royal Society of London. Series B: Biological Sciences, 359(1447), 1107-1114.\n\nDuggal, A., Pinto, R., Rubenfeld, G., & Fowler, R. A. (2016). Global variability in reported mortality for critical illness during the 2009-10 influenza A (H1N1) pandemic: a systematic review and meta-regression to guide reporting of outcomes during disease outbreaks. PloS one, 11(5), e0155044.\n\nFurmanski, M. (2014). Laboratory Escapes and “Self-fulfilling prophecy” Epidemics. Report: Center for Arms Control and Nonproliferation. PDF available online.\n\nGe, X. Y., Li, J. L., Yang, X. L., Chmura, A. A., Zhu, G., Epstein, J. H., … & Zhang, Y. J. (2013). Isolation and characterization of a bat SARS-like coronavirus that uses the ACE2 receptor. Nature, 503(7477), 535-538.\n\nGe, X. Y., Wang, N., Zhang, W., Hu, B., Li, B., Zhang, Y. Z., … & Wang, B. (2016). Coexistence of multiple coronaviruses in several bat colonies in an abandoned mineshaft. Virologica Sinica, 31(1), 31-40.\n\nHu, B., Zeng, L. P., Yang, X. L., Ge, X. Y., Zhang, W., Li, B., … & Luo, D. S. (2017). Discovery of a rich gene pool of bat SARS-related coronaviruses provides new insights into the origin of SARS coronavirus. PLoS pathogens, 13(11), e1006698.\n\nHuang, C., Wang, Y., Li, X., Ren, L., Zhao, J., Hu, Y., … & Cheng, Z. (2020). Clinical features of patients infected with 2019 novel coronavirus in Wuhan, China. The lancet, 395(10223), 497-506.\n\nKlotz, L. C., & Sylvester, E. J. (2014). The consequences of a lab escape of a potential pandemic pathogen. Frontiers in public health, 2, 116.\n\nLetko, M., Marzi, A., & Munster, V. (2020). Functional assessment of cell entry and receptor usage for SARS-CoV-2 and other lineage B betacoronaviruses. Nature microbiology, 5(4), 562- 569.\n\nLi, W., Shi, Z., Yu, M., Ren, W., Smith, C., Epstein, J. H., … & Zhang, J. (2005). Bats are natural reservoirs of SARS-like coronaviruses. Science, 310(5748), 676-679.\n\nLipsitch, M. (2018). Why Do Exceptionally Dangerous Gain-of-Function Experiments in Influenza?. In Influenza Virus (pp. 589-608). Humana Press, New York, NY.\n\nLipsitch, M., & Galvani, A. P. (2014). Ethical alternatives to experiments with novel potential pandemic pathogens. PLoS Med, 11(5), e1001646.\n\nNakajima, K., Desselberger, U., & Palese, P. (1978). Recent human influenza A (H1N1) viruses are closely related genetically to strains isolated in 1950. Nature, 274(5669), 334-339.\n\nNational Research Council. (2012). Evaluation of the updated site-specific risk assessment for the national bio-and agro-defense facility in Manhattan, Kansas. National Academies Press.\n\nPiplani, S., Singh, P. K., Winkler, D. A., & Petrovsky, N. (2020). In silico comparison of spike protein-ACE2 binding affinities across species; significance for the possible origin of the SARS- CoV-2 virus. arXiv preprint arXiv:2005.06199.\n\nRoberts, A., Deming, D., Paddock, C. D., Cheng, A., Yount, B., Vogel, L., … & Zaki, S. R. (2007). A mouse-adapted SARS-coronavirus causes disease and mortality in BALB/c mice. PLoS Pathog, 3(1), e5.\n\nSheahan, T., Rockx, B., Donaldson, E., Sims, A., Pickles, R., Corti, D., & Baric, R. (2008). Mechanisms of zoonotic severe acute respiratory syndrome coronavirus host range expansion in human airway epithelium. Journal of virology, 82(5), 2274-2285.\n\nSimonsen, L., Spreeuwenberg, P., Lustig, R., Taylor, R. J., Fleming, D. M., Kroneman, M., … & Paget, W. J. (2013). Global mortality estimates for the 2009 Influenza Pandemic from the GLaMOR project: a modeling study. PLoS Med, 10(11), e1001558.\n\nWalls, A. C., Park, Y. J., Tortorici, M. A., Wall, A., McGuire, A. T., & Veesler, D. (2020). Structure, function, and antigenicity of the SARS-CoV-2 spike glycoprotein. Cell, 180, 281-292.\n\nWan, Y., Shang, J., Graham, R., Baric, R. S., & Li, F. (2020). Receptor recognition by the novel coronavirus from Wuhan: an analysis based on decade-long structural studies of SARS coronavirus. Journal of virology, 94(7).\n\nWeiss, S., Yitzhaki, S., & Shapira, S. C. (2015). Lessons to be Learned from Recent Biosafety Incidents in the United States. The Israel Medical Association Journal: IMAJ, 17(5), 269-273.\n\nWertheim, J. O. (2010). The re-emergence of H1N1 influenza virus in 1977: a cautionary tale for estimating divergence times using biologically unrealistic sampling dates. PloS one, 5(6), e11184.\n\nWrapp, D., Wang, N., Corbett, K. S., Goldsmith, J. A., Hsieh, C. L., Abiona, O., … & McLellan, J. S. (2020). Cryo-EM structure of the 2019-nCoV spike in the prefusion conformation. Science, 367(6483), 1260-1263.\n\nZhan, S. H., Deverman, B. E., & Chan, Y. A. (2020). SARS-CoV-2 is well adapted for humans. What does this mean for re-emergence?. bioRxiv. doi: https://doi.org/10.1101/2020.05.01.073262\n\nZimmer, S. M., & Burke, D. S. (2009). Historical perspective—emergence of influenza A (H1N1) viruses. New England Journal of Medicine, 361(3), 279-285.\n\nZhou, P., Fan, H., Lan, T., Yang, X. L., Shi, W. F., Zhang, W., … & Zheng, X. S. (2018). Fatal swine acute diarrhoea syndrome caused by an HKU2-related coronavirus of bat origin. Nature, 556(7700), 255-258.\n\nZhou, P., Yang, X. L., Wang, X. G., Hu, B., Zhang, L., Zhang, W., … & Chen, H. D. (2020). A pneumonia outbreak associated with a new coronavirus of probable bat origin. nature, 579(7798), 270-273.\n\nEditor’s note. We welcome comments and information about the subject of this article. However, please note that the “reply” function in the comments section is not working for people without high level access to the website. There are two possible solutions for readers wanting to reply to specific comments:\n\n 1) Enter your comment but name the commenter you are responding to (if necessary with the date of their comment). Or,\n\n 2) Mail your comment to the editor: [email protected] and they will post it as a reply. Please be sure to say who/what you are replying to.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Case Is Building That COVID-19 Had a Lab Origin", "description": "What are the chances, after all, that the epicentre of the COVID-19 outbreak should occur within literal walking distance of the leading research and collection centre in the world for SARS-like bat coronaviruses? This article explains the specific lab accident scenarios and describes how the kind of research conducted at the WIV makes a lab accident a strong possibility.", "url": "https://www.independentsciencenews.org/health/the-case-is-building-that-covid-19-had-a-lab-origin/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-06-02T00:34:26+00:00", "article:modified_time": "2021-02-20T00:58:48+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/05/Shi-Zheng-Li-bat-release.jpg", "image:width": "1910", "image:height": "1277", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s41586-020-2012-7?rel=outbound", "https://www.nature.com/articles/nature12711", "https://doi.org/10.1128/JVI.00127-20", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7159299/", "https://www.nature.com/articles/S41591-020-0820-9", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5708621/", "https://twitter.com/R_H_Ebright", "https://thebulletin.org/2020/05/natural-spillover-or-research-lab-leak-why-a-credible-investigation-in-needed-to-determine-the-origin-of-the-coronavirus-pandemic/", "https://www.washingtonpost.com/opinions/global-opinions/how-did-covid-19-begin-its-initial-origin-story-is-shaky/2020/04/02/1475d488-7521-11ea-87da-77a8136c1a6d_story.html", "https://www.newsweek.com/controversial-wuhan-lab-experiments-that-may-have-started-coronavirus-pandemic-1500503", "https://www.biorxiv.org/content/10.1101/2020.05.01.073262v1", "https://arxiv.org/pdf/2005.06199.pdf", "https://www.theunion.com/opinion/columns/terry-mclaughlin-enough-with-the-blame-game-on-covid-19-response/", "https://link.springer.com/protocol/10.1007/978-1-4939-8678-1_29", "https://en.wikipedia.org/wiki/National_Bio_and_Agro-Defense_Facility", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4128296/", "https://www.nap.edu/catalog/13418/evaluation-of-the-updated-site-specific-risk-assessment-for-the-national-bio-and-agro-defense-facility-in-manhattan-kansas", "https://www.sciencedirect.com/science/article/pii/S2588933819300391", "https://thehill.com/opinion/international/499351-emerging-disease-foreign-assistance-needs-to-focus-on-the-root", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4028196/", "https://europepmc.org/article/med/26137650", "https://link.springer.com/protocol/10.1007/978-1-4939-8678-1_29", "https://www.nature.com/articles/274334a0", "http://www.ncbi.nlm.nih.gov/pubmed/19564632", "https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0011184", "https://armscontrolcenter.org/wp-content/uploads/2016/02/Escaped-Viruses-final-2-17-14-copy.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4865181/", "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1001558", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4028196/", "https://www.frontiersin.org/articles/10.3389/fpubh.2014.00116/full", "https://www.nature.com/articles/d41586-017-08837-7", "https://www.hsph.harvard.edu/news/features/deadly-pathogen-research-controversy/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5708621/", "https://www.nature.com/articles/s41586-018-0010-9", "https://www.bendbulletin.com/opinion/commentary-state-department-cables-warned-of-safety-issues-at-wuhan-lab-studying-bat-coronaviruses/article_8ffbfcf2-7e79-11ea-b101-cbcc5394b481.html", "https://project-evidence.github.io/", "https://www.scimex.org/newsfeed/expert-reaction-did-covid-19-come-from-a-lab-in-wuhan", "https://www.biorxiv.org/content/10.1101/2020.05.01.073262v1", "https://link.springer.com/article/10.1007/s12250-016-3713-9", "https://www.scientificamerican.com/article/how-chinas-bat-woman-hunted-down-viruses-from-sars-to-the-new-coronavirus1/", "https://science.sciencemag.org/content/336/6088/1534", "https://www.the-scientist.com/the-nutshell/moratorium-on-gain-of-function-research-36564", "https://www.hsph.harvard.edu/news/features/deadly-pathogen-research-controversy/", "https://jvi.asm.org/content/jvi/82/5/2274.full.pdf", "https://chem.rutgers.edu/people/faculty-bio/140-ebright-richard", "https://www.independentsciencenews.org/health/the-long-history-of-accidental-laboratory-releases-of-potential-pandemic-pathogens/", "https://www.jstor.org/stable/pdf/3842715.pdf?casa_token=YNwrDhA45zYAAAAA:Q1w6bI9t_5T_OcytwAUhnmabHVzflKhmzccU7_iRM82HTeb3CsGer3Yt5FLOG_hwPC74OLZAT7ZXrP3w9rjLtNyUGlbrfDSDvR2tvs3cq964RpHCocc", "https://www.nature.com/articles/nature12711", "https://link.springer.com/article/10.1007/s12250-016-3713-9", "https://www.nature.com/articles/s41586-018-0010-9", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4797993/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1769406/", "https://medium.com/@yurideigin/lab-made-cov2-genealogy-through-the-lens-of-gain-of-function-research-f96dd7413748", "https://www.ecohealthalliance.org/?gclid=EAIaIQobChMI-M2esq3P6QIVBL7ACh3YaADkEAAYASAAEgJgO_D_BwE", "https://grantome.com/grant/NIH/R01-AI110964-04", "https://doi.org/10.1038/s41586-020-2012-7", "https://doi.org/10.1126/science.abb2507", "https://doi.org/10.1128/JVI.00127-20", "https://doi.org/10.1101/2020.02.19.956581", "https://doi.org/10.1038/s41564-020-0688-y", "https://arxiv.org/pdf/2005.06199.pdf", "https://thebulletin.org/2020/06/did-the-sars-cov-2-virus-arise-from-a-bat-coronavirus-research-program-in-a-chinese-laboratory-very-possibly/", "https://www.gao.gov/assets/680/679392.pdf", "https://armscontrolcenter.org/wp-content/uploads/2016/02/Escaped-Viruses-final-2-17-14-copy.pdf", "https://europepmc.org/article/med/26137650", "https://thebulletin.org/2019/02/human-error-in-high-biocontainment-labs-a-likely-pandemic-threat/", "https://www.washingtonpost.com/opinions/global-opinions/how-did-covid-19-begin-its-initial-origin-story-is-shaky/2020/04/02/1475d488-7521-11ea-87da-77a8136c1a6d_story.html", "https://www.voanews.com/covid-19-pandemic/chinese-lab-checkered-safety-record-draws-scrutiny-over-covid-19", "https://www.news.com.au/world/asia/coronavirus-chinese-batswoman-scientist-shi-zhenglis-chilling-prediction/news-story/99542343419bb8f210a4f196df1654fb", "https://www.washingtonpost.com/opinions/global-opinions/how-did-covid-19-begin-its-initial-origin-story-is-shaky/2020/04/02/1475d488-7521-11ea-87da-77a8136c1a6d_story.html", "https://royalsocietypublishing.org/doi/abs/10.1098/rstb.2004.1492", "https://www.nature.com/articles/s41591-020-0820-9", "https://www.ecohealthalliance.org/board-of-directors", "https://www.democracynow.org/2020/4/16/peter_daszak_coronavirus", "https://grantome.com/search?q=@author%20%20Peter%20Daszak", "https://thebulletin.org/2020/05/will-the-who-call-for-an-international-investigation-into-the-coronaviruss-origins/", "https://www.ecohealthalliance.org/partners", "https://www.ecohealthalliance.org/partners", "https://www.ecohealthalliance.org/partners", "https://www.ecohealthalliance.org/partners", "https://www.ecohealthalliance.org/partners", "https://www.nature.com/news/inside-the-chinese-lab-poised-to-study-world-s-most-dangerous-pathogens-1.21487", "https://europepmc.org/article/med/26137650", "https://www.independentsciencenews.org/commentaries/a-proposed-origin-for-sars-cov-2-and-the-covid-19-pandemic/", "/cdn-cgi/l/email-protection", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-06-02T00:34:26+00:00"}