{"result_id": "166010", "URL": "https://www.independentsciencenews.org/news/gates-foundation-hired-pr-firm-to-manipulate-un-over-gene-drives/", "timestamp": "2023-04-25 15:36:33 CEST+0200", "meta": {"description": "The Bill and Melinda Gates Foundation paid a PR firm associated with the biotech industry to manipulate a key UN safety committee and its discussion of gene drives", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/news/gates-foundation-hired-pr-firm-to-manipulate-un-over-gene-drives/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Gates Foundation Hired PR Firm to Manipulate UN Over Gene Drives", "cleaned_text": "The Bill and Melinda Gates Foundation this year paid a PR firm called Emerging Ag $1.6 million to recruit a covert coalition of academics to manipulate a UN decision-making process over gene drives, according to emails obtained through Freedom of Information requests.\n\nGene drives are a highly controversial new genetic extinction technology. They have been proposed as potentially able to eradicate malarial mosquitoes, agricultural pests, invasive species, as well as having potential military uses.\n\nEmerging Ag calls itself “a boutique international consulting firm providing communications and public affairs services.” Its president and founder is Robynne Anderson, a former international communications director of CropLife, the global lobby group for the biotechnology, seed, and pesticide industries.\n\nThe FOIA emails reveal that the project coordinated by Emerging Ag was dubbed the “Gene Drive Research Sponsors and Supporters coalition”. It consisted of three members of a UN committee called the Ad Hoc Technical Expert Group on Synthetic Biology (AHTEG) plus a larger group of 65 covertly recruited, but seemingly independent, scientists and officials, all coordinated by a still larger number of government officials (mainly from English-speaking countries), PR advisors, academics, and members of various Gates-funded projects.\n\nThe AHTEG on Synthetic Biology is part of the UN Convention on Biological Diversity (CBD). This AHTEG is tasked with creating a formal set of regulatory recommendations to help governments avoid negative impacts on biodiversity. Its recommendations are supposed to draw from the discussions of an online forum of experts called The UN CBD Online Forum on Synthetic Biology.\n\nThe AHTEG on Synthetic Biology is about to meet, on December 5, 2017, in Montreal, where gene drive issues raised in that online forum are expected to be a significant focus of discussions.\n\nThe three AHTEG members who coordinated with Emerging Ag are Dr. Todd Kuiken of North Carolina State University, Robert Friedman of the J Craig Venter Institute, and Professor Paul Freemont of Imperial College, London. The first and last represent teams and institutions that have received at least $99 million dollars between them from the U.S. military and U.S. foundations, including Gates, to develop and test gene drive systems.\n\nAccording to the emails, which were obtained from the University of North Carolina by Edward Hammond of Prickly Research, the Gates funding for Emerging Ag was obtained to co-ordinate a “fight back against gene drive moratorium proponents.”\n\nFunding for Emerging Ag first began after the last full meeting of the UN Convention on Biological Diversity, held in Cancún, Mexico in December 2016 which witnessed calls from Southern countries and over 170 international organizations for a UN moratorium on gene drives. Adding to the pressure was a letter titled, “A Call for Conservation with a Conscience: No Place for Gene Drives in Conservation,” signed by 30 environmental leaders, including Jane Goodall. The letter asked for a “halt to all proposals for the use of gene drive technologies, but especially in conservation.”\n\nA primary function of Emerging Ag was to recruit academics. An introductory email from Stephanie James of the U.S. Foundation of the National Institutes of Health (FNIH), and the organiser of a workshop on messaging around gene drive technologies, illustrates their goal:\n\n“By way of this email, I would like to introduce you to Isabelle Coche [of Emerging Ag]. Isabelle will be working on efforts to get a broader scientific perspective represented in these discussion. She is looking for a few good scientists who have a broad perspective on the issues around gene drive and are mature enough to be able to deal with the kinds of conversations that can arise within the CBD arena. Isabelle would like the chance to explain what this all means and what activities will be needed to fight back against gene drive moratorium proponents before the next CBD meeting in 2018. Ultimately she is looking to get some volunteers to help in the cause. I hope you will all be interested enough to get back in touch with her to learn more about what this might entail. I’m sorry to say that these next few years are going to be critical and we are going to have to take the fight outside the laboratory.”\n\nThe primary task of the covertly recruited academics (those who were not on the inner circle of the AHTEG itself) was thus to stack the UN’s CBD Online Forum on Synthetic Biology. This forum was expected to discuss the wide scientific concerns about gene drives. The UN CBD process is the only multilateral process currently addressing gene drives.\n\nRecruited academics received daily briefings and instructions from Emerging Ag on how to influence the discussion:\n\n“My name is Ben Robinson, I work with Isabelle Coche & Delphine Thizy, and I will be sending you regular updates on the discussions taking place in the context of the CBD’s Open-Ended Online Forum on synthetic biology. I will monitor contributions and provide you with brief summaries of the content and tenor of conversations, while highlighting topics and posts you may wish to address. Should you feel that a topic needs to be addressed but you do not have the relevant resources or expertise, I can also help identify and coordinate those best suited among the group to respond to particular issues.”\n\nThe key role of the Gates Foundation\n\nDelphine Thizy, cited in the email above, works at Target Malaria in London, England. Target Malaria is a Gates-funded project to use gene drives against mosquitoes.\n\nEmerging Ag’s activities were overseen by Jeff Chertack who is Senior Program Officer of Global Policy and Advocacy at the Bill and Melinda Gates Foundation. He is a former public affairs executive from Ogilvy PR who previously represented biotech and pharma giants in Brussels. Chertack sat on the co-ordination team of Emerging Ag’s “Gene Drive Research Sponsors and Supporters coalition” and is copied on several strategy calls and co-ordination phone calls.\n\nThis is also not the first time that the Gates Foundation has used academics to influence public and private opinion on genetic engineering technologies, as witnessed by its funding of the Cornell Alliance for Science.\n\nAlso heavily active in coordinating the manipulation of the AHTEG on Synthetic Biology has been US nonprofit Island Conservation, which is leading the use of gene drives against invasive mammal species.\n\nIsland Conservation is the linchpin of another network, called Genetic Biocontrol of Invasive Rodents (GBIRd). Heath Packard, marketing and communications director of Island Conservation, enticed academics to join the CBD discussion process in an email dated May 30 2017:\n\n“We urge you to get yourself (or a colleague) nominated to the UN CBD Synthetic Biology Open-Ended Forum (July-Sept 2017). It is very important to have experts like yourselves to help balance policy discussions that might otherwise be weighted towards imposing a moratorium on gene drive research as we saw last winter at the CBD Convening of the Parties.”\n\nAccording to the emails, Island Conservation has numerous staff active in the promotion of gene drives, not just at the CBD but also in other scientific fora and the media. Island Conservation staff were among those who attended a workshop on “messaging” run by the Foundation of the National Institutes of Health which seems to be an independent arm of the NIH proper. The workshop’s agenda included a presentation by the Gates Foundation’s Jeff Chertack entitled “Presentation of preliminary findings of testing gene drive concepts and terminology with stakeholders and informed publics.”\n\nThe FOIA emails reveal that Emerging Ag also collaborated with a lobby group called the Public Research and Regulation Initiative (PRRI) that is little known outside the Convention on Biological Diversity.\n\nPRRI has a related influence operation which predates the efforts of Emerging Ag. Its history of lobbying the UN Convention on Biological Diversity over GMOs is mentioned in emails sent to a Canadian official on the UN AHTEG. In them, a PRRI member, Piet Vander Meer, boasts about its 24/7 “backup operation” for “like-minded” government and industry experts who sit on the AHTEG.\n\nThe emails suggest that national government representatives of Canada, U.S., UK, Brazil and the Netherlands were being remotely assisted by PRRI during closed door discussions. To help PRRI the ‘Gene Drive Research Sponsors and Supporters coalition’ offered to approach US Department of Agriculture (USDA) contacts to find additional funding for PRRI’s activities. The current funding sources of PRRI are not known but former funders include CropLife International, Monsanto and the US Grains Council.\n\n“There is no transparency about who is influencing decisions on the future of global ecosystems, people’s livelihoods, or our food system,” said Dana Perls of Friends of the Earth, U.S. “Gene drives could have profound ecological, health and socio-economic impacts, and the emails reveal a secretive attempt to game the system by gene drive proponents aiming to minimize regulations and oversight.”\n\nDespite the public perception that conservation and public health are what motivates gene drive research, it is known that, besides the contribution of the Gates Foundation, most gene drive funding comes from the DARPA, the technology foresight arm of the US Dept of Defense.\n\n“Gene drives are a powerful and dangerous new technology and potential biological weapons that could have disastrous impacts on peace, food security and the environment, especially if misused,” said Jim Thomas of ETC Group. “The fact that gene drive development is now being primarily funded and structured by the US military raises alarming questions about this entire field.”\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Gates Foundation Hired PR Firm to Manipulate UN Over Gene Drives", "description": "Emails obtained from the University of North Carolina released today show that, in advance of a UN meeting, the Bill and Melinda Gates Foundation has for months been seeking to secretly influence its outcome in favour of gene drive use.", "url": "https://www.independentsciencenews.org/news/gates-foundation-hired-pr-firm-to-manipulate-un-over-gene-drives/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2017-12-04T04:02:02+00:00", "article:modified_time": "2020-06-08T01:34:00+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2017/12/GATES-CAMPUS-.jpg", "image:width": "966", "image:height": "668", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://emergingag.com/", "https://www.theguardian.com/science/political-science/2016/jun/09/the-national-academies-gene-drive-study-has-ignored-important-and-obvious-issues", "http://www.croplife.com/", "http://www.pricklyresearch.com/webdump/genedrivefiles/", "https://www.jcvi.org/research/synthetic-biology#team", "http://www.pricklyresearch.com/webdump/genedrivefiles/", "http://www.pricklyresearch.com/", "https://www.scientificamerican.com/article/gene-drive-moratorium-shot-down-at-un-meeting/", "http://www.synbiowatch.org/wp-content/uploads/2016/09/letter_vs_genedrives.pdf", "http://www.pricklyresearch.com/webdump/genedrivefiles/Adelman_A%26M_Mails/Forum%20Lobbyists/fnih.png", "https://fnih.org/", "http://www.pricklyresearch.com/webdump/genedrivefiles/Adelman_A%26M_Mails/Forum%20Lobbyists/propaganda.jpg", "https://www.independentsciencenews.org/environment/gene-drives-a-scientific-case-for-a-complete-and-perpetual-ban/", "http://ilsirf.org/target-malaria-meeting-in-entebbe-uganda/", "https://www.scientificamerican.com/article/a-revolutionary-genetic-experiment-is-planned-for-a-west-african-village-if-residents-agree/", "http://www.pricklyresearch.com/webdump/genedrivefiles/20170601-Re_CBD%20follow%20up%20-%20reminder%20of%20our%20call%20Friday%202%20June-240%20%28N0024131xC1D49%29.PDF", "http://www.pricklyresearch.com/webdump/genedrivefiles/20170530-Re_CBD%20follow%20up%20-%20reminder%20of%20our%20call%20Friday%202%20June-136%20%28N0024130xC1D49%29.PDF", "https://www.independentsciencenews.org/news/gates-foundation-grants-additional-6-4million-to-cornells-controversial-alliance-for-science/", "https://www.islandconservation.org/", "http://www.geneticbiocontrol.org/", "http://www.pricklyresearch.com/webdump/genedrivefiles/20170530-Action%20requested%21%20CBD%20Syn%20Bio%20Forum-278.pdf", "http://www.pricklyresearch.com/webdump/genedrivefiles/20170407-Re_Gizmodo%20Media%20Inquiry-422.pdf", "http://www.pricklyresearch.com/webdump/genedrivefiles/Adelman_A%26M_Mails/Forum%20Lobbyists/propaganda.jpg", "https://corporateeurope.org/sites/default/files/sites/default/files/resource/prri.pdf", "http://genedrivefiles.synbiowatch.org/foia-cfia-syn-bio-prri-back-up-ahteg/", "http://ipbo.vib-ugent.be/about-us/piet-van-der-meer", "http://www.grains.org/", "https://foe.org/", "https://www.darpa.mil/news-events/2017-07-19", "http://www.etcgroup.org/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2017-12-04T04:02:02+00:00"}