{"result_id": "166014", "URL": "https://www.independentsciencenews.org/science-media/the-goodman-affair-monsanto-targets-the-heart-of-science/", "timestamp": "2023-04-25 15:36:35 CEST+0200", "meta": {"description": "Journal editors have a lot of power in science that provides opportunities for abuse. The industry knows this, and has moved to influence and control publishing", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/science-media/the-goodman-affair-monsanto-targets-the-heart-of-science/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Goodman Affair: Monsanto Targets the Heart of Science", "cleaned_text": "Richard Smith, former editor of the British Medical Journal, has jested that instead of scientific peer review, its rival The Lancet had a system of throwing a pile of papers down the stairs and publishing those that reached the bottom. On another occasion, Smith was challenged to publish an issue of the BMJ exclusively comprising papers that had failed peer review and see if anybody noticed. He replied, “How do you know I haven’t already done it?”\n\nAs Smith’s stories show, journal editors have a lot of power in science – power that provides opportunities for abuse. The life science industry knows this, and has increasingly moved to influence and control science publishing.\n\nThe strategy, often with the willing cooperation of publishers, is effective and sometimes blatant. In 2009, the scientific publishing giant Elsevier was found to have invented an entire medical journal, complete with editorial board, in order to publish papers promoting the products of the pharmaceutical manufacturer Merck. Merck provided the papers, Elsevier published them, and doctors read them, unaware that the Australasian Journal of Bone and Joint Medicine was simply a stuffed dummy.\n\nFast forward to September 2012, when the scientific journal Food and Chemical Toxicology (FCT) published a study that caused an international storm (Séralini, et al. 2012). The study, led by Prof Gilles-Eric Séralini of the University of Caen, France, suggested a Monsanto genetically modified (GM) maize, and the Roundup herbicide it is grown with, pose serious health risks. The two-year feeding study found that rats fed both suffered severe organ damage and increased rates of tumors and premature death. Both the herbicide (Roundup) and the GM maize are Monsanto products. Corinne Lepage, France’s former environment minister, called the study “a bomb”.\n\nSubsequently, an orchestrated campaign was launched to discredit the study in the media and persuade the journal to retract it. Many of those who wrote letters to FCT (which is published by Elsevier) had conflicts of interest with the GM industry and its lobby groups, though these were not publicly disclosed.\n\nThe journal did not retract the study (editor’s note: later they did). But just a few months later, in early 2013 the FCT editorial board acquired a new “Associate Editor for biotechnology”, Richard E. Goodman. This was a new position, seemingly established especially for Goodman in the wake of the “Séralini affair”.\n\nRichard E. Goodman is professor at the Food Allergy Research and Resource Program, University of Nebraska. But he is also a former Monsanto employee, who worked for the company between 1997 and 2004. While at Monsanto he assessed the allergenicity of the company’s GM crops and published papers on its behalf on allergenicity and safety issues relating to GM food (Goodman and Leach 2004).\n\nGoodman had no documented connection to the journal until February 2013. His fast-tracked appointment, directly onto the upper editorial board raises urgent questions. Does Monsanto now effectively decide which papers on biotechnology are published in FCT? And is this part of an attempt by Monsanto and the life science industry to seize control of science?\n\nTo equate one journal with “science” may seem like an exaggeration. But peer-reviewed publication, in the minds of most scientists, is science. Once a paper is published in an academic journal it enters the canon and stands with the discovery of plate tectonics or the structure of DNA. All other research, no matter how groundbreaking or true, is irrelevant. As a scientist once scathingly said of the “commercially confidential” industry safety data that underpin approvals of chemicals and GM foods, “If it isn’t published, it doesn’t exist.”\n\nThe industry affiliations of FCT’s new gatekeeper for biotechnology are not restricted to having worked directly for Monsanto. Goodman has an active and ongoing involvement with the International Life Sciences Institute (ILSI). ILSI is funded by the multinational GM and agrochemical companies, including Monsanto. It develops industry-friendly risk assessment methods for GM foods and chemical food contaminants and inserts them into government regulations.\n\nILSI describes itself as a public interest non-profit but its infiltration of regulatory agencies and influence on risk assessment policy has become highly controversial in North America and Europe. In 2005 US-based non-profits and trade unions wrote to the World Health Organization (WHO) protesting against ILSI’s influence on international health standards protecting food and water supplies. As a result, the WHO barred ILSI from taking part in WHO activities setting safety standards, because of its funding sources. And in Europe in 2012, Diana Banati, then head of the management board at the European Food Safety Authority (EFSA), had to resign over her undisclosed long-standing involvement with ILSI (Robinson et al. 2013).\n\nGoodman’s appointment to FCT is surprising also for the fact that the journal already has expertise in GM food safety. Of the four senior editors, José L. Domingo is a professor of toxicology and environmental health and author of two comprehensive reviews of GM food safety studies (Domingo 2007; Domingo and Bordonaba 2011). Both reviews expressed skepticism of the thesis that GMOs are safe. Consequently, it is far from clear why FCT needs an “associate editor for biotechnology”, but it is clear why Monsanto would have an interest in ensuring that the “Séralini affair” is never repeated.\n\nEditing the scientific record: The case of Paul Christou\n\nFCT is not the only academic journal that appears to have been captured by commercial interests. After the initial campaign failed to get FCT to retract the Séralini study, the journal Transgenic Research published a heavy-handed critique of the study and of the researchers themselves (Arjo et al., 2013). The lead author of that critique was Paul Christou.\n\nChristou and co-authors castigated the editor of FCT for publishing the study, calling it “a clear and egregious breach of the standards of scientific publishing”. They insisted that the journal editor retract the study “based on its clearly flawed data, its breaches of ethical standards, and the strong evidence for scientific misconduct and abuse of the peer-review process”. “Even a full retraction of the Séralini article” wrote Christou, “will not cleanse the Internet of the inflammatory images of tumorous rats.”\n\nThe same writers further implied that the Séralini study was “fraudulent”, that the researchers failed to analyse the data objectively, and that the treatment of the experimental animals was inhumane.\n\nThis is not the first time Christou has attacked scientific findings that have raised doubts about GM crops. In 2001 Ignacio Chapela and David Quist of the University of California, Berkeley, reported in the journal Nature that indigenous Mexican maize varieties had become contaminated with GM genes (Quist and Chapela, 2001). This issue was, and remains, highly controversial since Mexico is the genetic centre of origin for maize. In an exact parallel with the Séralini study, an internet campaign was waged against Chapela and Quist demanding that the journal retract the study. Then Christou, just as he was later to do with the Séralini study, attacked Chapela and Quist’s paper in an article in Transgenic Research. The title said it all: “No credible scientific evidence is presented to support claims that transgenic DNA was introgressed into traditional maize landraces in Oaxaca, Mexico” (Christou, 2002).\n\nResponding to the campaign, Nature editor Philip Campbell asked Chapela and Quist for more data, which they provided, and arranged another round of peer review. Only one reviewer in the final group of three supported retraction, and no one had presented any data or analysis that contradicted Chapela and Quist’s main finding. Nevertheless, Nature asserted, “The evidence available is not sufficient to justify the publication of the original paper”. Some subsequent investigations, testing different samples, reported finding GM genes in native landraces of Mexican corn (Pineyro-Nelson et al. 2009), while others did not (Ortiz-Garcia et al. 2005).\n\nPaul Christou, in contrast, probably did not have much trouble getting either of his critiques published in Transgenic Research. He is the journal’s editor-in-chief. And, like Goodman, Christou is connected to Monsanto. Monsanto bought the GM seed company Agracetus (Christou’s former employer) and Monsanto now holds patents for the production of GM crops on which Christou is named as the inventor. It is normal practice to declare inventor status on patents as a competing interest in scientific articles, but Christou did not disclose either conflict of interest – his editorship of the journal or his patent inventor status – in his critique of the Séralini study.\n\nThe Ermakova affair: Preemptive editing of the scientific record\n\nNot only can journal editors prevent the publication of research showing problems with GM crops in their own journals – they can effectively prevent publication elsewhere. In 2007, the leading academic journal Nature Biotechnology featured an extraordinary attack on the work of Russian scientist, Irina Ermakova (Marshall, 2007). Her laboratory research had found decreased weight gain, increased mortality, and decreased fertility in rats fed GM Roundup-tolerant soy over several generations (Ermakova, 2006; Ermakova, 2009).\n\nThe editor of Nature Biotechnology, Andrew Marshall, contacted Ermakova, inviting her to answer questions about her findings, which she had only presented at conferences. He told her it was “an opportunity to present your own findings and conclusions in your own words, rather than a critique from one side”. Ermakova agreed.\n\nThe process that followed was as deceptive as it was irregular. The editor sent Ermakova a set of questions about her research, which she answered. In due course she was sent a proof of what she thought was to be ‘her’ article, with her byline as author.\n\nHowever, the article that was finally published was very different. Ermakova’s byline had been removed and Marshall’s substituted. Each of Ermakova’s answers to the questions was followed by a lengthy critique by four pro-GM scientists (Marshall, 2007). The proof sent to Ermakova, now revealed as a ‘dummy proof’, had not included these critical comments. Consequently, she was denied the chance to address them in the same issue of the journal. And in the final article the editor had preserved the critics’ references but removed many of Ermakova’s, with the effect that her statements appeared unsubstantiated.\n\nNature Biotechnology’s treatment of Ermakova attracted condemnation from many scientists. It was also strongly criticized in some media outlets. Harvey Marcovitch, former editor of a scientific journal and now director of the Committee on Publication Ethics (COPE), which sets ethical standards for academic journals, commented, “This is a type of publication which I have never encountered.” He said that while reading it he was struck by “some surprising things”. He was unwilling to speculate as to what exactly happened: “Either the editor was trying out a new form of experimentation, in which not everything went according to plan, or there was indeed a conspiracy or whatever one wants to call it.”\n\nDr Brian John of the Wales-based campaign group GM-Free Cymru was more blunt, calling the process “tabloid academic publishing involving deception, lies, duplicity and editorial malpractice”.\n\nAmid the uproar, editor Marshall released his email correspondence with Ermakova on the internet. It showed that far from his having “solicited” the comments from the critics, as he had originally claimed, the four pro-GM scientists had themselves approached the journal proposing their “critique”, and even though none of them are toxicologists, Marshall had agreed. The self-selected critics judged Ermakova’s research – which they had never even seen in its complete form – “demonstrably flawed”.\n\nNature Biotechnology also failed to fully disclose the conflicts of interest of Ermakova’s critics. Bruce Chassy was lead author on two influential ILSI publications, which defined weak risk assessment methodologies for GM crops that were later inserted into the guidelines of the European Food Safety Authority (EFSA). Vivian Moses was chairman of CropGen, a GM industry lobby group with Monsanto among its funders. L. Val Giddings, an industry consultant, was described in the article as formerly of the Biotechnology Industry Organization (BIO). Nature Biotechnology omitted to say that Giddings occupied a senior position at BIO – vice president for food and agriculture – and that BIO’s funders include the GM crop companies, Monsanto, Dow and DuPont. The last of the four critics, Alan McHughen, developed a GM flax called Triffid that in 2009 was found to have contaminated flax supplies coming into Europe from Canada. If these interests had been disclosed, readers might have judged the criticism of Ermakova differently.\n\nThese examples show that the threat to scientific publishing from industry influence is real. The avenues for researchers to publish critical views in science are already few. This is especially true for the high-impact journals that the media notices and that therefore influence public discourse. Equally problematic is that few scientific institutions will support researchers whose findings contradict industry viewpoints, as Chapela found out when UC Berkeley tried to deny him tenure following the controversial maize study. Even fewer funding sources will give to such researchers. Consequently almost all funding of biosafety research finds its way into the hands of researchers with industry ties.\n\nThis directly affects the quality of the science produced. A recent literature review found that most studies concluding that GM foods are as safe as non-GM counterparts were performed by the developer companies or their associates (Domingo and Bordonaba, 2011). It is no coincidence that Norway, a country without an agricultural industry lobby, hosts the only publicly funded institute in the world with a mission to conduct research on the environmental, health and social consequences of genetic engineering.\n\nThere are in principle ways within the existing system to mitigate or neutralize the influence of industry on the ability of scientists to publish independent and critical research. The first is transparency in publishing. Journal editors should adopt the COPE guidelines and publish all conflicts of interest among staff and editors.\n\nAlso in line with COPE’s stipulation, peer reviewers should be selected to avoid conflicts of interest. If this proves impossible due to the spread of patents and industry research funding, then care must be taken to select a balanced panel representing a plurality of views. FCT is a member of COPE, but does not publish information on editors’ conflicts of interest, and its appointment of Goodman over Domingo shows that it does not seek to avoid them.\n\nThere may in fact be a need to critically examine the entire concept of peer review. The limitations of all types of expert opinion – whether that of an individual expert or of an expert panel – are recognized in the field of evidence-based medicine. To address this problem, bodies such as the non-profit Cochrane Collaboration have developed systematic and transparent methodologies to review and evaluate data on the effectiveness of different medical interventions. The aim is to enable healthcare practitioners to make well-informed clinical decisions. The reviewing criteria are transparently set out in advance, so there is less scope for bias in evaluations of studies. When disagreements do occur, it is easy to pinpoint the reason and resolve the problem. Cochrane also implements rules to prevent conflicts of interest among its reviewers and editorial board.\n\nThe Cochrane approach is widely respected and the lessons learned in evidence-based medicine about conflicts of interest and resisting industry pressure are being applied to other fields, such as hazardous environmental exposures (Woodruff et al., 2011). There is no reason why scientific journals, including those publishing GMO research, cannot use similar methods to evaluate papers, so that less discretion is given to experts with conflicts of interest.\n\nImplementing such policies presumes strong support among the scientific community for independent science. But this support may not exist outside of medical research.\n\nFCT took on Goodman, a former Monsanto employee and well-known supporter of industry viewpoints, immediately following the publication of a controversial paper that was critical of Monsanto’s principal products. In doing so, FCT senior management bypassed the normal scientific editorial culture of gradual promotion from within.\n\nMeanwhile, two other prominent academic journals have served as platforms for their editors to generate unsubstantiated and unscientific abuse without any repercussions for their editorial positions. Marshall remains editor of Nature Biotechnology. The fact that journal editors get away with such behavior suggests that support for independent research among scientists is generally lacking and that accountability within the scientific publishing world barely exists.\n\nIt seems unlikely that scientific journals will address unaided the defects in scientific publishing at FCT and elsewhere. To do so would require confronting the fundamental problem that academic science now largely makes its money from exploiting conflicts of interest. This has become the underlying business model of science. Universities offer ‘independent’ advice to governments while taking corporate money for ‘research’. Corporations offer that money to universities, not for the knowledge it generates, but primarily for the influence it buys.\n\nThese same incentives are reinforced at the personal level as well. Individual scientists occupy taxpayer-funded academic positions while benefitting from patents, stocks and industry consultancies. If journals and government agencies took action to eliminate conflicts of interest, the corporate money for science would dry up, because industry-funded scientists would lose influence.\n\nBut if scientific journals do not find a way to level the playing field for critical studies, the few scientists who are still able to carry out independent public interest research may need to find an alternative publishing model: public peer review, or ‘open-source science’. Such online collaborative approaches could even revitalize scientific publishing.\n\nUnless radical reform is achieved, peer-reviewed publication, which many hold to be the defining characteristic of science, will have undergone a remarkable inversion. From its origin as a safeguard of quality and independence, it will have become a tool through which one vision, that of corporate science, came to assert ultimate control. Richard Goodman, FCT’s new Associate Editor for biotechnology, now has the opportunity to throw down the stairs only those papers marked “industry approved”.\n\nNote: Click here to see a response from scientists to the attacks on Séralini\n\nPostcript: FCT has now retracted (Nov 28 2013) the Séralini study. The editors’ letter is at the bottom of this link.\n\nPost-postscript (Feb 25 2015): Food and Chemical Toxicology has expelled Richard Goodman and demoted Wallace Hayes, apparently because of numerous complaints.\n\nArjo G, et al. (2013). Plurality of opinion, scientific discourse and pseudoscience: an in depth analysis of the Séralini et al. study claiming that Roundup Ready corn or the herbicide Roundup cause cancer in rats. Transgenic Research 22: 2 255-267\n\nChristou P (2002). No credible scientific evidence is presented to support claims that transgenic DNA was introgressed into traditional maize landraces in Oaxaca, Mexico. Transgenic Research 11: iii–v\n\nDomingo JL (2007). Toxicity studies of genetically modified plants: a review of the published literature. Crit Rev Food Sci Nutr 47(8): 721-733\n\nDomingo JL and JG Bordonaba (2011). A literature review on the safety assessment of genetically modified plants. Environ Int 37: 734–742.\n\nErmakova I (2006). Genetically modified soy leads to the decrease of weight and high mortality of rat pups of the first generation. Preliminary studies. Ecosinform. 2006;1:4–9.\n\nErmakova I (2009). [Influence of soy with gene EPSPS CP4 on the physiological state and reproductive function of rats in the first two generations] [Russian text]. Contemporary Problems in Science and Education 5:15–20.\n\nOrtiz-Garcia S, et al. (2005). Absence of detectable transgenes in local landraces of maize in Oaxaca, Mexico. Proceedings of the National Academy of Sciences 102: 18242.\n\nPineyro-Nelson A, et al. (2009). Transgenes in Mexican maize: molecular evidence and methodological considerations for GMO detection in landrace populations. Mol Ecol 18(4): 750-761.\n\nQuist D and IH Chapela (2001). Transgenic DNA introgressed into traditional maize landraces in Oaxaca, Mexico. Nature 414(6863): 541-543.\n\nRobinson, C, et al. (2013). Conflicts of interest at the European Food Safety Authority erode public confidence. J Epidemiol Community Health.doi:10.1136/jech-2012-202185.\n\nSéralini GE, et al. (2012). Long term toxicity of a Roundup herbicide and a Roundup-tolerant genetically modified maize. Food and Chemical Toxicology 50(11): 4221-4231.\n\nWoodruff TJ, et al. (2011). An evidence-based medicine methodology to bridge the gap between clinical and environmental health sciences. Health Aff (Millwood) 30(5): 931-937.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Goodman Affair: Monsanto Targets the Heart of Science", "description": "Journal editors have a lot of power in science that provides opportunities for abuse. The industry knows this, and has moved to influence and control publishing", "url": "https://www.independentsciencenews.org/science-media/the-goodman-affair-monsanto-targets-the-heart-of-science/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2013-05-20T00:05:27+00:00", "article:modified_time": "2017-07-17T18:03:49+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2013/05/Richard-Goodman4-cropped-more.jpg", "image:width": "489", "image:height": "379", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://jrsm.rsmjournals.com/content/99/4/178.long", "http://www.the-scientist.com/?articles.view/articleNo/27376/title/Merck-published-fake-journal/", "http://dx.doi.org/10.1016/j.fct.2012.08.005", " http://www.huffingtonpost.fr/corinne-lepage/ogm-une-etude-et-une-demarche-historiques_b_1907658.html?utm_hp_ref=france", " http://www.sciencemediacentre.org/expert-reaction-to-gm-maize-causing-tumours-in-rats/", "https://www.independentsciencenews.org/health/seralini-and-science-nk603-rat-study-roundup/", "http://gmwatch.org/latest-listing/51-2012/14514", "http://www.journals.elsevier.com/food-and-chemical-toxicology/editorial-board/", "http://www.hesiglobal.org/files/public/Committees/PATC/Meetings/2012%20Prague/SpeakerBiosPATC_Sym2012.pdf", "http://www.hesiglobal.org/files/public/ParticipantsList.pdf", "http://www.youtube.com/watch?v=bjsBLqhhKkc", "http://www.nrdc.org/media/pressreleases/060131.asp", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1570087/", "http://www.biosafety.ru/ftp/domingo.pdf", "http://maurin.bnk.free.fr/Domingo%20et%20al.,%202011.pdf", "http://www.ask-force.org/web/Seralini/Arjo-Plurality-Opinion-Scientific-Discourse-Seralini-2013.pdf", "http://boards.cannabis.com/attachments/cannabis-com-lounge/113024d1168890567-global-warming-article-chapela-i.-transgenic-dna-native-mexican-corn.pdf", "http://www.gmwatch.org/latest-listing/1-test/10959", "https://research.cip.cgiar.org/confluence/download/attachments/3487/ak7.pdf", "http://www.twnside.org.sg/title/info10.htm", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3001031/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1184035/", "http://www.icrea.cat/web/ReportViewer.aspx?entidad=W0LloaT1B7Y%3d&id=KT0JBsyZN78%3d", "http://www.ptodirect.com/Results/Patents?p=1&r=10&query=Christou-Paul.INNM.", "http://www.ptodirect.com/Results/Patents?query=PN/6288312", "http://www.nature.com/nbt/journal/v25/n12/extref/nbt1207-1359-S1.pdf", "http://www.nature.com/nbt/journal/v25/n12/extref/nbt1207-1359-S1.pdf", " http://www.nature.com/nbt/journal/v25/n12/extref/nbt1207-1359-S1.pdf", "http://www.ask-force.org/web/Ermakova/Marshall-Ermakova-et-al-Controversy-all-reactions.pdf", "http://www.ask-force.org/web/Ermakova/Marshall-Ermakova-et-al-Controversy-all-reactions.pdf", "http://www.gmwatch.org/latest-listing/46-2007/5861", "https://independentsciencenews.org/health/nature-biotechnology/", "http://www.gmwatch.org/latest-listing/46-2007/5861-the-excommunication-of-a-heretic", "http://www.gmfreecymru.org.uk/pivotal_papers/rottweiler.htm", "http://www.powerbase.info/index.php/Bruce_Chassy", "http://www.testbiotech.org/en/node/426", "http://www.powerbase.info/index.php/CropGen", "http://www.linkedin.com/pub/l-val-giddings/4/2a1/2b1", "http://mybio.zerista.com/profile/member/391888", "http://www.bio.org/articles/bio-members-web-site-links", "http://www.powerbase.info/index.php/Alan_McHughen", "http://www.insidebayarea.com/trivalleyherald/localnews/ci_2668826", "http://www.genok.com/about_genok", "http://publicationethics.org/files/Code_of_conduct_for_journal_editors_Mar11.pdf ", "http://www.cochrane.org/", "http://handbook.cochrane.org/", "http://handbook.cochrane.org/chapter_2/box_2_6_a_the_cochrane_collaboration_code_of_conduct_for.htm", "http://ntp.niehs.nih.gov/go/38673", "http://content.healthaffairs.org/content/30/5/931.short", "https://www.independentsciencenews.org/health/seralini-and-science-nk603-rat-study-roundup/", "http://www.gmwatch.org/files/Letter_AWHayes_GES.pdf", "#"], "authors": ["Jonathan Latham"], "publish_date": "2013-05-20T00:05:27+00:00"}