{"result_id": "166022", "URL": "https://www.independentsciencenews.org/health/the-great-dna-data-deficit/", "timestamp": "2023-04-25 15:36:40 CEST+0200", "meta": {"description": "Just before his appointment as head of the US National Institutes of Health, Francis Collins, had his own genome scanned for disease susceptibility genes.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/the-great-dna-data-deficit/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Great DNA Data Deficit: Are Genes for Disease a Mirage?", "cleaned_text": "Just before his appointment as head of the US National Institutes of Health (NIH), Francis Collins, the most prominent medical geneticist of our time, had his own genome scanned for disease susceptibility genes. He had decided, so he said, that the technology of personalised genomics was finally mature enough to yield meaningful results. Indeed, the outcome of his scan inspired The Language of Life, his recent book which urges every individual to do the same and secure their place on the personalised genomics bandwagon.\n\nSo, what knowledge did Collins’s scan produce? His results can be summarised very briefly. For North American males the probability of developing type 2 diabetes is 23%. Collins’s own risk was estimated at 29% and he highlighted this as the outstanding finding. For all other common diseases, however, including stroke, cancer, heart disease, and dementia, Collins’s likelihood of contracting them was average.\n\nPredicting disease probability to within a percentage point might seem like a major scientific achievement. From the perspective of a professional geneticist, however, there is an obvious problem with these results. The hoped-for outcome is to detect genes that cause personal risk to deviate from the average. Otherwise, a genetic scan or even a whole genome sequence is showing nothing that wasn’t already known. The real story, therefore, of Collins’s personal genome scan is not its success, but rather its failure to reveal meaningful information about his long-term medical prospects. Moreover, Collins’s genome is unlikely to be an aberration. Contrary to expectations, the latest genetic research indicates that almost everyone’s genome will be similarly unrevealing.\n\nWe must assume that, as a geneticist as well as head of NIH, Francis Collins is more aware of this than anyone, but if so, he wrote The Language of Life not out of raw enthusiasm but because the genetics revolution (and not just personalised genomics) is in big trouble. He knows it is going to need all the boosters it can get.\n\nWhat has changed scientifically in the last three years is the accumulating inability of a new whole-genome scanning technique (called Genome-Wide Association studies; GWAs) to find important genes for disease in human populations1. In study after study, applying GWAs to every common (non-infectious) physical disease and mental disorder, the results have been remarkably consistent: only genes with very minor effects have been uncovered (summarised in Manolio et al 2009; Dermitzakis and Clark 2009). In other words, the genetic variation so confidently expected by medical geneticists to explain common diseases, cannot be found.\n\nThere are, nevertheless, certain exceptions to this blanket statement. One group are the single gene, mostly rare, genetic disorders whose discovery predated GWA studies2. These include cystic fibrosis, sickle cell anaemia and Huntington’s disease. A second class of exceptions are a handful of genetic contributors to common diseases and whose discovery also predated GWAs. They are few enough to list individually: a fairly common single gene variant for Alzheimer’s disease, and the two breast cancer genes BRCA 1 and 2 (Miki et al. 1994; Reiman et al. 1996). Lastly, GWA studies themselves have identified five genes each with a significant role in the common degenerative eye disease called age-related macular degeneration (AMD). With these exceptions duly noted, however, we can reiterate that according to the best available data, genetic predispositions (i.e. causes) have a negligible role in heart disease, cancer3, stroke, autoimmune diseases, obesity, autism, Parkinson’s disease, depression, schizophrenia and many other common mental and physical illnesses that are the major killers in Western countries4.\n\nFor anyone who has read about ‘genes for’ nearly every disease and the deluge of medical advances predicted to follow these discoveries, the negative results of the GWA studies will likely come as a surprise. They may even appear to contradict everything we know about the role of genes in disease. This disbelief is in fact the prevailing view of medical geneticists. They do not dispute the GWA results themselves but are now assuming that genes predisposing to common diseases must somehow have been missed by the GWA methodology. There is a big problem, however, in that geneticists have been unable to agree on where this ‘dark matter of DNA’ might be hiding.\n\nIf, instead of invoking missing genes, we take the GWA studies at face value, then apart from the exceptions noted above, genetic predispositions as significant factors in the prevalence of common diseases are refuted. If true, this would be a discovery of truly enormous significance. Medical progress will have to do without genetics providing “a complete transformation in therapeutic medicine” (Francis Collins, White House Press Release, June 26, 2000). Secondly, as with Francis Collins’ test, genetic testing will never predict an individual’s personal risk of common diseases. And most important of all, if the enormous death toll from common Western diseases cannot be attributed to genetic predispositions it must predominantly originate in our wider environment. In other words, diet, lifestyle and chemical exposures, to name a few of the possibilities.\n\nThe question, therefore, of whether medical geneticists are acting reasonably in proposing some hitherto unexpected genetic hiding place, or are simply grasping at straws, is a hugely significant one. And there is more than one problem with the medical geneticists’ position. Firstly, as lack of agreement implies, they have been unable to hypothesise a genetic hiding place that is both plausible and large enough to conceal the necessary human genetic variation for disease. Furthermore, for most common diseases there exists plentiful evidence that environment, and not genes, can satisfactorily explain their existence. Finally, the oddity of denying the significance of results they have spent many billions of dollars generating can be explained by realising that a shortage of genes for disease means an impending oversupply of medical geneticists.\n\nYou will not, however, gather this from the popular or even scientific media, or even the science journals themselves. No-one so far has been prepared to point out the weaknesses in the medical geneticist’s position. The closest up to now is from science journalist Nicholas Wade in the New York Times who has suggested that genetic researchers have “gone back to square one.” Even this is a massive understatement, however. Human genetic research is not merely at an impasse, it would seem to have excluded inherited DNA, its central subject, as a major explanation of most diseases.\n\nAdvances in medical genetics have historically centered on the search for genetic variants conferring susceptibility to rare diseases. Such genes are most easily detected when their effects are very strong (in genetics this is called highly penetrant), or a gene variant is present in unusually inbred human populations such as Icelanders or Ashkenazi Jews. This strategy, based on traditional genetics, has uncovered genes for cystic fibrosis, Huntington’s disease, the breast cancer susceptibility genes BRCA 1 and 2, and many others. Important though these discoveries have been, these defective genetic variants are relatively rare, meaning they do not account for disease in most people2. To find the genes expected to perform analogous roles in more common diseases, different genetic tools were needed, ones that were more statistical in nature.\n\nThe technique of genome wide association (GWA) was not merely the latest hot thing in genetics. It was in many ways the logical extension of the human genome sequencing project. The original project sequenced just one genome but, genetically speaking, we are all different. These differences are, for many geneticists, the real interest of human DNA. Many thousands of minor genetic differences between individuals have now been catalogued and medical geneticists wanted to use this seemingly random variation to tag disease genes. Using these minor DNA differences to screen large human populations, GWA studies were going to identify the precise location of the gene variants associated with susceptibility to common disorders and diseases.\n\nTo date, more than 700 separate GWA studies have been completed, covering about 80 different diseases. Every common disease, including dozens of cancers, heart disease, stroke, diabetes, mental illnesses, autism, and others, has had one or more GWA study associated with it (Hindorff et al. 2009). At a combined cost of billions of dollars, it was expected at last to reveal the genes behind human illness. And, once identified, these gene variants would become the launchpad for the personalised genomic revolution.\n\nBut it didn’t work out that way. Only for one disease, AMD, have geneticists found any of the major-effect genes they expected and, of the remaining diseases, only for type 2 diabetes does the genetic contribution of the genes with minor effects come anywhere close to being of any public health significance (Dermitzakis and Clark 2009; Manolio et al. 2009). In the case of AMD, the five genes determine approximately half the predicted genetic risk (Maller et al. 2006). Apart from these, GWA studies have found little genetic variation for disease. The few conclusive examples in which genes have a significant predisposing influence on a common disease remain the gene variant associated with Alzheimer’s disease and the breast cancer genes BRCA1 and 2, all of which were discovered well before the GWA era (Miki et al. 1994 and Reiman et al. 1996).\n\nThough they have not found what their designers hoped they would, the results of the GWA studies of common diseases do support two distinct conclusions, both with far-reaching implications. First, apart from the exceptions noted, the genetic contribution to major diseases is small, accounting at most for around 5 or 10% of all disease cases (Manolio et al. 2009). Secondly, and equally important, this genetic contribution is distributed among large numbers of genes, each with only a minute effect (Hindorff et al. 2009). For example, the human population contains at least 40 distinct genes associated with type I diabetes (Barrett et al. 2009). Prostate cancer is associated with 27 genes (Ioannidis et al. 2010); and Crohn’s disease with 32 (Barrett et al. 2008).\n\nThe implications for understanding how each person’s health is affected by their genetic inheritance are remarkable. For each disease, even if a person was born with every known ‘bad’ (or ‘good’) genetic variant, which is statistically highly unlikely, their probability of contracting the disease would still only be minimally altered from the average.\n\nDNA is not the language of life or death\n\nThis dearth of disease-causing genes is without question a scientific discovery of tremendous significance. It is comparable in stature to the discovery of vaccination, of antibiotics, or of the nature of infectious diseases, because it tells us that most disease, most of the time, is essentially environmental in origin.\n\nBut such significance leaves a puzzle. Huge quantities of newspaper space has been devoted to genes, or even to hints of genes for various diseases5. By rights then, reports of the GWA results should have filled the front pages of every world newspaper for a week. So, why has this coverage not occurred?\n\nIt is possible to conceive of excuses for lack of coverage: refutation is inherently less interesting, and the GWA results have been reported piecemeal, but the more likely reason is the disturbing implications for medical geneticists who are its discoverers. The GWA studies were not envisaged as a test of the hypothesis: do genes cause common diseases? Rather, they were expected merely to straightaway identify the guilty genes that everyone “knew” were there. By apparently refuting the entire concept of genes for common diseases, the GWA studies raise fundamental questions about money spent, hopes raised, and judgments made by medical researchers.\n\nIn the first place, the GWA results raise what are probably insurmountable questions for the prospective ‘genetic revolution’ in healthcare. What use will personalised DNA testing (or sequencing) be if genes cannot predict disease for the vast majority of people? Are genes with only extremely minor effects going to be of value as drug targets? How hard is it going to be to untangle their roles in disease when they have hardly any measurable effect? Should we still suppose that pouring more resources into human genetic research is going to rescue industry’s faltering drug development pipelines? All of a sudden, the future of medicine, especially in the specialities dealing with degenerative diseases and mental illness, looks very different and a lot less promising. We no longer have a ‘complete transformation’ to look forward to, only a continuation of the incremental improvements and setbacks that have characterised medicine for the last fifty years.\n\nIn a rare public sign of the struggle to come to terms with this genetically impoverished world-view, the authors of a brief review in Science magazine, Andrew Clark of Cornell University and Emmanouil Dermitzakis of the University of Geneva Medical School, Switzerland have been alone in stating the case even partly straightforwardly. According to them, the GWA studies tell us that “the magnitude of genetic effects is uniformly very small” and therefore “common variants provide little help in predicting risk” (Dermitzakis and Clark 2009). Consequently, the likelihood that personalised genomics will ever predict the occurrence of common diseases is “bleak”. This aim, they believe, will have to be abandoned altogether.\n\nThe first conclusion to be drawn from these quotes is that such directness implies that if the GWA findings are not finding their way to the front page the reason is not ambiguity in the results themselves. From a scientific perspective the GWA results, though negative, are robust and clear.\n\nMost human geneticists view the GWA results somewhat differently, however. An invited workshop, convened by Collins and others, discussed the then-accumulating results in February 2009. The most visible outcome of this workshop was a lengthy review published in Nature and titled: “Finding the Missing Heritability of Complex Diseases.” (Manolio et al. 2009).\n\nFor a review paper that does not lay out any new concepts or directions, 27 senior scientists as coauthors might be considered overkill. “Finding the Missing Heritability”, however, should be understood not so much as a scientific contribution but as an effort to conceal the gaping hole in the science of medical genetics.\n\nIn their Science article, which was published almost simultaneously, Dermitzakis and Clark paused only briefly to consider whether so many genes could have been overlooked. Apparently, they thought it an unlikely possibility. Manolio et al., however, frame this as the central issue. According to them, since heritability measurements suggest that genes for disease must exist, they must be hiding under some as-yet-unturned genetic rock. They list several possible hiding places: there may be very many genes with exceedingly small effects; genes for disease may be highly represented by rare variants with large effects; disease genes may have complex genetic architectures; or they may exist as gene Copy Number Variants (CNVs). Since Manolio et al. presented their list, the scientific literature has seen further suggestions for where disease genes might be hiding. These include in mitochondrial DNA, epigenetics and in statistical anomalies (e.g. Eichler et al. 2010; Petronis 2010).\n\nA problem for all these hypotheses, however, is that anyone wishing to take them seriously needs to consider one important question. How likely is it that a quantity of genetic variation that could only be called enormous (i.e. more than 90-95% of that for 80 human diseases) is all hiding in what until now had been considered genetically unlikely places? In other words, they all require the science of genetics to be turned on its head. For epigenetics, for example, there is scant evidence that important traits can be inherited through acquired modifications of DNA. Similarly, if rare variants with strong effects keep appearing in the population and causing major illnesses, why is there no evidence for this phenomenon, since it must have been occurring in the past? With unanswered questions such as these, it is unsurprising that none of the mooted explanations has attracted any kind of consensus among geneticists and in fact the CNV explanation is already looking highly unlikely (Conrad et al. 2010; The Wellcome Trust Case Control Consortium 2010). As the first of these two papers summarised “we conclude that, for complex traits, the heritability void left by genome-wide association studies will not be accounted for by CNVs” (Conrad et al. 2010).\n\nNow, it is not impossible that human diseases follow unique genetic rules, but the apparently overlooked possibility is that the GWA studies are indicating a simple truth: that genes are not important causes of major diseases.\n\nAs stated so far, the case against the importance of genes for disease seems strong. However, the ‘missing heritability’ argument is based on numerous predictions of a large genetic contribution to human diseases that are derived from heritability measurements. These heritability estimates are obtained from the study of identical and non-identical twins. A crucial question becomes, therefore, are these estimates truly reliable?\n\nHow robust is the historical evidence for genetic causation?\n\nA perennial feature of research into human health has always been the mountain of evidence that environment is overwhelmingly important in disease. People who migrate acquire the spectrum of diseases of their adopted country. Populations who take up Western habits, or move to cities with Western lifestyles, acquire Western diseases, and so on (e.g. Campbell and Campbell 2008). These data are hard to refute, not least because they are so simple, but geneticists, when discussing them, invariably wheel out their own version of incontrovertible evidence: twin studies of the heritability of complex diseases. When Francis Collins talks about ‘missing heritability’ it is to studies such as these that he is referring. They provide the basic evidence for genetic influences on human disease.\n\nA classic example of this contradiction is myopia. A large body of evidence suggests that myopia is an environment-induced disorder caused by some combination of night lighting, close reading, lack of distance viewing and diet (e.g. Quinn et al. 1999). Moreover, under the influence of Westernisation, genetically unchanged populations, for example, are known to have switched in a single generation from close to 0% to a prevalence of myopia of over 80% (Morgan 2003). And myopia is only one of many examples of diseases with very strong evidence for its environmental origin. In 2009, for example, researchers demonstrated that very moderate improvements in lifestyle could reduce an individual’s probability of contracting type 2 diabetes by 89% (Mozzafarian et al. 2009). The subjects of this study just had to smoke less than the average, keep trim, exercise moderately and not eat too much fat.\n\nIn stark contrast, twin studies (which compare the extent of similarity exhibited by identical and non-identical twins) estimate that myopia is a disease with a heritability (called h2) of about 0.8 (out of a possible 1.0), indicating that for myopia genetic causes dominate environmental ones. These findings are clearly incompatible with the available epidemiological data on myopia and no satisfactory resolution to them has ever been proposed (e.g. Rose et al. 2002; Morgan 2003). This contradiction, between the results of twin studies and the results of epidemiological and clinical research, is repeated for almost every human disease.\n\nA meaningful resolution to these contradictions is, nevertheless, necessary. Since it is unlikely that the many observations identifying environment as a dominant disease-causing factor are all incorrect, the parsimonious solution to the conundrum, even before the GWA studies were reported, was to propose that heritability studies of twins are inherently mistaken or misinterpreted.\n\nStudies of human twins estimate heritability (h2) by calculating disease incidence in monozygotic (genetically identical) twins versus dizygotic (fraternal) twins (who share 50% of their DNA). If monozygotic twin pairs share disorders more frequently than do dizygotic twins, it is presumed that a genetic factor must be involved. A problem arises, however, when the number resulting from this calculation is considered to be an estimate of the relative contribution of genes and environment over the whole population (and environment) from which the twins were selected. This is because the measurements are done in a series of pairwise comparisons, meaning that only the variation within each twin pair is actually being measured. Consequently, the method implicitly defines as environment only the difference within each twin pair. Since each twin pair normally shares location, parenting styles, food, schooling, etc., much of the environmental variability that exists between individuals in the wider population is de facto excluded from the analysis. In other words, heritability (h2), when calculated this way, fails to adequately incorporate environmental variation and inflates the relative importance of genes.\n\nHeritability studies of humans are classic experiments that have been conducted many times and they have strong defenders among modern geneticists (e.g. Visscher et al. 2008). Nevertheless, criticisms such as those above are not novel. They are a specific example of the general problem, formulated by Richard Lewontin (of Harvard University), that the contributions of genes to a trait normally depend on the particular environment. And further, that susceptibility to environment depends on genes. In consequence, there can be no universal constant (such as h2) that defines their relationship to one another (Lewontin, Rose and Kamin 1984; Lewontin 1993). Lewontin is not alone among geneticists in his dismissal of heritability as it is used in human genetics. Martin Bobrow of Cambridge University, for example, has called human heritability “a poisonous concept” and “almost uninterpretable”6.\n\nIf one accepts either that h2 is consistently inflated, or that it is essentially meaningless, even “poisonous”, then the only current evidence supporting genetic susceptibility as a major cause of disease disappears. “The Missing Heritability of Complex Diseases”, DNAs’ so-called ‘dark matter’, becomes simply an artefact arising from overinterpretation of twin studies.\n\nGenetic determinist ideas, especially in the form of explanations for health and disease, are powerful forces in our society (Lewontin 1993). Their pervasive influence, however, requires some explanation because the purely scientific evidence for genetic causation has always been weak, since it depended heavily on disputed heritability studies. To understand the significance a repudiation of inherited DNA as a disease explanation has, it is first necessary to understand the role genetic determinism plays in consolidating the social order.\n\nPoliticians like genetic determinism as a theory of disease because it substantially reduces their responsibility for people’s ill-health. By shifting blame towards individuals and their genetic ‘predispositions’ it greatly dilutes the pressure they may feel to regulate, ban, or tax harmful products and contaminants, courses of action that typically offend their business constituents. For a politician, therefore, spending tax dollars on medical genetics is an easy and even popular decision.\n\nCorporations like genetic determinism, again because it shifts blame. The Salt Institute website, for example, currently maintains that diseases linked to salt reflect the existence of a small number of highly predisposed individuals. This assertion, sandwiched (on the website) between other questions about salt and health, is clearly intended to undermine efforts to restrict salt in the diet. For the same reason, the tobacco industry has for many years encouraged research into the genetics of nicotine addiction (Gundle et al. 2010). This same reasoning, that disease is the fault of the victim’s genes, also protects corporate defendants from after-the-fact liability. If lung cancer patients, for example, suffer from even the possibility of a genetic predisposition, suing tobacco companies is very much harder than it would be otherwise (Tokuhata and Lilienfeld, 1963). There is evidence, too, that genetic determinism influences decisions well before the full facts are known. At least sometimes, it can even encourage the vendor knowingly to place on the market products with harmful effects (Gundle et al. 2010).\n\nMedical researchers are also partial to genetic determinism. They have noticed that whenever they focus on genetic causation, they can raise research dollars with relative ease. The last fifteen years, coinciding with the rise of medical genetics, have seen unprecedented sums of money directed at medical research. At the same time, research on pollution, nutrition and epidemiology has not benefited in any comparable way. It is hard not to conclude that this funding disparity is strongly influenced by the fit of genetics to the needs of businesses and politicians. In the words of Homer Simpson, “It takes two to lie, Marge. One to lie and one to listen”.\n\nRecognising their value, these groups have tended to elevate genetic explanations for disease to the status of unquestioned scientific facts, thus making their dominance of official discussions of health and disease seem natural and logical. This same mindset is accurately reflected in the media where even strong environmental links to disease often receive little attention, while speculative genetic associations can be front page news. It is astonishing to think that all this has occurred in spite of the reality that genes for common diseases were essentially hypothetical entities.\n\nMutually convenient or not, by the criteria normally applied in science, the hypothesis that genes are significant causes of common diseases stands refuted. The history of scientific refutation, however, is that adherents of established theories construct ever more elaborate or unlikely explanations to fend off their critics (Ziman 2000). The invocation of genetic ‘dark matter’ and the search for ‘hiding’ genetic variation shows that the process of special pleading is already well underway (e.g. Manolio et al. 2009; Eichler et al. 2010). Implausible though the suggested hiding places seem, it is nevertheless going to be difficult to rule them all out in the near future. Consequently, those geneticists wishing to do so will have the opportunity to obfuscate for some while yet.\n\nIn societies, including our own, much of the social fabric is arranged around our conception of the ‘proper’ place of death and disease. Confidence in the genetic paradigm has led us to explain non-infectious disease as primarily a natural manifestation of genetic predispositions and thus a normal outcome of aging. This normalisation of diseases has obscured the contrary evidence that these same diseases can be all but absent in other cultures and often were rare in historical times. With the GWA results confirming the epidemiological studies, however, we are confronted with the necessity of constructing a new narrative. To be consistent with the facts, this new narrative must incorporate Western diseases not as unavoidable, but as indicators of human fragility in the face of industrialisation and modern life.\n\nThat we are so vulnerable to our social and physical surroundings, is an uncompromising message. But to the very best of our scientific knowledge it is the truth. Fortunately, it is a truth that offers hope. If we can change our environment for the worse, we can also change it for the better. And if a magic medical cure-all pill is not going to materialise after all, it may be that it wasn’t needed in the first place.\n\nChange for better health can occur in part through individual effort. The new understanding implies that we are not fated to develop any of the common diseases and that the efforts we make to eat well and live a healthy life will be amply rewarded. We should not be surprised if specific lifestyle changes can reverse decades of disease progression (Esselstyn et al. 1995). Or that Seventh Day Adventists, who are non-smoking, non-drinking vegetarians, live on average to 88, eight years beyond the average American’s life expectancy (Fraser and Shavlik 2001). These examples suggest what can be achieved with relatively modest lifestyle changes. By focusing more exclusively on health-related lifestyle modifications than even Seventh Day Adventists do, we could probably extend our life expectancy still further. Exactly how much further is now a much more interesting question than we previously thought.\n\nFor most people, life expectancy is only truly of value if it is accompanied by life quality. We should expect, however, any future diminution of the burden of degenerative diseases from lifestyle modification to both extend life expectancy and enhance life quality7. If so, it might make the most common end-of-life experience very different from the actual prospect facing most Westerners for whom old age is commonly a process of ever more aggressive medical intervention culminating in a hospital room attached to drips and electrodes.\n\nWhile individual effort has a place, many positive lifestyle and social changes require the cooperation of the state. Nevertheless, most governments cooperate far more, for example, with their food industries than with those who wish to eat a healthy diet. The laying to rest of genetic determinism for disease, however, provides an opportunity to shift this cynical political calculus. It raises the stakes by confronting policy-makers as never before with the fact that they have every opportunity, through promoting food labeling, taxing junk food, or funding unbiased research, to help their electorates make enormously positive lifestyle choices. And, when their constituents realise that current policies are robbing every one of them of perhaps whole decades of healthy living, these citizens might start to apply the necessary political pressure.\n\nAddendum:\n\n Following publication of ‘The Great DNA Data Deficit’ various readers have contacted us with relevant publications and books of which we were unaware. These important contributions to the issue of whether genes might cause disease extend or otherwise support the discussion considerably. They are listed below in chronological order. Our sincere thanks to readers for sending these in:\n\nClerget-Darpoux, F. and Cambon-Thomsen, A. (2010) How seriously should we take risk predictions for multifactorial illnesses? Text endorsed by a community of 11 French professional societies involved in genetic issues.\n\n Jay Joseph and Carl Ratner (2010) The Fruitless Search for Genes in Psychiatry and Psychology: Time to Re-examine a Paradigm?\n\n Claudia Chaufan (2007) How much can a large population study on genes, environments, their interactions and common diseases contribute to the health of the American people? Social Science & Medicine 65: 1730-1741.\n\n Helen M. Wallace (2006) A model for gene-gene and gene-environment interactions and its implications for targeting environmental interventions by genotype. Theoretical Biology and Medical Modelling 3: 35-58.\n\n Jay Joseph The Missing Gene (2006)\n\n Buchanan, A; Weiss K and Fullerton S Dissecting complex disease: the quest for the Philosopher’s Stone? (2005)\n\n Jay Joseph The Gene Illusion (2004)\n\n Jay Joseph (2002) Twin studies in psychiatry and psychology: science or pseudoscience? Psychiatric Quarterly 73: 71-82.\n\n Joseph D Terwilliger and Kenneth M Weiss Linkage disequilibrium mapping of complex disease: fantasy or reality? Current Opinion in Biotechnology 9: 578-594 (1998)\n\n(1) ‘Genes for’ disease is shorthand for genetic variants predisposing the carrier to disease.\n\n(2) The definition of a genetically rare disease is usually that it affects fewer than 1 in 1,000 people. Approximately 6,000 rare diseases have been identified in humans.\n\n(3) The famous alleles BRCA 1 and 2 are important in some families and populations but otherwise are fairly rare.\n\n(4) According to the World Health Organisation, heart disease causes 17.1% of all deaths worldwide. Cancer causes 15% of all deaths. Stroke causes 10% of all deaths. WHO factsheet.\n\n(5) The explanation of the contradiction between the GWA studies and the newspaper reports is that much of this coverage was hype. Almost without exception these newspaper reports covered discoveries whose significance could be questioned. Typically, they concerned unsubstantiated results, or the genes were for very minor diseases or the medical and genetic implications of the discovery were substantially overplayed.\n\n(6) Why geneticists disagree about heritability has a historical context that usefully illuminates this issue. Once upon a time the term heritability was used differently. When Sewall Wright, one of the founders of genetics, developed the concept of heritability, he titled a key paper “The Relative Importance of Heredity and Environment in Determining the Piebald Pattern of Guinea Pigs” (Wright, 1920). He used this title even though all animals in the study were kept in identical conditions. Clearly, therefore, he wasn’t defining ‘environment’ as we now do. Instead, in that paper he explicitly defined environment as “the irregularities of development due to the intangible sorts of causes to which the word chance is applied”. All of the subsequent questions (like Lewontin’s) surrounding the validity of twin studies have arisen precisely because Wright’s method, which defined heritability in opposition to chance variations in development, was extended to populations of humans living in variable and varying environments.\n\n(7) In popular speech, aging and degeneration are often conflated, leading sometimes to a rejection of health advice as simply life-span extension. However, aging, by definition, is simply the passage of time and research shows that typically, extended life expectancy is correlated with improved health, when age is taken into account (Fraser and Shavlik 2001). In case one is tempted to confuse aging and disease, it may be helpful to think of children. For them, aging is a process of becoming stronger.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Great DNA Data Deficit: Are Genes for Disease a Mirage?", "description": "Just before his appointment as head of the US National Institutes of Health, Francis Collins, had his own genome scanned for disease susceptibility genes.", "url": "https://www.independentsciencenews.org/health/the-great-dna-data-deficit/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2010-12-08T08:57:45+00:00", "article:modified_time": "2022-04-14T00:50:33+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2011/03/184_247673.jpg", "image:width": "550", "image:height": "305", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://www.google.com/url?sa=t&source=web&cd=4&sqi=2&ved=0CCYQFjAD&url=http%3A%2F%2Fwww.ornl.gov%2Fsci%2Ftechresources%2FHuman_Genome%2Fproject%2Fclinton3.shtml&rct=j&q=a%20complete%20transformation%20in%20therapeutic%20medicine%20francis%20collins%202000&ei=WoXATKuEGcGclgfDseWaCg&usg=AFQjCNEvx_bRhPOgxf-g7BKg9DqiAyTnZg&sig2=q_K1gNykcTuv4s2ZUEVbqg&cad=rja", "http://www.nytimes.com/2010/06/13/health/research/13genome.html?pagewanted=1&_r=1", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2933170/", "http://www.bioscienceresource.org/reviews/review.php?id=9", "http://www.saltinstitute.org/About-salt/Salt-FAQs#Whats-more-important-health-outcomes-or-blood-pressure", "http://news.bbc.co.uk/2/hi/health/8250330.stm", "https://www.eshg.org/fileadmin/www.eshg.org/documents/received/2010MultifactorialDiseases.pdf", "http://www.councilforresponsiblegenetics.org/pageDocuments/1NX6VC0254.pdf", "http://www.sph.umich.edu/ciahd/minutes/FallWinter2009Minutes/april/chaufan_howcan%20largepopulationstudyongenesenvironmentandinteractionscontributetohealth_2007.pdf", "http://www.tbiomed.com/content/3/1/35", "http://jayjoseph.net/the_missing_gene", "http://ije.oxfordjournals.org/content/35/3/562.long", "http://jayjoseph.net/the_gene_illusion", "http://www.springerlink.com/index/V370P8J086067711.pdf", "http://ib.berkeley.edu/labs/slatkin/popgenjclub/pdf/terwilliger-weiss1998.pdf", "http://www.who.int/mediacentre/factsheets/fs310.pdf", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2933170/", "#"], "authors": ["admin"], "publish_date": "2010-12-08T08:57:45+00:00"}