{"result_id": "166013", "URL": "https://www.independentsciencenews.org/health/industrial-production-of-poultry-gives-rise-to-deadly-strains-of-bird-flu-h5nx/", "timestamp": "2023-04-25 15:36:35 CEST+0200", "meta": {"description": "by Robert G. Wallace Multiple outbreaks of deadly H5 bird flu are decimating poultry across Europe, Asia, and the Middle E", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/industrial-production-of-poultry-gives-rise-to-deadly-strains-of-bird-flu-h5nx/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Industrial Production of Poultry Gives Rise to Deadly Strains of Bird Flu H5Nx", "cleaned_text": "Multiple outbreaks of deadly H5 bird flu are decimating poultry across Europe, Asia, and the Middle East.\n\nThe epidemic, moving across Eurasia in wave after wave, follows an eruption of H5N2 here in the U.S. in 2015. All the new strains—H5N2, H5N3, H5N5, H5N6, H5N8, and H5N9, together called H5Nx—are descendants of the H5N1 subtype that first emerged in China in 1997 and since 2003 has killed 452 people.\n\nBig Poultry and its collaborators in government are blaming wild waterfowl, which act as reservoirs for many influenza strains, for the new poultry outbreaks.\n\nFor instance, research under the aegis of University of Minnesota Professor Carol Cardona, who holds the industry-funded Pomeroy Chair in Avian Health, claims that climate change is driving shifts in wild waterfowl ecology and therefore in the influenza to which industrial poultry here in Minnesota are now exposed.\n\nContrary to the industry’s claim, however, exhaustive sampling conducted by state ornithologists found no H5N2 in wild waterfowl in Minnesota. Yet Cardona’s team continues to search for H5N2 in Spring 2015 samples. Why? Simply because it claims the virus must be there. The absence of evidence is treated as no barrier to an expedient assumption in industry’s favor about the nature of the outbreak.\n\nBlaming waterfowl is based on another fallacy. Even if a search for H5N2 in waterfowl proved successful, what would it show? How would the presence of H5N2 in waterfowl here in Minnesota explain the damage the outbreak has caused to industrial turkey and chicken egg layers here in the Midwest in 2015 or across Eurasia today?\n\nThe industry’s line of research omits addressing why multiple influenza strains, including H5N2 and many of the other new H5Nx strains, develop a deadliness in its poultry that isn’t found in most waterfowl. Indeed, no cases of highly pathogenic flu in wild waterfowl were recorded anywhere before 2005. Deadly flu in waterfowl has since been discovered only as collateral blowback from outbreaks on farms.\n\nAs agricultural production turns wetlands into farmland, migrating waterfowl that have traditionally visited wetlands along their flyways have switched to feeding on grain on industrial farms. That is, the expanding interface between waterfowl and intensive poultry production isn’t caused exclusively by climatic changes, as the Cardona team suggests, as by the actions of the industrial agricultural sector itself.\n\nFocusing on wild waterfowl and climate change shifts scrutiny from an industrial model of poultry production that a growing scientific literature indicates is itself a potentially catastrophic public health danger.\n\nMathematical models of pathogen evolution—reviewed here and here—show that intensive husbandry (raising barns of thousands of poultry in packed homogeneous monoculture) offers so much food for flu (and other pathogens), spurring the evolution of explosive deadliness.\n\nThe models infer that a continual supply of cramped-in genetic clones removes a cap on how deadly influenza can evolve. With one new batch of birds after another every six weeks, thousands of immunologically weak clones are always available. The most virulent bird flu can be selected for, decimating fowl populations without running out of new hosts to infect. The now deadlier flu routinely spills back out among local smallholder flocks and wild waterfowl. But industrial scientists blame the resulting impact as the cause of the outbreak.\n\nNow new research is showing that the broader environmental factors on which Cardona’s team is banking as an explanation likely had at best only marginal effect on the emergence of the new H5 influenzas.\n\nIn a peer-reviewed paper recently published in eLIFE, a team led by Belgian spatial ecologist Marius Gilbert introduced models explaining the difference in spatial distributions in influenza outbreaks between the H5N1 subtype and its daughter H5Nx. Gilbert’s team showed that models including popular eco-climatic variables, such as land surface temperature, open water, and vegetation, added little in explanatory value.\n\nInstead, the study demonstrates, it’s the combination of host species that best explained the distribution of outbreaks.\n\nAs shown in Figure 1, Gilbert’s team inferred the relative contributions the various variables made in explaining the global spatial distributions of old school H5N1 (blue) and newbie H5Nx (red). We see that, yes, duck density (DuDnLg) is a major contributor to both kinds of bird flu—although less so for H5Nx—but we should keep in mind that ducks are also raised as poultry in intensive conditions in many European and Asian countries.\n\nThe headline news here is that the H5 virus shifted from extensive chicken production (ChDnLgExt) characteristic of mostly smallholder production to intensive chicken production (ChDNLgInt), urbanized human populations (HpDnLg), and managed horticulture (CultVeg). This means that the new strains now appear to be adapted to industrial poultry production near urban centers.\n\nAs shown in Figure 2, the Gilbert team globally mapped the resulting shift in influenza’s environmental niche (the combination of factors supporting outbreaks) showing already documented hot spots for H5N1 (top) and H5Nx (bottom). As reported in the press, H5Nx is shown spreading in the U.S., Europe, China, and South Korea, among other hot zones.\n\nBut the maps also show areas in potential danger of the new virus, albeit under the constraint of applying data from the early stages of an ongoing outbreak. Bangladesh, Indonesia, Australia, parts of South America, and, prophetically it turns out, the Nile Delta, are in danger of hosting outbreaks, should H5Nx migrate there.\n\nH5Nx’s rise isn’t just a matter of a shift in where the virus is spreading, however. The new strains have also molecularly adjusted. That is, the virus is evolving new attributes fit for infecting poultry.\n\nIn another new paper, a team of virologists from Utrecht University and the Scripps Research Institute show an evolution in a particular molecule called hemagglutinin–the H of H5–that the influenza virus uses to enter host cells.\n\nA rare amino acid substitution in the receptor-binding part of the molecule permits the new H5Nx both broader and more efficient binding to target cells. The virus has switched from binding specifically to receptors in waterfowl intestines to expanding to receptors found in poultry throats. That means the virus is able to infect a broader range of host species, now including the poultry global agribusiness raises in the billions.\n\nThe molecular changes may also account for why there is a rapid rise in so many new strains of H5Nx, which swap gene segments by a process called reassortment. As the virus begins to evolve more efficiently to target its hosts, new versions of the neuraminidase protein—the N in Nx—are apparently being swapped in and out of the various strains of H5Nx. How much virus is shed as a result during an infection and the rapidity of disease progression may also be affected.\n\nFortunately, the Utrecht team found no adaptation to mammalian receptors. So it seems no sustained transmission of the virus among humans is likely. But the researchers only tested H5N8 in this study and human cases of H5N6 have already been documented in China. As H5Nx diversifies and adapts to poultry that tens of thousands of human handlers care for and process every day, the likelihood of a deadly human-specific flu emerging increases.\n\nThe immediate take-home is that we have here divergent ecological and evolutionary analyses converging upon the conclusion that the new H5Nx are increasingly influenzas adapted to intensively raised poultry. That is, a growing literature of scrupulously documented science is showing alarming trends that are beyond the control of agribusiness-funded research.\n\nThese findings are in stark contrast to the rosy narrative presented by extremely well-paid researchers backed by Big Poultry in what the University of Minnesota describes as the “Silicon Valley of food.” Those teams continue to blame anything and anyone for bird flu other than the economic model at the heart of industrial poultry production.\n\nFarmers around the world, and the populations they feed, deserve better. Growers are bearing the economic costs of a model of production that supports pathogens deadly to poultry and potentially dangerous to humans. The new research showing a newly adapted influenza must be heeded and adopted for a fundamental change in public policy. Safer models of poultry production now being developed here in Minnesota and around the world must be supported before the next deadly pandemic sweeps the globe.\n\nThis post originally ran on the “Think Forward” Blog of the Institute for Agriculture and Trade Policy. Rob Wallace blogs at Farming Pathogens. His new book is: Big Farms Make Big Flu.\n\n\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Industrial Production of Poultry Gives Rise to Deadly Strains of Bird Flu H5Nx", "description": "by Robert G. Wallace Multiple outbreaks of deadly H5 bird flu are decimating poultry across Europe, Asia, and the Middle E", "url": "https://www.independentsciencenews.org/health/industrial-production-of-poultry-gives-rise-to-deadly-strains-of-bird-flu-h5nx/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2017-01-30T00:00:24+00:00", "article:modified_time": "2017-02-12T16:34:05+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2017/01/Naim-Alel-Wikimedia-cc.jpg", "image:width": "320", "image:height": "213", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://www.oie.int/animal-health-in-the-world/update-on-avian-influenza/2017/", "https://www.newscientist.com/article/2113725-killer-bird-flu-has-spread-across-europe-are-humans-next/", "https://www.ft.com/content/70c2e75c-b603-11e6-ba85-95d1533d9a62", "http://www.cidrap.umn.edu/news-perspective/2016/09/fao-warns-h5n1-threat-middle-east", "https://farmingpathogens.wordpress.com/2015/06/10/made-in-minnesota/", "http://www.fao.org/AG/AGAINFO/PROGRAMMES/EN/empres/H5N8/situation_update.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4412238/", "http://www.who.int/influenza/human_animal_interface/H5N1_cumulative_table_archives/en/", "http://www.nytimes.com/2015/04/10/business/brought-by-wild-neighbors-a-deadly-flu-attacks-turkey-flocks.html?_r=0", "https://www.vetmed.umn.edu/donors/where-give/chairs-professorships/pomeroy-chair", "http://www.bluetoad.com/publication/index.php?i=281053&m=&l=&p=22&pre=", "http://www.startribune.com/rembrandt-foods-egg-farm-could-be-largest-hit-by-bird-flu/301842401/", "https://farmingpathogens.wordpress.com/2016/11/30/banksgiving/", "http://www.tandfonline.com/doi/full/10.1080/03079450410001724085", "http://www.upi.com/Top_News/World-News/2016/12/06/Bird-flu-virus-spreading-in-South-Korea-from-farm-to-wildlife/9901481039077/", "http://www.ewg.org/research/going-going-gone", "https://farmingpathogens.wordpress.com/2013/03/26/bird-flew/", "https://books.google.com/books?id=Rf88DAAAQBAJ&pg=PA181&dq=big+Farms+Make+Big+Flu+Synchronize+Your+Barns&hl=en&sa=X&ved=0ahUKEwj1k96nidHQAhULyoMKHUQODOsQ6AEIJjAA#v=onepage&q=big%20Farms%20Make%20Big%20Flu%20Synchronize%20Your%20Barns&f=false", "https://www.ncbi.nlm.nih.gov/pubmed/23461333", "https://www.ncbi.nlm.nih.gov/pubmed/?term=Selection+of+broilers+with+improved+innate+immune+responsiveness+to+reduce+on-farm+infection+by+foodborne+pathogens.", "https://farmingpathogens.wordpress.com/2009/08/26/biosecure-farms-not-so-biosecure/", "https://elifesciences.org/content/5/e19571", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4539883/", "https://www.ncbi.nlm.nih.gov/pubmed/27309052", "http://www.newsnow.co.uk/h/Current+Affairs/Health/Pandemics/Flu+Pandemics/Bird+Flu", "https://flutrackers.com/forum/forum/egypt/765121-egypt-media-report-more-h5n8-avian-flu-found-in-birds-damietta-december-6-2016", "https://wwwnc.cdc.gov/eid/article/23/2/16-1072_article", "https://en.wikipedia.org/wiki/Hemagglutinin", "https://en.wikipedia.org/wiki/Amino_acid", "https://en.wikipedia.org/wiki/Reassortment", "https://en.wikipedia.org/wiki/Neuraminidase", "http://www.journalofclinicalvirology.com/article/S1386-6532%2816%2930137-8/abstract", "https://www.cfans.umn.edu/about/about-college/about-campus", "https://farmingpathogens.wordpress.com/2015/06/10/made-in-minnesota/", "http://www.tandfonline.com/doi/abs/10.1080/03079457.2016.1257775", "http://www.startribune.com/what-if-all-poultry-flocks-were-raised-cage-free/299263931/", "https://farmingpathogens.wordpress.com/", "http://monthlyreview.org/product/big_farms_make_big_flu/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2017-01-30T00:00:24+00:00"}