{"result_id": "166025", "URL": "https://www.independentsciencenews.org/commentaries/by-investigating-itself-the-us-can-answer-many-of-the-key-covid19-origin-questions/", "timestamp": "2023-04-25 15:36:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/commentaries/by-investigating-itself-the-us-can-answer-many-of-the-key-covid19-origin-questions/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "By Investigating Itself The US Can Answer Many Of The Key COVID19 Origin Questions", "cleaned_text": "On May 26 U.S. President Biden gave U.S. Intelligence agencies 90 days to report findings about the possible Wuhan lab origin of the Covid-19 pandemic.\n\nOne component of this investigation, having subpoena power, should focus on the “U.S./Wuhan GoF controversy”. This is the hypothesis that the U.S. National Institutes of Health (NIH) funded risky research into coronaviruses at the Wuhan Institute of Virology (WIV), especially during the federal GoF Pause imposed in 2014 under the Obama Administration, and also under the P3CO Framework established by the Trump Administration in 2017. Such a connection, it should be noted, does not automatically imply culpability if a lab escape is proven.\n\nIn recent months, an increasing number of official and media sources have drawn attention to this debate. On January 15 2021 it was mentioned in a disputed Department of State Fact Sheet (point 3.3) released by the last Administration. Since then, at least three separate Congressional representatives have addressed the issue in letters to the Department of Health & Human Services (DHHS) Principal Deputy Inspector General, the Director of the NIH, and the President of the EcoHealth Alliance.\n\nAlthough there have been some answers to a number of questions, it has not been enough to shut down debate.\n\nThe first of three open letters from 26 world scientists, released on March 4, was titled “Call for a Full and Unrestricted International Forensic Investigation into the Origins of COVID-19”. These scientists demanded complete transparency with “full or significant access to all sites, records, samples, and personnel of interest” [see § 3.6.2] and “All laboratories and institutions, Chinese or international, known to have worked on coronaviruses or shared facilities or equipment with groups that worked on coronaviruses” (bold added).\n\nOne of the signatories of this open letter, biosafety expert, molecular biologist and laboratory director Dr. Richard Ebright of Rutgers University tweeted about President Biden’s recent announcement:\n\n“Over the next 90 days, this investigation should examine any and all information on the Wuhan Institute of Virology held by NIH, USAID, DoD, DHS and NSF. The list also includes the nonprofit organization Ecohealth Alliance, which channeled U.S. funding to the Wuhan lab”.\n\n“Many threads of investigation are available in the U.S. and would be accessible to a Congressional inquiry with subpoena power. / At EcoHealth. At funding agencies (USAID, DTRA, DARPA, DHS, and NIH). At publishers (Springer – Nature and Lancet). / No cooperation from China needed”.\n\nThis “Full and Unrestricted National Forensic Investigation” should be carried out immediately, to show the world the same transparency that US Secretary of State, Anthony Blinken, requires from China’s government. As he said last Sunday in an interview aired on HBO, asked about the possibility that ‘Beijing’ is covering up a lab leak in Wuhan:\n\n“We have to get to the bottom of what happened. There is accountability. But the most important reason we have to get to the bottom of this is that’s the only way we are going to be able to prevent the next pandemic or at least do a better job in mitigating it”.\n\nA US investigation becomes even more imperative given the directors of the principal agencies implicated in the Wuhan controversy (the NIH and the NIAID) have firmly and formally denied any involvement. In a Senate hearing on May 11, NIAID Director Fauci declared [min. 59:49]:\n\n“The NIH has not ever and does not now fund gain-of-function research in the Wuhan Institute of Virology”.\n\nSubsequently the NIH Director declared in a statement on 19 May:\n\n“Neither NIH nor NIAID have ever approved any grant that would have supported ‘gain-of-function’ research on coronaviruses that would have increased their transmissibility or lethality for humans”.\n\nLawrence Tabak, Principal Deputy Director of the NIH further denied any involvement in his response on 21 May to the aforementioned Congressional letters.\n\nThe discrepancy between these official statements, and the opinions of relevant experts and the amount of evidence suggesting the contrary, is disturbing. In response to the NIH’s Director statement from 29 May, Dr. Ebright declared in an interview:\n\n“The statement by the NIH Director is demonstrably false. The NIH Director either is uninformed, or is misinformed, or is seeking to mislead (any one of which should be a disqualification for continuation in his position).\n\nThe NIH Director now even is denying that the 2015 Nature Medicine paper by UNC and WIV reporting construction of a novel chimeric coronavirus with spike gene from a bat SARS-related coronavirus with genomic backbone from SARS-CoV –a paper that for six years has been deemed to epitomize the highest-risk subset of gain of function research– was gain of function research”.\n\nThere is nevertheless a debate over the definition of GoF. Molecular biologist and postdoctoral researcher at the Broad Institute (MIT-Harvard) Alina Chan is another signatory of both the Wall Street Journal/LeMonde open letter, and the influential May 14 Science Magazine Open Letter “Investigate the origins of the Covid-19”. As the biotechnology expert Jamie Metzl notes, “Alina Chan, whom I greatly respect, makes the definitional argument supporting the Fauci/Collins assertions in this important Twitter thread”. A thread contradicted by Dr. Ebright in a May 19, 2021 section of Metzls’ updated calendar “Origins of SARS-CoV-2”.\n\nTechnicalities aside, perhaps it was the biological weapons expert Milton Leitenberg of the University of Maryland who made the most resounding conclusion when he said to the Financial Times on 28 May; “Whatever we classify this work as, it should not have been taking place at the Wuhan Institute of Virology”.\n\nFurther evidence supporting the need for additional scrutiny was reported in The Australian on May 28 by Sharri Markson of Sky News, Australia :\n\n“An investigation by The Weekend Australian has also confirmed Dr Fauci, the director of the Nat­ional Institute of Allergy and Infectious Diseases [NIAID], did not alert senior White House officials before lifting the ban on gain-of-function research in 2017 (…) Multiple Trump administration officials told The Weekend Australian Dr Fauci had not raised the issue of restarting the research funding with senior figures in the White House (…) The Weekend Australian has also confirmed that neither Mike Pompeo, the then director of the Central Intelligence Agency, nor National Security Council member Matthew Pottinger, was briefed”.\n\nAn unidentified source, cited as an ‘official’, is also quoted: “It kind of just got rammed through. I think there’s truth in the narrative that the (National Security Council) staff, the President, the White House Chief-of-Staff, those people were in the dark that he was switching back on the research”.\n\nThis generates many questions. Who are these multiple officials? Were the CIA Director, the National Security Council staff, the President and/or the White House Chief-of-staff supposed to be briefed? What was the procedure? Or was there even a procedure in place? Who wrote the 2014 Pause document? Who was supposed to provide oversight? And if the maneuver was inappropriate, why was it not reversed when the NIH made it public?\n\nThe fact is that in December 2017 the NIH, of which the NIAID is a part, announced it would resume funding gain-of-function research. This was officially flagged by the NIH Directors Office on December 19, 2017 (with the clear headline “NIH Lifts Funding Pause on Gain-of-Function Research”). This change was immediately reported by the New York Times on the same day with the striking headline: “A Federal Ban on Making Lethal Viruses Is Lifted”. If none of the abovementioned CIA, National Security Council or White House officials were briefed before the funding pause was lifted, they should have known about it immediately after it came into effect.\n\nMoreover, in a January 21, 2018 NIAID Advisory Council open meeting, NIAID Director Fauci addressed the resumption of government funding for GoF research (and the new December 19, 2017 P3CO Framework) which he defines as “research that might be anticipated to create, transfer, or use enhanced potential pandemic pathogens” (min. 44). Did anyone raise concerns, publicly or privately, and can they prove it? Did they address their concerns to leadership at the NIH, NIAID or other agencies? Did they suggest or try to reverse by any means the NIH decision? Shouldn’t this expand the range of candidates for accountability?\n\nMarkson’s sources nevertheless strengthen some timely conclusions that Dr. Ebright expressed in the aforementioned interview:\n\n“The Director of the National Institute of Allergy and Infectious Diseases (NIAID) and the Director of the National Institutes of Health (NIH) have systematically thwarted efforts by the White House, the Congress, scientists, and science policy specialists to regulate GoF research of concern and even to require risk-benefit review for projects involving GoF research of concern”.\n\n“In 2014, the Obama White House implemented a ‘Pause’ in federal funding for GoF research of concern. However, the document announcing the Pause stated in a footnote that: ‘An exception from pause may be obtained if head of funding agency determines research is urgently necessary to protect public health or national security’. Unfortunately, the NIAID Director and the NIH Director exploited this loophole to issue exemptions to projects subject to the Pause –preposterously asserting the exempted research was ‘urgently necessary to protect public health or national security’– thereby nullifying the Pause”.\n\n“In 2017, the Trump Administration announced a Potential Pandemic Pathogens Control and Oversight (P3CO) Framework that implemented a requirement for risk-benefit review of GoF research of concern. However, the P3CO Framework relies on the funding agency to flag and forward proposals for risk-benefit review. Unfortunately, the NIAID Director and the NIH Director have declined to flag and forward proposals for risk-benefit review, thereby nullifying the P3CO Framework”.\n\nThese statements by Dr. Ebright seem truly alarming in the wake of the current pandemic and need to be followed up.\n\nEbright was also cited by the Fox News anchor on Tucker Carlson Tonight. In an opinionated piece, Mr. Carlson presented accusatory conclusions where there are only hypotheses. He then requested “a criminal investigation into Tony Fauci’s role in this pandemic”.\n\nDid the directors of the NIH and NIAID break the law when they systematically thwarted efforts by the White House, Congress and the scientific community to implement the 2014 GoF Pause and the 2017 P3CO Framework? Was the recent NIH official statement and was Fauci’s NIAID Senate testimony about their role in Gain-of-Function funding, false or intentionally misleading? If this were the case, Title 18 § 1001 of the U.S. Legal Code has this to say:\n\n“(a) Except as otherwise provided in this section, whoever, in any matter within the jurisdiction of the executive, legislative, or judicial branch of the Government of the United States, knowingly and willfully- (1) falsifies, conceals, or covers up by any trick, scheme, or device a material fact; (2) makes any materially false, fictitious, or fraudulent statement or representation; or (3) makes or uses any false writing or document knowing the same to contain any materially false, fictitious, or fraudulent statement or entry;(…)”.\n\nIt would be an astonishing and shocking situation. A good way to know if it is true is to have a presidential mandate for a full and unrestricted national investigation, with subpoena powers, into the U.S./Wuhan GoF controversy. Now. The 90 days are running out.\n\nEven if the Wuhan lab turns out not to be the source of the SARS-CoV-2 outbreak, or U.S. Gain-of-Function funding played no role, it still would not change the urgency of a national investigation.\n\nAre GoF experiments really worth the risk?\n\nHigh-risk experiments with potential pandemic pathogens are a Pandora’s box, that much we know. The Cambridge Working Group has long warned that these studies could provoke a pandemic. Maybe the NIAID Director still thinks that the risk is worth it. As The Australian also recalls:\n\n“America’s top medical adviser for the coronavirus, Anthony Fauci, argued [in this Sep-Oct 2012 paper] that the benefits of experimenting on contagious viruses–manipulating and heightening their infectious potency–was worth the risk of a laboratory accident sparking a pandemic”.\n\n“In previously unreported remarks, Dr. Fauci supported the contentious gain-of-­function experiments that some now fear might have led to an escape from a Wuhan laboratory causing the Covid-19 pandemic, calling them ‘important work’”.\n\nJust before the SARS-CoV-2 Wuhan outbreak, the WHO Global Preparedness Monitoring Board’s September 2019 annual report of which Anthony Fauci was a member, alerted in at least four different sections that a pandemic due to a lab leak or bioweapon attack was a plausible scenario (bold added):\n\n“Countries, donors and multilateral institutions must be prepared for the worst. A rapidly spreading pandemic due to a lethal respiratory pathogen (whether naturally emergent or accidentally or deliberately released) poses additional preparedness requirements” (p. 8).\n\n“In addition to a greater risk of pandemics from natural pathogens, scientific developments allow for disease-causing microorganisms to be engineered or recreated in laboratories. Should countries, terrorist groups, or scientifically advanced individuals create or obtain and then use biological weapons that have the characteristics of a novel, high-impact respiratory pathogen, the consequences could be as severe as, or even greater, than those of a natural epidemic, as could an accidental release of epidemic-prone microorganisms” (p. 27).\n\n“Preparedness and response systems and capabilities for disease outbreaks are not sufficient to deal with the enormous impact, rapid spread and shock to health, social and economic systems of a highly lethal pandemic, whether natural, accidental or deliberately released” (p. 28).\n\n“A rapidly spreading pandemic due to a lethal respiratory pathogen (whether naturally emergent or accidentally or deliberately released) poses additional preparedness requirement” (p. 30).\n\nDr. Fauci knew in advance that a lab origin pandemic was plausible. Now former Food and Drug Administration chief, Scott Gottlieb, says that “Fauci briefed world leaders on the possibility the virus came from a Wuhan lab last spring”. According to a June 6 Forbes report, Gottlieb said last Sunday:\n\n“I was told at the time back in the spring that Dr. Fauci had gone over to a meeting with world health leaders in Europe around the World Health Assembly (…) At this meeting, Fauci briefed world health leaders on the information U.S. officials were looking at, including ‘that this could have been a potential lab leak, that this strain looked unusual’”.\n\nDoes the NIAID Director still think that the risk is worth it? And if the possibility of a lab origin pandemic was so obvious to him, has he been thwarting efforts to investigate a lab origin and making false statements, or just seeking to mislead? And why have the “world health leaders” that he apparently informed not spoken out?\n\nYes, science can makes us wiser and safer, but if we want wisdom and safety those are the values that must be rewarded. This is therefore not just a technical debate. It raises deep public policy, legal, ethical and cultural questions. The world has a right to know the truth. As Louis Brandeis once said, sunlight is the best disinfectant. Especially under penalty of perjury.\n\nThe author is a freelance journalist and author based in Spain. Regular contributor for El Imparcial newspaper and Cadena Cope radio station. He has three published books, one of them cataloged by the U.S. Library of Congress.\n\nEditor’s note. We welcome comments and information about the subject of this article. However, please note that the “reply” function in the comments section is not working for people without high level access to the website. There are two possible solutions for readers wanting to reply to specific comments:\n\n 1) Enter your comment but name the commenter you are responding to (if necessary with the date of their comment). Or,\n\n 2) Mail your comment to the editor: [email protected] and they will post it as a reply. Please be sure to say who/what you are replying too.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "By Investigating Itself The US Can Answer Many Of The Key COVID19 Origin Questions - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "by Jorge Casesmeiro Roger On May 26 U.S. President Biden gave U.S. Intelligence agencies 90 days to report findings about the possible Wuhan lab origin of the Covid-19 pandemic. One component of this investigation, having ...", "url": "https://www.independentsciencenews.org/commentaries/by-investigating-itself-the-us-can-answer-many-of-the-key-covid19-origin-questions/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2021-06-08T00:24:28+00:00", "article:modified_time": "2021-06-08T15:22:40+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2021/06/Francis-collins-anthony-fauci.jpeg", "image:width": "800", "image:height": "532", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.factcheck.org/2021/05/the-wuhan-lab-and-the-gain-of-function-disagreement/", "https://www.phe.gov/s3/dualuse/documents/gain-of-function.pdf", "https://www.phe.gov/s3/dualuse/Pages/p3co.aspx", "https://2017-2021.state.gov/fact-sheet-activity-at-the-wuhan-institute-of-virology/index.html", "https://blog.whitecoatwaste.org/wp-content/uploads/2021/02/NIH-Letter-re-Wuhan-Institute-of-Virology-FINAL-Perry-Feb-2021.pdf", "https://www.politico.com/f/?id=00000178-460d-d27f-ad7e-57cd8e6c0000", "https://ia803401.us.archive.org/4/items/eco-health-alliance-letter-1/EcoHealth-Alliance-Letter%20%281%29.pdf", "https://s.wsj.net/public/resources/documents/COVID%20OPEN%20LETTER%20FINAL%20030421%20(1).pdf", "https://twitter.com/R_H_Ebright/status/1398047205517316097", "https://twitter.com/R_H_Ebright/status/1399240387043155971", "https://twitter.com/disclosetv/status/1401682500846501888", "https://www.rev.com/blog/transcripts/dr-fauci-cdc-director-testify-before-senate-on-covid-19-guidelines-transcript", "https://www.nih.gov/about-nih/who-we-are/nih-director/statements/statement-misinformation-about-nih-support-specific-gain-function-research#.YKXFl1MJD8c.twitter", "https://context-cdn.washingtonpost.com/notes/prod/default/documents/e06e3735-d8a6-40f3-a37d-1e589d825dc7/note/255efe61-0103-4986-8792-9c149dd11443.", "https://www.nih.gov/about-nih/who-we-are/nih-director/statements/statement-misinformation-about-nih-support-specific-gain-function-research#.YKXFl1MJD8c.twitter", "https://www.independentsciencenews.org/commentaries/an-interview-with-richard-ebright-anthony-fauci-francis-collins-systematically-thwarted/", "https://www.nature.com/news/engineered-bat-virus-stirs-debate-over-risky-research-%201.18787", "https://blogs.sciencemag.org/editors-blog/2021/05/13/continued-discussion-on-the-origin-of-covid-19/?fbclid=IwAR2itdWgst88Q78lD7UAA7ibrlfZI_8-5UQKDUTKrNKT5FrJYxMUnjOUdNg", "https://twitter.com/Ayjchan/status/1370880584936001541?s=20", "https://jamiemetzl.com/origins-of-sars-cov-2/", "https://www.ft.com/content/7fef48f1-88a4-48f7-8263-c50384643b7f", "https://www.theaustralian.com.au/world/anthony-fauci-backed-virus-experiments-despite-pandemic-risk/news-story/3c604681cfcbfeda88bac25e372a1b8a", "https://www.nih.gov/about-nih/who-we-are/nih-director/statements/nih-lifts-funding-pause-gain-function-research", "https://www.nytimes.com/2017/12/19/health/lethal-viruses-nih.html?_r=0", "https://videocast.nih.gov/watch=26934", "https://www.independentsciencenews.org/commentaries/an-interview-with-richard-ebright-anthony-fauci-francis-collins-systematically-thwarted/", "https://www.foxnews.com/opinion/tucker-carlson-anthony-fauci-let-the-coronavirus-pandemic-happen-why-isnt-there-a-criminal-investigation", "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title18-section1001&num=0&edition=prelim", "http://www.cambridgeworkinggroup.org/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3484390/", "https://apps.who.int/gpmb/assets/annual_report/GPMB_annualreport_2019.pdf", "https://www.forbes.com/sites/jemimamcevoy/2021/06/06/fauci-briefed-world-health-leaders-last-year-on-possibility-covid-came-from-lab-ex-fda-chief-says/?sh=51850ebe523f", "/cdn-cgi/l/email-protection", "#"], "authors": ["Jonathan Latham"], "publish_date": "2021-06-08T00:24:28+00:00"}