{"result_id": "166018", "URL": "https://www.independentsciencenews.org/health/we-need-to-connect-the-2019-ncov-coronavirus-and-agriculture/", "timestamp": "2023-04-25 15:36:37 CEST+0200", "meta": {"description": "Did the Coronavirus begin on farms? Even if it did not we have a systemic problem of massive farms incubating viruses and other pathogens.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/we-need-to-connect-the-2019-ncov-coronavirus-and-agriculture/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "We Need to Connect the 2019-nCoV Coronavirus to Agriculture", "cleaned_text": "By Rob Wallace, PhD\n\n A new deadly coronavirus 2019-nCoV, related to SARS and MERS and apparently originating in live animal markets in Wuhan, China, is starting to spread worldwide.\n\nChinese authorities have reported 5974 cases nationwide, 1000 of them severe. With infections in nearly every province, authorities warned 2019-nCoV appears to be spreading fast out of its epicenter.\n\nThe virus’s basic reproduction number, a measure of the number of new cases per infection given no cap on available susceptibles, is clocking in at a healthy 3.11. That means in the face of such momentum, a control campaign must stop up to 75% of new infections to reverse the outbreak. The modeling team estimates there are presently over 21,000 cases, reported or not, in Wuhan alone.\n\nFull-genome sequences of the virus meanwhile show few differences between the samples isolated across China. Slower spread for such a fast-evolving RNA virus would be marked by mutations accumulating place-to-place.\n\nThe coronavirus is starting to open up theaters overseas. Travelers with 2019-nCoV have been treated in Australia, France, Hong Kong, Japan, Malaysia, Nepal, Vietnam, Singapore, South Korea, Taiwan, Thailand, and the United States. Local outbreaks are now starting up within sink countries.\n\nAs the infection is characterized by human-to-human transmission and an apparent two-week incubation period before the sickness hits, the infection will likely continue to spread across the globe. Whether it’ll be Wuhan everywhere remains an open question.\n\nThe virus’s final penetrance worldwide will depend on the difference between the rate of infection and the rate of removing infections by recovery or death. If the infection rate far exceeds removal, then the total population infected may approach the whole of humanity. That outcome, however, would likely be marked by large geographic variation brought about by a combination of dead chance and the differences in how countries responded to their outbreak.\n\nPandemic skeptics aren’t so sure of such a scenario. Far fewer patients have been infected and killed by 2019-nCoV than even the typical seasonal influenza. But the mistake here is in confusing a moment early in an outbreak for a virus’s essentialist nature.\n\nOutbreaks are dynamic. Yes, some burn out, including, maybe, 2019-nCoV. It takes the right evolutionary draw and a little luck to beat out chance extirpation. Sometimes enough hosts don’t line up to keep transmission going. Other outbreaks explode. Those that make it on the world stage can be game changers, even if they eventually die out. They upend the everyday routines of even a world already in tumult or at war.\n\nThe deadliness of any potential pandemic strain is the meat of the matter, of course.\n\nShould the virus prove less infectious or deadly than initially thought, civilization goes on, however many people are killed. The H1N1 (2009) influenza outbreak that worried so many a decade-plus ago proved less virulent than it first seemed. But even that strain penetrated the global population, and quietly killed patients, at magnitudes far beyond these first follow-up dismissals. H1N1 (2009) killed as many as 579,000 people its first year, producing complications in fifteen times more cases than initially projected from lab tests alone.\n\nThe danger here is found in humanity’s unprecedented connectivity. H1N1 (2009) crossed the Pacific Ocean in nine days, superseding predictions by the most sophisticated models of the global travel network by months. Airline data show a tenfold increase in travel in China just since the SARS epidemic.\n\nUnder such widespread percolation, low mortality for a large number of infections can still cause a large number of deaths. If four billion people are infected at a mortality rate of only 2%, a death rate less than half that of the 1918 influenza pandemic, eighty million people are killed. And unlike for seasonal influenza, we have neither herd immunity, nor a vaccine to slow it down. Even speeded-up development will at best take three months to produce a vaccine for 2019-nCoV, assuming it even works. Scientists successfully produced a vaccine for the H5N2 avian influenza only after the U.S. outbreak ended.\n\nA critical epidemiological parameter will be the relationship between infectivity and when those infected express symptoms. SARS and MERS proved infectious only upon symptoms. If this bears out for 2019-nCoV, we may be in relatively good shape, all things considered. Even without a vaccine or tailored antivirals, we can immediately quarantine the suddenly sick, breaking chains of transmission with nineteenth-century public health.\n\nSunday, however, China’s health minister Ma Xiaowei stunned the world announcing that 2019-nCoV had expressed infectivity before symptoms. It’s such a turnabout that infuriated U.S. epidemiologists are demanding access to the data showing the new infectivity. The shock implies researchers stateside expect the virus couldn’t possibly be able to evolve outside what they appear to imagine as some public health archetype. If the new infection life history holds true, health authorities aren’t going to be able to use symptoms to identify newly active cases.\n\nThese unknowns—the exact source, infectivity, penetrance, and possible treatments—together explain why epidemiologists and public health officials are worried about 2019-nCoV. Unlike the seasonal influenzas cited by pandemic skeptics, the uncertainty rattles practitioners.\n\nIt is the nature of the job, to worry, yes. Worry is built into the very probabilities and systemic errors embodied more broadly in the trade. The damage in failing to prepare for an outbreak that proves deadly far exceeds that from the embarrassment of preparing for an outbreak that fails to live up to the hype. But in an era celebrating austerity, few jurisdictions wish to pay for a disaster that is no guarantee, whatever the collateral benefits of precaution or, on the other end of outcomes, the devastating losses associated with a bad gamble.\n\nThe choice how to respond is often entirely out of epidemiologist hands anyway. The national authorities who will make these decisions juggle multiple and often contrary agendas. Stopping even a deadly outbreak isn’t always treated as the most important objective.\n\nWhile authorities stumble about figuring out what to do, the scale of impact can suddenly engage in escape velocity. As 2019-nCoV itself demonstrated moving from a single food market to the world stage in a month, the numbers can ramp up so far and fast that an epidemiologist’s best effort, their raison d’être, is dealt a lethal blow by facts on the ground.\n\nMy own visceral reactions this disease round have skipped across worry, disappointment, and impatience.\n\nI’m an evolutionary biologist and public health phylogeographer who has worked on various aspects of these new pandemics for twenty-five years, much of my adult life. As I’ve written elsewhere, with the help of many others, I have tried parlaying a growing understanding of these pathogens, from the genetic sequences of my initial studies up through economic geographies of land use, the political economy of global agriculture, and the epistemology of science.\n\nClarity can sour a soul. As my social media chimed with queries about 2019-nCoV, my immediate response bordered on pique and exhaustion. What, pray, do you wish me to say? What do you want me to do about this?\n\nIn dispensing advice personal and professional to legitimately worried friends and colleagues, I made some wrong calls. To one farmer friend’s query about traveling abroad, I advised a surgeon’s mask, washing hands before all meals, and stop fucking livestock, bro. Darkly ribald humor gets me through stress, but his earnest reply, “Stop fucking livestock?” showed I had missed my mark. Not a good look on my part at all. I apologized. He laughed about it later.\n\nIt’s an occupational hazard. There is the danger of an existential dread that arises from the political inertia epidemiologists must square off with in preparing the world for a nigh-on irresistible pandemic their constituencies pretend is no bother until it’s too late.\n\nIf 2019-nCoV is indeed the Big Bug, and it is not clear yet if that’s the case, there is almost nothing to be done at this point. All we can do is batten down the public health hatches and hope the virus kills only a small part of the world’s population instead of 90%.\n\nClearly humanity shouldn’t start reacting to a pandemic when it’s already underway. It’s a total dereliction of any notion of forward-thinking theory or practice. And leaders and their learned supporters worldwide identify themselves as Prometheans!\n\nThis century we’ve already trainspotted novel strains of African swine fever, Campylobacter, Cryptosporidium, Cyclospora, Ebola, E. coli O157:H7, foot-and-mouth disease, hepatitis E, Listeria, Nipah virus, Q fever, Salmonella, Vibrio, Yersinia, Zika, and a variety of novel inﬂuenza A variants, including H1N1 (2009), H1N2v, H3N2v, H5N1, H5N2, H5Nx, H6N1, H7N1, H7N3, H7N7, H7N9, and H9N2.\n\nAnd near-nothing real was done about any of them. Authorities spent a sigh of relief upon each’s reversal and immediately took the next roll of the epidemiological dice, risking snake eyes of maximum virulence and transmissibility.\n\nThat approach suffers more than a failure of foresight or nerve. However necessary, emergency interventions cleaning up each of these messes can make matters worse.\n\nYou see, sources of intervention compete. And, as my colleagues and I argue, emergency criteria are deployed as impositions in Gramscian hegemony to keep us from talking about structural interventions around power and production. Because, don’t you know, we’re warned, IT’S AN EMERGENCY RIGHT NOW!\n\nAtop this game of keep away, the failure to address structural problems can render these very emergency interventions ineffectual. The Allee threshold that prophylaxes and quarantine aim to push pathogen populations below—so that infections may burn out on their own unable to find new susceptibles—is set by structural causes.\n\nAs our team wrote about the Ebola outbreak in West Africa:\n\nDespite now with both an effective vaccine and antivirals, Ebola is presently undergoing its longest recorded outbreak in the Democratic Republic of Congo. What got lost along the way? Where is our biomedical God now? Blaming the Congolese to cover up this failure is an exercise in colonial displacement, washing imperialism’s hands of decades of structural adjustment and regime change in the global North’s favor.\n\nSaying there’s nothing we can do isn’t quite right either, however, even as the complaint about reacting only upon a new disease’s attack still stands.\n\nWithin any one locale, there is a left program for an outbreak, including organizing neighborhood brigades in mutual aid, demanding any vaccine and antivirals developed be made available at no cost to everyone here and abroad, pirating antivirals and medical supplies, and securing unemployment and healthcare coverage as the economy tanks during the outbreak.\n\nBut that way of thinking and organizing, an integral part of the left’s legacy, appears to have left the building for more performative (and discursive) configurations online.\n\nThe reactionary bent to disease control left and right has since pivoted me to assisting efforts at anti-capitalist agricultures and conservation. Let’s stop the outbreaks we can’t handle from emerging in the first place. At this point in my career, with the structural pacing the emergencies, I generally write about infectious diseases in only tangential terms.\n\nStructural causes of disease are themselves a source of debate. For one, questions remain as to 2019-nCoV’s origins.\n\nMuch initial attention has been placed on a particular exotic food market in Wuhan, with an orientalist preoccupation with strange and unsavory diets, representing both the end of biodiversity the West itself is destroying and a revolting source of dangerous disease:\n\nSaid snakes are brandished as both signifier and signified, a literal source of 2019-nCoV that also harkens to a paradise lost and original sin from a serpent’s maw.\n\nThere is epidemiological evidence in the hypothesis’s favor. Thirty-three of 585 samples at the Wuhan market were found positive for 2019-nCoV, with 31 at the west end of the market where wildlife trading was concentrated.\n\nOn the other hand, only 41% of these positive samples were found in market streets where the wildlife were housed. A quarter of the original infectees never visited the Wuhan market or appeared directly exposed. The earliest case was identified before the market was hit. Other infected marketers trafficked in hog alone, a livestock species that expresses a common vulnerable molecular receptor, leading one team to hypothesize hog as the putative source for the new coronavirus.\n\nAtop African swine fever, which has killed as many as half of China’s hog this past year, the latter possibility would represent quite the clusterfuck. Such disease convergences are not unheard of, even folding into an intimate reciprocal activation, wherein proteins of each pathogen catalyze each other, facilitating new clinical courses and transmission dynamics for both diseases.\n\nAt the same time, Western Sinophobia doesn’t absolve Chinese public health. Certainly the anger and disappointment the Chinese public has directed at local and federal authorities for their slow reaction to 2019-nCoV can’t be spun as weaponized xenophobia. And in our wise efforts to keep our foot out of that trap, we may also be missing a critical agroecological symmetry.\n\nSetting aside the culture war, wet markets and exotic food are staples in China, as is now industrial production, juxtaposed alongside each other since economic liberalization post-Mao. Indeed, the two food modes may be integrated by way of land use.\n\nExpanding industrial production may push increasingly capitalized wild foods deeper into the last of the primary landscape, dredging out a wider variety of potentially protopandemic pathogens. Peri-urban loops of growing extent and population density may increase the interface (and spillover) between wild nonhuman populations and newly urbanized rurality.\n\nWorldwide, even the wildest subsistence species are being roped into ag value chains: among them ostriches, porcupine, crocodiles, fruit bats, and the palm civet, whose partially digested berries now supply the world’s most expensive coffee bean. Some wild species are making it onto forks before they are even scientifically identified, including one new short-nosed dogfish found in a Taiwanese market.\n\nAll are increasingly treated as food commodities. As nature is stripped place-by-place, species-by-species, what’s left over becomes that much more valuable.\n\nWeberian anthropologist Lyle Fearnley pointed out that farmers in China repeatedly manipulate the distinction between wildness and domesticity as an economic signifier, producing new meanings and values attached to their animals, including in response to the very epidemiological alerts issued around their trade. A Marxist might push back that these signifiers emerge out of a context that extends well beyond smallholder control and out onto global circuits of capital.\n\nSo while the distinction between factory farms and wet markets isn’t unimportant, we may miss their similarities (and dialectical relationships).\n\nThe distinctions bleed together by a number of other mechanisms. Many a smallholder worldwide, including in China, is in actuality a contractor, growing out day-old poultry, for instance, for industrial processing. So on a contractor’s smallholding along the forest edge, a food animal may catch a pathogen before being shipped back to a processing plant on the outer ring of a major city.\n\nSpreading factory farms meanwhile may force increasingly corporatized wild foods companies to trawl deeper into the forest, increasing the likelihood of picking up a new pathogen, while reducing the kind of environmental complexity with which the forest disrupts transmission chains.\n\nCapital weaponizes the resulting disease investigations. Blaming smallholders is now a standard agribusiness crisis management practice, but clearly diseases are a matter of systems of production over time and space and mode, not just specific actors between whom we can juggle blame.\n\nAs a class, the coronaviruses appear to straddle these distinctions. While SARS and 2019-nCoV appeared to have emerged out of wet markets—possible pigs aside—MERS, the other deadly coronavirus, emerged straight out of an industrializing camel sector in the Middle East. It’s a path to virulence largely left out of broader scientific discussion about these viruses.\n\nIt should change how we think about them. I would recommend we err on the side of viewing disease causality and intervention beyond the biomedical or even ecohealth object and out into the field of ecosocial relationships.\n\nOther ethoses see a different way out. Some researchers recommend we genetically engineer poultry and livestock to be resistant to these diseases. They leave out whether that would still allow these strains to circulate among what would now be asymptomatic food animals before spilling over into decidedly unengineered humans.\n\nAgain turning back the clock, a source of my pique, nine years ago I wrote about what efforts at genetically engineering out pathogens miss as matters of first principle:\n\nOne source of vexation is the dimensionality of the problem. There is even among mainstream scholars a dawning realization influenza is more than mere virion or infection; that it respects little of disciplinary boundaries (and business plans) in both their form and content. Pathogens regularly use processes accumulating at one level of biocultural organization to solve problems they face at other levels, including the molecular.\n\n Agribusiness ever turns us toward a techno-utopian future to keep us in a past bounded by capitalist relations. We are spun round and round the very commodity tracks selecting for new diseases in the first place.\n\nThe secret thrill (and open terror) epidemiologists feel in an outbreak is nothing more than defeat disguised as heroism.\n\nAlmost the entirety of the profession is presently organized around post-hoc duties, much like a stable boy with a shovel following behind the elephants at a circus. Under the neoliberal program, epidemiologists and public health units are funded to clean up the system’s mess, while rationalizing even the worst practices that lead to many a deadly pandemic’s emergence.\n\nIn a commentary on the new coronavirus, one Simon Reid, a professor of communicable disease control at the University of Queensland, instantiates the resulting incoherence.\n\nReid pings from topic to topic, failing to weave a whole out of his technicist observations. Such folly isn’t necessarily a matter of incompetence or malicious intent upon Reid’s part. It is more a matter of the contradictory obligations of the neoliberal university.\n\nU.S. leftists recently joined swords over the existence of the professional-managerial class. Jacobin social democrats rail at the capitalist PMC they angle to join in a Sanders administration, while tankies claim managers are proletarian too. I’ll sidestep the metaphysical debate—how many PMC can dance on an epipen?—only to observe that whether the PMC theoretically exists in epidemiology, I’ve met its members in the flesh. They live!\n\nReid and other institutional epidemiologists are on the hook for cleaning up diseases of neoliberal origins—yes, including out of China—while meting out comforting platitudes that the system that pays them works. It’s a double bind many practitioners choose to live with, nay, prosper from, even should the resulting epidemiologies threaten millions.\n\nReid here kinda gets the food system and conservation parts of the explanation for 2019-nCoV (and many of its celebrity forerunners out of the series of epidemiological reality shows run this century so far). But in introducing this protopandemic, he propositions, to paraphrase, that “This utter horror has a saving grace—hooray!” And it is that “China has been a source of repeated outbreaks, but it, and a WHO now owned by philanthrocapitalism, conducts exemplary biocontrol.”\n\nWe can reject Sinophobia, offer material support, and still well remember China covered up the SARS outbreak in 2003. Beijing suppressed media and public health reports, allowing that coronavirus to splatter across its own country. Medical authorities one province over from an outbreak didn’t know what their patients were suddenly showing up with at the ER. SARS eventually spread across multiple countries as far as Canada and was barely driven to extirpation.\n\nThe new century has meanwhile been marked by China’s failure or refusal to unpack its near-perfect storm of rice, duck, and industrial poultry and hog production driving multiple novel strains of influenza. It is treated as a price for prosperity.\n\nThis is no Chinese exceptionalism, however. The U.S. and Europe have served as ground zeros for new influenzas as well, recently H5N2 and H5Nx, and their multinationals and neocolonial proxies drove the emergence of Ebola in West Africa and Zika in Brazil. U.S. public health officials covered for agribusiness during the H1N1 (2009) and H5N2 outbreaks.\n\nPerhaps then we should refrain from choosing between one of two cycles of capital accumulation: the end of the American cycle or the start of the Chinese one (or, as Reid appears to do, both). At the risk of accusations of third campism, choosing neither is another option.\n\nIf we must partake in the Great Game, let’s choose an ecosocialism that mends the metabolic rift between ecology and economy, and between the urban and the rural and wilderness, keeping the worst of these pathogens from emerging in the first place. Let’s choose international solidarity with everyday people the world over.\n\nLet’s realize a creaturely communism far from the Soviet model. Let’s braid together a new world-system, indigenous liberation, farmer autonomy, strategic rewilding, and place-specific agroecologies that, redefining biosecurity, reintroduce immune firebreaks of widely diverse varieties in livestock, poultry, and crops.\n\nLet’s reintroduce natural selection as an ecosystem service and let our livestock and crops reproduce on-site, whereby they can pass along their outbreak-tested immunogenetics to the next generation.\n\nConsider the options otherwise.\n\nMaybe I’ve been unfair to the Reids of the world, who as a matter of professional obligation must believe their own contradictions. But, as five hundred years of war and pestilence demonstrate, the sources of capital that many epidemiologists now serve are more than willing to scale mountains made of body bags.\n\nEvolutionary biologist Rob Wallace blogs at Farming Pathogens, and is the author of Big Farms Make Big Flu: Dispatches on Infectious Disease, Agribusiness, and the Nature of Science (Monthly Review Press 2016). This article was first published by MR Online.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "We Need to Connect the 2019-nCoV Coronavirus to Agriculture", "description": "Within any one locale, there is a left program for an outbreak, including organizing neighborhood brigades in mutual aid, demanding any vaccine and antivirals developed be made available at no cost to everyone here and abroad, pirating antivirals and medical supplies, and securing unemployment and healthcare coverage as the economy tanks during the outbreak.", "url": "https://www.independentsciencenews.org/health/we-need-to-connect-the-2019-ncov-coronavirus-and-agriculture/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-02-17T01:17:03+00:00", "article:modified_time": "2020-06-11T00:10:52+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/02/outbreak-coronavirus-world-1024x683px-600x400-1.jpg", "image:width": "600", "image:height": "400", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/about/symptoms.html", "https://www.cdc.gov/sars/about/index.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6446491/", "https://www.nytimes.com/2020/01/28/world/asia/china-coronavirus.html", "https://www.nytimes.com/2020/01/26/world/asia/coronavirus-wuhan-china-hubei.html", "https://www.medrxiv.org/content/10.1101/2020.01.23.20018549v1", "https://en.wikipedia.org/wiki/Basic_reproduction_number", "https://nextstrain.org/ncov", "https://en.wikipedia.org/wiki/Coronavirus", "https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6", "https://www.cnn.com/2020/01/28/asia/wuhan-coronavirus-update-jan-29-intl-hnk/index.html", "https://link.springer.com/chapter/10.1007/978-3-319-40940-5_5", "https://www.usatoday.com/story/news/health/2020/01/24/coronavirus-versus-flu-influenza-deadlier-than-wuhan-china-disease/4564133002/", "https://www.gutenberg.org/files/376/376-h/376-h.htm", "https://www.google.com/books/edition/The_Great_Influenza/BYsW6qTP0pMC?hl=en&gbpv=1&printsec=frontcover", "https://linkinghub.elsevier.com/retrieve/pii/S1473-3099(12)70121-4", "https://www.youtube.com/watch?v=8hedw5jKgzw", "https://en.wikipedia.org/wiki/Herd_immunity", "https://www.washingtonpost.com/science/2020/01/24/scientists-are-unraveling-chinese-coronavirus-with-unprecedented-speed-openness/", "https://www.ncbi.nlm.nih.gov/pubmed/28895870", "https://www.ncbi.nlm.nih.gov/pubmed/16339050", "https://www.cnn.com/2020/01/26/health/coronavirus-spread-symptoms-chinese-officials/index.html", "https://jech.bmj.com/content/57/12/918.2", "https://farmingpathogens.wordpress.com/2012/11/30/beware-the-blob/", "https://monthlyreview.org/product/big_farms_make_big_flu/", "https://www.pnas.org/content/104/11/4473.short", "https://farmingpathogens.wordpress.com/2017/10/31/prometheus-rebound/", "http://bit.ly/37hOqrl", "https://farmingpathogens.wordpress.com/2013/04/14/broiler-explosion/", "https://www.powercube.net/other-forms-of-power/gramsci-and-hegemony/", "https://en.wikipedia.org/wiki/Allee_effect", "https://journals.sagepub.com/doi/abs/10.1177/0020731415611644", "https://www.statnews.com/2019/04/12/the-data-are-clear-ebola-vaccine-shows-very-impressive-performance-in-outbreak/", "https://www.sciencemag.org/news/2019/08/finally-some-good-news-about-ebola-two-new-treatments-dramatically-lower-death-rate", "https://foreignpolicy.com/2019/04/30/cliches-can-kill-in-congo-grand-nord-north-kivu-tropes-conflict-ebola-response/", "https://www.versobooks.com/books/2779-old-gods-new-enigmas", "https://www.nytimes.com/2020/01/25/world/asia/china-markets-coronavirus-sars.html", "https://onlinelibrary.wiley.com/doi/abs/10.1002/jmv.25682", "http://www.xinhuanet.com/english/2020-01/27/c_138735677.htm", "https://twitter.com/BatResearch/status/1221979912501772289", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30183-5/fulltext", "https://www.sciencemag.org/news/2020/01/wuhan-seafood-market-may-not-be-source-novel-virus-spreading-globally", "https://www.scribd.com/document/444194430/Pork-Pigs-and-the-Wuhan-Coronavirus", "https://www.nytimes.com/2019/12/17/business/china-pigs-african-swine-fever.html", "https://link.springer.com/chapter/10.1007/978-3-319-40940-5_2", "https://mronline.org/wp-content/uploads/2020/01/rg_wallace_the_great_bird_flu_name_game.pdf", "https://www.nytimes.com/2020/01/23/world/asia/china-coronavirus.html", "https://www.mdpi.com/2071-1050/10/5/1465", "https://www.jstor.org/stable/43958339?seq=1", "https://www.taylorfrancis.com/books/e/9781849776448/chapters/10.4324/9781849776448-17", "https://www.sciencedirect.com/science/article/pii/S0016718515003243", "https://www.sciencedirect.com/science/article/pii/S1201971214014970", "https://www.sciencedirect.com/science/article/abs/pii/S0304401711004808", "https://www.taylorfrancis.com/books/e/9781849776448/chapters/10.4324/9781849776448-17", "https://link.springer.com/article/10.1007/s10460-010-9271-0", "https://www.sciencedirect.com/science/article/abs/pii/S0006320710003368", "https://link.springer.com/article/10.1007/s11250-007-9103-4", "https://www.sciencedirect.com/science/article/pii/S000632071100348X", "https://iopscience.iop.org/article/10.1088/1742-6596/835/1/012010/meta", "https://www.nationalgeographic.com/news/2011/9/110901-shark-new-species-eaten-science-ocean-squalus-formosus-dogfish/", "https://monthlyreview.org/2009/11/01/the-paradox-of-wealth-capitalism-and-ecological-destruction/", "https://limn.it/articles/the-birds-of-poyang-lake-sentinels-at-the-interface-of-wild-and-domestic/", "https://mronline.org/wp-content/uploads/2020/01/book-review_wallace-on-richards1.pdf", "https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1471-0366.2012.00352.x", "https://farmingpathogens.wordpress.com/2014/05/08/collateralized-farmers/", "https://mronline.org/wp-content/uploads/2020/01/Wallace-Duck-and-Cover-Report-September-2018.pdf", "https://mronline.org/wp-content/uploads/2020/01/2019.12.13.19014910v2.full_.pdf", "https://mronline.org/wp-content/uploads/2020/01/2019.12.13.19014910v2.full_.pdf", "https://farmingpathogens.wordpress.com/2010/10/25/we-can-think-ourselves-into-a-plague/", "https://www.newscientist.com/article/2230617-crispr-edited-chickens-made-resistant-to-a-common-virus/amp/", "http://bit.ly/2O5z2Hl", "https://www.sciencedirect.com/science/article/abs/pii/S0277953614006145?via%3Dihub", "https://www.abc.net.au/news/2020-01-24/coronavirus-came-from-animals-stopping-spread-not-simple/11893420", "https://www.dissentmagazine.org/online_articles/on-the-origins-of-the-professional-managerial-class-an-interview-with-barbara-ehrenreich", "https://jacobinmag.com/2019/10/ecological-politics-for-the-working-class/", "https://books.google.com/books?id=lQE9DAAAQBAJ&pg=PA160&lpg=PA160&dq=Big+Farms+Make+Big+Flu+Two+Gentlemen+of+Verona&source=bl&ots=G6ckmrjWkW&sig=ACfU3U3KIvGO4Ev7tdjrM-0lYF3Il1koIg&hl=en&sa=X&ved=2ahUKEwicoYmMuaXnAhXKKs0KHbb1DesQ6AEwA3oECAgQAQ#v=onepage&q=B", "https://www.commondreams.org/news/2016/01/15/ultra-rich-philanthrocapitalist-class-undermining-global-democracy-report", "https://www.google.com/books/edition/China_Syndrome/HRz3_mgUnqYC?hl=en&gbpv=1&printsec=frontcover", "https://farmingpathogens.wordpress.com/2015/06/10/made-in-minnesota/", "https://www.iatp.org/blog/201703/industrial-production-poultry-gives-rise-deadly-strains-bird-flu-h5nx", "https://journals.sagepub.com/doi/10.1068/a4712com", "https://link.springer.com/book/10.1007/978-3-319-72850-6", "https://farmingpathogens.wordpress.com/2009/06/01/the-hog-industry-strikes-back/", "https://farmingpathogens.wordpress.com/2015/06/10/made-in-minnesota/", "https://en.wikipedia.org/wiki/Third_camp", "https://monthlyreview.org/2013/12/01/marx-rift-universal-metabolism-nature/", "https://books.google.com/books?id=VH-tCwAAQBAJ&pg=PA250&lpg=PA250&dq=Big+Farms+Make+Big+Flu+%22A+probiotic+ecology%22&source=bl&ots=pODYylj_kP&sig=ACfU3U1qAqSTOZtQ23hhfStmVoOYHup9wQ&hl=en&sa=X&ved=2ahUKEwiix7zunqTnAhXZKs0KHexIBj0Q6AEwAXoECAkQAQ#v=onepage&q", "https://farmingpathogens.wordpress.com/", "https://monthlyreview.org/product/big_farms_make_big_flu/", "https://mronline.org/2020/01/29/notes-on-a-novel-coronavirus/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-02-17T01:17:03+00:00"}