{"result_id": "166015", "URL": "https://www.independentsciencenews.org/science-media/the-puppetmasters-of-academia-ny-times-left-out/", "timestamp": "2023-04-25 15:36:36 CEST+0200", "meta": {"description": "The real scoop was not the deceit of a handful of individual professors, but proof positive of active collusion between the agribusiness and chemical industries", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/science-media/the-puppetmasters-of-academia-ny-times-left-out/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Puppetmasters of Academia (or What the NYT Left out)", "cleaned_text": "“Reading the emails make(s) me want to throw up” tweeted the Food Babe after reading a lengthy series of them posted online by the NY Times on Sept 5th. The emails in question result from a Freedom of Information Act (FOIA) request and are posted in the side bars of a front-page article by Times reporter Eric Lipton (“Food Industry Enlisted Academics in G.M.O. Lobbying War, Emails Show”). The article is highly disturbing, but, as the Food Babe implied, the Times buried the real story. The real scoop was not the perfidy and deceit of a handful of individual professors. Buried in the emails is proof positive of active collusion between the agribusiness and chemical industries, numerous and often prominent academics, PR companies, and key administrators of land grant universities for the purpose of promoting GMOs and pesticides. In particular, nowhere does the Times note that one of the chief colluders was none other than the President of the American Association for the Advancement of Science (AAAS).\n\nAll this is omitted entirely, or buried in hard-to-notice side bars, which are anyway unavailable to print readers. So, here is the article Eric Lipton should have written.\n\nThe Lipton article seems, at first sight, to be impressive reporting. Lipton describes how Kevin Folta, Chair of the Dept. of Horticulture at the University of Florida secretly took expenses and $25,000 of unrestricted money from Monsanto to promote GMO crops. On behalf of the biotech industry, or via the PR firm Ketchum, Folta wrote on websites and attended public events, trainings, lobbying efforts and special missions.\n\nParts of this were already known, but Lipton digs up further damning evidence and quotes from Folta. They include an email to Monsanto that solidly contradicts Folta’s previous denials of a relationship with Monsanto and the biotech industry: “I am grateful for this opportunity and promise a solid return on the investment,” Folta wrote after receiving the $25,000 check, thereby showing both a clear understanding of his role and the purpose of the money. The article goes on to similarly expose Bruce Chassy (Prof Emeritus, University of Illinois) and David Shaw (Mississippi State University). It also discussses, presumably for “balance”, agronomist and GMO critic Charles Benbrook, then at Washington State University, who unlike the others openly acknowledged his funding.\n\nBut readers of the emails can find facts that are much more damaging to perceptions of academic independence than that contained in the main article. For one thing, the money Folta received is insignificant besides the tens of millions his university was taking from Syngenta (>$10million), Monsanto(>$1million), Pioneer (>$10million), and BASF (>$1million). Money that it’s hard to believe did not have a role in protecting Kevin Folta as he roamed zealously (and often offensively) over the internet, via his twitter account, blog, podcast, and OpEds, squelching dissent and ridiculing GMO critics wherever he went.\n\nAlso missing from the main Times article is a sense of the extensive and intricate networking of a small army of academics furthering the interests of Monsanto and other parts of the chemical, agribusiness and biotech industries. Folta rarely acted alone. His networks are filled with economists, molecular biologists, plant pathologists, development specialists, and agronomists, many of them much more celebrated than Kevin Folta, but all of them in a knowing loop with industry and the PR firms. Their job was acknowledged openly in emails (“We are all bad-ass shills for the truth. It’s a pleasure shilling with you.” Or, as Folta himself put it: “I’m glad to sign on to whatever you like, or write whatever you like.”). More generally, the group’s role was to initiate academic publications and other articles and to firefight legislative, media and scientific threats to the GMO and pesticide industries, all the while keeping their industry links hidden.\n\nThe academics identified by these emails as cooperating with industry and PR firms include:\n\nProfs. Bruce Chassy (University of Illinois) and Alan McHughen (University of California, Riverside) who worked together to destroy the credibility of Russian scientist and GMO critic Irina Ermakova. They persuaded the journal Nature Biotechnology to interview Ermakova about her research and describe it. This interview was followed by a detailed critique of her research (about which none of the authors were expert). Ermakova was neither told of the critique nor given a chance to answer it. This whole elaborate subterfuge required her to be sent a dummy proof of the article she thought she was publishing in the journal.\n\nProf. Roger Beachy (Danforth Center, formerly USAID). Beachy is the principal living exponent of a classic biotech strategy: to respond rapidly to a report or publication critical of some aspect of the technology with a multi-author “rebuttal” [Disclaimer: the inaugural report of the Bioscience Resource Project (on the genome damage caused by genetic engineering) was met, even before formal publication, with both barrels from 23 professors, including Roger Beachy (Altpeter et al 2005)].(2)\n\nProf. Ron Herring (Cornell) who has helped to promote GMOs in India and fought to defuse the farmer suicide debate in India.\n\nProf. CS Prakash (Tuskegee University) is the convener of the influential listserv AgBioWorld. AgBioWorld was the all-important conduit for a petition signed by three thousand scientists calling for the retraction of a 2001 scientific paper showing GMO contamination of Mexican corn (Quist and Chapela 2001). As detailed in an article called The Fake Persuaders, the scientists who initiated the petition, and made inaccurate and inflammatory statements about the authors, were not real people. However, their emails could be traced back to servers belonging to Monsanto or Bivings, a PR company that was working with Monsanto at the time.\n\nProf. Nina Fedoroff (Penn State) is the most prominent of all of the scientists looped into all of the Times emails. Nina Fedoroff was the 2011-2012 President of the American Association for the Advancement of Science. The AAAS is the foremost scientific body in the US. During her Presidency, Fedoroff, who is also a contributor to the NY Times, used her position to coordinate and sign a letter on behalf of 60 prominent scientists. This letter was sent to EPA as part of an effort to defeat a pesticide regulatory effort. The real coordinator was Monsanto but Fedoroff participated in phone conferences and email exchanges with them (including with the prominent lobbyist Stanley Abramson) and gets credit in the emails for “moving the ball far down the field”. Yet Nina Fedoroff is not once named in the main article and nowhere at all is her position noted.\n\nSo the story that academia’s most vocal GMO defenders, and some of its most prominent scientists, are copied into these emails is missing. The focus on individuals like Folta occludes a demonstration, for the first time ever, of long-suspected and intricate coordination and cooperation among them.\n\nAlso looped in to various of the emails are supposedly independent individuals and organisations who speak in favour of biotechnology, self-reportedly out of personal passion. These include Dr Steve Savage, Karl Haro von Mogel of Biofortified, Mischa Popoff (of the Heartland Institute) and Jon Entine (then affiliated with George Mason University and now head of the Genetic Literacy Project and a Forbes Magazine columnist). All are revealed, by the emails but not the article, as biotech insiders.\n\nCooperation among academics is not a crime. But these emails show, as in the EPA letter example, that a company (usually Monsanto, but also Dow and Syngenta and a PR firm, often several of them, plus sometimes the biotech lobbyists BIO or CropLife America) were invariably looped in to these emails, and further, that initiatives usually began with one of these non-academic entities, and were shepherded by them. Only rarely is there even a suggestion from the emails that the various academics were out in front, though that was always the intended impression of the result.\n\nBut perhaps the biggest of all revelations within these emails is the connivance of senior university administrators, especially at Cornell University. The NY Times article focuses on the misdeeds of Mississippi State University Vice President David Shaw. But, looped into one email string, along with the PR firm Ketchum and Jon Entine are various Cornell email addresses and names. These are ignored by Lipton, but the email addresses belong to very senior members of the Cornell administration. They include Ronnie Coffman (Director of Cornell’s College of Agriculture and Life Science) and Sarah Evanega Davidson (now director of the Gates-funded Cornell Alliance for Science).\n\nThe Alliance for Science is a PR project and international training center for academics and others who want to work with the biotech industry to promote GMOs. It is funded ($5.6 million) by the Gates Foundation. Its upcoming program of speakers at Cornell for September include Tamar Haspel (Washington Post reporter), Amy Harmon (New York Times reporter) and Prof. Dan Kahan (Yale Law School). These speakers are the exact ones mentioned in a proposal worked out between Kevin Folta and Monsanto in a series of email exchanges intended to enhance biotech outreach. These email exchanges also propose setting up “Ask Me Anything” events to be held at universities around the country with Kevin Folta as of the panelists.\n\nOn Sept 10th the Cornell Alliance for Science is hosting an event in downtown Ithaca (home town of Cornell). It is called “Ask Me Anything About GMOs” and Kevin Folta is a panelist. Somehow or other Davidson’s Cornell Alliance for Science read Monsanto’s lips, perfectly.\n\nYour right to know\n\nLet me speculate at what is really going on behind the scenes of Lipton’s article.\n\nEarlier this year, a newly-formed US group called US Right to Know (USRTK) set in motion Freedom of Information Act (FOIA) requests directed at 14 (now 43) prominent public university scientists it suspected of working with (and being paid by) the biotech industry and/or its PR intermediaries. Now, if these 43 academics had nothing to hide, this request would not have attracted much attention and hardly any emails would have been forthcoming. However, the USRTK FOIA requests triggered a huge outcry in various quarters about the “harassment” of public scientists. The outcry has led to OpEds in the LA Times and the controversial removal of scientific blog posts defending USRTK, and much else besides, as reputedly tens of thousands of emails (from these FOIA requests) have landed on the desks of USRTK.\n\nWhat would a good PR company recommend to its clients in such a situation? In order to preempt the likely upcoming firestorm, it might recommend that various media outlets run ahead of USRTK to publish a version of events in which academic small-fry like Kevin Folta, Bruce Chassy and David Shaw (of Mississippi State) are the villains. Making them the fall guys lets others off the hook: high-profile scientists like Nina Fedoroff and Roger Beachy; the pro-biotech academic community in general; and prestigious Ivy League institutions like Cornell University.\n\nThese much bigger fish are who the NY Times should have harpooned. Since they did not, or perhaps would not, let us hope that USRTK will make better use of those emails, ideally by posting all of them online.\n\n(1) Others Professors cc’d into the emails released by the NYTimes include : Peter Davies (Cornell), Carl Pray (Rutgers), Tony Shelton (Cornell), Peter Phillips (University of Saskatchewan), Prabhu Pingali (Cornell), Elizabeth Earle (Cornell), Peter Hobbs (Cornell), Janice Thies (Cornell) and Ann Grodzins Gold (Syracuse), Martina Newell-McGloughlin (UC Davis).\n\n (2) Later published as A. K. Wilson, J. R. Latham and R. A. Steinbrecher (2006) Transformation-induced Mutations in Transgenic Plants: Analysis and Biosafety Implications. Biotechnology and Genetic Engineering Reviews 23: 209-237\n\nAltpeter F. et al (2005) Particle bombardment and the genetic enhancement of crops: myths and realities. Molecular Breeding 15: 305–327.\n\n David Quist and Ignacio H. Chapela (2001) Transgenic DNA introgressed into traditional maize landraces in Oaxaca, Mexico. Nature 414: 541-543\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Puppetmasters of Academia (or What the NYT Left out)", "description": "The real scoop was not the deceit of a handful of individual professors, but proof positive of active collusion between the agribusiness and chemical industries", "url": "https://www.independentsciencenews.org/science-media/the-puppetmasters-of-academia-ny-times-left-out/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2015-09-08T14:39:24+00:00", "article:modified_time": "2020-06-04T15:46:16+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2015/09/Food-Industry-Enlisted-Academicsv2-.jpg", "image:width": "508", "image:height": "350", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://foodbabe.com/", "http://www.nytimes.com/2015/09/06/us/food-industry-enlisted-academics-in-gmo-lobbying-war-emails-show.html?_r=0", "https://gmoanswers.com/experts/kevin-folta", "http://www.nature.com/news/gm-crop-opponents-expand-probe-into-ties-between-scientists-and-industry-1.18146", "http://kfolta.blogspot.com/", "http://www.gmfreecymru.org/pivotal_papers/involvement_ermakova.htm", "http://www.pnas.org/content/105/7/E9.full", "http://www.researchgate.net/profile/Hans_Mooibroek/publication/226141826_Particle_bombardment_and_the_genetic_enhancement_of_crops_myths_and_realities/links/02e7e5149c291bc7bd000000.pdf", "http://casi.sas.upenn.edu/iit/rherring", "http://www.nature.com/nature/journal/v414/n6863/full/414541a.html", "http://www.monbiot.com/2002/05/14/the-fake-persuaders/", "http://cornellsun.com/blog/2014/08/28/cornell-alliance-for-science-awarded-5-6-million-grant/", "http://usrtk.org/", "http://usrtk.org/gmo/our-investigation-of-big-food-and-its-front-groups/", "http://retractionwatch.com/2015/08/24/following-criticism-plos-removes-blog-defending-scrutiny-of-science/", "http://www.bioscienceresource.org/wp/wp-content/uploads/2012/02/BSR-2-BGERvol23.pdf", "http://www.researchgate.net/profile/Hans_Mooibroek/publication/226141826_Particle_bombardment_and_the_genetic_enhancement_of_crops_myths_and_realities/links/02e7e5149c291bc7bd000000.pdf", "http://www.nature.com/nature/journal/v414/n6863/full/414541a.html", "#"], "authors": ["Jonathan Latham"], "publish_date": "2015-09-08T14:39:24+00:00"}