{"result_id": "166004", "URL": "https://www.independentsciencenews.org/un-sustainable-farming/bio-economy/", "timestamp": "2023-04-25 15:36:24 CEST+0200", "meta": {"description": "Experts do not have an entirely unblemished record of predicting the future of agriculture.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/un-sustainable-farming/bio-economy/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Does the Bio-Economy Add Up?", "cleaned_text": "Experts do not have an entirely unblemished record of predicting the future of agriculture. In the 1950s it was envisioned that farms would be irrigated with water from icecaps that had been melted by nuclear explosions. Naturally, this water would be stored in ponds also ‘dug’ by nuclear explosions. In the 1970s another generation of experts was predicting an era of remote control tractors and multi-story farms. Electromagnetic ploughing would prepare the soil for crops that would require only half an inch of recycled water per year and specially coated seeds would be blasted from pipes into crop-specific patterns channelled by underground magnetism (1).\n\nMore recently, official predictions of the future have been more biological in character and centred on the “knowledge-based bio-economy” (KBBE). This concept has been embraced by the European Union and governments around the world and is based for the most part on biotechnology. One report (2), published in 2004, by the Strategy and Policy Unit of the EU Directorate General for Research, presents its vision of 2025 thus:\n\n“Below are some of the features of that future world.”\n\n“It is said that money does not grow on trees, but more of our economic prosperity will be based on agricultural produce. Not only will farmers grow food for a larger population, but much of the economy will also be based on the raw materials they grow: new foods, biofuels, and biomaterials. They will become the gatekeepers of the bio-based economy.”\n\n“With attractive careers and investment prospects, farming and its spin offs will trigger a migration away from the cities and back to the countryside. This new agricultural class will make up the backbone of a prosperous and lively rural community away from the stress of urban life.”\n\n“[food] exports from Europe…will be essential to meeting fast-growing demand in China”\n\nNevertheless, despite extensive diversion of agricultural land to biofuels and biomaterials, and Europe’s simultaneous switch from a net importer of food to a net exporter, Europeans will not go hungry. On the contrary:\n\n“As more wild plants are cultivated and new food products are created, culinary culture will witness an unprecedented renaissance. Consumers will have a bountiful choice of tasty fruit and vegetables with good shelf life. As enjoying and experimenting with food becomes an important part of culture, interest in junk food will wane.”\n\nPerhaps as a result of predictions such as this, many countries (even many less-developed nations such as S. Korea, Nigeria and Malaysia) have developed significant programmes aimed at promoting or enticing investment in the biotechnology sector. The European Union, for its part, has funded approximately 400 million euros for plant biotechnology research for the period 1982-2007 (excluding applications like biofuels and pharma crops and spending by individual governments) (3) and this funding is continuing under the recently adopted Framework Programme 7 (FP7).\n\nIn 2005, detecting a deficit of reliable data supporting the KBBE vision the European parliament commissioned a report (which has come to be called ‘BIO4EU’) into the ‘status, opportunities and challenges of modern biotechnology’ and which was to include an assessment of biotechnologies’ contribution to meeting social and environmental goals. This report has just (April 2007) been launched (4).\n\nThe BIO4EU report merits careful study as it represents an important contribution to the midterm review of the European Union’s Biotech Strategy, which was adopted in 2002. New targets, as part of the review, will be adopted by Industry and Research Ministers this spring, thus setting the orientation and funding of biotechnology policy at EU level for years to come.\n\nThe publication of BIO4EU also provides a useful opportunity to dissect the emerging vision of the centrality of a KBBE to the future of the EU. What is the current status, and what are the current benefits, of biotechnology? Exactly how will biotechnology impact farming, the environment and society more generally? Is growth through modern biotechnology more sustainable than ordinary economic growth? Will it contribute decisively to the overall development of a sustainable society?\n\nBIO4EU begins by assessing the current contribution of modern biotechnology to the EU economy. In the executive summary, BIO4EU asserts that 1.43-1.69 % of current EU GVA (Gross Value Added) is contributed by modern biotechnology, a figure which (BIO4EU claims) is not far short of that for the entire EU agriculture or chemical sectors. According to BIO4EU, the three sectors considered within it account individually for 0.04% of total European GVA (medicine and healthcare), 0.01-0.02% (primary production and agro-food) and 0.08% (industrial biotechnology). However, the headline figure of 1.43%-1.69% was derived by adding in all ‘downstream products’ of modern biotechnology, even though the figures for the agricultural (1.79%) and chemical (1.95%) sectors, which were compared side-by-side with modern biotechnology, do not include their respective ‘downstream products’. Thus, if a bull was created using embryo transfer (ET), then all the meat and all the milk produced by all the cows inseminated by that bull were counted as GVA attributable to modern biotechnology. The headline figure of 1.43%-1.69% is therefore effectively an exaggeration. It is simply a product of mis-accounting. That this is so can be gauged from independent but related figures, including the fact that the agricultural industry in the EU employed approximately 7.4 million people (in 1997, before EU enlargement), which is hundreds of times more than the modern biotechnology industry (5).\n\nInspection of BIO4EUs’ list of modern biotechnologies presently used in agriculture also reinforces the conclusion that the contributions of current biotechnology are relatively minor. BIO4EUs list comprises the following: genetic markers, genetically modified organisms (GMOs), micropropagation and embryo transfer (in animal and plant breeding); feed additives in animal production (chiefly lysine and phytase); BSE, GMO and salmonella detection in veterinary and food diagnostics; veterinary vaccines for pseudorabies and enzymes in fruit juice production. This list contains mostly examples that so far have found limited use (for example molecular markers are used mostly in maize or in micropropagation of ornamental plants), which incidentally do not fall within BIO4EUs initially stated definition of modern biotechnology. The list contains hardly a hint (GMOs possibly excepted) that biotechnology is capable of forming the basis of a future agricultural revolution.\n\nBIO4EU then assesses the current contribution of these technologies to the wider and more complex social and economic goals of the EU. Here though, and at many points elsewhere in BIO4EU, outcomes of biotechnology that can be construed as positive are explored in some detail while outcomes of biotechnology that are, might be, or might become, less than positive in their consequences, are sidelined or ignored. To use again the example of ET, which is certainly widely used in cattle breeding, BIO4EU fails to note that the success of ET directly conflicts with EU policy, which is to restrict milk production through a system of quotas. Neither does BIO4EU mention that ET has played a significant role in the recent and drastic shrinkage of the gene pool of European cattle.\n\nGiven these one-sided interpretations, it comes as little surprise when BIO4EU proposes that application of modern biotechnology “reduces use of resources and emissions”; “bolsters the competitiveness of EU companies”; and that “wherever industrial biotechnology is applied it has positive economic and environmental implications”. BIO4EU reached these conclusions by examining evidence in the form of economically successful biotech applications such as ET. It is reasonable to ask however, whether in selecting only successes, BIO4EU has employed a fair sampling method. There have after all been at least as many biotechnology failures as there have been successes, but by selecting only successes (and only their best points) the conclusions above seem to have become more-or-less inevitable. Conversely, much more could perhaps have been learnt about the challenges of biotechnology from the biotech ventures and products that for varying reasons failed in the EU (e.g. the exodus of GM research out of Europe, discontinuation of the Flavr Savr® tomato, the failure of herbicide-tolerant oilseed rape to receive approval in Europe), but these are not discussed (6).\n\nInteresting also is that by most measures there is nothing particularly sustainable about these modern biotechnologies. BIO4EU argues differently though. On multiple occasions it proposes that sustainability arises from higher productivity: pigs have bigger litters, wheat gives more per hectare and thus one obtains more from less. This argument would be true if all else remained equal but in the real world this is rarely the case. A more useful interpretation of these examples might be that biotechnology (like any technology) cannot be separated from the context of who develops it and what they use it for; and at present that means a series of incremental extensions of industrial agriculture with all that entails.\n\nA flawed assessment of the current impacts of biotechnologies and a failure to consult potential sources of contradictory evidence would not seem to leave BIO4EU well placed to predict future trends. Nevertheless, such defects do not automatically preclude useful or accurate predictions for the future.\n\nThe remit of the BIO4EU report means that it has licence to take a position on the big picture prospects of biotechnology, and the executive summary of BIO4EU includes the following statement of what it considers the sustainability credentials of biotechnology. Modern biotechnology, says BIO4EU “provide[s] an opportunity to break the link between economic growth and pressure on the environment”.\n\nWhat then are the specific technologies that will enable this remarkable delinking of the economy and the environment in agriculture? BIO4EUs’ list of emerging technologies for agriculture and primary production comprises the following: plants for non-food purposes (both GM and non-GM, including biofuels, bioplastics and molecular pharming), GM animals (for organ transplantation, novel compounds and pets), animal cloning (for food, pets, sports animals and endangered species), improved diagnostics, biosensors, GMO monitoring and improved vaccines.\n\nThere are several noteworthy points about this list. The first is that, although listed under agriculture, many of these applications have no significant connection with farming (sports animals, pets, endangered species, xenotransplants). Secondly, the list is partially redundant. Cloned animals, for instance, will likely be GM animals since the purpose of cloning is likely to be in propagating transgenic animals. But the most significant feature of this list is that, with the exception of novel crop traits for food, feed and fuel, all of these applications have extremely limited potential, either to provide employment or to impact significantly on the environment. Molecular pharming, xenotransplants and biosensors, may make a modest contribution but BIO4EU again provides little evidence, or argument, that any of these are going to revolutionise farming, let alone liberate us from the constraints of our environment.\n\nFor biofuels, GM and other “resource-efficient biotechnologies”, which might theoretically make a significant contribution to sustainability, one expects that a proposition as bold and prominent as BIO4EUs linkage-breaking argument would have been discussed and supported at some length in the report. This is not the case however. Astonishingly, the de-linking proposition of the executive summary is never explained in the text itself.\n\nFurthermore, BIO4EU does not consider worth mentioning that, even restricting the discussion to carbon emissions, the linkage-breaking argument has a number of obvious and potentially fatal constraints. Among them, land availability for biofuels, the presently limited conversion efficiency of crops into fuel, effects on food prices and a dependence (particularly with respect to biofuels) on technologies that are not yet available and perhaps may never become available. Neither does BIO4EU discuss some of the more general issues raised by this proposition, such as that improvements in resource efficiency may loosen the connection between growth and environmental damage, but they in no way break it. Also not discussed is that much of the discussion of second generation biofuels is of farm ‘waste’. It is doubtful, however, that such waste exists that is not merely an artefact of farm inefficiency. In efficient farming systems there is little waste as residues are principally used to maintain soil fertility.\n\nOn economic issues also, BIO4EU sometimes pushes the envelope of optimism to breaking point. Included in its list of economic opportunities is GMO detection (for the purposes of labelling). Aside from the fact that it is hard to see the GMO detection industry ever becoming a dominant force in the EU economy, GMO detection is seen both by most of industry and most consumers (though for different reasons) purely as a burden. Including GMO detection in a list of economic benefits seems no different from arguing that crime has benefits since it boosts the economy by increasing the need for police officers and prisons.\n\nAs a further example of future benefits, BIO4EU proposes that vaccines will displace antibiotic use in agriculture thereby avoiding further spread of antibiotic resistant pathogens. On one count at least, this is a strange assertion. BIO4EU several times expresses total confidence in EU regulatory procedures so it is curious therefore to find (unreferenced) the implication that current EU regulators are failing to protect public health from spread of antibiotic resistance.\n\nAlthough extremely positive in its tone, BIO4EU thus provides little hard evidence for the future importance or sustainability of the KBBE. It is therefore interesting that two other recent analyses have taken a more sober view of the future prospects of biotechnology. A recent study (3), by Friends of the Earth Europe (FoEE), of industry and EU Commission figures on job creation and competitiveness in agribiotech reports that industry competitiveness in both the EU and US is proving disappointing, market diversity and innovation are being stifled by concentration, and that, even in the US, which has historically invested much more in biotechnology there are few products on the market. On job creation, there are fewer than 97000 biotechnology jobs in the European Union, of which 80% are in the health sector. Furthermore, despite 25 years of EU research funding being channelled into agribiotech, EU research has contributed to few products, and globally, only two GM crop traits (Bt and herbicide-tolerance) have achieved significant commercial success. The promises of other products have largely failed to materialise.\n\nA recent report of the Institute for the study of Genetics, Biorisks and Society (7) on the future of modern biotechnology in healthcare presents a not dissimilar picture of biotechnology in medicine. Despite a high level of public investment and strong support from governments, extreme optimism and dashed hopes have characterised the field.\n\nThe authors of BIO4EU, the Joint Research Centre (JRC), were instructed by the European parliament to examine the challenges of biotechnology as well as its potential. In spite of this clear guidance however, BIO4EU does not reserve a specific section for challenges and, although references to them, as well as benefits, are scattered throughout the text, they are not analysed in detail. They appear more as passing comments rather than being subjected to serious analysis and many obvious challenges are not even mentioned at all. Thus problems of patent thickets and ‘freedom to operate’, the potential for unforeseen risks of new technologies; animal welfare and the consequences of new technologies for market concentration, are all mentioned, but only briefly. At no point, however, does discussion extend to potential solutions to these problems. And not mentioned at all are the currently shaky confidence of European consumers in biotechnology; various defects in governance-including a general lack of transparency, conflicts of interest and the democratic deficit of the scientific, policy and regulatory processes that underlie biotechnology. Furthermore, although EU and other biotechnology risk assessments have received considerable criticism (8), BIO4EU effectively takes their satisfactoriness for granted. This is puzzling since even regulators themselves acknowledge that there are defects and loopholes in risk assessment. They have noted difficulties in certifying whole foods (as opposed to individual chemicals) as safe for human consumption, weaknesses in regulatory procedures in terms of assessment of long term effects, and difficulties associated with taking into account unanticipated consequences (9).\n\nThe final challenge avoided by BIO4EU is more EU-specific. The patent model of intellectual property is a “first-past the post” system. Those who come second get nothing and the problem for Europe is that its research is mostly second-best, and in only a few countries does EU research even begin to compare with that in the US. Thus even if the future bio-economy does live up to the expectations of BIO4EU, Europe is likely to be principally a recipient of technologies developed elsewhere rather than a prime innovator.\n\nBIO4EU thus exaggerates the size of the EU biotech sector and paints a very optimistic picture of growth and other prospects. Untutored readers could therefore be forgiven for coming away with the expectation that a transformed EU biotech-based economy is just around the corner. How and why, given the paucity of significant prospects, is this report so positive and so averse to discussing any challenges?\n\nAn explanation for this may lie in the constitution of the JRC, which was responsible for BIO4EU. It is the European Commission’s own research institute, and exists to carry out research to help guide EU policy decisions. It was set up to enable research to be undertaken that would be independent of Member States’ interests. Whilst its work may well be independent in this sense, the flaws in the research methodology, its optimism toward biotechnology which so closely follows Commission thinking (10,11), and of course the fact that the JRC is, in fact, part of the Commission, raise questions on its independence from EU political decision-making.\n\nA stakeholder process was conducted by the JRC during the writing of BIO4EU but this was dominated by industry and concerns raised by environmental NGOs, and consumer groups were seemingly ignored in the final report. Industry bodies, on the other hand, contributed extensively to BIO4EU, and their interest can be explained since the biotechnology sector stands to gain much from a positive analysis. Optimism supports share prices, it supports biotech industry lobbying efforts, which are much more effective if the industry is seen as the powerhouse of the future economy (rather than the bit-player it presently is), and optimism helps mobilise public and governmental support in the form of research budgets, subsidies and other favourable policies.\n\nReading BIO4EU, one may conclude that the evidence gap that BIO4EU was supposed to fill is not after all principally a failure of data collection, but a failure of substance. The effects of the biotechnology industry (economic and otherwise) are as yet small and its prospects are uncertain. This does not mean that that the future is necessarily bleak for biotechnology, rather that anyone who proposes a grand future for biotech is doing so based on farsightedness and boldness of vision rather than solid evidence.\n\nAnyone can make grandiose predictions about the future and agricultural history is littered with the wishful and discarded visions of technical experts who barely paused to think of the simple practicalities, the social consequences and the safety implications, of their predictions. Using nuclear explosions to dig ponds, apart from being exceedingly hazardous is unlikely ever to have been economic and probably also would not have been very neighbourly. Similarly, it would be interesting to know whether the relevant experts ever considered whether earthworms would have enjoyed electromagnetic waves strong enough to till soil, or if they ever calculated the amount of energy required to perform electromagnetic tillage. The lesson here is that the difficult part of futurism is not imagining technical possibilities but factoring in the inevitable confounding influences imposed by legal, social, cultural, economic and biological realities that collectively determine the course (and value) of technological uptake. These factors are not mere details that can be ignored.\n\nThe EU, compared to its competitors, has a much better informed and also more sceptical public. It also has smaller farms and fields, an agricultural system that is of great concern to much of its population, a significant level of interest in farmland wildlife and a well-developed organic sector. All of these militate against an easy passage of GM crops into agriculture or a revolutionary step-change of any kind. They imply instead multiple practical problems, for instance of genetic contamination by pharma crops. Yet, like many previous visions of the future, there is almost no evidence in BIO4EU that these and other simple practicalities have been taken into account-they have simply been ignored. And since BIO4EU also has such a spectacular disconnect between its bold visions and its practical examples, one is forced to wonder whether the KBBE is not so much a real and substantial prospect but more a fantasy future—one designed to meet present political needs for envisioning sustainability without at the same time abandoning a belief in technological ‘progress’.\n\nJohn Gray, the English political philosopher has proposed that a fundamental characteristic of Western thought is ‘technological utopianism’, the belief that we will eventually attain a heavenly state of social and economic bliss in which all our needs will be painlessly met through technology (12). This belief, he suggests, is essentially irrational, in that it is supported by neither science nor history. He would find nothing to contradict his thesis in BIO4EU.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Does the Bio-Economy Add Up?", "description": "Experts do not have an entirely unblemished record of predicting the future of agriculture.", "url": "https://www.independentsciencenews.org/un-sustainable-farming/bio-economy/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2007-06-10T17:13:33+00:00", "article:modified_time": "2023-03-24T12:40:19+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2013/12/Bio4eu.jpg", "image:width": "168", "image:height": "98", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://www.epsoweb.org/Catalog/TP/Plants%20for%20the%20future-Dec04.pdf", "http://www.bioscienceresource.org/docs/FoEE_biotechMarch072.pdf", "http://bio4eu.jrc.es/", "http://www.bioscienceresource.org/docs/GeneticMedicine.pdf", "http://www.bioscienceresource.org/docs/Schubert.doc", "#"], "authors": ["admin"], "publish_date": "2007-06-10T17:13:33+00:00"}