{"result_id": "166027", "URL": "https://www.independentsciencenews.org/environment/ruthless-power-and-deleterious-politics-from-ddt-to-roundup/", "timestamp": "2023-04-25 15:36:42 CEST+0200", "meta": {"description": "Agribusiness was expanding its conquest of rural America and the world, and the strategic interests of the Pentagon coincided with those of agribusiness.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/environment/ruthless-power-and-deleterious-politics-from-ddt-to-roundup/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Ruthless Power and Deleterious Politics: From DDT to Roundup", "cleaned_text": "Morton Biskind, a physician from Westport, Connecticut, was a courageous man. At the peak of the cold war, in 1953, he complained of maladies afflicting both domestic animals and people for the first time. He concluded that the popular insect poison DDT was the agent of their disease. DDT, he said, was “dangerous for all animal life from insects to mammals.”\n\nYet, he was astonished at what little was done to restrict or ban DDT. On the contrary, officials and scientists defended it:\n\n“[V]irtually the entire apparatus of communication, lay and scientific alike, has been devoted to denying, concealing, suppressing, distorting… [the bad news about DDT]. Libel, slander and economic boycott have not been overlooked… And a new principle of toxicology has… become firmly entrenched…: no matter how lethal a poison may be for all other forms of animal life, if it doesn’t kill human beings instantly, it is safe. When… it unmistakably does kill a human, this was the victim’s own fault – either he was “allergic” to it… or he didn’t use it properly,” he wrote (Biskind 1953).\n\nThe warnings of Biskind went nowhere. The Pentagon was testing nuclear weapons above ground and agribusiness was expanding its conquest of rural America — and the world. The strategic interests of the Pentagon coincided with those of agribusiness.\n\nRachel Carson, the author of “Silent Spring,” listened to Biskind. She denounced the hegemony of chemical pesticides, “the sinister and little-recognized partners of radiation in changing the very nature of the world – the very nature of its life.” She said America’s single-crop farming clashes with how nature works.\n\nInstead, “we allow the chemical death rain to fall…. The crusade to create a chemically sterile world seems to have engendered a fanatic zeal on the part of many specialists and most of the so-called control agencies… there is evidence that those engaged in spraying operations exercise a ruthless power.” (Rachel Carson, Silent Spring)\n\n\n\nMeanwhile, federal agencies and official science pretended nothing was wrong. The US Environmental Protection Agency, born in 1970, had to start from the beginning with toxic chemicals some 17 years after Biskind’s complaint. The political and economic forces of agribusiness, the chemical industry, and politicians forged an unofficial alliance between the Pentagon and big agriculture, with agriculture borrowing the Pentagon’s chemical warfare strategy for American farmers. Furthermore, the missionaries of agricultural industrialization adopted and spread the profitable new approach to chemical danger — what Biskind aptly called “a new principle of toxicology” — that still reigns supreme among the practitioners of conventional science and politics in the early twenty-first century. Like a gigantic octopus, the chemical industry put its tentacle all over Congress, the White House and land grant universities.\n\nNo wonder most toxic chemicals have been entering the market without being tested for health and environmental effects. Only the Federal Insecticide, Fungicide and Rodenticide Act (FIFRA) and the food and drug part of the Food, Drug and Cosmetic Act require testing of chemicals. The Occupational Safety and Health Act, the Toxic Substances Control Act, the cosmetic provisions of the Food, Drug and Cosmetics Act, as well as all other federal laws require no testing for the chemicals or other products entering the market. This does not prevent the industry men and women say the products of their companies “meet EPA standards.”\n\nDDT came out of that careless chemical culture – and war. DDT was successful in fighting malaria during World War II. For that reason, in 1948, its inventor, the Swiss scientist Paul Miller, received the Nobel Prize for medicine. By then DDT was used widely in America. The US Department of Agriculture “registered” it in 1945.\n\nThe popularity of DDT had nothing to do with its presumed “safety.” DDT killed more than insects. DDT doomed birds by making it impossible to give birth to live chicks. Their brittle shell cracked under the weight of the adult bird during hatching. DDT was particularly deleterious to predatory birds, bringing peregrine falcons, osprey, brown pelicans, and bald eagles to the brink of extinction. DDT also killed many insects it had not been designed to target, and also small animals, which ate DDT-poisoned fish and wildlife.\n\nThe deathly legacy of DDT and DDT-like chemicals has been a long one. The reason is their chemical properties: DDT belongs to the organochlorines, a huge group of chlorine-based poisons that last for decades in nature while accumulating in the fat of the animal ingesting them.\n\nIt was the human effects of DDT that convinced EPA to ban it in 1972. EPA considered DDT “a potential human carcinogen.” By that time, the early 1970s, DDT had contaminated “staple human foods, especially meat and milk.” In 1973, a federal judge did not know what to do since DDT had contaminated nearly all foods.\n\nHe said, “Although the cancer aspects of DDT are frightening, the obvious solution to that problem, that is, a total ban on foods containing DDT, is not available. Virtually every food contains some DDT… DDT has presented, and apparently will continue to present a massive dilemma both for EPA and for society.” (USA vs Goodman, 1973)\n\n\n\nThe same happened to the global environment. In 1979, two Wildlife Society scientists, Steven G. Herman and John B. Bulger, reported that DDT was “the most widespread and pernicious of global pollutants.” (Herman and Bulger 1979).\n\nThe banning of DDT in America in 1972 did not bring about any rethinking of factory farming and its addiction to deleterious pesticides. In fact, large industrialized and pesticide-dependent farms are now crowding the planet. Their owners preach a war on hunger but in actual practice their war is directed against the natural world and small farmers and peasants. And despite their propaganda for feeding the world, they only produce about a third of the world food. Peasants, not industrialized farmers, feed most of the world’s people (Douwe van der Ploeg, 2014). But industrialized farmers are responsible for huge harm done to the natural world and people. That harm comes in the form of global warming and the poisoning of wildlife, rivers, drinking water, and food.\n\nOther toxins replaced DDT. One that became extremely successful worldwide is glyphosate, the so-called active ingredient of Roundup weed killer. This herbicide is a product of the multinational giant seed and agribusiness company Monsanto.\n\nGlyphosate received its EPA registration in 1974. This was a time of deep corruption in the chemical industry. For a few decades before and after 1974, laboratories widely fabricated “safety” studies of pesticides, other chemicals, and also drugs. The fraud enabled these to benefit from government registration. It opened the doors to sales. I don’t know if glyphosate entered the market through fraud. But I do know 1974, the year EPA registered glyphosate, was a year of corruption for most pesticides. The EPA scientist who uncovered the lab fraud, Adrian Gross, was my friend and colleague.\n\nJust like DDT, glyphosate quickly became a global celebrity. Scientists on the payroll of the industry, including scientists of our land grant universities, declared it “safe.” Farmers, gardeners and lawn keepers adopted it widely.\n\nHowever, not everybody was happy seeing another weed killer making the rounds all over the world. Glyphosate caught the attention of Don Huber, a retired Colonel from the army’s biological warfare corps and a retired academic scientist from Purdue University where he taught for 35 years. Of all the things he knows about biological weapons and diseases and crops, he is the most concerned about the effects of pesticides on the biological systems making up agriculture. He illustrates his anxiety with the effects of glyphosate on crops.\n\nGlyphosate is more than a best-selling weed killer. It is also a powerhouse of genetic engineering. Its masters have bioengineered crops, called Roundup Ready soybeans, Roundup Ready corn, etc., to resist its killing power. This is music to the ears of farmers who can clear their fields of weeds just by spraying their crops with glyphosate.\n\nMonsanto would like one day to control the world’s food supply. With that imperial purpose in mind, Monsanto has been using seeds, crops, pesticides, and genetic engineering to spread its know-how throughout the planet.\n\nBut like other agribusiness giants, hubris keeps it blind to the harm its products may often cause to humans and the natural world. Studies published in 2010 show glyphosate is causing birth defects in frogs and chicken embryos at amounts smaller than those farmers and gardeners leave in food (Paganelli et al. 2010). Older studies document: cancer, endocrine disruption, damage to DNA, and deleterious malformations of the reproductive, neurological and developmental systems of animals, including human beings (Richard et al. 2005; Benachour et al. 2007). Some researchers also link glyphosate to miscarriages afflicting people and livestock. Both the industry, including Monsanto, and government authorities have known about the toxic effects of glyphosate since the 1980s. Yet both industry and regulators have kept the public in the dark.\n\nAccording to Huber, “glyphosate promotes soil pathogens and is already implicated with the increase of more than 40 plant diseases.” Furthermore, Huber reported that glyphosate “dismantles plant defenses” against disease by immobilizing vital nutrients, which means the growing crop is starved of the nutrients it must have to defend itself against disease and to be nutritious. Such impoverished crops, says Huber, are causing “animal disorders.”\n\nOn November 1, 2011, Huber visited England where he made a presentation to the All-Party Parliamentary Group on Agroecology of the House of Commons (Huber, 2011). His main argument was that glyphosate “predisposes plants to disease” and “stimulates pathogens” in the soil. In other words, glyphosate acts by compromising the defense of crops against disease; glyphosate kills the targeted plants (weeds) by becoming a biological war agent, in a sense, boosting disease organisms in the soil while killing disease resistance organisms. For the last 30 years glyphosate has been sterilizing the land of organisms that are essential for the health of crops. Such microorganisms are the highways through which plants absorb essential micronutrients. They are also responsible for fixing up to 75 percent of the nitrogen legumes like soybeans, alfalfa and peas need for protein. By killing microorganisms, glyphosate reduces the ability of crops to take up micronutrients from the earth. These micronutrients, like calcium, nickel, copper, iron, manganese and zinc are essential for the health and nutritional quality of crops and, therefore, the health of animals and people eating these crops. Huber connected the micronutrient deficiencies in crops to evidence of stillborn calves and animal disease.\n\nLike Morton Biskind in 1953, Huber in 2011 spoke of the danger of a new super weed killer, glyphosate. In both cases, separated by 58 years, we have the sick feeling little, maybe nothing, has changed. The same irresponsible agribusiness activities threaten the possible devastation of American agriculture.\n\nHuber denounces the betrayal of public trust by government, industry and academia. In fact, he cites a letter from 26 university entomologists to EPA in which these scientists complain they are prohibited from doing research because their universities receive money from genetic engineering companies to advance their mission, not the public good. And Huber laments the inexplicable reality of “how willing we’ve been to sacrifice our children and future generations and to jeopardize the sustainability of our entire agricultural infrastructure that is the very basis of our existence as a society.”\n\nIn spite of the warnings of Huber and other scientists, the USDA “regulators” of genetically engineered crops continue with business as usual. The EPA “regulators” of pesticides also continue with business as usual. The USDA recently approved 2,4-D for a new genetically modified corn. Apparently, they forgot the “weed killer” 2,4-D was a chemical weapon in the Vietnam War. Like its Agent Orange sibling, 2,4,5-T, the herbicide 2,4-D was contaminated by the lethal 2378-dioxin. Adding 2,4-D to the arsenal of GM crops doesn’t bode well for America and the world.\n\nFortunately, there’s resistance to business as usual. I cited Biskind and Carson but in the late 1960s, biologist Paul Shepard attacked the insanity of industrialization. He said ecology was more than a science. It was a resistance movement. He said ecologists are subversive because they challenge our “right” to pollute the environment, destroy predatory animals, spread pesticides everywhere, contaminate water and food, and appropriate the land for military and industrial purposes. Furthermore, ecology subverts our delusions of unlimited human population, the domestication of all wild places, large-scale manipulation of the atmosphere and the seas, and the extinction of species.\n\nResistance is now taking a new form: the removal of global toxins, unfortunately, one at a time. In early 2015, the usually timid and agribusiness-friendly, World Health Organization, declared both glyphosate and 2,4-D probable human carcinogens. Following on this modest step, in May 14, 2015, the International Society of Doctors for the Environment, based in Basel, Switzerland, issued an appeal to the European governments: “To immediately and permanently ban, with no exceptions, the production, trade and use in all the EU territory of glyphosate-based herbicides.” The UK journalist, Georgina Downs, echoes that sentiment to include all pesticides.\n\nHumans need a pesticides-free future. We need to appeal to all politicians all over the world to ban permanently and without exception all pesticides. Glyphosate represents all pesticides. Our message and policies should be telling agribusiness companies enough is enough: no more death rain. Monsanto, on the other hand, is building additional facilities to manufacture another weed killer by the name of dicamba in order to mix it up with glyphosate. That way the joint product will be more effective against the super weeds resisting glyphosate.\n\nPesticides are chemical weapons. They were brought to market under the cover of questionable and often fraudulent science and regulation. They are maintained in farming under the false pretense of feeding the world. They are danger itself; they are biocides. They are simply the money lubricants of giant agriculture. They serve no public purpose. We don’t need them.\n\nBenachour et al. (2007) Time-and dose-dependent effects of roundup on human embryonic and placental cells. Arch. Environ. Contam. Toxicol. 53, 126–133.\n\n Biskind, MS (1953) “Public Health Aspects of the New Insecticides,” American Journal of Digestive Diseases 20: 331-341.\n\n Douwe van der Ploeg, J “Peasant-driven agricultural growth and food sovereignty,” The Journal of Peasant Studies 41: 999-1030.\n\n Herman SG and Bulger JB (1979), “Effects of a Forest Application of DDT on Nontarget Organisms,” Wildlife Monographs, No 69: 49.\n\n Hobbelink, H “Hungry for Land” Grain, May 2014.\n\n Huber, DM “The effects of glyphosate (Roundup) on soils, crops and consumers” (Presentation to the All-Party Parliamentary Group on Agroecology, House of Commons, UK, 1 November 2011).\n\n Paganelli A. et al. (2010) Glyphosate-Based Herbicides Produce Teratogenic Effects on Vertebrates by Impairing Retinoic Acid Signaling. Chem. Res. Toxicol. 23: 1586-1595.\n\n Richard S, Moslemi S, Sipahutar H, Benachour N and Seralini G-E (2005) Differential Effects of Glyphosate and Roundup on Human Placental Cells and Aromatase. Environmental Health Perspectives 113: 716-720.\n\n Shepard, P “Ecology and Man – a Viewpoint” in The Subversive Science, ed. Paul Shepard and Daniel McKinley (Boston: Houghton Mifflin, 1969) 9.\n\n United States v. Goodman 486 F. 2d at 855 (7th Cir. 1973).\n\nEvaggelos Vallianatos, Ph.D., is a former EPA analyst. He is the author of hundreds of articles and several books, including “Poison Spring: The Secret History of Pollution and the EPA” (with McKay Jenkins, Bloomsbury Press, 2014).\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ruthless Power and Deleterious Politics: From DDT to Roundup", "description": "Agribusiness was expanding its conquest of rural America and the world, and the strategic interests of the Pentagon coincided with those of agribusiness.", "url": "https://www.independentsciencenews.org/environment/ruthless-power-and-deleterious-politics-from-ddt-to-roundup/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2015-07-17T12:57:21+00:00", "article:modified_time": "2017-07-17T16:19:31+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2015/07/DDTis-Good-for-mecrop1web.jpg", "image:width": "1460", "image:height": "1008", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://nepis.epa.gov/Exe/ZyNET.exe/910128JF.TXT?ZyActionD=ZyDocument&Client=EPA&Index=Prior+to+1976&Docs=&Query=&Time=&EndTime=&SearchMethod=1&TocRestrict=n&Toc=&TocEntry=&QField=&QFieldYear=&QFieldMonth=&QFieldDay=&IntQFieldOp=0&ExtQFieldOp=0&XmlQuery=&File=D%3A\\zyfiles\\Index%20Data\\70thru75\\Txt\\00000018\\910128JF.txt&User=ANONYMOUS&Password=anonymous&SortMethod=h|-&MaximumDocuments=1&FuzzyDegree=0&ImageQuality=r75g8/r75g8/x150y150g16/i425&Display=p|f&DefSeekPage=x&SearchBack=ZyActionL&Back=ZyActionS&BackDesc=Results%20page&MaximumPages=1&ZyEntry=1&SeekPage=x&ZyPURL", "https://www.independentsciencenews.org/environment/how-the-great-food-war-will-be-won/", "https://www.grain.org/article/entries/4952-media-release-hungry-for-land", "https://en.wikipedia.org/wiki/Industrial_Bio-Test_Laboratories", "http://xa.yimg.com/kq/groups/23009980/1257051006/name/tx1001749.pdf", "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.276.7132&rep=rep1&type=pdf", "http://stopogm.net/files/TDDERHEPC.pdf", "http://www.gmwatch.eu/component/content/article?id=12481:reports-official-report-confirms-correlation", "http://earthopensource.org/earth-open-source-reports/roundup-and-birth-defects-is-the-public-being-kept-in-the-dark/", "http://farmandranchfreedom.org/letter-dr-huber-roundup-animal-miscarriage-infertility/", "http://www.reuters.com/article/2011/08/12/us-glyphosate-idUSTRE77B58A20110812", "http://www.i-sis.org.uk/USDA_scientist_reveals_all.php", "http://www.isde.org/Appeal_glyphosate_IARC.pdf", "http://www.theecologist.org/News/news_analysis/2848400/its_not_just_glyphosate_and_neonicotinoids_why_we_need_a_pesticidefree_future.html", "http://www.reuters.com/article/2015/06/24/monsanto-dicamba-idUSL1N0ZA1XN20150624", "http://stopogm.net/files/TDDERHEPC.pdf", "https://www.grain.org/article/entries/4952-media-release-hungry-for-land", "http://xa.yimg.com/kq/groups/23009980/1257051006/name/tx1001749.pdf", "http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.276.7132&rep=rep1&type=pdf", "#"], "authors": ["Jonathan Latham"], "publish_date": "2015-07-17T12:57:21+00:00"}