{"result_id": "166032", "URL": "https://www.independentsciencenews.org/commentaries/did-this-virus-come-from-a-lab-maybe-not-but-it-exposes-the-threat-of-a-biowarfare-arms-race/", "timestamp": "2023-04-25 15:36:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/commentaries/did-this-virus-come-from-a-lab-maybe-not-but-it-exposes-the-threat-of-a-biowarfare-arms-race/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Did this Virus Come from a Lab? Maybe Not — But it Exposes the Threat of a Biowarfare Arms Race", "cleaned_text": "This article first appeared at Salon\n\nThere is no scientific finding that the novel coronavirus was bioengineered, but its origins are not entirely clear. Deadly pathogens discovered in the wild can be studied in secret in labs — and sometimes made more dangerous. That possibility, and other plausible scenarios, have been incorrectly dismissed in remarks by some scientists and government officials, and in the coverage of most major media outlets.\n\nRegardless of the source of this pandemic, there is considerable documentation that a global biological arms race going on outside of public view could produce even more deadly pandemics in the future.\n\nWhile much of the media and political establishment have minimized the threat from such lab work, some hawks on the American right like Sen. Tom Cotton, R-Ark., have singled out Chinese biodefense researchers as uniquely dangerous.\n\nBut there is every indication that U.S. lab work is every bit as threatening as that in Chinese labs. American labs also operate in secret, and are also known to be accident-prone.\n\nThe current dynamics of the biological arms race have been driven by U.S. government decisions that extend back decades. In December 2009, Reuters reported that the Obama administration was refusing even to negotiate the possible monitoring of biological weapons.\n\nMuch of the left in the U.S. now appears unwilling to scrutinize the origin of the pandemic — or the wider issue of biowarfare — perhaps because portions of the anti-Chinese right have been so vocal in making unfounded allegations.\n\nGovernments that participate in such biological weapon research generally distinguish between “biowarfare” and “biodefense,” as if to paint such “defense” programs as necessary. But this is rhetorical sleight-of-hand; the two concepts are largely indistinguishable.\n\n“Biodefense” implies tacit biowarfare, breeding more dangerous pathogens for the alleged purpose of finding a way to fight them. While this work appears to have succeeded in creating deadly and infectious agents, including deadlier flu strains, such “defense” research is impotent in its ability to defend us from this pandemic.\n\nThe legal scholar who drafted the main U.S. law on the subject, Francis Boyle, warned in his 2005 book “Biowarfare and Terrorism” that an “illegal biological arms race with potentially catastrophic consequences” was underway, largely driven by the U.S. government.\n\nFor years, many scientists have raised concerns regarding bioweapons/biodefense lab work, and specifically about the fact that huge increases in funding have taken place since 9/11. This was especially true after the anthrax-by-mail attacks that killed five people in the weeks after 9/11, which the FBI ultimately blamed on a U.S. government biodefense scientist. A 2013 study found that biodefense funding since 2001 had totaled at least $78 billion, and more has surely been spent since then. This has led to a proliferation of laboratories, scientists and new organisms, effectively setting off a biological arms race.\n\nFollowing the Ebola outbreak in west Africa in 2014, the U.S. government paused funding for what are known as “gain-of-function” research on certain organisms. This work actually seeks to make deadly pathogens deadlier, in some cases making pathogens airborne that previously were not. With little notice outside the field, the pause on such research was lifted in late 2017.\n\nDuring this pause, exceptions for funding were made for dangerous gain-of-function lab work. This included work jointly done by U.S. scientists from the University of North Carolina, Harvard and the Wuhan Institute of Virology. This work — which had funding from USAID and EcoHealth Alliance not originally acknowledged — was published in 2015 in Nature Medicine.\n\nA different Nature Medicine article about the origin of the current pandemic, authored by five scientists and published on March 17, has been touted by major media outlet and some officials — including current National Institutes of Health director Francis Collins — as definitively disproving a lab origin for the novel coronavirus. That journal article, titled “The proximal origin of SARS-CoV-2,” stated unequivocally: “Our analyses clearly show that SARS-CoV-2 is not a laboratory construct or a purposefully manipulated virus.” This is a subtly misleading sentence. While the scientists state that there is no known laboratory “signature” in the SARS-Cov-2 RNA, their argument fails to take account of other lab methods that could have created coronavirus mutations without leaving such a signature.\n\nIndeed, there is also the question of conflict of interest in the Nature Medicine article. Some of the authors of that article, as well as a February 2020 Lancet letter condemning “conspiracy theories suggesting that COVID-19 does not have a natural origin” — which seemed calculated to minimize outside scrutiny of biodefense lab work — have troubling ties to the biodefense complex, as well as to the U.S. government. Notably, neither of these articles makes clear that a virus can have a natural origin and then be captured and studied in a controlled laboratory setting before being let loose, either intentionally or accidentally — which is clearly a possibility in the case of the coronavirus.\n\nThis reporter raised questions about the subject at a news conference with a Center for Disease Control (CDC) representative at the now-shuttered National Press Club on Feb. 11. I asked if it was a “complete coincidence” that the pandemic had started in Wuhan, the only place in China with a declared biosafety level 4 (BSL4) laboratory. BSL4 laboratories have the most stringent safety mechanisms, but handle the most deadly pathogens. As I mentioned, it was odd that the ostensible origin of the novel coronavirus was bat caves in Yunnan province — more than 1,000 miles from Wuhan. I noted that “gain-of-function” lab work can results in more deadly pathogens, and that major labs, including some in the U.S., have had accidental releases.\n\nCDC Principal Deputy Director Anne Schuchat said that based on the information she had seen, the virus was of “zoonotic origin.” She also stated, regarding gain-of-function lab work, that it is important to “protect researchers and their laboratory workers as well as the community around them and that we use science for the benefit of people.”\n\nI followed up by asking whether an alleged natural origin did not preclude the possibility that this virus came through a lab, since a lab could have acquired a bat virus and been working on it. Schuchat replied to the assembled journalists that “it is very common for rumors to emerge that can take on life of their own,” but did not directly answer the question. She noted that in the 2014 Ebola outbreak some observers had pointed to nearby labs as the possible cause, claiming this “was a key rumor that had to be overcome in order to help control the outbreak.” She reiterated: “So based on everything that I know right now, I can tell you the circumstances of the origin really look like animals-to-human. But your question, I heard.”\n\nThis is no rumor. It’s a fact: Labs work with dangerous pathogens. The U.S. and China each have dual-use biowarfare/biodefense programs. China has major facilities at Wuhan — a biosafety level 4 lab and a biosafety level 2 lab. There are leaks from labs. (See “Preventing a Biological Arms Race,” MIT Press, 1990, edited by Susan Wright; also, a partial review in Journal of International Law from October 1992.)\n\nMuch of the discussion of this deadly serious subject is marred with snark that avoids or dodges the “gain-of-function” question. ABC ran a story on March 27 titled “Sorry, Conspiracy Theorists. Study Concludes COVID-19 ‘Is Not a Laboratory Construct.'” That story did not address the possibility that the virus could have been found in the wild, studied in a lab and then released.\n\nOn March 21, USA Today published a piece headlined “Fact Check: Did the Coronavirus Originate In a Chinese Laboratory?” — and rated it “FALSE.”\n\nThat USA Today story relied on the Washington Post, which, in a widely cited Feb. 17 piece “Tom Cotton keeps repeating a coronavirus conspiracy theory that was already debunked.” That article quoted public comments from Rutgers University professor of chemical biology Richard Ebright, but out of context and only in part. Specifically, the story quoted from Ebright’s tweet that the coronavirus was not an “engineered bioweapon.” In fact, his full quote included the clarification that the virus could have “entered human population through lab accident.” (An email requesting clarification sent to Post reporter Paulina Firozi was met with silence.)\n\nOther pieces in the Post since then (some heavily sourced to U.S. government officials) have conveyed Ebright’s thinking, but it gets worse. In a private exchange, Ebright — who, again, has said clearly that the novel coronavirus was not technically bioengineered using known coronavirus sequences — stated that other forms of lab manipulation could have been responsible for the current pandemic. This runs counter to much reporting, which is perhaps too scientifically illiterate to perceive the difference.\n\nIn response to the suggestion that the novel coronavirus could have come about through various methods besides bioengineering — made by Dr. Meryl Nass, who has done groundbreaking work on biowarfare — Ebright responded in an email:\n\nThat last paragraph is very important. It refers to virologist Ron Fouchier of the Erasmus Medical Center in Rotterdam, who performed research on intentionally increasing rates of viral mutation rate by spreading a virus from one animal to another in a sequence. The New York Times wrote about this in an editorial in January 2012, warning of “An Engineered Doomsday.”\n\n“Now scientists financed by the National Institutes of Health” have created a “virus that could kill tens or hundreds of millions of people” if it escaped confinement, the Times wrote. The story continued:\n\nThe word “engineering” in the New York Times headline is technically incorrect, since passing a virus through animals is not “genetic engineering.” This same distinction has hindered some from understanding the possible origins of the current pandemic.\n\nFouchier’s flu work, in which an H5N1 virus was made more virulent by transmitting it repeatedly between individual ferrets, briefly sent shockwaves through the media. “Locked up in the bowels of the medical faculty building here and accessible to only a handful of scientists lies a man-made flu virus that could change world history if it were ever set free,” wrote Science magazine in 2011 in a story titled “Scientists Brace for Media Storm Around Controversial Flu Studies.” It continues:\n\nDespite objections, Fouchier’s article was published by Science in June 2012. Titled “Airborne Transmission of Influenza A/H5N1 Virus Between Ferrets,” it summarized how Fouchier’s research team made the pathogen more virulent:\n\nIn other words, Fouchier’s research took a flu virus that did not exhibit airborne transmission, then infected a number of ferrets until it mutated to the point that it was transmissible by air.\n\nIn that same year, 2012, a similar study by Yoshihiro Kawaoka of the University of Wisconsin was published in Nature:\n\nIn 2014, Marc Lipsitch of Harvard and Alison P. Galvani of Yale wrote regarding Fouchier and Kawaoka’s work:\n\nThere may be a widespread notion that there is scientific consensus that the pandemic did not come out of a lab. But in fact many of the most knowledgeable scientists in the field are notably silent. This includes Lipsitch at Harvard, Jonathan A. King at MIT and many others.\n\nJust last year, Lynn Klotz of the Center for Arms Control and Non-Proliferation wrote a paper in the Bulletin of the Atomic Scientists entitled “Human Error in High-biocontainment Labs: A Likely Pandemic Threat.” Wrote Klotz:\n\nBoyle, a professor of international law at the University of Illinois, has condemned Fouchier, Kawaoka and others — including at least one of the authors of the recent Nature Medicine article in the strongest terms, calling such work a “criminal enterprise.” While Boyle has been embroiled in numerous controversies, he’s been especially dismissed by many on this issue. The “fact-checking” website Snopes has described him as “a lawyer with no formal training in virology” — without noting that he wrote the relevant U.S. law.\n\nAs Boyle said in 2015:\n\nThe law Boyle drafted states: “Whoever knowingly develops, produces, stockpiles, transfers, acquires, retains, or possesses any biological agent, toxin, or delivery system for use as a weapon, or knowingly assists a foreign state or any organization to do so, shall be fined under this title or imprisoned for life or any term of years, or both. There is extraterritorial Federal jurisdiction over an offense under this section committed by or against a national of the United States.”\n\nBoyle now states that he has been “blackballed” in the media on this issue, despite his having written the relevant statute. The group he worked with on the law, the Council for Responsible Genetics, went under several years ago, making Boyle’s views against “biodefense” even more marginal as government money for dual use work poured into the field and critics within the scientific community have fallen silent. In turn, his denunciations have grown more sweeping.\n\nIn the 1990 book “Preventing a Biological Arms Race,” scholar Susan Wright argued that current laws regarding bioweapons were insufficient, as there were “projects in which offensive and defensive aspects can be distinguished only by claimed motive.” Boyle notes, correctly, that current law he drafted does not make an exception for “defensive” work, but only for “prophylactic, protective or other peaceful purposes.”\n\nWhile Boyle is particularly vociferous in his condemnations, he is not alone. There has been irregular, but occasional media attention to this threat. The Guardian ran a piece in 2014, “Scientists condemn ‘crazy, dangerous’ creation of deadly airborne flu virus,” after Kawaoka created a life-threatening virus that “closely resembles the 1918 Spanish flu strain that killed an estimated 50m people”:\n\nBoyle’s charges beginning early this year that the coronavirus was bioengineered — allegations recently mirrored by French virologist and Nobel laureate Luc Montagnier — have not been corroborated by any publicly produced findings of any U.S. scientist. Boyle even charges that scientists like Ebright, who is at Rutgers, are compromised because the university got a biosafety level 3 lab in 2017 — though Ebright is perhaps the most vocal eminent critic of this research, among U.S. scientists. These and other controversies aside, Boyle’s concerns about the dangers of biowarfare are legitimate; indeed, Ebright shares them.\n\nSome of the most vocal voices to discuss the origins of the novel coronavirus have been eager to minimize the dangers of lab work, or have focused almost exclusively on “wet markets” or “exotic” animals as the likely cause.\n\nThe media celebrated Laurie Garrett, the Pulitzer Prize–winning author and former senior fellow at the Council on Foreign Relations, when she declared on Twitter on March 3 (in a since-deleted tweet) that the origin of the pandemic was discovered: “It’s pangolins. #COVID19 Researchers studied lung tissue from 12 of the scaled mammals that were illegally trafficked in Asia and found #SARSCoV2 in 3. The animals were found in Guangxi, China. Another virus+ smuggled sample found in Guangzhou.”\n\nShe was swiftly corrected by Ebright: “Arrant nonsense. Did you even read the paper? Reported pangolin coronavirus is not SARS-CoV-2 and is not even particularly close to SARS-CoV-2. Bat coronavirus RaTG13 is much closer to SARS-CoV-2 (96.2% identical) than reported pangolin coronavirus (92.4% identical).” He added: “No reason to invoke pangolin as intermediate. When A is much closer than B to C, in the absence of additional data, there is no rational basis to favor pathway A>B>C over pathway A>C.” When someone asked what Garrett was saying, Ebright responded: “She is saying she is scientifically illiterate.”\n\nThe following day, Garrett corrected herself (without acknowledging Ebright): “I blew it on the #Pangolins paper, & then took a few hours break from Twitter. It did NOT prove the species = source of #SARSCoV2. There’s a torrent of critique now, deservedly denouncing me & my posting. A lot of the critique is super-informative so leaving it all up 4 while.”\n\nAt least one Chinese government official has responded to the allegation that the labs in Wuhan could be the source for the pandemic by alleging that perhaps the U.S. is responsible instead. In American mainstream media, that has been reflexively treated as even more ridiculous than the original allegation that the virus could have come from a lab.\n\nObviously the Chinese government’s allegations should not be taken at face value, but neither should U.S. government claims — especially considering that U.S. government labs were the apparent source for the anthrax attacks in 2001. Those attacks sent panic through the U.S. and shut down Congress, allowing the Bush administration to enact the PATRIOT Act and ramp up the invasions of Afghanistan and Iraq. Indeed, in October 2001, media darlings like Richard Butler and Andrew Sullivan propagandized for war with Iraq because of the anthrax attacks.\n\nThe 2001 anthrax attacks also provided much of the pretext for the surge in biolab spending since then, even though they apparently originated in a U.S. or U.S.-allied lab. Indeed, those attacks remain shrouded in mystery.\n\nThe U.S. government has also come up with elaborate cover stories to distract from its bioweapons work. For instance, the U.S. government infamously claimed the 1953 death of Frank Olson, a scientist at Fort Detrick, Maryland, was an LSD experiment gone wrong; it now appears to have been an execution to cover up for U.S. biological warfare.\n\nRegardless of the cause of the current pandemic, these biowarfare/biodefense labs need far more scrutiny. The call to shut them down by Boyle and others needs to be clearly heard — and light must be shone on precisely what research is being conducted.\n\nThe secrecy of these labs may prevent us ever knowing with certainty the origins of the current pandemic. It could have been a lab release, presumably accidental, or it could have been a “zoonotic,” or animal-to-human, infection.\n\nWhat we do know is this lab work comes with real dangers. One might make a comparison to climate change: We cannot attribute an individual hurricane to man-made climate disruption, yet science tells us that human activity makes stronger hurricanes more likely. That brings us back to the imperative to cease the kinds of activities that produce such dangers in the first place.\n\nIf that doesn’t happen, the people of the planet will be at the mercy of the machinations and mistakes of state actors who are playing with fire for their geopolitical interests.\n\nSam Husseini is an independent journalist. His website is here. He’s on Twitter: @samhusseini.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Did this Virus Come from a Lab? Maybe Not — But it Exposes the Threat of a Biowarfare Arms Race - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "What we do know is this lab work comes with real dangers. One might make a comparison to climate change: We cannot attribute an individual hurricane to man-made climate disruption, yet science tells us that human activity makes stronger hurricanes more likely", "url": "https://www.independentsciencenews.org/commentaries/did-this-virus-come-from-a-lab-maybe-not-but-it-exposes-the-threat-of-a-biowarfare-arms-race/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-04-24T23:43:35+00:00", "article:modified_time": "2020-06-11T00:06:34+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/04/Wuhan-Institute-of-Virology-China.jpg", "image:width": "800", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.salon.com/2020/04/24/did-this-virus-come-from-a-lab-maybe-not--but-it-exposes-the-threat-of-a-biowarfare-arms-race/", "https://www.salon.com/2020/03/13/sen-tom-cotton-threatens-china-claims-beijing-inflicted-coronavirus-on-world_partner/", "https://www.usatoday.com/story/news/2016/06/23/undisclosed-cdc-lab-incidents/86305700/", "https://www.reuters.com/article/us-arms-biological/u-s-rejects-biological-weapons-checks-idUSTRE5B82DG20091209?type=politicsNews", "https://bookshop.org/a/2464/9780932863461", "https://www.nytimes.com/2005/03/01/politics/us-germresearch-policy-is-protested-by-758-scientists.html", "https://www.nytimes.com/2017/12/19/health/lethal-viruses-nih.html", "https://fas.org/programs/bio/research.html", "https://www.nytimes.com/2014/10/18/us/white-house-to-cut-funding-for-risky-biological-study.html", "https://www.nytimes.com/2017/12/19/health/lethal-viruses-nih.html", "https://www.nature.com/articles/nm.3985", "https://www.nature.com/articles/s41591-020-0820-9", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30418-9/fulltext", "https://husseini.posthaven.com/questioning-the-cdc-is-it-a-complete-coincidence-that-chinas-only-bsl4-is-in-wuhan", "https://www.usatoday.com/story/news/nation/2014/08/17/reports-of-incidents-at-bioterror-select-agent-labs/14140483/", "https://mitpress.mit.edu/books/preventing-biological-arms-race", "https://www.cambridge.org/core/journals/american-journal-of-international-law/article/preventing-a-biological-arms-race-edited-by-susan-wright-cambridge-london-the-mit-press-1990-pp-xviii-446-appendices-index-cloth-25-paper-1750/3DDE23565C945EA31256B1E87B94AC3B", "https://abcnews.go.com/US/conspiracy-theorists-study-concludes-covid-19-laboratory-construct/story?id=69827832", "https://www.usatoday.com/story/news/factcheck/2020/03/21/fact-check-did-coronavirus-originate-chinese-laboratory/2881150001/", "https://www.washingtonpost.com/politics/2020/02/16/tom-cotton-coronavirus-conspiracy", "https://twitter.com/R_H_Ebright/status/1229255646350127104", "https://www.washingtonpost.com/opinions/global-opinions/how-did-covid-19-begin-its-initial-origin-story-is-shaky/2020/04/02/1475d488-7521-11ea-87da-77a8136c1a6d_story.html", "https://www.washingtonpost.com/opinions/2020/04/14/state-department-cables-warned-safety-issues-wuhan-lab-studying-bat-coronaviruses/", "http://anthraxvaccine.blogspot.com/2020/03/there-are-many-ways-novel-coronavirus.html", "http://anthraxvaccine.blogspot.com/2020/04/why-are-some-of-us-top-scientists.html", "https://www.ippnw.org/pdf/mgs/psr-2-4-nass.pdf", "https://thelede.blogs.nytimes.com/2008/08/07/reactions-to-the-case-against-anthrax-suspect/", "https://www.nytimes.com/2012/01/08/opinion/sunday/an-engineered-doomsday.html", "https://www.sciencemag.org/news/2011/11/scientists-brace-media-storm-around-controversial-flu-studies", "https://science.sciencemag.org/content/336/6088/1534.abstract", "https://www.nature.com/articles/nature10831", "https://www.cidrap.umn.edu/news-perspective/2014/06/commentary-case-against-gain-function-experiments-reply-fouchier-kawaoka", "http://en.wikipedia.org/wiki/Nuremberg_Code", "https://thebulletin.org/2019/02/human-error-in-high-biocontainment-labs-a-likely-pandemic-threat/", "https://law.illinois.edu/faculty-research/faculty-profiles/francis-boyle/", "https://www.snopes.com/news/2020/04/01/covid-19-bioweapon/", "https://www.scoop.co.nz/stories/HL2002/S00184/us-biowarfare-programs-have-13000-death-scientists-hard-at-work.htm", "http://disarmament.un.org/treaties/t/bwc/text", "https://www.congress.gov/bill/101st-congress/senate-bill/993/text", "https://www.amazon.com/Chemical-Biological-Warfare-Americas-Arsenal/dp/0261631500/?tag=saloncom09-20", "https://mitpress.mit.edu/books/preventing-biological-arms-race", "https://www.theguardian.com/science/2014/jun/11/crazy-dangerous-creation-deadly-airborne-flu-virushttps:/", "https://www.uticaphoenix.net/2020/03/24/is-the-recent-corona-virus-covid-19-a-biological-weapon/", "https://www.theweek.in/news/world/2020/04/19/coronavirus-man-made-in-wuhan-lab-says-nobel-laureate.html", "https://phri.njms.rutgers.edu/programs-and-resources/rutgers-biocontainment-laboratory/", "https://twitter.com/R_H_Ebright/status/1246245488892039170", "https://twitter.com/R_H_Ebright/status/1246246600487337985", "https://twitter.com/samhusseini/status/1246478490611957760", "https://twitter.com/zlj517/status/1238111898828066823", "https://www.nytimes.com/2020/03/13/world/asia/coronavirus-china-conspiracy-theory.html", "https://www.wired.com/2011/03/ff_anthrax_fbi/", "https://www.salon.com/2016/09/11/the-patriot-acts-ugly-legacy-the-u-s-normalized-xenophobia-after-911-and-planted-the-seeds-for-trumps-rise/", "https://www.nytimes.com/2001/10/18/opinion/who-made-the-anthrax.html", "http://dish.andrewsullivan.com/2001/10/17/the-coming-conflict/", "https://www.nytimes.com/2008/09/18/washington/18anthrax.html", "https://www.youtube.com/watch?v=PquqlX8wnT0", "https://www.theguardian.com/us-news/2019/sep/06/from-mind-control-to-murder-how-a-deadly-fall-revealed-the-cias-darkest-secrets", "https://husseini.posthaven.com/", "https://twitter.com/samhusseini", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-04-24T23:43:35+00:00"}