{"result_id": "166012", "URL": "https://www.independentsciencenews.org/environment/how-the-great-food-war-will-be-won/", "timestamp": "2023-04-25 15:36:34 CEST+0200", "meta": {"description": "By conventional wisdom it is excellent news. Researchers have shown that organic farming methods can yield almost as highly as pesticide-intensive methods", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/environment/how-the-great-food-war-will-be-won/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "How the Great Food War Will Be Won", "cleaned_text": "By conventional wisdom it is excellent news. Researchers from Iowa have shown that organic farming methods can yield almost as highly as pesticide-intensive methods. Other researchers, from Berkeley, California, have reached a similar conclusion. Indeed, both findings met with a very enthusiastic reception. The enthusiasm is appropriate, but only if one misses a deep and fundamental point: that even to participate in such a conversation is to fall into a carefully laid trap.\n\nThe strategic centrepiece of Monsanto’s PR, and also that of just about every major commercial participant in the industrialised food system, is to focus on the promotion of one single overarching idea. The big idea that industrial producers in the food system want you to believe is that only they can produce enough for the future population (Peekhaus 2010). Thus non-industrial systems of farming, such as all those which use agroecological methods, or SRI, or are localised and family-oriented, or which use organic methods, or non-GMO seeds, cannot feed the world.\n\nTo be sure, agribusiness has other PR strategies. Agribusiness is “pro-science”, its opponents are “anti-science”, and so on. But the main plank has for decades been to create a cast-iron moral framing around the need to produce more food (Stone and Glover 2011).\n\nTherefore, if you go to the websites of Monsanto and Cargill and Syngenta and Bayer, and their bedfellows: the US Farm Bureau, the UK National Farmers Union, and the American Soybean Association, and CropLife International, or The Bill and Melinda Gates Foundation, The Rockefeller Foundation, USAID, or the international research system (CGIAR), and now even NASA, they very early (if not instantaneously) raise the “urgent problem” of who will feed the expected global population of 9 or 10 billion in 2050.\n\nLikewise, whenever these same organisations compose speeches or press releases, or videos, or make any pronouncement designed for policymakers or the populace, they devote precious space to the same urgent problem. It is even in their job advertisements. It is their Golden Fact and their universal calling card. And as far as neutrals are concerned it wins the food system debate hands down, because it says, if any other farming system cannot feed the world, it is irrelevant. Only agribusiness can do that.\n\nThe real food crisis is of overproduction\n\nYet this strategy has a disastrous foundational weakness. There is no global or regional shortage of food. There never has been and nor is there ever likely to be. India has a superabundance of food. South America is swamped in food. The US, Australia, New Zealand and Europe are swamped in food (e.g. Billen et al 2011). In Britain, like in many wealthy countries, nearly half of all row crop food production now goes to biofuels, which at bottom are an attempt to dispose of surplus agricultural products. China isn’t quite swamped but it still exports food (see Fig 1.); and it grows 30% of the world’s cotton. No foodpocalypse there either.\n\nOf all the populous nations, Bangladesh comes closest to not being swamped in food. Its situation is complex. Its government says it is self-sufficient. The UN world Food Program says it is not, but the truth appears to be that Bangladeshi farmers do not produce the rice they could because prices are too low, because of persistent gluts (1).\n\nEven some establishment institutions will occasionally admit that the food shortage concept – now and in any reasonably conceivable future – is bankrupt. According to experts consulted by the World Bank Institute there is already sufficient food production for 14 billion people – more food than will ever be needed. The Golden Fact of agribusiness is a lie.\n\nSo, if the agribusiness PR experts are correct that food crisis fears are pivotal to their industry, then it follows that those who oppose the industrialization of food and agriculture should make dismantling that lie their top priority.\n\nAnyone who wants a sustainable, pesticide-free, or non-GMO food future, or who wants to swim in a healthy river or lake again, or wants to avoid climate chaos, needs to know all this. Anyone who would like to rebuild the rural economy or who appreciates cultural, biological, or agricultural diversity of any meaningful kind should take every possible opportunity to point out the evidence that refutes it. Granaries are bulging, crops are being burned as biofuels or dumped, prices are low, farmers are abandoning farming for slums and cities, all because of massive oversupply. Anyone could also point out that probably the least important criterion for growing food, is how much it yields. Even just to acknowledge crop yield, as an issue for anyone other than the individual farmer, is to reinforce the framing of the industry they oppose.\n\nThe project to fully industrialise global food production is far from complete, yet already it is responsible for most deforestation, most marine pollution, most coral reef destruction, much of greenhouse gas emissions, most habitat loss, most of the degradation of streams and rivers, most food insecurity, most immigration, most water depletion, massive human health problems, and so on (Foley et al 2005; Foley et al 2011). Therefore, it is not an exaggeration to say that if the industrialisation of food is not reversed our planet will be made unlivable for multi-cellular organisms. Our planet is becoming literally uninhabitable solely as a result of the social and ecological consequences of industrialising agriculture. All these problems are without even mentioning the trillions of dollars in annual externalised costs and subsidies (Pretty et al. 2000).\n\nSo, if one were to devise a strategy for the food movement, it would be this. The public already knows (mostly) that pesticides are dangerous. They also know that organic food is higher quality, and is far more environmentally friendly. It knows that GMOs should be labeled, are largely untested, and may be harmful. That is why the leaders of most major countries, including China, dine on organic food. The immense scale of the problems created by industrial agriculture should, of course, be understood better, but the main facts are hardly in dispute.\n\nBut what industry understands, and the food movement does not, is that what prevents total rejection of bland, industrialised, pesticide-laden, GMO food is the standard acceptance, especially in Western countries, of the overarching agribusiness argument that such food is necessary. It is necessary to feed the world.\n\nBut, if the food movement could show that famine is an empty threat then it would also have shown, by clear implication, that the chemical health risks and the ecological devastation that these technologies represent are what is unnecessary. The movement would have shown that pesticides and GMOs exist solely to extract profit from the food chain. They have no other purpose. Therefore, every project of the food movement should aim to spread the truth of oversupply, until mention of the Golden Fact invites ridicule and embarrassment rather than fear.\n\nFood campaigners might also consider that a strategy to combat the food scarcity myth can unite a potent mix of causes. Just as an understanding of food abundance destroys the argument for pesticide use and GMOs simultaneously, it also creates the potential for common ground within and between constituencies that do not currently associate much: health advocates, food system workers, climate campaigners, wildlife conservationists and international development campaigners. None of these constituencies inherently like chemical poisons, and they are hardly natural allies of agribusiness, but the pressure of the food crisis lie has driven many of them to ignore what could be the best solution to their mutual problems: small scale farming and pesticide-free agriculture. This is exactly what the companies intended.\n\nSo divisive has the Golden Fact been that some non-profits have entered into perverse partnerships with agribusiness and others support inadequate or positively fraudulent sustainability labels. Another consequence has been mass confusion over the observation that almost all the threats to the food supply (salinisation, water depletion, soil erosion, climate change and chemical pollution) come from the supposed solution–the industrialisation of food production. These contradictions are not real. When the smoke is blown away and the mirrors are taken down the choices within the food system become crystal clear. They fall broadly into two camps.\n\nOn the one side lie family farms and ecological methods. These support farmer and consumer health, resilience, financial and democratic independence, community, cultural and biological diversity, and long term sustainability. Opposing them is control of the food system by corporate agribusiness. Agribusiness domination leads invariantly to dependence, uniformity, poisoning and ecological degradation, inequality, land grabbing, and, not so far off, to climate chaos.\n\nOne is a vision, the other is a nightmare: in every single case where industrial agriculture is implemented it leaves landscapes progressively emptier of life. Eventually, the soil turns either into mud that washes into the rivers or into dust that blows away on the wind. Industrial agriculture has no long term future; it is ecological suicide. But for obvious reasons those who profit from it cannot allow all this to become broadly understood. That is why the food scarcity lie is so fundamental to them. They absolutely depend on it, since it alone can camouflage the simplicity of the underlying issues.\n\nDespite all this, the food and environmental movements have never seriously contested the reality of a food crisis. Perhaps that is because it is a narrative with a long history. As early as the 1940s the chemical and oil industries sent the Rockefeller Foundation to Mexico to “fix” agriculture there. Despite evidence to the contrary, the Rockefeller scientists derived a now-familiar narrative: Mexican agriculture was obviously gripped by a production deficit that could be fixed by “modern” agribusiness products (The Hungry World, 2010). This story later became the uncontested “truth” that legitimised the green revolution and still propels the proliferation of pesticides, fertilizers, GMOs and other agribusiness methods into every part of the globe.\n\nYet in the age of the internet it is no longer necessary to let an industry decide where the truth resides. It is possible to restore reality to the global discussion about food so that all potential production methods can have their merits fairly evaluated (IAASTD, 2007). Until this is done agribusiness and chemical industry solutions will always be the default winner, alternative agriculture will always be alternative, if it exists at all.\n\nThe evidence with which to contradict the lie is everywhere; but in an unequal and unjust system truth never speaks for itself. It is a specific task that requires a refusal to be intimidated by the torrents of official misinformation and a willingness to unembed oneself from the intellectual web of industry thinking. (That will often mean ordinary people acting alone.)\n\nThe task requires two things; the first is familiarity with the basic facts of the food system. Good starting points (apart from the links in this article) are Good Food for Everyone Forever by Colin Tudge or World Hunger: Twelve Myths by Joseph Collins, Peter Rosset and Frances Moore Lappe.\n\nThe second requirement is a shift in perception. The shift is to move beyond considering only physical goals, such as saving individual species, or specific political achievements, and to move towards considering the significance of the underlying mental state of the citizenry.\n\nCompanies and industries pay huge sums of money for public relations (PR). PR is predicated on the idea that all human behaviour is governed by belief systems. PR is therefore the discovery of the structure of those belief systems, mainly through focus groups, and the subsequent manipulation of those belief structures with respect to particular products or other goals.\n\nThus human reasoning, which asks questions like: Is it fair? What will the neighbours think? can be accessed and diverted to make individuals and groups act often against their own self-interests. Two important general rules are that it works best when people don’t know they are being influenced, and that it comes best from a “friendly” source. PR is therefore always concealed which creates the widespread misunderstanding that it is rare or ineffective.\n\nAnyone who desires social change on a significant scale should seek to understand this, and its corollary, that the food crisis lie is far from the only lie. As philosopher Michel Foucault documented for madness and also criminality, many assertions constituting supposed “reality” are best understood as establishment fabrications. Those described by Foucault mostly have deep historical roots; but others, such as the genetic origin of disease, or the validity of animal experiments, are untruths of recent origin. The function of these fabrications is always social control. As Edward Bernays, the father of modern PR, long ago wrote:\n\n“The conscious and intelligent manipulation of the organized habits and opinions of the masses is an important element in democratic society. Those who manipulate this unseen mechanism of society constitute an invisible government which is the true ruling power of our country.”\n\nThe possibility of manipulating habits and opinions, which he also called “the engineering of consent” was not an idle boast.\n\nFoucault, who was concerned mostly with the power held by governments, considered that the fabrications he had identified were not conspiracies. They were emergent properties of power. Power and knowledge grow together in an intertwined and mutually supportive fashion. He argued that knowledge creates power but is also deferential to power and so is deformed by it. An example is when US newspapers decline to use the word “torture” for when torture is used by the US government. These newspapers and the US government are together doing what Foucault theorised. The US government gets to torture and gains power in the process while the public is simultaneously deceived and disempowered. In this way the preferred language of the powerful has historically and continuously evolved into the established public truth, to the disadvantage of the people.\n\nBernays, however, worked mainly for corporations. He knew, since some of them were his own ideas, that many of the more recent fabrications were not emergent properties but were intentionally planted.\n\nThe essential point, however, is to appreciate not only that companies and others deliberately engineer social change; but also that when they do so it begins with the reordering of the “reality” perceived by the people. The companies first create a reality (such as Mexican hunger) for which their desired change seems to the people either obvious, or beneficial, or natural. When it comes, the people therefore do not resist the solution, many welcome it.\n\nDictators and revolutionaries provide an interesting lesson in this. The successful ones have achieved sometimes extraordinary power. As always, they have done so first by changing the opinions of the people. The dictator, like any corporation, must make the people want them. As a general rule, dictators do this by creating new and more compelling false realities on top of older ones.\n\nHitler, to take a familiar example, harnessed a newly synthesised idea (German nationalism) to a baseless scientific theory (of racial genetics) and welded this to pre-existing “realities” of elitism and impugned manhood (the loss of WWI). These ideas were instrumental in his rise to power. But the important lesson for social change is that none of the ideas used by him possessed (now or then) any objective or empirical reality. They were all fabrications. It is true Hitler also had secret money, bodyguards, and so on, but so did others. Only Hitler found the appropriate combination of concepts able to colonise the minds of enough German people.\n\nBut Hitler is not known now for being just another leader of Germany. He is infamous for two events, the holocaust and World War II. The same lessons apply. Millions fought and died for almost a decade in a struggle to assert ideas that could have been destroyed by the intellectual equivalent of a feather. But that is how powerful ideas are.\n\nThe lies told in more democratic societies are not so very different to those used by Hitler in the sense that the important ones have predictable properties that can be categorised and sorted. What the food scarcity lie has in common with Hitler’s use of race, and with myths of nationalism, or of modern terrorism, and many others, is the creation of a threat, in this case of famine and possible social breakdown. The creation of an internal or external threat is thus the first category of lies.\n\nThe second category recognises the necessity of “efficient government”. No government can issue direct and separate orders to all the people all the time. Nor can it possess the resources for physical enforcement of those orders. It must therefore find ways to cause the people to govern, order, and regiment themselves, in exquisite detail. Therefore, governments supply and support guiding principles in the form of artificial unifying aspirations, such as “progress” or “civilisation”. Typically, they also strongly encourage the desirability of being “normal”; and especially they reinforce elitism (follow the leader), and so on.\n\nAnother structural category follows from the recognition that the effective operation of power over others, unless it is based on pure physical force or intimidation, usually requires an authoritative source of ostensibly unbiased knowledge. The population must be “convinced” by an unimpeachable third party. This function is typically fulfilled by either organised religion or by organised science. Scientific or religious institutions thus legitimate the ideas (progress, hierarchy, normality, inequality, etc.) of the rulers. These sources conceal the use of power because they combine the appearance of authority, independence and disinterestedness. These qualities are all or partly fictions.\n\nAnother category are fabrications intended to foster dependence on the state and the formal economy. These aim to undermine the ancient dependence of individuals on the land and each other, and transfer that dependence to the state. Thus the worship of competition, the exaggeration of gender differences, and genetic determinism (the theory that your health, personality, and success derive only from within) are examples of fabrications that sow enmity and isolation among the population.\n\nAnother important category, which include the myths of papal infallibility, or scientific and journalistic objectivity, exist to reinforce the power of authority itself. These fabrications act to bolster the influence of other myths.\n\nThe above list is not exhaustive, but it serves to introduce the idea that the organising of detailed control over populations of millions, achieved mostly without resorting to any physical force, requires the establishing and perpetual reinforcement of multiple interlocking untruths. This itself has important implications.\n\nThe first and most important implication is that if the lies and fabrications exist to concentrate and exercise power over others (and then conceal its use), then it also follows that genuinely beneficial and humanitarian goals such as harmony, justice, and equity, require retrieval of the truth and the goals will follow naturally from that retrieval.\n\nThe task of anyone who wants harmony, justice, peace, etc to prevail therefore becomes primarily to free the people from believing in lies and thus allowing them to attain mastery over their own minds. At that point they will know their own true needs and desires; they will no longer “want” to be oppressed or exploited.\n\nThe second implication of this entwining of knowledge with power is that, when properly understood, goals of harmony, understanding, health, diversity, justice, sustainability, opportunity, etc., are not contradictory or mutually exclusive. Rather, they are necessarily interconnected.\n\nThe third implication is that an empire built on lies is much more vulnerable than it seems. It can rapidly unravel.\n\nGiven that resources are limited, the problems of achieving broad social justice, of providing for the people, and of restoring environmental harms consequently become that of discerning which of the lies (since there are many) are most in need of exposing; and perhaps in what order.\n\nThus the necessary shift in perception is to see that, as in most wars, the crucial struggle in the food war is the one inside people’s heads. And that the great food war will be won by the side that understands that and uses it best.\n\nThis food war can be won by either side. The natural advantages of the grassroots in this realm are many. They include the power of the internet–which represents a historic opportunity to connect with others; second, that it takes a lot less effort to assert the truth than it does to build a lie-many people only need to hear the truth once; and thirdly, that in this particular battle the non-profit public-interest side doesn’t necessarily need a bigger megaphone because, unlike the industry, they are (broadly) trusted by the public.\n\nConsequently, it is perfectly possible that a lie that took several powerful industries many decades to build up could be dismantled in months. It is necessary only to unleash the power of the truth and to constantly remember the hidden power of the people: that all the effort industries put into misleading them is an accurate acknowledgement of the potential of that power.\n\nThere are many writers and NGOs, such as Pesticides Action Network, IATP, the EWG, the Organic Consumers Association, the Center for Food Safety, and others, who are aligned with the grassroots, and who are doing a good and necessary job of explaining the problems and costs of industrial agriculture. But these arguments have so far proven inadequate. Agribusiness knows why that is.\n\nBut by combining these arguments with a refutation of the food crisis they can help destroy the industrial model of agriculture forever. And when that happens many of our worst global problems, from climate change and rainforest destruction down, will become either manageable or even negligible.\n\nIt is all in the mind.\n\nReferences\n\n Billen et al (2011) Localising the Nitrogen Imprint of the Paris Food Supply: the Potential of Organic Farming and Changes in Human Diet. Biogeosciences Discuss 8: 10979-11002.\n\nCullather, N. (2010) The Hungry World: America’s Cold War Battle against Poverty in Asia (Harvard)\n\nFoley et al (2005) Global Consequences of Land use. Science 309: 570.\n\nPretty J. et al., (2000) An Assessment of the Total External Costs of UK Agriculture Agricultural Systems 65: 113-136.\n\nStone GD and Glover D. (2011) Genetically modified crops and the ‘food crisis’: discourse and material impacts. Development in Practice 21: DOI: 10.1080/09614524.2011.562876\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "How the Great Food War Will Be Won", "description": "By conventional wisdom it is excellent news. Researchers have shown that organic farming methods can yield almost as highly as pesticide-intensive methods", "url": "https://www.independentsciencenews.org/environment/how-the-great-food-war-will-be-won/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2015-01-12T04:03:53+00:00", "article:modified_time": "2019-10-17T02:42:54+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2014/12/Dustbowl.jpg", "image:width": "300", "image:height": "182", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["http://civileats.com/2014/12/10/organic-nearly-as-productive-as-industrial-farming-new-study-says/", "http://phys.org/news/2014-12-crops-industrial-agriculture.html", "http://ijoc.org/index.php/ijoc/article/viewFile/901/468", "https://www.independentsciencenews.org/un-sustainable-farming/how-millions-of-farmers-are-advancing-agriculture-for-themselves/", "https://pages.wustl.edu/files/pages/imce/stone/stone_glover_2011.pdf", "http://www.monsanto.com/pages/default.aspx", "http://www.cargill.com", "http://jobs.syngenta.com/content/about/", "http://www.cropscience.bayer.com/en/Company/Our-Mission.aspx", "http://fblog.fb.org/2014/12/29/support-all-farmers/", "http://www.nfuonline.com/about-us/nfu-whos-who/meurig-raymond/meurig-raymonds-blog/food-for-thought/", "http://soygrowers.com/about-asa/vision-mission/", "https://croplife.org", "http://www.gatesfoundation.org", "http://www.rockefellerfoundation.org", "http://www.usaid.gov/what-we-do", "http://www.cgiar.org", "http://foodtank.com/news/2013/08/food-hero-molly-brown-nasa-research-scientist", "http://jobs.syngenta.com", "http://www.thehindu.com/todays-paper/tp-national/centre-to-offload-65-lakh-tonnes-of-wheat-in-open-market/article4109903.ece", "http://www.nytimes.com/2012/06/08/business/global/a-failed-food-system-in-india-prompts-an-intense-review.html?pagewanted=all&_r=0", "http://www.bioscienceresource.org/2012/10/can-local-organic-agriculture-feed-a-major-city-and-protect-its-water-supply/", "http://www.biogeosciences.net/9/607/2012/bg-9-607-2012.pdf", "http://www.ethanolproducer.com/articles/10022/uk-wheat-to-ethanol-plant-officially-opens-for-business", "http://en.wikipedia.org/wiki/Cotton", "http://documents.wfp.org/stellent/groups/public/documents/ena/wfp078255.pdf", "https://2k4vbx44lajeo2rag2seu29o-wpengine.netdna-ssl.com/wp-content/uploads/2016/06/WBI-Global-Dialogue-on-Food-Security-and-Adaptation-Summary-of-emerging-issues.pdf", "http://fieldquestions.com/2011/06/16/feeding-hungry-indians/", "http://www.theguardian.com/environment/2013/jul/08/biofuels-plant-wheat-vivergo-hull", "http://landscape.forest.wisc.edu/courses/readings/Foley_etal_2005.pdf", "http://www.nature.com/nature/journal/v478/n7369/abs/nature10452.html", "http://www.theguardian.com/environment/2014/dec/14/earth-faces-sixth-great-extinction-with-41-of-amphibians-set-to-go-the-way-of-the-dodo", "http://www.huffingtonpost.com/evaggelos-vallianatos/shooting-nontargets_b_6368320.html", "https://www.independentsciencenews.org/health/seralini-and-science-nk603-rat-study-roundup/", "http://articles.latimes.com/2011/sep/16/world/la-fg-china-elite-farm-20110917", "https://www.independentsciencenews.org/news/how-extreme-levels-of-roundup-in-food-became-the-industry-norm/", "http://wrongkindofgreen.org/2013/07/22/watch-wwf-silence-of-the-pandas-a-journey-into-the-heart-of-the-green-empire/", "https://www.independentsciencenews.org/environment/way-beyond-greenwashing-have-multinationals-captured-big-conservation/", "http://earthopensource.org/2012/07/12/too-few-farms-and-these-too-large/", "http://graphics.latimes.com/product-of-mexico-camps/", "http://grist.org/article/2010-02-23-new-research-synthetic-nitrogen-destroys-soil-carbon-undermines/", "http://www.monbiot.com/2014/06/05/ripping-apart-the-fabric-of-the-nation/", "http://en.wikipedia.org/wiki/Dust_Bowl", "http://www.grida.no/graphicslib/detail/degraded-soils_c4c4", "http://www.hup.harvard.edu/catalog.php?isbn=9780674050785", "http://www.panna.org/resources/iaastd-agriculture-crossroads", "http://www.paripublishing.com/books/good-food-for-everyone-forever/", "http://smallplanet.org/books/world-hunger-twelve-myths", "http://www.iep.utm.edu/foucault/", "https://www.independentsciencenews.org/news/no-scientific-consensus-on-safety-of-genetically-modified-organisms/", "https://www.independentsciencenews.org/health/the-great-dna-data-deficit/", "https://www.independentsciencenews.org/news/the-experiment-is-on-us-animal-toxicology-testing-science/", "https://en.wikipedia.org/wiki/Edward_Bernays", "https://www.youtube.com/watch?v=DotBVZ26asI", "http://www.amazon.com/Wall-Street-Hitler-Antony-Sutton/dp/0945001533/ref=sr_1_1?s=books&ie=UTF8&qid=1420389351&sr=1-1&keywords=anthony+sutton+hitler", "https://www.independentsciencenews.org/science-media/science-and-social-control-political-paralysis-and-the-genetics-agenda/", "http://www.amazon.com/No-Contest-Case-Against-Competition/dp/0395631254/ref=sr_1_1?s=books&ie=UTF8&qid=1420757146&sr=1-1&keywords=no+competition#customerReviews", "http://www.amazon.com/Caliban-Witch-Women-Primitive-Accumulation/dp/1570270597", "https://www.independentsciencenews.org/health/biology-as-ideology-the-doctrine-of-dna/", "http://www.panna.org", "http://www.iatp.org", "http://www.ewg.org", "https://www.organicconsumers.org", "http://www.centerforfoodsafety.org", "http://www.bioscienceresource.org/2012/10/can-local-organic-agriculture-feed-a-major-city-and-protect-its-water-supply/", "http://www.amazon.com/The-Hungry-World-Americas-against/dp/0674050789", "http://landscape.forest.wisc.edu/courses/readings/Foley_etal_2005.pdf", "http://www.nature.com/nature/journal/v478/n7369/abs/nature10452.html", "http://ijoc.org/index.php/ijoc/article/viewFile/901/468", "http://www.julespretty.com/wp-content/uploads/2013/09/1.-AgSyst-pdf.pdf", "https://pages.wustl.edu/files/pages/imce/stone/stone_glover_2011.pdf", "#"], "authors": ["Jonathan Latham"], "publish_date": "2015-01-12T04:03:53+00:00"}