{"result_id": "166030", "URL": "https://www.independentsciencenews.org/health/neoliberal-ebola-the-agroeconomic-origins-of-the-ebola-outbreak/", "timestamp": "2023-04-25 15:36:43 CEST+0200", "meta": {"description": "The notion of a neoliberal Ebola is so beyond the pale as to send leading lights in ecology and health into apoplectic fits.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/neoliberal-ebola-the-agroeconomic-origins-of-the-ebola-outbreak/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Neoliberal Ebola: Agroeconomic Origins of the Ebola Outbreak", "cleaned_text": "The notion of a neoliberal Ebola is so beyond the pale as to send leading lights in ecology and health into apoplectic fits.\n\nHere’s one of bestseller David Quammen’s five tweets denouncing my hypothesis that neoliberalism drove the emergence of Ebola in West Africa. I’m an “addled guy” whose “loopy [blog] post” and “confused nonsense” Quammen hopes “doesn’t mislead credulous people.”\n\nScientific American’s Steve Mirksy joked that he feared “the supply-side salmonella”. He would walk that back when I pointed out the large literature documenting the ways and means by which the economics of the egg sector is driving salmonella’s evolution.\n\nThe facts of the Ebola outbreak similarly turn Quammen’s objection on its head.\n\nThe virus appears to have been spilling over for years in West Africa. Epidemiologist Joseph Fair’s group found antibodies to multiple species of Ebola, including the very Zaire strain that set off the outbreak, in patients in Sierra Leone as far back as five years ago. Phylogenetic analyses meanwhile show the Zaire strain Bayesian-dated in West Africa as far back as a decade.\n\nAn NIAID team showed the outbreak strain as possessing no molecular anomaly, with nucleotide substitution rates typical of Ebola outbreaks across Africa.\n\nThat result begs an explanation for Ebola’s ecotypic shift from intermittent forest killer to a protopandemic infection infecting 27,000 and killing over 11,000 across the region, leaving bodies in the streets of capital cities Monrovia and Conakry.\n\nThe answer, little explored in the scientific literature or the media, appears in the broader context in which Ebola emerged in West Africa.\n\nThe truth of the whole, in this case connecting disease dynamics, land use and global economics, routinely suffers at the expense of the principle of expediency. Such contextualization often represents a threat to many of the underlying premises of power.\n\nIn the face of such an objection, it was noted that the structural adjustment to which West Africa has been subjected the past decade included the kinds of divestment from public health infrastructure that permitted Ebola to incubate at the population level once it spilled over.\n\nThe effects, however, extend even farther back in the causal chain. The shifts in land use in the Guinea Forest Region from where the Ebola epidemic spread were also connected to neoliberal efforts at opening the forest to global circuits of capital.\n\nDaniel Bausch and Lara Schwarz characterize the Forest Region, where the virus emerged, as a mosaic of small and isolated populations of a variety of ethnic groups that hold little political power and receive little social investment. The forest’s economy and ecology are also strained by thousands of refugees from civil wars in neighboring countries.\n\nThe Region is subjected to the tandem trajectories of accelerating deterioration in public infrastructure and concerted efforts at private development dispossessing smallholdings and traditional foraging grounds for mining, clear-cut logging, and increasingly intensified agriculture.\n\nThe Ebola hot zone as a whole comprises a part of the larger Guinea Savannah Zone the World Bank describes as “one of the largest underused agricultural land reserves in the world.” Africa hosts 60% of the world’s last farmland frontier. And the Bank sees the Savannah best developed by market commercialization, if not solely on the agribusiness model.\n\nAs the Land Matrix Observatory documents, such prospects are in the process of being actualized. There, one can see the 90 deals by which U.S.-backed multinationals have procured hundreds of thousands of hectares for export crops, biofuels and mining around the world, including multiple deals in Sub-Saharan Africa. The Observatory’s online database shows similar land deals pursued by other world powers, including the UK, France, and China.\n\nUnder the newly democratized Guinean government, the Nevada-based and British-backed Farm Land of Guinea Limited secured 99-year leases for two parcels totaling nearly 9000 hectares outside the villages of N’Dema and Konindou in Dabola Prefecture, where a secondary Ebola epicenter developed, and 98,000 hectares outside the village of Saraya in Kouroussa Prefecture. The Ministry of Agriculture has now tasked Farm Land Inc to survey and map an additional 1.5 million hectares for third-party development.\n\nWhile these as of yet undeveloped acquisitions are not directly tied to Ebola, they are markers of a complex, policy-driven phase change in agroecology that our group hypothesizes undergirds Ebola’s emergence.\n\nThe role of palm oil in West Africa\n\nOur thesis orbits around palm oil, in particular.\n\nPalm is a vegetable oil of highly saturated fats derived from the red mesocarp of the African oil palm tree now grown around the world. The fruit’s kernel also produces its own oil. Refined and fractionated into a variety of byproducts, both oils are used in an array of food, cosmetic and cleaning products, as well as in some biodiesels. With the abandonment of trans fats, palm oil represents a growing market, with global exports totaling nearly 44 million metric tons in the 2014 growing season.\n\nOil palm plantations, covering more than 17 million hectares worldwide, are tied to deforestation and expropriation of lands from indigenous groups. We see from this Food and Agriculture Organization map that while most of the production can be found in Asia, particularly in Indonesia, Malaysia and Thailand, most of the suitable land left for palm oil can be found in the Amazon and the Congo Basin, the two largest rainforests in the world.\n\nPalm oil represents a classic case of Lauderdale’s paradox. As environmental resources are destroyed what’s left becomes more valuable. A decaying resource base, then, is no due cause for agribusiness turning into good global citizens, as industry-funded advocates have argued. On the contrary, agribusiness seeks exclusive access to our now fiscally appreciating, if ecologically declining, landscapes.\n\nFood production didn’t start that way in West Africa, of course.\n\nNatural and semi-wild groves of different oil palm types have long served as a source of red palm oil in the Guinea Forest Region. Forest farmers have been raising palm oil in one or another form for hundreds of years. Fallow periods allowing soils to recover, however, were reduced over the 20th century from 20 years in the 1930s to 10 by the 1970s, and still further by the 2000s, with the added effect of increasing grove density. Concomitantly, semi-wild production has been increasingly replaced with intensive hybrids, and red oil replaced by, or mixed with, industrial and kernel oils.\n\nOther crops are grown too, of course. Regional shade agriculture includes coffee, cocoa and kola. Slash-and-burn rice, maize, hibiscus, and corms of the first year, followed by peanut and cassava of the second and a fallow period, are rotated through the agroforest. Lowland flooding supports rice. In essence, we see a move toward increased intensification without private capital but still classifiable as agroforestry.\n\nBut even this kind of farming has since been transformed.\n\nThe Guinean Oil Palm and Rubber Company (with the French acronym SOGUIPAH) began in 1987 as a parastatal cooperative in the Forest but since has grown to the point it is better characterized a state company. It is leading efforts that began in 2006 to develop plantations of intensive hybrid palm for commodity export. SOGUIPAH economized palm production for the market by forcibly expropriating farmland, which to this day continues to set off violent protest.\n\nInternational aid has accelerated industrialization. SOGUIPAH’s new mill, with four times the capacity of one it previously used, was financed by the European Investment Bank.\n\nThe mill’s capacity ended the artisanal extraction that as late as 2010 provided local populations full employment. The subsequent increase in seasonal production has at one and the same time led to harvesting above the mill’s capacity and operation below capacity off-season, leading to a conflict between the company and some of its 2000 now partially proletarianized pickers, some of whom insist on processing a portion of their own yield to cover the resulting gaps in cash flow. Pickers who insist on processing their own oil during the rainy season now risk arrest.\n\nThe new economic geography has also initiated a classic case of land expropriation and enclosure, turning a tradition of shared forest commons toward expectations whereby informal pickers working fallow land outside their family lineage obtain an owner’s permission before picking palm.\n\nWhat does all this have to do with Ebola?\n\nThe figure at top left (of Fig. 1) shows an archipelago of oil palm plots in the Guéckédou area, the outbreak’s apparent ground zero. The characteristic landscape is a mosaic of villages surrounded by dense vegetation and interspersed by crop fields of oil palm (in red) and patches of open forest and regenerated young forest.\n\nThe general pattern can be discerned at a finer scale as well, above, west of the town of Meliandou, where the index cases appeared.\n\nThe landscape embodies a growing interface between humans and frugivore bats, a key Ebola reservoir, including hammer-headed bats, little collared fruit bats and Franquet’s epauletted fruit bats.\n\nNur Juliani Shafie and colleagues document a variety of disturbance-associated fruit bats attracted to oil palm plantations. Bats migrate to oil palm for food and shelter from the heat while the plantations’ wide trails also permit easy movement between roosting and foraging sites.\n\nBats aren’t stupid. As the forest disappears they shift their foraging behavior to what food and shelter are left.\n\nBush meat hunting and butchery are one means by which subsequent spillover may take place. But to move away from the kinds of Western ooga booga epidemiology that wraps outbreaks in such ‘dirty’ cultural cloth, agricultural cultivation may be enough. Fruit bats in Bangladesh transmitted Nipah virus to human hosts by urinating on the date fruit humans cultivated.\n\nAlmudena Marí Saéz and colleagues have since proposed the initial Ebola spillover occurred outside Meliandou when children, including the putative index case, caught and played with Angolan free-tailed bats in a local tree. The bats are an insectivore species also previously documented as an Ebola virus carrier.\n\nWhatever the specific reservoir source, shifts in agroeconomic context still appear a primary cause. Previous studies show the free-tailed bats also attracted to expanding cash crop production in West Africa, including of sugar cane, cotton, and macadamia.\n\nIndeed, every Ebola outbreak appears connected to capital-driven shifts in land use, including back to the first outbreak in Nzara, Sudan in 1976, where a British-financed factory spun and wove local cotton. When Sudan’s civil war ended in 1972, the area rapidly repopulated and much of the local rainforest—and bat ecology—was reclaimed for subsistence farming, with cotton returning as the area’s dominant cash crop.\n\nAre New York, London and Hong Kong as much to blame?\n\nClearly such outbreaks aren’t merely about specific companies.\n\nWe have started working with University of Washington’s Luke Bergmann to test whether the world’s circuits of capital as they relate to husbandry and land use are related to disease emergence. Bergmann and Holmberg’s maps, still in preparation, show the percent of land whose harvests are consumed abroad as agricultural goods or in manufactured goods and services for croplands, pastureland and forests.\n\nThe maps show landscapes are globalized by circuits of capital. In this way, the source of a disease may be more than merely the country in which it may first appear and indeed may extend as far as the other side of the world. We need to identify who funded the development and deforestation to begin with.\n\nSuch an epidemiology begs whether we might more accurately characterize such places as New York, London and Hong Kong, key sources of capital, as disease ‘hot spots’ in their own right. Diseases are relational in their geographies, and not solely absolute, as the ecohealth cowboys chronicled by David Quammen claim.\n\nSimilarly, such a new approach ruins the neat dichotomy between emergency responses and structural interventions.\n\nSome disease hounds who acknowledge global structural issues tend to still focus on the immediate logistics of any given outbreak. Emergency responses are needed, of course. But we need to acknowledge that the emergency arose from the structural. Indeed, such emergencies are used as a means by which to avoid talking about the bigger picture driving the emergence of new diseases.\n\nThe forest may be its own cure\n\nThere’s another false dichotomy to unpack—this one between the forest’s ecosystemic noise and deterministic effect.\n\nThe environmental stochasticity at the center of forest ecology isn’t synonymous with random noise.\n\nHere a bit of math can help. A simple stochastic differential model of exponential pathogen population growth can include fractional white noise of an index 0 to 1 defined by a covariance relationship across time and space. An Ito expansion produces a classic result in population growth:\n\nWhen below a threshold, the noise exponent is small enough to permit a pathogen population to explode in size. When above the threshold, the noise is large enough to control an outbreak, frustrating efforts on the part of the pathogen to string together a bunch of susceptibles to infect.\n\nNever mind the technical details. The important point is that disease trajectories, even in the deepest forest, aren’t divorced from their anthropogenic context. That context can impact upon the forest’s environmental noise and its effects on disease.\n\nHow exactly in Ebola’s case?\n\nIt’s been long known that if you can lower an outbreak below an infection Allee threshold—say by a vaccine or sanitary practices—an outbreak, not finding enough susceptibles, can burn out on its own. But commoditizing the forest may have lowered the region’s ecosystemic threshold to such a point where no emergency intervention can drive the Ebola outbreak low enough to burn out on its own. The virus will continue to circulate, with the potential to explode again.\n\nIn short, neoliberalism’s structural shifts aren’t just a background on which the emergency of Ebola takes place. The shifts are the emergency as much as the virus itself.\n\nIn contrast to Nassim Taleb’s Black Swan—history as shit happens—we have here an example of stochasticity’s impact arising out of deterministic agroeconomic policy—a phenomenon I’ve taken to calling the Red Swan.\n\nHere, sudden switches in land use may explain Ebola’s emergence. Deforestation and intensive agriculture strip out traditional agroforestry’s stochastic friction that until this point had kept the virus from stringing together enough transmission.\n\nUnder certain conditions, the forest may act as its own epidemiological protection. We risk the next deadly pandemic when we destroy that capacity.\n\nRob Wallace is an evolutionary biologist and public health phylogeographer currently visiting the Institute of Global Studies at the University of Minnesota. He also blogs at Farming Pathogens.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Neoliberal Ebola: Agroeconomic Origins of the Ebola Outbreak", "description": "The notion of a neoliberal Ebola is so beyond the pale as to send leading lights in ecology and health into apoplectic fits.", "url": "https://www.independentsciencenews.org/health/neoliberal-ebola-the-agroeconomic-origins-of-the-ebola-outbreak/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2015-07-27T00:05:47+00:00", "article:modified_time": "2019-12-10T21:10:50+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2015/07/Guineau-Forest-Region-in-2014.jpg", "image:width": "320", "image:height": "241", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://farmingpathogens.wordpress.com/2014/04/23/neoliberal-ebola/", "https://twitter.com/DavidQuammen/status/460605941520420864", "https://twitter.com/stevemirsky/status/460607676607893505", "https://scholar.google.com/scholar?hl=en&q=salmonella+industrial+agriculture&btnG=&as_sdt=1%2C33&as_sdtp=", "http://wwwnc.cdc.gov/eid/article/20/7/13-1265_article", "http://www.sciencemag.org/content/345/6202/1369.full", "http://www.niaid.nih.gov/Pages/default.aspx", "http://www.sciencemag.org/content/348/6230/117.abstract", "https://farmingpathogens.wordpress.com/2011/01/18/the-scientific-american/", "http://www.academia.edu/2719737/Circuits_of_capital_and_transnational_corporate_spatial_behaviour_Nestl%C3%A9_in_Southeast_Asia", "http://journals.plos.org/plosntds/article?id=10.1371/journal.pntd.0003056", "https://openknowledge.worldbank.org/handle/10986/2640", "http://www.landmatrix.org/en/", "http://www.landmatrix.org/en/get-the-detail/by-investor-country/united-states-of-america/?order_by=&starts_with=U", "http://www.landmatrix.org/en/get-the-detail/by-target-country/guinea/?order_by=&starts_with=G", "http://www.unep.org/pdf/Dec_11_Palm_Plantations.pdf", "http://monthlyreview.org/2009/11/01/the-paradox-of-wealth-capitalism-and-ecological-destruction/", "https://farmingpathogens.wordpress.com/2012/05/23/whose-food-footprint/", "http://www.cambridge.org/US/academic/subjects/anthropology/social-and-cultural-anthropology/misreading-african-landscape-society-and-ecology-forest-savanna-mosaic", "http://link.springer.com/article/10.1007/s10457-008-9146-1", "http://www.palgrave-journals.com/ejdr/journal/v25/n5/abs/ejdr201315a.html", "http://www.news24.com/Africa/News/Scores-displaced-in-Guinea-land-grab-row-20110803", "http://www.news24.com/Africa/News/Scores-displaced-in-Guinea-land-grab-row-20110803", "http://wrm.org.uy/books-and-briefings/oil_palm_in_africa/", "http://connection.ebscohost.com/c/articles/74462849/diversity-pattern-bats-two-contrasting-habitat-types-along-kerian-river-perak-malaysia", "https://en.wikipedia.org/wiki/Bushmeat", "http://www.washingtonpost.com/blogs/monkey-cage/wp/2014/08/25/othering-ebola-and-the-history-and-politics-of-pointing-at-immigrants-as-potential-disease-vectors/", "http://cid.oxfordjournals.org/content/49/11/1743.short", "http://onlinelibrary.wiley.com/doi/10.15252/emmm.201404792/abstract", "http://onlinelibrary.wiley.com/doi/10.1111/aje.12066/abstract", "http://www.cell.com/trends/microbiology/abstract/S0966-842X%2807%2900150-3?_returnURL=http%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0966842X07001503%3Fshowall%3Dtrue", "http://www.sciencedirect.com/science/article/pii/S0277953614006145", "http://www.sciencedirect.com/science/article/pii/S0277953614006145", "http://www.sciencedirect.com/science/article/pii/S0277953614006145", "https://en.wikipedia.org/wiki/Location_%28geography%29", "http://www.davidquammen.com/spillover", "http://www.washingtonpost.com/opinions/what-we-need-to-fight-ebola/2014/08/01/41f4dbb8-182d-11e4-9349-84d4a85be981_story.html", "http://www.envplan.com/fulltext_temp/0/a4712com.pdf", "http://darwin.eeb.uconn.edu/eeb310/lecture-notes/small-populations/node7.html", "https://en.wikipedia.org/wiki/Exponential_growth", "https://en.wikipedia.org/wiki/White_noise", "https://en.wikipedia.org/wiki/It%C5%8D%27s_lemma", "https://en.wikipedia.org/wiki/Allee_effect", "http://news.yahoo.com/liberia-confirms-ebola-case-outbreak-spreads-120753593.html", "http://www.amazon.com/The-Black-Swan-Improbable-Robustness/dp/081297381X", "https://farmingpathogens.wordpress.com/2013/01/28/the-red-swan/", "https://farmingpathogens.wordpress.com/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2015-07-27T00:05:47+00:00"}