{"result_id": "166036", "URL": "https://www.independentsciencenews.org/news/engineered-covid-19-infected-mouse-bites-researcher-amid-explosion-of-risky-coronavirus-research/", "timestamp": "2023-04-25 15:36:46 CEST+0200", "meta": {"description": "An accident at the University of North Carolina shows why many researchers are concerned by the upsurge in risky coronavirus research.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/news/engineered-covid-19-infected-mouse-bites-researcher-amid-explosion-of-risky-coronavirus-research/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Engineered COVID-19-Infected Mouse Bites Researcher Amid 'Explosion' Of Risky Coronavirus Research", "cleaned_text": "University researchers genetically engineer a human pandemic virus. They inject the new virus into a laboratory mouse. The infected mouse then bites a researcher…..It is a plot worthy of a Hollywood blockbuster about risky coronavirus research.\n\nBut according to newly obtained minutes of the Institutional Biosafety Committee (IBC) of the University of North Carolina (UNC), Chapel Hill, these exact events need not be imagined. They occurred for real between April 1st and May 6th this year.\n\nThe identity of the bitten coronavirus researcher has not been revealed except that they were working in a high security BSL-3 virus lab when the accident happened.\n\nAccording to Richard Ebright, an epidemiologist from Rutgers University, the UNC incident underscores an important development in virus research since the pandemic began:\n\n“There has been an explosion of research involving fully infectious SARS-CoV-2 over the last six months. Research with infectious SARS-CoV-2 now is occurring in every, or almost every, BSL-3 facility in the US and overseas.”\n\nThis strong upsurge is affirmed by Edward Hammond of Prickly Research, Austin, TX, former Director of the Sunshine Project, an NGO that tracked the post 9/11 expansion of the US Biodefense program.\n\n“It is evident that swarms of academic researchers with little prior experience with coronaviruses have leapt into the field in recent months.”\n\n“We need to be clear headed about the risk. The first SARS virus was a notorious source of laboratory-acquired infections and there is a very real risk that modified forms of SARS-CoV-2 could infect researchers, especially inexperienced researchers, with unpredictable and potentially quite dangerous results. The biggest risk is the creation and accidental release of a novel form of SARS-CoV-2 — a variant whose altered characteristics might undermine global efforts to stop the pandemic by evading the approaches being taken to find COVID vaccines and treatments.”\n\nAnd, continues Hammond: “Each additional lab that experiments with CoV-2 amplifies the risk.”\n\nRichard Ebright concurs, telling Independent Science News in an email that this research is:\n\n“in many cases being performed by researchers who have no prior experience in BSL-3 operations and pathogens research, and who therefore pose elevated risk of laboratory accidents with BSL-3 pathogens.”\n\nEbright is also concerned that some influential experimenters are now calling for reduced oversight :\n\n“The UNC incident also underscores that calls by some, notably Columbia University virologist Vincent Racaniello (Podcast at 01:35mins onwards), to allow virus-culture and virus-production research with fully infectious SARS-CoV-2 at BSL-2 are egregiously irresponsible and absolutely unacceptable.”\n\nOther researchers are also calling for restraint. In a paper titled “Prudently conduct the engineering and synthesis of the SARS-CoV-2 virus”, researchers from China and the US critiqued the synthesis in February of a full length infectious clone (Gao et al., 2020; Thao et al., 2020). And, in concluding, these researchers asked a question that is even more pertinent now than then “Once the risks [of a lab escape] become a reality, who or which organization should take responsibility for them?”\n\nThe accident at the University of North Carolina (UNC) is now in the public domain but only thanks to a FOIA request submitted by Hammond (in line with NIH guidelines) and shared with Independent Science News.\n\nDespite the FOIA request, apart from the fact that UNC classified it as an official “Reportable Incident”, i.e. that must be reported to National Institutes of Health (NIH) in Washington DC, scarcely any information about the accident is available.\n\nIn part this is because the minutes of the relevant IBC meeting (May 6th, 2020, p109) are extremely brief. They do not provide any details of the fate of the bitten researcher. Nor do they state, for example, whether the researcher developed an active infection, nor whether they developed symptoms, nor if they transmitted the recombinant virus to anyone else. Neither do they reveal what kind of recombinant virus was being used or the purpose of the experiment.\n\nTo try to learn more, Independent Science News emailed the lab of Ralph Baric at UNC, which, based on their research history is the most likely coronavirus research group involved (Roberts et al., 2007; Menachery et al., 2015), the University Biosafety Officer, and UNC Media relations.\n\nOnly the latter replied:\n\n“The April 2020 incident referred to in the University Institutional Biosafety Committee meeting minutes involved a mouse-adapted SARS-CoV-2 strain used in the development of a mouse model system.”\n\n“The researcher did not develop any symptoms and no infection occurred as a result of the incident.”\n\nOur questions in full and the full UNC reply are available here.\n\nThe second reason for this lack of information is that the UNC redacted the names of Principal Investigators (PIs) whose research required biosafety scrutiny, along with many of the experimental specifics.\n\nNevertheless, unredacted parts of minutes from IBC meetings held in 2020 contain descriptions of experiments that potentially encompass the accident. They include:\n\nIn all, any one of eight sets of different experiments approved by the UNC Chapel Hill IBC in 2020 proposed infecting mice with live infectious and mutant SARS-CoV-2-like coronaviruses under BSL-3 conditions and therefore could have led to the accident.\n\nAccording to Hammond the lack of transparency represented by the sparse minutes and especially the redactions represent a violation of science’s social contract:\n\n“At the dawn of recombinant DNA, at the request of the scientific community itself, following the fabled Asilomar conference, the United States government took the position of not regulating genetic engineering in the lab. The “deal” that big science struck with the government was that, in return for not being directly regulated, principal investigators would take personal responsibility for lab biosafety, involve the public in decision-making, and accept public accountability for their actions.\n\nThe NIH Guidelines and Institutional Biosafety Committee system of “self-regulation” by researchers is founded upon the principal of personal responsibility of PIs and the promise of transparency. The redaction of the researchers’ identities from IBC meeting minutes, in order to hide the activities of researchers and avoid accountability for accidents, fundamentally contradicts the core principles of the US oversight system and violates the commitments that science made.”\n\n“There is no justification for UNC’s redaction of the names of the laboratory heads and the identities of pathogens. UNC’s redactions violate conditions UNC agreed to in exchange for NIH funding of UNC’s research and, if not corrected, should result in the termination of current NIH funding, and the loss of eligibility for future NIH funding, of UNC’s research.”\n\nAre universities doing too many risky experiments on coronaviruses?\n\nThe second concern of researchers contacted by Independent Science News is that unnecessary and dangerous experiments will be conducted as a result of the COVID-19 pandemic. According to Richard Ebright:\n\n“The UNC incident shows that serious laboratory accidents with SARS-CoV-2 can occur even in a lab having extremely extensive experience in BSL-3 operations and unmatched expertise in coronavirus research, and underscores the risks associated with uncontrolled proliferation of research on SARS-CoV-2, especially for labs lacking prior experience in BSL-3 operations and coronavirus research.”\n\nFor this reason Ebright argues that:\n\n“It is essential that a national needs-assessment and biosafety assessment be performed for research involving fully infectious SARS-CoV-2. It also is essential that a risk-benefit review be performed before approving research projects involving fully infectious SARS-CoV-2–something that currently does not occur–to ensure that potential benefits to the public outweigh the real risks to laboratory workers and the public.”\n\nThis concern over risks and benefits is shared by Edward Hammond. Using FOIA again he has further discovered that researchers at the University of Pittsburgh (whose identity is redacted) plan to make what Hammond calls Corona-thrax.\n\nIn short, according to its Institutional Biosafety Committee, Pittsburgh researchers intend put the spike protein of SARS-CoV-2 (which allows the virus to gain entry into human cells) into Bacillus anthracis which is the causative agent of anthrax.\n\nThe anthrax strain proposed to be used for this experiment is “disarmed” but, Hammond agrees with Gao et al., (2020) that the balance of risks and benefits appears not to be receiving adequate consideration.\n\nThis experiment was nevertheless approved by the Institutional Biosafety Committee of the University of Pittsburgh. But by redacting the name of the laboratory from the minutes and also every name of the members of the committee which approved it, the University has supplied a de facto response to the final question posed by Gao et al.: who will take responsibility for risky coronavirus research?\n\nGao, P., Ma, S., Lu, D., Mitcham, C., Jing, Y., & Wang, G. (2020). Prudently conduct the engineering and synthesis of the SARS-CoV-2 virus. Synthetic and systems biotechnology, 5(2), 59-61.\n\n Menachery, V. D., Yount, B. L., Debbink, K., Agnihothram, S., Gralinski, L. E., Plante, J. A., … & Randell, S. H. (2015). A SARS-like cluster of circulating bat coronaviruses shows potential for human emergence. Nature medicine, 21(12), 1508-1513.\n\n Roberts, A., Deming, D., Paddock, C. D., Cheng, A., Yount, B., Vogel, L., … & Zaki, S. R. (2007). A mouse-adapted SARS-coronavirus causes disease and mortality in BALB/c mice. PLoS Pathog, 3(1), e5.\n\n Thao, T. T. N., Labroussaa, F., Ebert, N., V’kovski, P., Stalder, H., Portmann, J., … & Gultom, M. (2020). Rapid reconstruction of SARS-CoV-2 using a synthetic genomics platform. BioRxiv.\n\nEditor’s note. We welcome comments and information about the subject of this article. However, please note that the “reply” function in the comments section is not working for people without high level access to the website. There are two possible solutions for readers wanting to reply to specific comments:\n\n 1) Enter your comment but name the commenter you are responding to (if necessary with the date of their comment). Or,\n\n 2) Mail your comment to the editor: [email protected] and they will post it as a reply. Please be sure to say who/what you are replying to.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Engineered COVID-19-Infected Mouse Bites Researcher Amid 'Explosion' Of Risky Coronavirus Research - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "An accident at the University of North Carolina shows why many researchers are concerned by the upsurge in risky coronavirus research.", "url": "https://www.independentsciencenews.org/news/engineered-covid-19-infected-mouse-bites-researcher-amid-explosion-of-risky-coronavirus-research/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-08-13T13:32:59+00:00", "article:modified_time": "2021-02-20T00:56:43+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/08/Ralph-Baric-UNC-Gillings-School-of-Public-Health-web.jpg", "image:width": "700", "image:height": "680", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.independentsciencenews.org/wp-content/uploads/2020/08/For-Production-to-Requestor-IBC-Meeting-Minutes.pdf", "https://www.waksman.rutgers.edu/ebright", "https://www.technologyreview.com/2020/02/15/844752/biologists-rush-to-re-create-the-china-coronavirus-from-its-dna-code/", "https://www.microbe.tv/twiv/twiv-620/", "https://www.sciencedirect.com/science/article/pii/S2405805X20300193", "https://www.biorxiv.org/content/biorxiv/early/2020/02/21/2020.02.21.959817.full.pdf", "https://www.independentsciencenews.org/health/the-case-is-building-that-covid-19-had-a-lab-origin/", "https://2f7nhsvfj5dyz0312njuuj14-wpengine.netdna-ssl.com/wp-content/uploads/2020/08/For-Production-to-Requestor-IBC-Meeting-Minutes.pdf", "https://sph.unc.edu/adv_profile/ralph-s-baric-phd/", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.0030005", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4797993/", "https://www.independentsciencenews.org/wp-content/uploads/2020/08/Urgent-Media-question-on-COVID19-biosafety-incident-at-UNC-and-FOIA-request-on-behalf-of-Independent-Science-News.pdf", "https://en.wikipedia.org/wiki/Asilomar_Conference_on_Recombinant_DNA", "https://www.independentsciencenews.org/wp-content/uploads/2020/08/UPitt-IBC-Minutes-from-July-2019-to-June-20201_Redacted.pdf", "https://www.independentsciencenews.org/wp-content/uploads/2020/08/UPitt-IBC-Minutes-from-July-2019-to-June-20201_Redacted.pdf", "https://www.sciencedirect.com/science/article/pii/S2405805X20300193", "https://www.biorxiv.org/content/biorxiv/early/2020/02/21/2020.02.21.959817.full.pdf", "/cdn-cgi/l/email-protection", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-08-13T13:32:59+00:00"}