{"result_id": "166028", "URL": "https://www.independentsciencenews.org/biotechnology/bill-gates-global-agenda-and-how-we-can-resist-his-war-on-life/", "timestamp": "2023-04-25 15:36:43 CEST+0200", "meta": {"description": "The pandemic is not a war. The pandemic is a consequence of war. A war against life.", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/biotechnology/bill-gates-global-agenda-and-how-we-can-resist-his-war-on-life/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Bill Gates’ Global Agenda and How We Can Resist His War on Life", "cleaned_text": "In March 2015, Bill Gates showed an image of the coronavirus during a TED Talk and told the audience that it was what the greatest catastrophe of our time would look like. The real threat to life, he said, is ‘not missiles, but microbes.’ When the coronavirus pandemic swept over the earth like a tsunami five years later, he revived the war language, describing the pandemic as ‘a world war’.\n\n‘The coronavirus pandemic pits all of humanity against the virus,’ he said.\n\nIn fact, the pandemic is not a war. The pandemic is a consequence of war. A war against life. The mechanical mind connected to the money machine of extraction has created the illusion of humans as separate from nature, and nature as dead, inert raw material to be exploited. But, in fact, we are part of the biome. And we are part of the virome. The biome and the virome are us. When we wage war on the biodiversity of our forests, our farms, and in our guts, we wage war on ourselves.\n\nThe health emergency of the coronavirus is inseparable from the health emergency of extinction, the health emergency of biodiversity loss, and the health emergency of the climate crisis. All of these emergencies are rooted in a mechanistic, militaristic, anthropocentric worldview that considers humans separate from—and superior to—other beings. Beings we can own, manipulate, and control. All of these emergencies are rooted in an economic model based on the illusion of limitless growth and limitless greed, which violate planetary boundaries, and destroy the integrity of ecosystems and individual species.\n\nNew diseases arise because a globalized, industrialized, inefficient agriculture invades habitats, destroys ecosystems, and manipulates animals, plants, and other organisms with no respect for their integrity or their health. We are linked worldwide through the spread of diseases like the coronavirus because we have invaded the homes of other species, manipulated plants and animals for commercial profits and greed, and cultivated monocultures. As we clear-cut forests, as we turn farms into industrial monocultures that produce toxic, nutritionally empty commodities, as our diets become degraded through industrial processing with synthetic chemicals and genetic engineering, and as we perpetuate the illusion that earth and life are raw materials to be exploited for profits, we are indeed connecting. But instead of connecting on a continuum of health by protecting biodiversity, integrity, and self-organization of all living beings, including humans, we are connected through disease.\n\nAccording to the International Labour Organization, ‘1.6 billion informal economy workers (representing the most vulnerable in the labour market), out of a worldwide total of two billion and a global workforce of 3.3 billion, have suffered massive damage to their capacity to earn a living. This is due to lockdown measures and/or because they work in the hardest-hit sectors.’ According to the World Food Programme, a quarter of a billion additional people will be pushed to hunger and 300,000 could die every day. These, too, are pandemics that are killing people. Killing cannot be a prescription for saving lives.\n\nHealth is about life and living systems. There is no ‘life’ in the paradigm of health that Bill Gates and his ilk are promoting and imposing on the entire world. Gates has created global alliances to impose top-down analysis and prescriptions for health problems. He gives money to define the problems, and then he uses his influence and money to impose the solutions. And in the process, he gets richer. His ‘funding’ results in an erasure of democracy and biodiversity, of nature and culture. His ‘philanthropy’ is not just philanthrocapitalism. It is philanthroimperialism.\n\nThe coronavirus pandemic and lockdown have revealed even more clearly how we are being reduced to objects to be controlled, with our bodies and minds as the new colonies to be invaded. Empires create colonies, colonies enclose the commons of the indigenous living communities and turn them into sources of raw material to be extracted for profits. This linear, extractive logic is unable to see the intimate relations that sustain life in the natural world. It is blind to diversity, cycles of renewal, values of giving and sharing, and the power and potential of self-organising and mutuality. It is blind to the waste it creates and to the violence it unleashes. The extended coronavirus lockdown has been a lab experiment for a future without humanity.\n\nOn March 26, 2020, at a peak of the coronavirus pandemic and in the midst of the lockdown, Microsoft was granted a patent by the World Intellectual Property Organization (WIPO). Patent WO 060606 declares that ‘Human Body Activity associated with a task provided to a user may be used in a mining process of a cryptocurrency system….’\n\nThe ‘body activity’ that Microsoft wants to mine includes radiation emitted from the human body, brain activities, body fluid flow, blood flow, organ activity, body movement such as eye movement, facial movement, and muscle movement, as well as any other activities that can be sensed and represented by images, waves, signals, texts, numbers, degrees, or any other information or data.\n\nThe patent is an intellectual property claim over our bodies and minds. In colonialism, colonisers assign themselves the right to take the land and resources of indigenous people, extinguish their cultures and sovereignty, and in extreme cases exterminate them. Patent WO 060606 is a declaration by Microsoft that our bodies and minds are its new colonies. We are mines of ‘raw material’—the data extracted from our bodies. Rather than sovereign, spiritual, conscious, intelligent beings making decisions and choices with wisdom and ethical values about the impacts of our actions on the natural and social world of which we are a part, and to which we are inextricably related, we are ‘users.’ A ‘user’ is a consumer without choice in the digital empire.\n\nBut that’s not the totality of Gates’ vision. In fact, it is even more sinister—to colonise the minds, bodies, and spirits of our children before they even have the opportunity to understand what freedom and sovereignty look and feel like, beginning with the most vulnerable.\n\nIn May 2020, Governor Andrew Cuomo of New York announced a partnership with the Gates Foundation to ‘reinvent education.’ Cuomo called Gates a visionary and argued that the pandemic has created ‘a moment in history when we can actually incorporate and advance [Gates’] ideas…all these buildings, all these physical classrooms—why with all the technology you have?’\n\nIn fact, Gates has been trying to dismantle the public education system of the United States for two decades. For him students are mines for data. That is why the indicators he promotes are attendance, college enrollment, and scores on a math and reading test, because these can be easily quantified and mined. In reimagining education, children will be monitored through surveillance systems to check if they are attentive while they are forced to take classes remotely, alone at home. The dystopia is one where children never return to schools, do not have a chance to play, do not have friends. It is a world without society, without relationships, without love and friendship.\n\nAs I look to the future in a world of Gates and Tech Barons, I see a humanity that is further polarized into large numbers of ‘throw away’ people who have no place in the new Empire. Those who are included in the new Empire will be little more than digital slaves.\n\nOr, we can resist. We can seed another future, deepen our democracies, reclaim our commons, regenerate the earth as living members of a One Earth Family, rich in our diversity and freedom, one in our unity and interconnectedness. It is a healthier future. It is one we must fight for. It is one we must claim.\n\nWe stand at a precipice of extinction. Will we allow our humanity as living, conscious, intelligent, autonomous beings to be extinguished by a greed machine that does not know limits and is unable to put a break on its colonisation and destruction? Or will we stop the machine and defend our humanity, freedom, and autonomy to protect life on earth?\n\nThe above is excerpted from Vandana Shiva’s book Oneness vs. the 1%: Shattering Illusions, Seeding Freedom (Chelsea Green Publishing, August 2020) and is reprinted with permission from the publisher.\n\nVandana Shiva is a world-renowned environmental thinker and activist, a leader in the International Forum on Globalisation, and of the Slow Food Movement. Director of Navdanya and of the Research Foundation for Science, Technology and Ecology, and a tireless crusader for farmers’, peasants’, and women’s rights, she is the author and editor of a score of influential books, among them Making Peace with the Earth; Soil Not Oil; Globalisation’s New Wars; Seed Sovereignty, Food Security: Women in the Vanguard; and Who Really Feeds the World?. Her latest book is Oneness vs the 1% (Chelsea Green Publishing, August 2020).\n\nEditor’s note. We welcome comments and information about the subject of this article. However, please note that the “reply” function in the comments section is not working for people without high level access to the website. There are two possible solutions for readers wanting to reply to specific comments:\n\n 1) Enter your comment but name the commenter you are responding to (if necessary with the date of their comment). Or,\n\n 2) Mail your comment to the editor: [email protected] and they will post it as a reply. Please be sure to say who/what you are replying to.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates’ Global Agenda and How We Can Resist His War on Life - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "The pandemic is not a war. The pandemic is a consequence of war. A war against life.", "url": "https://www.independentsciencenews.org/biotechnology/bill-gates-global-agenda-and-how-we-can-resist-his-war-on-life/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2020-09-21T02:00:24+00:00", "article:modified_time": "2021-02-20T00:55:06+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2020/09/Vandana-Shiva_credit_Kartikey-Shiva.jpg", "image:width": "1024", "image:height": "682", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.ted.com/talks/bill_gates _the_next_outbreak_we_re_not_ready", "https://www.ilo.org/global/about-the-ilo /newsroom/news/WCMS_743036/lang--en/index.htm", "https://www.washingtonpost.com/opinions/2020/04/22/covid-19-could-detonate-hunger-pandemic-with-millions-risk-world-must-act/", "https://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606", "https://www.governor.ny.gov/news/amid-ongoing-covid-19-pandemic-governor-cuomo-announces-collaboration-gates-foundation-develop", "https://journals.sagepub.com/doi/full/10.1177/1478210316652008", "https://www.chelseagreen.com/product/the-reindeer-chronicles/", "https://www.chelseagreen.com/product/oneness-vs-the-1/", "/cdn-cgi/l/email-protection", "#"], "authors": ["Jonathan Latham"], "publish_date": "2020-09-21T02:00:24+00:00"}