{"result_id": "166021", "URL": "https://www.independentsciencenews.org/commentaries/open-for-military-business-ebola-research-at-canadas-only-bsl-4-lab/", "timestamp": "2023-04-25 15:36:39 CEST+0200", "meta": {"description": "Why were Xiangguo Qiu and her husband Keding Cheng removed by Canadian police from the Canadian National Microbiology Lab (NML) in Winnipeg, Manitoba?", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/commentaries/open-for-military-business-ebola-research-at-canadas-only-bsl-4-lab/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "Open for Military Business: Ebola Research at Canada’s Only BSL-4 Lab", "cleaned_text": "On July 5 2019, Xiangguo Qiu and her husband Keding Cheng were removed by Canadian police from the Canadian National Microbiology Lab (NML) in Winnipeg, Manitoba. Their security clearances were also retracted, allegedly over “administrative issues.” Qiu is an expert in Ebola and was in charge of the NML’s pathogen and vaccine division. Cheng is an expert in proteomics. The NML is Canada’s only Biosafety Level 4 (BSL-4) laboratory for the study of pathogens highly hazardous to humans. Starting in 2017, Qiu went at least five times to the Wuhan Institute of Virology. Over a five year period she also published papers with the leading members of China’s civilian/military virology establishment who may have had access to the Winnipeg lab. A few months before their suspension, Qiu organized the shipment, which was authorized, of many strains of Ebola and Henipah viruses to the Wuhan Institute of Virology. In January, 2021, the couple were finally fired. Canada’s Parliamentary committee on Canada-China relations has been unable to find out why: the government has refused to hand over unredacted documents about that firing, claiming they will cause embarrassment to Canada and compromise national security. In this section, drawn from her new book, On the Origin of the Deadliest Pandemic in 100 Years, Canadian investigative journalist and prize-winning non-fiction author Elaine Dewar digs into their story and its links to the origin of SARS-CoV-2.\n\nBy the time Qiu started work on Ebola, the mishandling of the SARS epidemic by China’s leadership was well-known worldwide. Officials had been fired for misbehaviour. China had called upon leading scholars in the US, like W. Ian Lipkin, and Chinese scholars with significant success abroad, such as George Gao, to help reorganize its public health system, especially its disease surveillance methods. That year, a group of scientists from Guangdong, the centre of the SARS pandemic, arrived in Winnipeg to tour the Canadian Science Centre for Human and Animal Health, which includes both the NML, now managed by PHAC (Public Health Agency of Canada), and the animal diseases lab managed by the Canadian Food Inspection Agency. China was negotiating its agreement with France, which led to the construction of the BSL-4 at the Wuhan Institute of Virology.\n\nNatalie Salat, a reporter for Legion, a magazine about Canada’s military history, came to Winnipeg to write about the facility after the visitors from China had come and gone. Their attendance was presented to her as a mark of the NML’s global importance. Salat was told that the NML had partnerships with the Department of National Defence, the University of Manitoba, the US Centers for Disease Control and Prevention, the US Bioterrorism Response Network, etc. Stefan Wagener, whom Salat identified as the centre’s scientific director for biosafety and environment, told her that everyone who worked at the lab for more than ten days had to have a rigorous security clearance. He jokingly said that if he told her anything else about the detailed security measures in place, he’d “have to kill her.”227\n\nReading the piece, I found myself wondering: How could Qiu have qualified for even a low-level clearance by 2003? She would need secret clearance to work in the BSL-4 by 2005. I’d read somewhere that to get a secret clearance one must have been a citizen for ten years, have no criminal record, and no other obvious exploitable problems of a criminal nature, like an addiction to drugs or gambling, etc. Surely Qiu had not been in the country long enough to qualify when she was first hired at the NML, though she and her husband might have been permanent residents by then. When I checked, I learned those are the requirements for a top-secret security clearance. It is less onerous to get a secret clearance.\n\nI remembered Stefan Wagener’s name from the Wuhan Institute of Virology’s website. He’d been listed there as a member of the WIV’s Scientific Advisory Committee of the Center for Emerging Infectious Diseases. I looked him up. The bio on his company’s website said he had worked at the NML from 2001 until 2013, then been appointed to the Grain Commission in Winnipeg, and that he now ran an international bio-risk consultancy. Surely he would know Qiu? We did a Zoom call rather than a phone call because he likes to see the people he’s speaking with. My video died within the first three minutes, but I got a glimpse of him: an older man sitting at a desk with a headset over his ears, waving at me. He said he started at the Canadian Science Centre for Human and Animal Health in 2001 as chief administrative officer. His responsibilities included human resources, but mainly the safety and security of the building and its complex systems. In 1999, before he was hired, there had been a leak: about 2,000 litres of insufficiently sterilized wastewater was released into Winnipeg sewers. Nothing was said about this to the public until the CBC published a story about it a month later. Ebola and Lassa fever had not yet arrived at the lab, so there was no danger, just like there was no danger the next year when there was another wastewater leak. That one never got out of the building.228\n\nAre you still an advisor to the WIV BSL-4 in Wuhan? I asked.\n\nHe said he was not. He had visited Wuhan when the BSL-4 lab was in the design stage, but that was some years ago.\n\nHe was pretty sure he had. He remembered her face when he saw the press stories about whether SARS-CoV-2 might have leaked from her lab. But he hadn’t worked with the WIV for quite some time: his advisor role had lapsed a couple of years after his visit.\n\nDo you remember Xiangguo Qiu from the NML? I asked. “I don’t remember her,” he said. He explained that there were about 400 people working there in his day, and that he had been more concerned with the physical plant’s operations. He certainly didn’t know everybody.\n\n“Did I know Cheng? Might have had conversations,” he said. But he had no clear recollection of “these people.”\n\nYet Wagener’s position at the NML was eliminated in 2013, which is when Keding Cheng apparently started work there. So why did he remember conversations with him, but nothing about the woman who’d been toiling for years in the NML’s special pathogens lab?\n\n“What can you tell me about the security clearance process at the NML?” I asked.\n\nHe explained that it was a graded system, requiring different levels of security clearance depending on which labs a person had access to. Canadian citizenship or landed status had nothing to do with those clearances, it was not a requirement to work at the NML. The Level 2 labs required lesser clearance than the Level 4s. People tried to arrange their work so that the bulk of it could be done in the Level 2s. Genetic material or proteins can be worked with in the BSL-2 because they don’t pose a risk to anyone.\n\nHow long did it take to get a security clearance?\n\n“It could take a long time to get access to data. It could take six to eight months before a full security request to work in a containment environment,” he said. He explained that the point is to bring the best scientists from all over the world to the lab and to do the best work possible, to be constantly training so that if infectious-disease outbreaks occur everybody is ready to deal with them. He himself was a German citizen when he worked at the NML. Before that, he’d spent 12 years working at the University of Michigan.\n\nSo how were people cleared? I asked.\n\nThere would be background checks and criminal record checks organized by the RCMP, who would deal with the country of origin, he explained.\n\nYou mean the RCMP would ask Chinese police about the status of a Chinese citizen?\n\nHe could see where I was going with that question: If China wanted to slip someone into Canada’s only BSL-4, Chinese officials contacted by the RCMP would of course send a glowing but not necessarily complete report.\n\nI told him about Qiu and Cheng collaborating on papers with members of the Chinese military. I told him that the experiments had been done in the BSL-4. How could that have happened?\n\n“I don’t have an answer to [that].” he said. But he wasn’t fussed by it. He asked if I’d have a problem if people in the NML worked with the American military.\n\nThe two situations are not comparable, I said. “Canada and the US are allies and we protect the North American continent together. China is not a friend of Canada.” And I am not alone in that view. On February 10, 2021, the director of CSIS, David Vigneault, gave a public talk in which he described China as a “strategic threat.”229\n\nBut Wagener saw things differently. Pathogenic agents can be looked at with two eyes, he said, from the point of view of public health, but also from a safety and security perspective, biowarfare and bioterrorism. “Almost any country with a Level 4 will have an interest in these agents in a military perspective. You prepare your armed forces in the event someone might have a weapon against troops. Just by publishing it, it tells you this knowledge is in the public domain.”\n\nWhat he meant is that, if something is published, it no longer constitutes a threat. Everybody can read it. I wasn’t so sure about that. And it raised another question: Had all the experiments done in the NML lab by Qiu and Cheng, along with Chinese military personnel, been published? And did the two of them retain their access to data even after their security clearances were withdrawn?\n\nFrom what Wagener said of the NML’s clearance process, it seemed to me more than possible that the security investigation of Keding Cheng and Xiangguo Qiu had been less than rigorous. As Wagener had also explained, people working in Level 4 labs organize their work so that they don’t have to be inside them any longer than necessary. The bulk of experimental protocols are conducted safely in labs with lesser containment. People coming from China to work with Qiu might not have needed security clearances—so long as they were working with someone in the lab who did have one.\n\nI went back to Google Scholar. I wanted to find out exactly when Qiu and Cheng began working with co- authors from the Chinese military, the Wuhan Institute of Virology, and with George Gao.\n\nI dug out Qiu’s paper on treating Ebola in nonhuman primates with “zMapp.” It had been published in Nature online in August 2014, in final form in October. She was the lead author, Kobinger the last, Larry Zeitlin was in the middle. Other co-authors, such as Gene Olinger, were affiliated with the NIH, still others with the United States Army Medical Research Institute of Infectious Diseases at Frederick, Maryland. But there was one author, Heiyan Wei, who was affiliated with both the NML and the Institute of Infectious Diseases, Henan Center for Disease Control, China. This seemed odd given that money for this paper had come from the US Defense Threat Reduction Agency, the US National Institutes of Health, PHAC, and the Canadian Safety and Security Program.230 Could a person working for a Chinese state-run institution qualify for a Canadian security clearance? And if not, how could Heiyan Wei have been affiliated with the NML?\n\nI found another paper co-authored by George Gao which appeared to be the first Xiangguo Qiu published with him. It was called “Molecular Characterization of the Monoclonal Antibodies Composing zMab: A Protective Cocktail Against Ebola Virus.” It was submitted to Scientific Reports in September 2014, just as the Nature piece appeared online. It was published in November, just after the Nature piece appeared in its final form. Kobinger was one of the co-authors. Gao and two others were with the CAS Key Laboratory of Pathogenic Microbiology and Immunology, Institute of Microbiology, Chinese Academy of Sciences, Beijing. Qiu was the corresponding author.231 The acknowledgements said the NML authors were supported by the Canadian Safety and Security Program, while George F. Gao was supported by two grants from the government of China, the China National Grand S & T Special Project, and the Special Foundation of President for Ebola Virus Research from Chinese Academy of Sciences. He was credited, along with the other colleagues from China, with performing the “surface plasmon resonance assay and data analysis.” Gary Kobinger was credited with writing the paper.\n\nThat same year, contrary to Amir Attaran’s assertion that gain-of-function experiments are permissible in Canada but not done, Qiu and Kobinger did a gain-of-function/ passaging experiment at the NML involving mice and Marburg. The paper was called “Establishment and characterization of a lethal mouse model for the Angola strain of Marburg virus.” Marburg normally does not infect mice, but after 24 passages in immunodeficient mice it adapted itself sufficiently to give the mice severe disease. The money for that experiment also came from the Canadian Safety and Security Program, but no one affiliated with a Chinese institution worked on it.232 But when Qiu and Gary Wong did a similar experiment in 2015 that entailed making guinea pigs susceptible to Sudan virus by adapting the virus to them through multiple passages, Heiyan Wei of the Henan Center for Disease Control and Prevention, China, was again a co-author.233\n\nA paper published in 2016 compared the pathogenicity of Kikwit and Makona strains of Ebola in rhesus macaques. Gary Wong worked on that paper as first author. George Gao worked on it too.234\n\nI found three articles focused on the creation of devices for rapid detection of Ebola. George Gao was a co-author on all three. The first appeared in the journal Biosensors and Bioelectronics, and the other two in Analytical Chemistry. The Biosensors paper was published at the end of 2015.235 The first Analytical Chemistry paper appeared in December 2016, the next in May 2018. A co-author on both Analytical Chemistry papers was Jianjun Chen of the Laboratory of Special Pathogens and Biosafety at the Wuhan Institute of Virology, where Shi Zhengli was deputy director.236 Gary Wong worked on those papers too. He was no longer affiliated with the NML but with the same institutes in China as George Gao: one in Shenzhen, one in Beijing.237 The only co-author from the NML on the May 2018 paper was Xiangguo Qiu. But work with Ebola must have been done at the NML. It could not be done in China at the WIV’s BSL-4 because the latter had not yet received permission to import Ebola to China.\n\nAnd what about the Chinese military?\n\nMembers of the military began working with Xiangguo Qiu about a year after George Gao. I found a paper titled “An Adenovirus Vaccine Expressing Ebola Virus variant Makona Glycoprotein Is Efficacious in Guinea Pigs and Nonhuman Primates.” It was published online on October 4, 2016, in the Journal of Infectious Diseases.238 The first author, Shipo Wu, was affiliated with the Beijing Institute of Biotechnology, an organization known to work closely with the Chinese military. Several other co-authors were with the same institute. The most important among them was Chen Wei. Her name is given on the paper as Wei Chen, but that’s the Western way of naming in which the family name comes last; in China it’s the other way around. Chen Wei, China’s lead expert on Ebola, had made the vaccine used in the study. She was then and still is a major general in the People’s Liberation Army, though that affiliation was not mentioned in this paper. Xiangguo Qiu, the last author, was said to be with both the Special Pathogens Program at the NML and with the University of Manitoba. Gary Wong was listed with both the NML and the CAS Key Laboratory of Pathogenic Microbiology and Immunology, Institute of Microbiology, Chinese Academy of Sciences Special Pathogens Program, which was George Gao’s home institution. Two other co-authors, Xuefeng Yu and Tao Zhu, were with Tianjin-based CanSino Biologics Inc.239\n\nXuefeng Yu came to Canada from China in 1996 and worked mainly at Sanofi, the pharmaceutical company, until 2009. He returned to China and set up CanSino to develop vaccines. It is now listed on the Hong Kong stock exchange. The cell line used to develop Major General Chen Wei’s Ebola vaccine is a variant on an original cell line crafted long ago by Dr. Frank Graham of McMaster University. The National Research Council (NRC) licensed its use to CanSino. This same cell line was used again by Major General Chen Wei to make China’s first vaccine to fight SARS-Cov-2.\n\nCanada was supposed to have gotten access to that SARS-CoV-2 vaccine for Phase 1 trials, along with the right to manufacture it at an NRC plant being adapted for vaccine production in Montreal. But in May 2020, shortly after this deal was announced, it fell apart, a fact not shared with Canadians until August. Chinese authorities would not permit the vaccine to be sent to Canada at all (adding vaccine diplomacy to hostage diplomacy in China’s bag of pressure tactics).240\n\nMajor General Chen Wei was awarded a special prize for her SARS-CoV-2 efforts (not for the vaccine, but for a plasma treatment) in a heavily publicized ceremony hosted by Xi Jinping himself. If you google her name, you’ll find an image of her resplendent in her military uniform with a very large decoration, like a mayor’s chain of office, hung over her shoulders. She is standing beside President Xi.241 There are several laudatory stories about her in the Chinese press, the kind that aim to show China’s tremendous military precision in combating the virus. She told state broadcaster CCTV that “the pandemic is a military affair, and the affected areas are the war zones.”\n\nI also found a lovely picture of her being tossed in the air by her African colleagues during the West African Ebola epidemic of 2014–2016, as if to celebrate her efforts in helping to stem the outbreak. Xiangguo Qiu tested Chen’s Ebola vaccine at the NML on guinea pigs and nonhuman primates: they were infected with Ebola to get a better fix on the vaccine’s efficacy. To do such experiments in China, Major General Chen Wei would have needed access to a BSL-4 lab, but the new BSL-4 at the Wuhan Institute of Virology was not yet finished so Ebola experiments couldn’t be done there.\n\nThe acknowledgements on the vaccine paper said that Xiangguo Qiu, Lihua Huo, and their colleague Wei Chen— Chen Wei—had conceived and designed the study. Funding came from the Public Health Agency of Canada, CanSino Biologics, and the Institute of Biotechnology in Beijing. In other words, by late 2015, when this experiment began, Xiangguo Qiu was already working with George Gao, the Wuhan Institute of Virology, and the Chinese military medical establishment at the highest level. Either the Public Health Agency of Canada approved these relationships or it just never noticed that China’s leading military expert on viruses with pandemic potential was using Canada’s only BSL-4 lab for China’s purposes. And where was CSIS (Canadian Security Intelligence Services) in all of this?\n\nExtracted from On the Origin of the Deadliest Pandemic in 100 Years Published by Biblioasis, Canada, 2021.\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "Open for Military Business: Ebola Research at Canada’s Only BSL-4 Lab - Independent Science News | Food, Health and Agriculture Bioscience News", "description": "Why were Xiangguo Qiu and her husband Keding Cheng removed by Canadian police from the Canadian National Microbiology Lab (NML) in Winnipeg, Manitoba?", "url": "https://www.independentsciencenews.org/commentaries/open-for-military-business-ebola-research-at-canadas-only-bsl-4-lab/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2021-09-27T04:56:37+00:00", "article:modified_time": "2021-09-27T21:53:13+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2021/09/nml-winnnipeg-canada-e1647881666668.webp", "image:width": "780", "image:height": "427", "image:type": "image/webp"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://www.cbc.ca/news/canada/manitoba/ebola-henipah-china-1.5232674", "https://www.cbc.ca/news/canada/manitoba/canadian-scientist-sent-deadly-viruses-to-wuhan-lab-months-before-rcmp-asked-to-investigate-1.5609582", "https://bookshop.org/books/on-the-origin-of-the-deadliest-pandemic-in-100-years/", ".https://www.cbc.ca/news/science/high-tech-canadian-lab-spills-waste-water-1.170095", "https://www.theglobeandmail.com/politics/article-canadian-spy-chief-calls-china-strategic-threat/", "https://www.theglobeandmail.com/politics/article-canadian-spy-chief-calls-china-strategic-threat/", "https://www.nature.com/articles/srep06881", "https://journals.asm.org/doi/full/10.1128/JVI.01643-14", "https://journals.asm.org/doi/full/10.1128/JVI.02331-15", "https://journals.asm.org/doi/full/10.1128/JVI.02331-15", "https://academic.oup.com/jid/article-abstract/214/suppl_3/S281/2388248", "https://pubs.acs.org/doi/abs/10.1021/acs.analchem.8b00513", "https://pubs.acs.org/doi/abs/10.1021/acs.analchem.6b04632", "https://pubmed.ncbi.nlm.nih.gov/27493239/", "https://pubmed.ncbi.nlm.nih.gov/27493239/", "https://www.cbc.ca/news/canada/nova-scotia/canada-china-covid-19-vaccine-trial-plug-pulled-1.5701101", "https://bookshop.org/books/on-the-origin-of-the-deadliest-pandemic-in-100-years/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2021-09-27T04:56:37+00:00"}