{"result_id": "166003", "URL": "https://www.independentsciencenews.org/health/the-uks-royal-society-how-the-health-risks-of-gmos-have-been-systematically-misrepresented/", "timestamp": "2023-04-25 15:36:23 CEST+0200", "meta": {"description": "Scientists and scientific institutions, such as the UK Royal Society, have been misrepresenting the science of GMO safety", "lang": "en", "keywords": "", "favicon": "https://www.independentsciencenews.org/wp-content/uploads/2017/10/cropped-favicon-large-32x32.png", "canonical": "https://www.independentsciencenews.org/health/the-uks-royal-society-how-the-health-risks-of-gmos-have-been-systematically-misrepresented/", "encoding": "UTF-8"}, "image": null, "domain": "www.independentsciencenews.org", "title": "The Health Risks of GMOs Have Been Systematically Misrepresented", "cleaned_text": "For more than twenty years, many eminent scientists and scientific institutions have routinely claimed that genetically modified foods are safe. And because of the perceived authority of their pronouncements, most government officials and members of the media have believed them. But when the arguments these scientists employ to support their claims are subjected to scrutiny, it becomes clear that important facts have invariably been misrepresented — either deliberately or through substantial negligence. And when these facts are fairly considered, the arguments collapse (1).\n\nA prime example of a purportedly scientific — but in reality, inaccurate — publication on GM foods was issued by the UK’s Royal Society in May 2016 (2). Titled “GMO Plants: Questions and Answers,” it claims to provide “unbiased” and “reliable” answers to peoples’ most pressing questions. However, analysis reveals that it not only displays a strong pro-GMO bias, but that several of its assertions are demonstrably false. The following paragraphs examine these defects and reveal the surprising extent to which that document, as well as previous publications of the Society about GM foods, conflict with the truth.\n\nThis analysis has major implications, because if the world’s oldest and most respected scientific institution cannot argue for the safety of GM foods without systematically distorting the facts, it indicates that such distortion is essential to the argument.\n\nObfuscating the unnatural nature of the GM process and ignoring its unsettling features\n\nThe document’s bias is evident from the outset, and the authors fail to furnish a forthright answer to the initial question: “What is genetic modification (GM) of crops and how is it done?”(3). Instead, their response is significantly misleading because it omits the most unnatural and unsettling features while downplaying the unnaturalness of those that are mentioned.\n\nFailing to note the randomness and disruptiveness of the insertion process\n\n In one of the biggest obfuscations, the authors avoid mentioning that biotechnicians have been inserting foreign DNA into plant genomes in a haphazard manner — and that the insertions not only disrupt the region of DNA into which they wedge but cause disruptions throughout the DNA strand, a well-documented phenomenon that some scientists call “genome scrambling.”(4)\n\nConcealing the need to artificially induce gene expression\n\n The authors are equally evasive regarding how the foreign genes are induced to actually function, and they fail to disclose a crucial fact: that inserting a new gene does not in itself endow the plant with the desired new trait. That’s because it’s essential to convert the information encoded within the gene into a protein or other molecule, and in almost every case, that won’t happen without artificial alteration of the inserted genetic material.\n\nThe default condition of most genes is to be inactive and blocked from expressing — which conserves the organism’s energy and prevents proteins from being produced when and where they’re not needed (5). A gene transitions from its closed-down default mode to its active mode through the operation of a regulatory element called a promoter, a segment of DNA adjoined to the gene that serves as its on/off switch. This switch is finely responsive to specific biochemical signals so that the gene expresses in harmony with the organism’s needs. Consequently, when a gene is taken from one species and transferred to an unrelated one, the promoter will rarely (if ever) receive signals to which it’s sensitive, and the gene will remain inactive. Hence, before making such transfers, biotechnicians must remove the native promoter and replace it with one that will reliably function in the foreign milieu. Moreover, to deliver the desired results, the promoter must in most cases not only induce the gene to express, but to boost its expression (and consequent protein production) to an extraordinary level.\n\nFor virtually every GM crop on the market, the potent promoter that’s been used to achieve such unusual results comes from a plant virus. Not only does it impel the inserted genes to produce proteins at an abnormally elevated level, it drives the production continuously, regardless of the organism’s needs and completely outside the intricate regulatory system through which its other genes are controlled. This can create serious problems by inducing metabolic imbalances or upsetting complex biochemical feedback loops.\n\nTherefore, given the crucial role played by viral promoters, and the degree to which their employment is unnatural, it’s reasonable to expect that any purportedly balanced account of the GM process would mention them — and to deplore the Society’s failure to do so.\n\nObscuring the disruptiveness of the process that transforms modified cells into whole plants\n\n The Royal Society authors are likewise elusive in explaining how an isolated plant cell that has incorporated new genes is subsequently turned into a mature plant. They say this is possible “because individual plant cells have an impressive capacity to generate entire plants,” but they neglect to disclose that this capacity can only be actualized through a distinctly artificial process — in contrast to natural seeds, which grow into plants spontaneously. That artificial process is called tissue culture, and although the authors note that it’s employed, they say nothing more about it — which obscures the fact that through its procedures, the cell is “forced to undergo abnormal developmental changes.”(6) The authors also becloud the fact that besides being highly unnatural, tissue culture is highly disruptive and imparts what’s referred to as a “genomic shock” that causes numerous mutations throughout the plant’s DNA.(7)\n\nThus, the authors’ systematic avoidance of disquieting facts causes their account of the GM process to be significantly distorted — which, as will be seen, leads to the distortion of other key parts of their presentation as well.\n\nDenying the significant differences between GM crops and those bred conventionally\n\nBecause the authors acknowledge only the most obvious differences between GM and conventional breeding, while ignoring the lesser-known but more important ones, they’re emboldened to claim that GM is no more likely to entail “unforeseen effects.” But this is flat-out false, and experts who have taken the key differences into account have decisively reached the opposite conclusion (8). For instance, a major report by the Royal Society of Canada concluded that GM is far more likely to induce unforeseen effects, and a report by the U.S. National Academy of Sciences has acknowledged this greater likelihood too (9).\n\nMisrepresenting Reality\n\n The authors attempt to support their spurious claim by arguing (1) that “all” plant genomes “frequently” receive insertions of new DNA through viral and bacterial infections and through the activity of ‘jumping genes’, (2) that these insertions are “similar” to those made via GM, and (3) that conventional breeding is therefore just as likely to have unforeseen consequences.\n\nWhereas the genes that are inserted into plant cells via GM technology are always integrated into the entire genome of the resultant plant, genes from viruses and bacteria rarely enter plant genomes. Although viruses frequently infect plant cells, they seldom insert their genes into the DNA of the gametes (the sex cells), a necessary step for transferring to the plant’s progeny and becoming established in the genome. Consequently, the few viral DNA sequences that are present within plant genomes have been there for an extremely long time — and during that time, the plants’ defense mechanisms have inactivated them.\n\nFurther, scientists know of only two bacterial species that can insert their genes into the DNA of plants, and those genes are hardly ever incorporated into an entire genome (10). There are only three plant species in which such integrations have been observed, and just one is a food crop (sweet potato). Moreover, the bacterial genes in the potatoes have no discernible effect, are being transcribed at low levels, and either may not be producing any proteins at all or are producing very little (11).\n\nIn contrast, the new genes that are added to a plant’s genome via GM not only produce proteins, they hyper-produce them, which could cause hazardous imbalances. As previously noted, this hyper-production is driven by a powerful viral promoter. While none of the active genes within conventionally bred crops are associated with that promoter, it’s affixed to one or more active genes within the genome of virtually every commercialized GM crop (12).\n\nSo not only are insertions of bacterial and viral DNA into plant genomes exceptionally rare, and not only are they dissimilar from the insertions wrought by GM, it is through the GM process alone that new viral DNA has recently and widely entered plant genomes — and this incursion has introduced new risks.\n\nThe actual facts about ‘jumping genes’ are likewise at odds with the authors’ claims. In reality, those segments of DNA, technically termed ‘transposons’, rarely mobilize in the absence of extraordinary stress; so most of their current locations have been stable since an ancient era (13). In fact, a GM plant is much more likely to harbor new transposon-induced perturbations than its parent because the GM process tends to activate transposons and get them jumping (14). Conversely, pollen-based breeding rarely causes transposons to move (15).\n\nReaching a patently false conclusion\n\n Thus, not only do the authors of the Society’s guide fail to acknowledge the abundant evidence that demonstrates the disruptive effects of the GM process, they significantly misrepresent important biological realities that they do discuss. Only in this way can they conclude that GM is no more likely to entail unforeseen consequences than is conventional breeding (16).\n\nIn glaring contrast, the expert panel that produced the report of the Royal Society of Canada, who took account of the facts the guide’s authors ignored or distorted, concluded that while pollen-based breeding rarely involves worrisome unintended outcomes, the “default prediction” for every GM crop should be that it entails unintended effects that are hard to predict, could be difficult to detect, and might be harmful to human health (17).\n\nWhich leads to the question of whether GM crops are safe, another issue that the authors of the guide have seriously mishandled.\n\nDeclaring the safety of GM crops by dishonoring the standards of science\n\n“Is it safe to eat GM crops?” Of all the questions the guide addresses, this is the most crucial. And it answers with a resounding “Yes.”\n\nBut this simple answer is simply unjustified.\n\nFor one thing, the unequivocal declaration that all GM crops are safe flies in the face of the World Health Organization’s assertion that “it is not possible to make general statements on the safety of all GM foods.” As the WHO noted, because “different GM organisms include different genes inserted in different ways” it’s necessary to assess them “on a case-by-case basis.” Even the Royal Society’s president emphasized the need for a case-by-case assessment in comments he released in conjunction with the guide’s publication.\n\nUnjustifiably dismissing all the research that has detected harm\n\n So how do the authors attempt to support their all-inclusive claim? They declare: “All reliable evidence produced to date shows that currently available GM food is at least as safe to eat as nonGM food.” And they assert “there has been no evidence of ill effects linked to the consumption of any approved GM crop.”\n\nBut there has indeed been such evidence, and many studies published in peer-reviewed journals have detected ill effects to the animals that consumed a GM crop. For instance, a systematic review of the toxicological studies on GM foods that was published in 2009 concluded that the results of “most” of them indicate that the products “may cause hepatic, pancreatic, renal, and reproductive effects and may alter hematological, biochemical, and immunologic parameters the significance of which remains unknown.” It also noted that further studies were clearly needed (18). Another review that encompassed the additional studies that had been published up until August 2010 also provided cause for caution. It concluded that there was an “equilibrium” between the research groups “suggesting” that GM crops are as safe as their non-GM counterparts and “those raising still serious concerns.” 19)\n\nBetween 2008 and 2014 there have been eight such reviews published in standard journals, and as a whole, they provide no grounds for unequivocally proclaiming safety. As Sheldon Krimsky, a professor at Tufts University, observed in a comprehensive examination that was also published in a peer-reviewed journal: “One cannot read these systematic reviews and conclude that the science on health effects of GMOs has been resolved within the scientific community.” (20) Yet, the authors of the guide purport that it has been resolved conclusively — and that safety is a certitude.\n\nStooping to Subterfuge\n\n But to do so, they resort to trickery. They claim that only “a few” studies have stated that a GM food caused harm when in fact there have been many. They then summarily dismiss all these studies as unreliable. And to justify this wholesale rejection, they argue that each of the studies has been “challenged” regarding its statistical analysis and methodology.\n\nBut based on that criterion, most of the studies that underlie their claim of safety are also unreliable, because they too have been challenged. Moreover, while the latter critiques have been reasonable and fair, most of those on which the Royal Society authors rely have not (21).\n\nDeceptively dealing with Séralini’s research\n\n The unfairness is strikingly displayed by the attacks on a long-term study that yielded disturbing results. In it, a team of university researchers led by Gilles-Eric Séralini demonstrated that a GM crop approved by regulators based on a medium-term, 90-day toxicological feeding study caused significant damage to the rats’ livers and kidneys when tested over the long-term (two years) (22).\n\nThose results cast doubt on the entire GM food venture because no regulators require tests greater than 90 days, and several GM crops have entered the market without any toxicological testing at all.\n\nSo when the study was published in a respected journal in 2012, proponents of GM crops bitterly denounced it and demanded its retraction. But because it was a solid toxicological study, they couldn’t attack it on that ground. So they focused on the part of the study that reported an increased rate of tumor development in the GM-fed rats, and they argued that too few animals had been used to meet the standards for a carcinogenicity study.\n\nHowever, they disregarded several crucial facts:\n\n (1) The research was not designed to meet the standards of a carcinogenicity study.\n\n (2) It did fulfill the standards for a toxicological study.\n\n (3) The troubling toxicological results were reliable.\n\n (4) Tumors are supposed to be reported when detected during a toxicological study.\n\nNonetheless, despite the weakness of their claims, they continued to pressure the journal until, more than a year after publication — and after the addition of a former Monsanto employee to the editorial board — the study was finally retracted. But not only did the chief editor acknowledge the adequacy of the toxicological findings, the lone reason he proffered for rejecting the tumor-related findings was that they were “inconclusive,” which is not a valid reason for retraction. Furthermore, according to standard guidelines, even if there had been good grounds for retracting that part of the study, the remainder should not have been withdrawn along with it.\n\nSéralini’s illegitimately retracted paper is the only study the guide’s authors cite to support their claim that all the ones which reported harm are unreliable. And though they emphasize its retraction, they don’t mention any of the above-noted facts, imparting the false impression that none of its findings were reliable. Worse, they also fail to mention one other key fact: that the study was subsequently republished in another scientific journal. Because that happened almost a year before their guide was released, such an omission is inexcusable — and downright deceptive.\n\nFalsely asserting that no study has cast doubt on the GM method itself\n\n Moreover, besides unfairly rejecting the studies that reported problems, the authors don’t even describe them fairly. For instance, they assert that none has indicated that “the GM method itself” caused any harm and that all the problems have been attributed either to the specific gene introduced or to particular agricultural practices.\n\nBut this claim is doubly bogus.\n\nFirst, in almost all the cases, the researchers couldn’t determine which specific factor or factors caused the harm, so they didn’t pin the blame on a particular gene or herbicide —and the GM process was never absolved. Further, the only study on an herbicide-tolerant GM crop designed to separately assess the roles of the herbicide and the plant found that each caused harm — and that the plant was harmful even when unsprayed (23). And because the exact source of the plant-induced harm could not be ascertained, some feature of the GM process may well have been at fault.\n\nSecond, at least one major study did specifically link the GM process with harm. And the Royal Society is well aware of that study because it led the sordid attempt to discredit it.\n\nMisrepresenting and maligning Pusztai’s important research\n\n That study was conducted at the Rowett Institute under the leadership of a renowned authority on food safety testing, Arpad Pusztai. It revealed that GM potatoes producing a foreign protein that’s safe for mammals to eat caused a problematic effect in the rats that consumed them compared to rats that ate the non-GM counterparts, even though the latter had been spiked with the same level of foreign protein within the modified potatoes. Accordingly, the researchers concluded that some aspect of the GM process itself was significantly responsible for the result (24).\n\nBecause this research implicated the process — and implied there are inherent risks in producing any GM food — the technology’s defenders ardently assailed it, with the Royal Society at the forefront. Even before it was published, nineteen of the Society’s fellows disparaged it in an open letter without having seen all the data; and the Society then conducted a biased and unwarrantedly critical review even though the research was still unpublished and the reviewers had not seen all the data either. So irregular and unfair was the Society’s review that the editor of the prestigious journal, The Lancet, rebuked the organization for its “breathtaking impertinence” and its “reckless” abandonment of the principle of due process (25). The Society subsequently put “intense pressure” on the Lancet to deter it from publishing the research (26), and even after that journal published it, the Society continued to unjustly malign it (27).\n\nSo, having been unable to honestly refute the research, and having also failed to block its publication in a premier journal, the Society now blatantly misrepresents its express findings, falsely asserting they have no bearing on the safety of the GM process itself. And to aggravate the injustice, it claims that the mere fact it attacked the study robs it of reliability — while ignoring the fact that the attack was demonstrably unfair (28).\n\nReports by Other Scientific Organizations Similarly Abuse the Facts\n\nRegrettably, the Royal Society is not the only scientific institution that abuses the evidence in order to protect GM foods. It’s been significantly distorted by every report that asserts their safety has been established.\n\nFurther, like those of the Royal Society, the other reports are especially unjust in dealing with the Pusztai and Séralini studies, presumably because presenting them in a fair manner would cast considerable doubt on the safety of GM foods. Such maltreatment is exemplified by the report from the U.S. National Academy of Sciences issued in 2016 (29). Although the authors were supposed to assess the safety of GM crops by considering the evidence that had accumulated since 1996, they didn’t even mention Pusztai’s research, despite the fact it was published in an eminent journal in 1999. And while they did discuss Séralini’s study, they entirely ignored the valid (and troubling) toxicological findings. Instead, they focused solely on the disputed tumor-related data — and emphasized that those data were alleged to be “inconclusive” by the editor of the journal that retracted the study. They then asserted that the inconclusiveness refutes the contention that long-term studies are needed to adequately assess the safety of GM foods, even though the toxicological data they ignored clearly do demonstrate the need.\n\nThe Falsehoods Are Propping Up the GM Food Venture — But Undermining Science\n\nThe preceding analysis has clearly shown that, despite its aura of authority, the Royal Society’s 2016 publication substantially ignores the principles of science and systematically misrepresents the facts. It’s also clear that if that document, and similar documents claiming to demonstrate the safety of GM foods, had upheld science and properly portrayed the facts, the massive venture to produce and promote those foods could not have survived.\n\nIt is additionally obvious that there’s an urgent need for reform on the part of the Royal Society and all other scientists and scientific institutions that assert the safety of GM foods. As the eminent biologist Philip Regal has pointed out, what’s at stake is not only the safety of our food and the future of agriculture, but the future of science itself. It’s disquieting that most scientists’ opinions about GM foods have been molded by misinformation — and that a relatively small group who ardently promote these products have misled a multitude of others into supporting them as well. In one of the most astonishing incidents, just a few scientists induced more than 120 Nobel laureates to sign a letter extolling the safety of GM foods and censuring the people who raise concerns, even though most of the letter’s chief assertions are demonstrably false (30).\n\nThere’s added urgency because the authority of science is being persistently challenged regarding climate change and other major issues, and when influential scientific institutions sully their integrity in one area, it weakens the stature of science across the board.\n\nAccordingly, it’s imperative that the scientists who have been promoting GM foods re-evaluate their priorities, rededicate themselves to the standards they were trained to uphold, and restore the honest communication of facts. Our food will be safer, agriculture will be sounder, and science will be healthier.\n\n[1] Altered Genes, Twisted Truth thoroughly backs this statement up; and it demonstrates that various publications purporting to establish the safety of GM foods issued by the Royal Society, the U.S. National Academy of Sciences, the American Association for the Advancement of Science, the American Medical Association, and similar organizations rely on multiple misrepresentations. John Ikerd, Professor Emeritus of Agricultural and Applied Economics at the University of Missouri, has stated that the evidence with which the book documents this systematic twisting of the truth is “comprehensive and irrefutable.”\n\n[2] “GM Plants: Questions and Answers,” The Royal Society (May 2016).\n\n[3] The Royal Society’s guide employs the terms ‘genetic modification’ and ‘GM process’ to exclusively refer to the methods that have been used to create almost all the genetically engineered crops currently on the market, and those methods are the focus of its discussion. It does not deal with newer techniques, such as those referred to as ‘genome editing.’ Accordingly, this article discusses the GM process on which the guide is focused.\n\n[4] Wilson, AK, Latham, JR and Steinbrecher,RA “Genome Scrambling -Myth or Reality? Transformation-Induced Mutations in Transgenic Crop Plants.” Technical Report (October 2004). See also, Latham, JR. Wilson, AK., and Steinbrecher, RA, “The Mutational Consequences of Plant Transformation” Journal of Biomedicine and Biotechnology (2006) Vol. 2006, Article ID 25376.\n\n[5] A small percentage of an organism’s genes are always in an expressive mode because it’s essential that their products be constantly available.\n\n[6] “Genome Scrambling -Myth or Reality? Transformation-Induced Mutations in Transgenic Crop Plants.” (cited in note 4) at p. 1.\n\n[7] The term “genomic shock” has been used in connection with tissue culture by several biologists. One example is: Kaeppler et al., “Epigenetic aspects of somaclonal variation in plants,” Plant Molecular Biology 43 (2000): 179–88; 181.\n\n[8] There are some modes of non-GM crop development that induce a greater number of unpredictable effects than pollen-based reproduction, and many GM proponents claim that two of them (inducing mutations via radiation and via chemicals) have greater potential to do so than does GM. However, not only are there are sound reasons to contest this claim (as explained in Altered Genes, Twisted Truth), because the guide’s authors employ the term ‘conventional breeding’ to denote only pollen-based reproduction, the soundness of their assertions must be judged by comparing the properties of that particular mode with GM.\n\n[9] “Elements of Precaution: Recommendations for the Regulation of Food Biotechnology in Canada.” The Royal Society of Canada (January 2001). National Research Council and Institute of Medicine of the National Academies (NAS), “Safety of Genetically Engineered Foods: Approaches to Assessing Unintended Health Effects” (Washington D.C.: The National Academies Press, 2004). The chart on page 240 of this report indicates that the processes used to produce the vast majority of the GM crops that have been cultivated and consumed are many times more likely to induce unintended effects than is pollen-based breeding, even when the effects of tissue culture are not factored in.\n\n[10] The species are Agrobacterium tumefaciens and Agrobacterium rhizogenes. The rarity of finding their genes within plant genomes is discussed in: Matveeva, T. et al., “Horizontal Gene Transfer from Genus Agrobacterium to the Plant Linaria in Nature,” Mol Plant Microbe Interact 25, no. 12 [December 2012]: 1542-51.\n\n[11] T. Kyndt, et al. “ The genome of cultivated sweet potato contains Agrobacterium T-DNAs\n\n[12] Because the virus containing that promoter is not a retrovirus but a pararetrovirus, its DNA ordinarily doesn’t even enter the DNA of the plant cells that it does infect, let alone the entire genome of plants. And in cases where it may have been inadvertently integrated into a genome, it would most likely have been inactivated.\n\n[13] Fedoroff, N. and Brown, N.M., Mendel in the Kitchen: A Scientist Looks at Genetically Modified Foods (Washington, DC: Joseph Henry Press, 2004) p. 103.\n\n[14] Transposons can be activated through the disruptions caused by the insertion process and also through those induced by tissue culture. And some scientists think they could also mobilize due to destabilizing effects of the powerful viral promoters.\n\n[15] Mendel in the Kitchen (cited in note 13) pp. 104-05. However, Fedoroff points out that wide crosses between “very distantly related plants” can activate transposons.\n\n[16] The key issue is whether GM is more likely than conventional breeding to induce unexpected, potentially harmful changes in a new plant that were not present in the parental generation. And it’s clear that the likelihood is greater — especially considering that the guide’s authors employ the term ‘conventional breeding’ to refer solely to pollen-based reproduction.\n\n[18] Dona, A., and I. S. Arvanitouannis. 2009. ‘‘Health Risks of Genetically Modified Foods.’’ Critical Reviews in Food Science and Nutrition 49 (2): 164-75.\n\n[19] Domingo, J. L., and J. G. Bordonaba. 2011. ‘‘A Literature Review on the Safety Assessment of Genetically Modified Plants.’’ Environment International 37 (4): 734-42.\n\n[20] Krimsky, S., “An Illusory Consensus Behind GMO Health Assessment,” Science, Technology & Human Values, November 2015; vol. 40, 6: pp. 883-914., first published on August 7, 2015\n\n[21] For a detailed discussion, see Chapters 6 and 10 of Altered Genes, Twisted Truth. Extensive documentation is also provided in GMO Myths and Truths.\n\n[22] Seralini, G.-E., et. al. 2012. ‘‘Long Term Toxicity of a Roundup Herbicide and a Roundup-tolerant Genetically Modified Maize.’’ Food and Chemical Toxicology 50:4221-31 (retracted 2013). Republished in Environmental Sciences Europe 26:1-17 (2014).\n\n[23] That study was Séralini’s long-term test, referenced in note 22.\n\n[24] Ewen, S. W. B., and A. Pusztai. 1999. ‘‘Effects of Diets Containing Genetically\n\n Modified Potatoes Expressing Galanthus nivalis Lectin on Rat Small Intestine.’’ Lancet 354 (9187): 1353-54.\n\n[25] Editorial: “Health risks of genetically modified foods,” The Lancet 353, May 29, 1999: 1811 and Horton, R., “GM Food Debate,” The Lancet 353, issue 9191, November 13, 1999: 1729.\n\n[26] Flynn, L. and M. Gillard, “Pro-GM food scientist ‘threatened editor’,” The Guardian, October 31, 1999. The Lancet’s editor stated that the Royal Society exerted “intense pressure” in an attempt to “suppress publication.”\n\n[27] For instance, the Society’s Biological Secretary asserted that the Lancet published Pusztai’s research “in the face of objections by its statistically-competent referees.” But because five out of the six referees voted for publication, the Secretary’s implication that more than one objected is false — and the implication that each of the five scientists who voted favorably lacked competence in statistics is almost surely false as well. (Bateson, P., “Mavericks are not always right,” Science and Public Affairs, June 2002.) The unjustness of the Society’s attack is more extensively described and documented in Chapter 10 of Altered Genes, Twisted Truth.\n\n[28] Although the authors do not specifically mention the Pusztai study, or any studies besides the long-term one conducted by Seralini’s team, their categorical assertions logically encompass it; and those assertions misrepresent it.\n\n[29] National Academy of Sciences, “Genetically Engineered Crops: Experiences and Prospects” (Washington D.C.: The National Academies Press, 2016)\n\n[30] For an examination of the letter’s inaccuracies, see the article I co-authored with David Schubert, a professor and laboratory director at the Salk Institute for Biological Studies.\n\nSteven M. Druker is an American public interest attorney who, as executive director of the Alliance for Bio-Integrity, initiated a lawsuit that exposed how deceptions by the U.S. Food and Drug Administration had enabled the commercialization of GM foods.\n\nHe is the author of Altered Genes, Twisted Truth: How the Venture to Genetically Engineer Our Food Has Subverted Science, Corrupted Government, and Systematically Deceived the Public, which was released in March 2015 with high praise from many experts and a foreword by Jane Goodall hailing it as “without doubt one of the most important books of the last 50 years.”\n\nIf this article was useful to you please consider sharing it with your networks.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Health Risks of GMOs Have Been Systematically Misrepresented", "description": "Scientists and scientific institutions, such as the UK Royal Society, have been misrepresenting the science of GMO safety", "url": "https://www.independentsciencenews.org/health/the-uks-royal-society-how-the-health-risks-of-gmos-have-been-systematically-misrepresented/", "site_name": "Independent Science News | Food, Health and Agriculture Bioscience News", "article:publisher": "https://www.facebook.com/BioSRP/", "article:published_time": "2017-08-14T00:01:49+00:00", "article:modified_time": "2017-08-14T00:59:30+00:00", "image": "https://www.independentsciencenews.org/wp-content/uploads/2017/08/Royal-Societys-Building.jpg", "image:width": "466", "image:height": "429", "image:type": "image/jpeg"}, "tags": ["maize", "agroecology", "FDA", "Golden Rice", "EPA", "Bt", "rice", "technology", "heritability", "crop", "plants", "regulation", "EFSA", "roundup", "health", "nutrition", "risks", "DNA", "transgenic", "disease", "environment", "GM", "coronavirus", "virus", "pesticide", "Vitamin A", "public interest", "USDA", "safety", "transgene", "biotechnology", "science", "development", "animal", "medical", "food", "monsanto", "genetics", "agriculture", "genetically modified", "predisposition", "risk assessment", "farming", "GMO", "ecology"], "tweets": [], "movies": [], "links": ["https://royalsociety.org/~/media/policy/projects/gm-plants/gm-plant-q-and-a.pdf", "http://bsr.wpengine.com/wp-content/uploads/2012/02/BSR-2-BGERvol23.pdf", "http://rsc-src.ca/sites/default/files/pdf/GMreportEN.pdf", "http://www.nap.edu/openbook.php?record_id=10977&page=R1", "http://www.who.int/foodsafety/publications/biotech/20questions/en/", "http://www.ncbi.nlm.nih.gov/pubmed/18989835/", "http://www.sciencedirect.com/science/article/pii/S0160412011000055", "https://www.nap.edu/catalog/23395/genetically-engineered-crops-experiences-and-prospects", "https://royalsociety.org/~/media/policy/projects/gm-plants/gm-plant-q-and-a.pdf", "http://www.econexus.info/publication/genome-scrambling-%E2%80%93-myth-or-reality", "http://www.econexus.info/publication/mutational-consequences-plant-transformation", "http://www.ncbi.nlm.nih.gov/pubmed/18989835/", "http://www.sciencedirect.com/science/article/pii/S0160412011000055", "http://earthopensource.org/earth-open-source-reports/gmo-myths-and-truths-2nd-edition/", "https://www.nap.edu/catalog/23395/genetically-engineered-crops-experiences-and-prospects", "http://gmwatch.org/news/latest-news/17320", "http://www.biointegrity.org/", "http://www.amazon.co.uk/ALTERED-GENES-TWISTED-TRUTH-Systematically-ebook/dp/B00U2LY3D2/ref=tmm_kin_swatch_0?_encoding=UTF8&sr=1-1&qid=1435068032", "http://www.alteredgenestwistedtruth.com/", "#"], "authors": ["Jonathan Latham"], "publish_date": "2017-08-14T00:01:49+00:00"}