{"result_id": "167004", "URL": "https://infiniteunknown.net/category/health/", "timestamp": "2023-04-25 15:36:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/category/health/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "Health – Infinite Unknown", "cleaned_text": "Authored by Allan Stein via The Epoch Times (emphasis ours),\n\nAt least five states have introduced bills restricting the use of controversial mRNA technology or gene therapies in livestock or demand full disclosure to consumers on product packaging.\n\nThe states considering legislation include North Dakota, Tennessee, Arizona, Idaho, and Missouri.\n\nIdaho House Bill 154 would make it a misdemeanor offense for anyone who provides or administers a vaccine using mRNA technology “for use in an individual or any other mammal in this state.”\n\nArizona House Bill 2762 requires conspicuous labeling of all aquatic, livestock, or poultry products that received mRNA vaccines, and prohibits these products from being labeled as organic.\n\nTennessee House Bill 0099 amends an existing law to prohibit the manufacture or sale of livestock or meat that contains mRNA “vaccine of vaccines materials” without a conspicuous label that there are such ingredients in the product.\n\nIn North Dakota, state lawmakers filed SB2384, which seeks to ban the use of mRNA vaccines in humans and to introduce a penalty for anyone breaking the prohibition.\n\nMissouri State Rep. Holly Jones, a Republican, is the lead sponsor of a bill requiring product labeling of all livestock meat containing “potential gene therapy products.\n\n“We label everything around the world. We label non-GMO. We label GMO. We label grass-fed. We label no antibiotics used. We label manufactured in a plant that has nuts,” Jones said.\n\n“We should label anything that has not been proven safe and effective. As we’ve seen with the COVID vaccines, they’re neither safe nor effective. Even the CDC has come out with that.”\n\nWhile HB1169 does not mention mRNA by name, the proposed ban would include all “potential gene therapy products.”", "opengraph": {}, "tags": ["Climate Change", "Fed", "Muslims", "Global Warming", "Terrorism", "Nuclear reactors", "China", "Society", "U.S.", "Japan", "EU", "Global News", "Donald Trump", "Nuclear", "Obama administration", "Economy", "Technology", "Military", "U.K.", "Science", "Germany", "Sex", "New World Order", "Islam", "Syria", "Russia", "Banking", "Middle East", "Radiation", "Israel", "Health", "Europe", "Global Cooling", "Environment", "Crime", "Debt", "Collapse", "Migrant Crisis", "Federal Reserve", "Politics", "Fukushima", "Government", "Trump administration", "Barack Obama", "Food"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/in-depth-controversial-gene-and-mrna-technologies-now-targeting-livestock_5204242.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": ["Infinite"], "publish_date": "2023-04-23T13:14:42-08:00"}