{"result_id": "167014", "URL": "https://infiniteunknown.net/tag/squalene/", "timestamp": "2023-04-25 15:37:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/tag/squalene/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "Squalene – Infinite Unknown", "cleaned_text": "People receiving H1N1 vaccine shots right now need to know that currently-available H1N1 vaccine shots may offer no protection whatsoever against the “Ukraine Strain.” \n\n – Mike Adams\n\n\n\nNot only that the H1N1 swine flu vaccine won’t offer any protection, but also the effect of squalene in the vaccine will make the ‘average badly taken care of human body’ overreact even greater to any real ‘super flu’, than it would have done without the vaccine. The immune system in high alert will create a cytokine storm that many will not survive. People will die very quickly because they received the H1N1 vaccine.\n\nEven without any ‘super flu’ around the vaccine alone is lethal stuff. \n\n\n\n“No one should take the swine flu vaccine–it is one of the most dangerous vaccines ever devised. It contains an immune adjuvant called squalene (MF-59) which has been shown to cause severe autoimmune disorders such as MS, rheumatoid arthritis and Lupus. This is the vaccine adjuvant that is strongly linked to the Gulf War syndrome, which killed over 10,000 soldiers and caused a 200% increase in the fatal disease ALS (Lou Gehreg disease). This virus H1N1 kills by causing a “cytokine storm”, which means that it cause the body’s immune system to overreact and that is why it is killing young people and is a mild disease in the elderly. (The elderly have weakened immune systems.) This vaccine is a very powerful immune stimulator and carries the real possibility of making the lethality of the virus much greater.\n\n – Dr. Russell Blaylock\n\n‘Somebody’ decided to put 1 million times more squalene into the H1N1 swine flu vaccine than into the vaccine that has been linked to the Gulf War syndrome according to Dr. Rima Laibow and Dr. Anders Bruun Laursen.\n\nSo what if instead of the very mild swine flu there is a real ‘super flu’ coming?\n\nPS: If you are really healthy and happy you will never ever get sick, even if all hell will break loose around you.\n\n\n\n Ukrainian Prime Minister Yulia Tymoshenko, left, wears a face mask as she visits a regional hospital in Lutsk, about 400 km (247 miles) west of Kiev, Ukraine\n\n \n\n (NaturalNews) Here’s what we know with some degree of certainty about the H1N1 virus in Ukraine right now: nearly 300 people have died from the viral strain, and over 65,000 people have been hospitalized (the actual numbers are increasing by the hour). The virus appears to be either a highly aggressive mutation of the globally-circulating H1N1 strain, or a combination of three different influenza strains now circulating in Ukraine. Some observers suspect this new “super flu” might be labeled viral hemorrhagic pneumonia (meaning it destroys lung tissue until your lungs bleed so much that you drown in your own fluid), but that has not been confirmed by any official sources we’re aware of.\n\nUkrainian President Viktor Yushchenko has issued emergency quarantine orders for nine of the country’s regions and ordered the deployment of mobile military hospitals. He announced that the nation had been simultaneously hit with two different seasonal flu strains plus H1N1 — and then hinted that all three might have recombined into the deadly new Ukrainian super flu.\n\nIn his own words, as reported by Daily Mail, “Unlike similar epidemics in other countries, three causes of serious viral infections came together simultaneously in Ukraine: two seasonal flus and the Californian flu. Virologists conclude that this combination of infections may produce an even more aggressive new virus as a result of mutation.”\n\nOn November 6, Ukraine’s Deputy Health Minister Zinovy Mytnyk announced that over 600,000 citizens had already caught the new flu. British scientists are now conducting tests on the new viral strain to find out why it appears to be so deadly (http://www.dailymail.co.uk/news/wor…).\n\nThe mainstream media is blaming Ukraine’s poor health care system for the relatively high rates of hospitalization and death (http://www.nytimes.com/2009/11/14/w…), but they refuse to mention (yet again) the vitamin D deficiency found across this population living at high latitude in the winter, where sunlight is relatively scarce.\n\nHere’s a useful blog for staying up to date on the Ukrainian plague:\n\n http://ukraineplague.blogspot.com/\n\n \n\n What we don’t know\n\nNow here’s what we don’t know about the Ukraine outbreak:", "opengraph": {}, "tags": ["Babies", "Africa", "Depopulation", "Fascism", "CDC", "Water", "Global News", "Autism", "Formaldehyde", "CFR", "Drugs", "pneumonia", "New World Order", "Dictatorship", "Vitamin D", "Yulia Tymoshenko", "Environment", "WHO", "Conspiracy", "Fraud", "Narcolepsy", "Guinea pigs", "GMO", "Americium", "Big Pharma", "Global Warming", "DynCorp", "Albert N. Stubblebine", "EPA", "U.S.", "Vaccine", "Rima E. Laibow", "Immune System", "Military", "Fluoridation", "neurotoxic", "Illuminati", "Medicine", "Flu", "Pharmaceutical Industry", "Plutonium", "Health", "Anthrax", "Cancer", "Smallpox", "Gulf War", "Eugenics", "Crime", "neurotoxicity", "Mercury", "Influenza", "Gulf War Syndrome", "Kathleen Sebelius", "Ukraine", "War Crimes", "Alex Jones", "Civilians", "Brain", "Squalene", "FDA", "Depleted uranium", "toxic", "organic", "Club of Rome", "Aluminum", "Nuclear", "Economy", "Chemicals", "Children", "U.N.", "Freedom", "toxicity", "Government", "ALS", "infertility", "Genocide", "Society", "Oil", "Bilderberg", "Suicide", "Genetically Modified Organisms", "Vioxx", "Philippines", "Guillain-barre syndrome", "Sterilize", "Fluoride", "Science", "Veterans", "Virus", "Pesticides", "Rockefeller", "Soldiers", "Doctors", "Vaccination", "Doug Rokke", "Council on Foreign Relations", "Pregnancy", "Politics", "War", "Food", "Dr. Russell Blaylock"], "tweets": [], "movies": [], "links": ["http://www.infiniteunknown.net/wp-content/uploads/2009/11/flu-ukraine.jpg", "http://www.dailymail.co.uk/news/worldnews/article-1227984/British-scientists-testing-Ukrainian-super-flu-killed-189-people.html", "http://www.nytimes.com/2009/11/14/world/europe/14flu.html?_r=2", "https://ukraineplague.blogspot.com/", "https://infiniteunknown.net/2009/11/16/h1n1-super-flu-plague-in-ukraine-spark-concern-conspiracy-theories-about-origins/#more-16736"], "authors": ["Infinite"], "publish_date": "2020-02-04T17:16:11-08:00"}