{"result_id": "167048", "URL": "https://infiniteunknown.net/2012/08/31/india%E2%80%99s-polio-eradication-campaign-caused-47500-cases-of-vaccine-induced-polio-paralysis/", "timestamp": "2023-04-25 15:38:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://infiniteunknown.net/2012/08/31/india%e2%80%99s-polio-eradication-campaign-caused-47500-cases-of-vaccine-induced-polio-paralysis/", "encoding": "UTF-8"}, "image": null, "domain": "infiniteunknown.net", "title": "India’s Polio Eradication Campaign Caused 47,500 Cases Of Vaccine-Induced Polio Paralysis – Infinite Unknown", "cleaned_text": "– Confirmed: India’s Polio Eradication Campaign in 2011 Caused 47,500 Cases of Vaccine-Induced Polio Paralysis (Dr. Mercola, Aug 28, 2012):\n\nIf you listen to mainstream media news, you’ll be told that polio has now been eradicated in India – an accomplishment the Polio Global Eradication Initiative (PGEI), founded in 1988 by the World Health Organization (WHO), Rotary International, UNICEF, and the U.S. Centers for Disease Control and Prevention (CDC), are attributing to the intense polio vaccination campaign. The Indian government reportedly had 2.3 million vaccine administrators visit over 200 million households, with oral polio vaccinations given to nearly 170 million children 5 years of age and younger;1 health officials are now doubling their efforts to conquer polio in Pakistan as well. What you’re NOT learning from the mainstream media, however, is that there’s a growing public movement fighting the profound misinformation about the vaccine, mainly because VACCINE-CAUSED polio is maiming and even killing a growing number of children every day, far outstripping the damage done by the wild-type polio that has been supplanted by the manmade form found within the vaccine.\n\nThe Polio Vaccine is Causing a Deadly Polio-Like Disease in Children\n\nA paper published earlier this year in the Indian Journal of Medical Ethics should have made headlines around the globe, as it estimated there were 47,500 cases of a polio-like condition linked to the oral polio vaccine in 2011 alone. Researchers reported:2 “…while India has been polio-free for a year, there has been a huge increase in non-polio acute flaccid paralysis (NPAFP). In 2011, there were an extra 47,500 new cases of NPAFP. Clinically indistinguishable from polio paralysis but twice as deadly, the incidence of NPAFP was directly proportional to doses of oral polio received. Though this data was collected within the polio surveillance system, it was not investigated. The principle of primum-non-nocere [First, do no harm] was violated.” Another way the public is being misled about India’s claims to be polio-free is that this is only referring to “wild” polio cases – not vaccine-caused polio, which is occurring on a massive scale every year. The problem is that while the oral vaccine has reined in wild polio, the wild virus is being replaced by vaccine-derived polio virus (VDPV), which causes the same symptoms of acute flaccid paralysis associated with classically-defined polio. (Health officials don’t call it polio because it isn’t “wild.”) Environmental surveillance for VDPV is now being conducted in a number of countries, including Australia, Egypt, Haiti, and Indonesia. In essence, this much-heralded vaccine strategy has replaced one infectious disease with another, more virulent strain… What kind of success is that, really?\n\nThird World Countries Using Dangerous and Dated Vaccines\n\nWhile most affluent nations now rely on inactivated poliovirus vaccine (IPV), many third-world countries still use an oral polio vaccine as it’s far less expensive and simpler to administer. However, the oral polio vaccine is made from a live polio virus, which carries a risk of causing polio in populations who may not normally even be at risk of infection. The virus in the vaccine can also mutate into a deadlier version, igniting new outbreaks. Genetic analysis has proven that such mutated viruses have caused at least seven separate outbreaks in Nigeria. Polio outbreaks in Haiti and the Dominican Republic in 2002 were also traced to an “attenuated” strain of oral polio vaccine (OPV) that mutated back to even greater virulence than wild polio. According to a 2010 article in the New England Journal of Medicine, outbreaks of vaccine-derived polioviruses (VDPVs) have been occurring at a rate of once or twice per year, since the year 2000.3 And it’s estimated that up to 180 Indian children develop vaccine-associated polio paralysis (VAPP) each year.4 The live polio virus from the vaccine can remain in your throat for one to two weeks, and in your feces for up to two months.5 So not only is the vaccine recipient at risk, but he or she can potentially spread the disease as long as the virus remains in feces – which, incidentally, turns on its head the age-old pro-vaccination dogma that the non-vaccinated represent an infection risk to the vaccinated.\n\nMedia is Not Giving the Whole Picture on the Oral Polio Vaccine Controversy\n\nBarbara Loe Fisher, founder of the National Vaccine Information Center (NVIC), spoke with Voice of America (VOA) about the intensive polio vaccine campaigns in the developing world. Unfortunately, much of Barbara’s interview and insights were edited out of the video, as she explains below: “I taped an interview with Voice of America on the subject of intensive polio vaccine campaigns in the developing world. Brian Padden, a veteran VOA reporter of 25 years, really pressed me to do the interview even though I told him I was on deadline with another project and could not come into the office – so he came to my house! Anyway, I have interviewed with VOA periodically for radio and print articles since the 1980’s with fair treatment. However, this time I was set up by his editors to be painted into the ‘anti-vaccine’ corner and the text of the article (reference below) and my excerpted quote from the longer interview I gave does not accurately reflect the substance of what I said. I actually gave the reporter this Indian journal article6 and raised the issue of the reported increases in Acute Flaccid Paralysis among Indian children given monthly doses of OPV [oral polio vaccine]. l told him that developed countries like the US had replaced live virus polio vaccine (OPV) with inactivated polio vaccine (IPV) more than a decade ago to prevent cases of vaccine-strain polio because OPV, being a live virus vaccine, causes recently vaccinated children to shed vaccine-strain polio virus in their body fluids for a period of time following vaccination. In underdeveloped countries with poverty and poor sanitation (like open sewage), vaccine-strain viruses can contaminate water and facilitate transmission of vaccine-strain paralytic polio. I brought up the issue of poverty, including poor sanitation, malnutrition, and limited access to health care facilities (for example, to undergo re-hydradation from diarrhea) as being an important cause of disease and poor health separate from vaccination. I did question whether repeated mass vaccination campaigns in underdeveloped countries were more a function of pharmaceutical companies seeking to sell product rather than making investments in infrastructure that address the basic causes of poor health. And I also questioned the lack of safety science to demonstrate that it is safe to give children MONTHLY polio vaccinations when children in the developed world only receive 5 doses. As you know, NVIC does not oppose the use of polio vaccine but we do not support excessive, repeated OPV vaccination campaigns in impoverished populations when that approach is not backed up with good safety science. We do oppose use of government enforcement mechanisms to aggressively implement mass vaccination campaigns that fail to obtain the voluntary, informed consent of the parents of children being vaccinated. We do this because NVIC defends the ethical principal of informed consent to medical risk taking, which is a human right, and we defend that right without compromise. It is too bad that either he chose, or his editors did not allow him, to use the substantive comments I made in my interview about addressing poverty, malnutrition and the root causes of disease versus simply giving these children OPV vaccine over and over again, when the vaccine can cause vaccine-strain polio, there are no safety studies showing that it is safe to give children monthly doses of OPV and the report out of India indicates that increases in Acute Flaccid Paralysis may be associated with repeated OPV vaccination in children.”\n\nHas the Chemical Synthesis of Polio Virus Made Global Eradication Impossible?\n\nIn 2002, it was reported that fully infectious polio virus had been recreated in a lab. While this was heralded as a milestone in biology, it was met with great unease by the general public who worried that polio could now be used as a weapon of bioterrorism. And, the very fact that it can be synthetically created technically means that global eradication is now impossible. Sayer Ji of GreenMedInfo.com stated: “One thing, which should not be overlooked is that the researchers who broke this story also revealed another highly disturbing fact: infectious polio virus has been known to be capable of de novo synthesis for over 10 years – essentially implying global polio eradication is now by principle impossible.” In fact, in the journal Science in 2002 it was reported:7 “The charade about polio eradication and the great savings it will bring has persisted to date. It is a paradox, that while the director general of WHO, Margret Chan, and Bill Gates are trying to muster support for polio eradication it has been known to the scientific community, for over 10 years, that eradication of polio is impossible. This is because in 2002 scientists had synthesized a chemical called poliovirus a chemical called poliovirus in a test-tube with the empirical formula c332,652H492,388N98,245O131,196P7,501S2,340. It has been demonstrated that by positioning the atoms in sequence, a particle can emerge with all the properties required for its proliferation and survival in nature… the test-tube synthesis of poliovirus has wiped out any possibility of eradicating poliovirus in the future. Poliovirus cannot be declared extinct because the sequence of its genome is known and modern biotechnology allows it to be resurrected at any time in vitro. Man can thus never let down his guard against poliovirus. indeed the 18-year-old global eradication campaign for polioviruses will have to be continued in some format forever. The long promised ‘infinite’ monetary benefits from ceasing to vaccinate against poliovirus will never be achieved. The attraction that ‘eradication’ has for policy makers will vanish once this truth is widely known.” The sentiment was repeated again in 2006:8 “…does the test-tube synthesis negate efforts to eradicate poliovirus? The conceptual answer to this is yes. Poliovirus cannot be declared extinct because the sequence of its genome is known and modern biotechnology allows it to be resurrected at any time in vitro. This is true for all viruses, including smallpox.”\n\nPolio Vaccine Has Been Linked to Cancer\n\nYou might be like me and be an American who received polio shots in the 1950’s and 60’s. I have not been, but many have ended up being informed – 40 years later – that many of those experimental polio shots were contaminated with a monkey virus, simian virus 40 (SV40), that causes cancer in lab animals and has been linked to brain, bone, lung, and lymphatic cancers in children and adults.9–10 They weren’t told the whole truth about polio vaccine risks, and vaccine makers and health officials are still frugal with the facts when it comes to vaccine risks. Many make blanket statements saying that “vaccines are safe,” when in fact such a statement simply cannot be made without misrepresenting the facts. The truth is, there are risks associated with any vaccine, and they clearly do not work for everyone. And even when they do work, you oftentimes end up with more virulent and hardy viruses… Not to mention, policy makers seem to be overlooking the poignant fact that people in third-world countries are in desperate need of clean water, healthy food and sanitation, which would work wonders for preventing many of the infectious diseases they are spending billions on vaccines for…\n\nThe Underlying Causes of Polio are Being Ignored\n\nVaccines alone don’t eradicate disease. Polio spreads, after all, largely through feces-contaminated water, so ignoring that major risk factor while trying to eradicate the disease is ignorant, to put it nicely. What if, just what if, the same amount of money that has been spent on vaccines over the past decade had been spent on sanitation facilities, toilets, healthy food and clean water instead? Sayer Ji expands:11 “Due to the fact that polio spreads through the fecal-oral route (i.e. the virus is transmitted from the stool of an infected person to the mouth of another person through a contaminated object, e.g. utensil) focusing on hygiene, sanitation and proper nutrition (to support innate immunity) is a logical way to prevent transmission in the first place, as well as reducing morbidity associated with an infection when it does occur. Instead, a large portion of the world’s vaccines are given to the third world as ‘charity,’ when the underlying conditions of economic impoverishment, poor nutrition, chemical exposures, and socio-political unrest are never addressed. You simply can’t vaccinate people out of these conditions, and as India’s new epidemic of vaccine-induced polio cases clearly demonstrates, the ‘cure’ may be far worse than the disease itself.” As an aside, did you know you can reduce your risk of contracting polio simply by cutting back on sugar? The evidence suggesting that a diet high in refined sugar (as well as other forms of fructose) increases your risk of contracting polio is discussed in the book Diet Prevents Polio, written by Benjamin P. Sandler, M.D. The book was published in 1951, at the height of the polio epidemic. In general, it makes perfect sense that high sugar/fructose consumption could raise your risk of polio, as it, just like other infections, only tends to cause complications when your immune system is weakened, which can easily happen through poor nutrition (high fructose consumption), stress, and lack of sleep. So, the polio vaccine is not the only, nor the ultimate, solution to prevent this disease. Maintaining a strong and well-functioning immune system will always be your first line of defense, as this will reduce your risk of any number of diseases, including polio – and this is, unfortunately, what most people in third-world countries are missing.\n\nWhat You Can Do to Make a Difference Right NOW", "opengraph": {}, "tags": ["Global News", "Health", "Polio", "Children", "Vaccine", "India", "Science", "Vaccination"], "tweets": [], "movies": [], "links": ["http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn1", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn2", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn3", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn4", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn5", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn6", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn7", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn8", "http://articles.mercola.com/sites/articles/archive/2008/01/02/simian-virus-40-dna-found-in-us-children.aspx", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn1", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn10", "http://articles.mercola.com/sites/articles/archive/2012/08/28/polio-eradication-campaign.aspx?e_cid=20120828_DNL_artNew_1#_edn11", "http://www.mercola.com/article/sugar/polio_sugar.htm", "http://www.nvic.org/", "http://www.nvicadvocacy.org/"], "authors": ["Infinite"], "publish_date": "2012-08-31T10:38:27-08:00"}